{"interestingcomments": [{"autor": "brandnew2", "posts": "26 posts", "date": "07/25/2020 01:47  PM", "content": "5 hours ago, scott kirkpatrick said: Nice album. And interesting light. The one concern that has come up from reviews so far is that the -----> improved !!!  headroom for exposures may not hold up at high ISOs. That comes from a rather sloppy set of shots taken in bad light, but is worth checking out while Leica is still nervously watching over the firmware health of their new baby. The Phoblogger complains that a bright light yellow turned white with slight overexposure at ISO 6400 or 12500, which seem to be usable settings with this new camera. What do you see? Thanks! I haven't gotten a chance yet to rigorously test how high ISO settings affect highlight recovery, but I can confirm that highlight recovery is in general noticeably -----> improved !!!  over the m10-p. I had my settings accidentally off for a shot and overexposed by ~2 stops, and when I looked at the LCD preview, I figured the highlights were irretrievably blown (based on my experience looking at similarly overexposed shots on the m10-p). However, when I got into lightroom, I was able to recover essentially all of the detail in the highlights, which was pleasantly surprising. That was an ISO 1600 shot, though."}, {"autor": "Leica Fanatic", "posts": "745 posts", "date": "01/19/2017 07:52  PM", "content": "There's the very real possibility that I may be wrong, but it wouldn't surprise me if Leica already has a '-----> designed !!!  for the M10' bag waiting in the wings. If so, I assume it will cost 20% more than the previous '-----> designed !!!  for the M240' bag?"}, {"autor": "Artin", "posts": "1,649 posts", "date": "10/30/2021 02:51  PM", "content": "Advertisement (gone after registration) If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX -----> improved !!!  buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? Edited October 30 by Artin"}, {"autor": "a.noctilux", "posts": "6,037 posts", "date": "10/30/2021 02:57  PM", "content": "5 minutes ago, Artin said: If or when say M11 is lunched Ok Traditional Leica M with Rangefinder say 40-50 MPX -----> improved !!!  buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they Lunch another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? Launch ? Edited October 30 by a.noctilux"}, {"autor": "Anbaric", "posts": "902 posts", "date": "10/30/2021 03:46  PM", "content": "Advertisement (gone after registration) 51 minutes ago, Artin said: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX -----> improved !!!  buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? Why not just shove an adapter on the mirrorless camera of your choice, or wait for the SL3?"}, {"autor": "Herr Barnack", "posts": "5,059 posts", "date": "10/30/2021 04:42  PM", "content": "1 hour ago, Artin said: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX -----> improved !!!  buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? Since this is a hypothetical question, my answer would be a \"yes\" - hypothetically, of course. I would not buy the hypothetical Japan made camera instead of an M11 but as an adjunct to the M11. All the above is contingent upon my suddenly experiencing an unexpected financial windfall so that I would have the hard currency to buy both hypothetical cameras. As it turns out, attempting to buy any M camera or lens with hypothetical money yields the same end result as attempting to buy with the much ballyhooed \"exposure dollars\" that companies who want photographers to work for free always dangle in front of us. Edited October 30 by Herr Barnack"}, {"autor": "M8X2", "posts": "22 posts", "date": "10/30/2021 05:34  PM", "content": "vor 2 Stunden schrieb Artin: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX -----> improved !!!  buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? I would buy a Q with an M-mount in a split second. Edited October 30 by M8X2"}, {"autor": "LBJ2", "posts": "640 posts", "date": "10/30/2021 06:36  PM", "content": "3 hours ago, Artin said: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX -----> improved !!!  buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? For me the second option is well covered with so many other mirrorless cameras on the market for some years now. Besides if your mystery camera is Leica FF @ $3500...hell did in fact freeze over and we have other problems to deal with 😉🙃 Seriously, IMO the SL2/S are such great options with all the mirrorless bells and whistles for adapting M lenses and on the shelves available for purchase as I type its really hard to dream of anything else. The Leica Rangefinder is however a completely different love affair for me. Not really looking for another lovely at the moment. As the M10-R is Simply Irresistible according to Robert Palmer's definition. *May he RIP."}, {"autor": "chasdfg", "posts": "185 posts", "date": "10/29/2021 01:11  PM", "content": "3 hours ago, evikne said: But how long does it take to connect to the app initially? I think perhaps that's the main problem. I only had issues connecting the camera to the app when I first got the camera, when I had the impression that connectivity would take a handful of seconds. Once the camera and phone are paired, its quite fast to connect and stable. I basically got used to just flicking the camera to Wifi, letting it boot up for about 10 seconds (while carrying on doing other things and not just staring a the green light blinking) and then going into the FOTOS app to pair the camera to phone. I have used the app for remote shooting. I also did a mini shoot for one of my friends before. The camera was paired for about 30mins so I could review pics on the go and it worked great the whole time. I've since sold my M10D to someone on the forum and do miss it sometimes. Prices are rising too. It's the perfect colour camera for me, of all the colour cameras out there right now. Sure, i have my list of things it could -----> improve !!!  on, but that -----> improve !!! d version does not exist (and may never). If i chose 1 colour camera today, that would be it. There was also a point of time I set the M10D to shoot in RAW + B&W JPEG. All the pictures displayed in the app were B&W JPEG. I was too lazy to edit pictures during that phase and simply downloaded the pictures from the app into my phone and used them from there..so I essentially had an M10-D Monochrom. That thumb rest...it's really some thumb rest. That and the slimness of the body without the screen are what I miss the most. Your hand falls nicely into place with the thumb rest and without the LCD in the way. Side thing, for some reason this thread reminded me of some M10D i stumbled upon on Schouten a few months back. The owner had replaced all the dials and knobs that were replaceable with silver ones (silver frame selector, ISO and shutter speed dials and screw). Looked pretty groovy. A camera I remember very fondly and I've used many."}, {"autor": "Max EPR", "posts": "29 posts", "date": "10/30/2021 06:37  AM", "content": "Advertisement (gone after registration) I just watched this video by Oz Yilmaz. Oz suggests due to the \"megapixel-wars\" the M10's value is going to take a major price drop as soon as the M11 is released. Oz says the \"M10 will be obsolete\" The M10 is a great camera. The M11 needs to be significantly -----> improved !!!  for me to consider upgrading to a M11. What is your opinion? Edited October 30 by Max EPR"}, {"autor": "Jon Warwick", "posts": "727 posts", "date": "10/30/2021 12:22  PM", "content": "32 minutes ago, sillbeers15 said: As for an M, maintaining it as RF and manual focus with a compact body & lenses, I yet to see how far the mega pixel race can offer. I am inclined to agree with that specific statement …. but separately, if a theoretical and much -----> improved !!!  Visoflex came out, then perhaps the M can work well at higher megapixels."}, {"autor": "sillbeers15", "posts": "1,949 posts", "date": "10/31/2021 01:37  AM", "content": "13 hours ago, Jon Warwick said: I am inclined to agree with that specific statement …. but separately, if a theoretical and much -----> improved !!!  Visoflex came out, then perhaps the M can work well at higher megapixels. I had the visoflex & multi-function handgrip/finger loop on my M240 and also adapted the R tele lenses onto my M system. Since having the SL & now SL2, I've decided to keep my M10 & now M10R back to the minimalist. Not even having the half case. I use the 3rd party enlargement viewer/eyepiece over the rear LCD screen for precise focusing when I mount my M over the tripod for landscape applications."}, {"autor": "rivi1969", "posts": "807 posts", "date": "11/04/2021 07:30  PM", "content": "On 10/30/2021 at 1:37 AM, Max EPR said: I just watched this video by Oz Yilmaz. Oz suggests due to the \"megapixel-wars\" the M10's value is going to take a major price drop as soon as the M11 is released. Oz says the \"M10 will be obsolete\" The M10 is a great camera. The M11 needs to be significantly -----> improved !!!  for me to consider upgrading to a M11. What is your opinion? He also said the M10 is for those “who can’t afford things and that it might serve well for a while” 😂😂😂😂😂 As far as I know both my M8 and M9P are working flawless, far from obsolete and I enjoy them very much. That's the problem with YouTube, anyone with a camera Becomes an eminence with something to say."}, {"autor": "adan", "posts": "10,775 posts", "date": "11/05/2021 04:12  AM", "content": "I dunno. My M10s have already paid for themselves - and continue to produce income. And that doesn't even include the tax writeoffs. So at this point whatever they sell for is pure profit. And my M8 and M9 are also still \"paying for themselves,\" now several times over, in edition-print sales, long after they were traded in. A version of \"the long tail\" - -----> create !!!  something reproducible and compelling enough to sell, and one can keep selling it forever - or at least until the edition is sold out. I don't see any diminution in print sales just because they are 10- or 18- or 24-Mpixel images. If they touch people. Now, I suppose there are different markets (work-for-hire), where a picture only sells once, to one customer (bride, architect, fast-food chain, interior decorator), and the extra detail of 40 or 60Mp may be a selling point, because the pictures will wallpaper an office, or 10000 modestly-priced motel rooms, or some such. My wedding work was all back in the pre-digital era, but no bride I worked with insisted on \"medium format\" or \"4x5\" quality (what passed for extra Mpixels back then). If they hired me, they wanted the casual, journalistic 35mm \"coverage\" of their wedding moments - and knew that's what I'd deliver. ............... Anyway, I'll trade in my M10s for Mxxs if and when I see a compelling reason. It won't be megapixels, because I know my market. It might be something else the M11 offers, or I might wait for an M11-S, or the M12. Edited Friday at 04:13 AM by adan"}, {"autor": "IkarusJohn", "posts": "10,133 posts", "date": "10/29/2021 04:53  AM", "content": "47 minutes ago, grahamc said: Ok second that. Genuine question what are the “issues” with higher megapixels ? I would assume that it’s more unforgiving of technical (focussing) errors ? Also - How about lenses ... does a higher Mp count reveal imperfections in vintage glass that previous resolutions didn’t? I ask this because a recent seller of a 50:1.4 pre-ASPH mentioned that the reason for sale was he was using m10R and as a result had switched to the latest and greatest lenses (namely APO in his case ). I don’t necessarily think that’s valid logic but would appreciate opinions. my only experience of high megapixels is Sony A7Riv 63MP. I really like it and haven’t experienced any issues but let’s be honest those cameras drive themselves - very hard / impossible to go wrong. HI Graham, I think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! It’s fiction! You don’t know what you’re talking about! Internet myth! Etc etc The 18MP M9 and 24MP M(240)/M10 were considered to be the “sweet spot” for handheld 135 format digital. At that time, Sony released its 37.5MP sensor (when Leica had “only” 37.5MP in its S2). The cameras that first sensor was in (the Sony A7r and the Nikon D800e were two I had) were a nightmare to get sharp. Many will deny this, but I can say from my own experience, that something was going on, and it wasn’t good. At the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly Ming Thein’s conclusion). I suspect it was a combination of shutter slap and the sensor site designs. Both of which appear to have been solved. I have great faith in Jono’s reviews, and he has said more than once that the M10-R doesn’t suffer from pixel level blur. That said, if I want greater resolution (which I don’t), I would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... As to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an improved sensor makes an image worse. I doubt this is actually possible. -----> Improve !!!  either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. If you have an M10-R, there is little doubt that a 50 APO Summicron will give you better images than the previous pre-Asph 50 Summicron or Summilux lenses, though some may prefer the older lens rendering. Each to their own, I guess."}, {"autor": "grahamc", "posts": "521 posts", "date": "10/29/2021 05:05  AM", "content": "12 minutes ago, IkarusJohn said: HI Graham, I think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! It’s fiction! You don’t know what you’re talking about! Internet myth! Etc etc The 18MP M9 and 24MP M(240)/M10 were considered to be the “sweet spot” for handheld 135 format digital. At that time, Sony released its 37.5MP sensor (when Leica had “only” 37.5MP in its S2). The cameras that first sensor was in (the Sony A7r and the Nikon D800e were two I had) were a nightmare to get sharp. Many will deny this, but I can say from my own experience, that something was going on, and it wasn’t good. At the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly Ming Thein’s conclusion). I suspect it was a combination of shutter slap and the sensor site designs. Both of which appear to have been solved. I have great faith in Jono’s reviews, and he has said more than once that the M10-R doesn’t suffer from pixel level blur. That said, if I want greater resolution (which I don’t), I would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... As to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an improved sensor makes an image worse. I doubt this is actually possible. -----> Improve !!!  either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. If you have an M10-R, there is little doubt that a 50 APO Summicron will give you better images than the previous pre-Asph 50 Summicron or Summilux lenses, though some may prefer the older lens rendering. Each to their own, I guess. Thanks John, Very interesting and all makes sense - I hadn't known about those earlier issues with the larger MP digital cameras. I'm really happy with my A7Riv although naturally it's had very little / no use since I wandered into a Leica store and picked up an M But it is really impressive. In practical terms I doubt that I need higher than 24MP in an M at this point ... even the noticeably quicker download to my computer and pain free editing makes the experience match the M system really well IMO (simplicity/compactness/lightness). This may change in the future but right now very happy. Edited October 29 by grahamc"}, {"autor": "aristotle", "posts": "134 posts", "date": "10/29/2021 11:55  AM", "content": "6 hours ago, IkarusJohn said: HI Graham, I think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! It’s fiction! You don’t know what you’re talking about! Internet myth! Etc etc The 18MP M9 and 24MP M(240)/M10 were considered to be the “sweet spot” for handheld 135 format digital. At that time, Sony released its 37.5MP sensor (when Leica had “only” 37.5MP in its S2). The cameras that first sensor was in (the Sony A7r and the Nikon D800e were two I had) were a nightmare to get sharp. Many will deny this, but I can say from my own experience, that something was going on, and it wasn’t good. At the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly Ming Thein’s conclusion). I suspect it was a combination of shutter slap and the sensor site designs. Both of which appear to have been solved. I have great faith in Jono’s reviews, and he has said more than once that the M10-R doesn’t suffer from pixel level blur. That said, if I want greater resolution (which I don’t), I would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... As to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an improved sensor makes an image worse. I doubt this is actually possible. -----> Improve !!!  either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. If you have an M10-R, there is little doubt that a 50 APO Summicron will give you better images than the previous pre-Asph 50 Summicron or Summilux lenses, though some may prefer the older lens rendering. Each to their own, I guess. I guess I'm one of those who deny this I still have my D800e and 100% crops from that are as sharp as from most anything that I've used. Even though the AA filter was removed from the 800e, there is still a low pass filter (albeit weaker than the AA filter in the original D800) so that does blur things a bit in comparison with the D850 for example, but that's not the result of having \"more pixels\"....the 850 actually has \"more\". I tend to do physical prints, so in theory higher resolution would benefit me by allowing more crop flexibility while maintaining a good print resolution. Practically, 24MP is plenty for that though. But also practically, even with my older computer systems, 40-50mp doesn't bog anything down for me, and there seems no downside to having higher resolution sensors. The irony is that for applications where the additional resolution would theoretically benefit (BIF or wildlife from afar), I'm typically handheld with a long telephoto doing my best to keep up with the subject. In those cases, regardless of IS or technique, the extra resolution doesn't often buy you what you'd like. On the other hand, for landscapes or other scenes that are composed, one can often define the framing and perspective as desired and even though the capability exists to cut way into the image, it's not needed and you end up throwing resolution away by the time you adjust for print. There are definitely some nature applications though where it is beneficial to crop into the scene because you can't physically get to where you want to. All in all, I'd take more resolution whenever it's available."}, {"autor": "Rob L", "posts": "258 posts", "date": "08/01/2020 02:47  PM", "content": "The difference is in the fit. Night and day. Arte de Mano cases are thin and the fit is amazing. They become part of the camera and add very little bulk. The case is basically flush to the control buttons and viewing screen on the back. The Luigi and Angelo Pelle cases are -----> designed !!!  to appear hand stitched, whether they are or not, I can't say. The leather is thick and the fit is a bit loosey goosey. Some people may like that?"}, {"autor": "evikne", "posts": "2,248 posts", "date": "10/05/2021 06:30  AM", "content": "I hope the rumor isn't true. But I'll wait and see if there comes an M11-D. If not, I'll maybe look around for an M10-D. \"Unfortunately\", Leica is likely to -----> create !!!  many new temptations (with screen) in the future. If I can't resist, some sort of solution would be to buy a half case that covers the screen. 😄"}, {"autor": "sebben", "posts": "169 posts", "date": "10/08/2021 11:53  PM", "content": "I love my M10D, the only way they could really -----> improve !!!  it is to remove some of the unnecessary dials and a better sensor. Perhaps the Sony 24 one from the SL2-S which is better than the the M10R one correct? USB - C charging would be nice, at least the batteries so that I don't need to carry an extra charger around."}, {"autor": "nodrog", "posts": "431 posts", "date": "10/12/2021 01:20  PM", "content": "Advertisement (gone after registration) I decided to revisit some photos from Florence in 2018, and was reminded that some images work far better as panoramas than the traditional 3:2 format. Panos can -----> create !!!  a feeling of being able to look around a landscape in a different way. Of course, at this fiddly size, it doesn't make much difference, and they tend to get somewhat lost in a forum system, but a large panorama print, in particular, is a very special thing. The first and last here are crops, while the middle shot is stitched from five vertical photos with a 90mm. 50mm Summilux-M ASPH (cropped)--img--  90mm Summicron-M (stitched)--img--  28mm Elmarit-M ASPH (cropped)--img--  Do add some more panos if you have them. Would be great to see them! Peter Edited October 12 by nodrog"}, {"autor": "RS-Colo", "posts": "18 posts", "date": "10/12/2021 05:02  PM", "content": "As soon as I scheduled my two covid shots last February, I booked a celebratory trip in May to San Francisco. Here are two panoramas I took, one with my M10-R and one with my M10-M. The actual full sized files are 25,200 x 4,800 and 54,000 x 3,600 pixels. I've also included a full resolution sliver from the Monochrom pan to show the actual resolution. I have been doing stitched panoramas for over a decade and continue to love the process and what I can -----> create !!! . Some subjects just seem to beg to be wider, or taller. --img-- --img-- --img-- "}, {"autor": "RS-Colo", "posts": "18 posts", "date": "10/13/2021 12:57  PM", "content": "I use Image Composite Editor (ICE). It was -----> developed !!!  by Microsoft but they stopped supporting it a while ago so the SW is a bit hard to find. I'm pretty sure at some point I will have to switch to something else that is supported. I'm not looking forward to the day. I did try Hugin at one point. It is opensource. But I found it to be extremely difficult to work with. BTW, the B&W pan is made up of 43 handheld images taken with my Elmar 135mm f4 lens. I don't recall the aperture but the shutter speed was 1/500. I bought the lens used years ago for a couple hundred dollars. It has cosmetic issues; the fake leather is pealing off in places. But, clearly, the optics are still great. Here is Ken Rockwell's excellent review of the lens: https://www.kenrockwell.com/leica/135mm-f4.htm"}, {"autor": "nodrog", "posts": "431 posts", "date": "10/15/2021 09:27  AM", "content": "On 10/13/2021 at 2:02 AM, RS-Colo said: As soon as I scheduled my two covid shots last February, I booked a celebratory trip in May to San Francisco. Here are two panoramas I took, one with my M10-R and one with my M10-M. The actual full sized files are 25,200 x 4,800 and 54,000 x 3,600 pixels. I've also included a full resolution sliver from the Monochrom pan to show the actual resolution. I have been doing stitched panoramas for over a decade and continue to love the process and what I can -----> create !!! . Some subjects just seem to beg to be wider, or taller. --img--  That monochrom pano is a monster! I don't think my little MacMini would survive a job like that. Would probably keel over and die halfway through. Have you ever tried to print it?"}, {"autor": "RS-Colo", "posts": "18 posts", "date": "10/15/2021 02:02  PM", "content": "4 hours ago, nodrog said: That monochrom pano is a monster! I don't think my little MacMini would survive a job like that. Would probably keel over and die halfway through. Have you ever tried to print it? My laptop would make a serious gamer envious. No, I haven't had it printed. My printer (DuraPlaq) can only print up to eight feet.The monochrome pan is -----> designed !!!  for fifteen feet. So I would probably have it printed in three five foot sections. It would make for an interesting tryptich."}, {"autor": "a.noctilux", "posts": "6,037 posts", "date": "10/22/2021 09:01  AM", "content": "I think it's up to user and situation, strap, wriststrap, or cord. No one solution for all 🤢 Or when the camera is -----> created !!!  for use in a case/half case ... The only digital Leica I know of without strap lug is M Edition 60, since Leica II, so long ago, every Leica has strap lugs, so it's no brainteaser, it's up to customer to use or not. --img--  I have \"0\" Replica without lug --img--  even my \"II\" transformed from \"I\" has none --img--  my universal wriststrap is old screw-in 1/4\" like here even usable under Rapidwinder, Leicavit M, wonderful --img--  Edited October 22 by a.noctilux"}, {"autor": "a.noctilux", "posts": "6,037 posts", "date": "10/22/2021 09:18  AM", "content": "Sometimes, I use custom made (all by myself ! ) leather wriststrap tailored to the precise use situation, as here I need to use most of time in vertical and original strap attached at right would be in the way, so with a handy place for my last digit to better hold the M-A 😉 --img--  However, in many setup, the original nylon strap is so handy to use as it was -----> created !!!  for --img--  Edited October 22 by a.noctilux"}, {"autor": "junix", "posts": "87 posts", "date": "10/18/2021 05:08  AM", "content": "Why wait for the M11? Wait for the M12, it will be a much better camera.. I would get an M10-P now. I had an M-A for some time and my “M-skills” -----> improved !!!  considerably after I bought an M10-R because of the instant feedback. You can always sell it later on at a loss and consider the loss as an investment in refining your skills.."}, {"autor": "grahamc", "posts": "521 posts", "date": "10/10/2021 10:29  PM", "content": "7 minutes ago, carlosmcse said: a lot of people dismiss 28 as “too wide” but it’s so perfect. I love it. Yeah that's what I was thinking when I was using it . I was really surprised I felt that way about the 28 and I got some of the best shots with it . I think the step through from 35 >> 28 was crucial for my journey to get there though, due to having gotten used to being close , then the extra for 28mm was insignificant . I also took some nice environmental portraits with it which I don't think 35mm would have -----> improved !!!  on. Overall I agree, this all kinda comes back to the fact that they are all nice but 35mm is the sweet spot for me, if only one lens . Edited October 10 by grahamc"}, {"autor": "Max EPR", "posts": "29 posts", "date": "10/14/2021 03:49  AM", "content": "Thank everyone for your comments. Leica photographers are lucky to have so many great choices. I fall in love over and over with my 3 Leica Cameras and various lenses. I appreciate each Leica camera for their unique qualities. Different Leica cameras are like different golf clubs. You would not use a driver as a putter or a putter as a driver. Each club , just like each Leica camera, has an advantage. I look forward to seeing what the new M11 -----> improves !!!  on while keeping its' heritage true. The new 3.0 firmware for the SL2 made this camera even more awesome. The Q2 is wildly popular for a good reason. It takes beautiful photos completely manually as well as completely automatically, and everywhere in between. Ultimately, no matter what camera we think is the best, we want Leica to have a camera for everyone. The more people that find a Leica camera they love the better it's for everyone. Obviously adding the SL's, Q's, CL's, etc. made Leica a stronger company. The Leica M is an extraordinary camera. There is nothing like it. The lens selection is incredible. That's why the people on this forum so fiercely love their M's. Me too."}, {"autor": "waigx", "posts": "5 posts", "date": "10/11/2021 02:35  AM", "content": "Advertisement (gone after registration) Hey there. I just got my new gadgets one week ago so far really enjoyed it. Yesterday I was trying out in a park. The picture shows purple fringing at the top (see the bright sunshine and leave areas). As mentioned in the title. the lens is 11663 and the body is M10R, this particular photo shot 1/1000s ISO 200 f1.4. The JPG -----> developed !!!  in lightroom Is this normal? I have zero proper camera experience before. I had only used smart phones. I am under impression that purple fringing has not being a problem for good phones recent years - pretty surprised to see it appears in a camera system at this tier. Thanks. --img--  --img--  Edited October 11 by waigx"}, {"autor": "Yarosuav", "posts": "200 posts", "date": "10/11/2021 11:28  AM", "content": "All fast lenses (1.4 and lower) will have purple fringing. Pretty easy to remove in Lightroom. If you want a lens with no fringing, you need to look at any of the APO lenses (Leica, Voigtlander, etc.). APO lenses are specifically -----> designed !!!  to eliminate fringing, but the fastest aperture (to my knowledge) they come in is f/2…"}, {"autor": "adan", "posts": "10,775 posts", "date": "10/11/2021 03:59  PM", "content": "A couple of questions: in your original post your say the picture was a \"JPG -----> developed !!!  in Lightroom.\" is that actually a .jpg original, and not .DNG (raw)? Are you cropping these pictures from the full 35mm field of view? ..................... ...and a comment (separate from the purple problem). A 35mm lens (a moderate wide-angle) is not the ideal lens for trying to create \"subject separation\" with focus. Even at f/1.4, a 35mm still has far more depth of field (everything apparently sharp) than, say, a 50mm f/1.4 or 75mm f/1.4. With a 35mm, one has to be within 1-2 meters/3-6 feet of the main subject to get enough \"blur\" to be effective. Picture below is with a 35mm at f/1.4 and has decent subject isolation at f/1.4 - but \"my man\" was only 3.5 feet away, not 40-60 feet away. --img-- "}, {"autor": "waigx", "posts": "5 posts", "date": "10/11/2021 06:21  PM", "content": "2 hours ago, Photoworks said: Not sure what can make the difference, Are you using a filter, if yes what are you using? I did have a Leica clear UV filter on. But I thought that is supposed to reduce the fringing. Your photos looks gorgeous btw. 2 hours ago, Gobert said: Is the 6bit recognition switched on? Yes, the recognition was on, and the exif is correctly shows the lens info in Lightroom. 2 hours ago, adan said: A couple of questions: in your original post your say the picture was a \"JPG -----> developed !!!  in Lightroom.\" is that actually a .jpg original, and not .DNG (raw)? Are you cropping these pictures from the full 35mm field of view? The original was a .DNG, I exported a .JPG in Lightroom iPad version. And it is full 35mm field of view. 2 hours ago, adan said: A 35mm lens (a moderate wide-angle) is not the ideal lens for trying to create \"subject separation\" with focus. Even at f/1.4, a 35mm still has far more depth of field (everything apparently sharp) than, say, a 50mm f/1.4 or 75mm f/1.4. With a 35mm, one has to be within 1-2 meters/3-6 feet of the main subject to get enough \"blur\" to be effective. Picture below is with a 35mm at f/1.4 and has decent subject isolation at f/1.4 - but \"my man\" was only 3.5 feet away, not 40-60 feet away. Thanks, I think these are great points — I happened learned a bit theory of dof yesterday. For this distance it was probability better to use a smaller aperture. But as a new amateur I actually found 35mm is a bit narrow for me because I used to my iPhone (which claims a 26mm main camera) ."}, {"autor": "Photoworks", "posts": "968 posts", "date": "10/11/2021 09:57  PM", "content": "3 hours ago, waigx said: Did you use a ND filter or something for this one? No, the sun was almost gone. most of the time I will shoot with auto ISO and A on the time selectors . I have exposure compensation at -0.3 to -0.7 most or the time on the M10-R The Noctilux 50 .95 has a ND filter all the time. I like to shoot wide open, but that is not necessary all the time. Some time it is good to try to close the F-stop 1 or 2 clicks. 1 Click is 1/2 stop and it makes a bid difference in CA . another thing I like to suggest is to try to -----> develop !!!  in a different way.. Many people have the tendency to highlight and shadow recovery in Lightroom to 90-100% and the pull the blacks. and the apply clarity. When I teach editing I will suggest to shoot DNG + JPG, look at the JPG file how it rendered and how a Leica interprets colors. Then go edit starting from the top slowly down only when it is needed. Many time not so much correction is needed and the picture became more brilliant with diminution . I am just saying it at this point because some of the corrections can amplify the CA effect in Lightroom , your original JPG probably has some, but not so extreme. Then try Lightroom lens correction and simple the purple to remove the color. again moderate use as it can give you horrible desaturated borders all around. this are just some tips, but you will see that the 35 FLE is a wonderful lens and CA is not always there. PS the image I have loaded this morning have lens correction turned off in Lightroom and sharpening and NR off. just to see what is possible"}, {"autor": "lct", "posts": "22,183 posts", "date": "09/26/2021 08:08  PM", "content": "Not sure what you are expecting from a 200% crop. You could just see artefacts -----> created !!!  by your computer or your screen. You may wish to crop at 100%. Or drop your raw file in a dropbox and we will see if there is any problem actually. Edited September 26 by lct"}, {"autor": "fbonde", "posts": "46 posts", "date": "09/27/2021 05:48  AM", "content": "9 hours ago, lct said: Not sure what you are expecting from a 200% crop. You could just see artefacts -----> created !!!  by your computer or your screen. You may wish to crop at 100%. Or drop your raw file in a dropbox and we will see if there is any problem actually. Thanks for the feedback guys. I will defiantly do that - hopefully, this week, and let you guys know."}, {"autor": "adan", "posts": "10,775 posts", "date": "10/11/2021 04:46  PM", "content": "Not sure what you are asking. Are you talking about a .jpg produced in the camera (which is not a \"conversion,\" just an in-camera .jpg) - or a jpg -----> created !!!  from a .DNG, done on your own computer? If the first - what WB was the camera using? (The bricks look \"lousy\" too - unless they are actually purple, with blue-ish cement. ) If the second, what/whose camera calibration profile are you using? Was the lighting full-spectrum sunlight (doesn't appear to be)? What WB did you select in processing the .DNG file? What exactly is \"lousy\" about the HD bucket color? It is orange - but I'm guessing you think it should be a redder orange? Or is it just not saturated/intense enough? https://www.homedepot.ca/product/the-home-depot-8l-orange-home-depot-logo-bucket/1000784938"}, {"autor": "scott kirkpatrick", "posts": "7,201 posts", "date": "08/14/2020 11:36  AM", "content": "I've got an R now and am very impressed with it, so I may be biased. To me the negatives that Jono Slack cites are very minor (I think he is trying to be even-handed), and the positives -- higher resolution, some amount of magic in better highlight coverage, resistance to Moire, new sensor cover layer that suppresses UV as well as IR contamination for cleaner colors are all important to me. These will mean that an R will hold value pretty well for the next few years. It takes about a year for any discounts on a new Leica model to appear, so if you buy one now, you get the advantage of that year's use. There may be some magic going on in the highlight behavior. The basic operation of a digital sensor is that each photon that is captured -----> creates !!!  the same number of electrons and the electrons accumulate up to a maximum, with a hard stop. My feeling is that Leica has softened that hard stop a bit, but I don't know yet at which step in the processing chain it happens."}, {"autor": "Jeff S", "posts": "18,651 posts", "date": "08/14/2020 01:16  PM", "content": "1 hour ago, scott kirkpatrick said: There may be some magic going on in the highlight behavior. The basic operation of a digital sensor is that each photon that is captured -----> creates !!!  the same number of electrons and the electrons accumulate up to a maximum, with a hard stop. My feeling is that Leica has softened that hard stop a bit, but I don't know yet at which step in the processing chain it happens. I couldn’t begin to explain, but we do know that Stefan Daniel has described four specific sensor enhancements besides increased MP or cover glass improvements: (1) greater active vs inactive (supporting electronics) area; (2) 10% more photons; (3) dual gain architecture; and (4) refined pixel shape to eliminate some imperfection. Jeff"}, {"autor": "Michael Geschlecht", "posts": "9,884 posts", "date": "10/06/2021 02:30  AM", "content": "Hello Ktsa5239, Welcome to the Forum. When you focus on a point straight in front of you & take a photo: The image plane in focus is a plane that is a straight line that is like the horizontal top of the letter \"T\". Also: Think of the line that is the part from the top of the \"T\" to the bottom as being the line from you to the subject. When you focus on something which is a distance horizontally away (Left or Right.) from this line to the top of the \"T\" then you are actually focusing on the circumference of a circle with a radius that is the length from you to the top of the \"T\". A circle where the edge of the circle only touches the edge of the straight ahead, same radius, image plane where that circle touches that plane straight ahead. So if you stood there & rotated a few degrees at a time & took photos: Each photo would have the CENTER in focus at that distance. Because lenses for cameras like the 1's we use are -----> DESIGNED !!!  to produce a flat image plane at a right angle from a line from the camera/lens to the point of focus: When a person focuses off center with a wide angle lens the ANGULAR DISPLACEMENT can become quite large so that: When a person turns the camera/lens back to compose: The distance that had originally been focused on has become a small portion of the new distance to where the image plane has moved to. I do not have the technical equipment to put a diagram on the screen. The further the angle of the subject focused on is: From the line going thru the center of the composition: The further away from the plane of focus the subject originally focused on will be. Because the actual plane of focus will EFFECTIVELY move further & further away from the subject originally focused on the FURTHER away from the center of the line of composition that the original subject is. The plane of focus of the original subject will EFFECTIVELY move CLOSER to the camera. Best Regards, Michael"}, {"autor": "petermullett", "posts": "837 posts", "date": "08/03/2021 07:59  AM", "content": "Currently in my Leica M kit I've a M10-P, a M10-M and a M10-D, ( the D is currently still at Wetzlar awaiting spares before undergoing a main circuit board transplant ). I also own a M9M but I've donated it on a \" it's your's for as long as you need it\" loan to a friend in South Africa who's B&W work deserved the uptick. The M10-P was a Wetzlar upgrade from the regular M10, that for me was a good move and I like to recycle stuff it at all possible rather than trade in / up. 24 megapixels are enough for me as I easily get A2 size prints from the files, sometimes even larger when I farm out that print work. I was given a trial of the M10-R about a year or so ago and I saw no real advantages for me in it's sensor and one disadvantage, the well discussed here motion problem that necessitates use of higher shutter speed to counter. The M10-M is a wonderful beast, no need to elaborate on that fact, and I love the M10-D as one adores, despite the problems it brings to ownership, the adopted dog that isn't quite housetrained and keeps running away to it's original home. I see little reason to upgrade from what I have in digital M's, I don't need more megapixels, I'm happy enough with the sensor, the M10 body is close to perfect and it's functionality leaves very little to desire. Anyway more megapixels would probably mean me having to upgrade my computing gear too, a hidden expense that I don't want to have to plumb for at this time.........Instead, in the past couple of years, I have invested in analogue cameras again with an M-A last year and a MP a month or so ago, they join my M7 that I had completely overhauled and it's VF upgraded at Wetzlar last year. The other \"upgrade\" is the building of a darkroom I've just finished here at home for film process only, ( I will continue to print with the two A2 size Epsons, one with regular full spectrum inks the other for monochrome only with the Jon Cone / Piezography Pro ink-set ). My personal work will now mainly be in film and then as a small bonus I can also bring back into play my trusty Pentax 67 and the various Nikon film Pro' cameras that I've never sold on even after their use died away when digital came on the scene. That said it's good to see Leica continuing to -----> develop !!!  the line of digital M cameras, that's very reassuring and even though no doubt there'll be temptations to \"upgrade' when I learn of the newer model's specifications I am happy with knowing that what I presently own is plenty good enough for my use. Might have to look for a Leica M AA group to ensure I can successfully kick the upgrading habit and stay financially sober."}, {"autor": "Gobert", "posts": "991 posts", "date": "09/26/2021 01:03  PM", "content": "1 hour ago, pippy said: I'm another who always uses a filter when shooting outdoors. Always. I know there could / should be, in theory, some degradation in IQ but having done tests in the studio the reality, IMX, is that there is no noticeable difference so for me, as Paul said above, it's also a no-brainer. Shooting in the studio, however, I don't use them but that's because the circumstances are very different. Philip. Shooting in de studio is different and sharp evening lights might be something to take into account. You might -----> create !!!  a ghost…."}, {"autor": "Artin", "posts": "1,649 posts", "date": "09/27/2021 10:35  PM", "content": "I have never used filters on my lenses , I always would like to use a lens as it was -----> designed !!! .. having said that when shooting at a beach I do slip one on. but I never ever use a lens without the hood"}, {"autor": "Photoworks", "posts": "968 posts", "date": "09/28/2021 12:35  PM", "content": "Leica does not recommend filter on the Noctilux lens as internal reflection in possible. I have a quality ND filter on it since the M camera does not shoot quick enough to get a normal exposure. I have had issues with a variety of filters that -----> creates !!!  goest images on sunset, blight led lights and night photos. Get a quality filter to reduce it.."}, {"autor": "jonoslack", "posts": "5,704 posts", "date": "08/21/2020 04:12  PM", "content": "Advertisement (gone after registration) Jono ask me to add this. Here are some further explanations: I’m afraid I haven’t spelt out what I’m getting at on this post. The point is that you can shoot the M10-R in brighter light conditions than the M10, M or M9. Without using ND filters. This wouldn’t matter to everyone, but I often want to shoot with the lens wide open in very bright high contrast situations (generally people rather than boats!). The base ISO of the M10-R already gives you 1 stop advantage (100 vs M10’s 200). In addition to this you can recover a lot more information than you can with the previous M cameras. Thanks to Dr No for pointing this out so clearly in post #78 I've been trying to think of a simple way of describing it, and here it is So This boat was shot with the 50 'lux at f1.4, and at 100 ISO at 1/4000th second --img--  This is the -----> developed !!!  image with 2.35 stops of under exposure --img--  and here they are side by side --img--  Here you are Scott: --img--  --img--  All the best"}, {"autor": "cp995", "posts": "1,055 posts", "date": "08/22/2021 09:39  AM", "content": "I see the M10 prices going down a bit after the availability of the successor. This will then -----> create !!!  a greater demand for upgraders and Leica newbies, which will lead to slightly higher prices again. Edited August 22 by cp995"}, {"autor": "satureyes", "posts": "827 posts", "date": "01/31/2017 01:46  AM", "content": "Hey, stuck this on this weekend, the m240 one works with the m10. Slightly different placement but like on the m240 the grip is much -----> improved !!!  and leaves the hot shoe free for the EVF. Definitely a fan! Good stuff. Can you bosh up a photo so I can see how it lines up with the thumb rest?"}, {"autor": "Harvard Kiwi", "posts": "184 posts", "date": "04/30/2021 03:31  AM", "content": "My Thumbie arrived today and it is installed on my M10. The version I have is -----> designed !!!  for the M (Type 240) and the M10. There were no issues with the installation and it sits well. Just make sure you follow the instructions and use soapy water during installation to correctly position it as the 3M adhesive is quite strong and you don't want a wonky grip. The Thumbie I received is brass with black paint and while I was initially concerned about how well a stick on accessory would work, I'm comfortable that it should last a while after installation. I was also concerned about the appearance of the adhesive strip between the brass accessory and the brass body and thought it may take away from the aesthetics of the camera. While I can see the strip, and it isn't a completely clean look, it is nowhere near as unsightly as I thought it could be and I am happy with it. I chose the Thumbie as I value the added grip along with my Leica protective half-case for one-handed use. I didn't want anything hot shoe mounted as I use that for my Visoflex 020 on occasion and didn't want to have to compromise. I was also a little bit concerned by some reports of hot shoe mounted thumb grips loosening the shoe. At this early stage, I wholeheartedly recommend the Thumbie but the true test will come with time."}, {"autor": "kgs", "posts": "1,258 posts", "date": "09/14/2021 01:08  PM", "content": "vor 2 Stunden schrieb a.noctilux: We are different. I would buy Leitz/Leica as first lens for my Leica. The magic (for me is there ...in the glasses), if not seen the 'magic', I'd buy cheaper lenses before buying cheaper bodies.... Sorry,I owned the Super Elmar 18 asph., the Elmarit 21 asph., the Elmar 24 asph., the Summicron 28 asph., the Lux 35 asph FLE, the Lux 50 asph, the Lux 75 asph. and have largely replaced them with the same or faster lenses from Voigtlaender. The Elmarit 24 asph (silver) has remained, the Summarit 75 and 90 and the Elmar 135.My pictures have remained equally good or have -----> improved !!!  technically. The \"Leica Look\" is a myth, revered again and again by so-called \"Leica disciples\".Greetings George"}, {"autor": "setuporg", "posts": "971 posts", "date": "08/26/2021 07:40  PM", "content": "1 hour ago, Jeff S said: I also don’t waste my time shooting the same scene with two cameras for scrutiny; either the picture/print resonates or not. Jeff, I know you put a lot of work in each print, and that's how it should be. Alas not everyone has the time to process each image, in fact very few get -----> developed !!!  in reality -- at most you can apply bulk presets. So if one uses photography to document life, you can end up with 0.6M DNGs in the Adobe Cloud as I do, so I can see them all on my ipad/iphone, rank/review and share from there. In my flow they all get imported and uploaded. In that setup I get to appreciate OOC look more than anything else. 1 hour ago, ianman said: the shutter is as quiet as a gnats fart The thread was worth it just for this!"}, {"autor": "LocalHero1953", "posts": "8,870 posts", "date": "09/08/2021 07:30  AM", "content": "My recollection is that this was not a problem with the M9, or much less of one - can any one with a M9 confirm? I don't remember finding it irritating till I got the M240; it was another reason for not getting the M10 when I found it was not -----> improved !!! . Not all of us are paying attention all the time with our fingers on the shutter button, especially if we're playing with small entertaining and photogenic children. Also, I did some tests with the M240, to see if I could sweep the camera quickly to my eye and take an instant shot while waking it from sleep as I did so. I could not - it still needed a slight extra delay for the camera to wake up. Perhaps this is a CMOS characteristic, but not CCD."}, {"autor": "Bornosor", "posts": "1 post", "date": "09/03/2021 06:59  PM", "content": "Advertisement (gone after registration) Hi i’ve just got my first digital Leica, an M10R. coming from a canon background im used to connecting my camera directly to my mac and having the eos utility automatically download and organize my photos into different folders sorted by date, Obviously thats not the case with the Leica and i have to connect the sd card to my mac in which all the photos are stores in one folder that i have to manually -----> create !!!  date stamped folders for on my hard drive. is there any way (in camera or through an app) that i can do something similar to the canon eos utility with the leica sd card and automatically import all the photos on it into date stamped folders?"}, {"autor": "Bikie John", "posts": "105 posts", "date": "09/04/2021 09:21  AM", "content": "I do it pretty manually. Generally I will end up with a folder for an \"event\", whether that is a walk in the country, a concert or a fortnight's holiday. I generally use Lightroom for basic processing. Then depending on all sorts of things, I might: 1. -----> Create !!!  the folder manually, copy photos from camera(s) into the folder, and import the folder into Lightroom . Or.... 2. -----> Create !!!  the folder and import the files directly from the camera card into it in LR. Or... 3. -----> Create !!!  the folder in LR and import the files directly from the card into it all in one go. John"}, {"autor": "tobey bilek", "posts": "5,007 posts", "date": "08/31/2021 09:39  PM", "content": "Advertisement (gone after registration) As I wanted to just try it out on M10 R, I bought a Fotodiox Nikon to Leica R adapter. The lens had already been converted to Nikon mount years ago. $24 seemed ok for an experiment. Looking for a trial subject, I found a white linen handkerchief 6 feet or two meters away and lit by a large window. Did one exposure in the center and refocused with it on the edge, magnified image for each. Image in Capture One is incredible! I can easily count the individual threads from a subject 6 feet away. To be sure this is a tripod set up/procedure only unless you have the electronic viewfinder which I do not have. Outdoors I would use the dark cloth from my view camera. until I decide I require it. Capture One is vastly -----> improved !!!  over two years ago. Leica images just seem correct as entered unlike before when I had to use linear response or flat mode and do it all from scratch. I would encourage you to try it out. An e Mail last week said they are adding HDR and Pano stitching. Goodby Adobe. I bought the lens in 1974 after trying one on my infant daughter who was not yet crawling. Electronic flash into an umbrella was the light. I could see her skin texture in Kodachrome 25. Summicron R 90 mm would not do it."}, {"autor": "petermullett", "posts": "837 posts", "date": "08/11/2017 11:09  AM", "content": "Thank you Alex for the very clear instructions…….it's a weird way of getting there that Leica -----> designed !!!  for that part of the menu, but your directions worked! I appreciate the help. Peter"}, {"autor": "augustwest100", "posts": "128 posts", "date": "05/25/2021 12:18  AM", "content": "I guess I should clarify - I would be taking the camera out of a small bag when shooting, and then returning to the bag when not. And, I always have those little peak -----> designs !!!  things so I can add a strap when needed!"}, {"autor": "overexposed", "posts": "99 posts", "date": "05/27/2021 01:39  AM", "content": "I used the handgrip plus fingerloop alot on my M-P and 246. even thought leica should really -----> develop !!!  a more comfortable fingerloop, i loved the combo! and will go for it again once i get my hands on a m10 mono"}, {"autor": "adan", "posts": "10,775 posts", "date": "08/25/2021 03:04  AM", "content": "I had one of these in the early days of the M10. The possible mechanicals difficulties on a digital Leica are: 1) as the name suggests, with dual ranges, the DR has two separate focusing cam surfaces (on one cylindrical cam). Using the long-distance range (1m > infinity) the closeup cam, now in the bottom of the lens, can jam or rub against the meter housing on the floor of the M10 shutter chamber as one focuses close to infinity. In my case, this happened only in the last fraction of a mm before reaching infinity, and it did not completely jam; the focusing just got a bit stiffer (and the lens left a little rub-mark inside the M10). 2) The close-up goggles won't always clip completely into place, unless the little black rubber \"bumper\" on the back of the goggles is trimmed to fit (see your picture, black bumper is just peeking over the top, above and behind the words \"Leitz Wetzlar.\" To focus closer than 1 meter, the goggles MUST be mounted on the lens (they unlock the close-focus action by pressing on the \"ball bearing\" on top of the lens mount - see your photo). The whole point of the DR lens and goggles is to focus close using the regular rangefinder and no other accessories. But it can be used with live-view or EVF - still needs the goggles mounted, though, to unlock the closeup range. It is also a bit heavier than most M 50mm f/2s, due to the 1950s build-quality, and the extra metal for extended focusing. At normal focusing distances (1m > infinity) I found the DR to be at least as good, and often better, than more modern 50mm Summicrons - at f/2.0. Stopped down, the differences decrease. Certainly for a 1950s design, it holds up extremely well with age. I.E. I mostly agree with Rockwell's evaluation. In the close range, as with most lenses -----> designed !!!  for longer distances, it is a bit soft at f/2.0, but very sharp stopped down. I used mine in the studio and for other close-range work for a couple of months - and still sell prints from some of its images. But I'm not excited by \"old stuff\" just for its own sake, and ultimately a 75mm Summarit f/2.4 gave me tighter cropping and equal resolution with less fiddling around with goggles and \"gear changes\" on the lens. But I'm glad I got a chance to try it out. 50 DR on M10 at abou 0.85m --img--  Edited August 25 by adan"}, {"autor": "bcapphoto", "posts": "159 posts", "date": "08/24/2021 12:11  PM", "content": "27 minutes ago, poli said: Did a slightly different thing, but my experiences might help you. I switched from the M-D to an M10-D. It was a bit a spur for the moment kind of thing and I did a trade incl cash. After about 6 months I had some small regrets. Not that I was not happy with the M10-D, quite the contrary, and the pros you mention (except for the screen ) all apply. My regrets were on my feeling that the differences seemed small and not really worth the money. Then a year later I borrowed an M246 for a weekend. And to be honest, in that weekend for me it confirmed that the M10-D was a step up from the MD 262. In retrospect I discovered the pros indeed were larger (for me personally) than I thought. I really prefer the slimmer body, the better viewfinder and another typical M10-D characteristic (faux lever). The better ISO performance is a plus too, but in real life not a game changer. That also counts the other way around regarding battery life. The M-D has better battery life, but in using the M10-D it is not an issue. Mostly I get by with one battery anyway. I think all these things will also count for the regular M10 (except for the screen less thing...). So if you trade, I advise you to do it enjoy it and don't look back. Borrowing the M246 (monochrom) made you realize how great the M10D was? I have the M246 - it's a stellar performer, and from what I can tell, offers at least 1-2 stops -----> improved !!!  ISO handling in low-light. Did you find otherwise?"}, {"autor": "poli", "posts": "374 posts", "date": "08/24/2021 12:22  PM", "content": "6 minutes ago, bcapphoto said: Borrowing the M246 (monochrom) made you realize how great the M10D was? I have the M246 - it's a stellar performer, and from what I can tell, offers at least 1-2 stops -----> improved !!!  ISO handling in low-light. Did you find otherwise? Yes, but not regarding the results, I am really talking about the handling (slimmer body and better viewfinder). To me the M246 felt less comfortable to use. So it made me realize I was happy with my choice after all. The BW results of the M246 are great. BTW: Low light handling of the M10-D is better than the MD 262."}, {"autor": "adan", "posts": "10,775 posts", "date": "08/21/2021 07:08  PM", "content": "10 hours ago, aral70 said: I had a discussion with a friend regarding the iso of the leica M10 do you think the 100 iso are virtual or are they real? Image sensors all only have one \"real\" ISO, called the base ISO. Which -----> creates !!!  the optimal and most efficient sensor output - one photon in knocks loose one electron to be captured and counted, with no overflow. For the M10 24Mpixel color sensor, this is about \"ISO 135-ish\" according to Leica. An analogy would be - put a needle on a rotating vinyl/wax sound recording, and the needle will vibrate and put out a given amount of sound all by itself. That is its \"base volume.\" The original \"phonographs\" amplified the sound with a megaphone or trumpet - eventually electrical devices were used to amplify the vibrations (or \"signal\") instead. --img--  All the other ISOs a digital camera may offer come from processing the base ISO image with additional processing chips. Amplifying or \"pushing\" it to a higher ISO get a usable image using less light, or to a lesser extent subduing it with de-amplification (\"pulling\") to get a lower apparent ISO, a stronger signal and thus slightly less noise (better signal/noise ratio). I guess those could be called \"virtual ISOs.\" But I've never head that term used. The ability to \"pull\" a digital image is very limited, since the base ISO is already using the full capacity of the sensor's \"pixel wells\" that store the electrons, and adding more light very quickly overflows the capacity of the wells to distinguish bright things, leading to \"blown\" highlights without detail. On the basic M10, ISO 100 is a slight \"pull\" of the base ISO, and ISO 200 or higher are \"pushes\" of the base ISO (weaker and weaker native signals (sensor exposed to less light than optimal), amplified more and more, and thus acquiring more and more noise.) And for whatever reason (probably to maintain even steps: 100, 200, 400, etc., on the mechanical ISO knob), Leica does not allow accessing and using the actual base ISO. ................... As to digital ISO compared to film ISO, the ISO (International Organization for Standards) standards for measuring each are completely different. Film ISOs are determined by measuring shadow density (although Ilford, for example, doesn't use the ISO method, for their own films). Digital ISOs are measured differently based on signal, noise, midtones - and only for .jpgs, since each photographer will do their own processing with raw of .DNG files). Nevertheless, in practical use, they are generally close, so that an external independent light meter, which has no idea what camera one is using, should produce equally-bright pictures from the same light, subject, and manual camera settings. The only way to really test that is a direct comparison with a color slide film of ISO 100 (no printing corrections allowed) and a digital .jpg taken at the same aperture and shutter speed at ISO 100 (no photographer post-processing - \"straight from the camera\"). The ISO organization doesn't come close to doing such a test, and I suspect most camera makers don't bother, either. DxO claims their testing system comes close, but it's still based on a \"virtual\" mathematical model, not shooting Velvia 100 alongside an M10 or the other cameras they test. Scroll down halfway for digital ISO explanations and measuring techniques: https://en.wikipedia.org/wiki/Film_speed Edited August 21 by adan"}, {"autor": "JonPB", "posts": "193 posts", "date": "08/04/2021 06:43  AM", "content": "For a rangefinder camera to focus accurately, both lens and camera must agree on what indicates nearest, what indicates infinity, and the curve that plots all points in between. This is because the rangefinder, unlike a view camera, SLR, or EVF camera, does not inspect the lens’ image directly to evaluate focus. Instead, one mechanism gauges distance to subject (the wheel at the top of the shutter box and the mechanics it attaches to in the camera, and the ring that moves in and out of the inside of the mount of the lens), and an independent mechanism adjusts the lens to focus at that distance (the distance between sensor and lens mount in the camera, including film plane flatness where relevant, and the movement of the optical cell(s) relative to the mount in the lens). Both systems must agree in box camera and lens to achieve optimum focus. This is a surprisingly complex problem. Possibilities that come to mind for a system that focuses past infinity in the center of the frame include: It might be working as intended. The lens might have field curvature and the lens designer optimized it to attain maximum resolution, i.e. to be in focus, in a ring around the center of the image, not the axis or corners. With recent lenses, you might look at the MTF curves; in the curve for the appropriate aperture, if the lowest dashed/solid pair of curves slopes upward from the left edge before falling down toward the right edge, then this behavior can be expected (but is unlikely to be visible when viewing the full image). It might be working as intended, part two: the lens was calibrated to place focus in the middle of the thickness of a sheet of film, but it is being used on a digital sensor which does not behave as if it has thickness. In this case, the lens is effectively focusing behind the sensor, so focusing closer (moving the lens away from the sensor) -----> improves !!!  resolution. It might be working as intended, part three: all lenses have aberrations, some of these aberrations occur mostly in front of or behind the focus plane, and some of those are reduced when changing aperture. Removing aberrations in front of the focus plane will shift optimum focus backwards without changing actual focus at all. Designers of lenses with this focus shift behavior must choose which aperture the focus setting is optimized for. It might be working as intended, part four: our metal lenses are more responsive to temperature changes than a well-designed plastic housing, so hot or cold temperatures have elongated/constricted enough material to change focus. I haven’t heard of this in practice, though; or, if it has changed enough to alter focus, the photographer has more pressing issues. It is working as intended, part five: your demand for focus has exceeded the design specifications. This may well be expected of extreme lenses: 135/3.4, 90/2, 50/1.2 lenses or with wider aperture might be within allowable tolerances yet still not perform well together. Changing both or either might improve performance in that equipment pairing yet impair performance of the calibrated device with most other M systems. Neither are working as intended, but they both agree with each other, mostly. To make the system work, all M lenses and cameras are designed to align within a given tolerance of a certain specification. But the spec doesn’t matter so long as the parts interacting do so agreeably. This is why testing multiple items helps identify the problem: if you have lens A, lens B, and camera 1, and two of them agree with each other but not the third, most likely the third would benefit from calibration. The camera is miscalibrated for focus throw: the shouldn’t be a problem at infinity, but might be at any other distance. The camera is miscalibrated for infinity: all properly calibrated lenses tend to show the same error. Adjusting camera will improve its performance with most lenses. The lens is miscalibrated for focus throw: some lenses have been modified by people who didn’t understand the system; sometimes this can be fixed by rotating the modified part out of the way. The lens is miscalibrated for infinity: as above or can be adjusted with shims. The camera and/or lens are misaligned. This can be expected with devices that show significant dents, and also when using imprecise adapters. So, there can be no generic answer to satisfy this kind of problem. It is not uncommon for rangefinder shooters to learn that lens a at aperture b needs to be adjusted like so when working at distance c, and so forth. I know that this is not a satisfying answer, but it is part of the package deal when extracting such high image quality from mechanical devices of this size."}, {"autor": "SiggiGun", "posts": "736 posts", "date": "05/31/2021 07:25  AM", "content": "vor 1 Stunde schrieb evikne: It is rumored that a new and -----> improved !!!  Visoflex will be launched in November … YES, this is correct. But I don't remember me if the new Visoflex is backward compatible with the M10 or if he is design for M11. Furthermore, the launch is rumored, as you mentionned, for November 11th, but the product will probably not be in the Stores before Februaray 2022,..."}, {"autor": "Zero9", "posts": "8 posts", "date": "05/31/2021 07:45  AM", "content": "Advertisement (gone after registration) 6 hours ago, jaapv said: I don't think that you would be happy. The SL2S is a completely different experience. I think that your solution, using the OVF in less critical situations and the EVF when needed is an optimal one. The SL2S may have the better EVF but the Visoflex is not bad at all and adequate for the purpose. You don't really need pretty pictures in your viewfinder, you need them on your prints. Whether the electronics of the SL2S are \"better\" is debatable - that judgement is mainly based on the additional AF and Video capability. Thanks! I was hoping that a better ‘evf’ on the sl2s can help me to focus faster and more precise. I agree practice and muscle memory is required to -----> improve !!!  the speed and hit rate, either using an ovf or evf. Just not sure how much of a difference a higher resolution evf will make in terms of assistance. You also brought up a good point; if sl only -----> improve !!! d on af and video capabilities, then does it mean the shooting experience is the same as other cameras like canon, Nikon or Sony"}, {"autor": "Zero9", "posts": "8 posts", "date": "05/31/2021 07:52  AM", "content": "1 hour ago, evikne said: It is rumored that a new and -----> improved !!!  Visoflex will be launched in November … Fingers crossed! My main concerns are: 1. whether it will support m10…the perspective correction upgrade only support m10p, r, mono 2.whether m10’s processing power can handle higher resolution"}, {"autor": "jaapv", "posts": "66,415 posts", "date": "05/31/2021 07:55  AM", "content": "33 minutes ago, Zero9 said: I agree practice and muscle memory is required to -----> improve !!!  the speed and hit rate, either using an ovf or evf. Just not sure how much of a difference a higher resolution evf will make in terms of assistance. Very little. I managed to for the Digilux2 and EVF2 on the M240, despite grotty IQ and slow speed. Miles behind the Visoflex on the M10. But I agree that the CL and SL offerings are better in terms of image quality and refresh speed, no doubt, but better in terms of functionality? The only functionality that will be -----> improve !!! d is the visualization of the OOF areas and DOF, but there is focus peaking to help in that respect and you wouldn't see it in the OVF anyway."}, {"autor": "LBJ2", "posts": "640 posts", "date": "05/31/2021 02:08  PM", "content": "Thankfully I am able to do everything I need/want wearing my glasses with the M10. I do want to be able to see clearly before, during and after I raise the RF to my eye 😉 But, eyesight corrections can be more than complicated and one size does not fit all. ** There are benefits to wearing glasses while using our cameras to include keeping the OVF clean from eyelash smudge. I wear my glasses when using the Sony EVF for the same reasons I do with the M10--to be able to see clearly before, during and after. With that said, before you trade your M10 for the larger SL which doesn't seen like what you really want based upon what your wrote, why don't you consider some of the other smaller mirrorless cameras too. I shoot mirrorless alongside my M10. Your 50 Lux and 90 Cron will perform nicely adapted to other mirrorless cameras. My 50 F0,95 works very well on mirrorless, but I am not sure about your 50 1.0 v3 ( was it -----> designed !!!  for digital?) As other have posted, the rumored next generation, hopefully much better IQ Visoflex may go a long way to solving more advanced eye sight issues. To me the current Visoflex 020 is already very effective, but I prefer RF/ZF and wearing my glasses. Good luck on your choice. The most important of course is to make sure you can keep-on shooting! Even if there are some compromises here and there. Edited May 31 by LBJ2"}, {"autor": "SrMi", "posts": "1,855 posts", "date": "06/10/2021 06:40  PM", "content": "It is unclear what a rumored new EVF would -----> improve !!! . The rumored new EVF would likely require a rumored new M11. I suggest trying out M10-R with the current EVF and decide if that works for you. If it does not, and the EVF experience is essential to you, then you postpone your Leica M purchase until Leica launches an M system that works for you (this year, next year, in 10 years?). IMO, M Leicas are primarily rangefinder cameras that gain a secondary functionality when EVF is added."}, {"autor": "Helge", "posts": "162 posts", "date": "07/18/2021 05:21  PM", "content": "Advertisement (gone after registration) Looks rather ugly and like -----> designed !!!  in a rush… Luigi‘s M Mate on the other hand is distinctive: --img--  However, I’m anyway not missing access to both while the camera is on a tripod, but if I would, I would choose Luigi‘s. And I would probably never miss this handgrip while the camera is on a tripod…"}, {"autor": "pop", "posts": "21,132 posts", "date": "07/22/2021 11:49  AM", "content": "vor 52 Minuten schrieb farnz: Thank you for posting, Philipp. It's interesting although not something I think I'd go for. I do like the integral Arca-Swiss mount, which seems like an excellent idea. Pete. Thanks , Pete. The integrated mount seems to have been -----> invented !!!  by Kamerakraft which has been mentioned by others earlier in this thread. I don't think the aesthetics of the thing all that appalling; the first image in the kickstarter site shows a crude prototype as a proof of concept. Later in that article there are drafts which look not as bad as that."}, {"autor": "Gelatino", "posts": "1,265 posts", "date": "07/24/2021 10:03  PM", "content": "Each attempt is -----> improving !!!  the concept, trying to correct the lacks of the Leica grip. The RRS is, in no particular order, heavier, top quality, more expensive, no more available. The kameracraft is not really less expensive, but provides a quick access to battery and SD card and has an integrated Arca profile, two features I use frequently, the grip not being honestly ugly but not smart for my taste. The main weakness of the Kameracraft is the absence of eyelet that let the grip move if not tightened. The Tse Hsiao Chung's model looks like the Kameracraft specially the wooden grip and the battery acces, but the Arca profile is on a spare piece a choice that I don't find appropriate. On the other hand it will be more stable with the eyelet. Because of the manufacturing choices it is more expensive. As said above by elmars it comes a bit late, and may be for 3/100mm it won't fit the oncoming M11. Luigi's could be perfect for me with a grip and the Arca profile, and a secure locking system."}, {"autor": "vincentb", "posts": "9 posts", "date": "08/10/2021 12:33  PM", "content": "55 minutes ago, farnz said: I'm very sorry to hear that this has happened to you, Vincent. Pete. No biggie, these things happen when you -----> develop !!!  products. The important thing is to keep ahead, and I've got things getting ready to be launched later this year"}, {"autor": "FrozenInTime", "posts": "1,558 posts", "date": "08/14/2021 11:22  PM", "content": "I use a pile of San Disk Extreme Pro 64GB UHS-1 cards which are about the same cost as a roll of Portra 400. My logic being : A very large card increases the possibility of loosing a lot of images should a fault -----> develop !!! . The M10 does not really need 4k+ video speed grade cards."}, {"autor": "Photoworks", "posts": "968 posts", "date": "08/15/2021 05:43  PM", "content": "Please no LEXAR. card failure is just a Mather of when. Whit the M10 hardware you can use UHS-I or II, I think you get about the same writing speed in camera for both. Sometime firmware -----> improves !!!  the speed and then a faster card is more convenient. One day you will update to another camera and you may want to quicker card. I use sandisk and ProGrade 256gb v90 UHS-II"}, {"autor": "Rodrigo castillo", "posts": "103 posts", "date": "07/27/2021 11:31  PM", "content": "Advertisement (gone after registration) I imagine that although each one of us lives his own doubts as if they were unique, surely many in this group have gone through the same doubts, and have made good and bad decisions. In my presentation in the forum I already mentioned it, but since surely few saw it, I will repeat some things as context for my doubt. I started taking photographs as a child, with analog cameras of my father that I no longer remember. I learned the basics of analog development as a teenager (I am currently close to 50) and after a long history about 20 years ago I was increasingly opting for Canon digital ones. From a cheap Canon EOS to full frame 5D, 5DII, 6D, 5DIII and some nice L lenses etc…. A few years ago, rather due to the need for a small business, I needed a smaller camera that would record good video, so I opted for a Sony A7RII, thinking that in addition to making good videos it would have a higher resolution than what I knew so far. From that moment I discovered the wonder of mirrorless cameras, basically because of the possibility of using any lens, from the oldest and rarest to the most modern…. that led me to the leica world ... and once I had some R's and a couple of M's, curiosity led me to try more and more alternatives. All this at the same time led me to buy my first analog camera in many years… a leicaflex to use my R lenses…. and go back to the dark room of my childhood ... and since I was -----> developing !!!  my own negatives why not the medium format ... and buy a Mamiya, and since I love the medium format why not hasselblad .... And since I have M lenses that have cost me an arm and a leg, why not an M body, and then a Leica M3 and then a Leica M9…. I imagine this is a story known to many…. well then …. I currently have an M3, an M9, an X2, a Licea CL analog and a Leica CL digital, all my Canon cameras, all my canon lenses, several Ricohs, analog and digital, an Olympus 35, a Nikon FE2, a Canon A1, one Minolta quartz two Hasselblad (500 EXL and 501 CM). Needless to say about the lenses… but in a leica M mount a 50 Summicron v3, a 50 Summicron v4, a 90 Elmerit tele M, an old 90 mm f4, a 35 mm Sumaron 3.5, several Voitglanders, several 7Artisan and TTArtisan…. etc etc etc …… The point is that I love my cameras and my lenses, I use them all, but the experience of the Leica M and my question… to conclude… is…. should I sell some cameras and lenses to buy a hopefully unused Leica m10R and a pair of M lenses or should I sell my Rolex (which I hardly ever use) to buy a Leica M10R and some lenses…. I know I'm being funny… .. but this is really my dilemma… .. I know they will tell me that only I can know and that it depends on what I want…. maybe the only answer to that is…. I want to stop at least for a while looking for the perfect image and rest assured knowing that I have the perfect camera and the perfect lenses and that if I don't take better photos, as always it's just because I'm not close enough ..."}, {"autor": "Printmaker", "posts": "1,680 posts", "date": "08/10/2021 11:37  PM", "content": "You might consider a gently used SL 601 rather than a visoflex. Best move I made when my visoflex -----> developed !!!  on again - off again connection issues."}, {"autor": "ravinj", "posts": "986 posts", "date": "08/11/2021 02:20  AM", "content": "6 hours ago, bellaluca said: My Visoflex stopped working without any warning. I sent it to Leica Repair, I was told it was not repairable and past warranty just by 4 months. Really frustrating, since they are very pricey but I depend on it when I mostly shoot with noctilux .95 . Now I am considering buying a used one, but of course concerned with what to do, 3 month warranty for used, 2 year warranty for new. Any advise? New one can be had for less than $500 shipped to USA through dealers in Asia. I bought one and it has been perfect. No customs duty. The lower price is still a rip-off in my view, but less than the prices being asked for by US dealers. While a new and -----> improved !!!  mythical EVF may arrive, expect a lot more higher price, so a new 020 is your best bet if you have to use the Noctilux wide-open with your M. Edited August 11 by ravinj"}, {"autor": "Wesselphoto", "posts": "1 post", "date": "03/13/2021 07:48  AM", "content": "I have the same issue with my m10, and before with my M262. The m10 is slow in startup, the only way to solve it is burning several batteries a day, the startup time has not -----> improved !!!  since years of production. It's slow, very slow.. To few pro's work with Leica today I guess. All other brand camera I have are near instant. X-pro, nikon etc. Time for a speed Firmware update ? The best digital M byfar is the M9 or M9mono in this case, it's Much faster then the later Cmos Leica s. I have all, but for proper response I Take the M9 (or m4😊). Rgs eddy"}, {"autor": "Kwesi", "posts": "818 posts", "date": "03/13/2021 01:22  PM", "content": "5 hours ago, Wesselphoto said: I have the same issue with my m10, and before with my M262. The m10 is slow in startup, the only way to solve it is burning several batteries a day, the startup time has not -----> improved !!!  since years of production. It's slow, very slow.. To few pro's work with Leica today I guess. All other brand camera I have are near instant. X-pro, nikon etc. Time for a speed Firmware update ? The best digital M byfar is the M9 or M9mono in this case, it's Much faster then the later Cmos Leica s. I have all, but for proper response I Take the M9 (or m4😊). Rgs eddy Deleting images from the card wether in camera or in the computer can create fragmentation which will slow down your start up time. If that's not the case for you then depending on how slow \"slow\" is you may have a defective camera."}, {"autor": "tom.w.bn", "posts": "528 posts", "date": "03/13/2021 03:49  PM", "content": "vor 7 Stunden schrieb Wesselphoto: I have the same issue with my m10, and before with my M262. The m10 is slow in startup, the only way to solve it is burning several batteries a day, the startup time has not -----> improved !!!  since years of production. It's slow, very slow.. To few pro's work with Leica today I guess. All other brand camera I have are near instant. X-pro, nikon etc. Time for a speed Firmware update ? The best digital M byfar is the M9 or M9mono in this case, it's Much faster then the later Cmos Leica s. I have all, but for proper response I Take the M9 (or m4😊). Rgs eddy I think it's technically impossible to deplete \"serveral batteries\" a day just because you switch off standby mode."}, {"autor": "yukosteel", "posts": "23 posts", "date": "05/07/2021 06:26  AM", "content": "Thanks for sharing! It's nice to better understand mechanics there. In case of film camera I'd not hesitate to open it and find what is wrong, though M10 is packed with electronics which is big stopping point. It's not under warranty, however if it's natural mechanical issue -----> developing !!!  over time, I'd still prefer professionals to take care of it. Otherwise, if it's expected M10 rangefinder precision level, then I can just live with it and keep shooting happily using a single focusing direction workaround."}, {"autor": "Good To Be Retired", "posts": "220 posts", "date": "11/17/2020 03:09  PM", "content": "9 hours ago, Ktsa5239 said: Sorry for another M10 to M10R post... In Australia, the trade in is fairly costly. I could potentially trade my M10 and the 16-18-21 WATE (used twice in the last 2 years) for the M10R I feel your pain :). I'm wrestling with a similar quandary myself. Ive hopped onto the SL2 earlier in the year,............................................... I cant help but feel its not giving me the same experience I got from the M. I also find it too heavy as a system to carry for long hikes and trips and I really miss the M at those times. Similar situation. I recently bought into my 4th medium format system. I understand heavy The reason I really want to upgrade are: 3) Ability to crop with higher MP so I could travel with just a 35mm and maybe a 90mm Been experimenting with such a thing myself. I used an M240 and a 28, 50, and a 90 the last time we went to France. Much more pleasant than a pro body Nikon and three pro zooms. We do mostly castles, cathedrals, ruins, that sort of thing. 24mp was sufficient for the things I wanted to crop, but not enough for architectural details. I'm probably going to try something similar with a Hasselblad X1d II and a 45, 65, and 90. Hopefully, the larger sensor will partially make up for lack of a really long lens. The reasons against it: 1) ....................................if anything new comes along I wont be able to afford it) Yeah you will. Trust me You'll think of something 2) About the same sensor MP count as SL2 3) M11 might have ibis.... or what if CL2 comes along with EVF and ibis and light Or what if somebody -----> developed !!!  a 28 - 300 f1.2 superzoom about the size of a beer can with light weight and excellent image quality Buy something you can use TODAY, not in 4 years. Oh man....what should I do..... Buy Baby, Buy. Support your local economy. Edited November 17, 2020 by Good To Be Retired"}, {"autor": "Dennis", "posts": "1,521 posts", "date": "11/17/2020 10:19  PM", "content": "I was shooting years ago with a Nikon D810 as the primary camera. I was happy, but something was missing: a better AF, faster response, better low light performance. I was needing a quicker camera to be sure I don't lose moments. I mean, being faster so I can do a better job to tell a story, according to my way to shoot. I was looking for a much faster camera, this was my priority. I traded, paid the difference, and it was the smart solutions. My photography -----> improved !!! , I'm faster with this camera, and I can't ask for more ... Except weight and size 😂 it. Although it was launched in January 2016 and the only 20MP, it's still my primary camera. I don't know your photography style and your needs, but reading your post can say only two things: First, don't trade it. Keep what you have and use it. A camera is just a tool, the story is in front of you, and everything else is still in your mind. But with your current camera, you probably have already everything that you need 17 hours ago, Ktsa5239 said: ... and the 16-18-21 WATE (used twice in the last 2 years) The second is ... Use more often the WATE! Once every year, it's no good at all. If you already have an expensive-amazing lens, use it. Instead of worrying about a better camera, use the gear you already have, and grow as a photographer. When you know the specific features you REALLY need, you will then find the perfect camera. IMHO, it's time to use what you already have. Edited November 17, 2020 by Dennis"}, {"autor": "andba", "posts": "41 posts", "date": "07/25/2021 01:46  PM", "content": "Advertisement (gone after registration) I'm a few weeks+ in to M10 ownership, and have decided that I want to significantly -----> improve !!!  my Lightroom prowess since I owned an M9 a couple of years back. I'm a designer with 20+ years of Photoshop experience and consider myself an expert in that regard, and I do understand the vast majority of principles in Lightroom. Still, in terms of getting the best output, not overprocessing (or processing in the wrong way) ... I could use help. I would also say I'm an absolute workflow novice. Note, I'm not interested in getting hyper technical, I mainly just want efficient use of the app, and lovely results. Should I start with presets and learn by examining how they have been constructed? Are there handy (but fairly high-ish level) videos to watch? As a reference, I particularly enjoy the look of the images @jonoslack produces. Maybe he has some tips? Thanks all."}, {"autor": "mujk", "posts": "307 posts", "date": "07/18/2021 05:02  PM", "content": "Advertisement (gone after registration) 1 hour ago, andba said: And now things have gotten worse. Since the most recent reset, the left side of the direction pad doesn't work. ALSO, when previewing images the focus peaking colors are just flashing all over the place (on already taken images). Is this emergency time? --img--  The colors are exposure clipping indicators (indicating areas that are severely over- and underexposed), so they are harmless. You can turn them on and off and also adjust the threshold values. The direction pad issue could indicate a hardware problem and also the WiFi issue could be hardware-related. Firmware/memory corruption is another possibility. Any chance that your M10 has been exposed to a very strong electromagnetic field of some sort? Regarding the WiFi issue, the only additional thing I would suggest is to check the WiFi for possible nearby strong networks on the same channel. I'm not sure if the M10 can change channel in that case. With a WiFi analyser you should also see the M10 network if it has managed to -----> create !!!  one."}, {"autor": "andba", "posts": "41 posts", "date": "07/18/2021 05:20  PM", "content": "12 minutes ago, mujk said: The colors are exposure clipping indicators (indicating areas that are severely over- and underexposed), so they are harmless. You can turn them on and off and also adjust the threshold values. The direction pad issue could indicate a hardware problem and also the WiFi issue could be hardware-related. Firmware/memory corruption is another possibility. Any chance that your M10 has been exposed to a very strong electromagnetic field of some sort? Regarding the WiFi issue, the only additional thing I would suggest is to check the WiFi for possible nearby strong networks on the same channel. I'm not sure if the M10 can change channel in that case. With a WiFi analyser you should also see the M10 network if it has managed to -----> create !!!  one. Good news on that first part. The direction pad problem is a brand new thing that has happened after following the steps from @rramesh above. As for electromagnetic fields. It was shipped to New York from the West Coast — that's all I can really say. Not sure if there are fields like that during transport. Will try the analyser technique and report back. Thank you."}, {"autor": "Photoworks", "posts": "968 posts", "date": "07/12/2021 04:54  PM", "content": "57 minutes ago, Mark II said: My interpretation is that there probably is not much difference between the cameras other than the M10-R effectively doing the equivalent of shooting the M10 with a slight under-exposure and perhaps applying a different luminosity curve to compensate. the M10-R is a difference sensor. When I meet dr. Kaufman in Paris he ask what I like to see -----> improved !!!  on the M10-P. my answer was a like a camera that does not blow highlights so quickly. and he said: we have the new SL2 . Few years make a difference in sensor tech. and for sure Leica learned and -----> improved !!!  their in camera software. 1 hour ago, pedaes said: Also, not sure what 'better colours and best reds' means - do you shoot jpg? I shoot Raw+J, almost never use the JPG, but it is interesting to learn what the leica look is, how much and what they correct, how much hi lights recovery and clarity is added . the color differences are in the RAW and on JPG. I high ISO the is more color retention then the M10-P often the more that you amplify the signal the more color purity you loose, modern sensors deliver better results. It is not all about the noise."}, {"autor": "SrMi", "posts": "1,855 posts", "date": "07/12/2021 05:00  PM", "content": "5 minutes ago, Photoworks said: the M10-R is a difference sensor. When I meet dr. Kaufman in Paris he ask what I like to see -----> improved !!!  on the M10-P. my answer was a like a camera that does not blow highlights so quickly. and he said: we have the new SL2 . Few years make a difference in sensor tech. and for sure Leica learned and -----> improved !!!  their in camera software. I shoot Raw+J, almost never use the JPG, but it is interesting to learn what the leica look is, how much and what they correct, how much hi lights recovery and clarity is added . the color differences are in the RAW and on JPG. I high ISO the is more color retention then the M10-P often the more that you amplify the signal the more color purity you loose, modern sensors deliver better results. It is not all about the noise. In almost all cases, blown highlights are caused by metering, not by sensor itself."}, {"autor": "mujk", "posts": "307 posts", "date": "06/30/2021 03:06  PM", "content": "The black chrome on the M10 is quite durable. After more than three years of active use it looks like this. Sharp edges are getting slightly gray. The bigger dent on the thumb rest is from an accident. The black paint M9 shows brassing and has become polished in several places after about six years of use. Brassing looks nicer than the grey shining through, but in my opinion it should be a sign of use - not -----> created !!!  artificially. --img-- --img-- "}, {"autor": "tedwill", "posts": "22 posts", "date": "07/06/2021 04:47  PM", "content": "Advertisement (gone after registration) Hello. I recently purchased the M10R and the 50 Summilux. Great combination. I'm enjoying learning about shooting with a rangefinder and -----> improving !!!  slowly but surely. I also have the 35 APO on order. Only time will tell when it will arrive. In the mean time, I'm torn between a 21 or a 28 as a wide angle option. To me, the 28 seems very close to the 35 in terms of focal length compared to the 21mm vs 35mm. While waiting for the 35 APO, what would be a good wide lens to use now and as part of a combination of 21 (or 28) + 35 APO + 50 Summilux in the future? I'd like to use the wide lens for landscape photography and eventually use it on the SL2 as well. Thanks! -Ted"}, {"autor": "lucerne", "posts": "1,416 posts", "date": "07/08/2021 12:30  AM", "content": "bewee I agree with you that under good conditions, the Visoflex works, but it doesnt deliver geotagging everywhere, and it does deplete the battery faster. Passive viewfinders that match the wide angle lenses are much easier. They also dont require live-view to be switched on. Many members of this forum are turned off by their experience of the Visoflex and dream of the next version in the hope that it will be -----> improved !!! . Each to their own, as we say. If it works well for you, there is no need to be concerned. If you are advising a new member, then giving a balanced opinion with pros and cons is only fair. Edited July 8 by lucerne"}, {"autor": "Pobble", "posts": "43 posts", "date": "07/08/2021 01:31  AM", "content": "On 7/6/2021 at 12:47 PM, tedwill said: Hello. I recently purchased the M10R and the 50 Summilux. Great combination. I'm enjoying learning about shooting with a rangefinder and -----> improving !!!  slowly but surely. I also have the 35 APO on order. Only time will tell when it will arrive. In the mean time, I'm torn between a 21 or a 28 as a wide angle option. To me, the 28 seems very close to the 35 in terms of focal length compared to the 21mm vs 35mm. While waiting for the 35 APO, what would be a good wide lens to use now and as part of a combination of 21 (or 28) + 35 APO + 50 Summilux in the future? I'd like to use the wide lens for landscape photography and eventually use it on the SL2 as well. Thanks! -Ted Try the Super Elmar 21 - superb lens ,. Resolution close to apo"}, {"autor": "beewee", "posts": "662 posts", "date": "07/08/2021 03:26  AM", "content": "3 hours ago, lucerne said: bewee I agree with you that under good conditions, the Visoflex works, but it doesnt deliver geotagging everywhere, and it does deplete the battery faster. Passive viewfinders that match the wide angle lenses are much easier. They also dont require live-view to be switched on. Many members of this forum are turned off by their experience of the Visoflex and dream of the next version in the hope that it will be -----> improved !!! . Each to their own, as we say. If it works well for you, there is no need to be concerned. If you are advising a new member, then giving a balanced opinion with pros and cons is only fair. Yes, I agree that geotagging doesn’t work everywhere. Especially not indoors but that’s the nature of GPS in general. BUT, the Visoflex still works better than the Leica FOTOs app with the SL2-S and it actually is reliable outdoors once you give the GPS receiver time to lock on to the satellite signals and get a position. The same cannot be said about the FOTOs app. As far as providing a balanced opinion. I believe you’ve a ready mentioned one side so it’s worth mentioning the other to ‘balance’ things out. Edited July 8 by beewee"}, {"autor": "Oswalt", "posts": "25 posts", "date": "06/20/2021 07:27  PM", "content": "I wanted to switch, as my preferred choice is C1 with Fujifilm. All was going well until I realized I have more highlight latitude in Lightroom than I do with C1. 1 - 100 in LR shows a significant amount of latitude in comparison to C1. I can bring them down almost entirely, but with C1 they just become flat, and “mattish” in appearance. Very ugly looking end result. C1 seems to have finer details after interpolation though, and as a result are also sharper. I’ve also noticed there’s more noise too, perhaps a trade off, but I prefer the noise structure more in LR. I hope they continue to -----> improve !!!  C1 to work better with Leica. I would love to be able to switch over completely. Edited June 20 by Oswalt"}, {"autor": "Photoworks", "posts": "968 posts", "date": "06/20/2021 07:47  PM", "content": "17 minutes ago, Oswalt said: I wanted to switch, as my preferred choice is C1 with Fujifilm. All was going well until I realized I have more highlight latitude in Lightroom than I do with C1. 1 - 100 in LR shows a significant amount of latitude in comparison to C1. I can bring them down almost entirely, but with C1 they just become flat, and “mattish” in appearance. Very ugly looking end result. C1 seems to have finer details after interpolation though, and as a result are also sharper. I’ve also noticed there’s more noise too, perhaps a trade off, but I prefer the noise structure more in LR. I hope they continue to -----> improve !!!  C1 to work better with Leica. I would love to be able to switch over completely. Sounds like you should try moving does sliders again C1 is famous for having better highlights recovery and rolloff"}, {"autor": "squaxor", "posts": "17 posts", "date": "07/06/2018 01:51  PM", "content": "Advertisement (gone after registration) What different User Profiles do you use on you Leica M10? So far I only use two: Norm: For general conditions (see attachment) Mono: For monochrome shooting For Mono I've made the following changes to the 'Norm' settings: File format: DNG + JPG Max ISO: 50,000 (I want that grain sometimes) JPG settings:Contrast, sharpness, Saturation: High Monochrome: On I've attached a PDF of the settings I use. It was -----> created !!!  by the legendary John Greengo. I think it's only fair to link to his course 'Leica M10 Fast Start' which I can highly recommend. For the record, I have no connection to this company nor do I get a referral payment. Leica M10 settings copy.pdf Edited July 6, 2018 by squaxor"}, {"autor": "kahhoe", "posts": "2 posts", "date": "06/24/2021 10:26  AM", "content": "On 7/6/2018 at 9:51 PM, squaxor said: What different User Profiles do you use on you Leica M10? So far I only use two: Norm: For general conditions (see attachment) Mono: For monochrome shooting For Mono I've made the following changes to the 'Norm' settings: File format: DNG + JPG Max ISO: 50,000 (I want that grain sometimes) JPG settings: Contrast, sharpness, Saturation: High Monochrome: On I've attached a PDF of the settings I use. It was -----> created !!!  by the legendary John Greengo. I think it's only fair to link to his course 'Leica M10 Fast Start' which I can highly recommend. For the record, I have no connection to this company nor do I get a referral payment. Leica M10 settings copy.pdf 64.48 kB · 176 downloads Hi The Leica M10 settings seemed unable to be opened. I am not sure if I am missing anything here. I wish to get my hands on a copy of it. Is there any chance you could send me a copy? Thanks in advance."}, {"autor": "Leicaiste", "posts": "1,169 posts", "date": "08/24/2018 02:42  PM", "content": "My bet is on a LHSA Black Paint M10-P. Bill Rosauer : \"2018 marks the 50th anniversary of the LHSA, and to commemorate this milestone, a new LHSA Special Edition model has been -----> created !!! . I have been working with Stefan Daniel and the team at Leica Camera AG for almost two years on this project. Originally, a Special Edition set consisting of a camera and lens was envisioned, but the introduction of the new Leica M10 last January changed that plan. Hopefully we will have something in the way of a Special Edition camera next year. We decided to continue on with the lens part of the project, and here is the result of the latest collaboration of the LHSA and Leica.\" https://lhsa.org/2018/02/lhsa-special-editions/#myaccount"}, {"autor": "tobey bilek", "posts": "5,007 posts", "date": "02/01/2018 04:43  PM", "content": "MAYBE the issue is the goggles are -----> designed !!!  for cameras with lower windows so they will not be centered on new cameras leading to off center images. I also think I read some of the lens internals interfere with body whether extended to focus close or not. Can be modified I think. Notice nobody is telling you why. I sold mine and kept the Rigid ."}, {"autor": "Jeff S", "posts": "18,651 posts", "date": "06/15/2021 11:32  PM", "content": "7 hours ago, Helge said: The RF correction lens does all the correction except astigmatism. Only if you‘ve got a significant astigmatism, the correction lens might not work. Otherwise, no glasses are required to use the RF. Astigmatism and sun protection (my eyes are sensitive to daylight). Plus RF focusing with my aging eyes -----> improves !!!  through use of +.5 diopter, despite otherwise appropriate (comfortable) distance correction via glasses. In younger days, this was not needed. Additionally, I need glasses for when my eye is not against the viewfinder, and I would find it very annoying to have to take them on and off when shooting and walking around. Each person is different, with different requirements and preferences. Math is only part of the story. Jeff Edited June 15 by Jeff S"}, {"autor": "Leon_B.", "posts": "959 posts", "date": "01/21/2021 03:22  PM", "content": "Advertisement (gone after registration) --img-- /applications/core/interface/js/spacer.png\"> With the Leica M10-P \"Reporter\" the german camera manufacturer wants to honor the hard work of reportage photographers. The camera housing has a particularly scratch-resistant dark green finish and is covered with Kevlar fabric - the synthetic fiber that is also used to produce ballistic protective clothing. The M10-P “Reporter” is available at specialist retailers and only 450 units will be available worldwide. Leica M10-P “Reporter”: A homage to the great reportage photographers of our time Wetzlar, January 21, 2021. As part of the celebrations marking the 40th anniversary of the Leica Oskar Barnack Award, Leica Camera AG presents a special design variant of the Leica M10-P: the M10-P “Reporter” is an uncompromising reportage camera, suitable for even the most challenging conditions. Many Leica cameras throughout the company’s history have been -----> developed !!!  with the needs of press and reportage photographers in mind. This is illustrated by exceptional models such as the Leica 250 of 1933, whose film cassette accommodated 250 exposures, or the Leica MP of 1956 – a Leica M3 variant which was equipped with the Leicavit rapid winder, following the suggestions of renowned photographers Alfred Eisenstaedt (1898– 1995) and David Douglas Duncan (1916–2018). With its dark green, particularly scratch-resistant finish and Kevlar camera trim, the Leica M10- P “Reporter” brings to mind the extremely challenging conditions under which many of the most remarkable reportages of our time were created. Kevlar is a synthetic fibre frequently used in the production of ballistic protective clothing. Through exposure to natural UV rays, the camera’s body armour will gradually turn the same colour as its top and base plate. The armour’s diamond-weave texture makes the Leica M10-P “Reporter” especially grippy and comfortable to hold. All of the camera’s engravings are inlaid in light green, resulting in a more discreet effect than the white inlays customarily used on black-finish cameras. In terms of its technical specifications, the M10-P “Reporter” is identical to the serially produced Leica M10- P. The Leica M10-P “Reporter” is available at specialist retailers. A total of 450 units of the Leica M10-P “Reporter” will be available worldwide. --img-- "}, {"autor": "wlaidlaw", "posts": "17,794 posts", "date": "05/23/2021 05:03  PM", "content": "Advertisement (gone after registration) 2 hours ago, pedaes said: Why after Smear Away? If you look with a high power illuminated sensor magnifier, you can often see very faint lines running across the sensor, after whatever product Visible Dust use for Smear Away, evaporates. I find if I use lab grade 99.99% IPA after the Smear Away, it leaves the sensor 100% pristine. I usually find that it normally takes either 2 goes with Smear Away or 1 with Smear Away and 1 with IPA to get a sensor totally clean anyway, so as IPA much cheaper than the Smear Away liquid platinum, by doing it my way, I actually save money I always use Visible Dust green swabs even though they are ridiculously over-priced (the profit margin must be enormous on them). Given that my M10-R cost over £7000, penny pinching on sensor swabs, seems particularly senseless, when I only usually clean each of the digital cameras I am currently using about 3 or 4 times a year. Where the M's were particularly bad on dust, was when I went on a classic car rally in a less -----> developed !!!  country (Thailand, Laos, India, Myanmar etc), usually much of it on dirt roads. Then I was having to clean my M (8, 9 or 240) every other day. I now use my SL for doing that and it stays totally clean inside, over a 2 week rally. The sealing on the SL is very good. The sealing on the CL is not bad but not quite as good as the SL and it does not have the ultrasonic sensor cleaning. of the SL. Wilson"}, {"autor": "Herr Barnack", "posts": "5,059 posts", "date": "05/13/2021 03:10  PM", "content": "@apatel I have only used the B Strap made by Harry Benz so I cannot offer first hand experience on the Gordy's straps. Judging from the images on their website, Gordy's straps look like they are sturdy and well made and the prices are certainly attractive. Gordy's leather looks like it is perhaps not quite as wide as the leather that Harry uses in making the B Strap, which is 1/2 in. wide and 1/8 in. thick. That said, Gordy's straps look functional and sturdy enough to safely use with CL, M and Q cameras; I would want a more sturdy strap on an SL2 or an S3, though. Harry Benz makes a strap called the Brogue SL/SL2 for heavier cameras. The Leather used in the Benz straps - Water Buffalo - becomes very supple and pliable over time. My oldest B Strap is four years old and it is buttery smooth and soft. I take my B Straps off my cameras and apply a leather treatment to them a couple of times per year, which keeps them from drying out and -----> developing !!!  cracks and also helps to soften them. Another possibility is the Tamarkin leather camera strap, which looks like a really excellent strap and is priced somewhat lower than the B Strap: http://www.tamarkin.com/tamarkin-camera-leather-camera-strap I really like the Arte Di Mano camera straps but they are not available in a 140 cm (55 in.) length, which is the length I want for cross body wear. Due to that factor, my eye keeps returning to the B Strap and to the Tamarkin straps. Hope this helps."}, {"autor": "LeicaS2", "posts": "382 posts", "date": "05/17/2021 08:57  PM", "content": "Hey Apatel, Harry Benz does custom work. That’s how the JLoop was -----> invented !!!  at “J”s request. I suggest you request Harry to do an “A” Strap, which would be a regular open strap with a snap on both ends, one leading to a hand strap and the other end to the short connector he calls a dongle that comes with the JLoop, since snaps could not attach directly to the eyehole. He will do it and perhaps name it after you, but you will need to be patient for say ten weeks. Harry should name it after me since I just -----> invented !!!  it, but the letter J has already been taken. Jack --img-- --img-- "}, {"autor": "M10 for me", "posts": "2,377 posts", "date": "05/17/2021 08:44  AM", "content": "I work with Lightroom and import directly into lightroom into a folder that I -----> create !!!  even out of Lightroom. On my Mac I do strictly nothing in the finder what has to do with photographs (in the finder I do even not show the photo-folder in the favorites). The photography folder I manage exclusively within Lightroom. Then I do a second thing: During the import process I alter the filenames to date/time e.g. \"2021-05-17 at 10-43-15\" So that is my way. But I must say that I am extremely pedantic on such things. Here I am the pure ingeneer type. When I sit together with other photographers and I see the complete mess they have in their organisation this makes me always mad. But it never helped anything: My friends always continued with their mess 😀. They must like it."}, {"autor": "Infantasy", "posts": "130 posts", "date": "11/22/2020 01:50  AM", "content": "Advertisement (gone after registration) Hi all, I recently looking for a tripod for travel. I wish to have a light weight but rigid one. I am 183cm tall. Have looked a Gitzo GT1545T, it is high enough for me but the new -----> designed !!!  legs are thick and nearly same as their traditional series 2 though it is series 1. I looked their GT0545T as well but the tripod is not high enough and always need to rise up the center column. Do you have any preference and what are you using? Thanks a lot."}, {"autor": "Gelatino", "posts": "1,265 posts", "date": "11/22/2020 08:47  AM", "content": "Advertisement (gone after registration) For me a tripod for travel use should be: -light weight between 1 and 1,5kg not over 1,7 or 1,8 kg -short folded between 40 and 45cm not over 50cm; this spec is -----> improved !!!  if the legs can be folded in reverse position -high enough unfolded (depends of the user's needs) central column may add some cm but not fully extended -able to wear 4 times the total weight of the combo camera-lens. this spec depends a lot of the head fitted on the tripod. -rigid as much as possible. personnaly I test rigidity leaning on the top of the expanded tripod Carbon fiber or metal interfere on weight, rigidity, price (so does the name brand...) The combo I use since years is : -tripod Benro C-168M8 carbon fiber -head Gitzo GH2781T with a no name Arca clamp It has been fully reliable for a Nikon D3 with telephoto up to 300mm, so it manages easily the M10 ."}, {"autor": "Mark_Mono", "posts": "6 posts", "date": "05/16/2021 04:59  PM", "content": "Advertisement (gone after registration) Hi , I have an issue just -----> developed !!!  on my M10. I get black shading/vignettes on the top of the frame when taking images. This happens rather randomly, sometimes on single frames , sometimes during a sequence of shots and when using rapid shooting. It appears at different heights in the frame. I assume it's either the shutter or shutter curtain not operating correctly. Anyone else had this issue , any known causes / fixes apart from return to Leica ? Be great to hear some thoughts before I send camera off to Leica for 6 weeks !!! Thanks --img--  --img--  --img--  --img--  --img-- "}, {"autor": "Steven", "posts": "3,750 posts", "date": "01/24/2021 12:11  PM", "content": "3 minutes ago, feelssadman said: I think the worst weather mine has been in was a severe snowstorm. I hardly baby my cameras and don't see the point to do so if it isn't for a rare collection model. Anyways, the camera obviously got wet but it took no damage since I wiped it off afterwards and made sure to keep it under my coat while walking around. The M10 isn't as weather sealed as other cameras may be but if you take a bit of care you'll have no problems with that. Just make sure not to drop a bucket of water on it and you'll be fine 😉 --img--  This is my experience as well. you need to unlock the psychological limit that is -----> created !!!  by the fact that is not weather sealed on paper and that it costs so much money. Then, as long as you're not stupidly exposing it to the elements either, its a pretty rugged camera. My only advice is to not mount your most precious lens on a bad weather day. Again, I mount my 600 dollars Nokton on a rainy day. Not irreplaceable, and small enough to put the camera in my pocket between shots."}, {"autor": "BlackBarn", "posts": "625 posts", "date": "07/25/2020 08:40  PM", "content": "35 minutes ago, reniwqwil5 said: and have decided to up my skills and photography to leica cameras, specificly the leica m-body. I’m fairly certain it’s not the camera which ‘ups the skills’ unless you consider Leica may be a camera which encourages you to engage with photography more and therefore a catalyst for upping your skills. Cameras, regardless of make, can do that and in different ways. Assuming you have identified the skills you would like to -----> improve !!!  on I would suggest funding the education not the camera route first. If you feel the Leica must come first then possibly hire/borrow one to see if the expectations match. If it does....be patient....something should come along."}, {"autor": "adan", "posts": "10,775 posts", "date": "12/12/2020 10:41  PM", "content": "I never use soft releases. Used properly, the M shutter release - as -----> designed !!!  - is better than any add-on. What is \"used properly?\" Grip the camera with three fingers and the thumb of the right hand. Lay the index finger across the top of the camera so that that tip lies on the shutter dial, bent ~70° at the second finger joint. That finger will then \"bridge\" the shutter button and its protective bowl or bezel. The finger is now stabilized on four points - the shutter dial, both sides of the shutter button bezel, and the edge of the camera under the second knuckle. Then simply squeeze or flex that whole finger down (as farnz says, don't \"stab\" with a fingertip). The finger flesh will settle into the bowl, firing the shutter (and tightening your grip at the same time, just when you need it). Much more stable than balancing the finger or fingertip on a raised \"pinnacle\" (i.e. add-on button). Try it. --img-- "}, {"autor": "MikeMyers", "posts": "1,192 posts", "date": "12/13/2020 01:36  AM", "content": "2 hours ago, adan said: I never use soft releases. Used properly, the M shutter release - as -----> designed !!!  - is better than any add-on. What is \"used properly?\" Grip the camera with three fingers and the thumb of the right hand. Lay the index finger across the top of the camera so that that tip lies on the shutter dial, bent ~70° at the second finger joint. That finger will then \"bridge\" the shutter button and its protective bowl or bezel. The finger is now stabilized on four points - the shutter dial, both sides of the shutter button bezel, and the edge of the camera under the second knuckle. Then simply squeeze or flex that whole finger down (as farnz says, don't \"stab\" with a fingertip). The finger flesh will settle into the bowl, firing the shutter (and tightening your grip at the same time, just when you need it). Much more stable than balancing the finger or fingertip on a raised \"pinnacle\" (i.e. add-on button). Try it. --img--  This is the most amazing thing anyone has told me about how to use my Leica M. I looked at your photo, and my first impression was that it made no sense at all. It just looked all wrong to me. Then I picked up one of my cameras and tried it. Incredible - when I applied enough pressure to that part of my finger to release the shutter, the camera remained rock still! I tried it over and over - amazing! So for 50 years I've been doing this wrong. I had to slide my index finger just a little bit further over the shutter release - still need to practice. I need to make this a habit from now on. To me, it \"looks\" wrong, and it \"feels\" wrong, but there is no doubt about it - when the shutter is released, the camera didn't move, or at least not enough that I could see it. Until now, I used the ball of my finger outboard of the first joint. I thought the idea was to do that, rather than have my finger pointing down, and use my finger like a plunger. The photo on page 32 of the \"Leica M10 The Expanded Guide\" show what I've been doing until now. Question - how did you ever learn to do it the way you described?"}, {"autor": "Gelatino", "posts": "1,265 posts", "date": "01/11/2020 08:17  AM", "content": "Hi Brad, I personnally use both Thumbie AND grip on my M10 : belt and suspenders. With Thumbie you still may use EVF 020 as it is stuck so does not inactivates the hot shoe, and it is much cheaper than any other thumb rest. The grip gives a better handling, specially for M as left hand has to focus and set the aperture, so is less able to hold the camera. See how many cameras are -----> designed !!!  with a grip. The leica grip for the M10 is not heavy and adds only 5 mm to the body height . Three negative points for me are #1 as it is screwed, acces to battery and memory card are a bit less easy and fast #2 the screw pitch is deported on the side so when using a tripod the body is not centered. #3 not cheap though good quality. Before you ask where to get the Thumbie: barnet@globalnet.co.uk . Edited January 11, 2020 by Gelatino"}, {"autor": "Harvard Kiwi", "posts": "184 posts", "date": "05/14/2021 08:29  AM", "content": "The Leica half case helps -----> improve !!!  the grip a bit and helps protect half the body. The case doesn't provide easy access to the battery or sd card and also does not have a tripod screw mount if you need to do some long exposures. On the plus side, with the extra rear flap, it almost feels like I have an M10-D which is good for a chimp like me."}, {"autor": "CJJon", "posts": "118 posts", "date": "10/20/2017 12:43  PM", "content": "I just got my M10 and am looking for a case. Probably the Leica one. A question to those who own it... How does the LCD Monitor flap stay up without flopping down (magnets)? There seems to be a white strip to protect the screen. Please enlighten me.... Thanks! Magnets. They are on the bottom corners of the flap. There is a strip of felt along the top inside of the flap. I really like the case. I'm a left-eye shooter and it keeps the screen clean and protected. I hate stick-on screen protectors. Most people think it is a film camera since the screen isn't visible. It's the case I would have -----> designed !!! ."}, {"autor": "Tom1234", "posts": "351 posts", "date": "10/26/2020 08:49  AM", "content": "I am not trying to hurt anyones feelings on high resolution cameras. Also for those wanting an aesthetic of so called \"super realism\", also called \"American Realism\", an aesthetic which one book claimed was the only, or one of a very few, American -----> invented !!!  art forms - high resolution can be a key to this form. High resolution certainly has its place in Landscape photography and wide angle photography. Ansel Adam's technical books on how to use a large format camera are mostly devoted to \"how to get a sharp print\" i.e. high resolution. Am I being nice enough? Actually I really like the American Realism aesthetic which is a sort of \"still life\" with lots of detail."}, {"autor": "Steven", "posts": "3,750 posts", "date": "10/26/2020 10:13  AM", "content": "1 hour ago, Tom1234 said: I am not trying to hurt anyones feelings on high resolution cameras. Also for those wanting an aesthetic of so called \"super realism\", also called \"American Realism\", an aesthetic which one book claimed was the only, or one of a very few, American -----> invented !!!  art forms - high resolution can be a key to this form. High resolution certainly has its place in Landscape photography and wide angle photography. Ansel Adam's technical books on how to use a large format camera are mostly devoted to \"how to get a sharp print\" i.e. high resolution. Am I being nice enough? Actually I really like the American Realism aesthetic which is a sort of \"still life\" with lots of detail. So interesting.... This is one of my favourite thread I participated in in a long time.... cant wait to see where it goes...."}, {"autor": "tom.w.bn", "posts": "528 posts", "date": "10/26/2020 01:06  PM", "content": "vor 4 Stunden schrieb Tom1234: I am not trying to hurt anyones feelings on high resolution cameras. Also for those wanting an aesthetic of so called \"super realism\", also called \"American Realism\", an aesthetic which one book claimed was the only, or one of a very few, American -----> invented !!!  art forms - high resolution can be a key to this form. High resolution certainly has its place in Landscape photography and wide angle photography. Ansel Adam's technical books on how to use a large format camera are mostly devoted to \"how to get a sharp print\" i.e. high resolution. Am I being nice enough? Actually I really like the American Realism aesthetic which is a sort of \"still life\" with lots of detail. I'm sure, you can also create blurry and unsharp photos with an M10-R, not only with a 24MP camera."}, {"autor": "Steven", "posts": "3,750 posts", "date": "10/26/2020 01:10  PM", "content": "1 minute ago, tom.w.bn said: I'm sure, you can also -----> create !!!  blurry and unsharp photos with an M10-R, not only with a 24MP camera. I asked myself the same thing. I think the only true way would be to export the dng at a lower resolution. I’m sure that there is a software that lets you do that. It would be an extra step before importing to lr but give you the flexibility of cropping when needed and the advantages of the new sensor."}, {"autor": "MT0227", "posts": "1,133 posts", "date": "06/28/2018 05:57  PM", "content": "I agree....I use a simple wrist strap and split ring setup that has the least possible termination failure when connected to my Camera(s). Some of these strap designs don't seem like they are -----> engineered !!!  well at all, when you are connected by thin dental floss like string or a 5 cent screw determining if your $10k+ rig stays attached to the strap or drops to the ground like a rock. Hmmm I really like Peak design, and their Everyday backpack is the absolute best! I have the Slide strap, and the attachment method is genius . . but if (like me) you spend time holding your camera in your hand with the strap around your wrist, then the metal bits on the slide immediately bash into the camera body / LCD / lens front element etc. . . so for me, it's back to what I know, which is NO METAL BITS (on straps, jackets, etc.) best"}, {"autor": "jaapv", "posts": "66,415 posts", "date": "09/09/2020 02:53  PM", "content": "Only upgrade if you need to - what feature of the new camera would -----> improve !!!  your photography and what not? And if there should be any upgrade reason, is it worth the money?. Please bear in mind that more megapixels do not automatically lead to better images, in fact for most \"standard\" use even 24 MP is considerable overkill. Unless, of course you suffer from the monkey-genetic defect that we all have, and that is reaching for the next shiny fruit before we have eaten the present one. In photography it is called GAS..."}, {"autor": "jplomley", "posts": "3,344 posts", "date": "09/09/2020 05:47  PM", "content": "I see a big difference in print quality with the M10-R at 17x22/16x24 since I can now print at a native resolution of 360 ppi rather than the 240 ppi the 24 MP sensor limited me to and which always -----> creates !!!  artifacts. I’m able to shoot the M10-R handheld at 1/30th with my 35 FLE without any noteworthy repercussions. All of my lenses seem to perform better as well; these include the 21 SEM Asph, 28 Cron Asph v2, 35 Lux Asph FLE and 50 Lux ASPH. They all resolve beautifully and for reasons I can’t explain, images seem more life-like. Prints are very very close to MF quality. So for someone like myself that has standardized on 17x22/16x24 inch prints, I will never go back to 24 MP. The trade of my M10 to M10-R was worth every penny, and in fact I’m now eyeing the M10M as a result."}, {"autor": "adan", "posts": "10,775 posts", "date": "04/26/2021 04:15  AM", "content": "Ms used to scratch my glasses until about a year ago, when I got fed up and got new glasses with the serious scratch-resistant coating that costs more and takes longer. No scratches since then - although the timing was bad. The really good scratch-resistant coatings are more prone to fogging up (as I was warned at the time of purchase) - and have fogged like crazy while I've had to shoot wearing a Covid mask. But Covid will pass eventually - scratches won't. I've never really liked the idea of soft felt or rubber protection rings, though. I always image airborne sand, dust or other grit embedding itself in the soft material over time - and -----> creating !!!  a nice piece of ring-shaped sandpaper around the eyepiece."}, {"autor": "Tom1234", "posts": "351 posts", "date": "10/19/2020 09:14  PM", "content": "Of equal or greater concern is… if you send it in, will they fix it? I paid $800 to send in to Leica repair, a Tri-Elmar 28-35-50 to get the focal-length-shift-collar fixed, and they did not fix it, though it was -----> improved !!! , yet they did charge me. This is the second time this has happened since the same happened years ago with a Tele-Elmarit-M 90mm 2.8 M lens that I paid for CLA but it was not done - so I paid twice sending it to DAG who did clean it. And that 90mm 2.8 Tele-Elmart was refused by another repair place that would not CLA it saying it was too complex to take apart. But Don at DAG did clean it… he must have the magic hands... I sent an email to Leica Germany backing Leica USA as doing the best they could with repairs given their circumstances back when Leica went unprofitable and was appreciated for it when I called Leica USA for some other issue: too many blinking lights in the M7 display - I wanted to turn off the blinking when I purposely adjusted the ASA differently than was on the film can, but they could not stop the blinking, but they were willing to try other adjustments - THANK YOU LEICA USA. Nothing should bother the user when they look through the rangefinder especially blinking. The above is another reason I use DAG repair since he has an extremely high hit rate on fixes. Yet, I think that some Leica parts may be so complex that no one can fix them except the factory? I took apart an Old Leica Viso and the design of how many threads to turn a collar had to be exact for one of the parts to come off and also go back on - this is brilliant design or maybe too complex… the engineers have to make some judgement calls on just how much design complexity makes sense. Regardless of the above comments - an expensive camera should be repairable to maintain its value… we should not be paying these prices, new or used, for a use-&-discard or unrepairable piece of equipment. I am NOT calling Leica a use-&-discard-when-old camera or unrepairable… just commenting that in these trying economic times obviously all the camera companies are having a repair problem as internet comments show. I should say that I have had probably 15 Leica M lenses CLA'd with no problems and they replaced my M9 sensor for free. So there is much integrity in their repairs except maybe for some rather extreme situations. Is there a repair \"appeal\" system at Leica - someone to talk/email to? Edited October 19, 2020 by Tom1234 additions"}, {"autor": "Tom1234", "posts": "351 posts", "date": "04/14/2021 05:40  AM", "content": "On 10/19/2020 at 5:14 PM, Tom1234 said: Of equal or greater concern is… if you send it in, will they fix it? I paid $800 to send in to Leica repair, a Tri-Elmar 28-35-50 to get the focal-length-shift-collar fixed, and they did not fix it, though it was -----> improved !!! , yet they did charge me. Correction: I paid $300 for repairs which were insufficient. Then sold the lens loosing about $800 down from what I paid for it. A $1,100 loss total. Most Leica lenses do not go this way they are better made. The Tele-Elmarit 90mm 2.8 is another lens which one repair shop would not CLA, another charged me but did not clean it, finally DAG CLA'd it correctly."}, {"autor": "Kiran", "posts": "9 posts", "date": "04/18/2021 09:15  PM", "content": "Advertisement (gone after registration) Hi Looking to buy an M10, i'm new to Leica and rangefinders so i'm asking potentially dumb questions 🙂 1) Does anyone know the wake time from sleep on the M10(r), i've googled but can only find some scant info about the M240, some are saying it's around 3 seconds. Has this been -----> improved !!!  on the M10(r)? 2) With regards to the viewfinder framelines, are these automatically set when a lens is mounted and can it accidentally be changed by knocking the lever under the viewfinder (I assume that's what it's for) Thanks for any help, i'll post more dumb questions as I think of them 🙂 Kiran"}, {"autor": "Keith_W", "posts": "344 posts", "date": "08/09/2017 07:40  AM", "content": "I bought the following accessories for my M10: Leica thumb grip #24015 I tried this on in the camera store and really liked the feel. The downside (as all the reviews will tell you), is that it covers the camera hotshoe. Leica M10 Hand Grip #24019 Combined with the thumb grip, the hand grip really makes your camera feel more secure. The downsides are - this grip screws into your tripod hole (it has a spare tripod hole to the side), so it decenters your tripod hole. Because it uses a thumb wheel, it is only slightly more finicky to get off than your standard bottom plate. The other downside is that it adds weight to your camera. Leica M10 Holster #24016 I am quite finicky when it comes to camera straps. What I want the most is a broad strap so that it puts less stress on my shoulders when I carry the camera. The holster holds the camera close to your body, and it won't swing around so much when you are moving (unlike a neck strap). It could be -----> improved !!!  if they included an addition waist strap to really hold the camera tight. The fit to the camera is snug, rather than tight - I would say it is perfect. Not so tight that removing the camera is difficult, but not so loose that the camera will fall out either. Also, buying a holster means that you can avoid two purchases - you do not need a half case, and you do not need a neck strap. If there were accessories that attached to the holster (e.g. spare pockets for CF cards and batteries), you might even get away with not carrying a bag. Leica Wrist Strap #18783 This is the only accessory I do not recommend. I needed a wrist strap to hold my camera secure (since I am using a holster), but this one is too thin and not comfortable. I will be replacing it with something else."}, {"autor": "Shu_downunder", "posts": "154 posts", "date": "04/07/2021 11:03  AM", "content": "2 hours ago, Cobram said: RF is a delicate piece of mechanics. I have an illusion that the higher a camera’s mechanical-part to electrical-part ratio, the more durable it is. And if it’s -----> designed !!!  properly, it will be tough. I was anticipating that M10 is such a thing, at least to a degree. Edited April 7 by Shu_downunder"}, {"autor": "Rob L", "posts": "258 posts", "date": "02/20/2021 02:11  PM", "content": "Maybe their skill level has slipped since M240? I've had - 2 New M6s in 94/95 - both good as far as I knew back then, unused M6 .85 2014 - good, New MP in 2014, vertical off. Needed top plate removal to adjust because M6 style special tool does not fit through the screw hole (terrible design!), New M-P 240 - good, New MD-262 - way off, 2 -New M10s in 2017 - Both off, M10R 2020 off, M10M 2020 - good. 5 good, 5 off. I'm probably pickier than most. Many people focus on vertical elements and never even notice. I have very good luck with gear and don't -----> create !!!  these kinds of issues. I have 10 Leica M lenses, none have needed service and all of them have appropriate damping on apertures and focus rings, except my Summarit 50 which focuses very light. My 35 Lux doesn't rattle, my 28 Summicron hasn't fallen apart...All focus accurately and match one another closely on all off my bodies! Edited February 20 by Rob L"}, {"autor": "gettons", "posts": "61 posts", "date": "09/05/2020 11:07  AM", "content": "1 hour ago, scott kirkpatrick said: I've used an M10-D since 2018. It minimizes your impact on the people around you, since it looks a lot like an M6 or 7. Of course that factor depends even more on you, but I live in a country where some people object to being captured in a photo, and not being able to stop for inspection comes in handy. Purchased new from existing unsold stock won't save any money, but they may be available used from time to time. Inside the camera, it's an M10-P with the quiet shutter. Thank you Scott! The workflow with an m10-D appears very similar to analog to some extent. And because I have an m6 and -----> develop !!!  at home, that specific side things are not super attractive to me (because essentially I can do with the film camera). However the discreetness and the lack of lcd display it’s something I like. At the end of the day I have a film camera, and the idea of having a modern one with lcd also does not seem like a bad idea in case I need to frame at very weird angles. And this is where the m10-p comes into play. I am only wondering if I go for the m10-p, is it going to be easy to resell one day if I need to (provided the m10-r is almost the same price)? Who should go for a new m10-p as opposed to a new m10-r these days? Cause I am sure there is people who prefers a brand new m10-p even at the same price tag (which is not exactly the same here in the UK though, there is a £600 difference)."}, {"autor": "250swb", "posts": "9,965 posts", "date": "09/05/2020 12:04  PM", "content": "51 minutes ago, gettons said: Thank you Scott! The workflow with an m10-D appears very similar to analog to some extent. And because I have an m6 and -----> develop !!!  at home, that specific side things are not super attractive to me (because essentially I can do with the film camera). However the discreetness and the lack of lcd display it’s something I like. At the end of the day I have a film camera, and the idea of having a modern one with lcd also does not seem like a bad idea in case I need to frame at very weird angles. And this is where the m10-p comes into play. I am only wondering if I go for the m10-p, is it going to be easy to resell one day if I need to (provided the m10-r is almost the same price)? Who should go for a new m10-p as opposed to a new m10-r these days? Cause I am sure there is people who prefers a brand new m10-p even at the same price tag (which is not exactly the same here in the UK though, there is a £600 difference). If you are doing landscape and want to get the best out of any camera you'll sometimes use a tripod and an LCD is invaluable if you are stood waiting for the light to change. It will also allow you to compose the picture accurately. But are you sure you can't still get an M10 and forget the 'P', after all a roll of black tape is much cheaper than paying so much more for cosmetic differences?"}, {"autor": "Michael Geschlecht", "posts": "9,884 posts", "date": "03/22/2021 12:27  AM", "content": "Hello Again Wallflower, I wasn't saying that you can treat your camera/lens roughly. Keep in mind that I was reasonably lucky with the outcome of what happened. The idea that I was trying to convey was that you should treat your camera/lens respectfully & try your best to protect them & try to not have them in situations of possible adverse circumstance or circumstances. I would think that a camera repeatedly bouncing into a person is NOT an optimal situation. Please remember: It is not necessary to purposefully -----> create !!!  adverse circumstance for your camera/lens & thereby add to the possibility for damage when Life itself will quite likely provide a number of opportunities for adverse outcomes for you. When you lessen the opportunities for adverse possibilities you simply keep the chances of having a nicely working camera/lens more on your side. Best Regards, Michael Edited March 22 by Michael Geschlecht"}, {"autor": "wolan", "posts": "275 posts", "date": "03/14/2021 07:59  AM", "content": "Well, it is highly unlikely that CaptureOne will -----> develop !!!  support for LR perspective control any time soon, as they have their own technology for this. It would be easier for Leica to crop the file directly in camera as they do with the JPEG. But I probably it is part of the agreement with Adobe that they do not allow this... Cheers"}, {"autor": "adan", "posts": "10,775 posts", "date": "12/24/2017 10:25  AM", "content": "Wide-angle rangefinder lenses -----> designed !!!  for film do not play well with full-color digital sensors. They need in-camera corrections applied to the picture files to remove the purple corners. This is why Leica has provided \"6-bit\" coding marks on their own lenses since 2006, and offers upgrades to add the coding to some older lenses, back to about 1980. So that the digital cameras will know what focal length you are using, and can then correct for the specific pattern of purple corners (which varies from lens type to lens type). The problem is called \"Italian Flag syndrome\" because in many cases the color shifts are red/purple on one side, and greenish on the other side. Note that SOME older wide-angles are very difficult to correct for. The Leica 21mm Super-Angulon f/3.4-f/4 lenses from the 1960s always produce strong purple corners, as does the Voigtlander 15mm from 1997 and the Zeiss 15mm Hologon from the 1960s. They are simply incompatible with color digital image sensors. http://www.kenrockwell.com/leica/images/m9/examples/21mm-f4/L1001261-21mm-f4.jpg Leica does not offer corrections -----> designed !!!  specifically for lenses made by someone else: Minolta, Zeiss, Voigtlander, Canon or Nikon LTM, etc. But sometimes a correction for a Leica lens will produce \"pretty good\" results with those lenses. As a first try at fixing this problem: with your Minolta lens mounted, open your M10's Main menu and go to the very first menu item: \"Lens Detection.\" Go into that menu item, and select \"Manual M\" and you will see a long list of LEICA M lenses. Scroll through the list to find \"21mm f/2.8 11134\" - this setting provides the strongest purple-removal in the corners, which your lens will likely need - even though it is just a 28mm lens. Press the \"Info\" button on the camera to set that as the active lens correction. This is the M typ 240 lens menu - the M10 menu is identical except for the background color: http://www.waloszek.de/m240/lens_list_manual/DSC06080_600.jpg Then take some pictures and see if the purple corners have been eliminated adequately. If you find the corners are now too green, you can try a milder correction from the same menu - perhaps the setting for \"28 f/2.8 11804.\" For solving this problem, the actual focal length chosen is not important - what you need is the correct pattern of purple removal, and since you lens is not from Leica originally, that may be a correction for a Leica 21 or 24 or 28, or even something else. Experimentation is free, and you will not damage anything by trying any or all of the settings. If you want deeper technical details about why this occurs with small wideangle rangefinder lenses on Leica digital cameras, we can give you that. The very short explanation is, the shallow body of Leica M cameras compared to SLRs, and how close these small lenses like your Minolta come to the sensor, and the shallow angle of incidence with which their light rays hit the sensor in the far corners. Combined with the \"checkerboard\" of microscopic color filters (Bayer pattern) that allow digital sensors to see in color. Edited December 24, 2017 by adan"}, {"autor": "adan", "posts": "10,775 posts", "date": "12/25/2017 06:20  AM", "content": "Let us start with film emulsion. It is a flat, thin, homogenous layer of light-sensitive silver compounds evenly distributed and suspended in translucent gelatin, smoothly coated on a base material (usually plastic) for strength. In modern (post-1935) color film there are three stacked layers for the three primary colors to be recorded (red, green, blue). It has a very simple and unorganized structure, relatively speaking. Any square micron of the emulsion is effectively identical to any other square micron. It is equally sensitive to light coming from any direction (except perhaps the back --img--  ), at any angle. Therefore, in the 150 years or so that camera lenses were -----> designed !!!  with film (or a coated glass plate) as the expected \"target\" for their projected light rays, little attention was paid to the imaging surface. It did not have any \"special needs\" to be considered ,and was assumed to simply respond as intended to any image projected on it. At least for general-purpose photography - special films and special lenses for technical or scientific work may have paid more precise attention to details. Next let us look at how the 28mm G-Rokkor or other compact short-focus lenses for Leica-type camera bodies work. One advantage of the Leica and other rangefinder cameras (and, of course, the recent \"mirrorless\" cameras) is that there is nothing inside the camera between the lens and the film except about 3mm of \"shutter curtains.\" (Unlike SLRs, which need about 40-45mm of space between the lens and shutter for the reflex mirror to flip up and down). Leica cameras and the lenses for them standardize on about 28mm between the lens mount and the film, with the lenses often protruding even deeper into the camera than the mount (as your 28mm G-Rokkor does): http://www.9days.hk/uploads/product/13F047_03.jpg But what really matters is that your lens and similar 28mm lenses capture a view of the world that is 65° wide across the long dimension of a 24x36 negative or sensor. And in designs for the Leica, the lenses are relatively symmetrical, so that the light coming out of the lens at the back to hit the film also covers a total angle of about 65°. At each end of a horizontal picture, the light from the edges of your subject area is thus hitting the film (or sensor) at an angle of about 32.5° from the vertical - the \"angle of incidence.\" http://mathworld.wolfram.com/images/eps-gif/AngleOfIncidence_800.gif Light passing straight through the lens from the center of the subject to the center of the film or sensor has an angle of incidence of zero. As we mentioned, film is relatively insensitive to the incoming angle of light rays, so lens designers knew that almost any angle of incidence would work. Unlike film, digital sensors have a very complex and non-homogenous 3D microscopic structure of silicon, glass, colored filters, etc. If one thinks of film as a smooth meadow, a digital sensor is like an inner city, divided up into blocks of tall buildings (on a microscopic scale). The net result is that digital sensors are far more \"sensitive\" than film to angle of incidence, and thus misbehave with lenses with a large angle of incidence at the picture edges/corners, that worked perfectly well on film. On the whole, current digital sensors work best when the angle of incidence is closer to zero. Horizontally, sensors are divided up into squares - the pixels - each with different color filtering, the Bayer pattern or Bayer filter array. One key point suspected in the \"Italian Flag\" problem is that the Bayer filter pattern is not symmetrical - the blue pixels are always biased to one side while the red pixels are biased to the other side, no matter how you turn the pattern: https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Bayer_pattern.svg/2000px-Bayer_pattern.svg.png Vertically, sensors are divided up into several layers, and most importantly, the imaging areas of the silicon (D and E) are not flat and homogenous, but deep \"wells\" divided by solid-state circuitry. Additionally important to the purple-corner problem is the existence of microlenses (F) capping each pixel, to refocus light down into the \"wells\". http://keyassets.timeincuk.net/inspirewp/live/wp-content/uploads/sites/13/2010/08/Sensors1.jpg This diagram demonstrates one current idea about what may cause the purple-corners or Italian-flag effects - leakage and/or reflection of light already filtered for one color (in this case green) into a neighboring pixel programmed to measure a different color (in this case blue). Due to the gaps between the vertical layers, the vertical structures, and the angle at which the incoming light hits the microlenses or the underlying silicon. And resulting in excess blue signal on one side of the picture, and (due to the bias of the Bayer pattern) excess red signal on the opposite side of the picture. http://www.extremetech.com/wp-content/uploads/2013/03/Wiring-diagram-for-a-typical-front-illuminated-sensor.gif Here are some real-world photomicrographs of an image sensor that may help clarify what the schematics above are showing, especially the 3D \"wiring\" etched into the silicon: https://petapixel.com/2013/02/12/what-a-dslrs-cmos-sensor-looks-like-under-a-microscope/ You may ask why Sony and other mirrorless cameras and lenses do not have as much problem as Leica's lenses. And the answer is, Sony and Fuji and Olympus have -----> designed !!!  their mirrorless-system lenses specifically for digital sensors right from the beginning, with optics that reduce the angles of incidence. Your G-Rokkor and my 1981 21mm Elmarit-M were not -----> designed !!!  for use with digital sensors (although fortunately Leica goes to some lengths to achieve significant backwards compatability through their camera corrections. At least for their own lenses, and coincidentally, sometimes for others') Edited December 25, 2017 by adan"}, {"autor": "adan", "posts": "10,775 posts", "date": "12/25/2017 06:36  PM", "content": "A brief follow-up on \"lenses -----> designed !!!  for digital.\" Here is a diagram of a 8mm-30mm zoom lens -----> designed !!!  for a (small) digital sensor, as in a Leica C or D-Lux P&S (or similar cameras from Nikon, Canon etc.). Note the path of the edge or corner light rays (blue) at the wide-angle focal length (8mm, bottom). That path is NOT symmetrical - the light from the subject comes in at a wide angle (~35° from each side), but after passing through the lens, exits the lens and strikes the sensor at an angle of incidence of less than 10°, unlike our old film-era rangefinder wide-angles. This is called a \"telecentric\" lens design. https://image.slidesharecdn.com/azoomlensdesignmethodjuly32013-131211180539-phpapp02/95/a-zoom-lens-design-method-july-3-2013-10-638.jpg?cb=1386786948 I can't find a ray-tracing diagram for the Leica Vario-Elmarit-SL 24-90 lens - but I am sure that that lens, -----> designed !!!  in the digital era, behaves the same way, and thus even at 24mm, and on the same sensor size, does not produce the purple edges of old film 28/21 lenses on M cameras. Could Leica design new \"telecentric\" lenses for the Leica M digitals? Certainly. But one characteristic of telecentric lenses is that they are generally very large relative to the size of the image area. The Vario-Elmarit 24-90 is larger and heavier than the SL camera itself. That would run contrary to the whole point of the M cameras. It is probable that the Leica-M 21 and 24 Summilux f/1.4 lenses, -----> designed !!!  in the digital era, and already large due to the aperture and angle of view, have some telecentricity -----> designed !!!  into them. SLR camera makers got lucky when it came to digital. Their wide-angle film lenses, even those -----> designed !!!  decades before digital sensors existed, already come with a certain amount of telecentricity built in. Because, to clear the swinging mirror, those lenses needed asymmetrical retrofocus designs (back focus distance substantially longer than the nominal focal length). Note the difference in angle of incidence (b ) delivered by a retrofocus wide-angle (top) and a shorter, more symmetrical wide-angle (bottom) - I'm guessing this compares the Zeiss Distagon 21mm for Contax SLRs, and the Zeiss G-Biogon 21mm for the Contax G1/G2 \"AF rangefinder\" cameras: http://pic.enorth.com.cn/0/03/48/96/3489683_304673.gif Mount a Leica R (or other SLR) 15/19/21/24/28/35 on the M10, and even without coding or menu identification, they will likely avoid any purple corners. The one SLR exception is tilt-shift lenses, where by dialing the lens off-center for perspective or DOF control, the angle of incidence may get very large in one direction or another - that will sometimes cause purple corners or Italian Flag color distortions even with SLR cameras. https://c4.staticflickr.com/3/2740/4278462691_ac24130c05_z.jpg Phase One's Capture One Pro program has a module for LCC (lens cast correction) that builds profiles of purple-corner problems due to off-center T/S lenses, and corrects for them https://i2.wp.com/blog.phaseone.com/wp-content/uploads/Tip902-Img7-full.jpg?ssl=1 Edited December 25, 2017 by adan"}, {"autor": "KFo", "posts": "204 posts", "date": "02/19/2020 04:56  PM", "content": "Advertisement (gone after registration) I’m wondering if any of you have heard anything about a shutter button failures on M10P. For a while I’d noticed that when shooting vertically it seemed that the shutter release didn’t always function. I wasn’t completely sure about it though: it has been a very rare occurrence and always caught me in the middle of something. Yesterday it happened with the camera held normally in the horizontal and I had the opportunity to observe that pressing the shutter release multiple times produced no action. This seems like a fundamental and what should be a well proven/-----> developed !!!  button. Any word of this happening out there? I did a search here and didn’t see any mentions. Thanks!"}, {"autor": "Stevejack", "posts": "79 posts", "date": "03/10/2021 05:15  AM", "content": "Advertisement (gone after registration) Hi all, I am running into some issues with what I assume is user error when -----> creating !!!  a camera profile for my M10-R using the x-rite colorchecker passport and Colorchecker camera calibration software on mac OSX (catalina). I notice the issue mainly in highlights - like the sun in the frame at sunset, or the bulb of a bright light. When I apply the xrite profile, I notice that highlights are crushed, like the data is clipped... switching to adobe standard (or any of the adobe profiles) the highlights look fine again. I want to create outdoor profiles so I am shooting the target in both shade and sunlight, mid afternoon light - representative of how and when I usually shoot. I have tried a few things, and followed video guides on how to make sure the target images are exposed correctly, including black level adjustment. No matter how I try it, the issue remains. As far as I can see, my export settings are all correct, colourspaces etc... I can't really see where I'm going wrong. Latest version of all software. Is there a good video guide that runs through all the steps to create a profile? (how to position the colorchecker passport when taking the photo, how to prepare the file when it arrives lightroom, which settings to select, and then sending it across to the xrite software and -----> creating !!!  the profile? I just want to re-do it all and make sure I'm getting it right."}, {"autor": "Jeff S", "posts": "18,651 posts", "date": "03/11/2021 12:37  AM", "content": "19 hours ago, Stevejack said: Hi all, I am running into some issues with what I assume is user error when -----> creating !!!  a camera profile for my M10-R using the x-rite colorchecker passport and Colorchecker camera calibration software on mac OSX (catalina). I notice the issue mainly in highlights - like the sun in the frame at sunset, or the bulb of a bright light. When I apply the xrite profile, I notice that highlights are crushed, like the data is clipped... switching to adobe standard (or any of the adobe profiles) the highlights look fine again. I want to create outdoor profiles so I am shooting the target in both shade and sunlight, mid afternoon light - representative of how and when I usually shoot. I have tried a few things, and followed video guides on how to make sure the target images are exposed correctly, including black level adjustment. No matter how I try it, the issue remains. As far as I can see, my export settings are all correct, colourspaces etc... I can't really see where I'm going wrong. Latest version of all software. Is there a good video guide that runs through all the steps to create a profile? (how to position the colorchecker passport when taking the photo, how to prepare the file when it arrives lightroom, which settings to select, and then sending it across to the xrite software and -----> creating !!!  the profile? I just want to re-do it all and make sure I'm getting it right. Have you exposed properly for your color patch export? Jeff"}, {"autor": "Stevejack", "posts": "79 posts", "date": "03/11/2021 02:44  AM", "content": "2 hours ago, Jeff S said: Have you exposed properly for your color patch export? Jeff Thanks Jeff, yes I have followed the steps exactly (using several other guides, as well as the one you linked) and I've re-done the profiles several times with the same results. The issue only seems to appear on these specular highlights, otherwise the image colour correction looks pretty good. I could understand if the xrite profiles just can't account for this situation (shooting straight into the sun), but I wouldn't think that posterization would appear unless there was something very wrong with the profiles the software was -----> creating !!! . I should add that it happens whenever I apply any of the custom xrite profiles (direct sunlight, shade, etc). It really has me stumped."}, {"autor": "Boojay", "posts": "1,946 posts", "date": "03/10/2021 08:37  AM", "content": "I'd be interested to see what would happen if you swapped the lenses and the settings🙂. That might narrow things down. Same day, time, weather conditions? Also wondering about the lenses, what version of the Summicron. I only ask that as I have an old 90 2.8 TE that when used on the 10R, if I pixel peep, can disappoint, maybe a CLA would -----> improve !!!  things, maybe not. Like you, pretty fed up of same old walking routes with nothing new to shoot."}, {"autor": "colonel", "posts": "4,402 posts", "date": "02/24/2021 11:31  AM", "content": "2 minutes ago, Nowhereman said: That makes sense to me, though I must say that I'd be interested in an M11 with 24 MP, if it took the path of the SL2-S. Not for video, but for dealing with highlights. I'm thinking about the degree to which one has to underexpose with the M10 when shooting into the light or with strong sidelight, sometimes as much as 2 stops. It seems to me that, compared to the M10-R for example, the overall the dynamic range of the M10 is the same, or even a smidgeon greater; but the distribution of the DR is weighted more to shadows than to highlights. That is, I believe, what makes people say that the DR of the M10-R \"better\". In other words, I would prefer if Leica had applied a different, flatter, contrast curve to the M10 DNGs — possibly that could be done in a firmware upgrade, although highly unlikely. But in a new M11, I would expect this issue would be solved and could make the highlight treatment more like shooting negative film. Until then, I think the M10 is great. _______________________Frog Leaping photobook The point is whether to freeze one line at 24mp but -----> improve !!!  DR, colour depth, ISO, etc. I think this is sensible. Faster speeds are needed with higher resolution to keep pixel level sharpness. If you loose this at 41mp, you might as well have had 24mp. I would support the \"lower\" res version creeping up over the years, e.g. 30mp, 35mp, etc. as this will fit in with sensor tech and computer speed evolution anyway. This would allow the R model to not have to do multiple jobs and jump to 60 or higher"}, {"autor": "scott kirkpatrick", "posts": "7,201 posts", "date": "01/29/2021 07:16  PM", "content": "26 minutes ago, erudolph said: The firmware update installation instructions has this info: Displaying the auxiliary frame: Select the function “Upright” > “With Auxiliary Lines” to display the cropping frame calculated by the camera. Deactivate that function via “Upright” > “Off” if a correction is not desired. Automatic display of the corrected version: The relevant presets for handling images in RAW file format must be configured if you want Lightroom or Photoshop Camera RAW to display the images with the results of Perspective Control when a file is opened. https://helpx.adobe.com/en/photoshop/kb/acr-raw-defaults.html Select>“Camera Settings” as the RAW default setting However, the Upright function in the current version of Lightroom Classic 10.1.1 doesn't have the \"With Auxiliary Lines\" option, and so, after importing into LR Classic 10.1.1, the file reverts to its uncorrected state. I participated in testing a beta version of what is now the official Perspective Correction. I think the text in the updated instructions was -----> developed !!!  at that time (but there may have been updates). We could only make the corrections happen at that point in ACR/photoshop. but not in LightRoom. So please indicate what works as described in the various versions of LR that are currently in use -- Classic, CC, etc. I think it will be helpful. By the end of the beta session, we were all still learning how to use the results. But we liked the new feature. Also, I think seeing the scene with the PC frame floating in front of you (on the VF020 especially) changes the feeling of shooting with a wide angle lens. I am looking forward to hearing how others react to this new way of viewing."}, {"autor": "erudolph", "posts": "628 posts", "date": "01/29/2021 07:36  PM", "content": "19 minutes ago, scott kirkpatrick said: I participated in testing a beta version of what is now the official Perspective Correction. I think the text in the updated instructions was -----> developed !!!  at that time (but there may have been updates). We could only make the corrections happen at that point in ACR/photoshop. but not in LightRoom. So please indicate what works as described in the various versions of LR that are currently in use -- Classic, CC, etc. I think it will be helpful. By the end of the beta session, we were all still learning how to use the results. But we liked the new feature. Also, I think seeing the scene with the PC frame floating in front of you (on the VF020 especially) changes the feeling of shooting with a wide angle lens. I am looking forward to hearing how others react to this new way of viewing. Thanks for this Scott! I've tried opening a Perspective Controlled dng in ACR (with import preference set to Camera Settings rather than Adobe Default) and there is no option in the Guided portion except to \"draw 2 or more lines.\" Operationally, I found the perspective controlled frame in the viewfinder to be useful. Edited January 29 by erudolph"}, {"autor": "earleygallery", "posts": "19,047 posts", "date": "12/27/2020 10:14  PM", "content": "This subject has been discussed many many times. I'm never going to be in the market for a new M camera but FWIW if you deviate too much from what it is, it will not longer be the same. That's no reason not to -----> develop !!!  a new system however, but it won't ever be an M system if only for technical reasons. As others have said if you want AF and EVF in a full frame Leica, then get the SL."}, {"autor": "Doc748", "posts": "10 posts", "date": "02/22/2021 06:24  PM", "content": "keptstein, my recently acquired M10-R -----> developed !!!  this problem as well. It wouldn't fire unless you exert enourmous force on shutter. Josh, at Leica Store Miami, asked me to bring it to the store to take a look at it. Bottom line, mine had a loose part on the shutter (I am not a technical person on this topic). He tightened it and now it works like a charm. You may want to contact Josh at the store and ask him to walk you through this process. It may be the same problem as yours. Javier"}, {"autor": "kepstein", "posts": "69 posts", "date": "02/23/2021 11:13  PM", "content": "On 2/22/2021 at 1:24 PM, Doc748 said: keptstein, my recently acquired M10-R -----> developed !!!  this problem as well. It wouldn't fire unless you exert enourmous force on shutter. Josh, at Leica Store Miami, asked me to bring it to the store to take a look at it. Bottom line, mine had a loose part on the shutter (I am not a technical person on this topic). He tightened it and now it works like a charm. You may want to contact Josh at the store and ask him to walk you through this process. It may be the same problem as yours. Javier Thanks for the advice, I will give Josh a call."}, {"autor": "dancook", "posts": "1,545 posts", "date": "02/21/2021 04:08  PM", "content": "39 minutes ago, T25UFO said: Did you keep the Hasselblad? If so, do you really need the M10R? I thought I had persuaded you to go with the Q2M over the M10M 🙂. I have both and still prefer the M but it’s a close run thing and there are times when auto focus means I get the shot. Doubt you’ll find a Q2M used so that’s £5,000 of your budget on a new one. At least you’ll get another three months of free Adobe use! What about the new f1.2 Noctilux? A really interesting lens, which should hold its value if you don’t like it and decide to sell. There goes another £6,500 leaving £8,500 to spend on a used M10P and some more glass. I still have my 907X 80mm 1.9 and 45p - but I did put them on ebay this morning, but not in a rush to sell. there was a Q2M used for £4250 and I just watched it pass by... should have jumped on it I -----> developed !!!  a used camera/lens database of UK retailers which updates daily - so I have a good chance to spot something in the used market. I will take a look at the new 50mm 1.2, not sure about holding it's value new though! (EDIT oh i see it's limited edition run..but it's also silver, wanted to go all black :)) Edited February 21 by dancook"}, {"autor": "Boojay", "posts": "1,946 posts", "date": "02/15/2021 01:30  PM", "content": "I think you named the best option, to my mind anyway, the CL and an M make nice companions. Not to say that I haven't tried adapting M lenses to other brands along the way(Fuji, Sony, Canon) but I think using M lenses on the APS-C CL is enough of a difference to keep it interesting, and to me more likely to get better IQ by sticking with Leica, less compromises, and -----> designed !!!  for doing just that."}, {"autor": "Marckyokay", "posts": "111 posts", "date": "02/17/2021 01:56  PM", "content": "On 2/15/2021 at 2:30 PM, Boojay said: I think you named the best option, to my mind anyway, the CL and an M make nice companions. Not to say that I haven't tried adapting M lenses to other brands along the way(Fuji, Sony, Canon) but I think using M lenses on the APS-C CL is enough of a difference to keep it interesting, and to me more likely to get better IQ by sticking with Leica, less compromises, and -----> designed !!!  for doing just that. I agree with that. A Leica CL is a really cool companion to the M10... And I love shooting with the CL and M lenses for completely different reasons than I love the M10. - Is the camera just a secondary thing and hangs around your shoulder? CL is lighter and less expensive so I feel less protective about it (with Elmarit 28). So it's not just a backup, it can have it's purpose depending on the intent before leaving home. - Focal lengths/ compositioning (lack of better words) change with the 1,5x crop and it stays fun and interesting. - Feeling of the CL in your hand is sooo much better than other brands (my opinion), I feel right at home with the menu and I like the first page, this information screen like the SL much more than the M10 version. - Focussing with M lenses I think works really well since I have punch-in on the right dial and it became second nature to compose, rotate the dial (needs the official LEICA adapter, no third party one!), watch for the peaking, recompose, shoot. I just really like it... would recommend it. Edited February 17 by Marckyokay"}, {"autor": "MikeMyers", "posts": "1,192 posts", "date": "11/25/2020 05:10  AM", "content": "Thanks, David. I read about it in my book \"LEICA M10 - THE EXPANDED GUIDE\". I'll check the user's manual also, but I suspect they will be the same. I took the test photo, and there is dust, but not very much. I was only aware of one speck until my friend took one of my images and -----> created !!!  the image I just posted in my original post here. Using the blower method doesn't worry me too much, but if it comes to cleaning solutions, \"timid\" would be an understatement. I do have a local Leica dealer in Miami, but I'm not going anywhere until the virus is under control, or I get vaccinated. It's good that Leica has this sensor cleaning test built-in - I suspect I'll quickly find out when it is clean enough."}, {"autor": "farnz", "posts": "25,167 posts", "date": "08/18/2018 12:15  AM", "content": "It also feels awful. Terrible lack of tactile feedback. It's identical to the bayonet release for some reason (seriously Leica?) but with less travel. I found it hard to locate with my finger so I purchased some tiny, clear, plastic, self-adhesive \"bumpons\" and stuck one to the button. Problem solved, the bumpon* isn't noticeable, and you get about 50 of them for pennies so they cost nothing to replace if they fall off, which they rarely do. *I believe that bumpons are -----> designed !!!  to be stuck to teh bottoms of ornament so they don't mark polished wooden surfaces. Pete. Edited August 18, 2018 by farnz"}, {"autor": "LocalHero1953", "posts": "8,872 posts", "date": "09/12/2020 06:57  AM", "content": "Leaving aside the question of IBIS, there are always trade-offs in -----> designing !!!  a camera this small. Sony gains practical, usable space over the Lumix and M by having a fatter body, and by making the EVF stick out the back. Leica cannot to do that while keeping the traditional M 'no-bumps' form factor, but I guess might sacrifice a bit of the CL design to make a full-frame equivalent: a battery grip and a fatter body would be acceptable, though I don't like protruding eyepieces (they catch on things). Given the constraints, Sony looks like it's done a good job in the shape. Still too many buttons, though, and I wonder how it manages with battery life and heat management."}, {"autor": "martinot", "posts": "303 posts", "date": "09/15/2020 08:36  AM", "content": "Totally agree with a lot of what you and others reflect on. Sony makes fantastic technological innovations, both with their camera division and not least their fantastic sensor company (I personally a big fan of the Sony sensors, I think they are outstanding, and the absolutely best on the market). Today they also have some really great lenses (even if far from all) that I really like. But I as a photographer I am not at all compatible with their cameras. I have seriously tried them many times, and have been close to buying some. But even if I have tried the hardest to like them, they have never felt right or connected with me. This might possibly be unfair, and it is perhaps a personal feeling, but it is like the cameras where -----> designed !!!  by software engineers to be like computers, not to be used as photographic tools. Despite their fantastic specs/tech, I am sorry to say (no offense to you or other Sony users) that they are my least favorite cameras. But this is a very personal feeling, and highly subjective (I am fully aware of that). Edited September 15, 2020 by martinot"}, {"autor": "jaapv", "posts": "66,415 posts", "date": "10/07/2020 06:07  AM", "content": "5 hours ago, mirekti said: So what do you do when you have a scene like this and you don't want to recompose? If I remember well the sky wasn't white. --img--  The same as photographers have been doing for ages: use fill-flash Even if a 16 stop camera had managed to capture the detail in the sky (was there any? I doubt it), the result would have been out of the range of the paper you would be printing it on, making for a flat result or one with loss of tonal range. Nor would you have been. able to display it properly on your monitor. Even HDR displays, as used in gaming and video production, cannot get 16 stops on screen without compressing the DR. But I am sure that using mild HDR techniques in postprocessing could have -----> improved !!!  the tones of this image. Quite hard to judge with the big black blob, though, as the main subject determines the quality of the image. As it is, the moment that cameras matched negative film, as they do now, the need for more DR became just for making exposure less critical, nothing more. Not to mention slide film. As an example: here is an image where the camera managed to capture both the detail in the midday Mozambique sun in the background and in the deep shadows of the kitchen. Th 13 stops or so of the CL were sufficient. But the need to compress the range to something you can see on your monitor pushed the image to the verge of a HDR look. More DR in the camera wouldn't have helped. --img-- "}, {"autor": "FlashGordonPhotography", "posts": "3,289 posts", "date": "10/07/2020 09:11  PM", "content": "19 hours ago, mirekti said: So true!!! ...the above was shot with M240, currently own an M10, but don't think R with so many megapixels -----> improved !!!  drastically. *Drastically* is in the eye of the beholder but the M10R does have noticeably -----> improved !!!  DR over the M10, plus less noise and more megapickles. I've tested them sided by side and the DR improvements are real. But there's always going to be scenes with more DR than any camera can handle. Gordon"}, {"autor": "Murdog", "posts": "21 posts", "date": "01/03/2021 02:22  PM", "content": "Advertisement (gone after registration) Hi, Just a little background first... I am an amateur street photographer and solely shoot street. I currently own a Leica M7, which has been my main camera for 3 years and this will be first move to digital. I really love how engaged I am in the moment while shooting film, so I wanted to hang onto that experience, which is why I have chosen the screenless option. Although I love the process of shooting film, I mainly shoot at night where I lack high ISO and sometimes I get lazy when it comes to -----> developing !!! . My current lenses are a 28mm Elmarit and a Voigtlander 35 1.4. 28mm being my favourite length. I will be buying used and my heart was set on an M10-D but while looking online, for the same money I could buy an MD 262 plus a 50 summilux for the same price. A 50 being a lens I have been hoping to buy in the future as I feel the 35 is too close to the lens I shoot most, the 28. So just looking for suggestions, or maybe someone who upgraded from a 240/D262 to an M10/D. Or even someone coming from film. (I will still keep my M7) Any help would be great, thanks."}, {"autor": "petermullett", "posts": "837 posts", "date": "01/18/2021 11:05  AM", "content": "Advertisement (gone after registration) On 1/3/2021 at 3:22 PM, Murdog said: Hi, Just a little background first... I am an amateur street photographer and solely shoot street. I currently own a Leica M7, which has been my main camera for 3 years and this will be first move to digital. I really love how engaged I am in the moment while shooting film, so I wanted to hang onto that experience, which is why I have chosen the screenless option. Although I love the process of shooting film, I mainly shoot at night where I lack high ISO and sometimes I get lazy when it comes to -----> developing !!! . My current lenses are a 28mm Elmarit and a Voigtlander 35 1.4. 28mm being my favourite length. I will be buying used and my heart was set on an M10-D but while looking online, for the same money I could buy an MD 262 plus a 50 summilux for the same price. A 50 being a lens I have been hoping to buy in the future as I feel the 35 is too close to the lens I shoot most, the 28. So just looking for suggestions, or maybe someone who upgraded from a 240/D262 to an M10/D. Or even someone coming from film. (I will still keep my M7) Any help would be great, thanks. Hello Murdog and welcome to the Forum.......I presently own a MD-10, ( plus a M7 like yourself ), and despite some quirks it is perhaps my favourite digital M so regarding the choices of camera I would definitely go with the M10-D over the MD 262, and here's a couple of reasons why......The better VF, the slimmer nicely balanced body, and the sensitivity and DR of the sensor is improved over the 240/262 in my opinion, ( I used to own a M240 before trading up to the M10's ), PLUS although I first thought that the faux winding lever was a really stupid \"throwback\" idea I'm now completely won over with it to the extent that I wish all other future M's would offer the same thing. I never liked the rear on/off/WiFi switch from day one, I wish that it was in the \"normal\" M position around the shutter release, but I've gotten used to it I guess now. The reliance on Foto's to make changes to the camera setup is also an annoyance for me, but having settled on the best settings for your shooting preferences you can just leave all that alone. I've not changed my M10-D's settings for more than 8 months or so. The fact that you can use the Visoflex 020 with the M10-D may also be a plus for you. I have one, I don't like it on the M's but others do find it a very handy accessory. Lenses? Frankly I think you've got two that are easily way good enough to start with, especially so the 28mm Elmarit which to my mind is one of Leica's best M lenses, also you may find that after using the M10-D for a while that perhaps you do not need to have a fast Summilux 50mm. I personally have found that since going into the M10 range of cameras I have been able to use smaller, marginally slower, lenses without any problem and to my mind the M balances so much better in the hand with the smaller lenses, ( like your present 28mm Elmarit ), larger faster lenses tend to block the VF more too which can be annoying.....they are also quite a lot more expensive! I'd recommend you looking at a 50mm Summarit when you are considering a 50mm, the Summaries are great little lenses and balance beautifully on the cameras. Good luck anyway!"}, {"autor": "Murdog", "posts": "21 posts", "date": "01/19/2021 08:35  AM", "content": "21 hours ago, petermullett said: Hello Murdog and welcome to the Forum.......I presently own a MD-10, ( plus a M7 like yourself ), and despite some quirks it is perhaps my favourite digital M so regarding the choices of camera I would definitely go with the M10-D over the MD 262, and here's a couple of reasons why......The better VF, the slimmer nicely balanced body, and the sensitivity and DR of the sensor is -----> improved !!!  over the 240/262 in my opinion, ( I used to own a M240 before trading up to the M10's ), PLUS although I first thought that the faux winding lever was a really stupid \"throwback\" idea I'm now completely won over with it to the extent that I wish all other future M's would offer the same thing. I never liked the rear on/off/WiFi switch from day one, I wish that it was in the \"normal\" M position around the shutter release, but I've gotten used to it I guess now. The reliance on Foto's to make changes to the camera setup is also an annoyance for me, but having settled on the best settings for your shooting preferences you can just leave all that alone. I've not changed my M10-D's settings for more than 8 months or so. The fact that you can use the Visoflex 020 with the M10-D may also be a plus for you. I have one, I don't like it on the M's but others do find it a very handy accessory. Lenses? Frankly I think you've got two that are easily way good enough to start with, especially so the 28mm Elmarit which to my mind is one of Leica's best M lenses, also you may find that after using the M10-D for a while that perhaps you do not need to have a fast Summilux 50mm. I personally have found that since going into the M10 range of cameras I have been able to use smaller, marginally slower, lenses without any problem and to my mind the M balances so much better in the hand with the smaller lenses, ( like your present 28mm Elmarit ), larger faster lenses tend to block the VF more too which can be annoying.....they are also quite a lot more expensive! I'd recommend you looking at a 50mm Summarit when you are considering a 50mm, the Summaries are great little lenses and balance beautifully on the cameras. Good luck anyway! Thank you for the reply. I think the points you make are very valid and kind of take me back down to earth. I mostly only get the chance to shoot at night and being so used to my M7, a faster lens was my reasoning for the 50 or maybe a 28 summicron. But as you say, with the ISO capability of the m10-D, maybe my 28 Elmarit will be good enough. I love this lens and love the size on my M7. I think I'm sold on the m10-D 😁"}, {"autor": "S.Rolf", "posts": "141 posts", "date": "05/17/2017 03:51  AM", "content": "And here is mine . . . . I have the same type of half-case and strap for my MP Film. I put the leather \"flaps\" that are on the strap -----> designed !!!  to protect the body under the half-case. Place the hole in the flap over the protrusions on the body that accepts the strap ring before attaching with the rings. It makes it look nice and neat."}, {"autor": "MRJohn", "posts": "303 posts", "date": "04/03/2019 09:37  PM", "content": "Advertisement (gone after registration) The advantages and disadvantages of an M10-D over an e.g. M10-P have been discussed at length in various reviews and topics. So those of you who got an M10-D, what is your experience (I assume this is not your only digital camera)? Do you think it has -----> improved !!!  your photography/composition? Has the discrete aesthetic helped you in any way (share your anecdotes)? How often do you miss the screen? Do you use the app as live view on occasion? Where and what is its place in your kit? What's rationale about it, what is emotional? - Lot's of question, would be great if you could share a few thoughts. Thanks in advance."}, {"autor": "IkarusJohn", "posts": "10,133 posts", "date": "04/04/2019 03:15  AM", "content": "5 hours ago, MRJohn said: The advantages and disadvantages of an M10-D over an e.g. M10-P have been discussed at length in various reviews and topics. So those of you who got an M10-D, what is your experience (I assume this is not your only digital camera)? No, not my only digital camera (SL, TL2 & Monochrom). Quote Do you think it has -----> improved !!!  your photography/composition? . In part, mostly by removing distraction. This morning I went to a fascinating lecture by a neurologist, talking specifically about the Hippocampus (the bit of your brain near each ear that allows you to remember what happened yesterday and anticipate tomorrow, including imagining things). It got me thinking that, while you may be taught the technology of photography, as a learned skill, your imagination is yours. Visualisation and imagining how an image will look seems to me to be something that comes from the Hippocampus. Removing the LCD is a step away from photography being a mechanical/technique based activity back to visualisation and engagement with the scene. Quote How often do you miss the screen? Never. Quote Do you use the app as live view on occasion? Only on a tripod (the camera, not the phone). Quote Where and what is its place in your kit? I carry it everyday at the moment. It’s my main camera right now - I’m a hobbyist. My profession is more profitable. Quote What's rationale about it, what is emotional? It’s both. Using the camera is completely rational - I don’t change the settings often and I don’t chimp. Having direct physical control of ISO, aperture, focus and shutter is plenty for me. Holding the camera is emotional. Cheers John Edited April 4, 2019 by IkarusJohn"}, {"autor": "Winedemonium", "posts": "411 posts", "date": "01/08/2021 08:40  AM", "content": "Advertisement (gone after registration) I used to be fairly active here on this forum, at one especially GAS-filled point using the M, S, and SL systems, so as well as enjoying 'photography', I know at heart I am also a shiny things fondler. 🙂 In mid-2019 I found myself for the first time in many years with no Leica gear at all. I adopted - rationally (my rationale anyway) - a two system approach using Fujifilm's X and GFX platforms, all native lenses. I liked the manual controls, the lightweight of the X system, and the IQ of the GFX100. In practice, I've gone into a creative slump. The X system doesn't inspire, and the GFX system is too much of a big lump, so in the end I grab neither when leaving the house. (To be clear, both systems are brilliant, just as almost everything made today, right?) So, after almost 2 years out, I find myself back round the block looking again at the Leica M system. Why? I know its limitations, and for me they are made worse now by the fact that in the intervening 2 years my eyesight has worsened, and I'd need to wear glasses while focusing the OVF. But I always found the M system pleasurable to use, and would often find myself picking up, and taking out the M without a clear objective in mind... just get going. My last M was the M10. I thought it was brilliant. There wasn't really anything much I would have wanted more (except perhaps IBIS, but we are told the wizards cannot do that spell yet, or perhaps ever). And, having \"looked away\" for a couple of years, I'm only now catching up on what has come since - the M10-D, M10-P, M10-M, M10-R, etc. It made me smile to see that the M engineers are still working on improvements, without losing what the M is all about. So, I'm pondering what to get, starting in the M system again completely from scratch. There's are lens choices to make. I've used most key ones - modern Karbe-era ones, older Mandler-era classics, and older ones still - on MM, M246, M240, and M10. The latest fast/enormous ones I haven't tried, but back when I had multi Leica systems, I found my 50NX better suited to my SL than my M. Many are better skilled at focusing at f/0.95 with a rangefinder patch than me, even with lens/body alignment assured. So for lenses, I have a shortlist in mind. Where I find myself still trying to work things out is the current crop of bodies. I've seen some of the tests, and debate on M10-P v M10-R v M10M. Clearly no one is buying the Monochrom unless they want at least a good chunk of their efforts to go to B&W output. But I'm also more persuaded by those who say the technological advantages the M10M might have aren't for them the main reason they bought it - rather its because carrying the M10M forces you to \"see\" black and white images, to pre-visualise, because you can't hedge your bets later in PP. When I had the MM and M246 I found my B&W work -----> improving !!!  because I was focused on light and shape. I also enjoyed being able to attach colour filters to lenses and play around with that. Some argue that having the colour channels info in your RAW file at PP gives more options in processing than a Monochrom file - you have these channels to slide around, absent in the Monochrom files. Some say the M10(-P) files have more latitude in them, other say the M10R files do. Some point to the challenge of rangefinder photography at higher resolution - human errors are amplified (shake, mis-focus). I didn't pose a question in the title of this post because I'm not quite sure what mine are yet. I guess at this point I'm interested in comments from experienced M users who have considered an M body purchase in the past year or two. What were your considerations, what did you choose, and has the experience of the new body delivered what you thought it would? Also, if you bought an M10R or M10M, did the higher resolution lead you to like certain lenses more, or less, than on lower resolution bodies? And, FWIW, I'll update here too what I end up getting. It's nice to be (almost) back. Happy New Year!"}, {"autor": "chasdfg", "posts": "185 posts", "date": "01/08/2021 11:37  AM", "content": "I purchased 2 Ms in the past year and completely understand what's going on (or so i think i do) . Basically i used an M240 for the most part of 5 years, itched for something new and went through Sony, Canon, Fuji GFX, Sigma FP, Leica SL/2 cameras before realising I just want to shoot with Leica bodies, and within that brand, preferably M cameras (I only like shooting with M glass so an M camera is best for this, along with the form factor of the body, physical dials, simple button layout, etc.). My process wasn't as \"clean\" as yours in that I still had my M lenses and 1 of my 2 current M bodies whilst going through all those other bodies and systems. In any case, it was plenty of soul searching of sorts and a very restless time gear wise. I'm now perfectly contented with my M10M and M10D, two cameras which I feel compliment each other well. I had always wanted a monochrom and was always drawn to the idea of learning how to shoot in b&w as I never had the discipline to convert my pictures to b&w in post. Likewise, i was always drawn to the idea of a screen-less M. Not that I had any major issues with chimping (or so i didn't think i did, until i got the M10D last month). I chose those 2 cameras because I felt they could teach me more than a colour M could alone. People might dismiss the idea that seeing in black and white changes how you shoot, but I've experienced it first hand, as have you. One is forced to think of better ways to draw the viewer's eye. I move more, I look for stronger lines, contrast and shadow more. It's a subtle shift but it's there. The M10D has made me make sure I get the shot when I'm \"getting the shot\". I don't take for granted that I'm shooting digital so much any more. Being forced to shoot differently with these two cameras has made me -----> improve !!!  more than any other camera has, aside from my initial few years with the M240 and with my Nikons when I first started photography. I may be a marketing victim, or convincing myself I made the right choices with the M10M and M10D, but hey if I feel a difference in my shooting and I'm enjoying this hobby more, isn't only relevant barometer the level of satisfaction I derive from using this gear? It's a breath of fresh air and I'm loving it. It's never going to be sensible in the grand scheme of things, to spend money on Leica gear. If I was rational and wanted just one M, I'd have gone with an M10R. If I was rational and just wanted a camera a Nikon Z (or even a DSLR from yesteryears) would suffice. Have the two cameras delivered what I thought they would? Absolutely. And I feel I have plenty to grow into and any limitations are on me. The beauty of the monochroms and the D versions is that you're paying a high price of entry for the concept and way of shooting they promote. It's kinda like paying the high price of entry for an M, but this time a niche within the niche. Once you own a mono/D, even if a new model comes out, the incentives would merely be technological. With cameras this good these days, and with the M10 form factor, it'd be hard to make me give these up for a newer version. I suppose one could argue that if you want to buy the concept, then an M246 and M-D262 would be most economical - however having used the M10 series cameras, I don't think I could go back to the M240 body size and buttons (for M246). Speaking of GFX and Ms, one big reason why I got it was the 40mp bayerless sensor. After my experience with the GFX 50S, I was bitten by the high MP bug. Not because I print big or leave sloppy composition to be fixed in post, but because every time I zoomed in past 100% in my GFX files, I saw so much it was downright fascinating that I could see all these \"new\" details I was capturing. You might appreciate the M10M or M10R on this basis alone, having come from the GFX100. On lenses on the cameras: I've kinda \"been there, done that\" with most lenses I've wanted. I owned/used fast glass, modern glass, vintage glass, limited edition lenses and sorted through what I wanted in my kit and got rid of the rest. Sometimes I feel I should have kept some of the glass I sold cause I took a while to acquire them, not to forget the adage about never selling Leica lenses. But the clutter bothered me more than the idea of selling them. I more than halved my kit and I now \"only\" have 5. 3 core lenses (28cron, 35FLE, 50APO) and 2 \"extra\"/superfluous ones (50 f1, 75lux) for portraits/Mandler days. My main pairing on the M10M tends to be a 28cron and 50APO. Both of these lenses have great clarity and don't embellish photos excessively, much in line with how I view my black and white shooting (no colours, fancy bokeh to spice up the pictures, but lines, shadows and contrast). One side thing I realised with the M10M is I prefer 28mm or 50mm on b&w whilst I prefer 35mm in colour (or prefer 28mm and 50mm less in colour?). Haven't really figured this one out yet, but it might have to do with 28mm giving more room to compose different angles, and 50mm giving an extra tightness to draw the viewer in. I do admit the 40mp sensor does make me want to put the 50APO on more than any other lens, because it can eek out the extra details. I often get pleasant surprises in my photos when I zoom in. This said, I have used Mandler glass on the M10M due to the charm of shooting oldish glass with b&w. With my glass and the M10M, it's very much \"same same but different\", in a pleasant way. I suppose I'm not really answering your higher MP camera + certain lenses question though, since my response has a b&w slant to it. My 35FLE lives on the M10D. Not much to say about this, as that lens could live on any M and I'd be happy camper (being a 35mm guy). Apologies for the long post. I tend to get carried away when talking about cameras...a little too carried away...(I could do a summary if that helps?) Cheers and happy new year to you too!"}, {"autor": "LBJ2", "posts": "640 posts", "date": "01/08/2021 01:46  PM", "content": "5 hours ago, Winedemonium said: I used to be fairly active here on this forum, at one especially GAS-filled point using the M, S, and SL systems, so as well as enjoying 'photography', I know at heart I am also a shiny things fondler. 🙂 In mid-2019 I found myself for the first time in many years with no Leica gear at all. I adopted - rationally (my rationale anyway) - a two system approach using Fujifilm's X and GFX platforms, all native lenses. I liked the manual controls, the lightweight of the X system, and the IQ of the GFX100. In practice, I've gone into a creative slump. The X system doesn't inspire, and the GFX system is too much of a big lump, so in the end I grab neither when leaving the house. (To be clear, both systems are brilliant, just as almost everything made today, right?) So, after almost 2 years out, I find myself back round the block looking again at the Leica M system. Why? I know its limitations, and for me they are made worse now by the fact that in the intervening 2 years my eyesight has worsened, and I'd need to wear glasses while focusing the OVF. But I always found the M system pleasurable to use, and would often find myself picking up, and taking out the M without a clear objective in mind... just get going. My last M was the M10. I thought it was brilliant. There wasn't really anything much I would have wanted more (except perhaps IBIS, but we are told the wizards cannot do that spell yet, or perhaps ever). And, having \"looked away\" for a couple of years, I'm only now catching up on what has come since - the M10-D, M10-P, M10-M, M10-R, etc. It made me smile to see that the M engineers are still working on improvements, without losing what the M is all about. So, I'm pondering what to get, starting in the M system again completely from scratch. There's are lens choices to make. I've used most key ones - modern Karbe-era ones, older Mandler-era classics, and older ones still - on MM, M246, M240, and M10. The latest fast/enormous ones I haven't tried, but back when I had multi Leica systems, I found my 50NX better suited to my SL than my M. Many are better skilled at focusing at f/0.95 with a rangefinder patch than me, even with lens/body alignment assured. So for lenses, I have a shortlist in mind. Where I find myself still trying to work things out is the current crop of bodies. I've seen some of the tests, and debate on M10-P v M10-R v M10M. Clearly no one is buying the Monochrom unless they want at least a good chunk of their efforts to go to B&W output. But I'm also more persuaded by those who say the technological advantages the M10M might have aren't for them the main reason they bought it - rather its because carrying the M10M forces you to \"see\" black and white images, to pre-visualise, because you can't hedge your bets later in PP. When I had the MM and M246 I found my B&W work -----> improving !!!  because I was focused on light and shape. I also enjoyed being able to attach colour filters to lenses and play around with that. Some argue that having the colour channels info in your RAW file at PP gives more options in processing than a Monochrom file - you have these channels to slide around, absent in the Monochrom files. Some say the M10(-P) files have more latitude in them, other say the M10R files do. Some point to the challenge of rangefinder photography at higher resolution - human errors are amplified (shake, mis-focus). I didn't pose a question in the title of this post because I'm not quite sure what mine are yet. I guess at this point I'm interested in comments from experienced M users who have considered an M body purchase in the past year or two. What were your considerations, what did you choose, and has the experience of the new body delivered what you thought it would? Also, if you bought an M10R or M10M, did the higher resolution lead you to like certain lenses more, or less, than on lower resolution bodies? And, FWIW, I'll update here too what I end up getting. It's nice to be (almost) back. Happy New Year! Happy New Year! M10-R and M10-M are the ultimate rangefinders in 2021. If I was just returning to Leica Rangefinder again and ready to start a fresh new build, I'd get back in the saddle with the M10-R and two Leica M lens. You wrote you already have your lens short list. Me ? I'd start off again with a 35mm and a 50mm. Test the waters with this kit to make sure the Leica Rangefinder system is still everything you remember it to be to include the motivation to get out there! It really is one click of one button in Lightroom to switch from color to B&W. If you find yourself converting most of your M10-R Color images to B&W, I would then consider adding the M10-M. ** I've always worn my glasses when using the RF patch and thankful I can. I see that as a benefit. Edited January 8 by LBJ2"}, {"autor": "Winedemonium", "posts": "411 posts", "date": "01/08/2021 02:32  PM", "content": "It's so nice to get these replies. I'd forgotten (forgive me!) how much I enjoyed chatting with other photography nuts here on this forum. 🙂 chasdfg - so much of your experience seems familiar to me! Regarding the M10D, I really smiled when I saw that one. I can't claim to have been part of the clamour here from those who imagined this camera, but I was one of those persuaded by it. I bought, and reported on the M60 - kind of the beta release for this, and I also had and reported here on the M-D (typ262). The same concept in M10 form has appeal I really get. But I also learned - especially with the M-D, the sometimes I like to frame and shoot, slightly arms length from the rear screen, and it is useful to have that option. But... I get it. The M246 I never really gelled with, and in fact while I owned that one I \"downgraded\" to the MM, which really made the MM's antiquated feel stand out, not to mention that \"guh jjjjjjrrrrrrrr\" after the shutter release. But there is - to this day - something about the MM files, and when I happen upon them in my catalogue they really stand out. I can imagine, in a return to the M, even if I had an M10M, I would still consider an MM, just as much and for the same kind of reason as I would consider another M-A/MP/M3, etc (so, I'm with you Jeff S too). Just like the M10D each of these bodies delivers slightly different strengths and weaknesses, we become attuned to them, and work creatively to deliver through them. It's part of the appeal, especially as other (immensely capable) systems deliver so much 'more' so much more easily. (I think everyone here gets this, right?). Thank you chasdfg, petermullett, LocalHero1953, LBJ2, and Jeff S for your comments too, and thank you LocalHero1953 for the welcome back too. LBJ2, regarding the shortlist, it's been tough working on this. I don't want to go nuts in the way I have in the past. I've been fortnate enough to own or try most at some point or other, or for longer periods. I want to get what I will really use, as opposed to fondle. 😁 The change in eyesight is also something I have to get used to. I've gone in to a couple of boutiques to try to figure out what feels comfortable. I don't want to set myself up for frustration. I do like the 28mm fl, but with eyeglasses in between me and the OVF (something that will be new to me), I worry that to much of the periphery of the view will be obscured by the limited access the glasses -----> create !!! . I'm someone who likes to do a quick scan around the framelines during photo-taking to check composition. I don't like to over-crop later in post. Or, at least, I try to challenge myself that way, and worry that this new dimension to the challenge will be de-motivating. I have found in the past that I feel very natural composing in 35mm, so that, and I think 50mm would make a good two lens starting point. I'm still debating 50APO and 50LX. Before I think it would have been no hesitating for the 50APO. I owned that lens for 6 years and know its immense capabilities. But right now for this system I also feel a little tempted back to the more painterly qualities of the near-focus range open aperture range of the 50LX ASPH - which, as we know, is no slouch either. But, I'm still working on this..."}, {"autor": "LBJ2", "posts": "640 posts", "date": "01/08/2021 03:11  PM", "content": "42 minutes ago, Winedemonium said: It's so nice to get these replies. I'd forgotten (forgive me!) how much I enjoyed chatting with other photography nuts here on this forum. 🙂 chasdfg - so much of your experience seems familiar to me! Regarding the M10D, I really smiled when I saw that one. I can't claim to have been part of the clamour here from those who imagined this camera, but I was one of those persuaded by it. I bought, and reported on the M60 - kind of the beta release for this, and I also had and reported here on the M-D (typ262). The same concept in M10 form has appeal I really get. But I also learned - especially with the M-D, the sometimes I like to frame and shoot, slightly arms length from the rear screen, and it is useful to have that option. But... I get it. The M246 I never really gelled with, and in fact while I owned that one I \"downgraded\" to the MM, which really made the MM's antiquated feel stand out, not to mention that \"guh jjjjjjrrrrrrrr\" after the shutter release. But there is - to this day - something about the MM files, and when I happen upon them in my catalogue they really stand out. I can imagine, in a return to the M, even if I had an M10M, I would still consider an MM, just as much and for the same kind of reason as I would consider another M-A/MP/M3, etc (so, I'm with you Jeff S too). Just like the M10D each of these bodies delivers slightly different strengths and weaknesses, we become attuned to them, and work creatively to deliver through them. It's part of the appeal, especially as other (immensely capable) systems deliver so much 'more' so much more easily. (I think everyone here gets this, right?). Thank you chasdfg, petermullett, LocalHero1953, LBJ2, and Jeff S for your comments too, and thank you LocalHero1953 for the welcome back too. LBJ2, regarding the shortlist, it's been tough working on this. I don't want to go nuts in the way I have in the past. I've been fortnate enough to own or try most at some point or other, or for longer periods. I want to get what I will really use, as opposed to fondle. 😁 The change in eyesight is also something I have to get used to. I've gone in to a couple of boutiques to try to figure out what feels comfortable. I don't want to set myself up for frustration. I do like the 28mm fl, but with eyeglasses in between me and the OVF (something that will be new to me), I worry that to much of the periphery of the view will be obscured by the limited access the glasses -----> create !!! . I'm someone who likes to do a quick scan around the framelines during photo-taking to check composition. I don't like to over-crop later in post. Or, at least, I try to challenge myself that way, and worry that this new dimension to the challenge will be de-motivating. I have found in the past that I feel very natural composing in 35mm, so that, and I think 50mm would make a good two lens starting point. I'm still debating 50APO and 50LX. Before I think it would have been no hesitating for the 50APO. I owned that lens for 6 years and know its immense capabilities. But right now for this system I also feel a little tempted back to the more painterly qualities of the near-focus range open aperture range of the 50LX ASPH - which, as we know, is no slouch either. But, I'm still working on this... You have the benefit of many years experience with old and new Leica and what appears to me, a very open mind...I like and value that on a Leica forum. I only know the M10 OVF and I've always been near-sighted. The M10 and my glasses seem very natural to me which is great since I can't RF accurately without it and my eye lash smudge the Leica diopter so I can't RF with a diopter either. Not sure if the M10's slightly increased eye relief has anything to do with it or it's simply all I know ha ha. My lens path started with the 35 Lux FLE and 50 Lux APSH specifically for the f1,4 and later selected the large Noctilux 50 f0,95 for special occasions. My motto has always been buy as much light as I can, even if the 50 APO is stunning at F2 and latest-greatest APO technology is my typical inclination. One day I'll try the 50APO, but don't want to give up f1,4. Even with digital, I find f1,4 logistics very much needed for low light where I have to really push ISO to keep handhold-ability. Either way, best wishes and much fun on your Leica M rebuild journey and I look forward to reading about your finds and adventure. Edited January 8 by LBJ2"}, {"autor": "chasdfg", "posts": "185 posts", "date": "01/09/2021 06:05  AM", "content": "@Winedemonium I didn't realise you've had the M60 & MD262 before, like the Monochroms. Just want to add points on the M10D and M10M compared to their predecessor(s). On the M10D, aside from the slimmer body, it has that really nifty thumb rest. I wasn't sold by this at first. Ergonomically, even without the thumb rest the M10D feels better in hand than the M10M because the back of the camera has no clutter and no LCD in the way. When I tried the M10D at different Leica stores I didn't much of the thumb rest and thought I would only use it for the sake of it. I was very wrong though, and it's something that grew on me quickly. Another thing is wifi, which is quite handy when commuting and I want see some pics I've taken or to use the remote function with live view via the Fotos app (not that I use wifi much, but it's there)...though the wifi aspect can be very divisive for purists. Also, the M10D looks so bloody good and is the most beautiful production digital M I've seen. This said, my feel about the M10D is that unless one is absolutely averse to the idea of processing film, buying a film camera and shooting film would get you there too, so it's not really as much of a game-changer in that respect. Plus it really depends on one's view of the \"inconvenience\" of -----> developing !!!  film - if one enjoys the process, then it's not much of a con (I for one am too lazy and would probably hoard dozens of rolls before doing anything about them). My only bugbear about buying a Leica film camera now is that prices for popular cameras have gone through the roof (and too the moon, and past that) in the past couple of years. On the M10M, I completely understand the appeal of the M9M and how unique those files are. I tend to view the M10M a little differently, in that the camera is it's own camera, not just lumped into the family of \"Monochroms\" and having the title of being the latest one on the market. It isn't an M9M and won't be. It has different film loaded into its DNA and will produce different files (out of the camera, the files are too punchy for my liking, so much so i changed the LCD picture review to have lower contrast too). Alfonso Cuaron mentioned that when he was producing the movie Roma, he wanted that movie to be in black and white, but didn't want it to be a black and white movie with the film grain and rawness reflecting the 1970s it was set in. He took a different approach and wanted the black and white aspect to convey nostalgia yet shoot \"clean\" black and white, utilising the strength of modern sensors today (with Arri cameras) and exploiting the depth and capabilities of this modern medium. I hope I didn't butcher or mis-convey what he was saying. Anyhow, I realised that that is how the M10M sensor should be seen - a modern medium to shoot black and white. Not Tri-X, or Ilford Delta, or even M9M. You can emulate those in post to some degree, but the M10M can also be its own camera and should be seen as it's own camera. It's tough even within the trio of Monochroms due to the M9M's cult following. Just my thoughts! Of course the above is moot if you just want to go simple and just get an M10P or M10R. Either one of them can do everything the M10M and M10D can as long as you have the self-imposed limitations, plus the M10R can do high res too. Lens wise, I feel the same as you about the 50APO in that I never found the f2 lacking in giving me \"thin DOF\". I would always say the 50lux ASPH is the ideal 50mm M to get because it does everything great (not just doing everything \"good enough\" but great) with speed, sharpness, size, MFD all thrown into one. I don't think any general photographer should find the sharpness and capability lacking in all modern Karbe lenses and they are all reliable performers image quality wise. More so if you don't go out testing lenses to no end and worrying about wavy plane of focus or that pinch more distortion than the 50APO, which to me are imperceptible and almost never in-your-face. One thing I've determined after my tedious and tiresome journey to deciding my current kit is that honestly, the only rational thing one should do is ensure you can afford what you're looking at. After that, the heart takes over and you should just get what you want. Too much of my time was wasted counting pennies and depreciation over 5 years, not wanting to put so much money in a spare camera, feeling guilty about owning X camera or Y lens, being practical or \"too economical\"...and this took a lot of joy out of the hobby. Ultimately, if you do get your lenses used, the cost of ownership per month is almost nothing if they are kept in good condition (plenty of places in HK to shop used too. I am envious!) and the cost of ownership for each of those cameras per month probably the same as how much you'd spend on film (or a nice meal or some alcohol...you get me). Edited January 9 by chasdfg"}, {"autor": "petermullett", "posts": "837 posts", "date": "01/09/2021 08:25  AM", "content": "Just one thing I would add, ( I know that at least one of the forum members posting above would agree ), and that is if you've the work space available to you get a decent printer, at least A2 size, and commit to making prints from whatever camera you may eventually choose. Printing one's images, printing them yourself rather than sending out to a pro' shop, is the best way to hone the craft irrespective of whatever camera you may have used to -----> create !!!  the image...................Just my two cents worth."}, {"autor": "LeicaR10", "posts": "596 posts", "date": "12/29/2020 06:39  AM", "content": "Calidre, I use the M and S systems for my business. I previously used the SL system but my clients didn't like the rendering. Everyone has different ideas and opinions on that subject and will leave that alone. Yes, the SL and M lenses do work in a most excellent manner as you will read in a number of threads in the forum. My experience though, demonstrated the M lenses work best on M cameras and are -----> designed !!!  to do so. The SL works best with SL lenses. I found the larger M lenses like the Noctilux and others were easier to focus at times with the SL, but performance was best with M cameras. It will get down to your preference of handling and rendering by the sensor. Everyone on the forum will offer different and well intentioned opinions. My 2 cents...if you are upgrading a M240...get a M10-R. Then get out and create superb photographs with your 35 Summilux. Hope this helps. r/ Mark Edited December 29, 2020 by LeicaR10"}, {"autor": "James M", "posts": "1 post", "date": "12/31/2020 08:18  PM", "content": "I have used a lot of cameras over the years. I now use Nikon's for work with my Leica. Somewhere in this forum others have talked about the idea that there is a perfect fit for some people when it comes to your favorite camera. For street photography the M-9 was the best thing that ever happened to me. Followed by a 240MP, for a short time. In March of this year I decided the SL2 was what I needed--can't remember exactly why now. It is a nice camera, but until I actually walked the streets (Washington, DC) I didn't realize why I am a Leica M person. The slightly heavier SL2 was too heavy. The electronics were diversions to me. The bulk wasn't subtle, especially with an SL lens (I tried to get back to normal with my Summilux--helped a little). A lot of things on the camera I don't use or need. So, at a loss, I sold the barely used SL2 to B&H for about half price in September. Maybe 500 images. Not many, but enough to conclude that this wasn't my camera. I then bought the Leica M-10R and it is absolutely heaven for what I do with a camera. So after all these years I have come to the same conclusion as some others - it isn't a question of the best camera. Not even the best camera for a particular type of use or work. It is the best camera for you. Your photography personality. And when you fall in love, you know it. I won't actually need another camera the rest of my life. I doubt there will be a new M that -----> improves !!!  on the 10R, for me anyway. And the Nikon's still work fine on more mundane work projects. Jim"}, {"autor": "jaapv", "posts": "66,415 posts", "date": "01/04/2021 02:05  AM", "content": "The problem may well be IR contamination. All M cameras are, for technical reasons, IR sensitive to a certain extent. (Caucasian) skin is is layered, and the fat layer produces uneven IR reflection, exacerbated by blood vessels under the skin. This will give rise to purple blotches, depending on the IR content of the light. More so on Leica M cameras than with cameras with more effective IR filtering on the sensor The M8 was particularly bad, the M240 worse than the M9. the M10 is probably about the same level as the M9. Use a 486 filter. (IR cut). All M cameras are able to capture IR images using a B+W 092 or 093 filter. As an aside, in my experience the colour out of any camera will be -----> improved !!!  by creating a dedicated profile, if only by streamlining the colour workflow."}, {"autor": "LBJ2", "posts": "640 posts", "date": "01/04/2021 12:36  PM", "content": "10 hours ago, jaapv said: The problem may well be IR contamination. All M cameras are, for technical reasons, IR sensitive to a certain extent. (Caucasian) skin is is layered, and the fat layer produces uneven IR reflection, exacerbated by blood vessels under the skin. This will give rise to purple blotches, depending on the IR content of the light. More so on Leica M cameras than with cameras with more effective IR filtering on the sensor The M8 was particularly bad, the M240 worse than the M9. the M10 is probably about the same level as the M9. Use a 486 filter. (IR cut). All M cameras are able to capture IR images using a B+W 092 or 093 filter. As an aside, in my experience the colour out of any camera will be -----> improved !!!  by creating a dedicated profile, if only by streamlining the colour workflow. Are we sure this is advice is valid for the M10 too ? https://leicastoremiami.com/products/b-w-39mm-f-pro-486m-uv-ir-cut-filter-mrc?variant=345636687 The B+W 39mm F-Pro 486M UV/IR Cut Filter MRC listed on the Leica Miami page comes with a red lettered warning: \"PLEASE NOTE THIS FILTER IS SPECIFICALLY DESIGNED TO BE USED ONLY ON THE LEICA M8 DIGITAL CAMERA.\""}, {"autor": "peter.hamilton@bardwell-pr", "posts": "3 posts", "date": "12/30/2020 11:29  PM", "content": "Have only just come to this topic as I was given a Lightpix Flash Q mini system as a Christmas present by my son, who is a professional photographer. Took me a little while to figure out how to make it work, so used my M6 to check out operation before using the M10. It works very well and gives plenty of light for such a small unit. Very versatile little thing and the Flash Q trigger is effective on both bodies, so I am thinking of using it with my studio flash unit as well. The whole set might have been purpose -----> designed !!!  for Leica M cameras! Small, unobtrusive, but provides enough light for environmental portraiture with an M camera."}, {"autor": "mike3996", "posts": "296 posts", "date": "12/29/2020 05:10  PM", "content": "Advertisement (gone after registration) Sorry, can't help but add to the wishlist threads Leica M-EVF is not going to happen. The reason is that no M lens supports automatic aperture opening for focusing and then closing it for taking. It's a juggle that will feel awkward enough to scare the majority of people off of the concept. Leica mini-SL just might happen. Approximately M sized*, with an EVF on the left. But it will feature an L mount instead of M. The same reason as for M-EVF not happening. They have to put electronic lens mount as the supported one and the adapted lenses, while they work perfectly, can be second-citizens in the sense of customer support. Leica M11... my crystal ball is foggy on this one, hard to say anything definite about the upcoming M11. Leica evolved the M10 throughout two major improvements, first in M10P and then M10R. I think it is clear by now that they will roll out a new number only when they revisit the body design. I have to wonder what they can possibly put in M11 to reasonably sell the camera over M10R. My personal wish is they focused on -----> improving !!!  the (still optional) EVF resolution and view delay. Battery is an easy secondary target that they can only improve upon body modifications. An IBIS on a rangefinder is a wonderful idea but I fear it's simply too wonderful to ever happen. Too much of a good thing, and all that. Leica CL2... can wait, instead a TL3 with IBIS will come out. Still rocking that Visoflex 020. There will be no new TL lenses announced. M5-sized, I'm afraid."}, {"autor": "LBJ2", "posts": "640 posts", "date": "12/29/2020 08:04  PM", "content": "2 hours ago, mike3996 said: Sorry, can't help but add to the wishlist threads Leica M-EVF is not going to happen. The reason is that no M lens supports automatic aperture opening for focusing and then closing it for taking. It's a juggle that will feel awkward enough to scare the majority of people off of the concept. Leica mini-SL just might happen. Approximately M sized*, with an EVF on the left. But it will feature an L mount instead of M. The same reason as for M-EVF not happening. They have to put electronic lens mount as the supported one and the adapted lenses, while they work perfectly, can be second-citizens in the sense of customer support. Leica M11... my crystal ball is foggy on this one, hard to say anything definite about the upcoming M11. Leica evolved the M10 throughout two major improvements, first in M10P and then M10R. I think it is clear by now that they will roll out a new number only when they revisit the body design. I have to wonder what they can possibly put in M11 to reasonably sell the camera over M10R. My personal wish is they focused on -----> improving !!!  the (still optional) EVF resolution and view delay. Battery is an easy secondary target that they can only improve upon body modifications. An IBIS on a rangefinder is a wonderful idea but I fear it's simply too wonderful to ever happen. Too much of a good thing, and all that. Leica CL2... can wait, instead a TL3 with IBIS will come out. Still rocking that Visoflex 020. There will be no new TL lenses announced. M5-sized, I'm afraid. Some interesting thoughts/predictions! Quick win and wondering why it hasn't come yet 🤨 I think an updated Visoflex with more MPs aka much better IQ would go a long way to satisfying some M users that want/need an EVF but still love their M- Rangefinder cameras/system."}, {"autor": "TomB_tx", "posts": "3,199 posts", "date": "12/28/2020 01:49  PM", "content": "The above answers are correct, especially now that Leica has implemented new methods that are more precise and repeatable. Any adjustment has some tolerance, and it's quite possible that with their old methods a body RF calibration could be towards one end of tolerance, and a lens calibration at the opposite end of tolerance. Thus while both met \"factory specs\" the combination - especially with a digital sensor and a lens like the 0.95 Noctilux with almost no DOF - might not be optimal. So sending both would let a technician see if the \"match\" required finer adjustment. I understand Leica -----> developed !!!  expensive new equipment and methods to make both calibrations more accurate (and likely less dependent on the individual technician's skill), so checking both together is not now recommended. However, there's still a chance that if only one is re-calibrated the other might not meet the new, tighter adjustment spec either. That said, in my 50+ years of owning & using Leica M cameras and lenses I've only had one body (M9) drift out of RF calibration (once). I have had a an issue with RF mis-calibration when a camera had a full service (CLA) by a (non factory) Leica tech - but that was obvious when I received the camera back, as both vertical and horizontal RF alignment was off a bit. On a retry it came back the same with the tech insisting it met factory specs - so I instead sent it to DAG who got it perfect. However, I should admit I've avoided fast exotic glass with no DOF, so my use may not be as critical as some. I had one lens lose calibration when dropped and an element shifted (also causing other optical effects), and a few lenses that were mal-adjusted from the factory, but otherwise no lenses drift out of RF cal. Overall I've had more issues with SLR camera focus issues (mirror & screen changes) that with Leica RF cameras. Live View - direct image from sensor - has much less opportunity for focus errors, if the EVF gives good evaluation of sharpness - but I still find electronic \"in-focus\" signals to be less precise than needed."}, {"autor": "petermullett", "posts": "837 posts", "date": "12/13/2020 08:56  AM", "content": "3 hours ago, chasdfg said: I also have a mini rant about how the Fotos App menu settings for configuring the M10D are so brief it's infuriating. I wish there were options such as dust detection and sensor cleaning (how does one clean the sensor safely with this thing?), file naming (do I have to do this in the computer?) as well as copyright info settings all built into the Fotos App. Basically I just wish they could mirror all the M10/P/Mono settings in Fotos. Why cripple the camera this much if you're already allowing users to adjust settings via WiFi? Its a halfway implementation which would neither satisfy \"purists\" nor people who expect proper menu access if you're providing this function. I have a M10-D myself, and I have to say that despite real irritations it is a \"favourite\" M of those that I presently own..............BUT at the same time I've labelled it in other posts the \"Orphan\" M because Leica put it out then totally ignored it as far as any meaningful or useful enhancement of it's capability. I agree that it's annoying, stupid even, that there's no sensor cleaning function...how the hell do we do that? I've disliked the fact that if you mount the Visoflex 020 the GPS is turned on automatically whether you need it or not with no way of turning it off thus being an unnecessary battery drain. Why is there no way to access the camera menu via the 020,? I hate being reliant on Foto's and carrying a 'phone to make settings adjustments, that seems contrary to the whole philosophy of the camera, it should be able to be self contained and independent and not over reliant on Foto's at all. Foto's itself I have always found for me to be finicky and next to useless anyway. Yes I too could rant more. There's a \"Feedback\" option in Foto's whereby you can let Leica know your thoughts on the camera use that for your complaints or suggestions I have a few times although I've yet to receive an answer,......Maybe more \"squeaky wheels\" will get their attention. The camera is, like the Monochroms, a wonderful addition to Leica M's line of cameras, but they made it a three legged horse at best. Surely there was or still could be much more Leica could -----> improve !!!  regarding the camera's functions and capabilities and as you say. at least give it more of the software / menu features that the rest of the M10's line enjoy. It is after all an M10 with the absence of the LCD, but I don't think that is ever going to happen and that's a pity because despite real frustrations the concept and much of the execution of the camera is so damn good."}, {"autor": "chasdfg", "posts": "185 posts", "date": "12/16/2020 01:01  AM", "content": "Don't get me wrong, the M10D is a marvellous camera. It does what it should - give me the proper experience of a screenless M (no cases with LCD covers or just turning off auto-review, the \"proper\" experience) and getting me close to the experience of shooting film without the -----> developing !!!  process and time (which I admit is also part of the process of film). I only raised these issues and went into a rant because these are so glaring when one sets up the camera and in my initial period of use. I didn't realise it before, but as @petermullett mentioned, the M7 has the switch where the film advance lever is at. Leica has a reference point from the cameras they made before, which almost makes it worse. It is just unusual to have to turn to the back of the M to turn the camera on but this is not a major complaint because I used to shoot the SL and it has the on/off switch on the other end of the camera. It's something i'd get used to and either way will probably leave the camera turned on with auto power off at 2mins to leave it on standby most of the time, as this appears to work for a couple of M10D users. I suppose this on/off switch at the lever may be addressed in an M11D, though this is probably at least 2 years away and am not going to cry about the switch placement. This isn't a deal breaker by any stretch. On the Fotos app, it's striking on set up because I normally wish to set the camera up properly when I first get it. Can't rename files, can't set copyright info (though I can in Lightroom). And I do like the dust detection system and sensor cleaning option found in the M240/M10 menus (there are workarounds, so no major issues here too). I know workarounds are commonplace in the Leica world. When a camera freezes, we pull the batt out. However, it would have been nice to seamlessly transition between cameras if one is already setting the camera up via Fotos. If not, it'd rather the MD-262 approach, which is not to give us this option at all. That's fine. On a somewhat related note regarding the EVF, I don't generally use the EVF as my main lenses are M lenses between 28mm to 50mm. It's not meant to work perpetually with an EVF and I agree an M10 with EVF or the SL might be a better option if one has to do a lot of work with an EVF. This said, I did use it with an R lens over the weekend and aside adapting glass and shooting wideangles, I also think it might be quite useful to check focus easily as I know I have no rear LCD to fall back on (this being the case when I do shoots or more critical situations). Offering the EVF capability but not having a LV button to switch it on and off or to turn off GPS is something I didn't think Leica would overlook. These might also have been non-issues if a full M10 menu was provided for the camera, at least for the GPS anyway. Annoyingly, the workarounds for these would be to not use the camera with the EVF (this is my only colour camera and I don't wish to purchase another camera just to do critical shoots, which are few and far between anyway), to turn the camera off in-between shots (the 2 minute auto-power off would still drain the battery significantly with the EVF and GPS perpetually turned on), to buy a truckload of batteries...All not very feasible or unnecessarily impractical. My point is, you don't offer EVF capability and implement it so poorly. I don't like an all or nothing approach but I think it might have worked better for this camera. You either give us the capability properly implemented or you don't at all. The points I raised above all are due to Leica giving me a taste of what the camera can do and then leaving much to be desired (at least initially anyway). What happened to the production and software design team? I am certain all these points were raised to them before by testers but never worked on. It's probably excuses, like the M10D's Fotos menu is the same as the M10's in Fotos so it's standard etc. It's like seeing someone standing 1 metre from the finish line of a race and just standing there. Okay, that's the last of my rant. I do love this camera, I really do. It's got me more excited to shoot than my M10M ever did and I do enjoy staring at a good-looking camera. I will sell my only R lens and I don't have any lenses wider than 28mm. So the EVF will go too, as will my frustrations about EVF use...swept under the carpet. Will sweep my Fotos frustrations under that carpet too. Edited December 16, 2020 by chasdfg"}], "name": "PersonalPronoun"}