{
  "name": "problem",
  "interestingcomments": [
    {
      "autor": "hirohhhh",
      "posts": "264 posts",
      "date": "10/21/2021 10:49  PM",
      "content": "Advertisement (gone after registration) How many of you carry M cameras without any strap? I bought the Oberwerth M bag and having M10-R inside with the original leather strap, I found it more -----> annoying !!!  than useful as I have now camera strap and the bag strap. Of course, I'd shoot myself if I ever drop the camera, even though it never happen to me before with any camera (unlike with the phones which I drop very frequently). I still have the strap on my camera, but I'm thinking taking it off. Would love to hear the opinions, and experiences of people who never use straps."
    },
    {
      "autor": "junix",
      "posts": "87 posts",
      "date": "10/22/2021 03:52  AM",
      "content": "4 hours ago, hirohhhh said: How many of you carry M cameras without any strap? I bought the Oberwerth M bag and having M10-R inside with the original leather strap, I found it more -----> annoying !!!  than useful as I have now camera strap and the bag strap. Of course, I'd shoot myself if I ever drop the camera, even though it never happen to me before with any camera (unlike with the phones which I drop very frequently). I still have the strap on my camera, but I'm thinking taking it off. Would love to hear the opinions, and experiences of people who never use straps. How do you like the Oberwerth M bag? I bought the Oberwerth Q bag for my Q2M but still using Ona Bowery for the M10-R.. thinking to replace it with the Ober as I really like the Ober Q. Answering your question.. when the M10 is in the bag I use a wrist strap (I never let the camera hang on it, it is just for security) as I also find to cumbersome using a full length strap in a bag."
    },
    {
      "autor": "250swb",
      "posts": "9,965 posts",
      "date": "10/22/2021 09:14  AM",
      "content": "10 hours ago, hirohhhh said: How many of you carry M cameras without any strap? I bought the Oberwerth M bag and having M10-R inside with the original leather strap, I found it more -----> annoying !!!  than useful as I have now camera strap and the bag strap. Of course, I'd shoot myself if I ever drop the camera, even though it never happen to me before with any camera (unlike with the phones which I drop very frequently). I still have the strap on my camera, but I'm thinking taking it off. Would love to hear the opinions, and experiences of people who never use straps. The secret a lot of photographers employ is to buy a bag that's big enough for both the camera and its strap 😉 Edited October 22 by 250swb"
    },
    {
      "autor": "Edax",
      "posts": "91 posts",
      "date": "07/17/2020 06:22  AM",
      "content": "3 hours ago, elmars said: The touchscreen cannot be deactivated. But I think this is unnecessary. I had no problems with it and heared from none. This week it happened to me again, M10-P refusing to release the shutter until I lifted my right thumb off the touchscreen. Unexpected, extremely -----> annoying !!!  and unwanted behaviour. What exactly happened during the few times that I ran into this, I really don’t know, difficult to reproduce. It is easy however to bring the M10-P into a state where the shutter refuses to fire; press play, zoom in on the displayed picture with two finger touch, and while still zooming press the release button. Nothing happens. An option to disable the touchscreen would only be a workaround, this is a bug and should be fixed. Back to the M10-R, thank you for posting these pictures."
    },
    {
      "autor": "roverover",
      "posts": "278 posts",
      "date": "01/01/2021 05:19  PM",
      "content": "On 12/31/2020 at 7:45 AM, FDS said: I had the same problem when initially trying to check the sensor for dust on white walls indoors as I have done consistently successfully with M10P and M10M. After repeatedly getting the 'Image Inhomogeneous' message I then tried using a section of uniformly bright sky with a 135 lens at closest focusing distance at f22 and it now works consistently well. Apparently, the M10R may simply need brighter light to do the dust detection test. I wanted to follow up. I attempted some tests with my 135 mm lens. I was able to get it to work on \"occasion,\" perhaps a little more than with other lenses, maybe 1 out of 40 or 50 tries, but it wasn't a repeatable process and seemed random. I appreciated this function on other M's as it was good for an occasional sensor check, but i also found it helpful for finding dust on lenses where i couldn't as easily see the rear lens elements, like the 135 lens where it's far deeper inside the tube. If this is widespread, I'm curious if it can be adjusted in a future firmware update. I wouldn't send my camera in because of this and hoping i never have to send it in for service. This is a great M camera in my opinion and the issue is minor, but slightly -----> annoying !!! ."
    },
    {
      "autor": "NigelG",
      "posts": "1,363 posts",
      "date": "08/18/2021 01:54  AM",
      "content": "I’m sure you’ll get lots of good advice here but fundamentally your issue IMHO is that you enjoy both the “screenless” and the “colourless” (ie b+w) experience which are - along with the RF - uniquely Leica digital options, both outside mainstream digital cameras and also currently mutually exclusive. I shoot 2x M edition 60s, an M9M and an M240-P (and had an M246) and have been wondering how to consolidate but struggle with rather same thought process, but I worry less about low light ISO as I use Summiluxes and then if it’s too dark for photos IMHO it’s too dark! I could ditch the M9M and just convert colour files to B+W (but lose that mindset/visualisation of shooting in B+W with only B+W RAWs available)* I could ditch the M60s and pretend* that turning off the screen was in some way the same* Or I could just use my M240-P for everything and forget I ever had the others ...🙄 * see previous interminable and -----> annoying !!!  threads re the “just convert from colour/turn off the screen cos it’s just the same” 😡 IMHO there’s a reason that Leica have made screenless and also B+W-only cameras and there’s surely a tiny, yet unfortunately commercially unsubstainable, Venn Diagram overlap that would be overjoyed with a MxM-D. I don’t think it’s coming. So choose your poison... Edited August 18 by NigelG"
    },
    {
      "autor": "Rupert Greenwell",
      "posts": "162 posts",
      "date": "03/13/2021 02:42  PM",
      "content": "The slow start up of the M10 and M10M is very -----> annoying !!!  and I have often missed the moment. The M9 Monochrom which I still have is so much quicker, the M 246 Monochrom and M 262 which I also have are a bit slower than the M9M but a second faster than M10. I remember when Leica M photographers used to discuss the shutter release button on film cameras as which was the crisper and therefore the quickest at catching the moment. I have been debating which Monochrom to keep out of the three and the M9M is looking the likely winner due to it's faster wake up amongst other things. Film to me will always be quicker providing that you have remembered to wind on or as what happened to me recently not put a film in !!"
    },
    {
      "autor": "brandnew2",
      "posts": "26 posts",
      "date": "07/31/2020 05:32  PM",
      "content": "No issues yet on my m10-r, but my m10-p does randomly freeze from time to time. I never quite figured out the cause or how to reproduce the issue, but usually I just pop the battery and turn it back on and it's fine. Not a dealbreaker but certainly -----> annoying !!!  when it does happen."
    },
    {
      "autor": "overexposed",
      "posts": "99 posts",
      "date": "07/21/2021 06:00  AM",
      "content": "On 6/28/2020 at 9:34 PM, faranstudio said: I have the same question and challenge with my M10mono. Specially in the studio sessions with using EVF for accurate focusing this becomes more important to lock the focus and keep it in the same spot. It seems the screen touch sensitivity is too responsive in a good way that the focus point changes by small amount of touch or nose pressure. i would also like to be able to disable it, every time i go into focus peaking zoom it is somewhere else, quite -----> annoying !!! "
    },
    {
      "autor": "Jeff S",
      "posts": "18,651 posts",
      "date": "06/15/2021 11:32  PM",
      "content": "7 hours ago, Helge said: The RF correction lens does all the correction except astigmatism. Only if you‘ve got a significant astigmatism, the correction lens might not work. Otherwise, no glasses are required to use the RF. Astigmatism and sun protection (my eyes are sensitive to daylight). Plus RF focusing with my aging eyes improves through use of +.5 diopter, despite otherwise appropriate (comfortable) distance correction via glasses. In younger days, this was not needed. Additionally, I need glasses for when my eye is not against the viewfinder, and I would find it very -----> annoying !!!  to have to take them on and off when shooting and walking around. Each person is different, with different requirements and preferences. Math is only part of the story. Jeff Edited June 15 by Jeff S"
    },
    {
      "autor": "mmx_2",
      "posts": "638 posts",
      "date": "08/29/2019 05:37  PM",
      "content": "I’ve used the 21 f2.8 quite extensively, and although sharp it had quite -----> annoying !!!  purple edges (fixable) sold it for a SEM 21 and never looked back. I still think they offer excellent value for money!"
    },
    {
      "autor": "Steven",
      "posts": "3,750 posts",
      "date": "10/26/2020 07:06  AM",
      "content": "23 hours ago, Tom1234 said: Does anyone find the 40meg aesthetic too harsh and technical looking verses the 24meg aesthetic that seems more smooth and calm and normal similar to what the eye sees? From pictures on the web the 24meg shots look more artsy and the 40meg have an exciting impact but are more technical in nature. I am preferring the 24meg myself. Has anyone gone to 40meg camera then gone back to the 24meg? Or just set the 40meg camera to a lower resolution to get back to the lower resolution look? I own a 32\" Benq Calibrated Color Photography monitor so I think I am seeing correctly what is there for a comparison. Sorry to be going against the stream here, but I actually completely agree with you mate. Resolution has a huge impact on aesthetics. I think it might be more noticeable on portraits and landscape but it’s on portraits that it’s the most -----> annoying !!! . it’s too sharp. Too clinical of course ! With 24pm, you get a softer image, and for some of us that are nostalgics (not trying to offend anyone this is why I don’t say all of us nostalgic photographers), and who look for a vintage look in our photos, too sharp is too harsh, I think. I shoot both on the q2 and the m10p, and while I love my q2 so much, I find the file more pleasing and soft on my m10. The truth is that I’m itching to upgrade my M10 to the M10R. That camera look like a little masterpiece. The only thing holding me back, besides the red dot design, is that I fear to get an image to sharp with the 40 mp. of course, it also changes everything with your post processing workflow, but I won’t get started on that."
    },
    {
      "autor": "Tom1234",
      "posts": "351 posts",
      "date": "10/26/2020 08:03  AM",
      "content": "52 minutes ago, Steven said: Sorry to be going against the stream here, but I actually completely agree with you mate. Resolution has a huge impact on aesthetics. I think it might be more noticeable on portraits and landscape but it’s on portraits that it’s the most -----> annoying !!! . it’s too sharp. Too clinical of course ! With 24pm, you get a softer image, and for some of us that are nostalgics (not trying to offend anyone this is why I don’t say all of us nostalgic photographers), and who look for a vintage look in our photos, too sharp is too harsh, I think. I shoot both on the q2 and the m10p, and while I love my q2 so much, I find the file more pleasing and soft on my m10. The truth is that I’m itching to upgrade my M10 to the M10R. That camera look like a little masterpiece. The only thing holding me back, besides the red dot design, is that I fear to get an image to sharp with the 40 mp. of course, it also changes everything with your post processing workflow, but I won’t get started on that. I totally agree. Maybe the M10-R 40meg has a lessor file that can be saved to... less meg. Not jpg which I find insulting after spending on an expensive camera. There is a famous photographer on the web that revels in jpg saying all should use it (he shall go nameless) but his commercial work needs that \"punch\" of the narrower color range with the color intensity turned up, so it makes sense to him. I like the fine art abilities of DMG myself."
    },
    {
      "autor": "Ranug",
      "posts": "9 posts",
      "date": "10/05/2020 11:34  AM",
      "content": "Advertisement (gone after registration) I bought the Leica M10-R at the beginning of August. I am very satisfied with the camera in itself; actually, much more. I am really happy with the device. It was only last week that I noticed that the camera draws a lot of power from the battery when it is switched off. Since I haven't managed to leave the camera for a few days yet, I can't give any concrete percentage values here. According to the current observations the loss of electricity is about 20% per day. Is this \"problem\" possibly known or has somebody already noticed it? As long as I am not travelling, the thing is not problematic but still a bit -----> annoying !!! . Greetings from Vienna Translated with www.DeepL.com/Translator (free version)"
    },
    {
      "autor": "petermullett",
      "posts": "837 posts",
      "date": "10/02/2020 11:11  AM",
      "content": "1 hour ago, vwillrocku said: Hi all, my almost 2 years old M10 gets some problems. The biggest problem is: the Leica repairing service is worst. Do you think there is Germany customer department to compliant or something I could do? Thanks for your advice and once again: Leica repairing service is worst in my personal experience. No more Leica in my life. Where was the camera sent for repair? If it was back to Wetzlar then I am very surprised that you've experienced all these problems, extremely frustrating and -----> annoying !!!  because I've nothing but good things to say for my repair/service experiences with Wetzlar, even though yes I do tend to agree that perhaps that the digital Leica M's do need more service or repairing than other brands I've used for 4-5 decades which is a pity because there's nothing even close to my mind to an M as a photographic tool. In your case I'd try a telephone call to Customer Service in Wetzlar, irrespective as to whether they did the repairs for you, ask for a manager and outline these troubles, following it up with a personal email to whoever you manage to talk to. It's sad, but it does appear that you are going to have to \"rattle the cage\" over this. Good luck, but don't give up yet on the M!"
    },
    {
      "autor": "vwillrocku",
      "posts": "39 posts",
      "date": "10/02/2020 11:44  AM",
      "content": "1 hour ago, petermullett said: Where was the camera sent for repair? If it was back to Wetzlar then I am very surprised that you've experienced all these problems, extremely frustrating and -----> annoying !!!  because I've nothing but good things to say for my repair/service experiences with Wetzlar, even though yes I do tend to agree that perhaps that the digital Leica M's do need more service or repairing than other brands I've used for 4-5 decades which is a pity because there's nothing even close to my mind to an M as a photographic tool. In your case I'd try a telephone call to Customer Service in Wetzlar, irrespective as to whether they did the repairs for you, ask for a manager and outline these troubles, following it up with a personal email to whoever you manage to talk to. It's sad, but it does appear that you are going to have to \"rattle the cage\" over this. Good luck, but don't give up yet on the M! Thanks for your kind reply. Yes, the camera was sent to Wetzlar and as you described, it is extremely frustrating and -----> annoying !!!  as M10 is the most unstable digital camera I own. I owned my first DC since 1998 and even the cheapest one was much more stable than M10. I have a friend who own an M10 and he also have bad experience such as needed to remove battery to fix a freeze. I have to say again I don't expect M10 is perfect, but I expect it can be repaired and I also expect the customer service can be better. I even asked them to bear the cost of shipping for this time but they refused. What makes me really upset is the screen protector was scratched after repairing. If I am the technician who made the scratch, I must replace for a new one for the customer rather than pretends nothing happened. This is the basic norm of a responsible after service department, right? But the Leica customer service didn't even reply \"I am sorry that your protector is scratched because......\" after I made the complaint. They perfer to remain silence. If the Leica service could not even do right in such minor aspect, how can I trust the whole repairing service and customer department? I have already send quite a lot of long emails to reflect the problems but what I can get is \"resend the camera for inspection\". They don't promise anything or try to do something. It is a good advice to find a manager, do anyone here have a email contact? I am not living in Germany, Europe or US, so direct calling may be not possible. Edited October 2, 2020 by vwillrocku"
    },
    {
      "autor": "vwillrocku",
      "posts": "39 posts",
      "date": "10/02/2020 11:44  AM",
      "content": "1 hour ago, petermullett said: Where was the camera sent for repair? If it was back to Wetzlar then I am very surprised that you've experienced all these problems, extremely frustrating and -----> annoying !!!  because I've nothing but good things to say for my repair/service experiences with Wetzlar, even though yes I do tend to agree that perhaps that the digital Leica M's do need more service or repairing than other brands I've used for 4-5 decades which is a pity because there's nothing even close to my mind to an M as a photographic tool. In your case I'd try a telephone call to Customer Service in Wetzlar, irrespective as to whether they did the repairs for you, ask for a manager and outline these troubles, following it up with a personal email to whoever you manage to talk to. It's sad, but it does appear that you are going to have to \"rattle the cage\" over this. Good luck, but don't give up yet on the M! Thanks for your kind reply. Yes, the camera was sent to Wetzlar and as you described, it is extremely frustrating and -----> annoying !!!  as M10 is the most unstable digital camera I own. I owned my first DC since 1998 and even the cheapest one was much more stable than M10. I have a friend who own an M10 and he also have bad experience such as needed to remove battery to fix a freeze. I have to say again I don't expect M10 is perfect, but I expect it can be repaired and I also expect the customer service can be better. I even asked them to bear the cost of shipping for this time but they refused. What makes me really upset is the screen protector was scratched after repairing. If I am the technician who made the scratch, I must replace for a new one for the customer rather than pretends nothing happened. This is the basic norm of a responsible after service department, right? But the Leica customer service didn't even reply \"I am sorry that your protector is scratched because......\" after I made the complaint. They perfer to remain silence. If the Leica service could not even do right in such minor aspect, how can I trust the whole repairing service and customer department? I have already send quite a lot of long emails to reflect the problems but what I can get is \"resend the camera for inspection\". They don't promise anything or try to do something. It is a good advice to find a manager, do anyone here have a email contact? I am not living in Germany, Europe or US, so direct calling may be not possible. Edited October 2, 2020 by vwillrocku"
    },
    {
      "autor": "petermullett",
      "posts": "837 posts",
      "date": "01/18/2021 11:05  AM",
      "content": "Advertisement (gone after registration) On 1/3/2021 at 3:22 PM, Murdog said: Hi, Just a little background first... I am an amateur street photographer and solely shoot street. I currently own a Leica M7, which has been my main camera for 3 years and this will be first move to digital. I really love how engaged I am in the moment while shooting film, so I wanted to hang onto that experience, which is why I have chosen the screenless option. Although I love the process of shooting film, I mainly shoot at night where I lack high ISO and sometimes I get lazy when it comes to developing. My current lenses are a 28mm Elmarit and a Voigtlander 35 1.4. 28mm being my favourite length. I will be buying used and my heart was set on an M10-D but while looking online, for the same money I could buy an MD 262 plus a 50 summilux for the same price. A 50 being a lens I have been hoping to buy in the future as I feel the 35 is too close to the lens I shoot most, the 28. So just looking for suggestions, or maybe someone who upgraded from a 240/D262 to an M10/D. Or even someone coming from film. (I will still keep my M7) Any help would be great, thanks. Hello Murdog and welcome to the Forum.......I presently own a MD-10, ( plus a M7 like yourself ), and despite some quirks it is perhaps my favourite digital M so regarding the choices of camera I would definitely go with the M10-D over the MD 262, and here's a couple of reasons why......The better VF, the slimmer nicely balanced body, and the sensitivity and DR of the sensor is improved over the 240/262 in my opinion, ( I used to own a M240 before trading up to the M10's ), PLUS although I first thought that the faux winding lever was a really stupid \"throwback\" idea I'm now completely won over with it to the extent that I wish all other future M's would offer the same thing. I never liked the rear on/off/WiFi switch from day one, I wish that it was in the \"normal\" M position around the shutter release, but I've gotten used to it I guess now. The reliance on Foto's to make changes to the camera setup is also an annoyance for me, but having settled on the best settings for your shooting preferences you can just leave all that alone. I've not changed my M10-D's settings for more than 8 months or so. The fact that you can use the Visoflex 020 with the M10-D may also be a plus for you. I have one, I don't like it on the M's but others do find it a very handy accessory. Lenses? Frankly I think you've got two that are easily way good enough to start with, especially so the 28mm Elmarit which to my mind is one of Leica's best M lenses, also you may find that after using the M10-D for a while that perhaps you do not need to have a fast Summilux 50mm. I personally have found that since going into the M10 range of cameras I have been able to use smaller, marginally slower, lenses without any problem and to my mind the M balances so much better in the hand with the smaller lenses, ( like your present 28mm Elmarit ), larger faster lenses tend to block the VF more too which can be -----> annoying !!! .....they are also quite a lot more expensive! I'd recommend you looking at a 50mm Summarit when you are considering a 50mm, the Summaries are great little lenses and balance beautifully on the cameras. Good luck anyway!"
    },
    {
      "autor": "Murdog",
      "posts": "21 posts",
      "date": "01/19/2021 08:35  AM",
      "content": "21 hours ago, petermullett said: Hello Murdog and welcome to the Forum.......I presently own a MD-10, ( plus a M7 like yourself ), and despite some quirks it is perhaps my favourite digital M so regarding the choices of camera I would definitely go with the M10-D over the MD 262, and here's a couple of reasons why......The better VF, the slimmer nicely balanced body, and the sensitivity and DR of the sensor is improved over the 240/262 in my opinion, ( I used to own a M240 before trading up to the M10's ), PLUS although I first thought that the faux winding lever was a really stupid \"throwback\" idea I'm now completely won over with it to the extent that I wish all other future M's would offer the same thing. I never liked the rear on/off/WiFi switch from day one, I wish that it was in the \"normal\" M position around the shutter release, but I've gotten used to it I guess now. The reliance on Foto's to make changes to the camera setup is also an annoyance for me, but having settled on the best settings for your shooting preferences you can just leave all that alone. I've not changed my M10-D's settings for more than 8 months or so. The fact that you can use the Visoflex 020 with the M10-D may also be a plus for you. I have one, I don't like it on the M's but others do find it a very handy accessory. Lenses? Frankly I think you've got two that are easily way good enough to start with, especially so the 28mm Elmarit which to my mind is one of Leica's best M lenses, also you may find that after using the M10-D for a while that perhaps you do not need to have a fast Summilux 50mm. I personally have found that since going into the M10 range of cameras I have been able to use smaller, marginally slower, lenses without any problem and to my mind the M balances so much better in the hand with the smaller lenses, ( like your present 28mm Elmarit ), larger faster lenses tend to block the VF more too which can be -----> annoying !!! .....they are also quite a lot more expensive! I'd recommend you looking at a 50mm Summarit when you are considering a 50mm, the Summaries are great little lenses and balance beautifully on the cameras. Good luck anyway! Thank you for the reply. I think the points you make are very valid and kind of take me back down to earth. I mostly only get the chance to shoot at night and being so used to my M7, a faster lens was my reasoning for the 50 or maybe a 28 summicron. But as you say, with the ISO capability of the m10-D, maybe my 28 Elmarit will be good enough. I love this lens and love the size on my M7. I think I'm sold on the m10-D 😁"
    },
    {
      "autor": "petermullett",
      "posts": "837 posts",
      "date": "12/13/2020 08:56  AM",
      "content": "3 hours ago, chasdfg said: I also have a mini rant about how the Fotos App menu settings for configuring the M10D are so brief it's infuriating. I wish there were options such as dust detection and sensor cleaning (how does one clean the sensor safely with this thing?), file naming (do I have to do this in the computer?) as well as copyright info settings all built into the Fotos App. Basically I just wish they could mirror all the M10/P/Mono settings in Fotos. Why cripple the camera this much if you're already allowing users to adjust settings via WiFi? Its a halfway implementation which would neither satisfy \"purists\" nor people who expect proper menu access if you're providing this function. I have a M10-D myself, and I have to say that despite real irritations it is a \"favourite\" M of those that I presently own..............BUT at the same time I've labelled it in other posts the \"Orphan\" M because Leica put it out then totally ignored it as far as any meaningful or useful enhancement of it's capability. I agree that it's -----> annoying !!! , stupid even, that there's no sensor cleaning function...how the hell do we do that? I've disliked the fact that if you mount the Visoflex 020 the GPS is turned on automatically whether you need it or not with no way of turning it off thus being an unnecessary battery drain. Why is there no way to access the camera menu via the 020,? I hate being reliant on Foto's and carrying a 'phone to make settings adjustments, that seems contrary to the whole philosophy of the camera, it should be able to be self contained and independent and not over reliant on Foto's at all. Foto's itself I have always found for me to be finicky and next to useless anyway. Yes I too could rant more. There's a \"Feedback\" option in Foto's whereby you can let Leica know your thoughts on the camera use that for your complaints or suggestions I have a few times although I've yet to receive an answer,......Maybe more \"squeaky wheels\" will get their attention. The camera is, like the Monochroms, a wonderful addition to Leica M's line of cameras, but they made it a three legged horse at best. Surely there was or still could be much more Leica could improve regarding the camera's functions and capabilities and as you say. at least give it more of the software / menu features that the rest of the M10's line enjoy. It is after all an M10 with the absence of the LCD, but I don't think that is ever going to happen and that's a pity because despite real frustrations the concept and much of the execution of the camera is so damn good."
    }
  ]
}
