{"interestingcomments": [{"autor": "scott kirkpatrick", "posts": "7,201 posts", "date": "07/25/2020 07:49  AM", "content": "Nice album. And interesting light. The one concern that has come up from reviews so far is that the -----> improved !!!  headroom for exposures may not hold up at high ISOs. That comes from a rather sloppy set of shots taken in bad light, but is worth checking out while Leica is still nervously watching over the firmware health of their new baby. The Phoblogger complains that a bright light yellow turned white with slight overexposure at ISO 6400 or 12500, which seem to be usable settings with this new camera. What do you see?"}, {"autor": "dkmoore", "posts": "2,194 posts", "date": "07/25/2020 01:02  PM", "content": "Advertisement (gone after registration) 5 hours ago, scott kirkpatrick said: Nice album. And interesting light. The one concern that has come up from reviews so far is that the -----> improved !!!  headroom for exposures may not hold up at high ISOs. That comes from a rather sloppy set of shots taken in bad light, but is worth checking out while Leica is still nervously watching over the firmware health of their new baby. The Phoblogger complains that a bright light yellow turned white with slight overexposure at ISO 6400 or 12500, which seem to be usable settings with this new camera. What do you see? It was very dreary and rainy so I didn't get to test out the \"-----> improved !!!  headroom in the highlights\". The only (bad) examples that I could find that somewhat test this are below and shot at ISO6400. One click auto adjustment in Lightroom and you do get quite a bit of highlight recovery on the lightbulb and around it. The colors all seem to hold up very well. I'm shooting with a model tomorrow AM and will purposefully stress test the highlights. Let's see more M10R photos! --img-- --img-- "}, {"autor": "dkmoore", "posts": "2,194 posts", "date": "07/25/2020 01:02  PM", "content": "Advertisement (gone after registration) 5 hours ago, scott kirkpatrick said: Nice album. And interesting light. The one concern that has come up from reviews so far is that the -----> improved !!!  headroom for exposures may not hold up at high ISOs. That comes from a rather sloppy set of shots taken in bad light, but is worth checking out while Leica is still nervously watching over the firmware health of their new baby. The Phoblogger complains that a bright light yellow turned white with slight overexposure at ISO 6400 or 12500, which seem to be usable settings with this new camera. What do you see? It was very dreary and rainy so I didn't get to test out the \"-----> improved !!!  headroom in the highlights\". The only (bad) examples that I could find that somewhat test this are below and shot at ISO6400. One click auto adjustment in Lightroom and you do get quite a bit of highlight recovery on the lightbulb and around it. The colors all seem to hold up very well. I'm shooting with a model tomorrow AM and will purposefully stress test the highlights. Let's see more M10R photos! --img-- --img-- "}, {"autor": "brandnew2", "posts": "26 posts", "date": "07/25/2020 01:47  PM", "content": "5 hours ago, scott kirkpatrick said: Nice album. And interesting light. The one concern that has come up from reviews so far is that the -----> improved !!!  headroom for exposures may not hold up at high ISOs. That comes from a rather sloppy set of shots taken in bad light, but is worth checking out while Leica is still nervously watching over the firmware health of their new baby. The Phoblogger complains that a bright light yellow turned white with slight overexposure at ISO 6400 or 12500, which seem to be usable settings with this new camera. What do you see? Thanks! I haven't gotten a chance yet to rigorously test how high ISO settings affect highlight recovery, but I can confirm that highlight recovery is in general noticeably -----> improved !!!  over the m10-p. I had my settings accidentally off for a shot and overexposed by ~2 stops, and when I looked at the LCD preview, I figured the highlights were irretrievably blown (based on my experience looking at similarly overexposed shots on the m10-p). However, when I got into lightroom, I was able to recover essentially all of the detail in the highlights, which was pleasantly surprising. That was an ISO 1600 shot, though."}, {"autor": "Jeff S", "posts": "18,651 posts", "date": "10/20/2020 08:03  PM", "content": "46 minutes ago, intermediatic said: M-10 did not offer anything significantly more than the M240. So why upgrade? I made the upgrade because: the VF was superior (larger opening, higher magnification and better eye relief for glasses), more robust build with -----> improved !!!  weather sealing and higher tolerances, slimmer form factor, elimination of video and simpler controls, better high ISO and dedicated top dial, etc. Best digital M platform to date. Obvious to me. Also built in WiFi, which is of no interest to me. Only downside is smaller battery, but I always have carried a spare anyway. Jeff"}, {"autor": "pedaes", "posts": "4,230 posts", "date": "10/20/2020 08:09  PM", "content": "52 minutes ago, intermediatic said: So why upgrade? Pleased cataract surgery went well. I agree with Jeff's points above, and would add -----> improved !!!  (suptle)colour in out of camera RAW files in LR."}, {"autor": "Jeff S", "posts": "18,651 posts", "date": "10/20/2020 08:17  PM", "content": "4 minutes ago, pedaes said: I agree with Jeff's points above, and would add -----> improved !!!  (suptle)colour in out of camera RAW files in LR. I didn’t include that because I prefer my own custom profile(s) with either (any) camera. Both of these cameras have a sufficient starting point for me. Jeff"}, {"autor": "mike3996", "posts": "296 posts", "date": "04/14/2021 03:02  PM", "content": "36 MP is going the wrong direction Perhaps they could offer a Canon-like \"s-RAW\" that would enable downsampled, in-camera 18 megapixel files. I like the quirky bottom plate system but don't care if it goes away. The -----> improved !!!  visoflex is precisely what I am waiting from my ideal M camera. If the supposedly new Visoflex fits older models, what will behave differently? Will the new model be able to feed it faster refresh rates, will the Visoflex's resolution be limited when plugged to an M10, what. I can barely wait! I happily shoot my MP240 and so far I've been able to reason about upgrades to M10/P/R being \"too little for too much\". My fear is that November comes too quickly and then I potentially have new GAS to deal with."}, {"autor": "ironringer", "posts": "404 posts", "date": "10/30/2021 07:23  AM", "content": "Would the performance and quality of the M10 cameras, that currently satisfy and please their owners, change the slightest, when a new------> improved !!!  model is introduced? The answer is obvious = no. To quote someone strange and famous \"it is what it is.\" So, no need to sell what works well. ADDING another Leica, old or new, is of course a different decision 🙂. Currently I am happy with my Leica film cameras and an aging-gracefully M240. But there is always room for another Leica 😉."}, {"autor": "sillbeers15", "posts": "1,949 posts", "date": "10/30/2021 11:49  AM", "content": "Well I sold my M10 at a good price last year when I took delivery of my M10R. I see the possibility of a 45-55MPx sensor with high ISO capability to become the likely offering in the M11. Such a sensor coupled with an -----> improved !!!  eye/face detect AF would make much better sense into the SL3 body. As for an M, maintaining it as RF and manual focus with a compact body & lenses, I yet to see how far the mega pixel race can offer. I guess I have the option now as to go for the M11 after it is released with a reasonably good resale value of my M10R or I can wait for the M12 if the difference between the M10R & M11 are not significant."}, {"autor": "IkarusJohn", "posts": "10,133 posts", "date": "10/29/2021 04:53  AM", "content": "47 minutes ago, grahamc said: Ok second that. Genuine question what are the “issues” with higher megapixels ? I would assume that it’s more unforgiving of technical (focussing) errors ? Also - How about lenses ... does a higher Mp count reveal imperfections in vintage glass that previous resolutions didn’t? I ask this because a recent seller of a 50:1.4 pre-ASPH mentioned that the reason for sale was he was using m10R and as a result had switched to the latest and greatest lenses (namely APO in his case ). I don’t necessarily think that’s valid logic but would appreciate opinions. my only experience of high megapixels is Sony A7Riv 63MP. I really like it and haven’t experienced any issues but let’s be honest those cameras drive themselves - very hard / impossible to go wrong. HI Graham, I think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! It’s fiction! You don’t know what you’re talking about! Internet myth! Etc etc The 18MP M9 and 24MP M(240)/M10 were considered to be the “sweet spot” for handheld 135 format digital. At that time, Sony released its 37.5MP sensor (when Leica had “only” 37.5MP in its S2). The cameras that first sensor was in (the Sony A7r and the Nikon D800e were two I had) were a nightmare to get sharp. Many will deny this, but I can say from my own experience, that something was going on, and it wasn’t good. At the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly Ming Thein’s conclusion). I suspect it was a combination of shutter slap and the sensor site designs. Both of which appear to have been solved. I have great faith in Jono’s reviews, and he has said more than once that the M10-R doesn’t suffer from pixel level blur. That said, if I want greater resolution (which I don’t), I would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... As to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an -----> improved !!!  sensor makes an image worse. I doubt this is actually possible. Improve either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. If you have an M10-R, there is little doubt that a 50 APO Summicron will give you better images than the previous pre-Asph 50 Summicron or Summilux lenses, though some may prefer the older lens rendering. Each to their own, I guess."}, {"autor": "grahamc", "posts": "521 posts", "date": "10/29/2021 05:05  AM", "content": "12 minutes ago, IkarusJohn said: HI Graham, I think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! It’s fiction! You don’t know what you’re talking about! Internet myth! Etc etc The 18MP M9 and 24MP M(240)/M10 were considered to be the “sweet spot” for handheld 135 format digital. At that time, Sony released its 37.5MP sensor (when Leica had “only” 37.5MP in its S2). The cameras that first sensor was in (the Sony A7r and the Nikon D800e were two I had) were a nightmare to get sharp. Many will deny this, but I can say from my own experience, that something was going on, and it wasn’t good. At the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly Ming Thein’s conclusion). I suspect it was a combination of shutter slap and the sensor site designs. Both of which appear to have been solved. I have great faith in Jono’s reviews, and he has said more than once that the M10-R doesn’t suffer from pixel level blur. That said, if I want greater resolution (which I don’t), I would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... As to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an -----> improved !!!  sensor makes an image worse. I doubt this is actually possible. Improve either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. If you have an M10-R, there is little doubt that a 50 APO Summicron will give you better images than the previous pre-Asph 50 Summicron or Summilux lenses, though some may prefer the older lens rendering. Each to their own, I guess. Thanks John, Very interesting and all makes sense - I hadn't known about those earlier issues with the larger MP digital cameras. I'm really happy with my A7Riv although naturally it's had very little / no use since I wandered into a Leica store and picked up an M But it is really impressive. In practical terms I doubt that I need higher than 24MP in an M at this point ... even the noticeably quicker download to my computer and pain free editing makes the experience match the M system really well IMO (simplicity/compactness/lightness). This may change in the future but right now very happy. Edited October 29 by grahamc"}, {"autor": "aristotle", "posts": "134 posts", "date": "10/29/2021 11:55  AM", "content": "6 hours ago, IkarusJohn said: HI Graham, I think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! It’s fiction! You don’t know what you’re talking about! Internet myth! Etc etc The 18MP M9 and 24MP M(240)/M10 were considered to be the “sweet spot” for handheld 135 format digital. At that time, Sony released its 37.5MP sensor (when Leica had “only” 37.5MP in its S2). The cameras that first sensor was in (the Sony A7r and the Nikon D800e were two I had) were a nightmare to get sharp. Many will deny this, but I can say from my own experience, that something was going on, and it wasn’t good. At the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly Ming Thein’s conclusion). I suspect it was a combination of shutter slap and the sensor site designs. Both of which appear to have been solved. I have great faith in Jono’s reviews, and he has said more than once that the M10-R doesn’t suffer from pixel level blur. That said, if I want greater resolution (which I don’t), I would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... As to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an -----> improved !!!  sensor makes an image worse. I doubt this is actually possible. Improve either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. If you have an M10-R, there is little doubt that a 50 APO Summicron will give you better images than the previous pre-Asph 50 Summicron or Summilux lenses, though some may prefer the older lens rendering. Each to their own, I guess. I guess I'm one of those who deny this I still have my D800e and 100% crops from that are as sharp as from most anything that I've used. Even though the AA filter was removed from the 800e, there is still a low pass filter (albeit weaker than the AA filter in the original D800) so that does blur things a bit in comparison with the D850 for example, but that's not the result of having \"more pixels\"....the 850 actually has \"more\". I tend to do physical prints, so in theory higher resolution would benefit me by allowing more crop flexibility while maintaining a good print resolution. Practically, 24MP is plenty for that though. But also practically, even with my older computer systems, 40-50mp doesn't bog anything down for me, and there seems no downside to having higher resolution sensors. The irony is that for applications where the additional resolution would theoretically benefit (BIF or wildlife from afar), I'm typically handheld with a long telephoto doing my best to keep up with the subject. In those cases, regardless of IS or technique, the extra resolution doesn't often buy you what you'd like. On the other hand, for landscapes or other scenes that are composed, one can often define the framing and perspective as desired and even though the capability exists to cut way into the image, it's not needed and you end up throwing resolution away by the time you adjust for print. There are definitely some nature applications though where it is beneficial to crop into the scene because you can't physically get to where you want to. All in all, I'd take more resolution whenever it's available."}, {"autor": "fenykepesz", "posts": "74 posts", "date": "08/25/2021 03:30  PM", "content": "as i am trying to find out how to contact Leica/Wetzlar, i stumbled over this here : FIRMWARE (2.20.48.40) LEICA M10-D - Date: 01/28/2021 it's the first time i see this new firmware for the m10-d - did you know about this ? did anybody else in this forum already -----> install !!!  this 121MB larger binary ? is it any good ? any new quirks ?"}, {"autor": "petermullett", "posts": "837 posts", "date": "08/25/2021 03:44  PM", "content": "14 minutes ago, fenykepesz said: as i am trying to find out how to contact Leica/Wetzlar, i stumbled over this here : FIRMWARE (2.20.48.40) LEICA M10-D - Date: 01/28/2021 it's the first time i see this new firmware for the m10-d - did you know about this ? did anybody else in this forum already -----> install !!!  this 121MB larger binary ? is it any good ? any new quirks ? There are said to be some GPS improvements but you wisely don't bother with that next to useless facility anyway. May as well -----> install !!!  it though, there may be some other\"invisible\" improvements \"under the hood\". Edited August 25 by petermullett"}, {"autor": "petermullett", "posts": "837 posts", "date": "08/25/2021 03:44  PM", "content": "14 minutes ago, fenykepesz said: as i am trying to find out how to contact Leica/Wetzlar, i stumbled over this here : FIRMWARE (2.20.48.40) LEICA M10-D - Date: 01/28/2021 it's the first time i see this new firmware for the m10-d - did you know about this ? did anybody else in this forum already -----> install !!!  this 121MB larger binary ? is it any good ? any new quirks ? There are said to be some GPS improvements but you wisely don't bother with that next to useless facility anyway. May as well -----> install !!!  it though, there may be some other\"invisible\" improvements \"under the hood\". Edited August 25 by petermullett"}, {"autor": "egrossman", "posts": "321 posts", "date": "08/25/2021 08:15  PM", "content": "4 hours ago, petermullett said: did anybody else in this forum already -----> install !!!  this 121MB larger binary ? is it any good ? any new quirks ? I purchased my M10-D around the same time you did a couple of years ago. I've (knock on wood) not had any problems with the camera. I've upgraded it to new firmware a while ago but no noticeable improvements. Erik"}, {"autor": "Ktsa5239", "posts": "206 posts", "date": "10/05/2021 09:56  AM", "content": "Advertisement (gone after registration) So I've started playing around with taking portraits using a wide 28mm lens and realised that some shots the eyes are focus and some shots they are not. I thought it was weird until I realised that for certain compositions where I need to focus through the OVF and -----> recompose !!!  moving the centre off further, its enough the change the distance of the eye to the lens which bring the focus point to the front by alittle bit. How do you combat that without using an EVF ? I guess I could move back, leave the focus on the eyes and crop later but it's not giving me the same composition as before. Whats more strange is, I've never noticed this before using 50mm lens for portrait. Maybe I just never had to -----> recompose !!!  as much? Has anyone else found this to be a problem?"}, {"autor": "Ktsa5239", "posts": "206 posts", "date": "10/05/2021 09:56  AM", "content": "Advertisement (gone after registration) So I've started playing around with taking portraits using a wide 28mm lens and realised that some shots the eyes are focus and some shots they are not. I thought it was weird until I realised that for certain compositions where I need to focus through the OVF and -----> recompose !!!  moving the centre off further, its enough the change the distance of the eye to the lens which bring the focus point to the front by alittle bit. How do you combat that without using an EVF ? I guess I could move back, leave the focus on the eyes and crop later but it's not giving me the same composition as before. Whats more strange is, I've never noticed this before using 50mm lens for portrait. Maybe I just never had to -----> recompose !!!  as much? Has anyone else found this to be a problem?"}, {"autor": "ianman", "posts": "7,956 posts", "date": "10/05/2021 10:08  AM", "content": "9 minutes ago, Ktsa5239 said: Maybe I just never had to -----> recompose !!!  as much? It depends how you -----> recompose !!! . As long as you keep the distance between the focus plane and the sensor it will be ok. But that's the hard part."}, {"autor": "ianman", "posts": "7,956 posts", "date": "10/05/2021 10:08  AM", "content": "9 minutes ago, Ktsa5239 said: Maybe I just never had to -----> recompose !!!  as much? It depends how you -----> recompose !!! . As long as you keep the distance between the focus plane and the sensor it will be ok. But that's the hard part."}, {"autor": "evikne", "posts": "2,248 posts", "date": "10/05/2021 11:07  AM", "content": "I have -----> recomposed !!!  for many years, without any problems, even with my Noctilux f/1 wide open. As the others say: practice and experience. Remember the closer you get, the more careful you have to be, because the depth of field decreases. Usually, I don't have to recompose much. If I for example want to place a subject according to the golden ratio, very little recomposition is required: --img-- "}, {"autor": "evikne", "posts": "2,248 posts", "date": "10/05/2021 11:07  AM", "content": "I have -----> recompose !!! d for many years, without any problems, even with my Noctilux f/1 wide open. As the others say: practice and experience. Remember the closer you get, the more careful you have to be, because the depth of field decreases. Usually, I don't have to -----> recompose !!!  much. If I for example want to place a subject according to the golden ratio, very little recomposition is required: --img-- "}, {"autor": "mujk", "posts": "307 posts", "date": "10/05/2021 06:18  PM", "content": "I don't use the EVF particularly often when taking pictures, but have found it practical when experimenting with how the focus point and DOF of a particular lens behave when -----> recomposing !!!  at different distances and using different apertures."}, {"autor": "IkarusJohn", "posts": "10,133 posts", "date": "10/06/2021 06:41  PM", "content": "On 10/5/2021 at 10:56 PM, Ktsa5239 said: So I've started playing around with taking portraits using a wide 28mm lens and realised that some shots the eyes are focus and some shots they are not. I thought it was weird until I realised that for certain compositions where I need to focus through the OVF and -----> recompose !!!  moving the centre off further, its enough the change the distance of the eye to the lens which bring the focus point to the front by alittle bit. How do you combat that without using an EVF ? I guess I could move back, leave the focus on the eyes and crop later but it's not giving me the same composition as before. Whats more strange is, I've never noticed this before using 50mm lens for portrait. Maybe I just never had to -----> recompose !!!  as much? Has anyone else found this to be a problem? If you focus in the centre of the OVF, and rotate in any direction, the pane of best focus will move behind your subject (assuming the plane is consistently at right angles to the line of vision - that’s a significant assumption). In practical terms, focus, -----> recompose !!! , and rock backwards slightly. Edited October 6 by IkarusJohn"}, {"autor": "IkarusJohn", "posts": "10,133 posts", "date": "10/06/2021 06:41  PM", "content": "On 10/5/2021 at 10:56 PM, Ktsa5239 said: So I've started playing around with taking portraits using a wide 28mm lens and realised that some shots the eyes are focus and some shots they are not. I thought it was weird until I realised that for certain compositions where I need to focus through the OVF and -----> recompose !!!  moving the centre off further, its enough the change the distance of the eye to the lens which bring the focus point to the front by alittle bit. How do you combat that without using an EVF ? I guess I could move back, leave the focus on the eyes and crop later but it's not giving me the same composition as before. Whats more strange is, I've never noticed this before using 50mm lens for portrait. Maybe I just never had to -----> recompose !!!  as much? Has anyone else found this to be a problem? If you focus in the centre of the OVF, and rotate in any direction, the pane of best focus will move behind your subject (assuming the plane is consistently at right angles to the line of vision - that’s a significant assumption). In practical terms, focus, -----> recompose !!! , and rock backwards slightly. Edited October 6 by IkarusJohn"}, {"autor": "a.noctilux", "posts": "6,037 posts", "date": "10/07/2021 09:20  AM", "content": "To be more positive ... This pic is from Monochrom, but it was exercise for RF focus/-----> recompose !!!  as learning the 28mm Elmarit lens, wide open. Just this would not be the same rendering if everything is in focus, I like this pic as it is. --img--  Jardin des Plantes, Montpellier 'voyage d'étude' 😉"}, {"autor": "Al Brown", "posts": "597 posts", "date": "08/02/2021 08:41  PM", "content": "My last analog pit-stop was a black M6 TTL. I skipped M8 due to the IR issues and crop, skipped M9 due to CCD's not stellar high ISO performance and landed with a silver M240. Loved the camera in professional use for years - fat bodied M was the longest run digital Leica M (2012-2019) in all its alterations AFAIK - but grew frustrated with opened shadows' green hues, blown highlights and tiny buffer (7 images), three things most users probably never noticed. Loved the battery life and chubby dimensions of the M240 though. Finally treated myself to the M10R in black paint and boy oh boy is that a different camera on so many levels from my first digital \"2013 technology\" M, especially in day-to-day use. One of the awesome aspects of the upgrade is the ability to use the Mandler 75 lux without EVF (still not perfect, but much, much better) and to have it permanently memorized in camera as the one uncoded lens, automatically swapping to 6-bit with other two summiluxes I own. Some neat organic grain on higher ISO that looks good in classic press print and many other -----> improved !!!  details - including the highlight recovery ability. Edited August 2 by Al Brown"}, {"autor": "IkarusJohn", "posts": "10,133 posts", "date": "08/15/2021 03:35  AM", "content": "There are functional reasons for a number of the options which flow on from each other - specifically, the compatibility with the EVF and Fotos. So, the base model, M10 body, baseplate or no baseplate, sensor, processor etc already determined for the M11. So, just ISO; the shutter dial and shutter release, on/off ring; lens release; nothing else on the camera - no hotshoe; no Fn button; no front button; no thumbwheel. So these questions are relevant: YES/NO Review of images remaining after each shot battery % and remaining shots, and exposure arrows (I’d like two arrows in each dirrection) Faux film advance lever / thumbrest Yes On/off on shutter button Yes ISO dial on back I like the M10 design - if the ISO goes back onto the rear, what goes on the topdeck? A plain topdeck is very ugly. USB-C port. Yes (hidden somewhere - not on the base). With software, this could cover much of what is currently the Fotos App Frameline lever. No Continuous mode. No Self Timer mode. No Black paint. Yes Silver chrome. No Black chrome. No M11-D-M monochrom version. Yes With this base model (much like the M60), there’s only centre weighted metering, auto-white balance, no remote triggering (save with the USB-C), no continuous, and no self timer. The camera would really only be good with 28-90 focal lengths, no macro, no adapted R lenses. I’d be happy with this camera. I’d like the design to be nicely resolved, so it didn’t look odd - some of the special editions had nice ideas to break up what could look like a lot of blank real estate. If Wifi/fotos is to be included - useful for remote triggering, self timer and reviewing images at your leisure; uploading firmware; downloading images etc (these are all possible with other systems): Thumbwheel and bump Perhaps not in its current iteration, but the thumbwheel, Fn button and front button enable the selection of different metering modes, and moving the magnification point for when you enlarge through the EVF - more accurate than focus and -----> recompose !!! . Leica had considered a D control button (not so nice) for the M10-D. EVF added? Visoflex capable. The much of what is discussed above (thumbwell etc) would make sense. GPS This all rather moves away from what was originally conceived with the M60. As I like the option of Fotos (or USB-C), and sometimes use the EVF, it would take a bit to move me from the current M10-D. But, if the base model above was released as an M11-D, then I might consider it. It would go well with my M-A (black paint) and my ageing Monochrom (silver chrome). I do have an Elmar 135/4, but tend to only use 21-75 focal lengths, and I don’t use the macro adapter that often. My $0.02"}, {"autor": "williamgor", "posts": "3 posts", "date": "09/10/2021 06:39  AM", "content": "Advertisement (gone after registration) Hi Folks,I’m intrigued by the announcement of the ASC edition which has 2 “Cine Look” modes to reproduce analogue and digital “motion picture looks” and that there are frameline settings for cinema ratios. my question is whether one could -----> install !!!  the asc firmware on an M10P? would love those settings on mine."}, {"autor": "rwchisholm", "posts": "152 posts", "date": "07/07/2017 05:52  PM", "content": "Advertisement (gone after registration) Hello all! A lot of folks buy an M camera (and I suspect many new users as the M10 is fantastic) but are at a loss for a good set of lenses. I think it is beneficial to list some good setups. Not one les that is good but a combination of lenses to cover most shooting situations and why. I'll start with my most useful setup; I've taken into consideration price and lens character to make this assessment. In my mind, everything Leica M starts with the 50. Now, for the uninitiated, 50mm is the easiest focal length for manufacturers to make great. Tons and tons of choices. After trying about everything, and given cost, my ideal minimum 50 setup is: Zeiss 50 f2 Planar AND 50 f1.5 Sonnar. -----> Optimized !!!  to 1.5 Together about 2 grand. The planar is an amazing everyday 50. The Sonnar is incredible wide open. Now it gets tricky.... Wide: Voigtlander 21mm 1.9. Great lens. Mid range: a combo of lenses: 28 summilux (absolute favorite lens - outstanding optics and bokeh). Plus a 35: would choose Leica 35 summarit OR older Leica 35 pre aspherical Cron (like version IV) OR Voigtlander 35 mm color Skopar OR Zeiss 35mm 2.8 You've got wide and midrange. Now you know a zoom. My FAVORITE is 75 LUX However if cost is consideration, the 90 TELE-ELMARIT is inexpensive and fantastic. And small. My preference is going expensive with one lens (in my case the 28 Lux) and moderate on the others. My lenses: the 21 Voigtlander, the 28 Lux, 35 color Skopar, both Zeiss 50s and 90 tele elmarit is relatively inexpensive -- except the 28 lux-- and amazing all around. You could go 28 elmarit and save cash and have an awesome small in size lens setup. Rob Sent from my iPhone using Tapatalk"}, {"autor": "arno_nyhm", "posts": "1,815 posts", "date": "07/07/2017 07:50  PM", "content": "i go for 21/3,4 SEM for the wider angles 35/2 Summicron for anything else. 90/2,8 elmarit, if needed. but i dont. (...) my ideal minimum 50 setup is:Zeiss50 f2 Planar AND50 f1.5 Sonnar. -----> Optimized !!!  to 1.5 sorry, rob. i rather disagree. it neither is cheaper than a summicron 50/2 nor is it really better. and why would i want to carry two 50 lenses at a time while not having any other focal length handy? f 1.5 is not what the M10 needs..."}, {"autor": "Printmaker", "posts": "1,680 posts", "date": "07/08/2017 02:36  AM", "content": "I'm experimenting with a new combo on my M10: 75/2 Summicron and my trusty 35/2 Summicron (type 4). So far this combo is working like a charm. I'm using the 75 as a tight 50 and as a portrait lens. Normally I'd pack 35, 50 and 90 but I'm trying to keep the size and weight of my kit to a minimum. The 75 is handling the double duty admirably. One of the nicest features with the M10 is the -----> improved !!!  frame lines. These make the 75 mm frame clearly visible. What can I say about the 35 mm Summicron? It is the one lens no Leica user should be without. The 35 Summicron is perfect for landscapes, tight streets and almost every other occasion. For extensive travel I bring along a 21/3.4 SEM and my trusty Monochrom wearing a 50/2 Summicron. In fact, I have two 50/2 Summicrons and will probably trade one in on a 135/4 Tele-Elmar"}, {"autor": "BlackBarn", "posts": "625 posts", "date": "08/04/2021 05:21  AM", "content": "As a non techie - Can anyone tell me what the difference is between -----> optimizing !!!  a lens to a camera and calibrating a lens/camera. I am in discussion with Leica through our NZ Leica rep regarding -----> optimizing !!!  a lens with my M cameras. This is the reply they received: ‘They (Leica Germany) advised that it is always recommended to optimize all lenses to your camera. It is possible that if they will optimize your camera with only the 50mm lux, some other lenses will not focus perfectly on the camera anymore and needed to be optimized too’"}, {"autor": "BlackBarn", "posts": "625 posts", "date": "08/04/2021 05:21  AM", "content": "As a non techie - Can anyone tell me what the difference is between -----> optimizing !!!  a lens to a camera and calibrating a lens/camera. I am in discussion with Leica through our NZ Leica rep regarding -----> optimizing !!!  a lens with my M cameras. This is the reply they received: ‘They (Leica Germany) advised that it is always recommended to optimize all lenses to your camera. It is possible that if they will optimize your camera with only the 50mm lux, some other lenses will not focus perfectly on the camera anymore and needed to be optimized too’"}, {"autor": "BlackBarn", "posts": "625 posts", "date": "08/04/2021 05:21  AM", "content": "As a non techie - Can anyone tell me what the difference is between optimizing a lens to a camera and calibrating a lens/camera. I am in discussion with Leica through our NZ Leica rep regarding optimizing a lens with my M cameras. This is the reply they received: ‘They (Leica Germany) advised that it is always recommended to -----> optimize !!!  all lenses to your camera. It is possible that if they will -----> optimize !!!  your camera with only the 50mm lux, some other lenses will not focus perfectly on the camera anymore and needed to be -----> optimize !!! d too’"}, {"autor": "BlackBarn", "posts": "625 posts", "date": "08/04/2021 05:21  AM", "content": "As a non techie - Can anyone tell me what the difference is between optimizing a lens to a camera and calibrating a lens/camera. I am in discussion with Leica through our NZ Leica rep regarding optimizing a lens with my M cameras. This is the reply they received: ‘They (Leica Germany) advised that it is always recommended to -----> optimize !!!  all lenses to your camera. It is possible that if they will -----> optimize !!!  your camera with only the 50mm lux, some other lenses will not focus perfectly on the camera anymore and needed to be -----> optimize !!! d too’"}, {"autor": "BlackBarn", "posts": "625 posts", "date": "08/04/2021 05:21  AM", "content": "As a non techie - Can anyone tell me what the difference is between optimizing a lens to a camera and calibrating a lens/camera. I am in discussion with Leica through our NZ Leica rep regarding optimizing a lens with my M cameras. This is the reply they received: ‘They (Leica Germany) advised that it is always recommended to optimize all lenses to your camera. It is possible that if they will optimize your camera with only the 50mm lux, some other lenses will not focus perfectly on the camera anymore and needed to be -----> optimized !!!  too’"}, {"autor": "Gobert", "posts": "991 posts", "date": "08/04/2021 05:54  AM", "content": "31 minutes ago, BlackBarn said: As a non techie - Can anyone tell me what the difference is between -----> optimizing !!!  a lens to a camera and calibrating a lens/camera. I am in discussion with Leica through our NZ Leica rep regarding -----> optimizing !!!  a lens with my M cameras. This is the reply they received: ‘They (Leica Germany) advised that it is always recommended to optimize all lenses to your camera. It is possible that if they will optimize your camera with only the 50mm lux, some other lenses will not focus perfectly on the camera anymore and needed to be optimized too’ I have two bodies… optimization is not possible?"}, {"autor": "Gobert", "posts": "991 posts", "date": "08/04/2021 05:54  AM", "content": "31 minutes ago, BlackBarn said: As a non techie - Can anyone tell me what the difference is between -----> optimizing !!!  a lens to a camera and calibrating a lens/camera. I am in discussion with Leica through our NZ Leica rep regarding -----> optimizing !!!  a lens with my M cameras. This is the reply they received: ‘They (Leica Germany) advised that it is always recommended to optimize all lenses to your camera. It is possible that if they will optimize your camera with only the 50mm lux, some other lenses will not focus perfectly on the camera anymore and needed to be optimized too’ I have two bodies… optimization is not possible?"}, {"autor": "Gobert", "posts": "991 posts", "date": "08/04/2021 05:54  AM", "content": "31 minutes ago, BlackBarn said: As a non techie - Can anyone tell me what the difference is between optimizing a lens to a camera and calibrating a lens/camera. I am in discussion with Leica through our NZ Leica rep regarding optimizing a lens with my M cameras. This is the reply they received: ‘They (Leica Germany) advised that it is always recommended to -----> optimize !!!  all lenses to your camera. It is possible that if they will -----> optimize !!!  your camera with only the 50mm lux, some other lenses will not focus perfectly on the camera anymore and needed to be -----> optimize !!! d too’ I have two bodies… optimization is not possible?"}, {"autor": "Gobert", "posts": "991 posts", "date": "08/04/2021 05:54  AM", "content": "31 minutes ago, BlackBarn said: As a non techie - Can anyone tell me what the difference is between optimizing a lens to a camera and calibrating a lens/camera. I am in discussion with Leica through our NZ Leica rep regarding optimizing a lens with my M cameras. This is the reply they received: ‘They (Leica Germany) advised that it is always recommended to -----> optimize !!!  all lenses to your camera. It is possible that if they will -----> optimize !!!  your camera with only the 50mm lux, some other lenses will not focus perfectly on the camera anymore and needed to be -----> optimize !!! d too’ I have two bodies… optimization is not possible?"}, {"autor": "Gobert", "posts": "991 posts", "date": "08/04/2021 05:54  AM", "content": "31 minutes ago, BlackBarn said: As a non techie - Can anyone tell me what the difference is between optimizing a lens to a camera and calibrating a lens/camera. I am in discussion with Leica through our NZ Leica rep regarding optimizing a lens with my M cameras. This is the reply they received: ‘They (Leica Germany) advised that it is always recommended to optimize all lenses to your camera. It is possible that if they will optimize your camera with only the 50mm lux, some other lenses will not focus perfectly on the camera anymore and needed to be -----> optimized !!!  too’ I have two bodies… optimization is not possible?"}, {"autor": "JonPB", "posts": "193 posts", "date": "08/04/2021 06:43  AM", "content": "For a rangefinder camera to focus accurately, both lens and camera must agree on what indicates nearest, what indicates infinity, and the curve that plots all points in between. This is because the rangefinder, unlike a view camera, SLR, or EVF camera, does not inspect the lens’ image directly to evaluate focus. Instead, one mechanism gauges distance to subject (the wheel at the top of the shutter box and the mechanics it attaches to in the camera, and the ring that moves in and out of the inside of the mount of the lens), and an independent mechanism adjusts the lens to focus at that distance (the distance between sensor and lens mount in the camera, including film plane flatness where relevant, and the movement of the optical cell(s) relative to the mount in the lens). Both systems must agree in box camera and lens to achieve optimum focus. This is a surprisingly complex problem. Possibilities that come to mind for a system that focuses past infinity in the center of the frame include: It might be working as intended. The lens might have field curvature and the lens designer -----> optimized !!!  it to attain maximum resolution, i.e. to be in focus, in a ring around the center of the image, not the axis or corners. With recent lenses, you might look at the MTF curves; in the curve for the appropriate aperture, if the lowest dashed/solid pair of curves slopes upward from the left edge before falling down toward the right edge, then this behavior can be expected (but is unlikely to be visible when viewing the full image). It might be working as intended, part two: the lens was calibrated to place focus in the middle of the thickness of a sheet of film, but it is being used on a digital sensor which does not behave as if it has thickness. In this case, the lens is effectively focusing behind the sensor, so focusing closer (moving the lens away from the sensor) improves resolution. It might be working as intended, part three: all lenses have aberrations, some of these aberrations occur mostly in front of or behind the focus plane, and some of those are reduced when changing aperture. Removing aberrations in front of the focus plane will shift optimum focus backwards without changing actual focus at all. Designers of lenses with this focus shift behavior must choose which aperture the focus setting is -----> optimized !!!  for. It might be working as intended, part four: our metal lenses are more responsive to temperature changes than a well-designed plastic housing, so hot or cold temperatures have elongated/constricted enough material to change focus. I haven’t heard of this in practice, though; or, if it has changed enough to alter focus, the photographer has more pressing issues. It is working as intended, part five: your demand for focus has exceeded the design specifications. This may well be expected of extreme lenses: 135/3.4, 90/2, 50/1.2 lenses or with wider aperture might be within allowable tolerances yet still not perform well together. Changing both or either might improve performance in that equipment pairing yet impair performance of the calibrated device with most other M systems. Neither are working as intended, but they both agree with each other, mostly. To make the system work, all M lenses and cameras are designed to align within a given tolerance of a certain specification. But the spec doesn’t matter so long as the parts interacting do so agreeably. This is why testing multiple items helps identify the problem: if you have lens A, lens B, and camera 1, and two of them agree with each other but not the third, most likely the third would benefit from calibration. The camera is miscalibrated for focus throw: the shouldn’t be a problem at infinity, but might be at any other distance. The camera is miscalibrated for infinity: all properly calibrated lenses tend to show the same error. Adjusting camera will improve its performance with most lenses. The lens is miscalibrated for focus throw: some lenses have been modified by people who didn’t understand the system; sometimes this can be fixed by rotating the modified part out of the way. The lens is miscalibrated for infinity: as above or can be adjusted with shims. The camera and/or lens are misaligned. This can be expected with devices that show significant dents, and also when using imprecise adapters. So, there can be no generic answer to satisfy this kind of problem. It is not uncommon for rangefinder shooters to learn that lens a at aperture b needs to be adjusted like so when working at distance c, and so forth. I know that this is not a satisfying answer, but it is part of the package deal when extracting such high image quality from mechanical devices of this size."}, {"autor": "JonPB", "posts": "193 posts", "date": "08/04/2021 06:43  AM", "content": "For a rangefinder camera to focus accurately, both lens and camera must agree on what indicates nearest, what indicates infinity, and the curve that plots all points in between. This is because the rangefinder, unlike a view camera, SLR, or EVF camera, does not inspect the lens’ image directly to evaluate focus. Instead, one mechanism gauges distance to subject (the wheel at the top of the shutter box and the mechanics it attaches to in the camera, and the ring that moves in and out of the inside of the mount of the lens), and an independent mechanism adjusts the lens to focus at that distance (the distance between sensor and lens mount in the camera, including film plane flatness where relevant, and the movement of the optical cell(s) relative to the mount in the lens). Both systems must agree in box camera and lens to achieve optimum focus. This is a surprisingly complex problem. Possibilities that come to mind for a system that focuses past infinity in the center of the frame include: It might be working as intended. The lens might have field curvature and the lens designer -----> optimized !!!  it to attain maximum resolution, i.e. to be in focus, in a ring around the center of the image, not the axis or corners. With recent lenses, you might look at the MTF curves; in the curve for the appropriate aperture, if the lowest dashed/solid pair of curves slopes upward from the left edge before falling down toward the right edge, then this behavior can be expected (but is unlikely to be visible when viewing the full image). It might be working as intended, part two: the lens was calibrated to place focus in the middle of the thickness of a sheet of film, but it is being used on a digital sensor which does not behave as if it has thickness. In this case, the lens is effectively focusing behind the sensor, so focusing closer (moving the lens away from the sensor) improves resolution. It might be working as intended, part three: all lenses have aberrations, some of these aberrations occur mostly in front of or behind the focus plane, and some of those are reduced when changing aperture. Removing aberrations in front of the focus plane will shift optimum focus backwards without changing actual focus at all. Designers of lenses with this focus shift behavior must choose which aperture the focus setting is -----> optimized !!!  for. It might be working as intended, part four: our metal lenses are more responsive to temperature changes than a well-designed plastic housing, so hot or cold temperatures have elongated/constricted enough material to change focus. I haven’t heard of this in practice, though; or, if it has changed enough to alter focus, the photographer has more pressing issues. It is working as intended, part five: your demand for focus has exceeded the design specifications. This may well be expected of extreme lenses: 135/3.4, 90/2, 50/1.2 lenses or with wider aperture might be within allowable tolerances yet still not perform well together. Changing both or either might improve performance in that equipment pairing yet impair performance of the calibrated device with most other M systems. Neither are working as intended, but they both agree with each other, mostly. To make the system work, all M lenses and cameras are designed to align within a given tolerance of a certain specification. But the spec doesn’t matter so long as the parts interacting do so agreeably. This is why testing multiple items helps identify the problem: if you have lens A, lens B, and camera 1, and two of them agree with each other but not the third, most likely the third would benefit from calibration. The camera is miscalibrated for focus throw: the shouldn’t be a problem at infinity, but might be at any other distance. The camera is miscalibrated for infinity: all properly calibrated lenses tend to show the same error. Adjusting camera will improve its performance with most lenses. The lens is miscalibrated for focus throw: some lenses have been modified by people who didn’t understand the system; sometimes this can be fixed by rotating the modified part out of the way. The lens is miscalibrated for infinity: as above or can be adjusted with shims. The camera and/or lens are misaligned. This can be expected with devices that show significant dents, and also when using imprecise adapters. So, there can be no generic answer to satisfy this kind of problem. It is not uncommon for rangefinder shooters to learn that lens a at aperture b needs to be adjusted like so when working at distance c, and so forth. I know that this is not a satisfying answer, but it is part of the package deal when extracting such high image quality from mechanical devices of this size."}, {"autor": "wolan", "posts": "275 posts", "date": "05/31/2021 07:33  AM", "content": "Without new batteries with -----> improved !!!  battery life the new Visoflex will be useless"}, {"autor": "jaapv", "posts": "66,415 posts", "date": "06/17/2021 07:53  PM", "content": "On 5/31/2021 at 9:33 AM, wolan said: Without new batteries with -----> improved !!!  battery life the new Visoflex will be useless And more processing power."}, {"autor": "pop", "posts": "21,132 posts", "date": "07/18/2021 08:09  AM", "content": "Advertisement (gone after registration) There's a project on Kickstarter, which may be of interest to users of the M10: an -----> improved !!!  handgrip which lets you access both the SD card and the battery compartment even while mounted on a tripod: http://kck.st/3ij3agE The usual caveats apply when supporting a project on Kickstarter."}, {"autor": "farnz", "posts": "25,167 posts", "date": "07/22/2021 10:53  AM", "content": "On 7/18/2021 at 9:09 AM, pop said: There's a project on Kickstarter, which may be of interest to users of the M10: an -----> improved !!!  handgrip which lets you access both the SD card and the battery compartment even while mounted on a tripod: http://kck.st/3ij3agE The usual caveats apply when supporting a project on Kickstarter. Thank you for posting, Philipp. It's interesting although not something I think I'd go for. I do like the integral Arca-Swiss mount, which seems like an excellent idea. Pete."}, {"autor": "Adam Bonn", "posts": "459 posts", "date": "08/04/2021 06:44  PM", "content": "Advertisement (gone after registration) Firstly, apologies for this - I've not much to say, but no doubt will take quite a while (and words) to do so! I came to Leica in 2017, I'd long fancied an M9 but it was a big outlay financially. They announced that they'd be ceasing the free sensor replacement which I figured wouldn't help them get any cheaper (if they'd had the new sensor) and wouldn't make them a safe bet if they hadn't. So the time was now (well then, aw you get what I mean) A low mileage official dealer supplied example came up at the right time and as they say on forums such as this I pulled the trigger Now truth be told I expected to use the M9 a bit like a classic sports' car (not that I own one) - sunny Sunday drives down country lanes, with a modern practical car for everyday. Long story short, I quickly became seduced by using a rangefinder, the cerebral challenges of a simple camera, and well boy meets Leica M - a story as old as the hills. My other brand cameras were relegated to the gear cupboard and the M9 and I partied like it was 2009 Of course the M9 does have some limitations, and I found myself wanting and needing something a little more modern for certain things. Enter the M240. I bought this camera because it was comparatively cheap, and had more ISO which I needed. Whereas I quite liked the 240, I never loved it. I found it quite hard work. Sure it performed better than the M9 with DR and ISO and I was glad of that. But the files needed more work in post, the camera was less nice in the hand and well.. we got on well enough but but it wasn't love I decided to see what the M11 did to M10 prices on the used market. About a month later my local AD got a secondhand M10 in, factory refurbished with new top and bottom plates (I don't want to know why it needed those....), the so important to me, warranty and at a price that was merely excruciating rather than terminal. I bounced into the store as they opened and... ...no M10 Sold? Nope - reserved for someone. You'll have to wait a week to see if I can sell to you It was a long week, that ended with a mad dash across the city to catch the store before closing. (Guy it was reserved for ended up buying a new m10R instead) I had a couple of DMs from folks asking about the whole M9/240/M10 comparison thing (which I've replied too), so that's not really what this missive is and besides that's all been done before I think? Also of course the early and mid adopters of the M10 have already shared their reviews and thoughts, so possibly I've little to add of value. But that said! I'm really very happy with the M10! My first concern was the reduced battery life compared to the 240.. well it is less, but as I'm not much of a chimper, tend to switch my camera off between shots, don't own the EVF, seldom use live view and can't be bothered to -----> install !!!  the phone app thing = my battery life is great 😁 Usually about 650-750 shots. The headline feature of the M10 is that it's thinner. I'm genuinely surprised at how much I notice this and how much better it feels in my hand than the 240 (I have small hands) - of course the weight distribution helps here too, the M10 has better balance than the 240 (less front heavy, and mass concentrated into a smaller area feels more nimble, it's a technique used in sports motorcycle design) The next headline feature (I guess) is the improved viewfinder. I didn't notice this in the store, but it's tangibly bigger and easier to use. I don't wear glasses, but I do wear sun glasses a lot and it's a lot nicer to use wearing them, 35mm framelines work better for me too. But I guess the key upgrade reason was the ISO improvements and what the internet seems to have dubbed the colour science Lets start with the ISO. This is easy. Yeah it's a ton better. And not just more ISO less noise better, but more exposure push in post, image doesn't end up with more banding than a field of Zebras better. Massive score IMO Re colours.. well when I go through my LR catalogue thumbnails it's not always completely obvious if I'm looking at a M10 or 240 shot... the colours are not poles apart, but I find the M10 DNGs nicer to work on, there's a lot of pleasing (to me) pop and contrast and bite from the off. Skins tones of the people I shoot look better to me (and them) too. In fact a custom DCP and a preset with a little contrast gets me most of the way there during DNG import, personally (OMMV) I found the 240 images were a lot more case by case with different images needing quite separate types of work to get what I liked. This was the main thing I missed from the M9 (which I still have) with the 240. It was just how the M9 images usually arrived pretty close to being usable (or completely useless), whereas always the 240 demanded work (obviously YMMV, you may use different tools or the same tools in a better way) In fact I've little to complain about with the M10 (well the price 🙄) and of course all the things that you've read on here already, the too stiff to lift ISO dial, the missing (for me, YMMV) cont/timed modes on the power switch (especially as timed isn't retained if you power off) - menu diving isn't what I associate with Leica... There's only really one fly in my personal M10 ointment (which I knew about before I bought it, not complaining too heavily, honest) Who's clucking bright idea was it too make base ISO inaccessible? WTAF? As you all know, you face a choice ISO 100 and don't dare clip a highlight or ISO 200 and hope the shadows aren't too murky if you need to recover them heavily Which, to me at least, makes ISO selection important for scenes where frankly it should be set base and forget (a colour RAW histogram might help here too...) But I can't stress enough... the camera is a tool, they all have foibles and we need to learn to use them to get what we want. So in some sort of summary The M10 compared to the M9. There's only one M9. The M10 isn't like an M9 v2.0 or something. It's just closer than the 240 was. The M9 colours are great and everything, but for me the M9 magic is the tonality, the glowing colours and airy light pictures. The M10 compared to the M240 On paper there's very little in it, but sincerely all those little improvements really do add up. The IQ is tangibly better, the ISO is far more usable, and it's just a nicer object to hold and use. (Which is important, cars get bought cos of the spec - they get sold if they're uncomfortable to drive) The M10 compared to the M11 ahahaha just messing - ask Jono or someone And that's the thing... Soon enough arrives the M11 Many here will get one, and I guess some you will use the opportunity to get an M10... Getting a camera that's not a current model has more than just price benefits... the firmware is mature, manufacturing bugs should be eliminated and the forums are full of tips and tricks for getting the most out of it written by people that have shot with one for some years If you've sat on the fence about the M10 and are figuring that now might be the time to jump, well I sincerely believe that you'll be happy with it. I know I am Thanks for reading."}, {"autor": "Adam Bonn", "posts": "459 posts", "date": "08/04/2021 06:44  PM", "content": "Advertisement (gone after registration) Firstly, apologies for this - I've not much to say, but no doubt will take quite a while (and words) to do so! I came to Leica in 2017, I'd long fancied an M9 but it was a big outlay financially. They announced that they'd be ceasing the free sensor replacement which I figured wouldn't help them get any cheaper (if they'd had the new sensor) and wouldn't make them a safe bet if they hadn't. So the time was now (well then, aw you get what I mean) A low mileage official dealer supplied example came up at the right time and as they say on forums such as this I pulled the trigger Now truth be told I expected to use the M9 a bit like a classic sports' car (not that I own one) - sunny Sunday drives down country lanes, with a modern practical car for everyday. Long story short, I quickly became seduced by using a rangefinder, the cerebral challenges of a simple camera, and well boy meets Leica M - a story as old as the hills. My other brand cameras were relegated to the gear cupboard and the M9 and I partied like it was 2009 Of course the M9 does have some limitations, and I found myself wanting and needing something a little more modern for certain things. Enter the M240. I bought this camera because it was comparatively cheap, and had more ISO which I needed. Whereas I quite liked the 240, I never loved it. I found it quite hard work. Sure it performed better than the M9 with DR and ISO and I was glad of that. But the files needed more work in post, the camera was less nice in the hand and well.. we got on well enough but but it wasn't love I decided to see what the M11 did to M10 prices on the used market. About a month later my local AD got a secondhand M10 in, factory refurbished with new top and bottom plates (I don't want to know why it needed those....), the so important to me, warranty and at a price that was merely excruciating rather than terminal. I bounced into the store as they opened and... ...no M10 Sold? Nope - reserved for someone. You'll have to wait a week to see if I can sell to you It was a long week, that ended with a mad dash across the city to catch the store before closing. (Guy it was reserved for ended up buying a new m10R instead) I had a couple of DMs from folks asking about the whole M9/240/M10 comparison thing (which I've replied too), so that's not really what this missive is and besides that's all been done before I think? Also of course the early and mid adopters of the M10 have already shared their reviews and thoughts, so possibly I've little to add of value. But that said! I'm really very happy with the M10! My first concern was the reduced battery life compared to the 240.. well it is less, but as I'm not much of a chimper, tend to switch my camera off between shots, don't own the EVF, seldom use live view and can't be bothered to install the phone app thing = my battery life is great 😁 Usually about 650-750 shots. The headline feature of the M10 is that it's thinner. I'm genuinely surprised at how much I notice this and how much better it feels in my hand than the 240 (I have small hands) - of course the weight distribution helps here too, the M10 has better balance than the 240 (less front heavy, and mass concentrated into a smaller area feels more nimble, it's a technique used in sports motorcycle design) The next headline feature (I guess) is the -----> improved !!!  viewfinder. I didn't notice this in the store, but it's tangibly bigger and easier to use. I don't wear glasses, but I do wear sun glasses a lot and it's a lot nicer to use wearing them, 35mm framelines work better for me too. But I guess the key upgrade reason was the ISO improvements and what the internet seems to have dubbed the colour science Lets start with the ISO. This is easy. Yeah it's a ton better. And not just more ISO less noise better, but more exposure push in post, image doesn't end up with more banding than a field of Zebras better. Massive score IMO Re colours.. well when I go through my LR catalogue thumbnails it's not always completely obvious if I'm looking at a M10 or 240 shot... the colours are not poles apart, but I find the M10 DNGs nicer to work on, there's a lot of pleasing (to me) pop and contrast and bite from the off. Skins tones of the people I shoot look better to me (and them) too. In fact a custom DCP and a preset with a little contrast gets me most of the way there during DNG import, personally (OMMV) I found the 240 images were a lot more case by case with different images needing quite separate types of work to get what I liked. This was the main thing I missed from the M9 (which I still have) with the 240. It was just how the M9 images usually arrived pretty close to being usable (or completely useless), whereas always the 240 demanded work (obviously YMMV, you may use different tools or the same tools in a better way) In fact I've little to complain about with the M10 (well the price 🙄) and of course all the things that you've read on here already, the too stiff to lift ISO dial, the missing (for me, YMMV) cont/timed modes on the power switch (especially as timed isn't retained if you power off) - menu diving isn't what I associate with Leica... There's only really one fly in my personal M10 ointment (which I knew about before I bought it, not complaining too heavily, honest) Who's clucking bright idea was it too make base ISO inaccessible? WTAF? As you all know, you face a choice ISO 100 and don't dare clip a highlight or ISO 200 and hope the shadows aren't too murky if you need to recover them heavily Which, to me at least, makes ISO selection important for scenes where frankly it should be set base and forget (a colour RAW histogram might help here too...) But I can't stress enough... the camera is a tool, they all have foibles and we need to learn to use them to get what we want. So in some sort of summary The M10 compared to the M9. There's only one M9. The M10 isn't like an M9 v2.0 or something. It's just closer than the 240 was. The M9 colours are great and everything, but for me the M9 magic is the tonality, the glowing colours and airy light pictures. The M10 compared to the M240 On paper there's very little in it, but sincerely all those little improvements really do add up. The IQ is tangibly better, the ISO is far more usable, and it's just a nicer object to hold and use. (Which is important, cars get bought cos of the spec - they get sold if they're uncomfortable to drive) The M10 compared to the M11 ahahaha just messing - ask Jono or someone And that's the thing... Soon enough arrives the M11 Many here will get one, and I guess some you will use the opportunity to get an M10... Getting a camera that's not a current model has more than just price benefits... the firmware is mature, manufacturing bugs should be eliminated and the forums are full of tips and tricks for getting the most out of it written by people that have shot with one for some years If you've sat on the fence about the M10 and are figuring that now might be the time to jump, well I sincerely believe that you'll be happy with it. I know I am Thanks for reading."}, {"autor": "charles tay", "posts": "76 posts", "date": "08/05/2021 03:23  PM", "content": "20 hours ago, Adam Bonn said: Firstly, apologies for this - I've not much to say, but no doubt will take quite a while (and words) to do so! I came to Leica in 2017, I'd long fancied an M9 but it was a big outlay financially. They announced that they'd be ceasing the free sensor replacement which I figured wouldn't help them get any cheaper (if they'd had the new sensor) and wouldn't make them a safe bet if they hadn't. So the time was now (well then, aw you get what I mean) A low mileage official dealer supplied example came up at the right time and as they say on forums such as this I pulled the trigger Now truth be told I expected to use the M9 a bit like a classic sports' car (not that I own one) - sunny Sunday drives down country lanes, with a modern practical car for everyday. Long story short, I quickly became seduced by using a rangefinder, the cerebral challenges of a simple camera, and well boy meets Leica M - a story as old as the hills. My other brand cameras were relegated to the gear cupboard and the M9 and I partied like it was 2009 Of course the M9 does have some limitations, and I found myself wanting and needing something a little more modern for certain things. Enter the M240. I bought this camera because it was comparatively cheap, and had more ISO which I needed. Whereas I quite liked the 240, I never loved it. I found it quite hard work. Sure it performed better than the M9 with DR and ISO and I was glad of that. But the files needed more work in post, the camera was less nice in the hand and well.. we got on well enough but but it wasn't love I decided to see what the M11 did to M10 prices on the used market. About a month later my local AD got a secondhand M10 in, factory refurbished with new top and bottom plates (I don't want to know why it needed those....), the so important to me, warranty and at a price that was merely excruciating rather than terminal. I bounced into the store as they opened and... ...no M10 Sold? Nope - reserved for someone. You'll have to wait a week to see if I can sell to you It was a long week, that ended with a mad dash across the city to catch the store before closing. (Guy it was reserved for ended up buying a new m10R instead) I had a couple of DMs from folks asking about the whole M9/240/M10 comparison thing (which I've replied too), so that's not really what this missive is and besides that's all been done before I think? Also of course the early and mid adopters of the M10 have already shared their reviews and thoughts, so possibly I've little to add of value. But that said! I'm really very happy with the M10! My first concern was the reduced battery life compared to the 240.. well it is less, but as I'm not much of a chimper, tend to switch my camera off between shots, don't own the EVF, seldom use live view and can't be bothered to -----> install !!!  the phone app thing = my battery life is great 😁 Usually about 650-750 shots. The headline feature of the M10 is that it's thinner. I'm genuinely surprised at how much I notice this and how much better it feels in my hand than the 240 (I have small hands) - of course the weight distribution helps here too, the M10 has better balance than the 240 (less front heavy, and mass concentrated into a smaller area feels more nimble, it's a technique used in sports motorcycle design) The next headline feature (I guess) is the improved viewfinder. I didn't notice this in the store, but it's tangibly bigger and easier to use. I don't wear glasses, but I do wear sun glasses a lot and it's a lot nicer to use wearing them, 35mm framelines work better for me too. But I guess the key upgrade reason was the ISO improvements and what the internet seems to have dubbed the colour science Lets start with the ISO. This is easy. Yeah it's a ton better. And not just more ISO less noise better, but more exposure push in post, image doesn't end up with more banding than a field of Zebras better. Massive score IMO Re colours.. well when I go through my LR catalogue thumbnails it's not always completely obvious if I'm looking at a M10 or 240 shot... the colours are not poles apart, but I find the M10 DNGs nicer to work on, there's a lot of pleasing (to me) pop and contrast and bite from the off. Skins tones of the people I shoot look better to me (and them) too. In fact a custom DCP and a preset with a little contrast gets me most of the way there during DNG import, personally (OMMV) I found the 240 images were a lot more case by case with different images needing quite separate types of work to get what I liked. This was the main thing I missed from the M9 (which I still have) with the 240. It was just how the M9 images usually arrived pretty close to being usable (or completely useless), whereas always the 240 demanded work (obviously YMMV, you may use different tools or the same tools in a better way) In fact I've little to complain about with the M10 (well the price 🙄) and of course all the things that you've read on here already, the too stiff to lift ISO dial, the missing (for me, YMMV) cont/timed modes on the power switch (especially as timed isn't retained if you power off) - menu diving isn't what I associate with Leica... There's only really one fly in my personal M10 ointment (which I knew about before I bought it, not complaining too heavily, honest) Who's clucking bright idea was it too make base ISO inaccessible? WTAF? As you all know, you face a choice ISO 100 and don't dare clip a highlight or ISO 200 and hope the shadows aren't too murky if you need to recover them heavily Which, to me at least, makes ISO selection important for scenes where frankly it should be set base and forget (a colour RAW histogram might help here too...) But I can't stress enough... the camera is a tool, they all have foibles and we need to learn to use them to get what we want. So in some sort of summary The M10 compared to the M9. There's only one M9. The M10 isn't like an M9 v2.0 or something. It's just closer than the 240 was. The M9 colours are great and everything, but for me the M9 magic is the tonality, the glowing colours and airy light pictures. The M10 compared to the M240 On paper there's very little in it, but sincerely all those little improvements really do add up. The IQ is tangibly better, the ISO is far more usable, and it's just a nicer object to hold and use. (Which is important, cars get bought cos of the spec - they get sold if they're uncomfortable to drive) The M10 compared to the M11 ahahaha just messing - ask Jono or someone And that's the thing... Soon enough arrives the M11 Many here will get one, and I guess some you will use the opportunity to get an M10... Getting a camera that's not a current model has more than just price benefits... the firmware is mature, manufacturing bugs should be eliminated and the forums are full of tips and tricks for getting the most out of it written by people that have shot with one for some years If you've sat on the fence about the M10 and are figuring that now might be the time to jump, well I sincerely believe that you'll be happy with it. I know I am Thanks for reading. Just curious... did you not consider SL2 or SL2-S with superior sensor over M10. Why M10 over SL models? I tried M10 Pre loved unit + M Lens and SL2-S with M Lens. I love the SL2-S technology but the size is a turn off. So i am hovering between M10 w M lens or Sl2-S with M Lens. Edited August 5 by charles tay"}, {"autor": "charles tay", "posts": "76 posts", "date": "08/05/2021 03:23  PM", "content": "20 hours ago, Adam Bonn said: Firstly, apologies for this - I've not much to say, but no doubt will take quite a while (and words) to do so! I came to Leica in 2017, I'd long fancied an M9 but it was a big outlay financially. They announced that they'd be ceasing the free sensor replacement which I figured wouldn't help them get any cheaper (if they'd had the new sensor) and wouldn't make them a safe bet if they hadn't. So the time was now (well then, aw you get what I mean) A low mileage official dealer supplied example came up at the right time and as they say on forums such as this I pulled the trigger Now truth be told I expected to use the M9 a bit like a classic sports' car (not that I own one) - sunny Sunday drives down country lanes, with a modern practical car for everyday. Long story short, I quickly became seduced by using a rangefinder, the cerebral challenges of a simple camera, and well boy meets Leica M - a story as old as the hills. My other brand cameras were relegated to the gear cupboard and the M9 and I partied like it was 2009 Of course the M9 does have some limitations, and I found myself wanting and needing something a little more modern for certain things. Enter the M240. I bought this camera because it was comparatively cheap, and had more ISO which I needed. Whereas I quite liked the 240, I never loved it. I found it quite hard work. Sure it performed better than the M9 with DR and ISO and I was glad of that. But the files needed more work in post, the camera was less nice in the hand and well.. we got on well enough but but it wasn't love I decided to see what the M11 did to M10 prices on the used market. About a month later my local AD got a secondhand M10 in, factory refurbished with new top and bottom plates (I don't want to know why it needed those....), the so important to me, warranty and at a price that was merely excruciating rather than terminal. I bounced into the store as they opened and... ...no M10 Sold? Nope - reserved for someone. You'll have to wait a week to see if I can sell to you It was a long week, that ended with a mad dash across the city to catch the store before closing. (Guy it was reserved for ended up buying a new m10R instead) I had a couple of DMs from folks asking about the whole M9/240/M10 comparison thing (which I've replied too), so that's not really what this missive is and besides that's all been done before I think? Also of course the early and mid adopters of the M10 have already shared their reviews and thoughts, so possibly I've little to add of value. But that said! I'm really very happy with the M10! My first concern was the reduced battery life compared to the 240.. well it is less, but as I'm not much of a chimper, tend to switch my camera off between shots, don't own the EVF, seldom use live view and can't be bothered to install the phone app thing = my battery life is great 😁 Usually about 650-750 shots. The headline feature of the M10 is that it's thinner. I'm genuinely surprised at how much I notice this and how much better it feels in my hand than the 240 (I have small hands) - of course the weight distribution helps here too, the M10 has better balance than the 240 (less front heavy, and mass concentrated into a smaller area feels more nimble, it's a technique used in sports motorcycle design) The next headline feature (I guess) is the -----> improved !!!  viewfinder. I didn't notice this in the store, but it's tangibly bigger and easier to use. I don't wear glasses, but I do wear sun glasses a lot and it's a lot nicer to use wearing them, 35mm framelines work better for me too. But I guess the key upgrade reason was the ISO improvements and what the internet seems to have dubbed the colour science Lets start with the ISO. This is easy. Yeah it's a ton better. And not just more ISO less noise better, but more exposure push in post, image doesn't end up with more banding than a field of Zebras better. Massive score IMO Re colours.. well when I go through my LR catalogue thumbnails it's not always completely obvious if I'm looking at a M10 or 240 shot... the colours are not poles apart, but I find the M10 DNGs nicer to work on, there's a lot of pleasing (to me) pop and contrast and bite from the off. Skins tones of the people I shoot look better to me (and them) too. In fact a custom DCP and a preset with a little contrast gets me most of the way there during DNG import, personally (OMMV) I found the 240 images were a lot more case by case with different images needing quite separate types of work to get what I liked. This was the main thing I missed from the M9 (which I still have) with the 240. It was just how the M9 images usually arrived pretty close to being usable (or completely useless), whereas always the 240 demanded work (obviously YMMV, you may use different tools or the same tools in a better way) In fact I've little to complain about with the M10 (well the price 🙄) and of course all the things that you've read on here already, the too stiff to lift ISO dial, the missing (for me, YMMV) cont/timed modes on the power switch (especially as timed isn't retained if you power off) - menu diving isn't what I associate with Leica... There's only really one fly in my personal M10 ointment (which I knew about before I bought it, not complaining too heavily, honest) Who's clucking bright idea was it too make base ISO inaccessible? WTAF? As you all know, you face a choice ISO 100 and don't dare clip a highlight or ISO 200 and hope the shadows aren't too murky if you need to recover them heavily Which, to me at least, makes ISO selection important for scenes where frankly it should be set base and forget (a colour RAW histogram might help here too...) But I can't stress enough... the camera is a tool, they all have foibles and we need to learn to use them to get what we want. So in some sort of summary The M10 compared to the M9. There's only one M9. The M10 isn't like an M9 v2.0 or something. It's just closer than the 240 was. The M9 colours are great and everything, but for me the M9 magic is the tonality, the glowing colours and airy light pictures. The M10 compared to the M240 On paper there's very little in it, but sincerely all those little improvements really do add up. The IQ is tangibly better, the ISO is far more usable, and it's just a nicer object to hold and use. (Which is important, cars get bought cos of the spec - they get sold if they're uncomfortable to drive) The M10 compared to the M11 ahahaha just messing - ask Jono or someone And that's the thing... Soon enough arrives the M11 Many here will get one, and I guess some you will use the opportunity to get an M10... Getting a camera that's not a current model has more than just price benefits... the firmware is mature, manufacturing bugs should be eliminated and the forums are full of tips and tricks for getting the most out of it written by people that have shot with one for some years If you've sat on the fence about the M10 and are figuring that now might be the time to jump, well I sincerely believe that you'll be happy with it. I know I am Thanks for reading. Just curious... did you not consider SL2 or SL2-S with superior sensor over M10. Why M10 over SL models? I tried M10 Pre loved unit + M Lens and SL2-S with M Lens. I love the SL2-S technology but the size is a turn off. So i am hovering between M10 w M lens or Sl2-S with M Lens. Edited August 5 by charles tay"}, {"autor": "EdwardM", "posts": "340 posts", "date": "07/03/2021 09:32  PM", "content": "Advertisement (gone after registration) Hello dear friends. Bought M10-R couple of months ago and had no occasion to shoot before today and immediately after the first press of the shutter, the camera freezes. No response on any buttons, had to remove the battery each time. So, accidentally managed to -----> install !!!  a new software update, but it did not help either, i have never faced such a problem with a new camera. Given the lockdown and logistic issues between Russia and Germany, i have no idea what to do. Its just 8k USD useless black brick now."}, {"autor": "MrFriendly", "posts": "129 posts", "date": "07/05/2021 09:23  PM", "content": "On 7/3/2021 at 4:32 PM, EdwardM said: Hello dear friends. Bought M10-R couple of months ago and had no occasion to shoot before today and immediately after the first press of the shutter, the camera freezes. No response on any buttons, had to remove the battery each time. So, accidentally managed to -----> install !!!  a new software update, but it did not help either, i have never faced such a problem with a new camera. Given the lockdown and logistic issues between Russia and Germany, i have no idea what to do. Its just 8k USD useless black brick now. I have three Leica M camera (M10-P, M10M, and M246M), and they suffer from this freeze issue. I'm almost certain it's a firmware bug, but Leica will not confirm nor deny it. I suggest using slower memory cards (90MB/s or slower), because it seems to reduce the likelihood that it will freeze/lock up. It doesn't solve the problem, as you will encounter the problem again, but it won't freeze up as often."}, {"autor": "poli", "posts": "374 posts", "date": "10/17/2020 06:51  PM", "content": "Indeed the led should stop blinking. If you are sure that you have the latest firmware (could you try to -----> install !!!  that again?), it sounds like a hardware issue. Your iPhone’s settings and version of the Leica app should have nothing to do with it. Although I do remember the first time setting it up, I had to use the QR code in the base plate."}, {"autor": "WanderingEye", "posts": "10 posts", "date": "10/17/2020 08:30  PM", "content": "Thanks, I did try to -----> install !!!  firmware 2.7.5.0 again, but that didn't change anything. I agree the iOS settings shouldn't matter (yet), but everyone keeps asking so I figured I'd mention it here. I should also say, I'm thankful for this forum, and your posts. I joined a couple years ago (almost exactly two years actually!) when I got my Q, and I'd spent a lot of time on here while considering the M10-D."}, {"autor": "Jeff S", "posts": "18,651 posts", "date": "06/15/2021 12:50  PM", "content": "5 hours ago, Helge said: Why not using the rangefinder without glasses and using a Leica correction lens instead? I'm using most of my cameras without glasses and using correction lenses/diopter correction instead. I use both, simultaneously, as glasses correct for distance and astigmatism (and sun protection with sunglasses), while diopter -----> optimizes !!!  RF focusing with aging eyes. Having thin, flexible frames with scratch resistant lenses aids in viewing wider frame lines. I don’t get along with contact lenses. No Visoflex for me. Each person has different vision requirements, viewing preferences and comfort levels. Sometimes experimenting with options can be beneficial. Jeff Edited June 15 by Jeff S"}, {"autor": "SrMi", "posts": "1,855 posts", "date": "05/16/2021 09:10  PM", "content": "Just now, mmradman said: I think all previous replies answer the question, the summary would be RF camera need to start the exposure with curtain closed so when working in LV it means shutter curtain is already open and it needs to be closed before it can take the exposure. In contrast Mirrorless camera operates with Shutter curtain open at all times, so be it electronic or mechanical exposure it is half way there, all it has to do is to operate the shutter to take the exposure. In mechanical shutter mode, an EVF-based camera also has to close the shutter and then open it again. However, a mirrorless shutter is -----> optimized !!!  for live-view operation."}, {"autor": "mmradman", "posts": "3,611 posts", "date": "05/16/2021 09:12  PM", "content": "1 minute ago, SrMi said: In mechanical shutter mode, an EVF-based camera also has to close the shutter and then open it again. However, a mirrorless shutter is -----> optimized !!!  for live-view operation. Indeed, as per post #5 - electronic camera concept grafted in 1950s camera body."}, {"autor": "elmars", "posts": "6,723 posts", "date": "04/06/2021 02:31  PM", "content": "It seems to be the same printer problem that I have every time after an update of the operating system of my Mac. You have to de-----> install !!!  the printer and -----> install !!!  him again."}, {"autor": "Jeff S", "posts": "18,651 posts", "date": "04/13/2021 11:35  PM", "content": "While expensive initially, ImagePrint will not only eliminate this problem by providing superb custom profiles (with IP Black) for virtually all papers and lighting conditions, but offers full time soft proofing, and overrides the Epson driver while -----> optimizing !!!  all settings for better print results. I use it as a simple external editor to LR Classic, in lieu of the LR print module. It also provides a variety of controls to complement and refine LR edits for best print results. I like that it also gets me out of the Apple/Adobe/Epson chain (or Windows users), which can get messy when one or another introduces issues as a result of ‘upgrades’. Jeff"}, {"autor": "adan", "posts": "10,775 posts", "date": "04/10/2021 05:42  AM", "content": "Not sure you are asking all the right questions - but I'll answer as best I can. 1. The coding, whether manual or built-in at the Leica factory, will affect both jpegs and raw files more or less equally. It affects the camera programming enroute between the sensor and the final file on the SD card. 2. The coding only automatically corrects, in the camera, for color vignetting and normal brightness vignetting (to a variable extent).* In addition, the fact that the lens type is then also recorded in a picture's EXIF metadata means that, after the fact, depending on what post-processing software one uses, the post-processing software (not the camera) may apply corrections for distortion and some regular vignetting. I have coded lenses, I use Photoshop CS6 and Adobe Camera Raw. They do absolutely nothing to fix distortion or vignetting just because the lens is coded. Those still have to be manually corrected with sliders, coding or not. Other software may vary, and may have an \"on/off\" switch to automatically detect the lens type and apply corrections, or not - see post-processing software instructions 3. This site has a list of the 6-bit codes - not sure how up-to-date: https://lavidaleica.com/content/leica-lens-codes The L-Camera Forum used to, but right now our link is reading \"404.\" I've reported it - the mods may repair it. See top of the M Lenses subforum for the thread with the link. 4. Lightroom (or other) profiles will do zip/nada/nothing to fix the color vignetting problem, when it exists. It has to be done in-camera at the moment of exposure for decent (and fast, automatic, seamless) results. I think Lightroom now has a \"flat-field\" plug-in that can help - but it stills requires some user intervention. Not as seamless as getting it fixed at the moment of exposure, all the time, every picture. Only 1) coding the lens, or 2) using the camera's lens menu to identify the lens type in use, will fix the color vignetting automatically and easily. ___________________ *The deal is this. Digital sensors do not play nicely with old-fashioned, rangefinder-type, close-to-the-sensor, wide-angle lenses (35mm or wider). This produces both brightness vignetting (closer and closer to the picture corners, not all the light gets to the silicon), and color vignetting (the light sometimes leaks from a red- or blue-filtered pixel onto a green-sensitive pixel (or vice-versa), and gets recorded as the wrong color). Lenses longer than 50mm usually do not show any vignetting problems if uncoded - they sit far enough away from the image plane/sensor. In the second case, this causes a measurable stain of magenta or blue-green along the short \"sides\" of the image and in the corners. A.K.A. \"Italian Flag syndrome.\" See photograph below. See diagram of older sensors (left), and the newer Leica CMOS sensors with different construction at the pixel level, which correct things partially. But not for all wide lenses - I can still see obvious problems with 35 and 28 images even on the M10 with the -----> improved !!!  sensor, if the lenses are not coded, or ID'd via the lens menu. --img--  The Leica M color cameras have corrections built into their firmware to dial out both types of vignetting, if the camera \"knows\" exactly which lens was used. It adds or subtracts color from parts of the image right-now after exposure, while the image data is being processed in-camera enroute to the SD card. This shows what color vignetting looks like - pink stain on the left, cyan on the right (like an Italian flag: 1980 Leica 21mm Elmarit, with \"poor\" correction from early M9 firmware, 2010). --img--  Lenses' vignetting patterns are like fingerprints - they depend on the precise path the light takes passing through the particular shapes of glass in the optical layout. All 35mm f/2 Summicron ASPH lenses behave about the same, but not all 35mm f/2 lenses overall necessarily act the same. 35 Summicron v.4 non-ASPH needs different corrections than 35 Summicron ASPH, which needs different corrections (maybe) than a Voigtlander 35mm Ultron. Leica supplies different 6-bit codes for different 35mm f/2 Summicron lens designs (1980 vs. 1997, for example). Do not assume that any 21, or 24, or 28, or 35 coding will necessarily work with just anyone's lens of the same speed and focal length. However, some designs are similar enough - even from different manufacturers and eras, that they can work for each other. For example, the corrections for the Leica 35mm Summicron v.4 (1980) work quite well for the Voigtlander 35mm f/1.4 Nokton v.1/2 - because they are similar, compact Double-Gauss designs. The reason I said the vignetting corrections are \"variable\" is that they are applied less strongly at higher ISOs, to prevent the corrected corners/edges getting too noisy. Edited April 10 by adan"}, {"autor": "steve 1959", "posts": "807 posts", "date": "04/10/2021 09:36  AM", "content": "3 hours ago, adan said: Not sure you are asking all the right questions - but I'll answer as best I can. 1. The coding, whether manual or built-in at the Leica factory, will affect both jpegs and raw files more or less equally. It affects the camera programming enroute between the sensor and the final file on the SD card. 2. The coding only automatically corrects, in the camera, for color vignetting and normal brightness vignetting (to a variable extent).* In addition, the fact that the lens type is then also recorded in a picture's EXIF metadata means that, after the fact, depending on what post-processing software one uses, the post-processing software (not the camera) may apply corrections for distortion and some regular vignetting. I have coded lenses, I use Photoshop CS6 and Adobe Camera Raw. They do absolutely nothing to fix distortion or vignetting just because the lens is coded. Those still have to be manually corrected with sliders, coding or not. Other software may vary, and may have an \"on/off\" switch to automatically detect the lens type and apply corrections, or not - see post-processing software instructions 3. This site has a list of the 6-bit codes - not sure how up-to-date: https://lavidaleica.com/content/leica-lens-codes The L-Camera Forum used to, but right now our link is reading \"404.\" I've reported it - the mods may repair it. See top of the M Lenses subforum for the thread with the link. 4. Lightroom (or other) profiles will do zip/nada/nothing to fix the color vignetting problem, when it exists. It has to be done in-camera at the moment of exposure for decent (and fast, automatic, seamless) results. I think Lightroom now has a \"flat-field\" plug-in that can help - but it stills requires some user intervention. Not as seamless as getting it fixed at the moment of exposure, all the time, every picture. Only 1) coding the lens, or 2) using the camera's lens menu to identify the lens type in use, will fix the color vignetting automatically and easily. ___________________ *The deal is this. Digital sensors do not play nicely with old-fashioned, rangefinder-type, close-to-the-sensor, wide-angle lenses (35mm or wider). This produces both brightness vignetting (closer and closer to the picture corners, not all the light gets to the silicon), and color vignetting (the light sometimes leaks from a red- or blue-filtered pixel onto a green-sensitive pixel (or vice-versa), and gets recorded as the wrong color). Lenses longer than 50mm usually do not show any vignetting problems if uncoded - they sit far enough away from the image plane/sensor. In the second case, this causes a measurable stain of magenta or blue-green along the short \"sides\" of the image and in the corners. A.K.A. \"Italian Flag syndrome.\" See photograph below. See diagram of older sensors (left), and the newer Leica CMOS sensors with different construction at the pixel level, which correct things partially. But not for all wide lenses - I can still see obvious problems with 35 and 28 images even on the M10 with the -----> improved !!!  sensor, if the lenses are not coded, or ID'd via the lens menu. --img--  The Leica M color cameras have corrections built into their firmware to dial out both types of vignetting, if the camera \"knows\" exactly which lens was used. It adds or subtracts color from parts of the image right-now after exposure, while the image data is being processed in-camera enroute to the SD card. This shows what color vignetting looks like - pink stain on the left, cyan on the right (like an Italian flag: 1980 Leica 21mm Elmarit, with \"poor\" correction from early M9 firmware, 2010). --img--  Lenses' vignetting patterns are like fingerprints - they depend on the precise path the light takes passing through the particular shapes of glass in the optical layout. All 35mm f/2 Summicron ASPH lenses behave about the same, but not all 35mm f/2 lenses overall necessarily act the same. 35 Summicron v.4 non-ASPH needs different corrections than 35 Summicron ASPH, which needs different corrections (maybe) than a Voigtlander 35mm Ultron. Leica supplies different 6-bit codes for different 35mm f/2 Summicron lens designs (1980 vs. 1997, for example). Do not assume that any 21, or 24, or 28, or 35 coding will necessarily work with just anyone's lens of the same speed and focal length. However, some designs are similar enough - even from different manufacturers and eras, that they can work for each other. For example, the corrections for the Leica 35mm Summicron v.4 (1980) work quite well for the Voigtlander 35mm f/1.4 Nokton v.1/2 - because they are similar, compact Double-Gauss designs. The reason I said the vignetting corrections are \"variable\" is that they are applied less strongly at higher ISOs, to prevent the corrected corners/edges getting too noisy. Must admit i coded my voigtlander 40mm f1.4 as a 35mm summilux pre-asph,,,do you think that is a sensible selection? I went fot that code because i read the lens was based on the early summilux."}, {"autor": "Crem", "posts": "58 posts", "date": "04/10/2021 01:44  PM", "content": "7 hours ago, adan said: Not sure you are asking all the right questions - but I'll answer as best I can. 1. The coding, whether manual or built-in at the Leica factory, will affect both jpegs and raw files more or less equally. It affects the camera programming enroute between the sensor and the final file on the SD card. 2. The coding only automatically corrects, in the camera, for color vignetting and normal brightness vignetting (to a variable extent).* In addition, the fact that the lens type is then also recorded in a picture's EXIF metadata means that, after the fact, depending on what post-processing software one uses, the post-processing software (not the camera) may apply corrections for distortion and some regular vignetting. I have coded lenses, I use Photoshop CS6 and Adobe Camera Raw. They do absolutely nothing to fix distortion or vignetting just because the lens is coded. Those still have to be manually corrected with sliders, coding or not. Other software may vary, and may have an \"on/off\" switch to automatically detect the lens type and apply corrections, or not - see post-processing software instructions 3. This site has a list of the 6-bit codes - not sure how up-to-date: https://lavidaleica.com/content/leica-lens-codes The L-Camera Forum used to, but right now our link is reading \"404.\" I've reported it - the mods may repair it. See top of the M Lenses subforum for the thread with the link. 4. Lightroom (or other) profiles will do zip/nada/nothing to fix the color vignetting problem, when it exists. It has to be done in-camera at the moment of exposure for decent (and fast, automatic, seamless) results. I think Lightroom now has a \"flat-field\" plug-in that can help - but it stills requires some user intervention. Not as seamless as getting it fixed at the moment of exposure, all the time, every picture. Only 1) coding the lens, or 2) using the camera's lens menu to identify the lens type in use, will fix the color vignetting automatically and easily. ___________________ *The deal is this. Digital sensors do not play nicely with old-fashioned, rangefinder-type, close-to-the-sensor, wide-angle lenses (35mm or wider). This produces both brightness vignetting (closer and closer to the picture corners, not all the light gets to the silicon), and color vignetting (the light sometimes leaks from a red- or blue-filtered pixel onto a green-sensitive pixel (or vice-versa), and gets recorded as the wrong color). Lenses longer than 50mm usually do not show any vignetting problems if uncoded - they sit far enough away from the image plane/sensor. In the second case, this causes a measurable stain of magenta or blue-green along the short \"sides\" of the image and in the corners. A.K.A. \"Italian Flag syndrome.\" See photograph below. See diagram of older sensors (left), and the newer Leica CMOS sensors with different construction at the pixel level, which correct things partially. But not for all wide lenses - I can still see obvious problems with 35 and 28 images even on the M10 with the -----> improved !!!  sensor, if the lenses are not coded, or ID'd via the lens menu. --img--  The Leica M color cameras have corrections built into their firmware to dial out both types of vignetting, if the camera \"knows\" exactly which lens was used. It adds or subtracts color from parts of the image right-now after exposure, while the image data is being processed in-camera enroute to the SD card. This shows what color vignetting looks like - pink stain on the left, cyan on the right (like an Italian flag: 1980 Leica 21mm Elmarit, with \"poor\" correction from early M9 firmware, 2010). --img--  Lenses' vignetting patterns are like fingerprints - they depend on the precise path the light takes passing through the particular shapes of glass in the optical layout. All 35mm f/2 Summicron ASPH lenses behave about the same, but not all 35mm f/2 lenses overall necessarily act the same. 35 Summicron v.4 non-ASPH needs different corrections than 35 Summicron ASPH, which needs different corrections (maybe) than a Voigtlander 35mm Ultron. Leica supplies different 6-bit codes for different 35mm f/2 Summicron lens designs (1980 vs. 1997, for example). Do not assume that any 21, or 24, or 28, or 35 coding will necessarily work with just anyone's lens of the same speed and focal length. However, some designs are similar enough - even from different manufacturers and eras, that they can work for each other. For example, the corrections for the Leica 35mm Summicron v.4 (1980) work quite well for the Voigtlander 35mm f/1.4 Nokton v.1/2 - because they are similar, compact Double-Gauss designs. The reason I said the vignetting corrections are \"variable\" is that they are applied less strongly at higher ISOs, to prevent the corrected corners/edges getting too noisy. adan, fantastic info and thank you for taking the time to write it up! It makes much more sense the way you explained it vs the random bits of info I found with Google searches."}, {"autor": "evikne", "posts": "2,248 posts", "date": "01/24/2021 02:04  PM", "content": "20 hours ago, stump4545 said: Before I buy a Visoflex for my M10 mono, any guess if a new upgraded Visoflex will be releases anytime soon for the M? I've heard that the M10's processor would not handle an -----> improved !!!  Visoflex with higher resolution etc. So we will most likely not see one before the next generation M camera is launched."}, {"autor": "beewee", "posts": "662 posts", "date": "01/29/2021 07:34  PM", "content": "4 hours ago, UliWer said: I updated my M10 (non-P, -R or -M) with the new firmware, though I could not find any differences. I suspect it is only supported on the M10-P, M10-R, M10-Monochrome because those cameras have a tilt sensor that measure more than just portrait/landscape orientation as they support levelling lines in the EVF. This was enabled with an -----> improved !!!  accelerometer which is not physically present on the original M10."}, {"autor": "Kwesi", "posts": "818 posts", "date": "01/28/2021 09:20  PM", "content": "32 minutes ago, Dennis said: Last update of the M10 was sept 2019. My sense is that this new firmware is just to support the 50/1.2 I doubt very much that Leica has any new or -----> improved !!!  functionality for the M10 series"}, {"autor": "Dennis", "posts": "1,521 posts", "date": "01/28/2021 09:26  PM", "content": "3 minutes ago, Kwesi said: My sense is that this new firmware is just to support the 50/1.2 I doubt very much that Leica has any new or -----> improved !!!  functionality for the M10 series A nice firmware would be nice. I would vote for faster response after turning on the camera, and better user profiles management. What about chance to see total actuations? Just dreaming."}, {"autor": "Jeff S", "posts": "18,651 posts", "date": "02/14/2021 11:06  PM", "content": "The -.5 diopter built-in correction is for the focus patch, which is set for 2m viewing distance. Ideally one needs to see the patch clearly as well as subjects at varying distances. For decades I relied solely on my glasses for distance and astigmatism. But as I aged, I found that adding a +.5 diopter -----> optimized !!!  focusing. It was simple to test this by using free trial diopters at my local optician. (Sorry for repeating myself... just realized I visited topic earlier.) Jeff Edited February 14 by Jeff S"}, {"autor": "augustwest100", "posts": "128 posts", "date": "02/04/2021 05:00  PM", "content": "Advertisement (gone after registration) Hello there, I am looking to get some advice coming from a Sony A9, which I got not because I shoot action, but because I was drawn to the \"no blackout\" EVF. I have used and owned many Leicas in my day, including the MP film camera, the M9, M240, Q, and M10, and am currently \"between\" Leicas. I am wondering whether anyone can guide me with my next decision: Whether to sell the Sony A9 and the glass I own for it in order to get a Leica SL2 or SL2S, or to get the Leica M10R. I absolutely love the experience of looking through a glass viewfinder at the real world and I like to take a minimalist approach to what gear I carry. I never \"spray and pray,\" even with the A9, at most I focus once, -----> recompose !!!  and shoot. I don't always hit focus with the M cameras, and sometimes I get a little stressed by the fact that you cannot see the exact framing of the image, and many of the lenses (such as the Summicron 35mm M I still own) do not focus on close subjects. So I guess what I am saying is that I am struggling with the pros and cons of both systems. The M system is near and dear to me, but I don't always get focus or framing when under a little pressure. The SL2S intrigues me as a good way to replace my Sony A9, sacrificing Sony's autofocus madness, button layout, and pages of frustrating menus, for a more sublime Leica experience, but seems a little heavy. The reason I was thinking of SL2S versus M10R is that the resolution of the M10R would allow me to \"fix\" the framing if I don't get it perfect, where on the SL2S I would be seeing exactly what I would get before I shoot, so the extra resolution would probably not be needed as much. Of course I would love to own both someday Note: I am not a professional photographer. I like shooting street, landscape and sometimes non-studio portraits. I like Leica because of the simplicity of use, the connection to film days, and because of the dedicated dials for ISO, Shutter Speed, Aperture. If the M10D had a film advance lever that worked, I probably would have pulled the plug on that baby! And if the Sony A9 had dedicated dials (and less of them) and about 10 pages less of options (animal eye auto focus - wow!) I would consider keeping it. Thanks for any advice you may have!"}, {"autor": "LBJ2", "posts": "640 posts", "date": "02/04/2021 06:00  PM", "content": "42 minutes ago, augustwest100 said: Hello there, I am looking to get some advice coming from a Sony A9, which I got not because I shoot action, but because I was drawn to the \"no blackout\" EVF. I have used and owned many Leicas in my day, including the MP film camera, the M9, M240, Q, and M10, and am currently \"between\" Leicas. I am wondering whether anyone can guide me with my next decision: Whether to sell the Sony A9 and the glass I own for it in order to get a Leica SL2 or SL2S, or to get the Leica M10R. I absolutely love the experience of looking through a glass viewfinder at the real world and I like to take a minimalist approach to what gear I carry. I never \"spray and pray,\" even with the A9, at most I focus once, -----> recompose !!!  and shoot. I don't always hit focus with the M cameras, and sometimes I get a little stressed by the fact that you cannot see the exact framing of the image, and many of the lenses (such as the Summicron 35mm M I still own) do not focus on close subjects. So I guess what I am saying is that I am struggling with the pros and cons of both systems. The M system is near and dear to me, but I don't always get focus or framing when under a little pressure. The SL2S intrigues me as a good way to replace my Sony A9, sacrificing Sony's autofocus madness, button layout, and pages of frustrating menus, for a more sublime Leica experience, but seems a little heavy. The reason I was thinking of SL2S versus M10R is that the resolution of the M10R would allow me to \"fix\" the framing if I don't get it perfect, where on the SL2S I would be seeing exactly what I would get before I shoot, so the extra resolution would probably not be needed as much. Of course I would love to own both someday Note: I am not a professional photographer. I like shooting street, landscape and sometimes non-studio portraits. I like Leica because of the simplicity of use, the connection to film days, and because of the dedicated dials for ISO, Shutter Speed, Aperture. If the M10D had a film advance lever that worked, I probably would have pulled the plug on that baby! And if the Sony A9 had dedicated dials (and less of them) and about 10 pages less of options (animal eye auto focus - wow!) I would consider keeping it. Thanks for any advice you may have! I shoot Leica M and Sony and not giving up either any time soon. Based upon what you wrote, the SL2-S might a be a good compromise for what you are currently looking for."}, {"autor": "martinot", "posts": "303 posts", "date": "09/13/2020 04:01  PM", "content": "On 9/12/2020 at 7:35 AM, AZN said: There has been a bit of news about it in the last few days - so appologies if this has been posted already: https://www.sonyalpharumors.com/sony-a7c-vs-panasonic-gx7-vs-sony-a7iii-comparison/ https://www.sonyalpharumors.com/sony-a7c-additional-specs-leaked/ Yes I know it won't work properly with most M lenses wider than 50mm. Yes I know the manufacturing and image quality is greatly inferior to the M10/ M10P/ M10R. But… $US 2K (?) for the body; IBIS; a pretty good battery and no rangefinder to drift out of alignment. Ahem - why cannot Leica do something like this?… Why compare it to the really old GX7 m43 camera at all? It looks just like they took their APS A6600 camera, and changed the APS sensor to FF. Personally I think it was a bad decision for Sony from the beginning to shoehorn in a FF sensors behind a camera mount -----> optimized !!!  for APS. Perhaps no problem in practice (the old Nikon F-mount had not so much practical problems to compete with Canons bigger EF-mount), but still not any good decision IMHO. My personal take on this is that Sony wants to kill their whole line of APS-C cameras and E-mount lenses, and will from now on only continue with their FF cameras and their FE-lenses. Sony APS-C E-mount is now dead. Expect the market to plummet in prices (both new and used). Sony´s current APS-owners will take the hit. Edited September 13, 2020 by martinot"}, {"autor": "martinot", "posts": "303 posts", "date": "09/13/2020 04:34  PM", "content": "20 hours ago, AZN said: FWIW I will be buying one. Should work fine with the Voigtlander 40mm Nokton, along with longer M lenses. Need a lightweight and compact camera for the landscape stuff I am currently doing. Toting a 1.5 kg camera/ lens combo gets old fast when trekking 10km a day and humping up and down ++150m hills. Was looking at one of the digital Ms, but no. The M10-R is $AUD 13.5K while the M10-P is $AUD 11.8K. I have the money, but IMO the price just isn't worth it. https://leica-store.com.au/categories/camera_systems/leica_m/m_cameras Finally, smashing a $2K camera hurts a lot less than something ++3x more expensive 😃 Nothing wrong with buying a mirrorless camera. I have several mirrorless cameras that I love. But they are no rangefinders, and no replacement for such an M camera. You do not buy an M-camera because it is cheap to trash/smash. You do not buy it be lightweight (the lenses might be, but not the M cameras). You buy it because you have a passion for zen like photographing with rangefinder focusing. That said; there are so many good options for mirrorless cameras besides Sony! I personally love the Fujifilm mirrorless cameras, but would also consider Nikon Z-mount, Canon RF-mount. and Leica, Panasonic and Sigma L-mount cameras over Sony FE cameras. Last thing; Sony have a lot of great native lenses, and personally I would skip M-lenses on Sony. The M-lenses will always perform better on M cameras than any mirrorless cameras (and especially avoid Sony cameras with less than optimal sensor package for M-lenses). Go for the great range of Sony FE lenses. For a Sony (or any other mirrorless camera for that matter); I strongly recommend using native lenses -----> optimized !!!  for that camera system. For M-lenses; I strongly recommend using native M cameras -----> optimized !!!  for that type of very special lenses."}, {"autor": "martinot", "posts": "303 posts", "date": "09/13/2020 04:34  PM", "content": "20 hours ago, AZN said: FWIW I will be buying one. Should work fine with the Voigtlander 40mm Nokton, along with longer M lenses. Need a lightweight and compact camera for the landscape stuff I am currently doing. Toting a 1.5 kg camera/ lens combo gets old fast when trekking 10km a day and humping up and down ++150m hills. Was looking at one of the digital Ms, but no. The M10-R is $AUD 13.5K while the M10-P is $AUD 11.8K. I have the money, but IMO the price just isn't worth it. https://leica-store.com.au/categories/camera_systems/leica_m/m_cameras Finally, smashing a $2K camera hurts a lot less than something ++3x more expensive 😃 Nothing wrong with buying a mirrorless camera. I have several mirrorless cameras that I love. But they are no rangefinders, and no replacement for such an M camera. You do not buy an M-camera because it is cheap to trash/smash. You do not buy it be lightweight (the lenses might be, but not the M cameras). You buy it because you have a passion for zen like photographing with rangefinder focusing. That said; there are so many good options for mirrorless cameras besides Sony! I personally love the Fujifilm mirrorless cameras, but would also consider Nikon Z-mount, Canon RF-mount. and Leica, Panasonic and Sigma L-mount cameras over Sony FE cameras. Last thing; Sony have a lot of great native lenses, and personally I would skip M-lenses on Sony. The M-lenses will always perform better on M cameras than any mirrorless cameras (and especially avoid Sony cameras with less than optimal sensor package for M-lenses). Go for the great range of Sony FE lenses. For a Sony (or any other mirrorless camera for that matter); I strongly recommend using native lenses -----> optimized !!!  for that camera system. For M-lenses; I strongly recommend using native M cameras -----> optimized !!!  for that type of very special lenses."}, {"autor": "mirekti", "posts": "1,027 posts", "date": "10/07/2020 01:13  AM", "content": "21 minutes ago, jaapv said: Do you REALLY need all those stops - there is no way that you can reproduce them in print or on screen. So what do you do when you have a scene like this and you don't want to -----> recompose !!! ? If I remember well the sky wasn't white. --img--  Edited October 7, 2020 by mirekti"}, {"autor": "lct", "posts": "22,183 posts", "date": "10/07/2020 02:02  AM", "content": "46 minutes ago, mirekti said: So what do you do when you have a scene like this and you don't want to -----> recompose !!! ? If I remember well the sky wasn't white. You may wish to underexpose a bit and adjust in PP if needed (Digital CL, MATE, f/8, -1 EV). --img-- "}, {"autor": "jaapv", "posts": "66,415 posts", "date": "10/07/2020 06:07  AM", "content": "5 hours ago, mirekti said: So what do you do when you have a scene like this and you don't want to -----> recompose !!! ? If I remember well the sky wasn't white. --img--  The same as photographers have been doing for ages: use fill-flash Even if a 16 stop camera had managed to capture the detail in the sky (was there any? I doubt it), the result would have been out of the range of the paper you would be printing it on, making for a flat result or one with loss of tonal range. Nor would you have been. able to display it properly on your monitor. Even HDR displays, as used in gaming and video production, cannot get 16 stops on screen without compressing the DR. But I am sure that using mild HDR techniques in postprocessing could have improved the tones of this image. Quite hard to judge with the big black blob, though, as the main subject determines the quality of the image. As it is, the moment that cameras matched negative film, as they do now, the need for more DR became just for making exposure less critical, nothing more. Not to mention slide film. As an example: here is an image where the camera managed to capture both the detail in the midday Mozambique sun in the background and in the deep shadows of the kitchen. Th 13 stops or so of the CL were sufficient. But the need to compress the range to something you can see on your monitor pushed the image to the verge of a HDR look. More DR in the camera wouldn't have helped. --img-- "}, {"autor": "farnz", "posts": "25,167 posts", "date": "10/07/2020 11:53  AM", "content": "10 hours ago, mirekti said: So what do you do when you have a scene like this and you don't want to -----> recompose !!! ? If I remember well the sky wasn't white. --img--  There is more DR in the picture than even your eyes, with roughly 24 stops of DR, could handle so expecting a camera to be capable of recording the scene without blowing the highlights or the shadows or both is unrealistic even if the camera is specced at 16-stops. I suspect that if a camera was available with enough DR to record the picture without blowing out detail somewhere, say, 26 to 30 stops of DR, then it would be odd to look at because your brain knows what levels of light and shadow your eyes can handle and anything outside that would look a bit wrong. It's the same as the multitude of poorly-produced HDR pictures we've all seen that just look odd. As pointed out by Jaap earlier, fill-in flash is your friend. Pete. PS, there appears to be a piece of dirt on your sensor."}, {"autor": "tobey bilek", "posts": "5,007 posts", "date": "01/05/2021 05:32  AM", "content": "C1 has a lot of built in “corrections.” as default. Find where it takes the open image and changes it to neutral and it does not “jack up” all the colors and contrast. You will need to make everything yourself. I made a whole process to do it easily and in the order I prefer. Update came and wiped it all out. It will take a lot to get me to -----> install !!!  2021 edition. Going back to CS6 and NX D for Nikon images."}, {"autor": "FMB", "posts": "526 posts", "date": "11/24/2018 06:57  PM", "content": "I use this flash frequently. You have the smart option to have an off camera mini-flash you can put elsewhere to light an small portion of the total content of your picture an also you own with this flash an unobtrusive good optical trigger for another flash you were using (as you know we the Leica users do not have on our cameras these little flashes for that purpose other cameras have). As lately I'm trying to -----> install !!!  at home a very modest studio I've bought as well the separate FlashQ triggers (1 transmitter + 2 receivers) also mini tools, you only have to care not forget to get off when the session is over. All of them are small, useful and not to much expensive. Francisco."}, {"autor": "dkmoore", "posts": "2,194 posts", "date": "12/28/2020 07:19  PM", "content": "My M10R has already needed to be adjusted. My M10M has been perfect for almost a year now. Knock on wood. I had an M10P that had an issue with the roller cam assembly and was actually replaced altogether by Leica. I do think the M10 variants are much -----> improved !!!  but still not close to perfect, which is THE only thing I hate about Leica M. I would only send in if you notice an issue with out of focus images and you’ve taken steps to ensure it isn’t user error. (Like many others have said)."}], "name": "Verbessert"}