{"interestingcomments": [{"Unnamed: 0": 343310, "autor": "SoarFM", "date": 1613922660000, "content": "Sigh, well here I am struggling with the same decision. I have a very beautiful M10P sitting here at my table for the last day. I’m either keeping it or returning it along with another wad of money for an M10R. My last digital M was an M9 that I sold 6+ years ago, and to be truthful, I never got on very good with it. Terrible high iso performance, the shutter was anything but discreet and lack of live view is what finally made me give it up as mirrorless cameras came of age with CMOS sensors and high resolution EVF’s. I tried to make my M lenses work on that infernal Sony A7r and A7r2, but never to my satisfaction. I just couldn’t accept smearing. So I sold all but my 35 and 50 summicrons and put them aside with my M6 (also 35 years old) that I couldn’t bear to part with for sentimental reasons. Turns out the Sony’s output is really nice but every time I had to dive into a menu, I wanted to poke my eyes out, searching for some cool feature that was for some reason not working because some other setting change made that unavailable, well I had enough and got rid of it. Then some time with the MF Fujis including the GFX 100, but turns out it was more an exercise in chasing ultimate image quality while ignoring my unwillingness to actually haul that stuff around on a regular basis. Sold it all replacing it with a relatively more diminutive Hasselblad 907x, although still not an everyday driver...In the meantime I put together a Leica CL digital kit for actually carry about and practical family and family vacation photography. I really use the hell out of that kit, pandemic notwithstanding. Bought an M-L adapter for the M lenses on the CL, used it a few times but really just used the very remarkable 18-56 zoom that came with the CL. A Q2 was rationalized and added for low light indoor uses.😀 Then I decided to start scanning my analog archive with a pre-owned Panasonic S1r (for the pixel shift multi shot function) and a Sigma macro. It is light years ahead of flatbed scanning and works so well I started putting film in my film cameras again, including the M6. I can’t emphasize enough how pleased I am to have meaningful access to almost 30 years of negatives and slides to print on modern inkjets. I decide upon the S1r for scanning because in the back of my mind I was aware that I could put all my CL lenses (L mount) on the S1r and then have IBIS capability and 20 megapixels available—if I wanted. Then took out the M-L adapter and put my 35 and 50 on the S1r. Wow! 47 megapixel of niceness and none of the edge smearing that I saw on the Sonys (2 paragraphs back), not perfect on the 35 but real darn close. Focus peaking worked great. But it’s still more camera than I will carry around. For a moment I regretted not jumping right to the SL2 which has the clean interface I know from the Q2 and CL, but the S1r pre-owned was about $2k and an SL2 was going to be well over $5k and I wasn’t convinced I would still carry it regular. I just can’t picture myself buying Leica SL lenses, not because of the cost, but because of the size. No how, no way. But my appetite has been whetted to use my diminutive M lenses on a camera I will carry. And the sour taste of the M9 is gone and while most of my time here on the L-forum has been focused on Q and CL cameras I have been aware that the digital rangefinder has really matured. So I bought an M10-P. It is slim and beautiful, and oh, that shutter, what a change from M9 days! I was a bit concerned about how I would get along with the rangefinder (focus accuracy) since eyeglasses became a part of my wardrobe. I know that digital is more demanding of focus than film. It’s going quite well, performance checking focus accuracy on the live view and picture review is very instructive. The fluid motion of focus and shutter release has returned helped out by setting 1/4f in auto. IBIS or high iso performance seem to serve the same function and now we have high iso performance, it places this camera in a different league of usability over film or the old M9. I’ve also found that I can frame, focus and shoot (at least indoors) using solely the rear screen quite well. That’s mostly how I use my Q2 indoors also. I am going to the Leica store tomorrow to pick up a Visolflex 020. I know some people swear by it, others say it sits in their bag unused. I get the feeling it is what will make the M useable, for me, close focusing (or critical focusing?) outdoors. The only real decision is do I exchange the M10P for the M10R? On the one hand, I am totally happy with the 24 megapixels of the CL for family photos and the Q2’s 47mp is nice (especially cropping)but not a must have (for the family photos), on the other hand the M lenses on the S1r really do shine with all those megapixels (except maybe near the edge) and I am quite happy with the 50 mp Hasselblad and starting to think that 40-50 mp might be my sweet spot. I think I know what I am going to do. There is a part of me that thinks keeping the M10P might be false economy, or is it keeping a camera that is everything the M10R is, save a few megapixels? Sigh... Edited February 21 by SoarFM", "link": "https://www.l-camera-forum.com/topic/312268-m10-p-or-m10r/page/8/?tab=comments#comment-4145982", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "sigh, well here i am struggling with the same decision. i have a very beautiful m10p sitting here at my table for the last day. i’m either keeping it or returning it along with another wad of money for an m10r. my last digital m was an m9 that i sold 6+ years ago, and to be truthful, i never got on very good with it. terrible high iso performance, the shutter was anything but discreet and lack of live view is what finally made me give it up as mirrorless cameras came of age with cmos sensors and high resolution evf’s. i tried to make my m lenses work on that infernal sony a7r and a7r2, but never to my satisfaction. i just couldn’t accept smearing. so i sold all but my 35 and 50 summicrons and put them aside with my m6 (also 35 years old) that i couldn’t bear to part with for sentimental reasons. turns out the sony’s output is really nice but every time i had to dive into a menu, i wanted to poke my eyes out, searching for some cool feature that was for some reason not working because some other setting change made that unavailable, well i had enough and got rid of it. then some time with the mf fujis including the gfx 100, but turns out it was more an exercise in chasing ultimate image quality while ignoring my unwillingness to actually haul that stuff around on a regular basis. sold it all replacing it with a relatively more diminutive hasselblad 907x, although still not an everyday driver...in the meantime i put together a leica cl digital kit for actually carry about and practical family and family vacation photography. i really use the hell out of that kit, pandemic notwithstanding. bought an m-l adapter for the m lenses on the cl, used it a few times but really just used the very remarkable 18-56 zoom that came with the cl. a q2 was rationalized and added for low light indoor uses.😀 then i decided to start scanning my analog -----> archive !!!  with a pre-owned panasonic s1r (for the pixel shift multi shot function) and a sigma macro. it is light years ahead of flatbed scanning and works so well i started putting film in my film cameras again, including the m6. i can’t emphasize enough how pleased i am to have meaningful access to almost 30 years of negatives and slides to print on modern inkjets. i decide upon the s1r for scanning because in the back of my mind i was aware that i could put all my cl lenses (l mount) on the s1r and then have ibis capability and 20 megapixels available—if i wanted. then took out the m-l adapter and put my 35 and 50 on the s1r. wow! 47 megapixel of niceness and none of the edge smearing that i saw on the sonys (2 paragraphs back), not perfect on the 35 but real darn close. focus peaking worked great. but it’s still more camera than i will carry around. for a moment i regretted not jumping right to the sl2 which has the clean interface i know from the q2 and cl, but the s1r pre-owned was about $2k and an sl2 was going to be well over $5k and i wasn’t convinced i would still carry it regular. i just can’t picture myself buying leica sl lenses, not because of the cost, but because of the size. no how, no way. but my appetite has been whetted to use my diminutive m lenses on a camera i will carry. and the sour taste of the m9 is gone and while most of my time here on the l-forum has been focused on q and cl cameras i have been aware that the digital rangefinder has really matured. so i bought an m10-p. it is slim and beautiful, and oh, that shutter, what a change from m9 days! i was a bit concerned about how i would get along with the rangefinder (focus accuracy) since eyeglasses became a part of my wardrobe. i know that digital is more demanding of focus than film. it’s going quite well, performance checking focus accuracy on the live view and picture review is very instructive. the fluid motion of focus and shutter release has returned helped out by setting 1/4f in auto. ibis or high iso performance seem to serve the same function and now we have high iso performance, it places this camera in a different league of usability over film or the old m9. i’ve also found that i can frame, focus and shoot (at least indoors) using solely the rear screen quite well. that’s mostly how i use my q2 indoors also. i am going to the leica store tomorrow to pick up a visolflex 020. i know some people swear by it, others say it sits in their bag unused. i get the feeling it is what will make the m useable, for me, close focusing (or critical focusing?) outdoors. the only real decision is do i exchange the m10p for the m10r? on the one hand, i am totally happy with the 24 megapixels of the cl for family photos and the q2’s 47mp is nice (especially cropping)but not a must have (for the family photos), on the other hand the m lenses on the s1r really do shine with all those megapixels (except maybe near the edge) and i am quite happy with the 50 mp hasselblad and starting to think that 40-50 mp might be my sweet spot. i think i know what i am going to do. there is a part of me that thinks keeping the m10p might be false economy, or is it keeping a camera that is everything the m10r is, save a few megapixels? sigh... edited february 21 by soarfm", "sortedWord": "None", "identifyer": 4388, "year": "2021"}, {"Unnamed: 0": 343311, "autor": "Steven", "date": 1613923320000, "content": "12 minutes ago, SoarFM said: Sigh, well here I am struggling with the same decision. I have a very beautiful M10P sitting here at my table for the last day. I’m either keeping it or returning it along with another wad of money for an M10R. My last digital M was an M9 that I sold 6+ years ago, and to be truthful, I never got on very good with it. Terrible high iso performance, the shutter was anything but discreet and lack of live view is what finally made me give it up as mirrorless cameras came of age with CMOS sensors and high resolution EVF’s. I tried to make my M lenses work on that infernal Sony A7r and A7r2, but never to my satisfaction. I just couldn’t accept smearing. So I sold all but my 35 and 50 summicrons and put them aside with my M6 (also 35 years old) that I couldn’t bear to part with for sentimental reasons. Turns out the Sony’s output is really nice but every time I had to dive into a menu, I wanted to poke my eyes out, searching for some cool feature that was for some reason not working because some other setting change made that unavailable, well I had enough and got rid of it. Then some time with the MF Fujis including the GFX 100, but turns out it was more an exercise in chasing ultimate image quality while ignoring my unwillingness to actually haul that stuff around on a regular basis. Sold it all replacing it with a relatively more diminutive Hasselblad 907x, although still not an everyday driver...In the meantime I put together a Leica CL digital kit for actually carry about and practical family and family vacation photography. I really use the hell out of that kit, pandemic notwithstanding. Bought an M-L adapter for the M lenses on the CL, used it a few times but really just used the very remarkable 18-56 zoom that came with the CL. A Q2 was rationalized and added for low light indoor uses.😀 Then I decided to start scanning my analog archive with a pre-owned Panasonic S1r (for the pixel shift multi shot function) and a Sigma macro. It is light years ahead of flatbed scanning and works so well I started putting film in my film cameras again, including the M6. I can’t emphasize enough how pleased I am to have meaningful access to almost 30 years of negatives and slides to print on modern inkjets. I decide upon the S1r for scanning because in the back of my mind I was aware that I could put all my CL lenses (L mount) on the S1r and then have IBIS capability and 20 megapixels available—if I wanted. Then took out the M-L adapter and put my 35 and 50 on the S1r. Wow! 47 megapixel of niceness and none of the edge smearing that I saw on the Sonys (2 paragraphs back), not perfect on the 35 but real darn close. Focus peaking worked great. But it’s still more camera than I will carry around. For a moment I regretted not jumping right to the SL2 which has the clean interface I know from the Q2 and CL, but the S1r pre-owned was about $2k and an SL2 was going to be well over $5k and I wasn’t convinced I would still carry it regular. I just can’t picture myself buying Leica SL lenses, not because of the cost, but because of the size. No how, no way. But my appetite has been whetted to use my diminutive M lenses on a camera I will carry. And the sour taste of the M9 is gone and while most of my time here on the L-forum has been focused on Q and CL cameras I have been aware that the digital rangefinder has really matured. So I bought an M10-P. It is slim and beautiful, and oh, that shutter, what a change from M9 days! I was a bit concerned about how I would get along with the rangefinder (focus accuracy) since eyeglasses became a part of my wardrobe. I know that digital is more demanding of focus than film. It’s going quite well, performance checking focus accuracy on the live view and picture review is very instructive. The fluid motion of focus and shutter release has returned helped out by setting 1/4f in auto. IBIS or high iso performance seem to serve the same function and now we have high iso performance, it places this camera in a different league of usability over film or the old M9. I’ve also found that I can frame, focus and shoot (at least indoors) using solely the rear screen quite well. That’s mostly how I use my Q2 indoors also. I am going to the Leica store tomorrow to pick up a Visolflex 020. I know some people swear by it, others say it sits in their bag unused. I get the feeling it is what will make the M useable, for me, close focusing (or critical focusing?) outdoors. The only real decision is do I exchange the M10P for the M10R? On the one hand, I am totally happy with the 24 megapixels of the CL for family photos and the Q2’s 47mp is nice (especially cropping)but not a must have (for the family photos), on the other hand the M lenses on the S1r really do shine with all those megapixels (except maybe near the edge) and I am quite happy with the 50 mp Hasselblad and starting to think that 40-50 mp might be my sweet spot. I think I know what I am going to do. There is a part of me that thinks keeping the M10P might be false economy, or is it keeping a camera that is very thing the M10R is, save a few megapixels? Sigh... Great posts. I feel your pain, I feel your passion. Beware of the extra efforts it will take you to get sharp results with the M10R, it requires better technique, or faster shutter speeds. I returned mine for an M10P, accepting a 3K loss in the process. Also, I don't want to add more problems on your plate, but I have heard early impressions from A1 users that M lenses are performing quite excellent on it. I have one on the side at my local retailer, might pick it up next week to try it. It might solve many of the things you didn't use to like. New menus, 50MP at 30fps (which means for fast action subject you could stay pressed on the shutter while slowly turning your focus ring from left to right or right to left, and choose which one has the sharpest focus in post among 60 shots 😂😭), extreme low light performance, new colour science which is supposed to be highly improved according to Gerald Undone... essentially the perfect hybrid camera, that can do it all, it a package half the size of the SL2, and very close to the Q2..... Let's see... P.S. I remind you that a few month ago I did a side by side between the M10R and the A7SIII with M lenses, and no one here could tell which was which. In the instance that there was a difference, the Sony was preferred in 90% of the situations in the blind test. So one could argue that the compact A1 could do everything (and more) than all the cameras you've mentioned in your post together. Only problem, its not a Leica. Edited February 21 by Steven", "link": "https://www.l-camera-forum.com/topic/312268-m10-p-or-m10r/page/8/?tab=comments#comment-4146000", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "12 minutes ago, soarfm said: sigh, well here i am struggling with the same decision. i have a very beautiful m10p sitting here at my table for the last day. i’m either keeping it or returning it along with another wad of money for an m10r. my last digital m was an m9 that i sold 6+ years ago, and to be truthful, i never got on very good with it. terrible high iso performance, the shutter was anything but discreet and lack of live view is what finally made me give it up as mirrorless cameras came of age with cmos sensors and high resolution evf’s. i tried to make my m lenses work on that infernal sony a7r and a7r2, but never to my satisfaction. i just couldn’t accept smearing. so i sold all but my 35 and 50 summicrons and put them aside with my m6 (also 35 years old) that i couldn’t bear to part with for sentimental reasons. turns out the sony’s output is really nice but every time i had to dive into a menu, i wanted to poke my eyes out, searching for some cool feature that was for some reason not working because some other setting change made that unavailable, well i had enough and got rid of it. then some time with the mf fujis including the gfx 100, but turns out it was more an exercise in chasing ultimate image quality while ignoring my unwillingness to actually haul that stuff around on a regular basis. sold it all replacing it with a relatively more diminutive hasselblad 907x, although still not an everyday driver...in the meantime i put together a leica cl digital kit for actually carry about and practical family and family vacation photography. i really use the hell out of that kit, pandemic notwithstanding. bought an m-l adapter for the m lenses on the cl, used it a few times but really just used the very remarkable 18-56 zoom that came with the cl. a q2 was rationalized and added for low light indoor uses.😀 then i decided to start scanning my analog -----> archive !!!  with a pre-owned panasonic s1r (for the pixel shift multi shot function) and a sigma macro. it is light years ahead of flatbed scanning and works so well i started putting film in my film cameras again, including the m6. i can’t emphasize enough how pleased i am to have meaningful access to almost 30 years of negatives and slides to print on modern inkjets. i decide upon the s1r for scanning because in the back of my mind i was aware that i could put all my cl lenses (l mount) on the s1r and then have ibis capability and 20 megapixels available—if i wanted. then took out the m-l adapter and put my 35 and 50 on the s1r. wow! 47 megapixel of niceness and none of the edge smearing that i saw on the sonys (2 paragraphs back), not perfect on the 35 but real darn close. focus peaking worked great. but it’s still more camera than i will carry around. for a moment i regretted not jumping right to the sl2 which has the clean interface i know from the q2 and cl, but the s1r pre-owned was about $2k and an sl2 was going to be well over $5k and i wasn’t convinced i would still carry it regular. i just can’t picture myself buying leica sl lenses, not because of the cost, but because of the size. no how, no way. but my appetite has been whetted to use my diminutive m lenses on a camera i will carry. and the sour taste of the m9 is gone and while most of my time here on the l-forum has been focused on q and cl cameras i have been aware that the digital rangefinder has really matured. so i bought an m10-p. it is slim and beautiful, and oh, that shutter, what a change from m9 days! i was a bit concerned about how i would get along with the rangefinder (focus accuracy) since eyeglasses became a part of my wardrobe. i know that digital is more demanding of focus than film. it’s going quite well, performance checking focus accuracy on the live view and picture review is very instructive. the fluid motion of focus and shutter release has returned helped out by setting 1/4f in auto. ibis or high iso performance seem to serve the same function and now we have high iso performance, it places this camera in a different league of usability over film or the old m9. i’ve also found that i can frame, focus and shoot (at least indoors) using solely the rear screen quite well. that’s mostly how i use my q2 indoors also. i am going to the leica store tomorrow to pick up a visolflex 020. i know some people swear by it, others say it sits in their bag unused. i get the feeling it is what will make the m useable, for me, close focusing (or critical focusing?) outdoors. the only real decision is do i exchange the m10p for the m10r? on the one hand, i am totally happy with the 24 megapixels of the cl for family photos and the q2’s 47mp is nice (especially cropping)but not a must have (for the family photos), on the other hand the m lenses on the s1r really do shine with all those megapixels (except maybe near the edge) and i am quite happy with the 50 mp hasselblad and starting to think that 40-50 mp might be my sweet spot. i think i know what i am going to do. there is a part of me that thinks keeping the m10p might be false economy, or is it keeping a camera that is very thing the m10r is, save a few megapixels? sigh... great posts. i feel your pain, i feel your passion. beware of the extra efforts it will take you to get sharp results with the m10r, it requires better technique, or faster shutter speeds. i returned mine for an m10p, accepting a 3k loss in the process. also, i don't want to add more problems on your plate, but i have heard early impressions from a1 users that m lenses are performing quite excellent on it. i have one on the side at my local retailer, might pick it up next week to try it. it might solve many of the things you didn't use to like. new menus, 50mp at 30fps (which means for fast action subject you could stay pressed on the shutter while slowly turning your focus ring from left to right or right to left, and choose which one has the sharpest focus in post among 60 shots 😂😭), extreme low light performance, new colour science which is supposed to be highly improved according to gerald undone... essentially the perfect hybrid camera, that can do it all, it a package half the size of the sl2, and very close to the q2..... let's see... p.s. i remind you that a few month ago i did a side by side between the m10r and the a7siii with m lenses, and no one here could tell which was which. in the instance that there was a difference, the sony was preferred in 90% of the situations in the blind test. so one could argue that the compact a1 could do everything (and more) than all the cameras you've mentioned in your post together. only problem, its not a leica. edited february 21 by steven", "sortedWord": "None", "identifyer": 4389, "year": "2021"}, {"Unnamed: 0": 343312, "autor": "dkmoore", "date": 1613924040000, "content": "19 minutes ago, SoarFM said: Sigh, well here I am struggling with the same decision. I have a very beautiful M10P sitting here at my table for the last day. I’m either keeping it or returning it along with another wad of money for an M10R. My last digital M was an M9 that I sold 6+ years ago, and to be truthful, I never got on very good with it. Terrible high iso performance, the shutter was anything but discreet and lack of live view is what finally made me give it up as mirrorless cameras came of age with CMOS sensors and high resolution EVF’s. I tried to make my M lenses work on that infernal Sony A7r and A7r2, but never to my satisfaction. I just couldn’t accept smearing. So I sold all but my 35 and 50 summicrons and put them aside with my M6 (also 35 years old) that I couldn’t bear to part with for sentimental reasons. Turns out the Sony’s output is really nice but every time I had to dive into a menu, I wanted to poke my eyes out, searching for some cool feature that was for some reason not working because some other setting change made that unavailable, well I had enough and got rid of it. Then some time with the MF Fujis including the GFX 100, but turns out it was more an exercise in chasing ultimate image quality while ignoring my unwillingness to actually haul that stuff around on a regular basis. Sold it all replacing it with a relatively more diminutive Hasselblad 907x, although still not an everyday driver...In the meantime I put together a Leica CL digital kit for actually carry about and practical family and family vacation photography. I really use the hell out of that kit, pandemic notwithstanding. Bought an M-L adapter for the M lenses on the CL, used it a few times but really just used the very remarkable 18-56 zoom that came with the CL. A Q2 was rationalized and added for low light indoor uses.😀 Then I decided to start scanning my analog archive with a pre-owned Panasonic S1r (for the pixel shift multi shot function) and a Sigma macro. It is light years ahead of flatbed scanning and works so well I started putting film in my film cameras again, including the M6. I can’t emphasize enough how pleased I am to have meaningful access to almost 30 years of negatives and slides to print on modern inkjets. I decide upon the S1r for scanning because in the back of my mind I was aware that I could put all my CL lenses (L mount) on the S1r and then have IBIS capability and 20 megapixels available—if I wanted. Then took out the M-L adapter and put my 35 and 50 on the S1r. Wow! 47 megapixel of niceness and none of the edge smearing that I saw on the Sonys (2 paragraphs back), not perfect on the 35 but real darn close. Focus peaking worked great. But it’s still more camera than I will carry around. For a moment I regretted not jumping right to the SL2 which has the clean interface I know from the Q2 and CL, but the S1r pre-owned was about $2k and an SL2 was going to be well over $5k and I wasn’t convinced I would still carry it regular. I just can’t picture myself buying Leica SL lenses, not because of the cost, but because of the size. No how, no way. But my appetite has been whetted to use my diminutive M lenses on a camera I will carry. And the sour taste of the M9 is gone and while most of my time here on the L-forum has been focused on Q and CL cameras I have been aware that the digital rangefinder has really matured. So I bought an M10-P. It is slim and beautiful, and oh, that shutter, what a change from M9 days! I was a bit concerned about how I would get along with the rangefinder (focus accuracy) since eyeglasses became a part of my wardrobe. I know that digital is more demanding of focus than film. It’s going quite well, performance checking focus accuracy on the live view and picture review is very instructive. The fluid motion of focus and shutter release has returned helped out by setting 1/4f in auto. IBIS or high iso performance seem to serve the same function and now we have high iso performance, it places this camera in a different league of usability over film or the old M9. I’ve also found that I can frame, focus and shoot (at least indoors) using solely the rear screen quite well. That’s mostly how I use my Q2 indoors also. I am going to the Leica store tomorrow to pick up a Visolflex 020. I know some people swear by it, others say it sits in their bag unused. I get the feeling it is what will make the M useable, for me, close focusing (or critical focusing?) outdoors. The only real decision is do I exchange the M10P for the M10R? On the one hand, I am totally happy with the 24 megapixels of the CL for family photos and the Q2’s 47mp is nice (especially cropping)but not a must have (for the family photos), on the other hand the M lenses on the S1r really do shine with all those megapixels (except maybe near the edge) and I am quite happy with the 50 mp Hasselblad and starting to think that 40-50 mp might be my sweet spot. I think I know what I am going to do. There is a part of me that thinks keeping the M10P might be false economy, or is it keeping a camera that is everything the M10R is, save a few megapixels? Sigh... My two cents (or one) after moving from the M10P to the M10R is that if you will be using the M for general family snaps indoor, never on tripod, and simply for fun then I would stick with the M10P. At first I argued against all of the shutter speed talk of needing high speed for the M10R but after many months of use I have to admit that it truly is a challenge and I keep around 120-200 minimum and even that can be challenging. But, the image quality is noticeably better with the M10R which is the only reason I haven’t gone back to the M10P. I can see why it would be a hard decision.", "link": "https://www.l-camera-forum.com/topic/312268-m10-p-or-m10r/page/8/?tab=comments#comment-4146015", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "19 minutes ago, soarfm said: sigh, well here i am struggling with the same decision. i have a very beautiful m10p sitting here at my table for the last day. i’m either keeping it or returning it along with another wad of money for an m10r. my last digital m was an m9 that i sold 6+ years ago, and to be truthful, i never got on very good with it. terrible high iso performance, the shutter was anything but discreet and lack of live view is what finally made me give it up as mirrorless cameras came of age with cmos sensors and high resolution evf’s. i tried to make my m lenses work on that infernal sony a7r and a7r2, but never to my satisfaction. i just couldn’t accept smearing. so i sold all but my 35 and 50 summicrons and put them aside with my m6 (also 35 years old) that i couldn’t bear to part with for sentimental reasons. turns out the sony’s output is really nice but every time i had to dive into a menu, i wanted to poke my eyes out, searching for some cool feature that was for some reason not working because some other setting change made that unavailable, well i had enough and got rid of it. then some time with the mf fujis including the gfx 100, but turns out it was more an exercise in chasing ultimate image quality while ignoring my unwillingness to actually haul that stuff around on a regular basis. sold it all replacing it with a relatively more diminutive hasselblad 907x, although still not an everyday driver...in the meantime i put together a leica cl digital kit for actually carry about and practical family and family vacation photography. i really use the hell out of that kit, pandemic notwithstanding. bought an m-l adapter for the m lenses on the cl, used it a few times but really just used the very remarkable 18-56 zoom that came with the cl. a q2 was rationalized and added for low light indoor uses.😀 then i decided to start scanning my analog -----> archive !!!  with a pre-owned panasonic s1r (for the pixel shift multi shot function) and a sigma macro. it is light years ahead of flatbed scanning and works so well i started putting film in my film cameras again, including the m6. i can’t emphasize enough how pleased i am to have meaningful access to almost 30 years of negatives and slides to print on modern inkjets. i decide upon the s1r for scanning because in the back of my mind i was aware that i could put all my cl lenses (l mount) on the s1r and then have ibis capability and 20 megapixels available—if i wanted. then took out the m-l adapter and put my 35 and 50 on the s1r. wow! 47 megapixel of niceness and none of the edge smearing that i saw on the sonys (2 paragraphs back), not perfect on the 35 but real darn close. focus peaking worked great. but it’s still more camera than i will carry around. for a moment i regretted not jumping right to the sl2 which has the clean interface i know from the q2 and cl, but the s1r pre-owned was about $2k and an sl2 was going to be well over $5k and i wasn’t convinced i would still carry it regular. i just can’t picture myself buying leica sl lenses, not because of the cost, but because of the size. no how, no way. but my appetite has been whetted to use my diminutive m lenses on a camera i will carry. and the sour taste of the m9 is gone and while most of my time here on the l-forum has been focused on q and cl cameras i have been aware that the digital rangefinder has really matured. so i bought an m10-p. it is slim and beautiful, and oh, that shutter, what a change from m9 days! i was a bit concerned about how i would get along with the rangefinder (focus accuracy) since eyeglasses became a part of my wardrobe. i know that digital is more demanding of focus than film. it’s going quite well, performance checking focus accuracy on the live view and picture review is very instructive. the fluid motion of focus and shutter release has returned helped out by setting 1/4f in auto. ibis or high iso performance seem to serve the same function and now we have high iso performance, it places this camera in a different league of usability over film or the old m9. i’ve also found that i can frame, focus and shoot (at least indoors) using solely the rear screen quite well. that’s mostly how i use my q2 indoors also. i am going to the leica store tomorrow to pick up a visolflex 020. i know some people swear by it, others say it sits in their bag unused. i get the feeling it is what will make the m useable, for me, close focusing (or critical focusing?) outdoors. the only real decision is do i exchange the m10p for the m10r? on the one hand, i am totally happy with the 24 megapixels of the cl for family photos and the q2’s 47mp is nice (especially cropping)but not a must have (for the family photos), on the other hand the m lenses on the s1r really do shine with all those megapixels (except maybe near the edge) and i am quite happy with the 50 mp hasselblad and starting to think that 40-50 mp might be my sweet spot. i think i know what i am going to do. there is a part of me that thinks keeping the m10p might be false economy, or is it keeping a camera that is everything the m10r is, save a few megapixels? sigh... my two cents (or one) after moving from the m10p to the m10r is that if you will be using the m for general family snaps indoor, never on tripod, and simply for fun then i would stick with the m10p. at first i argued against all of the shutter speed talk of needing high speed for the m10r but after many months of use i have to admit that it truly is a challenge and i keep around 120-200 minimum and even that can be challenging. but, the image quality is noticeably better with the m10r which is the only reason i haven’t gone back to the m10p. i can see why it would be a hard decision.", "sortedWord": "None", "identifyer": 4390, "year": "2021"}, {"Unnamed: 0": 343358, "autor": "SoarFM", "date": 1614880560000, "content": "On 2/21/2021 at 10:51 AM, SoarFM said: Sigh, well here I am struggling with the same decision. I have a very beautiful M10P sitting here at my table for the last day. I’m either keeping it or returning it along with another wad of money for an M10R. My last digital M was an M9 that I sold 6+ years ago, and to be truthful, I never got on very good with it. Terrible high iso performance, the shutter was anything but discreet and lack of live view is what finally made me give it up as mirrorless cameras came of age with CMOS sensors and high resolution EVF’s. I tried to make my M lenses work on that infernal Sony A7r and A7r2, but never to my satisfaction. I just couldn’t accept smearing. So I sold all but my 35 and 50 summicrons and put them aside with my M6 (also 35 years old) that I couldn’t bear to part with for sentimental reasons. Turns out the Sony’s output is really nice but every time I had to dive into a menu, I wanted to poke my eyes out, searching for some cool feature that was for some reason not working because some other setting change made that unavailable, well I had enough and got rid of it. Then some time with the MF Fujis including the GFX 100, but turns out it was more an exercise in chasing ultimate image quality while ignoring my unwillingness to actually haul that stuff around on a regular basis. Sold it all replacing it with a relatively more diminutive Hasselblad 907x, although still not an everyday driver...In the meantime I put together a Leica CL digital kit for actually carry about and practical family and family vacation photography. I really use the hell out of that kit, pandemic notwithstanding. Bought an M-L adapter for the M lenses on the CL, used it a few times but really just used the very remarkable 18-56 zoom that came with the CL. A Q2 was rationalized and added for low light indoor uses.😀 Then I decided to start scanning my analog archive with a pre-owned Panasonic S1r (for the pixel shift multi shot function) and a Sigma macro. It is light years ahead of flatbed scanning and works so well I started putting film in my film cameras again, including the M6. I can’t emphasize enough how pleased I am to have meaningful access to almost 30 years of negatives and slides to print on modern inkjets. I decide upon the S1r for scanning because in the back of my mind I was aware that I could put all my CL lenses (L mount) on the S1r and then have IBIS capability and 20 megapixels available—if I wanted. Then took out the M-L adapter and put my 35 and 50 on the S1r. Wow! 47 megapixel of niceness and none of the edge smearing that I saw on the Sonys (2 paragraphs back), not perfect on the 35 but real darn close. Focus peaking worked great. But it’s still more camera than I will carry around. For a moment I regretted not jumping right to the SL2 which has the clean interface I know from the Q2 and CL, but the S1r pre-owned was about $2k and an SL2 was going to be well over $5k and I wasn’t convinced I would still carry it regular. I just can’t picture myself buying Leica SL lenses, not because of the cost, but because of the size. No how, no way. But my appetite has been whetted to use my diminutive M lenses on a camera I will carry. And the sour taste of the M9 is gone and while most of my time here on the L-forum has been focused on Q and CL cameras I have been aware that the digital rangefinder has really matured. So I bought an M10-P. It is slim and beautiful, and oh, that shutter, what a change from M9 days! I was a bit concerned about how I would get along with the rangefinder (focus accuracy) since eyeglasses became a part of my wardrobe. I know that digital is more demanding of focus than film. It’s going quite well, performance checking focus accuracy on the live view and picture review is very instructive. The fluid motion of focus and shutter release has returned helped out by setting 1/4f in auto. IBIS or high iso performance seem to serve the same function and now we have high iso performance, it places this camera in a different league of usability over film or the old M9. I’ve also found that I can frame, focus and shoot (at least indoors) using solely the rear screen quite well. That’s mostly how I use my Q2 indoors also. I am going to the Leica store tomorrow to pick up a Visolflex 020. I know some people swear by it, others say it sits in their bag unused. I get the feeling it is what will make the M useable, for me, close focusing (or critical focusing?) outdoors. The only real decision is do I exchange the M10P for the M10R? On the one hand, I am totally happy with the 24 megapixels of the CL for family photos and the Q2’s 47mp is nice (especially cropping)but not a must have (for the family photos), on the other hand the M lenses on the S1r really do shine with all those megapixels (except maybe near the edge) and I am quite happy with the 50 mp Hasselblad and starting to think that 40-50 mp might be my sweet spot. I think I know what I am going to do. There is a part of me that thinks keeping the M10P might be false economy, or is it keeping a camera that is everything the M10R is, save a few megapixels? Sigh... Ok, so what did I do...? I exchanged the M10P (and some cash) for the M10R. I’ve only had the camera for a week now but I don’t seem to have any issues with camera shake vs. the M10P, but to be honest I only had the M10P for a coup;le days and the M10R hasn’t really seen wide usage in real life, just a bunch of test shots. I will accept that even if I didn’t see a night and day difference, I’m sure that there is a difference, that is the nature of working with a higher resolution sensor. So far I’ve been using 1/4f as min shutter speed and I’m OK with that. I put a diopter correction on the rangefinder and have now learned how to slide the eyeglasses up with my hand and I have the crisp clear viewfinder to work the rangefinder and the rangefinder is dead on. I had always struggled with the M9 rangefinder. I had actually noticed that my 50 Summicron wasn’t dead on with the rangefinder at closer distances and sent that and its 35mm cousin into Leica for a CLA that was 25 years overdue, I asked them to pay special attention to focus calibration. Sadly the problems ran a little deeper, Leica has pronounced the 50 Summicron unrepairable with haze and coating damage between rear elements that are no longer available. 😢. I was never in love with the 50 Summicron and am wondering if perhaps it is due to what amounts to a “bad sample”? Lens arrives back tomorrow and I will examine it closer because I never noticed any obvious defects. Happily, the 35 doesn’t seem to have been afflicted with same problem and is getting overhauled. Now I have to shop for a 50... Not the news I wanted.... The 50 summicron and Summilux are the two candidates. Going to Leica DC and put the lens on my camera and test in store and neighborhood near store. Go home. Pixel peep. Make decision. Edited March 4 by SoarFM", "link": "https://www.l-camera-forum.com/topic/312268-m10-p-or-m10r/page/10/?tab=comments#comment-4153589", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "on 2/21/2021 at 10:51 am, soarfm said: sigh, well here i am struggling with the same decision. i have a very beautiful m10p sitting here at my table for the last day. i’m either keeping it or returning it along with another wad of money for an m10r. my last digital m was an m9 that i sold 6+ years ago, and to be truthful, i never got on very good with it. terrible high iso performance, the shutter was anything but discreet and lack of live view is what finally made me give it up as mirrorless cameras came of age with cmos sensors and high resolution evf’s. i tried to make my m lenses work on that infernal sony a7r and a7r2, but never to my satisfaction. i just couldn’t accept smearing. so i sold all but my 35 and 50 summicrons and put them aside with my m6 (also 35 years old) that i couldn’t bear to part with for sentimental reasons. turns out the sony’s output is really nice but every time i had to dive into a menu, i wanted to poke my eyes out, searching for some cool feature that was for some reason not working because some other setting change made that unavailable, well i had enough and got rid of it. then some time with the mf fujis including the gfx 100, but turns out it was more an exercise in chasing ultimate image quality while ignoring my unwillingness to actually haul that stuff around on a regular basis. sold it all replacing it with a relatively more diminutive hasselblad 907x, although still not an everyday driver...in the meantime i put together a leica cl digital kit for actually carry about and practical family and family vacation photography. i really use the hell out of that kit, pandemic notwithstanding. bought an m-l adapter for the m lenses on the cl, used it a few times but really just used the very remarkable 18-56 zoom that came with the cl. a q2 was rationalized and added for low light indoor uses.😀 then i decided to start scanning my analog -----> archive !!!  with a pre-owned panasonic s1r (for the pixel shift multi shot function) and a sigma macro. it is light years ahead of flatbed scanning and works so well i started putting film in my film cameras again, including the m6. i can’t emphasize enough how pleased i am to have meaningful access to almost 30 years of negatives and slides to print on modern inkjets. i decide upon the s1r for scanning because in the back of my mind i was aware that i could put all my cl lenses (l mount) on the s1r and then have ibis capability and 20 megapixels available—if i wanted. then took out the m-l adapter and put my 35 and 50 on the s1r. wow! 47 megapixel of niceness and none of the edge smearing that i saw on the sonys (2 paragraphs back), not perfect on the 35 but real darn close. focus peaking worked great. but it’s still more camera than i will carry around. for a moment i regretted not jumping right to the sl2 which has the clean interface i know from the q2 and cl, but the s1r pre-owned was about $2k and an sl2 was going to be well over $5k and i wasn’t convinced i would still carry it regular. i just can’t picture myself buying leica sl lenses, not because of the cost, but because of the size. no how, no way. but my appetite has been whetted to use my diminutive m lenses on a camera i will carry. and the sour taste of the m9 is gone and while most of my time here on the l-forum has been focused on q and cl cameras i have been aware that the digital rangefinder has really matured. so i bought an m10-p. it is slim and beautiful, and oh, that shutter, what a change from m9 days! i was a bit concerned about how i would get along with the rangefinder (focus accuracy) since eyeglasses became a part of my wardrobe. i know that digital is more demanding of focus than film. it’s going quite well, performance checking focus accuracy on the live view and picture review is very instructive. the fluid motion of focus and shutter release has returned helped out by setting 1/4f in auto. ibis or high iso performance seem to serve the same function and now we have high iso performance, it places this camera in a different league of usability over film or the old m9. i’ve also found that i can frame, focus and shoot (at least indoors) using solely the rear screen quite well. that’s mostly how i use my q2 indoors also. i am going to the leica store tomorrow to pick up a visolflex 020. i know some people swear by it, others say it sits in their bag unused. i get the feeling it is what will make the m useable, for me, close focusing (or critical focusing?) outdoors. the only real decision is do i exchange the m10p for the m10r? on the one hand, i am totally happy with the 24 megapixels of the cl for family photos and the q2’s 47mp is nice (especially cropping)but not a must have (for the family photos), on the other hand the m lenses on the s1r really do shine with all those megapixels (except maybe near the edge) and i am quite happy with the 50 mp hasselblad and starting to think that 40-50 mp might be my sweet spot. i think i know what i am going to do. there is a part of me that thinks keeping the m10p might be false economy, or is it keeping a camera that is everything the m10r is, save a few megapixels? sigh... ok, so what did i do...? i exchanged the m10p (and some cash) for the m10r. i’ve only had the camera for a week now but i don’t seem to have any issues with camera shake vs. the m10p, but to be honest i only had the m10p for a coup;le days and the m10r hasn’t really seen wide usage in real life, just a bunch of test shots. i will accept that even if i didn’t see a night and day difference, i’m sure that there is a difference, that is the nature of working with a higher resolution sensor. so far i’ve been using 1/4f as min shutter speed and i’m ok with that. i put a diopter correction on the rangefinder and have now learned how to slide the eyeglasses up with my hand and i have the crisp clear viewfinder to work the rangefinder and the rangefinder is dead on. i had always struggled with the m9 rangefinder. i had actually noticed that my 50 summicron wasn’t dead on with the rangefinder at closer distances and sent that and its 35mm cousin into leica for a cla that was 25 years overdue, i asked them to pay special attention to focus calibration. sadly the problems ran a little deeper, leica has pronounced the 50 summicron unrepairable with haze and coating damage between rear elements that are no longer available. 😢. i was never in love with the 50 summicron and am wondering if perhaps it is due to what amounts to a “bad sample”? lens arrives back tomorrow and i will examine it closer because i never noticed any obvious defects. happily, the 35 doesn’t seem to have been afflicted with same problem and is getting overhauled. now i have to shop for a 50... not the news i wanted.... the 50 summicron and summilux are the two candidates. going to leica dc and put the lens on my camera and test in store and neighborhood near store. go home. pixel peep. make decision. edited march 4 by soarfm", "sortedWord": "None", "identifyer": 4436, "year": "2021"}, {"Unnamed: 0": 347364, "autor": "mnutzer", "date": 1621199340000, "content": "Changed file numbering of my Leicas: L1xxxxxx : M8.2 - original numbering for my first digital Leica, now only for the image archive because camera was sold, L2xxxxxx: M10-P - my second digital Leica, L3xxxxxx: X-U - my third digital Leica, L4xxxxxx- L9xxxxxx - don't think to need all numbers on future Leicas for the rest of my life. A million shutter releases are likely to exceed the lifespan of each of these cameras.", "link": "https://www.l-camera-forum.com/topic/320915-conflict-with-file-names-from-different-cameras/?tab=comments#comment-4202196", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "changed file numbering of my leicas: l1xxxxxx : m8.2 - original numbering for my first digital leica, now only for the image -----> archive !!!  because camera was sold, l2xxxxxx: m10-p - my second digital leica, l3xxxxxx: x-u - my third digital leica, l4xxxxxx- l9xxxxxx - don't think to need all numbers on future leicas for the rest of my life. a million shutter releases are likely to exceed the lifespan of each of these cameras.", "sortedWord": "None", "identifyer": 8460, "year": "2021"}, {"Unnamed: 0": 352745, "autor": "pop", "date": 1626157080000, "content": "Am 10.7.2021 um 02:41 schrieb jaeger: My question would be the access speed when operating these files in LR catalogue In a typical PC (of any make) the processor outperforms its storage. You will save much time when copying, moving and processing compressed images. This becomes perceptible when copying the images from the SD card or from the camera's memory as well as when doing a backup of your image archive and, of course, whenever you handle an image file. The same applies to moving the images over a network. Smaller files move faster. Conceivably, you might even save time in-camera by saving compressed images, but this depends on many technical details. Why not just try? Saving a digital image to a storage card does not cost anything but a bit of your time.", "link": "https://www.l-camera-forum.com/topic/321823-raw-dng-compression-on-or-off/?tab=comments#comment-4237208", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "am 10.7.2021 um 02:41 schrieb jaeger: my question would be the access speed when operating these files in lr catalogue in a typical pc (of any make) the processor outperforms its storage. you will save much time when copying, moving and processing compressed images. this becomes perceptible when copying the images from the sd card or from the camera's memory as well as when doing a backup of your image -----> archive !!!  and, of course, whenever you handle an image file. the same applies to moving the images over a network. smaller files move faster. conceivably, you might even save time in-camera by saving compressed images, but this depends on many technical details. why not just try? saving a digital image to a storage card does not cost anything but a bit of your time.", "sortedWord": "None", "identifyer": 13889, "year": "2021"}, {"Unnamed: 0": 369321, "autor": "setuporg", "date": 1629864960000, "content": " I was one of the lucky few who got the \"new\" M9-P from KEH -- releathered and certified by Leica, in a new box with the new document. I must say that everything about the different colors is true. It's like Ektachrome. Vibrant, fresh. Timeless camera, and really no drawbacks. I've already had like 10 batteries from the M9Ms and it's just a thing of beauty. Am getting some 8GB and even 4Gb cards so I don't have to wait for a complete 600-800 set (I used each card once and archive as digital negative). M10R/M10M are fine with 16 GB. Hold on to your M9s! What a club.", "link": "https://www.l-camera-forum.com/topic/323904-a-new-m9-p-in-2021/?tab=comments#comment-4263073", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": " i was one of the lucky few who got the \"new\" m9-p from keh -- releathered and certified by leica, in a new box with the new document. i must say that everything about the different colors is true. it's like ektachrome. vibrant, fresh. timeless camera, and really no drawbacks. i've already had like 10 batteries from the m9ms and it's just a thing of beauty. am getting some 8gb and even 4gb cards so i don't have to wait for a complete 600-800 set (i used each card once and -----> archive !!!  as digital negative). m10r/m10m are fine with 16 gb. hold on to your m9s! what a club.", "sortedWord": "None", "identifyer": 30617, "year": "2021"}, {"Unnamed: 0": 369323, "autor": "ianman", "date": 1629879060000, "content": "3 hours ago, setuporg said: Am getting some 8GB and even 4Gb cards so I don't have to wait for a complete 600-800 set (I used each card once and archive as digital negative). I don't understand what you're doing. What are waiting for? Do you mean you don't take the card out of the camera before it's full? In an y event I hope you are making back ups of your cards, I wouldn't trust them to archive anything.", "link": "https://www.l-camera-forum.com/topic/323904-a-new-m9-p-in-2021/?tab=comments#comment-4263151", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "3 hours ago, setuporg said: am getting some 8gb and even 4gb cards so i don't have to wait for a complete 600-800 set (i used each card once and -----> archive !!!  as digital negative). i don't understand what you're doing. what are waiting for? do you mean you don't take the card out of the camera before it's full? in an y event i hope you are making back ups of your cards, i wouldn't trust them to archive anything.", "sortedWord": "None", "identifyer": 30619, "year": "2021"}, {"Unnamed: 0": 369324, "autor": "setuporg", "date": 1629901680000, "content": "6 hours ago, ianman said: I don't understand what you're doing. What are waiting for? Do you mean you don't take the card out of the camera before it's full? In an y event I hope you are making back ups of your cards, I wouldn't trust them to archive anything. I shoot each crd to completion, lock it, and then ingest and archive as usual -- in Lightroom, with a secondary backup, and also periodically archiving drives to tape. The cards are all numbered and remain the \"negative\" archive.", "link": "https://www.l-camera-forum.com/topic/323904-a-new-m9-p-in-2021/?tab=comments#comment-4263417", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "6 hours ago, ianman said: i don't understand what you're doing. what are waiting for? do you mean you don't take the card out of the camera before it's full? in an y event i hope you are making back ups of your cards, i wouldn't trust them to -----> archive !!!  anything. i shoot each crd to completion, lock it, and then ingest and archive as usual -- in lightroom, with a secondary backup, and also periodically archiving drives to tape. the cards are all numbered and remain the \"negative\" archive.", "sortedWord": "None", "identifyer": 30620, "year": "2021"}, {"Unnamed: 0": 369326, "autor": "JonPB", "date": 1629954660000, "content": "Careful! If you’re just treating the cards as write-once, perhaps return to someday, then I definitely see the appeal. But if you’re trusting those cards as archives … don’t. Full stop, bold lettering with circles and arrows and a paragraph on the back of each one. SD cards are not archival media, and that’s over a period of years, not centuries. I’ve used a similar approach, and while I’ve only lost a few bits from a few images, which I could probably recover and clone over if it were important, the data on SD cards will certainly erode over years while even less expensive spinning disks will retain the same data for much longer, not to mention archive-specific tape or optical media. tl;dr: never trust flash memory for archival data. But. My M9, at least after upgrading firmware a few times, is happy with recently modern 32GB SDHC cards, and I am happy with them. I get that people might want video or live view (M240) or a larger finder (M10), but as far as I can tell the M9 is truly the authentic M-D of today — quality where it matters but not much else. The Monochrom (of any genetation) is my only siren.", "link": "https://www.l-camera-forum.com/topic/323904-a-new-m9-p-in-2021/?tab=comments#comment-4263791", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "careful! if you’re just treating the cards as write-once, perhaps return to someday, then i definitely see the appeal. but if you’re trusting those cards as archives … don’t. full stop, bold lettering with circles and arrows and a paragraph on the back of each one. sd cards are not archival media, and that’s over a period of years, not centuries. i’ve used a similar approach, and while i’ve only lost a few bits from a few images, which i could probably recover and clone over if it were important, the data on sd cards will certainly erode over years while even less expensive spinning disks will retain the same data for much longer, not to mention -----> archive !!! -specific tape or optical media. tl;dr: never trust flash memory for archival data. but. my m9, at least after upgrading firmware a few times, is happy with recently modern 32gb sdhc cards, and i am happy with them. i get that people might want video or live view (m240) or a larger finder (m10), but as far as i can tell the m9 is truly the authentic m-d of today — quality where it matters but not much else. the monochrom (of any genetation) is my only siren.", "sortedWord": "None", "identifyer": 30622, "year": "2021"}, {"Unnamed: 0": 369328, "autor": "ianman", "date": 1629978120000, "content": "21 hours ago, setuporg said: I shoot each crd to completion, lock it, and then ingest and archive as usual -- in Lightroom, with a secondary backup, and also periodically archiving drives to tape. The cards are all numbered and remain the \"negative\" archive. So you fill the card with 600-800 photos and only then see the photos properly? I couldn't do that, it'd take me ages And you keep all the files? At least you are backing them up to tape but tbh there are much easier solutions.", "link": "https://www.l-camera-forum.com/topic/323904-a-new-m9-p-in-2021/?tab=comments#comment-4263942", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "21 hours ago, setuporg said: i shoot each crd to completion, lock it, and then ingest and -----> archive !!!  as usual -- in lightroom, with a secondary backup, and also periodically archiving drives to tape. the cards are all numbered and remain the \"negative\" archive. so you fill the card with 600-800 photos and only then see the photos properly? i couldn't do that, it'd take me ages and you keep all the files? at least you are backing them up to tape but tbh there are much easier solutions.", "sortedWord": "None", "identifyer": 30624, "year": "2021"}, {"Unnamed: 0": 369329, "autor": "wattsy", "date": 1629978420000, "content": "I must admit the M9-P was probably my favourite of the various digital M cameras I've owned over the years. My M240 is quieter and has a smoother, more 'solid' feel but I've never really got on with the files. Incidentally, I agree with the advice not to rely on flash media (SD cards or USB sticks) for archive purposes. Okay for short term backup but a terrible idea for longer term purposes. I can't think of a medium less suitable as a \"digital negative\".", "link": "https://www.l-camera-forum.com/topic/323904-a-new-m9-p-in-2021/?tab=comments#comment-4263947", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "i must admit the m9-p was probably my favourite of the various digital m cameras i've owned over the years. my m240 is quieter and has a smoother, more 'solid' feel but i've never really got on with the files. incidentally, i agree with the advice not to rely on flash media (sd cards or usb sticks) for -----> archive !!!  purposes. okay for short term backup but a terrible idea for longer term purposes. i can't think of a medium less suitable as a \"digital negative\".", "sortedWord": "None", "identifyer": 30625, "year": "2021"}, {"Unnamed: 0": 387170, "autor": "Kriehuber", "date": 1632286620000, "content": "vor 7 Stunden schrieb i8z: I have studied Winogrand for years, his work is amazing and I frequently get lost in his photographs. I didn't realize he was using hyperfocal focusing, thank you. Since he used a M2 and ( more prominently a M4 ) he used a extern 28mm viewfinder ( the one from Leica ). In a couple of interviews he says how important it is for him to always look through the viewfinder when taking the picture. Thats why he focused via hyperlocal or to be more precise, he focused by feel ( feeling where the focus tab is on the lens ), Because when shooting the scenes he shot, there is no time to focus through the rangefinder and then to compose through the external viewfinder. Then the moment would be gone and out of focus and since you can focus precisely without the rangefinder when shooting at f5.6 . f22 ( on the Elamrit he used ) using the external finder was a really easy solution to get good framing. That way he could archive good focus and nice framing, while being extremely fast.", "link": "https://www.l-camera-forum.com/topic/324688-using-f11-for-100-of-my-leica-mda-photos-hyper-focal-focus-question/page/3/?tab=comments#comment-4279281", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "vor 7 stunden schrieb i8z: i have studied winogrand for years, his work is amazing and i frequently get lost in his photographs. i didn't realize he was using hyperfocal focusing, thank you. since he used a m2 and ( more prominently a m4 ) he used a extern 28mm viewfinder ( the one from leica ). in a couple of interviews he says how important it is for him to always look through the viewfinder when taking the picture. thats why he focused via hyperlocal or to be more precise, he focused by feel ( feeling where the focus tab is on the lens ), because when shooting the scenes he shot, there is no time to focus through the rangefinder and then to compose through the external viewfinder. then the moment would be gone and out of focus and since you can focus precisely without the rangefinder when shooting at f5.6 . f22 ( on the elamrit he used ) using the external finder was a really easy solution to get good framing. that way he could -----> archive !!!  good focus and nice framing, while being extremely fast.", "sortedWord": "None", "identifyer": 48602, "year": "2021"}, {"Unnamed: 0": 390773, "autor": "Ouroboros", "date": 1621942500000, "content": " A few years ago the washed-out pastel look that Portra 400 can produce (it can also be as punchy and vibrant as Ektar) became very popular with many wedding photographers and a plethora of 'film pack' plug-ins followed. Personally I think the effect, although very nice with the right location, the right light, the right human subjects and the right pp, can be overdone and ultimately tedious. It isn't a look I would want in my wedding photography from a wet, cold and dull January day in the West of Ireland! The problem for many photographers who are wanting a 'film look' in their images is that they've never used film and they don't really know what it is they're looking for other than a higher-key tonal range and colour palette they have seen somewhere. More almost-but-not-quite plugins become popular on the back of their quest and the digital 'film look' often deviates further from the reality of film. Fujifilm have been pretty good with some of their X-series camera profiles; Classic Chrome is very nice and prints beautifully on Crystal Archive but it is always a digital file on screen and not at all a file with the 'film look'. I still maintain that if you want the authentic film look, the best thing to do is shoot film until something eventually convinces me otherwise.", "link": "https://www.l-camera-forum.com/topic/321215-a-film-look-in-the-near-future/?tab=comments#comment-4207490", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": " a few years ago the washed-out pastel look that portra 400 can produce (it can also be as punchy and vibrant as ektar) became very popular with many wedding photographers and a plethora of 'film pack' plug-ins followed. personally i think the effect, although very nice with the right location, the right light, the right human subjects and the right pp, can be overdone and ultimately tedious. it isn't a look i would want in my wedding photography from a wet, cold and dull january day in the west of ireland! the problem for many photographers who are wanting a 'film look' in their images is that they've never used film and they don't really know what it is they're looking for other than a higher-key tonal range and colour palette they have seen somewhere. more almost-but-not-quite plugins become popular on the back of their quest and the digital 'film look' often deviates further from the reality of film. fujifilm have been pretty good with some of their x-series camera profiles; classic chrome is very nice and prints beautifully on crystal -----> archive !!!  but it is always a digital file on screen and not at all a file with the 'film look'. i still maintain that if you want the authentic film look, the best thing to do is shoot film until something eventually convinces me otherwise.", "sortedWord": "None", "identifyer": 3229, "year": "2021"}, {"Unnamed: 0": 393241, "autor": "Edgar1920", "date": 1613905860000, "content": "Am 11.2.2021 um 14:28 schrieb MikeMyers: Gee, if I use my M10 this afternoon, I wonder if I'll be trying to \"wind the film\" after each shot! :-) Hi Mike I also practice Leica M photography with models ranging from M2 to M10 and what I miss so much in my digital ones is the film winding action respectively it’s mechanical feeling. No digital M can give you this. Concerning development I use a changing bag so that I can spoil in the films on my daylight living room table. Quite practical accessory. I always develop my self as it is 30 mins only for one development including rinsing. All other options would take more time and I am always amazed when the film comes out of the tank. For scanning it took me some time especially on color slides to get what I saw on the slides, including color calibration with an IT target on my now old (but still very well running) Reflecta ProScan 7200. I think today I would first try to digitize with a digital camera. What then is important is to have a good lens (or full correction of its flaws like distortion and vignetting) and preferably a APS-C sensor than full frame as this sensor has higher depth of field. DOF must be higher than uneven film. In order to reduce unevenness of film I cut and put the film in the paper pouches shortly after drying and the let them under a big book during the night. Next morning the film is very even and stays so. Lab development usually gives you well curved negatives. Concerning lab scans: the are often of lower resolution and only JPG instead of TIFF or high priced. I now scan every negative with 3600dpi, independent if it seems to be a good or bad capture. So I have a full archive of my analog work. BW scan is not complicated as you do not have to care about colors. A scanner ha the following advantages: No uneven quality due to the digitizing lens’ flaws, possibility to repair dust, scratches and marks on color film (with infrared channel scanning); this feature does not work on BW film (and Kodachrome) as the silver does not permit the use of IR scan. The disadvantage is surely the slow digitizing process. Depending on how you work this does not matter if you are using your computer during an hour for something else, like post processing the precedent film. Then one remark in the Kodak Plus-X (which I have never used): it seems that the Kodak Double X (movie film) has a similar characteristic from what I have read. I have bought a 400ft roll last year and work exclusively with this film now since. I really like it and used it until now in a range between 125 and 1000 ISO with pleasing results for my taste. You find some few examples here (developer used see tags): https://www.flickr.com/gp/149009476@N07/KSSS00 I will soon add some of my experience with this film on my website rimpl.photo which ist still under construction. This film sells at FPP in 100ft rolls as well as already canned. Cinestill also stellt this Film. Sunny 16 for me works fine in most films (double x has some less exposure latitude and requires a bit more precise metering) with little aid sometimes from my light meter app on my smartphone when light conditions change or just to verify. This sharpens my sense of estimating light and until the illumination does not change I need no new metering. I wish you much fun with your M3. She will be gabby to get her old bones (or gear wheels) moved again, I think. Best regards, Frank", "link": "https://www.l-camera-forum.com/topic/316851-leica-m3-images-to-be-scanned/page/3/?tab=comments#comment-4145810", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "am 11.2.2021 um 14:28 schrieb mikemyers: gee, if i use my m10 this afternoon, i wonder if i'll be trying to \"wind the film\" after each shot! :-) hi mike i also practice leica m photography with models ranging from m2 to m10 and what i miss so much in my digital ones is the film winding action respectively it’s mechanical feeling. no digital m can give you this. concerning development i use a changing bag so that i can spoil in the films on my daylight living room table. quite practical accessory. i always develop my self as it is 30 mins only for one development including rinsing. all other options would take more time and i am always amazed when the film comes out of the tank. for scanning it took me some time especially on color slides to get what i saw on the slides, including color calibration with an it target on my now old (but still very well running) reflecta proscan 7200. i think today i would first try to digitize with a digital camera. what then is important is to have a good lens (or full correction of its flaws like distortion and vignetting) and preferably a aps-c sensor than full frame as this sensor has higher depth of field. dof must be higher than uneven film. in order to reduce unevenness of film i cut and put the film in the paper pouches shortly after drying and the let them under a big book during the night. next morning the film is very even and stays so. lab development usually gives you well curved negatives. concerning lab scans: the are often of lower resolution and only jpg instead of tiff or high priced. i now scan every negative with 3600dpi, independent if it seems to be a good or bad capture. so i have a full -----> archive !!!  of my analog work. bw scan is not complicated as you do not have to care about colors. a scanner ha the following advantages: no uneven quality due to the digitizing lens’ flaws, possibility to repair dust, scratches and marks on color film (with infrared channel scanning); this feature does not work on bw film (and kodachrome) as the silver does not permit the use of ir scan. the disadvantage is surely the slow digitizing process. depending on how you work this does not matter if you are using your computer during an hour for something else, like post processing the precedent film. then one remark in the kodak plus-x (which i have never used): it seems that the kodak double x (movie film) has a similar characteristic from what i have read. i have bought a 400ft roll last year and work exclusively with this film now since. i really like it and used it until now in a range between 125 and 1000 iso with pleasing results for my taste. you find some few examples here (developer used see tags): https://www.flickr.com/gp/149009476@n07/ksss00 i will soon add some of my experience with this film on my website rimpl.photo which ist still under construction. this film sells at fpp in 100ft rolls as well as already canned. cinestill also stellt this film. sunny 16 for me works fine in most films (double x has some less exposure latitude and requires a bit more precise metering) with little aid sometimes from my light meter app on my smartphone when light conditions change or just to verify. this sharpens my sense of estimating light and until the illumination does not change i need no new metering. i wish you much fun with your m3. she will be gabby to get her old bones (or gear wheels) moved again, i think. best regards, frank", "sortedWord": "None", "identifyer": 5705, "year": "2021"}, {"Unnamed: 0": 395845, "autor": "SrMi", "date": 1618424100000, "content": "On 6/3/2020 at 9:58 AM, evikne said: Yes, but that's not the same list. The missing list was much nicer. It is a pity that it's gone. Web Archive has saved a copy from 2015: https://web.archive.org/web/20151021103330/www.l-camera-forum.com/page/leica_objektiv.html/_/leica-m-objektive/", "link": "https://www.l-camera-forum.com/topic/250139-current-leica-m-lenses-full-list/page/3/?tab=comments#comment-4181356", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "on 6/3/2020 at 9:58 am, evikne said: yes, but that's not the same list. the missing list was much nicer. it is a pity that it's gone. web -----> archive !!!  has saved a copy from 2015: https://web.archive.org/web/20151021103330/www.l-camera-forum.com/page/leica_objektiv.html/_/leica-m-objektive/", "sortedWord": "None", "identifyer": 8321, "year": "2021"}, {"Unnamed: 0": 404659, "autor": "wlaidlaw", "date": 1611937740000, "content": "I don't think from a quick look that Eventbrite has an archive. All the events listed for Leica are future events and the search only goes from today forwards. Also it does not seem that Leica are hosting a copy on their website either. Wilson Edited January 29 by wlaidlaw", "link": "https://www.l-camera-forum.com/topic/317411-review-leica-noctilux-50mm-f12/page/4/?tab=comments#comment-4128256", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "i don't think from a quick look that eventbrite has an -----> archive !!! . all the events listed for leica are future events and the search only goes from today forwards. also it does not seem that leica are hosting a copy on their website either. wilson edited january 29 by wlaidlaw", "sortedWord": "None", "identifyer": 17421, "year": "2021"}, {"Unnamed: 0": 420574, "autor": "LocalHero1953", "date": 1628625120000, "content": "It depends what you call colour science......... I owned the SL since launch, the SL2 for 2-3 months last autumn, then swapped it for the SL2-S. Broadly I agree they are all clearly of the same family in terms of colour rendition in normal lighting. In mid to low lighting and high ISO I find the difference from SL to SL2-S like chalk and cheese. At the same high ISO, the SL2-S will have much more realistic colour, of greater depth and saturation, and both less noise and more pleasing noise. This is a shot from rehearsals of a play last night, taken indoors under fluorescent lighting, with the 90-280 zoom at 280mm. ISO 12500, f/4 1/500s. Auto White Balance in camera, slight adjustment to Red and Orange hue sliders in Lightroom, Noise Reduction 30, Color Noise Reduction 20. To give me the 'look' I was after, Saturation -15, Clarity -15. I am certain I could never have got anywhere near this degree of naturalness at ISO 12500 with the SL2. I would have to lose skin texture to denoising, and even then I would have struggled to get a natural skin colour. I have some shots at 25000 which show more grain, but mainly because I set the same Noise Reduction across all shots. --img--  And for comparison, the same pose an hour earlier taken under very bright flat flash lighting at ISO 100, 24-90 zoom at 90, f/11. I'm sorry I don't have anything so comparable from the SL at close hand. If this becomes an issue, I'll look back through the archive. --img--  Edited August 10 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/323427-ill-buy-the-sl2-s-if/?tab=comments#comment-4254745", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "it depends what you call colour science......... i owned the sl since launch, the sl2 for 2-3 months last autumn, then swapped it for the sl2-s. broadly i agree they are all clearly of the same family in terms of colour rendition in normal lighting. in mid to low lighting and high iso i find the difference from sl to sl2-s like chalk and cheese. at the same high iso, the sl2-s will have much more realistic colour, of greater depth and saturation, and both less noise and more pleasing noise. this is a shot from rehearsals of a play last night, taken indoors under fluorescent lighting, with the 90-280 zoom at 280mm. iso 12500, f/4 1/500s. auto white balance in camera, slight adjustment to red and orange hue sliders in lightroom, noise reduction 30, color noise reduction 20. to give me the 'look' i was after, saturation -15, clarity -15. i am certain i could never have got anywhere near this degree of naturalness at iso 12500 with the sl2. i would have to lose skin texture to denoising, and even then i would have struggled to get a natural skin colour. i have some shots at 25000 which show more grain, but mainly because i set the same noise reduction across all shots. --img--  and for comparison, the same pose an hour earlier taken under very bright flat flash lighting at iso 100, 24-90 zoom at 90, f/11. i'm sorry i don't have anything so comparable from the sl at close hand. if this becomes an issue, i'll look back through the -----> archive !!! . --img--  edited august 10 by localhero1953", "sortedWord": "None", "identifyer": 33592, "year": "2021"}, {"Unnamed: 0": 422446, "autor": "BernardC", "date": 1624103880000, "content": "On 6/15/2021 at 1:19 PM, PCPix said: On the M10 the file numbering only creates a new folder every 10 000 images. The SL2 does it every 1000 images. Is there any way to change the SL2's behaviour to match the M10? There are enough digits in the filenames to allow this. I am surprised that the M10 lets you save 10,000 images in the same folder. The reason why camera makers limit their folders to 1,000 images (or some other number) is that many computers slow-down to a crawl when they encounter folders with too many entries. That's especially true when those folders are on memory cards, since they don't use more advanced Unix-like file systems. This is mostly transparent to end-users, unless you archive images on memory cards. The folder structure is reorganized in your computer's file system (depending what system you use to ingest images). I do agree about the inconvenience of repeating file names, but in practice it never happens on the same day/job, so there's very little risk of confusion.", "link": "https://www.l-camera-forum.com/topic/321862-new-folder-created-every-1000-images/?tab=comments#comment-4222769", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "on 6/15/2021 at 1:19 pm, pcpix said: on the m10 the file numbering only creates a new folder every 10 000 images. the sl2 does it every 1000 images. is there any way to change the sl2's behaviour to match the m10? there are enough digits in the filenames to allow this. i am surprised that the m10 lets you save 10,000 images in the same folder. the reason why camera makers limit their folders to 1,000 images (or some other number) is that many computers slow-down to a crawl when they encounter folders with too many entries. that's especially true when those folders are on memory cards, since they don't use more advanced unix-like file systems. this is mostly transparent to end-users, unless you -----> archive !!!  images on memory cards. the folder structure is reorganized in your computer's file system (depending what system you use to ingest images). i do agree about the inconvenience of repeating file names, but in practice it never happens on the same day/job, so there's very little risk of confusion.", "sortedWord": "None", "identifyer": 35487, "year": "2021"}, {"Unnamed: 0": 427359, "autor": "ramarren", "date": 1628691660000, "content": "13 hours ago, AdamMark said: Hello everyone, I wish to create a photobook using the CL. Photobooks generally only allow the insertion of JPEG files. Since the DNGs are , at least in my opinion , far superior I would regrettably have to convert the DNGs into JPEGS. Will converting the DNG’s to JPEGS result in loss of image quality on the final print ? Thanks. Adam As others have said, raw files are always converted ... better word: rendered ... to JPEG or TIFF for printing in any form. How are you editing and viewing your CL photographs at present? If you're using Lightroom, either CC or Classic, and viewing them directly on screen, you may not realize it but LR is converting the raw/DNG files to a viewable RGB format for you on the fly. It has to do this in order to display them. When you Export your finished, edited work from LR, it is always output as some RGB format ... PSD, TIFF, or JPEG ... unless you specifically tell it to output a file to DNG or 'original' formats for archive/storage purposes. Thus, there is no \"loss of quality\" when you convert DNG files to JPEG or other export format ... The goal of editing your photos in LR or any other image processing app is to render the DNG raw files into the suitable form and look that you want for display or sharing, or printing, or inclusion into other works for printing and distribution. You edit (render) the DNG files to look the way they ought to look for whatever the display or distribution format is needed. If you want to make a photo book using the Blurb.com \"print on demand\" services, there is in fact a standard module in LR for that which will allow you to edit and complete your book layout using your DNG files just as you have them in Lightroom. When you have finished editing your photos, then laying out your book, and tell LR to send it to Blurb for printing, LR renders the book into a suitable RGB format for printing directly and sends that to Blurb. (You can also use Blurb's own dedicated book making software, at which point the workflow is to lay out the book using JPEG files output to the appropriate dimensions and spec from Lightroom or other image processing app.) G", "link": "https://www.l-camera-forum.com/topic/323479-cl-converting-dngs-to-jpegs-for-print/?tab=comments#comment-4255131", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "13 hours ago, adammark said: hello everyone, i wish to create a photobook using the cl. photobooks generally only allow the insertion of jpeg files. since the dngs are , at least in my opinion , far superior i would regrettably have to convert the dngs into jpegs. will converting the dng’s to jpegs result in loss of image quality on the final print ? thanks. adam as others have said, raw files are always converted ... better word: rendered ... to jpeg or tiff for printing in any form. how are you editing and viewing your cl photographs at present? if you're using lightroom, either cc or classic, and viewing them directly on screen, you may not realize it but lr is converting the raw/dng files to a viewable rgb format for you on the fly. it has to do this in order to display them. when you export your finished, edited work from lr, it is always output as some rgb format ... psd, tiff, or jpeg ... unless you specifically tell it to output a file to dng or 'original' formats for -----> archive !!! /storage purposes. thus, there is no \"loss of quality\" when you convert dng files to jpeg or other export format ... the goal of editing your photos in lr or any other image processing app is to render the dng raw files into the suitable form and look that you want for display or sharing, or printing, or inclusion into other works for printing and distribution. you edit (render) the dng files to look the way they ought to look for whatever the display or distribution format is needed. if you want to make a photo book using the blurb.com \"print on demand\" services, there is in fact a standard module in lr for that which will allow you to edit and complete your book layout using your dng files just as you have them in lightroom. when you have finished editing your photos, then laying out your book, and tell lr to send it to blurb for printing, lr renders the book into a suitable rgb format for printing directly and sends that to blurb. (you can also use blurb's own dedicated book making software, at which point the workflow is to lay out the book using jpeg files output to the appropriate dimensions and spec from lightroom or other image processing app.) g", "sortedWord": "None", "identifyer": 40468, "year": "2021"}, {"Unnamed: 0": 444834, "autor": "PhotoCruiser", "date": 1618768860000, "content": "Would you not archive the same or better effect doing same thing in your raw editing program? Chris", "link": "https://www.l-camera-forum.com/topic/320007-hoya-r1-filter-on-leica-q2-m/?tab=comments#comment-4183960", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "would you not -----> archive !!!  the same or better effect doing same thing in your raw editing program? chris", "sortedWord": "None", "identifyer": 8234, "year": "2021"}, {"Unnamed: 0": 444835, "autor": "AlexKirk", "date": 1618770960000, "content": "33 minutes ago, PhotoCruiser said: Would you not archive the same or better effect doing same thing in your raw editing program? Chris Nope... Look at the closest car toning (with and without IR-flter)", "link": "https://www.l-camera-forum.com/topic/320007-hoya-r1-filter-on-leica-q2-m/?tab=comments#comment-4183984", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "33 minutes ago, photocruiser said: would you not -----> archive !!!  the same or better effect doing same thing in your raw editing program? chris nope... look at the closest car toning (with and without ir-flter)", "sortedWord": "None", "identifyer": 8235, "year": "2021"}, {"Unnamed: 0": 444837, "autor": "RoySmith", "date": 1618831860000, "content": "17 hours ago, PhotoCruiser said: Would you not archive the same or better effect doing same thing in your raw editing program? Chris The raw file from a monochrome camera has no colour data so one cannot simulate the use of a coloured filter to filter out red. Anything you do affects all the pixels. It’s make sense to use colour filters with a monochrome camera.", "link": "https://www.l-camera-forum.com/topic/320007-hoya-r1-filter-on-leica-q2-m/?tab=comments#comment-4184402", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "17 hours ago, photocruiser said: would you not -----> archive !!!  the same or better effect doing same thing in your raw editing program? chris the raw file from a monochrome camera has no colour data so one cannot simulate the use of a coloured filter to filter out red. anything you do affects all the pixels. it’s make sense to use colour filters with a monochrome camera.", "sortedWord": "None", "identifyer": 8237, "year": "2021"}, {"Unnamed: 0": 444838, "autor": "PhotoCruiser", "date": 1618848300000, "content": "vor 10 Stunden schrieb Leica28: Now I’m confused. You mention using the Hoya R1 filter in the photo, which is a standard red color. In your reply you mention using an IR filter, which I’m assuming is an infrared. So which is it? My thoughts. However thanks for the explanation, I shot a lot in B/W in my analog times where filters where necessary to archive certain effects and i thought that nowadays we would be able to reproduce the effects on digital cameras but it seems that I was wrong. Chris", "link": "https://www.l-camera-forum.com/topic/320007-hoya-r1-filter-on-leica-q2-m/?tab=comments#comment-4184584", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "vor 10 stunden schrieb leica28: now i’m confused. you mention using the hoya r1 filter in the photo, which is a standard red color. in your reply you mention using an ir filter, which i’m assuming is an infrared. so which is it? my thoughts. however thanks for the explanation, i shot a lot in b/w in my analog times where filters where necessary to -----> archive !!!  certain effects and i thought that nowadays we would be able to reproduce the effects on digital cameras but it seems that i was wrong. chris", "sortedWord": "None", "identifyer": 8238, "year": "2021"}, {"Unnamed: 0": 445012, "autor": "Cheesehead", "date": 1618115880000, "content": "On 4/9/2021 at 8:24 AM, Leica Guy said: Have you tried to download a large number of images, say 500 or a 1000 for instance, using wifi? Does the battery support transferring that many images? How long does it take? Do you carry several extra batteries? I find the idea of using Wifi for image transfer to be completely unworkable. My experience especially traveling is I shoot all day. Grab dinner and download images. Backup to an SSD drive. Charge batteries and swap out the SD card so I have two copies. One SD and one SSD. Keep the two copies in different places so if one is lost or stolen I’m not out all my photos. I’ve done multiple month long trips and this system works for me. I often do not have internet or certainly not fast internet access. Because of that I do not rely on cloud backup. You’ll figure out the best solution for you. I just suggest running some experiments to ensure you fully understand the limitations, advantages and disadvantages of your idea versus other methods. If you’ve already done that, Leica ON!! You mention that while traveling you transfer from SD card to SSD. I have tried that method but have not found a satisfactory way to transfer to SSD without also bringing a computer. In the end I usually just have my single copy on an SD until I get home and can move to my hard drive. Every month I also back up from my hard drive to a second physical drive that is not generally attached to the computer, as well as a cloud backup. Some have mentioned the problem with changes in technology. Some of you, like me, once saved computer files to cassette tapes and recorded the tape counter position to have easier access. Every 3-5 years when my computer gets updated, I also copy my entire archive onto whatever the new format is. Generally a new computer will be access data from a singe generation of formats ago, but it becomes hit and miss trying to read anything older than that. I now need external devices to see what is on my CDs. Floppy disks would require major resources and punch cards (which will last 100+ years in a cool dry room) pretty much need to go to the recycler.", "link": "https://www.l-camera-forum.com/topic/319682-whats-the-largest-sd-card-the-q2-can-take/?tab=comments#comment-4178822", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "on 4/9/2021 at 8:24 am, leica guy said: have you tried to download a large number of images, say 500 or a 1000 for instance, using wifi? does the battery support transferring that many images? how long does it take? do you carry several extra batteries? i find the idea of using wifi for image transfer to be completely unworkable. my experience especially traveling is i shoot all day. grab dinner and download images. backup to an ssd drive. charge batteries and swap out the sd card so i have two copies. one sd and one ssd. keep the two copies in different places so if one is lost or stolen i’m not out all my photos. i’ve done multiple month long trips and this system works for me. i often do not have internet or certainly not fast internet access. because of that i do not rely on cloud backup. you’ll figure out the best solution for you. i just suggest running some experiments to ensure you fully understand the limitations, advantages and disadvantages of your idea versus other methods. if you’ve already done that, leica on!! you mention that while traveling you transfer from sd card to ssd. i have tried that method but have not found a satisfactory way to transfer to ssd without also bringing a computer. in the end i usually just have my single copy on an sd until i get home and can move to my hard drive. every month i also back up from my hard drive to a second physical drive that is not generally attached to the computer, as well as a cloud backup. some have mentioned the problem with changes in technology. some of you, like me, once saved computer files to cassette tapes and recorded the tape counter position to have easier access. every 3-5 years when my computer gets updated, i also copy my entire -----> archive !!!  onto whatever the new format is. generally a new computer will be access data from a singe generation of formats ago, but it becomes hit and miss trying to read anything older than that. i now need external devices to see what is on my cds. floppy disks would require major resources and punch cards (which will last 100+ years in a cool dry room) pretty much need to go to the recycler.", "sortedWord": "None", "identifyer": 8412, "year": "2021"}, {"Unnamed: 0": 445013, "autor": "Leica Guy", "date": 1618149240000, "content": " 9 hours ago, Cheesehead said: You mention that while traveling you transfer from SD card to SSD. I have tried that method but have not found a satisfactory way to transfer to SSD without also bringing a computer. In the end I usually just have my single copy on an SD until I get home and can move to my hard drive. Every month I also back up from my hard drive to a second physical drive that is not generally attached to the computer, as well as a cloud backup. Some have mentioned the problem with changes in technology. Some of you, like me, once saved computer files to cassette tapes and recorded the tape counter position to have easier access. Every 3-5 years when my computer gets updated, I also copy my entire archive onto whatever the new format is. Generally a new computer will be access data from a singe generation of formats ago, but it becomes hit and miss trying to read anything older than that. I now need external devices to see what is on my CDs. Floppy disks would require major resources and punch cards (which will last 100+ years in a cool dry room) pretty much need to go to the recycler. I should have mentioned I do take along a laptop that runs Lightroom. I use that to import photos and I use an external SSD as the location of the catalog and photos. There are obvious advantages and disadvantages to bringing a laptop. I use a MacBook Air so it’s not overly big or heavy. At one time I owned a dedicated device that I could plug in an SD card and It would copy to its own internal drive. I finally gave up on that. Fairly expensive and the internal drive was not SSD. I’ve not looked recently at what’s available.", "link": "https://www.l-camera-forum.com/topic/319682-whats-the-largest-sd-card-the-q2-can-take/page/2/?tab=comments#comment-4179099", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": " 9 hours ago, cheesehead said: you mention that while traveling you transfer from sd card to ssd. i have tried that method but have not found a satisfactory way to transfer to ssd without also bringing a computer. in the end i usually just have my single copy on an sd until i get home and can move to my hard drive. every month i also back up from my hard drive to a second physical drive that is not generally attached to the computer, as well as a cloud backup. some have mentioned the problem with changes in technology. some of you, like me, once saved computer files to cassette tapes and recorded the tape counter position to have easier access. every 3-5 years when my computer gets updated, i also copy my entire -----> archive !!!  onto whatever the new format is. generally a new computer will be access data from a singe generation of formats ago, but it becomes hit and miss trying to read anything older than that. i now need external devices to see what is on my cds. floppy disks would require major resources and punch cards (which will last 100+ years in a cool dry room) pretty much need to go to the recycler. i should have mentioned i do take along a laptop that runs lightroom. i use that to import photos and i use an external ssd as the location of the catalog and photos. there are obvious advantages and disadvantages to bringing a laptop. i use a macbook air so it’s not overly big or heavy. at one time i owned a dedicated device that i could plug in an sd card and it would copy to its own internal drive. i finally gave up on that. fairly expensive and the internal drive was not ssd. i’ve not looked recently at what’s available.", "sortedWord": "None", "identifyer": 8413, "year": "2021"}, {"Unnamed: 0": 445014, "autor": "iRandom", "date": 1618157400000, "content": "I haven't taken a vacation longer than week in quite some time. If I did, I think I'd probably go with a combination of multiple SDs and maybe one of the backup drives that have an SD reader in order to have a second copy. I prefer not to travel with a laptop since I don't like to leave anything valuable in the hotel room and I've never been the iPad type. I've given up on longterm offline storage since nothing is future-proofed. Longterm HW compatibly aside, it seems like most of the media requires it to be plugged in every so often to refresh or some just degrades over time. Since storage capacity continues to increase I've decided to just keep everything live. My primary library lives on my laptop and is mirrored in the cloud for access on all my devices. My laptop is backed up to a fire-hardened locally connected HDD and also has online backup. I used to also have a bootable backup, but the latest MacOS has made that tricky. My photos (library, digital negatives & archive) are additionally mirrored to a little RAID drive. I've been lucky in that all the photo software I use is able to read the RAW format for any digital camera I've ever used (that is commendable of the SW companies) and that JPEG doesn't look like it is going anywhere anytime soon. If I ever need to change the format I can easily do a bulk conversion since everything is stored locally.", "link": "https://www.l-camera-forum.com/topic/319682-whats-the-largest-sd-card-the-q2-can-take/page/2/?tab=comments#comment-4179216", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "i haven't taken a vacation longer than week in quite some time. if i did, i think i'd probably go with a combination of multiple sds and maybe one of the backup drives that have an sd reader in order to have a second copy. i prefer not to travel with a laptop since i don't like to leave anything valuable in the hotel room and i've never been the ipad type. i've given up on longterm offline storage since nothing is future-proofed. longterm hw compatibly aside, it seems like most of the media requires it to be plugged in every so often to refresh or some just degrades over time. since storage capacity continues to increase i've decided to just keep everything live. my primary library lives on my laptop and is mirrored in the cloud for access on all my devices. my laptop is backed up to a fire-hardened locally connected hdd and also has online backup. i used to also have a bootable backup, but the latest macos has made that tricky. my photos (library, digital negatives & -----> archive !!! ) are additionally mirrored to a little raid drive. i've been lucky in that all the photo software i use is able to read the raw format for any digital camera i've ever used (that is commendable of the sw companies) and that jpeg doesn't look like it is going anywhere anytime soon. if i ever need to change the format i can easily do a bulk conversion since everything is stored locally.", "sortedWord": "None", "identifyer": 8414, "year": "2021"}], "name": "archiveL-Forum2021"}