{"interestingcomments": [{"Unnamed: 0": 363933, "autor": "dkmoore", "date": 1602456240000, "content": "I don't have a way to send you a raw file but the attached are: 1. OOC RAW - saved to Jpeg with no edits to post here --> The files come out of the camera very flat and grey (blank canvas) 2. RAW file over edited for emphasis of how much can be done in post *excuse the crap image but I didn't feel like digging through the archive --img-- ", "link": "https://www.l-camera-forum.com/topic/314133-leica-monochrom-ccd-raw-files-2nd-generation-sensor/?tab=comments#comment-4061295", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "i don't have a way to send you a raw file but the attached are: 1. ooc raw - saved to jpeg with no edits to post here --> the files come out of the camera very flat and grey (blank canvas) 2. raw file over edited for emphasis of how much can be done in post *excuse the crap image but i didn't feel like digging through the -----> archive !!!  --img-- ", "sortedWord": "None", "identifyer": 25186, "year": "2020"}, {"Unnamed: 0": 366711, "autor": "Likaleica", "date": 1579794660000, "content": "4 hours ago, paulmac said: Look at it like this:- Would Larry Burrows Vietnam pictures or Sebastiao Salgado's \"Workers\" have the same effect if they looked like they had been shot in perfectly grain free and studio like conditions. Totally hear what you're saying, Paul. I know the magic you're talking about. But since you asked, here is how Salgado handles it now: http://povmagazine.com/articles/view/the-pov-interview-sebastiaeo-salgado \"POV: When did you switch to digital? Salgado: Very recently, in 2008. After what happened in New York in 2001, airport security started to change, and in a month it became hell. I remember once, after working in Guatemala, I lost 52 rolls of film because of the X-rays at the airport. So I changed to digital, but I don’t know how to edit on a computer. So what happened was that I had my assistants produce a contact sheet for me. I edit with a loupe like I always did, and when I edit they produce a work print like I always did, and when I make my final selection, we produce a negative from the digital archive in a quality that is better than when I photographed directly with a negative camera. From this archive, we introduce the grain from the Tri-X film that I worked with my whole life, and they produce for me a 4×5-inch negative, then we go to the enlarger and we print again.\" POV: And now you print it out, it will still be silver nitrate, if you want it to be silver nitrate…\" Salgado: Yeah. We print from an enlarger, with the grain of the film I’ve used all of my life, and I don’t lose any grain. Digital is flat, and when I put the Tri-X grain in, I have my life there, the texture that I have always worked with.\"", "link": "https://www.l-camera-forum.com/topic/305530-your-opinion-about-the-leica-m10-monochrom/page/6/?tab=comments#comment-3897739", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "4 hours ago, paulmac said: look at it like this:- would larry burrows vietnam pictures or sebastiao salgado's \"workers\" have the same effect if they looked like they had been shot in perfectly grain free and studio like conditions. totally hear what you're saying, paul. i know the magic you're talking about. but since you asked, here is how salgado handles it now: http://povmagazine.com/articles/view/the-pov-interview-sebastiaeo-salgado \"pov: when did you switch to digital? salgado: very recently, in 2008. after what happened in new york in 2001, airport security started to change, and in a month it became hell. i remember once, after working in guatemala, i lost 52 rolls of film because of the x-rays at the airport. so i changed to digital, but i don’t know how to edit on a computer. so what happened was that i had my assistants produce a contact sheet for me. i edit with a loupe like i always did, and when i edit they produce a work print like i always did, and when i make my final selection, we produce a negative from the digital -----> archive !!!  in a quality that is better than when i photographed directly with a negative camera. from this archive, we introduce the grain from the tri-x film that i worked with my whole life, and they produce for me a 4×5-inch negative, then we go to the enlarger and we print again.\" pov: and now you print it out, it will still be silver nitrate, if you want it to be silver nitrate…\" salgado: yeah. we print from an enlarger, with the grain of the film i’ve used all of my life, and i don’t lose any grain. digital is flat, and when i put the tri-x grain in, i have my life there, the texture that i have always worked with.\"", "sortedWord": "None", "identifyer": 27982, "year": "2020"}, {"Unnamed: 0": 372634, "autor": "tom.w.bn", "date": 1590869280000, "content": "Just for fun I looked through my archive of M9 and M240 images, searching for mainly green images. There are some images where I thought that I found a typicel M9 example. I couldn't clearly guess the camera for the majority of images though. There are probably people out there who can. At least there were some threads back in the days were people complaint about the colour of M240 compared to M9.", "link": "https://www.l-camera-forum.com/topic/310083-m9-kodachrome-examples-anyone/page/2/?tab=comments#comment-3983485", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "just for fun i looked through my -----> archive !!!  of m9 and m240 images, searching for mainly green images. there are some images where i thought that i found a typicel m9 example. i couldn't clearly guess the camera for the majority of images though. there are probably people out there who can. at least there were some threads back in the days were people complaint about the colour of m240 compared to m9.", "sortedWord": "None", "identifyer": 33938, "year": "2020"}, {"Unnamed: 0": 372636, "autor": "oliviersm", "date": 1590871080000, "content": "13 minutes ago, tom.w.bn said: Just for fun I looked through my archive of M9 and M240 images, searching for mainly green images. There are some images where I thought that I found a typicel M9 example. I couldn't clearly guess the camera for the majority of images though. There are probably people out there who can. At least there were some threads back in the days were people complaint about the colour of M240 compared to M9. Yes, I've seen a few of those also. I don't think I would be able to spot on the majority of photos. The only times I would is if I edit a portrait (dng) adjust white balance to slightly cooler (generally 18%grey) and then increase the contrast +20 in lightroom. The magenta response in the lips of most persons is very strong. As a photographer who was shooting almost exclusively portraits at the time, it was so noticeable and it sort of threw me off in my workflow. Now (4+ years later), I've come to embrace the colour response of the M9 and as I was waiting for the Leica store to open to go and purchase my M10-P, I spent a lot of time shooting with my M9 again, in a sense to re-explore the camera. It's part of the reason this thread started. It was only a few weeks ago (after owning the camera for 4 years) that I started reading about kodachrome and the M9's relationship to the film. In the end though, what still remains true to me is, digital is digital and analog is analog and they both have a very strong place in my photography.", "link": "https://www.l-camera-forum.com/topic/310083-m9-kodachrome-examples-anyone/page/2/?tab=comments#comment-3983499", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "13 minutes ago, tom.w.bn said: just for fun i looked through my -----> archive !!!  of m9 and m240 images, searching for mainly green images. there are some images where i thought that i found a typicel m9 example. i couldn't clearly guess the camera for the majority of images though. there are probably people out there who can. at least there were some threads back in the days were people complaint about the colour of m240 compared to m9. yes, i've seen a few of those also. i don't think i would be able to spot on the majority of photos. the only times i would is if i edit a portrait (dng) adjust white balance to slightly cooler (generally 18%grey) and then increase the contrast +20 in lightroom. the magenta response in the lips of most persons is very strong. as a photographer who was shooting almost exclusively portraits at the time, it was so noticeable and it sort of threw me off in my workflow. now (4+ years later), i've come to embrace the colour response of the m9 and as i was waiting for the leica store to open to go and purchase my m10-p, i spent a lot of time shooting with my m9 again, in a sense to re-explore the camera. it's part of the reason this thread started. it was only a few weeks ago (after owning the camera for 4 years) that i started reading about kodachrome and the m9's relationship to the film. in the end though, what still remains true to me is, digital is digital and analog is analog and they both have a very strong place in my photography.", "sortedWord": "None", "identifyer": 33940, "year": "2020"}, {"Unnamed: 0": 380262, "autor": "B_K_", "date": 1603751580000, "content": " 4 minutes ago, tom.w.bn said: The website is available on archive.org. Found the help page with the paramters. use it as a command line tool and the first command in the examples section should do the job. https://web.archive.org/web/20190819224647/http://m8raw2dng.de/help/tool-parameters/ Oh wow, that's perfect.. thanks so much!! Ignorant me wasn't even aware of the web archive, brilliant! 🙏🍻", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/8/?tab=comments#comment-4068920", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": " 4 minutes ago, tom.w.bn said: the website is available on archive.org. found the help page with the paramters. use it as a command line tool and the first command in the examples section should do the job. https://web.archive.org/web/20190819224647/http://m8raw2dng.de/help/tool-parameters/ oh wow, that's perfect.. thanks so much!! ignorant me wasn't even aware of the web -----> archive !!! , brilliant! 🙏🍻", "sortedWord": "None", "identifyer": 41650, "year": "2020"}, {"Unnamed: 0": 428800, "autor": "gteague", "date": 1597953060000, "content": "1 hour ago, Louis said: Still the same issue of the frame number continuation ! I tried to catch up with my files, but I went too high!... Now, I am wondering if I can go back in numbers! lol Not very fond of the new menu, though!.... what's the deal with renumbering? does this mean that the first image i take now will be 001? how do i run it back up to where it was as this will play holy heck with my archive schema for offloading card images. tks, /guy", "link": "https://www.l-camera-forum.com/topic/312494-firmware-version-4-available-for-cl/?tab=comments#comment-4030395", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "1 hour ago, louis said: still the same issue of the frame number continuation ! i tried to catch up with my files, but i went too high!... now, i am wondering if i can go back in numbers! lol not very fond of the new menu, though!.... what's the deal with renumbering? does this mean that the first image i take now will be 001? how do i run it back up to where it was as this will play holy heck with my -----> archive !!!  schema for offloading card images. tks, /guy", "sortedWord": "None", "identifyer": 41914, "year": "2020"}, {"Unnamed: 0": 428802, "autor": "Louis", "date": 1597960200000, "content": "1 hour ago, gteague said: what's the deal with renumbering? does this mean that the first image i take now will be 001? how do i run it back up to where it was as this will play holy heck with my archive schema for offloading card images. tks, /guy This is a serious issue, at least for me. Every time you update the FW, numbering of the frames starts from “1”. I prefer the continuation for the filing. Therefore, you have to change the numbering by hand. This time, I went a little too high and screw up the right continuation, and can’t go back to correct.! 🧐🤔😖", "link": "https://www.l-camera-forum.com/topic/312494-firmware-version-4-available-for-cl/?tab=comments#comment-4030449", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "1 hour ago, gteague said: what's the deal with renumbering? does this mean that the first image i take now will be 001? how do i run it back up to where it was as this will play holy heck with my -----> archive !!!  schema for offloading card images. tks, /guy this is a serious issue, at least for me. every time you update the fw, numbering of the frames starts from “1”. i prefer the continuation for the filing. therefore, you have to change the numbering by hand. this time, i went a little too high and screw up the right continuation, and can’t go back to correct.! 🧐🤔😖", "sortedWord": "None", "identifyer": 41916, "year": "2020"}], "name": "archiveL-Forum2020"}