{"interestingcomments": [{"Unnamed: 0": 345487, "autor": "budjames", "date": 1558008720000, "content": "I occasionally use my Visoflex on my two M10s without any issues. It works very well once you get used to the necessary live view decreasing your battery life. I use the Visoflex with my Super Elmar 18 and Summicron 90 lenses. The geotagging is cool too. Regards, Bud James Please check out my fine art and travel photography at www.budjames.photography or on Instagram at www.instagram.com/budjamesphoto.", "link": "https://www.l-camera-forum.com/topic/297307-visoflex-issues-with-leica-m10/?tab=comments#comment-3741827", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "i occasionally use my visoflex on my two m10s without any issues. it works very well once you get used to the necessary live view decreasing your battery life. i use the visoflex with my super elmar 18 and summicron 90 lenses. the -----> geotagging !!!  is cool too. regards, bud james please check out my fine art and travel photography at www.budjames.photography or on instagram at www.instagram.com/budjamesphoto.", "sortedWord": "None", "identifyer": 6576, "year": "2019"}, {"Unnamed: 0": 416621, "autor": "nicci78", "date": 1574625600000, "content": "If it’s just like the geotagging of Q2. Forget it, consider the SL2 a GPSless camera. Hence its lower price compare to SL. 😅", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/?tab=comments#comment-3861280", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "if it’s just like the -----> geotagging !!!  of q2. forget it, consider the sl2 a gpsless camera. hence its lower price compare to sl. 😅", "sortedWord": "None", "identifyer": 29622, "year": "2019"}, {"Unnamed: 0": 416629, "autor": "SrMi", "date": 1574666640000, "content": "Apart from the integrated GPS, the second best and reliable method of geotagging is to have the phone collect location data and then merge that data with the images, e.g., in Lightroom. Just have to make sure that the clock in the camera is synchronized with the phone. It is too bad that SL2 lost the integrated GPS.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/?tab=comments#comment-3861551", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "apart from the integrated gps, the second best and reliable method of -----> geotagging !!!  is to have the phone collect location data and then merge that data with the images, e.g., in lightroom. just have to make sure that the clock in the camera is synchronized with the phone. it is too bad that sl2 lost the integrated gps.", "sortedWord": "None", "identifyer": 29630, "year": "2019"}, {"Unnamed: 0": 416630, "autor": "scott kirkpatrick", "date": 1574667120000, "content": "4 minutes ago, SrMi said: Apart from the integrated GPS, the second best and reliable method of geotagging is to have the phone collect location data and then merge that data with the images, e.g., in Lightroom. Just have to make sure that the clock in the camera is synchronized with the phone. Can lightroom geotag with input from a good hikers' GPS, like the Garmin 60? There is no question about those working in the Far North or other outbacks.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/?tab=comments#comment-3861553", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "4 minutes ago, srmi said: apart from the integrated gps, the second best and reliable method of -----> geotagging !!!  is to have the phone collect location data and then merge that data with the images, e.g., in lightroom. just have to make sure that the clock in the camera is synchronized with the phone. can lightroom geotag with input from a good hikers' gps, like the garmin 60? there is no question about those working in the far north or other outbacks.", "sortedWord": "None", "identifyer": 29631, "year": "2019"}, {"Unnamed: 0": 416631, "autor": "hotshew", "date": 1574667240000, "content": "Quote Apart from the integrated GPS, the second best and reliable method of geotagging is to have the phone collect location data and then merge that data with the images, e.g., in Lightroom. I have a BadElf GPS PRO+ tracker that I use instead, but basically the same idea.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/?tab=comments#comment-3861554", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "quote apart from the integrated gps, the second best and reliable method of -----> geotagging !!!  is to have the phone collect location data and then merge that data with the images, e.g., in lightroom. i have a badelf gps pro+ tracker that i use instead, but basically the same idea.", "sortedWord": "None", "identifyer": 29632, "year": "2019"}, {"Unnamed: 0": 452442, "autor": "drgek", "date": 1549995240000, "content": "21 hours ago, Sang said: I updated new version of POTOS and tried to connect my camera by bluetooth. In the iPhone, POTOS found the camera and I push the \"connect\" button. However, it said \"connecting Wifi\" and then \"connection failed.\" It worked by Wifi from the previous POTOS. Now both connections are not working. Can I go back to the earlier version of POTOS? While the phone is attempting to establish a connection, navigate back to the Fotos app from the settings window. This worked for me. As mentioned above, don't waste your time with Geotagging because it still doesn't work.", "link": "https://www.l-camera-forum.com/topic/291847-d-lux-7-bluetooth-connection/?tab=comments#comment-3683135", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "21 hours ago, sang said: i updated new version of potos and tried to connect my camera by bluetooth. in the iphone, potos found the camera and i push the \"connect\" button. however, it said \"connecting wifi\" and then \"connection failed.\" it worked by wifi from the previous potos. now both connections are not working. can i go back to the earlier version of potos? while the phone is attempting to establish a connection, navigate back to the fotos app from the settings window. this worked for me. as mentioned above, don't waste your time with -----> geotagging !!!  because it still doesn't work.", "sortedWord": "None", "identifyer": 16044, "year": "2019"}, {"Unnamed: 0": 452445, "autor": "Sangsara", "date": 1554610380000, "content": "Bluetooth for file transfers would be much slower than WiFi, I think. Lately I’ve noticed a Bluetooth + GPS logo appearing on the display while shooting, which suggests geotagging is now working via my connected iPhone.", "link": "https://www.l-camera-forum.com/topic/291847-d-lux-7-bluetooth-connection/?tab=comments#comment-3717315", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "bluetooth for file transfers would be much slower than wifi, i think. lately i’ve noticed a bluetooth + gps logo appearing on the display while shooting, which suggests -----> geotagging !!!  is now working via my connected iphone.", "sortedWord": "None", "identifyer": 16047, "year": "2019"}, {"Unnamed: 0": 452447, "autor": "HPNAviator", "date": 1554689340000, "content": "I updated the Fotos app in my iPhone to the latest release today however the Geotagging function appears still not to work. When the GPS indicator in the viewfinder is translucent then Geotagging is not functioning.", "link": "https://www.l-camera-forum.com/topic/291847-d-lux-7-bluetooth-connection/?tab=comments#comment-3717914", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "i updated the fotos app in my iphone to the latest release today however the -----> geotagging !!!  function appears still not to work. when the gps indicator in the viewfinder is translucent then geotagging is not functioning.", "sortedWord": "None", "identifyer": 16049, "year": "2019"}], "name": "geotaggingL-Forum2019"}