{"interestingcomments": [{"Unnamed: 0": 205701, "autor": "waterlenz", "date": 1485142920000, "content": "Sure there is a standard, many of them — first you need a continuous spectrum light source: 3200 degree Kelvin tungsten, daylight, or HMI lights. Just not LEDs or fluorescent lights. Sensors are designed for them. By standard I meant something numerical and repeatable. Tungsten 3200 works but how many have their studios set up this way? As well I am not sure if the light frequency distribution among tungsten bulbs is the same. Daylight is variable in its degrees K within a day (think just before sunset) as well as location. Fluoro has the problems mentioned above - also there are various types of bulbs. There is a 5000K bulb that is not too bad - I have used these look at trannys on a light table. Even strobes have variable light color temps. They may have a specified color temp in K but the K value may vary with flash output level. There are ways to have a controllable light source. For example, I have several microscopes that take arc lamps such as Hg and Xe that are used in combination with specialized filters (there is quite a range here). Not all that practical. BTW to get back on topic the pix in posts 96 and 97 were done with mixed light - outdoor as well as indoor lighting. The indoor lighting may have had various types of light sources - halogen bulbs, etc. The results look good!! Edited January 23, 2017 by waterlenz", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/page/5/?tab=comments#comment-3194311", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sure there is a standard, many of them — first you need a continuous spectrum light source: 3200 degree kelvin tungsten, daylight, or hmi lights. just not leds or fluorescent lights. sensors are designed for them. by standard i meant something numerical and repeatable. tungsten 3200 works but how many have their studios set up this way? as well i am not sure if the light frequency distribution among tungsten bulbs is the same. daylight is variable in its degrees k within a day (think just before sunset) as well as -----> location !!! . fluoro has the problems mentioned above - also there are various types of bulbs. there is a 5000k bulb that is not too bad - i have used these look at trannys on a light table. even strobes have variable light color temps. they may have a specified color temp in k but the k value may vary with flash output level. there are ways to have a controllable light source. for example, i have several microscopes that take arc lamps such as hg and xe that are used in combination with specialized filters (there is quite a range here). not all that practical. btw to get back on topic the pix in posts 96 and 97 were done with mixed light - outdoor as well as indoor lighting. the indoor lighting may have had various types of light sources - halogen bulbs, etc. the results look good!! edited january 23, 2017 by waterlenz", "sortedWord": "None", "identifyer": 99179, "year": "2017"}, {"Unnamed: 0": 205702, "autor": "hmathias", "date": 1485149580000, "content": "By standard I meant something numerical and repeatable. Tungsten 3200 works but how many have their studios set up this way? As well I am not sure if the light frequency distribution among tungsten bulbs is the same. Daylight is variable in its degrees K within a day (think just before sunset) as well as location. Fluoro has the problems mentioned above - also there are various types of bulbs. There is a 5000K bulb that is not too bad - I have used these look at trannys on a light table. Even strobes have variable light color temps. They may have a specified color temp in K but the K value may vary with flash output level. There are ways to have a controllable light source. For example, I have several microscopes that take arc lamps such as Hg and Xe that are used in combination with specialized filters (there is quite a range here). Not all that practical. BTW to get back on topic the pix in posts 96 and 97 were done with mixed light - outdoor as well as indoor lighting. The indoor lighting may have had various types of light sources - halogen bulbs, etc. The results look good!! Knowledgable studios are set up with 3200 Tungsten or Strobes which are daylight balanced and a reliable color source. Frequency is not an issue, except in motion pictures. Daylight is variable, but it is a contiuous spectrum source and can be adjuster with color temperature in the camera, or later with LR or CO1. None od this is a problem except Solid State lighting LEDs and fluorescents.", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/page/5/?tab=comments#comment-3194345", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "by standard i meant something numerical and repeatable. tungsten 3200 works but how many have their studios set up this way? as well i am not sure if the light frequency distribution among tungsten bulbs is the same. daylight is variable in its degrees k within a day (think just before sunset) as well as -----> location !!! . fluoro has the problems mentioned above - also there are various types of bulbs. there is a 5000k bulb that is not too bad - i have used these look at trannys on a light table. even strobes have variable light color temps. they may have a specified color temp in k but the k value may vary with flash output level. there are ways to have a controllable light source. for example, i have several microscopes that take arc lamps such as hg and xe that are used in combination with specialized filters (there is quite a range here). not all that practical. btw to get back on topic the pix in posts 96 and 97 were done with mixed light - outdoor as well as indoor lighting. the indoor lighting may have had various types of light sources - halogen bulbs, etc. the results look good!! knowledgable studios are set up with 3200 tungsten or strobes which are daylight balanced and a reliable color source. frequency is not an issue, except in motion pictures. daylight is variable, but it is a contiuous spectrum source and can be adjuster with color temperature in the camera, or later with lr or co1. none od this is a problem except solid state lighting leds and fluorescents.", "sortedWord": "None", "identifyer": 99180, "year": "2017"}, {"Unnamed: 0": 340330, "autor": "erl", "date": 1510023360000, "content": "I have an ONA bag. I think it is the Union St but can'r remember. I also Have a Billingham, Can't remember what that is either. I don't put a great store by names, just functionality. I bought the ONA, reputedely as the same capacity as the Billingham, and because Liked the look of leather. It is nice, but it is too heavy, inflexible and the cover straps for the main flap are awkward to use. I am seriously of thinking of giving the ONA away (to my daughter) because it is simply not nearly as funtional as ther Billingham. I can fit at least 50% more gear in the Billingham than the ONA of same size. I don't recommend over stuffing any bag of course, because then it becomes non-funtional. I use my Billingham for travel by fitting three camera bodies (Leicas), I think four lenses and much other bits and pieces. However, for day to day shooting I use a small Fogg bag with three lenses. To actually travel, the Fogg is stuffed with socks and underwear and packed in my main (hold) case. The Billingham has ALL my camera gear and travels with me in the overhead locker. I simply 'cherry pick' from the Billingham once on location, or even just wear a belt pouch or two and no bag. I would never use a backpack to work from. Sooo inaccessible on your back, except maybe to theives. However, it would work for travel between locations, maybe. This is very much personal preference and work style of course.", "link": "https://www.l-camera-forum.com/topic/268434-what-bag-for-the-m10/page/13/?tab=comments#comment-3390602", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i have an ona bag. i think it is the union st but can'r remember. i also have a billingham, can't remember what that is either. i don't put a great store by names, just functionality. i bought the ona, reputedely as the same capacity as the billingham, and because liked the look of leather. it is nice, but it is too heavy, inflexible and the cover straps for the main flap are awkward to use. i am seriously of thinking of giving the ona away (to my daughter) because it is simply not nearly as funtional as ther billingham. i can fit at least 50% more gear in the billingham than the ona of same size. i don't recommend over stuffing any bag of course, because then it becomes non-funtional. i use my billingham for travel by fitting three camera bodies (leicas), i think four lenses and much other bits and pieces. however, for day to day shooting i use a small fogg bag with three lenses. to actually travel, the fogg is stuffed with socks and underwear and packed in my main (hold) case. the billingham has all my camera gear and travels with me in the overhead locker. i simply 'cherry pick' from the billingham once on -----> location !!! , or even just wear a belt pouch or two and no bag. i would never use a backpack to work from. sooo inaccessible on your back, except maybe to theives. however, it would work for travel between locations, maybe. this is very much personal preference and work style of course.", "sortedWord": "None", "identifyer": 1397, "year": "2017"}, {"Unnamed: 0": 340333, "autor": "jonoslack", "date": 1510857900000, "content": "However, for day to day shooting I use a small Fogg bag with three lenses. To actually travel, the Fogg is stuffed with socks and underwear and packed in my main (hold) case. The Billingham has ALL my camera gear and travels with me in the overhead locker. I simply 'cherry pick' from the Billingham once on location, or even just wear a belt pouch or two and no bag. I would never use a backpack to work from. Sooo inaccessible on your back, except maybe to theives. However, it would work for travel between locations, maybe. This is very much personal preference and work style of course. I do just the same with my Fogg B-Laika - pack it with socks and underwear in the hold . . and put the cameras in something bigger as cabin luggage.", "link": "https://www.l-camera-forum.com/topic/268434-what-bag-for-the-m10/page/13/?tab=comments#comment-3397013", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "however, for day to day shooting i use a small fogg bag with three lenses. to actually travel, the fogg is stuffed with socks and underwear and packed in my main (hold) case. the billingham has all my camera gear and travels with me in the overhead locker. i simply 'cherry pick' from the billingham once on -----> location !!! , or even just wear a belt pouch or two and no bag. i would never use a backpack to work from. sooo inaccessible on your back, except maybe to theives. however, it would work for travel between locations, maybe. this is very much personal preference and work style of course. i do just the same with my fogg b-laika - pack it with socks and underwear in the hold . . and put the cameras in something bigger as cabin luggage.", "sortedWord": "None", "identifyer": 1400, "year": "2017"}, {"Unnamed: 0": 342371, "autor": "cookedart", "date": 1487099400000, "content": "My thoughts on where to go with a future M: More practical considerations: - Electronic shutter. Fully silent shutter with no vibration on an M just makes sense to me. - Figure out a way that we can shoot with different metering modes with the rangefinder (having the shutter open and sensor exposed - maybe a low power mode for the sensor that can just do metering?). The shutter blade center weighted metering is pretty archaic and is too easily fooled with point light sources at night. - Figure out how to make the camera lighter. Personally, I'd prefer the M11 be Aluminium top and bottom covers, gorilla glass, and a red dot logo, and release the M11-P at the same time with Brass top and bottom plates, sapphire glass, and without the red dot (for the traditionalists). - Release an optional bottom plate that has a more traditional battery/card door. Of course this needs good weather sealing as well. - Focus the M's sensor on high performance in any light, not resolution. 24MP is good, I think. ISO 50 would be welcome. Also, banding free at all ISOs. - Return of the 1/8000 sec shutter - USB charging of battery within the camera. - Half stops for the ISO dial. - Figure out how to fit the BP-SCL2 (M240) battery inside the M with the M10's size. (Its physically possible, but the SD card location prevents this). - Possibly add a small, circular OLED or E-ink display (similar to M8), for battery remaining info, as well as info for the exposure compensation selected. Leave the Exposure compensation as a software dial. This could also be where a GPS antenna could go. Less practical but I still want it: - Release ROM M Mount lenses with full weather sealing (including at the mount). Full weather sealing in the digital M system is overdue. At the very least the ROM lenses could report the chosen aperture to the body. At most they could control the aperture blades so we could have full program or shutter priority modes. Of course this would have to be done with the minimal of size increases. - On Sensor Image Stabilization. The M is a handheld platform. - Hybrid viewfinder. At the very least, integrate a high contrast OLED panel instead of the frameline masks. That way the frameline pairs and shooting info could be fully customizable. You could in theory link the frameline optimization to focus distance, too. If they perfect this then maybe we can eventually have a dream of an optional, integrated EVF (a la the X100 or XPro series) eventually. - Touchscreen, tilt screen. Some probably wouldn't want this but I do. If not a tilt screen, get rid of of the bezel and protrusion of the fixed LCD. Try to move the LCD and buttons as far left as possible to get the four way controller in a nicer spot for the thumb.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/9/?tab=comments#comment-3212940", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "my thoughts on where to go with a future m: more practical considerations: - electronic shutter. fully silent shutter with no vibration on an m just makes sense to me. - figure out a way that we can shoot with different metering modes with the rangefinder (having the shutter open and sensor exposed - maybe a low power mode for the sensor that can just do metering?). the shutter blade center weighted metering is pretty archaic and is too easily fooled with point light sources at night. - figure out how to make the camera lighter. personally, i'd prefer the m11 be aluminium top and bottom covers, gorilla glass, and a red dot logo, and release the m11-p at the same time with brass top and bottom plates, sapphire glass, and without the red dot (for the traditionalists). - release an optional bottom plate that has a more traditional battery/card door. of course this needs good weather sealing as well. - focus the m's sensor on high performance in any light, not resolution. 24mp is good, i think. iso 50 would be welcome. also, banding free at all isos. - return of the 1/8000 sec shutter - usb charging of battery within the camera. - half stops for the iso dial. - figure out how to fit the bp-scl2 (m240) battery inside the m with the m10's size. (its physically possible, but the sd card -----> location !!!  prevents this). - possibly add a small, circular oled or e-ink display (similar to m8), for battery remaining info, as well as info for the exposure compensation selected. leave the exposure compensation as a software dial. this could also be where a gps antenna could go. less practical but i still want it: - release rom m mount lenses with full weather sealing (including at the mount). full weather sealing in the digital m system is overdue. at the very least the rom lenses could report the chosen aperture to the body. at most they could control the aperture blades so we could have full program or shutter priority modes. of course this would have to be done with the minimal of size increases. - on sensor image stabilization. the m is a handheld platform. - hybrid viewfinder. at the very least, integrate a high contrast oled panel instead of the frameline masks. that way the frameline pairs and shooting info could be fully customizable. you could in theory link the frameline optimization to focus distance, too. if they perfect this then maybe we can eventually have a dream of an optional, integrated evf (a la the x100 or xpro series) eventually. - touchscreen, tilt screen. some probably wouldn't want this but i do. if not a tilt screen, get rid of of the bezel and protrusion of the fixed lcd. try to move the lcd and buttons as far left as possible to get the four way controller in a nicer spot for the thumb.", "sortedWord": "None", "identifyer": 3442, "year": "2017"}, {"Unnamed: 0": 354244, "autor": "sml_photo", "date": 1489702260000, "content": "You don't believe ? Look next video: That's a Leica camera, but is it a Leica repair location? That is, is that what Leica technicians use?", "link": "https://www.l-camera-forum.com/topic/270401-typ-240-sensor-cleaning/?tab=comments#comment-3235181", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "you don't believe ? look next video: that's a leica camera, but is it a leica repair -----> location !!! ? that is, is that what leica technicians use?", "sortedWord": "None", "identifyer": 15401, "year": "2017"}, {"Unnamed: 0": 354248, "autor": "Gregm61", "date": 1490042520000, "content": "That's a Leica camera, but is it a Leica repair location? That is, is that what Leica technicians use? That's at the factory. About as official as it gets.", "link": "https://www.l-camera-forum.com/topic/270401-typ-240-sensor-cleaning/?tab=comments#comment-3237921", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "that's a leica camera, but is it a leica repair -----> location !!! ? that is, is that what leica technicians use? that's at the factory. about as official as it gets.", "sortedWord": "None", "identifyer": 15405, "year": "2017"}, {"Unnamed: 0": 359116, "autor": "Paul J", "date": 1485006420000, "content": "So I finally got a good look at the camera in the store, and though it is certainly a tempting beautiful machine, I do feel that Leica has moved the emphasis to the affectionados/amateur market (which is a good thing for many prospective customesr). Fortunately the M240 is still around as well. For my daily use the M10 would be perfect, but I judge it as a travel camera. And there the 240 reigns. Better battery life, video, better hold with heavy/long lenses, those are things that count. Now I travel with a 2KG long lens combo included and 4 batteries which I really need. With the M10 it might be 6 to 8, depending on the power use by the new EVF. The better RFVF and EVF cannot compensate, and the results out of the camera will be mostly identical. It certainly does look that way with the new emphasis in my mind. Leica wants me to to use the SL - Not going to happen. I don't have an option but to try find a work around and try and push Leica to continue developing the M240 line or extend the M10-P with functionality that this world has evolved with. But a simple continuation of the M-240 won't do for me - it needs developing. Ideally, I need the M10 to have usb and I want to be shooting this in way into the future with sensor improvements as they happen, more resolution etc. Sometimes I am on location for 10 days at a time and there are times when we don't have the luxury of power to charge things. While I can make do with M9 battery life, I do have a silly amount of them and to regress in that department seems a disappointment to me also. I agree - this is a travel camera, it's one of the reasons I choose to use it, so again to take away core functionality is just wrong. Video has it's place moreso in this day and age than anything. I can't even begin to mention how much more useful it is to have in one body, at your finger tips to be ready at the decisive moment rather than a separate system you have to reach for etc. It seems crazy to me to pull this as well - this is 2017 and video is part of every day life and becoming even more so by the day. They talk about returning to the photojournalist fold - this is how they are working today!!! Edited January 21, 2017 by Paul J", "link": "https://www.l-camera-forum.com/topic/268389-why-m240-users-will-not-switch-to-m10/page/5/?tab=comments#comment-3192895", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "so i finally got a good look at the camera in the store, and though it is certainly a tempting beautiful machine, i do feel that leica has moved the emphasis to the affectionados/amateur market (which is a good thing for many prospective customesr). fortunately the m240 is still around as well. for my daily use the m10 would be perfect, but i judge it as a travel camera. and there the 240 reigns. better battery life, video, better hold with heavy/long lenses, those are things that count. now i travel with a 2kg long lens combo included and 4 batteries which i really need. with the m10 it might be 6 to 8, depending on the power use by the new evf. the better rfvf and evf cannot compensate, and the results out of the camera will be mostly identical. it certainly does look that way with the new emphasis in my mind. leica wants me to to use the sl - not going to happen. i don't have an option but to try find a work around and try and push leica to continue developing the m240 line or extend the m10-p with functionality that this world has evolved with. but a simple continuation of the m-240 won't do for me - it needs developing. ideally, i need the m10 to have usb and i want to be shooting this in way into the future with sensor improvements as they happen, more resolution etc. sometimes i am on -----> location !!!  for 10 days at a time and there are times when we don't have the luxury of power to charge things. while i can make do with m9 battery life, i do have a silly amount of them and to regress in that department seems a disappointment to me also. i agree - this is a travel camera, it's one of the reasons i choose to use it, so again to take away core functionality is just wrong. video has it's place moreso in this day and age than anything. i can't even begin to mention how much more useful it is to have in one body, at your finger tips to be ready at the decisive moment rather than a separate system you have to reach for etc. it seems crazy to me to pull this as well - this is 2017 and video is part of every day life and becoming even more so by the day. they talk about returning to the photojournalist fold - this is how they are working today!!! edited january 21, 2017 by paul j", "sortedWord": "None", "identifyer": 20298, "year": "2017"}, {"Unnamed: 0": 368308, "autor": "scott kirkpatrick", "date": 1506450480000, "content": "Now with the original camera, when I had had it for about six months (June 2010): --img-- L4005366 by scott kirkpatrick, on Flickr Elmarit 28-asph, location unknown scott", "link": "https://www.l-camera-forum.com/topic/277247-m9-m9-p-m-e-photos-post-them-here/?tab=comments#comment-3365796", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "now with the original camera, when i had had it for about six months (june 2010): --img-- l4005366 by scott kirkpatrick, on flickr elmarit 28-asph, -----> location !!!  unknown scott", "sortedWord": "None", "identifyer": 29586, "year": "2017"}, {"Unnamed: 0": 368339, "autor": "Graham (G4FUJ)", "date": 1510395900000, "content": "Great location BP. I must get back there soon.", "link": "https://www.l-camera-forum.com/topic/277247-m9-m9-p-m-e-photos-post-them-here/page/3/?tab=comments#comment-3393525", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "great -----> location !!!  bp. i must get back there soon.", "sortedWord": "None", "identifyer": 29621, "year": "2017"}, {"Unnamed: 0": 368340, "autor": "Beena22", "date": 1510396980000, "content": "Great location BP. I must get back there soon. I can't believe I've never been. It's only half an hour away from me. Sent from my SM-G950F using Tapatalk", "link": "https://www.l-camera-forum.com/topic/277247-m9-m9-p-m-e-photos-post-them-here/page/3/?tab=comments#comment-3393535", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "great -----> location !!!  bp. i must get back there soon. i can't believe i've never been. it's only half an hour away from me. sent from my sm-g950f using tapatalk", "sortedWord": "None", "identifyer": 29622, "year": "2017"}, {"Unnamed: 0": 391373, "autor": "almoore", "date": 1504768680000, "content": "If your other M-A is \"tighter and more precise\" it is most likely because these cameras are just not built very well in the first place.... Every film M I've ever used - M2s, 4s, 6s - has had a different feel, and they tend to keep that feel over time. Wind on tension and shutter release point varies so much that the traditional 'what's the best M' question is always impossible to answer. You never know until you pick one up. When it comes to gouging on repairs, unless my memory is badly failing me, this is a fairly new phenomenon. The apparent luxury goods repair tax is a really bad vibe on a camera as simple and utilitarian as a film M. It would be interesting to know if stores in places with rents as high as Mayfair and Hong Kong actually make a profit - a trait in the fashion industry is to consider losses in high cost locations as being an advertising expense. Edited September 7, 2017 by almoore", "link": "https://www.l-camera-forum.com/topic/275842-i-burnt-through-my-shutter-cloth/page/4/?tab=comments#comment-3353877", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "if your other m-a is \"tighter and more precise\" it is most likely because these cameras are just not built very well in the first place.... every film m i've ever used - m2s, 4s, 6s - has had a different feel, and they tend to keep that feel over time. wind on tension and shutter release point varies so much that the traditional 'what's the best m' question is always impossible to answer. you never know until you pick one up. when it comes to gouging on repairs, unless my memory is badly failing me, this is a fairly new phenomenon. the apparent luxury goods repair tax is a really bad vibe on a camera as simple and utilitarian as a film m. it would be interesting to know if stores in places with rents as high as mayfair and hong kong actually make a profit - a trait in the fashion industry is to consider losses in high cost -----> locations !!!  as being an advertising expense. edited september 7, 2017 by almoore", "sortedWord": "None", "identifyer": 3830, "year": "2017"}, {"Unnamed: 0": 391377, "autor": "wattsy", "date": 1504773480000, "content": "Every film M I've ever used - M2s, 4s, 6s - has had a different feel, and they tend to keep that feel over time. Wind on tension and shutter release point varies so much that the traditional 'what's the best M' question is always impossible to answer. You never know until you pick one up. Yes, that's true and certainly in more recent years some of the cameras can feel a bit rough and shoddy compared with others. I once had an M7 that I could squeeze vertically about a millimetre or so on one side. I was told it was \"normal\". --img--  My point was really that one camera feeling less \"tight\" shouldn't indicate that it requires a major service when it has probably only had a few dozen rolls of film through it. When it comes to gouging on repairs, unless my memory is badly failing me, this is a fairly new phenomenon. The apparent luxury goods repair tax is a really bad vibe on a camera as simple and utilitarian as a film M. It would be interesting to know if stores in places with rents as high as Mayfair and Hong Kong actually make a profit - a trait in the fashion industry is to consider losses in high cost locations as being an advertising expense. I think it is new. I was told last year by the service guy at Leica UK that Wetzlar had introduced a policy where any repair or service request would involve a mandatory CLA at around £600 or so. There are a number of anecdotal stories in this forum that back that up – I seem to recall someone needing either the frame selector lever or rewind switch replacing and being quoted for a price around £700 including a full CLA. I believe that sense eventually prevailed in that case and the bill was finally agreed at around £150.", "link": "https://www.l-camera-forum.com/topic/275842-i-burnt-through-my-shutter-cloth/page/4/?tab=comments#comment-3353911", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "every film m i've ever used - m2s, 4s, 6s - has had a different feel, and they tend to keep that feel over time. wind on tension and shutter release point varies so much that the traditional 'what's the best m' question is always impossible to answer. you never know until you pick one up. yes, that's true and certainly in more recent years some of the cameras can feel a bit rough and shoddy compared with others. i once had an m7 that i could squeeze vertically about a millimetre or so on one side. i was told it was \"normal\". --img--  my point was really that one camera feeling less \"tight\" shouldn't indicate that it requires a major service when it has probably only had a few dozen rolls of film through it. when it comes to gouging on repairs, unless my memory is badly failing me, this is a fairly new phenomenon. the apparent luxury goods repair tax is a really bad vibe on a camera as simple and utilitarian as a film m. it would be interesting to know if stores in places with rents as high as mayfair and hong kong actually make a profit - a trait in the fashion industry is to consider losses in high cost -----> locations !!!  as being an advertising expense. i think it is new. i was told last year by the service guy at leica uk that wetzlar had introduced a policy where any repair or service request would involve a mandatory cla at around £600 or so. there are a number of anecdotal stories in this forum that back that up – i seem to recall someone needing either the frame selector lever or rewind switch replacing and being quoted for a price around £700 including a full cla. i believe that sense eventually prevailed in that case and the bill was finally agreed at around £150.", "sortedWord": "None", "identifyer": 3834, "year": "2017"}, {"Unnamed: 0": 418216, "autor": "Likaleica", "date": 1488042060000, "content": "That said, who is Sean Cranor and what are the names of his stores? Sean owned Camera West when it was in Mendocino, then he closed that and moved to Rancho Mirage. Then when Reed's Camera in Walnut Creek went out of business he essentially filled the void and opened a second Camera West location. Then he opened Leica SF. So, he owns/runs 3 Leica stores in the Bay Area. He'll do anything for you, great guy. And great people working for him. Very professional. Of course, they sell more than Leica, but both Camera West locations are also a Leica boutique. They also have a blog www.madeinwetzlar.com I know I sound like an advertisement, but they've been very good to me. I can tell others on the Forum use them, especially the WC store, from their descriptions. They are the closest stores to me (i.e., less than 1000 miles) with a large Leica selection. If for some reason they don't have it, and I gotta have it, I go to David Farkas' store in Miami. He's also very helpful. I've found that many of the items I look at on eBay are out of one of Sean's shops. To me, in the age of the internet, it is remarkable that one guy can keep three camera stores thriving. A real testament to the value of customer satisfaction.", "link": "https://www.l-camera-forum.com/topic/269692-which-backpack-for-the-sl/page/2/?tab=comments#comment-3221541", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "that said, who is sean cranor and what are the names of his stores? sean owned camera west when it was in mendocino, then he closed that and moved to rancho mirage. then when reed's camera in walnut creek went out of business he essentially filled the void and opened a second camera west -----> location !!! . then he opened leica sf. so, he owns/runs 3 leica stores in the bay area. he'll do anything for you, great guy. and great people working for him. very professional. of course, they sell more than leica, but both camera west locations are also a leica boutique. they also have a blog www.madeinwetzlar.com i know i sound like an advertisement, but they've been very good to me. i can tell others on the forum use them, especially the wc store, from their descriptions. they are the closest stores to me (i.e., less than 1000 miles) with a large leica selection. if for some reason they don't have it, and i gotta have it, i go to david farkas' store in miami. he's also very helpful. i've found that many of the items i look at on ebay are out of one of sean's shops. to me, in the age of the internet, it is remarkable that one guy can keep three camera stores thriving. a real testament to the value of customer satisfaction.", "sortedWord": "None", "identifyer": 31225, "year": "2017"}, {"Unnamed: 0": 423129, "autor": "thighslapper", "date": 1513072440000, "content": "This morning ...... 18-56 ...... there are only a few mornings a year where the sun rises in the right place for this location .... and very rarely snow. Pity the sky was cloudless though --img--  . For those getting bored with these there will be no more .... this morning was -10c and standing around for half an hour doing nothing was not much fun. ps. the dog is not stuffed and placed as required in the photos ..... he is just a very obliging model .... --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/320292-cl-the-image-thread/page/8/?tab=comments#comment-3416292", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "this morning ...... 18-56 ...... there are only a few mornings a year where the sun rises in the right place for this -----> location !!!  .... and very rarely snow. pity the sky was cloudless though --img--  . for those getting bored with these there will be no more .... this morning was -10c and standing around for half an hour doing nothing was not much fun. ps. the dog is not stuffed and placed as required in the photos ..... he is just a very obliging model .... --img--  --img-- ", "sortedWord": "None", "identifyer": 36179, "year": "2017"}, {"Unnamed: 0": 440811, "autor": "marchyman", "date": 1492281840000, "content": "There is an O-ring/gasket that needs some force to compress so the hood is in the proper location. The position of your hood is about where it takes more force to rotate. And while I doubt it is part of the problem I'd try putting the hood on after removing the filter just to be sure.", "link": "https://www.l-camera-forum.com/topic/271428-hood-doesnt-rotate-fully/?tab=comments#comment-3255412", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "there is an o-ring/gasket that needs some force to compress so the hood is in the proper -----> location !!! . the position of your hood is about where it takes more force to rotate. and while i doubt it is part of the problem i'd try putting the hood on after removing the filter just to be sure.", "sortedWord": "None", "identifyer": 54152, "year": "2017"}, {"Unnamed: 0": 446125, "autor": "DwF", "date": 1485820680000, "content": "How do I upload photos to the forum? Welcome to the site/thread, and thanks for asking! --img--  First, upload your image to a site like flickr or pbase, and then click on that image to \"copy image location\". Then open this box here and click on the 'green\" image icon and paste your link there. It should open in the dialog box, and you can preview before you hit \"Post\" Cheers, David", "link": "https://www.l-camera-forum.com/topic/234653-leica-x-type-113-photos/page/15/?tab=comments#comment-3200727", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "how do i upload photos to the forum? welcome to the site/thread, and thanks for asking! --img--  first, upload your image to a site like flickr or pbase, and then click on that image to \"copy image -----> location !!! \". then open this box here and click on the 'green\" image icon and paste your link there. it should open in the dialog box, and you can preview before you hit \"post\" cheers, david", "sortedWord": "None", "identifyer": 9555, "year": "2017"}, {"Unnamed: 0": 446126, "autor": "pop", "date": 1485846660000, "content": "Welcome to the site/thread, and thanks for asking! --img--  First, upload your image to a site like flickr or pbase, and then click on that image to \"copy image location\". Then open this box here and click on the 'green\" image icon and paste your link there. It should open in the dialog box, and you can preview before you hit \"Post\" Cheers, David Thanks for your suggestion. Actually, the post you are quoting is a link to the entry in our FAQ explaining how to upload photographs. Click on the link to see the instructions. We prefer members uploading their photographs to the forum itself and not linking via third party sites.", "link": "https://www.l-camera-forum.com/topic/234653-leica-x-type-113-photos/page/15/?tab=comments#comment-3200848", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "welcome to the site/thread, and thanks for asking! --img--  first, upload your image to a site like flickr or pbase, and then click on that image to \"copy image -----> location !!! \". then open this box here and click on the 'green\" image icon and paste your link there. it should open in the dialog box, and you can preview before you hit \"post\" cheers, david thanks for your suggestion. actually, the post you are quoting is a link to the entry in our faq explaining how to upload photographs. click on the link to see the instructions. we prefer members uploading their photographs to the forum itself and not linking via third party sites.", "sortedWord": "None", "identifyer": 9556, "year": "2017"}, {"Unnamed: 0": 446462, "autor": "JMF", "date": 1513596180000, "content": "Nice shots - but I expected the camera to be used in more extreme circumstances. Thanks, as per the locations . --img--  en Cuba by JM__, on Flickr Edited December 18, 2017 by JMF", "link": "https://www.l-camera-forum.com/topic/274692-leica-x-u-image-thread/?tab=comments#comment-3420415", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "nice shots - but i expected the camera to be used in more extreme circumstances. thanks, as per the -----> locations !!!  . --img--  en cuba by jm__, on flickr edited december 18, 2017 by jmf", "sortedWord": "None", "identifyer": 9906, "year": "2017"}], "name": "locationL-Forum2017"}