{"interestingcomments": [{"Unnamed: 0": 353089, "autor": "bencoyote", "date": 1453996860000, "content": " For anyone looking for that \"old pro\" look or to garner respect granted people in the Leica community who pull out a brassed camera, one that has the authentic look of years heavy use (not one of those pre-brassed faux Black Chrome\" special editions). i seem to have inadvertently stumbled across a method of accelerated brassing which surprisingly rapidly begins to give your camera an authentic brassed look. The technique is actually quite simple. You run to a place where you are going to shoot while carrying the camera in a conventional backpack. It seems that friction of nylon while being gently jostled thousands of times while running to your shooting location gently removes the surface paint in all the locations frequently seen on the cameras of old pro's who have taken their Leicas to dozens of countries and shot for a multitude of magazines for years. You too can project the image of being a old grizzled pro without having to go through the effort of actually having to travel to far away destinations and shoot in dangerous situations or go through the bother of satisfying clients or even having to edit through thousands upon thousands of pictures. You can just pull out your elegantly brassed Leica with aplomb take a few shots and everyone will know that you have captured the magic in the moment and that there is some greatness in those few frames you have captured. ;-)", "link": "https://www.l-camera-forum.com/topic/256170-accelerated-brassing/?tab=comments#comment-2978027", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " for anyone looking for that \"old pro\" look or to garner respect granted people in the leica community who pull out a brassed camera, one that has the authentic look of years heavy use (not one of those pre-brassed faux black chrome\" special editions). i seem to have inadvertently stumbled across a method of accelerated brassing which surprisingly rapidly begins to give your camera an authentic brassed look. the technique is actually quite simple. you run to a place where you are going to shoot while carrying the camera in a conventional backpack. it seems that friction of nylon while being gently jostled thousands of times while running to your shooting -----> location !!!  gently removes the surface paint in all the locations frequently seen on the cameras of old pro's who have taken their leicas to dozens of countries and shot for a multitude of magazines for years. you too can project the image of being a old grizzled pro without having to go through the effort of actually having to travel to far away destinations and shoot in dangerous situations or go through the bother of satisfying clients or even having to edit through thousands upon thousands of pictures. you can just pull out your elegantly brassed leica with aplomb take a few shots and everyone will know that you have captured the magic in the moment and that there is some greatness in those few frames you have captured. ;-)", "sortedWord": "None", "identifyer": 14233, "year": "2016"}, {"Unnamed: 0": 356715, "autor": "sdk", "date": 1461854700000, "content": "One thing I noticed on Leica's Details web page is they claim the M-D's shutter is significantly quieter in re-cocking than the M Typ 240 series cameras. That quietude could be a boon for people shooting in quiet locations, or wanting maximum discretion.", "link": "https://www.l-camera-forum.com/topic/259865-the-leica-m-d-thread-merged/page/14/?tab=comments#comment-3035144", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "one thing i noticed on leica's details web page is they claim the m-d's shutter is significantly quieter in re-cocking than the m typ 240 series cameras. that quietude could be a boon for people shooting in quiet -----> locations !!! , or wanting maximum discretion.", "sortedWord": "None", "identifyer": 17883, "year": "2016"}, {"Unnamed: 0": 365378, "autor": "Leonardo_alves", "date": 1470752040000, "content": "yes john Thanks John! Do you have a similar experience? If yes, did you need to pay the shipping for the repair location? Sent from my ASUS_T00J using Tapatalk", "link": "https://www.l-camera-forum.com/topic/250545-original-monochrom-corrosion-issues/page/2/?tab=comments#comment-3093442", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "yes john thanks john! do you have a similar experience? if yes, did you need to pay the shipping for the repair -----> location !!! ? sent from my asus_t00j using tapatalk", "sortedWord": "None", "identifyer": 26639, "year": "2016"}, {"Unnamed: 0": 394314, "autor": "Michael Geschlecht", "date": 1465071600000, "content": "Hello CGR, Welcome to the Forum. Altho it is customary for many cameras to come with centrally located tripod connections you may well find that the M3's offset location at times is advantageous. Please note: Certain heavier range/viewfinder lenses such as the 135mm, F2.8, Elmarit & the earlier 90mm, F2, Summicron come with their own centrally located 1/4 & 3/8 combined tripod connections. The connection is on the lens where it should be with a heavier lens. I have used a 135mm, F4, Tele-Elmar for years in both horizontal & vertical format held in place by a medium sized Leitz Large Ball Head with no problems in terms of camera or lens movement. None. This is combined with easy adjustability on the tripod. Most Leitz/Leica range/viewfinder lenses without their own tripod connections are smaller, lighter & more centrally balanced than the above mentioned Tele-Elmar which has most of its weight at the end opposite the camera end because of a reasonably long lens barrel. A longer lens barrel tends to make a lens more unbalanced. You might try a substantial ball head like a Leitz/Leica Large Ballhead & be pleasantly surprised at the advantages that an offset tripod connection can have when it used with a substantial enough ballhead. Best Regards, Michael", "link": "https://www.l-camera-forum.com/topic/261249-baseplate-option-for-a-central-tripod-bush/?tab=comments#comment-3056720", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "hello cgr, welcome to the forum. altho it is customary for many cameras to come with centrally located tripod connections you may well find that the m3's offset -----> location !!!  at times is advantageous. please note: certain heavier range/viewfinder lenses such as the 135mm, f2.8, elmarit & the earlier 90mm, f2, summicron come with their own centrally located 1/4 & 3/8 combined tripod connections. the connection is on the lens where it should be with a heavier lens. i have used a 135mm, f4, tele-elmar for years in both horizontal & vertical format held in place by a medium sized leitz large ball head with no problems in terms of camera or lens movement. none. this is combined with easy adjustability on the tripod. most leitz/leica range/viewfinder lenses without their own tripod connections are smaller, lighter & more centrally balanced than the above mentioned tele-elmar which has most of its weight at the end opposite the camera end because of a reasonably long lens barrel. a longer lens barrel tends to make a lens more unbalanced. you might try a substantial ball head like a leitz/leica large ballhead & be pleasantly surprised at the advantages that an offset tripod connection can have when it used with a substantial enough ballhead. best regards, michael", "sortedWord": "None", "identifyer": 6779, "year": "2016"}, {"Unnamed: 0": 397507, "autor": "willeica", "date": 1477037640000, "content": "I have the 3.5/35mm LTM Summaron and it is almost a doppelgänger for the 2.8/5.6 Summaron we are discussing. It is another really nice lens, both build and image quality-wise. Interesting to me that you mention this lens. I feel like we are on the same page. But, the 35mm/3.5 Summaron is not even close to being as optically advanced as the 2.8/5.6 Summaron. The 3.5/3.5 Summaron is a moderate contrast lens that is only sharp on axis and drops off precipitously by 6mm. Even stopping it down to 5.6 only improve softness a little bit across the frame. I also own the 3.5/35mm Summaron LTM and really like the way it renders regardless of its optical limitations. But, it can not compare to modern lens designs the way the 2.8/5.6 Summaron can. I believe this is why Leica chose the 3.5/5.6 Summaron. The 3.5/5.6 Summaron is still optically relevant. Historically, the 3.5/5.6 Summaron gave way to the M mount Emarit 2.8. But, it really wasn't until the version IV of the Elmarit that the sharpness across the frame caught up to the 1950 designed Summaron 2.8/5.6. The little Summaron's double Gauss design although, optically not on the level of the latest Summicron, produces a classic look that is still optically relevant compared to modern lenses. Rick Thanks Rick. Yes the f3.5 35mm Summaron is not as good as the f5.6 2.8 cm Summaron but the lens is still much better than some might expect and is available at a reasonable price to enable users to experiment with digital plus 'vintage look'. Any picture is worth a thousand words. Rather than analysing graphs and discussing optical formulae, my contribution is another photo, taken this time on the Leica M9 with the f3.5 35mm Summaron. By the purest of coincidences this was taken in the same location as the second set of photos in my article on the 2.8 cm lens linked above, but five years earlier and in much better weather. --img--  I might add that this looks much better on my iMac at home than it does here. I am happy to mail a better copy to anyone who is really interested. William", "link": "https://www.l-camera-forum.com/topic/265598-leica-summaron-28-image-thread/page/7/?tab=comments#comment-3132773", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i have the 3.5/35mm ltm summaron and it is almost a doppelgänger for the 2.8/5.6 summaron we are discussing. it is another really nice lens, both build and image quality-wise. interesting to me that you mention this lens. i feel like we are on the same page. but, the 35mm/3.5 summaron is not even close to being as optically advanced as the 2.8/5.6 summaron. the 3.5/3.5 summaron is a moderate contrast lens that is only sharp on axis and drops off precipitously by 6mm. even stopping it down to 5.6 only improve softness a little bit across the frame. i also own the 3.5/35mm summaron ltm and really like the way it renders regardless of its optical limitations. but, it can not compare to modern lens designs the way the 2.8/5.6 summaron can. i believe this is why leica chose the 3.5/5.6 summaron. the 3.5/5.6 summaron is still optically relevant. historically, the 3.5/5.6 summaron gave way to the m mount emarit 2.8. but, it really wasn't until the version iv of the elmarit that the sharpness across the frame caught up to the 1950 designed summaron 2.8/5.6. the little summaron's double gauss design although, optically not on the level of the latest summicron, produces a classic look that is still optically relevant compared to modern lenses. rick thanks rick. yes the f3.5 35mm summaron is not as good as the f5.6 2.8 cm summaron but the lens is still much better than some might expect and is available at a reasonable price to enable users to experiment with digital plus 'vintage look'. any picture is worth a thousand words. rather than analysing graphs and discussing optical formulae, my contribution is another photo, taken this time on the leica m9 with the f3.5 35mm summaron. by the purest of coincidences this was taken in the same -----> location !!!  as the second set of photos in my article on the 2.8 cm lens linked above, but five years earlier and in much better weather. --img--  i might add that this looks much better on my imac at home than it does here. i am happy to mail a better copy to anyone who is really interested. william", "sortedWord": "None", "identifyer": 10097, "year": "2016"}, {"Unnamed: 0": 398872, "autor": "JMF", "date": 1456181640000, "content": "with the WATE on 16mm in Hong Kong: --img-- Hong Kong by Dirk Raffel, auf Flickr Great shot of a classic location !", "link": "https://www.l-camera-forum.com/topic/253730-your-ultra-wide-angle-uwa-pictures-10mm-to-21mm/page/3/?tab=comments#comment-2994749", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "with the wate on 16mm in hong kong: --img-- hong kong by dirk raffel, auf flickr great shot of a classic -----> location !!!  !", "sortedWord": "None", "identifyer": 11525, "year": "2016"}, {"Unnamed: 0": 398974, "autor": "LocalHero1953", "date": 1475943000000, "content": "I found a used SEM 21mm at a reasonable price today. Excellent condition, but shabby box & papers and no lens cap - the latter was easily sorted. This is my first venture into the UWA realm: so, some standard locations and shots. --img-- ", "link": "https://www.l-camera-forum.com/topic/253730-your-ultra-wide-angle-uwa-pictures-10mm-to-21mm/page/8/?tab=comments#comment-3125458", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i found a used sem 21mm at a reasonable price today. excellent condition, but shabby box & papers and no lens cap - the latter was easily sorted. this is my first venture into the uwa realm: so, some standard -----> locations !!!  and shots. --img-- ", "sortedWord": "None", "identifyer": 11627, "year": "2016"}, {"Unnamed: 0": 398977, "autor": "EoinC", "date": 1475944500000, "content": " I found a used SEM 21mm at a reasonable price today. Excellent condition, but shabby box & papers and no lens cap - the latter was easily sorted. This is my first venture into the UWA realm: so, some standard locations and shots. --img-- London - 21mm lens check 08-10-16 -01.jpg Good work, Paul. Fun times ahead...", "link": "https://www.l-camera-forum.com/topic/253730-your-ultra-wide-angle-uwa-pictures-10mm-to-21mm/page/9/?tab=comments#comment-3125473", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": " i found a used sem 21mm at a reasonable price today. excellent condition, but shabby box & papers and no lens cap - the latter was easily sorted. this is my first venture into the uwa realm: so, some standard -----> locations !!!  and shots. --img-- london - 21mm lens check 08-10-16 -01.jpg good work, paul. fun times ahead...", "sortedWord": "None", "identifyer": 11630, "year": "2016"}, {"Unnamed: 0": 399001, "autor": "EoinC", "date": 1477399620000, "content": "I know this is an UWA thread but just bear with me because as I was talking about one of my all time photographic heroes Bill Brandt and I live about 3miles away from where he took some of his greatest ever images I thought that I would post my version of what I consider to be Brandt's greatest ever image. Originally taken in Halifax West Yorkshire, on the steps going up to the footbridge over the railway line to the old Halifax North Bridge railway station. Brandt called it \"A snicket in Halifax\" and took it in 1945 on his Rolleiflex. My picture is my homage to him and was taken in 2012 on my Leica M9 at exactly the same location and processed in the same high contrast way that Brandt did all those years ago. Nothing has changed, the scene in just as it was when Brandt took the picture. For our members who maybe are not familiar with the work of Bill Brandt I would say go and have a look at this wonderful photographers work because to me at least it just mesmerises me and I am awestruck by what he achieved with his Rolleiflex and laterly with a second hand ex Police wide angle camera that I think he bought from a junk shop for about 7 Shillings and Sixpence. Well done, Paul, and thank you.", "link": "https://www.l-camera-forum.com/topic/253730-your-ultra-wide-angle-uwa-pictures-10mm-to-21mm/page/10/?tab=comments#comment-3135146", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i know this is an uwa thread but just bear with me because as i was talking about one of my all time photographic heroes bill brandt and i live about 3miles away from where he took some of his greatest ever images i thought that i would post my version of what i consider to be brandt's greatest ever image. originally taken in halifax west yorkshire, on the steps going up to the footbridge over the railway line to the old halifax north bridge railway station. brandt called it \"a snicket in halifax\" and took it in 1945 on his rolleiflex. my picture is my homage to him and was taken in 2012 on my leica m9 at exactly the same -----> location !!!  and processed in the same high contrast way that brandt did all those years ago. nothing has changed, the scene in just as it was when brandt took the picture. for our members who maybe are not familiar with the work of bill brandt i would say go and have a look at this wonderful photographers work because to me at least it just mesmerises me and i am awestruck by what he achieved with his rolleiflex and laterly with a second hand ex police wide angle camera that i think he bought from a junk shop for about 7 shillings and sixpence. well done, paul, and thank you.", "sortedWord": "None", "identifyer": 11654, "year": "2016"}, {"Unnamed: 0": 419547, "autor": "FlashGordonPhotography", "date": 1454961660000, "content": "SF 240 probably wouldn't be powerful enough for you either Gordon for covering a wedding. I know things have changed a lot but I started out I suppose like many with a Metz 402 and then a Metz CT60 in the days before TTL - now of course it's all dedicated TTL with SB900's. Just as an aside to this I have got a really nice collection of Nikon SB flashes for virtually nothing because they won't dedicate with digital. I picked up my bargain of all bargains when I bought a Nikon SB80 for £10 in mint condition the other month. I saw it in a shop and grabbed it straight away - the shop owner was at pains to point out that it could only be used for older film Nikons. I of course never said that was OK by me because I only wanted it to use in manual mode via a manual wireless trigger. For me then I have a couple of SB900's for TTL and a bag of cheap SB flashes for manual strobist off camera use with ANY camera system along with the Yongnuo RF 602 wireless triggers. These RF 602N's work better than anything that I know even dare I say it Pocket Wizards. PS: on my avatar pic I'm using a SB800 on a Nikon - my friend took it and then took the p**s out of me for trying to light with a flash from 2000ft. Actually the flash was for the inside of the helicopter but his pic made a nice one for me to nick to use as an avatar! I've shot a couple of full weddings and needed nothing more than an i40 on my Fuji cameras. Modern high ISO helps a lot. However I do intend to either use my SF58's or purchase an SF64 for the SL. I really bought the SF40 because it suits the M cameras so well. I expect that often it will be enough for use at a wedding because in the environment I shoot my main use is really fill flash. I also carry a Godox 360 to each wedding and have that to use when necessary. Plenty of power there. Good find on the Nikon guns. It's a shame people dump this incredibly useful stuff. But great for you. I have a bunch of older guns, collected over the years that make near perfect hair lights and rim lights in studio and on location. And a couple of sets of eneloops makes them into a rechargeable battery system. I'm so dull I'm still triggering most of them off wein optical slaves although I do have a couple of cheap Chinese triggers. Many of the older Metz guns have a slave built in. Nice avatar pic. I've never got round to doing mine. Gordon", "link": "https://www.l-camera-forum.com/topic/256231-flash-performance-very-disappointing-on-the-sl/page/2/?tab=comments#comment-2985606", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "sf 240 probably wouldn't be powerful enough for you either gordon for covering a wedding. i know things have changed a lot but i started out i suppose like many with a metz 402 and then a metz ct60 in the days before ttl - now of course it's all dedicated ttl with sb900's. just as an aside to this i have got a really nice collection of nikon sb flashes for virtually nothing because they won't dedicate with digital. i picked up my bargain of all bargains when i bought a nikon sb80 for £10 in mint condition the other month. i saw it in a shop and grabbed it straight away - the shop owner was at pains to point out that it could only be used for older film nikons. i of course never said that was ok by me because i only wanted it to use in manual mode via a manual wireless trigger. for me then i have a couple of sb900's for ttl and a bag of cheap sb flashes for manual strobist off camera use with any camera system along with the yongnuo rf 602 wireless triggers. these rf 602n's work better than anything that i know even dare i say it pocket wizards. ps: on my avatar pic i'm using a sb800 on a nikon - my friend took it and then took the p**s out of me for trying to light with a flash from 2000ft. actually the flash was for the inside of the helicopter but his pic made a nice one for me to nick to use as an avatar! i've shot a couple of full weddings and needed nothing more than an i40 on my fuji cameras. modern high iso helps a lot. however i do intend to either use my sf58's or purchase an sf64 for the sl. i really bought the sf40 because it suits the m cameras so well. i expect that often it will be enough for use at a wedding because in the environment i shoot my main use is really fill flash. i also carry a godox 360 to each wedding and have that to use when necessary. plenty of power there. good find on the nikon guns. it's a shame people dump this incredibly useful stuff. but great for you. i have a bunch of older guns, collected over the years that make near perfect hair lights and rim lights in studio and on -----> location !!! . and a couple of sets of eneloops makes them into a rechargeable battery system. i'm so dull i'm still triggering most of them off wein optical slaves although i do have a couple of cheap chinese triggers. many of the older metz guns have a slave built in. nice avatar pic. i've never got round to doing mine. gordon", "sortedWord": "None", "identifyer": 32559, "year": "2016"}, {"Unnamed: 0": 441481, "autor": "lucerne", "date": 1453584480000, "content": "So many options. I don't think utilitarian is a factor because designers are waiting to take your cash for something that is designed as utilitarian but priced as a luxury item. Definitely avoid! . It really depends on what - in addition to the camera - do you need to carry and whether this has to double as protective bag for long distance travel. Are you only carrying the q plus a spare card and battery, or water, sandwiches and protective clothing. Certainly, in choosing a simple bag that gives good protection and is waterproofed you could look at Lowepro top loaders. If you want to avoid giving away the fact that you are carrying photographic gear, just choose a small shoulder bag. I use a Case Logic, but in reality, once I get to my shooting location, the bag just gets in the way. I hate carrying an empty bag once I'm shooting. Use the forum search facility to see how others interpret the type of bag that suits. It's been discussed since the Q was released. Some bought the bag before their camera even arrived. I wonder if -on reflection - they made the right decision . You need to experiment in your local store. Edited January 23, 2016 by lucerne", "link": "https://www.l-camera-forum.com/topic/255988-camera-bag/?tab=comments#comment-2974993", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "so many options. i don't think utilitarian is a factor because designers are waiting to take your cash for something that is designed as utilitarian but priced as a luxury item. definitely avoid! . it really depends on what - in addition to the camera - do you need to carry and whether this has to double as protective bag for long distance travel. are you only carrying the q plus a spare card and battery, or water, sandwiches and protective clothing. certainly, in choosing a simple bag that gives good protection and is waterproofed you could look at lowepro top loaders. if you want to avoid giving away the fact that you are carrying photographic gear, just choose a small shoulder bag. i use a case logic, but in reality, once i get to my shooting -----> location !!! , the bag just gets in the way. i hate carrying an empty bag once i'm shooting. use the forum search facility to see how others interpret the type of bag that suits. it's been discussed since the q was released. some bought the bag before their camera even arrived. i wonder if -on reflection - they made the right decision . you need to experiment in your local store. edited january 23, 2016 by lucerne", "sortedWord": "None", "identifyer": 54829, "year": "2016"}, {"Unnamed: 0": 448837, "autor": "wda", "date": 1456940340000, "content": "Mike, welcome to the forum! I have found AF to be the weak point on the X Vario. For snap decisions such as your 'fleeting moments' it is likely to be found wanting. If you rush exposure before you get the green light you might be disappointed. In such situations work out a preset manual procedure, based on reasonable depth of field. (lens stopped down to f/8 and focus to your normal shooting distance for candid work. For personal locations it is easy to measure a good mid point for manual focusing. Experiment with Face Detection which can work surprisingly well in social situations or street. (Your points 1 and 2) Point 3. I do not think this is correct. My belief is that after zooming focus must be reset. I will check this when I have time. Edited March 2, 2016 by wda", "link": "https://www.l-camera-forum.com/topic/257559-manual-focusing-techniques-for-the-x-vario-with-an-leica-evf2/?tab=comments#comment-3000372", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "mike, welcome to the forum! i have found af to be the weak point on the x vario. for snap decisions such as your 'fleeting moments' it is likely to be found wanting. if you rush exposure before you get the green light you might be disappointed. in such situations work out a preset manual procedure, based on reasonable depth of field. (lens stopped down to f/8 and focus to your normal shooting distance for candid work. for personal -----> locations !!!  it is easy to measure a good mid point for manual focusing. experiment with face detection which can work surprisingly well in social situations or street. (your points 1 and 2) point 3. i do not think this is correct. my belief is that after zooming focus must be reset. i will check this when i have time. edited march 2, 2016 by wda", "sortedWord": "None", "identifyer": 12325, "year": "2016"}, {"Unnamed: 0": 448840, "autor": "wda", "date": 1457003100000, "content": "Mike, welcome to the forum! I have found AF to be the weak point on the X Vario. For snap decisions such as your 'fleeting moments' it is likely to be found wanting. If you rush exposure before you get the green light you might be disappointed. In such situations work out a preset manual procedure, based on reasonable depth of field. (lens stopped down to f/8 and focus to your normal shooting distance for candid work. For personal locations it is easy to measure a good mid point for manual focusing. Experiment with Face Detection which can work surprisingly well in social situations or street. (Your points 1 and 2) Point 3. I do not think this is correct. My belief is that after zooming focus must be reset. I will check this when I have time. I have since checked this technique and conclude that in manual focusing mode, zooming aids accuracy and does not appear to change with focal length.", "link": "https://www.l-camera-forum.com/topic/257559-manual-focusing-techniques-for-the-x-vario-with-an-leica-evf2/?tab=comments#comment-3000798", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "mike, welcome to the forum! i have found af to be the weak point on the x vario. for snap decisions such as your 'fleeting moments' it is likely to be found wanting. if you rush exposure before you get the green light you might be disappointed. in such situations work out a preset manual procedure, based on reasonable depth of field. (lens stopped down to f/8 and focus to your normal shooting distance for candid work. for personal -----> locations !!!  it is easy to measure a good mid point for manual focusing. experiment with face detection which can work surprisingly well in social situations or street. (your points 1 and 2) point 3. i do not think this is correct. my belief is that after zooming focus must be reset. i will check this when i have time. i have since checked this technique and conclude that in manual focusing mode, zooming aids accuracy and does not appear to change with focal length.", "sortedWord": "None", "identifyer": 12328, "year": "2016"}, {"Unnamed: 0": 449202, "autor": "Manoleica", "date": 1454323260000, "content": "Great image, can you please tell us the location of the bridge. Tx L", "link": "https://www.l-camera-forum.com/topic/256308-happy-x2-owner/?tab=comments#comment-2980553", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "great image, can you please tell us the -----> location !!!  of the bridge. tx l", "sortedWord": "None", "identifyer": 12692, "year": "2016"}], "name": "locationL-Forum2016"}