{"interestingcomments": [{"Unnamed: 0": 342505, "autor": "ramarren", "date": 1530661620000, "content": "But presumably also with M10 size (thinner) than MD (fatter)? Sent from my iPhone using Tapatalk No. The M-D where I grip it is as thin as the M10, and without the cumbersome array of buttons and LCD that get in the way of my hands. I prefer how the M-D feels in my hands to the extent that I have not yet seen any reason at all to buy an M10, other than the improved viewfinder and sensor of the M10 ... which aren't enough justification to spend for it, for me. When I measured the two cameras side-by-side at the Leica Store in SF, the M10 in some places might be as much as 1mm thinner ... but most places it is thicker. And the M-D was much more comfortable to hold, with controls in more convenient locations, than the M10.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/16/?tab=comments#comment-3549173", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "but presumably also with m10 size (thinner) than md (fatter)? sent from my iphone using tapatalk no. the m-d where i grip it is as thin as the m10, and without the cumbersome array of buttons and lcd that get in the way of my hands. i prefer how the m-d feels in my hands to the extent that i have not yet seen any reason at all to buy an m10, other than the improved viewfinder and sensor of the m10 ... which aren't enough justification to spend for it, for me. when i measured the two cameras side-by-side at the leica store in sf, the m10 in some places might be as much as 1mm thinner ... but most places it is thicker. and the m-d was much more comfortable to hold, with controls in more convenient -----> locations !!! , than the m10.", "sortedWord": "None", "identifyer": 3576, "year": "2018"}, {"Unnamed: 0": 358132, "autor": "PFM", "date": 1535334420000, "content": "I've been doing a lot of reshuffling around the apartment lately, trying to get the 45 years worth of accumulation down to a manageable pile. In the process I'll stack things to get to later, and then forget what I put where when I need to find it. Like the bag of Nikon rangefinder gear I couldn't find for two weeks. Thought I'd left it at the last location. After that episode I put all my camera bags on a new set of shelving bought just for that purpose. So far, I've been able to keep track of the Leica gear. --img--  PF", "link": "https://www.l-camera-forum.com/topic/287683-heart-attack-time-almost/?tab=comments#comment-3580257", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i've been doing a lot of reshuffling around the apartment lately, trying to get the 45 years worth of accumulation down to a manageable pile. in the process i'll stack things to get to later, and then forget what i put where when i need to find it. like the bag of nikon rangefinder gear i couldn't find for two weeks. thought i'd left it at the last -----> location !!! . after that episode i put all my camera bags on a new set of shelving bought just for that purpose. so far, i've been able to keep track of the leica gear. --img--  pf", "sortedWord": "None", "identifyer": 19311, "year": "2018"}, {"Unnamed: 0": 358133, "autor": "ajayk", "date": 1535346060000, "content": "Well happens all the time with me... fortunately I don’t forget them in outdoor locations but at home. Latest being a small Canon that I had bought at the time of my younger daughter’s birth ... lost some magnificent memories with it...monetary loss was not my main issue.", "link": "https://www.l-camera-forum.com/topic/287683-heart-attack-time-almost/?tab=comments#comment-3580303", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "well happens all the time with me... fortunately i don’t forget them in outdoor -----> locations !!!  but at home. latest being a small canon that i had bought at the time of my younger daughter’s birth ... lost some magnificent memories with it...monetary loss was not my main issue.", "sortedWord": "None", "identifyer": 19312, "year": "2018"}, {"Unnamed: 0": 358804, "autor": "sblutter", "date": 1546283880000, "content": "We were on a 3hr walking trip in Madrid - one guy also had an M240, his was fitted with the 2.0 90 - a big heavy lens. I was using my fav walking lenses; 50 Elmarit-M (collapsible) & and the pancake Voight 35 2.5. I'm been an M shooter for 50 yrs - was a pro for yrs, a lot of them as an architectural view camera on location guy, have had shows etc. In 3 hours, the 90 guy never even looked through the VF'r Maybe nothing interested him...", "link": "https://www.l-camera-forum.com/topic/292641-do-you-assume-a-certain-level-of-knowledge-of-a-leica-shooter/page/2/?tab=comments#comment-3656129", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "we were on a 3hr walking trip in madrid - one guy also had an m240, his was fitted with the 2.0 90 - a big heavy lens. i was using my fav walking lenses; 50 elmarit-m (collapsible) & and the pancake voight 35 2.5. i'm been an m shooter for 50 yrs - was a pro for yrs, a lot of them as an architectural view camera on -----> location !!!  guy, have had shows etc. in 3 hours, the 90 guy never even looked through the vf'r maybe nothing interested him...", "sortedWord": "None", "identifyer": 19985, "year": "2018"}, {"Unnamed: 0": 366310, "autor": "wilfredo", "date": 1532367540000, "content": "It was definitely pouring, and I was able to take the shot from a location with a small ceiling overhead. The light was quickly disappearing. I posted the picture with hardly any PP, but I decided to tweak it a bit to give it a bit more contrast. I can see Jaap's point about the water looking like quick sand, it looks surreal, nevertheless I enjoy the artistic effect, and the mood it creates. If it looks like quick sand, so be it! I'm looking forward to more experimentation with the ND filter. Cheers! --img--  Edited July 23, 2018 by wilfredo", "link": "https://www.l-camera-forum.com/topic/281818-long-exposures-with-the-mm1-60-240-sec/page/4/?tab=comments#comment-3560362", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "it was definitely pouring, and i was able to take the shot from a -----> location !!!  with a small ceiling overhead. the light was quickly disappearing. i posted the picture with hardly any pp, but i decided to tweak it a bit to give it a bit more contrast. i can see jaap's point about the water looking like quick sand, it looks surreal, nevertheless i enjoy the artistic effect, and the mood it creates. if it looks like quick sand, so be it! i'm looking forward to more experimentation with the nd filter. cheers! --img--  edited july 23, 2018 by wilfredo", "sortedWord": "None", "identifyer": 27579, "year": "2018"}, {"Unnamed: 0": 368430, "autor": "Beena22", "date": 1517601360000, "content": " . . . . . the Beena magic again --img--  I think the light and location had more to do with it than I did --img-- ", "link": "https://www.l-camera-forum.com/topic/277247-m9-m9-p-m-e-photos-post-them-here/page/8/?tab=comments#comment-3453816", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " . . . . . the beena magic again --img--  i think the light and -----> location !!!  had more to do with it than i did --img-- ", "sortedWord": "None", "identifyer": 29717, "year": "2018"}, {"Unnamed: 0": 373255, "autor": "schattenundlicht", "date": 1539520260000, "content": "CONCLUSION: The Elmarit 28 ASPH is not at fault at all. No need to sell this wonderful lens. The problem stems from the M9 sensor but is corrected in-camera for jpegs if the appropriate lens profile is chosen manually or detected automatically. DNGs shot w/o lens profile show the full cyan/green hue, whereas DNGs shot with the appropriate lens profile show somewhat corrected color on default in Lightroom, even when lens profiles are deactivated in LR. This is a case in point, that „raw“ files are far from being truly unprocessed sensor data The correction of the DNGs is only partal, however. There remains a subtle greenish hue in the corners, although much much less garish than w/o lens profile. This is a nuisance, since non-uniform hues are harder to correct in postprocessing. I find it disappointing to use different M bodies (e.g. M9 & M10) at the same time on the same location and get such highly inconsistent color rendering. Any further firmware improvement by Leica would be very welcome. Edited October 14, 2018 by schattenundlicht", "link": "https://www.l-camera-forum.com/topic/258854-green-cast-in-m9-with-new-firmware-1204/page/3/?tab=comments#comment-3612202", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "conclusion: the elmarit 28 asph is not at fault at all. no need to sell this wonderful lens. the problem stems from the m9 sensor but is corrected in-camera for jpegs if the appropriate lens profile is chosen manually or detected automatically. dngs shot w/o lens profile show the full cyan/green hue, whereas dngs shot with the appropriate lens profile show somewhat corrected color on default in lightroom, even when lens profiles are deactivated in lr. this is a case in point, that „raw“ files are far from being truly unprocessed sensor data the correction of the dngs is only partal, however. there remains a subtle greenish hue in the corners, although much much less garish than w/o lens profile. this is a nuisance, since non-uniform hues are harder to correct in postprocessing. i find it disappointing to use different m bodies (e.g. m9 & m10) at the same time on the same -----> location !!!  and get such highly inconsistent color rendering. any further firmware improvement by leica would be very welcome. edited october 14, 2018 by schattenundlicht", "sortedWord": "None", "identifyer": 34559, "year": "2018"}, {"Unnamed: 0": 373256, "autor": "adan", "date": 1539532260000, "content": "3 hours ago, schattenundlicht said: The Elmarit 28 ASPH is not at fault at all. No need to sell this wonderful lens. ﻿ The problem stems from the M9 sensor but is corrected in-camera for jpegs if the appropriate lens profile is chosen manually or detected automatically. I agree that one should not blame the 28 Elmarit ASPH alone or in particular. But in reality it is a combination of a lens, the short mount distance of the M cameras, and sensor microlens design and IR filtering. Leica could have designed the Elmarit optics to be more like a massive SLR lens, or the Sony Alpha FE 28mm f/2.0 - twice as long, and 10% fatter - and probably eliminated almost all the \"native\" cyan vignetting. But that is not consistent with the scale of a Leica M camera, and in the case of the Elmarit in particular, a lens that was designed to 1) have the \"size and feel,\" and approximate FoV, of a 35mm on 2) the cropped sensor of the M8 (the lens and camera were introduced simultaneously). 15 years ago, Leica was insisting that it was not possible to make a digital M at all, and technical problems like the cyan vignetting are exactly what they knew they would face. Market forces eventually forced them to address the problem, by a Rube-Goldberg combination of 6-bit coding, IR filtering so \"thin\" that it was only 50% effective, a cropped sensor in the first iteration (M8), extensive in-camera processing to correct the remaining vignetting, and so on. https://en.wikipedia.org/wiki/Rube_Goldberg_machine#/media/File:Rube_Goldberg's_\"Self-Operating_Napkin\"_(cropped).gif It helps to remember that the M9 sensor silicon is \"last-millenium\" technology - based on the Kodak CCD architecture for, first, medium-format SLR digital-back sensors (c. 2000), and then cut down for use in the Leica DMR back (2005), and then carried over into the M8 (late 2006), and then \"de-cropped\" for 24x36 in the M9 (2009). The \"new\" M9 sensor changed virtually nothing - except for using a less corrosion-prone cover glass type. 3 hours ago, schattenundlicht said: • This is a case in point, that „raw“ files are far from being truly unprocessed sensor data ﻿ As has been well-known (at least by anyone paying attention) since - oh - about 2003. 3 hours ago, schattenundlicht said: • The correction of the DNGs is only part(i)al, however. Yes, and for a very simple reason. To remove the cyan tint, the red channel is pushed or amplified. On a curved gradient from zero amount in the center to a larger amount (up to 2 stops with an older 21) in the corners. Which means more noise in the red channel. One of the very first things I noticed trying my 21 pre-ASPH on an M9 on the day of introduction (9/9/09) was how many red noise speckles appeared near the edges as the red luminance was cranked up to counteract the cyan tint. Leica does a \"balancing act,\" varying the amount or \"curve\" of correction with the ISO in use. 3 hours ago, schattenundlicht said: • I find it disappointing to use different M bodies (e.g. M9 & M10) at the same ti﻿me on the same location and get such highly inconsistent color rendering. Just a question of perspective. Kodachrome II did not render color the same as original Kodachrome, nor did Kodachrome 25 render color the same as KII. Ektachrome 100 in 2005 (and probably in 2018) rendered color differently than E100 (1980). Velvia 50 renders very differently than Fujichrome 50 RF (1980s) - and \"Velvia\" film simulation in a Fuji digital is not really the same as Velvia itself. Time and technology move on. 3 hours ago, schattenundlicht said: • Any further firmware improvement by Leica would be very welcome. ﻿﻿ For those using the M9, I hope so. However, 9 years and 2 generations on, at some point the M9 becomes \"a finished product.\" Looks like the last M8 firmware update was five years ago - and the M9 is only 3 years newer. Edited October 14, 2018 by adan", "link": "https://www.l-camera-forum.com/topic/258854-green-cast-in-m9-with-new-firmware-1204/page/3/?tab=comments#comment-3612305", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "3 hours ago, schattenundlicht said: the elmarit 28 asph is not at fault at all. no need to sell this wonderful lens. ﻿ the problem stems from the m9 sensor but is corrected in-camera for jpegs if the appropriate lens profile is chosen manually or detected automatically. i agree that one should not blame the 28 elmarit asph alone or in particular. but in reality it is a combination of a lens, the short mount distance of the m cameras, and sensor microlens design and ir filtering. leica could have designed the elmarit optics to be more like a massive slr lens, or the sony alpha fe 28mm f/2.0 - twice as long, and 10% fatter - and probably eliminated almost all the \"native\" cyan vignetting. but that is not consistent with the scale of a leica m camera, and in the case of the elmarit in particular, a lens that was designed to 1) have the \"size and feel,\" and approximate fov, of a 35mm on 2) the cropped sensor of the m8 (the lens and camera were introduced simultaneously). 15 years ago, leica was insisting that it was not possible to make a digital m at all, and technical problems like the cyan vignetting are exactly what they knew they would face. market forces eventually forced them to address the problem, by a rube-goldberg combination of 6-bit coding, ir filtering so \"thin\" that it was only 50% effective, a cropped sensor in the first iteration (m8), extensive in-camera processing to correct the remaining vignetting, and so on. https://en.wikipedia.org/wiki/rube_goldberg_machine#/media/file:rube_goldberg's_\"self-operating_napkin\"_(cropped).gif it helps to remember that the m9 sensor silicon is \"last-millenium\" technology - based on the kodak ccd architecture for, first, medium-format slr digital-back sensors (c. 2000), and then cut down for use in the leica dmr back (2005), and then carried over into the m8 (late 2006), and then \"de-cropped\" for 24x36 in the m9 (2009). the \"new\" m9 sensor changed virtually nothing - except for using a less corrosion-prone cover glass type. 3 hours ago, schattenundlicht said: • this is a case in point, that „raw“ files are far from being truly unprocessed sensor data ﻿ as has been well-known (at least by anyone paying attention) since - oh - about 2003. 3 hours ago, schattenundlicht said: • the correction of the dngs is only part(i)al, however. yes, and for a very simple reason. to remove the cyan tint, the red channel is pushed or amplified. on a curved gradient from zero amount in the center to a larger amount (up to 2 stops with an older 21) in the corners. which means more noise in the red channel. one of the very first things i noticed trying my 21 pre-asph on an m9 on the day of introduction (9/9/09) was how many red noise speckles appeared near the edges as the red luminance was cranked up to counteract the cyan tint. leica does a \"balancing act,\" varying the amount or \"curve\" of correction with the iso in use. 3 hours ago, schattenundlicht said: • i find it disappointing to use different m bodies (e.g. m9 & m10) at the same ti﻿me on the same -----> location !!!  and get such highly inconsistent color rendering. just a question of perspective. kodachrome ii did not render color the same as original kodachrome, nor did kodachrome 25 render color the same as kii. ektachrome 100 in 2005 (and probably in 2018) rendered color differently than e100 (1980). velvia 50 renders very differently than fujichrome 50 rf (1980s) - and \"velvia\" film simulation in a fuji digital is not really the same as velvia itself. time and technology move on. 3 hours ago, schattenundlicht said: • any further firmware improvement by leica would be very welcome. ﻿﻿ for those using the m9, i hope so. however, 9 years and 2 generations on, at some point the m9 becomes \"a finished product.\" looks like the last m8 firmware update was five years ago - and the m9 is only 3 years newer. edited october 14, 2018 by adan", "sortedWord": "None", "identifyer": 34560, "year": "2018"}, {"Unnamed: 0": 374799, "autor": "Graham (G4FUJ)", "date": 1545481620000, "content": "You're in a great location! Few years since I was down that way - still need to go back, again. https://www.nitecore.co.uk/Shop/Products/Chargers/13595-Nitecore-ULM9-Leica-Camera-Charger.html - cheaper than showing on that auction site. Then plug it into a \"decent\" mains USB supply, not a cheap Chinese one. Has the advantage you can use the Nitecore in a car with a 12V adaptor and the possibility of plugging into a computer...", "link": "https://www.l-camera-forum.com/topic/292490-battery-charger/?tab=comments#comment-3651350", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "you're in a great -----> location !!! ! few years since i was down that way - still need to go back, again. https://www.nitecore.co.uk/shop/products/chargers/13595-nitecore-ulm9-leica-camera-charger.html - cheaper than showing on that auction site. then plug it into a \"decent\" mains usb supply, not a cheap chinese one. has the advantage you can use the nitecore in a car with a 12v adaptor and the possibility of plugging into a computer...", "sortedWord": "None", "identifyer": 36105, "year": "2018"}, {"Unnamed: 0": 374843, "autor": "Ko.Fe.", "date": 1545285720000, "content": "5 hours ago, jaapv said: Probably not corroded - just a clean. Maybe it didn't even leave Russia. Sorry, I have to be more precise. Purchased in Russia. But it is in Canada ever since after purchase. It went through Downtown Camera in Toronto for sensor. It was in one of the earlier threads at this sub forum, where you participated. Actively. Or was it on RFF :). But you might be right about Leica cameras in Russia. They say Leica sends sensors for some of them to get sensors replaced at one location in Moscow.", "link": "https://www.l-camera-forum.com/topic/292300-forged-repair-certificate-for-m9/page/2/?tab=comments#comment-3650096", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "5 hours ago, jaapv said: probably not corroded - just a clean. maybe it didn't even leave russia. sorry, i have to be more precise. purchased in russia. but it is in canada ever since after purchase. it went through downtown camera in toronto for sensor. it was in one of the earlier threads at this sub forum, where you participated. actively. or was it on rff :). but you might be right about leica cameras in russia. they say leica sends sensors for some of them to get sensors replaced at one -----> location !!!  in moscow.", "sortedWord": "None", "identifyer": 36149, "year": "2018"}, {"Unnamed: 0": 374983, "autor": "Ko.Fe.", "date": 1516214280000, "content": "Thank you for the report, Jeff. I'm getting emotionally and gear ready to send my M-E to NJ location. It looks like we have two options available in GTA. Send or bring to authorized dealer to send it. I wonder, if I do it via dealer, who is going to receive it back? UPS here will dump the package outside. They did it for professional equipment which cost much more than Leica camera... They lost our company cheque for ten of thousands dollars in 2017. Is it possible just to drive-in to Leica NJ, submit camera and pickup then it is done? I did it with Canon gear in Toronto (Canada) Canon service center. I could make it to NJ and back and visit NYC to take some pictures, with non-Leica camera.", "link": "https://www.l-camera-forum.com/topic/278477-current-sensor-replacement-times/page/3/?tab=comments#comment-3442288", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "thank you for the report, jeff. i'm getting emotionally and gear ready to send my m-e to nj -----> location !!! . it looks like we have two options available in gta. send or bring to authorized dealer to send it. i wonder, if i do it via dealer, who is going to receive it back? ups here will dump the package outside. they did it for professional equipment which cost much more than leica camera... they lost our company cheque for ten of thousands dollars in 2017. is it possible just to drive-in to leica nj, submit camera and pickup then it is done? i did it with canon gear in toronto (canada) canon service center. i could make it to nj and back and visit nyc to take some pictures, with non-leica camera.", "sortedWord": "None", "identifyer": 36290, "year": "2018"}, {"Unnamed: 0": 375016, "autor": "james.liam", "date": 1523925540000, "content": "It was a \"special favor\" to me, JSU. I asked someone from Germany. I have a feeling that not many customers were offered a loaner camera. I have heard that known professionals who use Leica cameras are more likely to get loaners.It came with battery in the camera and a charger. No second battery. I live close enough to the NJ location so I dropped off my Monochrom personally and passingly asked if they had one to loan. They asked no questions and were kind enough to lend it to me for the duration. My several experiences with NJ have been nothing but exemplary.", "link": "https://www.l-camera-forum.com/topic/278477-current-sensor-replacement-times/page/5/?tab=comments#comment-3501670", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "it was a \"special favor\" to me, jsu. i asked someone from germany. i have a feeling that not many customers were offered a loaner camera. i have heard that known professionals who use leica cameras are more likely to get loaners.it came with battery in the camera and a charger. no second battery. i live close enough to the nj -----> location !!!  so i dropped off my monochrom personally and passingly asked if they had one to loan. they asked no questions and were kind enough to lend it to me for the duration. my several experiences with nj have been nothing but exemplary.", "sortedWord": "None", "identifyer": 36323, "year": "2018"}, {"Unnamed: 0": 375018, "autor": "doctorlebel", "date": 1524079740000, "content": " I sent my nearly brand new (less than 100 actuations) Leica M-E to the NJ location in December 2017 after having Leica Germany confirm the sensor showed corrosion. It arrived at Leica N.J. on Dec. 20, 2017 based on an e-mail confirmation from Leica. I contacted Leica NJ this afternoon. It appears they are still working on the backlog of bodies that arrived prior to my camera. It looks like several more weeks before I can expect my M-E to enter the “repair” group. Patience is a virtue.", "link": "https://www.l-camera-forum.com/topic/278477-current-sensor-replacement-times/page/5/?tab=comments#comment-3502693", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " i sent my nearly brand new (less than 100 actuations) leica m-e to the nj -----> location !!!  in december 2017 after having leica germany confirm the sensor showed corrosion. it arrived at leica n.j. on dec. 20, 2017 based on an e-mail confirmation from leica. i contacted leica nj this afternoon. it appears they are still working on the backlog of bodies that arrived prior to my camera. it looks like several more weeks before i can expect my m-e to enter the “repair” group. patience is a virtue.", "sortedWord": "None", "identifyer": 36325, "year": "2018"}, {"Unnamed: 0": 376131, "autor": "james.liam", "date": 1518377820000, "content": " It would seem that this is happening at only one location, Leica Ginza in Tokyo, according to Shoot Tokyo web blog. Anyone hear of this elsewhere in the world? My impression was that the M10 was excluded from this offer.", "link": "https://www.l-camera-forum.com/topic/281729-sensor-failure-m10-upgrade-offering/?tab=comments#comment-3459645", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " it would seem that this is happening at only one -----> location !!! , leica ginza in tokyo, according to shoot tokyo web blog. anyone hear of this elsewhere in the world? my impression was that the m10 was excluded from this offer.", "sortedWord": "None", "identifyer": 37440, "year": "2018"}, {"Unnamed: 0": 376296, "autor": "schattenundlicht", "date": 1526768280000, "content": "I enjoy the fast switch between focal lengths in the field, thus I carry M10 + M9 most of the time. Combo works great for me. Both fit into a convenient Pacsafe hip bag, which is rather nondescript and leaves both hands free. I use the M10 for wide or ultrawide (the latter because of EVF) and the M9 for normal or tele (the latter for better balance). Depending on location and theme, this setup may vary or may be accompanied by a film M or LTM - but three is definitely the maximum number of cameras I carry at a given time --img-- . Even three M‘s do not weigh me down more than my Nikon + battery grip + 24-70, which I still prefer for very rough environmental conditions. My M9 has the new sensor. Before replacement, blue skies were full of wormholes...", "link": "https://www.l-camera-forum.com/topic/284570-a-m9me-as-a-travel-companion-to-my-m10/?tab=comments#comment-3521699", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i enjoy the fast switch between focal lengths in the field, thus i carry m10 + m9 most of the time. combo works great for me. both fit into a convenient pacsafe hip bag, which is rather nondescript and leaves both hands free. i use the m10 for wide or ultrawide (the latter because of evf) and the m9 for normal or tele (the latter for better balance). depending on -----> location !!!  and theme, this setup may vary or may be accompanied by a film m or ltm - but three is definitely the maximum number of cameras i carry at a given time --img-- . even three m‘s do not weigh me down more than my nikon + battery grip + 24-70, which i still prefer for very rough environmental conditions. my m9 has the new sensor. before replacement, blue skies were full of wormholes...", "sortedWord": "None", "identifyer": 37605, "year": "2018"}, {"Unnamed: 0": 376993, "autor": "Susie", "date": 1523097900000, "content": "Hi Guys, Thanks for your input. It will not be in a studio. My partner and I do a fair amount of research using old books and documents at various locations, and so the ability to travel with the kit is a must, hence the use of the VALOO and not a Reprovit 11a (which I also have most of!) although at the National Archives at Kew they have about 50 Kaiser copy stands. I suppose in my head I had the notion of a modern version of the lighting set up Leitz had for the Reprovits, but using modern flash (with radio triggering?) which would compact down into a smallish box for carrying. I suggested the sf 24 ds because they are available for about £140 each off ebay, hence my £300 budget! Also they would fit onto the M9 if I wanted on camera flash for some reason. I notice that soft boxes are available for the small Metz flash units, which would probably come nearer to what I used on Wednesday. On a slightly different tack could I do anything with soft large LED lighting units - or is that an oxymoron? Susie", "link": "https://www.l-camera-forum.com/topic/283464-flash-units-for-m9/?tab=comments#comment-3495776", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "hi guys, thanks for your input. it will not be in a studio. my partner and i do a fair amount of research using old books and documents at various -----> locations !!! , and so the ability to travel with the kit is a must, hence the use of the valoo and not a reprovit 11a (which i also have most of!) although at the national archives at kew they have about 50 kaiser copy stands. i suppose in my head i had the notion of a modern version of the lighting set up leitz had for the reprovits, but using modern flash (with radio triggering?) which would compact down into a smallish box for carrying. i suggested the sf 24 ds because they are available for about £140 each off ebay, hence my £300 budget! also they would fit onto the m9 if i wanted on camera flash for some reason. i notice that soft boxes are available for the small metz flash units, which would probably come nearer to what i used on wednesday. on a slightly different tack could i do anything with soft large led lighting units - or is that an oxymoron? susie", "sortedWord": "None", "identifyer": 38304, "year": "2018"}, {"Unnamed: 0": 377459, "autor": "Peter_S", "date": 1516775400000, "content": " Hi! I left my M9 charger in another location and just got my M9 back from service. I am scratching my head now how to charge to battery while waiting for the charger to arrive. I have an X1 charger here.A while ago I managed to charge a Kodak Pro Back battery with a Canon video camera charger. Now...is X1 --> M9 possible? If so, what to wire where? Any suggestions are welcome, also regarding alternative charger easily obtainable in shops that I can wire to to the M9 battery.Peter", "link": "https://www.l-camera-forum.com/topic/281163-charging-m9-battery-with-x1-charger/?tab=comments#comment-3446933", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " hi! i left my m9 charger in another -----> location !!!  and just got my m9 back from service. i am scratching my head now how to charge to battery while waiting for the charger to arrive. i have an x1 charger here.a while ago i managed to charge a kodak pro back battery with a canon video camera charger. now...is x1 --> m9 possible? if so, what to wire where? any suggestions are welcome, also regarding alternative charger easily obtainable in shops that i can wire to to the m9 battery.peter", "sortedWord": "None", "identifyer": 38771, "year": "2018"}, {"Unnamed: 0": 418292, "autor": "MarkinVan", "date": 1517424420000, "content": "I currently have the Everyday 15\" Messenger and it really good for the short hauls, house to car, road trips etc. Single sling not so good for extended carrying easily shifts, throwing one off balance. I have the 24-90 & 90-280 and can't wait for the 16-35 to complete the kit, should be able to include M240 hopefully and accessories. For that I am thinking the Everyday Backpack 30. Water-resistant for Vancouver and holding 15' laptop for going between our 2 places and road trips, photo trips and hiking to locations. Edited January 31, 2018 by MarkinVan", "link": "https://www.l-camera-forum.com/topic/269692-which-backpack-for-the-sl/page/6/?tab=comments#comment-3452132", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i currently have the everyday 15\" messenger and it really good for the short hauls, house to car, road trips etc. single sling not so good for extended carrying easily shifts, throwing one off balance. i have the 24-90 & 90-280 and can't wait for the 16-35 to complete the kit, should be able to include m240 hopefully and accessories. for that i am thinking the everyday backpack 30. water-resistant for vancouver and holding 15' laptop for going between our 2 places and road trips, photo trips and hiking to -----> locations !!! . edited january 31, 2018 by markinvan", "sortedWord": "None", "identifyer": 31301, "year": "2018"}, {"Unnamed: 0": 421454, "autor": "Michael Hodges", "date": 1527887700000, "content": "Having a dummy battery with AC would be huge. The S has this option as a proper studio camera. I've been trying to use it more for video interviews with the Noctilux but this is the main limiting factor for attempting this in a professional capacity on location for long periods of time. Just as well I guess as it's not really meant for this type of work but I do enjoy doing it when I can.", "link": "https://www.l-camera-forum.com/topic/284996-external-power-for-sl/?tab=comments#comment-3529768", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "having a dummy battery with ac would be huge. the s has this option as a proper studio camera. i've been trying to use it more for video interviews with the noctilux but this is the main limiting factor for attempting this in a professional capacity on -----> location !!!  for long periods of time. just as well i guess as it's not really meant for this type of work but i do enjoy doing it when i can.", "sortedWord": "None", "identifyer": 34484, "year": "2018"}, {"Unnamed: 0": 437911, "autor": "sillbeers15", "date": 1537064040000, "content": "Leica Geosystems also makes surveying equipment. Exactly my point, the size of those PCBAs and the density of SMT components on the board does not show the case for cameras. With battery and sensor occupy a significant footprint in the digital camera interior, it will mean a very dense double sided PCBA. The PCBA process also involves testing after automated components mounting and reflow process, hardly few labor, unless the manufacturing process is patented or differentiated in manufacturing knowhow, it is senseless to have high overheads and labor cost in Europe. Coupled with low volume to atmotise high fixed cost, every business would know how to farm out these low valueadded manufacturing to lower cost locations. The pictures could likely be showing either supplies to other high valueadded non consumer products or it is part of product development process. The following are ballpart production operator monthly labour rates in USD$ from different asia locations: 1 Japan $4000; 2 Singapore $1500; 3 Thailand $400; 4 Indonesia $200. Edited September 16, 2018 by sillbeers15", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/3/?tab=comments#comment-3593830", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "leica geosystems also makes surveying equipment. exactly my point, the size of those pcbas and the density of smt components on the board does not show the case for cameras. with battery and sensor occupy a significant footprint in the digital camera interior, it will mean a very dense double sided pcba. the pcba process also involves testing after automated components mounting and reflow process, hardly few labor, unless the manufacturing process is patented or differentiated in manufacturing knowhow, it is senseless to have high overheads and labor cost in europe. coupled with low volume to atmotise high fixed cost, every business would know how to farm out these low valueadded manufacturing to lower cost -----> locations !!! . the pictures could likely be showing either supplies to other high valueadded non consumer products or it is part of product development process. the following are ballpart production operator monthly labour rates in usd$ from different asia locations: 1 japan $4000; 2 singapore $1500; 3 thailand $400; 4 indonesia $200. edited september 16, 2018 by sillbeers15", "sortedWord": "None", "identifyer": 51152, "year": "2018"}, {"Unnamed: 0": 437977, "autor": "BernardC", "date": 1537549560000, "content": "Besides, why would anyone want to really use M43 lens on full frame sensor camera. The main reason is video. Contrary to what many internet pundits say, a smaller frame size can be an advantage for many video productions. M43 is halfway between Super-16 and Super-35, so it's well within the range of historical cinema gauges. So-called \"full frame\" (Vistavision in cine terms) forces you to stop-down a lot if you want reasonable depth of field to keep your subjects in focus. That means more lights, more budget, and more setup time. You can always try pushing the ISO, but what if your location is already dimly lit, like a restaurant at night? What if that restaurant opens-up to the street? You can make the restaurant brighter, but it's expensive to make the street brighter. That being said, most people who want a m43 adapter seem to be interested in using their existing lenses for still photography. That won't work well. They will need new lenses if they move to any FF system. Such an adapter can be made if the \"brains\" are inside the camera. There are historical examples of adapters that fit inside a mount, like M to L39 (LSM). The SL wouldn't support this adapter, because the SL firmware doesn't know how to control m43 lenses.", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/6/?tab=comments#comment-3597135", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "besides, why would anyone want to really use m43 lens on full frame sensor camera. the main reason is video. contrary to what many internet pundits say, a smaller frame size can be an advantage for many video productions. m43 is halfway between super-16 and super-35, so it's well within the range of historical cinema gauges. so-called \"full frame\" (vistavision in cine terms) forces you to stop-down a lot if you want reasonable depth of field to keep your subjects in focus. that means more lights, more budget, and more setup time. you can always try pushing the iso, but what if your -----> location !!!  is already dimly lit, like a restaurant at night? what if that restaurant opens-up to the street? you can make the restaurant brighter, but it's expensive to make the street brighter. that being said, most people who want a m43 adapter seem to be interested in using their existing lenses for still photography. that won't work well. they will need new lenses if they move to any ff system. such an adapter can be made if the \"brains\" are inside the camera. there are historical examples of adapters that fit inside a mount, like m to l39 (lsm). the sl wouldn't support this adapter, because the sl firmware doesn't know how to control m43 lenses.", "sortedWord": "None", "identifyer": 51218, "year": "2018"}, {"Unnamed: 0": 437980, "autor": "mmradman", "date": 1537550340000, "content": "The main reason is video. Contrary to what many internet pundits say, a smaller frame size can be an advantage for many video productions. M43 is halfway between Super-16 and Super-35, so it's well within the range of historical cinema gauges. So-called \"full frame\" (Vistavision in cine terms) forces you to stop-down a lot if you want reasonable depth of field to keep your subjects in focus. That means more lights, more budget, and more setup time. You can always try pushing the ISO, but what if your location is already dimly lit, like a restaurant at night? What if that restaurant opens-up to the street? You can make the restaurant brighter, but it's expensive to make the street brighter. That being said, most people who want a m43 adapter seem to be interested in using their existing lenses for still photography. That won't work well. They will need new lenses if they move to any FF system. Such an adapter can be made if the \"brains\" are inside the camera. There are historical examples of adapters that fit inside a mount, like M to L39 (LSM). The SL wouldn't support this adapter, because the SL firmware doesn't know how to control m43 lenses. So the video is the answer. Well, good luck to video users, plenty of good M43 cameras around. Ultimately Pansonic should provide the answer, it is them who need to protect legacy. BTW there are manual focus M43 lenses like Voightlander, so lens can be used stopped down.", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/6/?tab=comments#comment-3597142", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "the main reason is video. contrary to what many internet pundits say, a smaller frame size can be an advantage for many video productions. m43 is halfway between super-16 and super-35, so it's well within the range of historical cinema gauges. so-called \"full frame\" (vistavision in cine terms) forces you to stop-down a lot if you want reasonable depth of field to keep your subjects in focus. that means more lights, more budget, and more setup time. you can always try pushing the iso, but what if your -----> location !!!  is already dimly lit, like a restaurant at night? what if that restaurant opens-up to the street? you can make the restaurant brighter, but it's expensive to make the street brighter. that being said, most people who want a m43 adapter seem to be interested in using their existing lenses for still photography. that won't work well. they will need new lenses if they move to any ff system. such an adapter can be made if the \"brains\" are inside the camera. there are historical examples of adapters that fit inside a mount, like m to l39 (lsm). the sl wouldn't support this adapter, because the sl firmware doesn't know how to control m43 lenses. so the video is the answer. well, good luck to video users, plenty of good m43 cameras around. ultimately pansonic should provide the answer, it is them who need to protect legacy. btw there are manual focus m43 lenses like voightlander, so lens can be used stopped down.", "sortedWord": "None", "identifyer": 51221, "year": "2018"}, {"Unnamed: 0": 447556, "autor": "carbon_dragon", "date": 1542470460000, "content": " 12 hours ago, PFM said: Yep, that was the one, Dave. I missed the red flag until after I closed the deal. I wanted to see what shipping outfit he was going to use, and it referenced the package as coming from Switzerland. If I had checked that first, then I'd have known it was a scam. I just thought it was some new seller who couldn't get his descriptions right (no mention of the OVF). The next day when it was posted as shipped, but no information was given, I had that sinking feeling. So far I've received no reply from the e-mail I sent the \"seller\" asking for the shipping information. Looks like I'll be filing a claim soon. Maybe I should just save up for a M10-P instead. PF I saw that one too. This stuff is expensive and I've been lucky to only have gotten cheated once on a very cheap item in the early days of eBay. Even so I feel like eBay is good for checking prices for expensive items, but I probably won't buy on eBay unless I know the seller (like KEH sells on eBay as well). I think I'd rather pay more and get some kind of service after the sale if it's available. The question is how much of a premium to accept. I'm sorry this happened to you though. I look at the feedback and the location of the item. If it's somewhere like the Russian Federation or Nigeria or somewhere remote, I typically pass. If there is no feedback, or not much feedback, I tend to pass, though with small amount of feedback, I look at the seller's other items and go read all the feedback to see if the person might just be a person selling off his own stuff and mostly a buyer or something like that. I also look to see if this is an expensive item, and his previous ones have been just a few cheap items. But none of that is a guarantee. Buying at Tamarkin or KEH or B&H or a reputable dealer is a lot safer (but sometimes more expensive). Not many X's out there in those places right now though. I saw one 113 for $1300 from a reputable dealer but that's a lot -- $680'ish for an X2. I'm wondering whether that low res screen on the X2 (especially as it has no built in viewfinder) might be a hard thing to take for me. Going for the 113 is going for sheer looks in a lot of ways, I really like that brown and chrome. Hey let us know if you file a claim and get satisfaction. I hope it works out.", "link": "https://www.l-camera-forum.com/topic/291442-which-x-to-buy/page/2/?tab=comments#comment-3632632", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " 12 hours ago, pfm said: yep, that was the one, dave. i missed the red flag until after i closed the deal. i wanted to see what shipping outfit he was going to use, and it referenced the package as coming from switzerland. if i had checked that first, then i'd have known it was a scam. i just thought it was some new seller who couldn't get his descriptions right (no mention of the ovf). the next day when it was posted as shipped, but no information was given, i had that sinking feeling. so far i've received no reply from the e-mail i sent the \"seller\" asking for the shipping information. looks like i'll be filing a claim soon. maybe i should just save up for a m10-p instead. pf i saw that one too. this stuff is expensive and i've been lucky to only have gotten cheated once on a very cheap item in the early days of ebay. even so i feel like ebay is good for checking prices for expensive items, but i probably won't buy on ebay unless i know the seller (like keh sells on ebay as well). i think i'd rather pay more and get some kind of service after the sale if it's available. the question is how much of a premium to accept. i'm sorry this happened to you though. i look at the feedback and the -----> location !!!  of the item. if it's somewhere like the russian federation or nigeria or somewhere remote, i typically pass. if there is no feedback, or not much feedback, i tend to pass, though with small amount of feedback, i look at the seller's other items and go read all the feedback to see if the person might just be a person selling off his own stuff and mostly a buyer or something like that. i also look to see if this is an expensive item, and his previous ones have been just a few cheap items. but none of that is a guarantee. buying at tamarkin or keh or b&h or a reputable dealer is a lot safer (but sometimes more expensive). not many x's out there in those places right now though. i saw one 113 for $1300 from a reputable dealer but that's a lot -- $680'ish for an x2. i'm wondering whether that low res screen on the x2 (especially as it has no built in viewfinder) might be a hard thing to take for me. going for the 113 is going for sheer looks in a lot of ways, i really like that brown and chrome. hey let us know if you file a claim and get satisfaction. i hope it works out.", "sortedWord": "None", "identifyer": 11032, "year": "2018"}, {"Unnamed: 0": 447765, "autor": "wda", "date": 1518954780000, "content": "Adam, there is a problem which has never been resolved. It is significant that a new XV has not appeared. I was caught out badly after assuming it was user error and returned the camera to my UK dealer with accompanying evidence. At first he thought there was no problem but agreed to send the camera to Leica in Germany. The service department tested the camera and returned the camera to me declaring the camera performed within specifications. They enclosed a CD with copies of their test results. I felt deflated and disappointed. However, when I examined their test files, a few clearly showed evidence of faulty focusing. So back went the camera to Germany with a statement of my analysis of their test results. Silence! I received a loan camera from my dealer which proved better than mine but still prone to occasional errors. My camera eventually returned with a new processor, but same story. I was then sent a replacement camera which performed a little better. Why do I still have this camera with its occasionally unreliable AF? A good question. Well I have learned to operate it with greater care. It is also highly suitable for a range of horticulture and close-up photography. I routinely check important shots while on location and repeat any suspects where possible. For landscapes, I set focus manually by scale - infinity or nearby. I am less capable judging manual focus on the LCD or through the EVF. With experience I have learned to live with its foibles and appreciate its excellent results over 98% of the time. Reference your portrait picture, such marginal focus displacement is not typical of my experience of AF errors on the XV. With respect, placing a focus spot on a human eye is seriously challenging with the XV. If handheld, slight body movement after seeing the green light is sufficient to displace the focus point as shown in your example. In such a situation, I would shoot a short burst to enhance my prospects of obtaining desired expression and focus. Finally, like many, I hope Leica will release a fixed zoom lens version of the new CL. I do not want another camera system with sensor cleaning issues.", "link": "https://www.l-camera-forum.com/topic/281928-x-vario-mis-focusing/?tab=comments#comment-3463934", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "adam, there is a problem which has never been resolved. it is significant that a new xv has not appeared. i was caught out badly after assuming it was user error and returned the camera to my uk dealer with accompanying evidence. at first he thought there was no problem but agreed to send the camera to leica in germany. the service department tested the camera and returned the camera to me declaring the camera performed within specifications. they enclosed a cd with copies of their test results. i felt deflated and disappointed. however, when i examined their test files, a few clearly showed evidence of faulty focusing. so back went the camera to germany with a statement of my analysis of their test results. silence! i received a loan camera from my dealer which proved better than mine but still prone to occasional errors. my camera eventually returned with a new processor, but same story. i was then sent a replacement camera which performed a little better. why do i still have this camera with its occasionally unreliable af? a good question. well i have learned to operate it with greater care. it is also highly suitable for a range of horticulture and close-up photography. i routinely check important shots while on -----> location !!!  and repeat any suspects where possible. for landscapes, i set focus manually by scale - infinity or nearby. i am less capable judging manual focus on the lcd or through the evf. with experience i have learned to live with its foibles and appreciate its excellent results over 98% of the time. reference your portrait picture, such marginal focus displacement is not typical of my experience of af errors on the xv. with respect, placing a focus spot on a human eye is seriously challenging with the xv. if handheld, slight body movement after seeing the green light is sufficient to displace the focus point as shown in your example. in such a situation, i would shoot a short burst to enhance my prospects of obtaining desired expression and focus. finally, like many, i hope leica will release a fixed zoom lens version of the new cl. i do not want another camera system with sensor cleaning issues.", "sortedWord": "None", "identifyer": 11244, "year": "2018"}], "name": "locationL-Forum2018"}