{"interestingcomments": [{"Unnamed: 0": 383722, "autor": "sean_reid", "date": 1178847420000, "content": "Jef: When I did a long trip on my motorcycle a few years back, the Leica Ms I brought went in a tank bag. The cameras were in a billingham bag and this went into a tank bag wich I put an extra piece of foam into. The Billingham sat on the foam. I think the tank bag is the best option as the tanks on most motorcycles are rubber mounted and have a bit of built in damping. I would avoid putting them in the hard bags or a tail trunk. These not usually rubber mounted and also are closer to the wheel vibration than a tank mounted bag. Robert That's an interesting thought. I know photographers who've cut foam to make their tank bags into custom camera cases. Jeff, it might be good to ride the GS and hold your left hand on the tank when you can to see how much vibration is getting to it (or maybe you can tell with your knees). It might be one of the more isolated parts of the bike although security might be an issue. Some argue that only soft things should go into the tank bag but then the tank itself, bars, instruments, they're all hard too <G> As for the trunk being a bad location Rob...I've been carrying various cameras and lenses in my LT trunk for the past 102,000 miles or so (often within a few miles of your house actually) and the only problem I've ever seen was with that 35 Pancake II (and I'm not even sure if I can blame that on the bike). They've always been in padded cases though and the bike is smooth. Thank goodness for a good suspension because NS still needs to put a few more looneys into repaving. If it were my GS, I'd probably put a Givi trunk or something like that on and build custom foam for the equipment. I don't like to leave camera equipment in anything I can't lock. Cheers, Sean", "link": "https://www.l-camera-forum.com/topic/23730-m8-motorcycles-vibration-resistance/?tab=comments#comment-251810", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "jef: when i did a long trip on my motorcycle a few years back, the leica ms i brought went in a tank bag. the cameras were in a billingham bag and this went into a tank bag wich i put an extra piece of foam into. the billingham sat on the foam. i think the tank bag is the best option as the tanks on most motorcycles are rubber mounted and have a bit of built in damping. i would avoid putting them in the hard bags or a tail trunk. these not usually rubber mounted and also are closer to the wheel vibration than a tank mounted bag. robert that's an interesting thought. i know photographers who've cut foam to make their tank bags into custom camera cases. jeff, it might be good to ride the gs and hold your left hand on the tank when you can to see how much vibration is getting to it (or maybe you can tell with your knees). it might be one of the more isolated parts of the bike although security might be an issue. some argue that only soft things should go into the tank bag but then the tank itself, bars, instruments, they're all hard too <g> as for the trunk being a bad -----> location !!!  rob...i've been carrying various cameras and lenses in my lt trunk for the past 102,000 miles or so (often within a few miles of your house actually) and the only problem i've ever seen was with that 35 pancake ii (and i'm not even sure if i can blame that on the bike). they've always been in padded cases though and the bike is smooth. thank goodness for a good suspension because ns still needs to put a few more looneys into repaving. if it were my gs, i'd probably put a givi trunk or something like that on and build custom foam for the equipment. i don't like to leave camera equipment in anything i can't lock. cheers, sean", "sortedWord": "None", "identifyer": 45123, "year": "2007"}, {"Unnamed: 0": 383724, "autor": "Jager", "date": 1178885760000, "content": "Jeff, it might be good to ride the GS and hold your left hand on the tank when you can to see how much vibration is getting to it (or maybe you can tell with your knees). It might be one of the more isolated parts of the bike although security might be an issue. Sean Over the years I've actually used my hand many times to touch various points of the bike to try and gauge relative vibration levels. I long ago concluded that the gas tank is almost always the smoothest part of a bike - often by a considerable margin. That's why a tank bag is my preferred location for sensitive equipment on any long ride. That does raise potential security issues when off the bike, of course, but I solve those by either taking my camera with me or by taking the whole tank bag. The seat is usually the next smoothest, in my experience - which is why a tail pack strapped to the passenger seat often works well for those who like that sort of thing. I generally don't, much preferring hard luggage. I'd agree with the comments about saddlebags not being ideal locations with respect to vibration isolation. And tail trunks, being suspended high and aft of the rear wheel, are the worst of all. That probably doesn't make much difference in an extremely smooth motorcycle like a (previous generation) K12 or a Goldwing. But those bikes are the exceptions. I wouldn't carry sensitive gear in the tail trunk of most bikes. On day rides, where I don't want to hassle with a tank bag, I'll simply place my A&A bag (with its inherent padding) in the right saddlebag (side away from the exhaust pipe). I remain comfortable with doing that on my K1200RS. But I still have misgivings about doing that on my R1200GS. Mostly, I'm concerned with longer trips, since those are the ones I most would like to record photographically. If the conclusion ended up being that the gas tank is the only viable location, I'd be fine with that since that's a manageable situation. My angst continues around the question of whether even that is acceptable on anything other than the very smoothest motorcycles out there. I dunno. I certainly recognize that some amount of vibration is inherent to much of what we do, often without us even being aware of it. I've carried an M camera to work with me every day for the last several years (previously my M7; now my M8) in a Domke F-803 Satchel. Touch the passenger seat in my Honda Civic, upon which that Domke bag sits, and you can clearly feel a constant, albeit mild, vibration. If I drive my Toyota pickup, that vibrates a bit more. And the metro train which I ride every day has some vibration. But, rightly or wrongly, I've rationalized that all those fall beneath the threshold at which measurable/predictable equipment deterioration would begin. If I flew frequently, I'd worry about that - aircraft frames typically transmit considerable vibration. But I only fly occasionally and so that's not a concern. I'm not particularly worried about the one-time effects from a single trip. If I were contemplating a 3-week cross-country excursion to California, I'd carry my M8 and lenses and wouldn't give it a second thought. I'm not even unduly worried about an entire season of riding. What does worry me are the cumulative effect of subjecting my gear to pervasive vibration over many months and years. I spend a lot of time on motorcycles. The irony is that although I've certainly given this topic a lot of thought over the years - certainly this is not the first time I've ever considered how and where to carry expensive camera gear - this is the first time I've really anguished over it. Gotta love that M8... ;-)", "link": "https://www.l-camera-forum.com/topic/23730-m8-motorcycles-vibration-resistance/?tab=comments#comment-252064", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "jeff, it might be good to ride the gs and hold your left hand on the tank when you can to see how much vibration is getting to it (or maybe you can tell with your knees). it might be one of the more isolated parts of the bike although security might be an issue. sean over the years i've actually used my hand many times to touch various points of the bike to try and gauge relative vibration levels. i long ago concluded that the gas tank is almost always the smoothest part of a bike - often by a considerable margin. that's why a tank bag is my preferred -----> location !!!  for sensitive equipment on any long ride. that does raise potential security issues when off the bike, of course, but i solve those by either taking my camera with me or by taking the whole tank bag. the seat is usually the next smoothest, in my experience - which is why a tail pack strapped to the passenger seat often works well for those who like that sort of thing. i generally don't, much preferring hard luggage. i'd agree with the comments about saddlebags not being ideal locations with respect to vibration isolation. and tail trunks, being suspended high and aft of the rear wheel, are the worst of all. that probably doesn't make much difference in an extremely smooth motorcycle like a (previous generation) k12 or a goldwing. but those bikes are the exceptions. i wouldn't carry sensitive gear in the tail trunk of most bikes. on day rides, where i don't want to hassle with a tank bag, i'll simply place my a&a bag (with its inherent padding) in the right saddlebag (side away from the exhaust pipe). i remain comfortable with doing that on my k1200rs. but i still have misgivings about doing that on my r1200gs. mostly, i'm concerned with longer trips, since those are the ones i most would like to record photographically. if the conclusion ended up being that the gas tank is the only viable location, i'd be fine with that since that's a manageable situation. my angst continues around the question of whether even that is acceptable on anything other than the very smoothest motorcycles out there. i dunno. i certainly recognize that some amount of vibration is inherent to much of what we do, often without us even being aware of it. i've carried an m camera to work with me every day for the last several years (previously my m7; now my m8) in a domke f-803 satchel. touch the passenger seat in my honda civic, upon which that domke bag sits, and you can clearly feel a constant, albeit mild, vibration. if i drive my toyota pickup, that vibrates a bit more. and the metro train which i ride every day has some vibration. but, rightly or wrongly, i've rationalized that all those fall beneath the threshold at which measurable/predictable equipment deterioration would begin. if i flew frequently, i'd worry about that - aircraft frames typically transmit considerable vibration. but i only fly occasionally and so that's not a concern. i'm not particularly worried about the one-time effects from a single trip. if i were contemplating a 3-week cross-country excursion to california, i'd carry my m8 and lenses and wouldn't give it a second thought. i'm not even unduly worried about an entire season of riding. what does worry me are the cumulative effect of subjecting my gear to pervasive vibration over many months and years. i spend a lot of time on motorcycles. the irony is that although i've certainly given this topic a lot of thought over the years - certainly this is not the first time i've ever considered how and where to carry expensive camera gear - this is the first time i've really anguished over it. gotta love that m8... ;-)", "sortedWord": "None", "identifyer": 45125, "year": "2007"}, {"Unnamed: 0": 383725, "autor": "geoffreyg", "date": 1178893920000, "content": "Vibration is, as we all know, a tricky thing. There is measuring it (amplitude, frequency), there is the issue of duration, and finally, resonance. We don't know the resonance for a camera, and in fact, there will be many different ones. It is likely that sometime over a long duration on a bike, somehow it will match up with the bike vibrations. Maybe a wee bit, maybe a lot. But it doesn't take a lot to do some modest and internal damage. People are correct in noting that the resonance on a bike will vary enormously. The bike will vibrate differently at different places, times, and speeds. So too, where the item is located, and its own internal natural frequencies impacts this. One of the issues with cameras on bikes is that there are lots of small bits in a camera, and the bike vibration has a lovely tendency to \"loosen\" up these connections. Which ones, in what way, no one really knows. It depends on the bike, how its mounted, how long, etc. Its probably the case for a short time, vibration from the bike is probably no big deal. We take cameras on planes, cars, etc, but then again, the buzzing on a bike is more directly effective to a camera than it would be on a plane in an overhead compartment. Of course, what do we mean by short? Who knows? One person's 15 minutes is another persons weekly commute. Overall, The safest is to minimize any or all of the connections of the camera to the bike. Break the linkage of the vibration to the camera. Isolation helps here - but it really should be isolated. To do this, carrying the camera on the body is the best place but its not the safest for the body in the event of a crash. The tank bag is probably next best location, but the camera should be wrapped in a couple of different layers of foam (each will stop different vibration frequencies). If teh side bags are rubber mounted, then the same thing might hold true there as well. More layers of packing to make more isolation will help, but the last layer of protection should aim toward isolating or \"floating\" the camera as best as you can from the bike. Imagine the camera as a fine pocketwatch. Pack it accordingly! All in all - a little trip here and there, or even a week long trip carefully packed probably won't do damage. But imagine a mechanical entity on a month long ride - and that vibration will probably do something somewhere. If one could see all the places, and tighten them up, it wouldn't be a worry. But like an old pocket watch, its hard to see what is loosening up. Geoff", "link": "https://www.l-camera-forum.com/topic/23730-m8-motorcycles-vibration-resistance/?tab=comments#comment-252210", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "vibration is, as we all know, a tricky thing. there is measuring it (amplitude, frequency), there is the issue of duration, and finally, resonance. we don't know the resonance for a camera, and in fact, there will be many different ones. it is likely that sometime over a long duration on a bike, somehow it will match up with the bike vibrations. maybe a wee bit, maybe a lot. but it doesn't take a lot to do some modest and internal damage. people are correct in noting that the resonance on a bike will vary enormously. the bike will vibrate differently at different places, times, and speeds. so too, where the item is located, and its own internal natural frequencies impacts this. one of the issues with cameras on bikes is that there are lots of small bits in a camera, and the bike vibration has a lovely tendency to \"loosen\" up these connections. which ones, in what way, no one really knows. it depends on the bike, how its mounted, how long, etc. its probably the case for a short time, vibration from the bike is probably no big deal. we take cameras on planes, cars, etc, but then again, the buzzing on a bike is more directly effective to a camera than it would be on a plane in an overhead compartment. of course, what do we mean by short? who knows? one person's 15 minutes is another persons weekly commute. overall, the safest is to minimize any or all of the connections of the camera to the bike. break the linkage of the vibration to the camera. isolation helps here - but it really should be isolated. to do this, carrying the camera on the body is the best place but its not the safest for the body in the event of a crash. the tank bag is probably next best -----> location !!! , but the camera should be wrapped in a couple of different layers of foam (each will stop different vibration frequencies). if teh side bags are rubber mounted, then the same thing might hold true there as well. more layers of packing to make more isolation will help, but the last layer of protection should aim toward isolating or \"floating\" the camera as best as you can from the bike. imagine the camera as a fine pocketwatch. pack it accordingly! all in all - a little trip here and there, or even a week long trip carefully packed probably won't do damage. but imagine a mechanical entity on a month long ride - and that vibration will probably do something somewhere. if one could see all the places, and tighten them up, it wouldn't be a worry. but like an old pocket watch, its hard to see what is loosening up. geoff", "sortedWord": "None", "identifyer": 45126, "year": "2007"}, {"Unnamed: 0": 383875, "autor": "marknorton", "date": 1176160560000, "content": "Turning our attention to the other side of the clam-shell, this is what we see. --img--  So, from the left: - The battery case with the two flying red/black wires to supply power to the back of the camera - The sensor board which is actually the aluminium plate secured in three locations – look for the green locking lacquer, top left, top right, bottom centre. - The sensor circuit board is soldered directly on the back of the sensor which is mounted on the aluminium plate, apparently using epoxy. The flex print at the bottom connects to the DSP board on the back of the camera. - To the right, there is the shutter/motor-wind controller which is run under control from the M16C processor, removed in this picture. Here’s a close up of the battery connections. --img--  The red/black wires feed the DSP board and power is fed to the M16C processor through the flex print – check out the wide connections which make use of more than one contact on the connector. Interestingly, all the brass contacts from the battery holder apparently make it through to the microprocessor for monitoring purposes, even though the current battery doesn’t use them all. This may allow for different batteries in the future. Here’s a close-up of the Sensor Board. --img--  This was the board that was supposedly replaced by the hardware recall and we understood at the time that the sensor was not being replaced. However, the sensor is soldered to this board, you can see the rows of soldered connections (4 * 15 pins), so it’s not clear exactly what was done. This is a later camera and did not need to the hardware recall. If I was to open my M8 which did go back (which I’m not about to do, one M8 in bits is enough), I might find some more specific information on what was done. In any event, this is the electronics which interfaces to and drives the sensor. Look at the board and you can see a certain symmetry which matches the dual output architecture. Look also here at the bottom fixing. You can see the shims which fit underneath to precisely position the sensor relative to the lens mount. Because the sensor is mounted at three points (like a tripod), it can be adjusted to be square to the lens axis in all directions by fitting shims of different thicknesses under each mounting point. When I removed the sensor, I was very careful to keep the shims from each mounting point separate so that when I put the camera back together again, the sensor alignment will not be disturbed. Leica does this very precisely. The thinnest shim of any there is 0.01mm. I’ve measured the thickness of the shims and they are as follows: Left: 0.61mm Right: 0.49mm Bottom: 0.34mm So, deep breath, remove the sensor. --img--  With the sensor removed, you can see the back of the shutter: --img-- ", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/?tab=comments#comment-224266", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "turning our attention to the other side of the clam-shell, this is what we see. --img--  so, from the left: - the battery case with the two flying red/black wires to supply power to the back of the camera - the sensor board which is actually the aluminium plate secured in three -----> locations !!!  – look for the green locking lacquer, top left, top right, bottom centre. - the sensor circuit board is soldered directly on the back of the sensor which is mounted on the aluminium plate, apparently using epoxy. the flex print at the bottom connects to the dsp board on the back of the camera. - to the right, there is the shutter/motor-wind controller which is run under control from the m16c processor, removed in this picture. here’s a close up of the battery connections. --img--  the red/black wires feed the dsp board and power is fed to the m16c processor through the flex print – check out the wide connections which make use of more than one contact on the connector. interestingly, all the brass contacts from the battery holder apparently make it through to the microprocessor for monitoring purposes, even though the current battery doesn’t use them all. this may allow for different batteries in the future. here’s a close-up of the sensor board. --img--  this was the board that was supposedly replaced by the hardware recall and we understood at the time that the sensor was not being replaced. however, the sensor is soldered to this board, you can see the rows of soldered connections (4 * 15 pins), so it’s not clear exactly what was done. this is a later camera and did not need to the hardware recall. if i was to open my m8 which did go back (which i’m not about to do, one m8 in bits is enough), i might find some more specific information on what was done. in any event, this is the electronics which interfaces to and drives the sensor. look at the board and you can see a certain symmetry which matches the dual output architecture. look also here at the bottom fixing. you can see the shims which fit underneath to precisely position the sensor relative to the lens mount. because the sensor is mounted at three points (like a tripod), it can be adjusted to be square to the lens axis in all directions by fitting shims of different thicknesses under each mounting point. when i removed the sensor, i was very careful to keep the shims from each mounting point separate so that when i put the camera back together again, the sensor alignment will not be disturbed. leica does this very precisely. the thinnest shim of any there is 0.01mm. i’ve measured the thickness of the shims and they are as follows: left: 0.61mm right: 0.49mm bottom: 0.34mm so, deep breath, remove the sensor. --img--  with the sensor removed, you can see the back of the shutter: --img-- ", "sortedWord": "None", "identifyer": 45277, "year": "2007"}, {"Unnamed: 0": 383896, "autor": "gravastar", "date": 1176163860000, "content": "Well, it looks as if we got our money's worth --img--  , there's a lot of engineering in that product! I wonder if any location other than Solms will ever be able to service them. Mark from the work you've done have you been able to acertain why there seemed to be such a high impedance between various parts of the body shell components? If I remember correctly some time ago you measured about 100 Ohms between some items. Bob.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/2/?tab=comments#comment-224305", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "well, it looks as if we got our money's worth --img--  , there's a lot of engineering in that product! i wonder if any -----> location !!!  other than solms will ever be able to service them. mark from the work you've done have you been able to acertain why there seemed to be such a high impedance between various parts of the body shell components? if i remember correctly some time ago you measured about 100 ohms between some items. bob.", "sortedWord": "None", "identifyer": 45298, "year": "2007"}, {"Unnamed: 0": 383930, "autor": "marknorton", "date": 1176181020000, "content": "Well, it looks as if we got our money's worth --img--  , there's a lot of engineering in that product! I wonder if any location other than Solms will ever be able to service them. Mark from the work you've done have you been able to acertain why there seemed to be such a high impedance between various parts of the body shell components? If I remember correctly some time ago you measured about 100 Ohms between some items. Bob. Bob, I think it's simply down to the painted castings. I can see a few places where they have scraped paint away to make a good connection. Ideally the painting process would leave the \"lands\" they require unpainted.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/3/?tab=comments#comment-224399", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "well, it looks as if we got our money's worth --img--  , there's a lot of engineering in that product! i wonder if any -----> location !!!  other than solms will ever be able to service them. mark from the work you've done have you been able to acertain why there seemed to be such a high impedance between various parts of the body shell components? if i remember correctly some time ago you measured about 100 ohms between some items. bob. bob, i think it's simply down to the painted castings. i can see a few places where they have scraped paint away to make a good connection. ideally the painting process would leave the \"lands\" they require unpainted.", "sortedWord": "None", "identifyer": 45332, "year": "2007"}, {"Unnamed: 0": 384097, "autor": "barjohn", "date": 1177786740000, "content": " Mark, I dare say you are being too modest. I seriously doubt that very many people could have provided as much insight into what each circuit board, chip or component did from mere observation without a significant amount of engineering knowledge (software & hardware). As to whether you revealed or did not reveal any Leica IP would be hard to know withut knowing what Leica considers there IP to be. A quick look at their code told me which processors were used but not to the detail revealed y your dissassembly and comments. Was that a Leica secret? I don't know. If you buy an author's book and write explanatory notes in the margins have you violated the author's copyright? I don't think anyone would think so. (Legally, I know you wouldn't have). Adding functionality to Leica's code is no different. You are not depriving Leica of revenue as it is useless unless you own a Leica camera and have already paid for the use of the IP. While I can't speak to UK law, Leica has protected there IP in one of several ways, copyright, patent or trade secret. The first two are legal protections and the latter is considered fair game to reverse engineering in the USA. It is not fair to be given access to the IP and then disclosing it. If the IP is patented it must be disclosed so you would not be violating their IP and copyright by its very nature is a disclosed thing, music, pictures, books, software, etc. If what you are saying is that you may have discovered some of their trade secrets and you choose not to disclose them, that is of course your perogative but it is a personal decision to which I place no moral value. In any case, I don't believe my question as to your knowledge of the location for the SDK tools for commercially available processors was asking you to violate any IP at all.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/12/?tab=comments#comment-240959", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " mark, i dare say you are being too modest. i seriously doubt that very many people could have provided as much insight into what each circuit board, chip or component did from mere observation without a significant amount of engineering knowledge (software & hardware). as to whether you revealed or did not reveal any leica ip would be hard to know withut knowing what leica considers there ip to be. a quick look at their code told me which processors were used but not to the detail revealed y your dissassembly and comments. was that a leica secret? i don't know. if you buy an author's book and write explanatory notes in the margins have you violated the author's copyright? i don't think anyone would think so. (legally, i know you wouldn't have). adding functionality to leica's code is no different. you are not depriving leica of revenue as it is useless unless you own a leica camera and have already paid for the use of the ip. while i can't speak to uk law, leica has protected there ip in one of several ways, copyright, patent or trade secret. the first two are legal protections and the latter is considered fair game to reverse engineering in the usa. it is not fair to be given access to the ip and then disclosing it. if the ip is patented it must be disclosed so you would not be violating their ip and copyright by its very nature is a disclosed thing, music, pictures, books, software, etc. if what you are saying is that you may have discovered some of their trade secrets and you choose not to disclose them, that is of course your perogative but it is a personal decision to which i place no moral value. in any case, i don't believe my question as to your knowledge of the -----> location !!!  for the sdk tools for commercially available processors was asking you to violate any ip at all.", "sortedWord": "None", "identifyer": 45499, "year": "2007"}], "name": "locationL-Forum2007"}