{"interestingcomments": [{"Unnamed: 0": 383544, "autor": "Michael Tyler", "date": 1214869620000, "content": "Michael, great photo!! Thanks, she was the one who made the photo nice. Wonderful client, beautiful location. The background was busy, and this is one of those lenses that so easily yanks away everything in the frame except the subject on which you're focusing, like the Nocti and the 75 Lux. Others can do it too, but these three are the best for it from everything I've seen.", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/2/?tab=comments#comment-593199", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "michael, great photo!! thanks, she was the one who made the photo nice. wonderful client, beautiful -----> location !!! . the background was busy, and this is one of those lenses that so easily yanks away everything in the frame except the subject on which you're focusing, like the nocti and the 75 lux. others can do it too, but these three are the best for it from everything i've seen.", "sortedWord": "None", "identifyer": 44944, "year": "2008"}, {"Unnamed: 0": 383604, "autor": "Riccis", "date": 1215485100000, "content": "Since I am not a telephoto guy (and really don't use anything over 75 mm), I never cared about filling the frame with the bride and dad as they are walking towards the isle. Instead, I'd rather fill the frame with whatever elements I have at my disposal that helps me tell a better story (usually these elements are some of the reasons why the couple wanted to have their wedding at a certain location)... --img-- ", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/5/?tab=comments#comment-598875", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "since i am not a telephoto guy (and really don't use anything over 75 mm), i never cared about filling the frame with the bride and dad as they are walking towards the isle. instead, i'd rather fill the frame with whatever elements i have at my disposal that helps me tell a better story (usually these elements are some of the reasons why the couple wanted to have their wedding at a certain -----> location !!! )... --img-- ", "sortedWord": "None", "identifyer": 45004, "year": "2008"}], "name": "locationL-Forum2008"}