{"interestingcomments": [{"Unnamed: 0": 379772, "autor": "Clook", "date": 1275645780000, "content": "Hi Cris, I've owned a 28 Biogon now for almost a year. I have two bodies, an M8 and M8.2. I have the Biogon permanently fixed to the 8.2 and have used it exclusively for a photo-documentary project. I obviously cannot give you the comparison you need as my other lens is a 50mm Summarit which I use for portraits. The Biogon has delivered terrific results even when used in 'point & shoot' mode where I set the aperture to f8 and set the focus back from infinity to the f8 mark ( hyperfocal). Great dof. The documentary project is being put on display in two locations in Belfast next month and I have printed the images to 20 by 16 with amazing clarity. I run a business and have a budget and got the 'gear freak' thing out of my system years ago. This lens just works. I've no doubt that a Leica lens would be better but the Biogon has done a terrific job for me. Belfast, The Steady Generation", "link": "https://www.l-camera-forum.com/topic/122841-leica-elmarit-28-or-zeiss-28-biogon/?tab=comments#comment-1343132", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "hi cris, i've owned a 28 biogon now for almost a year. i have two bodies, an m8 and m8.2. i have the biogon permanently fixed to the 8.2 and have used it exclusively for a photo-documentary project. i obviously cannot give you the comparison you need as my other lens is a 50mm summarit which i use for portraits. the biogon has delivered terrific results even when used in 'point & shoot' mode where i set the aperture to f8 and set the focus back from infinity to the f8 mark ( hyperfocal). great dof. the documentary project is being put on display in two -----> locations !!!  in belfast next month and i have printed the images to 20 by 16 with amazing clarity. i run a business and have a budget and got the 'gear freak' thing out of my system years ago. this lens just works. i've no doubt that a leica lens would be better but the biogon has done a terrific job for me. belfast, the steady generation", "sortedWord": "None", "identifyer": 41160, "year": "2010"}, {"Unnamed: 0": 382940, "autor": "pklein", "date": 1286388780000, "content": "The following is reasonably informed speculation, not based on extensive testing, so take it for what it's worth. There seem to be two problems people report with non-Leica batteries: 1. The battery doesn't last as long \"per\" charge than the original 2. The batteries fail out of box or after a few charge cycles. #2 is just a matter of industrial QC being what it is. So it makes sense to buy from someone who will quickly give you a replacement if that happens. Now, let's take a closer look at #1. The M8 and M9 take a 3.7 volt battery. The current \"cheap eBay batteries\" seem to be of two ratings, 1700 mAh and 1900 mAh, and there used to be a 1400 mAH battery available. The \"official\" Leica battery is either 1800 or 1900 mAh, depending on who you believe. (mAh is Milliampere hours, the amount of charge the battery can hold). It makes sense to get something that equals or exceeds the specs of the original Leica battery, otherwise you won't get as many shots per charge. And if the battery's \"discharge curve\" is such that the voltage drops more quickly than the original to the point where the camera thinks it's discharged, you may get even less shots than the battery's rating would suggest. I think the above is what has happened to many people who bought 1400 and 1700 mAh batteries from Hong Kong eBay sellers. As we might expect, they didn't last as long per charge on the M8 and M9. But I've only heard good things about the 1900 mAh battery. The 1900 mAh battery has a white label with blue lettering. I've seen what appears to be the same batteries offered by the Hong Kong eBay sellers for anywhere from about $17 to $30. I think Empire Scientific simply imports it. So I decided to order a couple of the 1900 mAH batteries just a couple of days ago (I don't have them yet). Empire Scientific is a wholesaler, you can't buy direct from them. They recommended budgetbatteries.com, so that's where I ordered them. Budget Batteries had them in stock for $52.37. Another supplier I called advertised them for $44.00, but \"would have to order them.\" If you have time to deal with international shipping times and possible returns, it makes sense to buy several batteries from Hong Kong. If one doesn't hold a charge, you're still ahead. I decided to deal with a U.S. supplier, as I'm going on a trip soon, so any long delays in getting a replacement could impact my photography. Several U.S. online dealers stock what appears to be the same 1900 mAh battery, at prices ranging from $44 to $60. Considering that the Leica battery costs 2x-4x those prices, it's still a good deal. If you think the original Leica battery is immune to out-of-box failure, think again. I've heard several reports of Leica batteries failing after a few cycles. All the batteries probably come from the same few factories at some \"undisclosed location\" in Asia anyway. --Peter Edited October 6, 2010 by pklein", "link": "https://www.l-camera-forum.com/topic/133135-i-think-i-found-a-good-m8-battery-alternative/?tab=comments#comment-1463927", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "the following is reasonably informed speculation, not based on extensive testing, so take it for what it's worth. there seem to be two problems people report with non-leica batteries: 1. the battery doesn't last as long \"per\" charge than the original 2. the batteries fail out of box or after a few charge cycles. #2 is just a matter of industrial qc being what it is. so it makes sense to buy from someone who will quickly give you a replacement if that happens. now, let's take a closer look at #1. the m8 and m9 take a 3.7 volt battery. the current \"cheap ebay batteries\" seem to be of two ratings, 1700 mah and 1900 mah, and there used to be a 1400 mah battery available. the \"official\" leica battery is either 1800 or 1900 mah, depending on who you believe. (mah is milliampere hours, the amount of charge the battery can hold). it makes sense to get something that equals or exceeds the specs of the original leica battery, otherwise you won't get as many shots per charge. and if the battery's \"discharge curve\" is such that the voltage drops more quickly than the original to the point where the camera thinks it's discharged, you may get even less shots than the battery's rating would suggest. i think the above is what has happened to many people who bought 1400 and 1700 mah batteries from hong kong ebay sellers. as we might expect, they didn't last as long per charge on the m8 and m9. but i've only heard good things about the 1900 mah battery. the 1900 mah battery has a white label with blue lettering. i've seen what appears to be the same batteries offered by the hong kong ebay sellers for anywhere from about $17 to $30. i think empire scientific simply imports it. so i decided to order a couple of the 1900 mah batteries just a couple of days ago (i don't have them yet). empire scientific is a wholesaler, you can't buy direct from them. they recommended budgetbatteries.com, so that's where i ordered them. budget batteries had them in stock for $52.37. another supplier i called advertised them for $44.00, but \"would have to order them.\" if you have time to deal with international shipping times and possible returns, it makes sense to buy several batteries from hong kong. if one doesn't hold a charge, you're still ahead. i decided to deal with a u.s. supplier, as i'm going on a trip soon, so any long delays in getting a replacement could impact my photography. several u.s. online dealers stock what appears to be the same 1900 mah battery, at prices ranging from $44 to $60. considering that the leica battery costs 2x-4x those prices, it's still a good deal. if you think the original leica battery is immune to out-of-box failure, think again. i've heard several reports of leica batteries failing after a few cycles. all the batteries probably come from the same few factories at some \"undisclosed -----> location !!! \" in asia anyway. --peter edited october 6, 2010 by pklein", "sortedWord": "None", "identifyer": 44340, "year": "2010"}, {"Unnamed: 0": 383696, "autor": "ndjambrose", "date": 1275924360000, "content": "Alexander, I like these a lot. Very nice work. What was the story behind getting the bride + groom to the location?", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/10/?tab=comments#comment-1345684", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "alexander, i like these a lot. very nice work. what was the story behind getting the bride + groom to the -----> location !!! ?", "sortedWord": "None", "identifyer": 45097, "year": "2010"}, {"Unnamed: 0": 446283, "autor": "h00ligan", "date": 1287455340000, "content": " I had a very small amount of time to go out practicing tonight. Here's one of the shots. Not the best location, but at the end of the day I'm not unhappy with it. It will also give me a chance to work on removing some elements. The x1 doesn't seem to have trouble with reds as much as a lot of other cameras. --img-- ", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/8/?tab=comments#comment-1476183", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " i had a very small amount of time to go out practicing tonight. here's one of the shots. not the best -----> location !!! , but at the end of the day i'm not unhappy with it. it will also give me a chance to work on removing some elements. the x1 doesn't seem to have trouble with reds as much as a lot of other cameras. --img-- ", "sortedWord": "None", "identifyer": 9718, "year": "2010"}, {"Unnamed: 0": 446344, "autor": "DwF", "date": 1291931160000, "content": " Hey Sparth, Welcome to the X1 and the forum. I looked at your first shot and said...wait! that's got to be Seattle and then saw your location --img--  David", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/11/?tab=comments#comment-1526466", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " hey sparth, welcome to the x1 and the forum. i looked at your first shot and said...wait! that's got to be seattle and then saw your -----> location !!!  --img--  david", "sortedWord": "None", "identifyer": 9784, "year": "2010"}], "name": "locationL-Forum2010"}