{"interestingcomments": [{"Unnamed: 0": 371469, "autor": "Lindolfi", "date": 1351336920000, "content": "With the need of more experimental evidence in this thread, I have made another set of exposures of a MacBeth color card with the settings of 160 and 1250 ISO and at equal exposure, but now in daylight (6500 Kelvin) instead of the former tests in Tungsten light (2800 Kelvin) and at shorter exposure times (1/60 and f5/6). This time there is no statistical difference anymore between the 3 stops pushed 160 ISO and 1250 ISO exposures for all color patches of the MacBeth card in standard deviation of the luminance. Most likely the different result of the tests comes from the longer exposure times and/or the low blue light contribution in the 2800 Kelvin exposures. Also I have tested 0 sharpening and 0 noise reduction settings when loaded in LightRoom and that still does not show a difference between pushed 160 and 1250 ISO. So there is no support for the statement that pushing is better, nor inferior compared to conventional use of higher ISO in these conditions. Also image quality is very much the same. So what it boils down to is that it is your choice of in camera signal amplification from your ISO setting or post processing by pushing in LightRoom development: it makes no difference, with the exception that you can blow out highlights with the former method and not with the latter. Advantage of the former method is that you have an easier review of exposure on location from the histogram on the LCD. If required I can post a link to the DNG files of the MacBeth exposures.", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/12/?tab=comments#comment-2152006", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "with the need of more experimental evidence in this thread, i have made another set of exposures of a macbeth color card with the settings of 160 and 1250 iso and at equal exposure, but now in daylight (6500 kelvin) instead of the former tests in tungsten light (2800 kelvin) and at shorter exposure times (1/60 and f5/6). this time there is no statistical difference anymore between the 3 stops pushed 160 iso and 1250 iso exposures for all color patches of the macbeth card in standard deviation of the luminance. most likely the different result of the tests comes from the longer exposure times and/or the low blue light contribution in the 2800 kelvin exposures. also i have tested 0 sharpening and 0 noise reduction settings when loaded in lightroom and that still does not show a difference between pushed 160 and 1250 iso. so there is no support for the statement that pushing is better, nor inferior compared to conventional use of higher iso in these conditions. also image quality is very much the same. so what it boils down to is that it is your choice of in camera signal amplification from your iso setting or post processing by pushing in lightroom development: it makes no difference, with the exception that you can blow out highlights with the former method and not with the latter. advantage of the former method is that you have an easier review of exposure on -----> location !!!  from the histogram on the lcd. if required i can post a link to the dng files of the macbeth exposures.", "sortedWord": "None", "identifyer": 32770, "year": "2012"}, {"Unnamed: 0": 371480, "autor": "Jaybob", "date": 1351343880000, "content": "There have been several examples in this thread alone showing the M9 results pushed in the LR4 converter being superior. It could simply be that Adobe's noise reduction is currently better than Leica's in-camera attempt. If you're a \"get it right in the camera\" shooter, then ETTR doesn't make sense, either, because you likely have to pull exposure back in the converter. ....another set of exposures of a MacBeth color card with the settings of 160 and 1250 ISO and at equal exposure, but now in daylight (6500 Kelvin) instead of the former tests in Tungsten light (2800 Kelvin) and at shorter exposure times (1/60 and f5/6). This time there is no statistical difference anymore between the 3 stops pushed 160 ISO and 1250 ISO exposures for all color patches of the MacBeth card in standard deviation of the luminance. So there is no support for the statement that pushing is better, nor inferior compared to conventional use of higher ISO in these conditions. Also image quality is very much the same. So what it boils down to is that it is your choice of in camera signal amplification from your ISO setting or post processing by pushing in LightRoom development: it makes no difference, with the exception that you can blow out highlights with the former method and not with the latter. Advantage of the former method is that you have an easier review of exposure on location from the histogram on the LCD. The one M9 example , where the \"numbers dont lie\", has shown one underexposure to be marginally better on a set of uncompressed DNGs. The other examples have hardly shown superiority, in fact they have shown almost no noticable difference. A million times more than more than ISO, Noise reduction doesn't have anything at all to do with exposure, at least in this discussion. Proper (I mean dead on) Color balance has more to do with exposure than anything. Lightroom Noise reduction is applied by the user moving the sliders, not \"behind the scenes\", unless your import settings apply Contrast or Color Noise reduction as the default setting, (they do!). They also can apply brightnesss and contrast, or a lot of other things... My understanding of behind the scenes In camera noise reduction was it was only on JPGs, regardless, it has always in the OFF position on my cameras. I consider mysyself a \"get it how I want it, AND give me options later...\" RAW shooter in camera, using the histogram in a way that is close to what I need, AND is still going to help me the most later. Having those higher registers of the histogram more populated with information, makes a LOT more sense to me. Edited October 27, 2012 by Jaybob", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/12/?tab=comments#comment-2152085", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "there have been several examples in this thread alone showing the m9 results pushed in the lr4 converter being superior. it could simply be that adobe's noise reduction is currently better than leica's in-camera attempt. if you're a \"get it right in the camera\" shooter, then ettr doesn't make sense, either, because you likely have to pull exposure back in the converter. ....another set of exposures of a macbeth color card with the settings of 160 and 1250 iso and at equal exposure, but now in daylight (6500 kelvin) instead of the former tests in tungsten light (2800 kelvin) and at shorter exposure times (1/60 and f5/6). this time there is no statistical difference anymore between the 3 stops pushed 160 iso and 1250 iso exposures for all color patches of the macbeth card in standard deviation of the luminance. so there is no support for the statement that pushing is better, nor inferior compared to conventional use of higher iso in these conditions. also image quality is very much the same. so what it boils down to is that it is your choice of in camera signal amplification from your iso setting or post processing by pushing in lightroom development: it makes no difference, with the exception that you can blow out highlights with the former method and not with the latter. advantage of the former method is that you have an easier review of exposure on -----> location !!!  from the histogram on the lcd. the one m9 example , where the \"numbers dont lie\", has shown one underexposure to be marginally better on a set of uncompressed dngs. the other examples have hardly shown superiority, in fact they have shown almost no noticable difference. a million times more than more than iso, noise reduction doesn't have anything at all to do with exposure, at least in this discussion. proper (i mean dead on) color balance has more to do with exposure than anything. lightroom noise reduction is applied by the user moving the sliders, not \"behind the scenes\", unless your import settings apply contrast or color noise reduction as the default setting, (they do!). they also can apply brightnesss and contrast, or a lot of other things... my understanding of behind the scenes in camera noise reduction was it was only on jpgs, regardless, it has always in the off position on my cameras. i consider mysyself a \"get it how i want it, and give me options later...\" raw shooter in camera, using the histogram in a way that is close to what i need, and is still going to help me the most later. having those higher registers of the histogram more populated with information, makes a lot more sense to me. edited october 27, 2012 by jaybob", "sortedWord": "None", "identifyer": 32781, "year": "2012"}, {"Unnamed: 0": 377568, "autor": "msap7222", "date": 1328081400000, "content": "I am located in Australia but travel worldwide for assignments several times a year and interstate quite frequently. I have 2 OEM LEICA Batteries and 8 Aftermarket Leica M8 Batteries which I reckon are about 80% charge capacity and performance of OEM (they were only about $20 each - makes them almost disposable!) New OEM Leica Batteries here are $200 each! If I am travelling somewhere remote, I pre-charge ALL 10 batteries. I do take both the M8 Brick Charger and the slimmer M9 charger with Car Adapters, so I am assuming that I may not have electricity AT ALL in some of the remote locations I work. The 10 pre-charged batteries get me through a few days serious shooting without the need to re-charge. The aftermarket batteries are not fantastic, but certainly good enough as backup until I get to the next place with power (hotel room) BTW, can I ask again (prev. post) - does anybody now what the fuse rating for the M9 **CAR LIGHTER SOCKET ADAPTER ** is? I asked both the retailer AND the Authorised Repairer here and neither could tell me. Sadly, I lost this fuse when I blew it a couple months ago. Thanks In Advance", "link": "https://www.l-camera-forum.com/topic/151529-m9-battery-charger-dead/page/2/?tab=comments#comment-1914723", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i am located in australia but travel worldwide for assignments several times a year and interstate quite frequently. i have 2 oem leica batteries and 8 aftermarket leica m8 batteries which i reckon are about 80% charge capacity and performance of oem (they were only about $20 each - makes them almost disposable!) new oem leica batteries here are $200 each! if i am travelling somewhere remote, i pre-charge all 10 batteries. i do take both the m8 brick charger and the slimmer m9 charger with car adapters, so i am assuming that i may not have electricity at all in some of the remote -----> locations !!!  i work. the 10 pre-charged batteries get me through a few days serious shooting without the need to re-charge. the aftermarket batteries are not fantastic, but certainly good enough as backup until i get to the next place with power (hotel room) btw, can i ask again (prev. post) - does anybody now what the fuse rating for the m9 **car lighter socket adapter ** is? i asked both the retailer and the authorised repairer here and neither could tell me. sadly, i lost this fuse when i blew it a couple months ago. thanks in advance", "sortedWord": "None", "identifyer": 38880, "year": "2012"}, {"Unnamed: 0": 385088, "autor": "pico", "date": 1346259660000, "content": "So if your Yaris breaks down and cannot be repaired for some reason Toyota owes you a Lexus for free? Of course, such overstatement must be jest. It is certainly not pertinent to this discussion. For what it is worth, some years ago we had a case in Toyota where the V6 experienced a sudden and complete loss of oil due to a failed main oil line. There was a certain location on the assembly line for a brief time when the wrong fitting was used. It effected only about 400 cars. Toyota replaced the engines for each customer right away. Free, of course. Why should Leica not offer the same? Edited August 29, 2012 by pico", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/3/?tab=comments#comment-2099253", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "so if your yaris breaks down and cannot be repaired for some reason toyota owes you a lexus for free? of course, such overstatement must be jest. it is certainly not pertinent to this discussion. for what it is worth, some years ago we had a case in toyota where the v6 experienced a sudden and complete loss of oil due to a failed main oil line. there was a certain -----> location !!!  on the assembly line for a brief time when the wrong fitting was used. it effected only about 400 cars. toyota replaced the engines for each customer right away. free, of course. why should leica not offer the same? edited august 29, 2012 by pico", "sortedWord": "None", "identifyer": 46492, "year": "2012"}, {"Unnamed: 0": 385090, "autor": "jaapv", "date": 1346260080000, "content": "Certainly - a not quite serious hyperbole. But I cannot find a 3000-4000 $ discount ungenerous. And you do get a considerably newer and better camera, which cannot be a freebie. Maybe Leica should offer a buyback - Used M8 price, sometimes minus repair cost. Between 500 and 2000 $. What are you going to say to that? Of course, such overstatement must be jest. It is certainly not pertinent to this discussion. For what it is worth, some years ago we had a case in Toyota where the V6 experienced a sudden and complete loss of oil due to a failed main oil line. There was a certain location on the assembly line for a brief time when the wrong fitting was used. It effected only about 400 cars. Toyota replaced the engines for each customer right away. Free, of course. Why should Leica not offer the same? And you know the Lexus is just another Toyota with special (oh, tho special) interior appointments.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/4/?tab=comments#comment-2099264", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "certainly - a not quite serious hyperbole. but i cannot find a 3000-4000 $ discount ungenerous. and you do get a considerably newer and better camera, which cannot be a freebie. maybe leica should offer a buyback - used m8 price, sometimes minus repair cost. between 500 and 2000 $. what are you going to say to that? of course, such overstatement must be jest. it is certainly not pertinent to this discussion. for what it is worth, some years ago we had a case in toyota where the v6 experienced a sudden and complete loss of oil due to a failed main oil line. there was a certain -----> location !!!  on the assembly line for a brief time when the wrong fitting was used. it effected only about 400 cars. toyota replaced the engines for each customer right away. free, of course. why should leica not offer the same? and you know the lexus is just another toyota with special (oh, tho special) interior appointments.", "sortedWord": "None", "identifyer": 46494, "year": "2012"}, {"Unnamed: 0": 385269, "autor": "IkarusJohn", "date": 1347139800000, "content": " Thanks for the response James. But my point is that whilst its reasonable to talk about improved security of service, it makes no sense simply to insist on such things without knowing the cost. (This is a separate point from the marketing one: clearly if you can't guarantee something you shouldn't suggest that you can.) There's not a lot of comfort in having a watertight contract with a supplier who goes bust. There's not a lot of genuine comfort to customers in giving guarantees that depend of the viability of third-party suppliers. The only way of getting close to guaranteeing something (and no guarantee is 100% safe, not least because of credit-risk) is to express the guarantee in financial terms. No one, not even Canon or Apple, can guarantee the supply of all the parts they need. They cannot prevent a third-party supplier going bust, although obviously they have more clout in the market than Leica when it comes to buying up production capacity.) But they can underwrite their guarantees with, in effect, insurance policies: if we can't effect a repair because a part is unavailable, we'll indemnify you against the cost to you of the closest replacement you can find, up to the value of the camera affected. But this is what Leica are offering to do by way of the up-grade programme. I don't know whether the specific terms are fair, and it might be considered restrictive only to offer a Leica product rather than a cash payment, but that's not an unusual practice. But surely there's no point in insisting on something without knowing whether its possible to provide it, and what the cost of doing so might be. I agree an indication from Leica would be helpful, but again, it would be rather more information than most companies would be prepared to reveal, so I'm not holding my breath. Please excuse the full quote; I'm on an iPad, and selective quoting is not as easy as on a computer. I've drafted a few subcontracts and supply agreements over the last 30 years, so it is an area of some familiarity for me. First off, continued supply for production and maintenance is a critical issue, as we can see with the LCD supply for the M8. It is part of the design and selection process - the cool, one-off design, against the standard off the shelf purchase. Each has it's risks, along with selection suppliers who have a partnership approach. Second, few supply items are genuinely one-off. Most use established designs and technology. Even Apple with its revolutionary products have few truly revolutionary, patented components. Typically, the intellectual property for those components belongs to the supplier. Third, when specifying components, a company like Leica will specify a certain relatively standard performance, but it will usually have specific requirements, like size, configuration, electronic connection type and location and means of attachment. Fourth, for economies of scale, batch runs will be the best method of procurement, so Leica will make confirmed orders of certain quantities at certain times. They will meet initial production runs, extended runs for greater demand, and the continuity of supply for repair and maintenance. While the supplier will do bigger batches and maintain some inventory, all is smoothed out over the entire life of the product. There will always be a buffer to cope with immediate, unscheduled demand, while further production is established to meet unexpected additional demand. As a matter of contract, this means a number of things - Leica will have a supply schedule, based on anticipated sales, repairs and spares. As the M8 popularity grew, all component supplies will have been adjusted. They will have contracted, in the past, with trusted suppliers. Contractually, there will have been initial pricing, supply times and notices, with provision for price adjustment to market and inflation. For any supply agreement, there are two big issues - (1) component failure, and (2) supplier failure. When I draft supply contracts, I always try to cover these issues pragmatically, and as effectively as technology and market risk allow. For the first, the supplier must replace failed components immediately - this encourages some stock of spares to be maintained. The second can be harder to cover. Typically, we look at the anticipated life of the overall product. We're not talking consumer products, or vanity/fashion items here. This is not book value, economic life or any other excuse for failure, but operating life. Any large piece of plant relying on some crappy piece of electronics has repair and backup strategies for these weak links. In its marketing, Leica pitches its products in the same way - they express a commitment to future service beyond what other products offer. These contracts always contain a life expectancy for the product, with a commitment to service and maintain those parts for that life - 10 years would typically be at the shorter end. If the supplier fails or refuses to maintain the spares, I usually require the supplier to assign all intellectual property to the buyer, in the expectation that the buyer can commission a supply elsewhere. An LCD is not a high tech or difficult item to source. The constraints for Leica are size, proportions, connection and performance. Not hard to replicate, provided you have the designs and the rights to use them, and you order enough items; your contract should provide for this to be done by the supplier, or at its cost. So, the excuses for non-supply and unavailability of the LCD ring a bit thin. It's not impossible to solve this. It is either a matter of cost (it's always a matter of cost), and they appear not to have some fairly basic contract rights in place. Leica does not go out and buy the entire production run and spares of all parts at the outset. That's what the Japanese taught the rest of the World back in the 1960s with \"just in time\" supply. A number of things astound me about all this - Leica does not, apparently, record where the components go. With the LCD failure, presumably they know how many faulty LCDs were delivered, but they have no idea where they went; less than 3 years after ceasing production of the camera, their supplier cannot run a new production run (at no cost to Leica); and they seem to have no backup strategy for sourcing alternative supplies (at no cost to Leica). So, my underlying concern is less that there have been M8 failures which can't be fixed, than that Leica is unable to solve a problem which was entirely predictable, and should have been at the core of its supply chain management. That they pass the cost of this failure on to camera owners shows a lack of willingness to fully take responsibility for their failure. Cheers John", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/13/?tab=comments#comment-2108265", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " thanks for the response james. but my point is that whilst its reasonable to talk about improved security of service, it makes no sense simply to insist on such things without knowing the cost. (this is a separate point from the marketing one: clearly if you can't guarantee something you shouldn't suggest that you can.) there's not a lot of comfort in having a watertight contract with a supplier who goes bust. there's not a lot of genuine comfort to customers in giving guarantees that depend of the viability of third-party suppliers. the only way of getting close to guaranteeing something (and no guarantee is 100% safe, not least because of credit-risk) is to express the guarantee in financial terms. no one, not even canon or apple, can guarantee the supply of all the parts they need. they cannot prevent a third-party supplier going bust, although obviously they have more clout in the market than leica when it comes to buying up production capacity.) but they can underwrite their guarantees with, in effect, insurance policies: if we can't effect a repair because a part is unavailable, we'll indemnify you against the cost to you of the closest replacement you can find, up to the value of the camera affected. but this is what leica are offering to do by way of the up-grade programme. i don't know whether the specific terms are fair, and it might be considered restrictive only to offer a leica product rather than a cash payment, but that's not an unusual practice. but surely there's no point in insisting on something without knowing whether its possible to provide it, and what the cost of doing so might be. i agree an indication from leica would be helpful, but again, it would be rather more information than most companies would be prepared to reveal, so i'm not holding my breath. please excuse the full quote; i'm on an ipad, and selective quoting is not as easy as on a computer. i've drafted a few subcontracts and supply agreements over the last 30 years, so it is an area of some familiarity for me. first off, continued supply for production and maintenance is a critical issue, as we can see with the lcd supply for the m8. it is part of the design and selection process - the cool, one-off design, against the standard off the shelf purchase. each has it's risks, along with selection suppliers who have a partnership approach. second, few supply items are genuinely one-off. most use established designs and technology. even apple with its revolutionary products have few truly revolutionary, patented components. typically, the intellectual property for those components belongs to the supplier. third, when specifying components, a company like leica will specify a certain relatively standard performance, but it will usually have specific requirements, like size, configuration, electronic connection type and -----> location !!!  and means of attachment. fourth, for economies of scale, batch runs will be the best method of procurement, so leica will make confirmed orders of certain quantities at certain times. they will meet initial production runs, extended runs for greater demand, and the continuity of supply for repair and maintenance. while the supplier will do bigger batches and maintain some inventory, all is smoothed out over the entire life of the product. there will always be a buffer to cope with immediate, unscheduled demand, while further production is established to meet unexpected additional demand. as a matter of contract, this means a number of things - leica will have a supply schedule, based on anticipated sales, repairs and spares. as the m8 popularity grew, all component supplies will have been adjusted. they will have contracted, in the past, with trusted suppliers. contractually, there will have been initial pricing, supply times and notices, with provision for price adjustment to market and inflation. for any supply agreement, there are two big issues - (1) component failure, and (2) supplier failure. when i draft supply contracts, i always try to cover these issues pragmatically, and as effectively as technology and market risk allow. for the first, the supplier must replace failed components immediately - this encourages some stock of spares to be maintained. the second can be harder to cover. typically, we look at the anticipated life of the overall product. we're not talking consumer products, or vanity/fashion items here. this is not book value, economic life or any other excuse for failure, but operating life. any large piece of plant relying on some crappy piece of electronics has repair and backup strategies for these weak links. in its marketing, leica pitches its products in the same way - they express a commitment to future service beyond what other products offer. these contracts always contain a life expectancy for the product, with a commitment to service and maintain those parts for that life - 10 years would typically be at the shorter end. if the supplier fails or refuses to maintain the spares, i usually require the supplier to assign all intellectual property to the buyer, in the expectation that the buyer can commission a supply elsewhere. an lcd is not a high tech or difficult item to source. the constraints for leica are size, proportions, connection and performance. not hard to replicate, provided you have the designs and the rights to use them, and you order enough items; your contract should provide for this to be done by the supplier, or at its cost. so, the excuses for non-supply and unavailability of the lcd ring a bit thin. it's not impossible to solve this. it is either a matter of cost (it's always a matter of cost), and they appear not to have some fairly basic contract rights in place. leica does not go out and buy the entire production run and spares of all parts at the outset. that's what the japanese taught the rest of the world back in the 1960s with \"just in time\" supply. a number of things astound me about all this - leica does not, apparently, record where the components go. with the lcd failure, presumably they know how many faulty lcds were delivered, but they have no idea where they went; less than 3 years after ceasing production of the camera, their supplier cannot run a new production run (at no cost to leica); and they seem to have no backup strategy for sourcing alternative supplies (at no cost to leica). so, my underlying concern is less that there have been m8 failures which can't be fixed, than that leica is unable to solve a problem which was entirely predictable, and should have been at the core of its supply chain management. that they pass the cost of this failure on to camera owners shows a lack of willingness to fully take responsibility for their failure. cheers john", "sortedWord": "None", "identifyer": 46673, "year": "2012"}, {"Unnamed: 0": 385275, "autor": "kdriceman", "date": 1347162840000, "content": " Please excuse the full quote; I'm on an iPad' date=' and selective quoting is not as easy as on a computer. I've drafted a few subcontracts and supply agreements over the last 30 years, so it is an area of some familiarity for me. First off, continued supply for production and maintenance is a critical issue, as we can see with the LCD supply for the M8. It is part of the design and selection process - the cool, one-off design, against the standard off the shelf purchase. Each has it's risks, along with selection suppliers who have a partnership approach. Second, few supply items are genuinely one-off. Most use established designs and technology. Even Apple with its revolutionary products have few truly revolutionary, patented components. Typically, the intellectual property for those components belongs to the supplier. Third, when specifying components, a company like Leica will specify a certain relatively standard performance, but it will usually have specific requirements, like size, configuration, electronic connection type and location and means of attachment. Fourth, for economies of scale, batch runs will be the best method of procurement, so Leica will make confirmed orders of certain quantities at certain times. They will meet initial production runs, extended runs for greater demand, and the continuity of supply for repair and maintenance. While the supplier will do bigger batches and maintain some inventory, all is smoothed out over the entire life of the product. There will always be a buffer to cope with immediate, unscheduled demand, while further production is established to meet unexpected additional demand. As a matter of contract, this means a number of things - Leica will have a supply schedule, based on anticipated sales, repairs and spares. As the M8 popularity grew, all component supplies will have been adjusted. They will have contracted, in the past, with trusted suppliers. Contractually, there will have been initial pricing, supply times and notices, with provision for price adjustment to market and inflation. For any supply agreement, there are two big issues - (1) component failure, and (2) supplier failure. When I draft supply contracts, I always try to cover these issues pragmatically, and as effectively as technology and market risk allow. For the first, the supplier must replace failed components immediately - this encourages some stock of spares to be maintained. The second can be harder to cover. Typically, we look at the anticipated life of the overall product. We're not talking consumer products, or vanity/fashion items here. This is not book value, economic life or any other excuse for failure, but operating life. Any large piece of plant relying on some crappy piece of electronics has repair and backup strategies for these weak links. In its marketing, Leica pitches its products in the same way - they express a commitment to future service beyond what other products offer. These contracts always contain a life expectancy for the product, with a commitment to service and maintain those parts for that life - 10 years would typically be at the shorter end. If the supplier fails or refuses to maintain the spares, I usually require the supplier to assign all intellectual property to the buyer, in the expectation that the buyer can commission a supply elsewhere. An LCD is not a high tech or difficult item to source. The constraints for Leica are size, proportions, connection and performance. Not hard to replicate, provided you have the designs and the rights to use them, and you order enough items; your contract should provide for this to be done by the supplier, or at its cost. So, the excuses for non-supply and unavailability of the LCD ring a bit thin. It's not impossible to solve this. It is either a matter of cost (it's always a matter of cost), and they appear not to have some fairly basic contract rights in place. Leica does not go out and buy the entire production run and spares of all parts at the outset. That's what the Japanese taught the rest of the World back in the 1960s with \"just in time\" supply. A number of things astound me about all this - Leica does not, apparently, record where the components go. With the LCD failure, presumably they know how many faulty LCDs were delivered, but they have no idea where they went; less than 3 years after ceasing production of the camera, their supplier cannot run a new production run (at no cost to Leica); and they seem to have no backup strategy for sourcing alternative supplies (at no cost to Leica). So, my underlying concern is less that there have been M8 failures which can't be fixed, than that Leica is unable to solve a problem which was entirely predictable, and should have been at the core of its supply chain management. That they pass the cost of this failure on to camera owners shows a lack of willingness to fully take responsibility for their failure. Cheers John[/quote'] +1", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/13/?tab=comments#comment-2108409", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " please excuse the full quote; i'm on an ipad' date=' and selective quoting is not as easy as on a computer. i've drafted a few subcontracts and supply agreements over the last 30 years, so it is an area of some familiarity for me. first off, continued supply for production and maintenance is a critical issue, as we can see with the lcd supply for the m8. it is part of the design and selection process - the cool, one-off design, against the standard off the shelf purchase. each has it's risks, along with selection suppliers who have a partnership approach. second, few supply items are genuinely one-off. most use established designs and technology. even apple with its revolutionary products have few truly revolutionary, patented components. typically, the intellectual property for those components belongs to the supplier. third, when specifying components, a company like leica will specify a certain relatively standard performance, but it will usually have specific requirements, like size, configuration, electronic connection type and -----> location !!!  and means of attachment. fourth, for economies of scale, batch runs will be the best method of procurement, so leica will make confirmed orders of certain quantities at certain times. they will meet initial production runs, extended runs for greater demand, and the continuity of supply for repair and maintenance. while the supplier will do bigger batches and maintain some inventory, all is smoothed out over the entire life of the product. there will always be a buffer to cope with immediate, unscheduled demand, while further production is established to meet unexpected additional demand. as a matter of contract, this means a number of things - leica will have a supply schedule, based on anticipated sales, repairs and spares. as the m8 popularity grew, all component supplies will have been adjusted. they will have contracted, in the past, with trusted suppliers. contractually, there will have been initial pricing, supply times and notices, with provision for price adjustment to market and inflation. for any supply agreement, there are two big issues - (1) component failure, and (2) supplier failure. when i draft supply contracts, i always try to cover these issues pragmatically, and as effectively as technology and market risk allow. for the first, the supplier must replace failed components immediately - this encourages some stock of spares to be maintained. the second can be harder to cover. typically, we look at the anticipated life of the overall product. we're not talking consumer products, or vanity/fashion items here. this is not book value, economic life or any other excuse for failure, but operating life. any large piece of plant relying on some crappy piece of electronics has repair and backup strategies for these weak links. in its marketing, leica pitches its products in the same way - they express a commitment to future service beyond what other products offer. these contracts always contain a life expectancy for the product, with a commitment to service and maintain those parts for that life - 10 years would typically be at the shorter end. if the supplier fails or refuses to maintain the spares, i usually require the supplier to assign all intellectual property to the buyer, in the expectation that the buyer can commission a supply elsewhere. an lcd is not a high tech or difficult item to source. the constraints for leica are size, proportions, connection and performance. not hard to replicate, provided you have the designs and the rights to use them, and you order enough items; your contract should provide for this to be done by the supplier, or at its cost. so, the excuses for non-supply and unavailability of the lcd ring a bit thin. it's not impossible to solve this. it is either a matter of cost (it's always a matter of cost), and they appear not to have some fairly basic contract rights in place. leica does not go out and buy the entire production run and spares of all parts at the outset. that's what the japanese taught the rest of the world back in the 1960s with \"just in time\" supply. a number of things astound me about all this - leica does not, apparently, record where the components go. with the lcd failure, presumably they know how many faulty lcds were delivered, but they have no idea where they went; less than 3 years after ceasing production of the camera, their supplier cannot run a new production run (at no cost to leica); and they seem to have no backup strategy for sourcing alternative supplies (at no cost to leica). so, my underlying concern is less that there have been m8 failures which can't be fixed, than that leica is unable to solve a problem which was entirely predictable, and should have been at the core of its supply chain management. that they pass the cost of this failure on to camera owners shows a lack of willingness to fully take responsibility for their failure. cheers john[/quote'] +1", "sortedWord": "None", "identifyer": 46679, "year": "2012"}], "name": "locationL-Forum2012"}