{"interestingcomments": [{"Unnamed: 0": 345503, "autor": "AndreasG", "date": 1567330380000, "content": "Let me share my experience with the Visoflex 020 and a M10-D with you. I bought the Visoflex around 3 weeks ago. Everything works well, display, focussing, proximity switch, indication of the key parameters - except the GPS function. The satellite symbol appears within a few seconds, telling that the link got established, but with the small \"x\" - no data transfer. First I thought, maybe out of satellite range for a short while, but I never could get any GPS data, at various locations. I contacted the Leica service Wetzlar by email, but their reply was only to follow the instruction on p. 5 of the manual - keep the antenna upright and do not shield it. To be honest, I expected a qualified advice. A few day later I visited the shop where I had bought the Visoflex ( a well known dealer in Düsseldorf). They took plenty of time, but unfortunately no M10 or a Visoflex were available for a comparison. But the told that next day an expert from Leica would come and they would discuss this case. I left without any expectation. Surprisingly, two days later the shop sent me an email, informing me that the Leica guy had admitted that this GPS issue with the M10-D/Visoflex has been known already and would be solved with the new firmware version 2.7.5.0 to be released September 4, 2019. So, I wait now...", "link": "https://www.l-camera-forum.com/topic/297307-visoflex-issues-with-leica-m10/?tab=comments#comment-3810825", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "let me share my experience with the visoflex 020 and a m10-d with you. i bought the visoflex around 3 weeks ago. everything works well, display, focussing, proximity switch, indication of the key parameters - except the gps function. the satellite symbol appears within a few seconds, telling that the link got established, but with the small \"x\" - no data transfer. first i thought, maybe out of satellite range for a short while, but i never could get any gps data, at various -----> locations !!! . i contacted the leica service wetzlar by email, but their reply was only to follow the instruction on p. 5 of the manual - keep the antenna upright and do not shield it. to be honest, i expected a qualified advice. a few day later i visited the shop where i had bought the visoflex ( a well known dealer in düsseldorf). they took plenty of time, but unfortunately no m10 or a visoflex were available for a comparison. but the told that next day an expert from leica would come and they would discuss this case. i left without any expectation. surprisingly, two days later the shop sent me an email, informing me that the leica guy had admitted that this gps issue with the m10-d/visoflex has been known already and would be solved with the new firmware version 2.7.5.0 to be released september 4, 2019. so, i wait now...", "sortedWord": "None", "identifyer": 6592, "year": "2019"}, {"Unnamed: 0": 349421, "autor": "250swb", "date": 1565851920000, "content": "It's amazing, I can barely make out where the camera is in these photos, except for the one with the red dot which gives away it's location.", "link": "https://www.l-camera-forum.com/topic/300302-how-to-remove-white-lettering-on-m10-d/?tab=comments#comment-3798050", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "it's amazing, i can barely make out where the camera is in these photos, except for the one with the red dot which gives away it's -----> location !!! .", "sortedWord": "None", "identifyer": 10524, "year": "2019"}, {"Unnamed: 0": 349422, "autor": "SiOnara", "date": 1565855520000, "content": " 1 hour ago, 250swb said: It's amazing, I can barely make out where the camera is in these photos, except for the one with the red dot which gives away it's location. Don't be silly. I could still spot an M10D from 500 feet away! Edited August 15, 2019 by SiOnara", "link": "https://www.l-camera-forum.com/topic/300302-how-to-remove-white-lettering-on-m10-d/?tab=comments#comment-3798088", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " 1 hour ago, 250swb said: it's amazing, i can barely make out where the camera is in these photos, except for the one with the red dot which gives away it's -----> location !!! . don't be silly. i could still spot an m10d from 500 feet away! edited august 15, 2019 by sionara", "sortedWord": "None", "identifyer": 10525, "year": "2019"}, {"Unnamed: 0": 351993, "autor": "Aldrahn", "date": 1560031320000, "content": " Thanks, so far I've found the following, serial numbers with location (not necessarily the location sold in) 4982424 austria 4982426 singapore 4987xxx unknown 4987xxx uk 4987528 italy 4987584 austria 4987584 austria 4987621 uk 4998xxx unknown 4998631 germany 4998695 Japan 5150xxx unknown 5150xxx unknown 5150146 italy 5150177 germany 5150491 uk (mine)", "link": "https://www.l-camera-forum.com/topic/297947-m-d-type-262-production-numbers/?tab=comments#comment-3756064", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " thanks, so far i've found the following, serial numbers with -----> location !!!  (not necessarily the -----> location !!!  sold in) 4982424 austria 4982426 singapore 4987xxx unknown 4987xxx uk 4987528 italy 4987584 austria 4987584 austria 4987621 uk 4998xxx unknown 4998631 germany 4998695 japan 5150xxx unknown 5150xxx unknown 5150146 italy 5150177 germany 5150491 uk (mine)", "sortedWord": "None", "identifyer": 13133, "year": "2019"}, {"Unnamed: 0": 352011, "autor": "pippy", "date": 1576956900000, "content": "On 6/8/2019 at 11:02 PM, Aldrahn said: Thanks, so far I've found the following, serial numbers with location (not necessarily the location sold in) 4982424 austria 4982426 singapore... Just googled the same question regarding production numbers and found this thread. I picked up an ex-shop-demo example just this week. Only 140 clicks(!) and, as you might imagine, in mint condition with all the usual acc's and boxes. Interesting to see the early numbers here (along with Nigel G's 4982410). My example is 4982421. Bought in London - which means that (when members answered) 2421 (mine) turned up in London; 2424 turned up in Austria; 2426 turned up in Singapore and 2410 turned up in the Cotswolds. Or, possibly, London. Or, as it might have been, NYC... I wonder if these were all from the first batch sent out to dealerships around the globe? Any numbers earlier than Nigel's known? Strange scattering of units if they were all procured in the territories to which they had originally been delivered. Philip.", "link": "https://www.l-camera-forum.com/topic/297947-m-d-type-262-production-numbers/page/2/?tab=comments#comment-3877158", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on 6/8/2019 at 11:02 pm, aldrahn said: thanks, so far i've found the following, serial numbers with -----> location !!!  (not necessarily the -----> location !!!  sold in) 4982424 austria 4982426 singapore... just googled the same question regarding production numbers and found this thread. i picked up an ex-shop-demo example just this week. only 140 clicks(!) and, as you might imagine, in mint condition with all the usual acc's and boxes. interesting to see the early numbers here (along with nigel g's 4982410). my example is 4982421. bought in london - which means that (when members answered) 2421 (mine) turned up in london; 2424 turned up in austria; 2426 turned up in singapore and 2410 turned up in the cotswolds. or, possibly, london. or, as it might have been, nyc... i wonder if these were all from the first batch sent out to dealerships around the globe? any numbers earlier than nigel's known? strange scattering of units if they were all procured in the territories to which they had originally been delivered. philip.", "sortedWord": "None", "identifyer": 13151, "year": "2019"}, {"Unnamed: 0": 357889, "autor": "Exodies", "date": 1572989880000, "content": "5 hours ago, terrycym said: Nowhere is not (0,0,0). It's off the west coast of Africa on the Equator Really annoyed that they didn't fix this - if GPS hasn't been set then the EXIF should contain <Null> for GPS data like every other camera manufacturer manages to do. Whatever, I’m always further from null than anywhere else. I would like to keep the last known location for ever.", "link": "https://www.l-camera-forum.com/topic/302808-new-firmware-206/page/3/?tab=comments#comment-3848522", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "5 hours ago, terrycym said: nowhere is not (0,0,0). it's off the west coast of africa on the equator really annoyed that they didn't fix this - if gps hasn't been set then the exif should contain <null> for gps data like every other camera manufacturer manages to do. whatever, i’m always further from null than anywhere else. i would like to keep the last known -----> location !!!  for ever.", "sortedWord": "None", "identifyer": 19066, "year": "2019"}, {"Unnamed: 0": 357890, "autor": "jaeger", "date": 1572993540000, "content": "1 hour ago, Exodies said: Whatever, I’m always further from null than anywhere else. I would like to keep the last known location for ever. I don't want previous location or what-so-ever 0,0,0 I want the GPS to work as it supposed to be. it's now taking few minutes to locate which is way too slow. Edited November 5, 2019 by jaeger", "link": "https://www.l-camera-forum.com/topic/302808-new-firmware-206/page/3/?tab=comments#comment-3848542", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "1 hour ago, exodies said: whatever, i’m always further from null than anywhere else. i would like to keep the last known -----> location !!!  for ever. i don't want previous location or what-so-ever 0,0,0 i want the gps to work as it supposed to be. it's now taking few minutes to locate which is way too slow. edited november 5, 2019 by jaeger", "sortedWord": "None", "identifyer": 19067, "year": "2019"}, {"Unnamed: 0": 357891, "autor": "david strachan", "date": 1573004880000, "content": "Jaeger perhaps you have expectations beyond existing technology. I've had a few GPS systems, including many dedicated Garmin type. They all take time to get a first fix, and even then poor units will drop out pretty easily. I just wonder if wishful thinking for GPS location, on-the-fly is beyond us at the moment. Can't see an immediate future with quick turn-on and immediate positioning...just not going to happen. ...", "link": "https://www.l-camera-forum.com/topic/302808-new-firmware-206/page/3/?tab=comments#comment-3848603", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "jaeger perhaps you have expectations beyond existing technology. i've had a few gps systems, including many dedicated garmin type. they all take time to get a first fix, and even then poor units will drop out pretty easily. i just wonder if wishful thinking for gps -----> location !!! , on-the-fly is beyond us at the moment. can't see an immediate future with quick turn-on and immediate positioning...just not going to happen. ...", "sortedWord": "None", "identifyer": 19068, "year": "2019"}, {"Unnamed: 0": 357893, "autor": "jaeger", "date": 1573008180000, "content": "54 minutes ago, david strachan said: Jaeger perhaps you have expectations beyond existing technology. I've had a few GPS systems, including many dedicated Garmin type. They all take time to get a first fix, and even then poor units will drop out pretty easily. I just wonder if wishful thinking for GPS location, on-the-fly is beyond us at the moment. Can't see an immediate future with quick turn-on and immediate positioning...just not going to happen. ... really, then my iPhone must be wrong. it takes... about 3 seconds to sync with the satellite.", "link": "https://www.l-camera-forum.com/topic/302808-new-firmware-206/page/3/?tab=comments#comment-3848614", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "54 minutes ago, david strachan said: jaeger perhaps you have expectations beyond existing technology. i've had a few gps systems, including many dedicated garmin type. they all take time to get a first fix, and even then poor units will drop out pretty easily. i just wonder if wishful thinking for gps -----> location !!! , on-the-fly is beyond us at the moment. can't see an immediate future with quick turn-on and immediate positioning...just not going to happen. ... really, then my iphone must be wrong. it takes... about 3 seconds to sync with the satellite.", "sortedWord": "None", "identifyer": 19070, "year": "2019"}, {"Unnamed: 0": 357894, "autor": "frame-it", "date": 1573008600000, "content": "phones also get an approximate location based on the cellular base station/tower it is in contact with, so they can lock faster Edited November 6, 2019 by frame-it", "link": "https://www.l-camera-forum.com/topic/302808-new-firmware-206/page/3/?tab=comments#comment-3848620", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "phones also get an approximate -----> location !!!  based on the cellular base station/tower it is in contact with, so they can lock faster edited november 6, 2019 by frame-it", "sortedWord": "None", "identifyer": 19071, "year": "2019"}, {"Unnamed: 0": 358809, "autor": "ianman", "date": 1546332660000, "content": " 13 hours ago, sblutter said: We were on a 3hr walking trip in Madrid - one guy also had an M240, his was fitted with the 2.0 90 - a big heavy lens. I was using my fav walking lenses; 50 Elmarit-M (collapsible) & and the pancake Voight 35 2.5. I'm been an M shooter for 50 yrs - was a pro for yrs, a lot of them as an architectural view camera on location guy, have had shows etc. In 3 hours, the 90 guy never even looked through the VF'r Maybe nothing interested him... I really don't get your point!?", "link": "https://www.l-camera-forum.com/topic/292641-do-you-assume-a-certain-level-of-knowledge-of-a-leica-shooter/page/3/?tab=comments#comment-3656273", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " 13 hours ago, sblutter said: we were on a 3hr walking trip in madrid - one guy also had an m240, his was fitted with the 2.0 90 - a big heavy lens. i was using my fav walking lenses; 50 elmarit-m (collapsible) & and the pancake voight 35 2.5. i'm been an m shooter for 50 yrs - was a pro for yrs, a lot of them as an architectural view camera on -----> location !!!  guy, have had shows etc. in 3 hours, the 90 guy never even looked through the vf'r maybe nothing interested him... i really don't get your point!?", "sortedWord": "None", "identifyer": 19990, "year": "2019"}, {"Unnamed: 0": 359523, "autor": "jaapv", "date": 1556358060000, "content": ".ds files are little metadata files that are appended to any folder that is seen by Finder. They contain the location of icons, background colours, etc. A bit like thumb.db in Windows. They may become visible when moving a file between Mac and Windows. To disable, write this command in terminal: defaults write com.apple.desktopservices DSDontWriteNetworkStores true To remove : https://helpx.adobe.com/dreamweaver/kb/remove-ds-store-files-mac.html The simplest solution is to run \"CleanMyMac \" regularly which I do for multiple reasons.", "link": "https://www.l-camera-forum.com/topic/295135-it-is-known-bug/page/2/?tab=comments#comment-3730170", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": ".ds files are little metadata files that are appended to any folder that is seen by finder. they contain the -----> location !!!  of icons, background colours, etc. a bit like thumb.db in windows. they may become visible when moving a file between mac and windows. to disable, write this command in terminal: defaults write com.apple.desktopservices dsdontwritenetworkstores true to remove : https://helpx.adobe.com/dreamweaver/kb/remove-ds-store-files-mac.html the simplest solution is to run \"cleanmymac \" regularly which i do for multiple reasons.", "sortedWord": "None", "identifyer": 20705, "year": "2019"}, {"Unnamed: 0": 359629, "autor": "richam", "date": 1554097020000, "content": " April 1st: Leica has announced the Iowa special edition of the M-P, referred to as the LEICOWA. Based on the M-P digital rangefinder, the Leicowa features actual corn covering rather than leather, and bold green and yellow colors throughout. The corn covering has the advantage, in case of overheating, of turning into a tasty popcorn snack. There is no red dot; instead familiar Iowa icons are featured on the front and top. A matching 35mm Summarit lens is available, including a hawkeye lens hood for University of Iowa fans. If the camera and lens are purchased together as a set, a handy re-useable corncob lens wipe is included. The camera will be produced in Dickens in cooperation with a local factory, whose expertise in galvanized pipe manufacture directly applies to camera production. The location is also handy for access to a famous Steakhouse and Lounge. --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/295788-leica-m-p-iowa-version/?tab=comments#comment-3713489", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " april 1st: leica has announced the iowa special edition of the m-p, referred to as the leicowa. based on the m-p digital rangefinder, the leicowa features actual corn covering rather than leather, and bold green and yellow colors throughout. the corn covering has the advantage, in case of overheating, of turning into a tasty popcorn snack. there is no red dot; instead familiar iowa icons are featured on the front and top. a matching 35mm summarit lens is available, including a hawkeye lens hood for university of iowa fans. if the camera and lens are purchased together as a set, a handy re-useable corncob lens wipe is included. the camera will be produced in dickens in cooperation with a local factory, whose expertise in galvanized pipe manufacture directly applies to camera production. the -----> location !!!  is also handy for access to a famous steakhouse and lounge. --img-- --img-- --img-- ", "sortedWord": "None", "identifyer": 20811, "year": "2019"}, {"Unnamed: 0": 367427, "autor": "adan", "date": 1576998120000, "content": "4 hours ago, dkmoore said: Whenever the \"what is your wish for the next M\" posts occur I say the same thing. I'm not necessarily wishing for an OVF that never needs adjustment. Rather, I am looking for a tweak to the current system as I don't want to go full EVF in the M. All I want is the sensor to know when the rangefinder patches align and light up the frame lines red, green, blue, or white when that happens. Then you get best of both worlds. How do you propose Leica do that? The rangefinder patch images are completely independent of each other and not aligned at all - until they pass through the viewfinder (where the are combined) and to your eye - which is the \"sensor\" that determines they are aligned. You can move your eye a mm or so \"off-center\" and the images will dis-align themselves - which shows how critical positioning is. Thus a \"sensor\" to do what your eye does also must be placed directly in the middle of the camera eyepiece to work. Which will mean that looking though the viewfinder, you won't see your subject - you'll just see the sensor. Rough schematic of the M RF/VF - you see the subject (red line) by looking through the eyepiece lens (bottom left) and a split block of glass with a silver \"semi-mirror\" coating diagonally through it. You also see a secondary view of the subject from a different angle (yellow line) reflected from the semi-mirror surface. The only place those two views exist together to be compared or aligned - by eye or by electronics - is the blue line. Which is mostly inside solid glass. You can download this .jpg diagram. if you can draw on it exactly where you would place optical sensor(s), and any additional hardware needed, so that the camera could sense when the \"correct\" two images are aligned, and repost your suggested engineeriing, that will be fine. --img--  Assuming you can do that, you can move on to the problem of deciding which objects in the combined image are supposed to be aligned. Because the RF patch contains not just a single point, but a fair area of the scene. ------------- This is a stereo pair. Two overlapped pictures from slightly different left-right locations. Which is exactly how the Leica rangefinder views the world - through two different windows a few inches apart. It simulates just the \"rangefinder patch\" of dual overlapped images in the Leica RF. Two images with varying alignment due to parallax - viewing the world from two different places. In the left image, I have aligned the red and cyan images to be \"focused\" on the worn patch inside the bus on the wheel-well (background). In the right image, I have aligned the images to be \"focused\" on the chrome \"[\"-shaped railing just inside the door. You, as a photographer with a human brain, know whether you want the focus/alignment on the worn patch, or the railing - but how does your electronic servant know which alignment you want? It may light up if the railing is aligned - or the handicapped sign is aligned - or the \"Please allow...\" sign is aligned - or the worn patch is aligned - or the far window frames are aligned. It can't read your mind. --img--  Edited December 22, 2019 by adan", "link": "https://www.l-camera-forum.com/topic/302293-when-will-we-get-the-m10m-really/page/5/?tab=comments#comment-3877410", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "4 hours ago, dkmoore said: whenever the \"what is your wish for the next m\" posts occur i say the same thing. i'm not necessarily wishing for an ovf that never needs adjustment. rather, i am looking for a tweak to the current system as i don't want to go full evf in the m. all i want is the sensor to know when the rangefinder patches align and light up the frame lines red, green, blue, or white when that happens. then you get best of both worlds. how do you propose leica do that? the rangefinder patch images are completely independent of each other and not aligned at all - until they pass through the viewfinder (where the are combined) and to your eye - which is the \"sensor\" that determines they are aligned. you can move your eye a mm or so \"off-center\" and the images will dis-align themselves - which shows how critical positioning is. thus a \"sensor\" to do what your eye does also must be placed directly in the middle of the camera eyepiece to work. which will mean that looking though the viewfinder, you won't see your subject - you'll just see the sensor. rough schematic of the m rf/vf - you see the subject (red line) by looking through the eyepiece lens (bottom left) and a split block of glass with a silver \"semi-mirror\" coating diagonally through it. you also see a secondary view of the subject from a different angle (yellow line) reflected from the semi-mirror surface. the only place those two views exist together to be compared or aligned - by eye or by electronics - is the blue line. which is mostly inside solid glass. you can download this .jpg diagram. if you can draw on it exactly where you would place optical sensor(s), and any additional hardware needed, so that the camera could sense when the \"correct\" two images are aligned, and repost your suggested engineeriing, that will be fine. --img--  assuming you can do that, you can move on to the problem of deciding which objects in the combined image are supposed to be aligned. because the rf patch contains not just a single point, but a fair area of the scene. ------------- this is a stereo pair. two overlapped pictures from slightly different left-right -----> locations !!! . which is exactly how the leica rangefinder views the world - through two different windows a few inches apart. it simulates just the \"rangefinder patch\" of dual overlapped images in the leica rf. two images with varying alignment due to parallax - viewing the world from two different places. in the left image, i have aligned the red and cyan images to be \"focused\" on the worn patch inside the bus on the wheel-well (background). in the right image, i have aligned the images to be \"focused\" on the chrome \"[\"-shaped railing just inside the door. you, as a photographer with a human brain, know whether you want the focus/alignment on the worn patch, or the railing - but how does your electronic servant know which alignment you want? it may light up if the railing is aligned - or the handicapped sign is aligned - or the \"please allow...\" sign is aligned - or the worn patch is aligned - or the far window frames are aligned. it can't read your mind. --img--  edited december 22, 2019 by adan", "sortedWord": "None", "identifyer": 28701, "year": "2019"}, {"Unnamed: 0": 370704, "autor": "enboe", "date": 1552745340000, "content": "Perhaps you can benefit from my decades of experience buying, using, and eventually selling cameras. Be mentally prepared to pay fair market value for a camera without problems. You may have to be patient to find a clean, problem-free example, but when you do, you know what the fair market price is and will be prepared to pay it. Ebay Completed Listings and collectiblend.com are two good sources for looking at prices. Expect to pay a mid-range price. Buying used can save you money, especially if you are expert in the make and model you seek. Knowing the issues, wear-and-tear items, etc. allows for a thorough inspection and assessment before you buy. Not having this knowledge is setting you up for the occasional, \"buying someone else's problems.\" I don't know if you are part of a local photographic equipment community like here in Los Angeles, but you will label yourself quickly by low-balling your offers. The experienced camera owners here are used to wholesale or below-wholesale offers from dealers all the time, and you can quickly get yourself labeled as a dealer or dealer wanna-be if you make low-ball offers in a location where there are enough photographers to gossip about what they hear. By the way, the converse works as well when someone is asking too much. Rather than make an issue, best just to say, \"thank you\" and walk away. Eric", "link": "https://www.l-camera-forum.com/topic/295238-fair-price-of-a-used-old-sensor-m9/?tab=comments#comment-3703582", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "perhaps you can benefit from my decades of experience buying, using, and eventually selling cameras. be mentally prepared to pay fair market value for a camera without problems. you may have to be patient to find a clean, problem-free example, but when you do, you know what the fair market price is and will be prepared to pay it. ebay completed listings and collectiblend.com are two good sources for looking at prices. expect to pay a mid-range price. buying used can save you money, especially if you are expert in the make and model you seek. knowing the issues, wear-and-tear items, etc. allows for a thorough inspection and assessment before you buy. not having this knowledge is setting you up for the occasional, \"buying someone else's problems.\" i don't know if you are part of a local photographic equipment community like here in los angeles, but you will label yourself quickly by low-balling your offers. the experienced camera owners here are used to wholesale or below-wholesale offers from dealers all the time, and you can quickly get yourself labeled as a dealer or dealer wanna-be if you make low-ball offers in a -----> location !!!  where there are enough photographers to gossip about what they hear. by the way, the converse works as well when someone is asking too much. rather than make an issue, best just to say, \"thank you\" and walk away. eric", "sortedWord": "None", "identifyer": 32004, "year": "2019"}, {"Unnamed: 0": 370709, "autor": "DandA", "date": 1553097360000, "content": "No one really knows the percentage of M9's that ultimately shows signs of corrosion. Apparently some report they've had their M9's for years and still see know signs of corrosion while others had two (and possibly more) replacements of the original type of sensor, and each sensor of theirs showed corrosion. What a M9 showing no corrosion but having the original sensor should sell for, I have no idea and don't want to venture a guess as opinions vary. What I do believe (based on my using more than one M9 and follow the market), is that a M9 with a new non corroding sensor, in most cases will not be selling for $1900 at this point in time, unless its in what KEH refers to as BGN condition and even then will probably cost more. On average, a nice M9 (M-E) with new non corroding sensor in approx. \"9\" excellent condition might be around $2500-2600. A 9+ in Excellent + with new non corroding sensor somewhat more, and a beautiful \"10 condition that perfect, boxed and complete with new non corroding sensor would fetch the most. Depends on how nice a body you seek and of course buying location. Low number of shutter actuations of course play a role in price too. This excludes the M9-P, which will fetch a premium about all these prices. So like any item (lens etc.), condition and completeness will play a role in price , so generalities of lowballing it really doesn't apply in my opinion. Like others have suggested, if you want to get the least expensive M9 with new non corroding sensor, be patient and wait till the right one in your price range comes along and this gives you the best chance to secure a camera you'll be happy with. Dave (D&A) Edited March 20, 2019 by DandA", "link": "https://www.l-camera-forum.com/topic/295238-fair-price-of-a-used-old-sensor-m9/?tab=comments#comment-3706338", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "no one really knows the percentage of m9's that ultimately shows signs of corrosion. apparently some report they've had their m9's for years and still see know signs of corrosion while others had two (and possibly more) replacements of the original type of sensor, and each sensor of theirs showed corrosion. what a m9 showing no corrosion but having the original sensor should sell for, i have no idea and don't want to venture a guess as opinions vary. what i do believe (based on my using more than one m9 and follow the market), is that a m9 with a new non corroding sensor, in most cases will not be selling for $1900 at this point in time, unless its in what keh refers to as bgn condition and even then will probably cost more. on average, a nice m9 (m-e) with new non corroding sensor in approx. \"9\" excellent condition might be around $2500-2600. a 9+ in excellent + with new non corroding sensor somewhat more, and a beautiful \"10 condition that perfect, boxed and complete with new non corroding sensor would fetch the most. depends on how nice a body you seek and of course buying -----> location !!! . low number of shutter actuations of course play a role in price too. this excludes the m9-p, which will fetch a premium about all these prices. so like any item (lens etc.), condition and completeness will play a role in price , so generalities of lowballing it really doesn't apply in my opinion. like others have suggested, if you want to get the least expensive m9 with new non corroding sensor, be patient and wait till the right one in your price range comes along and this gives you the best chance to secure a camera you'll be happy with. dave (d&a) edited march 20, 2019 by danda", "sortedWord": "None", "identifyer": 32009, "year": "2019"}, {"Unnamed: 0": 373759, "autor": "adan", "date": 1567288140000, "content": " Hey, DD - nope, no stand-alone M9 profile in the location you specified. Just an \"index.dat\" file that lists 100s of cameras, including M8 and S2 but NOT M9 (that I can see - I ran a text search on \"Leica\"). File dated Jan. 2014 I do think the M9 embedded profile is not a separate \"thing\" to be found elsewhere on a computer, but is literally \"embedded\" in the metadata of every M9 .DNG. Which of course is why any image from a brand-new camera model using DNG can immediately be opened in ACR or LR without waiting until Adobe gets around to creating their own profile and publishing it in an update. M10 with a 5-year-old version of PS6? Opens right out of the Leica box. It can bootstrap itself because the profile already is right there in the DNG, alongside all the pixels. Probably 100 bytes or so (certainly less than 1kb) to list (in numeric code): color of top-left pixel (pixel order), image dimensions, base WB, base WB tint, contrast curve parameter, profile (hue/sat for red/green/blue, plus shadow tint) etc. etc. Everything ACR or LR need to know to open the image. Except your new versions won't do that for some reason. For grins, I tried opening a \"virgin\" M9 .DNG file in TextEdit, but of course all I see is a bunch of hexadecimal gibberish - not the right software to \"read\" even the metadata of a camera file. ______________ BTW, there appear to be quite a few of cases of problems with missing embedded or legacy profiles with LR/ACR updates - reported on the Adobe Help pages. And the sad part is that the Adobe techs don't always seem to know exactly what people are talking about, or how their own software operates. (e.g. \" 'Embedded' profiles mean the file is JPEG/TIFF/PSD.\" - really!?). (of course, a DNG is basically a 16-bit TIFF in a special \"wrapper.\") One suggestion is to delete (or simply remove to the desktop) the cameraprofiles folder, and then restart or reinstall LR (check the posts for details - don't take my word for it literally!!) https://forums.adobe.com/thread/2530710 https://forums.adobe.com/thread/2506892 There is also this:", "link": "https://www.l-camera-forum.com/topic/300928-m9-embedded-camera-profile-adobe-camera-raw/?tab=comments#comment-3810619", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " hey, dd - nope, no stand-alone m9 profile in the -----> location !!!  you specified. just an \"index.dat\" file that lists 100s of cameras, including m8 and s2 but not m9 (that i can see - i ran a text search on \"leica\"). file dated jan. 2014 i do think the m9 embedded profile is not a separate \"thing\" to be found elsewhere on a computer, but is literally \"embedded\" in the metadata of every m9 .dng. which of course is why any image from a brand-new camera model using dng can immediately be opened in acr or lr without waiting until adobe gets around to creating their own profile and publishing it in an update. m10 with a 5-year-old version of ps6? opens right out of the leica box. it can bootstrap itself because the profile already is right there in the dng, alongside all the pixels. probably 100 bytes or so (certainly less than 1kb) to list (in numeric code): color of top-left pixel (pixel order), image dimensions, base wb, base wb tint, contrast curve parameter, profile (hue/sat for red/green/blue, plus shadow tint) etc. etc. everything acr or lr need to know to open the image. except your new versions won't do that for some reason. for grins, i tried opening a \"virgin\" m9 .dng file in textedit, but of course all i see is a bunch of hexadecimal gibberish - not the right software to \"read\" even the metadata of a camera file. ______________ btw, there appear to be quite a few of cases of problems with missing embedded or legacy profiles with lr/acr updates - reported on the adobe help pages. and the sad part is that the adobe techs don't always seem to know exactly what people are talking about, or how their own software operates. (e.g. \" 'embedded' profiles mean the file is jpeg/tiff/psd.\" - really!?). (of course, a dng is basically a 16-bit tiff in a special \"wrapper.\") one suggestion is to delete (or simply remove to the desktop) the cameraprofiles folder, and then restart or reinstall lr (check the posts for details - don't take my word for it literally!!) https://forums.adobe.com/thread/2530710 https://forums.adobe.com/thread/2506892 there is also this:", "sortedWord": "None", "identifyer": 35065, "year": "2019"}, {"Unnamed: 0": 388497, "autor": "Lika", "date": 1547395620000, "content": " Hi I have a sporadic light leak which is proving very frustrating to figure out. I put two sets of adjacent frames below to show that this has a triangular profile and crosses the frame line. It’s been evaluated by an expert leica technician who couldn’t reproduce it. But when the camera comes back into my hands I get maybe 10% of the frames with the light leak. In other threads on other sites, people have commented that this kind of light leak can occur from the range finder window in the M2 camera. However, the technician who had the camera tells me that the M3 doesn’t have this kind of problem. In searching for leaks using a bright LED lamp, I see some light coming around the base of the lens at the lens mount, but I can’t see any other leaks anywhere else. It seems to me unlikely that this leak would account for the shape and location on the negatives. If anyone has an experience of a similar leak I would be most grateful for any comments or advice. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/293251-light-leak-with-leica-m3/?tab=comments#comment-3663833", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " hi i have a sporadic light leak which is proving very frustrating to figure out. i put two sets of adjacent frames below to show that this has a triangular profile and crosses the frame line. it’s been evaluated by an expert leica technician who couldn’t reproduce it. but when the camera comes back into my hands i get maybe 10% of the frames with the light leak. in other threads on other sites, people have commented that this kind of light leak can occur from the range finder window in the m2 camera. however, the technician who had the camera tells me that the m3 doesn’t have this kind of problem. in searching for leaks using a bright led lamp, i see some light coming around the base of the lens at the lens mount, but i can’t see any other leaks anywhere else. it seems to me unlikely that this leak would account for the shape and -----> location !!!  on the negatives. if anyone has an experience of a similar leak i would be most grateful for any comments or advice. --img-- --img-- ", "sortedWord": "None", "identifyer": 947, "year": "2019"}, {"Unnamed: 0": 390370, "autor": "dkmoore", "date": 1575726420000, "content": "7 hours ago, pridbor said: I have decided to send my M7 to Leica US and am now asking myself the question How to? It's the most valuable entity that I will send by mail and am worried that it will be lost underway. My question to you gents who have done it before, did you send it Certified and did you insure it? And did you package it yourself or had a professional do it for you! The latter is, at least sometimes, important as I have a friend who shipped a very delicate Sculpture and it broke. He got nothing from the insurer as they claimed that it could have been damaged beforehand, or because of his inadequate packaging. Thanks Preben I sell and buy a ton of Leica gear and I use USPS 100% of the time. I use priority service which is 2-3 days anywhere in the USA and shipping cameras with insurance is never more than $80.00. The best ways to ship are as follows (1 being the best): 1. put camera in original box. put the Cheetos like packing pieces all around the original Leica box inside a larger box. 2. If you don't have the original Leica box, put the camera in a plastic clean bag, wrap it in bubble wrap, and then put the camera in the middle of a bunch of the Cheetos looking packing. 3. If you don't have the Cheeto's like packing I just use a ton of the bubble wrap. I wrap the camera a few times and then I put bubble wrap below, on the sides, and on top of the camera (not nicely - ball it up etc to make shock absorbers). All of the packaging is available at USPS locations for reasonably cheap. Take a picture of the camera going into the box before hand and text it to someone so that you have the time stamp if you are overly concerned. If you are SUPER paranoid I would wait until have the holidays at this point to ship because if anything is going to happen it would probably be this time of year.", "link": "https://www.l-camera-forum.com/topic/304204-shipping-myyour-camera-how-to-do-it/?tab=comments#comment-3869100", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "7 hours ago, pridbor said: i have decided to send my m7 to leica us and am now asking myself the question how to? it's the most valuable entity that i will send by mail and am worried that it will be lost underway. my question to you gents who have done it before, did you send it certified and did you insure it? and did you package it yourself or had a professional do it for you! the latter is, at least sometimes, important as i have a friend who shipped a very delicate sculpture and it broke. he got nothing from the insurer as they claimed that it could have been damaged beforehand, or because of his inadequate packaging. thanks preben i sell and buy a ton of leica gear and i use usps 100% of the time. i use priority service which is 2-3 days anywhere in the usa and shipping cameras with insurance is never more than $80.00. the best ways to ship are as follows (1 being the best): 1. put camera in original box. put the cheetos like packing pieces all around the original leica box inside a larger box. 2. if you don't have the original leica box, put the camera in a plastic clean bag, wrap it in bubble wrap, and then put the camera in the middle of a bunch of the cheetos looking packing. 3. if you don't have the cheeto's like packing i just use a ton of the bubble wrap. i wrap the camera a few times and then i put bubble wrap below, on the sides, and on top of the camera (not nicely - ball it up etc to make shock absorbers). all of the packaging is available at usps -----> locations !!!  for reasonably cheap. take a picture of the camera going into the box before hand and text it to someone so that you have the time stamp if you are overly concerned. if you are super paranoid i would wait until have the holidays at this point to ship because if anything is going to happen it would probably be this time of year.", "sortedWord": "None", "identifyer": 2826, "year": "2019"}, {"Unnamed: 0": 392362, "autor": "Ildjarn", "date": 1566130740000, "content": "Just tried with VPN, indeed works. So it's something related to my location. Will try to reach out directly. Anyway. Alternatives?", "link": "https://www.l-camera-forum.com/topic/300426-good-cla-in-europe/?tab=comments#comment-3800440", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "just tried with vpn, indeed works. so it's something related to my -----> location !!! . will try to reach out directly. anyway. alternatives?", "sortedWord": "None", "identifyer": 4825, "year": "2019"}, {"Unnamed: 0": 404088, "autor": "kinch123", "date": 1577699760000, "content": "Hi from Hong Kong. 9 Days Photo & Camera and Rangefinder.com.hk are both good and reputable. I’ve made several purchases from 9 Days in the past and have no complaints. These have websites which are kept up-to-date. You may be lucky also if you go into an actual Leica store and flash cash or card and intimate that you’re a serious buyer and and then quote prices of items in stock at one or both of the above grey market dealers. In other words give them the impression that you’re aware of what’s what in Hong Kong. Not really about bargaining or haggling, more about showing them you know you have options. In addition to the official Leica Stores, there’s also Tin Cheung Camera store. They can be quite open to a bit of negotiation when they’re in the mood. Could try the Hong Kong Island Branch and ask for Queena. Have bought bodies and lenses from her and was happy with results. Lots of other options for 2nd hand lenses in Champagne Court, TST. David Chan’s store is famous. Definitely do *not* go into any ‘camera store’ at street level in Causeway Bay or TST — these guys are scammers — nobody can afford to be honest selling cameras at street level in these insanely expensive property price locations. Hope this helps. Cheers!", "link": "https://www.l-camera-forum.com/topic/304858-buying-leica-in-hong-kong/?tab=comments#comment-3881799", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "hi from hong kong. 9 days photo & camera and rangefinder.com.hk are both good and reputable. i’ve made several purchases from 9 days in the past and have no complaints. these have websites which are kept up-to-date. you may be lucky also if you go into an actual leica store and flash cash or card and intimate that you’re a serious buyer and and then quote prices of items in stock at one or both of the above grey market dealers. in other words give them the impression that you’re aware of what’s what in hong kong. not really about bargaining or haggling, more about showing them you know you have options. in addition to the official leica stores, there’s also tin cheung camera store. they can be quite open to a bit of negotiation when they’re in the mood. could try the hong kong island branch and ask for queena. have bought bodies and lenses from her and was happy with results. lots of other options for 2nd hand lenses in champagne court, tst. david chan’s store is famous. definitely do *not* go into any ‘camera store’ at street level in causeway bay or tst — these guys are scammers — nobody can afford to be honest selling cameras at street level in these insanely expensive property price -----> locations !!! . hope this helps. cheers!", "sortedWord": "None", "identifyer": 16848, "year": "2019"}, {"Unnamed: 0": 404090, "autor": "pedaes", "date": 1577723640000, "content": "6 hours ago, kinch123 said: Hi from Hong Kong. 9 Days Photo & Camera and Rangefinder.com.hk are both good and reputable. I’ve made several purchases from 9 Days in the past and have no complaints. These have websites which are kept up-to-date. You may be lucky also if you go into an actual Leica store and flash cash or card and intimate that you’re a serious buyer and and then quote prices of items in stock at one or both of the above grey market dealers. In other words give them the impression that you’re aware of what’s what in Hong Kong. Not really about bargaining or haggling, more about showing them you know you have options. In addition to the official Leica Stores, there’s also Tin Cheung Camera store. They can be quite open to a bit of negotiation when they’re in the mood. Could try the Hong Kong Island Branch and ask for Queena. Have bought bodies and lenses from her and was happy with results. Lots of other options for 2nd hand lenses in Champagne Court, TST. David Chan’s store is famous. Definitely do *not* go into any ‘camera store’ at street level in Causeway Bay or TST — these guys are scammers — nobody can afford to be honest selling cameras at street level in these insanely expensive property price locations. Hope this helps. Cheers! This is fantastic detailed advice for our OP. Deserves to be 'Pinned' IMHO.", "link": "https://www.l-camera-forum.com/topic/304858-buying-leica-in-hong-kong/?tab=comments#comment-3881981", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "6 hours ago, kinch123 said: hi from hong kong. 9 days photo & camera and rangefinder.com.hk are both good and reputable. i’ve made several purchases from 9 days in the past and have no complaints. these have websites which are kept up-to-date. you may be lucky also if you go into an actual leica store and flash cash or card and intimate that you’re a serious buyer and and then quote prices of items in stock at one or both of the above grey market dealers. in other words give them the impression that you’re aware of what’s what in hong kong. not really about bargaining or haggling, more about showing them you know you have options. in addition to the official leica stores, there’s also tin cheung camera store. they can be quite open to a bit of negotiation when they’re in the mood. could try the hong kong island branch and ask for queena. have bought bodies and lenses from her and was happy with results. lots of other options for 2nd hand lenses in champagne court, tst. david chan’s store is famous. definitely do *not* go into any ‘camera store’ at street level in causeway bay or tst — these guys are scammers — nobody can afford to be honest selling cameras at street level in these insanely expensive property price -----> locations !!! . hope this helps. cheers! this is fantastic detailed advice for our op. deserves to be 'pinned' imho.", "sortedWord": "None", "identifyer": 16850, "year": "2019"}, {"Unnamed: 0": 404405, "autor": "a.noctilux", "date": 1551523560000, "content": "Mark II, so we (there with my wife) were lucky having this clear day when I took the pictures, early February. No, not so far as Montjuic, location was Sants Estación taking advantage height from Torre Catalunya Edited March 2, 2019 by a.noctilux", "link": "https://www.l-camera-forum.com/topic/45272-in-praise-of-the-mandler-lenses/page/11/?tab=comments#comment-3693942", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "mark ii, so we (there with my wife) were lucky having this clear day when i took the pictures, early february. no, not so far as montjuic, -----> location !!!  was sants estación taking advantage height from torre catalunya edited march 2, 2019 by a.noctilux", "sortedWord": "None", "identifyer": 17165, "year": "2019"}, {"Unnamed: 0": 409853, "autor": "padam", "date": 1559748240000, "content": "It really depends on the location as well. Here for instance, 21/35 turned out to be a good pairing with the M240.", "link": "https://www.l-camera-forum.com/topic/297967-2-lens-kit-choice/?tab=comments#comment-3754130", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "it really depends on the -----> location !!!  as well. here for instance, 21/35 turned out to be a good pairing with the m240.", "sortedWord": "None", "identifyer": 22680, "year": "2019"}, {"Unnamed: 0": 409855, "autor": "Nick_S", "date": 1559752020000, "content": "I like 21, 35, and 90mm --- taking 35mm as a main lens, plus one of the other two depending on the location. External viewfinders such as the Voigtländer 21/25mm for the super-wide lens are very clear and relatively inexpensive. The other option which has been mentioned is 28 and 50, but I find 35 vs 50, or 28 vs 35 to be sufficiently distinct in their looks -- it is down to personal taste. The 21mm focal length is something special, while the 90mm is nice to have for travel, especially the tiny 90mm Macro Elmar. If I had to own only two lenses it would be 35 and 90mm. Nick Edited June 5, 2019 by Nick_S", "link": "https://www.l-camera-forum.com/topic/297967-2-lens-kit-choice/?tab=comments#comment-3754173", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i like 21, 35, and 90mm --- taking 35mm as a main lens, plus one of the other two depending on the -----> location !!! . external viewfinders such as the voigtländer 21/25mm for the super-wide lens are very clear and relatively inexpensive. the other option which has been mentioned is 28 and 50, but i find 35 vs 50, or 28 vs 35 to be sufficiently distinct in their looks -- it is down to personal taste. the 21mm focal length is something special, while the 90mm is nice to have for travel, especially the tiny 90mm macro elmar. if i had to own only two lenses it would be 35 and 90mm. nick edited june 5, 2019 by nick_s", "sortedWord": "None", "identifyer": 22682, "year": "2019"}, {"Unnamed: 0": 409860, "autor": "PPENHABRASIL", "date": 1559756220000, "content": "2 hours ago, padam said: It really depends on the location as well. Here for instance, 21/35 turned out to be a good pairing with the M240. Very interesting video...", "link": "https://www.l-camera-forum.com/topic/297967-2-lens-kit-choice/?tab=comments#comment-3754213", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "2 hours ago, padam said: it really depends on the -----> location !!!  as well. here for instance, 21/35 turned out to be a good pairing with the m240. very interesting video...", "sortedWord": "None", "identifyer": 22687, "year": "2019"}, {"Unnamed: 0": 414577, "autor": "jaapv", "date": 1572771660000, "content": " 1 hour ago, lykaman said: Rent a FF camera and appropriate lenses.. L Nonsense. The only thing you will do is increase the weight and make the rig more unwieldy. Full Frame is a handicap, not an advantage. A good MFT camera with the DG Vario-Elmar 100-400 is fantastic as well, but the CL with a long zoom and handgrip will beat any FF offering in practicality of use and IQ. (The latter if you you use the 90-280 (or 105-280). Forget about tripods. I do use a chest pod (an old Rowi one) It is very handy to keep your camera aimed. If the Safari vehicle is suitable, a bean-bag is handy. Take it empty and fill on location, or use a Polistyrene filling for weight. I am just back from Tanzania - Selous and the only lens I used was a Vario-Elmar-R 105-280. The focal length was ample, the image quality stunning. Actually my 55-135 stayed in the bag - I didn't use it once in the bush. Don't get hung up on AF. With wildlife and birds MF is often better. As critical focus is essential. (eyes and beaks) AF often struggles with fur and twigs will mess up the system. IS is useful, but, in the end, light will be good, Go to ISO 400 or 800 and your shutterspeed will be well above 1/1000th.Happy to answer any questions about destinations, camps, companies, places to go, etc. PM me if needed (and Mike, he is a pro, gave me some very good advice as well) CL + Vario-Elmar-R 105-280 --img--  For the rest of your trip, the CL with one or two zooms is a fantastic travel camera. Once again, a big DSLR is a handicap. It will be a barrier between you and your subjects and do you really want to carry all that in 30º+ ? Think street and people. But for Africa, do take a fast shortish prime. Africa after sunset is umm... dark and a flash is an atmosphere-killer. Another thought, be careful when you go. The seasons appear to be shifting. This year the rainy season was six weeks early and violent all around the equator. I can assure you that 50mm/hour for four days is no fun on a holiday. On the other hand, the light can be beautiful and the colours vibrant as soon as the sky breaks. Stone Town, Zanzibar --img-- ", "link": "https://www.l-camera-forum.com/topic/303064-telephoto-for-safari-panasonic-70-200-w-2x-vs-leica-90-280/?tab=comments#comment-3846807", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " 1 hour ago, lykaman said: rent a ff camera and appropriate lenses.. l nonsense. the only thing you will do is increase the weight and make the rig more unwieldy. full frame is a handicap, not an advantage. a good mft camera with the dg vario-elmar 100-400 is fantastic as well, but the cl with a long zoom and handgrip will beat any ff offering in practicality of use and iq. (the latter if you you use the 90-280 (or 105-280). forget about tripods. i do use a chest pod (an old rowi one) it is very handy to keep your camera aimed. if the safari vehicle is suitable, a bean-bag is handy. take it empty and fill on -----> location !!! , or use a polistyrene filling for weight. i am just back from tanzania - selous and the only lens i used was a vario-elmar-r 105-280. the focal length was ample, the image quality stunning. actually my 55-135 stayed in the bag - i didn't use it once in the bush. don't get hung up on af. with wildlife and birds mf is often better. as critical focus is essential. (eyes and beaks) af often struggles with fur and twigs will mess up the system. is is useful, but, in the end, light will be good, go to iso 400 or 800 and your shutterspeed will be well above 1/1000th.happy to answer any questions about destinations, camps, companies, places to go, etc. pm me if needed (and mike, he is a pro, gave me some very good advice as well) cl + vario-elmar-r 105-280 --img--  for the rest of your trip, the cl with one or two zooms is a fantastic travel camera. once again, a big dslr is a handicap. it will be a barrier between you and your subjects and do you really want to carry all that in 30º+ ? think street and people. but for africa, do take a fast shortish prime. africa after sunset is umm... dark and a flash is an atmosphere-killer. another thought, be careful when you go. the seasons appear to be shifting. this year the rainy season was six weeks early and violent all around the equator. i can assure you that 50mm/hour for four days is no fun on a holiday. on the other hand, the light can be beautiful and the colours vibrant as soon as the sky breaks. stone town, zanzibar --img-- ", "sortedWord": "None", "identifyer": 27513, "year": "2019"}, {"Unnamed: 0": 414579, "autor": "lykaman", "date": 1572774300000, "content": "42 minutes ago, jaapv said: Nonsense. The only thing you will do is increase the weight and make the rig more unwieldy. Full Frame is a handicap, not an advantage. A good MFT camera with the DG Vario-Elmar 100-400 is fantastic as well, but the CL with a long zoom and handgrip will beat any FF offering in practicality of use and IQ. (The latter if you you use the 90-280 (or 105-280). Forget about tripods. I do use a chest pod (an old Rowi one) It is very handy to keep your camera aimed. If the Safari vehicle is suitable, a bean-bag is handy. Take it empty and fill on location, or use a Polistyrene filling for weight. I am just back from Tanzania - Selous and the only lens I used was a Vario-Elmar-R 105-280. The focal length was ample, the image quality stunning. Actually my 55-135 stayed in the bag - I didn't use it once in the bush. Don't get hung up on AF. With wildlife and birds MF is often better. As critical focus is essential. (eyes and beaks) AF often struggles with fur and twigs will mess up the system. IS is useful, but, in the end, light will be good, Go to ISO 400 or 800 and your shutterspeed will be well above 1/1000th.Happy to answer any questions about destinations, camps, companies, places to go, etc. PM me if needed (and Mike, he is a pro, gave me some very good advice as well) CL + Vario-Elmar-R 105-280 --img--  For the rest of your trip, the CL with one or two zooms is a fantastic travel camera. Once again, a big DSLR is a handicap. It will be a barrier between you and your subjects and do you really want to carry all that in 30º+ ? Think street and people. But for Africa, do take a fast shortish prime. Africa after sunset is umm... dark and a flash is an atmosphere-killer. Another thought, be careful when you go. The seasons appear to be shifting. This year the rainy season was six weeks early and violent all around the equator. I can assure you that 50mm/hour for four days is no fun on a holiday. On the other hand, the light can be beautiful and the colours vibrant as soon as the sky breaks. Whilst I respect your views, \"Nonsense\" was uncalled for..IMHO would have been more appropriate... L", "link": "https://www.l-camera-forum.com/topic/303064-telephoto-for-safari-panasonic-70-200-w-2x-vs-leica-90-280/?tab=comments#comment-3846824", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "42 minutes ago, jaapv said: nonsense. the only thing you will do is increase the weight and make the rig more unwieldy. full frame is a handicap, not an advantage. a good mft camera with the dg vario-elmar 100-400 is fantastic as well, but the cl with a long zoom and handgrip will beat any ff offering in practicality of use and iq. (the latter if you you use the 90-280 (or 105-280). forget about tripods. i do use a chest pod (an old rowi one) it is very handy to keep your camera aimed. if the safari vehicle is suitable, a bean-bag is handy. take it empty and fill on -----> location !!! , or use a polistyrene filling for weight. i am just back from tanzania - selous and the only lens i used was a vario-elmar-r 105-280. the focal length was ample, the image quality stunning. actually my 55-135 stayed in the bag - i didn't use it once in the bush. don't get hung up on af. with wildlife and birds mf is often better. as critical focus is essential. (eyes and beaks) af often struggles with fur and twigs will mess up the system. is is useful, but, in the end, light will be good, go to iso 400 or 800 and your shutterspeed will be well above 1/1000th.happy to answer any questions about destinations, camps, companies, places to go, etc. pm me if needed (and mike, he is a pro, gave me some very good advice as well) cl + vario-elmar-r 105-280 --img--  for the rest of your trip, the cl with one or two zooms is a fantastic travel camera. once again, a big dslr is a handicap. it will be a barrier between you and your subjects and do you really want to carry all that in 30º+ ? think street and people. but for africa, do take a fast shortish prime. africa after sunset is umm... dark and a flash is an atmosphere-killer. another thought, be careful when you go. the seasons appear to be shifting. this year the rainy season was six weeks early and violent all around the equator. i can assure you that 50mm/hour for four days is no fun on a holiday. on the other hand, the light can be beautiful and the colours vibrant as soon as the sky breaks. whilst i respect your views, \"nonsense\" was uncalled for..imho would have been more appropriate... l", "sortedWord": "None", "identifyer": 27515, "year": "2019"}, {"Unnamed: 0": 416048, "autor": "nryn", "date": 1575856680000, "content": "I just finished a 4-day shoot for a book with an SL2, SF C1 and 3 flashes: an SF 60 and two MG-10s. I have wanted for some time to get away from bringing my huge strobes everywhere. A few notes: The MG-10s are excellent flashes and work well with the SF C1 and SL2. As reported in this thread and elsewhere, the SL2 has some hiccups when using with a flash: I couldn't get the flashes to fire consistently in A or S modes, nor could I figure out the conditions under which they either would or would not fire. It wasn't sync speed, TTL vs. M, or anything like that. It just seemed random, both in my testing before the shoot and whenever I tried to use A or S during the shoot. It wasn't a big deal--I usually expose manually when using flash anyway. But it's strange and I suspect it's a bug. HSS only works in TTL. I don't find TTL on the SL2 very good. Shooting from the same location, same exposure, same ambient light--I got exposures all over the place. Like with exposure mode on the camera, I went to manual on the flashes as well. The SF C1 is a nice piece of kit. I've used a number of remote triggers such as this, which allow you to control individual flash output independently, and I found this controller intuitive and slick. I like that it is low-profile and well-made. The SF 60 is OK; I ended up using it occasionally as a bounce flash to remove shadows and relied on the MG-10s for primary flash (to counter some strong sunlight from windows). Pretty happy with the results and extremely happy with the portability of this lighting kit. I don't think the Einsteins will come out of the drawer very often anymore.", "link": "https://www.l-camera-forum.com/topic/303662-leica-sl2-and-flash/?tab=comments#comment-3870028", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i just finished a 4-day shoot for a book with an sl2, sf c1 and 3 flashes: an sf 60 and two mg-10s. i have wanted for some time to get away from bringing my huge strobes everywhere. a few notes: the mg-10s are excellent flashes and work well with the sf c1 and sl2. as reported in this thread and elsewhere, the sl2 has some hiccups when using with a flash: i couldn't get the flashes to fire consistently in a or s modes, nor could i figure out the conditions under which they either would or would not fire. it wasn't sync speed, ttl vs. m, or anything like that. it just seemed random, both in my testing before the shoot and whenever i tried to use a or s during the shoot. it wasn't a big deal--i usually expose manually when using flash anyway. but it's strange and i suspect it's a bug. hss only works in ttl. i don't find ttl on the sl2 very good. shooting from the same -----> location !!! , same exposure, same ambient light--i got exposures all over the place. like with exposure mode on the camera, i went to manual on the flashes as well. the sf c1 is a nice piece of kit. i've used a number of remote triggers such as this, which allow you to control individual flash output independently, and i found this controller intuitive and slick. i like that it is low-profile and well-made. the sf 60 is ok; i ended up using it occasionally as a bounce flash to remove shadows and relied on the mg-10s for primary flash (to counter some strong sunlight from windows). pretty happy with the results and extremely happy with the portability of this lighting kit. i don't think the einsteins will come out of the drawer very often anymore.", "sortedWord": "None", "identifyer": 28991, "year": "2019"}, {"Unnamed: 0": 416054, "autor": "sillbeers15", "date": 1575966480000, "content": "On 12/9/2019 at 9:58 AM, etherfarm said: I just finished a 4-day shoot for a book with an SL2, SF C1 and 3 flashes: an SF 60 and two MG-10s. I have wanted for some time to get away from bringing my huge strobes everywhere. A few notes: The MG-10s are excellent flashes and work well with the SF C1 and SL2. As reported in this thread and elsewhere, the SL2 has some hiccups when using with a flash: I couldn't get the flashes to fire consistently in A or S modes, nor could I figure out the conditions under which they either would or would not fire. It wasn't sync speed, TTL vs. M, or anything like that. It just seemed random, both in my testing before the shoot and whenever I tried to use A or S during the shoot. It wasn't a big deal--I usually expose manually when using flash anyway. But it's strange and I suspect it's a bug. HSS only works in TTL. I don't find TTL on the SL2 very good. Shooting from the same location, same exposure, same ambient light--I got exposures all over the place. Like with exposure mode on the camera, I went to manual on the flashes as well. The SF C1 is a nice piece of kit. I've used a number of remote triggers such as this, which allow you to control individual flash output independently, and I found this controller intuitive and slick. I like that it is low-profile and well-made. The SF 60 is OK; I ended up using it occasionally as a bounce flash to remove shadows and relied on the MG-10s for primary flash (to counter some strong sunlight from windows). Pretty happy with the results and extremely happy with the portability of this lighting kit. I don't think the Einsteins will come out of the drawer very often anymore. I am also using MG10 & SF60. As you have mentioned that HSS only work in TTL mode. ie The camera shutter release trigger will not fire on SL when Manual is selected with a shutter speed above sync speed of 1/250 Sec. However on SL2, the same will allow camera shutter release to be triggered just no flash when flash selected on Manual and shutter speed of camera is above sync speed. You also mentioned you do not like to use TTL and therefore in A& S mode the shutter speed could have exceeded sync speed?", "link": "https://www.l-camera-forum.com/topic/303662-leica-sl2-and-flash/?tab=comments#comment-3870590", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on 12/9/2019 at 9:58 am, etherfarm said: i just finished a 4-day shoot for a book with an sl2, sf c1 and 3 flashes: an sf 60 and two mg-10s. i have wanted for some time to get away from bringing my huge strobes everywhere. a few notes: the mg-10s are excellent flashes and work well with the sf c1 and sl2. as reported in this thread and elsewhere, the sl2 has some hiccups when using with a flash: i couldn't get the flashes to fire consistently in a or s modes, nor could i figure out the conditions under which they either would or would not fire. it wasn't sync speed, ttl vs. m, or anything like that. it just seemed random, both in my testing before the shoot and whenever i tried to use a or s during the shoot. it wasn't a big deal--i usually expose manually when using flash anyway. but it's strange and i suspect it's a bug. hss only works in ttl. i don't find ttl on the sl2 very good. shooting from the same -----> location !!! , same exposure, same ambient light--i got exposures all over the place. like with exposure mode on the camera, i went to manual on the flashes as well. the sf c1 is a nice piece of kit. i've used a number of remote triggers such as this, which allow you to control individual flash output independently, and i found this controller intuitive and slick. i like that it is low-profile and well-made. the sf 60 is ok; i ended up using it occasionally as a bounce flash to remove shadows and relied on the mg-10s for primary flash (to counter some strong sunlight from windows). pretty happy with the results and extremely happy with the portability of this lighting kit. i don't think the einsteins will come out of the drawer very often anymore. i am also using mg10 & sf60. as you have mentioned that hss only work in ttl mode. ie the camera shutter release trigger will not fire on sl when manual is selected with a shutter speed above sync speed of 1/250 sec. however on sl2, the same will allow camera shutter release to be triggered just no flash when flash selected on manual and shutter speed of camera is above sync speed. you also mentioned you do not like to use ttl and therefore in a& s mode the shutter speed could have exceeded sync speed?", "sortedWord": "None", "identifyer": 28997, "year": "2019"}, {"Unnamed: 0": 419245, "autor": "nryn", "date": 1576974360000, "content": "On 12/8/2019 at 3:30 PM, jto555 said: Nissin is a cheap product that no professional would use. It really lets the whole system down. I’ve done studio/location work with ProFoto, Paul Buff, Elinchrom, and a number of proprietary and third-party flash systems (Nikon, Canon, Olympus, Metz, and now Leica/Nissin). I obviously cannot speak to your experience and I have no experience with other Nissin products but I’m not sure where the snobbery comes from. My recent experience with the Nissin MG-10 is all the evidence I need to know that it’s a first-rate flash system in just about every sense—connectivity, output, build quality, power options, etc. I do not think my Einsteins or ProFotos will come out of storage much. My issues using the system were (I suspect) actually with the SL2 camera’s flash implementation.", "link": "https://www.l-camera-forum.com/topic/287530-can-the-sf-c1-control-the-nissin-i60a-for-others-systems/?tab=comments#comment-3877298", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on 12/8/2019 at 3:30 pm, jto555 said: nissin is a cheap product that no professional would use. it really lets the whole system down. i’ve done studio/-----> location !!!  work with profoto, paul buff, elinchrom, and a number of proprietary and third-party flash systems (nikon, canon, olympus, metz, and now leica/nissin). i obviously cannot speak to your experience and i have no experience with other nissin products but i’m not sure where the snobbery comes from. my recent experience with the nissin mg-10 is all the evidence i need to know that it’s a first-rate flash system in just about every sense—connectivity, output, build quality, power options, etc. i do not think my einsteins or profotos will come out of storage much. my issues using the system were (i suspect) actually with the sl2 camera’s flash implementation.", "sortedWord": "None", "identifyer": 32255, "year": "2019"}, {"Unnamed: 0": 419246, "autor": "sillbeers15", "date": 1576978200000, "content": "59 minutes ago, nryn said: I’ve done studio/location work with ProFoto, Paul Buff, Elinchrom, and a number of proprietary and third-party flash systems (Nikon, Canon, Olympus, Metz, and now Leica/Nissin). I obviously cannot speak to your experience and I have no experience with other Nissin products but I’m not sure where the snobbery comes from. My recent experience with the Nissin MG-10 is all the evidence I need to know that it’s a first-rate flash system in just about every sense—connectivity, output, build quality, power options, etc. I do not think my Einsteins or ProFotos will come out of storage much. My issues using the system were (I suspect) actually with the SL2 camera’s flash implementation. The MG10 is the alternative to Godox popular AD200 which Leica OCF system can operate in TTL & HSS It is strong enough to fill the shadow of my subjects under intense backlighting situation where most single speedlights fail.", "link": "https://www.l-camera-forum.com/topic/287530-can-the-sf-c1-control-the-nissin-i60a-for-others-systems/?tab=comments#comment-3877322", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "59 minutes ago, nryn said: i’ve done studio/-----> location !!!  work with profoto, paul buff, elinchrom, and a number of proprietary and third-party flash systems (nikon, canon, olympus, metz, and now leica/nissin). i obviously cannot speak to your experience and i have no experience with other nissin products but i’m not sure where the snobbery comes from. my recent experience with the nissin mg-10 is all the evidence i need to know that it’s a first-rate flash system in just about every sense—connectivity, output, build quality, power options, etc. i do not think my einsteins or profotos will come out of storage much. my issues using the system were (i suspect) actually with the sl2 camera’s flash implementation. the mg10 is the alternative to godox popular ad200 which leica ocf system can operate in ttl & hss it is strong enough to fill the shadow of my subjects under intense backlighting situation where most single speedlights fail.", "sortedWord": "None", "identifyer": 32256, "year": "2019"}, {"Unnamed: 0": 419247, "autor": "jto555", "date": 1577454360000, "content": "On 12/22/2019 at 12:26 AM, nryn said: I’ve done studio/location work with ProFoto, Paul Buff, Elinchrom, and a number of proprietary and third-party flash systems (Nikon, Canon, Olympus, Metz, and now Leica/Nissin). I obviously cannot speak to your experience and I have no experience with other Nissin products but I’m not sure where the snobbery comes from. My recent experience with the Nissin MG-10 is all the evidence I need to know that it’s a first-rate flash system in just about every sense—connectivity, output, build quality, power options, etc. I do not think my Einsteins or ProFotos will come out of storage much. My issues using the system were (I suspect) actually with the SL2 camera’s flash implementation. I also have experience in studio work plus location work and have used Broncolor, Bowens, Multiblitz, Elinchrom, in the studio while Canon, Nikon, Metz and Leica/Metz Leica/Nissin, on location. My experience with Nissin is the i40. I am on my third one, not because I think they are wonderful but two stopped working on shots. The third one is still in its box! The build quality is not as good as Canon/Nikon, I am sure you will agree with that and the roter dial on the back can be moved off a setting too easily. I found out the hard way! The i60 seems to be a bigger version of the i40. The Nissin MG10, I have to admit that I have no experience with that flashgun. However it is a hammerhead flashgun so not easy to use with modifiers. But with Leica/Nissin that is it. If I shoot events I need on camera flash which will give me HSS, I would like TTL. Most importantly I need flashguns that are reliable. For me the Nissin is not. The systems I would like to see with 3rd party support for Leica are Godox and Profoto. (By the way, I am not involved/endorsed working for or have any relationship with these manufactures). Look at the range from Godox: 850ii, 860ii plus V1 (with a round head) for on camera flash and these are just the ones with lithium-ion batteries. Plus these flashguns have built in triggers to control off camera strobes. AD200, AD400, AD600, and an about to be released AD1200 for off camera strobes. These are just the battery powered range BUT you have to buy from a retailer for warranty cover not from Amazon or eBay. Profoto: A1X for on camera flash. B10 and B10plus (a small 500 watt second flash), B1X (a bigger 500 watt second flash). Again these are just the battery powered range. BUT a very expensive brand with great backup. So who needs this range of flash. Think a wedding photographer, sports photographer – not shooting a live sports events, portrait photographers, wildlife photographers. The list is endless so for the SL to be used by pro photographers Leica needs to get the flash implementation sorted out. Canon and Nikon can both use all the above flashguns with HSS and TTL. Sony can also plus they are now market leaders because the have the cameras where Canon and Nikon do not. The SL2 looks like a brilliant camera but for a pro it is crippled by not been able to use the strobes needed for the job. By the way, it is not snobbery to want to use the correct tools for the job. Edited December 27, 2019 by jto555", "link": "https://www.l-camera-forum.com/topic/287530-can-the-sf-c1-control-the-nissin-i60a-for-others-systems/?tab=comments#comment-3880428", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on 12/22/2019 at 12:26 am, nryn said: i’ve done studio/-----> location !!!  work with profoto, paul buff, elinchrom, and a number of proprietary and third-party flash systems (nikon, canon, olympus, metz, and now leica/nissin). i obviously cannot speak to your experience and i have no experience with other nissin products but i’m not sure where the snobbery comes from. my recent experience with the nissin mg-10 is all the evidence i need to know that it’s a first-rate flash system in just about every sense—connectivity, output, build quality, power options, etc. i do not think my einsteins or profotos will come out of storage much. my issues using the system were (i suspect) actually with the sl2 camera’s flash implementation. i also have experience in studio work plus location work and have used broncolor, bowens, multiblitz, elinchrom, in the studio while canon, nikon, metz and leica/metz leica/nissin, on location. my experience with nissin is the i40. i am on my third one, not because i think they are wonderful but two stopped working on shots. the third one is still in its box! the build quality is not as good as canon/nikon, i am sure you will agree with that and the roter dial on the back can be moved off a setting too easily. i found out the hard way! the i60 seems to be a bigger version of the i40. the nissin mg10, i have to admit that i have no experience with that flashgun. however it is a hammerhead flashgun so not easy to use with modifiers. but with leica/nissin that is it. if i shoot events i need on camera flash which will give me hss, i would like ttl. most importantly i need flashguns that are reliable. for me the nissin is not. the systems i would like to see with 3rd party support for leica are godox and profoto. (by the way, i am not involved/endorsed working for or have any relationship with these manufactures). look at the range from godox: 850ii, 860ii plus v1 (with a round head) for on camera flash and these are just the ones with lithium-ion batteries. plus these flashguns have built in triggers to control off camera strobes. ad200, ad400, ad600, and an about to be released ad1200 for off camera strobes. these are just the battery powered range but you have to buy from a retailer for warranty cover not from amazon or ebay. profoto: a1x for on camera flash. b10 and b10plus (a small 500 watt second flash), b1x (a bigger 500 watt second flash). again these are just the battery powered range. but a very expensive brand with great backup. so who needs this range of flash. think a wedding photographer, sports photographer – not shooting a live sports events, portrait photographers, wildlife photographers. the list is endless so for the sl to be used by pro photographers leica needs to get the flash implementation sorted out. canon and nikon can both use all the above flashguns with hss and ttl. sony can also plus they are now market leaders because the have the cameras where canon and nikon do not. the sl2 looks like a brilliant camera but for a pro it is crippled by not been able to use the strobes needed for the job. by the way, it is not snobbery to want to use the correct tools for the job. edited december 27, 2019 by jto555", "sortedWord": "None", "identifyer": 32257, "year": "2019"}, {"Unnamed: 0": 434609, "autor": "Chaemono", "date": 1549797060000, "content": "Am 6.2.2019 um 05:58 schrieb caissa: Experiences of a german team of photographers with the Panasonic S1 and S lenses in Fuerteventura. Positive and negative points (btw. a nice size comparison with Sigma 1.4/105 and 12-24) 45 minutes video in german (if you don't mind) but at least with real experiences (three day photo shooting), not only the feature lists that the Northrups sell us as \"truth about...this and that\" to get us as click-bait . Panasonic Lumix S1 Full Review / Praxisbericht ... - YouTubehttps://www.youtube.com/watch?v=gtCD9tEKS00 Excellent, impartial review. Great location for testing the camera. Spot on about the size of mirrorless bodies. Love the skin tones, BTW, even though the pictures shown are compressed, in-camera JPEGs.", "link": "https://www.l-camera-forum.com/topic/293871-is-the-s1s1r-a-good-backup-camera-for-sl/?tab=comments#comment-3681674", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "am 6.2.2019 um 05:58 schrieb caissa: experiences of a german team of photographers with the panasonic s1 and s lenses in fuerteventura. positive and negative points (btw. a nice size comparison with sigma 1.4/105 and 12-24) 45 minutes video in german (if you don't mind) but at least with real experiences (three day photo shooting), not only the feature lists that the northrups sell us as \"truth about...this and that\" to get us as click-bait . panasonic lumix s1 full review / praxisbericht ... - youtubehttps://www.youtube.com/watch?v=gtcd9teks00 excellent, impartial review. great -----> location !!!  for testing the camera. spot on about the size of mirrorless bodies. love the skin tones, btw, even though the pictures shown are compressed, in-camera jpegs.", "sortedWord": "None", "identifyer": 47838, "year": "2019"}, {"Unnamed: 0": 436384, "autor": "rpittal", "date": 1555118460000, "content": "1 hour ago, Stuart Richardson said: I am on a trip now, and found an S1. I decided to pick it up, to see if it can replace my Sonys, mostly for video. So far I am impressed. It is certainly more pleasurable to use with MF Leica lenses. I did not buy a lens, so right now I only have my M lenses, and I will by an S adapter L. One question I have at the moment, however, is whether it is possible to do focus stacking with MF lenses. I hope it is, but so far it appears like it might not be possible. I could not figure it out at least. It would be nice if it could be done in camera with non-AF lenses, given that none of my lenses support AF! AF is not all that important to me, but reading the manual, the amount given over to all the different permutations and settings for autofocus is pretty amazing...apart from sports, I am not sure what is so difficult about it, haha. The \"automatic\" focus stacking option on S1 (at least on my S1R) requires AF lenses and only outputs jpgs (unless I have overlooked something, which is certainly possible). Not at all like current Nikon focus stacking (focus \"shifting\") on the Zs and 850 which requires 3rd party software and AF lenses, but takes the images for you from your close focus to infinity. However, I do focus stacking frequently with my SL manually by simply moving the focus point from the bottom to the top of the frame and magnify and use manual focus at several locations and then blend with 3rd party software (Zerene Stacker).", "link": "https://www.l-camera-forum.com/topic/296129-questions-and-answers-re-s1-or-s1r/?tab=comments#comment-3721309", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "1 hour ago, stuart richardson said: i am on a trip now, and found an s1. i decided to pick it up, to see if it can replace my sonys, mostly for video. so far i am impressed. it is certainly more pleasurable to use with mf leica lenses. i did not buy a lens, so right now i only have my m lenses, and i will by an s adapter l. one question i have at the moment, however, is whether it is possible to do focus stacking with mf lenses. i hope it is, but so far it appears like it might not be possible. i could not figure it out at least. it would be nice if it could be done in camera with non-af lenses, given that none of my lenses support af! af is not all that important to me, but reading the manual, the amount given over to all the different permutations and settings for autofocus is pretty amazing...apart from sports, i am not sure what is so difficult about it, haha. the \"automatic\" focus stacking option on s1 (at least on my s1r) requires af lenses and only outputs jpgs (unless i have overlooked something, which is certainly possible). not at all like current nikon focus stacking (focus \"shifting\") on the zs and 850 which requires 3rd party software and af lenses, but takes the images for you from your close focus to infinity. however, i do focus stacking frequently with my sl manually by simply moving the focus point from the bottom to the top of the frame and magnify and use manual focus at several -----> locations !!!  and then blend with 3rd party software (zerene stacker).", "sortedWord": "None", "identifyer": 49619, "year": "2019"}, {"Unnamed: 0": 436385, "autor": "JeffWright", "date": 1555123800000, "content": "1 hour ago, rpittal said: The \"automatic\" focus stacking option on S1 (at least on my S1R) requires AF lenses and only outputs jpgs (unless I have overlooked something, which is certainly possible). Not at all like current Nikon focus stacking (focus \"shifting\") on the Zs and 850 which requires 3rd party software and AF lenses, but takes the images for you from your close focus to infinity. However, I do focus stacking frequently with my SL manually by simply moving the focus point from the bottom to the top of the frame and magnify and use manual focus at several locations and then blend with 3rd party software (Zerene Stacker). Are you sure about the jpg thing? With my S1R, the focus stacking works as one would expect (as per my onw experience Fujifilm and Nikon) on the S1R, at least in RAW mode, generating a series of RAW images with the (hard to predict) expected focusing interval. AF is required, of course. Automatic focus stacking modes won't work with MF lenses (on any camera manufacturer that I know of, for that matter). Edited April 13, 2019 by JeffWright", "link": "https://www.l-camera-forum.com/topic/296129-questions-and-answers-re-s1-or-s1r/?tab=comments#comment-3721328", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "1 hour ago, rpittal said: the \"automatic\" focus stacking option on s1 (at least on my s1r) requires af lenses and only outputs jpgs (unless i have overlooked something, which is certainly possible). not at all like current nikon focus stacking (focus \"shifting\") on the zs and 850 which requires 3rd party software and af lenses, but takes the images for you from your close focus to infinity. however, i do focus stacking frequently with my sl manually by simply moving the focus point from the bottom to the top of the frame and magnify and use manual focus at several -----> locations !!!  and then blend with 3rd party software (zerene stacker). are you sure about the jpg thing? with my s1r, the focus stacking works as one would expect (as per my onw experience fujifilm and nikon) on the s1r, at least in raw mode, generating a series of raw images with the (hard to predict) expected focusing interval. af is required, of course. automatic focus stacking modes won't work with mf lenses (on any camera manufacturer that i know of, for that matter). edited april 13, 2019 by jeffwright", "sortedWord": "None", "identifyer": 49620, "year": "2019"}, {"Unnamed: 0": 436599, "autor": "scott kirkpatrick", "date": 1571053740000, "content": "Hmmm. I think I see what you are looking at. Download this tiny section --img-- P1022461 copy(2) by scott kirkpatrick, on Flickr and then blow it up 4 or 8 times actual size: You get this: --img-- Screen Shot 2019-10-14 at 2.45.41 PM by scott kirkpatrick, on Flickr I think the row of white dots at the edge of the text is the result of moving the two 4-Bayer shot pixels that result from the 8 frames that HD takes into four locations, doubling the resolution of the original grid. There are probably better ways to do it. edit: I believe Hasselblad takes only four shots in one of their HR modes, eliminating the artifacts of de-mosaicing but leaving the same number of pixels. That seems to fit the spirit of \"the essentials\" better than what you see in this example. Edited October 14, 2019 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/302140-does-the-s1-produce-sharper-images-than-the-s1r/page/2/?tab=comments#comment-3835693", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "hmmm. i think i see what you are looking at. download this tiny section --img-- p1022461 copy(2) by scott kirkpatrick, on flickr and then blow it up 4 or 8 times actual size: you get this: --img-- screen shot 2019-10-14 at 2.45.41 pm by scott kirkpatrick, on flickr i think the row of white dots at the edge of the text is the result of moving the two 4-bayer shot pixels that result from the 8 frames that hd takes into four -----> locations !!! , doubling the resolution of the original grid. there are probably better ways to do it. edit: i believe hasselblad takes only four shots in one of their hr modes, eliminating the artifacts of de-mosaicing but leaving the same number of pixels. that seems to fit the spirit of \"the essentials\" better than what you see in this example. edited october 14, 2019 by scott kirkpatrick", "sortedWord": "None", "identifyer": 49834, "year": "2019"}, {"Unnamed: 0": 437394, "autor": "thighslapper", "date": 1552748460000, "content": "Hello folks ....... another quick update from a few hours testing ..... and I'm afraid it may not be particularly good news ...... I think you will find that M lenses under 90mm are going to give significantly worse peripheral performance than on the SL ... and the wider you, the worse it gets. Even the WATE is not completely immune. I tried the following this morning, Voigt 10mm, Voigt 12mm (old version), WATE, MATE, 21/3.4, Zeiss 35/1.4, Apo 50/2, Noct 50/0.95, 75/2, 90/4, wide open (f2 for the Nocti) The Voigt 10mm and 90/4 are perfect and all the rest have varying degrees of often fairly obvious peripheral smearing..... even the Apo 50/2 seems to be affected. On the worst it starts within the outer 1/3 of the frame. The R and SL lenses are unsurprisingly fine ...... I did have initial concerns about the SL 16-35 wide open on the S1R in the periphery ......but I think this was due to slight differences in location of the focal plane and the fact that the increased resolution shows up OOF areas more easily. This may also be a factor in making the problem more obvious on the M lenses. This is from JPG only ..... but I doubt RAW conversions are going to be much better. Peripheral colour casts are not particularly evident although there is vignetting. The only caveat is that it is blowing a gale still and the photos I took in the garden have some subject movement .... but there were enough static elements to be fairly confident in the results. I'm not bothering to post them as I can't be bothered to process/crop/label etc etc. The last time I did this I got in a right old muddle. Bear in mind these are fairly rough and ready quick tests ...... but the fact that appearances of the files is fairly consistent throughout the whole group makes me reasonably confident I am not imagining things. I'll do a selection of tripod based SL 16-35/24-90 based direct comparisons when the weather improves tomorrow. If performance of the 16-35 is not as good as on the SL then the camera is going back. The timed 60sec limit on exposure makes use for landscape a nuisance ..... having to use Bulb, extrapolating the exposure and then manually timing things is hardly 21st century photography. The only definitely compatible remote release is a crappy one like on the SL and equally overpriced. LENR is active up to 60 sec in Leica fashion but can be disabled .... I will have to check what the difference is in terms of image quality. Quite what happens beyond 60 seconds using bulb is unclear ..... . More testing to do. Edited March 16, 2019 by thighslapper", "link": "https://www.l-camera-forum.com/topic/294926-panasonic-s1-s1r-available-next-week/page/3/?tab=comments#comment-3703628", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "hello folks ....... another quick update from a few hours testing ..... and i'm afraid it may not be particularly good news ...... i think you will find that m lenses under 90mm are going to give significantly worse peripheral performance than on the sl ... and the wider you, the worse it gets. even the wate is not completely immune. i tried the following this morning, voigt 10mm, voigt 12mm (old version), wate, mate, 21/3.4, zeiss 35/1.4, apo 50/2, noct 50/0.95, 75/2, 90/4, wide open (f2 for the nocti) the voigt 10mm and 90/4 are perfect and all the rest have varying degrees of often fairly obvious peripheral smearing..... even the apo 50/2 seems to be affected. on the worst it starts within the outer 1/3 of the frame. the r and sl lenses are unsurprisingly fine ...... i did have initial concerns about the sl 16-35 wide open on the s1r in the periphery ......but i think this was due to slight differences in -----> location !!!  of the focal plane and the fact that the increased resolution shows up oof areas more easily. this may also be a factor in making the problem more obvious on the m lenses. this is from jpg only ..... but i doubt raw conversions are going to be much better. peripheral colour casts are not particularly evident although there is vignetting. the only caveat is that it is blowing a gale still and the photos i took in the garden have some subject movement .... but there were enough static elements to be fairly confident in the results. i'm not bothering to post them as i can't be bothered to process/crop/label etc etc. the last time i did this i got in a right old muddle. bear in mind these are fairly rough and ready quick tests ...... but the fact that appearances of the files is fairly consistent throughout the whole group makes me reasonably confident i am not imagining things. i'll do a selection of tripod based sl 16-35/24-90 based direct comparisons when the weather improves tomorrow. if performance of the 16-35 is not as good as on the sl then the camera is going back. the timed 60sec limit on exposure makes use for landscape a nuisance ..... having to use bulb, extrapolating the exposure and then manually timing things is hardly 21st century photography. the only definitely compatible remote release is a crappy one like on the sl and equally overpriced. lenr is active up to 60 sec in leica fashion but can be disabled .... i will have to check what the difference is in terms of image quality. quite what happens beyond 60 seconds using bulb is unclear ..... . more testing to do. edited march 16, 2019 by thighslapper", "sortedWord": "None", "identifyer": 50632, "year": "2019"}, {"Unnamed: 0": 437430, "autor": "scott kirkpatrick", "date": 1552891020000, "content": "11 hours ago, ron777 said: Always on, GPS, tends to be a power hog. Perhaps that is the reason for its omission. Not as big a power hog as keeping the wifi on full blast. I think Leica Fotos is trying to handle this by using BlueTooth to keep the phone and the camera synchronized, and wifi for uploading images. The Q2 is probably the first camera with which we will see this. You can set an M10-D to get its date and time information from the phone (over wifi), but I don't think they do this for other cameras yet. In some future world we will offload time and location tasks to our phones, which of course will always be with us, and cameras will be one of the devices that take advantage. For the M10-D of a traveller that crosses timezones, this is already an advantage.", "link": "https://www.l-camera-forum.com/topic/294926-panasonic-s1-s1r-available-next-week/page/5/?tab=comments#comment-3704784", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "11 hours ago, ron777 said: always on, gps, tends to be a power hog. perhaps that is the reason for its omission. not as big a power hog as keeping the wifi on full blast. i think leica fotos is trying to handle this by using bluetooth to keep the phone and the camera synchronized, and wifi for uploading images. the q2 is probably the first camera with which we will see this. you can set an m10-d to get its date and time information from the phone (over wifi), but i don't think they do this for other cameras yet. in some future world we will offload time and -----> location !!!  tasks to our phones, which of course will always be with us, and cameras will be one of the devices that take advantage. for the m10-d of a traveller that crosses timezones, this is already an advantage.", "sortedWord": "None", "identifyer": 50670, "year": "2019"}, {"Unnamed: 0": 437431, "autor": "mmradman", "date": 1552907040000, "content": "4 hours ago, scott kirkpatrick said: Not as big a power hog as keeping the wifi on full blast. I think Leica Fotos is trying to handle this by using BlueTooth to keep the phone and the camera synchronized, and wifi for uploading images. The Q2 is probably the first camera with which we will see this. You can set an M10-D to get its date and time information from the phone (over wifi), but I don't think they do this for other cameras yet. In some future world we will offload time and location tasks to our phones, which of course will always be with us, and cameras will be one of the devices that take advantage. For the M10-D of a traveller that crosses timezones, this is already an advantage. So keeping Bluetooth on on your phone will also drain phone's battery. Do you really want to hammer your phone battery and run out of juice when you may actually need to use phone, maybe to display your boarding pass or other ticket, or perhaps call emergency number? It seems to me designers of modern gadgets never venture far away from power mains socket.", "link": "https://www.l-camera-forum.com/topic/294926-panasonic-s1-s1r-available-next-week/page/5/?tab=comments#comment-3704885", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "4 hours ago, scott kirkpatrick said: not as big a power hog as keeping the wifi on full blast. i think leica fotos is trying to handle this by using bluetooth to keep the phone and the camera synchronized, and wifi for uploading images. the q2 is probably the first camera with which we will see this. you can set an m10-d to get its date and time information from the phone (over wifi), but i don't think they do this for other cameras yet. in some future world we will offload time and -----> location !!!  tasks to our phones, which of course will always be with us, and cameras will be one of the devices that take advantage. for the m10-d of a traveller that crosses timezones, this is already an advantage. so keeping bluetooth on on your phone will also drain phone's battery. do you really want to hammer your phone battery and run out of juice when you may actually need to use phone, maybe to display your boarding pass or other ticket, or perhaps call emergency number? it seems to me designers of modern gadgets never venture far away from power mains socket.", "sortedWord": "None", "identifyer": 50671, "year": "2019"}, {"Unnamed: 0": 437432, "autor": "scott kirkpatrick", "date": 1552916040000, "content": "2 hours ago, mmradman said: So keeping Bluetooth on on your phone will also drain phone's battery. Do you really want to hammer your phone battery and run out of juice when you may actually need to use phone, maybe to display your boarding pass or other ticket, or perhaps call emergency number? It seems to me designers of modern gadgets never venture far away from power mains socket. My phone keeps Bluetooth on all day, in addition to telling the phone network where it can be reached every few minutes, and keeping track of its location. My M10-D can only keep its wifi on for an hour. I think the key to low power networking is smarter software, which has to be on both ends of each connection. And the Bluetooth, because it has lower bandwidth, uses less power and perhaps costs less power to start and stop. Edit: a little Googling supports this. Phone protocols (Bluetooth and cellular data) have low startup and connection maintenance power requirements. But WiFi startup costs are high. It takes as much power to start up a wifi link as to transmit data continuously for about 15 seconds, in one study. Edited March 18, 2019 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/294926-panasonic-s1-s1r-available-next-week/page/5/?tab=comments#comment-3704962", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "2 hours ago, mmradman said: so keeping bluetooth on on your phone will also drain phone's battery. do you really want to hammer your phone battery and run out of juice when you may actually need to use phone, maybe to display your boarding pass or other ticket, or perhaps call emergency number? it seems to me designers of modern gadgets never venture far away from power mains socket. my phone keeps bluetooth on all day, in addition to telling the phone network where it can be reached every few minutes, and keeping track of its -----> location !!! . my m10-d can only keep its wifi on for an hour. i think the key to low power networking is smarter software, which has to be on both ends of each connection. and the bluetooth, because it has lower bandwidth, uses less power and perhaps costs less power to start and stop. edit: a little googling supports this. phone protocols (bluetooth and cellular data) have low startup and connection maintenance power requirements. but wifi startup costs are high. it takes as much power to start up a wifi link as to transmit data continuously for about 15 seconds, in one study. edited march 18, 2019 by scott kirkpatrick", "sortedWord": "None", "identifyer": 50672, "year": "2019"}, {"Unnamed: 0": 437435, "autor": "ron777", "date": 1552921020000, "content": "With the exception of photojournalists, those who work in war zones and forensic investigators, I have yet to find a personal use for GPS enabled cameras, of which I own 3, and or geotagged images. At the end of any shooting day, when I transfer my images from card to computer and catalogue same, I make a note of the shooting location and weather characteristics. Unless I am missing something crucial, I cannot see how the GPS coordinates would be of use. Perhaps you can enlighten me.", "link": "https://www.l-camera-forum.com/topic/294926-panasonic-s1-s1r-available-next-week/page/5/?tab=comments#comment-3705001", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "with the exception of photojournalists, those who work in war zones and forensic investigators, i have yet to find a personal use for gps enabled cameras, of which i own 3, and or geotagged images. at the end of any shooting day, when i transfer my images from card to computer and catalogue same, i make a note of the shooting -----> location !!!  and weather characteristics. unless i am missing something crucial, i cannot see how the gps coordinates would be of use. perhaps you can enlighten me.", "sortedWord": "None", "identifyer": 50675, "year": "2019"}, {"Unnamed: 0": 437680, "autor": "airscrew", "date": 1555235460000, "content": "24-105 on CL. +1/3 compensation in camera, adjusted it back to zero in Iridient Developer, cropped from top and bottom. ISO100 - 4.0 - 1/500 - 85. Location Janadarg near Baku at evening sun last week. --img--  Edited April 14, 2019 by airscrew", "link": "https://www.l-camera-forum.com/topic/295559-no-one-with-hands-on-experience-with-new-pana-lenses/page/2/?tab=comments#comment-3722031", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "24-105 on cl. +1/3 compensation in camera, adjusted it back to zero in iridient developer, cropped from top and bottom. iso100 - 4.0 - 1/500 - 85. -----> location !!!  janadarg near baku at evening sun last week. --img--  edited april 14, 2019 by airscrew", "sortedWord": "None", "identifyer": 50921, "year": "2019"}, {"Unnamed: 0": 437700, "autor": "thighslapper", "date": 1555106940000, "content": "9 minutes ago, caissa said: I am more interested in the S 24-105 (not pro) than in the primes to compare with the 24-90. It’s macro range is very attractive and it is also lighter and more compact than the 24-90. So I would also like to see a comparison at equal focal lengths. Wonder how much weaker it is than the 24-90, if at all. Maybe in practice differences in IQ are neglectable anyway ? I think most of us here on the forum buy Leica lenses because we can ...... rather than because we need to... There is a whole world out there perfectly happy with the quality of Tamron lenses ...... and taking great photos .... As has been pointed out by many a photographer ..... the 10000 euros spent on a Noctilux might be better used financing a few photographic trips to interesting locations ...", "link": "https://www.l-camera-forum.com/topic/296134-leica-24-90mm-vario-elmar-iq-vs-panasonic-s-pro-primes/?tab=comments#comment-3721259", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "9 minutes ago, caissa said: i am more interested in the s 24-105 (not pro) than in the primes to compare with the 24-90. it’s macro range is very attractive and it is also lighter and more compact than the 24-90. so i would also like to see a comparison at equal focal lengths. wonder how much weaker it is than the 24-90, if at all. maybe in practice differences in iq are neglectable anyway ? i think most of us here on the forum buy leica lenses because we can ...... rather than because we need to... there is a whole world out there perfectly happy with the quality of tamron lenses ...... and taking great photos .... as has been pointed out by many a photographer ..... the 10000 euros spent on a noctilux might be better used financing a few photographic trips to interesting -----> locations !!!  ...", "sortedWord": "None", "identifyer": 50941, "year": "2019"}, {"Unnamed: 0": 438191, "autor": "thighslapper", "date": 1554847140000, "content": "no ....... but if it was me I would search for panasonic dealers in Rome and see if the show any stock availability..... and buy direct in person while you are there. Plenty of German/Dutch dealerships have english versions of their websites and ship globally next day ..... but then you run into issues with shipping to an address different to the credit cardholder..... which is invariably difficult to circumvent. Might be easier to ask the hotel to have a hunt on the internet for dealers for you when you get there ..... they will know which is closest and may be able to check availability online. My quick hunt proved difficult as the pesky search engines always default to your current location.", "link": "https://www.l-camera-forum.com/topic/296075-s-series-battery-availability/?tab=comments#comment-3719257", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "no ....... but if it was me i would search for panasonic dealers in rome and see if the show any stock availability..... and buy direct in person while you are there. plenty of german/dutch dealerships have english versions of their websites and ship globally next day ..... but then you run into issues with shipping to an address different to the credit cardholder..... which is invariably difficult to circumvent. might be easier to ask the hotel to have a hunt on the internet for dealers for you when you get there ..... they will know which is closest and may be able to check availability online. my quick hunt proved difficult as the pesky search engines always default to your current -----> location !!! .", "sortedWord": "None", "identifyer": 51433, "year": "2019"}, {"Unnamed: 0": 438350, "autor": "LUF Admin", "date": 1549288500000, "content": " --img--  Panasonic has officially introduced the first Lumix S cameras featuring the Leica L-Mount. LUMIX S1 & Lumix S1R at a glance 24 MP (Lumix S1) and 47 MP (Lumix S1R) full format sensor New Venus Engine processor Leica L-Mount DFD-Contrast AF until -6EV Dual IS Image stabilizer: 5,5 EV body only, 6 EV with Lumix S OIS lenses 1/8.000 s shutter speed 1/320 s flash sync 9 fps continuous shooting, 6 fps with full C-AF 6k photo mode: 18 MP images at 30 fps max. standard ISO 51.200 (S1) or ISO 25.600 (S1R), extended untile ISO 51.200 / ISO 204.800 5,8 MP OLED electronic viewfinder with 120 fps Highres Shot with 96 (S1) or 187 megapixel (S1R) 4k 60p Video 2 memory card slots (SD and XQD) USB charging Lumix S1 / Lumix S1R Images Zitat Panasonic Launches New LUMIX S Series Full-frame Mirrorless Cameras LUMIX S1R and LUMIX S1 After the development announcement at Photokina 2018, Panasonic is now proud to introduce the full specifications of its long-awaited first full-frame Digital Single Lens Mirrorless cameras, the LUMIX S1R and S1, with a 35mm full-frame CMOS sensor. The new cameras are based on the L-Mount standard, which boasts a well-balanced, large inner diameter and compact dimensions for a flange focus to realize optimum size and performance as a mirrorless camera system. The LUMIX S Series aims for unprecedented image quality with high resolution, rich gradation and superior color reproduction. A high-speed, high-precision AF system based on advanced control technology over the lens, the sensor, and the new Venus Engine enable the user to capture the target in sharp focus without fail. The LUMIX S Series also boasts industry-leading video recording performance (4K 60p/50p*1), intuitive control, a rugged design for heavy field use, durability, and expandability. The LUMIX S1R integrates a 47.3-megapixel full-frame CMOS sensor (36mm x 24mm), which gives it the industry’s highest level of resolution in the full-frame mirrorless cameras*2, to pursue the ultimate power of expression. In addition to the precise reproduction capability in detail, this sensor achieves a high S/N ratio by taking advantage of its high light-condensing efficiency despite the large number of pixels. The LUMIX S1R features a High Resolution mode for the first time as a mirrorless full- frame camera to enable 187-megapixel ultra-high precision photo shooting. The LUMIX S1 comes with a 24.2-megapixel full-frame CMOS sensor (35.6mm x 23.8mm) that provides a wide dynamic range and excellent performance at high sensitivity in addition to a natural yet sharp image description thanks to sufficient light condensation per pixel. The LUMIX S1 supports professional use in videography by taking advantage of the stunning expression performance that a full- frame camera can offer. It records smooth 4K 60p/50p*1 video and enables full-pixel readout of signals in 4K 30p/25p*1 to save truly beautiful footage. Furthermore, the LUMIX S1 will comply with 4:2:2 10-bit 4K 30p/25p*1 internal video recording and 4K 60p/50p*1 HDMI output as well as V-Log, with a software upgrade key (to be sold separately) following soon in 2019. Panasonic’s advanced Contrast AF system with DFD technology has evolved through the development of numerous mirrorless cameras to make the AF system of the LUMIX S1R/S1 even more practical. It achieves not only the industry’s fastest level of focusing speed but also a tracking performance that is made possible by the adoption of Advanced AI Technology that accurately recognizes moving target subjects. The LUMIX S1R/S1 incorporates a Body I.S. (Image Stabilizer) to effectively compensate for the hand-shake movement. Combining the Body I.S.(5-axis) and the O.I.S. (Optical Image Stabilizer, 2-axis) in the LUMIX S Series lenses, the Dual I.S. 2*3 boasts even more powerful compensates for virtually any types of blur. Equipped with a high-resolution Real View Finder, Panasonic Corporation 2019 triaxial tilt rear monitor and high performance shutter unit with high durability, the rugged design LUMIX S1R/S1 provides the professional photographers with high reliability. Drawing on the vast expertise of the L-Mount Alliance with Leica Camera and Sigma, various interchangeable lenses are available for the LUMIX S Series. On the other hand, the LUMIX PRO service*4 has also launched to support professional work globally. As a pioneer of the Digital Single Lens Mirrorless camera, Panasonic has pursued innovations in technology under the vision of “Changing Photography”. Crystallizing all these digital and optical technologies, Panasonic is committed to introducing an unparalleled full-frame camera system without compromise for professional photographers and videographers. *1 PAL area only *2 As a Digital Single Lens Mirrorless Camera, as of February 1, 2019. *3 5-Axis Dual I.S.2 can be used with the lens S-R24105 and S-R70200 as of February 1, 2019. *4 Service is not available in some countries. 1. High picture quality made possible by the first LUMIX full-frame mirrorless camera Unprecedented picture quality and high descriptive performance The LUMIX S1R incorporates a new 47.3-megapixel CMOS sensor without LPF (Low Pass Filter) to realize high resolution and descriptive performance. This sensor adopts an aspherical lens for the on- chip micro lens to enhance light condensation. Together with the optimum design to concentrate more incoming light onto the photodiode, it achieves both high resolution and highly efficient light condensation performance. This results in the realization of the industry’s highest level of 47.3-megapixel resolution* in the full-frame mirrorless cameras at high S/N ratio and maximum ISO 25600 high sensitivity. The large amount of digital signals is processed by the new high-speed, high-performance image processor Venus Engine to render images with breathtaking description in both photo and video. * As a Digital Single Lens Mirrorless Camera, as of February 1, 2019. High image quality, high sensitivity performance The LUMIX S1 employs a 24.2-megapixel CMOS sensor. The new Venus Engine, which is exclusively tuned for the full-frame camera, and its Multipixel Luminance Generation and Intelligent Detail Processing realize natural, high-resolution expression while suppressing color moiré. Three- dimensional Color Control improves the color reproduction of both bright and shadow areas. This results in natural, true-to-life images from low to high sensitivity. Taking advantage of sufficient light condensation, the LUMIX S1 boasts a wide dynamic range and reproduces sharp images with exceptional clarity. Noise is minimized even when shot at maximum ISO 51200 high sensitivity. It is an ideal camera to use especially in low-light situations. An AR coating applied on the sensor of both LUMIX S1R/S1 minimizes ghost and flare even in backlighting. Combination with the high-quality LUMIX S Series lenses based on the L-Mount further enhances the potential of the camera. Plus, the LUMIX S1R/S1 integrates the Body I.S. (Image Stabilizer) for powerful handshake correction. Panasonic developed an algorithm that precisely calculates shake information acquired not only from a gyrosensor, but also from the image sensor and accelerometer sensor. This enables more accurate shake detection and compensation, making it possible to use a 5.5-stop slower shutter speed*1. Combining the Body I.S. (5-axis) in the camera and the O.I.S. (Optical Image Stabilizer, 2-axis) in the LUMIX S Series lens, the 5-axis Dual I.S. 2 compensates for larger movements that were conventionally uncontrollable. Maximizing both O.I.S and B.I.S. is highly beneficial in telephoto shots and in adverse situations, such as in low-light or with one-handed shooting with a 6-stop slower shutter speed*2. The 5- axis Dual I.S. 2 works for both photo and video recording, including 4K. The Body I.S. compensates for camera movement even when other L-Mount lenses without O.I.S. are used. Taking full advantage of its high-resolution sensor, the LUMIX S1R/S1 provides a High Resolution mode that faithfully reproduces precise details to be saved as beautiful, highly realistic RAW images. Eight consecutive images are automatically shot while shifting the sensor using the Body I.S. (Image Stabilizer) mechanism and synthesized into a 187-megapixel equivalent (16,736 x 11,168-pixel) image for LUMIX S1R and 96-megapixel equivalent (12,000 x 8,000-pixel) image for LUMIX S1 by the new Venus Engine, which boasts high-speed signal processing. This mode is suitable for taking natural landscapes or fine arts with delicate details. This magnificently high resolution photo is ideal for landscape photography of stationary subjects using a tripod. However, it can also be used in situations where moving subjects are included in the scene, by switching the sub mode. The HLG*3 Photo mode is a whole new style of photo expression that Panasonic proposes. It provides a wider dynamic range to reproduce light and shadow with more natural contrast. The HLG Photos can also be produced as an HSP file*4 with compressed high-brightness signals in stunning 8K resolution (7,680 x 4,320 in 16:9, with LUMIX S1R) or its full resolution (5,888 x 3,312, in 16:9, with LUMIX S1) in addition to JPEG/RAW files. It excels in the expression of lights, such as sparkling starlight or glaring sunlight. The user can playback these vibrant images on the latest Panasonic HLG-compliant 4KTV via HDMI cable connection or other HLG-compliant devices. It is also ideal for photo presentations by photographers. The high-precision shutter unit offers the highest shutter speed at a maximum 1/8000 second to capture spur-of-the-moment, fast moving subjects and to use a high-speed lens with a fully open aperture even outdoors for impressive defocusing. The external flash can be synchronized with the industry’s fastest shutter speed of a maximum 1/320 second.*5*6 *1 Based on the CIPA standard [Yaw/Pitch direction: focusing distance f=50mm, when S-X50 is used.] *2 Based on the CIPA standard [Yaw/Pitch direction: focusing distance f=200mm, when S-R70200 is used.] *3 “HLG (Hybrid Log Gamma)” is an international standard (ITU-R BT.2100) HDR format. *4 “HSP” is an HDR picture format using HLG format video technology. *5 The guide number decreases when the shutter speed is set to 1/320 of a second. *6 As a Digital Single Lens Mirrorless Camera, as of February 1, 2019. 2. High-speed, high-precision AF system Panasonic has achieved a high-speed AF with its advanced control technology over the major devices - lens, sensor and imaging engine. The lens and sensor communicate at a maximum 480 fps. Combining the Contrast AF with DFD technology, the LUMIX S1R/S1 realizes an ultra high-speed, high- precision AF of approximately 0.08 sec*1. The LUMIX S1R/S1 also boasts high speed burst shooting at 9 fps (AFS) or 6 fps (AFC). With its high subject tracking performance, the LUMIX S1R/S1 never loses the target subject. As a camera that excels in low-light shooting, the LUMIX S1R/S1 boasts -6EV*2 luminance detection performance with Low Light AF thanks to the higher sensitivity and optimized tuning of the sensor. The face/eye detection technology makes it possible to capture people in crisp focus, the Eye AF even detects the pupil of the eye and precisely focuses on it for impressive portrait shooting. The LUMIX S1R/S1 also incorporates Advanced AI Technology that detects specific subjects - humans and fast-moving animals, including canidae, felidae and birds. The camera keeps tracking these subjects even when they turn their back to the camera. For more continuous burst shooting, 6K PHOTO*3 makes it possible to capture unmissable moments at 30 fps by extracting the frame with the best timing out of a 6K burst file (in 4:3 or 3:2 aspect ratio) to save as an approximate 18-megapixel equivalent high resolution photo. The 4K PHOTO enables 60-fps high-speed captures in approximate 8-megapixel equivalent resolution. In 6K PHOTO /4K PHOTO, three exclusive modes can be chosen from depending on the situation; 6K Burst/4K Burst, 6K Burst (Start/Stop)/4K Burst (Start/Stop) and 6K Pre-burst/4K Pre-burst. Users can choose the most suitable burst shooting mode in addition to the regular consecutive shooting mode in full resolution depending on the situation. *1 11EV, at wide-end with S-R24105 (CIPA) in LVF120 fps setting. *2 At ISO100, F1.4, AFS *3 6K PHOTO’ is a high speed burst shooting function that cuts a still image out of a 4:3 or 3:2 video footage with approx.18-megapixel (approx. 6000 x 3000 effective pixel count) that the 6K image manages. 3. Operability from ingenuity for intuitive control The LVF (Live View Finder) is the key factor for completing the ultra high-speed response of the camera. The LUMIX S1R/S1 has the largest level of Real View Finder which boasts the world’s highest 5,760k-dot resolution.* The 0.78x magnification ratio can be switched to 0.7x or 0.74x according to the shooting situation. Adoption of a high-speed, high-precision OLED (Organic Light-Emitting Diode) for the LVF achieves smooth display at 60 fps/120 fps (switchable) and high-speed response with minimum time lag of less than 0.005 sec as well as 10,000:1 high contrast for exceptional visibility. With minimum distortion and high optical performance, this Real View Finder provides a natural view as seen with the naked eye. It is always sharp and clear from the center all the way to the corners. The 2,100K-dot high resolution monitor in 3:2 aspect ratio has adopted a triaxial tilt moving element to secure both durability and operational ease. It also has a touch control system. Live View Boost is another practical feature that makes it possible to check the composition even in total darkness by boosting the sensitivity just for live view. It also incorporates a Night mode that provides mild backlighting. It lets the user watch the subject comfortably even right after viewing the monitor while in a dark situation for a long time. The LUMIX S1R/S1 includes a largest-in-class Status LCD on the top, allowing users to check the settings at a glance. To make the camera just like a part of the photographer's body, the LUMIX S1R/S1 provides a firm grip, making it easy to hold for long periods. The control buttons and dials are located based on an ergonomic study to enable the user to concentrate on shooting. The adoption of an 8-directional joystick and refined UI (User Interface) also supports quick operation during shooting. In addition, illuminated buttons can be of help in low-light situations. An operation lock lever prevents unintentional operation, and the user can choose which operation to lock. * As a Digital Single Lens Mirrorless Camera, as of February 1, 2019. 4. Rugged design, reliability and expandability To be tough enough to withstand heavy field use, the main structure is composed of a magnesium alloy full die-cast front/rear frame. Robust construction and a sealing for every joint, dial, and button make the LUMIX S1R/S1 not only splash resistant* and dust resistant* but also freeze resistant down to - 10 degrees Centigrade. The shutter unit is also durable for approximately 400,000 cycles. The LUMIX S1R/S1 is equipped with a double Memory Card slot compatible with SD (UHS-II) or XQD Memory Cards for high-speed, high-capacity continuous data recording. Users can flexibly choose the recording method from Relay Recording, Backup Recording or Allocation Recording using the double slots. It will also be compatible with CFexpress in the near future. The 7.4-V 3,050 mAh high-capacity battery can be quickly charged via USB PD (USB Power Delivery) using the bundled USB3.1 Type-C cable. And it also realizes high-speed data transfer. A variety of new accessories are available for the LUMIX S1R/S1 including Remote Shutter (DMW- RS2), Eyecup (DMW-EC6), Battery Grip (DMW-BGS1) and Battery Charger (DMW-BTC14). The Battery Charger also complies with USB PD and enables quick power charging in approximately 2 hours. The camera can be used while charging via this adaptor. The conventional External Flash (DMW-FL580L / FL360L / FL200L) can also be mounted on the LUMIX S Series cameras. *Dust and Splash Resistant does not guarantee that damage will not occur if this camera is subjected to direct contact with dust and water. 5.Outstanding video recording performance in a full-frame camera 4K 60p/50p video recording for more creative freedom The LUMIX S1R is a camera designed and developed to boast exceptional performance in photography, yet is capable of 4K 60p/50p*1 video recording.*2 To elevate the video expression even more, a variety of effects are available for video recording. Exceptional video recording performance for professional videographers The LUMIX S1 features outstanding video performance for professional videography with 4K 60p/50p*1 recording. It realizes a crop factor of 1.0x in 4K 30p/25p*1/24p, which means that the user can record video in the original viewing angle of the lens. There is no recording time limit*3 for both 4K 30p/25p*1/24p and Full-HD video. Notably, the CMOS Sensor with high sensitivity on the LUMIX S1 achieves full-pixel readout for an excellent S/N ratio. The HDR (High Dynamic Range) video recording is available, which reproduces both the bright parts and dark parts of an image, making it look just like human eyes see it. The camera records video with a designated gamma curve compatible with ITU-R BT.2100, and you can now choose Hybrid Log Gamma (HLG) in Photo Style. The LUMIX S1 further expands its potential with a firmware update including 4:2:2 10-bit 4K 30p/25p*1 internal video recording and 4K 60p/50p HDMI output as well as V-Log, with a Software Upgrade Key (to be sold separately) following soon in 2019. As a camera from Panasonic that has been overstepping the limit of video performance in digital cameras, a host of functions are available on the LUMIX S1R/S1. The High Speed Video lets users record slow motion video in 4K (maximum 60 fps/ 50 fps*1) and FHD (maximum 180 fps /150 fps). For the terminal, an HDMI Type A is provided. Plus, a cable lock holder for the HDMI cable is included in the LUMIX S1R/S1 to prevent unplugging trouble on location. LINE input is also supported by a 3.5-mm microphone jack. This makes it possible to input sounds from an external audio device, for more efficient video production. A 3.5-mm headphone jack is also available. In addition, it complies with the Microphone Adaptor DMW-XLR1 (sold separately), which is a plug-in type adaptor for an XLR microphone to record high-quality stereo sound. It is ideal for lip-sync recording. Dedicated switches allow direct, quick control. MIC, LINE and CONDENSER MICROPHONES are switchable. *1 PAL area only. *2 Maximum 15 minutes in 4K60p and unlimited recording time in Full HD until the SD Memory Card becomes full or the battery runs out. *3 Maximum 29 minutes 59 seconds in 4K60p until the SD Memory Card becomes full or the battery runs out. - When the ambient temperature is high or continuous recording is performed, the camera may stop the recording to protect itself. Wait until the camera cools down (*2*3). 6. Other Features ・Photo Style featuring a new Flat mode To shorten post-processing work, JPEG photos can be adjusted precisely according to the photographer’s intention. The LUMIX S1R/S1 also provides a Flat mode that features a plain finish with less contrast and saturation for versatile use. ・Variable aspect ratios with new 65:24 and 2:1 In addition to the standard 3:2, 4:3, 16:9 and 1:1, 65:24 (Film Panorama) and 2:1 (6 x 12 cm) aspect ratios are available for photo shooting. ・I.S. Status Scope The user can consciously remove the cause of shake by checking a pointer that indicates the camera’s shaking condition. It is available while the viewfinder or rear monitor blacks out even during a long-time exposure. ・Flicker Decrease When the flickering of a fluorescent light is detected, the camera indicates it and releases the shutter when its effect is the least to suppress the discontinuity of exposure or color across a sequence of photos. *Not available in 6K PHOTO, 4K PHOTO and Post Focus. ・Highlight Weighted Light Metering Mode The Highlight Weighted Light Metering Mode meters light with the priority on highlighted parts, to prevent it from washing out. ・New AWBw Auto White Balance mode In Auto White Balance, a new AWBw that retains a reddish tint is available in addition to conventional AWB (standard) and AWBc (bluish tint). AWBw reproduces healthy, rosy skin color even under fluorescent light. ・Bluetooth 4.2 and Wi-Fi 5GHz (IEEE802.11ac)* / 2.4GHz (IEEE802.11b/g/n) Compatibility with Bluetooth 4.2 (called BLE: Bluetooth Low Energy) enables constant connection with a smartphone/tablet with minimum power consumption. The settings of a LUMIX S1R/S1 camera can also be copied and transmitted wirelessly to other S1R/S1 cameras when using multiple S1R/S1 cameras*1. Also, Wi-Fi 5GHz (IEEE802.11ac)*2 is effective in addition to 2.4GHz (IEEE802.11b/g/n.) This provides even secure and stable connection not only with a smartphone/tablet but also with other devices on location for smooth remote control. Transmission speed of photo/video data is also increased up by using the 5GHz-band*2. *1 The Settings of LUMIX S1R can be copied to S1R only and the settings of LUMIX S1 can be copied to S1 only. *2 5GHz Wi-Fi is not available in some countries. ・Lumix Tether This software enables tethered shooting via USB. Users can control the camera by connecting it to a PC via USB. It lets you view the image on a large PC screen while shooting, which is helpful in commercial photoshoots of portraits, products and so on, where continuous confirmation is required. You can use [6K PHOTO] [4K PHOTO] and start and stop video recording with tethered shooting. It is also possible to choose the folder to save the image files in the PC. ・Lumix Sync Lumix Sync is a new application for iOS/Android devices, which enables photo transmission to a smartphone or tablet via easy wireless connection. It also allows remote control of the camera using a smartphone or tablet. •Leica is a registered trademark of Leica Microsystems IR GmbH. •L-Mount is a trademark or registered trademark of Leica Camera AG. •Android and Google Play are trademarks or registered trademarks of Google Inc. • IOS is a trademark or registered trademark of Cisco in the U.S. and other countries and is used under license. •XQD is a trademark of Sony Corporation. •All other company and product names are trademarks of their respective corporations. •Some accessories are not available in some countries. •The use of recorded or printed materials that are protected by copyright for any purpose other than personal enjoyment is prohibited, as it would infringe upon the rights of the copyright holder. •Design and specifications are subject to change without notice.", "link": "https://www.l-camera-forum.com/topic/293988-lumix-s1-s1r-panasonics-l-mount-cameras/?tab=comments#comment-3677958", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " --img--  panasonic has officially introduced the first lumix s cameras featuring the leica l-mount. lumix s1 & lumix s1r at a glance 24 mp (lumix s1) and 47 mp (lumix s1r) full format sensor new venus engine processor leica l-mount dfd-contrast af until -6ev dual is image stabilizer: 5,5 ev body only, 6 ev with lumix s ois lenses 1/8.000 s shutter speed 1/320 s flash sync 9 fps continuous shooting, 6 fps with full c-af 6k photo mode: 18 mp images at 30 fps max. standard iso 51.200 (s1) or iso 25.600 (s1r), extended untile iso 51.200 / iso 204.800 5,8 mp oled electronic viewfinder with 120 fps highres shot with 96 (s1) or 187 megapixel (s1r) 4k 60p video 2 memory card slots (sd and xqd) usb charging lumix s1 / lumix s1r images zitat panasonic launches new lumix s series full-frame mirrorless cameras lumix s1r and lumix s1 after the development announcement at photokina 2018, panasonic is now proud to introduce the full specifications of its long-awaited first full-frame digital single lens mirrorless cameras, the lumix s1r and s1, with a 35mm full-frame cmos sensor. the new cameras are based on the l-mount standard, which boasts a well-balanced, large inner diameter and compact dimensions for a flange focus to realize optimum size and performance as a mirrorless camera system. the lumix s series aims for unprecedented image quality with high resolution, rich gradation and superior color reproduction. a high-speed, high-precision af system based on advanced control technology over the lens, the sensor, and the new venus engine enable the user to capture the target in sharp focus without fail. the lumix s series also boasts industry-leading video recording performance (4k 60p/50p*1), intuitive control, a rugged design for heavy field use, durability, and expandability. the lumix s1r integrates a 47.3-megapixel full-frame cmos sensor (36mm x 24mm), which gives it the industry’s highest level of resolution in the full-frame mirrorless cameras*2, to pursue the ultimate power of expression. in addition to the precise reproduction capability in detail, this sensor achieves a high s/n ratio by taking advantage of its high light-condensing efficiency despite the large number of pixels. the lumix s1r features a high resolution mode for the first time as a mirrorless full- frame camera to enable 187-megapixel ultra-high precision photo shooting. the lumix s1 comes with a 24.2-megapixel full-frame cmos sensor (35.6mm x 23.8mm) that provides a wide dynamic range and excellent performance at high sensitivity in addition to a natural yet sharp image description thanks to sufficient light condensation per pixel. the lumix s1 supports professional use in videography by taking advantage of the stunning expression performance that a full- frame camera can offer. it records smooth 4k 60p/50p*1 video and enables full-pixel readout of signals in 4k 30p/25p*1 to save truly beautiful footage. furthermore, the lumix s1 will comply with 4:2:2 10-bit 4k 30p/25p*1 internal video recording and 4k 60p/50p*1 hdmi output as well as v-log, with a software upgrade key (to be sold separately) following soon in 2019. panasonic’s advanced contrast af system with dfd technology has evolved through the development of numerous mirrorless cameras to make the af system of the lumix s1r/s1 even more practical. it achieves not only the industry’s fastest level of focusing speed but also a tracking performance that is made possible by the adoption of advanced ai technology that accurately recognizes moving target subjects. the lumix s1r/s1 incorporates a body i.s. (image stabilizer) to effectively compensate for the hand-shake movement. combining the body i.s.(5-axis) and the o.i.s. (optical image stabilizer, 2-axis) in the lumix s series lenses, the dual i.s. 2*3 boasts even more powerful compensates for virtually any types of blur. equipped with a high-resolution real view finder, panasonic corporation 2019 triaxial tilt rear monitor and high performance shutter unit with high durability, the rugged design lumix s1r/s1 provides the professional photographers with high reliability. drawing on the vast expertise of the l-mount alliance with leica camera and sigma, various interchangeable lenses are available for the lumix s series. on the other hand, the lumix pro service*4 has also launched to support professional work globally. as a pioneer of the digital single lens mirrorless camera, panasonic has pursued innovations in technology under the vision of “changing photography”. crystallizing all these digital and optical technologies, panasonic is committed to introducing an unparalleled full-frame camera system without compromise for professional photographers and videographers. *1 pal area only *2 as a digital single lens mirrorless camera, as of february 1, 2019. *3 5-axis dual i.s.2 can be used with the lens s-r24105 and s-r70200 as of february 1, 2019. *4 service is not available in some countries. 1. high picture quality made possible by the first lumix full-frame mirrorless camera unprecedented picture quality and high descriptive performance the lumix s1r incorporates a new 47.3-megapixel cmos sensor without lpf (low pass filter) to realize high resolution and descriptive performance. this sensor adopts an aspherical lens for the on- chip micro lens to enhance light condensation. together with the optimum design to concentrate more incoming light onto the photodiode, it achieves both high resolution and highly efficient light condensation performance. this results in the realization of the industry’s highest level of 47.3-megapixel resolution* in the full-frame mirrorless cameras at high s/n ratio and maximum iso 25600 high sensitivity. the large amount of digital signals is processed by the new high-speed, high-performance image processor venus engine to render images with breathtaking description in both photo and video. * as a digital single lens mirrorless camera, as of february 1, 2019. high image quality, high sensitivity performance the lumix s1 employs a 24.2-megapixel cmos sensor. the new venus engine, which is exclusively tuned for the full-frame camera, and its multipixel luminance generation and intelligent detail processing realize natural, high-resolution expression while suppressing color moiré. three- dimensional color control improves the color reproduction of both bright and shadow areas. this results in natural, true-to-life images from low to high sensitivity. taking advantage of sufficient light condensation, the lumix s1 boasts a wide dynamic range and reproduces sharp images with exceptional clarity. noise is minimized even when shot at maximum iso 51200 high sensitivity. it is an ideal camera to use especially in low-light situations. an ar coating applied on the sensor of both lumix s1r/s1 minimizes ghost and flare even in backlighting. combination with the high-quality lumix s series lenses based on the l-mount further enhances the potential of the camera. plus, the lumix s1r/s1 integrates the body i.s. (image stabilizer) for powerful handshake correction. panasonic developed an algorithm that precisely calculates shake information acquired not only from a gyrosensor, but also from the image sensor and accelerometer sensor. this enables more accurate shake detection and compensation, making it possible to use a 5.5-stop slower shutter speed*1. combining the body i.s. (5-axis) in the camera and the o.i.s. (optical image stabilizer, 2-axis) in the lumix s series lens, the 5-axis dual i.s. 2 compensates for larger movements that were conventionally uncontrollable. maximizing both o.i.s and b.i.s. is highly beneficial in telephoto shots and in adverse situations, such as in low-light or with one-handed shooting with a 6-stop slower shutter speed*2. the 5- axis dual i.s. 2 works for both photo and video recording, including 4k. the body i.s. compensates for camera movement even when other l-mount lenses without o.i.s. are used. taking full advantage of its high-resolution sensor, the lumix s1r/s1 provides a high resolution mode that faithfully reproduces precise details to be saved as beautiful, highly realistic raw images. eight consecutive images are automatically shot while shifting the sensor using the body i.s. (image stabilizer) mechanism and synthesized into a 187-megapixel equivalent (16,736 x 11,168-pixel) image for lumix s1r and 96-megapixel equivalent (12,000 x 8,000-pixel) image for lumix s1 by the new venus engine, which boasts high-speed signal processing. this mode is suitable for taking natural landscapes or fine arts with delicate details. this magnificently high resolution photo is ideal for landscape photography of stationary subjects using a tripod. however, it can also be used in situations where moving subjects are included in the scene, by switching the sub mode. the hlg*3 photo mode is a whole new style of photo expression that panasonic proposes. it provides a wider dynamic range to reproduce light and shadow with more natural contrast. the hlg photos can also be produced as an hsp file*4 with compressed high-brightness signals in stunning 8k resolution (7,680 x 4,320 in 16:9, with lumix s1r) or its full resolution (5,888 x 3,312, in 16:9, with lumix s1) in addition to jpeg/raw files. it excels in the expression of lights, such as sparkling starlight or glaring sunlight. the user can playback these vibrant images on the latest panasonic hlg-compliant 4ktv via hdmi cable connection or other hlg-compliant devices. it is also ideal for photo presentations by photographers. the high-precision shutter unit offers the highest shutter speed at a maximum 1/8000 second to capture spur-of-the-moment, fast moving subjects and to use a high-speed lens with a fully open aperture even outdoors for impressive defocusing. the external flash can be synchronized with the industry’s fastest shutter speed of a maximum 1/320 second.*5*6 *1 based on the cipa standard [yaw/pitch direction: focusing distance f=50mm, when s-x50 is used.] *2 based on the cipa standard [yaw/pitch direction: focusing distance f=200mm, when s-r70200 is used.] *3 “hlg (hybrid log gamma)” is an international standard (itu-r bt.2100) hdr format. *4 “hsp” is an hdr picture format using hlg format video technology. *5 the guide number decreases when the shutter speed is set to 1/320 of a second. *6 as a digital single lens mirrorless camera, as of february 1, 2019. 2. high-speed, high-precision af system panasonic has achieved a high-speed af with its advanced control technology over the major devices - lens, sensor and imaging engine. the lens and sensor communicate at a maximum 480 fps. combining the contrast af with dfd technology, the lumix s1r/s1 realizes an ultra high-speed, high- precision af of approximately 0.08 sec*1. the lumix s1r/s1 also boasts high speed burst shooting at 9 fps (afs) or 6 fps (afc). with its high subject tracking performance, the lumix s1r/s1 never loses the target subject. as a camera that excels in low-light shooting, the lumix s1r/s1 boasts -6ev*2 luminance detection performance with low light af thanks to the higher sensitivity and optimized tuning of the sensor. the face/eye detection technology makes it possible to capture people in crisp focus, the eye af even detects the pupil of the eye and precisely focuses on it for impressive portrait shooting. the lumix s1r/s1 also incorporates advanced ai technology that detects specific subjects - humans and fast-moving animals, including canidae, felidae and birds. the camera keeps tracking these subjects even when they turn their back to the camera. for more continuous burst shooting, 6k photo*3 makes it possible to capture unmissable moments at 30 fps by extracting the frame with the best timing out of a 6k burst file (in 4:3 or 3:2 aspect ratio) to save as an approximate 18-megapixel equivalent high resolution photo. the 4k photo enables 60-fps high-speed captures in approximate 8-megapixel equivalent resolution. in 6k photo /4k photo, three exclusive modes can be chosen from depending on the situation; 6k burst/4k burst, 6k burst (start/stop)/4k burst (start/stop) and 6k pre-burst/4k pre-burst. users can choose the most suitable burst shooting mode in addition to the regular consecutive shooting mode in full resolution depending on the situation. *1 11ev, at wide-end with s-r24105 (cipa) in lvf120 fps setting. *2 at iso100, f1.4, afs *3 6k photo’ is a high speed burst shooting function that cuts a still image out of a 4:3 or 3:2 video footage with approx.18-megapixel (approx. 6000 x 3000 effective pixel count) that the 6k image manages. 3. operability from ingenuity for intuitive control the lvf (live view finder) is the key factor for completing the ultra high-speed response of the camera. the lumix s1r/s1 has the largest level of real view finder which boasts the world’s highest 5,760k-dot resolution.* the 0.78x magnification ratio can be switched to 0.7x or 0.74x according to the shooting situation. adoption of a high-speed, high-precision oled (organic light-emitting diode) for the lvf achieves smooth display at 60 fps/120 fps (switchable) and high-speed response with minimum time lag of less than 0.005 sec as well as 10,000:1 high contrast for exceptional visibility. with minimum distortion and high optical performance, this real view finder provides a natural view as seen with the naked eye. it is always sharp and clear from the center all the way to the corners. the 2,100k-dot high resolution monitor in 3:2 aspect ratio has adopted a triaxial tilt moving element to secure both durability and operational ease. it also has a touch control system. live view boost is another practical feature that makes it possible to check the composition even in total darkness by boosting the sensitivity just for live view. it also incorporates a night mode that provides mild backlighting. it lets the user watch the subject comfortably even right after viewing the monitor while in a dark situation for a long time. the lumix s1r/s1 includes a largest-in-class status lcd on the top, allowing users to check the settings at a glance. to make the camera just like a part of the photographer's body, the lumix s1r/s1 provides a firm grip, making it easy to hold for long periods. the control buttons and dials are located based on an ergonomic study to enable the user to concentrate on shooting. the adoption of an 8-directional joystick and refined ui (user interface) also supports quick operation during shooting. in addition, illuminated buttons can be of help in low-light situations. an operation lock lever prevents unintentional operation, and the user can choose which operation to lock. * as a digital single lens mirrorless camera, as of february 1, 2019. 4. rugged design, reliability and expandability to be tough enough to withstand heavy field use, the main structure is composed of a magnesium alloy full die-cast front/rear frame. robust construction and a sealing for every joint, dial, and button make the lumix s1r/s1 not only splash resistant* and dust resistant* but also freeze resistant down to - 10 degrees centigrade. the shutter unit is also durable for approximately 400,000 cycles. the lumix s1r/s1 is equipped with a double memory card slot compatible with sd (uhs-ii) or xqd memory cards for high-speed, high-capacity continuous data recording. users can flexibly choose the recording method from relay recording, backup recording or allocation recording using the double slots. it will also be compatible with cfexpress in the near future. the 7.4-v 3,050 mah high-capacity battery can be quickly charged via usb pd (usb power delivery) using the bundled usb3.1 type-c cable. and it also realizes high-speed data transfer. a variety of new accessories are available for the lumix s1r/s1 including remote shutter (dmw- rs2), eyecup (dmw-ec6), battery grip (dmw-bgs1) and battery charger (dmw-btc14). the battery charger also complies with usb pd and enables quick power charging in approximately 2 hours. the camera can be used while charging via this adaptor. the conventional external flash (dmw-fl580l / fl360l / fl200l) can also be mounted on the lumix s series cameras. *dust and splash resistant does not guarantee that damage will not occur if this camera is subjected to direct contact with dust and water. 5.outstanding video recording performance in a full-frame camera 4k 60p/50p video recording for more creative freedom the lumix s1r is a camera designed and developed to boast exceptional performance in photography, yet is capable of 4k 60p/50p*1 video recording.*2 to elevate the video expression even more, a variety of effects are available for video recording. exceptional video recording performance for professional videographers the lumix s1 features outstanding video performance for professional videography with 4k 60p/50p*1 recording. it realizes a crop factor of 1.0x in 4k 30p/25p*1/24p, which means that the user can record video in the original viewing angle of the lens. there is no recording time limit*3 for both 4k 30p/25p*1/24p and full-hd video. notably, the cmos sensor with high sensitivity on the lumix s1 achieves full-pixel readout for an excellent s/n ratio. the hdr (high dynamic range) video recording is available, which reproduces both the bright parts and dark parts of an image, making it look just like human eyes see it. the camera records video with a designated gamma curve compatible with itu-r bt.2100, and you can now choose hybrid log gamma (hlg) in photo style. the lumix s1 further expands its potential with a firmware update including 4:2:2 10-bit 4k 30p/25p*1 internal video recording and 4k 60p/50p hdmi output as well as v-log, with a software upgrade key (to be sold separately) following soon in 2019. as a camera from panasonic that has been overstepping the limit of video performance in digital cameras, a host of functions are available on the lumix s1r/s1. the high speed video lets users record slow motion video in 4k (maximum 60 fps/ 50 fps*1) and fhd (maximum 180 fps /150 fps). for the terminal, an hdmi type a is provided. plus, a cable lock holder for the hdmi cable is included in the lumix s1r/s1 to prevent unplugging trouble on -----> location !!! . line input is also supported by a 3.5-mm microphone jack. this makes it possible to input sounds from an external audio device, for more efficient video production. a 3.5-mm headphone jack is also available. in addition, it complies with the microphone adaptor dmw-xlr1 (sold separately), which is a plug-in type adaptor for an xlr microphone to record high-quality stereo sound. it is ideal for lip-sync recording. dedicated switches allow direct, quick control. mic, line and condenser microphones are switchable. *1 pal area only. *2 maximum 15 minutes in 4k60p and unlimited recording time in full hd until the sd memory card becomes full or the battery runs out. *3 maximum 29 minutes 59 seconds in 4k60p until the sd memory card becomes full or the battery runs out. - when the ambient temperature is high or continuous recording is performed, the camera may stop the recording to protect itself. wait until the camera cools down (*2*3). 6. other features ・photo style featuring a new flat mode to shorten post-processing work, jpeg photos can be adjusted precisely according to the photographer’s intention. the lumix s1r/s1 also provides a flat mode that features a plain finish with less contrast and saturation for versatile use. ・variable aspect ratios with new 65:24 and 2:1 in addition to the standard 3:2, 4:3, 16:9 and 1:1, 65:24 (film panorama) and 2:1 (6 x 12 cm) aspect ratios are available for photo shooting. ・i.s. status scope the user can consciously remove the cause of shake by checking a pointer that indicates the camera’s shaking condition. it is available while the viewfinder or rear monitor blacks out even during a long-time exposure. ・flicker decrease when the flickering of a fluorescent light is detected, the camera indicates it and releases the shutter when its effect is the least to suppress the discontinuity of exposure or color across a sequence of photos. *not available in 6k photo, 4k photo and post focus. ・highlight weighted light metering mode the highlight weighted light metering mode meters light with the priority on highlighted parts, to prevent it from washing out. ・new awbw auto white balance mode in auto white balance, a new awbw that retains a reddish tint is available in addition to conventional awb (standard) and awbc (bluish tint). awbw reproduces healthy, rosy skin color even under fluorescent light. ・bluetooth 4.2 and wi-fi 5ghz (ieee802.11ac)* / 2.4ghz (ieee802.11b/g/n) compatibility with bluetooth 4.2 (called ble: bluetooth low energy) enables constant connection with a smartphone/tablet with minimum power consumption. the settings of a lumix s1r/s1 camera can also be copied and transmitted wirelessly to other s1r/s1 cameras when using multiple s1r/s1 cameras*1. also, wi-fi 5ghz (ieee802.11ac)*2 is effective in addition to 2.4ghz (ieee802.11b/g/n.) this provides even secure and stable connection not only with a smartphone/tablet but also with other devices on location for smooth remote control. transmission speed of photo/video data is also increased up by using the 5ghz-band*2. *1 the settings of lumix s1r can be copied to s1r only and the settings of lumix s1 can be copied to s1 only. *2 5ghz wi-fi is not available in some countries. ・lumix tether this software enables tethered shooting via usb. users can control the camera by connecting it to a pc via usb. it lets you view the image on a large pc screen while shooting, which is helpful in commercial photoshoots of portraits, products and so on, where continuous confirmation is required. you can use [6k photo] [4k photo] and start and stop video recording with tethered shooting. it is also possible to choose the folder to save the image files in the pc. ・lumix sync lumix sync is a new application for ios/android devices, which enables photo transmission to a smartphone or tablet via easy wireless connection. it also allows remote control of the camera using a smartphone or tablet. •leica is a registered trademark of leica microsystems ir gmbh. •l-mount is a trademark or registered trademark of leica camera ag. •android and google play are trademarks or registered trademarks of google inc. • ios is a trademark or registered trademark of cisco in the u.s. and other countries and is used under license. •xqd is a trademark of sony corporation. •all other company and product names are trademarks of their respective corporations. •some accessories are not available in some countries. •the use of recorded or printed materials that are protected by copyright for any purpose other than personal enjoyment is prohibited, as it would infringe upon the rights of the copyright holder. •design and specifications are subject to change without notice.", "sortedWord": "None", "identifyer": 51592, "year": "2019"}, {"Unnamed: 0": 439021, "autor": "sturkel", "date": 1555613580000, "content": "A macro from the same location. --img-- ", "link": "https://www.l-camera-forum.com/topic/303026-leica-q2-images-post-them-here/page/12/?tab=comments#comment-3724994", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a macro from the same -----> location !!! . --img-- ", "sortedWord": "None", "identifyer": 52305, "year": "2019"}, {"Unnamed: 0": 439055, "autor": "vikasmg", "date": 1556156880000, "content": "11 hours ago, nitesoul said: so cool, i want to go there just to see the airport lol! Given that I've lived here for so long, I think Singapore is arguably the easiest airport anywhere to leave from or arrive at. And to transit through. This new addition is probably going to be of most interest to transit passengers, of which there are many. And locals who just want to shop or dine at the newest cool location.", "link": "https://www.l-camera-forum.com/topic/303026-leica-q2-images-post-them-here/page/14/?tab=comments#comment-3728903", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "11 hours ago, nitesoul said: so cool, i want to go there just to see the airport lol! given that i've lived here for so long, i think singapore is arguably the easiest airport anywhere to leave from or arrive at. and to transit through. this new addition is probably going to be of most interest to transit passengers, of which there are many. and locals who just want to shop or dine at the newest cool -----> location !!! .", "sortedWord": "None", "identifyer": 52343, "year": "2019"}, {"Unnamed: 0": 440296, "autor": "stuny", "date": 1565376300000, "content": "Though I don't know your answer the focus point moves based on pressing the four locations (N-S-E-W) on the round button on the back right of the camera when the camera is on. Perhaps you've had the camera on while it was hanging from your shoulder, and accidentally pressed that button, kind of like \"butt dialing\" your phone?", "link": "https://www.l-camera-forum.com/topic/300150-q-how-to-lock-the-focus-point-in-the-center/?tab=comments#comment-3794549", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "though i don't know your answer the focus point moves based on pressing the four -----> locations !!!  (n-s-e-w) on the round button on the back right of the camera when the camera is on. perhaps you've had the camera on while it was hanging from your shoulder, and accidentally pressed that button, kind of like \"butt dialing\" your phone?", "sortedWord": "None", "identifyer": 53634, "year": "2019"}, {"Unnamed: 0": 442945, "autor": "zampelis", "date": 1555576320000, "content": "I am sorry for your problem, I can completely understand how you feel as it is happening on my brand new Leica Q replacement. I initially thought that it was a 3.0 firmware option not to do focus and exposure lock by half pressing the shutter button. Apparently I was still using 2.0 on my old one. Then I realised that some times it worked properly. And then I found out that the shutter button (the inner button, not the ring that turns the camera on/off and selected shooting modes) rotates freely and when it is aligned on specific locations, then something strange happens: If you have half pressed and locked focus/exposure and then decide to fully press the button to take the photo, at the point that the button clicks, for a fraction of a second the contact of the button gets lost, the press gets released and if you still keep pressing it, it then makes contact again and it tries to refocus again.. This has many implications: You can't lock focus and exposure by half pressing the button in auto focus mode. When in manual focus mode some times you press the shutter button and it doesn't take a photo if you instantly release it - or the completely opposite: it takes 2 and 3 photos even when in single shot mode if you keep it pressed for a bit longer (we are always talking about a fraction of a second). This is very frustrating with electronic shutter as there is not a feedback that the photo was taken. I have ended up missing a large amount of shots because of this. And also when in continuous shooting mode, the shots get interrupted and instead of shooting 10-12 photos and stacking them in a single stack, it takes random amount of shots and creates random number of different stacks. It is obviously a mechanical problem and from what I can see something that has happened to other people, not just me. I don't know if I want to go through the nightmare of Leica's engineer expertise again and wait another 4 months just not to have my camera fixed. I will have a chat with my local dealer and I will probably sell it for good.. Issues like these should have been spotted on first place on brand new cameras of such a price before they get in the box. Also the fact that mine is a silver makes me feel that they may not even have a silver shutter button to replace it judging from their response to the previous problem I had... Edited April 18, 2019 by zampelis", "link": "https://www.l-camera-forum.com/topic/292183-af-not-locking-properly/page/2/?tab=comments#comment-3724613", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i am sorry for your problem, i can completely understand how you feel as it is happening on my brand new leica q replacement. i initially thought that it was a 3.0 firmware option not to do focus and exposure lock by half pressing the shutter button. apparently i was still using 2.0 on my old one. then i realised that some times it worked properly. and then i found out that the shutter button (the inner button, not the ring that turns the camera on/off and selected shooting modes) rotates freely and when it is aligned on specific -----> locations !!! , then something strange happens: if you have half pressed and locked focus/exposure and then decide to fully press the button to take the photo, at the point that the button clicks, for a fraction of a second the contact of the button gets lost, the press gets released and if you still keep pressing it, it then makes contact again and it tries to refocus again.. this has many implications: you can't lock focus and exposure by half pressing the button in auto focus mode. when in manual focus mode some times you press the shutter button and it doesn't take a photo if you instantly release it - or the completely opposite: it takes 2 and 3 photos even when in single shot mode if you keep it pressed for a bit longer (we are always talking about a fraction of a second). this is very frustrating with electronic shutter as there is not a feedback that the photo was taken. i have ended up missing a large amount of shots because of this. and also when in continuous shooting mode, the shots get interrupted and instead of shooting 10-12 photos and stacking them in a single stack, it takes random amount of shots and creates random number of different stacks. it is obviously a mechanical problem and from what i can see something that has happened to other people, not just me. i don't know if i want to go through the nightmare of leica's engineer expertise again and wait another 4 months just not to have my camera fixed. i will have a chat with my local dealer and i will probably sell it for good.. issues like these should have been spotted on first place on brand new cameras of such a price before they get in the box. also the fact that mine is a silver makes me feel that they may not even have a silver shutter button to replace it judging from their response to the previous problem i had... edited april 18, 2019 by zampelis", "sortedWord": "None", "identifyer": 6323, "year": "2019"}, {"Unnamed: 0": 447373, "autor": "dkCambridgeshire", "date": 1552900860000, "content": "Aquariums are useful … Heather Angel uses them 'on location' … but I prefer the challenge of taking a photo in a natural habitat. Regarding exposing the X1 to 'such risk' … it's a digital tool camera and being electronic likely has a more finite life than e.g. an M3 or a 1A. And I enjoy stretching a camera beyond its normal limits … especially if it's a cost effective project with potentially interesting results. D-Lux or Pana cameras are fine (I have a 4 years old Leica C) but for exhibition prints, APS-C and FF cameras have the edge - especially as regards dynamic range. dunk", "link": "https://www.l-camera-forum.com/topic/295055-leica-x1-underwater-housing/?tab=comments#comment-3704855", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "aquariums are useful … heather angel uses them 'on -----> location !!! ' … but i prefer the challenge of taking a photo in a natural habitat. regarding exposing the x1 to 'such risk' … it's a digital tool camera and being electronic likely has a more finite life than e.g. an m3 or a 1a. and i enjoy stretching a camera beyond its normal limits … especially if it's a cost effective project with potentially interesting results. d-lux or pana cameras are fine (i have a 4 years old leica c) but for exhibition prints, aps-c and ff cameras have the edge - especially as regards dynamic range. dunk", "sortedWord": "None", "identifyer": 10847, "year": "2019"}, {"Unnamed: 0": 452376, "autor": "Ando", "date": 1566937560000, "content": "The same dragon-fly, other location --img--  4 K picture modus", "link": "https://www.l-camera-forum.com/topic/301766-please-post-v-lux-5-pictures-here/page/2/?tab=comments#comment-3807589", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "the same dragon-fly, other -----> location !!!  --img--  4 k picture modus", "sortedWord": "None", "identifyer": 15965, "year": "2019"}], "name": "locationL-Forum2019"}