{"interestingcomments": [{"Unnamed: 0": 342179, "autor": "Alberti", "date": 1634286300000, "content": "I have had the same. It happened when I connected an SD card reader to my Ipad, as a method to store images while on vacation. The loading went so slow (not always) so I disconnected the card after about 15 minutes. I saw some files were bad copied. When I imported the same file later in LR Mobile, that went well. It was not a card issue. After that mistreatment I selected smaller batches for transfer and let them finish. All images that were 'in transit' - several files are copied at the same time by the file management system - were concatenated. So about 10 of the 200 images were damaged. Some had a band, and looked like a barber shop sign like your third, one had a grey band. I got some pretty abstract works this way. Some I recovered after I saw it - by copying those files again. It circumstantial was with a Lexar card. But that is not the culprit. --img--  The next I added a NIK-polaroid effect because it fitted so well, it now looks like a failed Polaroid development. Imagine. My own abstract expressionism generator. [When at school, I 'painted' like this a few times.] --img--  --img--  Edited October 15 by Alberti", "link": "https://www.l-camera-forum.com/topic/325393-m10-r-occasional-images-are-corrupt/?tab=comments#comment-4292958", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "i have had the same. it happened when i connected an sd card reader to my ipad, as a method to store images while on vacation. the loading went so slow (not always) so i disconnected the card after about 15 minutes. i saw some files were bad copied. when i imported the same file later in lr mobile, that went well. it was not a card issue. after that mistreatment i selected smaller batches for transfer and let them finish. all images that were 'in transit' - several files are copied at the same time by the -----> file !!!  -----> management !!!  system - were concatenated. so about 10 of the 200 images were damaged. some had a band, and looked like a barber shop sign like your third, one had a grey band. i got some pretty abstract works this way. some i recovered after i saw it - by copying those files again. it circumstantial was with a lexar card. but that is not the culprit. --img--  the next i added a nik-polaroid effect because it fitted so well, it now looks like a failed polaroid development. imagine. my own abstract expressionism generator. [when at school, i 'painted' like this a few times.] --img--  --img--  edited october 15 by alberti", "sortedWord": "None", "identifyer": 3250, "year": "2021"}, {"Unnamed: 0": 349538, "autor": "Al Brown", "date": 1611997740000, "content": "10 hours ago, LeicaS2 said: If someone tells me how to work on the RAW file in LR or PS I'd appreciate it. Here is the full video on perspective control (in German, but use CC subtitles), including the Lightroom file management and opening part:https://en.leica-camera.com/Photography/Leica-M/Leica-M10-R/Technical-Insights --img--  Edited January 30 by Al Brown", "link": "https://www.l-camera-forum.com/topic/317447-firmware-update-perspective-correction-for-the-leica-m10-p-m10-r-and-m10-monochrom/page/2/?tab=comments#comment-4128785", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "10 hours ago, leicas2 said: if someone tells me how to work on the raw file in lr or ps i'd appreciate it. here is the full video on perspective control (in german, but use cc subtitles), including the lightroom -----> file !!!  -----> management !!!  and opening part:https://en.leica-camera.com/photography/leica-m/leica-m10-r/technical-insights --img--  edited january 30 by al brown", "sortedWord": "None", "identifyer": 10641, "year": "2021"}], "name": "managementL-Forum2021"}