{"interestingcomments": [{"Unnamed: 0": 358769, "autor": "Me Leica!", "date": 1545885360000, "content": " Bit of a long-winded title, but the gist is this : if you see someone wielding a Leica - particularly a new, expensive one - in a way which demonstrates that they clearly have no idea what they're doing with it , does it bother you? A little, a lot, not at all? Couple of examples might help. I was in one of the most famous camera shops in Japan (where I live), Map Camera in Shinjuku. Definitely worth a visit if you happen to be in Tokyo, by the way. The basement floor is for Leicas, Hasselblads, medium format, etc. A month or so ago I was browsing there and there was a guy testing out a Leica. I couldn't see precisely which one, but I'm certain it was a digital M, just from the shape. So, however you cut it, not a cheap camera - and Map Camera is not known for generous pricing; if anything it's the opposite. He was holding it up to his eye and looking all Bresson-ish, when the following conversation took place between him and the shop assistant. Man carrying considerably expensive camera and lens combination : \"What is this figure in red here?\" Shop staff, extremely politely : \"That is the shutter speed, Sir\". My conclusion : man with enough cash to buy a modern digital M plus lens doesn't recognize shutter speed when he sees it. Secondly - a few days ago - I was out shooting the remains of the superb autumn foliage we get here. There was another person doing the same thing. Again, I couldn't tell for sure but at a glance it looked very much like another digital M in his hands. The guy was shooting it by holding it out in front of him, arms locked out with the strap around his neck, and contorting his body to look through the rear screen (meaning that it couldn't have been an M8 or M9 / monochrom(e?), so an M240 or newer). Now it could of course have been the case that his rangefinder was out and he had to use the rear screen, but the way he was leaning back, tilting his head and basically doing an olympic gymnastics routine to get the framing where he wanted it, suggested otherwise. I've seen quite a lot of this around here : you don't see that many digital Ms in the wild, but when you do I'd estimate that at least half the users shoot as if they were carrying something like a Sony RX-1. I'm all for people shooting whatever they want, but I have to admit to a bit of eye-rolling at the above two examples; they strike me as giving credence to the notion, held by some, that some Leica users have far more money than sense / photographic talent. Does this sort of thing bother you at all? Or are you all zen about it?", "link": "https://www.l-camera-forum.com/topic/292641-do-you-assume-a-certain-level-of-knowledge-of-a-leica-shooter/?tab=comments#comment-3653585", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " bit of a long-winded title, but the gist is this : if you see someone wielding a leica - particularly a new, expensive one - in a way which demonstrates that they clearly have no idea what they're doing with it , does it bother you? a little, a lot, not at all? couple of examples might help. i was in one of the most famous camera shops in japan (where i live), -----> map !!!  camera in shinjuku. definitely worth a visit if you happen to be in tokyo, by the way. the basement floor is for leicas, hasselblads, medium format, etc. a month or so ago i was browsing there and there was a guy testing out a leica. i couldn't see precisely which one, but i'm certain it was a digital m, just from the shape. so, however you cut it, not a cheap camera - and map camera is not known for generous pricing; if anything it's the opposite. he was holding it up to his eye and looking all bresson-ish, when the following conversation took place between him and the shop assistant. man carrying considerably expensive camera and lens combination : \"what is this figure in red here?\" shop staff, extremely politely : \"that is the shutter speed, sir\". my conclusion : man with enough cash to buy a modern digital m plus lens doesn't recognize shutter speed when he sees it. secondly - a few days ago - i was out shooting the remains of the superb autumn foliage we get here. there was another person doing the same thing. again, i couldn't tell for sure but at a glance it looked very much like another digital m in his hands. the guy was shooting it by holding it out in front of him, arms locked out with the strap around his neck, and contorting his body to look through the rear screen (meaning that it couldn't have been an m8 or m9 / monochrom(e?), so an m240 or newer). now it could of course have been the case that his rangefinder was out and he had to use the rear screen, but the way he was leaning back, tilting his head and basically doing an olympic gymnastics routine to get the framing where he wanted it, suggested otherwise. i've seen quite a lot of this around here : you don't see that many digital ms in the wild, but when you do i'd estimate that at least half the users shoot as if they were carrying something like a sony rx-1. i'm all for people shooting whatever they want, but i have to admit to a bit of eye-rolling at the above two examples; they strike me as giving credence to the notion, held by some, that some leica users have far more money than sense / photographic talent. does this sort of thing bother you at all? or are you all zen about it?", "sortedWord": "None", "identifyer": 19950, "year": "2018"}, {"Unnamed: 0": 358774, "autor": "ramarren", "date": 1545887400000, "content": "I remember Map Camera, I think, from the last time I was in Shinjuku ... That was about 2002, I hope it's the same store. It was a great store! As to the potential for people owning a Leica, or any other piece of high end kit be it camera, motorcycle, car, phone, having no idea whatever what they have in their hands: Yeah, it happens. Some are truly motivated folks who have to figure it out. Others are truly clueless folks who bought something because their friends were going to be impressed by it. Others still are people who thought they knew something and are too embarrassed to admit that they don't. Et cetera. I try not to spend much energy on such concerns. Sometimes I try to help someone who seems like they want to learn, if I happen to know what the issue that they're confounded by is. I'm always amazed by how many times such good intent is taken wrongly. Best in most cases to smile and ignore. It reminds me of this classic cartoon: https://goo.gl/images/n3MMFF", "link": "https://www.l-camera-forum.com/topic/292641-do-you-assume-a-certain-level-of-knowledge-of-a-leica-shooter/?tab=comments#comment-3653593", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i remember -----> map !!!  camera, i think, from the last time i was in shinjuku ... that was about 2002, i hope it's the same store. it was a great store! as to the potential for people owning a leica, or any other piece of high end kit be it camera, motorcycle, car, phone, having no idea whatever what they have in their hands: yeah, it happens. some are truly motivated folks who have to figure it out. others are truly clueless folks who bought something because their friends were going to be impressed by it. others still are people who thought they knew something and are too embarrassed to admit that they don't. et cetera. i try not to spend much energy on such concerns. sometimes i try to help someone who seems like they want to learn, if i happen to know what the issue that they're confounded by is. i'm always amazed by how many times such good intent is taken wrongly. best in most cases to smile and ignore. it reminds me of this classic cartoon: https://goo.gl/images/n3mmff", "sortedWord": "None", "identifyer": 19955, "year": "2018"}, {"Unnamed: 0": 370002, "autor": "designdog", "date": 1529501520000, "content": "I will do this. Since I have cards all over the map, including some very large, very fast ones, I will start with the largest/fastest and see if it works, when my M9 arrives. I will post the results here. I would prefer to be able to use the largest/fastest cards, as that is what I am using on my M10.", "link": "https://www.l-camera-forum.com/topic/269714-latest-thinking-on-sd-cards-and-m9/page/4/?tab=comments#comment-3540724", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i will do this. since i have cards all over the -----> map !!! , including some very large, very fast ones, i will start with the largest/fastest and see if it works, when my m9 arrives. i will post the results here. i would prefer to be able to use the largest/fastest cards, as that is what i am using on my m10.", "sortedWord": "None", "identifyer": 31302, "year": "2018"}, {"Unnamed: 0": 370003, "autor": "DandA", "date": 1529510400000, "content": "I have been using the M9 since the week it was 1st introduced. Use of fast read/write cards are all over the map whether they have issues or not and combined with this is the particular brand of card. Some have had issues and some not and random issues sometimes show up immediately and some after a given card is in use for some time. Just sticking in a fast large card might work for days or weeks and all of a sudden images that should have been wrtten to cards are gone or hangups occur with camera. The near universal good performance has been with 8 or 16gb cards of moderate speed as noted by others. It isn't much of an issue to carry a bunch of those for your M9 and larger faster cards for your M10. Thats what I would do in order to eliminate all the vaiables to problematic card related issues with the M9. Just think of this. Some may go 100 mph down a certain road that has a 45mph speed limit and claim they never get a speeding ticket. Therefore does that mean no one else doing the same won't? The percentages are that they will in time and thus the same has happened (issues) to those using 64gb and/or larger & fast cards with a M9. Just my own thoughts. Dave (D&A) Edited June 20, 2018 by DandA", "link": "https://www.l-camera-forum.com/topic/269714-latest-thinking-on-sd-cards-and-m9/page/4/?tab=comments#comment-3540789", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i have been using the m9 since the week it was 1st introduced. use of fast read/write cards are all over the -----> map !!!  whether they have issues or not and combined with this is the particular brand of card. some have had issues and some not and random issues sometimes show up immediately and some after a given card is in use for some time. just sticking in a fast large card might work for days or weeks and all of a sudden images that should have been wrtten to cards are gone or hangups occur with camera. the near universal good performance has been with 8 or 16gb cards of moderate speed as noted by others. it isn't much of an issue to carry a bunch of those for your m9 and larger faster cards for your m10. thats what i would do in order to eliminate all the vaiables to problematic card related issues with the m9. just think of this. some may go 100 mph down a certain road that has a 45mph speed limit and claim they never get a speeding ticket. therefore does that mean no one else doing the same won't? the percentages are that they will in time and thus the same has happened (issues) to those using 64gb and/or larger & fast cards with a m9. just my own thoughts. dave (d&a) edited june 20, 2018 by danda", "sortedWord": "None", "identifyer": 31303, "year": "2018"}, {"Unnamed: 0": 370004, "autor": "pedaes", "date": 1529511900000, "content": "I will do this. Since I have cards all over the map, including some very large, very fast ones, I will start with the largest/fastest and see if it works, when my M9 arrives. I will post the results here. I would prefer to be able to use the largest/fastest cards, as that is what I am using on my M10. It's called \"Reinventing the wheel\".", "link": "https://www.l-camera-forum.com/topic/269714-latest-thinking-on-sd-cards-and-m9/page/4/?tab=comments#comment-3540806", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i will do this. since i have cards all over the -----> map !!! , including some very large, very fast ones, i will start with the largest/fastest and see if it works, when my m9 arrives. i will post the results here. i would prefer to be able to use the largest/fastest cards, as that is what i am using on my m10. it's called \"reinventing the wheel\".", "sortedWord": "None", "identifyer": 31304, "year": "2018"}, {"Unnamed: 0": 382292, "autor": "romanus53", "date": 1531729920000, "content": "Had a M8 years ago with no Problems but noticed a dead Pixel when checking before selling it. So push ISO high and shoot something dark than you can see a bright (blue or green) line vertically marking the dead pixel. Solutions are either map it inside via Leica or create a correction mask via CaputreOne or some other Software. Actually I bought another M8 about a year ago, again the first Version with 1/8000 moaned to be unstable but everything is still fine.", "link": "https://www.l-camera-forum.com/topic/286634-some-question-for-m8/?tab=comments#comment-3556646", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "had a m8 years ago with no problems but noticed a dead pixel when checking before selling it. so push iso high and shoot something dark than you can see a bright (blue or green) line vertically marking the dead pixel. solutions are either -----> map !!!  it inside via leica or create a correction mask via caputreone or some other software. actually i bought another m8 about a year ago, again the first version with 1/8000 moaned to be unstable but everything is still fine.", "sortedWord": "None", "identifyer": 43691, "year": "2018"}, {"Unnamed: 0": 382293, "autor": "jaapv", "date": 1531730460000, "content": "1. No. 2. You will see it immediately at high ISO. It can be mapped out or dealt with in postprocessing. 3. Not much. Does everything work (pay extra attention to the LCD, there is no supply of spares), is the camera well kept in general. 4. Absolute nonsense. If that were true, there would not be so many happily working after up to twelve years. It is built like a tank. As for the shutter, mentioned above, the max speed was not reduced to increase durability, but to minimize noise. If anything, we have seen more shutter defects of the slower shutter than of the faster ones on this forum. Come to think of it, I have not seen any \"broken shutter\" post for the last few years.", "link": "https://www.l-camera-forum.com/topic/286634-some-question-for-m8/?tab=comments#comment-3556652", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "1. no. 2. you will see it immediately at high iso. it can be -----> mapped !!!  out or dealt with in postprocessing. 3. not much. does everything work (pay extra attention to the lcd, there is no supply of spares), is the camera well kept in general. 4. absolute nonsense. if that were true, there would not be so many happily working after up to twelve years. it is built like a tank. as for the shutter, mentioned above, the max speed was not reduced to increase durability, but to minimize noise. if anything, we have seen more shutter defects of the slower shutter than of the faster ones on this forum. come to think of it, i have not seen any \"broken shutter\" post for the last few years.", "sortedWord": "None", "identifyer": 43692, "year": "2018"}, {"Unnamed: 0": 382294, "autor": "pgk", "date": 1531730580000, "content": "I had 2 x M8s and an M8-2. The only problem with them was that one of the M8s had to have a sensor re-map from Leica and all shot many images. Other than that they were trouble free. They are now getting on in digital camera terms though and spares such as rear screens are not available any more. So you need to be aware that you are buying an older digital camera and one which, if it needs any repairs which can be made, will be expensive to fix because Leica are not cheap for repairs. If you can pick one up for the right price though they are great cameras.", "link": "https://www.l-camera-forum.com/topic/286634-some-question-for-m8/?tab=comments#comment-3556656", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i had 2 x m8s and an m8-2. the only problem with them was that one of the m8s had to have a sensor re------> map !!!  from leica and all shot many images. other than that they were trouble free. they are now getting on in digital camera terms though and spares such as rear screens are not available any more. so you need to be aware that you are buying an older digital camera and one which, if it needs any repairs which can be made, will be expensive to fix because leica are not cheap for repairs. if you can pick one up for the right price though they are great cameras.", "sortedWord": "None", "identifyer": 43693, "year": "2018"}, {"Unnamed: 0": 382370, "autor": "jaapv", "date": 1536413340000, "content": "That depends on the number that was mapped out when the camera was built.", "link": "https://www.l-camera-forum.com/topic/288281-my-m8-seems-to-require-repair-take-a-look/page/2/?tab=comments#comment-3589496", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "that depends on the number that was -----> mapped !!!  out when the camera was built.", "sortedWord": "None", "identifyer": 43769, "year": "2018"}, {"Unnamed: 0": 400202, "autor": "Liveview", "date": 1527528180000, "content": " It not fair not be compared against the Summicron 35 ASPH, design, age, cost, quality controls and many more, but if it is close to the leica performance, WOW.... Chinese products are improving in quality, not only quantity, they are here to stay. Wonder what it is their actual lens road map for the future.", "link": "https://www.l-camera-forum.com/topic/283856-first-7artisans-35mm-f2-lens-review/page/3/?tab=comments#comment-3526983", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " it not fair not be compared against the summicron 35 asph, design, age, cost, quality controls and many more, but if it is close to the leica performance, wow.... chinese products are improving in quality, not only quantity, they are here to stay. wonder what it is their actual lens road -----> map !!!  for the future.", "sortedWord": "None", "identifyer": 12924, "year": "2018"}, {"Unnamed: 0": 415527, "autor": "frame-it", "date": 1537544820000, "content": "not an Elmar but.. SL + Summitar 50mm [collapsible] @f2 via Voigtlander M39>M adapter @ MAP Camera Leica Store in Shinjuku, Tokyo --img-- ", "link": "https://www.l-camera-forum.com/topic/278201-collapsable-5028-elmar-on-the-sl/?tab=comments#comment-3597090", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "not an elmar but.. sl + summitar 50mm [collapsible] @f2 via voigtlander m39>m adapter @ -----> map !!!  camera leica store in shinjuku, tokyo --img-- ", "sortedWord": "None", "identifyer": 28466, "year": "2018"}, {"Unnamed: 0": 416365, "autor": "frame-it", "date": 1536282960000, "content": "SL + Summitar 50mm [collapsible] @f2 via Voigtlander M39>M adapter @ MAP Camera Leica Store in Shinjuku, Tokyo --img-- ", "link": "https://www.l-camera-forum.com/topic/275370-vintage-lenses-on-the-sl/page/5/?tab=comments#comment-3588417", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "sl + summitar 50mm [collapsible] @f2 via voigtlander m39>m adapter @ -----> map !!!  camera leica store in shinjuku, tokyo --img-- ", "sortedWord": "None", "identifyer": 29311, "year": "2018"}, {"Unnamed: 0": 419795, "autor": "HeinzX", "date": 1526111880000, "content": "I use a Cognisys system for focus stacking and the Helicon software afterwards. All these things were bought for a Canon camera together with Canon Macro lenses. And the workflow was very comfortable with all these things together. In case of need I can use all of them with my SL - the macro lenses are adapted with a novoflex adapter. But unfortunately there is one restriction. In contrary to Canon, Nikon and other systems there exists no cable for automatic releasing the shutter for the SL. Cognisys has told me, that because of technical reasons they are not able to deliver one. Therefore I have to release the shutter for each step - which ist possible - for every camera - including the Ms - but less comfortable. P.S. It is a shame, that Leica has no own native Macro lens for the SL - not even in the road map - at least according to my knowledge. Edited May 12, 2018 by HeinzX", "link": "https://www.l-camera-forum.com/topic/284299-focus-stacking/?tab=comments#comment-3517158", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i use a cognisys system for focus stacking and the helicon software afterwards. all these things were bought for a canon camera together with canon macro lenses. and the workflow was very comfortable with all these things together. in case of need i can use all of them with my sl - the macro lenses are adapted with a novoflex adapter. but unfortunately there is one restriction. in contrary to canon, nikon and other systems there exists no cable for automatic releasing the shutter for the sl. cognisys has told me, that because of technical reasons they are not able to deliver one. therefore i have to release the shutter for each step - which ist possible - for every camera - including the ms - but less comfortable. p.s. it is a shame, that leica has no own native macro lens for the sl - not even in the road -----> map !!!  - at least according to my knowledge. edited may 12, 2018 by heinzx", "sortedWord": "None", "identifyer": 32808, "year": "2018"}, {"Unnamed: 0": 438032, "autor": "jplomley", "date": 1537719240000, "content": "I’m so pleased with the current SL performance with the 16-35 SVE, I honestly could care less what they introduce. I just want to see the promised lenses arrive in a timely fashion and an accurate road map for the system. Will we see a macro option? Tilt-shift? Wide angle primes such as 15, 18, 21 and 28 mm?", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/9/?tab=comments#comment-3598227", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i’m so pleased with the current sl performance with the 16-35 sve, i honestly could care less what they introduce. i just want to see the promised lenses arrive in a timely fashion and an accurate road -----> map !!!  for the system. will we see a macro option? tilt-shift? wide angle primes such as 15, 18, 21 and 28 mm?", "sortedWord": "None", "identifyer": 51274, "year": "2018"}, {"Unnamed: 0": 442678, "autor": "SonomaBear", "date": 1524670980000, "content": "I have four default settings, all controlled via the \"User\" memories. They key is to use the Fn button mapped to the selection of User. The other key is common mappings, such as Exposure Compensation via thumb wheel, movie button disabled, back button to focal length selection. Switching \"User\" is fast, trying to remember differing control mappings is impossible. My four are \"Landscape\", \"Portrait\", \"Street\", and \"General\" -- each one with Fn mapped to \"User\" to quick change to another User. Each one has metering, focusing, etc. optimized to the situations. 1. Landscape assumes a fixed, non-moving, subject with perhaps difficult dynamic range issues, so I use three exposures with ⅔ stop over/under/normal and high speed continuous shutter. Handy in case I later choose to do HDR. 2. Portrait is also continuous but lower speed. But no exposure bracketing. 3. Street is just there in case I see something unusual and want to be in stealth mode. 4. General is where 90% of my images are shot. Perhaps the next firmware release will allow focal length to be held in user memory. Landscape and general at 28mm, street at 35mm, and portrait at 50mm. Four cameras for the price of one {huge purchase} ...", "link": "https://www.l-camera-forum.com/topic/283948-what-are-your-default-settings-on-your-q/?tab=comments#comment-3506722", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "i have four default settings, all controlled via the \"user\" memories. they key is to use the fn button -----> mapped !!!  to the selection of user. the other key is common mappings, such as exposure compensation via thumb wheel, movie button disabled, back button to focal length selection. switching \"user\" is fast, trying to remember differing control mappings is impossible. my four are \"landscape\", \"portrait\", \"street\", and \"general\" -- each one with fn mapped to \"user\" to quick change to another user. each one has metering, focusing, etc. optimized to the situations. 1. landscape assumes a fixed, non-moving, subject with perhaps difficult dynamic range issues, so i use three exposures with ⅔ stop over/under/normal and high speed continuous shutter. handy in case i later choose to do hdr. 2. portrait is also continuous but lower speed. but no exposure bracketing. 3. street is just there in case i see something unusual and want to be in stealth mode. 4. general is where 90% of my images are shot. perhaps the next firmware release will allow focal length to be held in user memory. landscape and general at 28mm, street at 35mm, and portrait at 50mm. four cameras for the price of one {huge purchase} ...", "sortedWord": "None", "identifyer": 6056, "year": "2018"}, {"Unnamed: 0": 442684, "autor": "caigy", "date": 1525828860000, "content": "Single-point AF most of the time, but if I'm shooting people I use face detection mode. ISO 100, almost always. Once in a while I bump it up to 400 or 800, but very infrequently. RAW + JPEG AWB always Rear wheel set to exposure comp, often set a -1/3 unless doing portraits Function button set to crop mode, as default from factory, but I don't use it much. Use f/1.7 a lot, use f/8 for landscape/travel, and f/2.8 or f/4 for portraits (gives enough DOF to render full face in focus but background sufficiently out of focus) Have never taken a movie, never will. Wish that button could be re-mapped. Speaking of re-mapping: There had been a rumor a few months ago that Leica was working on a firmware update, but we still haven't seen it. Given that there's already a trademark registration for a Q2, I would like to think that Leica will continue to support owners of the original Q before bringing out a Q2. It would be an important issue for me before I buy another Leica, that I see they will continue to provide firmware updates for a reasonable number of years from launch date (say, 5 years minimum).", "link": "https://www.l-camera-forum.com/topic/283948-what-are-your-default-settings-on-your-q/?tab=comments#comment-3515391", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "single-point af most of the time, but if i'm shooting people i use face detection mode. iso 100, almost always. once in a while i bump it up to 400 or 800, but very infrequently. raw + jpeg awb always rear wheel set to exposure comp, often set a -1/3 unless doing portraits function button set to crop mode, as default from factory, but i don't use it much. use f/1.7 a lot, use f/8 for landscape/travel, and f/2.8 or f/4 for portraits (gives enough dof to render full face in focus but background sufficiently out of focus) have never taken a movie, never will. wish that button could be re------> mapped !!! . speaking of re-mapping: there had been a rumor a few months ago that leica was working on a firmware update, but we still haven't seen it. given that there's already a trademark registration for a q2, i would like to think that leica will continue to support owners of the original q before bringing out a q2. it would be an important issue for me before i buy another leica, that i see they will continue to provide firmware updates for a reasonable number of years from launch date (say, 5 years minimum).", "sortedWord": "None", "identifyer": 6062, "year": "2018"}], "name": "mapL-Forum2018"}