{"interestingcomments": [{"Unnamed: 0": 341859, "autor": "fenykepesz", "date": 1633713000000, "content": "i very much hope that there will be another M*-D at some point in the future, perhaps as an M11-D in 2-3 years from now. my M10-D is an amazing workhorse - even as mine is right now a bit broken though still functional enough to take pictures. i agree with petermullett that we should be concerned about future tech/service support by Leica for years from now, considering how short lived today's digital products are. in that respect we will see how/if my current electronic hardware problem will be solved in Wetzlar... ! regarding a wish list here my items for a new slim screenless M11-D : - a power switch built into the \"advance lever\" - a much faster camera boot time, with quasi immediate responsiveness - a modern 24MB (or higher) sensor with ISO truly starting at around 50 and signal depth of 16 bit - a simple way to update/synchronize camera date/time (think about trips!) - a builtin sensor cleaning capability ? - and last, what about a hybrid VF/EVF with information superimposed on demand (pressing some button) for picture specs and focus peaking, similar to what they do in jet cockpits ? is that technically that hard ? though i assume that switching lenses is not a trivial situation for correctly mapping VF and EVF coordinate systems.", "link": "https://www.l-camera-forum.com/topic/325094-will-there-be-another-d/?tab=comments#comment-4288752", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapping", "selectorShort": "map", "MarkedSent": "i very much hope that there will be another m*-d at some point in the future, perhaps as an m11-d in 2-3 years from now. my m10-d is an amazing workhorse - even as mine is right now a bit broken though still functional enough to take pictures. i agree with petermullett that we should be concerned about future tech/service support by leica for years from now, considering how short lived today's digital products are. in that respect we will see how/if my current electronic hardware problem will be solved in wetzlar... ! regarding a wish list here my items for a new slim screenless m11-d : - a power switch built into the \"advance lever\" - a much faster camera boot time, with quasi immediate responsiveness - a modern 24mb (or higher) sensor with iso truly starting at around 50 and signal depth of 16 bit - a simple way to update/synchronize camera date/time (think about trips!) - a builtin sensor cleaning capability ? - and last, what about a hybrid vf/evf with information superimposed on demand (pressing some button) for picture specs and focus peaking, similar to what they do in jet cockpits ? is that technically that hard ? though i assume that switching lenses is not a trivial situation for correctly -----> mapping !!!  vf and evf coordinate systems.", "sortedWord": "None", "identifyer": 2929, "year": "2021"}, {"Unnamed: 0": 344483, "autor": "Herr Barnack", "date": 1630265520000, "content": "3 hours ago, Matlock said: ...Perhaps you think it would be a good idea if there was a setting on the menu that tells you that you have left your lens in the car. 😄 Word on the street is that the M11 will have that feature. The M11 will also have a warning pop up on the rear screen to warn you when your wife is outraged after she finds out how much the M11 costs. It will also have a GPS function that displays a map showing the location of the nearest Holiday Inn with vacancies. Edited August 29 by Herr Barnack", "link": "https://www.l-camera-forum.com/topic/324046-m10-r-baseplate/?tab=comments#comment-4265925", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "3 hours ago, matlock said: ...perhaps you think it would be a good idea if there was a setting on the menu that tells you that you have left your lens in the car. 😄 word on the street is that the m11 will have that feature. the m11 will also have a warning pop up on the rear screen to warn you when your wife is outraged after she finds out how much the m11 costs. it will also have a gps function that displays a -----> map !!!  showing the location of the nearest holiday inn with vacancies. edited august 29 by herr barnack", "sortedWord": "None", "identifyer": 5566, "year": "2021"}, {"Unnamed: 0": 344484, "autor": "jdlaing", "date": 1630280340000, "content": "4 hours ago, Herr Barnack said: Word on the street is that the M11 will have that feature. The M11 will also have a warning pop up on the rear screen to warn you when your wife is outraged after she finds out how much the M11 costs. It will also have a GPS function that displays a map showing the location of the nearest Holiday Inn with vacancies. All depends on who wears the pants. 🤑", "link": "https://www.l-camera-forum.com/topic/324046-m10-r-baseplate/?tab=comments#comment-4266000", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "4 hours ago, herr barnack said: word on the street is that the m11 will have that feature. the m11 will also have a warning pop up on the rear screen to warn you when your wife is outraged after she finds out how much the m11 costs. it will also have a gps function that displays a -----> map !!!  showing the location of the nearest holiday inn with vacancies. all depends on who wears the pants. 🤑", "sortedWord": "None", "identifyer": 5567, "year": "2021"}, {"Unnamed: 0": 344707, "autor": "egrossman", "date": 1631498760000, "content": "Line of dead pixels. Send the camera into Leica to have the sensor re-mapped.", "link": "https://www.l-camera-forum.com/topic/324492-line-through-my-photo-anybody-ever-see-this/?tab=comments#comment-4274417", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "line of dead pixels. send the camera into leica to have the sensor re------> mapped !!! .", "sortedWord": "None", "identifyer": 5792, "year": "2021"}, {"Unnamed: 0": 345321, "autor": "Photoworks", "date": 1628906700000, "content": "14 minutes ago, derleicaman said: Nothing that I can see wrong except the disgraced American flag that is posing as “art”! Not to get into politics, but think of how insulting this is to the men and women who have fought and died for this flag. 😞 Before you get into politics. David, a political activist and it is worth to reflect on his intent true his art. \"Beginning with a masterful piece, the lacerated American flag in the colours of the Pan-African flag, entitled Oh say can you see (2017), the show concludes with a unique installation called Minimum Security (2007), which constitutes the highlight of the exhibition. The first work responds to the folkloristic and colonial vision of the painted decor that adorns the dome, evoking slavery in the section depicting North America and decorated with a dazzling yet incomplete American flag. The second piece is housed in the old Hall of Lost Steps, at the end of the exhibition route, where it generates a particular tension with the restored remains of the original decor: the metal cage with the dimensions of a prison cell responds to the map of the world from the late 19th century, showing the trade routes used at the height of the West’s colonial expansion.\"", "link": "https://www.l-camera-forum.com/topic/323543-do-you-see-any-defect/?tab=comments#comment-4256417", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "14 minutes ago, derleicaman said: nothing that i can see wrong except the disgraced american flag that is posing as “art”! not to get into politics, but think of how insulting this is to the men and women who have fought and died for this flag. 😞 before you get into politics. david, a political activist and it is worth to reflect on his intent true his art. \"beginning with a masterful piece, the lacerated american flag in the colours of the pan-african flag, entitled oh say can you see (2017), the show concludes with a unique installation called minimum security (2007), which constitutes the highlight of the exhibition. the first work responds to the folkloristic and colonial vision of the painted decor that adorns the dome, evoking slavery in the section depicting north america and decorated with a dazzling yet incomplete american flag. the second piece is housed in the old hall of lost steps, at the end of the exhibition route, where it generates a particular tension with the restored remains of the original decor: the metal cage with the dimensions of a prison cell responds to the -----> map !!!  of the world from the late 19th century, showing the trade routes used at the height of the west’s colonial expansion.\"", "sortedWord": "None", "identifyer": 6410, "year": "2021"}, {"Unnamed: 0": 346052, "autor": "mujk", "date": 1626359340000, "content": "If I recall correctly, there are several threads on this issue, including the one linked in the original post. After you have contacted them Leica Germany support will ask you for one or several sample images in dng format and then, if they think it is a bad pixel, send you a customised firmware file. Once installed, this will map out the bad pixel an fix the problem.", "link": "https://www.l-camera-forum.com/topic/322708-leica-m10p-problem-customer-service-isnt-replying/?tab=comments#comment-4238757", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "if i recall correctly, there are several threads on this issue, including the one linked in the original post. after you have contacted them leica germany support will ask you for one or several sample images in dng format and then, if they think it is a bad pixel, send you a customised firmware file. once installed, this will -----> map !!!  out the bad pixel an fix the problem.", "sortedWord": "None", "identifyer": 7141, "year": "2021"}, {"Unnamed: 0": 348520, "autor": "jplomley", "date": 1613495280000, "content": "1 minute ago, jslabovitz said: I traveled to Romania in 1998 — Cluj-Napoca and Brasov, but also Suceava and smaller places. It was one of the most interesting journeys I’ve ever taken, and still recall it fondly. It was very raw travel, but I met amazing & friendly people everywhere. I’m sure it’s changed in the 20+ years since, but I’d love to return some day. I wasn’t seriously photographing, but had an Olympus XA4 with slide film. I should dig those slides out some time and take a look... Raw travel indeed! And visually stimulating, images everywhere. Some of the villages cannot even be found on a map. I just love meandering through the countryside, picking a \"road\" and see what's happening. I ended up in some village with a population of 30, all farmers and still attending church on Sundays in a rickety wooden temple from the 17th century. Mind boggling. And friendly indeed. In Craiova I was invited by a priest to photograph a baptism and wedding on the same day. And not one person minded that I was there. That would never happen in North America. And don't get me started on the quality of the food. Spectacular. I'm not up to speed on what sorts of bastardization is happening to our food in North America, but I can tell you the food in Romania is the freshest and most tasty I've had anywhere. Not one incident of GI upset. I eat a croissant here and I bloat up like the Michelin Man. I remember eating a tomato a farmer in one of the villages had given me, and it was like I had never tasted a proper tomato in the 50 years of my existence. And then he walks me around to the side of his house and he has bee hives. Gave me raw honeycomb to try, and that pretty much spoiled honey from the grocer for me.", "link": "https://www.l-camera-forum.com/topic/317840-is-the-m10-r-a-success/page/6/?tab=comments#comment-4142515", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "1 minute ago, jslabovitz said: i traveled to romania in 1998 — cluj-napoca and brasov, but also suceava and smaller places. it was one of the most interesting journeys i’ve ever taken, and still recall it fondly. it was very raw travel, but i met amazing & friendly people everywhere. i’m sure it’s changed in the 20+ years since, but i’d love to return some day. i wasn’t seriously photographing, but had an olympus xa4 with slide film. i should dig those slides out some time and take a look... raw travel indeed! and visually stimulating, images everywhere. some of the villages cannot even be found on a -----> map !!! . i just love meandering through the countryside, picking a \"road\" and see what's happening. i ended up in some village with a population of 30, all farmers and still attending church on sundays in a rickety wooden temple from the 17th century. mind boggling. and friendly indeed. in craiova i was invited by a priest to photograph a baptism and wedding on the same day. and not one person minded that i was there. that would never happen in north america. and don't get me started on the quality of the food. spectacular. i'm not up to speed on what sorts of bastardization is happening to our food in north america, but i can tell you the food in romania is the freshest and most tasty i've had anywhere. not one incident of gi upset. i eat a croissant here and i bloat up like the michelin man. i remember eating a tomato a farmer in one of the villages had given me, and it was like i had never tasted a proper tomato in the 50 years of my existence. and then he walks me around to the side of his house and he has bee hives. gave me raw honeycomb to try, and that pretty much spoiled honey from the grocer for me.", "sortedWord": "None", "identifyer": 9621, "year": "2021"}, {"Unnamed: 0": 348521, "autor": "mmradman", "date": 1613496000000, "content": "8 minutes ago, jplomley said: Raw travel indeed! And visually stimulating, images everywhere. Some of the villages cannot even be found on a map. I just love meandering through the countryside, picking a \"road\" and see what's happening. I ended up in some village with a population of 30, all farmers and still attending church on Sundays in a rickety wooden temple from the 17th century. Mind boggling. And friendly indeed. In Craiova I was invited by a priest to photograph a baptism and wedding on the same day. And not one person minded that I was there. That would never happen in North America. And don't get me started on the quality of the food. Spectacular. I'm not up to speed on what sorts of bastardization is happening to our food in North America, but I can tell you the food in Romania is the freshest and most tasty I've had anywhere. Not one incident of GI upset. I eat a croissant here and I bloat up like the Michelin Man. I remember eating a tomato a farmer in one of the villages had given me, and it was like I had never tasted a proper tomato in the 50 years of my existence. And then he walks me around to the side of his house and he has bee hives. Gave me raw honeycomb to try, and that pretty much spoiled honey from the grocer for me. No name mentioned big convinience food chains are probably alays on the lookout to \"enlighten\" remaining gastronomic backwaters.", "link": "https://www.l-camera-forum.com/topic/317840-is-the-m10-r-a-success/page/6/?tab=comments#comment-4142523", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "8 minutes ago, jplomley said: raw travel indeed! and visually stimulating, images everywhere. some of the villages cannot even be found on a -----> map !!! . i just love meandering through the countryside, picking a \"road\" and see what's happening. i ended up in some village with a population of 30, all farmers and still attending church on sundays in a rickety wooden temple from the 17th century. mind boggling. and friendly indeed. in craiova i was invited by a priest to photograph a baptism and wedding on the same day. and not one person minded that i was there. that would never happen in north america. and don't get me started on the quality of the food. spectacular. i'm not up to speed on what sorts of bastardization is happening to our food in north america, but i can tell you the food in romania is the freshest and most tasty i've had anywhere. not one incident of gi upset. i eat a croissant here and i bloat up like the michelin man. i remember eating a tomato a farmer in one of the villages had given me, and it was like i had never tasted a proper tomato in the 50 years of my existence. and then he walks me around to the side of his house and he has bee hives. gave me raw honeycomb to try, and that pretty much spoiled honey from the grocer for me. no name mentioned big convinience food chains are probably alays on the lookout to \"enlighten\" remaining gastronomic backwaters.", "sortedWord": "None", "identifyer": 9622, "year": "2021"}, {"Unnamed: 0": 348938, "autor": "farnz", "date": 1611667320000, "content": "2 hours ago, rramesh said: Interesting though it still takes up with hotshoe mount.https://leicarumors.com/2019/09/06/lever-type-thumb-rest-for-leica-m10-m10-p-now-available-for-sale.aspx/ The webpage is from September 2019 and clicking through to Map Camera who sells the 'lever-type' thumb rest informs that it has been discontinued. There might be a few floating around on that online auction site but even at its original price of £400 it would be quite a leap of faith. Pete.", "link": "https://www.l-camera-forum.com/topic/317283-new-upgraded-visoflex-coming-anytime-soon/page/2/?tab=comments#comment-4125917", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "2 hours ago, rramesh said: interesting though it still takes up with hotshoe mount.https://leicarumors.com/2019/09/06/lever-type-thumb-rest-for-leica-m10-m10-p-now-available-for-sale.aspx/ the webpage is from september 2019 and clicking through to -----> map !!!  camera who sells the 'lever-type' thumb rest informs that it has been discontinued. there might be a few floating around on that online auction site but even at its original price of £400 it would be quite a leap of faith. pete.", "sortedWord": "None", "identifyer": 10040, "year": "2021"}, {"Unnamed: 0": 350042, "autor": "scott kirkpatrick", "date": 1611921240000, "content": "The PC (perspective correction) feature in this new firmware is a lot of fun. Instead of filling the frame without losing awareness of what's just outside the frame, this feature gives you a second frame, seen in live view (it's a good reason to use the VF020). The second frame floats around. If your camera is dead level if fills the image, but as you look up or down or tilt the camera, the frame changes shape to map out what would remain accessible after a complete perspective correction, so you chase the material that you want in your final picture and trap it in the simulated frame. If you are shooting way up or down, the shrinkage is a compromise, so you can get more than the floating rectangle suggests by under-correcting.the perspective. Even if you shoot DNG-only, you can see the effect of a full perspective correction by reviewing the shot in-camera. Adobe already knows how to read the bits of metadata that Leica writes into the DNG, so if you input to ACR and set the geometric options to \"auto\" you get the correction. If you don't like the correction, you can change it, or turn it off completely. This is more flexible than, e.g. distortion corrections, which are enforced in Adobe products, optional with others. Leica now writes the perspective correction info into every DNG, whether or not PC is turned on. That's what I see in an M10-R. Don't have an M10-P or -M. Two things I wish they had done: This whole system gives up if you tilt more than about 30 degrees or look down more than 45 degrees. I'd like it to work when I shoot nearly straight down to copy a document or piece of artwork, but it doesn't. Also, since shooting with the floating rhomboid you tend to lose track whether or not your floating frame is level, wouldn't it be nice if the bottom line of the frame went green when the camera is level?", "link": "https://www.l-camera-forum.com/topic/317425-m10-new-firmware-finally/page/3/?tab=comments#comment-4128029", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "the pc (perspective correction) feature in this new firmware is a lot of fun. instead of filling the frame without losing awareness of what's just outside the frame, this feature gives you a second frame, seen in live view (it's a good reason to use the vf020). the second frame floats around. if your camera is dead level if fills the image, but as you look up or down or tilt the camera, the frame changes shape to -----> map !!!  out what would remain accessible after a complete perspective correction, so you chase the material that you want in your final picture and trap it in the simulated frame. if you are shooting way up or down, the shrinkage is a compromise, so you can get more than the floating rectangle suggests by under-correcting.the perspective. even if you shoot dng-only, you can see the effect of a full perspective correction by reviewing the shot in-camera. adobe already knows how to read the bits of metadata that leica writes into the dng, so if you input to acr and set the geometric options to \"auto\" you get the correction. if you don't like the correction, you can change it, or turn it off completely. this is more flexible than, e.g. distortion corrections, which are enforced in adobe products, optional with others. leica now writes the perspective correction info into every dng, whether or not pc is turned on. that's what i see in an m10-r. don't have an m10-p or -m. two things i wish they had done: this whole system gives up if you tilt more than about 30 degrees or look down more than 45 degrees. i'd like it to work when i shoot nearly straight down to copy a document or piece of artwork, but it doesn't. also, since shooting with the floating rhomboid you tend to lose track whether or not your floating frame is level, wouldn't it be nice if the bottom line of the frame went green when the camera is level?", "sortedWord": "None", "identifyer": 11147, "year": "2021"}, {"Unnamed: 0": 352257, "autor": "Avvie", "date": 1625580720000, "content": " Hi guys, i know im not the only one writing about this. But is there anyone who got it solved? It's a black line in the middle of the screen. Firmware is up to date. Switching sd cards doesn't help. And the black line is also visible in live view. Don't know if pixel mapping would help. I also hear different stories about being able to pixel map with a firmware sent from leica support or having to send the body to leica. --img-- ", "link": "https://www.l-camera-forum.com/topic/322483-black-line-on-m240-sensor/?tab=comments#comment-4233015", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " hi guys, i know im not the only one writing about this. but is there anyone who got it solved? it's a black line in the middle of the screen. firmware is up to date. switching sd cards doesn't help. and the black line is also visible in live view. don't know if pixel mapping would help. i also hear different stories about being able to pixel -----> map !!!  with a firmware sent from leica support or having to send the body to leica. --img-- ", "sortedWord": "None", "identifyer": 13400, "year": "2021"}, {"Unnamed: 0": 362779, "autor": "convexferret", "date": 1613565540000, "content": "I'm a bit confused by what on earth you are asking. The zone system is a method of exposing and then manipulating the materials (development) so that tones map as best as possible onto the output medium. I started with that assumption until you yourself said that this wasn't about exposure. Reading between the lines your main issue seems to be that any photograph that doesn't contain a full range of tones is by defintion a poor photo and that by using a telephoto you think that you'll find it harder to include blacks, whites and everything in between in a single frame. I can't believe that this is really your premise, surely?", "link": "https://www.l-camera-forum.com/topic/318032-longer-focal-lengths-in-bw/page/3/?tab=comments#comment-4143063", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i'm a bit confused by what on earth you are asking. the zone system is a method of exposing and then manipulating the materials (development) so that tones -----> map !!!  as best as possible onto the output medium. i started with that assumption until you yourself said that this wasn't about exposure. reading between the lines your main issue seems to be that any photograph that doesn't contain a full range of tones is by defintion a poor photo and that by using a telephoto you think that you'll find it harder to include blacks, whites and everything in between in a single frame. i can't believe that this is really your premise, surely?", "sortedWord": "None", "identifyer": 24025, "year": "2021"}, {"Unnamed: 0": 370232, "autor": "Adam Bonn", "date": 1620122760000, "content": "On 5/2/2021 at 9:48 PM, ianman said: The sensor IS different technology. (Sorry, I don’t know what percentage is required to allow the use of the word completely 🙄) You seem to have very little faith in the longevity of the digital M line. Why would they stop working in 3 weeks, 3 months or 3 years? I have classics analog synths - a 1972 Moog and a 1976 Polyphonic Korg - which still work perfectly and I see no reason why they would suddenly stop working any time soon. My 22 year old Nikon cool pix 950 still works perfectly. The battery which came with my M9 almost 12 years ago is still fine, I could go on. Even so, why do you seem to think the 240 would last any longer? There is always a risk with electronics devices, anyone buying a digital camera knows that. It has been written many times before on this forum, it’s not because an M10, 11, 12 or 13 are released that previous models suddenly become obsolete or any less good than they were. The fact is the M9 is the only full frame CCD Leica. That makes it unique and that is why all the other so called improvements are irrelevant. If someone wants one, it’s still a good - the only - option. Well nothing lasts forever. The risk with the m9 isn’t that it might break down, it’s that it might break down and Leica might not have the parts any longer. (Like with some m8 parts, eg the lcd) The same will be true for the 240, the 10 and even the 11. But not any time soon as they’re newer cameras that Leica still have parts to repair them. The m9 is not any more or any less likely to suffer an issue than other cameras. It’s just less likely to be repairable due to the age and in particular Leica’s proclivity not to keep an infinite number of spares for their models. the m9 isn’t just the only ff CCD leica, AFAIK it’s the only ff CCD anywhere. So yes in that respect it’s the only gig in town. My 240 will go to wetzlar soon to have some pixels mapped out. I wonder if my m9 needed that work doing what they would say? If I drop my 9 and break the lcd, I wonder if leica still have any to replace it? There’s no reason the m9 WILL have a problem.. but all things CAN have a problem, and a complication with the m9 is the age and lack of support Remember, there’s no m9 sensors left because the supplier stopped making them, first Kodak, then the company that bought out Kodak’s sensor production. So Leica (like many companies) is at the mercy of its suppliers. The risk of any old product that’s out of support needs to be offset by the desire of the buyer to own the product... and that’s a person by person dialogue, whether or not CCD is worth the cost and the risk is up the individual.", "link": "https://www.l-camera-forum.com/topic/319279-m9-with-original-sensor-still-worth-a-shot/page/3/?tab=comments#comment-4193979", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "on 5/2/2021 at 9:48 pm, ianman said: the sensor is different technology. (sorry, i don’t know what percentage is required to allow the use of the word completely 🙄) you seem to have very little faith in the longevity of the digital m line. why would they stop working in 3 weeks, 3 months or 3 years? i have classics analog synths - a 1972 moog and a 1976 polyphonic korg - which still work perfectly and i see no reason why they would suddenly stop working any time soon. my 22 year old nikon cool pix 950 still works perfectly. the battery which came with my m9 almost 12 years ago is still fine, i could go on. even so, why do you seem to think the 240 would last any longer? there is always a risk with electronics devices, anyone buying a digital camera knows that. it has been written many times before on this forum, it’s not because an m10, 11, 12 or 13 are released that previous models suddenly become obsolete or any less good than they were. the fact is the m9 is the only full frame ccd leica. that makes it unique and that is why all the other so called improvements are irrelevant. if someone wants one, it’s still a good - the only - option. well nothing lasts forever. the risk with the m9 isn’t that it might break down, it’s that it might break down and leica might not have the parts any longer. (like with some m8 parts, eg the lcd) the same will be true for the 240, the 10 and even the 11. but not any time soon as they’re newer cameras that leica still have parts to repair them. the m9 is not any more or any less likely to suffer an issue than other cameras. it’s just less likely to be repairable due to the age and in particular leica’s proclivity not to keep an infinite number of spares for their models. the m9 isn’t just the only ff ccd leica, afaik it’s the only ff ccd anywhere. so yes in that respect it’s the only gig in town. my 240 will go to wetzlar soon to have some pixels -----> mapped !!!  out. i wonder if my m9 needed that work doing what they would say? if i drop my 9 and break the lcd, i wonder if leica still have any to replace it? there’s no reason the m9 will have a problem.. but all things can have a problem, and a complication with the m9 is the age and lack of support remember, there’s no m9 sensors left because the supplier stopped making them, first kodak, then the company that bought out kodak’s sensor production. so leica (like many companies) is at the mercy of its suppliers. the risk of any old product that’s out of support needs to be offset by the desire of the buyer to own the product... and that’s a person by person dialogue, whether or not ccd is worth the cost and the risk is up the individual.", "sortedWord": "None", "identifyer": 31532, "year": "2021"}, {"Unnamed: 0": 370233, "autor": "Ko.Fe.", "date": 1620136860000, "content": "2 hours ago, Adam Bonn said: Well nothing lasts forever. The risk with the m9 isn’t that it might break down, it’s that it might break down and Leica might not have the parts any longer. (Like with some m8 parts, eg the lcd) The same will be true for the 240, the 10 and even the 11. But not any time soon as they’re newer cameras that Leica still have parts to repair them. The m9 is not any more or any less likely to suffer an issue than other cameras. It’s just less likely to be repairable due to the age and in particular Leica’s proclivity not to keep an infinite number of spares for their models. the m9 isn’t just the only ff CCD leica, AFAIK it’s the only ff CCD anywhere. So yes in that respect it’s the only gig in town. My 240 will go to wetzlar soon to have some pixels mapped out. I wonder if my m9 needed that work doing what they would say? If I drop my 9 and break the lcd, I wonder if leica still have any to replace it? There’s no reason the m9 WILL have a problem.. but all things CAN have a problem, and a complication with the m9 is the age and lack of support Remember, there’s no m9 sensors left because the supplier stopped making them, first Kodak, then the company that bought out Kodak’s sensor production. So Leica (like many companies) is at the mercy of its suppliers. The risk of any old product that’s out of support needs to be offset by the desire of the buyer to own the product... and that’s a person by person dialogue, whether or not CCD is worth the cost and the risk is up the individual. Where are other parts beet out now rather than just sensors for M9 series. It happened too soon after last M9 series cameras were made in late 2015 and been available for sale via official dealers well into 2016. Not to mention, Leica Camera AG recent double dipping on M9 cameras which were traded in due to sensors failure. Recent transactions under heavy price only to find out what camera is EOL and only solution in need of repair is to allow Leica Camera AG triple dipping and sell replacement for even more than initially was paid for refurb camera. My made in late 2015 M-E 220 went for sensor replacement and I have to wait several months. And no paper work on return. I will use this camera as pleasure toy until it craps out. I don't want to depend on tool which has no local, dependable service. M240 support is unknown. It might be M9 V2 soon. M10 is not impressive on reliability. I'm waiting for commercially available conversion kit to use more common components an get my M4-2 to digital. DIY instructions already available for M3 with use of Sony made components.", "link": "https://www.l-camera-forum.com/topic/319279-m9-with-original-sensor-still-worth-a-shot/page/3/?tab=comments#comment-4194145", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "2 hours ago, adam bonn said: well nothing lasts forever. the risk with the m9 isn’t that it might break down, it’s that it might break down and leica might not have the parts any longer. (like with some m8 parts, eg the lcd) the same will be true for the 240, the 10 and even the 11. but not any time soon as they’re newer cameras that leica still have parts to repair them. the m9 is not any more or any less likely to suffer an issue than other cameras. it’s just less likely to be repairable due to the age and in particular leica’s proclivity not to keep an infinite number of spares for their models. the m9 isn’t just the only ff ccd leica, afaik it’s the only ff ccd anywhere. so yes in that respect it’s the only gig in town. my 240 will go to wetzlar soon to have some pixels -----> mapped !!!  out. i wonder if my m9 needed that work doing what they would say? if i drop my 9 and break the lcd, i wonder if leica still have any to replace it? there’s no reason the m9 will have a problem.. but all things can have a problem, and a complication with the m9 is the age and lack of support remember, there’s no m9 sensors left because the supplier stopped making them, first kodak, then the company that bought out kodak’s sensor production. so leica (like many companies) is at the mercy of its suppliers. the risk of any old product that’s out of support needs to be offset by the desire of the buyer to own the product... and that’s a person by person dialogue, whether or not ccd is worth the cost and the risk is up the individual. where are other parts beet out now rather than just sensors for m9 series. it happened too soon after last m9 series cameras were made in late 2015 and been available for sale via official dealers well into 2016. not to mention, leica camera ag recent double dipping on m9 cameras which were traded in due to sensors failure. recent transactions under heavy price only to find out what camera is eol and only solution in need of repair is to allow leica camera ag triple dipping and sell replacement for even more than initially was paid for refurb camera. my made in late 2015 m-e 220 went for sensor replacement and i have to wait several months. and no paper work on return. i will use this camera as pleasure toy until it craps out. i don't want to depend on tool which has no local, dependable service. m240 support is unknown. it might be m9 v2 soon. m10 is not impressive on reliability. i'm waiting for commercially available conversion kit to use more common components an get my m4-2 to digital. diy instructions already available for m3 with use of sony made components.", "sortedWord": "None", "identifyer": 31533, "year": "2021"}, {"Unnamed: 0": 370555, "autor": "Stuart Richardson", "date": 1610962260000, "content": "It is not corrosion. As M9reno said, while annoying, this is not a major problem. One pixel is malfunctioning (you can usually see one looks brighter than the rest within this line), and due to the sensor architecture, it causes a malfunction that makes the entire line of pixels on the same readout brighter than normal. The fix is basically turning off the pixel and telling the camera to map that pixel to a neighboring pixel. Once it is done, you will never tell the difference. You should call Leica Customer Service and see what they need for you to fix it. Occasionally this can be done remotely, but I think usually it is done by sending the camera in.", "link": "https://www.l-camera-forum.com/topic/317048-vertical-lines/?tab=comments#comment-4120437", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "it is not corrosion. as m9reno said, while annoying, this is not a major problem. one pixel is malfunctioning (you can usually see one looks brighter than the rest within this line), and due to the sensor architecture, it causes a malfunction that makes the entire line of pixels on the same readout brighter than normal. the fix is basically turning off the pixel and telling the camera to -----> map !!!  that pixel to a neighboring pixel. once it is done, you will never tell the difference. you should call leica customer service and see what they need for you to fix it. occasionally this can be done remotely, but i think usually it is done by sending the camera in.", "sortedWord": "None", "identifyer": 31855, "year": "2021"}, {"Unnamed: 0": 370567, "autor": "Ko.Fe.", "date": 1611075060000, "content": "12 hours ago, boojum said: No. Should I? If they have more problems that is awful. Stable, reliable camera electronics are a fact. I have old Japanese cameras which work fine, like a Pentax K1000 and Pentax ME Super plus some old Sony digitals. I hope the M10's are not faulty but I now must check. Spaceba. I checked, few weeks ago. First four pages, back then, were with faults reports. Not any different from M9 sub-forum, if not worse. I never seen anything like this on Canon DSLRs forum. But those are not Leica. And Leica is not even Olympus, where you could map out dead pixels by DIY. I'm holding to my 220 M-E and if it will need update, I'll get something from M240 series. M10 price, quality issues are not for my pocket.", "link": "https://www.l-camera-forum.com/topic/317048-vertical-lines/?tab=comments#comment-4121447", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "12 hours ago, boojum said: no. should i? if they have more problems that is awful. stable, reliable camera electronics are a fact. i have old japanese cameras which work fine, like a pentax k1000 and pentax me super plus some old sony digitals. i hope the m10's are not faulty but i now must check. spaceba. i checked, few weeks ago. first four pages, back then, were with faults reports. not any different from m9 sub-forum, if not worse. i never seen anything like this on canon dslrs forum. but those are not leica. and leica is not even olympus, where you could -----> map !!!  out dead pixels by diy. i'm holding to my 220 m-e and if it will need update, i'll get something from m240 series. m10 price, quality issues are not for my pocket.", "sortedWord": "None", "identifyer": 31867, "year": "2021"}, {"Unnamed: 0": 379122, "autor": "romanus53", "date": 1634288820000, "content": "dead pixel that could be mapped by Leica or in post-processing software, note that dead-pixel-mapping is quite normal as long as you dont lose too much of them. my first M8 showed that on high ISO too. Edited October 15 by romanus53", "link": "https://www.l-camera-forum.com/topic/325408-m8-vertikal-line/?tab=comments#comment-4292988", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "dead pixel that could be -----> mapped !!!  by leica or in post-processing software, note that dead-pixel-mapping is quite normal as long as you dont lose too much of them. my first m8 showed that on high iso too. edited october 15 by romanus53", "sortedWord": "None", "identifyer": 40509, "year": "2021"}, {"Unnamed: 0": 379124, "autor": "jaapv", "date": 1634404920000, "content": "It is probably just a pixel that Leica can map out, nothing broken on the sensor. I would send a DNG to Leica and ask.", "link": "https://www.l-camera-forum.com/topic/325408-m8-vertikal-line/?tab=comments#comment-4294001", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "it is probably just a pixel that leica can -----> map !!!  out, nothing broken on the sensor. i would send a dng to leica and ask.", "sortedWord": "None", "identifyer": 40511, "year": "2021"}, {"Unnamed: 0": 391013, "autor": "ramarren", "date": 1626112980000, "content": " I have heard people talking of \"looks like film\", \"looks like Tri-X\", etc, and seen all the film simulation stuff in Fuji cameras for years. I have to say: I've *never* looked at any of my photos with a goal of obtaining a particular film's look and feel, even the photos made with my film cameras. When my medium was 100% film, I chose what film I wanted to work with based on its colors and response curve (always slide film) and just worked with it to get what my eye wanted ... That's much the same as what I do today with instant print cameras since I only ever use B&W negative film otherwise today. What a given B&W film produces is mostly determined by its color sensitivity response curves, which I map with a Color Checker and my usual developing sludge (*all* my film gets the same soup) and the minor nuances of grain and acutance are things I push on to achieve what my eye wants, which isn't necessarily what the film's look and feel are supposed to be. When I am shooting with digital capture, I usually have in mind what I'm looking for as output and it's never a matter of \"I want it to look like 1970s Tri-X in D76\" or some such malarkey as that. I want expressive tonal scale that fits the subject, color tones if I want a polychrome rendering that suits my ideas, and I'll add or subtract grain to make it look the way my eye wants, even if I don't remember what film and developer looked like that once upon a time. So this notion of striving for a \"film look\" seems to me to be mostly talking in circles about things that do not matter. Strive to make photographs that express what you see/feel about the subject, with whatever capture medium you use. Who cares what film it might have once looked like? It's unimportant. Does the photo connect with your emotions and thoughts that motivated you to make it...? That's what's important. --img--  Leica M4-2 + Pentax SMC-L 43mm Special + Instant Magny 35; Fujifilm Instax SQ :: rendered and then reprocessed through ShakeIt Photo app to achieve the instant print surround. Of course, with suitable ingenuity, you can achieve any film look you want. G Edited July 12 by ramarren", "link": "https://www.l-camera-forum.com/topic/321215-a-film-look-in-the-near-future/page/13/?tab=comments#comment-4236909", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " i have heard people talking of \"looks like film\", \"looks like tri-x\", etc, and seen all the film simulation stuff in fuji cameras for years. i have to say: i've *never* looked at any of my photos with a goal of obtaining a particular film's look and feel, even the photos made with my film cameras. when my medium was 100% film, i chose what film i wanted to work with based on its colors and response curve (always slide film) and just worked with it to get what my eye wanted ... that's much the same as what i do today with instant print cameras since i only ever use b&w negative film otherwise today. what a given b&w film produces is mostly determined by its color sensitivity response curves, which i -----> map !!!  with a color checker and my usual developing sludge (*all* my film gets the same soup) and the minor nuances of grain and acutance are things i push on to achieve what my eye wants, which isn't necessarily what the film's look and feel are supposed to be. when i am shooting with digital capture, i usually have in mind what i'm looking for as output and it's never a matter of \"i want it to look like 1970s tri-x in d76\" or some such malarkey as that. i want expressive tonal scale that fits the subject, color tones if i want a polychrome rendering that suits my ideas, and i'll add or subtract grain to make it look the way my eye wants, even if i don't remember what film and developer looked like that once upon a time. so this notion of striving for a \"film look\" seems to me to be mostly talking in circles about things that do not matter. strive to make photographs that express what you see/feel about the subject, with whatever capture medium you use. who cares what film it might have once looked like? it's unimportant. does the photo connect with your emotions and thoughts that motivated you to make it...? that's what's important. --img--  leica m4-2 + pentax smc-l 43mm special + instant magny 35; fujifilm instax sq :: rendered and then reprocessed through shakeit photo app to achieve the instant print surround. of course, with suitable ingenuity, you can achieve any film look you want. g edited july 12 by ramarren", "sortedWord": "None", "identifyer": 3469, "year": "2021"}, {"Unnamed: 0": 401879, "autor": "FrozenInTime", "date": 1631610720000, "content": "Map camera has put up a samples review page https://news.mapcamera.com/k4l/voigtlander-heliar-classic-50mm-f1-5-vm/", "link": "https://www.l-camera-forum.com/topic/323521-rumor-new-heliar-classic-50mm-f15-vm/page/5/?tab=comments#comment-4275000", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "-----> map !!!  camera has put up a samples review page https://news.mapcamera.com/k4l/voigtlander-heliar-classic-50mm-f1-5-vm/", "sortedWord": "None", "identifyer": 14614, "year": "2021"}, {"Unnamed: 0": 410069, "autor": "egrossman", "date": 1628887800000, "content": "The cheapest 35mm Summarit-M/2.5 I could find was in pretty good condition from MAP Camera in Japan for $1,231 with free shipping on eBay. https://www.ebay.com/itm/373673273664?chn=ps&mkevt=1&mkcid=28 Edited August 13 by egrossman", "link": "https://www.l-camera-forum.com/topic/323526-recommandation-for-sharp-35mm-less-than-1000%E2%82%AC-used/?tab=comments#comment-4256328", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "the cheapest 35mm summarit-m/2.5 i could find was in pretty good condition from -----> map !!!  camera in japan for $1,231 with free shipping on ebay. https://www.ebay.com/itm/373673273664?chn=ps&mkevt=1&mkcid=28 edited august 13 by egrossman", "sortedWord": "None", "identifyer": 22897, "year": "2021"}, {"Unnamed: 0": 412056, "autor": "rtai", "date": 1626964380000, "content": "11 minutes ago, a.noctilux said: As life goes on, @rtaiwe have some regrets (or not) some proud events which make our life wonderful, or as I try to 'live', now 'just take the present from present time'. As side note, I was ( happily my wife also) for decades exclusive fan of Kodachrome which in that time only taken with plain lenses (no asph. in those days for us). While I no longer have a drawer full of exotic lenses I do have a large portfolio of half way ok photographs over the years and I am happy with that. I remember being in Tokyo the day the new Noctilux .95 was released and I had to look at it at Map Camera in Shinjuku. It was the equivalent of US$10k. And ten feet away in the used section was a mint condition Noctilux 50/1.2 for the exact same price. I had my credit card handy as well as my passport for the tax free discount but remembered my wife had sat next to me on the flight over. Rats! So that was the day I didn’t get my 50/1.2. (Sound of the world’s smallest violin).", "link": "https://www.l-camera-forum.com/topic/299418-summilux-35-pre-asph-vs-pre-fle-vs-fle/page/4/?tab=comments#comment-4242955", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "11 minutes ago, a.noctilux said: as life goes on, @rtaiwe have some regrets (or not) some proud events which make our life wonderful, or as i try to 'live', now 'just take the present from present time'. as side note, i was ( happily my wife also) for decades exclusive fan of kodachrome which in that time only taken with plain lenses (no asph. in those days for us). while i no longer have a drawer full of exotic lenses i do have a large portfolio of half way ok photographs over the years and i am happy with that. i remember being in tokyo the day the new noctilux .95 was released and i had to look at it at -----> map !!!  camera in shinjuku. it was the equivalent of us$10k. and ten feet away in the used section was a mint condition noctilux 50/1.2 for the exact same price. i had my credit card handy as well as my passport for the tax free discount but remembered my wife had sat next to me on the flight over. rats! so that was the day i didn’t get my 50/1.2. (sound of the world’s smallest violin).", "sortedWord": "None", "identifyer": 24900, "year": "2021"}, {"Unnamed: 0": 412235, "autor": "a.noctilux", "date": 1626561600000, "content": "2 hours ago, Gobert said: Ducati produces only friendly vibrations. Those won’t hurt the M-mechanism. I’m not sure however about BMW. That’s more a shaker. Yes flat twin motorbike is kind of shaker 😌, but becomes better since three or four generations of BMW. I travel thousands of kms with tank bag with M inside, R1100, R1150, R1200, more or less on difficult roads. From experience, I just had some 'padding', as clothes or under/in the bag a thick foam to absorb vibrations. Voyager Bag is very nice for map and some photo gear 'protected' and easy access. --img-- ", "link": "https://www.l-camera-forum.com/topic/322778-tri-elmar-mate-and-bmw1200gs-great-combination/?tab=comments#comment-4240058", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "2 hours ago, gobert said: ducati produces only friendly vibrations. those won’t hurt the m-mechanism. i’m not sure however about bmw. that’s more a shaker. yes flat twin motorbike is kind of shaker 😌, but becomes better since three or four generations of bmw. i travel thousands of kms with tank bag with m inside, r1100, r1150, r1200, more or less on difficult roads. from experience, i just had some 'padding', as clothes or under/in the bag a thick foam to absorb vibrations. voyager bag is very nice for -----> map !!!  and some photo gear 'protected' and easy access. --img-- ", "sortedWord": "None", "identifyer": 25085, "year": "2021"}, {"Unnamed: 0": 413041, "autor": "NigelG", "date": 1613583360000, "content": "My understanding is that the silverchrome V2 Ultra is made of brass whereas the various V1 versions are \"metal\". (Checked specs - 210g vs 170g for V1 so might be the case) I have been tracking down a copy of the lovely Map Camera special edition of the Classic MC v1 in chromed brass to use as a walk around on my chrome M9M but this is a more affordable/better performer so maybe....🤔 Edited February 17 by NigelG", "link": "https://www.l-camera-forum.com/topic/317846-voigtlander-apo-lanthar-35mm-f2-aspherical-vm/page/3/?tab=comments#comment-4143318", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "my understanding is that the silverchrome v2 ultra is made of brass whereas the various v1 versions are \"metal\". (checked specs - 210g vs 170g for v1 so might be the case) i have been tracking down a copy of the lovely -----> map !!!  camera special edition of the classic mc v1 in chromed brass to use as a walk around on my chrome m9m but this is a more affordable/better performer so maybe....🤔 edited february 17 by nigelg", "sortedWord": "None", "identifyer": 25893, "year": "2021"}, {"Unnamed: 0": 414974, "autor": "Andrew Gough", "date": 1637781300000, "content": "I have no doubt that all of your reasons are valid. But these lenses were originally on a road map with a 2018 release, then 2019 and so on. It's the end of 2021 going into 2022, and yes covid has been and issue, but it should be manageable buy now. Releasing the 28mm should have been delayed in favour of the 21mm. I support Leica as much as the next guy, and I am heavily invested in the SL system. But, I fear that I will be on my THIRD generation body before these lenses are released. Maybe a few less special editions and a little more bread and butter is required. SL lens production needs to be ramped up to take care of demand. That said, the 35mm and 28mm are widely available now. Hopefully, the 21mm & 24mm should be forthcoming. Heck, even a road map would be nice. Edited November 24 by Andrew Gough", "link": "https://www.l-camera-forum.com/topic/319852-sve-16-35-or-summilux-m-21-14/page/3/?tab=comments#comment-4319665", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i have no doubt that all of your reasons are valid. but these lenses were originally on a road -----> map !!!  with a 2018 release, then 2019 and so on. it's the end of 2021 going into 2022, and yes covid has been and issue, but it should be manageable buy now. releasing the 28mm should have been delayed in favour of the 21mm. i support leica as much as the next guy, and i am heavily invested in the sl system. but, i fear that i will be on my third generation body before these lenses are released. maybe a few less special editions and a little more bread and butter is required. sl lens production needs to be ramped up to take care of demand. that said, the 35mm and 28mm are widely available now. hopefully, the 21mm & 24mm should be forthcoming. heck, even a road map would be nice. edited november 24 by andrew gough", "sortedWord": "None", "identifyer": 27910, "year": "2021"}, {"Unnamed: 0": 416761, "autor": "Tom B", "date": 1624164780000, "content": "vor 10 Stunden schrieb Bernd B.: Julian, save time and nerves. I have a tracking-app running when taking photos I want with gps-data. Then the usual way: export the gps-file to lightroom, let lightroom do the work. This always works. which LR version are you using? I'm using the online version - without the maps - and couldn't find the the way; only for the classic version 🙂 Thanks a lot - this a point which makes me really angry of Leica. tom Edited June 20 by Tom B", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/8/?tab=comments#comment-4223202", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "vor 10 stunden schrieb bernd b.: julian, save time and nerves. i have a tracking-app running when taking photos i want with gps-data. then the usual way: export the gps-file to lightroom, let lightroom do the work. this always works. which lr version are you using? i'm using the online version - without the -----> maps !!!  - and couldn't find the the way; only for the classic version 🙂 thanks a lot - this a point which makes me really angry of leica. tom edited june 20 by tom b", "sortedWord": "None", "identifyer": 29762, "year": "2021"}, {"Unnamed: 0": 417961, "autor": "eab", "date": 1611081360000, "content": "11 hours ago, beewee said: I feel the same about this. If Sigma wasn’t in the Alliance, I don’t think I would get into the L-mount system. As far as bodies go, having been an M shooter for over 10yrs with a fairly complete set of M lenses that I like, I’d definitely go for an Leica body. For L-mount lenses though, Sigma has a few unique lenses that have no equivalent options from Panasonic or Leica. A good example is the 14-24mm DG DN zoom which is great for astrophotography. As far as SL lenses go, the primes have a very unique modern look with the smooth bokeh and low contrast OOF areas that I don’t think any other lens (even SL zooms) can replicate. To me, these will become classics (assuming they keep working 30+ years from now) whereas the current Leica SL zooms, although offering better sharpness compared to their Panasonic and Sigma equivalents is 2-3x more expensive and doesn’t seem to have a rendering that stands out from the other options. For me, it’s nice to have a sharp lens with good micro contrast if you’re printing but most images these days are consumed digitally and are compressed. For this reason, most subtle improvements in micro contrast will be completely destroyed and go unappreciated when the images are shared digitally. On the other hand, a lens that offers a unique rendering/drawing/bokeh can be appreciated even on an iPad and that to me is very appealing. In other words, if I needed a decent zoom, I would probably go with a Sigma or Panasonic option and put the money I save into the real unique lenses like the SL primes. Hi Beewee, Thank you for the comments. Yes the L-Alliance makes the decision easier. Your comments regarding the Sigma lenses unique offerings will cause me to look at little harder at what that means, in some ways I have been focused on the body and knowing there is flexibility in lens selection has made that an easier decision. I think once I settle on the body, I will need to do more thinking about the lenses and work out a little road map based not he current offerings. Your comment regarding the unique rendering that the Summicrons provide vs the more generic Leica Zoom offering is one I really need to consider. I was going to start with the 24-90 and one of the bodies, but it sounds like I should not make the decision with out some more thought. I am sure I will purchase some primes if I enjoy the using the body and zoom but it will come after the zoom as I was planning on using M primes initially. I am going to look around on the forum for discussions on the zooms. Thank you for specifically pointing that out!!", "link": "https://www.l-camera-forum.com/topic/317060-sl2-or-sl2-s-advice-appreciated/page/2/?tab=comments#comment-4121514", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "11 hours ago, beewee said: i feel the same about this. if sigma wasn’t in the alliance, i don’t think i would get into the l-mount system. as far as bodies go, having been an m shooter for over 10yrs with a fairly complete set of m lenses that i like, i’d definitely go for an leica body. for l-mount lenses though, sigma has a few unique lenses that have no equivalent options from panasonic or leica. a good example is the 14-24mm dg dn zoom which is great for astrophotography. as far as sl lenses go, the primes have a very unique modern look with the smooth bokeh and low contrast oof areas that i don’t think any other lens (even sl zooms) can replicate. to me, these will become classics (assuming they keep working 30+ years from now) whereas the current leica sl zooms, although offering better sharpness compared to their panasonic and sigma equivalents is 2-3x more expensive and doesn’t seem to have a rendering that stands out from the other options. for me, it’s nice to have a sharp lens with good micro contrast if you’re printing but most images these days are consumed digitally and are compressed. for this reason, most subtle improvements in micro contrast will be completely destroyed and go unappreciated when the images are shared digitally. on the other hand, a lens that offers a unique rendering/drawing/bokeh can be appreciated even on an ipad and that to me is very appealing. in other words, if i needed a decent zoom, i would probably go with a sigma or panasonic option and put the money i save into the real unique lenses like the sl primes. hi beewee, thank you for the comments. yes the l-alliance makes the decision easier. your comments regarding the sigma lenses unique offerings will cause me to look at little harder at what that means, in some ways i have been focused on the body and knowing there is flexibility in lens selection has made that an easier decision. i think once i settle on the body, i will need to do more thinking about the lenses and work out a little road -----> map !!!  based not he current offerings. your comment regarding the unique rendering that the summicrons provide vs the more generic leica zoom offering is one i really need to consider. i was going to start with the 24-90 and one of the bodies, but it sounds like i should not make the decision with out some more thought. i am sure i will purchase some primes if i enjoy the using the body and zoom but it will come after the zoom as i was planning on using m primes initially. i am going to look around on the forum for discussions on the zooms. thank you for specifically pointing that out!!", "sortedWord": "None", "identifyer": 30966, "year": "2021"}, {"Unnamed: 0": 419706, "autor": "BernardC", "date": 1629727140000, "content": " 1 hour ago, MITDelay said: From this article, Panasonic will stick to improving the contrast detection autofocus with DFD. If Leica continues to cooperate with Panasonicin dveloping SL cameras (which I think they will for awhile becuase of the L mount alliance), then maybe they will also stick with the CDAF for years to come. My assumption of course is that CDAF/PDAF is a hardware issue and not a software one so that Leica cannot just develop PDAF saftware to use on the cameras. I don't know enough to break that assumption. Yes, phase detect is a hardware thing. PDAF sensors have extra elements on the sensor which determine if an subject is in-front-of, or behind, the plane of focus. This has benefits for autofocus speed, but not for accuracy. It has disadvantages too. In the interview, the Panasonic executive states that they are working on technology to bridge the gap. I suspect that these are time-of-flight sensors, a technology in which Leica and Panasonic are both involved. ToF sensors draw a low-resolution distance map of a scene, which can be used to speed-up initial focus acquisition. This would compensate for the main shortcoming of CDAF: the fact that the camera doesn't know the direction of subject movement in the depth axis (it can do left/right, up/down just fine). The L-Mount Alliance doesn't prevent the use of PDAF. Sigma uses a Sony PDAF sensor in their fp-l camera.", "link": "https://www.l-camera-forum.com/topic/323614-sl2-s-autofocus/page/2/?tab=comments#comment-4261955", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " 1 hour ago, mitdelay said: from this article, panasonic will stick to improving the contrast detection autofocus with dfd. if leica continues to cooperate with panasonicin dveloping sl cameras (which i think they will for awhile becuase of the l mount alliance), then maybe they will also stick with the cdaf for years to come. my assumption of course is that cdaf/pdaf is a hardware issue and not a software one so that leica cannot just develop pdaf saftware to use on the cameras. i don't know enough to break that assumption. yes, phase detect is a hardware thing. pdaf sensors have extra elements on the sensor which determine if an subject is in-front-of, or behind, the plane of focus. this has benefits for autofocus speed, but not for accuracy. it has disadvantages too. in the interview, the panasonic executive states that they are working on technology to bridge the gap. i suspect that these are time-of-flight sensors, a technology in which leica and panasonic are both involved. tof sensors draw a low-resolution distance -----> map !!!  of a scene, which can be used to speed-up initial focus acquisition. this would compensate for the main shortcoming of cdaf: the fact that the camera doesn't know the direction of subject movement in the depth axis (it can do left/right, up/down just fine). the l-mount alliance doesn't prevent the use of pdaf. sigma uses a sony pdaf sensor in their fp-l camera.", "sortedWord": "None", "identifyer": 32718, "year": "2021"}, {"Unnamed: 0": 419707, "autor": "MITDelay", "date": 1629728280000, "content": "6 minutes ago, BernardC said: Yes, phase detect is a hardware thing. PDAF sensors have extra elements on the sensor which determine if an subject is in-front-of, or behind, the plane of focus. This has benefits for autofocus speed, but not for accuracy. It has disadvantages too. In the interview, the Panasonic executive states that they are working on technology to bridge the gap. I suspect that these are time-of-flight sensors, a technology in which Leica and Panasonic are both involved. ToF sensors draw a low-resolution distance map of a scene, which can be used to speed-up initial focus acquisition. This would compensate for the main shortcoming of CDAF: the fact that the camera doesn't know the direction of subject movement in the depth axis (it can do left/right, up/down just fine). The L-Mount Alliance doesn't prevent the use of PDAF. Sigma uses a Sony PDAF sensor in their fp-l camera. Truly informative. Thank you Do you think even with the ToF sensors, it will be on par with canon's dual pixel PDAF? I mean, even if given time, does ToF sensors have that kind of potential? That would be very nice due to the fact that autofocusing (especially in video mode) is one of Panasonic (and Leica's) camera's biggest weakness. I understand the L mount alliance does not prevent anyone in the alliance to use PDAF; however, I suspect Leica depends heavily on Panasonic for the hardware development for the SL2, while Leica focuses on the software for their own cameras, given that the internal architechture is very similar to that of Panasonic's S1 series. That includes CDAF. Unless of course Leica will also cooperate with Sigma in making a camera, in which case we the leica customers will gain all the benefits.", "link": "https://www.l-camera-forum.com/topic/323614-sl2-s-autofocus/page/2/?tab=comments#comment-4261972", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "6 minutes ago, bernardc said: yes, phase detect is a hardware thing. pdaf sensors have extra elements on the sensor which determine if an subject is in-front-of, or behind, the plane of focus. this has benefits for autofocus speed, but not for accuracy. it has disadvantages too. in the interview, the panasonic executive states that they are working on technology to bridge the gap. i suspect that these are time-of-flight sensors, a technology in which leica and panasonic are both involved. tof sensors draw a low-resolution distance -----> map !!!  of a scene, which can be used to speed-up initial focus acquisition. this would compensate for the main shortcoming of cdaf: the fact that the camera doesn't know the direction of subject movement in the depth axis (it can do left/right, up/down just fine). the l-mount alliance doesn't prevent the use of pdaf. sigma uses a sony pdaf sensor in their fp-l camera. truly informative. thank you do you think even with the tof sensors, it will be on par with canon's dual pixel pdaf? i mean, even if given time, does tof sensors have that kind of potential? that would be very nice due to the fact that autofocusing (especially in video mode) is one of panasonic (and leica's) camera's biggest weakness. i understand the l mount alliance does not prevent anyone in the alliance to use pdaf; however, i suspect leica depends heavily on panasonic for the hardware development for the sl2, while leica focuses on the software for their own cameras, given that the internal architechture is very similar to that of panasonic's s1 series. that includes cdaf. unless of course leica will also cooperate with sigma in making a camera, in which case we the leica customers will gain all the benefits.", "sortedWord": "None", "identifyer": 32719, "year": "2021"}, {"Unnamed: 0": 419843, "autor": "Pixeleater", "date": 1621989000000, "content": "I followed a similar usage map as the OP. I primarily shoot with the M10-R + 28 1.4, 50 APO or 50 Lux BC. Bought an SL2-S to use with the M lenses. Love the EVF and focus peaking assist more often than I want to admit (that, and the M10-R is back at Wetzler for adjustments.) so I use the SL2-S all the time I bought a new 90-280 just before the price increase. (Searched for a used one but finding one was like searching for a white ptarmigan in blizzard conditions. It wasn't happening.) I wanted the reach and native IBIS in body and lens. I use it for nature and birds (I live on a lake) and the last firmware update seems to help on the photo side for AF. I use to shoot with the Canon 5D Mark IV + 300 2.8. Mostly sports. Stayed away from teleconverters because I did not want to lose stop. Perhaps the L alliance will produce a 300 2.8 telephoto. That would be fun to try out.", "link": "https://www.l-camera-forum.com/topic/320803-should-i-get-the-90-280-lens/page/2/?tab=comments#comment-4207899", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i followed a similar usage -----> map !!!  as the op. i primarily shoot with the m10-r + 28 1.4, 50 apo or 50 lux bc. bought an sl2-s to use with the m lenses. love the evf and focus peaking assist more often than i want to admit (that, and the m10-r is back at wetzler for adjustments.) so i use the sl2-s all the time i bought a new 90-280 just before the price increase. (searched for a used one but finding one was like searching for a white ptarmigan in blizzard conditions. it wasn't happening.) i wanted the reach and native ibis in body and lens. i use it for nature and birds (i live on a lake) and the last firmware update seems to help on the photo side for af. i use to shoot with the canon 5d mark iv + 300 2.8. mostly sports. stayed away from teleconverters because i did not want to lose stop. perhaps the l alliance will produce a 300 2.8 telephoto. that would be fun to try out.", "sortedWord": "None", "identifyer": 32856, "year": "2021"}, {"Unnamed: 0": 420228, "autor": "6bit", "date": 1626833040000, "content": " After shooting my SL 50 Lux, I of course wonder if Leica could stuff a 35 Lux into that lens casing. Anyone know if this is likely? I'm unsure of their road map and what lenses they consider priorities in the SL system.", "link": "https://www.l-camera-forum.com/topic/322867-sl-35-lux-will-there-be-one/?tab=comments#comment-4241869", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " after shooting my sl 50 lux, i of course wonder if leica could stuff a 35 lux into that lens casing. anyone know if this is likely? i'm unsure of their road -----> map !!!  and what lenses they consider priorities in the sl system.", "sortedWord": "None", "identifyer": 33245, "year": "2021"}, {"Unnamed: 0": 420538, "autor": "Ktsa5239", "date": 1628774340000, "content": "I wanted to test mine as well so I took the experiment to the extreme. Went out to my balcony and shot the furtherst thing possible. This is an apartment block over 5km away according to google maps. Using 280mm f8 and 30 sec shutter 200% crop. I’m impressed with this lens more than ever. --img--  Edited August 12 by Ktsa5239", "link": "https://www.l-camera-forum.com/topic/323376-apo-vario-90-280-sharpness-at-the-long-end/page/3/?tab=comments#comment-4255598", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "i wanted to test mine as well so i took the experiment to the extreme. went out to my balcony and shot the furtherst thing possible. this is an apartment block over 5km away according to -----> google !!!  -----> maps !!! . using 280mm f8 and 30 sec shutter 200% crop. i’m impressed with this lens more than ever. --img--  edited august 12 by ktsa5239", "sortedWord": "None", "identifyer": 33556, "year": "2021"}, {"Unnamed: 0": 420540, "autor": "meerec", "date": 1628779740000, "content": "1 hour ago, Ktsa5239 said: This is an apartment block over 5km away according to google maps. Using 280mm f8 and 30 sec shutter 200% crop. I’m impressed with this lens more than ever. This is a very impressive lens, no doubt but I’m afraid your image doesn’t stand a chance to illustrate the superiority of this zoom. With your subject 5km away, the air instability and vibration blurs the image and it shows in your pic, no matter what you do and how carefully you approach it.", "link": "https://www.l-camera-forum.com/topic/323376-apo-vario-90-280-sharpness-at-the-long-end/page/3/?tab=comments#comment-4255646", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "1 hour ago, ktsa5239 said: this is an apartment block over 5km away according to -----> google !!!  -----> maps !!! . using 280mm f8 and 30 sec shutter 200% crop. i’m impressed with this lens more than ever. this is a very impressive lens, no doubt but i’m afraid your image doesn’t stand a chance to illustrate the superiority of this zoom. with your subject 5km away, the air instability and vibration blurs the image and it shows in your pic, no matter what you do and how carefully you approach it.", "sortedWord": "None", "identifyer": 33558, "year": "2021"}, {"Unnamed: 0": 421032, "autor": "BernardC", "date": 1627054140000, "content": "To recap, the SL2-S (and SL before that) has two ways of recording 4K. In \"Super-35\" (crop) mode it maps a 4K area in the centre of the sensor, and samples the pixels 1:1. This area is roughly 24mm wide, similar to 35mm motion picture film. In \"full frame\" mode it uses the full width of the sensor (a little less for UHD) and over-samples it. This isn't \"pixel binning\", more like RGGB-to-RGB. Sony uses a similar algorithm in some of their cine cameras, as do others. The 47MP SL2 uses oversampling all the time.", "link": "https://www.l-camera-forum.com/topic/322913-how-is-video-processed-on-the-sl2-s/?tab=comments#comment-4243696", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "to recap, the sl2-s (and sl before that) has two ways of recording 4k. in \"super-35\" (crop) mode it -----> maps !!!  a 4k area in the centre of the sensor, and samples the pixels 1:1. this area is roughly 24mm wide, similar to 35mm motion picture film. in \"full frame\" mode it uses the full width of the sensor (a little less for uhd) and over-samples it. this isn't \"pixel binning\", more like rggb-to-rgb. sony uses a similar algorithm in some of their cine cameras, as do others. the 47mp sl2 uses oversampling all the time.", "sortedWord": "None", "identifyer": 34052, "year": "2021"}, {"Unnamed: 0": 422892, "autor": "jrp", "date": 1623531000000, "content": " Yes, hard to map. Distance x f stop -> front : back ratio", "link": "https://www.l-camera-forum.com/topic/305622-leica-apo-summicron-sl2035mm-average-performer/page/14/?tab=comments#comment-4218985", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " yes, hard to -----> map !!! . distance x f stop -> front : back ratio", "sortedWord": "None", "identifyer": 35940, "year": "2021"}, {"Unnamed: 0": 424607, "autor": "jolsen", "date": 1634115060000, "content": "I have the X2 and CL. I bought the CL to use it with my R and M lenses. I have no issue with the X being discontinued, and no issues with no road map for the CL. Both cameras are working well and fits my needs. Happy that Leica is not tempting me to by gear I don’t really need 😀.", "link": "https://www.l-camera-forum.com/topic/325292-my-message-to-leica-ag-in-regards-to-cl/page/3/?tab=comments#comment-4291594", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i have the x2 and cl. i bought the cl to use it with my r and m lenses. i have no issue with the x being discontinued, and no issues with no road -----> map !!!  for the cl. both cameras are working well and fits my needs. happy that leica is not tempting me to by gear i don’t really need 😀.", "sortedWord": "None", "identifyer": 37686, "year": "2021"}, {"Unnamed: 0": 425040, "autor": "frame-it", "date": 1637372340000, "content": " \"Road map\" looked exciting, i though it might be a lens roadmap uploaded by mistake, turned out to be a map to get to the leica kyoto store", "link": "https://www.l-camera-forum.com/topic/326746-location-of-latest-cl-firmware/?tab=comments#comment-4316636", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " \"road -----> map !!! \" looked exciting, i though it might be a lens roadmap uploaded by mistake, turned out to be a -----> map !!!  to get to the leica kyoto store", "sortedWord": "None", "identifyer": 38125, "year": "2021"}, {"Unnamed: 0": 442103, "autor": "p-arrow", "date": 1625706060000, "content": "Yes you can! You can map ‘magnification’ to the Fn button, which makes it work exactly as you want. Press it to engage the magnification, press again or half press the shutter to disengage. I just set mine ip this way to see how I like it. I find the auto zoom annoying too, but having the option is nice…", "link": "https://www.l-camera-forum.com/topic/321561-can-you-assign-zoom-function-for-the-purpose-of-manual-focus-to-a-button/?tab=comments#comment-4234034", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "yes you can! you can -----> map !!!  ‘magnification’ to the fn button, which makes it work exactly as you want. press it to engage the magnification, press again or half press the shutter to disengage. i just set mine ip this way to see how i like it. i find the auto zoom annoying too, but having the option is nice…", "sortedWord": "None", "identifyer": 5452, "year": "2021"}, {"Unnamed: 0": 442105, "autor": "pau.cod", "date": 1629708000000, "content": "On 7/8/2021 at 3:01 AM, p-arrow said: Yes you can! You can map ‘magnification’ to the Fn button, which makes it work exactly as you want. Press it to engage the magnification, press again or half press the shutter to disengage. I just set mine ip this way to see how I like it. I find the auto zoom annoying too, but having the option is nice… Amazing thank you!!!!", "link": "https://www.l-camera-forum.com/topic/321561-can-you-assign-zoom-function-for-the-purpose-of-manual-focus-to-a-button/?tab=comments#comment-4261757", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "on 7/8/2021 at 3:01 am, p-arrow said: yes you can! you can -----> map !!!  ‘magnification’ to the fn button, which makes it work exactly as you want. press it to engage the magnification, press again or half press the shutter to disengage. i just set mine ip this way to see how i like it. i find the auto zoom annoying too, but having the option is nice… amazing thank you!!!!", "sortedWord": "None", "identifyer": 5454, "year": "2021"}, {"Unnamed: 0": 442106, "autor": "Ba Erv", "date": 1629726180000, "content": "I have mapped the center button on the top wheel to magnify. Pretty intuitive to use for me.", "link": "https://www.l-camera-forum.com/topic/321561-can-you-assign-zoom-function-for-the-purpose-of-manual-focus-to-a-button/?tab=comments#comment-4261950", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "i have -----> mapped !!!  the center button on the top wheel to magnify. pretty intuitive to use for me.", "sortedWord": "None", "identifyer": 5455, "year": "2021"}, {"Unnamed: 0": 442107, "autor": "Hemmer", "date": 1629834480000, "content": "On 8/23/2021 at 3:43 PM, Ba Erv said: I have mapped the center button on the top wheel to magnify. Pretty intuitive to use for me. Yup, exact same here.", "link": "https://www.l-camera-forum.com/topic/321561-can-you-assign-zoom-function-for-the-purpose-of-manual-focus-to-a-button/?tab=comments#comment-4262873", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "on 8/23/2021 at 3:43 pm, ba erv said: i have -----> mapped !!!  the center button on the top wheel to magnify. pretty intuitive to use for me. yup, exact same here.", "sortedWord": "None", "identifyer": 5456, "year": "2021"}, {"Unnamed: 0": 443859, "autor": "gteague", "date": 1619538660000, "content": "the changelog is now up for the v3.1 update. and indeed it addresses exactly the issue all us left-eye shooters were having with the field af mode. there is now a setting to turn off touch af focusing while using the evf and the default setting is /off/ which is why i immediately discovered it had solved the problem. it seems that this issue and pixel mapping are the new things in this update. i hope the pixel mapping addition doesn't mean a lot of user are reporting dead pixels that need to be mapped out. Quote TOUCH AF IN EVF MODE Touch AF is deactivated by default when EVF is in use to prevent any inadvertent altering of the AF metering field. AF Quick Setting continues to be accessible. This function can also be disabled if that is not wanted (e.g. when focusing with the left eye). Factory setting: Off ▸ Select Focusing in the main menu ▸ Select Touch AF in EVF ▸ Select the desired setting (On, AF Quick Setting only, Off) – On – Positioning of the AF metering field (quick tap) – Accessing the AF Quick Setting (touch and hold) – AF Quick Setting only – Accessing the AF Quick Setting (touch and hold) – Off Note • In this case, you can change the position of the AF metering field by swiping. /guy Edited April 27 by gteague", "link": "https://www.l-camera-forum.com/topic/320347-firmware-31-q2-now-available/?tab=comments#comment-4189623", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "the changelog is now up for the v3.1 update. and indeed it addresses exactly the issue all us left-eye shooters were having with the field af mode. there is now a setting to turn off touch af focusing while using the evf and the default setting is /off/ which is why i immediately discovered it had solved the problem. it seems that this issue and pixel mapping are the new things in this update. i hope the pixel mapping addition doesn't mean a lot of user are reporting dead pixels that need to be -----> mapped !!!  out. quote touch af in evf mode touch af is deactivated by default when evf is in use to prevent any inadvertent altering of the af metering field. af quick setting continues to be accessible. this function can also be disabled if that is not wanted (e.g. when focusing with the left eye). factory setting: off ▸ select focusing in the main menu ▸ select touch af in evf ▸ select the desired setting (on, af quick setting only, off) – on – positioning of the af metering field (quick tap) – accessing the af quick setting (touch and hold) – af quick setting only – accessing the af quick setting (touch and hold) – off note • in this case, you can change the position of the af metering field by swiping. /guy edited april 27 by gteague", "sortedWord": "None", "identifyer": 7243, "year": "2021"}, {"Unnamed: 0": 443860, "autor": "Marc B-C", "date": 1619545740000, "content": "1 hour ago, gteague said: the changelog is now up for the v3.1 update. and indeed it addresses exactly the issue all us left-eye shooters were having with the field af mode. there is now a setting to turn off touch af focusing while using the evf and the default setting is /off/ which is why i immediately discovered it had solved the problem. it seems that this issue and pixel mapping are the new things in this update. i hope the pixel mapping addition doesn't mean a lot of user are reporting dead pixels that need to be mapped out. /guy Having deliberately rubbed my nose over the EVF, I can confirm this works! I now have to wipe the EVF.", "link": "https://www.l-camera-forum.com/topic/320347-firmware-31-q2-now-available/?tab=comments#comment-4189694", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "1 hour ago, gteague said: the changelog is now up for the v3.1 update. and indeed it addresses exactly the issue all us left-eye shooters were having with the field af mode. there is now a setting to turn off touch af focusing while using the evf and the default setting is /off/ which is why i immediately discovered it had solved the problem. it seems that this issue and pixel mapping are the new things in this update. i hope the pixel mapping addition doesn't mean a lot of user are reporting dead pixels that need to be -----> mapped !!!  out. /guy having deliberately rubbed my nose over the evf, i can confirm this works! i now have to wipe the evf.", "sortedWord": "None", "identifyer": 7244, "year": "2021"}, {"Unnamed: 0": 443864, "autor": "nicci78", "date": 1619595840000, "content": "15 hours ago, gteague said: i hope the pixel mapping addition doesn't mean a lot of user are reporting dead pixels that need to be mapped out. Every high MP count cameras have such issue. Typically the camera is correcting them directly in jpg and Lightroom will do so for the DNG. So you almost never notice it. But it is there and it can get worst with time. Edited April 28 by nicci78", "link": "https://www.l-camera-forum.com/topic/320347-firmware-31-q2-now-available/?tab=comments#comment-4189979", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "15 hours ago, gteague said: i hope the pixel mapping addition doesn't mean a lot of user are reporting dead pixels that need to be -----> mapped !!!  out. every high mp count cameras have such issue. typically the camera is correcting them directly in jpg and lightroom will do so for the dng. so you almost never notice it. but it is there and it can get worst with time. edited april 28 by nicci78", "sortedWord": "None", "identifyer": 7248, "year": "2021"}, {"Unnamed: 0": 443990, "autor": "nwphil", "date": 1609612500000, "content": "4 hours ago, Leica Guy said: It would be very helpful to hear from Leica if they do have a built-in firmware capability for mapping out the hot pixels. Replacing cameras seems like a very expensive solution. Has anyone received feedback from Leica to the affirmative? sort of...they are not admitting yet there is a problem, but they seem to have way to solve it, and aware that pixels need extra time to get re-mapped with use or if not, an in-house software fix Edited January 2 by nwphil", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/5/?tab=comments#comment-4110827", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "4 hours ago, leica guy said: it would be very helpful to hear from leica if they do have a built-in firmware capability for mapping out the hot pixels. replacing cameras seems like a very expensive solution. has anyone received feedback from leica to the affirmative? sort of...they are not admitting yet there is a problem, but they seem to have way to solve it, and aware that pixels need extra time to get re------> mapped !!!  with use or if not, an in-house software fix edited january 2 by nwphil", "sortedWord": "None", "identifyer": 7375, "year": "2021"}, {"Unnamed: 0": 443997, "autor": "hdmesa", "date": 1609691640000, "content": "39 minutes ago, SrMi said: The pixel should appear at ISO 800 already (none at ISO 400). My Q2 has no stuck pixels when testing with fast shutter speed. Your Q2 probably does have them as do all cameras, but the firmware maps them out just like it does on the Q2M JPEGs. Leica just needs to update the firmware to address the issue.", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/5/?tab=comments#comment-4111465", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "39 minutes ago, srmi said: the pixel should appear at iso 800 already (none at iso 400). my q2 has no stuck pixels when testing with fast shutter speed. your q2 probably does have them as do all cameras, but the firmware -----> maps !!!  them out just like it does on the q2m jpegs. leica just needs to update the firmware to address the issue.", "sortedWord": "None", "identifyer": 7382, "year": "2021"}, {"Unnamed: 0": 444059, "autor": "SrMi", "date": 1615155660000, "content": "6 hours ago, Marc B-C said: Agreed and thank you. Being in the UK, probably now means a much longer wait for me if the camera has to go back to Germany or I cannot get a clean third copy from the dealer this week and/or the firmware update does not apply to the Q2. The firmware update should address a separate issue that occurred only on Q2M (hot pixels appear only after dual gain conversion kicks in), but maybe they'll add a manual trigger of pixel remapping. You could try to run Q2's DNG files through the free Adobe DNG Converter (you could lossless compress the files while doing it) and see if the DNG conversion maps out the hot pixels.", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/9/?tab=comments#comment-4155902", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "6 hours ago, marc b-c said: agreed and thank you. being in the uk, probably now means a much longer wait for me if the camera has to go back to germany or i cannot get a clean third copy from the dealer this week and/or the firmware update does not apply to the q2. the firmware update should address a separate issue that occurred only on q2m (hot pixels appear only after dual gain conversion kicks in), but maybe they'll add a manual trigger of pixel remapping. you could try to run q2's dng files through the free adobe dng converter (you could lossless compress the files while doing it) and see if the dng conversion -----> maps !!!  out the hot pixels.", "sortedWord": "None", "identifyer": 7444, "year": "2021"}, {"Unnamed: 0": 444061, "autor": "Marc B-C", "date": 1615158180000, "content": "40 minutes ago, SrMi said: The firmware update should address a separate issue that occurred only on Q2M (hot pixels appear only after dual gain conversion kicks in), but maybe they'll add a manual trigger of pixel remapping. You could try to run Q2's DNG files through the free Adobe DNG Converter (you could lossless compress the files while doing it) and see if the DNG conversion maps out the hot pixels. If camera three has the same issue and the firmware will not work on the Q2, I will edit it out.", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/9/?tab=comments#comment-4155925", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "40 minutes ago, srmi said: the firmware update should address a separate issue that occurred only on q2m (hot pixels appear only after dual gain conversion kicks in), but maybe they'll add a manual trigger of pixel remapping. you could try to run q2's dng files through the free adobe dng converter (you could lossless compress the files while doing it) and see if the dng conversion -----> maps !!!  out the hot pixels. if camera three has the same issue and the firmware will not work on the q2, i will edit it out.", "sortedWord": "None", "identifyer": 7446, "year": "2021"}, {"Unnamed: 0": 444074, "autor": "jaapv", "date": 1616316060000, "content": "I wouldn't call it a defective sensor - all commercial grade sensors have a certain percentage of defective pixels from manufacture, and are graded and priced accordingly. Normally they are mapped out in the factory, but somehow this particular sensor appears to throw them up at an early later stage. Normally \"new\". dead or hot pixels show up after years of use. I'm sure that was a surprise for Leica as well. Let's hope that they get their remapping firmware out soon. There are 100% perfect sensors on the market for scientific use, but providing those would drive up the price of the camera by magnitudes.", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/9/?tab=comments#comment-4165048", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "i wouldn't call it a defective sensor - all commercial grade sensors have a certain percentage of defective pixels from manufacture, and are graded and priced accordingly. normally they are -----> mapped !!!  out in the factory, but somehow this particular sensor appears to throw them up at an early later stage. normally \"new\". dead or hot pixels show up after years of use. i'm sure that was a surprise for leica as well. let's hope that they get their remapping firmware out soon. there are 100% perfect sensors on the market for scientific use, but providing those would drive up the price of the camera by magnitudes.", "sortedWord": "None", "identifyer": 7459, "year": "2021"}, {"Unnamed: 0": 444076, "autor": "nwphil", "date": 1616348340000, "content": "8 hours ago, jaapv said: I wouldn't call it a defective sensor - all commercial grade sensors have a certain percentage of defective pixels from manufacture, and are graded and priced accordingly. Normally they are mapped out in the factory, but somehow this particular sensor appears to throw them up at an early later stage. Normally \"new\". dead or hot pixels show up after years of use. I'm sure that was a surprise for Leica as well. Let's hope that they get their remapping firmware out soon. There are 100% perfect sensors on the market for scientific use, but providing those would drive up the price of the camera by magnitudes. for the record, I never noticed dead pixela in normal pictures; only when start taking shots with caps on and pixel peeping. (..and I was being sarcastic btw)", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/9/?tab=comments#comment-4165382", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "8 hours ago, jaapv said: i wouldn't call it a defective sensor - all commercial grade sensors have a certain percentage of defective pixels from manufacture, and are graded and priced accordingly. normally they are -----> mapped !!!  out in the factory, but somehow this particular sensor appears to throw them up at an early later stage. normally \"new\". dead or hot pixels show up after years of use. i'm sure that was a surprise for leica as well. let's hope that they get their remapping firmware out soon. there are 100% perfect sensors on the market for scientific use, but providing those would drive up the price of the camera by magnitudes. for the record, i never noticed dead pixela in normal pictures; only when start taking shots with caps on and pixel peeping. (..and i was being sarcastic btw)", "sortedWord": "None", "identifyer": 7461, "year": "2021"}, {"Unnamed: 0": 444633, "autor": "Guest", "date": 1619567760000, "content": "4 minutes ago, SrMi said: Thank you for the pointer. I installed it. It fixed the hot/dead pixels issue at higher ISO :). Excellent! Good news. They have also added a manual pixel mapping. Good addition. Unfortunately, the Zoom/Lock button still has a very limited list of options to assign. Would be great to map this button to any function you want.", "link": "https://www.l-camera-forum.com/topic/318748-firmware-q2-monochrom/?tab=comments#comment-4189872", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "4 minutes ago, srmi said: thank you for the pointer. i installed it. it fixed the hot/dead pixels issue at higher iso :). excellent! good news. they have also added a manual pixel mapping. good addition. unfortunately, the zoom/lock button still has a very limited list of options to assign. would be great to -----> map !!!  this button to any function you want.", "sortedWord": "None", "identifyer": 8033, "year": "2021"}, {"Unnamed: 0": 444634, "autor": "SrMi", "date": 1619568360000, "content": "8 minutes ago, Faravahar said: Excellent! Good news. They have also added a manual pixel mapping. Good addition. Unfortunately, the Zoom/Lock button still has a very limited list of options to assign. Would be great to map this button to any function you want. I did run pixel mapping manually. Too bad there is still no standard BBF (as done in Q).", "link": "https://www.l-camera-forum.com/topic/318748-firmware-q2-monochrom/?tab=comments#comment-4189874", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "8 minutes ago, faravahar said: excellent! good news. they have also added a manual pixel mapping. good addition. unfortunately, the zoom/lock button still has a very limited list of options to assign. would be great to -----> map !!!  this button to any function you want. i did run pixel mapping manually. too bad there is still no standard bbf (as done in q).", "sortedWord": "None", "identifyer": 8034, "year": "2021"}], "name": "mapL-Forum2021"}