{"interestingcomments": [{"Unnamed: 0": 205929, "autor": "fotografr", "date": 1595715360000, "content": "1 minute ago, Tailwagger said: That's exactly what I said. It was returned to the water a few moments later, so its available if you'd like to try your hand. 😉 Please post a map with the exact spot marked and the type of lure used. 😉", "link": "https://www.l-camera-forum.com/topic/314837-m-10-r-image-thread/?tab=comments#comment-4015589", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "1 minute ago, tailwagger said: that's exactly what i said. it was returned to the water a few moments later, so its available if you'd like to try your hand. 😉 please post a -----> map !!!  with the exact spot marked and the type of lure used. 😉", "sortedWord": "None", "identifyer": 99416, "year": "2020"}, {"Unnamed: 0": 205930, "autor": "Tailwagger", "date": 1595716860000, "content": "18 minutes ago, fotografr said: Please post a map with the exact spot marked and the type of lure used. 😉 Here you go... but as for the lure I'm afraid you are on your own, though I will say the fish had its eye on my Summilux. 😀 --img-- ", "link": "https://www.l-camera-forum.com/topic/314837-m-10-r-image-thread/?tab=comments#comment-4015597", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "18 minutes ago, fotografr said: please post a -----> map !!!  with the exact spot marked and the type of lure used. 😉 here you go... but as for the lure i'm afraid you are on your own, though i will say the fish had its eye on my summilux. 😀 --img-- ", "sortedWord": "None", "identifyer": 99417, "year": "2020"}, {"Unnamed: 0": 205932, "autor": "scott kirkpatrick", "date": 1595773620000, "content": "I asked Google Maps just where you found that nice fish, and I am impressed by your roaming efforts. Even though I have gotten up to Pepperell for the sky-diving, I would never have gone down that particular byway.", "link": "https://www.l-camera-forum.com/topic/314837-m-10-r-image-thread/?tab=comments#comment-4015978", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "i asked -----> google !!!  -----> maps !!!  just where you found that nice fish, and i am impressed by your roaming efforts. even though i have gotten up to pepperell for the sky-diving, i would never have gone down that particular byway.", "sortedWord": "None", "identifyer": 99419, "year": "2020"}, {"Unnamed: 0": 205933, "autor": "fotografr", "date": 1595774820000, "content": "20 minutes ago, scott kirkpatrick said: I asked Google Maps just where you found that nice fish, and I am impressed by your roaming efforts. Even though I have gotten up to Pepperell for the sky-diving, I would never have gone down that particular byway. Next time you jump, pack your rod.", "link": "https://www.l-camera-forum.com/topic/314837-m-10-r-image-thread/?tab=comments#comment-4016002", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "20 minutes ago, scott kirkpatrick said: i asked -----> google !!!  -----> maps !!!  just where you found that nice fish, and i am impressed by your roaming efforts. even though i have gotten up to pepperell for the sky-diving, i would never have gone down that particular byway. next time you jump, pack your rod.", "sortedWord": "None", "identifyer": 99420, "year": "2020"}, {"Unnamed: 0": 343176, "autor": "Erato", "date": 1597414740000, "content": "Draft version -- mind map, FYR. --img-- ", "link": "https://www.l-camera-forum.com/topic/312268-m10-p-or-m10r/?tab=comments#comment-4026968", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "draft version -- mind -----> map !!! , fyr. --img-- ", "sortedWord": "None", "identifyer": 4254, "year": "2020"}, {"Unnamed: 0": 355352, "autor": "adan", "date": 1598805780000, "content": "To avoid a lot of repitition, this thread covers the subject of hot or dead pixels to the nth degree: Key point is that silicon is silicon, and at the level of quantum physics, new pixel defects will be created throughout the working life of a sensor simply by existing in a universe filled with cosmic radiation (or heat/infrared - I've had an M9 acquire a new stuck pixel just by leaving it in a hot car at 45°C for an hour). The M(240) manual, along with every other Leica digital manual, specifically warns that a certain number of defective pixels (out of 18 million or 24 million) are normal, even brand-new from the factory. There is no \"expensive Leica silicon\" nor \"cheap Nikon silicon\" as far as the raw material is concerned. It is all 99.9999999% pure when the chip fabrication begins. BTW - if you see 10 such pixels, that is a failure rate of 0.0000004166667% (10/24000000). Another key point is that unless one has used a statistically-significant sample of Leicas, Canons, and Nikons (at least 1000 Leicas, and 10000 Canons or Nikons), saying one has \"never seen\" stuck pixels on a Canon or Nikon is not serious evidence. I've had seven digital Ms, M8 through M10. One acquired a couple of stuck pixels, two showed evidence of mapped-out stuck pixels, four never showed anything. But even seven cameras do not make a statistically-significant sample - it was pure chance that I happened to get those particular seven cameras out of the tens of thousands made. The good news is that one no longer has to physically send in a digital Leica to have hot/stuck pixels mapped out. Simply email Leica service with a complete .DNG file showing the bad pixels, and Leica can email you back a new personalized copy of the current firmware, with an updated \"bad pixel map\" - the camera will then ignore the data from each hot (or dead) pixel and fill it in by interpolation from the next-door pixels.", "link": "https://www.l-camera-forum.com/topic/312804-mp240-white-pixels-hot-pixels/?tab=comments#comment-4036391", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "to avoid a lot of repitition, this thread covers the subject of hot or dead pixels to the nth degree: key point is that silicon is silicon, and at the level of quantum physics, new pixel defects will be created throughout the working life of a sensor simply by existing in a universe filled with cosmic radiation (or heat/infrared - i've had an m9 acquire a new stuck pixel just by leaving it in a hot car at 45°c for an hour). the m(240) manual, along with every other leica digital manual, specifically warns that a certain number of defective pixels (out of 18 million or 24 million) are normal, even brand-new from the factory. there is no \"expensive leica silicon\" nor \"cheap nikon silicon\" as far as the raw material is concerned. it is all 99.9999999% pure when the chip fabrication begins. btw - if you see 10 such pixels, that is a failure rate of 0.0000004166667% (10/24000000). another key point is that unless one has used a statistically-significant sample of leicas, canons, and nikons (at least 1000 leicas, and 10000 canons or nikons), saying one has \"never seen\" stuck pixels on a canon or nikon is not serious evidence. i've had seven digital ms, m8 through m10. one acquired a couple of stuck pixels, two showed evidence of -----> mapped !!! -out stuck pixels, four never showed anything. but even seven cameras do not make a statistically-significant sample - it was pure chance that i happened to get those particular seven cameras out of the tens of thousands made. the good news is that one no longer has to physically send in a digital leica to have hot/stuck pixels mapped out. simply email leica service with a complete .dng file showing the bad pixels, and leica can email you back a new personalized copy of the current firmware, with an updated \"bad pixel map\" - the camera will then ignore the data from each hot (or dead) pixel and fill it in by interpolation from the next-door pixels.", "sortedWord": "None", "identifyer": 16516, "year": "2020"}, {"Unnamed: 0": 355353, "autor": "jev_dk", "date": 1598807460000, "content": "@adan thanks for this summary (I did my research prior to posting though) This topic is not about dead og stuck pixels as they do not appear in the same place. It’s meerly about the JPG processing combined with some pixels behaving differently than they should (?) Only from M10 remote pixel mapping can be done so my MP needs another trip to Wetzlar but as pixels seem to be random in their behaviour I can’t see how they can be mapped out I suspect this is more to do with ISO combined with certain lighting and I am still asking for other M owners that have experienced this.", "link": "https://www.l-camera-forum.com/topic/312804-mp240-white-pixels-hot-pixels/?tab=comments#comment-4036403", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "@adan thanks for this summary (i did my research prior to posting though) this topic is not about dead og stuck pixels as they do not appear in the same place. it’s meerly about the jpg processing combined with some pixels behaving differently than they should (?) only from m10 remote pixel mapping can be done so my mp needs another trip to wetzlar but as pixels seem to be random in their behaviour i can’t see how they can be -----> mapped !!!  out i suspect this is more to do with iso combined with certain lighting and i am still asking for other m owners that have experienced this.", "sortedWord": "None", "identifyer": 16517, "year": "2020"}, {"Unnamed: 0": 355666, "autor": "jowatt", "date": 1594577280000, "content": " Hello, I bought a used M240 and when looking through the test shots I noticed a white pixel appearing in the same place in every image. I then took a complete black picture (ISO 200) and then found 6 of such 1x1 pixels spread all over the sensor. 2 of these are grey. Now my question is if this is a common thing with this camera or not? Is it something most people just don't notice? The seller didn't mention them but I also didn't think of asking because I never noticed anything like that on any other camera before. Is it true that Leica can map these out? If so how much will that cost approximately? Do faults like these exist in the sensor from the start, do they happen with age or are they an indicator of certain misuse? I know I can easily edit them out in Capture One but I feel sad since I paid a price expecting the camera to be pristine technically. I didn't plan on selling it anytime soon but I wonder if this will make the resell value drop by a lot. Edited July 12, 2020 by jowatt", "link": "https://www.l-camera-forum.com/topic/311282-how-common-are-white-pixels-in-the-sensor/?tab=comments#comment-4007845", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " hello, i bought a used m240 and when looking through the test shots i noticed a white pixel appearing in the same place in every image. i then took a complete black picture (iso 200) and then found 6 of such 1x1 pixels spread all over the sensor. 2 of these are grey. now my question is if this is a common thing with this camera or not? is it something most people just don't notice? the seller didn't mention them but i also didn't think of asking because i never noticed anything like that on any other camera before. is it true that leica can -----> map !!!  these out? if so how much will that cost approximately? do faults like these exist in the sensor from the start, do they happen with age or are they an indicator of certain misuse? i know i can easily edit them out in capture one but i feel sad since i paid a price expecting the camera to be pristine technically. i didn't plan on selling it anytime soon but i wonder if this will make the resell value drop by a lot. edited july 12, 2020 by jowatt", "sortedWord": "None", "identifyer": 16831, "year": "2020"}, {"Unnamed: 0": 355667, "autor": "jaapv", "date": 1594577760000, "content": "Hot pixels are not normal, as the sensor is mapped at production, but may appear over time. The sensor can be mapped out by Leica, but only if the number of mapped pixels stays within the tolerance span. Otherwise you are looking at an (expensive) sensor replacement. Personally I would return the camera.", "link": "https://www.l-camera-forum.com/topic/311282-how-common-are-white-pixels-in-the-sensor/?tab=comments#comment-4007851", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "hot pixels are not normal, as the sensor is -----> mapped !!!  at production, but may appear over time. the sensor can be mapped out by leica, but only if the number of mapped pixels stays within the tolerance span. otherwise you are looking at an (expensive) sensor replacement. personally i would return the camera.", "sortedWord": "None", "identifyer": 16832, "year": "2020"}, {"Unnamed: 0": 355668, "autor": "jowatt", "date": 1594579680000, "content": "vor 26 Minuten schrieb jaapv: Hot pixels are not normal, as the sensor is mapped at production, but may appear over time. The sensor can be mapped out by Leica, but only if the number of mapped pixels stays within the tolerance span. Otherwise you are looking at an (expensive) sensor replacement. Personally I would return the camera. Over how long and how many do usually appear? After all the M240 is quite old now. Is the tolerance span something Leica can determine from the test image or do I need to send in the camera? I sadly don't think I am able to return it since I bought it from a private seller.", "link": "https://www.l-camera-forum.com/topic/311282-how-common-are-white-pixels-in-the-sensor/?tab=comments#comment-4007860", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "vor 26 minuten schrieb jaapv: hot pixels are not normal, as the sensor is -----> mapped !!!  at production, but may appear over time. the sensor can be mapped out by leica, but only if the number of mapped pixels stays within the tolerance span. otherwise you are looking at an (expensive) sensor replacement. personally i would return the camera. over how long and how many do usually appear? after all the m240 is quite old now. is the tolerance span something leica can determine from the test image or do i need to send in the camera? i sadly don't think i am able to return it since i bought it from a private seller.", "sortedWord": "None", "identifyer": 16833, "year": "2020"}, {"Unnamed: 0": 355673, "autor": "Adam Bonn", "date": 1595101440000, "content": "Coincidentally I noticed a couple of stuck pixels on my 240. I went through some photos to see if they’d always been there, and long story short, there’s been some pixels that have stuck and unstuck over the months I've had the camera. From what I understand adobe maps them out upon import (and stuck pixels I can find in C1 aren’t there in the same image in LR) but in C1 you’ll need the single pixel sider on the noise reduction tool. A value of 1 usually does the job", "link": "https://www.l-camera-forum.com/topic/311282-how-common-are-white-pixels-in-the-sensor/?tab=comments#comment-4011341", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "coincidentally i noticed a couple of stuck pixels on my 240. i went through some photos to see if they’d always been there, and long story short, there’s been some pixels that have stuck and unstuck over the months i've had the camera. from what i understand adobe -----> maps !!!  them out upon import (and stuck pixels i can find in c1 aren’t there in the same image in lr) but in c1 you’ll need the single pixel sider on the noise reduction tool. a value of 1 usually does the job", "sortedWord": "None", "identifyer": 16838, "year": "2020"}, {"Unnamed: 0": 355678, "autor": "jaapv", "date": 1595496780000, "content": "It may well be crazy - that is the Internet for you. Hot/stuck pixels are something that can/will happen and has no relation to a sensor dying and certainly nothing at all with corrosion, as corrosion is not a sensor defect. The f stop is irrelevant as well. Just send the DNG to Leica for evaluation, they can tell you exactly what to do. Asking on a forum will not lead to any meaningful conclusion. Normally Leica will map them out, should the number exceed the tolerance, they will replace the sensor.", "link": "https://www.l-camera-forum.com/topic/311282-how-common-are-white-pixels-in-the-sensor/?tab=comments#comment-4013965", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "it may well be crazy - that is the internet for you. hot/stuck pixels are something that can/will happen and has no relation to a sensor dying and certainly nothing at all with corrosion, as corrosion is not a sensor defect. the f stop is irrelevant as well. just send the dng to leica for evaluation, they can tell you exactly what to do. asking on a forum will not lead to any meaningful conclusion. normally leica will -----> map !!!  them out, should the number exceed the tolerance, they will replace the sensor.", "sortedWord": "None", "identifyer": 16843, "year": "2020"}, {"Unnamed: 0": 355681, "autor": "Adam Bonn", "date": 1595528160000, "content": "I noticed a stuck pixel on my 240 So I had a look for more and found 2 I swapped to c1 from lr recently and it turns out that Adobe maps then out automatically In c1 try a value of 1 to 5 on the single pixel slider in the noise reduction tool I decided to check all my photos since I got the camera secondhand as I wondered if they had always been there No I also found a stuck pixel that has since unstuck So maybe yours will go away Did leica advise to send the camera in? Don't try the freezer thing... If you do take the sensor out of the camera first!", "link": "https://www.l-camera-forum.com/topic/311282-how-common-are-white-pixels-in-the-sensor/?tab=comments#comment-4014288", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "i noticed a stuck pixel on my 240 so i had a look for more and found 2 i swapped to c1 from lr recently and it turns out that adobe -----> maps !!!  then out automatically in c1 try a value of 1 to 5 on the single pixel slider in the noise reduction tool i decided to check all my photos since i got the camera secondhand as i wondered if they had always been there no i also found a stuck pixel that has since unstuck so maybe yours will go away did leica advise to send the camera in? don't try the freezer thing... if you do take the sensor out of the camera first!", "sortedWord": "None", "identifyer": 16846, "year": "2020"}, {"Unnamed: 0": 363616, "autor": "jonnyboy", "date": 1605886740000, "content": "Oh yes I've experienced that late recocking too! I had news from Wetzlar today and they found out that the board of the camera needed replacement. Wow. This is the problem it had since they re-mapped the sensor: https://drive.google.com/file/d/1Sa0xNFv-7CgOrAznCE_aTERT_YtWo5Vc/view?usp=sharing Luckly, they acknowledged that's something that happened after the remapping and therefore is free of charge.", "link": "https://www.l-camera-forum.com/topic/313395-m9-monochrom-vertical-line-at-high-iso/page/2/?tab=comments#comment-4083934", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "oh yes i've experienced that late recocking too! i had news from wetzlar today and they found out that the board of the camera needed replacement. wow. this is the problem it had since they re------> mapped !!!  the sensor: https://drive.google.com/file/d/1sa0xnfv-7cgoraznce_atert_ytwo5vc/view?usp=sharing luckly, they acknowledged that's something that happened after the remapping and therefore is free of charge.", "sortedWord": "None", "identifyer": 24869, "year": "2020"}, {"Unnamed: 0": 363617, "autor": "BrianS", "date": 1605890700000, "content": "1 hour ago, jonnyboy said: Oh yes I've experienced that late recocking too! I had news from Wetzlar today and they found out that the board of the camera needed replacement. Wow. This is the problem it had since they re-mapped the sensor: https://drive.google.com/file/d/1Sa0xNFv-7CgOrAznCE_aTERT_YtWo5Vc/view?usp=sharing Luckly, they acknowledged that's something that happened after the remapping and therefore is free of charge. That is an expensive board that they are replacing free of charge- which in my mind, taking responsibility for a possible mistake made during the repair and fixing it free of charge to the customer. I hope this is the end of the problems. The original M Monochrom is the last of a breed.", "link": "https://www.l-camera-forum.com/topic/313395-m9-monochrom-vertical-line-at-high-iso/page/2/?tab=comments#comment-4083994", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "1 hour ago, jonnyboy said: oh yes i've experienced that late recocking too! i had news from wetzlar today and they found out that the board of the camera needed replacement. wow. this is the problem it had since they re------> mapped !!!  the sensor: https://drive.google.com/file/d/1sa0xnfv-7cgoraznce_atert_ytwo5vc/view?usp=sharing luckly, they acknowledged that's something that happened after the remapping and therefore is free of charge. that is an expensive board that they are replacing free of charge- which in my mind, taking responsibility for a possible mistake made during the repair and fixing it free of charge to the customer. i hope this is the end of the problems. the original m monochrom is the last of a breed.", "sortedWord": "None", "identifyer": 24870, "year": "2020"}, {"Unnamed: 0": 363993, "autor": "BrianS", "date": 1600723920000, "content": "I bought my M Monochrom in Dec 2012, the M9 in May 2011. There has been a lot of discussion of CCD vs CMOS. I've stated in the past that more image processing goes into a CMOS image before it is written as a DNG (raw) image, the CCD DNG file has very little processing applied. With the M Monochrom- the sensor is the most uniform sensor of any that I've used. A few months ago I found a website that posted \"sensor heat maps\", measures of sensor uniformity. After several years, I can verify that comment based on numbers: https://www.photonstophotos.net/Charts/Sensor_Heatmaps.htm#mode=23,camera=Leica%20M10-R,suffix=14 This table is from the above website, the last two columns are dark signal non-uniformity (DSNU) and Photo Response Non Uniformity (PRNU) is - like Fixed Pattern Noise (FPN) - a way of expressing errors in the output from sensors. The lower the value, the better the raw image. Note that the M Monochrom has the lowest numbers in the table.. To save you from having to search the table for Leica, I did a screen shot. And in case the website disappears. So- apologies for the geekiness of my excitement. BUT- the first 10 images out of my camera, I knew this was true. 8 years later, someone put numbers on it. --img--  Edited September 21, 2020 by BrianS", "link": "https://www.l-camera-forum.com/topic/313364-leica-monochrom-ccd-who%E2%80%99s-selling-why/page/3/?tab=comments#comment-4050077", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "i bought my m monochrom in dec 2012, the m9 in may 2011. there has been a lot of discussion of ccd vs cmos. i've stated in the past that more image processing goes into a cmos image before it is written as a dng (raw) image, the ccd dng file has very little processing applied. with the m monochrom- the sensor is the most uniform sensor of any that i've used. a few months ago i found a website that posted \"sensor heat -----> maps !!! \", measures of sensor uniformity. after several years, i can verify that comment based on numbers: https://www.photonstophotos.net/charts/sensor_heatmaps.htm#mode=23,camera=leica%20m10-r,suffix=14 this table is from the above website, the last two columns are dark signal non-uniformity (dsnu) and photo response non uniformity (prnu) is - like fixed pattern noise (fpn) - a way of expressing errors in the output from sensors. the lower the value, the better the raw image. note that the m monochrom has the lowest numbers in the table.. to save you from having to search the table for leica, i did a screen shot. and in case the website disappears. so- apologies for the geekiness of my excitement. but- the first 10 images out of my camera, i knew this was true. 8 years later, someone put numbers on it. --img--  edited september 21, 2020 by brians", "sortedWord": "None", "identifyer": 25248, "year": "2020"}, {"Unnamed: 0": 364743, "autor": "Robert Blanko", "date": 1592890140000, "content": "Playing with the tonality curve (I hope this is the correct terminology in Adobe Lightroom) may help, as already noted in the thread. As a matter of things, this is by the way almost always required in practice, as it is not possible to 1:1 display a digital photo having a dynamic range of about 13-14 or with the m10 Mono of even about 15 f-stops on any available display media which at best may have about 10 f-stops of dynamic range (cf. for instance here for ballpark numbers, if you scroll down, see the table: https://en.wikipedia.org/wiki/Dynamic_range ). Instead of simply clipping dark or bright parts of the photo, it might be advisable to non-linearly scale the dynamic range of your camera to map to the insofar reduced dynamic range of the display medium. The M10 mono increases said challenge by let‘s say 1 f-stop as compared to what we were used to before.", "link": "https://www.l-camera-forum.com/topic/310780-m10-monochrom-almost-too-much-dr/?tab=comments#comment-3997753", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "playing with the tonality curve (i hope this is the correct terminology in adobe lightroom) may help, as already noted in the thread. as a matter of things, this is by the way almost always required in practice, as it is not possible to 1:1 display a digital photo having a dynamic range of about 13-14 or with the m10 mono of even about 15 f-stops on any available display media which at best may have about 10 f-stops of dynamic range (cf. for instance here for ballpark numbers, if you scroll down, see the table: https://en.wikipedia.org/wiki/dynamic_range ). instead of simply clipping dark or bright parts of the photo, it might be advisable to non-linearly scale the dynamic range of your camera to -----> map !!!  to the insofar reduced dynamic range of the display medium. the m10 mono increases said challenge by let‘s say 1 f-stop as compared to what we were used to before.", "sortedWord": "None", "identifyer": 26003, "year": "2020"}, {"Unnamed: 0": 365293, "autor": "adan", "date": 1584042900000, "content": "Ummm - he did say M9M (as in Monochrom) and posted in the Monochrom forum. As to the line - lines are generally the result of one stuck or hot pixel (if light) or dead pixel (if dark) that contaminate a row or column of pixels on readout. Leica can map away (program the camera to ignore) such pixels. I believe you can even send them an original .DNG file showing the line, and they can email you a personal firmware fix to remove the line - you could check on that. The Instagram problem just looks like a scrambled or corrupted .jpg file. This can happen any time a picture is copied from one place to another, although it's not common. Delete it from Instagram and try reposting it. Edited March 12, 2020 by adan", "link": "https://www.l-camera-forum.com/topic/307371-visual-problem-on-m9m-on-high-iso/?tab=comments#comment-3930112", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "ummm - he did say m9m (as in monochrom) and posted in the monochrom forum. as to the line - lines are generally the result of one stuck or hot pixel (if light) or dead pixel (if dark) that contaminate a row or column of pixels on readout. leica can -----> map !!!  away (program the camera to ignore) such pixels. i believe you can even send them an original .dng file showing the line, and they can email you a personal firmware fix to remove the line - you could check on that. the instagram problem just looks like a scrambled or corrupted .jpg file. this can happen any time a picture is copied from one place to another, although it's not common. delete it from instagram and try reposting it. edited march 12, 2020 by adan", "sortedWord": "None", "identifyer": 26554, "year": "2020"}, {"Unnamed: 0": 365297, "autor": "Anakronox", "date": 1585381380000, "content": " On 3/12/2020 at 10:55 PM, adan said: Leica can map away (program the camera to ignore) such pixels. I believe you can even send them an original .DNG file showing the line, and they can email you a personal firmware fix to remove the line - you could check on that.. I spent almost a week in February with Leica tech support working in my M9M with 2 rows of dead pixels. After sending them multiple DNGs, they finally claimed that they can only offer the sensor remapping service for M10 series cameras. So as a result I returned the M9M.", "link": "https://www.l-camera-forum.com/topic/307371-visual-problem-on-m9m-on-high-iso/?tab=comments#comment-3940987", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " on 3/12/2020 at 10:55 pm, adan said: leica can -----> map !!!  away (program the camera to ignore) such pixels. i believe you can even send them an original .dng file showing the line, and they can email you a personal firmware fix to remove the line - you could check on that.. i spent almost a week in february with leica tech support working in my m9m with 2 rows of dead pixels. after sending them multiple dngs, they finally claimed that they can only offer the sensor remapping service for m10 series cameras. so as a result i returned the m9m.", "sortedWord": "None", "identifyer": 26558, "year": "2020"}, {"Unnamed: 0": 366219, "autor": "Stevejack", "date": 1581405660000, "content": "I enjoyed playing with this file a lot, there's a hell of a lot of range in these files. I keep reading posts where people are worrying that the files are flat and can't be pushed far in post.. not sure why that impression came about. I overcooked this edit with a few gradient maps and some luminance masking but I'm definitely happy with how malleable the files are. --img-- ", "link": "https://www.l-camera-forum.com/topic/305695-lets-have-a-look-at-some-dng-files-from-the-m10m/page/5/?tab=comments#comment-3910672", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "i enjoyed playing with this file a lot, there's a hell of a lot of range in these files. i keep reading posts where people are worrying that the files are flat and can't be pushed far in post.. not sure why that impression came about. i overcooked this edit with a few gradient -----> maps !!!  and some luminance masking but i'm definitely happy with how malleable the files are. --img-- ", "sortedWord": "None", "identifyer": 27484, "year": "2020"}, {"Unnamed: 0": 370924, "autor": "EdricBF", "date": 1602102120000, "content": "Thank you for the response. Well, if the processor is not able to scrub that pixel for JPEGs, I guess asking Leica if they have come up with a \"map out\" firmware remedy is in order. Thank you. Edited October 7, 2020 by EdricBF", "link": "https://www.l-camera-forum.com/topic/314019-why-hot-pixel-just-in-jpeg/?tab=comments#comment-4059033", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "thank you for the response. well, if the processor is not able to scrub that pixel for jpegs, i guess asking leica if they have come up with a \"-----> map !!!  out\" firmware remedy is in order. thank you. edited october 7, 2020 by edricbf", "sortedWord": "None", "identifyer": 32224, "year": "2020"}, {"Unnamed: 0": 370925, "autor": "Marac", "date": 1602165660000, "content": "The dead pixel is obviously 'dead' so it remains actively dead. Lightroom and other RAW software will detect and auto map the file so you don't really see it. Jap has explained already about the camera processing power. In camera remapping is a different ball game, don't give up hope just yet, they may very well surprise you although, and don't quote me on this, I believe that IF they do develop a remapper of sorts, it will be similar to updating firmware, in that, you will download the file from Leica and execute it the same way you would update firmware, this of cause would solve the .JPG issue you are having too.. Well, that's just my personal take on it. Maybe someone with great knowledge could develop it themselves, can't be THAT hard, can it?", "link": "https://www.l-camera-forum.com/topic/314019-why-hot-pixel-just-in-jpeg/?tab=comments#comment-4059417", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "the dead pixel is obviously 'dead' so it remains actively dead. lightroom and other raw software will detect and auto -----> map !!!  the file so you don't really see it. jap has explained already about the camera processing power. in camera remapping is a different ball game, don't give up hope just yet, they may very well surprise you although, and don't quote me on this, i believe that if they do develop a remapper of sorts, it will be similar to updating firmware, in that, you will download the file from leica and execute it the same way you would update firmware, this of cause would solve the .jpg issue you are having too.. well, that's just my personal take on it. maybe someone with great knowledge could develop it themselves, can't be that hard, can it?", "sortedWord": "None", "identifyer": 32225, "year": "2020"}, {"Unnamed: 0": 370927, "autor": "TomB_tx", "date": 1602185460000, "content": "I had a hot red pixel on my M9 original sensor, and also noticed it was mapped out by Lightroom when using DNG. I found the M9 in-camera jpg images were not nearly as good as the output from Lightroom - even with default settings (I don't like post-processing), so I didn't bother getting the camera corrected. Once I found a trace of sensor corrosion I had the sensor replaced (sensor and circuit board) near the end of Leica's free service, and of course that eliminated the hot pixel issue. I find the m10 in-camera jpg files better than the M9, so I use them more often.", "link": "https://www.l-camera-forum.com/topic/314019-why-hot-pixel-just-in-jpeg/?tab=comments#comment-4059606", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "i had a hot red pixel on my m9 original sensor, and also noticed it was -----> mapped !!!  out by lightroom when using dng. i found the m9 in-camera jpg images were not nearly as good as the output from lightroom - even with default settings (i don't like post-processing), so i didn't bother getting the camera corrected. once i found a trace of sensor corrosion i had the sensor replaced (sensor and circuit board) near the end of leica's free service, and of course that eliminated the hot pixel issue. i find the m10 in-camera jpg files better than the m9, so i use them more often.", "sortedWord": "None", "identifyer": 32227, "year": "2020"}, {"Unnamed: 0": 394528, "autor": "adan", "date": 1600103580000, "content": " 12 minutes ago, colint544 said: Bit niche, I know, but does anyone know why the film advance lever on the M6 is skinnier than the fat one on the original M4? That change occured with the revival of the M4 as the M4-2 - on which the M4-P and M6 were then based. Leitz Canada probably just figured the original was \"overengineered\" for the actual stresses involved, and likely saved a few ¢¢ per camera using a bit less metal. But I wouldn't argue with the \"comfort\" theory..... As to the price of an M6 in the mid-1980s: - In 1986 the price of the M4-P without meter was US $898 and the M6 was US $1695 (NB: some US mail-order stores told people to \"Call\" for the M6 price - which means it was likely available for less, but they could not print anything less than the MAP of $1695, or face Leica's wrath). https://leicarumors.com/2011/04/10/leica-prices-from-25-years-ago.aspx/ - In 2001 or so, a brand-new plain-vanilla M6 was US $1995 (plus tax), occasionally discounted 10% to $1795 at \"Leica Day\" store events. Those numbers were burned into my brain as I considered buying one back then. In any event, a revived M6 (if real) is unlikely to be that cheap now. As a special edition, it will be at least as expensive as a new MP, if not more. The costs won't be significantly less. Now, if it comes with a \"special-edition\" Leitz/Leica 35mm Summicron v.4, that would be interesting....", "link": "https://www.l-camera-forum.com/topic/313311-rumour-about-a-new-m6-1984-from-leica/page/2/?tab=comments#comment-4045845", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " 12 minutes ago, colint544 said: bit niche, i know, but does anyone know why the film advance lever on the m6 is skinnier than the fat one on the original m4? that change occured with the revival of the m4 as the m4-2 - on which the m4-p and m6 were then based. leitz canada probably just figured the original was \"overengineered\" for the actual stresses involved, and likely saved a few ¢¢ per camera using a bit less metal. but i wouldn't argue with the \"comfort\" theory..... as to the price of an m6 in the mid-1980s: - in 1986 the price of the m4-p without meter was us $898 and the m6 was us $1695 (nb: some us mail-order stores told people to \"call\" for the m6 price - which means it was likely available for less, but they could not print anything less than the -----> map !!!  of $1695, or face leica's wrath). https://leicarumors.com/2011/04/10/leica-prices-from-25-years-ago.aspx/ - in 2001 or so, a brand-new plain-vanilla m6 was us $1995 (plus tax), occasionally discounted 10% to $1795 at \"leica day\" store events. those numbers were burned into my brain as i considered buying one back then. in any event, a revived m6 (if real) is unlikely to be that cheap now. as a special edition, it will be at least as expensive as a new mp, if not more. the costs won't be significantly less. now, if it comes with a \"special-edition\" leitz/leica 35mm summicron v.4, that would be interesting....", "sortedWord": "None", "identifyer": 6995, "year": "2020"}, {"Unnamed: 0": 394529, "autor": "logan2z", "date": 1600110300000, "content": "1 hour ago, adan said: That change occured with the revival of the M4 as the M4-2 - on which the M4-P and M6 were then based. Leitz Canada probably just figured the original was \"overengineered\" for the actual stresses involved, and likely saved a few ¢¢ per camera using a bit less metal. But I wouldn't argue with the \"comfort\" theory..... As to the price of an M6 in the mid-1980s: - In 1986 the price of the M4-P without meter was US $898 and the M6 was US $1695 (NB: some US mail-order stores told people to \"Call\" for the M6 price - which means it was likely available for less, but they could not print anything less than the MAP of $1695, or face Leica's wrath). https://leicarumors.com/2011/04/10/leica-prices-from-25-years-ago.aspx/ - In 2001 or so, a brand-new plain-vanilla M6 was US $1995 (plus tax), occasionally discounted 10% to $1795 at \"Leica Day\" store events. Those numbers were burned into my brain as I considered buying one back then. In any event, a revived M6 (if real) is unlikely to be that cheap now. As a special edition, it will be at least as expensive as a new MP, if not more. The costs won't be significantly less. Now, if it comes with a \"special-edition\" Leitz/Leica 35mm Summicron v.4, that would be interesting.... I'm still not sure what a 'new' M6 would really mean. I have to assume it would have the MP finder/framelines, MP meter, etc. So it would be an MP with the M6-style rewind knob and 'M6' label on the front? Not sure I really get the point, but I'm not a collector so it may be lost on me.", "link": "https://www.l-camera-forum.com/topic/313311-rumour-about-a-new-m6-1984-from-leica/page/2/?tab=comments#comment-4045917", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "1 hour ago, adan said: that change occured with the revival of the m4 as the m4-2 - on which the m4-p and m6 were then based. leitz canada probably just figured the original was \"overengineered\" for the actual stresses involved, and likely saved a few ¢¢ per camera using a bit less metal. but i wouldn't argue with the \"comfort\" theory..... as to the price of an m6 in the mid-1980s: - in 1986 the price of the m4-p without meter was us $898 and the m6 was us $1695 (nb: some us mail-order stores told people to \"call\" for the m6 price - which means it was likely available for less, but they could not print anything less than the -----> map !!!  of $1695, or face leica's wrath). https://leicarumors.com/2011/04/10/leica-prices-from-25-years-ago.aspx/ - in 2001 or so, a brand-new plain-vanilla m6 was us $1995 (plus tax), occasionally discounted 10% to $1795 at \"leica day\" store events. those numbers were burned into my brain as i considered buying one back then. in any event, a revived m6 (if real) is unlikely to be that cheap now. as a special edition, it will be at least as expensive as a new mp, if not more. the costs won't be significantly less. now, if it comes with a \"special-edition\" leitz/leica 35mm summicron v.4, that would be interesting.... i'm still not sure what a 'new' m6 would really mean. i have to assume it would have the mp finder/framelines, mp meter, etc. so it would be an mp with the m6-style rewind knob and 'm6' label on the front? not sure i really get the point, but i'm not a collector so it may be lost on me.", "sortedWord": "None", "identifyer": 6996, "year": "2020"}, {"Unnamed: 0": 394544, "autor": "derleicaman", "date": 1602269040000, "content": "On 9/14/2020 at 12:13 PM, adan said: That change occured with the revival of the M4 as the M4-2 - on which the M4-P and M6 were then based. Leitz Canada probably just figured the original was \"overengineered\" for the actual stresses involved, and likely saved a few ¢¢ per camera using a bit less metal. But I wouldn't argue with the \"comfort\" theory..... As to the price of an M6 in the mid-1980s: - In 1986 the price of the M4-P without meter was US $898 and the M6 was US $1695 (NB: some US mail-order stores told people to \"Call\" for the M6 price - which means it was likely available for less, but they could not print anything less than the MAP of $1695, or face Leica's wrath). https://leicarumors.com/2011/04/10/leica-prices-from-25-years-ago.aspx/ - In 2001 or so, a brand-new plain-vanilla M6 was US $1995 (plus tax), occasionally discounted 10% to $1795 at \"Leica Day\" store events. Those numbers were burned into my brain as I considered buying one back then. In any event, a revived M6 (if real) is unlikely to be that cheap now. As a special edition, it will be at least as expensive as a new MP, if not more. The costs won't be significantly less. Now, if it comes with a \"special-edition\" Leitz/Leica 35mm Summicron v.4, that would be interesting.... I was at Photokina for the intro of the M6 in 1984. I was a Leica dealer then, and I got one of the first demo cameras after I returned home to the States. I used that camera for almost 20 years and I still have it. Stefan Daniel confirmed that my camera was one of the Photokina demo cameras. I used another M6 and later my M6TTL professionally for years and they never missed a beat. I sold the M6 for $ 1,200 every day of the week in 1984-85. MAP (Minimum Advertised Price) was the lowest you could advertise a Leica item, but you were free to sell at whatever price you wanted to. The idea was to sell the M6 for a similar price to an M4-P with Leicameter MR-4 combination. However, the circuit board in the M6 was its Achilles heal. The originals were done by an Italian firm, Olivetti I think, and they were not very robust. The new MP is a vastly improved camera in every way, including the circuit board. You can easily put and M6 style advance lever on any previous M camera. I had one on my M2 for years, very easy to do. I agree with the rewind knob being a PITA. The M4 and later rewind crank was much better when you were shooting a lot. I used the Leica Motor M doing jobs and it worked out fairly well. I also used the Leicavit MP and Tom A's Rapidwinder. Little things like this made a big difference when you were shooting a job, and 36 exposures went by quick and you always ran out of film at the worst moment. I always used 2-3 M cameras on a job. I looked like Jim Marshall! It would be very easy to put the rewind crank on an MP instead of the knob for Leica.", "link": "https://www.l-camera-forum.com/topic/313311-rumour-about-a-new-m6-1984-from-leica/page/2/?tab=comments#comment-4060158", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "on 9/14/2020 at 12:13 pm, adan said: that change occured with the revival of the m4 as the m4-2 - on which the m4-p and m6 were then based. leitz canada probably just figured the original was \"overengineered\" for the actual stresses involved, and likely saved a few ¢¢ per camera using a bit less metal. but i wouldn't argue with the \"comfort\" theory..... as to the price of an m6 in the mid-1980s: - in 1986 the price of the m4-p without meter was us $898 and the m6 was us $1695 (nb: some us mail-order stores told people to \"call\" for the m6 price - which means it was likely available for less, but they could not print anything less than the -----> map !!!  of $1695, or face leica's wrath). https://leicarumors.com/2011/04/10/leica-prices-from-25-years-ago.aspx/ - in 2001 or so, a brand-new plain-vanilla m6 was us $1995 (plus tax), occasionally discounted 10% to $1795 at \"leica day\" store events. those numbers were burned into my brain as i considered buying one back then. in any event, a revived m6 (if real) is unlikely to be that cheap now. as a special edition, it will be at least as expensive as a new mp, if not more. the costs won't be significantly less. now, if it comes with a \"special-edition\" leitz/leica 35mm summicron v.4, that would be interesting.... i was at photokina for the intro of the m6 in 1984. i was a leica dealer then, and i got one of the first demo cameras after i returned home to the states. i used that camera for almost 20 years and i still have it. stefan daniel confirmed that my camera was one of the photokina demo cameras. i used another m6 and later my m6ttl professionally for years and they never missed a beat. i sold the m6 for $ 1,200 every day of the week in 1984-85. map (minimum advertised price) was the lowest you could advertise a leica item, but you were free to sell at whatever price you wanted to. the idea was to sell the m6 for a similar price to an m4-p with leicameter mr-4 combination. however, the circuit board in the m6 was its achilles heal. the originals were done by an italian firm, olivetti i think, and they were not very robust. the new mp is a vastly improved camera in every way, including the circuit board. you can easily put and m6 style advance lever on any previous m camera. i had one on my m2 for years, very easy to do. i agree with the rewind knob being a pita. the m4 and later rewind crank was much better when you were shooting a lot. i used the leica motor m doing jobs and it worked out fairly well. i also used the leicavit mp and tom a's rapidwinder. little things like this made a big difference when you were shooting a job, and 36 exposures went by quick and you always ran out of film at the worst moment. i always used 2-3 m cameras on a job. i looked like jim marshall! it would be very easy to put the rewind crank on an mp instead of the knob for leica.", "sortedWord": "None", "identifyer": 7011, "year": "2020"}, {"Unnamed: 0": 404092, "autor": "kinch123", "date": 1577961420000, "content": "4 hours ago, ktmrider2 said: How far is Chan's store from Hong Kong International? Are the demonstrations making street travel difficult? I am presently in the Philippines and thought I might skip over to Hong Kong in mid February. Thanks Champagne Court is at 40 Carnarvon Road, Tsimshatsui (TST). Easy to find in Google Maps. Not very far from TST MTR Exit B2. I wouldn't bother with trying to navigate there in a taxi, I'd use train and feet. Impossible to say anything about street demonstrations on any given date in the future. I was in Champagne Court afternoon of December 24 and life was proceeding as usual. By the same evening, there were some fun and games pitting the Good Burghers of Hong Kong against Asia's No-longer Quite Finest happening all around TST and places further North in Kowloon. However there was nothing very unexpected about this: everybody knew roughly what was going to happen and approximately where and when. As with so many things, Timing is Everything. As a general rule, Monday-Saturday daytime trading hours are OK.", "link": "https://www.l-camera-forum.com/topic/304858-buying-leica-in-hong-kong/?tab=comments#comment-3883523", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "4 hours ago, ktmrider2 said: how far is chan's store from hong kong international? are the demonstrations making street travel difficult? i am presently in the philippines and thought i might skip over to hong kong in mid february. thanks champagne court is at 40 carnarvon road, tsimshatsui (tst). easy to find in -----> google !!!  -----> maps !!! . not very far from tst mtr exit b2. i wouldn't bother with trying to navigate there in a taxi, i'd use train and feet. impossible to say anything about street demonstrations on any given date in the future. i was in champagne court afternoon of december 24 and life was proceeding as usual. by the same evening, there were some fun and games pitting the good burghers of hong kong against asia's no-longer quite finest happening all around tst and places further north in kowloon. however there was nothing very unexpected about this: everybody knew roughly what was going to happen and approximately where and when. as with so many things, timing is everything. as a general rule, monday-saturday daytime trading hours are ok.", "sortedWord": "None", "identifyer": 16852, "year": "2020"}, {"Unnamed: 0": 416651, "autor": "scott kirkpatrick", "date": 1596567720000, "content": "I have messed around with the BTLE/GPS combination on my Sl2. I think it is a great idea, makes connection much simpler (but no faster), but one side or another of the BTLE connection keeps going to sleep and never waking.and I can't tell where and when Fotos is getting its LOC information from my phone or iPad., because it is almost random. Accuracies are off by 100 m, while the phone is accurate to 10 m or better on Google or Apple maps at the same time. Panasonic does this much better. Leica is clearly not putting the first team on this challenge.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/2/?tab=comments#comment-4021478", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "i have messed around with the btle/gps combination on my sl2. i think it is a great idea, makes connection much simpler (but no faster), but one side or another of the btle connection keeps going to sleep and never waking.and i can't tell where and when fotos is getting its loc information from my phone or ipad., because it is almost random. accuracies are off by 100 m, while the phone is accurate to 10 m or better on google or apple -----> maps !!!  at the same time. panasonic does this much better. leica is clearly not putting the first team on this challenge.", "sortedWord": "None", "identifyer": 29652, "year": "2020"}, {"Unnamed: 0": 419495, "autor": "scott kirkpatrick", "date": 1589741520000, "content": "On 5/17/2020 at 9:31 PM, msh58 said: Is this correct? At least for me Lightroom and Mac Preview shows the Leica SL GPS locations at accuracy of 0.01 arc seconds, which is 1/360000 of a degree and corresponds to about 0.3 m on the equator. This, of course, does not directly tell anything about the accuracy of the GPS of the camera. I've tried two things so far. I looked at the test of the EXIF gps information in the DNG files and it seems to be degrees, minutes, according to the \"info\" page in Capture One, which reports the accuracy of the minutes to four decimal places. Fotos displays the locations in terms of degrees with a precision of one ten-thousandth of a degree. Adobe's DNG-Validate program reports out the locations in degrees, minutes and seconds, showing the last number to an accuracy of 0.01. I first thought those were minutes of arc. That's not very good. Phones can do better,. Then I went for a short walk and plotted several pictures on Google maps. The first few positions were awful. The last one was pretty good. I'll do that some more. I did the same experiment with an S1R a few months back, and it did much better as I recall. But, hey, you are right and I read them wrong. Here are some GPS data from an SL2 DNG file: (as extracted by Adobe dng_validate) GPSVersionID: 2.3.0.0 GPSLatitudeRef: \"N\" GPSLatitude: 31.0000 46.0000 20.4700 GPSLongitudeRef: \"E\" GPSLongitude: 35.0000 12.0000 4.9000 So I'll agree with your potential accuracy of 0.3 m if the signal is that accurate. Maybe it takes some time being active to get that kind of precision. I know surveyors' GPSes average over minutes to get better than a cm precision (which we don't need). A curious thing. Fotos prints out the location to 0.0001 degree, which is cruder. And it still seems to jump about. Maybe part of the problem is getting your phone or iPad to do its thing right. Edited May 19, 2020 by scott kirkpatrick cover up a dumb mistake...", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/?tab=comments#comment-3975352", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "on 5/17/2020 at 9:31 pm, msh58 said: is this correct? at least for me lightroom and mac preview shows the leica sl gps locations at accuracy of 0.01 arc seconds, which is 1/360000 of a degree and corresponds to about 0.3 m on the equator. this, of course, does not directly tell anything about the accuracy of the gps of the camera. i've tried two things so far. i looked at the test of the exif gps information in the dng files and it seems to be degrees, minutes, according to the \"info\" page in capture one, which reports the accuracy of the minutes to four decimal places. fotos displays the locations in terms of degrees with a precision of one ten-thousandth of a degree. adobe's dng-validate program reports out the locations in degrees, minutes and seconds, showing the last number to an accuracy of 0.01. i first thought those were minutes of arc. that's not very good. phones can do better,. then i went for a short walk and plotted several pictures on -----> google !!!  -----> maps !!! . the first few positions were awful. the last one was pretty good. i'll do that some more. i did the same experiment with an s1r a few months back, and it did much better as i recall. but, hey, you are right and i read them wrong. here are some gps data from an sl2 dng file: (as extracted by adobe dng_validate) gpsversionid: 2.3.0.0 gpslatituderef: \"n\" gpslatitude: 31.0000 46.0000 20.4700 gpslongituderef: \"e\" gpslongitude: 35.0000 12.0000 4.9000 so i'll agree with your potential accuracy of 0.3 m if the signal is that accurate. maybe it takes some time being active to get that kind of precision. i know surveyors' gpses average over minutes to get better than a cm precision (which we don't need). a curious thing. fotos prints out the location to 0.0001 degree, which is cruder. and it still seems to jump about. maybe part of the problem is getting your phone or ipad to do its thing right. edited may 19, 2020 by scott kirkpatrick cover up a dumb mistake...", "sortedWord": "None", "identifyer": 32507, "year": "2020"}, {"Unnamed: 0": 419496, "autor": "msh58", "date": 1589744040000, "content": "vor 28 Minuten schrieb scott kirkpatrick: I've tried two things so far. I looked at the test of the EXIF gps information in the DNG files and it seems to be degrees, minutes and the accuracy of the minutes is two decimal digits. That's not very good. Phones can do better, so I'd like leica to use more of the accuracy available. Then I went for a short walk and plotted several pictures on Google maps. The first few positions were awful. The last one was pretty good. I'll do that some more. I did the same experiment with an S1R a few months back, and it did much better as I recall. But, hey, you are right and I read them wrong. Here are some GPS data from an SL2 DNG file: GPSVersionID: 2.3.0.0 GPSLatitudeRef: \"N\" GPSLatitude: 31.0000 46.0000 20.4700 GPSLongitudeRef: \"E\" GPSLongitude: 35.0000 12.0000 4.9000 So I'll agree with your potential accuracy of 0.3 m if the signal is that accurate. Maybe it takes some time being active to get that kind of precision. I know surveyors' GPSes average over minutes to get better than a cm precision (which we don't need). A curious thing. Fotos prints out the location to 0.0001 degree, which is cruder. And it still seems to jump about. Maybe part of the problem is getting your phone or iPad to do its thing right. I did a quick retrospective study of the locations stored in the DNG files by comparing the result to the associated photograph. The pictures were taken in both city and rural areas here in Massachusetts and in Finland. It seems that depending of the situation the SL GPS accuracy is anywhere between 1 to 10 m. The accuracy of S Typ 006 seemed to be similar. I then went on to browse some photos taken with an iPhone 6s. There was no apparent improvement in accuracy. Based on these limited data it still maintain my position that inclusion of a built-in GPS in the SL2 would have been a sound idea. Perhaps the software contraption could have been offered as an option.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/?tab=comments#comment-3975377", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "vor 28 minuten schrieb scott kirkpatrick: i've tried two things so far. i looked at the test of the exif gps information in the dng files and it seems to be degrees, minutes and the accuracy of the minutes is two decimal digits. that's not very good. phones can do better, so i'd like leica to use more of the accuracy available. then i went for a short walk and plotted several pictures on -----> google !!!  -----> maps !!! . the first few positions were awful. the last one was pretty good. i'll do that some more. i did the same experiment with an s1r a few months back, and it did much better as i recall. but, hey, you are right and i read them wrong. here are some gps data from an sl2 dng file: gpsversionid: 2.3.0.0 gpslatituderef: \"n\" gpslatitude: 31.0000 46.0000 20.4700 gpslongituderef: \"e\" gpslongitude: 35.0000 12.0000 4.9000 so i'll agree with your potential accuracy of 0.3 m if the signal is that accurate. maybe it takes some time being active to get that kind of precision. i know surveyors' gpses average over minutes to get better than a cm precision (which we don't need). a curious thing. fotos prints out the location to 0.0001 degree, which is cruder. and it still seems to jump about. maybe part of the problem is getting your phone or ipad to do its thing right. i did a quick retrospective study of the locations stored in the dng files by comparing the result to the associated photograph. the pictures were taken in both city and rural areas here in massachusetts and in finland. it seems that depending of the situation the sl gps accuracy is anywhere between 1 to 10 m. the accuracy of s typ 006 seemed to be similar. i then went on to browse some photos taken with an iphone 6s. there was no apparent improvement in accuracy. based on these limited data it still maintain my position that inclusion of a built-in gps in the sl2 would have been a sound idea. perhaps the software contraption could have been offered as an option.", "sortedWord": "None", "identifyer": 32508, "year": "2020"}, {"Unnamed: 0": 419796, "autor": "dritz", "date": 1586982600000, "content": "On 5/12/2018 at 12:58 AM, HeinzX said: I use a Cognisys system for focus stacking and the Helicon software afterwards. All these things were bought for a Canon camera together with Canon Macro lenses. And the workflow was very comfortable with all these things together. In case of need I can use all of them with my SL - the macro lenses are adapted with a novoflex adapter. But unfortunately there is one restriction. In contrary to Canon, Nikon and other systems there exists no cable for automatic releasing the shutter for the SL. Cognisys has told me, that because of technical reasons they are not able to deliver one. Therefore I have to release the shutter for each step - which ist possible - for every camera - including the Ms - but less comfortable. P.S. It is a shame, that Leica has no own native Macro lens for the SL - not even in the road map - at least according to my knowledge. Buy a 120-APO-S and adapter. Then you can get all those lovely S lenses cheap since you have the adapter. It's a great setup. I also use the 100 APO-R in a pinch, such as needing to use the APO Elpro for 1:1 reproduction. Dean", "link": "https://www.l-camera-forum.com/topic/284299-focus-stacking/?tab=comments#comment-3954533", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "on 5/12/2018 at 12:58 am, heinzx said: i use a cognisys system for focus stacking and the helicon software afterwards. all these things were bought for a canon camera together with canon macro lenses. and the workflow was very comfortable with all these things together. in case of need i can use all of them with my sl - the macro lenses are adapted with a novoflex adapter. but unfortunately there is one restriction. in contrary to canon, nikon and other systems there exists no cable for automatic releasing the shutter for the sl. cognisys has told me, that because of technical reasons they are not able to deliver one. therefore i have to release the shutter for each step - which ist possible - for every camera - including the ms - but less comfortable. p.s. it is a shame, that leica has no own native macro lens for the sl - not even in the road -----> map !!!  - at least according to my knowledge. buy a 120-apo-s and adapter. then you can get all those lovely s lenses cheap since you have the adapter. it's a great setup. i also use the 100 apo-r in a pinch, such as needing to use the apo elpro for 1:1 reproduction. dean", "sortedWord": "None", "identifyer": 32809, "year": "2020"}, {"Unnamed: 0": 431692, "autor": "dadu007", "date": 1598453520000, "content": "Just to follow up: The GPS4Camera (not GPS4Cam) is a bust for me...while the programmer is a nice guy, I think the app is more of a hobby venture for him and it's not quite ready for primetime. I have two workable and acceptable solutions now: I found HoudahGeo (Mac only, https://www.houdah.com/houdahGeo/), which is only 43 USD (39 Euro). I like it! It supports RAW files. 🙂 Basically I can use my Cyclemeter phone app (https://abvio.com/cyclemeter/) to track my route when walking/riding/hiking, and then export a .gpx file from that and import it into HoudahGeo. HoudahGeo then easily pushes the appropriate coordinates to each photo, based on matching the timestamps in the .gpx file and exif info in the .dng files. I tested this with great results before purchasing HoudaGeo. It's best to try to match the camera's time as closely as possible with the time on your cell phone. My photo database, IMatch (https://www.photools.com/), can also import the above .gpx export and geocode my photos using that within its Map Panel. However, I prefer to geocode my photos BEFORE adding them to my IMatch database only because it's bit tedious to undo bad info in IMatch. So I'll use HoudahGeo. So I will geocode photos from my Leica CL on my MacAir, then move them to my Windows PC where IMatch (a Windows-only application) resides. Edited August 26, 2020 by dadu007", "link": "https://www.l-camera-forum.com/topic/312548-gps/?tab=comments#comment-4033700", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "just to follow up: the gps4camera (not gps4cam) is a bust for me...while the programmer is a nice guy, i think the app is more of a hobby venture for him and it's not quite ready for primetime. i have two workable and acceptable solutions now: i found houdahgeo (mac only, https://www.houdah.com/houdahgeo/), which is only 43 usd (39 euro). i like it! it supports raw files. 🙂 basically i can use my cyclemeter phone app (https://abvio.com/cyclemeter/) to track my route when walking/riding/hiking, and then export a .gpx file from that and import it into houdahgeo. houdahgeo then easily pushes the appropriate coordinates to each photo, based on matching the timestamps in the .gpx file and exif info in the .dng files. i tested this with great results before purchasing houdageo. it's best to try to match the camera's time as closely as possible with the time on your cell phone. my photo database, imatch (https://www.photools.com/), can also import the above .gpx export and geocode my photos using that within its -----> map !!!  panel. however, i prefer to geocode my photos before adding them to my imatch database only because it's bit tedious to undo bad info in imatch. so i'll use houdahgeo. so i will geocode photos from my leica cl on my macair, then move them to my windows pc where imatch (a windows-only application) resides. edited august 26, 2020 by dadu007", "sortedWord": "None", "identifyer": 44853, "year": "2020"}, {"Unnamed: 0": 443906, "autor": "anuncastshadow", "date": 1608512400000, "content": "12 minutes ago, nwphil said: I would definitely contact Leica asap report what is happening and ask for their advice - might be a longtime till they release such firmware if indeed can be solved that way. Besides only Lica will know how to solve the issue and might require returning the camera to them directly; if your camera was bought at an authorized retailer, you should be fine under Leica warranty. I would be more inclined returning the camera to store as defective, and let them handle the issue - as long as their terms grat you full refund. They then would initiate a return to Leica , and you would be free to try yet a third time - but making sure it is a Leica store. If you can go to an authorized retailer/leica store explained what you have been experiencing and have the camera tested even before leaving the store, it might be of great help, if that is allowed by them - likely have to bring a laptop. Something to talk with your retailer and Leica - Leica above all should offer a better solution imo Thank you for your response. I do believe I have the option to return, but upon proof “the item is defective”. With further research, the shop from whom I purchased this unit appears not to be an authorized retailer (I am not certain), unlike the first shop. I have reached out to Leica with RAW images of the exposures made today with the lens cap attached (pure black) and am waiting to hear back. However, I am aware that my options moving forward may be limited based on the purchase information. The item was sealed, and sold through rangefinder.com.hk which I heard good things about, but I don’t think they are an authorized Leica dealer, in which case that responsibility lies on me. But I do feel like I should be able to return the item within the 14 day return period to them (not Leica) regardless. Anyway, I digress, but I appreciate your input and will see what happens moving forward. For reference, the camera has Firmware ver. 1.0 installed, and I could not find any updated version on Leica’s website. Will have to see if Leica can provide a custom firmware update to map the indicated areas. Additionally, I have been using the RAW and JPEGs with Lightroom and Photoshop 2021, on a 2020 16” MacBook Pro with Big Sur. Edited December 21, 2020 by anuncastshadow", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/?tab=comments#comment-4102823", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "12 minutes ago, nwphil said: i would definitely contact leica asap report what is happening and ask for their advice - might be a longtime till they release such firmware if indeed can be solved that way. besides only lica will know how to solve the issue and might require returning the camera to them directly; if your camera was bought at an authorized retailer, you should be fine under leica warranty. i would be more inclined returning the camera to store as defective, and let them handle the issue - as long as their terms grat you full refund. they then would initiate a return to leica , and you would be free to try yet a third time - but making sure it is a leica store. if you can go to an authorized retailer/leica store explained what you have been experiencing and have the camera tested even before leaving the store, it might be of great help, if that is allowed by them - likely have to bring a laptop. something to talk with your retailer and leica - leica above all should offer a better solution imo thank you for your response. i do believe i have the option to return, but upon proof “the item is defective”. with further research, the shop from whom i purchased this unit appears not to be an authorized retailer (i am not certain), unlike the first shop. i have reached out to leica with raw images of the exposures made today with the lens cap attached (pure black) and am waiting to hear back. however, i am aware that my options moving forward may be limited based on the purchase information. the item was sealed, and sold through rangefinder.com.hk which i heard good things about, but i don’t think they are an authorized leica dealer, in which case that responsibility lies on me. but i do feel like i should be able to return the item within the 14 day return period to them (not leica) regardless. anyway, i digress, but i appreciate your input and will see what happens moving forward. for reference, the camera has firmware ver. 1.0 installed, and i could not find any updated version on leica’s website. will have to see if leica can provide a custom firmware update to -----> map !!!  the indicated areas. additionally, i have been using the raw and jpegs with lightroom and photoshop 2021, on a 2020 16” macbook pro with big sur. edited december 21, 2020 by anuncastshadow", "sortedWord": "None", "identifyer": 7290, "year": "2020"}, {"Unnamed: 0": 443972, "autor": "nwphil", "date": 1609281120000, "content": "Leica will solve this issue - everything takes extra time these days. As it stands the Q2M should in theory map out some pixels after some use; otoh Leica might have miss mapping some pixels too, and the fix right now seems to have them inspect the camera, and use their special equipment & software to fix. Unfortunately it's not a built-in with camera software as with some M's. Contact Leica, explain the issue and request repair/inspection - they will stand by their product; it's an awesome 📷. I am not giving up or back😎", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/4/?tab=comments#comment-4108373", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "leica will solve this issue - everything takes extra time these days. as it stands the q2m should in theory -----> map !!!  out some pixels after some use; otoh leica might have miss mapping some pixels too, and the fix right now seems to have them inspect the camera, and use their special equipment & software to fix. unfortunately it's not a built-in with camera software as with some m's. contact leica, explain the issue and request repair/inspection - they will stand by their product; it's an awesome 📷. i am not giving up or back😎", "sortedWord": "None", "identifyer": 7357, "year": "2020"}], "name": "mapL-Forum2020"}