{"interestingcomments": [{"Unnamed: 0": 375659, "autor": "colonel", "date": 1436896200000, "content": " I've been holding off on sending my M-E into New Jersey for this very reason. For several months now as I have a couple bad columns that I can see when shooting in low light, higher ISO, and pushing the Shadows in LR. Don't think I have the corrosion issue but this is my only camera and don't want to be without it for 2 - 3 months. My wife suggested I buy a used one while mine is in the shop but then the prices I see are comparable to buying the upgrade if it were offered for mine it I were to send it in. This will be my second sensor replacement since buying the camera new 2.5 years ago. I'm sure my sensor issue is the amount of time I travel via my job as a pilot and getting to and from work on the airlines. (Note: page 163 of the Leica M-E manual has this to say: SENSOR Cosmic radiation (e.g. on flights) can cause pixel defects.) BTW, anyone shooting the M240 have this same statement in your manual? Sounds nothing like the sensor corrosion issue It sounds like a standard set of hot/stuck pixels which just have to be mapped out. Leica normally do this quite fast. Lines are typically caused by a single hot pixel on the M-E sensor. Unfortunately other cameras can do this in software but Leica's need software programming at HQ Rgds", "link": "https://www.l-camera-forum.com/topic/247062-ccd-sensor-new-leica-information-about-the-state-of-development/page/3/?tab=comments#comment-2854096", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": " i've been holding off on sending my m-e into new jersey for this very reason. for several months now as i have a couple bad columns that i can see when shooting in low light, higher iso, and pushing the shadows in lr. don't think i have the corrosion issue but this is my only camera and don't want to be without it for 2 - 3 months. my wife suggested i buy a used one while mine is in the shop but then the prices i see are comparable to buying the upgrade if it were offered for mine it i were to send it in. this will be my second sensor replacement since buying the camera new 2.5 years ago. i'm sure my sensor issue is the amount of time i travel via my job as a pilot and getting to and from work on the airlines. (note: page 163 of the leica m-e manual has this to say: sensor cosmic radiation (e.g. on flights) can cause pixel defects.) btw, anyone shooting the m240 have this same statement in your manual? sounds nothing like the sensor corrosion issue it sounds like a standard set of hot/stuck pixels which just have to be -----> mapped !!!  out. leica normally do this quite fast. lines are typically caused by a single hot pixel on the m-e sensor. unfortunately other cameras can do this in software but leica's need software programming at hq rgds", "sortedWord": "None", "identifyer": 36967, "year": "2015"}, {"Unnamed: 0": 375660, "autor": "Duane Pandorf", "date": 1436916600000, "content": "Sounds nothing like the sensor corrosion issue It sounds like a standard set of hot/stuck pixels which just have to be mapped out. Leica normally do this quite fast. Lines are typically caused by a single hot pixel on the M-E sensor. Unfortunately other cameras can do this in software but Leica's need software programming at HQ Rgds Last time I sent it in for the same problem they replaced the CCD and board its attached to. So I'm afraid it would be the 2-3 month wait. I still may look at a second body. One that I carry on trips and my current body once returned from Leica will stay at home.", "link": "https://www.l-camera-forum.com/topic/247062-ccd-sensor-new-leica-information-about-the-state-of-development/page/3/?tab=comments#comment-2854301", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "sounds nothing like the sensor corrosion issue it sounds like a standard set of hot/stuck pixels which just have to be -----> mapped !!!  out. leica normally do this quite fast. lines are typically caused by a single hot pixel on the m-e sensor. unfortunately other cameras can do this in software but leica's need software programming at hq rgds last time i sent it in for the same problem they replaced the ccd and board its attached to. so i'm afraid it would be the 2-3 month wait. i still may look at a second body. one that i carry on trips and my current body once returned from leica will stay at home.", "sortedWord": "None", "identifyer": 36968, "year": "2015"}, {"Unnamed: 0": 377991, "autor": "Kwesi", "date": 1422377640000, "content": "You are possibly correct. And I thank you for raising a reasonable point. But people need to remember that photography is mostly done at base ISO, even in the dark regions of Canada where I live. Let's hope that if Leica is able to find a suitable replacement glass sensor cover, the next ME Will have a CCD sensor housed in an M240 body with all the relevant electronics updated. Leica's response to the sensor glass issue shows that not only are they very fond of the M9 but they appreciate what the camera has done to put Leica back on the map.", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/2/?tab=comments#comment-2753936", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "you are possibly correct. and i thank you for raising a reasonable point. but people need to remember that photography is mostly done at base iso, even in the dark regions of canada where i live. let's hope that if leica is able to find a suitable replacement glass sensor cover, the next me will have a ccd sensor housed in an m240 body with all the relevant electronics updated. leica's response to the sensor glass issue shows that not only are they very fond of the m9 but they appreciate what the camera has done to put leica back on the -----> map !!! .", "sortedWord": "None", "identifyer": 39307, "year": "2015"}, {"Unnamed: 0": 377995, "autor": "mjh", "date": 1422400440000, "content": "Let's hope that if Leica is able to find a suitable replacement glass sensor cover, the next ME Will have a CCD sensor housed in an M240 body with all the relevant electronics updated. I would be very surprised if the next M-E wasn’t simply the M (Typ 240) with a few cosmetic changes, i.e. an M-E (Typ 240). Leica's response to the sensor glass issue shows that not only are they very fond of the M9 but they appreciate what the camera has done to put Leica back on the map. This isn‘t about fond remembrances really. It is about caring for your customers and their investment in the M system (and also about Leica caring for their reputation of course). Just because Leica doesn’t try to force their customers to upgrade to a newer model one should not assume they wouldn’t much prefer if their customers made the switch to CMOS anyway.", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/2/?tab=comments#comment-2754158", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "let's hope that if leica is able to find a suitable replacement glass sensor cover, the next me will have a ccd sensor housed in an m240 body with all the relevant electronics updated. i would be very surprised if the next m-e wasn’t simply the m (typ 240) with a few cosmetic changes, i.e. an m-e (typ 240). leica's response to the sensor glass issue shows that not only are they very fond of the m9 but they appreciate what the camera has done to put leica back on the -----> map !!! . this isn‘t about fond remembrances really. it is about caring for your customers and their investment in the m system (and also about leica caring for their reputation of course). just because leica doesn’t try to force their customers to upgrade to a newer model one should not assume they wouldn’t much prefer if their customers made the switch to cmos anyway.", "sortedWord": "None", "identifyer": 39311, "year": "2015"}, {"Unnamed: 0": 378256, "autor": "IWC Doppel", "date": 1424275200000, "content": "Hi there I absolutely see the difference with cameras with CCD based sensors and CMOS based sensors . . . In fact, I absolutely see the difference between ALL cameras. . . which lead me to ask myself wether it was the CCD/CMOS which caused the difference (or other factors). A little thought reminded me that the sensor itself is only registering the light differences . . . it's the Bayer filter and the Demosaicing which is affecting the colour. With respect to the M9/M240 differences, sadly, most people made up their minds in the very early days when there was a problem with the AWB - that was fixed ages ago. The differences however still survive. For instance, the M9 files have more 'zing' to them - but I don't think that's to do with the sensor technology, it's a function of the reduced dynamic range. . . . In fact I think that much of the perceived difference between CCD and CMOS is because CCD sensors usually have less dynamic range - but that's a bad thing, because you can always reduce the dynamic range . . . but you can't increase it! Like O1af I actually prefer the quality of the files from the M240, and I'm certain I can do more with them in PostProcessing (but that's just a matter of taste). What I'm also certain of is that this is not a function of CCD/CMOS technology, and were you successful in getting Leica to go back to CCD technology, you would lose much and gain very little - fortunately I'm sure there's no chance of it. All the best The dynamic range is I suspect not linear in respect of sensors or eyes. I spent years setting up projectors in home cinema, it's all about the 0-10 IRE coming out of black but not losing the base black or clipping. I suspect the look is less easily mapped to one metric called dynamic range. I also suspect some of the in chip processing has an impact on the look. I just see it like it or I don't. I then do try to understand the why, but won't change my judgement if I can't !", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/15/?tab=comments#comment-2766808", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "hi there i absolutely see the difference with cameras with ccd based sensors and cmos based sensors . . . in fact, i absolutely see the difference between all cameras. . . which lead me to ask myself wether it was the ccd/cmos which caused the difference (or other factors). a little thought reminded me that the sensor itself is only registering the light differences . . . it's the bayer filter and the demosaicing which is affecting the colour. with respect to the m9/m240 differences, sadly, most people made up their minds in the very early days when there was a problem with the awb - that was fixed ages ago. the differences however still survive. for instance, the m9 files have more 'zing' to them - but i don't think that's to do with the sensor technology, it's a function of the reduced dynamic range. . . . in fact i think that much of the perceived difference between ccd and cmos is because ccd sensors usually have less dynamic range - but that's a bad thing, because you can always reduce the dynamic range . . . but you can't increase it! like o1af i actually prefer the quality of the files from the m240, and i'm certain i can do more with them in postprocessing (but that's just a matter of taste). what i'm also certain of is that this is not a function of ccd/cmos technology, and were you successful in getting leica to go back to ccd technology, you would lose much and gain very little - fortunately i'm sure there's no chance of it. all the best the dynamic range is i suspect not linear in respect of sensors or eyes. i spent years setting up projectors in home cinema, it's all about the 0-10 ire coming out of black but not losing the base black or clipping. i suspect the look is less easily -----> mapped !!!  to one metric called dynamic range. i also suspect some of the in chip processing has an impact on the look. i just see it like it or i don't. i then do try to understand the why, but won't change my judgement if i can't !", "sortedWord": "None", "identifyer": 39572, "year": "2015"}, {"Unnamed: 0": 380234, "autor": "pklein", "date": 1428020640000, "content": "Here is some more fun with pushing M8 Raw files. Below is a link to two crops, both at 100% magnification, taken at the same f-stop (despite what the EXIF says). They were taken at night under artificial light. The scene looked a bit darker in real life than it does in the pictures. The crop on the left is ISO 160 pushed to 1250. The shadowed upper part of the face is \"dodged\" an additional 0.6-stop. Very nice. The crop on the right was accidentally underexposed 1-2/3 stops beyond that, so it's probably at about ISO 4000 equivalent. Again, the upper face is dodged an additional 0.5 stop. The color is a bit crunchy, but it would still be usable at reasonable print size. Ignore the vertical line, I believe it's caused by a hot pixel just above what's shown. I haven't yet messed with Arvid's feature to map that out. http://gallery.leica-users.org/d/407757-1/M8Raw1250vs2500.JPG And, if I convert the ISO 4000 equivalent to B&W, it would print as a nice, moderately grainy picture. Remember, this is at 100%. http://gallery.leica-users.org/d/407759-1/M8Raw2500bw.JPG Shot with an M8 and 35/1.2 Voigtlander Version I, Raw converter is Capture One 7.12. Screen-size images of the full pictures are here: <http://gallery.leica-users.org/d/407725-1/L1010071.jpg> <http://gallery.leica-users.org/d/407786-1/L1010074.jpg> <http://gallery.leica-users.org/d/407784-1/L1010074+_1_+.jpg> The uncompressed Raw files plus M8Raw2DNG software easily gives the M8 a full stop more usable high-ISO than the compressed DNGs. ISO 1250-equivalent is only a tiny bit worse than uncompressed 640, and 2500 (or slightly more) is not as bad as compressed 1250. Your mileage may vary, batteries not included, I am a data point of one, but I find this technique *very* useful. A big thank you to Arvid for the software, and to LensHacker for working with it and telling us about it. --Peter Edited April 3, 2015 by pklein", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/6/?tab=comments#comment-2791761", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "here is some more fun with pushing m8 raw files. below is a link to two crops, both at 100% magnification, taken at the same f-stop (despite what the exif says). they were taken at night under artificial light. the scene looked a bit darker in real life than it does in the pictures. the crop on the left is iso 160 pushed to 1250. the shadowed upper part of the face is \"dodged\" an additional 0.6-stop. very nice. the crop on the right was accidentally underexposed 1-2/3 stops beyond that, so it's probably at about iso 4000 equivalent. again, the upper face is dodged an additional 0.5 stop. the color is a bit crunchy, but it would still be usable at reasonable print size. ignore the vertical line, i believe it's caused by a hot pixel just above what's shown. i haven't yet messed with arvid's feature to -----> map !!!  that out. http://gallery.leica-users.org/d/407757-1/m8raw1250vs2500.jpg and, if i convert the iso 4000 equivalent to b&w, it would print as a nice, moderately grainy picture. remember, this is at 100%. http://gallery.leica-users.org/d/407759-1/m8raw2500bw.jpg shot with an m8 and 35/1.2 voigtlander version i, raw converter is capture one 7.12. screen-size images of the full pictures are here: <http://gallery.leica-users.org/d/407725-1/l1010071.jpg> <http://gallery.leica-users.org/d/407786-1/l1010074.jpg> <http://gallery.leica-users.org/d/407784-1/l1010074+_1_+.jpg> the uncompressed raw files plus m8raw2dng software easily gives the m8 a full stop more usable high-iso than the compressed dngs. iso 1250-equivalent is only a tiny bit worse than uncompressed 640, and 2500 (or slightly more) is not as bad as compressed 1250. your mileage may vary, batteries not included, i am a data point of one, but i find this technique *very* useful. a big thank you to arvid for the software, and to lenshacker for working with it and telling us about it. --peter edited april 3, 2015 by pklein", "sortedWord": "None", "identifyer": 41622, "year": "2015"}, {"Unnamed: 0": 380239, "autor": "pklein", "date": 1428635160000, "content": "Arvid: I ran another test for you, of the same scene, lens and lighing. This time I used DNG + JPG Fine, continuous mode, with everything else set the same as as with RAW + JPG Fine. The Buffer still filled up after 10 shots, but emptied in 1:06. A 38% improvement in overall speed. It's a multi-variable problem, because we're keeping the JPG processing, but the DNG is half the size of the RAW and more \"stepped\" in gradation rather than continuous, and the square root compression is being applied with DNG, but not with the RAWs. It is fun to play with this. Now I need to see if I can map out the hot pixels on my sensor, and if that will get rid of a vertical line that has appeared in some of my RAW-derived pictures. I never sent my M8 to Leica to have hot pixels mapped out, I just used Pixel Fixer. So now I need to get my hot pixel data into your INI file. I didn't have to worry about lines with Pixel Fixer. Once I mapped out the hot pixel, any line that descended from it disappeared. --Peter", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/6/?tab=comments#comment-2796191", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "arvid: i ran another test for you, of the same scene, lens and lighing. this time i used dng + jpg fine, continuous mode, with everything else set the same as as with raw + jpg fine. the buffer still filled up after 10 shots, but emptied in 1:06. a 38% improvement in overall speed. it's a multi-variable problem, because we're keeping the jpg processing, but the dng is half the size of the raw and more \"stepped\" in gradation rather than continuous, and the square root compression is being applied with dng, but not with the raws. it is fun to play with this. now i need to see if i can -----> map !!!  out the hot pixels on my sensor, and if that will get rid of a vertical line that has appeared in some of my raw-derived pictures. i never sent my m8 to leica to have hot pixels mapped out, i just used pixel fixer. so now i need to get my hot pixel data into your ini file. i didn't have to worry about lines with pixel fixer. once i mapped out the hot pixel, any line that descended from it disappeared. --peter", "sortedWord": "None", "identifyer": 41627, "year": "2015"}, {"Unnamed: 0": 383406, "autor": "pippy", "date": 1420642800000, "content": "...10 days ago I've decided to update the firmware to 2.024. The update was successful(now it shows firmware 2.024) and I am not completely sure that the problem comes from this, but now, when I try to make a picture, the red light starts blinking like it 'writes' to the sd card but nothing happens. Before updating the firmware myself I was aware that this had happened to some M8's and so I did an on-line search to see what the problem was. It seemed to affect some early M8's but yours is the first time I've read of it happening with an 8.2. The following text is a translation of the first item I read which mentioned the problem as posted in the German section of the forum on the 20th Dec last (apologies in advance to dg2mst - see post #5, above - for google's mashed translation of this, his earlier post!); \"After a successful update an image was recorded on a memory card no more. The settings were reset naturally. I tested it with multiple cards and DNG and JPEG. The maps were doing formatted in the camera and the PC, which made no difference. The red LED has just hingeblinkt permanently on. Interestingly, the camera view previously made pictures to another memory card and easily enlarge.\" Later on he states that returning to the previous firmware sorted out the problem in his case. If it were me I'd persevere in trying to get your camera to 'read' the older version. He, like you, experienced the problems with several different SD cards so the cards don't seem to be the issue. Have you contacted Leica about this? They might be able to sort out the problem over the phone? Just a thought. FWIW I uploaded the 2.024 version on my 8.2 without encountering the problems you and others have faced. The serial # of my body is 35564XX. Best of luck in getting it corrected. Could you keep us informed of developments, please? Philip. Edited January 7, 2015 by pippy", "link": "https://www.l-camera-forum.com/topic/239483-m82-firmware-2024-update-issue/?tab=comments#comment-2743204", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "...10 days ago i've decided to update the firmware to 2.024. the update was successful(now it shows firmware 2.024) and i am not completely sure that the problem comes from this, but now, when i try to make a picture, the red light starts blinking like it 'writes' to the sd card but nothing happens. before updating the firmware myself i was aware that this had happened to some m8's and so i did an on-line search to see what the problem was. it seemed to affect some early m8's but yours is the first time i've read of it happening with an 8.2. the following text is a translation of the first item i read which mentioned the problem as posted in the german section of the forum on the 20th dec last (apologies in advance to dg2mst - see post #5, above - for google's mashed translation of this, his earlier post!); \"after a successful update an image was recorded on a memory card no more. the settings were reset naturally. i tested it with multiple cards and dng and jpeg. the -----> maps !!!  were doing formatted in the camera and the pc, which made no difference. the red led has just hingeblinkt permanently on. interestingly, the camera view previously made pictures to another memory card and easily enlarge.\" later on he states that returning to the previous firmware sorted out the problem in his case. if it were me i'd persevere in trying to get your camera to 'read' the older version. he, like you, experienced the problems with several different sd cards so the cards don't seem to be the issue. have you contacted leica about this? they might be able to sort out the problem over the phone? just a thought. fwiw i uploaded the 2.024 version on my 8.2 without encountering the problems you and others have faced. the serial # of my body is 35564xx. best of luck in getting it corrected. could you keep us informed of developments, please? philip. edited january 7, 2015 by pippy", "sortedWord": "None", "identifyer": 44806, "year": "2015"}, {"Unnamed: 0": 385831, "autor": "Lenshacker", "date": 1429927620000, "content": "Leica should be able to map out the Bad Pixel and stop the line from happening. You can also use Arvid's M8RAW2DNG and map out the bad pixel. Also get the benefit of Uncompressed DNG, which is very much worth it. http://m8raw2dng.de/ You can also try this software, http://people.csail.mit.edu/ericchan/tmp/FixBadPixels.pdf Which puts the instructions in the DNG file to correct the bad lines. Edited April 25, 2015 by Lenshacker", "link": "https://www.l-camera-forum.com/topic/244196-m8-living-with-a-vertical-line-does-it-gets-worst/?tab=comments#comment-2804435", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "leica should be able to -----> map !!!  out the bad pixel and stop the line from happening. you can also use arvid's m8raw2dng and map out the bad pixel. also get the benefit of uncompressed dng, which is very much worth it. http://m8raw2dng.de/ you can also try this software, http://people.csail.mit.edu/ericchan/tmp/fixbadpixels.pdf which puts the instructions in the dng file to correct the bad lines. edited april 25, 2015 by lenshacker", "sortedWord": "None", "identifyer": 47236, "year": "2015"}, {"Unnamed: 0": 385846, "autor": "Lenshacker", "date": 1430434680000, "content": "That is frustrating! You might want to contact the person that wrote the software, probably would be interested to know about the problem. The M8 DNG files straight from the camera use a compression scheme with a \"look-up-table\" to get the values restored. I'll bet the software cannot figure it out. Very frustrating! It would be best to have Leica map the bad pixel out, too bad the \"quick fix\" isn't quick and does not fix!", "link": "https://www.l-camera-forum.com/topic/244196-m8-living-with-a-vertical-line-does-it-gets-worst/?tab=comments#comment-2807671", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "that is frustrating! you might want to contact the person that wrote the software, probably would be interested to know about the problem. the m8 dng files straight from the camera use a compression scheme with a \"look-up-table\" to get the values restored. i'll bet the software cannot figure it out. very frustrating! it would be best to have leica -----> map !!!  the bad pixel out, too bad the \"quick fix\" isn't quick and does not fix!", "sortedWord": "None", "identifyer": 47251, "year": "2015"}, {"Unnamed: 0": 385851, "autor": "jaapv", "date": 1430525760000, "content": "Yes, but you do not know how many dead pixels were originally mapped out. Sending it to Wetzlar is not a bad idea.", "link": "https://www.l-camera-forum.com/topic/244196-m8-living-with-a-vertical-line-does-it-gets-worst/page/2/?tab=comments#comment-2808473", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "yes, but you do not know how many dead pixels were originally -----> mapped !!!  out. sending it to wetzlar is not a bad idea.", "sortedWord": "None", "identifyer": 47256, "year": "2015"}, {"Unnamed: 0": 385852, "autor": "lm_user", "date": 1438084620000, "content": "Can the sensor be re-mapped in camera? Or does a sensor re-map require pulling the sensor and replacing the leatherette. My sensor re-map from Leica NJ came with new leatherette.", "link": "https://www.l-camera-forum.com/topic/244196-m8-living-with-a-vertical-line-does-it-gets-worst/page/2/?tab=comments#comment-2861914", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "can the sensor be re------> mapped !!!  in camera? or does a sensor re-map require pulling the sensor and replacing the leatherette. my sensor re-map from leica nj came with new leatherette.", "sortedWord": "None", "identifyer": 47257, "year": "2015"}, {"Unnamed: 0": 385853, "autor": "watteau", "date": 1442300580000, "content": "Hi all and hi from a new member on the forum. My M8 has some 15k actuations, had no problems apart from three lines and some four-five stuck pixels. Not very complex to map outon software, but wanted to get a nice professional RF adjustment unlike mine, and a bit of checkup. Sent my M8 18 Aug for repair to Leica Germany. Package was sent by DHL on 18th, accepted according to DHL on 21st, got e-mail confirmation of arrival on 27th, received estimate on 4th Sept. Estimate was: Necessary labour costs: 2.3 HRS * 149.00 EUR = 347.62 EUR repair: pixel/line fault on image adjust sensor adjust range finder adjust range finder clean range finder adjustment of all parts cleaning and end control Total necessary labours: Net value: 347.62 +VAT.: 66.05 = 413.67 EUR So this is the price now for line mapping + complete adjustments. A bit steep, but we will see. Delays are a bit long-ish though. Paid same day, on 11th Sept status changed to \"In repair\", and now, almost month later, I still have no camera and have to use my CL instead.", "link": "https://www.l-camera-forum.com/topic/244196-m8-living-with-a-vertical-line-does-it-gets-worst/page/2/?tab=comments#comment-2888240", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "hi all and hi from a new member on the forum. my m8 has some 15k actuations, had no problems apart from three lines and some four-five stuck pixels. not very complex to -----> map !!!  outon software, but wanted to get a nice professional rf adjustment unlike mine, and a bit of checkup. sent my m8 18 aug for repair to leica germany. package was sent by dhl on 18th, accepted according to dhl on 21st, got e-mail confirmation of arrival on 27th, received estimate on 4th sept. estimate was: necessary labour costs: 2.3 hrs * 149.00 eur = 347.62 eur repair: pixel/line fault on image adjust sensor adjust range finder adjust range finder clean range finder adjustment of all parts cleaning and end control total necessary labours: net value: 347.62 +vat.: 66.05 = 413.67 eur so this is the price now for line mapping + complete adjustments. a bit steep, but we will see. delays are a bit long-ish though. paid same day, on 11th sept status changed to \"in repair\", and now, almost month later, i still have no camera and have to use my cl instead.", "sortedWord": "None", "identifyer": 47258, "year": "2015"}, {"Unnamed: 0": 385973, "autor": "Maarten", "date": 1446045540000, "content": "I had a few dead pixels that were re-mapped for free when the camera was send in to have other work performed (silent shutter upgrade).", "link": "https://www.l-camera-forum.com/topic/251692-how-many-have-you-dealt-with-a-red-linedead-pixel-issue/?tab=comments#comment-2915622", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "i had a few dead pixels that were re------> mapped !!!  for free when the camera was send in to have other work performed (silent shutter upgrade).", "sortedWord": "None", "identifyer": 47379, "year": "2015"}], "name": "mapL-Forum2015"}