{"interestingcomments": [{"Unnamed: 0": 342375, "autor": "wlaidlaw", "date": 1487145060000, "content": "GPS that works in all countries, like the T/TL ......and that you don't have to bolt a humgeous handle on the bottom to get. The SL GPS is a whole lot better than the M240's and gets a fix fairly quickly. The M240 can take over 5 minutes to get a lock and then in cities with any obscuration of the skyline, loses that lock almost immediately. In fact my wife's old V-Lux 20 has better GPS than the M240. For both my last two long trips, I used the SL and when cataloguing the images, it was so easy in Capture One, where the information tab for each image has a hot link to Google Maps from the latitude and longitude EXIF, to find exactly where some of the 1000+ images I took on each trip was. I did a short trip to Berlin before Xmas using the M240. I have GPS data on less than 25% of the images. Wilson", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/9/?tab=comments#comment-3213352", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "gps that works in all countries, like the t/tl ......and that you don't have to bolt a humgeous handle on the bottom to get. the sl gps is a whole lot better than the m240's and gets a fix fairly quickly. the m240 can take over 5 minutes to get a lock and then in cities with any obscuration of the skyline, loses that lock almost immediately. in fact my wife's old v-lux 20 has better gps than the m240. for both my last two long trips, i used the sl and when cataloguing the images, it was so easy in capture one, where the information tab for each image has a hot link to -----> google !!!  -----> maps !!!  from the latitude and longitude exif, to find exactly where some of the 1000+ images i took on each trip was. i did a short trip to berlin before xmas using the m240. i have gps data on less than 25% of the images. wilson", "sortedWord": "None", "identifyer": 3446, "year": "2017"}, {"Unnamed: 0": 342376, "autor": "Soden", "date": 1487147400000, "content": "......and that you don't have to bolt a humgeous handle on the bottom to get. The SL GPS is a whole lot better than the M240's and gets a fix fairly quickly. The M240 can take over 5 minutes to get a lock and then in cities with any obscuration of the skyline, loses that lock almost immediately. In fact my wife's old V-Lux 20 has better GPS than the M240. For both my last two long trips, I used the SL and when cataloguing the images, it was so easy in Capture One, where the information tab for each image has a hot link to Google Maps from the latitude and longitude EXIF, to find exactly where some of the 1000+ images I took on each trip was. I did a short trip to Berlin before Xmas using the M240. I have GPS data on less than 25% of the images. Wilson Well, if you want to bring the M240 into it. I live in China. But I spent the summer in America and the M240 never figured it out. Two months I spent in California, Michigan or Texas and I have zero pictures with GPS. Always the camera would say GPS is disabled for legal reasons. What legal reasons? GPS is common in China, even foreign products, like the Leica T/TL. Customs and immigration does not distinguish between the T/TL and the M.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/9/?tab=comments#comment-3213384", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "......and that you don't have to bolt a humgeous handle on the bottom to get. the sl gps is a whole lot better than the m240's and gets a fix fairly quickly. the m240 can take over 5 minutes to get a lock and then in cities with any obscuration of the skyline, loses that lock almost immediately. in fact my wife's old v-lux 20 has better gps than the m240. for both my last two long trips, i used the sl and when cataloguing the images, it was so easy in capture one, where the information tab for each image has a hot link to -----> google !!!  -----> maps !!!  from the latitude and longitude exif, to find exactly where some of the 1000+ images i took on each trip was. i did a short trip to berlin before xmas using the m240. i have gps data on less than 25% of the images. wilson well, if you want to bring the m240 into it. i live in china. but i spent the summer in america and the m240 never figured it out. two months i spent in california, michigan or texas and i have zero pictures with gps. always the camera would say gps is disabled for legal reasons. what legal reasons? gps is common in china, even foreign products, like the leica t/tl. customs and immigration does not distinguish between the t/tl and the m.", "sortedWord": "None", "identifyer": 3447, "year": "2017"}, {"Unnamed: 0": 346710, "autor": "jaapv", "date": 1501845780000, "content": " That is correct. It is the accepted way of fixing pixel defects. It is called sensor remapping. All sensors are mapped from new, sometimes they need to be remapped. There is a maximum number of pixels that may be remapped, depending on the quality target that the manufacturer has set, depending on the level the camera is on. Above that number the sensor must be changed. In fact, Leica has a rather low tolerance, resulting in a proportionally high number of sensors swapped out under guaranty. If the camera makers were to use completely flawless sensors, camera prices would explode. A perfect sensor will cost in the tens of thousands of dollars.", "link": "https://www.l-camera-forum.com/topic/272367-vertical-line-at-high-iso/?tab=comments#comment-3329982", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": " that is correct. it is the accepted way of fixing pixel defects. it is called sensor remapping. all sensors are -----> mapped !!!  from new, sometimes they need to be remapped. there is a maximum number of pixels that may be remapped, depending on the quality target that the manufacturer has set, depending on the level the camera is on. above that number the sensor must be changed. in fact, leica has a rather low tolerance, resulting in a proportionally high number of sensors swapped out under guaranty. if the camera makers were to use completely flawless sensors, camera prices would explode. a perfect sensor will cost in the tens of thousands of dollars.", "sortedWord": "None", "identifyer": 7801, "year": "2017"}, {"Unnamed: 0": 374552, "autor": "pico", "date": 1495125000000, "content": "When I find myself slipping into bitter disappointments I cope and brighten up. The older I become the easier coping becomes. Regarding the M9s, I like them so much regardless of tiny sensor defects that I have mapped the locations and heal them (even in batch) in post-processing. I can't imagine being so uptight that I have to view pixel level to find defects. Some of the angst people have amounts to microscopic issues. Tough life.", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/14/?tab=comments#comment-3277653", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "when i find myself slipping into bitter disappointments i cope and brighten up. the older i become the easier coping becomes. regarding the m9s, i like them so much regardless of tiny sensor defects that i have -----> mapped !!!  the locations and heal them (even in batch) in post-processing. i can't imagine being so uptight that i have to view pixel level to find defects. some of the angst people have amounts to microscopic issues. tough life.", "sortedWord": "None", "identifyer": 35858, "year": "2017"}, {"Unnamed: 0": 383765, "autor": "Desmoprem", "date": 1488123660000, "content": "As you can see from this image from a week long trip through Blue Ridge Parkway and nearby regions, I travel pretty lightly. Just that one back strapped to the tail of the ol' Ducati Paul Smart LE. Typically, I dress not for the ride, but for the crash, which also includes camera gear. I was carrying a D Lux 5 on this trip, which I consider a \"disposable Leica\", something I wouldn't get too worried about if I was involved in an accident. Really, all that is in the bag are toiletries, maps, rain gear, one pair of bluejeans and underwear to wear under full leathers...and the little point-n-shoot Leica. --img-- ", "link": "https://www.l-camera-forum.com/topic/23730-m8-motorcycles-vibration-resistance/page/3/?tab=comments#comment-3222225", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "as you can see from this image from a week long trip through blue ridge parkway and nearby regions, i travel pretty lightly. just that one back strapped to the tail of the ol' ducati paul smart le. typically, i dress not for the ride, but for the crash, which also includes camera gear. i was carrying a d lux 5 on this trip, which i consider a \"disposable leica\", something i wouldn't get too worried about if i was involved in an accident. really, all that is in the bag are toiletries, -----> maps !!! , rain gear, one pair of bluejeans and underwear to wear under full leathers...and the little point-n-shoot leica. --img-- ", "sortedWord": "None", "identifyer": 45166, "year": "2017"}, {"Unnamed: 0": 383766, "autor": "Ernstk", "date": 1488383760000, "content": "As you can see from this image from a week long trip through Blue Ridge Parkway and nearby regions, I travel pretty lightly. Just that one back strapped to the tail of the ol' Ducati Paul Smart LE. Typically, I dress not for the ride, but for the crash, which also includes camera gear. I was carrying a D Lux 5 on this trip, which I consider a \"disposable Leica\", something I wouldn't get too worried about if I was involved in an accident. Really, all that is in the bag are toiletries, maps, rain gear, one pair of bluejeans and underwear to wear under full leathers...and the little point-n-shoot Leica. Lovely bike. I had a 748R until recently. Ernst --img-- ", "link": "https://www.l-camera-forum.com/topic/23730-m8-motorcycles-vibration-resistance/page/3/?tab=comments#comment-3224604", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "as you can see from this image from a week long trip through blue ridge parkway and nearby regions, i travel pretty lightly. just that one back strapped to the tail of the ol' ducati paul smart le. typically, i dress not for the ride, but for the crash, which also includes camera gear. i was carrying a d lux 5 on this trip, which i consider a \"disposable leica\", something i wouldn't get too worried about if i was involved in an accident. really, all that is in the bag are toiletries, -----> maps !!! , rain gear, one pair of bluejeans and underwear to wear under full leathers...and the little point-n-shoot leica. lovely bike. i had a 748r until recently. ernst --img-- ", "sortedWord": "None", "identifyer": 45167, "year": "2017"}, {"Unnamed: 0": 404135, "autor": "Chubkins", "date": 1511737740000, "content": "hmm, I guess I considered the 1959 versions as rare as only 300 were made right before they transitioned to the 2.8. Oh well. Is there a good price range for it? Seems to be all over the map in the usual places.", "link": "https://www.l-camera-forum.com/topic/279231-considering-a-35cm-summaron-f35-should-i-look-for-the-rarest-version/?tab=comments#comment-3404513", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "hmm, i guess i considered the 1959 versions as rare as only 300 were made right before they transitioned to the 2.8. oh well. is there a good price range for it? seems to be all over the -----> map !!!  in the usual places.", "sortedWord": "None", "identifyer": 16895, "year": "2017"}, {"Unnamed: 0": 418232, "autor": "david perry", "date": 1488907440000, "content": "Just spent the day out with the Peak Design 30L backpack. What a fabulous piece of kit. Carried SL plus 35 cron, 50apo and 21SEM, plus the 24-90 zoom, water, maps etc. Can access the side compartments without removing the bag, and everything just works brilliantly. Really comfortable on my shoulders, which means I can carry much more weight with comfort than I can with my ONA Berlin for example.", "link": "https://www.l-camera-forum.com/topic/269692-which-backpack-for-the-sl/page/3/?tab=comments#comment-3228955", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "just spent the day out with the peak design 30l backpack. what a fabulous piece of kit. carried sl plus 35 cron, 50apo and 21sem, plus the 24-90 zoom, water, -----> maps !!!  etc. can access the side compartments without removing the bag, and everything just works brilliantly. really comfortable on my shoulders, which means i can carry much more weight with comfort than i can with my ona berlin for example.", "sortedWord": "None", "identifyer": 31241, "year": "2017"}, {"Unnamed: 0": 419657, "autor": "FlashGordonPhotography", "date": 1494711660000, "content": "O Can you remind me, do you alter the flash EV on the 64 by altering the camera EV on the top adjuster knob, like you would alter camera EV when not using a flash? Alternatively do you have to delve into the camera menu of flash settings to adjust flash power? If it is the first alternative, that could tempt me to upgrade my SF-58D Mk.1 to the SF-64. Having to use the settings menu on the flash LCD and menu buttons on the SF58 to alter flash power in TTL, is rather slow and clunky, needing multiple button presses. Wilson On the SL FEC can be changed by either the camera OR the flash. Both work and the change is communicated properly( change on camera, see it on flash and vice versa). On the camera it isn't through the top dial. That's still normal exposure compensation. It's a menu item but you can map it to a long press button. I have mine set to the lower right which means I can use FEC without lowering the camera from my eye. So basically (for the SL)... SF26....................set on camera. SF58....................set on flash SF40....................set on flash SF64.....................set on either camera or flash Gordon", "link": "https://www.l-camera-forum.com/topic/256231-flash-performance-very-disappointing-on-the-sl/page/7/?tab=comments#comment-3274457", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "o can you remind me, do you alter the flash ev on the 64 by altering the camera ev on the top adjuster knob, like you would alter camera ev when not using a flash? alternatively do you have to delve into the camera menu of flash settings to adjust flash power? if it is the first alternative, that could tempt me to upgrade my sf-58d mk.1 to the sf-64. having to use the settings menu on the flash lcd and menu buttons on the sf58 to alter flash power in ttl, is rather slow and clunky, needing multiple button presses. wilson on the sl fec can be changed by either the camera or the flash. both work and the change is communicated properly( change on camera, see it on flash and vice versa). on the camera it isn't through the top dial. that's still normal exposure compensation. it's a menu item but you can -----> map !!!  it to a long press button. i have mine set to the lower right which means i can use fec without lowering the camera from my eye. so basically (for the sl)... sf26....................set on camera. sf58....................set on flash sf40....................set on flash sf64.....................set on either camera or flash gordon", "sortedWord": "None", "identifyer": 32669, "year": "2017"}, {"Unnamed: 0": 439931, "autor": "Lucena", "date": 1483704720000, "content": "Wow. That is unusual. Where was this taken. Country? Region? Thanks. Portugal, Baixo Alentejo, Penedos In google maps: 37°29'10.0\"N 7°47'54.7\"W Edited January 6, 2017 by Lucena", "link": "https://www.l-camera-forum.com/topic/260179-leica-q-leica-q2-macro-image-thread/page/14/?tab=comments#comment-3180287", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "wow. that is unusual. where was this taken. country? region? thanks. portugal, baixo alentejo, penedos in -----> google !!!  -----> maps !!! : 37°29'10.0\"n 7°47'54.7\"w edited january 6, 2017 by lucena", "sortedWord": "None", "identifyer": 53267, "year": "2017"}, {"Unnamed: 0": 439946, "autor": "Lucena", "date": 1484763540000, "content": "The New Map of Europe... F2.8, 1/1250, ISO 100 Can anybody guess what this is? A wall...decaying...", "link": "https://www.l-camera-forum.com/topic/260179-leica-q-leica-q2-macro-image-thread/page/14/?tab=comments#comment-3189586", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "the new -----> map !!!  of europe... f2.8, 1/1250, iso 100 can anybody guess what this is? a wall...decaying...", "sortedWord": "None", "identifyer": 53282, "year": "2017"}], "name": "mapL-Forum2017"}