{"interestingcomments": [{"Unnamed: 0": 359559, "autor": "Me Leica!", "date": 1547473560000, "content": "3 minutes ago, IamTheDistance said: Wow, its true! the M240 is much more expensive in Japan (MapCamera prices) than Red Dot Camera. However, the newer M10 is a little bit cheaper in Japan (MapCamera again). Why is the M240 holding it value in Japan?😅 Map Camera is many things, but cheap ain't one of them! I pop in there quite regularly and the average price of an M9 with a replaced sensor there is around 400,000 yen, sometimes quite a bit over that. That's around 2900 UK pounds - and Red Dot have M240s (with slight cosmetic issues, and I don't care about those as long as the main functions are OK) for as low as 2150. They answered my email (very quickly) and quoted me 110 quid for shipping, so even with that plus whatever import fees are applicable, I'd be getting an M240 for significantly less than a Map Camera M9.", "link": "https://www.l-camera-forum.com/topic/293271-how-sturdy-robust-is-the-m240-compared-to-the-m9/?tab=comments#comment-3664318", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "3 minutes ago, iamthedistance said: wow, its true! the m240 is much more expensive in japan (mapcamera prices) than red dot camera. however, the newer m10 is a little bit cheaper in japan (mapcamera again). why is the m240 holding it value in japan?😅 -----> map !!!  camera is many things, but cheap ain't one of them! i pop in there quite regularly and the average price of an m9 with a replaced sensor there is around 400,000 yen, sometimes quite a bit over that. that's around 2900 uk pounds - and red dot have m240s (with slight cosmetic issues, and i don't care about those as long as the main functions are ok) for as low as 2150. they answered my email (very quickly) and quoted me 110 quid for shipping, so even with that plus whatever import fees are applicable, i'd be getting an m240 for significantly less than a map camera m9.", "sortedWord": "None", "identifyer": 20741, "year": "2019"}, {"Unnamed: 0": 359563, "autor": "Ted Lemon", "date": 1547485440000, "content": "3 hours ago, Me Leica! said: Map Camera is many things, but cheap ain't one of them! I pop in there quite regularly and the average price of an M9 with a replaced sensor there is around 400,000 yen, sometimes quite a bit over that. That's around 2900 UK pounds - and Red Dot have M240s (with slight cosmetic issues, and I don't care about those as long as the main functions are OK) for as low as 2150. They answered my email (very quickly) and quoted me 110 quid for shipping, so even with that plus whatever import fees are applicable, I'd be getting an M240 for significantly less than a Map Camera M9. I buy and sell all my gear at Red Dot - Great folks to deal with.", "link": "https://www.l-camera-forum.com/topic/293271-how-sturdy-robust-is-the-m240-compared-to-the-m9/?tab=comments#comment-3664430", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "3 hours ago, me leica! said: -----> map !!!  camera is many things, but cheap ain't one of them! i pop in there quite regularly and the average price of an m9 with a replaced sensor there is around 400,000 yen, sometimes quite a bit over that. that's around 2900 uk pounds - and red dot have m240s (with slight cosmetic issues, and i don't care about those as long as the main functions are ok) for as low as 2150. they answered my email (very quickly) and quoted me 110 quid for shipping, so even with that plus whatever import fees are applicable, i'd be getting an m240 for significantly less than a map camera m9. i buy and sell all my gear at red dot - great folks to deal with.", "sortedWord": "None", "identifyer": 20745, "year": "2019"}, {"Unnamed: 0": 365971, "autor": "adan", "date": 1559718780000, "content": "On 6/1/2019 at 3:15 PM, wolfloid said: Thanks for the replies. I'm not convinced it has nothing to do with dynamic range. Surely, as you say, extending the 'range' of tones would also, at least theoretically, extend the range of highlight tones, and it is that which seems to be missing. You are assuming that the DR is equally distributed (or \"should be equally distributed\") around \"middle gray\"- which is not the case. The DR extension can be quite asymmetrical, with proportionally more range at the shadow end. Not totally useful, yet, but I've been exploring the M10 tone curves, and happen to have had a chance to compare the M240 curves (upon which the M246 sensor is based). Would love to get an MM or M9 (or even M8) CCD for comparison, but have not run across one to borrow, yet. Anyway, here is how the tone curves map out for M240, M10 and (for reference) Canon 6D - the DR is distributed about 4 stops on the highlight side of middle gray, and about 7.5 stops on the shadow side of middle gray (based on metering for a gray card with each camera - heavy blue line). Not symmetrical at all, but about a 2:1 ratio - and that is \"normal\" for all cameras I've checked so far. Specific to blown highlights, the M240 gets brighter faster up to a point, but rolls off a bit more slowly than the M10 (doesn't crash through 255 like a rocket as much). Both actually \"blow\" medium gray identically when it is 4 stops overexposed. Both have the same total DR of 8+4=12 stops±. The M240 renders medium gray about 0.5 stop lighter, however --img-- ", "link": "https://www.l-camera-forum.com/topic/297813-m246-weak-in-the-highlight-range/?tab=comments#comment-3753810", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "on 6/1/2019 at 3:15 pm, wolfloid said: thanks for the replies. i'm not convinced it has nothing to do with dynamic range. surely, as you say, extending the 'range' of tones would also, at least theoretically, extend the range of highlight tones, and it is that which seems to be missing. you are assuming that the dr is equally distributed (or \"should be equally distributed\") around \"middle gray\"- which is not the case. the dr extension can be quite asymmetrical, with proportionally more range at the shadow end. not totally useful, yet, but i've been exploring the m10 tone curves, and happen to have had a chance to compare the m240 curves (upon which the m246 sensor is based). would love to get an mm or m9 (or even m8) ccd for comparison, but have not run across one to borrow, yet. anyway, here is how the tone curves -----> map !!!  out for m240, m10 and (for reference) canon 6d - the dr is distributed about 4 stops on the highlight side of middle gray, and about 7.5 stops on the shadow side of middle gray (based on metering for a gray card with each camera - heavy blue line). not symmetrical at all, but about a 2:1 ratio - and that is \"normal\" for all cameras i've checked so far. specific to blown highlights, the m240 gets brighter faster up to a point, but rolls off a bit more slowly than the m10 (doesn't crash through 255 like a rocket as much). both actually \"blow\" medium gray identically when it is 4 stops overexposed. both have the same total dr of 8+4=12 stops±. the m240 renders medium gray about 0.5 stop lighter, however --img-- ", "sortedWord": "None", "identifyer": 27235, "year": "2019"}, {"Unnamed: 0": 365976, "autor": "adan", "date": 1559844420000, "content": "On 6/5/2019 at 10:36 AM, wolfloid said: I too thought the digital sensor response to light was a straight line. Generally it is, straight off the sensor. 1 photon in ≈ 1 electron, or pico/nano/whatevercoulomb of charge, or pico/nano/whatevervolt of electrical potential out. But that would really look screwy to us humans used to 190 years of seeing non-linear silver-based photographs. So in the initial digitizing and processing of the image between sensor and SD card, an S-shaped tone curve is mapped onto the linear output, to make the result look more normal to our eyes. It does attempt to replicate the logarithmic S-shape (\"toe,\" \"straight-line\" and \"shoulder\") of the \"Hurter-Driffield\" curves of processed film, in a generic way (not replicating any particular film - although Fuji's \"Film Type\" settings may do that): https://en.wikipedia.org/wiki/Sensitometry Those \"built-in\" firmware curves (and differences between them from various cameras, especially other digital Ms) are exactly what I am attempting to visualize in my own test. To get a handle on how different (if at all) the \"dark, contrasty\" M10 curve is, compared to others. A camera-maker has \"artistic license\" to play with the tone curves it programs into the camera firmware (thus Leica changed the curve mathematics, going from the M(240) to the M10). When you make curve or other exposure adjustments in PhotoShop/LR/ACR/whatever - your curve-adjustments are on top of the baked-in \"looks like a photograph\" curve from the camera's firmware.", "link": "https://www.l-camera-forum.com/topic/297813-m246-weak-in-the-highlight-range/?tab=comments#comment-3754700", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "on 6/5/2019 at 10:36 am, wolfloid said: i too thought the digital sensor response to light was a straight line. generally it is, straight off the sensor. 1 photon in ≈ 1 electron, or pico/nano/whatevercoulomb of charge, or pico/nano/whatevervolt of electrical potential out. but that would really look screwy to us humans used to 190 years of seeing non-linear silver-based photographs. so in the initial digitizing and processing of the image between sensor and sd card, an s-shaped tone curve is -----> mapped !!!  onto the linear output, to make the result look more normal to our eyes. it does attempt to replicate the logarithmic s-shape (\"toe,\" \"straight-line\" and \"shoulder\") of the \"hurter-driffield\" curves of processed film, in a generic way (not replicating any particular film - although fuji's \"film type\" settings may do that): https://en.wikipedia.org/wiki/sensitometry those \"built-in\" firmware curves (and differences between them from various cameras, especially other digital ms) are exactly what i am attempting to visualize in my own test. to get a handle on how different (if at all) the \"dark, contrasty\" m10 curve is, compared to others. a camera-maker has \"artistic license\" to play with the tone curves it programs into the camera firmware (thus leica changed the curve mathematics, going from the m(240) to the m10). when you make curve or other exposure adjustments in photoshop/lr/acr/whatever - your curve-adjustments are on top of the baked-in \"looks like a photograph\" curve from the camera's firmware.", "sortedWord": "None", "identifyer": 27240, "year": "2019"}, {"Unnamed: 0": 373403, "autor": "TomB_tx", "date": 1566309420000, "content": "I thought the M9 only supported SDHC cards, not SDXC. I've seen PCs that only supported SDHC but would somewhat work with SDXC - until another PC wrote into the eXpanded memory map of the XC card - then the SDHC PC wouldn't read it.", "link": "https://www.l-camera-forum.com/topic/300493-m-e-works-with-all-sd-cards/?tab=comments#comment-3802105", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i thought the m9 only supported sdhc cards, not sdxc. i've seen pcs that only supported sdhc but would somewhat work with sdxc - until another pc wrote into the expanded memory -----> map !!!  of the xc card - then the sdhc pc wouldn't read it.", "sortedWord": "None", "identifyer": 34707, "year": "2019"}, {"Unnamed: 0": 373466, "autor": "TomB_tx", "date": 1573907640000, "content": "Leica can certainly map out the hot pixel and fix the wheel. (Sometimes just exercising a wheel control can improve it, if it is a potentiometer type, but I suspect this may be an encoder type, so replacement may be in order.) I'd never use a spray. However, if they have to open up to fix internals (not just a re-map of the sensor) Leica often will only do a complete service. That gives a like-new result, but much more than a few hundred dollars! But it is still a nice camera. I still use my M9, which is like new after Leica replaced the sensor. I was fortunate to have that done during the \"free\" period, which was amazing for a 7-year old camera. It's likely not to be the bargain you thought, but you'll have to evaluate if the cost if worth it.", "link": "https://www.l-camera-forum.com/topic/303531-just-picked-up-a-used-m-e-220-a-couple-small-issues-with-it-any-advice-would-be-great/?tab=comments#comment-3855717", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "leica can certainly -----> map !!!  out the hot pixel and fix the wheel. (sometimes just exercising a wheel control can improve it, if it is a potentiometer type, but i suspect this may be an encoder type, so replacement may be in order.) i'd never use a spray. however, if they have to open up to fix internals (not just a re-map of the sensor) leica often will only do a complete service. that gives a like-new result, but much more than a few hundred dollars! but it is still a nice camera. i still use my m9, which is like new after leica replaced the sensor. i was fortunate to have that done during the \"free\" period, which was amazing for a 7-year old camera. it's likely not to be the bargain you thought, but you'll have to evaluate if the cost if worth it.", "sortedWord": "None", "identifyer": 34770, "year": "2019"}, {"Unnamed: 0": 374011, "autor": "NigelG", "date": 1550487960000, "content": "Map Camera Tokyo currently list good M9Ps at c 550000yen which even after the tax is removed for export equates to $4850 / £ 3750 / €4300! I paid less than £2500 for an absolutely mint one from a UK leica dealer with a brand new sensor/service and only 1500 frames and even Leica Mayfair just had one available for £2750....", "link": "https://www.l-camera-forum.com/topic/294411-is-used-leica-m9-is-good-for-a-first-leica-or-should-i-go-to-m10-for-the-newest-and-greatest/?tab=comments#comment-3686441", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "-----> map !!!  camera tokyo currently list good m9ps at c 550000yen which even after the tax is removed for export equates to $4850 / £ 3750 / €4300! i paid less than £2500 for an absolutely mint one from a uk leica dealer with a brand new sensor/service and only 1500 frames and even leica mayfair just had one available for £2750....", "sortedWord": "None", "identifyer": 35317, "year": "2019"}, {"Unnamed: 0": 374019, "autor": "Eric727", "date": 1550501940000, "content": "Thank you everyone by giving such useful information and opinions. Just to give some background about myself as I am new to Leica forum. I am from Malaysia, which to me, this is a place that every difficult to find a good condition Leica, even there is, the price will be sky high. For my understanding, the only better place to look for used camera in Asia is Japan although their price are not cheap, but at least they are honest enough to explain the condition of the camera before we can make purchase decision. However, if you can provide a better place that I can obtain a Leica at reasonable price and that online shop is reliable and willing to offer international shipping, I am totally find with it. I have been shooting DSLR for 10 years, and started with digital, currently (still) shooting with Canon EOS 1D Mark IV, 6D and owned few good glass such as 16-35mm f/4, 70-200mm f/2.8, 24-105 f/4 and few primes. Photography is just my hobby, and mainly in street photography and travel photography. For the gears I owned, I think I can shoot fast if I want, but I wish to experience the Leica rangefinder camera, and I noticed that, this is not a \"run-and-gun\" camera. Camera is just a tool for me to take picture, a better camera won't help for me to take good picture! The experience is important to me, I believe the Leica should able to bring a very good experience to enjoy the photography. From the Map Camera, a GOOD used M9 cost around usd4,800, a good M240 is around USD5,050 which even cheaper than a M9-P, and an used M10 cost around USD6,300. My budget is below USD5,000 for a body only, since there are so many problem for M9, is it M9-P or M240 is a better option? Would appreciated if you can give some advise. Thank you. --img-- ", "link": "https://www.l-camera-forum.com/topic/294411-is-used-leica-m9-is-good-for-a-first-leica-or-should-i-go-to-m10-for-the-newest-and-greatest/?tab=comments#comment-3686536", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "thank you everyone by giving such useful information and opinions. just to give some background about myself as i am new to leica forum. i am from malaysia, which to me, this is a place that every difficult to find a good condition leica, even there is, the price will be sky high. for my understanding, the only better place to look for used camera in asia is japan although their price are not cheap, but at least they are honest enough to explain the condition of the camera before we can make purchase decision. however, if you can provide a better place that i can obtain a leica at reasonable price and that online shop is reliable and willing to offer international shipping, i am totally find with it. i have been shooting dslr for 10 years, and started with digital, currently (still) shooting with canon eos 1d mark iv, 6d and owned few good glass such as 16-35mm f/4, 70-200mm f/2.8, 24-105 f/4 and few primes. photography is just my hobby, and mainly in street photography and travel photography. for the gears i owned, i think i can shoot fast if i want, but i wish to experience the leica rangefinder camera, and i noticed that, this is not a \"run-and-gun\" camera. camera is just a tool for me to take picture, a better camera won't help for me to take good picture! the experience is important to me, i believe the leica should able to bring a very good experience to enjoy the photography. from the -----> map !!!  camera, a good used m9 cost around usd4,800, a good m240 is around usd5,050 which even cheaper than a m9-p, and an used m10 cost around usd6,300. my budget is below usd5,000 for a body only, since there are so many problem for m9, is it m9-p or m240 is a better option? would appreciated if you can give some advise. thank you. --img-- ", "sortedWord": "None", "identifyer": 35325, "year": "2019"}, {"Unnamed: 0": 374029, "autor": "Eric727", "date": 1550550660000, "content": "17 hours ago, NigelG said: Map Camera Tokyo currently list good M9Ps at c 550000yen which even after the tax is removed for export equates to $4850 / £ 3750 / €4300! I paid less than £2500 for an absolutely mint one from a UK leica dealer with a brand new sensor/service and only 1500 frames and even Leica Mayfair just had one available for £2750.... Hi NigelG, Thanks for your comments. Do you know any honest and reliable Leica seller from UK that willing to ship internationally? Or if possible, can you leave a website so I can contact them directly? Thank you.", "link": "https://www.l-camera-forum.com/topic/294411-is-used-leica-m9-is-good-for-a-first-leica-or-should-i-go-to-m10-for-the-newest-and-greatest/page/2/?tab=comments#comment-3686866", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "17 hours ago, nigelg said: -----> map !!!  camera tokyo currently list good m9ps at c 550000yen which even after the tax is removed for export equates to $4850 / £ 3750 / €4300! i paid less than £2500 for an absolutely mint one from a uk leica dealer with a brand new sensor/service and only 1500 frames and even leica mayfair just had one available for £2750.... hi nigelg, thanks for your comments. do you know any honest and reliable leica seller from uk that willing to ship internationally? or if possible, can you leave a website so i can contact them directly? thank you.", "sortedWord": "None", "identifyer": 35335, "year": "2019"}, {"Unnamed: 0": 414634, "autor": "Printmaker", "date": 1572989400000, "content": "That's why I'm a loner. Just my wife, a backpack, a map, and our cameras. Sure, we make some mistakes, but people are always helpful to two lost old timers who smile a lot. BTW: The people you will meet in South Africa are incredibly nice. They are only surpassed by the Kiwis and even then only by a hair.", "link": "https://www.l-camera-forum.com/topic/303064-telephoto-for-safari-panasonic-70-200-w-2x-vs-leica-90-280/page/4/?tab=comments#comment-3848519", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "that's why i'm a loner. just my wife, a backpack, a -----> map !!! , and our cameras. sure, we make some mistakes, but people are always helpful to two lost old timers who smile a lot. btw: the people you will meet in south africa are incredibly nice. they are only surpassed by the kiwis and even then only by a hair.", "sortedWord": "None", "identifyer": 27570, "year": "2019"}, {"Unnamed: 0": 418977, "autor": "dkCambridgeshire", "date": 1553945220000, "content": "27 minutes ago, Alistairm said: I'm really interested in what the Sigma L mount lenses can do here. While I am usually \"lean in lean out\" and using flash to freeze the frame, as a bug chaser autofocus is useful for me. I also prefer longer focal lengths... the Nikon 200 and Sigma 180 remain my favourite all time macro lenses, with Tamron's offerings not far behind. At the moment the CL60 on the CL is the best Leica offering I have. Leica does a great deal of things well, but flash, macro, long lenses and sport/wildlife are all way behind Nikon and Canon... I'm hoping the new L mount offerings from Sigma and Panasonic change that. Sigma is due to release its EF to L mount adapter in December https://www.bhphotovideo.com/c/product/1463159-REG/sigma_sigma_mc_21_mount_converter_lens.html … but will it AF any better / quicker than the Novoflex EF to SL smart adapter? There's a Sigma L mount 70mm macro listed on the road map but that's too short for 'in the field' AF macro of moving insects. dunk", "link": "https://www.l-camera-forum.com/topic/288047-macro-solution-for-sl/page/2/?tab=comments#comment-3712365", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "27 minutes ago, alistairm said: i'm really interested in what the sigma l mount lenses can do here. while i am usually \"lean in lean out\" and using flash to freeze the frame, as a bug chaser autofocus is useful for me. i also prefer longer focal lengths... the nikon 200 and sigma 180 remain my favourite all time macro lenses, with tamron's offerings not far behind. at the moment the cl60 on the cl is the best leica offering i have. leica does a great deal of things well, but flash, macro, long lenses and sport/wildlife are all way behind nikon and canon... i'm hoping the new l mount offerings from sigma and panasonic change that. sigma is due to release its ef to l mount adapter in december https://www.bhphotovideo.com/c/product/1463159-reg/sigma_sigma_mc_21_mount_converter_lens.html … but will it af any better / quicker than the novoflex ef to sl smart adapter? there's a sigma l mount 70mm macro listed on the road -----> map !!!  but that's too short for 'in the field' af macro of moving insects. dunk", "sortedWord": "None", "identifyer": 31987, "year": "2019"}, {"Unnamed: 0": 418978, "autor": "Alistairm", "date": 1553946720000, "content": " 23 minutes ago, dkCambridgeshire said: Sigma is due to release its EF to L mount adapter in December https://www.bhphotovideo.com/c/product/1463159-REG/sigma_sigma_mc_21_mount_converter_lens.html … but will it AF any better / quicker than the Novoflex EF to SL smart adapter? There's a Sigma L mount 70mm macro listed on the road map but that's too short for 'in the field' AF macro of moving insects. dunk Yep... looking forward to someone making the next lens that drags me back into the deep end of macro. The game hasn't moved on much since John Shaw's books for SLR style cameras at least.", "link": "https://www.l-camera-forum.com/topic/288047-macro-solution-for-sl/page/3/?tab=comments#comment-3712371", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": " 23 minutes ago, dkcambridgeshire said: sigma is due to release its ef to l mount adapter in december https://www.bhphotovideo.com/c/product/1463159-reg/sigma_sigma_mc_21_mount_converter_lens.html … but will it af any better / quicker than the novoflex ef to sl smart adapter? there's a sigma l mount 70mm macro listed on the road -----> map !!!  but that's too short for 'in the field' af macro of moving insects. dunk yep... looking forward to someone making the next lens that drags me back into the deep end of macro. the game hasn't moved on much since john shaw's books for slr style cameras at least.", "sortedWord": "None", "identifyer": 31988, "year": "2019"}, {"Unnamed: 0": 418980, "autor": "Jenningsmca", "date": 1553987340000, "content": "11 hours ago, dkCambridgeshire said: Sigma is due to release its EF to L mount adapter in December https://www.bhphotovideo.com/c/product/1463159-REG/sigma_sigma_mc_21_mount_converter_lens.html … but will it AF any better / quicker than the Novoflex EF to SL smart adapter? There's a Sigma L mount 70mm macro listed on the road map but that's too short for 'in the field' AF macro of moving insects. dunk You talking about the MC-21 adapter, where sigma said it does not work with Leica bodies. At the time of the initial announcmenet Sigma said the adapter would work with 'any L-mount camera body.' Sigma is now saying that the MC-21 won't work with existing Leica L-mount camera bodies due to 'specifications [that] have changed.' Looks like there are a few bugs to iron out yet. Edited March 30, 2019 by Jenningsmca", "link": "https://www.l-camera-forum.com/topic/288047-macro-solution-for-sl/page/3/?tab=comments#comment-3712725", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "11 hours ago, dkcambridgeshire said: sigma is due to release its ef to l mount adapter in december https://www.bhphotovideo.com/c/product/1463159-reg/sigma_sigma_mc_21_mount_converter_lens.html … but will it af any better / quicker than the novoflex ef to sl smart adapter? there's a sigma l mount 70mm macro listed on the road -----> map !!!  but that's too short for 'in the field' af macro of moving insects. dunk you talking about the mc-21 adapter, where sigma said it does not work with leica bodies. at the time of the initial announcmenet sigma said the adapter would work with 'any l-mount camera body.' sigma is now saying that the mc-21 won't work with existing leica l-mount camera bodies due to 'specifications [that] have changed.' looks like there are a few bugs to iron out yet. edited march 30, 2019 by jenningsmca", "sortedWord": "None", "identifyer": 31990, "year": "2019"}, {"Unnamed: 0": 426489, "autor": "ramarren", "date": 1572006480000, "content": "I took a nice cycle ride on Wednesday... Hopped the train with the Fatboy Comp Carbon here in Santa Clara and exitted in Redwood City. --img--  I met a friend there for lunch. Afterwards, I let Google Maps guide me back down the Peninsula towards Mountain View. I had it set to cycling and it took me through a marvelously twisty and fun route that I'd never have dreamed up myself. I stopped several times to make a photo when the light and the scene moved me. First, at the edge of Menlo Park and Palo Alto, there was this giraffe: --img--  After that, I crossed over the US 101 highway complex at the Arastradero maze using the very long pedestrian bridge there and headed out on the Bay Trail. It was a lovely day out and the trail was completely empty when I was there, the first time that's happened on the rides I've taken there. --img--  This trail goes way out onto the edge of SF Bay, and can take you onto dirt around east of Moffet Field, but I didn't want to go that way. Hopping back over US 101 via another pedestrian bridge, and then wiggling through one neighborhood after another, I found myself right back at one of my favorite cafe's in downtown Mountain View, Dana Street Roasting Company. These chairs begged to be photographed, the light was stunning in rich contrasts. --img--  From there to home is a (mostly boring) pretty straight shot down Evelyn and onto Monroe, about 8 miles or so long. I didn't stop again to make any photos in that section, I just pounded pedals and flew as it is slightly downhill most of the way… All told, it was 27 miles on that run at 11.8 mph average speed. I pummeled down 1400 calories of pedaling... It was great! All photos with the Leica CL fitted with Voigtländer 10mm f/5.6 lens ... of course. enjoy! G", "link": "https://www.l-camera-forum.com/topic/298369-a-mini-digital-swc-leica-cl-voigtl%C3%A4nder-10mm/page/4/?tab=comments#comment-3841955", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "i took a nice cycle ride on wednesday... hopped the train with the fatboy comp carbon here in santa clara and exitted in redwood city. --img--  i met a friend there for lunch. afterwards, i let -----> google !!!  -----> maps !!!  guide me back down the peninsula towards mountain view. i had it set to cycling and it took me through a marvelously twisty and fun route that i'd never have dreamed up myself. i stopped several times to make a photo when the light and the scene moved me. first, at the edge of menlo park and palo alto, there was this giraffe: --img--  after that, i crossed over the us 101 highway complex at the arastradero maze using the very long pedestrian bridge there and headed out on the bay trail. it was a lovely day out and the trail was completely empty when i was there, the first time that's happened on the rides i've taken there. --img--  this trail goes way out onto the edge of sf bay, and can take you onto dirt around east of moffet field, but i didn't want to go that way. hopping back over us 101 via another pedestrian bridge, and then wiggling through one neighborhood after another, i found myself right back at one of my favorite cafe's in downtown mountain view, dana street roasting company. these chairs begged to be photographed, the light was stunning in rich contrasts. --img--  from there to home is a (mostly boring) pretty straight shot down evelyn and onto monroe, about 8 miles or so long. i didn't stop again to make any photos in that section, i just pounded pedals and flew as it is slightly downhill most of the way… all told, it was 27 miles on that run at 11.8 mph average speed. i pummeled down 1400 calories of pedaling... it was great! all photos with the leica cl fitted with voigtländer 10mm f/5.6 lens ... of course. enjoy! g", "sortedWord": "None", "identifyer": 39588, "year": "2019"}, {"Unnamed: 0": 426490, "autor": "Viv", "date": 1572013560000, "content": " 1 hour ago, ramarren said: I took a nice cycle ride on Wednesday... Hopped the train with the Fatboy Comp Carbon here in Santa Clara and exitted in Redwood City. --img--  I met a friend there for lunch. Afterwards, I let Google Maps guide me back down the Peninsula towards Mountain View. I had it set to cycling and it took me through a marvelously twisty and fun route that I'd never have dreamed up myself. I stopped several times to make a photo when the light and the scene moved me. First, at the edge of Menlo Park and Palo Alto, there was this giraffe: --img--  After that, I crossed over the US 101 highway complex at the Arastradero maze using the very long pedestrian bridge there and headed out on the Bay Trail. It was a lovely day out and the trail was completely empty when I was there, the first time that's happened on the rides I've taken there. --img--  This trail goes way out onto the edge of SF Bay, and can take you onto dirt around east of Moffet Field, but I didn't want to go that way. Hopping back over US 101 via another pedestrian bridge, and then wiggling through one neighborhood after another, I found myself right back at one of my favorite cafe's in downtown Mountain View, Dana Street Roasting Company. These chairs begged to be photographed, the light was stunning in rich contrasts. --img--  From there to home is a (mostly boring) pretty straight shot down Evelyn and onto Monroe, about 8 miles or so long. I didn't stop again to make any photos in that section, I just pounded pedals and flew as it is slightly downhill most of the way… All told, it was 27 miles on that run at 11.8 mph average speed. I pummeled down 1400 calories of pedaling... It was great! All photos with the Leica CL fitted with Voigtländer 10mm f/5.6 lens ... of course. enjoy! G The rolling resistance of those huge tyres must be considerable. They might be useful offroad but are surely not optimal on tarmac.", "link": "https://www.l-camera-forum.com/topic/298369-a-mini-digital-swc-leica-cl-voigtl%C3%A4nder-10mm/page/4/?tab=comments#comment-3842020", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": " 1 hour ago, ramarren said: i took a nice cycle ride on wednesday... hopped the train with the fatboy comp carbon here in santa clara and exitted in redwood city. --img--  i met a friend there for lunch. afterwards, i let -----> google !!!  -----> maps !!!  guide me back down the peninsula towards mountain view. i had it set to cycling and it took me through a marvelously twisty and fun route that i'd never have dreamed up myself. i stopped several times to make a photo when the light and the scene moved me. first, at the edge of menlo park and palo alto, there was this giraffe: --img--  after that, i crossed over the us 101 highway complex at the arastradero maze using the very long pedestrian bridge there and headed out on the bay trail. it was a lovely day out and the trail was completely empty when i was there, the first time that's happened on the rides i've taken there. --img--  this trail goes way out onto the edge of sf bay, and can take you onto dirt around east of moffet field, but i didn't want to go that way. hopping back over us 101 via another pedestrian bridge, and then wiggling through one neighborhood after another, i found myself right back at one of my favorite cafe's in downtown mountain view, dana street roasting company. these chairs begged to be photographed, the light was stunning in rich contrasts. --img--  from there to home is a (mostly boring) pretty straight shot down evelyn and onto monroe, about 8 miles or so long. i didn't stop again to make any photos in that section, i just pounded pedals and flew as it is slightly downhill most of the way… all told, it was 27 miles on that run at 11.8 mph average speed. i pummeled down 1400 calories of pedaling... it was great! all photos with the leica cl fitted with voigtländer 10mm f/5.6 lens ... of course. enjoy! g the rolling resistance of those huge tyres must be considerable. they might be useful offroad but are surely not optimal on tarmac.", "sortedWord": "None", "identifyer": 39589, "year": "2019"}, {"Unnamed: 0": 436598, "autor": "scott kirkpatrick", "date": 1571052960000, "content": "2 hours ago, Stuart Richardson said: Yes, and do you see that odd aliasing around the letters...that is the pattern I was mentioning. I have seen it in the landscapes I have taken. I do not think it is the camera being moved, I think it is inherent in the way that the camera combines the images. Is that really pattern noise or just the result of the actual pixels being larger than the spaces they are mapped into, thus needing some post-sharpening? I have't used the HR outdoors because of leaves and grass moving. But it should be good for rocks and ice (but maybe not clouds). Algorithmically, this is tricky stuff, probably proprietary, and thus each manufacture has to learn some things by trial and error. Panasonic, for example, offers a correction for moving leaves and grass. I would imagine that it works well only some of the time and fails in funny ways at other times. Olympus has been doing this the longest. Do they show the same effects?", "link": "https://www.l-camera-forum.com/topic/302140-does-the-s1-produce-sharper-images-than-the-s1r/page/2/?tab=comments#comment-3835689", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "2 hours ago, stuart richardson said: yes, and do you see that odd aliasing around the letters...that is the pattern i was mentioning. i have seen it in the landscapes i have taken. i do not think it is the camera being moved, i think it is inherent in the way that the camera combines the images. is that really pattern noise or just the result of the actual pixels being larger than the spaces they are -----> mapped !!!  into, thus needing some post-sharpening? i have't used the hr outdoors because of leaves and grass moving. but it should be good for rocks and ice (but maybe not clouds). algorithmically, this is tricky stuff, probably proprietary, and thus each manufacture has to learn some things by trial and error. panasonic, for example, offers a correction for moving leaves and grass. i would imagine that it works well only some of the time and fails in funny ways at other times. olympus has been doing this the longest. do they show the same effects?", "sortedWord": "None", "identifyer": 49833, "year": "2019"}, {"Unnamed: 0": 436602, "autor": "scott kirkpatrick", "date": 1571091840000, "content": "I did a quick check of what Google can find about how different cameras go about using 4 or 8 shots to get higher resolution. Imaging resource reviewed most of the contenders about 4 years ago, B&H posted a review article, and there was one blog post. Both Olympus and Panasonic's G-9 used 8 shot technology. Pentax K-1 and some others used four shot. Each article explains the idea that with four shots spaced one pixelsite apart you can collect all four Bayer-filtered exposures and relate that to a single point in the finished image. Nobody seems to know where the next four shots are taken, but the most plausible answer is this pattern: X X O O X X O O with the X's indicating the first four shots and the O's the second set. But that gives us only twice as many pixel sites, not arranged like the original set but with complete color information for each site. Olympus then maps these into 2.5 times as many sites as in the original image (in a JPEG) and three times as many in a raw file. In the S1R and S1, Panasonic is giving us 4 times as many pixel sites in a final raw image, and doesn't produce a JPG.. But the resulting raw files are processed by existing software, which means that the software thinks it is getting a traditional Bayer-ized raw file with four times as many pixels, each pixel carrying only R, G, B or G information. This means for compatibility the nicely collected color information has to be spread around in the finished HR image. No wonder there can be color artifacts as well as the patterns of light and dark that I show above near a horizontal black-white edge. Edited October 15, 2019 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/302140-does-the-s1-produce-sharper-images-than-the-s1r/page/2/?tab=comments#comment-3836065", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "i did a quick check of what google can find about how different cameras go about using 4 or 8 shots to get higher resolution. imaging resource reviewed most of the contenders about 4 years ago, b&h posted a review article, and there was one blog post. both olympus and panasonic's g-9 used 8 shot technology. pentax k-1 and some others used four shot. each article explains the idea that with four shots spaced one pixelsite apart you can collect all four bayer-filtered exposures and relate that to a single point in the finished image. nobody seems to know where the next four shots are taken, but the most plausible answer is this pattern: x x o o x x o o with the x's indicating the first four shots and the o's the second set. but that gives us only twice as many pixel sites, not arranged like the original set but with complete color information for each site. olympus then -----> maps !!!  these into 2.5 times as many sites as in the original image (in a jpeg) and three times as many in a raw file. in the s1r and s1, panasonic is giving us 4 times as many pixel sites in a final raw image, and doesn't produce a jpg.. but the resulting raw files are processed by existing software, which means that the software thinks it is getting a traditional bayer-ized raw file with four times as many pixels, each pixel carrying only r, g, b or g information. this means for compatibility the nicely collected color information has to be spread around in the finished hr image. no wonder there can be color artifacts as well as the patterns of light and dark that i show above near a horizontal black-white edge. edited october 15, 2019 by scott kirkpatrick", "sortedWord": "None", "identifyer": 49837, "year": "2019"}, {"Unnamed: 0": 437159, "autor": "bags27", "date": 1558874580000, "content": "If Panasonic IS announcing the teleconverters next week, whether or not they fit Leica L lenses, the minimum take away is that they are keeping to their announced road map. Meaning, very likely 3 more lenses this year. But to me as well, the most interesting will be the super telephoto.", "link": "https://www.l-camera-forum.com/topic/297648-panasonic-teleconverters-coming-soon/?tab=comments#comment-3747998", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "if panasonic is announcing the teleconverters next week, whether or not they fit leica l lenses, the minimum take away is that they are keeping to their announced road -----> map !!! . meaning, very likely 3 more lenses this year. but to me as well, the most interesting will be the super telephoto.", "sortedWord": "None", "identifyer": 50395, "year": "2019"}], "name": "mapL-Forum2019"}