{"interestingcomments": [{"Unnamed: 0": 369381, "autor": "Julian Thompson", "date": 1271192400000, "content": "Jamie - I tried that initially but wasn't lucky enough to have the screw head on the M9 in such an orientation that I could get the right angle driver in. It's pretty tight and you need full control over the tool Jamie - I found that the screwdriver with a filed end was perfect and allowed me to easily do it. If your screw is such that you can get the right angle in then I reckon, yes, perhaps that'd be OK.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/2/?tab=comments#comment-1293117", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "jamie - i tried that initially but wasn't lucky enough to have the screw head on the m9 in such an -----> orientation !!!  that i could get the right angle driver in. it's pretty tight and you need full control over the tool jamie - i found that the screwdriver with a filed end was perfect and allowed me to easily do it. if your screw is such that you can get the right angle in then i reckon, yes, perhaps that'd be ok.", "sortedWord": "None", "identifyer": 30677, "year": "2010"}, {"Unnamed: 0": 369383, "autor": "Jamie Roberts", "date": 1271193420000, "content": "Jamie - I tried that initially but wasn't lucky enough to have the screw head on the M9 in such an orientation that I could get the right angle driver in. It's pretty tight and you need full control over the tool Jamie - I found that the screwdriver with a filed end was perfect and allowed me to easily do it. If your screw is such that you can get the right angle in then I reckon, yes, perhaps that'd be OK. Thanks Julian! @ Roger, it is sometimes more of an art, especially with a lot of lenses in play. As I said, I can't get both my Noctilux (new) and my Summilux ASPH 50 to align with the RF at infinity. When I took my M8 and all my lenses into Kindermann, we used a building that was over a kilometer away for infinity. That seemed to work. I'm currently using a tower that's 5K away on the horizon, and that's also ok. The compromise between the Nocti and Lux seems ok for infinity; 1m / ,8 M is now out, ever so slightly, on both lenses, but both are better at 20m again. This can drive you crazy --img--  I'm off to look for the right screwdriver --img--  Edited April 13, 2010 by Jamie Roberts", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/2/?tab=comments#comment-1293156", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "jamie - i tried that initially but wasn't lucky enough to have the screw head on the m9 in such an -----> orientation !!!  that i could get the right angle driver in. it's pretty tight and you need full control over the tool jamie - i found that the screwdriver with a filed end was perfect and allowed me to easily do it. if your screw is such that you can get the right angle in then i reckon, yes, perhaps that'd be ok. thanks julian! @ roger, it is sometimes more of an art, especially with a lot of lenses in play. as i said, i can't get both my noctilux (new) and my summilux asph 50 to align with the rf at infinity. when i took my m8 and all my lenses into kindermann, we used a building that was over a kilometer away for infinity. that seemed to work. i'm currently using a tower that's 5k away on the horizon, and that's also ok. the compromise between the nocti and lux seems ok for infinity; 1m / ,8 m is now out, ever so slightly, on both lenses, but both are better at 20m again. this can drive you crazy --img--  i'm off to look for the right screwdriver --img--  edited april 13, 2010 by jamie roberts", "sortedWord": "None", "identifyer": 30679, "year": "2010"}], "name": "orientationL-Forum2010"}