{"interestingcomments": [{"Unnamed: 0": 384120, "autor": "ho_co", "date": 1180680420000, "content": "Mark-- Any idea where the orientation sensor is or how it functions? Thanks! --HC", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/13/?tab=comments#comment-269773", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "mark-- any idea where the -----> orientation !!!  sensor is or how it functions? thanks! --hc", "sortedWord": "None", "identifyer": 45522, "year": "2007"}, {"Unnamed: 0": 384122, "autor": "wlaidlaw", "date": 1180687380000, "content": "Mark--Any idea where the orientation sensor is or how it functions? Thanks! --HC Probably looks something like this: Wilson --img-- ", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/13/?tab=comments#comment-269856", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "mark--any idea where the -----> orientation !!!  sensor is or how it functions? thanks! --hc probably looks something like this: wilson --img-- ", "sortedWord": "None", "identifyer": 45524, "year": "2007"}, {"Unnamed: 0": 384124, "autor": "marknorton", "date": 1180695900000, "content": "Mark--Any idea where the orientation sensor is or how it functions? Thanks! --HC HC, interesting question! We can hear it rattling of course but I have no idea where it might be. I imagine it's something like a gold ball rolling around in a square of contacts inclined at 45 degrees and parallel to the plane of sensor (so, for example, mounted flat on the main DSP board); depending on the orientation, the ball makes contact with two sides of the square. I'm wondering if the white square on the DSP board is that, I thought at the time it was the \"clicker\". You're making me want to take the camera apart again!", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/13/?tab=comments#comment-269950", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "mark--any idea where the -----> orientation !!!  sensor is or how it functions? thanks! --hc hc, interesting question! we can hear it rattling of course but i have no idea where it might be. i imagine it's something like a gold ball rolling around in a square of contacts inclined at 45 degrees and parallel to the plane of sensor (so, for example, mounted flat on the main dsp board); depending on the orientation, the ball makes contact with two sides of the square. i'm wondering if the white square on the dsp board is that, i thought at the time it was the \"clicker\". you're making me want to take the camera apart again!", "sortedWord": "None", "identifyer": 45526, "year": "2007"}, {"Unnamed: 0": 384146, "autor": "marknorton", "date": 1191499800000, "content": "Carsten, the lens throat moulding is integrated with half of the battery housing as this (not very good picture) shows. It's also coated with an anti-reflective black flocking on the part that becomes the lens throat, so I would be concerned about disturbing that. The plastic is quite thin as well, so I expect any attempt to remove material is going to end in disaster! --img--  For orientation, if you remove the battery from the camera, you can see the bottom shape with the two screws attaching it to the front casting. To the right is the lens throat and here you can see the cut out which allows access to the rangefinder adjustment through the bottom of the camera.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/14/?tab=comments#comment-369149", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "carsten, the lens throat moulding is integrated with half of the battery housing as this (not very good picture) shows. it's also coated with an anti-reflective black flocking on the part that becomes the lens throat, so i would be concerned about disturbing that. the plastic is quite thin as well, so i expect any attempt to remove material is going to end in disaster! --img--  for -----> orientation !!! , if you remove the battery from the camera, you can see the bottom shape with the two screws attaching it to the front casting. to the right is the lens throat and here you can see the cut out which allows access to the rangefinder adjustment through the bottom of the camera.", "sortedWord": "None", "identifyer": 45548, "year": "2007"}], "name": "orientationL-Forum2007"}