{"interestingcomments": [{"Unnamed: 0": 377864, "autor": "Lindolfi", "date": 1331308380000, "content": "Thanks Jaap. It is however confirming my objection to the system: if you shoot in portrait mode, it will give different results if you turn the camera 90 degrees to the left or 90 degrees to the right... Just did a test: filling the left half of the image with black and the right half with white in portrait orientation and taking the same image after turning the camera 180 degrees, so that now black is right and white is left. (care was taken that the boundary between black and white was exactly through the middle of the image). The black and white had a difference of 7 stops in brightness. Result: same measurement of exposure time in the 1/3 stop accuracy the M9 offers in both portrait orientations. So no reason to be consistent in how you turn the camera to portrait orientation: just use the meter as though it is rotation symmetric around the centre of the image.", "link": "https://www.l-camera-forum.com/topic/174190-m9-metering-pattern/?tab=comments#comment-1949042", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "thanks jaap. it is however confirming my objection to the system: if you shoot in portrait mode, it will give different results if you turn the camera 90 degrees to the left or 90 degrees to the right... just did a test: filling the left half of the image with black and the right half with white in portrait -----> orientation !!!  and taking the same image after turning the camera 180 degrees, so that now black is right and white is left. (care was taken that the boundary between black and white was exactly through the middle of the image). the black and white had a difference of 7 stops in brightness. result: same measurement of exposure time in the 1/3 stop accuracy the m9 offers in both portrait orientations. so no reason to be consistent in how you turn the camera to portrait orientation: just use the meter as though it is rotation symmetric around the centre of the image.", "sortedWord": "None", "identifyer": 39177, "year": "2012"}, {"Unnamed: 0": 412464, "autor": "01af", "date": 1329919440000, "content": "Can someone please describe or show a picture of a headshot at closest focusing in portrait format? I'm wanting to see how much it fills the frame ... The minimum focusing distances are 0.75 m for the Summilux-M 75 mm and 1 m for the Summicron-M 90 mm (and Apo-Summicron-M 90 mm Asph, too). So the maximum magnification at the minimum focusing distances is bigger for the 75 mm, it's 1:8 or 1:9.2, respectively. So on a 35-mm-format camera (i. e. all Leica M models except M8/M8.2), the height of the field-of-view in portrait orientation is 28.8 cm (11 1/3 inch) for the 75 mm or 33.3 cm (13 1/9 inch) for the 90 mm. By the way, the Apo-Summicron-M 75 mm Asph can focus down to 0.7 m which yields a magnification of 1:7, or a width of the field-of-view (= height in portrait orientation) of 25.4 cm (10 inch). An average adult's head's height is about 25 cm (10 inch) from the tip of the chin to the top of the head (or a little more when there's a lot of hair). So with both lenses, you can capture a head-only portrait with a few centimeters of space between the head and the frame's borders (or no space with the Apo-Summicron-M 75 mm Asph). With the 90 mm, this extra space will be very slightly more ... but the perspective will look nicer due to the longer distance. In real life, usually you'll want a little more space around a person's head, so all these lenses basically are equally well-suited for portraiture. If you want to get closer than head-only—say, face-only or eyes-only—then you'll need to crop, or use an M8, or use the Macro-Elmar-M 90 mm, or go for an SLR camera. My advice is—when choosing a short telephoto lens for Leica M, namely 75 mm or 90 mm, then do not base your decision upon minimum focusing distance or maximum magnification but upon focal length, perspective of view, and how well it fits into your existing lens line-up. A 75 mm lens is more kinda longish standard lens while a 90 mm is more like a short telephoto.", "link": "https://www.l-camera-forum.com/topic/173284-75-summilux/?tab=comments#comment-1934315", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "can someone please describe or show a picture of a headshot at closest focusing in portrait format? i'm wanting to see how much it fills the frame ... the minimum focusing distances are 0.75 m for the summilux-m 75 mm and 1 m for the summicron-m 90 mm (and apo-summicron-m 90 mm asph, too). so the maximum magnification at the minimum focusing distances is bigger for the 75 mm, it's 1:8 or 1:9.2, respectively. so on a 35-mm-format camera (i. e. all leica m models except m8/m8.2), the height of the field-of-view in portrait -----> orientation !!!  is 28.8 cm (11 1/3 inch) for the 75 mm or 33.3 cm (13 1/9 inch) for the 90 mm. by the way, the apo-summicron-m 75 mm asph can focus down to 0.7 m which yields a magnification of 1:7, or a width of the field-of-view (= height in portrait orientation) of 25.4 cm (10 inch). an average adult's head's height is about 25 cm (10 inch) from the tip of the chin to the top of the head (or a little more when there's a lot of hair). so with both lenses, you can capture a head-only portrait with a few centimeters of space between the head and the frame's borders (or no space with the apo-summicron-m 75 mm asph). with the 90 mm, this extra space will be very slightly more ... but the perspective will look nicer due to the longer distance. in real life, usually you'll want a little more space around a person's head, so all these lenses basically are equally well-suited for portraiture. if you want to get closer than head-only—say, face-only or eyes-only—then you'll need to crop, or use an m8, or use the macro-elmar-m 90 mm, or go for an slr camera. my advice is—when choosing a short telephoto lens for leica m, namely 75 mm or 90 mm, then do not base your decision upon minimum focusing distance or maximum magnification but upon focal length, perspective of view, and how well it fits into your existing lens line-up. a 75 mm lens is more kinda longish standard lens while a 90 mm is more like a short telephoto.", "sortedWord": "None", "identifyer": 25314, "year": "2012"}], "name": "orientationL-Forum2012"}