{"interestingcomments": [{"Unnamed: 0": 369551, "autor": "thighslapper", "date": 1411994700000, "content": "What I don't understand is :1. How do you loosen the A screw, which is very tightly fit (and has a cruciform shape on M240) without damaging it ? A plain screwdriver won't do : there is no clearance to catch the screw on the M240. 2. What is the \"arm\" you need to adjust : the part linking the screw to the roller or the seemingly twisted piece uprear on your picture ? I don't mind sending it in to Wetzlar, I'm less at ease with sending the camera + 8 lenses. If you read the rest of the thread above you will see you need a screwdriver that is a very good fit that is slightly bevelled so when you use it at an angle in the camera body it sits flush with the screw head. This takes a few minutes with a file ....... The screw as you say now has a X head which makes it even easier ...... before if the slot was in the wrong orientation it was hard to get enough purchase with a screwdriver. This seems to have appeared quite recently. The screw has some sort of sealant painted on to stop it moving ..... I loosened it with Butanol, but I suspect most other solvents would work. I just used more solvent when done and it sealed again. No need to remove or re-paint. The screw is TIGHT and you need to get everything stable and well aligned before you exert enough torque to loosen it. Once you have done it and realise just how much force to use it will be much easier. Under the screw is an eccentric cam that rotates and has a bent up portion with a slot in it ..... this is so you can put a screwdriver blade or similar in it and gently nudge it clockwise or anticlockwise. One way effectively lengthens the arm with the roller on, and the other way shortens it. You only need very slight movements to move the near point focus a centimetre or two in either direction. As Julian says, the process is one of gradual adjustment to near and far till both are correct. Once you get the hang of it you will realise that 'over-correction' will avoid some of this see-sawing and shorten the process. All this is quite hard to describe .... but once you have done it the process suddenly becomes logical and easy .... albeit rather repetitive and fiddly. Juian has covered virtually everything .... it is all there if you read methodically through the whole thread.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/11/?tab=comments#comment-2680298", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "what i don't understand is :1. how do you loosen the a screw, which is very tightly fit (and has a cruciform shape on m240) without damaging it ? a plain screwdriver won't do : there is no clearance to catch the screw on the m240. 2. what is the \"arm\" you need to adjust : the part linking the screw to the roller or the seemingly twisted piece uprear on your picture ? i don't mind sending it in to wetzlar, i'm less at ease with sending the camera + 8 lenses. if you read the rest of the thread above you will see you need a screwdriver that is a very good fit that is slightly bevelled so when you use it at an angle in the camera body it sits flush with the screw head. this takes a few minutes with a file ....... the screw as you say now has a x head which makes it even easier ...... before if the slot was in the wrong -----> orientation !!!  it was hard to get enough purchase with a screwdriver. this seems to have appeared quite recently. the screw has some sort of sealant painted on to stop it moving ..... i loosened it with butanol, but i suspect most other solvents would work. i just used more solvent when done and it sealed again. no need to remove or re-paint. the screw is tight and you need to get everything stable and well aligned before you exert enough torque to loosen it. once you have done it and realise just how much force to use it will be much easier. under the screw is an eccentric cam that rotates and has a bent up portion with a slot in it ..... this is so you can put a screwdriver blade or similar in it and gently nudge it clockwise or anticlockwise. one way effectively lengthens the arm with the roller on, and the other way shortens it. you only need very slight movements to move the near point focus a centimetre or two in either direction. as julian says, the process is one of gradual adjustment to near and far till both are correct. once you get the hang of it you will realise that 'over-correction' will avoid some of this see-sawing and shorten the process. all this is quite hard to describe .... but once you have done it the process suddenly becomes logical and easy .... albeit rather repetitive and fiddly. juian has covered virtually everything .... it is all there if you read methodically through the whole thread.", "sortedWord": "None", "identifyer": 30848, "year": "2014"}], "name": "orientationL-Forum2014"}