{"interestingcomments": [{"Unnamed: 0": 348024, "autor": "Raymondl", "date": 1604135820000, "content": "26 minutes ago, Steven said: I just had another idea for this thread for a new test. https://topazlabs.com/gigapixel-ai/ Let me know if anyone is interested by this MP comparison and I can get on it. im bored. @Steven This is what I am interested in.. for a give 40MP file (i.e. Leica M10-R) that you don't find aesthetically pleasing, what would you do in post production to making it aesthetically pleasing \"like\" a 24MP file? Obviously it depends on the subject and what's in frame etc.. but I am just curious.. I know the obvious answer is to \"do live photoshop\" when you are taking a photo..so that means less post production work... @Steven found a place where there are sample M10-R + raw download Gallery 1 - https://www.dpreview.com/sample-galleries/7410958786/leica-m10-r-sample-gallery-dpreview-tv Gallery 2 - https://www.dpreview.com/sample-galleries/1022560946/leica-m10-r-sample-gallery Edited October 31, 2020 by Raymondl", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/12/?tab=comments#comment-4071209", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "found a place", "selectorShort": "place", "MarkedSent": "26 minutes ago, steven said: i just had another idea for this thread for a new test. https://topazlabs.com/gigapixel-ai/ let me know if anyone is interested by this mp comparison and i can get on it. im bored. @steven this is what i am interested in.. for a give 40mp file (i.e. leica m10-r) that you don't find aesthetically pleasing, what would you do in post production to making it aesthetically pleasing \"like\" a 24mp file? obviously it depends on the subject and what's in frame etc.. but i am just curious.. i know the obvious answer is to \"do live photoshop\" when you are taking a photo..so that means less post production work... @steven -----> found !!!  -----> a !!!  -----> place !!!  where there are sample m10-r + raw download gallery 1 - https://www.dpreview.com/sample-galleries/7410958786/leica-m10-r-sample-gallery-dpreview-tv gallery 2 - https://www.dpreview.com/sample-galleries/1022560946/leica-m10-r-sample-gallery edited october 31, 2020 by raymondl", "sortedWord": "None", "identifyer": 9123, "year": "2020"}, {"Unnamed: 0": 348028, "autor": "Tom1234", "date": 1604147220000, "content": "3 hours ago, Raymondl said: @Steven This is what I am interested in.. for a give 40MP file (i.e. Leica M10-R) that you don't find aesthetically pleasing, what would you do in post production to making it aesthetically pleasing \"like\" a 24MP file? Obviously it depends on the subject and what's in frame etc.. but I am just curious.. I know the obvious answer is to \"do live photoshop\" when you are taking a photo..so that means less post production work... @Steven found a place where there are sample M10-R + raw download Gallery 1 - https://www.dpreview.com/sample-galleries/7410958786/leica-m10-r-sample-gallery-dpreview-tv Gallery 2 - https://www.dpreview.com/sample-galleries/1022560946/leica-m10-r-sample-gallery Downloaded DNG looks best. Jpg's loose a little color saturation and a little color brightness but not much. On DNG downloads there is slightly brighter rust above the blue baseline of the far ship and the red baseline of the closer ship is a darker red in jpg. White of closest ship is just slightly darker in jpg. Overall: The M10-R pictures are stunning at 40 meg downloaded. The color is just a bit less saturated as the M10's I have seen on the internet but I can not tell for sure until I see 40 meg downloaded m10 files. The M10-R apparently gives a file that you can take anywhere including down to 24meg or with unsharp for some softening. I can only like & love these. I still might choose the M10 for its less detailed rendition and ease of getting that look I like yet I would like to see m10 downloaded 24 meg files first. Website downscaling does NOT do the M10-R files justice. Pretty exotic model in the private downloads. Wow! Edited October 31, 2020 by Tom1234", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/13/?tab=comments#comment-4071319", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "found a place", "selectorShort": "place", "MarkedSent": "3 hours ago, raymondl said: @steven this is what i am interested in.. for a give 40mp file (i.e. leica m10-r) that you don't find aesthetically pleasing, what would you do in post production to making it aesthetically pleasing \"like\" a 24mp file? obviously it depends on the subject and what's in frame etc.. but i am just curious.. i know the obvious answer is to \"do live photoshop\" when you are taking a photo..so that means less post production work... @steven -----> found !!!  -----> a !!!  -----> place !!!  where there are sample m10-r + raw download gallery 1 - https://www.dpreview.com/sample-galleries/7410958786/leica-m10-r-sample-gallery-dpreview-tv gallery 2 - https://www.dpreview.com/sample-galleries/1022560946/leica-m10-r-sample-gallery downloaded dng looks best. jpg's loose a little color saturation and a little color brightness but not much. on dng downloads there is slightly brighter rust above the blue baseline of the far ship and the red baseline of the closer ship is a darker red in jpg. white of closest ship is just slightly darker in jpg. overall: the m10-r pictures are stunning at 40 meg downloaded. the color is just a bit less saturated as the m10's i have seen on the internet but i can not tell for sure until i see 40 meg downloaded m10 files. the m10-r apparently gives a file that you can take anywhere including down to 24meg or with unsharp for some softening. i can only like & love these. i still might choose the m10 for its less detailed rendition and ease of getting that look i like yet i would like to see m10 downloaded 24 meg files first. website downscaling does not do the m10-r files justice. pretty exotic model in the private downloads. wow! edited october 31, 2020 by tom1234", "sortedWord": "None", "identifyer": 9127, "year": "2020"}, {"Unnamed: 0": 348030, "autor": "Steven", "date": 1604148540000, "content": "2 hours ago, Raymondl said: @Steven This is what I am interested in.. for a give 40MP file (i.e. Leica M10-R) that you don't find aesthetically pleasing, what would you do in post production to making it aesthetically pleasing \"like\" a 24MP file? Obviously it depends on the subject and what's in frame etc.. but I am just curious.. I know the obvious answer is to \"do live photoshop\" when you are taking a photo..so that means less post production work... @Steven found a place where there are sample M10-R + raw download Gallery 1 - https://www.dpreview.com/sample-galleries/7410958786/leica-m10-r-sample-gallery-dpreview-tv Gallery 2 - https://www.dpreview.com/sample-galleries/1022560946/leica-m10-r-sample-gallery I understand that you want to make a 40MP file to look like a 24MP file. But with the Topaz Gigapixel test, I am looking at the problem the other way. Before I show you my first result, which I think is mind-blowing, let me give you more details on the context of this test. I am in total agreement with the original post of this thread. 24MP vs 40MP produces different files. It's a matter of taste, and I usually prefer the 24MP files, but that's not always true. Is it possible to make the 40MP files look like 24MP in post ? Some here are showing great results at this. I myself, have not been able to. My recent experience with high MP has been with: - the Canon R5, which I hated, and never managed to make a picture I like with. - the Sony A7RIV, which I hated even more than the R5 - the Leica Q2, which I absolutely love. I like every photo that comes out of it, even before LR. This is the Leica magic. The spectacular lens, paired with a tailor-made sensor for it, and the most beautiful, incomparable, color science I have ever seen. That being said, the files from my Q2 look sharp, clinical, and very modern. In other words, the opposite of the 24MP from my M10P, and I never managed to make them look less modern in LR. So to answer your question of wether or not we can \"degrade\" a 40MP image to make it look more like 24MP? Maybe, probably, but I havent found how yet, at least to match my editing style which as you know is very particular. The reason why I found a passion for this thread is because I hesitate to upgrade to M10R. While I love the files from my Q2, I don't always want that look, and while I understand that the 28 'lux from the Q2 is a modern rendering lens and I could pair the M10R with more classic lenses, I feared that in the upgrade to the M10R, I would end up upgrading to a more modern, sharp look, which I don't look for when I go out to shoot with an M. In parallel to this, I loved this thread because it made me think deeply about megapixels. This might actually deserve a thread on its own, but I'll allow myself to share it here. If you want me to move this to another thread, I totally understand. This is the reason why: I have been in search for the holy grail. The holy grail to me is the perfect hybrid camera. A camera that can do exceptional photos and videos. To be a little more precise, I look for a camera that is compact, that is pleasant to use, that takes incredible photos, that take incredible videos, and that has the best autofocus on the planet. In other words, I want a camera built like an M, compact like a Q, that has the resolution of an SL2, that can take videos like an Arri and all that with the best eye autofocus that exists. I thought it could be the R5 but it definitely was not. I thought it would be the SL2, but I doubt it can be. It could be the future A74, but that doesn't exist yet, and since a few days, I am wondering if this could be the new A7S3. As you see, I have been testing it next to the M, thanks to this thread. Don't get me wrong. I don't think in 2020 there exists a camera that can meet all my needs, because I need a lot. And I know that some cameras are better for things than other. I also enjoy a lot when im home to have a choice. Some days I feel like shooting my Q, some days my M. It's great. But sometimes, I can leave on a trip, or even on a photowalk with just one camera. And I wonder which one is the most versatile to meet all my criteria. I think today, thanks to Topaz, it might be the A7SIII. Let's see why: - Excellent video? I can assure you that paired with the right lenses, the A7S3 is comparable to an Alexa. The image is gorgeous, the codecs are insane, and the camera is very future proof. - Excellent lenses? Although I like some Sony lenses, like the 24 GM and the Zeiss 55 1.8, there are in a lower category as Leica. But as you all know, I have been testing adapted lenses and most of us could not tell a difference with the 35 'lux. So yes, the A7SIII can shoot with the best lenses in the world. Which also take me to my next point. - Compact ? Yes ! paired with a Leica M lens, it fits in the pocket of my jacket. - Enjoyable to use ? No, unfortunately. It will never beat a Leica. Neither the Q nor the M, and im sure not the SL either. - High resolution ? Well, this is where I had most doubts. While 12MP is great for almost everything I do, in 2020 it did feel a bit short. And it prevented me from considering a real Hybrid until this thread, until today. We have proven thanks to this thread that 12MP actually has a beautiful aesthetics. High MP count is particularly useful for two things as far I am concerned. For cropping, and for printing. I personally don't print much, but I do crop with landscape photography. What I am trying to say is that for portraits, as we discussed it extensively, I actually like lower res aesthetics. It's look better on people than 50MP. For landscape, its great to have the resolution. 12 MP is definitely a bit tight. Yesterday, I went out at sunset to shoot with the A7S3 paired with the Voigtlander 35mm 1.4 Nokton MCII M lens. You will notice on the photo below how soft and glowy it looks with the 12MP sensor. I love it. I took a shot which I really loved, but unfortunately, at a resolution of 4240 × 2832 (12MP), I just was not detailed enough for my needs, especially not since I plan to crop it when I edit it. So I downloaded the trial of Gigapixel and run it on the photo, and OH MY GOD. This thing is sorcellerie. I am MINDBLOWN by the results. I transformed the image into a 17024 × 11392 (192MP!!!!) file and its not even the max output. Of course, I understand its not a real 192MP image, but its so incredible and it seems perfect for the occasional need of higher res. This enables me to be confident with a 12MP sensor, or with a 24MP M10 sensor. What I mean is that the M10P is perfect for 90% of my shots, and when I need to raise the resolution, I can ! I know of course that the M10R is not only about resolution. The sensor is better in many other ways. But for those of us that like the M10P's aesthetics, instead of getting an R and trying to modify the image, we can also keep the M10/M10P and bump up the res when needed! Please, look at the result for yourself here and let me know your thoughts.. I mean, this is 12MP image turned into 192 million pixels in less than a minute! https://drive.google.com/drive/folders/1PPaq1vIOVqRfCVBgMPRbIaCzpT6fAX49?usp=sharing", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/13/?tab=comments#comment-4071331", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "found a place", "selectorShort": "place", "MarkedSent": "2 hours ago, raymondl said: @steven this is what i am interested in.. for a give 40mp file (i.e. leica m10-r) that you don't find aesthetically pleasing, what would you do in post production to making it aesthetically pleasing \"like\" a 24mp file? obviously it depends on the subject and what's in frame etc.. but i am just curious.. i know the obvious answer is to \"do live photoshop\" when you are taking a photo..so that means less post production work... @steven -----> found !!!  -----> a !!!  -----> place !!!  where there are sample m10-r + raw download gallery 1 - https://www.dpreview.com/sample-galleries/7410958786/leica-m10-r-sample-gallery-dpreview-tv gallery 2 - https://www.dpreview.com/sample-galleries/1022560946/leica-m10-r-sample-gallery i understand that you want to make -----> a !!!  40mp file to look like -----> a !!!  24mp file. but with the topaz gigapixel test, i am looking at the problem the other way. before i show you my first result, which i think is mind-blowing, let me give you more details on the context of this test. i am in total agreement with the original post of this thread. 24mp vs 40mp produces different files. it's a matter of taste, and i usually prefer the 24mp files, but that's not always true. is it possible to make the 40mp files look like 24mp in post ? some here are showing great results at this. i myself, have not been able to. my recent experience with high mp has been with: - the canon r5, which i hated, and never managed to make a picture i like with. - the sony a7riv, which i hated even more than the r5 - the leica q2, which i absolutely love. i like every photo that comes out of it, even before lr. this is the leica magic. the spectacular lens, paired with a tailor-made sensor for it, and the most beautiful, incomparable, color science i have ever seen. that being said, the files from my q2 look sharp, clinical, and very modern. in other words, the opposite of the 24mp from my m10p, and i never managed to make them look less modern in lr. so to answer your question of wether or not we can \"degrade\" a 40mp image to make it look more like 24mp? maybe, probably, but i havent found how yet, at least to match my editing style which as you know is very particular. the reason why i found a passion for this thread is because i hesitate to upgrade to m10r. while i love the files from my q2, i don't always want that look, and while i understand that the 28 'lux from the q2 is a modern rendering lens and i could pair the m10r with more classic lenses, i feared that in the upgrade to the m10r, i would end up upgrading to a more modern, sharp look, which i don't look for when i go out to shoot with an m. in parallel to this, i loved this thread because it made me think deeply about megapixels. this might actually deserve a thread on its own, but i'll allow myself to share it here. if you want me to move this to another thread, i totally understand. this is the reason why: i have been in search for the holy grail. the holy grail to me is the perfect hybrid camera. a camera that can do exceptional photos and videos. to be a little more precise, i look for a camera that is compact, that is pleasant to use, that takes incredible photos, that take incredible videos, and that has the best autofocus on the planet. in other words, i want a camera built like an m, compact like a q, that has the resolution of an sl2, that can take videos like an arri and all that with the best eye autofocus that exists. i thought it could be the r5 but it definitely was not. i thought it would be the sl2, but i doubt it can be. it could be the future a74, but that doesn't exist yet, and since a few days, i am wondering if this could be the new a7s3. as you see, i have been testing it next to the m, thanks to this thread. don't get me wrong. i don't think in 2020 there exists a camera that can meet all my needs, because i need a lot. and i know that some cameras are better for things than other. i also enjoy a lot when im home to have a choice. some days i feel like shooting my q, some days my m. it's great. but sometimes, i can leave on a trip, or even on a photowalk with just one camera. and i wonder which one is the most versatile to meet all my criteria. i think today, thanks to topaz, it might be the a7siii. let's see why: - excellent video? i can assure you that paired with the right lenses, the a7s3 is comparable to an alexa. the image is gorgeous, the codecs are insane, and the camera is very future proof. - excellent lenses? although i like some sony lenses, like the 24 gm and the zeiss 55 1.8, there are in a lower category as leica. but as you all know, i have been testing adapted lenses and most of us could not tell a difference with the 35 'lux. so yes, the a7siii can shoot with the best lenses in the world. which also take me to my next point. - compact ? yes ! paired with a leica m lens, it fits in the pocket of my jacket. - enjoyable to use ? no, unfortunately. it will never beat a leica. neither the q nor the m, and im sure not the sl either. - high resolution ? well, this is where i had most doubts. while 12mp is great for almost everything i do, in 2020 it did feel a bit short. and it prevented me from considering a real hybrid until this thread, until today. we have proven thanks to this thread that 12mp actually has a beautiful aesthetics. high mp count is particularly useful for two things as far i am concerned. for cropping, and for printing. i personally don't print much, but i do crop with landscape photography. what i am trying to say is that for portraits, as we discussed it extensively, i actually like lower res aesthetics. it's look better on people than 50mp. for landscape, its great to have the resolution. 12 mp is definitely a bit tight. yesterday, i went out at sunset to shoot with the a7s3 paired with the voigtlander 35mm 1.4 nokton mcii m lens. you will notice on the photo below how soft and glowy it looks with the 12mp sensor. i love it. i took a shot which i really loved, but unfortunately, at a resolution of 4240 × 2832 (12mp), i just was not detailed enough for my needs, especially not since i plan to crop it when i edit it. so i downloaded the trial of gigapixel and run it on the photo, and oh my god. this thing is sorcellerie. i am mindblown by the results. i transformed the image into a 17024 × 11392 (192mp!!!!) file and its not even the max output. of course, i understand its not a real 192mp image, but its so incredible and it seems perfect for the occasional need of higher res. this enables me to be confident with a 12mp sensor, or with a 24mp m10 sensor. what i mean is that the m10p is perfect for 90% of my shots, and when i need to raise the resolution, i can ! i know of course that the m10r is not only about resolution. the sensor is better in many other ways. but for those of us that like the m10p's aesthetics, instead of getting an r and trying to modify the image, we can also keep the m10/m10p and bump up the res when needed! please, look at the result for yourself here and let me know your thoughts.. i mean, this is 12mp image turned into 192 million pixels in less than a minute! https://drive.google.com/drive/folders/1ppaq1viovqrfcvbgmprbiaczpt6fax49?usp=sharing", "sortedWord": "None", "identifyer": 9129, "year": "2020"}, {"Unnamed: 0": 419149, "autor": "caissa", "date": 1592947680000, "content": "5 hours ago, SrMi said: [Sarcasm On] Multishot feature is essential as long as it is missing. Once it is here, nobody uses it. [Sarcasm off] That said, there is some progress in that area, and maybe once we understand its limitation, we can put it to some good use. Even though it is 'over-rated,' the discussion is useful. One possible application is to use Multishot for better DR, better colors, and less moire, resize it to 47Mp and replace any troublesome areas (leaves in the wind?) with the single-shot image that accompanies the high-res image. But is the additional effort of Multishot images worth the gains? It is undoubtedly not a point-and-shoot experience :). Agreed, I will rarely use it. But not because I would not like to use it, but because I hate to haul tripods around (and sturdy tripods even less). I use it for things invisible without (e.g. details of wine etiquettes, or bank notes) or for crazy big cityscapes, too big to find a place on my walls. (like Gursky, I love his islands) Or maybe some mountainscapes. Or if I ever went on a polar cruize. Edited June 23, 2020 by caissa", "link": "https://www.l-camera-forum.com/topic/310699-leica-sl2-firmware-20-187-mp-multishot-mode/page/8/?tab=comments#comment-3998239", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "5 hours ago, srmi said: [sarcasm on] multishot feature is essential as long as it is missing. once it is here, nobody uses it. [sarcasm off] that said, there is some progress in that area, and maybe once we understand its limitation, we can put it to some good use. even though it is 'over-rated,' the discussion is useful. one possible application is to use multishot for better dr, better colors, and less moire, resize it to 47mp and replace any troublesome areas (leaves in the wind?) with the single-shot image that accompanies the high-res image. but is the additional effort of multishot images worth the gains? it is undoubtedly not a point-and-shoot experience :). agreed, i will rarely use it. but not because i would not like to use it, but because i hate to haul tripods around (and sturdy tripods even less). i use it for things invisible without (e.g. details of wine etiquettes, or bank notes) or for crazy big cityscapes, too big to -----> find !!!  -----> a !!!  -----> place !!!  on my walls. (like gursky, i love his islands) or maybe some mountainscapes. or if i ever went on a polar cruize. edited june 23, 2020 by caissa", "sortedWord": "None", "identifyer": 32159, "year": "2020"}, {"Unnamed: 0": 419150, "autor": "SrMi", "date": 1592949600000, "content": "10 minutes ago, caissa said: Agreed, I will rarely use it. But not because I would not like to use it, but because I hate to haul tripods around (and sturdy tripods even less). I use it for things invisible without (e.g. details of wine etiquettes, or bank notes) or for crazy big cityscapes, too big to find a place on my walls. (like Gursky, I love his islands) Or maybe some mountainscapes. It would be nice if Leica would implement hand-held Multishot mode like Olympus does :-).", "link": "https://www.l-camera-forum.com/topic/310699-leica-sl2-firmware-20-187-mp-multishot-mode/page/8/?tab=comments#comment-3998258", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "10 minutes ago, caissa said: agreed, i will rarely use it. but not because i would not like to use it, but because i hate to haul tripods around (and sturdy tripods even less). i use it for things invisible without (e.g. details of wine etiquettes, or bank notes) or for crazy big cityscapes, too big to -----> find !!!  -----> a !!!  -----> place !!!  on my walls. (like gursky, i love his islands) or maybe some mountainscapes. it would be nice if leica would implement hand-held multishot mode like olympus does :-).", "sortedWord": "None", "identifyer": 32160, "year": "2020"}], "name": "placeL-Forum2020"}