{"interestingcomments": [{"Unnamed: 0": 345616, "autor": "MikeMyers", "date": 1626200040000, "content": "Lots of tempting, beautiful, and very functional choices, but many of them don't fit what I'm searching for: \"I got to wondering what kind of small case I could get, to protect the camera while it's in my car, and to carry when I'm walking around outside with the camera.\" The most tempting one posted here so far is the \"Billingham Stowaway Pola Shoulder Bag - Black Canvas/Black Leather 500701-01\". I need to do some more searching, to find out the inside size. 'Helge', what you wrote was very encouraging. Does the M10 fit into your bag bottom-plate down, and with at least a 35mm Summilux attached, lens shade reversed? I suspect this might be exactly what I'm looking for. I need to do some more searching, to find out the inside dimensions. Thanks! (I went for a walk a few months ago, and thought I was going to be caught by a shower. I put the camera inside my shirt, and found some place almost dry. Once was enough - even if my M10 is water resistant, my old lenses almost certainly are not.)", "link": "https://www.l-camera-forum.com/topic/322676-looking-for-a-small-travel-bag-for-a-m10-preferably-available-from-amazon-with-bh-being-second-choice/?tab=comments#comment-4237643", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "found some place", "selectorShort": "place", "MarkedSent": "lots of tempting, beautiful, and very functional choices, but many of them don't fit what i'm searching for: \"i got to wondering what kind of small case i could get, to protect the camera while it's in my car, and to carry when i'm walking around outside with the camera.\" the most tempting one posted here so far is the \"billingham stowaway pola shoulder bag - black canvas/black leather 500701-01\". i need to do some more searching, to find out the inside size. 'helge', what you wrote was very encouraging. does the m10 fit into your bag bottom-plate down, and with at least a 35mm summilux attached, lens shade reversed? i suspect this might be exactly what i'm looking for. i need to do some more searching, to find out the inside dimensions. thanks! (i went for a walk a few months ago, and thought i was going to be caught by a shower. i put the camera inside my shirt, and -----> found !!!  -----> some !!!  -----> place !!!  almost dry. once was enough - even if my m10 is water resistant, my old lenses almost certainly are not.)", "sortedWord": "None", "identifyer": 6705, "year": "2021"}, {"Unnamed: 0": 345643, "autor": "stefanusj", "date": 1626266700000, "content": "18 hours ago, MikeMyers said: Lots of tempting, beautiful, and very functional choices, but many of them don't fit what I'm searching for: \"I got to wondering what kind of small case I could get, to protect the camera while it's in my car, and to carry when I'm walking around outside with the camera.\" The most tempting one posted here so far is the \"Billingham Stowaway Pola Shoulder Bag - Black Canvas/Black Leather 500701-01\". I need to do some more searching, to find out the inside size. 'Helge', what you wrote was very encouraging. Does the M10 fit into your bag bottom-plate down, and with at least a 35mm Summilux attached, lens shade reversed? I suspect this might be exactly what I'm looking for. I need to do some more searching, to find out the inside dimensions. Thanks! (I went for a walk a few months ago, and thought I was going to be caught by a shower. I put the camera inside my shirt, and found some place almost dry. Once was enough - even if my M10 is water resistant, my old lenses almost certainly are not.) Billingham Pola... i just add an old Lowepro Divider and velcro sticker to add a divider inside the bag. This bag is surprisingly big. --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/322676-looking-for-a-small-travel-bag-for-a-m10-preferably-available-from-amazon-with-bh-being-second-choice/page/2/?tab=comments#comment-4238097", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "found some place", "selectorShort": "place", "MarkedSent": "18 hours ago, mikemyers said: lots of tempting, beautiful, and very functional choices, but many of them don't fit what i'm searching for: \"i got to wondering what kind of small case i could get, to protect the camera while it's in my car, and to carry when i'm walking around outside with the camera.\" the most tempting one posted here so far is the \"billingham stowaway pola shoulder bag - black canvas/black leather 500701-01\". i need to do some more searching, to find out the inside size. 'helge', what you wrote was very encouraging. does the m10 fit into your bag bottom-plate down, and with at least a 35mm summilux attached, lens shade reversed? i suspect this might be exactly what i'm looking for. i need to do some more searching, to find out the inside dimensions. thanks! (i went for a walk a few months ago, and thought i was going to be caught by a shower. i put the camera inside my shirt, and -----> found !!!  -----> some !!!  -----> place !!!  almost dry. once was enough - even if my m10 is water resistant, my old lenses almost certainly are not.) billingham pola... i just add an old lowepro divider and velcro sticker to add a divider inside the bag. this bag is surprisingly big. --img-- --img-- --img-- ", "sortedWord": "None", "identifyer": 6732, "year": "2021"}, {"Unnamed: 0": 388462, "autor": "Giguchan", "date": 1632937680000, "content": "Me again... I was able to find this place in Germany. Has anyone used them before? Thoughts? good bad? https://fotogoerlitz.de Thanks.", "link": "https://www.l-camera-forum.com/topic/323361-is-it-worth-buying-analogue-in-2021/page/8/?tab=comments#comment-4283732", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "find this place", "selectorShort": "place", "MarkedSent": "me again... i was able to -----> find !!!  -----> this !!!  -----> place !!!  in germany. has anyone used them before? thoughts? good bad? https://fotogoerlitz.de thanks.", "sortedWord": "None", "identifyer": 912, "year": "2021"}, {"Unnamed: 0": 388463, "autor": "logan2z", "date": 1632944580000, "content": "1 hour ago, Giguchan said: Me again... I was able to find this place in Germany. Has anyone used them before? Thoughts? good bad? https://fotogoerlitz.de Thanks. If you're looking for a black MP then take a look at my post from yesterday - Tamarkin Camera (a forum sponsor) has a brand new one - or did as of yesterday.", "link": "https://www.l-camera-forum.com/topic/323361-is-it-worth-buying-analogue-in-2021/page/8/?tab=comments#comment-4283784", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "find this place", "selectorShort": "place", "MarkedSent": "1 hour ago, giguchan said: me again... i was able to -----> find !!!  -----> this !!!  -----> place !!!  in germany. has anyone used them before? thoughts? good bad? https://fotogoerlitz.de thanks. if you're looking for a black mp then take a look at my post from yesterday - tamarkin camera (a forum sponsor) has a brand new one - or did as of yesterday.", "sortedWord": "None", "identifyer": 913, "year": "2021"}, {"Unnamed: 0": 412975, "autor": "shirubadanieru", "date": 1625104680000, "content": " I couldn’t find a place to share and / or discuss LTM lenses only so I’m creating this thread and will be adding pictures here from 1930s Leica lenses (and maybe some more modern LTM lenses). For those of you who also shoot with LTM lenses fell free to contribute to this thread", "link": "https://www.l-camera-forum.com/topic/322311-ltm-lenses-thread/?tab=comments#comment-4229286", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": " i couldn’t -----> find !!!  -----> a !!!  -----> place !!!  to share and / or discuss ltm lenses only so i’m creating this thread and will be adding pictures here from 1930s leica lenses (and maybe some more modern ltm lenses). for those of you who also shoot with ltm lenses fell free to contribute to this thread", "sortedWord": "None", "identifyer": 25827, "year": "2021"}, {"Unnamed: 0": 412984, "autor": "frame-it", "date": 1625118300000, "content": "3 hours ago, shirubadanieru said: I couldn’t find a place to share and / or discuss LTM lenses only so I’m creating this thread and will be adding pictures here from 1930s Leica lenses (and maybe some more modern LTM lenses). For those of you who also shoot with LTM lenses fell free to contribute to this thread 9 pages already here >", "link": "https://www.l-camera-forum.com/topic/322311-ltm-lenses-thread/?tab=comments#comment-4229327", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "3 hours ago, shirubadanieru said: i couldn’t -----> find !!!  -----> a !!!  -----> place !!!  to share and / or discuss ltm lenses only so i’m creating this thread and will be adding pictures here from 1930s leica lenses (and maybe some more modern ltm lenses). for those of you who also shoot with ltm lenses fell free to contribute to this thread 9 pages already here >", "sortedWord": "None", "identifyer": 25836, "year": "2021"}, {"Unnamed: 0": 412993, "autor": "a.noctilux", "date": 1625440920000, "content": "On 7/1/2021 at 3:58 AM, shirubadanieru said: I couldn’t find a place to share and / or discuss LTM lenses only so I’m creating this thread and will be adding pictures here from 1930s Leica lenses (and maybe some more modern LTM lenses). For those of you who also shoot with LTM lenses fell free to contribute to this thread I forgot this thread here for LTM lenses on Leica M this section is called Leica M lenses LTM Leica or not may be in this section for easy search, I think Edited July 4 by a.noctilux", "link": "https://www.l-camera-forum.com/topic/322311-ltm-lenses-thread/?tab=comments#comment-4231944", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "on 7/1/2021 at 3:58 am, shirubadanieru said: i couldn’t -----> find !!!  -----> a !!!  -----> place !!!  to share and / or discuss ltm lenses only so i’m creating this thread and will be adding pictures here from 1930s leica lenses (and maybe some more modern ltm lenses). for those of you who also shoot with ltm lenses fell free to contribute to this thread i forgot this thread here for ltm lenses on leica m this section is called leica m lenses ltm leica or not may be in this section for easy search, i think edited july 4 by a.noctilux", "sortedWord": "None", "identifyer": 25845, "year": "2021"}, {"Unnamed: 0": 433528, "autor": "scrollt", "date": 1635961740000, "content": "My 50mm 1.8 arrived yesterday and it's exactly what I was expecting. 10 years ago (or something) I used a Canon 50mm 1.4, which was absolutely terribly wide open compared to this. I like it and it will be a nice light lens that always finds a place in my bags.", "link": "https://www.l-camera-forum.com/topic/324857-panasonic-lumix-s-18-50-first-impressions/?tab=comments#comment-4306212", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "finds a place", "selectorShort": "place", "MarkedSent": "my 50mm 1.8 arrived yesterday and it's exactly what i was expecting. 10 years ago (or something) i used a canon 50mm 1.4, which was absolutely terribly wide open compared to this. i like it and it will be -----> a !!!  nice light lens that always -----> finds !!!  -----> a !!!  -----> place !!!  in my bags.", "sortedWord": "None", "identifyer": 46721, "year": "2021"}, {"Unnamed: 0": 433529, "autor": "Archiver", "date": 1636019880000, "content": "16 hours ago, scrollt said: My 50mm 1.8 arrived yesterday and it's exactly what I was expecting. 10 years ago (or something) I used a Canon 50mm 1.4, which was absolutely terribly wide open compared to this. I like it and it will be a nice light lens that always finds a place in my bags. The 50/1.8 is giving me some really good portraits and action pictures, it's very pleasing. Looking forward to Panasonic's 35mm f1.8.", "link": "https://www.l-camera-forum.com/topic/324857-panasonic-lumix-s-18-50-first-impressions/?tab=comments#comment-4306653", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "finds a place", "selectorShort": "place", "MarkedSent": "16 hours ago, scrollt said: my 50mm 1.8 arrived yesterday and it's exactly what i was expecting. 10 years ago (or something) i used a canon 50mm 1.4, which was absolutely terribly wide open compared to this. i like it and it will be -----> a !!!  nice light lens that always -----> finds !!!  -----> a !!!  -----> place !!!  in my bags. the 50/1.8 is giving me some really good portraits and action pictures, it's very pleasing. looking forward to panasonic's 35mm f1.8.", "sortedWord": "None", "identifyer": 46722, "year": "2021"}, {"Unnamed: 0": 440056, "autor": "NZDavid", "date": 1623051360000, "content": "Leica, whatever you do, please keep the traditional analog shutter dial on top and aperture ring around the lens! No multifunction controls like the CL. The Q is one of Leica's best selling cameras without a doubt and you have to ask yourself why. My feeling is that the simple, intuitive controls, as well as the excellent IQ, are the reason. The X cameras are also good in this respect but full frame compacts are where the action is now -- and they are likely to continue to be highly sought after. Interchangeable lenses would require a new lens range, but existing optics could also be adapted or modified -- and it may well be worth it. I love my M but my wife and I could find a place for a modified Q as well.", "link": "https://www.l-camera-forum.com/topic/321243-survey-your-wishes-for-future-leica-q-models/page/3/?tab=comments#comment-4215213", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "leica, whatever you do, please keep the traditional analog shutter dial on top and aperture ring around the lens! no multifunction controls like the cl. the q is one of leica's best selling cameras without a doubt and you have to ask yourself why. my feeling is that the simple, intuitive controls, as well as the excellent iq, are the reason. the x cameras are also good in this respect but full frame compacts are where the action is now -- and they are likely to continue to be highly sought after. interchangeable lenses would require a new lens range, but existing optics could also be adapted or modified -- and it may well be worth it. i love my m but my wife and i could -----> find !!!  -----> a !!!  -----> place !!!  for -----> a !!!  modified q as well.", "sortedWord": "None", "identifyer": 53393, "year": "2021"}], "name": "placeL-Forum2021"}