{"interestingcomments": [{"Unnamed: 0": 356112, "autor": "wparsonsgisnet", "date": 1420318380000, "content": "Question: How do I set Auto ISO on the M (type 240)? 1. This may require an update to the firmware. When my camera arrived, it had version 1.0.0.17 installed. This version will only set the ISO when A(uto) is selected for the shutter setting. Also see posting #105, above. 2. If you wish to have auto ISO when setting the shutter speed, for example to 1/180, you must: 3. Update the firmware. I updated to version 2.0.1.7 for this purpose. 4. Click the SET button. You will be positioned at the ISO setting line. 5. Click the INFO button. 6. Dial the ISO settings until you get AUTO. 7. You MUST now set all the settings on the 3 lines below this one, Max ISO, Max Exp, and Auto ISO in M mode, as follows: 8. Use the down arrow (under the INFO button) to go to the next line. Dial the Max ISO setting desired. 9. Use the down arrow to go to the next line. Dial the Max Exposure Time. I used 1/focal length. This causes some work when I use lenses that are not coded. The lens must be selected in the Menu options. 10. Use the down arrow to go to the next line. Dial to select On. 11. Touch the shutter to complete the actions. Edited January 3, 2015 by wparsonsgisnet", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/6/?tab=comments#comment-2740669", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "question: how do i set auto iso on the m (type 240)? 1. this may require an update to the firmware. when my camera arrived, it had version 1.0.0.17 installed. this version will only set the iso when a(uto) is selected for the shutter setting. also see posting #105, above. 2. if you wish to have auto iso when setting the shutter speed, for example to 1/180, you must: 3. update the firmware. i updated to version 2.0.1.7 for this purpose. 4. click the set button. you will be -----> positioned !!!  at the iso setting line. 5. click the info button. 6. dial the iso settings until you get auto. 7. you must now set all the settings on the 3 lines below this one, max iso, max exp, and auto iso in m mode, as follows: 8. use the down arrow (under the info button) to go to the next line. dial the max iso setting desired. 9. use the down arrow to go to the next line. dial the max exposure time. i used 1/focal length. this causes some work when i use lenses that are not coded. the lens must be selected in the menu options. 10. use the down arrow to go to the next line. dial to select on. 11. touch the shutter to complete the actions. edited january 3, 2015 by wparsonsgisnet", "sortedWord": "None", "identifyer": 17278, "year": "2015"}, {"Unnamed: 0": 357558, "autor": "FlashGordonPhotography", "date": 1431161280000, "content": "The rangefinder is fully adjustable. Leica can do it. Or if it's only the infinity that's off then you can do it with a 2mm allen key (2mm hex key). If the rangefinder is falling short of the infinity position then it's a very slight turn toward the lens relese button. If it's overshooting then it's front focusing and it's a slight turn toward the main vf window. If you turn your camera upside down with no lens mounted you'll see the hex nut at the top (bottom if the camera is upside down) just inside the lens mount. Small movements and lots of patience. Personally I find it MUCH easier to calibrate to a point about 15 meters away and then use infinity as a double check rather than trying to calibrate at infinity. If you get the mid or infinity right and there's still something off at other distances only Leica can make the complex adjustments of throw distance and curve on the M240. Gordon Gordon", "link": "https://www.l-camera-forum.com/topic/244454-rangefinder-slightly-off-at-infinity/?tab=comments#comment-2813307", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the rangefinder is fully adjustable. leica can do it. or if it's only the infinity that's off then you can do it with a 2mm allen key (2mm hex key). if the rangefinder is falling short of the infinity -----> position !!!  then it's a very slight turn toward the lens relese button. if it's overshooting then it's front focusing and it's a slight turn toward the main vf window. if you turn your camera upside down with no lens mounted you'll see the hex nut at the top (bottom if the camera is upside down) just inside the lens mount. small movements and lots of patience. personally i find it much easier to calibrate to a point about 15 meters away and then use infinity as a double check rather than trying to calibrate at infinity. if you get the mid or infinity right and there's still something off at other distances only leica can make the complex adjustments of throw distance and curve on the m240. gordon gordon", "sortedWord": "None", "identifyer": 18729, "year": "2015"}, {"Unnamed: 0": 378111, "autor": "Paulus", "date": 1422701520000, "content": "The recent issues with the current CCD sensor notwithstanding, there is a strong demand for CCD sensors in M cameras. My Open Letter to Leica has garnered over 400 signatures by discerning photographers, artists, and general photo enthusiasts. Please Leica, keep CCD alive. —Peter. First of all, thank you for this initiative. Leica will certainly read this and act accordingly. They have listened to this forum many times. Not alway with the expected results but they have a business to attend. Second; I have enjoyed the M9 with ccd very much. Still the decision to go to the M was one of better iso. Not better colours. With the M9 I just hadn't enough light to make the picture I wanted. I also noticed that I did not took so many colour photographs with the M9 because of the limitations I felt, or wasn't able to correct properly ( my fault ) or I did not wanted to spent time on it. With the M 240 I don't feel this problem any more. I took the liberty of comparing some of my shots. I also see a difference in the way I develope my M 240 files. Maybe because it's more flexible. I also notice that I use different colour choises. I do not really know if it's impossible to get the same results/colour, at the same time with the two different camera's because I was never in that position. I do know that my colour choice has changed in time. Maybe because of this camera and its possibilities. See: M 9: Affligem kleur - pauljoostenfotograaf Duik 15 mei 2013 Oostplas. Tilburg. Platform - pauljoostenfotograaf M 240: Saint Michaels Castle \" Sint Michielsgestel\" Brabant - pauljoostenfotograaf Ballonvaart en landing in Moerenburg: \"Trying to catch a Virgin.\" - pauljoostenfotograaf Landscapes around the Baltic Sea. - pauljoostenfotograaf", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/8/?tab=comments#comment-2756413", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the recent issues with the current ccd sensor notwithstanding, there is a strong demand for ccd sensors in m cameras. my open letter to leica has garnered over 400 signatures by discerning photographers, artists, and general photo enthusiasts. please leica, keep ccd alive. —peter. first of all, thank you for this initiative. leica will certainly read this and act accordingly. they have listened to this forum many times. not alway with the expected results but they have a business to attend. second; i have enjoyed the m9 with ccd very much. still the decision to go to the m was one of better iso. not better colours. with the m9 i just hadn't enough light to make the picture i wanted. i also noticed that i did not took so many colour photographs with the m9 because of the limitations i felt, or wasn't able to correct properly ( my fault ) or i did not wanted to spent time on it. with the m 240 i don't feel this problem any more. i took the liberty of comparing some of my shots. i also see a difference in the way i develope my m 240 files. maybe because it's more flexible. i also notice that i use different colour choises. i do not really know if it's impossible to get the same results/colour, at the same time with the two different camera's because i was never in that -----> position !!! . i do know that my colour choice has changed in time. maybe because of this camera and its possibilities. see: m 9: affligem kleur - pauljoostenfotograaf duik 15 mei 2013 oostplas. tilburg. platform - pauljoostenfotograaf m 240: saint michaels castle \" sint michielsgestel\" brabant - pauljoostenfotograaf ballonvaart en landing in moerenburg: \"trying to catch a virgin.\" - pauljoostenfotograaf landscapes around the baltic sea. - pauljoostenfotograaf", "sortedWord": "None", "identifyer": 39427, "year": "2015"}, {"Unnamed: 0": 378182, "autor": "IWC Doppel", "date": 1423212660000, "content": "Obsolete doesn’t equal old. CCD-based digital cameras have been around for 40 years now and for most of that time CCD was deemed the superior imaging technology compared to CMOS. But during the last 15 years it was mostly CMOS technology where all the exciting developments were happening and soon CMOS imagers surpassed their CCD cousins. Now we have a choice of FSI CMOS and BSI CMOS, stacked CMOS sensors are showing a lot of promise, and in the future there may be hybrid sensors using organic layers or quantum dots on top of a CMOS substrate. CCD technology, on the other hand, is rather stagnant these days. Fair point. I do want Leica to differentiate and not simply catch up and follow. One thing that may have driven the appeal of CMOS is clearly price, flexibility/functionality with video EVF etc, and ofcourse power. But none of those really concern me. Leica is in the unique position to focus in areas others can't aftord or justify.", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/11/?tab=comments#comment-2760183", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "obsolete doesn’t equal old. ccd-based digital cameras have been around for 40 years now and for most of that time ccd was deemed the superior imaging technology compared to cmos. but during the last 15 years it was mostly cmos technology where all the exciting developments were happening and soon cmos imagers surpassed their ccd cousins. now we have a choice of fsi cmos and bsi cmos, stacked cmos sensors are showing a lot of promise, and in the future there may be hybrid sensors using organic layers or quantum dots on top of a cmos substrate. ccd technology, on the other hand, is rather stagnant these days. fair point. i do want leica to differentiate and not simply catch up and follow. one thing that may have driven the appeal of cmos is clearly price, flexibility/functionality with video evf etc, and ofcourse power. but none of those really concern me. leica is in the unique -----> position !!!  to focus in areas others can't aftord or justify.", "sortedWord": "None", "identifyer": 39498, "year": "2015"}, {"Unnamed: 0": 380220, "autor": "bla", "date": 1426360560000, "content": "Hi John, the idea is to position the blue or orange bright line exactly on the faulty column on your sensor. Then with -s only the erroneous column will be fixed. So either get the exact coordinates or try with the -s and different columns (2799, 2800, ...) until the blue line is gone. Again, that might be better discussed per email --img--  Good luck and let me know if you solved it. - Arvid", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/5/?tab=comments#comment-2780705", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi john, the idea is to -----> position !!!  the blue or orange bright line exactly on the faulty column on your sensor. then with -s only the erroneous column will be fixed. so either get the exact coordinates or try with the -s and different columns (2799, 2800, ...) until the blue line is gone. again, that might be better discussed per email --img--  good luck and let me know if you solved it. - arvid", "sortedWord": "None", "identifyer": 41608, "year": "2015"}, {"Unnamed: 0": 385921, "autor": "pgk", "date": 1446538980000, "content": "I've always stuck to using an external viewfinder which is approximate nevertheless. 'Accurate' framing - or at least reasonably accurate framing, seems to get better with experience as far as I can determine (based on my experience). So perseverance with an external viewfinder is IMO the way to go - on the M8 you will need a 28mm viewfinder or the latest version 21mm which has the M8 FOV indicated too. I've shot 21mm lenses on the M8 without an external viewfinder using the 'whole' of the visible built in viewfinder view but as I wear glasses this isn't very effective and depends on how repeatably you position your eye every time you look through the viewfinder. Others may have differing experiences though!", "link": "https://www.l-camera-forum.com/topic/252510-leica-m8-21mm-lens/?tab=comments#comment-2919782", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i've always stuck to using an external viewfinder which is approximate nevertheless. 'accurate' framing - or at least reasonably accurate framing, seems to get better with experience as far as i can determine (based on my experience). so perseverance with an external viewfinder is imo the way to go - on the m8 you will need a 28mm viewfinder or the latest version 21mm which has the m8 fov indicated too. i've shot 21mm lenses on the m8 without an external viewfinder using the 'whole' of the visible built in viewfinder view but as i wear glasses this isn't very effective and depends on how repeatably you -----> position !!!  your eye every time you look through the viewfinder. others may have differing experiences though!", "sortedWord": "None", "identifyer": 47327, "year": "2015"}, {"Unnamed: 0": 386064, "autor": "peterjcb", "date": 1441589280000, "content": "I am in your same position. I purchased an MM1 recently and love it but I'll never sell my M8. The crop factor is an advantage with some lenses and when I want to shoot color I'll use the M8.Although it's not FF I find that there is a certain uniqueness to the files that I get out of mine that can't be duplicated with any other camera including my MM1. It's a keeper.", "link": "https://www.l-camera-forum.com/topic/249359-old-m8-owner-worth-keeping-now-that-i-have-a-ff-m/page/2/?tab=comments#comment-2883700", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i am in your same -----> position !!! . i purchased an mm1 recently and love it but i'll never sell my m8. the crop factor is an advantage with some lenses and when i want to shoot color i'll use the m8.although it's not ff i find that there is a certain uniqueness to the files that i get out of mine that can't be duplicated with any other camera including my mm1. it's a keeper.", "sortedWord": "None", "identifyer": 47470, "year": "2015"}, {"Unnamed: 0": 386116, "autor": "tmTm", "date": 1442435940000, "content": "This happened on my M8 as well. I did all the things that were mentioned - with no effect. The shutter was completely stuck. Even using a brand new battery fully charged did not have any effect. After a day having the M8 left beside, I checked again - nothing. Then I remembered that Leica service told me that the camera body frame was broken. I took the body into both hands and \"wrenched\" the body holding in both hands. after two or three \"applications\" the sensor went backing normal position and everything works then. After that occurrance I actuated the camera w/o any problems for more than 5.000 pictures. A repair - if this is your problem - will at least start at 500 € incl. VAT and shipping. Better to go for a second one and use the other as a repository over time. :-) . And don't give up M8! There are circumstances that produce different pictures than the M (240)", "link": "https://www.l-camera-forum.com/topic/250104-drive-fault-did-my-m8-just-turned-into-a-brick/?tab=comments#comment-2889325", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "this happened on my m8 as well. i did all the things that were mentioned - with no effect. the shutter was completely stuck. even using a brand new battery fully charged did not have any effect. after a day having the m8 left beside, i checked again - nothing. then i remembered that leica service told me that the camera body frame was broken. i took the body into both hands and \"wrenched\" the body holding in both hands. after two or three \"applications\" the sensor went backing normal -----> position !!!  and everything works then. after that occurrance i actuated the camera w/o any problems for more than 5.000 pictures. a repair - if this is your problem - will at least start at 500 € incl. vat and shipping. better to go for a second one and use the other as a repository over time. :-) . and don't give up m8! there are circumstances that produce different pictures than the m (240)", "sortedWord": "None", "identifyer": 47522, "year": "2015"}, {"Unnamed: 0": 386117, "autor": "Maxos", "date": 1442444400000, "content": "This happened on my M8 as well. I did all the things that were mentioned - with no effect. The shutter was completely stuck. Even using a brand new battery fully charged did not have any effect. After a day having the M8 left beside, I checked again - nothing. Then I remembered that Leica service told me that the camera body frame was broken. I took the body into both hands and \"wrenched\" the body holding in both hands. after two or three \"applications\" the sensor went backing normal position and everything works then. After that occurrance I actuated the camera w/o any problems for more than 5.000 pictures. A repair - if this is your problem - will at least start at 500 € incl. VAT and shipping. Better to go for a second one and use the other as a repository over time. :-) . And don't give up M8! There are circumstances that produce different pictures than the M (240) Thanks! The \"wrenching\" thing didn't work --img--  I'll try a new battery next, and if not I need to think what I can do.", "link": "https://www.l-camera-forum.com/topic/250104-drive-fault-did-my-m8-just-turned-into-a-brick/?tab=comments#comment-2889429", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "this happened on my m8 as well. i did all the things that were mentioned - with no effect. the shutter was completely stuck. even using a brand new battery fully charged did not have any effect. after a day having the m8 left beside, i checked again - nothing. then i remembered that leica service told me that the camera body frame was broken. i took the body into both hands and \"wrenched\" the body holding in both hands. after two or three \"applications\" the sensor went backing normal -----> position !!!  and everything works then. after that occurrance i actuated the camera w/o any problems for more than 5.000 pictures. a repair - if this is your problem - will at least start at 500 € incl. vat and shipping. better to go for a second one and use the other as a repository over time. :-) . and don't give up m8! there are circumstances that produce different pictures than the m (240) thanks! the \"wrenching\" thing didn't work --img--  i'll try a new battery next, and if not i need to think what i can do.", "sortedWord": "None", "identifyer": 47523, "year": "2015"}, {"Unnamed: 0": 405804, "autor": "james.liam", "date": 1424156520000, "content": "I'm resurrecting this old thread to help clarify matters; I'm at a loss to identify when the Rigid v.I serial #'s goes to v.II. Is there actually any optical difference between the two? Seems some have dual meter/feet measurements engraved while others are only feet; some are engraved 5cm while others 50mm. Also, the later one has the ridges in the scalloped ring in the opposite positions (along the indentation rather than the ridge). I'm a bit unclear how to properly distinguish the two.", "link": "https://www.l-camera-forum.com/topic/189640-summicron-rigid-50mm-version-ii/?tab=comments#comment-2766019", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i'm resurrecting this old thread to help clarify matters; i'm at a loss to identify when the rigid v.i serial #'s goes to v.ii. is there actually any optical difference between the two? seems some have dual meter/feet measurements engraved while others are only feet; some are engraved 5cm while others 50mm. also, the later one has the ridges in the scalloped ring in the opposite -----> positions !!!  (along the indentation rather than the ridge). i'm a bit unclear how to properly distinguish the two.", "sortedWord": "None", "identifyer": 18572, "year": "2015"}, {"Unnamed: 0": 405807, "autor": "james.liam", "date": 1424185920000, "content": "I will pose the question again for anyone out there able to shed light. I'm resurrecting this old thread to help clarify matters; I'm at a loss to identify when the Rigid v.I serial #'s goes to v.II. Is there actually any optical difference between the two? Seems some have dual meter/feet measurements engraved while others are only feet; some are engraved 5cm while others 50mm. Also, the later one has the ridges in the scalloped ring in the opposite positions (along the indentation rather than the ridge). I'm a bit unclear how to properly distinguish the two.", "link": "https://www.l-camera-forum.com/topic/189640-summicron-rigid-50mm-version-ii/?tab=comments#comment-2766207", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i will pose the question again for anyone out there able to shed light. i'm resurrecting this old thread to help clarify matters; i'm at a loss to identify when the rigid v.i serial #'s goes to v.ii. is there actually any optical difference between the two? seems some have dual meter/feet measurements engraved while others are only feet; some are engraved 5cm while others 50mm. also, the later one has the ridges in the scalloped ring in the opposite -----> positions !!!  (along the indentation rather than the ridge). i'm a bit unclear how to properly distinguish the two.", "sortedWord": "None", "identifyer": 18575, "year": "2015"}, {"Unnamed: 0": 405808, "autor": "jdlaing", "date": 1424186400000, "content": "I will pose the question again for anyone out there able to shed light. I'm resurrecting this old thread to help clarify matters; I'm at a loss to identify when the Rigid v.I serial #'s goes to v.II. Is there actually any optical difference between the two? Seems some have dual meter/feet measurements engraved while others are only feet; some are engraved 5cm while others 50mm. Also, the later one has the ridges in the scalloped ring in the opposite positions (along the indentation rather than the ridge). I'm a bit unclear how to properly distinguish the two. http://www.l-camera-forum.com/leica-wiki.en/index.php/Summicron_(II)_f%3D_5_cm_1:2 http://www.l-camera-forum.com/leica-wiki.en/index.php/Summicron_(I)_f%3D_5_cm_1:2", "link": "https://www.l-camera-forum.com/topic/189640-summicron-rigid-50mm-version-ii/?tab=comments#comment-2766213", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i will pose the question again for anyone out there able to shed light. i'm resurrecting this old thread to help clarify matters; i'm at a loss to identify when the rigid v.i serial #'s goes to v.ii. is there actually any optical difference between the two? seems some have dual meter/feet measurements engraved while others are only feet; some are engraved 5cm while others 50mm. also, the later one has the ridges in the scalloped ring in the opposite -----> positions !!!  (along the indentation rather than the ridge). i'm a bit unclear how to properly distinguish the two. http://www.l-camera-forum.com/leica-wiki.en/index.php/summicron_(ii)_f%3d_5_cm_1:2 http://www.l-camera-forum.com/leica-wiki.en/index.php/summicron_(i)_f%3d_5_cm_1:2", "sortedWord": "None", "identifyer": 18576, "year": "2015"}, {"Unnamed: 0": 406506, "autor": "dwild", "date": 1433343660000, "content": "My \"slim\" 43mm filter has an outside diameter of 43.7mm so it sits in from the edge just like you've illustrated in your previous post, Windemonium. That's how the hood still can lock in position. How'd Leica do it with the 35 Summicron and its reversible hood? (I don't own one of those) Will Leica make another slim 43 UV with the correct thread pitch? I always liked the smooth front and never need to stack filters. Thanks again for all the help David", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/?tab=comments#comment-2827142", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "my \"slim\" 43mm filter has an outside diameter of 43.7mm so it sits in from the edge just like you've illustrated in your previous post, windemonium. that's how the hood still can lock in -----> position !!! . how'd leica do it with the 35 summicron and its reversible hood? (i don't own one of those) will leica make another slim 43 uv with the correct thread pitch? i always liked the smooth front and never need to stack filters. thanks again for all the help david", "sortedWord": "None", "identifyer": 19286, "year": "2015"}, {"Unnamed: 0": 406527, "autor": "JMF", "date": 1436831400000, "content": "Well I have to report that the B+W MRC Nano X5-Pro UV 43mm filter I just received does NOT allow the hood to fit -- although it is not as thick as other 43mm filters -- it is the same diameter at the front of the lens. Dang. Really need to find a filter just slightly smaller than the front of the lens with the .75 thread pitch. I know some people don't use lens hoods, but I prefer them -- and filters too. If only Leica would have made the front diameter of the housing just slightly larger than the diameter of their filter (like with the 35 Summicron) OR made a filter just slightly smaller like the early days of the 50 Summilux. Not sure what their thought process was. The search continues... Since I have the same B+W MRC Nano XS-Pro Digital UV 43mm filter and also noticed the problem with the original hood supplied with the 50 lux asph e43, I tried the 12586 hood and it works fine, not likely to snap off so easily. Tried a XOOIM also but it will not stay securely in position. Tried a screw in 43 mm vented hood from Heavystar , it vignets slightly (shows as a stronger fall-off @f1.4). My 2 centavos, JM. Edited July 13, 2015 by jmanivelle", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/2/?tab=comments#comment-2853643", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "well i have to report that the b+w mrc nano x5-pro uv 43mm filter i just received does not allow the hood to fit -- although it is not as thick as other 43mm filters -- it is the same diameter at the front of the lens. dang. really need to find a filter just slightly smaller than the front of the lens with the .75 thread pitch. i know some people don't use lens hoods, but i prefer them -- and filters too. if only leica would have made the front diameter of the housing just slightly larger than the diameter of their filter (like with the 35 summicron) or made a filter just slightly smaller like the early days of the 50 summilux. not sure what their thought process was. the search continues... since i have the same b+w mrc nano xs-pro digital uv 43mm filter and also noticed the problem with the original hood supplied with the 50 lux asph e43, i tried the 12586 hood and it works fine, not likely to snap off so easily. tried a xooim also but it will not stay securely in -----> position !!! . tried a screw in 43 mm vented hood from heavystar , it vignets slightly (shows as a stronger fall-off @f1.4). my 2 centavos, jm. edited july 13, 2015 by jmanivelle", "sortedWord": "None", "identifyer": 19307, "year": "2015"}, {"Unnamed: 0": 411896, "autor": "luigi bertolotti", "date": 1429455120000, "content": "I was hoping if anyone has experience with this lens in comparison to the zeiss 15mm f/2.8. Especially in regards to image quality. My feeling is that there aren't so many around... I am a frequent surfer in the Forum, but don't remember the last time I saw a picture taken with the ZM 15... --img--  with its high price, is into a someway uncomfortable position against the WATE.... Edited April 19, 2015 by luigi bertolotti", "link": "https://www.l-camera-forum.com/topic/242555-voigtlander-15mm-f45-vm-iii/page/3/?tab=comments#comment-2801011", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i was hoping if anyone has experience with this lens in comparison to the zeiss 15mm f/2.8. especially in regards to image quality. my feeling is that there aren't so many around... i am a frequent surfer in the forum, but don't remember the last time i saw a picture taken with the zm 15... --img--  with its high price, is into a someway uncomfortable -----> position !!!  against the wate.... edited april 19, 2015 by luigi bertolotti", "sortedWord": "None", "identifyer": 24740, "year": "2015"}, {"Unnamed: 0": 411897, "autor": "hiepphotog", "date": 1430247240000, "content": "My feeling is that there aren't so many around... I am a frequent surfer in the Forum, but don't remember the last time I saw a picture taken with the ZM 15... --img--  with its high price, is into a someway uncomfortable position against the WATE.... Let's change that shall we? Shooting with its long enough, I would say it's actually sharper than the ZE/ZF 15 in the corners. The good thing about this lens over the WATE is that its field curvature is predictable, very flat until the very corners due to sensor stack thickness. WATE would have the typical wavy, unpredictable field. MM should be the best body for it IMO since its corner performance would be close to what it should be on film. --img--  --img--  --img--  --img--  Edited April 28, 2015 by hiepphotog", "link": "https://www.l-camera-forum.com/topic/242555-voigtlander-15mm-f45-vm-iii/page/3/?tab=comments#comment-2806375", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "my feeling is that there aren't so many around... i am a frequent surfer in the forum, but don't remember the last time i saw a picture taken with the zm 15... --img--  with its high price, is into a someway uncomfortable -----> position !!!  against the wate.... let's change that shall we? shooting with its long enough, i would say it's actually sharper than the ze/zf 15 in the corners. the good thing about this lens over the wate is that its field curvature is predictable, very flat until the very corners due to sensor stack thickness. wate would have the typical wavy, unpredictable field. mm should be the best body for it imo since its corner performance would be close to what it should be on film. --img--  --img--  --img--  --img--  edited april 28, 2015 by hiepphotog", "sortedWord": "None", "identifyer": 24741, "year": "2015"}, {"Unnamed: 0": 411922, "autor": "rscheffler", "date": 1432600380000, "content": "The summary by Richard Clompus earlier in this thread pretty much covers everything, however, having just acquired the vIII and directly compared it against the vII with the camera on a tripod shooting the same scenes with both, in terms of image sharpness, colour, contrast, etc., I don't see a significant difference between the two. Nor any real advantage with respect to these points, for the vIII. Central sharpness is fine, but does fade off a bit towards the edges. My early impression is that f/8 offers best central sharpness but f/11 is best across the frame, giving up a bit of central acutance due to the onset of diffraction. But as mentioned already, colour shift is nonexistent with vIII when used uncoded, and alone is compelling enough of a reason, IMO. I do dislike the larger size and built in hood. I have vI of the 12/5.6 and it is tiny, just like vI of the 15. As expressed by someone earlier, it's a lens I often bring along because it's so tiny, even if used for less than 1% of my images. The 15 vIII will occupy a 'real' position in my kit bag, meaning greater consideration of the benefits to bringing it along. But I do accept that most of the size increase is likely a tradeoff for eliminating the edge colour shift. In any case, considering the price of the new CV, it's a great performer.", "link": "https://www.l-camera-forum.com/topic/242555-voigtlander-15mm-f45-vm-iii/page/5/?tab=comments#comment-2822002", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the summary by richard clompus earlier in this thread pretty much covers everything, however, having just acquired the viii and directly compared it against the vii with the camera on a tripod shooting the same scenes with both, in terms of image sharpness, colour, contrast, etc., i don't see a significant difference between the two. nor any real advantage with respect to these points, for the viii. central sharpness is fine, but does fade off a bit towards the edges. my early impression is that f/8 offers best central sharpness but f/11 is best across the frame, giving up a bit of central acutance due to the onset of diffraction. but as mentioned already, colour shift is nonexistent with viii when used uncoded, and alone is compelling enough of a reason, imo. i do dislike the larger size and built in hood. i have vi of the 12/5.6 and it is tiny, just like vi of the 15. as expressed by someone earlier, it's a lens i often bring along because it's so tiny, even if used for less than 1% of my images. the 15 viii will occupy a 'real' -----> position !!!  in my kit bag, meaning greater consideration of the benefits to bringing it along. but i do accept that most of the size increase is likely a tradeoff for eliminating the edge colour shift. in any case, considering the price of the new cv, it's a great performer.", "sortedWord": "None", "identifyer": 24766, "year": "2015"}, {"Unnamed: 0": 413229, "autor": "helged", "date": 1447786560000, "content": "How much work are you all doing on them in PP? Almost no PP at all. M9 and M240 need - in general - much more post-massaging than the SL images. Sometimes the colours are too poppy for my liking, but that can be mediated, of course. Quite some info can be lifted from the deep shadows, which is a neat option to have. High iso is quite good. All of the above is based on less than 24 hr of shooting, so view this as first impressions. On the hard ware side, the viewfinder is nothing but outstanding, the shutter is smooth, quick and silent. I don't have full control of the exposure options and exposure adjustments yet, but that will come. The joystick works well, but I see that I tend to put the position of the spot metering around, so I need to improve in that one. The body feels solid indeed and it's comfortable to hand-held. I keep the body in the right hand as with the M-bodies (using a wrist strap). No problem.", "link": "https://www.l-camera-forum.com/topic/253192-leica-sl-image-thread-post-your-examples-here/page/3/?tab=comments#comment-2930750", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how much work are you all doing on them in pp? almost no pp at all. m9 and m240 need - in general - much more post-massaging than the sl images. sometimes the colours are too poppy for my liking, but that can be mediated, of course. quite some info can be lifted from the deep shadows, which is a neat option to have. high iso is quite good. all of the above is based on less than 24 hr of shooting, so view this as first impressions. on the hard ware side, the viewfinder is nothing but outstanding, the shutter is smooth, quick and silent. i don't have full control of the exposure options and exposure adjustments yet, but that will come. the joystick works well, but i see that i tend to put the -----> position !!!  of the spot metering around, so i need to improve in that one. the body feels solid indeed and it's comfortable to hand-held. i keep the body in the right hand as with the m-bodies (using a wrist strap). no problem.", "sortedWord": "None", "identifyer": 26101, "year": "2015"}, {"Unnamed: 0": 413412, "autor": "ramarren", "date": 1449430440000, "content": "Godfrey explained clearly how the SL using the T-M adapter handles the WATE and MATE, in each case transferring the 6-bit code of the lens. On the M, all lenses actually have an eight-bit code, with two extra bits derived from the \"frame lug\" on the mount that mechanically selects the frame lines shown. On the M8 (the last time these details were visible) there were separate lookup tables (LUTs) for the corrections of each of the three WATE settings. I suspect the reason that the list of identifiable R lenses on the Ms is rather short has to do with the limited number of possible places available in this LUT name space. In the SL, this may have been fixed. But the fact that the T-M adapter doesn't pay attention to mechanical linkages on the M lenses is not encouraging to those of us who would like to see aperture awareness or auto aperture stop down for R lenses, which requires mechanically activating one of the cams in the R mounts. In R lenses, lens maximum aperture awareness and current aperture setting requires reading the position of two of the cams in the camera. AASD requires controlling the position of the mechanical diaphragm stop-down lever. The M obtains the additional information from the frame line coupling cam, a part of the lens bayonet flange, which there might not be enough room to implement in the thin M Adapter T unit. And the WATE and MATE are the only two lenses for which this information is needed; that seems a lot of trouble (and cost) to go through for two lenses in the entire M line up. The dedicated R Adapter SL unit will have quite a bit more space to work with since it is both larger diameter and nearly 28mm long to provide correct mount registration. And this information is applicable to every 3-cam, R-only, and ROM R lens there is ... that justifies a lot more development effort as the benefits apply to all users of these lenses rather than just users who happen to own one of two particular lenses. I remain hopeful. --img-- ", "link": "https://www.l-camera-forum.com/topic/253192-leica-sl-image-thread-post-your-examples-here/page/12/?tab=comments#comment-2943985", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "godfrey explained clearly how the sl using the t-m adapter handles the wate and mate, in each case transferring the 6-bit code of the lens. on the m, all lenses actually have an eight-bit code, with two extra bits derived from the \"frame lug\" on the mount that mechanically selects the frame lines shown. on the m8 (the last time these details were visible) there were separate lookup tables (luts) for the corrections of each of the three wate settings. i suspect the reason that the list of identifiable r lenses on the ms is rather short has to do with the limited number of possible places available in this lut name space. in the sl, this may have been fixed. but the fact that the t-m adapter doesn't pay attention to mechanical linkages on the m lenses is not encouraging to those of us who would like to see aperture awareness or auto aperture stop down for r lenses, which requires mechanically activating one of the cams in the r mounts. in r lenses, lens maximum aperture awareness and current aperture setting requires reading the -----> position !!!  of two of the cams in the camera. aasd requires controlling the position of the mechanical diaphragm stop-down lever. the m obtains the additional information from the frame line coupling cam, a part of the lens bayonet flange, which there might not be enough room to implement in the thin m adapter t unit. and the wate and mate are the only two lenses for which this information is needed; that seems a lot of trouble (and cost) to go through for two lenses in the entire m line up. the dedicated r adapter sl unit will have quite a bit more space to work with since it is both larger diameter and nearly 28mm long to provide correct mount registration. and this information is applicable to every 3-cam, r-only, and rom r lens there is ... that justifies a lot more development effort as the benefits apply to all users of these lenses rather than just users who happen to own one of two particular lenses. i remain hopeful. --img-- ", "sortedWord": "None", "identifyer": 26294, "year": "2015"}, {"Unnamed: 0": 439139, "autor": "viramati", "date": 1434462300000, "content": "Maybe you should try without IS on as Leica themselves say (see the interview on the Lula website) that the default position is to have it off as it can degrade IQ. Edited June 16, 2015 by viramati", "link": "https://www.l-camera-forum.com/topic/269530-leica-q-the-image-thread/page/3/?tab=comments#comment-2835995", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "maybe you should try without is on as leica themselves say (see the interview on the lula website) that the default -----> position !!!  is to have it off as it can degrade iq. edited june 16, 2015 by viramati", "sortedWord": "None", "identifyer": 52434, "year": "2015"}, {"Unnamed: 0": 439140, "autor": "Daniel_G", "date": 1434462480000, "content": "Maybe you should try without IS on as Leica themselves say (see the interview on the Lula website) that the default position is to have it off as it can degrade IQ. Will do it again tomorrow.", "link": "https://www.l-camera-forum.com/topic/269530-leica-q-the-image-thread/page/3/?tab=comments#comment-2835999", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "maybe you should try without is on as leica themselves say (see the interview on the lula website) that the default -----> position !!!  is to have it off as it can degrade iq. will do it again tomorrow.", "sortedWord": "None", "identifyer": 52435, "year": "2015"}, {"Unnamed: 0": 441433, "autor": "digitalfx", "date": 1435157760000, "content": "I am using Capture One to process the files, seems to work just fine and recognizes all the data from the files. And i see no difference between this and LR on the DNG capture. BUT, and this is the point of my post.....the DNG and JPG files are exactly the same size yet when I go to crop the DNG file there is more room around the picture (more on the sides than top and bottom, and a little more on the top). Originally I though this was a quirky aspect of C1 because it isn't yet set for the Q. When i go to crop the JPG file no added picture shows up. My guess is that C1 is pulling in the full FOV of the camera and the JPG is holding to the advertised 28mm. One other point, I understand the math about cropping and how MPs are left. I think, however, this is somewhat misleading. The depth and 3d characteristics that a better sensor delivers is negated back to a smaller lesser MP sensor because you are cropping. Otherwise, there is no real advance from sensor to sensor in terms of IQ once you start to crop. It sounds like you have selected the crop option. This is exactly how the camera is supposed to work. Make sure you have crop turned off...its the small flat button underneath the shutter speed dial. Pushing it will cycle thru 3 positions. No crop, 35mm crop and 50mm crop. If you see frame lines in the EVF and LCD, you have this engaged which crops the JPEG files and flags the RAW files to start in crop mode. This is normal behavior. Edited June 24, 2015 by digitalfx", "link": "https://www.l-camera-forum.com/topic/246760-28mm-focal-length-but-what-is-the-actual-field-of-view-after-lens-correction/page/2/?tab=comments#comment-2841591", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i am using capture one to process the files, seems to work just fine and recognizes all the data from the files. and i see no difference between this and lr on the dng capture. but, and this is the point of my post.....the dng and jpg files are exactly the same size yet when i go to crop the dng file there is more room around the picture (more on the sides than top and bottom, and a little more on the top). originally i though this was a quirky aspect of c1 because it isn't yet set for the q. when i go to crop the jpg file no added picture shows up. my guess is that c1 is pulling in the full fov of the camera and the jpg is holding to the advertised 28mm. one other point, i understand the math about cropping and how mps are left. i think, however, this is somewhat misleading. the depth and 3d characteristics that a better sensor delivers is negated back to a smaller lesser mp sensor because you are cropping. otherwise, there is no real advance from sensor to sensor in terms of iq once you start to crop. it sounds like you have selected the crop option. this is exactly how the camera is supposed to work. make sure you have crop turned off...its the small flat button underneath the shutter speed dial. pushing it will cycle thru 3 -----> positions !!! . no crop, 35mm crop and 50mm crop. if you see frame lines in the evf and lcd, you have this engaged which crops the jpeg files and flags the raw files to start in crop mode. this is normal behavior. edited june 24, 2015 by digitalfx", "sortedWord": "None", "identifyer": 54780, "year": "2015"}, {"Unnamed: 0": 441656, "autor": "jaapv", "date": 1441174440000, "content": "i know that Raynox is doing good quality converters, there are tele converters like this that multiply for 1.5x i m curios if it will fill full frame lens : http://raynox.co.jp/english/dcr/dcr1541pro/index.htm In the promotional video you can see the extreme vignetting with the camera zoom at wideangle position. I had the same experience with the teleconverter for the Olympus XZ1. It will only fill the frame at the longest focal length. I think a teleconverter for a 28 mm lens would need a soup plate-sized front lens and a huge barrel, otherwise the camera lens will \"see\" the inside of the converter.", "link": "https://www.l-camera-forum.com/topic/248236-lens-converter-tele-for-q/?tab=comments#comment-2880900", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i know that raynox is doing good quality converters, there are tele converters like this that multiply for 1.5x i m curios if it will fill full frame lens : http://raynox.co.jp/english/dcr/dcr1541pro/index.htm in the promotional video you can see the extreme vignetting with the camera zoom at wideangle -----> position !!! . i had the same experience with the teleconverter for the olympus xz1. it will only fill the frame at the longest focal length. i think a teleconverter for a 28 mm lens would need a soup plate-sized front lens and a huge barrel, otherwise the camera lens will \"see\" the inside of the converter.", "sortedWord": "None", "identifyer": 5005, "year": "2015"}, {"Unnamed: 0": 441658, "autor": "leicatraveller", "date": 1441179360000, "content": "In the promotional video you can see the extreme vignetting with the camera zoom at wideangle position. I had the same experience with the teleconverter for the Olympus XZ1. It will only fill the frame at the longest focal length. I think a teleconverter for a 28 mm lens would need a soup plate-sized front lens and a huge barrel, otherwise the camera lens will \"see\" the inside of the converter. yes i m also afraid that it will be a 1kg converter and large like a small dish :-)", "link": "https://www.l-camera-forum.com/topic/248236-lens-converter-tele-for-q/?tab=comments#comment-2880938", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "in the promotional video you can see the extreme vignetting with the camera zoom at wideangle -----> position !!! . i had the same experience with the teleconverter for the olympus xz1. it will only fill the frame at the longest focal length. i think a teleconverter for a 28 mm lens would need a soup plate-sized front lens and a huge barrel, otherwise the camera lens will \"see\" the inside of the converter. yes i m also afraid that it will be a 1kg converter and large like a small dish :-)", "sortedWord": "None", "identifyer": 5007, "year": "2015"}, {"Unnamed: 0": 446558, "autor": "pmagee", "date": 1426464000000, "content": "I just wanted to follow-up quickly on this issue and report that it's been resolved. I contacted Leica in New Jersey by email and they sent the part free of charge to Canada. No instructions were provided and I did find it was a bit tricky to put the part in. Before I could install the new part, the bottom half of the clip was still in the camera. I can't really say that I removed it the best way possible... I forced the part sideways in order to allow it to slide out. The only other way I could think of doing this was cutting the broken part in two. The inside of the X Vario is plastic so I don't really recommend removing the broken pieces like I did, I could have easily damaged the housing of the battery lock. After extracting the broken half from the camera, I put the spring onto the new clip and tried to install it many times before succeeding. The spring tends to fall inside the camera body but I almost lost it outside the body a few times. Make sure you do this in a well lit area, I found it was easiest to lay on the ground and do the work there. I had very thin tweezers that allowed me to pressure fit the spring onto the battery lock and using two pairs of tweezers I managed to hold the battery lock in place and use a second pair to press the new clip into position. I realize that there was perhaps a way to simplify this repair by removing the bottom plate, but I was not sure what that entailed so I chose to do it from the outside. I have to say that you are really proceeding at your own risk when repairing the battery lock!", "link": "https://www.l-camera-forum.com/topic/241159-x-vario-battery-lock-broken/?tab=comments#comment-2781427", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i just wanted to follow-up quickly on this issue and report that it's been resolved. i contacted leica in new jersey by email and they sent the part free of charge to canada. no instructions were provided and i did find it was a bit tricky to put the part in. before i could install the new part, the bottom half of the clip was still in the camera. i can't really say that i removed it the best way possible... i forced the part sideways in order to allow it to slide out. the only other way i could think of doing this was cutting the broken part in two. the inside of the x vario is plastic so i don't really recommend removing the broken pieces like i did, i could have easily damaged the housing of the battery lock. after extracting the broken half from the camera, i put the spring onto the new clip and tried to install it many times before succeeding. the spring tends to fall inside the camera body but i almost lost it outside the body a few times. make sure you do this in a well lit area, i found it was easiest to lay on the ground and do the work there. i had very thin tweezers that allowed me to pressure fit the spring onto the battery lock and using two pairs of tweezers i managed to hold the battery lock in place and use a second pair to press the new clip into -----> position !!! . i realize that there was perhaps a way to simplify this repair by removing the bottom plate, but i was not sure what that entailed so i chose to do it from the outside. i have to say that you are really proceeding at your own risk when repairing the battery lock!", "sortedWord": "None", "identifyer": 10025, "year": "2015"}, {"Unnamed: 0": 448911, "autor": "asiafish", "date": 1450884840000, "content": "I don't necessarily want a new X Vario or Q Vario, if Leica could bring a firmware update that would improve a few things, that would be nice. Like what? DNG only is probably not technically possible on this hardware platform as the JPEG appears to be used for the review. Fixing the \"review off\" feature to actually work would be nice, but that bug has been with us since the X1, so that too is unlikely. Autofocus is likely limited in speed by the hardware, not the software, and is already quite good. What else is there to complain about on these cameras from a firmware perspective? They don't crash, image quality is fantastic. About the only thing I can think of is allowing the video record button to be disabled or customized to a different function (ISO?) and giving the option to customize the down position on the thumb controller. I would love to have AV controlled by that down position on the controller and AE lock with a half press of the shutter release (or vice versa) and to disable the movie record button. After that, the X Vario and X 113 would be absolutely perfect for cameras of their age and size.", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/2/?tab=comments#comment-2954641", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i don't necessarily want a new x vario or q vario, if leica could bring a firmware update that would improve a few things, that would be nice. like what? dng only is probably not technically possible on this hardware platform as the jpeg appears to be used for the review. fixing the \"review off\" feature to actually work would be nice, but that bug has been with us since the x1, so that too is unlikely. autofocus is likely limited in speed by the hardware, not the software, and is already quite good. what else is there to complain about on these cameras from a firmware perspective? they don't crash, image quality is fantastic. about the only thing i can think of is allowing the video record button to be disabled or customized to a different function (iso?) and giving the option to customize the down -----> position !!!  on the thumb controller. i would love to have av controlled by that down position on the controller and ae lock with a half press of the shutter release (or vice versa) and to disable the movie record button. after that, the x vario and x 113 would be absolutely perfect for cameras of their age and size.", "sortedWord": "None", "identifyer": 12400, "year": "2015"}, {"Unnamed: 0": 448912, "autor": "Sho-Bud", "date": 1450901700000, "content": "Like what? DNG only is probably not technically possible on this hardware platform as the JPEG appears to be used for the review. Fixing the \"review off\" feature to actually work would be nice, but that bug has been with us since the X1, so that too is unlikely. Autofocus is likely limited in speed by the hardware, not the software, and is already quite good. What else is there to complain about on these cameras from a firmware perspective? They don't crash, image quality is fantastic. About the only thing I can think of is allowing the video record button to be disabled or customized to a different function (ISO?) and giving the option to customize the down position on the thumb controller. I would love to have AV controlled by that down position on the controller and AE lock with a half press of the shutter release (or vice versa) and to disable the movie record button. After that, the X Vario and X 113 would be absolutely perfect for cameras of their age and size. Leica managed to get some speed improvements on the T, if they good do that for the X Vario as well, that would be nice. If not than it's no problem for me , I'm happy with my X Vario", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/2/?tab=comments#comment-2954833", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "like what? dng only is probably not technically possible on this hardware platform as the jpeg appears to be used for the review. fixing the \"review off\" feature to actually work would be nice, but that bug has been with us since the x1, so that too is unlikely. autofocus is likely limited in speed by the hardware, not the software, and is already quite good. what else is there to complain about on these cameras from a firmware perspective? they don't crash, image quality is fantastic. about the only thing i can think of is allowing the video record button to be disabled or customized to a different function (iso?) and giving the option to customize the down -----> position !!!  on the thumb controller. i would love to have av controlled by that down position on the controller and ae lock with a half press of the shutter release (or vice versa) and to disable the movie record button. after that, the x vario and x 113 would be absolutely perfect for cameras of their age and size. leica managed to get some speed improvements on the t, if they good do that for the x vario as well, that would be nice. if not than it's no problem for me , i'm happy with my x vario", "sortedWord": "None", "identifyer": 12401, "year": "2015"}, {"Unnamed: 0": 448914, "autor": "TMorita", "date": 1450938540000, "content": "tAbout the only thing I can think of is allowing the video record button to be disabled or customized to a different function (ISO?) and giving the option to customize the down position on the thumb controller. Oh geez yes please! I'm always shooting movies unintentionally on the XV.", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/2/?tab=comments#comment-2955025", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "tabout the only thing i can think of is allowing the video record button to be disabled or customized to a different function (iso?) and giving the option to customize the down -----> position !!!  on the thumb controller. oh geez yes please! i'm always shooting movies unintentionally on the xv.", "sortedWord": "None", "identifyer": 12403, "year": "2015"}, {"Unnamed: 0": 449364, "autor": "DwF", "date": 1448233200000, "content": "That's true, and I thought that would be preferable to my Sony EVF (goes with RX1R) where I need to lightly tap the button on-off. It took getting used to that but I did. The nice thing about that system, is that you can keep the LCD from going on whereas with the Visoflex, it changes with your eye position. Visoflex is really nice though! David", "link": "https://www.l-camera-forum.com/topic/253369-how-to-use-visoflex-020-evf-on-x-113/?tab=comments#comment-2934880", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "that's true, and i thought that would be preferable to my sony evf (goes with rx1r) where i need to lightly tap the button on-off. it took getting used to that but i did. the nice thing about that system, is that you can keep the lcd from going on whereas with the visoflex, it changes with your eye -----> position !!! . visoflex is really nice though! david", "sortedWord": "None", "identifyer": 12854, "year": "2015"}, {"Unnamed: 0": 449578, "autor": "asiafish", "date": 1442861220000, "content": "After buying the Q, within 8-12 months the trade in value will be in the 'tank\" -- pretty much like the other X's... Buy it to Use, not trade.. Nope, I did the analysis and a Q won't make my photography any better than what it is now. I already have two 28mm options, the X Vario at widest position and my M-E or M Monochrom with 28/2.8 Elmarit ASPH. Yes the Q handles better and focuses faster than the X113 or X Vario, but not enough better to take the hit selling those cameras and buying the new one, which itself will be superseded and drop in value. When I bought the X it had everything I could want in an autofocus compact except for a built-in EVF and really fast AF. The add-on EVF is a bit of a PITA, but of outstanding quality and while not blazing fast, the AF is fast enough. Today the X113 still pushes all of the right buttons for me, and it probably will for years to come. Ditto the X Vario, its just that I'd rather work around the limitations of the prime lens on the X113 than the slow lens of the X Vario, at least for casual (business) travel. For family vacations I still pack both X cameras, with the X Vario going out for the day, and the X113 coming out in the evening or when I anticipate a lot of time indoors such as a museum day.", "link": "https://www.l-camera-forum.com/topic/250334-leica-x1-too-inexpensive-to-let-go/?tab=comments#comment-2891885", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "after buying the q, within 8-12 months the trade in value will be in the 'tank\" -- pretty much like the other x's... buy it to use, not trade.. nope, i did the analysis and a q won't make my photography any better than what it is now. i already have two 28mm options, the x vario at widest -----> position !!!  and my m-e or m monochrom with 28/2.8 elmarit asph. yes the q handles better and focuses faster than the x113 or x vario, but not enough better to take the hit selling those cameras and buying the new one, which itself will be superseded and drop in value. when i bought the x it had everything i could want in an autofocus compact except for a built-in evf and really fast af. the add-on evf is a bit of a pita, but of outstanding quality and while not blazing fast, the af is fast enough. today the x113 still pushes all of the right buttons for me, and it probably will for years to come. ditto the x vario, its just that i'd rather work around the limitations of the prime lens on the x113 than the slow lens of the x vario, at least for casual (business) travel. for family vacations i still pack both x cameras, with the x vario going out for the day, and the x113 coming out in the evening or when i anticipate a lot of time indoors such as a museum day.", "sortedWord": "None", "identifyer": 13069, "year": "2015"}, {"Unnamed: 0": 449732, "autor": "asiafish", "date": 1439362980000, "content": "I have the X Vario in use with the viewfinder (Olympus version). The X Typ 113 uses the viewfinder of the T. Do you use a viewfinder with the X Typ 113. I was thinking of getting an optical 35 mm viewfinder instead of the rather expensive electronic viewfinder. Thanks Best I use the EVF2 on the X Vario and the Viso on the X113. Both are great, the Viso is better. More than image quality, the thing about the Viso that I like most is the diopter adjustment which is just a bit stiffer and tends to stay in position. That, and the click stops make it easy to reset by feel if it does get nudged. Honestly I think the EVF (either model) makes the respective camera far better.", "link": "https://www.l-camera-forum.com/topic/246265-leica-x-prices-and-values/page/2/?tab=comments#comment-2870322", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i have the x vario in use with the viewfinder (olympus version). the x typ 113 uses the viewfinder of the t. do you use a viewfinder with the x typ 113. i was thinking of getting an optical 35 mm viewfinder instead of the rather expensive electronic viewfinder. thanks best i use the evf2 on the x vario and the viso on the x113. both are great, the viso is better. more than image quality, the thing about the viso that i like most is the diopter adjustment which is just a bit stiffer and tends to stay in -----> position !!! . that, and the click stops make it easy to reset by feel if it does get nudged. honestly i think the evf (either model) makes the respective camera far better.", "sortedWord": "None", "identifyer": 13223, "year": "2015"}, {"Unnamed: 0": 450012, "autor": "erickillinger", "date": 1436476620000, "content": "I've had the large finger loop since the first of the year. Have used it ever since. The other day, I picked up my X Vario while the grip was off to change batteries and my fingers automatically assumed the position the grip \"forces\" them into; I was pleasantly surprised. Also find my shots a lot steadier.", "link": "https://www.l-camera-forum.com/topic/210253-x-vario-finger-loop/page/2/?tab=comments#comment-2850939", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i've had the large finger loop since the first of the year. have used it ever since. the other day, i picked up my x vario while the grip was off to change batteries and my fingers automatically assumed the -----> position !!!  the grip \"forces\" them into; i was pleasantly surprised. also find my shots a lot steadier.", "sortedWord": "None", "identifyer": 13503, "year": "2015"}, {"Unnamed: 0": 450338, "autor": "wda", "date": 1428500940000, "content": "...I used to have an X1 before (sold but I sometimes miss it), and a slightly frustrating thing is that for the few times during a trip when I wanted to hand the camera to someone else to get a picture of myself with my partner - the results were often not so great.... This experience is quite common with any AF camera. My method is to place the temporary photographer and then, from the subject position, manually focus the camera. Next, take the camera to the shooting postion and you return to where you stood to pre-focus the camera. At least you know focusing should be accurate. Framing is another matter. I certainly use that method with my X1.", "link": "https://www.l-camera-forum.com/topic/243377-leica-x-113-is-it-doing-ok-in-fully-automatic-mode-mf-useability/?tab=comments#comment-2794802", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "...i used to have an x1 before (sold but i sometimes miss it), and a slightly frustrating thing is that for the few times during a trip when i wanted to hand the camera to someone else to get a picture of myself with my partner - the results were often not so great.... this experience is quite common with any af camera. my method is to place the temporary photographer and then, from the subject -----> position !!! , manually focus the camera. next, take the camera to the shooting postion and you return to where you stood to pre-focus the camera. at least you know focusing should be accurate. framing is another matter. i certainly use that method with my x1.", "sortedWord": "None", "identifyer": 13831, "year": "2015"}, {"Unnamed: 0": 450645, "autor": "dolina", "date": 1421072640000, "content": "Thanks for the clarification admin. I am coming from the a Canon system so the verbiage of Leica is somewhat different. I am trying to change the focusing point's position of the 113 is my assumption that it is called \"pressure points\" correct? Next, how do I change it from center to where I want it predefined? I have the 113 for less than half a day and reading the manual so I somewhat know how to use the camera.", "link": "https://www.l-camera-forum.com/topic/239758-x-typ-113/?tab=comments#comment-2746058", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks for the clarification admin. i am coming from the a canon system so the verbiage of leica is somewhat different. i am trying to change the focusing point's -----> position !!!  of the 113 is my assumption that it is called \"pressure points\" correct? next, how do i change it from center to where i want it predefined? i have the 113 for less than half a day and reading the manual so i somewhat know how to use the camera.", "sortedWord": "None", "identifyer": 14138, "year": "2015"}, {"Unnamed: 0": 450646, "autor": "Yoki", "date": 1421080260000, "content": "Thanks for the clarification admin. I am coming from the a Canon system so the verbiage of Leica is somewhat different. I am trying to change the focusing point's position of the 113 is my assumption that it is called \"pressure points\" correct? Next, how do I change it from center to where I want it predefined? I have the 113 for less than half a day and reading the manual so I somewhat know how to use the camera. Just press and hold the \"DELETE/FOCUS\" button until the small-red triangles appears on each side of the focus point. Then move the focus point to where you want it to be, using the INFO button (INFO; EV, Flash, Timer..). Make sure that you don't choose the \"Face Detection\" focus. Edited January 12, 2015 by Yoki", "link": "https://www.l-camera-forum.com/topic/239758-x-typ-113/?tab=comments#comment-2746112", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks for the clarification admin. i am coming from the a canon system so the verbiage of leica is somewhat different. i am trying to change the focusing point's -----> position !!!  of the 113 is my assumption that it is called \"pressure points\" correct? next, how do i change it from center to where i want it predefined? i have the 113 for less than half a day and reading the manual so i somewhat know how to use the camera. just press and hold the \"delete/focus\" button until the small-red triangles appears on each side of the focus point. then move the focus point to where you want it to be, using the info button (info; ev, flash, timer..). make sure that you don't choose the \"face detection\" focus. edited january 12, 2015 by yoki", "sortedWord": "None", "identifyer": 14139, "year": "2015"}, {"Unnamed: 0": 450803, "autor": "Keith (M)", "date": 1420456500000, "content": "KeithI do rely upon an EVF and have seen criticisms of the tiny C EVF as not being good. Do you have any views on that? Richard Like Ric, I use the EVF by preference and tend to only use the LCD for awkwardly positioned subjects, particularly in the macro-mode. Even when using spectacles, the EVF gives a clear 100% representation of the view and information that one would see on the LCD. Mostly I use aperture priority mode and the large diameter knurled ring at the base of the lens makes changing aperture very quick and easy. I have never seen or tried the other cameras you have mentioned so cannot compare them with the C. However, I find it hard to envisage a better shirt-pocket/travel camera!", "link": "https://www.l-camera-forum.com/topic/237139-leica-c-images-post-them-here/page/2/?tab=comments#comment-2741636", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "keithi do rely upon an evf and have seen criticisms of the tiny c evf as not being good. do you have any views on that? richard like ric, i use the evf by preference and tend to only use the lcd for awkwardly -----> positioned !!!  subjects, particularly in the macro-mode. even when using spectacles, the evf gives a clear 100% representation of the view and information that one would see on the lcd. mostly i use aperture priority mode and the large diameter knurled ring at the base of the lens makes changing aperture very quick and easy. i have never seen or tried the other cameras you have mentioned so cannot compare them with the c. however, i find it hard to envisage a better shirt-pocket/travel camera!", "sortedWord": "None", "identifyer": 14296, "year": "2015"}, {"Unnamed: 0": 450810, "autor": "Keith (M)", "date": 1420653120000, "content": "Is the EVF on the C 100% coverage? I cannot find that anywhere on the Spec.Richard As per post #33:- Like Ric, I use the EVF by preference and tend to only use the LCD for awkwardly positioned subjects, particularly in the macro-mode. Even when using spectacles, the EVF gives a clear 100% representation of the view and information that one would see on the LCD. Hope that helps!", "link": "https://www.l-camera-forum.com/topic/237139-leica-c-images-post-them-here/page/2/?tab=comments#comment-2743299", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "is the evf on the c 100% coverage? i cannot find that anywhere on the spec.richard as per post #33:- like ric, i use the evf by preference and tend to only use the lcd for awkwardly -----> positioned !!!  subjects, particularly in the macro-mode. even when using spectacles, the evf gives a clear 100% representation of the view and information that one would see on the lcd. hope that helps!", "sortedWord": "None", "identifyer": 14303, "year": "2015"}], "name": "positionL-Forum2015"}