{"interestingcomments": [{"Unnamed: 0": 340251, "autor": "Al_OOF", "date": 1495880940000, "content": "I forgot to point out \"if you put the camera to the extreme side of the bag\", which for me is the best position to take it, but if you keep it in the center the problem is not there", "link": "https://www.l-camera-forum.com/topic/268434-what-bag-for-the-m10/page/9/?tab=comments#comment-3283682", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i forgot to point out \"if you put the camera to the extreme side of the bag\", which for me is the best -----> position !!!  to take it, but if you keep it in the center the problem is not there", "sortedWord": "None", "identifyer": 1318, "year": "2017"}, {"Unnamed: 0": 342281, "autor": "pop", "date": 1486155180000, "content": "I still don't get this at all. Presumably the EVF is from the sensor. .... The Leica patent describing a solid state, digital rangefinder uses in addition to the lens and sensor of the camera two tiny cameras positioned where the two rangefinder windows in the M are. Think of the cameras built into phones. The on-board computer mixes the images from the two small cameras and shifts one to the left or right, depending on the distance set on the main lens.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/5/?tab=comments#comment-3203920", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "i still don't get this at all. presumably the evf is from the sensor. .... the leica patent describing a solid state, digital rangefinder uses in addition to the lens and sensor of the camera two tiny cameras -----> positioned !!!  where the two rangefinder windows in the m are. think of the cameras built into phones. the on-board computer mixes the images from the two small cameras and shifts one to the left or right, depending on the distance set on the main lens.", "sortedWord": "None", "identifyer": 3352, "year": "2017"}, {"Unnamed: 0": 342283, "autor": "Steve Spencer", "date": 1486157280000, "content": "The Leica patent describing a solid state, digital rangefinder uses in addition to the lens and sensor of the camera two tiny cameras positioned where the two rangefinder windows in the M are. Think of the cameras built into phones. The on-board computer mixes the images from the two small cameras and shifts one to the left or right, depending on the distance set on the main lens. Ok, so we are talking about 3 different sensors. The main one for taking the image and one for each of the two cameras. I think we are a long way away from that being implemented and personally I would not be that interested, but that system is at least close to a reimagining of the rangefinder as digital. Still seems overly complex and I can't see how it would be worth it and there are still some very tough issues to solve (how to to interface a mechanical lens with the little camera controlling the rangefinder patch; and how to project the rangefinder patch onto the EVF so that it accurately indicates distance). I can't see how it would be a step forward at all, but maybe I just lack vision.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/5/?tab=comments#comment-3203945", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "the leica patent describing a solid state, digital rangefinder uses in addition to the lens and sensor of the camera two tiny cameras -----> positioned !!!  where the two rangefinder windows in the m are. think of the cameras built into phones. the on-board computer mixes the images from the two small cameras and shifts one to the left or right, depending on the distance set on the main lens. ok, so we are talking about 3 different sensors. the main one for taking the image and one for each of the two cameras. i think we are a long way away from that being implemented and personally i would not be that interested, but that system is at least close to a reimagining of the rangefinder as digital. still seems overly complex and i can't see how it would be worth it and there are still some very tough issues to solve (how to to interface a mechanical lens with the little camera controlling the rangefinder patch; and how to project the rangefinder patch onto the evf so that it accurately indicates distance). i can't see how it would be a step forward at all, but maybe i just lack vision.", "sortedWord": "None", "identifyer": 3354, "year": "2017"}, {"Unnamed: 0": 342288, "autor": "Michael Geschlecht", "date": 1486158420000, "content": "Ok, so we are talking about 3 different sensors. The main one for taking the image and one for each of the two cameras. I think we are a long way away from that being implemented and personally I would not be that interested, but that system is at least close to a reimagining of the rangefinder as digital. Still seems overly complex and I can't see how it would be worth it and there are still some very tough issues to solve (how to to interface a mechanical lens with the little camera controlling the rangefinder patch; and how to project the rangefinder patch onto the EVF so that it accurately indicates distance). I can't see how it would be a step forward at all, but maybe I just lack vision. Hello Steve, It appears that we are looking at a significantly cheaper to build range/viewfinder system which would be coupled with letting Leica move away from the optical/mechanical range/viewfinder which has been both the Hero & the Achillies Heel of the various \"M\" cameras. Both film & digital. Hero because it has allowed Leitz/Leica to be in a somewhat unique position in terms of its market share of the high quality lens business. Achillies Heel because of the need for highly skilled workers who are involved with an expensive technology that is from the First Half of the 20th Century. A technology that is pretty much unrelated to their current direction of development. Best Regards, Michael Edited February 3, 2017 by Michael Geschlecht", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/5/?tab=comments#comment-3203958", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "ok, so we are talking about 3 different sensors. the main one for taking the image and one for each of the two cameras. i think we are a long way away from that being implemented and personally i would not be that interested, but that system is at least close to a reimagining of the rangefinder as digital. still seems overly complex and i can't see how it would be worth it and there are still some very tough issues to solve (how to to interface a mechanical lens with the little camera controlling the rangefinder patch; and how to project the rangefinder patch onto the evf so that it accurately indicates distance). i can't see how it would be a step forward at all, but maybe i just lack vision. hello steve, it appears that we are looking at a significantly cheaper to build range/viewfinder system which would be coupled with letting leica move away from the optical/mechanical range/viewfinder which has been both the hero & the achillies heel of the various \"m\" cameras. both film & digital. hero because it has allowed leitz/leica to be in a somewhat unique -----> position !!!  in terms of its market share of the high quality lens business. achillies heel because of the need for highly skilled workers who are involved with an expensive technology that is from the first half of the 20th century. a technology that is pretty much unrelated to their current direction of development. best regards, michael edited february 3, 2017 by michael geschlecht", "sortedWord": "None", "identifyer": 3359, "year": "2017"}, {"Unnamed: 0": 342292, "autor": "Steve Spencer", "date": 1486181220000, "content": "Hello Steve, It appears that we are looking at a significantly cheaper to build range/viewfinder system which would be coupled with letting Leica move away from the optical/mechanical range/viewfinder which has been both the Hero & the Achillies Heel of the various \"M\" cameras. Both film & digital. Hero because it has allowed Leitz/Leica to be in a somewhat unique position in terms of its market share of the high quality lens business. Achillies Heel because of the need for highly skilled workers who are involved with an expensive technology that is from the First Half of the 20th Century. A technology that is pretty much unrelated to their current direction of development. Best Regards, Michael There are other systems that would let them move away from an optical rangefinder--namely an EVF that they already use in the SL and I can't see how this system would be cheaper than an EVF as an EVF is only one component of it. I can't see how it would be a useful focussing aid over the one's that are already used either. It seems it would be clumsy and its only advantage is that it would mimic the way an optical rangefinder works--but I have a lot of doubts it would really seem all that similar. So, I can't see it happening, but hey maybe I am wrong. Edited February 4, 2017 by Steve Spencer", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/5/?tab=comments#comment-3204084", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hello steve, it appears that we are looking at a significantly cheaper to build range/viewfinder system which would be coupled with letting leica move away from the optical/mechanical range/viewfinder which has been both the hero & the achillies heel of the various \"m\" cameras. both film & digital. hero because it has allowed leitz/leica to be in a somewhat unique -----> position !!!  in terms of its market share of the high quality lens business. achillies heel because of the need for highly skilled workers who are involved with an expensive technology that is from the first half of the 20th century. a technology that is pretty much unrelated to their current direction of development. best regards, michael there are other systems that would let them move away from an optical rangefinder--namely an evf that they already use in the sl and i can't see how this system would be cheaper than an evf as an evf is only one component of it. i can't see how it would be a useful focussing aid over the one's that are already used either. it seems it would be clumsy and its only advantage is that it would mimic the way an optical rangefinder works--but i have a lot of doubts it would really seem all that similar. so, i can't see it happening, but hey maybe i am wrong. edited february 4, 2017 by steve spencer", "sortedWord": "None", "identifyer": 3363, "year": "2017"}, {"Unnamed: 0": 342316, "autor": "Michael Geschlecht", "date": 1486227480000, "content": "The Leica patent describing a solid state, digital rangefinder uses in addition to the lens and sensor of the camera two tiny cameras positioned where the two rangefinder windows in the M are. Think of the cameras built into phones. The on-board computer mixes the images from the two small cameras and shifts one to the left or right, depending on the distance set on the main lens. There are other systems that would let them move away from an optical rangefinder--namely an EVF that they already use in the SL and I can't see how this system would be cheaper than an EVF as an EVF is only one component of it. I can't see how it would be a useful focussing aid over the one's that are already used either. It seems it would be clumsy and its only advantage is that it would mimic the way an optical rangefinder works--but I have a lot of doubts it would really seem all that similar. So, I can't see it happening, but hey maybe I am wrong. Hello Steve, I was thinking more along the lines of what Philipp wrote, which I have quoted just above in this Post. Best Regards, Michael Edited February 4, 2017 by Michael Geschlecht", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/6/?tab=comments#comment-3204541", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "the leica patent describing a solid state, digital rangefinder uses in addition to the lens and sensor of the camera two tiny cameras -----> positioned !!!  where the two rangefinder windows in the m are. think of the cameras built into phones. the on-board computer mixes the images from the two small cameras and shifts one to the left or right, depending on the distance set on the main lens. there are other systems that would let them move away from an optical rangefinder--namely an evf that they already use in the sl and i can't see how this system would be cheaper than an evf as an evf is only one component of it. i can't see how it would be a useful focussing aid over the one's that are already used either. it seems it would be clumsy and its only advantage is that it would mimic the way an optical rangefinder works--but i have a lot of doubts it would really seem all that similar. so, i can't see it happening, but hey maybe i am wrong. hello steve, i was thinking more along the lines of what philipp wrote, which i have quoted just above in this post. best regards, michael edited february 4, 2017 by michael geschlecht", "sortedWord": "None", "identifyer": 3387, "year": "2017"}, {"Unnamed: 0": 342340, "autor": "AandW", "date": 1486841340000, "content": " Since many people don’t seem to use the Focus Button on the front perhaps it could be replaced with a 2 or 3 position lever. (Alternatively there is room for a button and a lever). It could be another throwback to the analogue cameras and about the same size as the Reversing/Rewind Lever. You could either assign a few Drive Modes to the lever or User Profiles. Anyone who misses the drive modes on the On Switch could assign single, continuous and self timer to the lever. I would prefer to use the lever like the 1 and 2 settings on the Sony A7s and quickly select User Profiles or reset to my standard settings after making some adjustments. If you wished, via the User Profiles, the lever could quickly change the A and M settings of the ISO dial.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/8/?tab=comments#comment-3210500", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " since many people don’t seem to use the focus button on the front perhaps it could be replaced with a 2 or 3 -----> position !!!  lever. (alternatively there is room for a button and a lever). it could be another throwback to the analogue cameras and about the same size as the reversing/rewind lever. you could either assign a few drive modes to the lever or user profiles. anyone who misses the drive modes on the on switch could assign single, continuous and self timer to the lever. i would prefer to use the lever like the 1 and 2 settings on the sony a7s and quickly select user profiles or reset to my standard settings after making some adjustments. if you wished, via the user profiles, the lever could quickly change the a and m settings of the iso dial.", "sortedWord": "None", "identifyer": 3411, "year": "2017"}, {"Unnamed: 0": 342341, "autor": "digitalfx", "date": 1486842120000, "content": "Since many people don’t seem to use the Focus Button on the front perhaps it could be replaced with a 2 or 3 position lever. (Alternatively there is room for a button and a lever). It could be another throwback to the analogue cameras and about the same size as the Reversing/Rewind Lever. You could either assign a few Drive Modes to the lever or User Profiles. Anyone who misses the drive modes on the On Switch could assign single, continuous and self timer to the lever. I would prefer to use the lever like the 1 and 2 settings on the Sony A7s and quickly select User Profiles or reset to my standard settings after making some adjustments. If you wished, via the User Profiles, the lever could quickly change the A and M settings of the ISO dial. Its used by everyone who uses R lenses...it cant be eliminated.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/8/?tab=comments#comment-3210517", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "since many people don’t seem to use the focus button on the front perhaps it could be replaced with a 2 or 3 -----> position !!!  lever. (alternatively there is room for a button and a lever). it could be another throwback to the analogue cameras and about the same size as the reversing/rewind lever. you could either assign a few drive modes to the lever or user profiles. anyone who misses the drive modes on the on switch could assign single, continuous and self timer to the lever. i would prefer to use the lever like the 1 and 2 settings on the sony a7s and quickly select user profiles or reset to my standard settings after making some adjustments. if you wished, via the user profiles, the lever could quickly change the a and m settings of the iso dial. its used by everyone who uses r lenses...it cant be eliminated.", "sortedWord": "None", "identifyer": 3412, "year": "2017"}, {"Unnamed: 0": 344921, "autor": "M10 for me", "date": 1502446320000, "content": "I think you do something wrong. Here how I do it (and it works): - Press 3 times the menu button - You see on this side a menu position \"Capture Assistant\" - With the button on the right side of the screen you go up or down to that \"capture assistant\" and you press the middle button - A new menu pops up: Press arrows up or down until you reach \"exposure clipping\". Press the middle button to open - On the top on the screen you see \"Clipping enabled\" is \"On\" - Press the arrow to the right or left to switch to \"Off\" - Then press the middle button so many times until the menu jumps back to the previous page (this happens after pressing 3 times) - Now you see \"Exposure Clipping\" is \"Off\" Same way you turn the Clipping \"On\" again Edited August 11, 2017 by Alex U.", "link": "https://www.l-camera-forum.com/topic/274254-exposure-clipping-wont-turn-off-on-m10/?tab=comments#comment-3334694", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think you do something wrong. here how i do it (and it works): - press 3 times the menu button - you see on this side a menu -----> position !!!  \"capture assistant\" - with the button on the right side of the screen you go up or down to that \"capture assistant\" and you press the middle button - a new menu pops up: press arrows up or down until you reach \"exposure clipping\". press the middle button to open - on the top on the screen you see \"clipping enabled\" is \"on\" - press the arrow to the right or left to switch to \"off\" - then press the middle button so many times until the menu jumps back to the previous page (this happens after pressing 3 times) - now you see \"exposure clipping\" is \"off\" same way you turn the clipping \"on\" again edited august 11, 2017 by alex u.", "sortedWord": "None", "identifyer": 6008, "year": "2017"}, {"Unnamed: 0": 358704, "autor": "asiafish", "date": 1486167480000, "content": "Leica has created a digital version of their M7 film offering. I was fortunate enough to purchase one of these cameras three weeks ago. I put my name on the local wait list even before the camera was announced, but was bumped a couple of positions by higher-priority customers and saw the opportunity to have a camera in hand in time for a planned vacation, so I bit. Shooting Leicas is a major entertainment outlet for me, and I have shot with every mainline production M I can think of, M1, M2, M3, M4, M5, M4-2, M4-P, M6, M6TTL, M7, MP, M-A, M8, M8.2, M9P, Monochrom, M-P240, M246, and M262. Still, the screen-less Leica digital sounded like loads of fun, and did not disappoint. I have had the chance to shoot my M-D for one day at Universal Studios Hollywood and for 8 days in the various attractions in Orlando, Florida. During this time, I averaged 150 frames per day, for a total of just under 1400 images. I shot the camera “naked” of any case or protector for the minimum bulk. I attached the new 35mm/2.0/ASPH/II lens and an E39 UVa and didn’t look back. The camera shoots like an M7. It meters like an M7, focuses like an M7, and uses the same muscle memories for the on/off switch that I developed with my M7. The big difference is not the extra depth, which is truly minimal, but rather the adjustable ISO dial on the back, which you don’t get to leverage on an M7 without changing rolls of film. Having any speed film from 200-6400 ISO at the twist of a dial is very handy. The rest of the body works like an M7, and the bump on the back of the top plate holds your thumb very much like a film winding lever. All in all, an excellent handling design. O.K., there is one tiny new item I need to train myself on, that is the use of the function button and rear control thumb wheel to adjust exposure compensation. Luckily the meter is good enough you don’t need to use it often. The shutter sound is discrete like an M should be, very much like the one in the M262, which has the current best M digital shutter. Several aspects of performance warrant discussion. First and foremost, the image quality is every bit as good as any of the other ‘240 class cameras. The default compressed DNG files are superb and offer lots of flexibility for image editing. The second area worth note is the metering. The pattern used is the ‘240-series “Classic” pattern, which uses reflections off of the central blades of the shutter curtain. Metering reflected off of curtain works very well and quickly, although the metering can occasionally be fooled by high or low-key lighting. The solution is what I term, “nodding the camera”. You simply point the camera down for lower shutter speeds, up for higher shutter speeds, then hold the exposure with a half-press of the shutter release and recompose your final shot. Using this approach, I achieved exposures that were around ½ stop underexposed 98-99% of the time. The slight underexposure is perfect for ensuring you don’t blow out your highlights, and the dynamic range of the sensor and resultant files pulls the details out of the rest of the image and the shadows without issue. The continuous burst buffer is good for 10 shots in a sequence. Battery consumption hovered around 15% per day for an average 150 photos, which extrapolates to 1000 photos on a full charge. These numbers were achieved by turning the camera off between periods of use. I did confirm the hard way, however, that the camera does not have an auto-off, and I would up with a dead battery one morning. I would recommend having a spare charged battery readily available in case you make a similar mistake. The M-D comes with a hard black paint finish over brass. I would have preferred a silver chrome version, and may pick one up in the future if offered, but the black paint chosen for the current version is very durable, with no signs of wear after 9 days in busy amusement parks. This is no MP black lacquer, and your camera will not resemble the Kravitz ‘240 for quite a long time of use. Other than the aforementioned dead battery, the camera was 100% reliable, with no crashes or hang-ups. It wrote every single image I took to SD card without error, something no other M digital I have owned can claim. It really is that good. If I were to make two changes, I would add silver chrome as an option for the top and bottom plates and hardware, and maybe a two-position on/off switch versus the current Off/S/C/Timer. I did overachieve and put the camera into Continuous mode when I wanted Single, but no harm came, and no images or opportunities were lost. Oh, and did I mention it had the cleanest sensor straight out of the box of the 11 digital Ms I’ve purchased since 2006? Not a speck of dust! I did have the chance to share the camera over lunch with a friend named Kevin who has made a career out of photography. He loves his M’s, but also shoots a lot of Canons for digital stills, and other gear for video. I explained the philosophy behind the camera as a reliable tool where you stay focused on your subject and environment to be ready for the next shot, not reviewing the past image. I caught him chimping the ISO dial a few times, and when I commented he said, “you’re right, this will take some getting used to, but it’s a good thing, and I need to get me one of these (M-D).” Kevin supervises a number of other photography professionals, and I would not be surprised to see their department adopting a no-screen shooters challenge as a way of capturing more “decisive moment” images. This, of course, requires equipment that is 100% reliable and predictable, and photographers with the skills to make the most out of the equipment on every image. The M-D is up to the task. So, who should buy this camera? This is a little bit hard to define. The camera is ultra-reliable, produces excellent images, and is totally predictable. It should be durable enough to last for decades. I would expect the batteries and SD cards will be the lifespan-limiting commodities, not the M-D. If you want a “decisive moment” Leica M digital for still images only, and have at least some skill with M cameras, this is an excellent selection, and could be your only M. If you need to work at the limits of M capabilities, lenses wider than 28 or longer than 90 (subjective), shoot macro, hold cameras overhead or away from your eye for perspective or safety,, shoot at f/0.95, or need to capture short video clips, then a ‘240 may be a better tool, but don’t forget the lessons the M-D and prior film M cameras teach us. Great overview, but an M1? You used the no-viewfinder M?", "link": "https://www.l-camera-forum.com/topic/261262-a-few-comments-based-upon-two-outings-with-the-leica-m-d-type-262-camera/page/3/?tab=comments#comment-3204035", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "leica has created a digital version of their m7 film offering. i was fortunate enough to purchase one of these cameras three weeks ago. i put my name on the local wait list even before the camera was announced, but was bumped a couple of -----> positions !!!  by higher-priority customers and saw the opportunity to have a camera in hand in time for a planned vacation, so i bit. shooting leicas is a major entertainment outlet for me, and i have shot with every mainline production m i can think of, m1, m2, m3, m4, m5, m4-2, m4-p, m6, m6ttl, m7, mp, m-a, m8, m8.2, m9p, monochrom, m-p240, m246, and m262. still, the screen-less leica digital sounded like loads of fun, and did not disappoint. i have had the chance to shoot my m-d for one day at universal studios hollywood and for 8 days in the various attractions in orlando, florida. during this time, i averaged 150 frames per day, for a total of just under 1400 images. i shot the camera “naked” of any case or protector for the minimum bulk. i attached the new 35mm/2.0/asph/ii lens and an e39 uva and didn’t look back. the camera shoots like an m7. it meters like an m7, focuses like an m7, and uses the same muscle memories for the on/off switch that i developed with my m7. the big difference is not the extra depth, which is truly minimal, but rather the adjustable iso dial on the back, which you don’t get to leverage on an m7 without changing rolls of film. having any speed film from 200-6400 iso at the twist of a dial is very handy. the rest of the body works like an m7, and the bump on the back of the top plate holds your thumb very much like a film winding lever. all in all, an excellent handling design. o.k., there is one tiny new item i need to train myself on, that is the use of the function button and rear control thumb wheel to adjust exposure compensation. luckily the meter is good enough you don’t need to use it often. the shutter sound is discrete like an m should be, very much like the one in the m262, which has the current best m digital shutter. several aspects of performance warrant discussion. first and foremost, the image quality is every bit as good as any of the other ‘240 class cameras. the default compressed dng files are superb and offer lots of flexibility for image editing. the second area worth note is the metering. the pattern used is the ‘240-series “classic” pattern, which uses reflections off of the central blades of the shutter curtain. metering reflected off of curtain works very well and quickly, although the metering can occasionally be fooled by high or low-key lighting. the solution is what i term, “nodding the camera”. you simply point the camera down for lower shutter speeds, up for higher shutter speeds, then hold the exposure with a half-press of the shutter release and recompose your final shot. using this approach, i achieved exposures that were around ½ stop underexposed 98-99% of the time. the slight underexposure is perfect for ensuring you don’t blow out your highlights, and the dynamic range of the sensor and resultant files pulls the details out of the rest of the image and the shadows without issue. the continuous burst buffer is good for 10 shots in a sequence. battery consumption hovered around 15% per day for an average 150 photos, which extrapolates to 1000 photos on a full charge. these numbers were achieved by turning the camera off between periods of use. i did confirm the hard way, however, that the camera does not have an auto-off, and i would up with a dead battery one morning. i would recommend having a spare charged battery readily available in case you make a similar mistake. the m-d comes with a hard black paint finish over brass. i would have preferred a silver chrome version, and may pick one up in the future if offered, but the black paint chosen for the current version is very durable, with no signs of wear after 9 days in busy amusement parks. this is no mp black lacquer, and your camera will not resemble the kravitz ‘240 for quite a long time of use. other than the aforementioned dead battery, the camera was 100% reliable, with no crashes or hang-ups. it wrote every single image i took to sd card without error, something no other m digital i have owned can claim. it really is that good. if i were to make two changes, i would add silver chrome as an option for the top and bottom plates and hardware, and maybe a two-position on/off switch versus the current off/s/c/timer. i did overachieve and put the camera into continuous mode when i wanted single, but no harm came, and no images or opportunities were lost. oh, and did i mention it had the cleanest sensor straight out of the box of the 11 digital ms i’ve purchased since 2006? not a speck of dust! i did have the chance to share the camera over lunch with a friend named kevin who has made a career out of photography. he loves his m’s, but also shoots a lot of canons for digital stills, and other gear for video. i explained the philosophy behind the camera as a reliable tool where you stay focused on your subject and environment to be ready for the next shot, not reviewing the past image. i caught him chimping the iso dial a few times, and when i commented he said, “you’re right, this will take some getting used to, but it’s a good thing, and i need to get me one of these (m-d).” kevin supervises a number of other photography professionals, and i would not be surprised to see their department adopting a no-screen shooters challenge as a way of capturing more “decisive moment” images. this, of course, requires equipment that is 100% reliable and predictable, and photographers with the skills to make the most out of the equipment on every image. the m-d is up to the task. so, who should buy this camera? this is a little bit hard to define. the camera is ultra-reliable, produces excellent images, and is totally predictable. it should be durable enough to last for decades. i would expect the batteries and sd cards will be the lifespan-limiting commodities, not the m-d. if you want a “decisive moment” leica m digital for still images only, and have at least some skill with m cameras, this is an excellent selection, and could be your only m. if you need to work at the limits of m capabilities, lenses wider than 28 or longer than 90 (subjective), shoot macro, hold cameras overhead or away from your eye for perspective or safety,, shoot at f/0.95, or need to capture short video clips, then a ‘240 may be a better tool, but don’t forget the lessons the m-d and prior film m cameras teach us. great overview, but an m1? you used the no-viewfinder m?", "sortedWord": "None", "identifyer": 19883, "year": "2017"}, {"Unnamed: 0": 359189, "autor": "IkarusJohn", "date": 1485249900000, "content": "Will you still say the same when the SL has 50MP? --img--  The 42MP A7r2 can be used easily handheld thanks to IBIS (in-camera image stabilization). Not to say that hit rates are the same handheld as with a tripod of course but cleaner high isos allow for faster shutter speeds on modern cameras so all in all if there is a limit it cannot be below 42MP IMHO (no experience beyond).Almost certainly, if the experience is no better than the D800E and the A7R. Don't try to misrepresent my position, LCT. I'm not opposed to more MP, provided it works. The one limiting factor to my cameras is not MP, nor does it limit my photography. More critically, I make no claim to know more about the topic than Leica. It is as important to me as the speedometer on my car - actually, less so. Edited January 24, 2017 by IkarusJohn", "link": "https://www.l-camera-forum.com/topic/268389-why-m240-users-will-not-switch-to-m10/page/9/?tab=comments#comment-3195399", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "will you still say the same when the sl has 50mp? --img--  the 42mp a7r2 can be used easily handheld thanks to ibis (in-camera image stabilization). not to say that hit rates are the same handheld as with a tripod of course but cleaner high isos allow for faster shutter speeds on modern cameras so all in all if there is a limit it cannot be below 42mp imho (no experience beyond).almost certainly, if the experience is no better than the d800e and the a7r. don't try to misrepresent my -----> position !!! , lct. i'm not opposed to more mp, provided it works. the one limiting factor to my cameras is not mp, nor does it limit my photography. more critically, i make no claim to know more about the topic than leica. it is as important to me as the speedometer on my car - actually, less so. edited january 24, 2017 by ikarusjohn", "sortedWord": "None", "identifyer": 20371, "year": "2017"}, {"Unnamed: 0": 368337, "autor": "Beena22", "date": 1510216440000, "content": "Proving that you don’t need a massive telephoto lens and 15fps autofocus to shoot wildlife..... --img--  Just a 90mm, a rangefinder.......and a very friendly little fella who stuck around for five minutes hoping for some food whilst I frantically tried to coax him into a better position. Sent from my iPad using Tapatalk", "link": "https://www.l-camera-forum.com/topic/277247-m9-m9-p-m-e-photos-post-them-here/page/3/?tab=comments#comment-3392148", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "proving that you don’t need a massive telephoto lens and 15fps autofocus to shoot wildlife..... --img--  just a 90mm, a rangefinder.......and a very friendly little fella who stuck around for five minutes hoping for some food whilst i frantically tried to coax him into a better -----> position !!! . sent from my ipad using tapatalk", "sortedWord": "None", "identifyer": 29619, "year": "2017"}, {"Unnamed: 0": 369581, "autor": "Rus", "date": 1499988480000, "content": "Thanks for the photo Alex. Glad to see that the wheel is still controlled by the allen key. With regard to the eccentric screw being \"locked\" by glue, I actually wonder if this makes the RF mechanism more robust -- provided that it has been properly calibrated to the standard, of course -- since there is now only one moving part that is likely to slightly shift position through long-term use.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/12/?tab=comments#comment-3315312", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks for the photo alex. glad to see that the wheel is still controlled by the allen key. with regard to the eccentric screw being \"locked\" by glue, i actually wonder if this makes the rf mechanism more robust -- provided that it has been properly calibrated to the standard, of course -- since there is now only one moving part that is likely to slightly shift -----> position !!!  through long-term use.", "sortedWord": "None", "identifyer": 30878, "year": "2017"}, {"Unnamed: 0": 369583, "autor": "jdlaing", "date": 1499989200000, "content": "Thanks for the photo Alex. Glad to see that the wheel is still controlled by the allen key. With regard to the eccentric screw being \"locked\" by glue, I actually wonder if this makes the RF mechanism more robust -- provided that it has been properly calibrated to the standard, of course -- since there is now only one moving part that is likely to slightly shift position through long-term use. See that cam lever? It rotates on the axis of that screw. It would loosen over time with constant turning. Loctite is not good on the screw threads as it is meant to be adjusted. The spot of lacquer just locks it in place from loosening while still being able to be set free for adjustments.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/12/?tab=comments#comment-3315317", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks for the photo alex. glad to see that the wheel is still controlled by the allen key. with regard to the eccentric screw being \"locked\" by glue, i actually wonder if this makes the rf mechanism more robust -- provided that it has been properly calibrated to the standard, of course -- since there is now only one moving part that is likely to slightly shift -----> position !!!  through long-term use. see that cam lever? it rotates on the axis of that screw. it would loosen over time with constant turning. loctite is not good on the screw threads as it is meant to be adjusted. the spot of lacquer just locks it in place from loosening while still being able to be set free for adjustments.", "sortedWord": "None", "identifyer": 30880, "year": "2017"}, {"Unnamed: 0": 373156, "autor": "stephengv", "date": 1507015320000, "content": "I tried the Trekpak with my Pelican 1200 and could not find a layout that worked without the camera sliding around. I went back to the plucked foam and am happy with how protected the camera is. --img--  I tried putting my M240 inside the 1200. I notice that it was hard to close the case when the M240 is in standing position. Have you experience the same? is it safe?", "link": "https://www.l-camera-forum.com/topic/241035-anyone-uses-pelican-1200-for-their-leica-m9-family/page/3/?tab=comments#comment-3369310", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i tried the trekpak with my pelican 1200 and could not find a layout that worked without the camera sliding around. i went back to the plucked foam and am happy with how protected the camera is. --img--  i tried putting my m240 inside the 1200. i notice that it was hard to close the case when the m240 is in standing -----> position !!! . have you experience the same? is it safe?", "sortedWord": "None", "identifyer": 34460, "year": "2017"}, {"Unnamed: 0": 374419, "autor": "jaapv", "date": 1495026120000, "content": " No, the two are linked. It appears to me to be rather impossible to to the one without the other. The position as you formulate it should have been the subject of this discussion from the beginning.", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/8/?tab=comments#comment-3276745", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " no, the two are linked. it appears to me to be rather impossible to to the one without the other. the -----> position !!!  as you formulate it should have been the subject of this discussion from the beginning.", "sortedWord": "None", "identifyer": 35725, "year": "2017"}, {"Unnamed: 0": 374462, "autor": "IkarusJohn", "date": 1495049280000, "content": "Thanks, Jaap, for taking the time to report Leica's position. In my view, this is very poor PR spin. There was no \"miscommunication\" in the 2014 announcement Leica was forced to make (largely by pressure from here, I would surmise). It was clear, unequivocal and Leica continued to sell the CCD based M-E after that announcement. They now seem to be saying a digital M is good for only 5 years before we start paying for the repair of inherent defects (I struggle to see \"goodwill\" when the M9 was sold as a \"camera for life\" - Leica's words, not mine). I can't tell you how much of a relief it isn't that the €1,000 charge is for labour rather than the sensor cost. This is nothing more than spin, and poor spin at that. The worst thing about it is it bears no resemblance to the actual service I get from Leica, and the fantastic products they make. Talk about shooting themselves in the foot!", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/10/?tab=comments#comment-3276974", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks, jaap, for taking the time to report leica's -----> position !!! . in my view, this is very poor pr spin. there was no \"miscommunication\" in the 2014 announcement leica was forced to make (largely by pressure from here, i would surmise). it was clear, unequivocal and leica continued to sell the ccd based m-e after that announcement. they now seem to be saying a digital m is good for only 5 years before we start paying for the repair of inherent defects (i struggle to see \"goodwill\" when the m9 was sold as a \"camera for life\" - leica's words, not mine). i can't tell you how much of a relief it isn't that the €1,000 charge is for labour rather than the sensor cost. this is nothing more than spin, and poor spin at that. the worst thing about it is it bears no resemblance to the actual service i get from leica, and the fantastic products they make. talk about shooting themselves in the foot!", "sortedWord": "None", "identifyer": 35768, "year": "2017"}, {"Unnamed: 0": 374474, "autor": "IkarusJohn", "date": 1495063920000, "content": "The timeline here is interesting: M9 released - 9/9/2009 (discontinued 2013)Monochrom released - May 2012 (discontinued April 2015 with the release of the M(246))M-E released - 2012 (discontinued late 2015)sensor corrosion issues identified - 2014 and Leica (eventually responds with free sensor replacement for 10 years following discontinuance of CCD sensor cameras)Leica replaces sensors with existing, defective CCD sensors until a new sensor was developed in 2016(?)Leica revises offer to 5 years after original purchase, and 1,00 Euro for others from August 2017So, what we have is CCD based cameras being sold (new) by Leica till late 2015, and the original CCD sensor being used as replacements until some time in 2016. At that time, Leica had an unqualified commitment to replace affected sensors at no cost until 10 years after the CCD based cameras were discontinued. That means at least until 2025. Unless I have some of my dates wrong, I'm pretty sure there can be no argument about this. In 2017 (with 8 years left to run on their commitment), Leica changes the rules. This means that a buyer with a 2 year old M-E Monochrom or camera is under some uncertainty. Certainly, Leica will stand by its commitment given back in 2014 to replace the sensor at no cost, but will this endure for the entire 10 years those buyers will have relied upon when they purchased? Or will Leica change the rules again ... It seems to me that CCD based M camera owners have a number of choices (Jaap might like to share his consumer law expertise here - I wouldn't be so bold, but my understanding is that the consumer law in the place of purchase applies, and in any event Germany is quite good on consumer protection). For original M9, M9P and Monochrom purchasers, before the sensor fault was discovered, their rights would seem to lie in the original purchase - assurances of \"camera for life\" and defective goods etc. Most jurisdictions will have reasonably well developed laws on latent defect. In this respect, while Leica's commitment of 2014 is expressed to be a \"goodwill gesture\", it was clearly more than that. It was an offer of compensation to the world at large (owning CCD based M cameras) to settle any potential claims they might have. I have very little doubt that for anyone having the energy, the 2014 commitment by Leica is enforceable against them, despite their latest attempt to re-write the rules. For those who bought after the 2014 commitment, I think the position is stronger. The commitment would be easily identified as a representation which was relied upon by those buyers, and would be enforceable, I would think, against Leica. Then, for that small group (small?) who had their corroded sensors replaced with the same sensor (not the new sensor Leica assures us won't corrode), they are sitting on a time bomb, it seems to me. Theoretically, the replacement sensor is irrelevant, as Leica hasn't really rectified the inherent defect. Now, legal analysis will vary from jurisdiction to jurisdiction, class actions will be available in the US and other jurisdictions will allow them and an energetic lawyer could easily go forum shopping to find the best place to sue. Leica would then be faced with settling those claims as they arose, much like a game of whackamole. But the point, as everyone here has made well, is the damage to the goodwill which has saved Leica in the past. The M9 was the camera which made Leica profitable again, and the cynical ease with which Leica seems to want to walk away from a commitment made to its loyal customers is breathtaking. Much like Jaap, I have passed on my concerns to Leica - no reply yet. It would be a mistake, I think, to let this fester. Cheers John", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/10/?tab=comments#comment-3277158", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the timeline here is interesting: m9 released - 9/9/2009 (discontinued 2013)monochrom released - may 2012 (discontinued april 2015 with the release of the m(246))m-e released - 2012 (discontinued late 2015)sensor corrosion issues identified - 2014 and leica (eventually responds with free sensor replacement for 10 years following discontinuance of ccd sensor cameras)leica replaces sensors with existing, defective ccd sensors until a new sensor was developed in 2016(?)leica revises offer to 5 years after original purchase, and 1,00 euro for others from august 2017so, what we have is ccd based cameras being sold (new) by leica till late 2015, and the original ccd sensor being used as replacements until some time in 2016. at that time, leica had an unqualified commitment to replace affected sensors at no cost until 10 years after the ccd based cameras were discontinued. that means at least until 2025. unless i have some of my dates wrong, i'm pretty sure there can be no argument about this. in 2017 (with 8 years left to run on their commitment), leica changes the rules. this means that a buyer with a 2 year old m-e monochrom or camera is under some uncertainty. certainly, leica will stand by its commitment given back in 2014 to replace the sensor at no cost, but will this endure for the entire 10 years those buyers will have relied upon when they purchased? or will leica change the rules again ... it seems to me that ccd based m camera owners have a number of choices (jaap might like to share his consumer law expertise here - i wouldn't be so bold, but my understanding is that the consumer law in the place of purchase applies, and in any event germany is quite good on consumer protection). for original m9, m9p and monochrom purchasers, before the sensor fault was discovered, their rights would seem to lie in the original purchase - assurances of \"camera for life\" and defective goods etc. most jurisdictions will have reasonably well developed laws on latent defect. in this respect, while leica's commitment of 2014 is expressed to be a \"goodwill gesture\", it was clearly more than that. it was an offer of compensation to the world at large (owning ccd based m cameras) to settle any potential claims they might have. i have very little doubt that for anyone having the energy, the 2014 commitment by leica is enforceable against them, despite their latest attempt to re-write the rules. for those who bought after the 2014 commitment, i think the -----> position !!!  is stronger. the commitment would be easily identified as a representation which was relied upon by those buyers, and would be enforceable, i would think, against leica. then, for that small group (small?) who had their corroded sensors replaced with the same sensor (not the new sensor leica assures us won't corrode), they are sitting on a time bomb, it seems to me. theoretically, the replacement sensor is irrelevant, as leica hasn't really rectified the inherent defect. now, legal analysis will vary from jurisdiction to jurisdiction, class actions will be available in the us and other jurisdictions will allow them and an energetic lawyer could easily go forum shopping to find the best place to sue. leica would then be faced with settling those claims as they arose, much like a game of whackamole. but the point, as everyone here has made well, is the damage to the goodwill which has saved leica in the past. the m9 was the camera which made leica profitable again, and the cynical ease with which leica seems to want to walk away from a commitment made to its loyal customers is breathtaking. much like jaap, i have passed on my concerns to leica - no reply yet. it would be a mistake, i think, to let this fester. cheers john", "sortedWord": "None", "identifyer": 35780, "year": "2017"}, {"Unnamed: 0": 374521, "autor": "pgk", "date": 1495113060000, "content": "What we are discussing here is different. For example, an M9 falling in value slowly, then a big, rapid drop in value when the corrosion problem was found. When Leica announced the 'for life' replacement programme the M9 value increased and more people bought them. Now the value for a first-generation M9 must surely be very low. So the problem is a perception problem? One of yo-yoing values rather than anything else. An M9 with a replaced sensor should not be affected by the fact that Leica will charge for replacement sensors should it? And one with its original sensor which has been checked and found to be ok is probably going to remain OK isn't it? As I said in an earlier post, Leica are in the position to know just how many sensors may have been affected. Perhaps most have now been replaced and what we are now discussing is valuation which as I have said before is irrelevant if you are a user. Cameras are only an investment if pristine and virtually unused or with a provenance which makes them valuable. For the rest of us they are to take photos with. Like cars they take a big value hit at first and then steadily tail off until around 10 years old. The M9 still appears to have a better resale value than most and although I wouldn't mind buying a very cheap one if one came up, I'm a bit doubtful of this happening despite all the suggestions to the contrary.", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/13/?tab=comments#comment-3277527", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what we are discussing here is different. for example, an m9 falling in value slowly, then a big, rapid drop in value when the corrosion problem was found. when leica announced the 'for life' replacement programme the m9 value increased and more people bought them. now the value for a first-generation m9 must surely be very low. so the problem is a perception problem? one of yo-yoing values rather than anything else. an m9 with a replaced sensor should not be affected by the fact that leica will charge for replacement sensors should it? and one with its original sensor which has been checked and found to be ok is probably going to remain ok isn't it? as i said in an earlier post, leica are in the -----> position !!!  to know just how many sensors may have been affected. perhaps most have now been replaced and what we are now discussing is valuation which as i have said before is irrelevant if you are a user. cameras are only an investment if pristine and virtually unused or with a provenance which makes them valuable. for the rest of us they are to take photos with. like cars they take a big value hit at first and then steadily tail off until around 10 years old. the m9 still appears to have a better resale value than most and although i wouldn't mind buying a very cheap one if one came up, i'm a bit doubtful of this happening despite all the suggestions to the contrary.", "sortedWord": "None", "identifyer": 35827, "year": "2017"}, {"Unnamed: 0": 374527, "autor": "Ecar", "date": 1495116540000, "content": "The way I see it, Leica has been trying to get away with it on the cheap by not issuing a recall for all cameras potentially affected from the outset (as happens in other industries when manufacturing defects are identified - and as Leica itself did in the case of the M240 strap lugs issue). Now, I appreciate that such a recall may have brought the company to its knees financially, but at the very least I'd have expected them to honour their initial commitment to replace the faulty sensors as and when required. They have the numbers, and they can build inventory over time to mitigate the financial impact. Particularly so if only a relatively small portion of all sensors suffer from corrosion. If, in addition to sensor corrosion, other problems are identified upon inspection, then it is up to the customer to decide whether to proceed (and pay for the additional repairs) or not. However, if I understand correctly, the flawed rationale now being used to justify the end of the sensor replacement programme goes like \"some of the cameras that we receive for sensor replacement require additional work, which we are not charging to these customers; therefore, we will now charge all customers for the sensor replacement work\". A bit of a shortcut, perhaps, but plainly unacceptable IMO. As I indicated earlier, had this happened a few days earlier, I would not have taken delivery of my M10. But, at the very least, I was able to cancel the purchase of two new lenses that were reserved for me (btw, the dealer, who lost a fairly substantial sale and whose name I won't mention here, is mad at Leica and fully understands my position).", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/13/?tab=comments#comment-3277553", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the way i see it, leica has been trying to get away with it on the cheap by not issuing a recall for all cameras potentially affected from the outset (as happens in other industries when manufacturing defects are identified - and as leica itself did in the case of the m240 strap lugs issue). now, i appreciate that such a recall may have brought the company to its knees financially, but at the very least i'd have expected them to honour their initial commitment to replace the faulty sensors as and when required. they have the numbers, and they can build inventory over time to mitigate the financial impact. particularly so if only a relatively small portion of all sensors suffer from corrosion. if, in addition to sensor corrosion, other problems are identified upon inspection, then it is up to the customer to decide whether to proceed (and pay for the additional repairs) or not. however, if i understand correctly, the flawed rationale now being used to justify the end of the sensor replacement programme goes like \"some of the cameras that we receive for sensor replacement require additional work, which we are not charging to these customers; therefore, we will now charge all customers for the sensor replacement work\". a bit of a shortcut, perhaps, but plainly unacceptable imo. as i indicated earlier, had this happened a few days earlier, i would not have taken delivery of my m10. but, at the very least, i was able to cancel the purchase of two new lenses that were reserved for me (btw, the dealer, who lost a fairly substantial sale and whose name i won't mention here, is mad at leica and fully understands my -----> position !!! ).", "sortedWord": "None", "identifyer": 35833, "year": "2017"}, {"Unnamed: 0": 374596, "autor": "pgk", "date": 1495204560000, "content": "Thank you for your reply great to have found someone here who lived part of my path. ... and like me might be baffled by the similarity of events regarding Kodak and Leica. I know this forum has it origins in Corporate Leica - maybe someone else will come forward and shine a light on events once the dust settles. I think that the fundamental problem here is expectations. An 8 year old design which was discontinued 5 years ago is minimally halfway through its life and in some cases more than. But Leicas last forever, or so many still think, even though a digital camera is an entirely different beast to a mechanical one. And at some point support will cease; I'd like to think at 10 years after production ended. After the indignation has died down some may start to consider the viability of a replacement sensor in an 8 year old camera from Leica's pov, though I'm not sure about this. But at some point Leica will have to withdraw support entirely. Should they continue to offer replacement sensors up until the point at which support ceases? I think that whatever Leica did/does they are going to be criticised and the criticism is about a problem that they did not foresee, and about which they have now done something. I personally fully understand their position. Offering a replacement sensor, full service and full year's warranty is actually a great option, but there's a bottom line. As I own a potentially affected Leica I could be moaning and complaining myself but I'm not. I'd rather have an 8 year old camera restored to full functionality and given a full year's warranty, although I certainly don't relish the cost. On the other hand its still going to be cheaper than buying another M dRF so if I must I will pay and carry on. And all that said, my 'affected' M9 has not developed sensor problems as yet despite being extensively used and used in conditions which might be expected to exacerbate any problems and it may never do so. IMO Leica have been sitting on this problem which is/has undoubtedly cost them a lot, they've developed a solution and have dealt with many cameras for free. As all cameras are now at least 5 years old they've obviously decided its time to call it a day with respect to free replacement - though I suspect that they will be busy for the next few months as a result. They could have handled it better but if they'd delayed and gone with another time frame they would still receive criticism no doubt.", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/16/?tab=comments#comment-3278282", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thank you for your reply great to have found someone here who lived part of my path. ... and like me might be baffled by the similarity of events regarding kodak and leica. i know this forum has it origins in corporate leica - maybe someone else will come forward and shine a light on events once the dust settles. i think that the fundamental problem here is expectations. an 8 year old design which was discontinued 5 years ago is minimally halfway through its life and in some cases more than. but leicas last forever, or so many still think, even though a digital camera is an entirely different beast to a mechanical one. and at some point support will cease; i'd like to think at 10 years after production ended. after the indignation has died down some may start to consider the viability of a replacement sensor in an 8 year old camera from leica's pov, though i'm not sure about this. but at some point leica will have to withdraw support entirely. should they continue to offer replacement sensors up until the point at which support ceases? i think that whatever leica did/does they are going to be criticised and the criticism is about a problem that they did not foresee, and about which they have now done something. i personally fully understand their -----> position !!! . offering a replacement sensor, full service and full year's warranty is actually a great option, but there's a bottom line. as i own a potentially affected leica i could be moaning and complaining myself but i'm not. i'd rather have an 8 year old camera restored to full functionality and given a full year's warranty, although i certainly don't relish the cost. on the other hand its still going to be cheaper than buying another m drf so if i must i will pay and carry on. and all that said, my 'affected' m9 has not developed sensor problems as yet despite being extensively used and used in conditions which might be expected to exacerbate any problems and it may never do so. imo leica have been sitting on this problem which is/has undoubtedly cost them a lot, they've developed a solution and have dealt with many cameras for free. as all cameras are now at least 5 years old they've obviously decided its time to call it a day with respect to free replacement - though i suspect that they will be busy for the next few months as a result. they could have handled it better but if they'd delayed and gone with another time frame they would still receive criticism no doubt.", "sortedWord": "None", "identifyer": 35902, "year": "2017"}, {"Unnamed: 0": 382502, "autor": "Dougg", "date": 1508743200000, "content": "Perspective depends only on relative positions of the camera and subject... For pleasing portraits, a distance of about 5 or 6 feet is a good choice, though closer or farther can suit different face shapes. Farther minimizes the size of the nose but shows the ears more, for instance. So, having chosen a subject distance, choose a focal length to get the framing you wish. Longer focal length for tight portraits like your first sample. Wider for a waist-up framing, and even wider for full length portraits. This seems to be a productive way to think about it! --img--  Doug", "link": "https://www.l-camera-forum.com/topic/278045-portrait-lens-for-m8/?tab=comments#comment-3380628", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "perspective depends only on relative -----> positions !!!  of the camera and subject... for pleasing portraits, a distance of about 5 or 6 feet is a good choice, though closer or farther can suit different face shapes. farther minimizes the size of the nose but shows the ears more, for instance. so, having chosen a subject distance, choose a focal length to get the framing you wish. longer focal length for tight portraits like your first sample. wider for a waist-up framing, and even wider for full length portraits. this seems to be a productive way to think about it! --img--  doug", "sortedWord": "None", "identifyer": 43901, "year": "2017"}, {"Unnamed: 0": 382504, "autor": "freemindghost", "date": 1508751180000, "content": "Perspective depends only on relative positions of the camera and subject... For pleasing portraits, a distance of about 5 or 6 feet is a good choice, though closer or farther can suit different face shapes. Farther minimizes the size of the nose but shows the ears more, for instance. So, having chosen a subject distance, choose a focal length to get the framing you wish. Longer focal length for tight portraits like your first sample. Wider for a waist-up framing, and even wider for full length portraits. This seems to be a productive way to think about it! --img--  Doug Yes you‘re right about the perspektiv. I think i have lend an longer focal lens to tried it out. Maybe its an nice way for my an my m8 or i have to use my 5D fot this kinds of portraits of face pictures. 5 or 6 feed, this should be, 1,5m -1,8 m is mostly to far for me. „If is not good enought , your are not close enought“ Gesendet von iPhone mit Tapatalk", "link": "https://www.l-camera-forum.com/topic/278045-portrait-lens-for-m8/?tab=comments#comment-3380681", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "perspective depends only on relative -----> positions !!!  of the camera and subject... for pleasing portraits, a distance of about 5 or 6 feet is a good choice, though closer or farther can suit different face shapes. farther minimizes the size of the nose but shows the ears more, for instance. so, having chosen a subject distance, choose a focal length to get the framing you wish. longer focal length for tight portraits like your first sample. wider for a waist-up framing, and even wider for full length portraits. this seems to be a productive way to think about it! --img--  doug yes you‘re right about the perspektiv. i think i have lend an longer focal lens to tried it out. maybe its an nice way for my an my m8 or i have to use my 5d fot this kinds of portraits of face pictures. 5 or 6 feed, this should be, 1,5m -1,8 m is mostly to far for me. „if is not good enought , your are not close enought“ gesendet von iphone mit tapatalk", "sortedWord": "None", "identifyer": 43903, "year": "2017"}, {"Unnamed: 0": 382979, "autor": "JohnAS", "date": 1505573160000, "content": " Pulled my M8 out of its' box after being in there for a long while. Charged up my two old batteries. One afternoon, one of the batteries, that was showing \"2 bars\" on the battery charge level, died mid-wind. No battery display. Turning the camera off and on gave a little peep, with no display. Putting in the other battery gave me the dreaded \"drive blocked\" message. What to do? Visual inspection of the shutter showed that it looked ok, but was not fully cocked. Send it to Leica? Bang it and see if it'll continue cocking with the good battery? The \"banging\" it a bit with the palm of my hand did nothing, despite what others suggested on this forum on posted-long-ago messages. Mark Norton's \"Anatomy of an M8\" was incredibly helpful; (it is on this site) as it showed what the insides of the camera was like. So, armed with one of my (expensive) screwdrivers, I removed the 5 screws holding the plastic plate on the bottom of the camera (take the bottom cover off). The cocking lever was shown to be ALMOST fully cocked, and the cocking cam was at it's highest (thus, least torque) position. A little push with a flat bladed screwdriver on the bearing shaft that rides on the cam enabled the shutter to finish the cocking procedure. Screws put back in place, and the camera is functioning very well. Two new batteries ordered, and the \"dud\" marked so it is not used in the camera. Now, I do some delicate metalworking for another hobby of mine, so have good tools, and know how to use them, but I think anyone who has some top-quality (German, in my case) screwdrivers and a clean environment should be ok - just think before you poke. Camera now seems fine, and it's a pleasure to use again. Why did I leave it in its' box for so long??? Edited September 16, 2017 by JohnAS", "link": "https://www.l-camera-forum.com/topic/276917-bad-battery-and-drive-blocked-a-simple-fix/?tab=comments#comment-3360243", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " pulled my m8 out of its' box after being in there for a long while. charged up my two old batteries. one afternoon, one of the batteries, that was showing \"2 bars\" on the battery charge level, died mid-wind. no battery display. turning the camera off and on gave a little peep, with no display. putting in the other battery gave me the dreaded \"drive blocked\" message. what to do? visual inspection of the shutter showed that it looked ok, but was not fully cocked. send it to leica? bang it and see if it'll continue cocking with the good battery? the \"banging\" it a bit with the palm of my hand did nothing, despite what others suggested on this forum on posted-long-ago messages. mark norton's \"anatomy of an m8\" was incredibly helpful; (it is on this site) as it showed what the insides of the camera was like. so, armed with one of my (expensive) screwdrivers, i removed the 5 screws holding the plastic plate on the bottom of the camera (take the bottom cover off). the cocking lever was shown to be almost fully cocked, and the cocking cam was at it's highest (thus, least torque) -----> position !!! . a little push with a flat bladed screwdriver on the bearing shaft that rides on the cam enabled the shutter to finish the cocking procedure. screws put back in place, and the camera is functioning very well. two new batteries ordered, and the \"dud\" marked so it is not used in the camera. now, i do some delicate metalworking for another hobby of mine, so have good tools, and know how to use them, but i think anyone who has some top-quality (german, in my case) screwdrivers and a clean environment should be ok - just think before you poke. camera now seems fine, and it's a pleasure to use again. why did i leave it in its' box for so long??? edited september 16, 2017 by johnas", "sortedWord": "None", "identifyer": 44379, "year": "2017"}, {"Unnamed: 0": 382985, "autor": "Ernstk", "date": 1512125100000, "content": " I had the same issue with my M8. Sent it to Wetzlar and they repaired the shutter, realigned viewfinder, recalibrated the sensor position and did a general service. It came back like new and running very smoothly. Ernst", "link": "https://www.l-camera-forum.com/topic/276917-bad-battery-and-drive-blocked-a-simple-fix/?tab=comments#comment-3408113", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " i had the same issue with my m8. sent it to wetzlar and they repaired the shutter, realigned viewfinder, recalibrated the sensor -----> position !!!  and did a general service. it came back like new and running very smoothly. ernst", "sortedWord": "None", "identifyer": 44385, "year": "2017"}, {"Unnamed: 0": 383819, "autor": "tobey bilek", "date": 1491465720000, "content": "24 mm lens which on APS H is field of view of 32 mm. 35/135 is one position, 50/75 another , 28/90 another. Always There are no 135 frames on M8, so the 24 shows with 35.", "link": "https://www.l-camera-forum.com/topic/271087-m8-vf-full-view-corresponds-to/?tab=comments#comment-3249267", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "24 mm lens which on aps h is field of view of 32 mm. 35/135 is one -----> position !!! , 50/75 another , 28/90 another. always there are no 135 frames on m8, so the 24 shows with 35.", "sortedWord": "None", "identifyer": 45220, "year": "2017"}, {"Unnamed: 0": 384343, "autor": "roshuu", "date": 1484655780000, "content": "Check it out - the picture is as if shaken but time was 1/180, focal length 40 mm made from a stable position ... It is rather not the fault of the filter? --img--  Edited January 17, 2017 by roshuu", "link": "https://www.l-camera-forum.com/topic/267617-voigtlander-40-14-with-e43-uv-ir/?tab=comments#comment-3188097", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "check it out - the picture is as if shaken but time was 1/180, focal length 40 mm made from a stable -----> position !!!  ... it is rather not the fault of the filter? --img--  edited january 17, 2017 by roshuu", "sortedWord": "None", "identifyer": 45745, "year": "2017"}, {"Unnamed: 0": 391362, "autor": "wattsy", "date": 1504467960000, "content": " I seem to recall that Keith Mercer had a problem with a bent pin inside the shutter release of his M7 which was possibly caused by a soft release being pushed against it. I think it's the pin that stops the release in the 'off' position.", "link": "https://www.l-camera-forum.com/topic/275842-i-burnt-through-my-shutter-cloth/page/4/?tab=comments#comment-3351126", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " i seem to recall that keith mercer had a problem with a bent pin inside the shutter release of his m7 which was possibly caused by a soft release being pushed against it. i think it's the pin that stops the release in the 'off' -----> position !!! .", "sortedWord": "None", "identifyer": 3819, "year": "2017"}, {"Unnamed: 0": 391365, "autor": "wlaidlaw", "date": 1504507620000, "content": "Thanks Ian, I will bear that in mind when putting my M7 into a bag or packing in luggage. However I suspect Keith's feeling that this may also have been a Friday/Monday camera may be nearer the truth. My original M7 was one of those and having been through a year of pain with a Monday/Friday Leicaflex SL2, I gave up far quicker with my first M7 and changed it for a Contax G2, where I could also get the lenses at cost, as a Contax beta tester. One of the faults on my original M7 was that the camera would not turn off, with the switch collar stuck firmly in the on position. I never used that camera with a soft release, so it rather looks as if this is a weak area. In that my \"new\" M7 is a 2002 vintage and has obviously been back to the factory, as it has the optical DX reader, I am hoping that all its faults have been ironed out. Wilson", "link": "https://www.l-camera-forum.com/topic/275842-i-burnt-through-my-shutter-cloth/page/4/?tab=comments#comment-3351376", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks ian, i will bear that in mind when putting my m7 into a bag or packing in luggage. however i suspect keith's feeling that this may also have been a friday/monday camera may be nearer the truth. my original m7 was one of those and having been through a year of pain with a monday/friday leicaflex sl2, i gave up far quicker with my first m7 and changed it for a contax g2, where i could also get the lenses at cost, as a contax beta tester. one of the faults on my original m7 was that the camera would not turn off, with the switch collar stuck firmly in the on -----> position !!! . i never used that camera with a soft release, so it rather looks as if this is a weak area. in that my \"new\" m7 is a 2002 vintage and has obviously been back to the factory, as it has the optical dx reader, i am hoping that all its faults have been ironed out. wilson", "sortedWord": "None", "identifyer": 3822, "year": "2017"}, {"Unnamed: 0": 399556, "autor": "lik", "date": 1514589180000, "content": "@dkmoore and others - about how the blur changes: The following is done with CSF at 2.3, 4.something and something close to 6. Seriously - it's a nightmare to keep the focusing in its position while turning the aperture ring in order to stay in focus. Tribute to tradition... --img--  And thanks to my model who didn't lose patience ... --img--  Anyway - therefore I cannot say more exactly which aperture it was in the end. But maybe it gives an idea of the change in blur. That afternoon the sea as a background was best I could find. So my conclusion: In some cases it's really interesting to stop down. In others to shot wide open. For my part I learnt that I should try all option as much as it is possible to do. --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/13/?tab=comments#comment-3428234", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "@dkmoore and others - about how the blur changes: the following is done with csf at 2.3, 4.something and something close to 6. seriously - it's a nightmare to keep the focusing in its -----> position !!!  while turning the aperture ring in order to stay in focus. tribute to tradition... --img--  and thanks to my model who didn't lose patience ... --img--  anyway - therefore i cannot say more exactly which aperture it was in the end. but maybe it gives an idea of the change in blur. that afternoon the sea as a background was best i could find. so my conclusion: in some cases it's really interesting to stop down. in others to shot wide open. for my part i learnt that i should try all option as much as it is possible to do. --img-- --img-- --img-- ", "sortedWord": "None", "identifyer": 12236, "year": "2017"}, {"Unnamed: 0": 404186, "autor": "Guest )-(", "date": 1503898140000, "content": "Thanks all. Looking back at the occasions it happened, it does always seem to be with the sun just outside the frame in similar positions to the examples above. I'll try that test Adan mentioned (thanks) and take a closer look at everything. I don't mind some flare if I'm being careless or risky but am disappointed at the frequency I've seen so far from what's a relatively new lens to me. I may have to rethink the hood I use if it's going to happen so often, maybe the Cron v4 hood might fare better. It's certainly a type of flare that most often kills the frame whatever the cause.", "link": "https://www.l-camera-forum.com/topic/215282-35mm-f2-summicron-asph-flaring-issues/?tab=comments#comment-3346485", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "thanks all. looking back at the occasions it happened, it does always seem to be with the sun just outside the frame in similar -----> positions !!!  to the examples above. i'll try that test adan mentioned (thanks) and take a closer look at everything. i don't mind some flare if i'm being careless or risky but am disappointed at the frequency i've seen so far from what's a relatively new lens to me. i may have to rethink the hood i use if it's going to happen so often, maybe the cron v4 hood might fare better. it's certainly a type of flare that most often kills the frame whatever the cause.", "sortedWord": "None", "identifyer": 16946, "year": "2017"}, {"Unnamed: 0": 404188, "autor": "Leicaiste", "date": 1503906960000, "content": " I had some flare with the 35/2 Asph. with sun positioned just outside of the frame. That is when an EVF beats a rangefinder. [emoji6]", "link": "https://www.l-camera-forum.com/topic/215282-35mm-f2-summicron-asph-flaring-issues/page/2/?tab=comments#comment-3346537", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": " i had some flare with the 35/2 asph. with sun -----> positioned !!!  just outside of the frame. that is when an evf beats a rangefinder. [emoji6]", "sortedWord": "None", "identifyer": 16948, "year": "2017"}, {"Unnamed: 0": 404191, "autor": "Ko.Fe.", "date": 1503929880000, "content": "Thanks all. Looking back at the occasions it happened, it does always seem to be with the sun just outside the frame in similar positions to the examples above. I'll try that test Adan mentioned (thanks) and take a closer look at everything. I don't mind some flare if I'm being careless or risky but am disappointed at the frequency I've seen so far from what's a relatively new lens to me. I may have to rethink the hood I use if it's going to happen so often, maybe the Cron v4 hood might fare better. It's certainly a type of flare that most often kills the frame whatever the cause. I don't have flare problems with Summarit-M 35 2.5. Both 2.5 and 2.4 are aspherical. Mine is great on bw darkroom prints. The only bad thing I could say about this lens, it has distortions, but in real life photography it never been an issue. --img-- ", "link": "https://www.l-camera-forum.com/topic/215282-35mm-f2-summicron-asph-flaring-issues/page/2/?tab=comments#comment-3346737", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "thanks all. looking back at the occasions it happened, it does always seem to be with the sun just outside the frame in similar -----> positions !!!  to the examples above. i'll try that test adan mentioned (thanks) and take a closer look at everything. i don't mind some flare if i'm being careless or risky but am disappointed at the frequency i've seen so far from what's a relatively new lens to me. i may have to rethink the hood i use if it's going to happen so often, maybe the cron v4 hood might fare better. it's certainly a type of flare that most often kills the frame whatever the cause. i don't have flare problems with summarit-m 35 2.5. both 2.5 and 2.4 are aspherical. mine is great on bw darkroom prints. the only bad thing i could say about this lens, it has distortions, but in real life photography it never been an issue. --img-- ", "sortedWord": "None", "identifyer": 16951, "year": "2017"}, {"Unnamed: 0": 404193, "autor": "semi-ambivalent", "date": 1503931380000, "content": "The Summicron needs an optical upgrade. There has been speculation here already about just what that might have to mean. Leica's position on the 50mm Summicron was that it was already so good the only choice was an 'ignore everything' re-design. A 2/35 APO-Summicron ASPH? I can't imagine what that would have to cost. Karbe & Co. probably already have pre-production samples in place; it's all in the timing. s-a", "link": "https://www.l-camera-forum.com/topic/215282-35mm-f2-summicron-asph-flaring-issues/page/2/?tab=comments#comment-3346751", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the summicron needs an optical upgrade. there has been speculation here already about just what that might have to mean. leica's -----> position !!!  on the 50mm summicron was that it was already so good the only choice was an 'ignore everything' re-design. a 2/35 apo-summicron asph? i can't imagine what that would have to cost. karbe & co. probably already have pre-production samples in place; it's all in the timing. s-a", "sortedWord": "None", "identifyer": 16953, "year": "2017"}, {"Unnamed: 0": 406170, "autor": "Ecar", "date": 1504336380000, "content": "Mine is from 1953. I've hesitated to put it on my digital body (246) due to possible damage if the lens is collapsed. Is this a problem? Collapsing works fine on all the digital bodies I have put my lens on. If you are unsure about your particular body/lens combination, this is easy to measure with a caliper. Always mount/unmount in extended position to avoid damage to the roller cam.", "link": "https://www.l-camera-forum.com/topic/158389-summicron-collapsible-50mm/page/2/?tab=comments#comment-3350033", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mine is from 1953. i've hesitated to put it on my digital body (246) due to possible damage if the lens is collapsed. is this a problem? collapsing works fine on all the digital bodies i have put my lens on. if you are unsure about your particular body/lens combination, this is easy to measure with a caliper. always mount/unmount in extended -----> position !!!  to avoid damage to the roller cam.", "sortedWord": "None", "identifyer": 18949, "year": "2017"}, {"Unnamed: 0": 406655, "autor": "Ernest", "date": 1495344540000, "content": "Kudos to Overgaard for creating, manufacturing and distributing a solution to this problem. If I was CEO of Leica I would offer any owner of this lens who applies to reimburse the expense of buying this aftermarket shade along with a letter of apology for the error. What I found particularly grating was the lack of admission from Leica that they had made a mistake. In the very least we should have received an apology. I found the response arrogant, which surprised me, because my impression in so many other instances is that Leica listen to their user community. Oh well. I sold my lens at a loss, as the frustration from this issue took some of the pleasure out of using it. For all that, I continue to be an ongoing customer and user, and like Leica very much. But I think they would do well to at least acknowledge that they made a mistake with this lens. First, thank you for starting this thread and exercising such tenacity with everyone else in trying to resolve this issue that has occupied an inordinate number of hours. Are we in the thousands of hours, yet? When I finally took delivery of my black chrome Lux in December 2015, I was blindsided, like many, with the filter/hood issue and fired off an enquiry to Leica NJ. After six months of back and forth, in July 2016, I suggested that “Leica might consider: produce an updated E43 UVa filter based on the mount of the E43 UV/IR #13417, only having 0.75mm pitch threads instead of the finer .5mm threads of the #13417. What’s important in solving the lens hood problem is that the 3mm ridge of the #13417 fits perfectly between the prongs of the Summilux-M lens hood catches in shooting position as well as reversed for traveling. Also, this updated E43 UVa filter can be stacked on top of another filter (ND, color filter, etc.) and the lens hood can be attached for shooting or reversed for traveling. Two filters stacked using this updated #13417 as the outermost filter moves the hood forward about 9mm, but I don’t see any vignetting from the hood. \"What I have done in the meantime is to modify a slimline UV filter, first removing the filter, then reducing the mount into a 45mm x 3mm spacer ring. This spacer ring allows me to easily change filters and attach the hood to the lens as it is designed. Now I can use ND filters with slower shutter speeds and wide open f-stops.” The Leica rep in NJ thanked for me for the suggestions which he said were to be forwarded to Germany and that was the end of it. It is truly sad to hear that you have been so frustrated by this issue that your resolution was to eliminate the irritant--sell the black chrome Lux at a loss--because the pleasure of using it had been taken! Is Leica listening to the silence?", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/8/?tab=comments#comment-3279194", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "kudos to overgaard for creating, manufacturing and distributing a solution to this problem. if i was ceo of leica i would offer any owner of this lens who applies to reimburse the expense of buying this aftermarket shade along with a letter of apology for the error. what i found particularly grating was the lack of admission from leica that they had made a mistake. in the very least we should have received an apology. i found the response arrogant, which surprised me, because my impression in so many other instances is that leica listen to their user community. oh well. i sold my lens at a loss, as the frustration from this issue took some of the pleasure out of using it. for all that, i continue to be an ongoing customer and user, and like leica very much. but i think they would do well to at least acknowledge that they made a mistake with this lens. first, thank you for starting this thread and exercising such tenacity with everyone else in trying to resolve this issue that has occupied an inordinate number of hours. are we in the thousands of hours, yet? when i finally took delivery of my black chrome lux in december 2015, i was blindsided, like many, with the filter/hood issue and fired off an enquiry to leica nj. after six months of back and forth, in july 2016, i suggested that “leica might consider: produce an updated e43 uva filter based on the mount of the e43 uv/ir #13417, only having 0.75mm pitch threads instead of the finer .5mm threads of the #13417. what’s important in solving the lens hood problem is that the 3mm ridge of the #13417 fits perfectly between the prongs of the summilux-m lens hood catches in shooting -----> position !!!  as well as reversed for traveling. also, this updated e43 uva filter can be stacked on top of another filter (nd, color filter, etc.) and the lens hood can be attached for shooting or reversed for traveling. two filters stacked using this updated #13417 as the outermost filter moves the hood forward about 9mm, but i don’t see any vignetting from the hood. \"what i have done in the meantime is to modify a slimline uv filter, first removing the filter, then reducing the mount into a 45mm x 3mm spacer ring. this spacer ring allows me to easily change filters and attach the hood to the lens as it is designed. now i can use nd filters with slower shutter speeds and wide open f-stops.” the leica rep in nj thanked for me for the suggestions which he said were to be forwarded to germany and that was the end of it. it is truly sad to hear that you have been so frustrated by this issue that your resolution was to eliminate the irritant--sell the black chrome lux at a loss--because the pleasure of using it had been taken! is leica listening to the silence?", "sortedWord": "None", "identifyer": 19436, "year": "2017"}, {"Unnamed: 0": 406657, "autor": "Ernest", "date": 1495386660000, "content": "Lens Hood Filter Adapter Ring: Summilux-M 50mm f/1.4 ASPH Black Chrome Until Leica follows through . . . I want to have my filter and use it, too, with my lens hood. In about fifteen minutes, I made an adapter ring that works. Cost: less than $20. Since the inside aperture diameter of a 43mm filter is 40.5mm, I used a Heliopan 40.5-43mm step-up ring (#270), which has an outside diameter of 45mm, and though it fits the inside dimension of the Leica hood, it is 1mm too thick to fit behind the lens hood catches. Lay it flat on a sheet of medium grit sand paper with the male threads facing up, and sand it down, reducing the 4mm thickness to 3mm. This way it will fit perfectly inside the lens hood catches. It isn’t necessary to bother sanding the male threads of the step-up ring. You are now finished with the lens hood filter adapter ring. Now screw a 43mm filter into the step-up ring until it seats, then back it off about one-quarter turn to allow for the thickness of the lens hood catches when you position the filter + step-up ring into the front of the Leica hood. With the lens hood off of your lens now, position the filter + step-up ring into the front of the hood, depressing the lens hood catches. Release the lens hood catches and adjust the filter until it is secure. Finally, attach the lens hood with the filter + step-up ring to the lens, and make any final adjustments screwing the filter slightly if needed into the step-up ring so the fit is snug. Using this adapter step-up ring allows you to attach the lens hood as it was designed to the lens. This filter adapter ring is the same as mounting a super slim 3+mm filter, plus a 4mm filter to the Lux. The lens hood mounts in its customary groove. Since the 4mm filter is adjusted for a snug fit, it is perhaps more secure. You can use a polarizer with LV by easily rotating the hood, also. No vignetting that I can see, since the filter extends only 7+mm from the lens. The downside is that the filter adapter with the filter must be removed from the hood so that the hood can be mounted reversed for traveling. A hassle, so the hood stays mounted. Another thing, don’t take the hood off with the lens pointed down, since the filter with the adapter ring may fall out. As a side note, for my first go-around, I modified an inexpensive aluminum 43mm filter, removing the filter glass, sanding the threads, and reducing the thickness to 3mm. It worked fine, but it looked too proto-type funky. Yes, the step-up ring was easier. Less sanding. Realize that not all 40.5-43mm step-up rings may fit, some being too wide. For another much less expensive aluminum step-up ring with a 45mm OD that will fit, Google the following: uxcell Replacement 40.5mm-43mm Camera Metal Filter Step Up Ring Adapter.", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/9/?tab=comments#comment-3279611", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "lens hood filter adapter ring: summilux-m 50mm f/1.4 asph black chrome until leica follows through . . . i want to have my filter and use it, too, with my lens hood. in about fifteen minutes, i made an adapter ring that works. cost: less than $20. since the inside aperture diameter of a 43mm filter is 40.5mm, i used a heliopan 40.5-43mm step-up ring (#270), which has an outside diameter of 45mm, and though it fits the inside dimension of the leica hood, it is 1mm too thick to fit behind the lens hood catches. lay it flat on a sheet of medium grit sand paper with the male threads facing up, and sand it down, reducing the 4mm thickness to 3mm. this way it will fit perfectly inside the lens hood catches. it isn’t necessary to bother sanding the male threads of the step-up ring. you are now finished with the lens hood filter adapter ring. now screw a 43mm filter into the step-up ring until it seats, then back it off about one-quarter turn to allow for the thickness of the lens hood catches when you -----> position !!!  the filter + step-up ring into the front of the leica hood. with the lens hood off of your lens now, position the filter + step-up ring into the front of the hood, depressing the lens hood catches. release the lens hood catches and adjust the filter until it is secure. finally, attach the lens hood with the filter + step-up ring to the lens, and make any final adjustments screwing the filter slightly if needed into the step-up ring so the fit is snug. using this adapter step-up ring allows you to attach the lens hood as it was designed to the lens. this filter adapter ring is the same as mounting a super slim 3+mm filter, plus a 4mm filter to the lux. the lens hood mounts in its customary groove. since the 4mm filter is adjusted for a snug fit, it is perhaps more secure. you can use a polarizer with lv by easily rotating the hood, also. no vignetting that i can see, since the filter extends only 7+mm from the lens. the downside is that the filter adapter with the filter must be removed from the hood so that the hood can be mounted reversed for traveling. a hassle, so the hood stays mounted. another thing, don’t take the hood off with the lens pointed down, since the filter with the adapter ring may fall out. as a side note, for my first go-around, i modified an inexpensive aluminum 43mm filter, removing the filter glass, sanding the threads, and reducing the thickness to 3mm. it worked fine, but it looked too proto-type funky. yes, the step-up ring was easier. less sanding. realize that not all 40.5-43mm step-up rings may fit, some being too wide. for another much less expensive aluminum step-up ring with a 45mm od that will fit, google the following: uxcell replacement 40.5mm-43mm camera metal filter step up ring adapter.", "sortedWord": "None", "identifyer": 19438, "year": "2017"}, {"Unnamed: 0": 406682, "autor": "Ernest", "date": 1501296480000, "content": " I am set to receive a modified hood from Leica. I will report back once I have it and have tested it. Thanks for the heads up, BBHewee! Perhaps that \"bird\" you and Muri were talking about is not extinct, after all. If I dare hazard a guess, Leica redesigned the bottom part of the hood that unscrews by adding 8mm, making the base 18mm high to accommodate a standard 4mm thick filter (Leica, B+W, Heliopan, etc.). The little ridge that seats on the filter mounted on the lens is then in the center of the base (9mm from either end). The hood can be mounted in the reverse position for travel, a feature Leica has reiterated. This hood design will not accept filters thicker than 4mm, so 5mm thick polarizers or stacked filters cannot be used with the hood. Small concession. And the padding in the leather carrying case must be modified to accommodate the extra overall length of the lens with a filter and lens hood mounted for storage/travel. Two years ago, Forum members targeted these redesign issues of the lens hood base and its ridge with their suggestions, so there's nothing new here, other than Leica seems at last committed to making this lens hood work. Whatever Leica's solution may be, I am anxious to hear your verdict.", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/10/?tab=comments#comment-3325628", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " i am set to receive a modified hood from leica. i will report back once i have it and have tested it. thanks for the heads up, bbhewee! perhaps that \"bird\" you and muri were talking about is not extinct, after all. if i dare hazard a guess, leica redesigned the bottom part of the hood that unscrews by adding 8mm, making the base 18mm high to accommodate a standard 4mm thick filter (leica, b+w, heliopan, etc.). the little ridge that seats on the filter mounted on the lens is then in the center of the base (9mm from either end). the hood can be mounted in the reverse -----> position !!!  for travel, a feature leica has reiterated. this hood design will not accept filters thicker than 4mm, so 5mm thick polarizers or stacked filters cannot be used with the hood. small concession. and the padding in the leather carrying case must be modified to accommodate the extra overall length of the lens with a filter and lens hood mounted for storage/travel. two years ago, forum members targeted these redesign issues of the lens hood base and its ridge with their suggestions, so there's nothing new here, other than leica seems at last committed to making this lens hood work. whatever leica's solution may be, i am anxious to hear your verdict.", "sortedWord": "None", "identifyer": 19463, "year": "2017"}, {"Unnamed: 0": 409551, "autor": "luigi bertolotti", "date": 1483308060000, "content": "I inspected the lens, front and back with a strong light - no fog, haze, fungus. Given how little respect I have for this sample I have brought out my lens tools and will dissect it part by part from the back. Given what a terrible performer it is I have nothing to lose. . Pico... one of my Summaron 3,5 was a terrible performer when bought it... it resulted that had been \"dissected part by part\" as you plan to do... and badly reassembled after cleaning... after excuses by the dealer, it was again disassembled and reassembled perfectly, and all is OK now.... I have the feeling that is a lens (I refer to the E39 BM version) that has some \"strategic\" shims that MUST be correctly positioned... Edited January 1, 2017 by luigi bertolotti", "link": "https://www.l-camera-forum.com/topic/267809-critique-35mm-summaron-f35/?tab=comments#comment-3177208", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "i inspected the lens, front and back with a strong light - no fog, haze, fungus. given how little respect i have for this sample i have brought out my lens tools and will dissect it part by part from the back. given what a terrible performer it is i have nothing to lose. . pico... one of my summaron 3,5 was a terrible performer when bought it... it resulted that had been \"dissected part by part\" as you plan to do... and badly reassembled after cleaning... after excuses by the dealer, it was again disassembled and reassembled perfectly, and all is ok now.... i have the feeling that is a lens (i refer to the e39 bm version) that has some \"strategic\" shims that must be correctly -----> positioned !!! ... edited january 1, 2017 by luigi bertolotti", "sortedWord": "None", "identifyer": 22375, "year": "2017"}, {"Unnamed: 0": 411945, "autor": "erudolph", "date": 1499281440000, "content": " 15mm voigtlander v3 on type 246 slightly cropped (in this position, framing is difficult): --img-- ", "link": "https://www.l-camera-forum.com/topic/242555-voigtlander-15mm-f45-vm-iii/page/6/?tab=comments#comment-3309268", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " 15mm voigtlander v3 on type 246 slightly cropped (in this -----> position !!! , framing is difficult): --img-- ", "sortedWord": "None", "identifyer": 24789, "year": "2017"}, {"Unnamed: 0": 411946, "autor": "DMJ", "date": 1499286480000, "content": "15mm voigtlander v3 on type 246 slightly cropped (in this position, framing is difficult): --img--  Shouldn't you be asleep for your operation, not taking photos?", "link": "https://www.l-camera-forum.com/topic/242555-voigtlander-15mm-f45-vm-iii/page/6/?tab=comments#comment-3309328", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "15mm voigtlander v3 on type 246 slightly cropped (in this -----> position !!! , framing is difficult): --img--  shouldn't you be asleep for your operation, not taking photos?", "sortedWord": "None", "identifyer": 24790, "year": "2017"}, {"Unnamed: 0": 411948, "autor": "jmahto", "date": 1499350980000, "content": "15mm voigtlander v3 on type 246 slightly cropped (in this position, framing is difficult): --img--  Clever. Wonder what will be the caption. --img-- ", "link": "https://www.l-camera-forum.com/topic/242555-voigtlander-15mm-f45-vm-iii/page/6/?tab=comments#comment-3309728", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "15mm voigtlander v3 on type 246 slightly cropped (in this -----> position !!! , framing is difficult): --img--  clever. wonder what will be the caption. --img-- ", "sortedWord": "None", "identifyer": 24792, "year": "2017"}, {"Unnamed: 0": 415526, "autor": "amoebahydra", "date": 1509735540000, "content": "I am using it on SL though I won't risk the camera for retracted position ................ --img-- ", "link": "https://www.l-camera-forum.com/topic/278201-collapsable-5028-elmar-on-the-sl/?tab=comments#comment-3388026", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i am using it on sl though i won't risk the camera for retracted -----> position !!!  ................ --img-- ", "sortedWord": "None", "identifyer": 28465, "year": "2017"}, {"Unnamed: 0": 418263, "autor": "MRJohn", "date": 1491336600000, "content": "Well, the SL shoulder bag thread might be more to your liking. --img--  I also prefer shoulder bags for quick access (or no bag at all)....backpacks serve a different, more infrequent need for me. Jeff well, I haven't decided on a new backpack yet (still torn between the Trifecta and the Peak Design) but recently bought a Thinktank Urban Disguise 35 V2 with a backpack strap add-on. Both discontinued and hence quite discounted. So a hybrid of sort --img--  . This is really a great shoulder bag for the SL as one can change lenses from the top without putting the bag down. It fits the SL with 90-280 mounted in vertical position and two other lenses (probably more if you push it and want to carry it). So ideal for the 90-280 and the 24-90 (both better without hoods), or the 90-280 and e.g. a noct and a wide angle.", "link": "https://www.l-camera-forum.com/topic/269692-which-backpack-for-the-sl/page/4/?tab=comments#comment-3248398", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "well, the sl shoulder bag thread might be more to your liking. --img--  i also prefer shoulder bags for quick access (or no bag at all)....backpacks serve a different, more infrequent need for me. jeff well, i haven't decided on a new backpack yet (still torn between the trifecta and the peak design) but recently bought a thinktank urban disguise 35 v2 with a backpack strap add-on. both discontinued and hence quite discounted. so a hybrid of sort --img--  . this is really a great shoulder bag for the sl as one can change lenses from the top without putting the bag down. it fits the sl with 90-280 mounted in vertical -----> position !!!  and two other lenses (probably more if you push it and want to carry it). so ideal for the 90-280 and the 24-90 (both better without hoods), or the 90-280 and e.g. a noct and a wide angle.", "sortedWord": "None", "identifyer": 31272, "year": "2017"}, {"Unnamed: 0": 422998, "autor": "LocalHero1953", "date": 1511528760000, "content": "Did I read that correctly that they switched the meaning of the two dials around, ie, the right dial is now aperture and the left dial is now exposure time? Didn't that drive you insane? Not really - the CL feels sufficiently different from the TL2 in the way you use it that it is just one of a number of different things I'm learning from scratch. The dials are in a different position in relation to my thumb, and the buttons on the dials open up a range of customisation and quick access. It would be a good future customisation option though, to allow you to switch the dials. In A-mode (which is what I use most), I typically set aperture first (the marginally less easily accessible RH dial) and then fiddle with exposure compensation (the more easily accessed LH dial). I doubt I would switch it around even if I could. In S-mode on the other hand, shutter speed is set with the LH dial - for the same reasons of priority of use and accessibility, I would want it on the RH dial with EC on the left. I have set up three basic user profiles (default, flash, manual focus), but the way customisation of the dial buttons and the Fn button works is different from what I'm used to, and it will take me a while to develop settings that are useful but not too complicated. It's not as simple as assigning one function to one button. My CL box didn't contain the manuals - the store aren't sure if they were accidentally omitted at the factory, or they haven't been printed yet. Even without them, I found it easy to work out how to use the CL just by working through the menu. The only thing that drove me to download the manual from the internet was the usual exasperating question: what do the LEDs on the battery charger mean: charging or charged?* *(Spoiler alert: green means charging; it goes out when it's charged). Edited November 24, 2017 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/320292-cl-the-image-thread/page/2/?tab=comments#comment-3402641", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "did i read that correctly that they switched the meaning of the two dials around, ie, the right dial is now aperture and the left dial is now exposure time? didn't that drive you insane? not really - the cl feels sufficiently different from the tl2 in the way you use it that it is just one of a number of different things i'm learning from scratch. the dials are in a different -----> position !!!  in relation to my thumb, and the buttons on the dials open up a range of customisation and quick access. it would be a good future customisation option though, to allow you to switch the dials. in a-mode (which is what i use most), i typically set aperture first (the marginally less easily accessible rh dial) and then fiddle with exposure compensation (the more easily accessed lh dial). i doubt i would switch it around even if i could. in s-mode on the other hand, shutter speed is set with the lh dial - for the same reasons of priority of use and accessibility, i would want it on the rh dial with ec on the left. i have set up three basic user profiles (default, flash, manual focus), but the way customisation of the dial buttons and the fn button works is different from what i'm used to, and it will take me a while to develop settings that are useful but not too complicated. it's not as simple as assigning one function to one button. my cl box didn't contain the manuals - the store aren't sure if they were accidentally omitted at the factory, or they haven't been printed yet. even without them, i found it easy to work out how to use the cl just by working through the menu. the only thing that drove me to download the manual from the internet was the usual exasperating question: what do the leds on the battery charger mean: charging or charged?* *(spoiler alert: green means charging; it goes out when it's charged). edited november 24, 2017 by localhero1953", "sortedWord": "None", "identifyer": 36048, "year": "2017"}, {"Unnamed: 0": 427250, "autor": "Chaemono", "date": 1513026240000, "content": "I've used the same SL lens here on the CL and the SL. I think even at ISO 200 the SL sensor has better color sensitivity and resolves more details but the test shots were at 1/50 sec. without a tripod so I won't post those here. Below there are two at ISO 1600 and at 1/320 sec. with the 50 Summilux-SL on the CL and the SL taken from changed positions to account for the difference in field of view and cropped almost exactly the same. Uncompressed files here: https://www.smugmug.com/gallery/n-snPbMf/ CL + 50 Summilux-SL (WB adjusted to try to match, Exposure +1.50) --img--  ISO 1600 f/1.4 @1/320 sec. SL + 50 Summilux-SL (WB adjusted to try to match, Exposure +0.80) --img--  ISO 1600 f/1.4 @1/320 sec. Edited December 11, 2017 by Chaemono", "link": "https://www.l-camera-forum.com/topic/279451-cl-and-sl-comparison-with-lenses-of-similar-capability/page/2/?tab=comments#comment-3416027", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i've used the same sl lens here on the cl and the sl. i think even at iso 200 the sl sensor has better color sensitivity and resolves more details but the test shots were at 1/50 sec. without a tripod so i won't post those here. below there are two at iso 1600 and at 1/320 sec. with the 50 summilux-sl on the cl and the sl taken from changed -----> positions !!!  to account for the difference in field of view and cropped almost exactly the same. uncompressed files here: https://www.smugmug.com/gallery/n-snpbmf/ cl + 50 summilux-sl (wb adjusted to try to match, exposure +1.50) --img--  iso 1600 f/1.4 @1/320 sec. sl + 50 summilux-sl (wb adjusted to try to match, exposure +0.80) --img--  iso 1600 f/1.4 @1/320 sec. edited december 11, 2017 by chaemono", "sortedWord": "None", "identifyer": 40357, "year": "2017"}, {"Unnamed: 0": 440810, "autor": "TheEyesHaveIt", "date": 1492281360000, "content": " Hello all, Recently got a used (mint condition) Leica Q. Everything works perfectly, but one thing I've noticed is the hood doesn't seem to rotate fully when attaching it. What I mean is that when I screw on the hood, it stops before it is in the right position. It's off center / tilted compared to where it should be. I don't want to screw it further because I don't want to risk damaging something. I've tried screwing it on every possible way, but always ends up in the same position. Any ideas? Thanks! --img-- ", "link": "https://www.l-camera-forum.com/topic/271428-hood-doesnt-rotate-fully/?tab=comments#comment-3255404", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " hello all, recently got a used (mint condition) leica q. everything works perfectly, but one thing i've noticed is the hood doesn't seem to rotate fully when attaching it. what i mean is that when i screw on the hood, it stops before it is in the right -----> position !!! . it's off center / tilted compared to where it should be. i don't want to screw it further because i don't want to risk damaging something. i've tried screwing it on every possible way, but always ends up in the same position. any ideas? thanks! --img-- ", "sortedWord": "None", "identifyer": 54151, "year": "2017"}, {"Unnamed: 0": 440816, "autor": "Useink!", "date": 1492615560000, "content": " Hi everyone, Just first like to say how delighted I am to have found this forum having purchased a new 'Q' only last week. Regarding fitting the hood, I too found the tightness and subsequent 'off-set' position a slight problem until I smeared the lens and hood threads with a smidgeon of oil (from behind my ears actually!) I've used this lubrication technique before for various applications and have found it to be a useful standby! I also note that when the hood is perfectly aligned on the front of the camera, a soft 'click' can be heard and the hood won't rotate further, serving to indicate that that it is seated correctly and symmetrically. A nice touch I thought and a reassurance that it's simply not possible to over-tighten the hood.", "link": "https://www.l-camera-forum.com/topic/271428-hood-doesnt-rotate-fully/?tab=comments#comment-3257788", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " hi everyone, just first like to say how delighted i am to have found this forum having purchased a new 'q' only last week. regarding fitting the hood, i too found the tightness and subsequent 'off-set' -----> position !!!  a slight problem until i smeared the lens and hood threads with a smidgeon of oil (from behind my ears actually!) i've used this lubrication technique before for various applications and have found it to be a useful standby! i also note that when the hood is perfectly aligned on the front of the camera, a soft 'click' can be heard and the hood won't rotate further, serving to indicate that that it is seated correctly and symmetrically. a nice touch i thought and a reassurance that it's simply not possible to over-tighten the hood.", "sortedWord": "None", "identifyer": 54157, "year": "2017"}, {"Unnamed: 0": 443599, "autor": "Lucena", "date": 1501399260000, "content": "I think I was the OP. I have my Q and finally got an M10. I was using a MM1 a lot, but am so impressed with M10 have sold the MM1 and a 50 Cron and purchased a 50 Summilux. So about to go on a trip with Q and M10/50Lux and see what happens. Please send me a message when you publish your impressions on the Q and M10 during your trip, I am interested as I will be in the same position in september: I go to the Feroe Islands and am not yet decided in what I take! Have a nice trip", "link": "https://www.l-camera-forum.com/topic/272045-will-i-regret-selling-my-leica-q/page/4/?tab=comments#comment-3326228", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think i was the op. i have my q and finally got an m10. i was using a mm1 a lot, but am so impressed with m10 have sold the mm1 and a 50 cron and purchased a 50 summilux. so about to go on a trip with q and m10/50lux and see what happens. please send me a message when you publish your impressions on the q and m10 during your trip, i am interested as i will be in the same -----> position !!!  in september: i go to the feroe islands and am not yet decided in what i take! have a nice trip", "sortedWord": "None", "identifyer": 6981, "year": "2017"}, {"Unnamed: 0": 443603, "autor": "sls", "date": 1503584940000, "content": "Please send me a message when you publish your impressions on the Q and M10 during your trip, I am interested as I will be in the same position in september: I go to the Feroe Islands and am not yet decided in what I take! Have a nice trip Bilbao was wet and brief and even good photography could not redeem it. We drove over the hills to the Rioja region and literally as you drive through a pass it goes from horrible to lovely, especially as first stop was Frank Gehry's hotel at Marques de Risqual. Then on to Salamanca, Caceres, Seville, Toledo and Madrid and a few points in-between. Long story short, I used the M10 and Q about 50/50, depending on time available and what we were doing. The Q remains a superb everyday camera. That said, I was in Berlin last weekend and just took the M10 and 35/f2 and a spare battery, which suits me fine. Having bought the M10, I've bought three lenses, a s/h APO 135 that gives stunning architectural detail shots hand-held at slow speeds, a Voightlander 15mm Mk 111 that is spectacularly sharp and free of aberration, and the 5.6 Summaron the other day, not been out with it properly yet. As the M10 is my first Leica with Live View, I got the digital viewfinder which makes the 15 and 135 lenses a joy to use. I also borrowed a 50 Lux having sold my 50 Cron and waiting for a black 50 Lux to come in. Thanks to the M10, have sold my MM9, a s/h a7r and a couple of lenses to pay for most of this changing. Even after all that, still keeping the Q. Edited August 24, 2017 by sls", "link": "https://www.l-camera-forum.com/topic/272045-will-i-regret-selling-my-leica-q/page/4/?tab=comments#comment-3344354", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "please send me a message when you publish your impressions on the q and m10 during your trip, i am interested as i will be in the same -----> position !!!  in september: i go to the feroe islands and am not yet decided in what i take! have a nice trip bilbao was wet and brief and even good photography could not redeem it. we drove over the hills to the rioja region and literally as you drive through a pass it goes from horrible to lovely, especially as first stop was frank gehry's hotel at marques de risqual. then on to salamanca, caceres, seville, toledo and madrid and a few points in-between. long story short, i used the m10 and q about 50/50, depending on time available and what we were doing. the q remains a superb everyday camera. that said, i was in berlin last weekend and just took the m10 and 35/f2 and a spare battery, which suits me fine. having bought the m10, i've bought three lenses, a s/h apo 135 that gives stunning architectural detail shots hand-held at slow speeds, a voightlander 15mm mk 111 that is spectacularly sharp and free of aberration, and the 5.6 summaron the other day, not been out with it properly yet. as the m10 is my first leica with live view, i got the digital viewfinder which makes the 15 and 135 lenses a joy to use. i also borrowed a 50 lux having sold my 50 cron and waiting for a black 50 lux to come in. thanks to the m10, have sold my mm9, a s/h a7r and a couple of lenses to pay for most of this changing. even after all that, still keeping the q. edited august 24, 2017 by sls", "sortedWord": "None", "identifyer": 6985, "year": "2017"}, {"Unnamed: 0": 448016, "autor": "gbealnz", "date": 1501313940000, "content": "Adam. Self-confessed astro-nut here, and I cannot agree more with David's sage advice. Enjoy the moment. I've never seen a total. Seen a few partials, and imaged them plus transits (Venus, and Mercury) as well as Lunar obviously, but the total is something still on the bucket list. Back in the day, I used an old Digilux 4.3 for lunar imaging, it was all I had, and I made a suitable bracket that held the camera at the appropriate distance and position near the eyepiece, so I was doing \"afocal eyepiece projection\" I think. It worked, and at the time I was happy. Now? Nah, too hard, and I have better options. But back in the infancy of digital it was earth-shattering, LOL. The two lines David wrote sum it up. Gary", "link": "https://www.l-camera-forum.com/topic/275149-x-vario-and-the-solar-eclipse-ideas/?tab=comments#comment-3325714", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "adam. self-confessed astro-nut here, and i cannot agree more with david's sage advice. enjoy the moment. i've never seen a total. seen a few partials, and imaged them plus transits (venus, and mercury) as well as lunar obviously, but the total is something still on the bucket list. back in the day, i used an old digilux 4.3 for lunar imaging, it was all i had, and i made a suitable bracket that held the camera at the appropriate distance and -----> position !!!  near the eyepiece, so i was doing \"afocal eyepiece projection\" i think. it worked, and at the time i was happy. now? nah, too hard, and i have better options. but back in the infancy of digital it was earth-shattering, lol. the two lines david wrote sum it up. gary", "sortedWord": "None", "identifyer": 11500, "year": "2017"}], "name": "positionL-Forum2017"}