{"interestingcomments": [{"Unnamed: 0": 379403, "autor": "andybarton", "date": 1206300060000, "content": "You have probably knocked the lock tab on the card to the \"Locked\" position. Take out the card and check the little tab on the side of the card.", "link": "https://www.l-camera-forum.com/topic/48736-hlep-message-sd-card-locked-error-message/?tab=comments#comment-518384", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "you have probably knocked the lock tab on the card to the \"locked\" -----> position !!! . take out the card and check the little tab on the side of the card.", "sortedWord": "None", "identifyer": 40790, "year": "2008"}, {"Unnamed: 0": 379404, "autor": "rafael_macia", "date": 1206300180000, "content": "No Andy, I checked that. It is in the unlocked position", "link": "https://www.l-camera-forum.com/topic/48736-hlep-message-sd-card-locked-error-message/?tab=comments#comment-518394", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "no andy, i checked that. it is in the unlocked -----> position !!! ", "sortedWord": "None", "identifyer": 40791, "year": "2008"}, {"Unnamed: 0": 379424, "autor": "rafael_macia", "date": 1206333960000, "content": "Strange development; The SD card when I slide the lock 'ON\" to the \"Lock \" position the card functions. when the lock is slid \"OFF\" to what is marked the \"San Disk\" position it does not function. The indication says \"SD locked\". and the view finder shows full. Rafael", "link": "https://www.l-camera-forum.com/topic/48736-hlep-message-sd-card-locked-error-message/page/2/?tab=comments#comment-518711", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "strange development; the sd card when i slide the lock 'on\" to the \"lock \" -----> position !!!  the card functions. when the lock is slid \"off\" to what is marked the \"san disk\" position it does not function. the indication says \"sd locked\". and the view finder shows full. rafael", "sortedWord": "None", "identifyer": 40811, "year": "2008"}, {"Unnamed: 0": 379429, "autor": "philipir", "date": 1206396240000, "content": "You have probably knocked the lock tab on the card to the \"Locked\" position. Take out the card and check the little tab on the side of the card. I know you have looked at the \"Lock\" caption and its little indicating triangle but please indulge me and look again - the word and the triangle are not logically placed to a quick look, on some of mine.", "link": "https://www.l-camera-forum.com/topic/48736-hlep-message-sd-card-locked-error-message/page/2/?tab=comments#comment-519468", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "you have probably knocked the lock tab on the card to the \"locked\" -----> position !!! . take out the card and check the little tab on the side of the card. i know you have looked at the \"lock\" caption and its little indicating triangle but please indulge me and look again - the word and the triangle are not logically placed to a quick look, on some of mine.", "sortedWord": "None", "identifyer": 40816, "year": "2008"}, {"Unnamed: 0": 379432, "autor": "ALbino", "date": 1209685200000, "content": "One of my cameras kept dying over and over and I ended up having this problem with the 3 memory cards I had been trying to use on it. Eventually I realized that somehow the switch was backwards now. If it was set to \"lock\" then it was fine, but if it's set to \"unlocked\" then it doesn't work and it errors as locked. I have no idea how this happened, but they seem to be working fine in the \"lock\" position. Go figure.", "link": "https://www.l-camera-forum.com/topic/48736-hlep-message-sd-card-locked-error-message/page/2/?tab=comments#comment-549838", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "one of my cameras kept dying over and over and i ended up having this problem with the 3 memory cards i had been trying to use on it. eventually i realized that somehow the switch was backwards now. if it was set to \"lock\" then it was fine, but if it's set to \"unlocked\" then it doesn't work and it errors as locked. i have no idea how this happened, but they seem to be working fine in the \"lock\" -----> position !!! . go figure.", "sortedWord": "None", "identifyer": 40819, "year": "2008"}, {"Unnamed: 0": 379436, "autor": "Shootist", "date": 1209739020000, "content": "Superglue the switch in the Unlocked position. If it then reads as locked throw the card away.", "link": "https://www.l-camera-forum.com/topic/48736-hlep-message-sd-card-locked-error-message/page/2/?tab=comments#comment-550087", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "superglue the switch in the unlocked -----> position !!! . if it then reads as locked throw the card away.", "sortedWord": "None", "identifyer": 40823, "year": "2008"}, {"Unnamed: 0": 383293, "autor": "marknorton", "date": 1225382880000, "content": " Eagerly awaited by at least one person on this forum, here is the latest in the \"Anatomy of the Leica...\" series. The M8 upgrade program allows the framelines to be changed for ones which are calibrated at around 2m shooting distance instead of the closest focus of 0.7m. This has the effect of balancing the framing error between closest focus and infinity to provide a more acceptable result. If you're contemplating this update and want to know what's involved, or just wondered how they work, this thread is for you! To begin... The framelines work by projecting light through a series of slits in two metal masks; one is in a fixed position and the other slides diagonally behind it. By clever design, in each of three positions of the movable mask, slits in the two masks coincide to allow the light through. This then appears as a frameline injected into the viewfinder. In the M7 and M8, there is also an LED display (just like the old red LED calculators) to display the AE shutter speed, manual metering and flash indicators. Here's the fixed mask... --img--  You can see the familiar layout of the framelines; counting from the outside: 24mm, 28mm, 35mm, 50mm, 75mm, 90mm. Note that the 75mm frame is scarcely bigger than the 90mm frame; no wonder the 75mm frame is the most inaccurate. If you wanted to eliminate some of the frames, \"all\" you have to do is black out the slits you don't want. The centre rectangle defines the rangefinder patch. It's through this aperture that the image from the rangefinder window is projected into the viewfinder. Without the masks in place, you see a much larger image with parts of it superimposing the main viewfinder image, other parts being split from it, depending on distance; confusing and the rectangle constrains the rangefinder image to the centre. The two holes top left and bottom right are used to locate the mask in the carrier; only one round hole is required; the second is elongated to ensure the mask sits flat. The diagonal slot top left is used to locate a spring which provides the audible \"click\" when the framelines change. This mask is tiny, around 15mm wide, so you can imagine how small the slits are and how accurately located. It's not clear how they are made. In former times, I expect they were stamped, now, it would make sense to cut them using a laser. Either way, an expensive component to make. At the bottom, an identifier for this type of mask: M8, 0.68 (viewfinder magnification), 6 (frame count). You can just make out a clear plastic block in front of the lower aperture. This is where the viewfinder LED display is mounted. It's not clear what it's for. I think it is some sort of light \"pipe\" to increase the display contrast. Here's an oblique view of the same mask - you can see the plastic block super-glued on to the mask - at six points it turns out after mine fell apart. Easily re-glued using Loctite 4062, a very low viscosity cyanoacrylate. Steady hand required, easy on the Rioja the previous night! --img--  Here is the moveable mask which sits behind the fixed mask and moves diagonally. The pattern of slits may look odd but keep in mind that their only purpose is to align with the slits in the fixed mask when the moveable mask is set to one of three positions. --img--  There are now two diagonal slots top left and bottom right so the mask can move along this axis. The strange shape top left is to allow the framelines to click into place. The spring expands into the zig-zag edges and causes this mask to settle into the correct position. The diagonal slot right centre is used to set the position of the mask. A pin actuated by the frame selection lever engages in the slot and moves the mask in the required direction. Now, here's the clever bit. The whole mask assembly can be shifted to provide parallax correction and that movement takes place in the other diagonal direction, bottom left to top right. Notice how the frame selection slot is parallel with that movement - the two directions of movement are orthogonal so that a movement in one direction (as you focus closely) is not affected by a movement in the other (as you select a new lens). Clever stuff!", "link": "https://www.l-camera-forum.com/topic/66999-anatomy-of-the-leica-m8-framelines/?tab=comments#comment-700391", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " eagerly awaited by at least one person on this forum, here is the latest in the \"anatomy of the leica...\" series. the m8 upgrade program allows the framelines to be changed for ones which are calibrated at around 2m shooting distance instead of the closest focus of 0.7m. this has the effect of balancing the framing error between closest focus and infinity to provide a more acceptable result. if you're contemplating this update and want to know what's involved, or just wondered how they work, this thread is for you! to begin... the framelines work by projecting light through a series of slits in two metal masks; one is in a fixed -----> position !!!  and the other slides diagonally behind it. by clever design, in each of three positions of the movable mask, slits in the two masks coincide to allow the light through. this then appears as a frameline injected into the viewfinder. in the m7 and m8, there is also an led display (just like the old red led calculators) to display the ae shutter speed, manual metering and flash indicators. here's the fixed mask... --img--  you can see the familiar layout of the framelines; counting from the outside: 24mm, 28mm, 35mm, 50mm, 75mm, 90mm. note that the 75mm frame is scarcely bigger than the 90mm frame; no wonder the 75mm frame is the most inaccurate. if you wanted to eliminate some of the frames, \"all\" you have to do is black out the slits you don't want. the centre rectangle defines the rangefinder patch. it's through this aperture that the image from the rangefinder window is projected into the viewfinder. without the masks in place, you see a much larger image with parts of it superimposing the main viewfinder image, other parts being split from it, depending on distance; confusing and the rectangle constrains the rangefinder image to the centre. the two holes top left and bottom right are used to locate the mask in the carrier; only one round hole is required; the second is elongated to ensure the mask sits flat. the diagonal slot top left is used to locate a spring which provides the audible \"click\" when the framelines change. this mask is tiny, around 15mm wide, so you can imagine how small the slits are and how accurately located. it's not clear how they are made. in former times, i expect they were stamped, now, it would make sense to cut them using a laser. either way, an expensive component to make. at the bottom, an identifier for this type of mask: m8, 0.68 (viewfinder magnification), 6 (frame count). you can just make out a clear plastic block in front of the lower aperture. this is where the viewfinder led display is mounted. it's not clear what it's for. i think it is some sort of light \"pipe\" to increase the display contrast. here's an oblique view of the same mask - you can see the plastic block super-glued on to the mask - at six points it turns out after mine fell apart. easily re-glued using loctite 4062, a very low viscosity cyanoacrylate. steady hand required, easy on the rioja the previous night! --img--  here is the moveable mask which sits behind the fixed mask and moves diagonally. the pattern of slits may look odd but keep in mind that their only purpose is to align with the slits in the fixed mask when the moveable mask is set to one of three positions. --img--  there are now two diagonal slots top left and bottom right so the mask can move along this axis. the strange shape top left is to allow the framelines to click into place. the spring expands into the zig-zag edges and causes this mask to settle into the correct position. the diagonal slot right centre is used to set the position of the mask. a pin actuated by the frame selection lever engages in the slot and moves the mask in the required direction. now, here's the clever bit. the whole mask assembly can be shifted to provide parallax correction and that movement takes place in the other diagonal direction, bottom left to top right. notice how the frame selection slot is parallel with that movement - the two directions of movement are orthogonal so that a movement in one direction (as you focus closely) is not affected by a movement in the other (as you select a new lens). clever stuff!", "sortedWord": "None", "identifyer": 44693, "year": "2008"}, {"Unnamed: 0": 383295, "autor": "marknorton", "date": 1225383300000, "content": "That's the major components then. There are of course some other components, shown here with a centimetre rule for scale. --img--  Moving clockwise from top left: 2 mounting screws and washers to secure the mounting frame to the top of the viewfinder. The mirror which reflects light coming in through the centre window through the masks into the viewfinder. A guide for the flex print of the LED display. The LED display itself, a wonder of miniaturisation; you can see the display at the bottom. The central window is about 1 * 2.5mm. The connector at the top connects the display to the M16C processor on the top of the camera. A plastic prism; it's not clear what this is for, possibly to provide even illumination of the framelines. 3 screws to mount the prism to the carrier, the carrier to the mounting bracket and the mirror, guide and flex-print to the mounting bracket. An L-shaped spring which is used to return the parallax correction to the infinity position. Finally, the famous spring. This tiny, minute spring, is what provides the audible clicks when the framelines are selected. It's inserted though the masks and the carrier. By springing outwards, it causes the moveable mask to settle in one of the three required positions.", "link": "https://www.l-camera-forum.com/topic/66999-anatomy-of-the-leica-m8-framelines/?tab=comments#comment-700395", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "that's the major components then. there are of course some other components, shown here with a centimetre rule for scale. --img--  moving clockwise from top left: 2 mounting screws and washers to secure the mounting frame to the top of the viewfinder. the mirror which reflects light coming in through the centre window through the masks into the viewfinder. a guide for the flex print of the led display. the led display itself, a wonder of miniaturisation; you can see the display at the bottom. the central window is about 1 * 2.5mm. the connector at the top connects the display to the m16c processor on the top of the camera. a plastic prism; it's not clear what this is for, possibly to provide even illumination of the framelines. 3 screws to mount the prism to the carrier, the carrier to the mounting bracket and the mirror, guide and flex-print to the mounting bracket. an l-shaped spring which is used to return the parallax correction to the infinity -----> position !!! . finally, the famous spring. this tiny, minute spring, is what provides the audible clicks when the framelines are selected. it's inserted though the masks and the carrier. by springing outwards, it causes the moveable mask to settle in one of the three required positions.", "sortedWord": "None", "identifyer": 44695, "year": "2008"}, {"Unnamed: 0": 383296, "autor": "marknorton", "date": 1225383540000, "content": "So, with this kit of parts, let's play Leica technician and build it all. First, attached the prism to the carrier with a mounting screw. --img--  Turn it over and place the moveable mask in the back. Note how the mask can slide diagonally, constrained by the chrome pins. --img--  Then, put the fixed mask in; this cannot move because it is constrained by the pins. With the moveable mask in one position, the 28 and 90mm frames are visible... --img--  With the moveable mask in the other extreme position, the 24 and 35mm frames are visible. Notice how the position of the slot centre right has changed between these two. The small spring is pushed into the stop top left through both masks and the frame carrier. --img--  The carrier is then mounted on the mounting bracket using a screw top left; the L-shaped spring is installed and the carrier can move diagonally for parallax correction, returning to the infinity position under the force from the L-shaped spring. --img--  Notice the tiny spring appearing through the slit, to the left of the pin, top right.", "link": "https://www.l-camera-forum.com/topic/66999-anatomy-of-the-leica-m8-framelines/?tab=comments#comment-700397", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "so, with this kit of parts, let's play leica technician and build it all. first, attached the prism to the carrier with a mounting screw. --img--  turn it over and place the moveable mask in the back. note how the mask can slide diagonally, constrained by the chrome pins. --img--  then, put the fixed mask in; this cannot move because it is constrained by the pins. with the moveable mask in one -----> position !!! , the 28 and 90mm frames are visible... --img--  with the moveable mask in the other extreme position, the 24 and 35mm frames are visible. notice how the position of the slot centre right has changed between these two. the small spring is pushed into the stop top left through both masks and the frame carrier. --img--  the carrier is then mounted on the mounting bracket using a screw top left; the l-shaped spring is installed and the carrier can move diagonally for parallax correction, returning to the infinity position under the force from the l-shaped spring. --img--  notice the tiny spring appearing through the slit, to the left of the pin, top right.", "sortedWord": "None", "identifyer": 44696, "year": "2008"}, {"Unnamed: 0": 383312, "autor": "marknorton", "date": 1225421460000, "content": "Jonathan, go easy! The masks may look substantial but in reality they are tiny slivers of metal and that spring is ready to fly away and ruin your day. The plastic block detached very easily and I am extremely careful with these things. You'll void your warranty of course if you do this... You can see that the holes at the top of the mounting bracket are quite large and that the screws have flat tops meaning the position of the bracket is adjustable and I expect the centre hole is to locate some sort of alignment tool. The screws are secured with Loctite as perhaps you can see. Important therefore that you record the position so that you can return it to the same position to keep the alignment.", "link": "https://www.l-camera-forum.com/topic/66999-anatomy-of-the-leica-m8-framelines/?tab=comments#comment-700804", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "jonathan, go easy! the masks may look substantial but in reality they are tiny slivers of metal and that spring is ready to fly away and ruin your day. the plastic block detached very easily and i am extremely careful with these things. you'll void your warranty of course if you do this... you can see that the holes at the top of the mounting bracket are quite large and that the screws have flat tops meaning the -----> position !!!  of the bracket is adjustable and i expect the centre hole is to locate some sort of alignment tool. the screws are secured with loctite as perhaps you can see. important therefore that you record the position so that you can return it to the same position to keep the alignment.", "sortedWord": "None", "identifyer": 44712, "year": "2008"}, {"Unnamed: 0": 383567, "autor": "lxlim", "date": 1215106080000, "content": "I think, what a lot of people forget (including Ned there) is that the \"beauty\" in the images (whether they're created by an M8, M7 or Canon 5D, Nikon D3 etc.) is in the eye of the customer..... Dave and those who view the images and re-lived those moments with them. The isn't a better testimony than those who witnessed and can say that the photographer was great. If he/she was using a leica ..... maybe that helps a little --img--  Frankly I didn't realise how much Leica has impacted on the photography world until I started using the M8. Bought it to solve unacceptable AF issues and I get amateurs armed with Nikon D3 giving way to me when I was angling for position. Puzzling and quite amusing. I must say that the M8 certainly fulfills my intended deployment but until now I can't get myself use it to complement my DSLR in event coverage. My hat is off to those can and do cover weddings and events with the rangefinder. Whenever I view the M8 images next those of the 1D... sigh!", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/4/?tab=comments#comment-595264", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think, what a lot of people forget (including ned there) is that the \"beauty\" in the images (whether they're created by an m8, m7 or canon 5d, nikon d3 etc.) is in the eye of the customer..... dave and those who view the images and re-lived those moments with them. the isn't a better testimony than those who witnessed and can say that the photographer was great. if he/she was using a leica ..... maybe that helps a little --img--  frankly i didn't realise how much leica has impacted on the photography world until i started using the m8. bought it to solve unacceptable af issues and i get amateurs armed with nikon d3 giving way to me when i was angling for -----> position !!! . puzzling and quite amusing. i must say that the m8 certainly fulfills my intended deployment but until now i can't get myself use it to complement my dslr in event coverage. my hat is off to those can and do cover weddings and events with the rangefinder. whenever i view the m8 images next those of the 1d... sigh!", "sortedWord": "None", "identifyer": 44967, "year": "2008"}, {"Unnamed: 0": 383647, "autor": "Rolo", "date": 1215621120000, "content": "Even when something totally unexpected happens it needs moments to develop and getting into position is important, but grabbing a shot can be more important. Have great respect for PJ shooters who do it well and equal respect, maybe more for those who can organise a shoot in the middle of the wedding. Is shooting what's going on in front of you just plain record photography or reportage and when does it transfer from one to the other? Some can do both and some can't do the other style, but sometimes the greatest respect goes to the little guy who has a small low budget wedding to shoot, where there's little going on, the B&G are not film stars and the kids are running riot. When that happens I think of the Elliott Erwitt shot of the guy smiling at the B&G - priceless. --img-- ", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/8/?tab=comments#comment-600332", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "even when something totally unexpected happens it needs moments to develop and getting into -----> position !!!  is important, but grabbing a shot can be more important. have great respect for pj shooters who do it well and equal respect, maybe more for those who can organise a shoot in the middle of the wedding. is shooting what's going on in front of you just plain record photography or reportage and when does it transfer from one to the other? some can do both and some can't do the other style, but sometimes the greatest respect goes to the little guy who has a small low budget wedding to shoot, where there's little going on, the b&g are not film stars and the kids are running riot. when that happens i think of the elliott erwitt shot of the guy smiling at the b&g - priceless. --img-- ", "sortedWord": "None", "identifyer": 45048, "year": "2008"}, {"Unnamed: 0": 384179, "autor": "aesop", "date": 1209045840000, "content": "Shutter Removal The shutter is held in by 3 screws and a single flex-print to the shutter/motor-wind controller. One oddity is the bottom right mounting where instead of a screw, the corner of the shutter is secured by a plate: Originally I thought that this was because the mounting hole ended up in the wrong position but no, if you remove the plate, the hole for the screw is perfectly aligned, so it’s a mystery why they didn’t use it. Mark, I am strictly mechanical but still found your piece remarkable. Re: the clamped shutter corner, leaving a part of the shutter assembly screw-free ensures that it acts as a \"lightning conductor\" for some of the vibration/noise generated by the shutter. In simple terms, some of that energy is dissipated away from the camera body by the fourth unattached corner. I have observed this technique employed in high-end cycle framebuilding, where vibrations are simply a no-no. So why did Leica's design include a fourth mounting? No firm idea, but tellingly, structural integrity of the shutter assembly does not appear to be compromised by the omission of the fourth screw. This suggests the benefits of the clamped shutter corner were recognised late in development. It would be interesting to do a vibration/noise level comparison with the fourth screw in place. There.--img-- ", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/16/?tab=comments#comment-544381", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "shutter removal the shutter is held in by 3 screws and a single flex-print to the shutter/motor-wind controller. one oddity is the bottom right mounting where instead of a screw, the corner of the shutter is secured by a plate: originally i thought that this was because the mounting hole ended up in the wrong -----> position !!!  but no, if you remove the plate, the hole for the screw is perfectly aligned, so it’s a mystery why they didn’t use it. mark, i am strictly mechanical but still found your piece remarkable. re: the clamped shutter corner, leaving a part of the shutter assembly screw-free ensures that it acts as a \"lightning conductor\" for some of the vibration/noise generated by the shutter. in simple terms, some of that energy is dissipated away from the camera body by the fourth unattached corner. i have observed this technique employed in high-end cycle framebuilding, where vibrations are simply a no-no. so why did leica's design include a fourth mounting? no firm idea, but tellingly, structural integrity of the shutter assembly does not appear to be compromised by the omission of the fourth screw. this suggests the benefits of the clamped shutter corner were recognised late in development. it would be interesting to do a vibration/noise level comparison with the fourth screw in place. there.--img-- ", "sortedWord": "None", "identifyer": 45581, "year": "2008"}, {"Unnamed: 0": 384189, "autor": "carstenw", "date": 1209208680000, "content": "Bill, That the 50 Lux Asph. If you don't recognise it on sight, then you can see the focal length (50) on the lens, the aperture on the aperture ring (1.4) and then you just need to know that the only other 50 Lux version with a built-in shade has it sliding underneath the aperture ring in the closed position, not on the outside of the lens like this one. I don't think the old 50 Lux had a locking hood either (see the slots inside the hood). Besides, the serial number is very new.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/16/?tab=comments#comment-545558", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "bill, that the 50 lux asph. if you don't recognise it on sight, then you can see the focal length (50) on the lens, the aperture on the aperture ring (1.4) and then you just need to know that the only other 50 lux version with a built-in shade has it sliding underneath the aperture ring in the closed -----> position !!! , not on the outside of the lens like this one. i don't think the old 50 lux had a locking hood either (see the slots inside the hood). besides, the serial number is very new.", "sortedWord": "None", "identifyer": 45591, "year": "2008"}, {"Unnamed: 0": 408216, "autor": "luigi bertolotti", "date": 1214674380000, "content": "Al, I think that most of the people answered misunderstanding the word \"exciting\". As we can see, and it's somehow obvious, you get the best part of the answer from people who listed they're own lens, being it exciting or not. I guess this thread, it's somehow become a typical \"what's your favourite lens?\" I don't discuss one's favourite lens, but exciting for me has a different meaning. It means fun and maybe creative at the same way, something able to deliver our full pontential, maybe. It's like make love, or make love with someone like a \"wild\" and fully herotic girl (that maybe you can't even control)... ...only 50 noct and 75lux are those kind of girl (IMHO) in this little bunch... P.S. I always prefere exciting girls! --img--  Good precisation, Maurizio... and so I confess the absolutely most exciting is the Summarex 85 (followed closely by SA 21 f4 and Lux 35 preasph ... simply, a certain kind of chroming makes my CRAZY....); I haven't ever practiced nude studio photo... but sometimes I imagine which pic would I like to take with the right model and the 3 items above...--img--  ... posed in apt positions...", "link": "https://www.l-camera-forum.com/topic/55623-which-are-your-most-exciting-m-lenses/page/4/?tab=comments#comment-591757", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "al, i think that most of the people answered misunderstanding the word \"exciting\". as we can see, and it's somehow obvious, you get the best part of the answer from people who listed they're own lens, being it exciting or not. i guess this thread, it's somehow become a typical \"what's your favourite lens?\" i don't discuss one's favourite lens, but exciting for me has a different meaning. it means fun and maybe creative at the same way, something able to deliver our full pontential, maybe. it's like make love, or make love with someone like a \"wild\" and fully herotic girl (that maybe you can't even control)... ...only 50 noct and 75lux are those kind of girl (imho) in this little bunch... p.s. i always prefere exciting girls! --img--  good precisation, maurizio... and so i confess the absolutely most exciting is the summarex 85 (followed closely by sa 21 f4 and lux 35 preasph ... simply, a certain kind of chroming makes my crazy....); i haven't ever practiced nude studio photo... but sometimes i imagine which pic would i like to take with the right model and the 3 items above...--img--  ... posed in apt -----> positions !!! ...", "sortedWord": "None", "identifyer": 21009, "year": "2008"}, {"Unnamed: 0": 408222, "autor": "Mauribix", "date": 1214826000000, "content": "Good precisation, Maurizio... and so I confess the absolutely most exciting is the Summarex 85 (followed closely by SA 21 f4 and Lux 35 preasph ... simply, a certain kind of chroming makes my CRAZY....); I haven't ever practiced nude studio photo... but sometimes I imagine which pic would I like to take with the right model and the 3 items above...--img--  ... posed in apt positions... ...eheheh... Grazie Luigi!", "link": "https://www.l-camera-forum.com/topic/55623-which-are-your-most-exciting-m-lenses/page/5/?tab=comments#comment-592737", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "good precisation, maurizio... and so i confess the absolutely most exciting is the summarex 85 (followed closely by sa 21 f4 and lux 35 preasph ... simply, a certain kind of chroming makes my crazy....); i haven't ever practiced nude studio photo... but sometimes i imagine which pic would i like to take with the right model and the 3 items above...--img--  ... posed in apt -----> positions !!! ... ...eheheh... grazie luigi!", "sortedWord": "None", "identifyer": 21015, "year": "2008"}, {"Unnamed: 0": 451932, "autor": "audidudi", "date": 1218213000000, "content": "That explains why my lens looked completely new after I had my sensor replaced in june this year! All for free! As you can see clearly in the photo of my LC1 below, the sensor is actually attached to the lens with three T4 (or T5, I forget) screws. Under the screws are spacers and springs that serve to properly position the sensor and take up any slack in tolerances from unit-to-unit. The sensor can indeed be removed from the lens and replaced separately, and Panasonic lists the sensor for sale as a separate part at its online parts site. I all know this for a fact because I've modified one of my cameras by removing the OEM hot filter that goes between the sensor and lens (the purplish piece of glass you see sitting on the right side of the camera) and replacing it with an IR-pass only filter to dedicate it to IR operation. Unfortunately, I haven't had time to write anything further about the conversion (the only tricky bit was cutting the glass for the filter and sizing it to its final dimensions) or post any of the photos I've shot with the camera setup this way, but it's working great so far and I will be taking it to the Grand Canyon with me on my upcoming photo outing, so I'm expecting to give it a thorough workout shortly. --img-- ", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/13/?tab=comments#comment-623511", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "that explains why my lens looked completely new after i had my sensor replaced in june this year! all for free! as you can see clearly in the photo of my lc1 below, the sensor is actually attached to the lens with three t4 (or t5, i forget) screws. under the screws are spacers and springs that serve to properly -----> position !!!  the sensor and take up any slack in tolerances from unit-to-unit. the sensor can indeed be removed from the lens and replaced separately, and panasonic lists the sensor for sale as a separate part at its online parts site. i all know this for a fact because i've modified one of my cameras by removing the oem hot filter that goes between the sensor and lens (the purplish piece of glass you see sitting on the right side of the camera) and replacing it with an ir-pass only filter to dedicate it to ir operation. unfortunately, i haven't had time to write anything further about the conversion (the only tricky bit was cutting the glass for the filter and sizing it to its final dimensions) or post any of the photos i've shot with the camera setup this way, but it's working great so far and i will be taking it to the grand canyon with me on my upcoming photo outing, so i'm expecting to give it a thorough workout shortly. --img-- ", "sortedWord": "None", "identifyer": 15478, "year": "2008"}], "name": "positionL-Forum2008"}