{"interestingcomments": [{"Unnamed: 0": 379566, "autor": "Guest Walt", "date": 1184396100000, "content": "Thanks Sean. I will try the Skopar and the Milich (?) adapter (though I find I usually need a very small amount of density vignetting to hold an image together). I don't know why people don't understand the contrast issue with regard to digital cameras because it's fairly obvious in the seeing. A decade or two ago, we were still always fighting for more contrast in the camera end of the process, or at least I was. I think this was because of the latitude of negative film and because lens flare and flat light were so often a problem--and we didn't have PS with its huge array of controls to raise contrast selectively (but not so easily lower it). Simply increasing a paper grade or two solved the overall contrast problem but introduced new local problems that were very difficult to handle without the highly selective tools we have now. Today lens contrast (but not flare control) is mostly a liability. On this issue, too, Leica is way behind the times and they have an entire line of otherwise good lenses that is borderline unsuitable for digital photography. It's as if they are still trying to excel in solving a 1980 issue. And, yes, you are right, I do confuse DOF with sharpness and I forget that I am doing that. Thanks for the reminder. On Mitch's comment about innovation, this was really the point of my original post, though you made it much more succintly. Leica was, at one time, an innovator and I guess I was expecting that of the M8. Your post made me realize that Leica didn't at all go into the M8 project to make an innovative \"Leica class\" digital camera. They went into it to try to squeeze out a little more viability and salability from the M camera -- heavy, soft brass top and bottom plates and all. It's as if they were dragged kicking and screaming into a digital camera by technological and market forces they could no longer resist. If they had come from a creative position instead of a reactive one, they might have made a camera like the GR-D but three times the size and with a rangefinder, M mount and some other innovations that I can't even imagine, but they as camera designers should be thinking about. And wouldn't that have been an amazing, amazing beast? They would have set the Japanese and their DSLRs on their ears. And, for Hank's comments, maybe what I need for my work is a digital IIIF. Let's see, would that be a GR-D? Or maybe the new camera Sean is testing? Or the new GR-D that Ricoh must have been working on since before they released the current one? Good night, Walt", "link": "https://www.l-camera-forum.com/topic/28906-leica-m8-and-ricoh-gr-d/?tab=comments#comment-305440", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks sean. i will try the skopar and the milich (?) adapter (though i find i usually need a very small amount of density vignetting to hold an image together). i don't know why people don't understand the contrast issue with regard to digital cameras because it's fairly obvious in the seeing. a decade or two ago, we were still always fighting for more contrast in the camera end of the process, or at least i was. i think this was because of the latitude of negative film and because lens flare and flat light were so often a problem--and we didn't have ps with its huge array of controls to raise contrast selectively (but not so easily lower it). simply increasing a paper grade or two solved the overall contrast problem but introduced new local problems that were very difficult to handle without the highly selective tools we have now. today lens contrast (but not flare control) is mostly a liability. on this issue, too, leica is way behind the times and they have an entire line of otherwise good lenses that is borderline unsuitable for digital photography. it's as if they are still trying to excel in solving a 1980 issue. and, yes, you are right, i do confuse dof with sharpness and i forget that i am doing that. thanks for the reminder. on mitch's comment about innovation, this was really the point of my original post, though you made it much more succintly. leica was, at one time, an innovator and i guess i was expecting that of the m8. your post made me realize that leica didn't at all go into the m8 project to make an innovative \"leica class\" digital camera. they went into it to try to squeeze out a little more viability and salability from the m camera -- heavy, soft brass top and bottom plates and all. it's as if they were dragged kicking and screaming into a digital camera by technological and market forces they could no longer resist. if they had come from a creative -----> position !!!  instead of a reactive one, they might have made a camera like the gr-d but three times the size and with a rangefinder, m mount and some other innovations that i can't even imagine, but they as camera designers should be thinking about. and wouldn't that have been an amazing, amazing beast? they would have set the japanese and their dslrs on their ears. and, for hank's comments, maybe what i need for my work is a digital iiif. let's see, would that be a gr-d? or maybe the new camera sean is testing? or the new gr-d that ricoh must have been working on since before they released the current one? good night, walt", "sortedWord": "None", "identifyer": 40954, "year": "2007"}, {"Unnamed: 0": 379571, "autor": "hankg", "date": 1184418900000, "content": "M camera -- heavy, soft brass top and bottom plates and all. It's as if they were dragged kicking and screaming into a digital camera by technological and market forces they could no longer resist. If they had come from a creative position instead of a reactive one, they might have made a camera like the GR-D but three times the size and with a rangefinder, M mount and some other innovations that I can't even imagine, but they as camera designers should be thinking about. That kind of innovation involves more risk. With one foot in the grave, a very conservative user base that punished the company severely with the innovative M5 -it's no surprise that their first effort was to make a digital M staying as close to the film camera as possible. Even to the bit absurd point of keeping the removable base and using brass (black lacquer to follow in a special edition). I think though that if the company regains profitability and stability that you are going to see more risk taking and innovation on the part of the new management. I could see room for 2 types of RF lines. A smaller chip (maybe 2x) reportage camera (better IQ, high ISO and dynamic range then the GRD) that has a lowest ISO of 320 or 400 skewing performance to low light and a bigger chip medium format quality camera. They could concievably both use the M mount but with a line of made for digital lenses for the small format camera. Maybe they could combine the guts of a D camera with the M mount and RF finder with Asian manufacturing to get the price down. A wide angle camera could dispense with the RF finder altogether.", "link": "https://www.l-camera-forum.com/topic/28906-leica-m8-and-ricoh-gr-d/page/2/?tab=comments#comment-305676", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "m camera -- heavy, soft brass top and bottom plates and all. it's as if they were dragged kicking and screaming into a digital camera by technological and market forces they could no longer resist. if they had come from a creative -----> position !!!  instead of a reactive one, they might have made a camera like the gr-d but three times the size and with a rangefinder, m mount and some other innovations that i can't even imagine, but they as camera designers should be thinking about. that kind of innovation involves more risk. with one foot in the grave, a very conservative user base that punished the company severely with the innovative m5 -it's no surprise that their first effort was to make a digital m staying as close to the film camera as possible. even to the bit absurd point of keeping the removable base and using brass (black lacquer to follow in a special edition). i think though that if the company regains profitability and stability that you are going to see more risk taking and innovation on the part of the new management. i could see room for 2 types of rf lines. a smaller chip (maybe 2x) reportage camera (better iq, high iso and dynamic range then the grd) that has a lowest iso of 320 or 400 skewing performance to low light and a bigger chip medium format quality camera. they could concievably both use the m mount but with a line of made for digital lenses for the small format camera. maybe they could combine the guts of a d camera with the m mount and rf finder with asian manufacturing to get the price down. a wide angle camera could dispense with the rf finder altogether.", "sortedWord": "None", "identifyer": 40959, "year": "2007"}, {"Unnamed: 0": 382228, "autor": "giordano", "date": 1188105540000, "content": "Everybody speaks of the Viso III as having a quick-return mirror. I have a III, and the only diff between the two settings is that the mirror either rises gradually as you depress the arm, or it snaps up at end of the arm travel. In either setting, the return of the mirror is gradual, as you let the arm rise after exposure, i.e., there is no automatic mirror return. Is something amiss with my III? It's \"quick return\", not \"instant return\". On the Visoflex III the mirror drops as soon as you let go of the arm, but on the Visoflex II it stays up until you cock the mechanism with a little chrome lever that doesn't exist on the III. The separate cocking lever means that the arm of the Viso II has a much shorter travel. In its resting position it's almost touching the shutter release (like the Viso III with the mirror locked up).", "link": "https://www.l-camera-forum.com/topic/31884-visoflex-question/?tab=comments#comment-338167", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "everybody speaks of the viso iii as having a quick-return mirror. i have a iii, and the only diff between the two settings is that the mirror either rises gradually as you depress the arm, or it snaps up at end of the arm travel. in either setting, the return of the mirror is gradual, as you let the arm rise after exposure, i.e., there is no automatic mirror return. is something amiss with my iii? it's \"quick return\", not \"instant return\". on the visoflex iii the mirror drops as soon as you let go of the arm, but on the visoflex ii it stays up until you cock the mechanism with a little chrome lever that doesn't exist on the iii. the separate cocking lever means that the arm of the viso ii has a much shorter travel. in its resting -----> position !!!  it's almost touching the shutter release (like the viso iii with the mirror locked up).", "sortedWord": "None", "identifyer": 43626, "year": "2007"}, {"Unnamed: 0": 382821, "autor": "Etruscello", "date": 1188140760000, "content": " I had DAG code my 16mm Hologon. (Don Goldberg had done the original conversion from G to M.) He does brilliant work! I asked DAG to paint in the WATE code. I find, when the WATE menu comes up on the M8, that it is best to set the focal length to 21mm, not 16mm, for the fullest correction for cyan corners. (One WATE owner tells him he has to set his menu to 18mm for the 16mm lens position. Apparently, the M8 frimware is still overcorrecting for the WATE -- too much red in the corners.) There is no danger to the shutter with the Hologon's protruding rear lens element. For some exposure situations, you may have to set the shutter manually, as the protruding element does cover the light meter partially. No regrets on the coding. This is a superb lens. My favorite use of it is with B&W and true IR (with dark IR filter). For this purpose, I set lens detection on the M8 to \"On\" -- not to cyan correction. Tom P.", "link": "https://www.l-camera-forum.com/topic/29483-zeiss-hologon-with-m-mount-and-6-bit-code/?tab=comments#comment-338585", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " i had dag code my 16mm hologon. (don goldberg had done the original conversion from g to m.) he does brilliant work! i asked dag to paint in the wate code. i find, when the wate menu comes up on the m8, that it is best to set the focal length to 21mm, not 16mm, for the fullest correction for cyan corners. (one wate owner tells him he has to set his menu to 18mm for the 16mm lens -----> position !!! . apparently, the m8 frimware is still overcorrecting for the wate -- too much red in the corners.) there is no danger to the shutter with the hologon's protruding rear lens element. for some exposure situations, you may have to set the shutter manually, as the protruding element does cover the light meter partially. no regrets on the coding. this is a superb lens. my favorite use of it is with b&w and true ir (with dark ir filter). for this purpose, i set lens detection on the m8 to \"on\" -- not to cyan correction. tom p.", "sortedWord": "None", "identifyer": 44220, "year": "2007"}, {"Unnamed: 0": 383751, "autor": "sean_reid", "date": 1181264940000, "content": "call me a dinosaur, but after owning many Triumphs, BSA's, Nortons, Hondas, Maicos, Husqvarnas, BMW;s, (even a Cushman, egad!) I now ride a HD Road King and love it. Just came back from 900 miles on and Electroglide in New Mexico with passenger and the M8. camera worked fine. Absolutely wonderful landscape for 360 degrees, but the biggest problem was the pia of pulling over, stopping, removing helmet, extracting camera from saddlebag, etc. kept the camera in its padded A&A bag int the rear luggage compartment, away from the wheels and heat of the saddle bags. Hi John, We've had a lot of Road Kings on tour and used a small fleet of them for a tour we did for Daimler-Chrysler in 2003. It isn't quite fashionable in most Harley circles to use a tank bag but there are some magnetic bags that can go on the RK without blocking the speedo. One just has to reach under the bag a little to turn the ignition position switch. We had quite a few people riding with RKs and tank bags. It certainly would make your camera more accessible. If you're interested I'll see if I find one of the bags we used and I'll tell you what it was. Cheers, Sean", "link": "https://www.l-camera-forum.com/topic/23730-m8-motorcycles-vibration-resistance/page/3/?tab=comments#comment-275964", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "call me a dinosaur, but after owning many triumphs, bsa's, nortons, hondas, maicos, husqvarnas, bmw;s, (even a cushman, egad!) i now ride a hd road king and love it. just came back from 900 miles on and electroglide in new mexico with passenger and the m8. camera worked fine. absolutely wonderful landscape for 360 degrees, but the biggest problem was the pia of pulling over, stopping, removing helmet, extracting camera from saddlebag, etc. kept the camera in its padded a&a bag int the rear luggage compartment, away from the wheels and heat of the saddle bags. hi john, we've had a lot of road kings on tour and used a small fleet of them for a tour we did for daimler-chrysler in 2003. it isn't quite fashionable in most harley circles to use a tank bag but there are some magnetic bags that can go on the rk without blocking the speedo. one just has to reach under the bag a little to turn the ignition -----> position !!!  switch. we had quite a few people riding with rks and tank bags. it certainly would make your camera more accessible. if you're interested i'll see if i find one of the bags we used and i'll tell you what it was. cheers, sean", "sortedWord": "None", "identifyer": 45152, "year": "2007"}, {"Unnamed: 0": 383752, "autor": "Rolo", "date": 1181286660000, "content": "I now ride a HD Road King and love it. My last mount before this one was a 1550cc Road King. I used it with a Corbin single seat and strapped a backpack, cover up, in the pillion position. If the pillion seat was in position I loaded my camera gear into the hard side panniers in a narrow bag that enabled me access to the gear without withdrawing it. These have the advantage of opening up towards you and provides a solid shelf on which to store film/filters/lenses etc. Great fun and a fabulous group of people riding them. Rolo", "link": "https://www.l-camera-forum.com/topic/23730-m8-motorcycles-vibration-resistance/page/3/?tab=comments#comment-276077", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i now ride a hd road king and love it. my last mount before this one was a 1550cc road king. i used it with a corbin single seat and strapped a backpack, cover up, in the pillion -----> position !!! . if the pillion seat was in position i loaded my camera gear into the hard side panniers in a narrow bag that enabled me access to the gear without withdrawing it. these have the advantage of opening up towards you and provides a solid shelf on which to store film/filters/lenses etc. great fun and a fabulous group of people riding them. rolo", "sortedWord": "None", "identifyer": 45153, "year": "2007"}, {"Unnamed: 0": 383873, "autor": "marknorton", "date": 1176160200000, "content": "Looking now at the top… --img--  What’s immediately striking is the weight of the top cover, fully 20% of the total camera weight. It’s a very impressive piece of machining. This picture is with the LCD display removed, the shutter speed dial dismantled, the power switch partially dismantled, the shutter release switch removed and the circuit board unsoldered from the hot shoe connections. There are three screws underneath the circuit board securing the hot shoe. It is also glued in with silicone sealant which may be to improve weather proofing, provide additional insulation from possible high voltages on the hot shoe contact or discourage tampering with the serial number. The circuit board is actually soldered to the 4 hot-shoe contacts and the fourth mounting screw (top right) makes for a direct ground connection which will help avoid any ill-effects of using a flash with a high voltage trigger. --img--  Looking at the circuit board you can see: A contact pattern for the shutter speed dial, the power switch is similar. There are 33 possible positions of the shutter speed dial and a rotating contact connects one or more of the patches to ground at each position. By looking at which contacts are connected to ground, the microprocessor can figure out the selected shutter speed. The board uses a Philips (now NXP) technology called I-squared C (I2C) which uses a serial interface to connect the circuitry to the microprocessor. Here, there’s an I2C LCD display driver (bottom right) and an 8 bit port expander (bottom left). The shutter speed dial requires 6 data bits to specify its 33 possible positions, the power switch 2 bits and the shutter release 2 bits. If, for example, the 8 bit port expander was used for the power switch and the shutter speed dial, a single pair of serial data and clock lines could provide the complete interface to read the power switch and shutter speed dial and support the LCD display. The port expander used can also interrupt the micro when an input changes which avoids the need to have the software repeatedly scanning for data change. This may also be used as part of the wake-up sequence when the camera is turned on or the shutter release pressed. A high voltage transistor (the black component to the left of the hot shoe connections) connects directly to the hot shoe centre contact. It’s this which fires the flash under control of the microprocessor, not the old fashioned electrical contact linked to the physical shutter. The flex print, bottom left connects the top to the rest of the camera and its 13 connections provide the following interface: - Power for the top of the camera - Flash trigger - Flash SCA bi-directional communications - LCD functionality - Status of the Shutter Speed Dial, Power Switch and Shutter Release - Wake-Up Interrupt To be clear, the power switch here is not actually interrupting power to the camera, it’s signalling instead to the microprocessor to start up/shutdown the camera. Here’s a picture with the Shutter Speed dial and Power Switches re-assembled. The metal “ears” serve to limit the motion of the Power Switch. --img--  I haven’t yet at this point re-soldered the flash hot shoe connections… The detent for the Shutter Speed dial is provided by a pair of ball bearings on the outside of the camera. A metal block has two holes carrying a spring and ball bearing. These are at different distances from the centre line and each engages in one of the two circles of detents on the underside of the shutter speed dial. The outer ring handles the main shutter speeds, B and A and the inner ring handles the half-stop speeds. --img-- --img--  The top flex print has 4 contacts which screw to the sides of the shutter release switch. Here is it in pieces: --img--  There are 3 black screws to screw into onto the back of the power switch and the gold plunger makes the required connections as it is pressed. The contacts are made of very small springs and gold ball bearings. The screws, springs and plungers (only one shown here) are used to set the strength of the detents for the shutter release. Tiny components, one sneeze and you’d be in trouble…", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/?tab=comments#comment-224261", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "looking now at the top… --img--  what’s immediately striking is the weight of the top cover, fully 20% of the total camera weight. it’s a very impressive piece of machining. this picture is with the lcd display removed, the shutter speed dial dismantled, the power switch partially dismantled, the shutter release switch removed and the circuit board unsoldered from the hot shoe connections. there are three screws underneath the circuit board securing the hot shoe. it is also glued in with silicone sealant which may be to improve weather proofing, provide additional insulation from possible high voltages on the hot shoe contact or discourage tampering with the serial number. the circuit board is actually soldered to the 4 hot-shoe contacts and the fourth mounting screw (top right) makes for a direct ground connection which will help avoid any ill-effects of using a flash with a high voltage trigger. --img--  looking at the circuit board you can see: a contact pattern for the shutter speed dial, the power switch is similar. there are 33 possible -----> positions !!!  of the shutter speed dial and a rotating contact connects one or more of the patches to ground at each position. by looking at which contacts are connected to ground, the microprocessor can figure out the selected shutter speed. the board uses a philips (now nxp) technology called i-squared c (i2c) which uses a serial interface to connect the circuitry to the microprocessor. here, there’s an i2c lcd display driver (bottom right) and an 8 bit port expander (bottom left). the shutter speed dial requires 6 data bits to specify its 33 possible positions, the power switch 2 bits and the shutter release 2 bits. if, for example, the 8 bit port expander was used for the power switch and the shutter speed dial, a single pair of serial data and clock lines could provide the complete interface to read the power switch and shutter speed dial and support the lcd display. the port expander used can also interrupt the micro when an input changes which avoids the need to have the software repeatedly scanning for data change. this may also be used as part of the wake-up sequence when the camera is turned on or the shutter release pressed. a high voltage transistor (the black component to the left of the hot shoe connections) connects directly to the hot shoe centre contact. it’s this which fires the flash under control of the microprocessor, not the old fashioned electrical contact linked to the physical shutter. the flex print, bottom left connects the top to the rest of the camera and its 13 connections provide the following interface: - power for the top of the camera - flash trigger - flash sca bi-directional communications - lcd functionality - status of the shutter speed dial, power switch and shutter release - wake-up interrupt to be clear, the power switch here is not actually interrupting power to the camera, it’s signalling instead to the microprocessor to start up/shutdown the camera. here’s a picture with the shutter speed dial and power switches re-assembled. the metal “ears” serve to limit the motion of the power switch. --img--  i haven’t yet at this point re-soldered the flash hot shoe connections… the detent for the shutter speed dial is provided by a pair of ball bearings on the outside of the camera. a metal block has two holes carrying a spring and ball bearing. these are at different distances from the centre line and each engages in one of the two circles of detents on the underside of the shutter speed dial. the outer ring handles the main shutter speeds, b and a and the inner ring handles the half-stop speeds. --img-- --img--  the top flex print has 4 contacts which screw to the sides of the shutter release switch. here is it in pieces: --img--  there are 3 black screws to screw into onto the back of the power switch and the gold plunger makes the required connections as it is pressed. the contacts are made of very small springs and gold ball bearings. the screws, springs and plungers (only one shown here) are used to set the strength of the detents for the shutter release. tiny components, one sneeze and you’d be in trouble…", "sortedWord": "None", "identifyer": 45275, "year": "2007"}, {"Unnamed: 0": 383876, "autor": "marknorton", "date": 1176160800000, "content": "The Shutter The shutter is of course made by Copal. It’s operated by two small electro-magnets and a mechanical cocking lever. There’s also a contact in there which may be used to indicate back to the microprocessor whether it’s cocked or not or else it might be used for flash purposes. Before we remove the shutter, let’s look at the bottom of the camera…. --img--  Here, you can see the shutter cocking lever (to the top and left of the large flat screw). The shutter is cocked by pulling the lever to the right. That’s done by the copper coloured arm which is connected to a lever which is in turn moved by the rotating cam. --img--  When the shutter needs to be cocked, the cam does a single rotation, the arm moves first to the right and then the left to cock the shutter. There’s an optical position sensor so that the microprocessor can monitor the motion of the cocking level in case something gets jammed. At rest the sensor is blocked. Early in the motion, the sensor becomes unblocked until the shutter is cocked. --img--  --img--  The firmware in the M16C can monitor the status returned by the sensor and also perform a reasonableness test by measuring the time the shutter cocking action takes.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/?tab=comments#comment-224267", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the shutter the shutter is of course made by copal. it’s operated by two small electro-magnets and a mechanical cocking lever. there’s also a contact in there which may be used to indicate back to the microprocessor whether it’s cocked or not or else it might be used for flash purposes. before we remove the shutter, let’s look at the bottom of the camera…. --img--  here, you can see the shutter cocking lever (to the top and left of the large flat screw). the shutter is cocked by pulling the lever to the right. that’s done by the copper coloured arm which is connected to a lever which is in turn moved by the rotating cam. --img--  when the shutter needs to be cocked, the cam does a single rotation, the arm moves first to the right and then the left to cock the shutter. there’s an optical -----> position !!!  sensor so that the microprocessor can monitor the motion of the cocking level in case something gets jammed. at rest the sensor is blocked. early in the motion, the sensor becomes unblocked until the shutter is cocked. --img--  --img--  the firmware in the m16c can monitor the status returned by the sensor and also perform a reasonableness test by measuring the time the shutter cocking action takes.", "sortedWord": "None", "identifyer": 45278, "year": "2007"}, {"Unnamed: 0": 383877, "autor": "marknorton", "date": 1176160920000, "content": " Shutter Lock When the shutter is fully cocked, a lever is actually which “sticks” in the actuated position using a permanent magnet solenoid. These use a pulse of power to release them, not actuate them. Here is it in “unlocked” position: --img--  Here is it in “locked” position: --img--  You can see the armature – the bit that moves - has been filled with silicone, presumably to stop it rattling and making a noise. There’s another position sensor on the reverse side so that the micro can tell if the shutter is locked or not. In operation, as the shutter is cocked, the armature moves towards to solenoid and sticks because the core is a permanent magnet. Under microprocessor control, a current is passed through the solenoid to release it. It was said the that the change to the shutter noise in V1.092 firmware was because this lock is released earlier in the shutter release cycle and becomes audible as a separate event. The shutter is cocked using a small motor made by a Japanese manufacturer, Namiki, and a finely engineered gear train which turns the cam. The profile of the cam has, apparently been tailored to provide the best action with the shutter. In this picture, you can see the complete shutter cocking motor, shutter lock and control electronics. --img--  With some unsoldering, I’ve removed the circuit and unfolded it: --img--  I tried running the motor directly from a 3v battery and, outside the camera, it is much quieter than when inside. I think at least some of the excessive shutter noise comes from vibrations from the motor being amplified because it is directly mounted on the camera body. A compliant mounting to reduce transmission might reduce the noise.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/?tab=comments#comment-224269", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " shutter lock when the shutter is fully cocked, a lever is actually which “sticks” in the actuated -----> position !!!  using a permanent magnet solenoid. these use a pulse of power to release them, not actuate them. here is it in “unlocked” position: --img--  here is it in “locked” position: --img--  you can see the armature – the bit that moves - has been filled with silicone, presumably to stop it rattling and making a noise. there’s another position sensor on the reverse side so that the micro can tell if the shutter is locked or not. in operation, as the shutter is cocked, the armature moves towards to solenoid and sticks because the core is a permanent magnet. under microprocessor control, a current is passed through the solenoid to release it. it was said the that the change to the shutter noise in v1.092 firmware was because this lock is released earlier in the shutter release cycle and becomes audible as a separate event. the shutter is cocked using a small motor made by a japanese manufacturer, namiki, and a finely engineered gear train which turns the cam. the profile of the cam has, apparently been tailored to provide the best action with the shutter. in this picture, you can see the complete shutter cocking motor, shutter lock and control electronics. --img--  with some unsoldering, i’ve removed the circuit and unfolded it: --img--  i tried running the motor directly from a 3v battery and, outside the camera, it is much quieter than when inside. i think at least some of the excessive shutter noise comes from vibrations from the motor being amplified because it is directly mounted on the camera body. a compliant mounting to reduce transmission might reduce the noise.", "sortedWord": "None", "identifyer": 45279, "year": "2007"}, {"Unnamed: 0": 383878, "autor": "marknorton", "date": 1176161100000, "content": "Shutter Removal The shutter is held in by 3 screws and a single flex-print to the shutter/motor-wind controller. One oddity is the bottom right mounting where instead of a screw, the corner of the shutter is secured by a plate: --img--  Originally I thought that this was because the mounting hole ended up in the wrong position but no, if you remove the plate, the hole for the screw is perfectly aligned, so it’s a mystery why they didn’t use it. --img--  Once removed, the shutter is fine, almost watch-like device. No, I didn’t take it apart! --img--  --img--  --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/?tab=comments#comment-224272", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "shutter removal the shutter is held in by 3 screws and a single flex-print to the shutter/motor-wind controller. one oddity is the bottom right mounting where instead of a screw, the corner of the shutter is secured by a plate: --img--  originally i thought that this was because the mounting hole ended up in the wrong -----> position !!!  but no, if you remove the plate, the hole for the screw is perfectly aligned, so it’s a mystery why they didn’t use it. --img--  once removed, the shutter is fine, almost watch-like device. no, i didn’t take it apart! --img--  --img--  --img--  --img-- ", "sortedWord": "None", "identifyer": 45280, "year": "2007"}, {"Unnamed: 0": 384036, "autor": "marknorton", "date": 1176270960000, "content": "After looking thur all the inside mechanics, do you think it is feasible to come up with a silent shutter by deferring the motor rewind till we release our finger from the shutter press? Matthew, Both the actuation of the shutter and the motor are controlled by the M16C processor which also has direct access to the position of the shutter release so that it would be perfectly possible to defer the cocking of the shutter until the shutter release is released, all selected from a menu option which could be part of a profile. Alternatively, it's possible to think of an add-on Leicavit-type manual wind, see this picture. http://www.leica-camera-user.com/digital-forum/21331-anatomy-leica-m8-4.html#post224784", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/9/?tab=comments#comment-225388", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "after looking thur all the inside mechanics, do you think it is feasible to come up with a silent shutter by deferring the motor rewind till we release our finger from the shutter press? matthew, both the actuation of the shutter and the motor are controlled by the m16c processor which also has direct access to the -----> position !!!  of the shutter release so that it would be perfectly possible to defer the cocking of the shutter until the shutter release is released, all selected from a menu option which could be part of a profile. alternatively, it's possible to think of an add-on leicavit-type manual wind, see this picture. http://www.leica-camera-user.com/digital-forum/21331-anatomy-leica-m8-4.html#post224784", "sortedWord": "None", "identifyer": 45438, "year": "2007"}, {"Unnamed: 0": 384094, "autor": "marknorton", "date": 1177771980000, "content": "Scott There are two sensors for the shutter wind, one to detect motion and the second to detect the position of the shutter lock. The rangefinder is completely independent of the rest of the camera. Its only inputs are the roller lever and frame lever position. The flex you're referring to makes its way down the front of the camera to the 6 bit sensor and frame lever position switches, there's nothing in the camera to let the camera electronics know the position of the roller and hence focusssing cam/focussing distance. As you know, the roller only moves about 3-4mm between closest focus and infinity, so sensing that position to, say, 0.01mm would be quite tough.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/12/?tab=comments#comment-240835", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "scott there are two sensors for the shutter wind, one to detect motion and the second to detect the -----> position !!!  of the shutter lock. the rangefinder is completely independent of the rest of the camera. its only inputs are the roller lever and frame lever position. the flex you're referring to makes its way down the front of the camera to the 6 bit sensor and frame lever position switches, there's nothing in the camera to let the camera electronics know the position of the roller and hence focusssing cam/focussing distance. as you know, the roller only moves about 3-4mm between closest focus and infinity, so sensing that position to, say, 0.01mm would be quite tough.", "sortedWord": "None", "identifyer": 45496, "year": "2007"}, {"Unnamed: 0": 384133, "autor": "marknorton", "date": 1182074760000, "content": "Thank you! These are all taken with a Nikon D2X with a 60mm f2.8 macro lens and the new macro flash mounted on the front. The sensor is bonded to the carrier plate, precisely positioned with the sensor board soldered on the back - 4 rows of 15 pins. You're correct it's not possible to see the front of the board without unsoldering it and that was a step too far! The sensor has precise timing requirements and I thought they would use the Kodak clock chip (KSC-1000 timing generator) but I can see no evidence of it. Instead, it's likely they are using the Xilinx as a programmable timing generator so that they can fine tune it in firmware. The firmeare update includes a load for the Xilinx. As regards the ADC, things like grounding, stray capacitance and inductance will significantly affect performance so it's important to keep the ADC physically close to the sensor. My guess is that the ADC is on the other sie of the board and the most likely candidate is a dual 14 bit ADC from Analog Devices, something like this: Analog Devices AD9248 - Dual 14-Bit, 20/40/65 MSPS, 3 V Analog-to-Digital Converter It may also be quite simple to interface the ADC directly to the Blackfin processor.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/14/?tab=comments#comment-283155", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "thank you! these are all taken with a nikon d2x with a 60mm f2.8 macro lens and the new macro flash mounted on the front. the sensor is bonded to the carrier plate, precisely -----> positioned !!!  with the sensor board soldered on the back - 4 rows of 15 pins. you're correct it's not possible to see the front of the board without unsoldering it and that was a step too far! the sensor has precise timing requirements and i thought they would use the kodak clock chip (ksc-1000 timing generator) but i can see no evidence of it. instead, it's likely they are using the xilinx as a programmable timing generator so that they can fine tune it in firmware. the firmeare update includes a load for the xilinx. as regards the adc, things like grounding, stray capacitance and inductance will significantly affect performance so it's important to keep the adc physically close to the sensor. my guess is that the adc is on the other sie of the board and the most likely candidate is a dual 14 bit adc from analog devices, something like this: analog devices ad9248 - dual 14-bit, 20/40/65 msps, 3 v analog-to-digital converter it may also be quite simple to interface the adc directly to the blackfin processor.", "sortedWord": "None", "identifyer": 45535, "year": "2007"}, {"Unnamed: 0": 384704, "autor": "blakley", "date": 1195405800000, "content": "Thanks for the testing.To me the new lenses have more pleasing/\"better\" bokeh. Then Again I find the skin shows less texture with the new lenses, and a little bit less pop. I think price-value wise 75/2.7 and 90/2.5 are interesting to get. For 35 and 50mm I would rather get a used cron than a new Summarit. Cheers, Tom To my eye it's more complicated than that. The 35 Summarit has better bokeh than the tested 35 Summicron, but its sharpness and contrast both seem lower. On balance, I'd call this race about even but wouldn't buy the Summarit if I already had another lens - but if I were starting from a \"no lens\" position I'd buy the Summarit. The 50 Summarit seems to me to be a clear loser against the 50 Summilux ASPH, but hey, that's the best 35mm-mount lens in the world at the moment, right? Here I would definitely forego the Summarit for the Summilux, both because of the speed differential and because I like everything about the picture quality of the Lux better. The 90 Summarit seems to me to be the real winner in this test. Both in bokeh and in sharpness it seems entirely the equal of the 90 Summicron - in fact it's hard to tell the two sets of pictures apart. Given the substantial size and weight advantage of the Summarit, I might well consider getting one of these.", "link": "https://www.l-camera-forum.com/topic/38334-summarit-series-355090-ugly-test/page/3/?tab=comments#comment-405853", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks for the testing.to me the new lenses have more pleasing/\"better\" bokeh. then again i find the skin shows less texture with the new lenses, and a little bit less pop. i think price-value wise 75/2.7 and 90/2.5 are interesting to get. for 35 and 50mm i would rather get a used cron than a new summarit. cheers, tom to my eye it's more complicated than that. the 35 summarit has better bokeh than the tested 35 summicron, but its sharpness and contrast both seem lower. on balance, i'd call this race about even but wouldn't buy the summarit if i already had another lens - but if i were starting from a \"no lens\" -----> position !!!  i'd buy the summarit. the 50 summarit seems to me to be a clear loser against the 50 summilux asph, but hey, that's the best 35mm-mount lens in the world at the moment, right? here i would definitely forego the summarit for the summilux, both because of the speed differential and because i like everything about the picture quality of the lux better. the 90 summarit seems to me to be the real winner in this test. both in bokeh and in sharpness it seems entirely the equal of the 90 summicron - in fact it's hard to tell the two sets of pictures apart. given the substantial size and weight advantage of the summarit, i might well consider getting one of these.", "sortedWord": "None", "identifyer": 46108, "year": "2007"}, {"Unnamed: 0": 384750, "autor": "c6gowin", "date": 1196050440000, "content": "I believe the Summarit line will be a winner for Leica. I suspect they will steal some sales away from Leica's other more expensive lenses because they are so good. However, the fact that they are so good and more competitively priced puts Leica in position to take sales from C/V and Zeiss. The other sales position the Summarits fill is what Guy touched on earlier - a more affordable gap lens. Thats the position I am in with the 75mm focal length. I already have the 50 Lux and 90 Cron AA and would like to have a 75mm. In my case, its difficult to justify the cost of the 75mm Cron AA - not as difficult to justify the Summarit.", "link": "https://www.l-camera-forum.com/topic/38334-summarit-series-355090-ugly-test/page/5/?tab=comments#comment-411708", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i believe the summarit line will be a winner for leica. i suspect they will steal some sales away from leica's other more expensive lenses because they are so good. however, the fact that they are so good and more competitively priced puts leica in -----> position !!!  to take sales from c/v and zeiss. the other sales position the summarits fill is what guy touched on earlier - a more affordable gap lens. thats the position i am in with the 75mm focal length. i already have the 50 lux and 90 cron aa and would like to have a 75mm. in my case, its difficult to justify the cost of the 75mm cron aa - not as difficult to justify the summarit.", "sortedWord": "None", "identifyer": 46154, "year": "2007"}, {"Unnamed: 0": 451684, "autor": "robbegibson", "date": 1175106540000, "content": "Amin, I just had my Digilux 2 sensor replaced. It was warranteed but I would have paid the $600 or so if it wasn't. I don't know of another camera that offers the package of features, image quality and 'feel' for lack of a better term. I should also mention the two position built-in flash. It makes a wonderful bounced light. Yes, I know there are lots of ways to accomplish all the above, but not all in one compact package that I know of. Even the Digilux 3 doesn't get there -it's larger, it's zoom range with the supplied lens is only 10mm (35mm equiv.) longer and the Digilux 2 lens is faster. Have fun! Robbe Gibson", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/?tab=comments#comment-214530", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "amin, i just had my digilux 2 sensor replaced. it was warranteed but i would have paid the $600 or so if it wasn't. i don't know of another camera that offers the package of features, image quality and 'feel' for lack of a better term. i should also mention the two -----> position !!!  built-in flash. it makes a wonderful bounced light. yes, i know there are lots of ways to accomplish all the above, but not all in one compact package that i know of. even the digilux 3 doesn't get there -it's larger, it's zoom range with the supplied lens is only 10mm (35mm equiv.) longer and the digilux 2 lens is faster. have fun! robbe gibson", "sortedWord": "None", "identifyer": 15226, "year": "2007"}, {"Unnamed: 0": 451747, "autor": "richam", "date": 1175257200000, "content": "Jaap, Thanks for the correction on the Clux. I notice the Clux2 has the same focal range. The D2 remains for me the most versatile camera I own. For traveling, I have a Tamrac bag with zip off bottom where I store cables and charger. In the main section, I carry the D2 and usually one of my Ms with an extra lens. In the pockets, the leica mini-pod, film, extra batteries, etc. This covers all the shooting I'm likely to be doing while traveling. Concerning the max 400 iso of the D2, this can often be offset with careful use of the minipod and special hand holding techniques. If you hold the D2 stretched towards arms length so the neck strap is a bit taut, and bring the elbows in towards the body, you have something of a \"human pod\" to steady the camera. With the shutter set to 2 seconds delay, press the shutter button and hold the position. This eliminates any motion caused by the finger releasing the shutter, and normally allows 1/15 sec exposures. I've used it successfully in this manner to 1/8 sec. I also am impressed with the bounce flash of the D2. The flash has a 45° position that makes a much softer and nicer light in many cases. Here is an example from my balcony last July. It has a white ceiling and awning. I was entertaining some Greek and German friends to watch the Mondial. (unfortunately, Germany lost the match we were watching). But the quality of the light was quite appealing to me. --img--  Bottom line: Can't think of any other camera on the market with the D2 size, weight, handling, features, and quality output. I'll be keeping mine for some time.", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/4/?tab=comments#comment-216004", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "jaap, thanks for the correction on the clux. i notice the clux2 has the same focal range. the d2 remains for me the most versatile camera i own. for traveling, i have a tamrac bag with zip off bottom where i store cables and charger. in the main section, i carry the d2 and usually one of my ms with an extra lens. in the pockets, the leica mini-pod, film, extra batteries, etc. this covers all the shooting i'm likely to be doing while traveling. concerning the max 400 iso of the d2, this can often be offset with careful use of the minipod and special hand holding techniques. if you hold the d2 stretched towards arms length so the neck strap is a bit taut, and bring the elbows in towards the body, you have something of a \"human pod\" to steady the camera. with the shutter set to 2 seconds delay, press the shutter button and hold the -----> position !!! . this eliminates any motion caused by the finger releasing the shutter, and normally allows 1/15 sec exposures. i've used it successfully in this manner to 1/8 sec. i also am impressed with the bounce flash of the d2. the flash has a 45° position that makes a much softer and nicer light in many cases. here is an example from my balcony last july. it has a white ceiling and awning. i was entertaining some greek and german friends to watch the mondial. (unfortunately, germany lost the match we were watching). but the quality of the light was quite appealing to me. --img--  bottom line: can't think of any other camera on the market with the d2 size, weight, handling, features, and quality output. i'll be keeping mine for some time.", "sortedWord": "None", "identifyer": 15289, "year": "2007"}, {"Unnamed: 0": 451755, "autor": "audidudi", "date": 1175265300000, "content": "Concerning the max 400 iso of the D2, this can often be offset with careful use of the minipod and special hand holding techniques. If you hold the D2 stretched towards arms length so the neck strap is a bit taut, and bring the elbows in towards the body, you have something of a \"human pod\" to steady the camera. With the shutter set to 2 seconds delay, press the shutter button and hold the position. This eliminates any motion caused by the finger releasing the shutter, and normally allows 1/15 sec exposures. I've used it successfully in this manner to 1/8 sec. I've had reasonable success shooting handheld with shutter speeds as slow as 1/4 second on occasion and regularly shoot at 1/10-1/15 second without a significant loss of sharpness. Don't forget that when you apply the 1/focal length rule, the LC1/D2 lens is actually 7mm at the short end, not 28mm, which suggests a minimum shutter speed of 1/7 second -- let's round it up to 1/10 second -- and my experience confirms this. Still, if for some reason Panasonic/Leica ever do decide to upgrade the LC1/D2 design, I'd welcome the addition of image stabilization. In fact, this alone would go a long way to overcome the LC1/D2's perceived noise problem as it would allow the camera to be used at ISO100 for another two or three stops into darkness...", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/4/?tab=comments#comment-216115", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "concerning the max 400 iso of the d2, this can often be offset with careful use of the minipod and special hand holding techniques. if you hold the d2 stretched towards arms length so the neck strap is a bit taut, and bring the elbows in towards the body, you have something of a \"human pod\" to steady the camera. with the shutter set to 2 seconds delay, press the shutter button and hold the -----> position !!! . this eliminates any motion caused by the finger releasing the shutter, and normally allows 1/15 sec exposures. i've used it successfully in this manner to 1/8 sec. i've had reasonable success shooting handheld with shutter speeds as slow as 1/4 second on occasion and regularly shoot at 1/10-1/15 second without a significant loss of sharpness. don't forget that when you apply the 1/focal length rule, the lc1/d2 lens is actually 7mm at the short end, not 28mm, which suggests a minimum shutter speed of 1/7 second -- let's round it up to 1/10 second -- and my experience confirms this. still, if for some reason panasonic/leica ever do decide to upgrade the lc1/d2 design, i'd welcome the addition of image stabilization. in fact, this alone would go a long way to overcome the lc1/d2's perceived noise problem as it would allow the camera to be used at iso100 for another two or three stops into darkness...", "sortedWord": "None", "identifyer": 15297, "year": "2007"}], "name": "positionL-Forum2007"}