{"interestingcomments": [{"Unnamed: 0": 356065, "autor": "jaapv", "date": 1335000660000, "content": "Question: What can I do to prevent dead pixels and red lines on my sensor? Answer: Basically nothing, as these are caused by cosmic radiation. Flying may increase sensor damage, especially on the transpolar route. The only rational precaution is to store your camera in an upright position, especially in an aircraft, to minimize the target area for the cosmic particles.", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/4/?tab=comments#comment-2464140", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question: what can i do to prevent dead pixels and red lines on my sensor? answer: basically nothing, as these are caused by cosmic radiation. flying may increase sensor damage, especially on the transpolar route. the only rational precaution is to store your camera in an upright -----> position !!! , especially in an aircraft, to minimize the target area for the cosmic particles.", "sortedWord": "None", "identifyer": 17231, "year": "2012"}, {"Unnamed: 0": 360835, "autor": "Avatar", "date": 1350614760000, "content": "ran to catch up and get into position for one fast shot..Lexington Avenue 58th Street NYC sorry about the ugly watermark...working on learning how to make it smaller,etc.. --img--  Edited October 19, 2012 by Avatar", "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/page/9/?tab=comments#comment-2144842", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "ran to catch up and get into -----> position !!!  for one fast shot..lexington avenue 58th street nyc sorry about the ugly watermark...working on learning how to make it smaller,etc.. --img--  edited october 19, 2012 by avatar", "sortedWord": "None", "identifyer": 22055, "year": "2012"}, {"Unnamed: 0": 360848, "autor": "becker", "date": 1350972540000, "content": "ran to catch up and get into position for one fast shot..Lexington Avenue 58th Street NYC sorry about the ugly watermark...working on learning how to make it smaller,etc.. shame on you", "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/page/10/?tab=comments#comment-2148239", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "ran to catch up and get into -----> position !!!  for one fast shot..lexington avenue 58th street nyc sorry about the ugly watermark...working on learning how to make it smaller,etc.. shame on you", "sortedWord": "None", "identifyer": 22068, "year": "2012"}, {"Unnamed: 0": 369508, "autor": "byroncheung", "date": 1338444120000, "content": " hi i have been reading this thread to learn how to adjust my newly purchased second hand m9 and 50mm lux. to begin with the combo seems to back focus. using the allen key i can line up the rangefinder to infinity (using a start) no problem, and cure the backfocus problem in mid range distance however near distance would front focus. i have been trying to loosen the screw to adjust the the near distance front focus problem, however even when i turn the cam to the most anti-clockwise position, it still front focus by couple cm or so... is it a sign that maybe my lens is bad and i'd need to send it to one of the leica doctor to adjust them both? anyone has similar experience?", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/9/?tab=comments#comment-2027511", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " hi i have been reading this thread to learn how to adjust my newly purchased second hand m9 and 50mm lux. to begin with the combo seems to back focus. using the allen key i can line up the rangefinder to infinity (using a start) no problem, and cure the backfocus problem in mid range distance however near distance would front focus. i have been trying to loosen the screw to adjust the the near distance front focus problem, however even when i turn the cam to the most anti-clockwise -----> position !!! , it still front focus by couple cm or so... is it a sign that maybe my lens is bad and i'd need to send it to one of the leica doctor to adjust them both? anyone has similar experience?", "sortedWord": "None", "identifyer": 30805, "year": "2012"}, {"Unnamed: 0": 369514, "autor": "thighslapper", "date": 1340141820000, "content": " One unreported issue with the adjustment of the near point ..... which I have found has limited my exact adjustment... is the fact that the the rotating cam that is moved when you adjust this has a maximum point beyond which further adjustment starts to reverse the process. This is presumably because the rotating cam is ovoid (or similar eccentric profile) and once you get beyond a certain point the arm adjustment starts to reverse. When Leica set all this up I assume they lock the lever arrangement at a point (you can see the arm retaining screw is glued in position) to allow a reasonable range of adjustment once it is roughly set. On my M9 I can get very close to perfect near focus adjustment and if I push it a tiny bit further it goes dramatically into reverse.... This drove me mad for hours until I realised it wasn't things moving when I tightened the lock screw but the fact that I was going beyond the maximum diameter of the eccentric cam. The only reason I mention this is to prevent some poor soul thinking they are going mad if they encounter the same behaviour....--img--  It really is the most pathetically crude arrangement for an otherwise perfect piece of optical engineering.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/9/?tab=comments#comment-2044223", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " one unreported issue with the adjustment of the near point ..... which i have found has limited my exact adjustment... is the fact that the the rotating cam that is moved when you adjust this has a maximum point beyond which further adjustment starts to reverse the process. this is presumably because the rotating cam is ovoid (or similar eccentric profile) and once you get beyond a certain point the arm adjustment starts to reverse. when leica set all this up i assume they lock the lever arrangement at a point (you can see the arm retaining screw is glued in -----> position !!! ) to allow a reasonable range of adjustment once it is roughly set. on my m9 i can get very close to perfect near focus adjustment and if i push it a tiny bit further it goes dramatically into reverse.... this drove me mad for hours until i realised it wasn't things moving when i tightened the lock screw but the fact that i was going beyond the maximum diameter of the eccentric cam. the only reason i mention this is to prevent some poor soul thinking they are going mad if they encounter the same behaviour....--img--  it really is the most pathetically crude arrangement for an otherwise perfect piece of optical engineering.", "sortedWord": "None", "identifyer": 30811, "year": "2012"}, {"Unnamed: 0": 369675, "autor": "Manolo Laguillo", "date": 1352568960000, "content": " Following MarkP's suggestion, I post the 'humble advices' I wrote for him. He thinks this could be interesting for others as well. As English is not my language, he has done highly valuable corrections which make the text really fluid and understandable. Thank you very much, Mark! Hi Mark, as you requested I have sent you some advice both for use and workflow for your 2.8/28 PC-Super-Angulon-R. Hopefully, you will find it useful. I am sure most, if not all, of what follows here is just common sense, and therefore redundant, but anyway here it goes: 1 Tripod I assume you will use the lens with the camera mounted on a tripod. This will eliminate the unavoidable small variations in camera positioning that occur when hand-held. This will also help to establish a fast and efficient technical routine (which is as broad and inclusive as possible in the sense that it is independent of any particular photogrpahic style) so that you won't need to think about the workflow every time. 2 Camera placement Initially you should try to define your image left-to-right, move around the scene you want to photograph, and adjust distance to and angle towards the subject, a well as height from ground. As always, the image is first defined in your mind, ie. deciding what you want even before having used the camera as a framing tool. This is especially important with the 28PC and M9, as without live-view you will need to review the image after having taken the photograph and then make any necessary adjustments. You first shoot in order to see what the photo will be like, and then, looking at the LCD, adjust the camera. The more experience you have with the 28mm focal length the better will be the initial positioning of the camera. Finally, you will have the right position for the camera, which is that which produces the correct geometry for the final image you want. This is a very important point so please bear with me whilst I digress to explain two possibilities. One can either be true to the geometry of the main plane of the subject (ie the true frontal view of the façade of the building), or not be true to it's geometry. With the latter there is a 'shortening', or Scorzo in Italian, or Verkürzung in German. There is only one way to produce a true frontal view, but many ways of producing a Scorzo. The Scorzo can be either a very small and almost unrecognizable departure from the true frontal view, or very large. In other words, the trapezoidal figure obtained from the original rectangle can be more or less irregular and bizarre depending on the degree of displacement from the true frontal view. The more from the side the photo is taken, the more bizarre the image and less recognizable will be the façade! This is why the most commonly sought image geometry is that delivered from the true frontal view, where the orthogonality of the façade is preserved, and the original rectangular front of the building becomes a true rectangle in the image. It takes some time and patience to develop the skill to achieve this more or less right from the beginning. 3 Level the Camera Align the camera with the aid of a bubble level. A 3D head is better for obvious reasons. The ideal tripod head is one that will allow a panoramic movement without losing the level, and where the panoramic movement is directly under the camera, not under the head. The Arca-Swiss d4 is the one I use precisely because of this feature. But it's not essential if you don't have it as it's only a minor inconvenience having to readjust the level after adjusting the camera for framing. It goes without saying that you will achieve the correct camera position and levelling by trial-and-error. Shoot and then go back to the LCD until you have the image you want. I find the quality of the M9's LCD to be adequate for this, but yes it could be better. Now, when the camera is correctly positioned for the image you want (from left-to-right), it is time to adjust the lens. 4 Lens Exposure and Focus Settings Meter the light with lens PC settings at zero. The diaphragm should be set to f11, but could be set to f8 if the shift is only going to be slight. There is a lever/switch on the lens that must be set to the down position - you will easily find this yourself. As the aperture setting of f11 is not variable, obviously only shutter speed (and ISO) is available to adjust for the correct exposure. I assume you are photographing landscapes and cityscapes/buildings so the focus is, by default, set to infinity. It is always worthwhile using the lens-hood. 5 Lens - Shift Settings So now let's shift! You are at ground level on the street and want to photograph a five storey building so you will need to shift the lens up. As the default lens position is for sideways shift it will need to be rotated. Personally, I like to have the knob pointing to the sky simply because it is convenient to have the f-stop and the distance scales to the right where the shutter-release is. In this way one only needs to move/look from behind the camera to the right of the lens and back again, rather than to both the left and right of the lens. Shifting is a very straightforward procedure, again done by trial-and-error because there is no live-view. If we think about it, this step is simply a means of framing up-and-down! If you are on the top of a building and want to shoot looking down the lens will obvioulsy be shifted down. However, for some strange reason I nearly always avoid correcting verticals when looking down: as I do not find verticals converging towards the ground didtrubing. You can of course shift laterally, applying the same principles as above. 6 Tips for Shift Settings a. After gaining some experience with up-down and left-right movements you can try diagonals. Diagonal adjustments will shift simultaneously through the two planes, for example right and up if the lens is shifted diagonally towards 1:30 on the clock. The example you saw in the forum was exactly this - right & up. Schneider recommends that with these combined diagonal shifts one should not shift beyond 9mm. b. There is a rule-of-thumb when working with a view camera that one should avoid shifting if tilting the lens axis more than ±30° such as with a taller building. This is because the resulting image would look 'artificial' but this is not a problem with 28 PC-R because it can only shift to a maximum of 11mm. Not that this is an inconsiderable shift being nearly 50% of 24mm which is of course the short length of a 24mmx36 full-frame. It is of course possible to combine lens shifting with tilting the camera up in these more extreme situations. The shift will lessen the convergence without totally eliminating it. c. In some instances it is better to avoid a 100% correction of vertical convergence because if overdone it can appear as if a vertical convergence towards the ground is happening. The classic example is a tall building seen in such a way that it appears as a ship's prow, ie. aggresively pointing towards the camera. Because of the 'fish spine' configuration of horizontal lines, even if vertical lines are perfectly parallel, the verticals seem to converge towards the ground. This effect can be avoided easily by not trying to attempt a full 100% correction of vertical convergence. This is comparable to the 'entasis' applied by the old greeks to their temple architecture. I hope you find this helpful! Warm regards from Barcelona. Manolo Epilogue This has been written for those who want to try using a PC lens on the M9 and already believes that this is worthwhile. For those who are still to be converted I include this final reflection on: Why use a PC lens on the M9? Which is easier, using a PC lens on a DSLR or on an M9? The answer is obvious - on a DSLR. But we are not speaking about the obvious, but of a solution that is much more interesting precisely because it is not obvious! I like the M9's quality, I like it's small size, and it's the camera I own. This is an important point! I don't own a Nikon 800 or Canon 5DIII or equivalent because I don't want or need them. The price of a 2nd hand PC such as the 28 PC-R is much lower than those camera bodies. This lens is an excellent compromise - with a trade-off of what I find to be only a minor inconveninece in use, it adds only 800 gm to my bag, and is like having a very small view camera at hand. Using this lens allows me to take advantage of the M9's small size and image quality but give me the option of a PC lens. I don't consider this as being against the 'M philosophy,' but actually quite the opposite. Everything can be looked at from different or divergent (pardon the PC lens pun) point of view. As photographers, we know this very well... The combination of a M9 with a PC lens may seem bizarre at first, but it isn't if we think a little bit about it, or better yet, try it. This combination requires experience and practice, but can be very rewarding if you are willing to climb that steep learning curve. Edited November 10, 2012 by Manolo Laguillo", "link": "https://www.l-camera-forum.com/topic/191982-using-the-2828-pc-super-angulon-r-on-the-m/?tab=comments#comment-2163472", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " following markp's suggestion, i post the 'humble advices' i wrote for him. he thinks this could be interesting for others as well. as english is not my language, he has done highly valuable corrections which make the text really fluid and understandable. thank you very much, mark! hi mark, as you requested i have sent you some advice both for use and workflow for your 2.8/28 pc-super-angulon-r. hopefully, you will find it useful. i am sure most, if not all, of what follows here is just common sense, and therefore redundant, but anyway here it goes: 1 tripod i assume you will use the lens with the camera mounted on a tripod. this will eliminate the unavoidable small variations in camera positioning that occur when hand-held. this will also help to establish a fast and efficient technical routine (which is as broad and inclusive as possible in the sense that it is independent of any particular photogrpahic style) so that you won't need to think about the workflow every time. 2 camera placement initially you should try to define your image left-to-right, move around the scene you want to photograph, and adjust distance to and angle towards the subject, a well as height from ground. as always, the image is first defined in your mind, ie. deciding what you want even before having used the camera as a framing tool. this is especially important with the 28pc and m9, as without live-view you will need to review the image after having taken the photograph and then make any necessary adjustments. you first shoot in order to see what the photo will be like, and then, looking at the lcd, adjust the camera. the more experience you have with the 28mm focal length the better will be the initial positioning of the camera. finally, you will have the right -----> position !!!  for the camera, which is that which produces the correct geometry for the final image you want. this is a very important point so please bear with me whilst i digress to explain two possibilities. one can either be true to the geometry of the main plane of the subject (ie the true frontal view of the façade of the building), or not be true to it's geometry. with the latter there is a 'shortening', or scorzo in italian, or verkürzung in german. there is only one way to produce a true frontal view, but many ways of producing a scorzo. the scorzo can be either a very small and almost unrecognizable departure from the true frontal view, or very large. in other words, the trapezoidal figure obtained from the original rectangle can be more or less irregular and bizarre depending on the degree of displacement from the true frontal view. the more from the side the photo is taken, the more bizarre the image and less recognizable will be the façade! this is why the most commonly sought image geometry is that delivered from the true frontal view, where the orthogonality of the façade is preserved, and the original rectangular front of the building becomes a true rectangle in the image. it takes some time and patience to develop the skill to achieve this more or less right from the beginning. 3 level the camera align the camera with the aid of a bubble level. a 3d head is better for obvious reasons. the ideal tripod head is one that will allow a panoramic movement without losing the level, and where the panoramic movement is directly under the camera, not under the head. the arca-swiss d4 is the one i use precisely because of this feature. but it's not essential if you don't have it as it's only a minor inconvenience having to readjust the level after adjusting the camera for framing. it goes without saying that you will achieve the correct camera position and levelling by trial-and-error. shoot and then go back to the lcd until you have the image you want. i find the quality of the m9's lcd to be adequate for this, but yes it could be better. now, when the camera is correctly positioned for the image you want (from left-to-right), it is time to adjust the lens. 4 lens exposure and focus settings meter the light with lens pc settings at zero. the diaphragm should be set to f11, but could be set to f8 if the shift is only going to be slight. there is a lever/switch on the lens that must be set to the down position - you will easily find this yourself. as the aperture setting of f11 is not variable, obviously only shutter speed (and iso) is available to adjust for the correct exposure. i assume you are photographing landscapes and cityscapes/buildings so the focus is, by default, set to infinity. it is always worthwhile using the lens-hood. 5 lens - shift settings so now let's shift! you are at ground level on the street and want to photograph a five storey building so you will need to shift the lens up. as the default lens position is for sideways shift it will need to be rotated. personally, i like to have the knob pointing to the sky simply because it is convenient to have the f-stop and the distance scales to the right where the shutter-release is. in this way one only needs to move/look from behind the camera to the right of the lens and back again, rather than to both the left and right of the lens. shifting is a very straightforward procedure, again done by trial-and-error because there is no live-view. if we think about it, this step is simply a means of framing up-and-down! if you are on the top of a building and want to shoot looking down the lens will obvioulsy be shifted down. however, for some strange reason i nearly always avoid correcting verticals when looking down: as i do not find verticals converging towards the ground didtrubing. you can of course shift laterally, applying the same principles as above. 6 tips for shift settings a. after gaining some experience with up-down and left-right movements you can try diagonals. diagonal adjustments will shift simultaneously through the two planes, for example right and up if the lens is shifted diagonally towards 1:30 on the clock. the example you saw in the forum was exactly this - right & up. schneider recommends that with these combined diagonal shifts one should not shift beyond 9mm. b. there is a rule-of-thumb when working with a view camera that one should avoid shifting if tilting the lens axis more than ±30° such as with a taller building. this is because the resulting image would look 'artificial' but this is not a problem with 28 pc-r because it can only shift to a maximum of 11mm. not that this is an inconsiderable shift being nearly 50% of 24mm which is of course the short length of a 24mmx36 full-frame. it is of course possible to combine lens shifting with tilting the camera up in these more extreme situations. the shift will lessen the convergence without totally eliminating it. c. in some instances it is better to avoid a 100% correction of vertical convergence because if overdone it can appear as if a vertical convergence towards the ground is happening. the classic example is a tall building seen in such a way that it appears as a ship's prow, ie. aggresively pointing towards the camera. because of the 'fish spine' configuration of horizontal lines, even if vertical lines are perfectly parallel, the verticals seem to converge towards the ground. this effect can be avoided easily by not trying to attempt a full 100% correction of vertical convergence. this is comparable to the 'entasis' applied by the old greeks to their temple architecture. i hope you find this helpful! warm regards from barcelona. manolo epilogue this has been written for those who want to try using a pc lens on the m9 and already believes that this is worthwhile. for those who are still to be converted i include this final reflection on: why use a pc lens on the m9? which is easier, using a pc lens on a dslr or on an m9? the answer is obvious - on a dslr. but we are not speaking about the obvious, but of a solution that is much more interesting precisely because it is not obvious! i like the m9's quality, i like it's small size, and it's the camera i own. this is an important point! i don't own a nikon 800 or canon 5diii or equivalent because i don't want or need them. the price of a 2nd hand pc such as the 28 pc-r is much lower than those camera bodies. this lens is an excellent compromise - with a trade-off of what i find to be only a minor inconveninece in use, it adds only 800 gm to my bag, and is like having a very small view camera at hand. using this lens allows me to take advantage of the m9's small size and image quality but give me the option of a pc lens. i don't consider this as being against the 'm philosophy,' but actually quite the opposite. everything can be looked at from different or divergent (pardon the pc lens pun) point of view. as photographers, we know this very well... the combination of a m9 with a pc lens may seem bizarre at first, but it isn't if we think a little bit about it, or better yet, try it. this combination requires experience and practice, but can be very rewarding if you are willing to climb that steep learning curve. edited november 10, 2012 by manolo laguillo", "sortedWord": "None", "identifyer": 30974, "year": "2012"}, {"Unnamed: 0": 369678, "autor": "tobey bilek", "date": 1352750280000, "content": "If you wish to fight this battle, a few suggestions. Put the lens axis on the subject at a point eye level. This insures a vertical camera back. The RF patch may be close enough or you may have to determine where center of the RF screen is, Remember you have lost all parallax compensation. Full shift up in portrait format will move the bottom of the frame about 80% of the way to the horizontal dividing line. This will be 1000% easier with a DSLR or live view. The 28 is my favorite panorama lens. In landscape format, place the camera on a SIDEWAYS micro focus rail. Make three photos, L 11 mm, center, R 11mm. The point of the focus rail is so you can keep the lens in the same position. Diagonal lines will join perfectly and they will be straight unlike the cigar shaped rectangles you get with rotation or a swing lens camera. The image will cover around 90 deg horizontal.", "link": "https://www.l-camera-forum.com/topic/191982-using-the-2828-pc-super-angulon-r-on-the-m/?tab=comments#comment-2165149", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "if you wish to fight this battle, a few suggestions. put the lens axis on the subject at a point eye level. this insures a vertical camera back. the rf patch may be close enough or you may have to determine where center of the rf screen is, remember you have lost all parallax compensation. full shift up in portrait format will move the bottom of the frame about 80% of the way to the horizontal dividing line. this will be 1000% easier with a dslr or live view. the 28 is my favorite panorama lens. in landscape format, place the camera on a sideways micro focus rail. make three photos, l 11 mm, center, r 11mm. the point of the focus rail is so you can keep the lens in the same -----> position !!! . diagonal lines will join perfectly and they will be straight unlike the cigar shaped rectangles you get with rotation or a swing lens camera. the image will cover around 90 deg horizontal.", "sortedWord": "None", "identifyer": 30977, "year": "2012"}, {"Unnamed: 0": 369681, "autor": "Hausen17", "date": 1352848800000, "content": " Have found a Micro focus rail. So the idea is to attach it to that to keep lens in position then shift as normal?", "link": "https://www.l-camera-forum.com/topic/191982-using-the-2828-pc-super-angulon-r-on-the-m/?tab=comments#comment-2166288", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " have found a micro focus rail. so the idea is to attach it to that to keep lens in -----> position !!!  then shift as normal?", "sortedWord": "None", "identifyer": 30980, "year": "2012"}, {"Unnamed: 0": 369682, "autor": "Manolo Laguillo", "date": 1352885400000, "content": "Have found a Micro focus rail. So the idea is to attach it to that to keep lens in position then shift as normal? If you shift the lens sideways, the point of view changes. Therefore, a panorama with a close foreground made in this way will be impossible to be stitched correctly because of the parallax. But if you put the camera on a lateral moving micro focus rail, you can do the following: 1. Make the first picture after moving the camera on the rail 11mm to the right and with the lens shifted 11mm to the left. 2. Make the second picture moving the camera 11mm to the left and with the lens shift zeroed. 3. Make the third picture after moving the camera again 11mm to the left and with the lens shifted 11mm to the right. The lens is in the 3 pictures is in the same spot, only the camera moves. With a 28mm the total angle will be 90 degrees, the one a 18mm delivers. But there will be a greater amount of pixels! The tripod must be a really sturdy one, of course... Edited November 14, 2012 by Manolo Laguillo", "link": "https://www.l-camera-forum.com/topic/191982-using-the-2828-pc-super-angulon-r-on-the-m/?tab=comments#comment-2166523", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "have found a micro focus rail. so the idea is to attach it to that to keep lens in -----> position !!!  then shift as normal? if you shift the lens sideways, the point of view changes. therefore, a panorama with a close foreground made in this way will be impossible to be stitched correctly because of the parallax. but if you put the camera on a lateral moving micro focus rail, you can do the following: 1. make the first picture after moving the camera on the rail 11mm to the right and with the lens shifted 11mm to the left. 2. make the second picture moving the camera 11mm to the left and with the lens shift zeroed. 3. make the third picture after moving the camera again 11mm to the left and with the lens shifted 11mm to the right. the lens is in the 3 pictures is in the same spot, only the camera moves. with a 28mm the total angle will be 90 degrees, the one a 18mm delivers. but there will be a greater amount of pixels! the tripod must be a really sturdy one, of course... edited november 14, 2012 by manolo laguillo", "sortedWord": "None", "identifyer": 30981, "year": "2012"}, {"Unnamed: 0": 369688, "autor": "robsteve", "date": 1353874980000, "content": "I haven't tried it with the M8, but on the DMR, when you used the 28mm shift, it introduced a colour shift across the image. This is common on sensors that use micro-lenses. You need to use a program such as Capture One Pro and shoot a lens correction image for each shift position for it to be corrected out in raw conversion. Here is an image showing what I was getting, along with the lens cast image used for correction. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/191982-using-the-2828-pc-super-angulon-r-on-the-m/?tab=comments#comment-2174870", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i haven't tried it with the m8, but on the dmr, when you used the 28mm shift, it introduced a colour shift across the image. this is common on sensors that use micro-lenses. you need to use a program such as capture one pro and shoot a lens correction image for each shift -----> position !!!  for it to be corrected out in raw conversion. here is an image showing what i was getting, along with the lens cast image used for correction. --img-- --img-- ", "sortedWord": "None", "identifyer": 30987, "year": "2012"}, {"Unnamed: 0": 377731, "autor": "tobey bilek", "date": 1352607240000, "content": "Genetics. Nothing can be done. I once had an eye doctor who previously examined candidates for aerial gunner positions on WW2 bombers. If you were right handed and left eye dominant, you were returned to where you came from, No training was wasted on you. I can`t use a shotgun to save my soul, rifle and pistol deadly. So now I get nose prints over that beautiful sapphire glass screen on my M9. I am trying to train the right eye, but after decades using Leica with left eye, I find it quite impossible.", "link": "https://www.l-camera-forum.com/topic/191990-left-eye-shooting/?tab=comments#comment-2163821", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "genetics. nothing can be done. i once had an eye doctor who previously examined candidates for aerial gunner -----> positions !!!  on ww2 bombers. if you were right handed and left eye dominant, you were returned to where you came from, no training was wasted on you. i can`t use a shotgun to save my soul, rifle and pistol deadly. so now i get nose prints over that beautiful sapphire glass screen on my m9. i am trying to train the right eye, but after decades using leica with left eye, i find it quite impossible.", "sortedWord": "None", "identifyer": 39044, "year": "2012"}, {"Unnamed: 0": 377734, "autor": "gravastar", "date": 1352649900000, "content": "Genetics. Nothing can be done. I once had an eye doctor who previously examined candidates for aerial gunner positions on WW2 bombers. If you were right handed and left eye dominant, you were returned to where you came from, No training was wasted on you. I can`t use a shotgun to save my soul, rifle and pistol deadly. So now I get nose prints over that beautiful sapphire glass screen on my M9. I am trying to train the right eye, but after decades using Leica with left eye, I find it quite impossible. Interesting, I'm right handed left eye dominant and when younger earned marksman status shooting 303s. Artistically I'm useless at composing with my right eye. I forsake the better vision in my right eye for the left when using the Leica. For sure you get nose grease on the screen, it's par for the course. I just feel very uncomfortable using the right eye with a camera. Bob. Edited November 11, 2012 by gravastar", "link": "https://www.l-camera-forum.com/topic/191990-left-eye-shooting/?tab=comments#comment-2164119", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "genetics. nothing can be done. i once had an eye doctor who previously examined candidates for aerial gunner -----> positions !!!  on ww2 bombers. if you were right handed and left eye dominant, you were returned to where you came from, no training was wasted on you. i can`t use a shotgun to save my soul, rifle and pistol deadly. so now i get nose prints over that beautiful sapphire glass screen on my m9. i am trying to train the right eye, but after decades using leica with left eye, i find it quite impossible. interesting, i'm right handed left eye dominant and when younger earned marksman status shooting 303s. artistically i'm useless at composing with my right eye. i forsake the better vision in my right eye for the left when using the leica. for sure you get nose grease on the screen, it's par for the course. i just feel very uncomfortable using the right eye with a camera. bob. edited november 11, 2012 by gravastar", "sortedWord": "None", "identifyer": 39047, "year": "2012"}, {"Unnamed: 0": 377735, "autor": "iedei", "date": 1352651700000, "content": "Genetics. Nothing can be done. I once had an eye doctor who previously examined candidates for aerial gunner positions on WW2 bombers. If you were right handed and left eye dominant, you were returned to where you came from, No training was wasted on you. I can`t use a shotgun to save my soul, rifle and pistol deadly. So now I get nose prints over that beautiful sapphire glass screen on my M9. I am trying to train the right eye, but after decades using Leica with left eye, I find it quite impossible. i've been reading about this since the morning. Eye dominance can be changed by applying an eye patch over the dominant eye and forcing the weaker eye to become dominant. Similar to how 'strabismus' is treated, i suppose.", "link": "https://www.l-camera-forum.com/topic/191990-left-eye-shooting/?tab=comments#comment-2164142", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "genetics. nothing can be done. i once had an eye doctor who previously examined candidates for aerial gunner -----> positions !!!  on ww2 bombers. if you were right handed and left eye dominant, you were returned to where you came from, no training was wasted on you. i can`t use a shotgun to save my soul, rifle and pistol deadly. so now i get nose prints over that beautiful sapphire glass screen on my m9. i am trying to train the right eye, but after decades using leica with left eye, i find it quite impossible. i've been reading about this since the morning. eye dominance can be changed by applying an eye patch over the dominant eye and forcing the weaker eye to become dominant. similar to how 'strabismus' is treated, i suppose.", "sortedWord": "None", "identifyer": 39048, "year": "2012"}, {"Unnamed: 0": 377743, "autor": "hjsesq", "date": 1353005100000, "content": " At Paul's suggestion, I took an old Leitz/Wetzlar viewfinder and placed it in the flash shoe - works like a charm in keeping my nose from being smashed into the LED screen as well as holding the camera in an uncomfortable position. Now I have to keep remembering is to put my left eye at the Leica Viewfinder rather than my right. BTW, with the Leitz sitting useless on top and the M9 taped over with gaffing tape, it creates the illusion of a much older Leica. Thanks Paul and everyone else for your jumping in to my rescue. What a great group and you are much appreciated. Harris", "link": "https://www.l-camera-forum.com/topic/191990-left-eye-shooting/page/2/?tab=comments#comment-2167706", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " at paul's suggestion, i took an old leitz/wetzlar viewfinder and placed it in the flash shoe - works like a charm in keeping my nose from being smashed into the led screen as well as holding the camera in an uncomfortable -----> position !!! . now i have to keep remembering is to put my left eye at the leica viewfinder rather than my right. btw, with the leitz sitting useless on top and the m9 taped over with gaffing tape, it creates the illusion of a much older leica. thanks paul and everyone else for your jumping in to my rescue. what a great group and you are much appreciated. harris", "sortedWord": "None", "identifyer": 39056, "year": "2012"}, {"Unnamed: 0": 385029, "autor": "Stefan Daniel", "date": 1346228100000, "content": " As promised yesterday by JJ, please let me state our position about the serviceability of the M8 and M8.2 Display. First of all, we are very sorry, that some of you encountered issues with your cameras. It remains our aim to find the very best solutions to satisfy you. Please let me give you some more information and details on the display issue. The cameras with a display problem stay operational, image quality and the main functions are not affected. The effect only occurs on a single production lot of displays, both built into M8 and M8.2. The serial number of the camera doesn’t give information about the lot of the display. The lot in question was pulled out of service stock as soon as we have recognized the issue. Meanwhile the manufacturer of the LCD displays had stopped production, in general these parts have a very short life cycle and Leica did not have a possibility for additional production. As the display and the rest of the electronics are linked very much together, it was not possible to create a repair solution up to our quality requirements. The display of the M9/M9-P is a different display and is sourced from another manufacturer and is therefore not affected. For the M9 as for all our products, we are taking measures that we are able to service the camera for a period of at least ten years after production will stop. In the case that (especially electronic-) parts are no longer available, we will offer an upgrade program. As you know, we have quite a history of being able to service our products for a period much longer than that! The upgrade program will work with both a M9 or M9-P, with a slightly different premium. Please contact your local Leica Customer Care for details should you have concerns with your M8/ M8.2 display. Best regards from Solms, Stefan Daniel, Director Product Management", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/?tab=comments#comment-2098737", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " as promised yesterday by jj, please let me state our -----> position !!!  about the serviceability of the m8 and m8.2 display. first of all, we are very sorry, that some of you encountered issues with your cameras. it remains our aim to find the very best solutions to satisfy you. please let me give you some more information and details on the display issue. the cameras with a display problem stay operational, image quality and the main functions are not affected. the effect only occurs on a single production lot of displays, both built into m8 and m8.2. the serial number of the camera doesn’t give information about the lot of the display. the lot in question was pulled out of service stock as soon as we have recognized the issue. meanwhile the manufacturer of the lcd displays had stopped production, in general these parts have a very short life cycle and leica did not have a possibility for additional production. as the display and the rest of the electronics are linked very much together, it was not possible to create a repair solution up to our quality requirements. the display of the m9/m9-p is a different display and is sourced from another manufacturer and is therefore not affected. for the m9 as for all our products, we are taking measures that we are able to service the camera for a period of at least ten years after production will stop. in the case that (especially electronic-) parts are no longer available, we will offer an upgrade program. as you know, we have quite a history of being able to service our products for a period much longer than that! the upgrade program will work with both a m9 or m9-p, with a slightly different premium. please contact your local leica customer care for details should you have concerns with your m8/ m8.2 display. best regards from solms, stefan daniel, director product management", "sortedWord": "None", "identifyer": 46433, "year": "2012"}, {"Unnamed: 0": 385094, "autor": "lm_user", "date": 1346261160000, "content": "I think you are misreading this. There are no sensors failing because they are faulty - this probably refers to the coffee stain. I interpret this to mean that this exhausted the supply with no option of replenshing it to the needed level.My exegesis of SD's text: 1. Leica decides to switch producer 2. Sufficient stock is bough 3. After a year cameras start developing coffee stains 4. lLca identifies a faulty lot, pulls it, depleting the stock 5. There are more screens to be replaced depleting stock further 6. The production has been discontinued At the time of identifying the faulty lot), making it impossible to replenish the stock Jaapv - I re-read Stafan's post and I think your interpretation is correct. Stefan did specifically say the lot was pulled from service stock and not production stock. I misread this line. There is no evidence in Stefan's statement that Leica was aware of this situation when they were in a position to do something about it. I stand corrected", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/4/?tab=comments#comment-2099285", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think you are misreading this. there are no sensors failing because they are faulty - this probably refers to the coffee stain. i interpret this to mean that this exhausted the supply with no option of replenshing it to the needed level.my exegesis of sd's text: 1. leica decides to switch producer 2. sufficient stock is bough 3. after a year cameras start developing coffee stains 4. llca identifies a faulty lot, pulls it, depleting the stock 5. there are more screens to be replaced depleting stock further 6. the production has been discontinued at the time of identifying the faulty lot), making it impossible to replenish the stock jaapv - i re-read stafan's post and i think your interpretation is correct. stefan did specifically say the lot was pulled from service stock and not production stock. i misread this line. there is no evidence in stefan's statement that leica was aware of this situation when they were in a -----> position !!!  to do something about it. i stand corrected", "sortedWord": "None", "identifyer": 46498, "year": "2012"}, {"Unnamed: 0": 385127, "autor": "menos I M6", "date": 1346295180000, "content": "Interesting how we've all come out of the woodwork. To raise an heretical alternative: there are also some excellent HP calculor emulation apps for iPhones. Convenient, but they just don't have the feel of those lovely old HP buttons, and my iPhone won't give me more than 20 years of reliable service:) HP32S II here, made in 1987, in use daily since early 90's - can't break. Best calculator ever. I indeed intended, to use my M8.2 in a very similar fashion - it's fantastic in use, has the same focussing experience, as my other M cameras, fits the same lenses and on top of that has some unique perks, no other Leica M to date has, making it uniquely useful. I don't get all this stupid talk about it being a bad product, outdated camera, etc … If somebody would come along and offer me money and the latest and greatest calculator to snag away my HP, I would be shocked, insulted and astonished, asking \"Are you nuts?\" Leica doesn't do the right thing in this affair so far. The taken reaction was mandatory, the execution and especially the communication in this regard looks clumsy. It is not the message, M8 owners want to hear - they, as many people, who bought a Leica product simply want to have a warm feeling, that the manufacturer will take care of their issues and not to worry about it. The opposite has happened - many M8 owners and potential starters into the Leica M system (that includes many potential first Leica customers) will have genuine worries and think twice before making decisions. This is absolutely wrong from a marketing standpoint, absolutely. Sure it makes technically no sense, to freeze valuable company liquidity into a big honking cost position, which Leica would likely have to depreciate for nothing more than an outdated piece of history in Leica's young digital past. Sure it would be a pity from a business standpoint, to waste this precious money just for those outdated experimental cameras, we first brought to market. We actually would love all the internet chatter about this issue to disappear and those troublesome M8 camera's just to vanish in a puff of air. This is not going to happen. Leica has an obligation - invest in a reasonable service solution, that will cost an owner of a Leica M8 nothing more than a reasonable repair bill for a display exchange (no, that would not be 800 EUR) and eat those costs. Heck, you can even break down this loss and raise the next digital M's price on the projected sale of 20.000 − 50.000 units and have all involved people happy, investors, engineers, marketing and very especially all M8 owners with or without broken LCD. If indeed the monetary investment is so large, that giving away refurbished M9 bodies at production cost value to involved M8 owners has close to or less negative impact in the balance sheet, than the heck design an exchange/ upgrade program around this solution! Is this so difficult to see? I manage a small company. Would one of my products suffer from a similar issue, that would be, what I would do … making sure, MY FAULT will not become an issue of MY CUSTOMER. I have the obligation, that my customers have absolutely zero negative experience.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/5/?tab=comments#comment-2099721", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "interesting how we've all come out of the woodwork. to raise an heretical alternative: there are also some excellent hp calculor emulation apps for iphones. convenient, but they just don't have the feel of those lovely old hp buttons, and my iphone won't give me more than 20 years of reliable service:) hp32s ii here, made in 1987, in use daily since early 90's - can't break. best calculator ever. i indeed intended, to use my m8.2 in a very similar fashion - it's fantastic in use, has the same focussing experience, as my other m cameras, fits the same lenses and on top of that has some unique perks, no other leica m to date has, making it uniquely useful. i don't get all this stupid talk about it being a bad product, outdated camera, etc … if somebody would come along and offer me money and the latest and greatest calculator to snag away my hp, i would be shocked, insulted and astonished, asking \"are you nuts?\" leica doesn't do the right thing in this affair so far. the taken reaction was mandatory, the execution and especially the communication in this regard looks clumsy. it is not the message, m8 owners want to hear - they, as many people, who bought a leica product simply want to have a warm feeling, that the manufacturer will take care of their issues and not to worry about it. the opposite has happened - many m8 owners and potential starters into the leica m system (that includes many potential first leica customers) will have genuine worries and think twice before making decisions. this is absolutely wrong from a marketing standpoint, absolutely. sure it makes technically no sense, to freeze valuable company liquidity into a big honking cost -----> position !!! , which leica would likely have to depreciate for nothing more than an outdated piece of history in leica's young digital past. sure it would be a pity from a business standpoint, to waste this precious money just for those outdated experimental cameras, we first brought to market. we actually would love all the internet chatter about this issue to disappear and those troublesome m8 camera's just to vanish in a puff of air. this is not going to happen. leica has an obligation - invest in a reasonable service solution, that will cost an owner of a leica m8 nothing more than a reasonable repair bill for a display exchange (no, that would not be 800 eur) and eat those costs. heck, you can even break down this loss and raise the next digital m's price on the projected sale of 20.000 − 50.000 units and have all involved people happy, investors, engineers, marketing and very especially all m8 owners with or without broken lcd. if indeed the monetary investment is so large, that giving away refurbished m9 bodies at production cost value to involved m8 owners has close to or less negative impact in the balance sheet, than the heck design an exchange/ upgrade program around this solution! is this so difficult to see? i manage a small company. would one of my products suffer from a similar issue, that would be, what i would do … making sure, my fault will not become an issue of my customer. i have the obligation, that my customers have absolutely zero negative experience.", "sortedWord": "None", "identifyer": 46531, "year": "2012"}, {"Unnamed: 0": 385128, "autor": "MarkP", "date": 1346296800000, "content": "HP32S II here, made in 1987, in use daily since early 90's - can't break. Best calculator ever. I indeed intended, to use my M8.2 in a very similar fashion - it's fantastic in use, has the same focussing experience, as my other M cameras, fits the same lenses and on top of that has some unique perks, no other Leica M to date has, making it uniquely useful. I don't get all this stupid talk about it being a bad product, outdated camera, etc … If somebody would come along and offer me money and the latest and greatest calculator to snag away my HP, I would be shocked, insulted and astonished, asking \"Are you nuts?\" Leica doesn't do the right thing in this affair so far. The taken reaction was mandatory, the execution and especially the communication in this regard looks clumsy. It is not the message, M8 owners want to hear - they, as many people, who bought a Leica product simply want to have a warm feeling, that the manufacturer will take care of their issues and not to worry about it. The opposite has happened - many M8 owners and potential starters into the Leica M system (that includes many potential first Leica customers) will have genuine worries and think twice before making decisions. This is absolutely wrong from a marketing standpoint, absolutely. Sure it makes technically no sense, to freeze valuable company liquidity into a big honking cost position, which Leica would likely have to depreciate for nothing more than an outdated piece of history in Leica's young digital past. Sure it would be a pity from a business standpoint, to waste this precious money just for those outdated experimental cameras, we first brought to market. We actually would love all the internet chatter about this issue to disappear and those troublesome M8 camera's just to vanish in a puff of air. This is not going to happen. Leica has an obligation - invest in a reasonable service solution, that will cost an owner of a Leica M8 nothing more than a reasonable repair bill for a display exchange (no, that would not be 800 EUR) and eat those costs. Heck, you can even break down this loss and raise the next digital M's price on the projected sale of 20.000 − 50.000 units and have all involved people happy, investors, engineers, marketing and very especially all M8 owners with or without broken LCD. If indeed the monetary investment is so large, that giving away refurbished M9 bodies at production cost value to involved M8 owners has close to or less negative impact in the balance sheet, than the heck design an exchange/ upgrade program around this solution! Is this so difficult to see? I manage a small company. Would one of my products suffer from a similar issue, that would be, what I would do … making sure, MY FAULT will not become an issue of MY CUSTOMER. I have the obligation, that my customers have absolutely zero negative experience. see post #15 above..lets start an I love my HP32-SII thread in Barnack's Bar:rolleyes: Seriously though , I completely agree. You've obviously seen my last post #556 in the Lifetime service... NOT thread With this shit storm raging it looks like Leica may need to rethink this. I'm starting to think that they should just order a supply of sensors, bear the cost, and protect their reputation. Maintain the Rage:mad:", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/5/?tab=comments#comment-2099735", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hp32s ii here, made in 1987, in use daily since early 90's - can't break. best calculator ever. i indeed intended, to use my m8.2 in a very similar fashion - it's fantastic in use, has the same focussing experience, as my other m cameras, fits the same lenses and on top of that has some unique perks, no other leica m to date has, making it uniquely useful. i don't get all this stupid talk about it being a bad product, outdated camera, etc … if somebody would come along and offer me money and the latest and greatest calculator to snag away my hp, i would be shocked, insulted and astonished, asking \"are you nuts?\" leica doesn't do the right thing in this affair so far. the taken reaction was mandatory, the execution and especially the communication in this regard looks clumsy. it is not the message, m8 owners want to hear - they, as many people, who bought a leica product simply want to have a warm feeling, that the manufacturer will take care of their issues and not to worry about it. the opposite has happened - many m8 owners and potential starters into the leica m system (that includes many potential first leica customers) will have genuine worries and think twice before making decisions. this is absolutely wrong from a marketing standpoint, absolutely. sure it makes technically no sense, to freeze valuable company liquidity into a big honking cost -----> position !!! , which leica would likely have to depreciate for nothing more than an outdated piece of history in leica's young digital past. sure it would be a pity from a business standpoint, to waste this precious money just for those outdated experimental cameras, we first brought to market. we actually would love all the internet chatter about this issue to disappear and those troublesome m8 camera's just to vanish in a puff of air. this is not going to happen. leica has an obligation - invest in a reasonable service solution, that will cost an owner of a leica m8 nothing more than a reasonable repair bill for a display exchange (no, that would not be 800 eur) and eat those costs. heck, you can even break down this loss and raise the next digital m's price on the projected sale of 20.000 − 50.000 units and have all involved people happy, investors, engineers, marketing and very especially all m8 owners with or without broken lcd. if indeed the monetary investment is so large, that giving away refurbished m9 bodies at production cost value to involved m8 owners has close to or less negative impact in the balance sheet, than the heck design an exchange/ upgrade program around this solution! is this so difficult to see? i manage a small company. would one of my products suffer from a similar issue, that would be, what i would do … making sure, my fault will not become an issue of my customer. i have the obligation, that my customers have absolutely zero negative experience. see post #15 above..lets start an i love my hp32-sii thread in barnack's bar:rolleyes: seriously though , i completely agree. you've obviously seen my last post #556 in the lifetime service... not thread with this shit storm raging it looks like leica may need to rethink this. i'm starting to think that they should just order a supply of sensors, bear the cost, and protect their reputation. maintain the rage:mad:", "sortedWord": "None", "identifyer": 46532, "year": "2012"}, {"Unnamed: 0": 385187, "autor": "pico", "date": 1346616960000, "content": "Thanks, Pico, but a company would be unlikely to production test a screen to 160F (71C), which is well beyond the highest ambient record global temperature, because it's not designed to work in that heat. (Now I feel sure that you're going to tell me that's it's 160C in the shade in Minnesota right now.--img-- ) Last month was the hottest in all of history for us. I live in the Tropics of MinneSnowta. --img--  I do not know how hot the M9 got last month but it was too hot to hold at one point. (From habit I carry the camera with lens facing in.) No failures of any kind, except me when I almost passed out. Saved in the nick by a Guinness. Perhaps that heat might be attained in Death Valley in a car in direct sunlight with all the windows closed but the operating manual tells you not to do that so you shouldn't need to test for it. If the owner does it and the LCD fails then RTFM.--img--  Pete. RTFM? Manual? That's the shutter position off A, right? Right Turn For Manual.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/8/?tab=comments#comment-2103168", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks, pico, but a company would be unlikely to production test a screen to 160f (71c), which is well beyond the highest ambient record global temperature, because it's not designed to work in that heat. (now i feel sure that you're going to tell me that's it's 160c in the shade in minnesota right now.--img-- ) last month was the hottest in all of history for us. i live in the tropics of minnesnowta. --img--  i do not know how hot the m9 got last month but it was too hot to hold at one point. (from habit i carry the camera with lens facing in.) no failures of any kind, except me when i almost passed out. saved in the nick by a guinness. perhaps that heat might be attained in death valley in a car in direct sunlight with all the windows closed but the operating manual tells you not to do that so you shouldn't need to test for it. if the owner does it and the lcd fails then rtfm.--img--  pete. rtfm? manual? that's the shutter -----> position !!!  off a, right? right turn for manual.", "sortedWord": "None", "identifyer": 46591, "year": "2012"}, {"Unnamed: 0": 385221, "autor": "marknorton", "date": 1346915280000, "content": "Received in my junk email folder this morning... --img--  \"Dear Leica M8 User Thank you for returning your camera to us for repair. Unfortunately, your camera requires parts which, due to our being even more incompetent than usual, we have failed to keep in stock and which are now unavailable here in Solms. Fortunately, we have at our disposal \"Team Hapless\" who were last involved in marketing the Digilux 3 to an unreceptive and unenthusiastic world. They have now been deployed from their usual resting position of hiding under their desks to search the world for used M8s. We always intended that these would serve as a backup source of spare parts, distributed across a wide geographic area in case of natural or man-made disaster (the latter of which naturally excludes them being kept in Solms). I am pleased to tell you that we have located a used M8 in the middle of the Sahara Desert which will provide the parts we need to repair your camera. These will be fitted for just 10% of the normally extortionate price we charge and will carry a 3 month warranty. We will start work on your camera as soon as we can persuade the delivery camel to stand up. Best Regards from Solms, etc\"", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/10/?tab=comments#comment-2106241", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "received in my junk email folder this morning... --img--  \"dear leica m8 user thank you for returning your camera to us for repair. unfortunately, your camera requires parts which, due to our being even more incompetent than usual, we have failed to keep in stock and which are now unavailable here in solms. fortunately, we have at our disposal \"team hapless\" who were last involved in marketing the digilux 3 to an unreceptive and unenthusiastic world. they have now been deployed from their usual resting -----> position !!!  of hiding under their desks to search the world for used m8s. we always intended that these would serve as a backup source of spare parts, distributed across a wide geographic area in case of natural or man-made disaster (the latter of which naturally excludes them being kept in solms). i am pleased to tell you that we have located a used m8 in the middle of the sahara desert which will provide the parts we need to repair your camera. these will be fitted for just 10% of the normally extortionate price we charge and will carry a 3 month warranty. we will start work on your camera as soon as we can persuade the delivery camel to stand up. best regards from solms, etc\"", "sortedWord": "None", "identifyer": 46625, "year": "2012"}, {"Unnamed: 0": 385248, "autor": "farnz", "date": 1346944200000, "content": "No doubt the bean counters like the, uh, substantial sales price of the camera though... They can get this price as a direct result of the reputation... Which might cost more in parts inventory, etc... You make fair points here, but the result is that Leica is choosing not to fully support a $5000/$6000 camera after only only 3 years. Whatever the reason, it adversely affects their reputation with many of us. I agree. To be clear I wasn't intending to defend Leica's position or response, just to explain the experience I've gained through the years. Pete.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/11/?tab=comments#comment-2106568", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "no doubt the bean counters like the, uh, substantial sales price of the camera though... they can get this price as a direct result of the reputation... which might cost more in parts inventory, etc... you make fair points here, but the result is that leica is choosing not to fully support a $5000/$6000 camera after only only 3 years. whatever the reason, it adversely affects their reputation with many of us. i agree. to be clear i wasn't intending to defend leica's -----> position !!!  or response, just to explain the experience i've gained through the years. pete.", "sortedWord": "None", "identifyer": 46652, "year": "2012"}, {"Unnamed: 0": 385277, "autor": "marknorton", "date": 1347173940000, "content": "As some might expect, I take a far from conciliatory position on Leica's handling of this situation. Yesterday, I took out my two M8u's, newly upgraded with the latest firmware and used them as they were intended. They performed perfectly. Compared to the M9, I like the larger more readable display font, I like the top panel display, I like the chrome camera with the red dot. I liked them a lot. They are close to 6 years old, at which point Leica thinks they are worthless. Leica have made their bed - built a reputation of service and long operational life - and must now lie in it. They've charged a premium compared to other camera manufacturers and should now deliver the continued service reasonably expected. As I suggested in my spoof email which fell flat, Leica have a ready supply of spare parts in the population of M8s out there which they can call in by buying the cameras on the secondhand market. Users sending their camera in would have to accept it was going to receive used parts with a limited warranty. That is their contribution to the compromise forced on them by Leica being asleep on the job and not looking after their parts inventory. Leica's contribution to the same compromise is not to offer M9s on a sliding scale but to take the financial cost of doing this as a necessary part of doing business and preserving their reputation. Their stand at Photokina will cost far more, will be soon forgotten while their failure now to maintain M8s will remain a thorn in their side for years. For those who say that it's only the LCD which is the problem, I say I would expect the DSP board to become one soon if it is not already. The M8 has other parts in a similar position. The driver chip for the shutter motor was made by Sanyo and has been obsolete for a while. For those who say it is not worth spending more money repairing a camera than the repaired camera would then be worth, I point to the classic car market and the likelihood of an M3 shutter replacement and CLA (which they claim they can still do) costing more than the cost of a used M3. The bottom line is that Leica have got it wrong. Again.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/13/?tab=comments#comment-2108445", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "as some might expect, i take a far from conciliatory -----> position !!!  on leica's handling of this situation. yesterday, i took out my two m8u's, newly upgraded with the latest firmware and used them as they were intended. they performed perfectly. compared to the m9, i like the larger more readable display font, i like the top panel display, i like the chrome camera with the red dot. i liked them a lot. they are close to 6 years old, at which point leica thinks they are worthless. leica have made their bed - built a reputation of service and long operational life - and must now lie in it. they've charged a premium compared to other camera manufacturers and should now deliver the continued service reasonably expected. as i suggested in my spoof email which fell flat, leica have a ready supply of spare parts in the population of m8s out there which they can call in by buying the cameras on the secondhand market. users sending their camera in would have to accept it was going to receive used parts with a limited warranty. that is their contribution to the compromise forced on them by leica being asleep on the job and not looking after their parts inventory. leica's contribution to the same compromise is not to offer m9s on a sliding scale but to take the financial cost of doing this as a necessary part of doing business and preserving their reputation. their stand at photokina will cost far more, will be soon forgotten while their failure now to maintain m8s will remain a thorn in their side for years. for those who say that it's only the lcd which is the problem, i say i would expect the dsp board to become one soon if it is not already. the m8 has other parts in a similar position. the driver chip for the shutter motor was made by sanyo and has been obsolete for a while. for those who say it is not worth spending more money repairing a camera than the repaired camera would then be worth, i point to the classic car market and the likelihood of an m3 shutter replacement and cla (which they claim they can still do) costing more than the cost of a used m3. the bottom line is that leica have got it wrong. again.", "sortedWord": "None", "identifyer": 46681, "year": "2012"}, {"Unnamed: 0": 385278, "autor": "jaapv", "date": 1347174840000, "content": "For those who say that it's only the LCD which is the problem, I say I would expect the DSP board to become one soon if it is not already. The M8 has other parts in a similar position. The driver chip for the shutter motor was made by Sanyo and has been obsolete for a while. I take it that you are privy to the number of these parts that Leica stocks? --img-- I personally have no idea, and very much doubt that you have. --img-- ", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/13/?tab=comments#comment-2108452", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "for those who say that it's only the lcd which is the problem, i say i would expect the dsp board to become one soon if it is not already. the m8 has other parts in a similar -----> position !!! . the driver chip for the shutter motor was made by sanyo and has been obsolete for a while. i take it that you are privy to the number of these parts that leica stocks? --img-- i personally have no idea, and very much doubt that you have. --img-- ", "sortedWord": "None", "identifyer": 46682, "year": "2012"}, {"Unnamed: 0": 385280, "autor": "lm_user", "date": 1347176220000, "content": "At risk of changing the conversation. Does anyone understand the root cause of the catastrophic lcd failures? (Not the coffee stain). Should current M8 owners:Turn down the brightness of our screens and perhaps automatic playback? http://www.landmarktek.com/pdf/TK801.pdf Avoid freezing temperatures - even if the camera is off? Other? [*]I ask - because I would like to know if there are any pro-active steps I can take to maximize the life of my M8? [*]Perhaps an official \"Tips for maximizing the life of the M8 lcd screen\" could be published by Leica? They are in the best position to understand the issue and provide guidance?", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/13/?tab=comments#comment-2108462", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "at risk of changing the conversation. does anyone understand the root cause of the catastrophic lcd failures? (not the coffee stain). should current m8 owners:turn down the brightness of our screens and perhaps automatic playback? http://www.landmarktek.com/pdf/tk801.pdf avoid freezing temperatures - even if the camera is off? other? [*]i ask - because i would like to know if there are any pro-active steps i can take to maximize the life of my m8? [*]perhaps an official \"tips for maximizing the life of the m8 lcd screen\" could be published by leica? they are in the best -----> position !!!  to understand the issue and provide guidance?", "sortedWord": "None", "identifyer": 46684, "year": "2012"}, {"Unnamed: 0": 385348, "autor": "marknorton", "date": 1347577020000, "content": "I'm not sure whether Leica think the issue is dealt with but I remain highly critical of the position they have taken. My simple 3 point plan for them is as follows: 1. Leica need to accept that statements made about products made to last a lifetime are incorrect and misleading to customers and should not be used to describe their products. 2. Leica need to make a clear statement about how long they guarantee spare parts availability for current and future digital products and then back that up with inventories of quality checked parts. I think most here would regard 10 years from end of production as a workable limit for the M9 on. 3. In the special case of the M8, Leica should retain the M9 upgrade offer but supplement it with a lower cost alternative where Leica will obtain used parts from used M8s to keep broken M8s working. Users would have to accept that replacement parts might be used, pay a lower price and receive a shorter repair warranty. I think these changes would be the best solution in the circumstances and of course, someone would have to decide how long this would run for the M8. I would say 6 years from end of production would be a good compromise. I daresay Leica and the bean counters would come up with a thousand reasons why not but it's only in this way they can salvage their reputation.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/16/?tab=comments#comment-2112433", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i'm not sure whether leica think the issue is dealt with but i remain highly critical of the -----> position !!!  they have taken. my simple 3 point plan for them is as follows: 1. leica need to accept that statements made about products made to last a lifetime are incorrect and misleading to customers and should not be used to describe their products. 2. leica need to make a clear statement about how long they guarantee spare parts availability for current and future digital products and then back that up with inventories of quality checked parts. i think most here would regard 10 years from end of production as a workable limit for the m9 on. 3. in the special case of the m8, leica should retain the m9 upgrade offer but supplement it with a lower cost alternative where leica will obtain used parts from used m8s to keep broken m8s working. users would have to accept that replacement parts might be used, pay a lower price and receive a shorter repair warranty. i think these changes would be the best solution in the circumstances and of course, someone would have to decide how long this would run for the m8. i would say 6 years from end of production would be a good compromise. i daresay leica and the bean counters would come up with a thousand reasons why not but it's only in this way they can salvage their reputation.", "sortedWord": "None", "identifyer": 46752, "year": "2012"}, {"Unnamed: 0": 385496, "autor": "plasticman", "date": 1356537060000, "content": "totally agree. NO company does that. I admit I put this very badly in my original post, but in fact companies position their products in this way all the time: disabling an output on a hi-fi system; not allowing leather seating in a specific car model, and so on. The role of the M-E is therefore as a 'positional good' in relation to the M - which is in turn a classic 'Veblen good'. PS: I didn't mean my posts to be an attack on the M-E. As far as I'm concerned, I'm yet to meet anyone who likes it, and I'm basing my views on that general fact - it seems that a lot of people are at the very least indifferent to the color and spec of the camera. I genuinely think that Leica could quite easily have continued producing an all-black camera, and that such a product would have sold at a better rate than the M-Es that are sitting on shelves. Why they chose a color that isn't for everyone is up to others to decide, if they disagree with my speculative analysis. Edited December 26, 2012 by plasticman", "link": "https://www.l-camera-forum.com/topic/194174-tempted-by-m-e/page/2/?tab=comments#comment-2198128", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "totally agree. no company does that. i admit i put this very badly in my original post, but in fact companies -----> position !!!  their products in this way all the time: disabling an output on a hi-fi system; not allowing leather seating in a specific car model, and so on. the role of the m-e is therefore as a 'positional good' in relation to the m - which is in turn a classic 'veblen good'. ps: i didn't mean my posts to be an attack on the m-e. as far as i'm concerned, i'm yet to meet anyone who likes it, and i'm basing my views on that general fact - it seems that a lot of people are at the very least indifferent to the color and spec of the camera. i genuinely think that leica could quite easily have continued producing an all-black camera, and that such a product would have sold at a better rate than the m-es that are sitting on shelves. why they chose a color that isn't for everyone is up to others to decide, if they disagree with my speculative analysis. edited december 26, 2012 by plasticman", "sortedWord": "None", "identifyer": 46900, "year": "2012"}, {"Unnamed: 0": 385498, "autor": "iedei", "date": 1356542160000, "content": " I admit I put this very badly in my original post, but in fact companies position their products in this way all the time: disabling an output on a hi-fi system; not allowing leather seating in a specific car model, and so on. true, however of the couple features removed on the M-E....neither of which were particularly useful or needed to most users. It would be more akin to a new 'facelifted' car which had a smaller spoiler OR less chrome trim around the edges..... I agree with you that the M-E has been met with a lukewarm reception, however being a fan of the M-E myself----i think this more due to snobbery then actual evaluation of the product. I also think that this has been spread by M9 owners who are angry they paid significantly more for the same camera! --img--  Edited December 26, 2012 by iedei", "link": "https://www.l-camera-forum.com/topic/194174-tempted-by-m-e/page/3/?tab=comments#comment-2198203", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " i admit i put this very badly in my original post, but in fact companies -----> position !!!  their products in this way all the time: disabling an output on a hi-fi system; not allowing leather seating in a specific car model, and so on. true, however of the couple features removed on the m-e....neither of which were particularly useful or needed to most users. it would be more akin to a new 'facelifted' car which had a smaller spoiler or less chrome trim around the edges..... i agree with you that the m-e has been met with a lukewarm reception, however being a fan of the m-e myself----i think this more due to snobbery then actual evaluation of the product. i also think that this has been spread by m9 owners who are angry they paid significantly more for the same camera! --img--  edited december 26, 2012 by iedei", "sortedWord": "None", "identifyer": 46902, "year": "2012"}, {"Unnamed: 0": 394859, "autor": "brianv", "date": 1349697420000, "content": " The new lens is a Sonnar. I learned that the front section of a Sonnar is a \"Telephoto\" design, a long focal length. On the 50mm (ish) lenses the front section is about 120mm focal length and the back triplet is about 50mm. The optics are positioned closely to get the overall 50mm focal length. That gives an explanation of the short length of a Sonnar 50 compared with others. I also looked at an 85, 105, and 135 Sonnar formula lenses: they follow the same stategy: front section is a telephoto design about 2.5 times the focal length of the completed lens, the rear element is about the same as the focal length of the lens. Started looking at this for the Jupiter-9 with the reduced focal length. I also have a Nikkor 105/2.5 in S-Mount that needs a new rear element. If the lenses ordered from Surplusshack do not cut it, I will use an F-Mount lens for the donor.", "link": "https://www.l-camera-forum.com/topic/268173-the-view-through-older-glass/page/12/?tab=comments#comment-2136051", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": " the new lens is a sonnar. i learned that the front section of a sonnar is a \"telephoto\" design, a long focal length. on the 50mm (ish) lenses the front section is about 120mm focal length and the back triplet is about 50mm. the optics are -----> positioned !!!  closely to get the overall 50mm focal length. that gives an explanation of the short length of a sonnar 50 compared with others. i also looked at an 85, 105, and 135 sonnar formula lenses: they follow the same stategy: front section is a telephoto design about 2.5 times the focal length of the completed lens, the rear element is about the same as the focal length of the lens. started looking at this for the jupiter-9 with the reduced focal length. i also have a nikkor 105/2.5 in s-mount that needs a new rear element. if the lenses ordered from surplusshack do not cut it, i will use an f-mount lens for the donor.", "sortedWord": "None", "identifyer": 7327, "year": "2012"}, {"Unnamed: 0": 394866, "autor": "brianv", "date": 1349729820000, "content": "At F4: --img-- Can-Nikkor 50mm F1.5, at F4 by anachronist1, on Flickr Made from the front section of a Canon Serenar 50mm F1.5 and the rear triplet of a later Nikkor 5cm F1.4. RF coupling is good throught the entire focus range. I mounted the front section using the original main shim and positioned the mismatched rear triplet until focus was good mid-range at 15ft.", "link": "https://www.l-camera-forum.com/topic/268173-the-view-through-older-glass/page/12/?tab=comments#comment-2136685", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "at f4: --img-- can-nikkor 50mm f1.5, at f4 by anachronist1, on flickr made from the front section of a canon serenar 50mm f1.5 and the rear triplet of a later nikkor 5cm f1.4. rf coupling is good throught the entire focus range. i mounted the front section using the original main shim and -----> positioned !!!  the mismatched rear triplet until focus was good mid-range at 15ft.", "sortedWord": "None", "identifyer": 7334, "year": "2012"}, {"Unnamed: 0": 394868, "autor": "philipus", "date": 1349731020000, "content": "I mounted the front section using the original main shim and positioned the mismatched rear triplet until focus was good mid-range at 15ft. Very cool indeed, impressive. I'd be very interested to see a photo of the lens.", "link": "https://www.l-camera-forum.com/topic/268173-the-view-through-older-glass/page/12/?tab=comments#comment-2136706", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "i mounted the front section using the original main shim and -----> positioned !!!  the mismatched rear triplet until focus was good mid-range at 15ft. very cool indeed, impressive. i'd be very interested to see a photo of the lens.", "sortedWord": "None", "identifyer": 7336, "year": "2012"}, {"Unnamed: 0": 404002, "autor": "StS", "date": 1334608860000, "content": "I have the same lens, where the aperture ring behaves in the same way as Luigi's. A simple fix could be to choose f/2 as rest position, the aperture ring will then be countered by the lens lock, when stopping down. Stefan", "link": "https://www.l-camera-forum.com/topic/177313-summicron-5cm-f2-collapsible-question/?tab=comments#comment-1985319", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i have the same lens, where the aperture ring behaves in the same way as luigi's. a simple fix could be to choose f/2 as rest -----> position !!! , the aperture ring will then be countered by the lens lock, when stopping down. stefan", "sortedWord": "None", "identifyer": 16761, "year": "2012"}, {"Unnamed: 0": 404004, "autor": "McGirton", "date": 1334677080000, "content": "after some research i found an easy way to fix it: \"Take the lens off that camera, and look at the back of the lens barrel, the part that slides out, while it is in the collapsed position. There are three curved strips of brass along the rear edge. These three strips are what prevent the lens from unlocking. In some cases they have been pushed too close to the lens barrel, so they do not present enough friction to prevent the lens from unlocking. Take a thin strip of plastic (I caution you not to use a steel knife, or a Swiss Army screw driver, as they can mark the brass), and gently push the end of the strips outwards, less than 0.2mm. Do this in increments and then try to lock and unlock the lens. It should work.\" it worked great and now the lens locks like a charme and switching aperture isn't a problem anymore.", "link": "https://www.l-camera-forum.com/topic/177313-summicron-5cm-f2-collapsible-question/?tab=comments#comment-1985985", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "after some research i found an easy way to fix it: \"take the lens off that camera, and look at the back of the lens barrel, the part that slides out, while it is in the collapsed -----> position !!! . there are three curved strips of brass along the rear edge. these three strips are what prevent the lens from unlocking. in some cases they have been pushed too close to the lens barrel, so they do not present enough friction to prevent the lens from unlocking. take a thin strip of plastic (i caution you not to use a steel knife, or a swiss army screw driver, as they can mark the brass), and gently push the end of the strips outwards, less than 0.2mm. do this in increments and then try to lock and unlock the lens. it should work.\" it worked great and now the lens locks like a charme and switching aperture isn't a problem anymore.", "sortedWord": "None", "identifyer": 16763, "year": "2012"}, {"Unnamed: 0": 404006, "autor": "luigi bertolotti", "date": 1334731800000, "content": " after some research i found an easy way to fix it: \"Take the lens off that camera, and look at the back of the lens barrel, the part that slides out, while it is in the collapsed position. There are three curved strips of brass along the rear edge. These three strips are what prevent the lens from unlocking. In some cases they have been pushed too close to the lens barrel, so they do not present enough friction to prevent the lens from unlocking. Take a thin strip of plastic (I caution you not to use a steel knife, or a Swiss Army screw driver, as they can mark the brass), and gently push the end of the strips outwards, less than 0.2mm. Do this in increments and then try to lock and unlock the lens. It should work.\" it worked great and now the lens locks like a charme and switching aperture isn't a problem anymore. Good finding... --img-- ...a useful trick... I understand you operated on the three little \"blades\" along the black final part of the tube... I did not know it was only up to them the locking of the Summicron... I thought there was also an (invisible) milled guide like in the Summitar (see picture hereunder - Summitar at left, Summicron at right). In this forum one never ends to acquire some new information... --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/177313-summicron-5cm-f2-collapsible-question/?tab=comments#comment-1986475", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " after some research i found an easy way to fix it: \"take the lens off that camera, and look at the back of the lens barrel, the part that slides out, while it is in the collapsed -----> position !!! . there are three curved strips of brass along the rear edge. these three strips are what prevent the lens from unlocking. in some cases they have been pushed too close to the lens barrel, so they do not present enough friction to prevent the lens from unlocking. take a thin strip of plastic (i caution you not to use a steel knife, or a swiss army screw driver, as they can mark the brass), and gently push the end of the strips outwards, less than 0.2mm. do this in increments and then try to lock and unlock the lens. it should work.\" it worked great and now the lens locks like a charme and switching aperture isn't a problem anymore. good finding... --img-- ...a useful trick... i understand you operated on the three little \"blades\" along the black final part of the tube... i did not know it was only up to them the locking of the summicron... i thought there was also an (invisible) milled guide like in the summitar (see picture hereunder - summitar at left, summicron at right). in this forum one never ends to acquire some new information... --img-- --img-- ", "sortedWord": "None", "identifyer": 16765, "year": "2012"}, {"Unnamed: 0": 408926, "autor": "k-hawinkler", "date": 1353664980000, "content": " In a way to me it seems to be a mute point whether framelines are displayed in the M-240's rangefinder window when a non-rangefinder coupled adapter is attached. As it's non-coupled the parallax adjustment isn't operative. Furthermore for large lenses attached, that window's view is substantially blocked. So, in this case the rangefinder window cannot be used for either framing or focusing. In this situation the M-240's rangefinder window might as well not display framelines at all. So, just for fun, I checked out which frame lines my M9 displays when various adapters are being attached. To get a base understanding: Lever in the outward position displays framelines for 35 and 135 mm focal lengths. Lever in the vertical position displays framelines for 50 and 75 mm focal lengths. Lever in the inward position displays framelines for 28 and 90 mm focal lengths. When no lens or adapter is attached the lever is in the outward position. Furthermore the coupling pin at the top is positioned as outward as possible, corresponding to close focus. As one pushes that pin in, frame lines move from lower right to upper left. Pushed all the way in seems to correspond to infinity focus. Now, let's see what happens when I attach 5 different adapters to the M9: • NOVOFLEX LEM/LER adapter attached, lever in vertical position. • NOVOFLEX LEM/NIK-NT adapter attached, lever in vertical position. • Fotodiox LR-LM adapter attached, lever in outward position. • No Name Nikon-LM Japan adapter attached, lever in vertical position. • No Name Nikon(G)-LM adapter attached, lever in outward position.", "link": "https://www.l-camera-forum.com/topic/192591-lens-code-for-new-apo-50-f2-confusion/page/2/?tab=comments#comment-2173030", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " in a way to me it seems to be a mute point whether framelines are displayed in the m-240's rangefinder window when a non-rangefinder coupled adapter is attached. as it's non-coupled the parallax adjustment isn't operative. furthermore for large lenses attached, that window's view is substantially blocked. so, in this case the rangefinder window cannot be used for either framing or focusing. in this situation the m-240's rangefinder window might as well not display framelines at all. so, just for fun, i checked out which frame lines my m9 displays when various adapters are being attached. to get a base understanding: lever in the outward -----> position !!!  displays framelines for 35 and 135 mm focal lengths. lever in the vertical position displays framelines for 50 and 75 mm focal lengths. lever in the inward position displays framelines for 28 and 90 mm focal lengths. when no lens or adapter is attached the lever is in the outward position. furthermore the coupling pin at the top is positioned as outward as possible, corresponding to close focus. as one pushes that pin in, frame lines move from lower right to upper left. pushed all the way in seems to correspond to infinity focus. now, let's see what happens when i attach 5 different adapters to the m9: • novoflex lem/ler adapter attached, lever in vertical position. • novoflex lem/nik-nt adapter attached, lever in vertical position. • fotodiox lr-lm adapter attached, lever in outward position. • no name nikon-lm japan adapter attached, lever in vertical position. • no name nikon(g)-lm adapter attached, lever in outward position.", "sortedWord": "None", "identifyer": 21737, "year": "2012"}], "name": "positionL-Forum2012"}