{"interestingcomments": [{"Unnamed: 0": 353418, "autor": "ramarren", "date": 1470778920000, "content": "Thorsten and Godfrey .... Just a question .... When I was using film Ms it seemed like the back rotating Iso setting was always getting askew ... How is it with the M-D? Bob I don't remember how it was with the M6/M6TTL. With the M-D, it's nicely weighted click stops, holds position securely until you change it.", "link": "https://www.l-camera-forum.com/topic/262069-i-love-my-m-d-262/page/3/?tab=comments#comment-3093726", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thorsten and godfrey .... just a question .... when i was using film ms it seemed like the back rotating iso setting was always getting askew ... how is it with the m-d? bob i don't remember how it was with the m6/m6ttl. with the m-d, it's nicely weighted click stops, holds -----> position !!!  securely until you change it.", "sortedWord": "None", "identifyer": 14563, "year": "2016"}, {"Unnamed: 0": 355682, "autor": "LUF Admin", "date": 1461937740000, "content": " Just received the press release from Leica: Finally the new firmware for Leica M240 / M262 / Monochrom 246! First things first: The annoying message (“check battery age”) is gone Leica M (Typ 240) FW 2.0.3.0https://en.leica-camera.com/Service-Support/Support/Downloads?category=&subcategory=93711&type=108942&language=68389 Leica M (Typ 262) FW 1.0.0.6https://en.leica-camera.com/Service-Support/Support/Downloads?category=&subcategory=129115&type=108942&language=68389Leica M Monochrom (Typ 246) FW 1.0.1.0https://en.leica-camera.com/Service-Support/Support/Downloads?category=&subcategory=124179&type=108942&language=68389Important: Don't forget to save your profiles before you update!Performance Improvements:• Implemented optimizations that prevent the camera controls from becoming unresponsive after a series of continuous burst photos fills the buffer.• The selected user profile will be displayed even when exposure compensation has been adjusted. Exposure compensation is no longer saved to the user profile.• Memory cards with a capacity up to 512 GB are supported• The default file format settings upon camera reset have been changed from „JPG“ to „DNG+JPG“• The time-out period for the last GPS Position, when no GPS signal is received, has been extended to 2.5 hours (GPS is not available with M (Typ 262))• It is now possible to display DNG files from the Leica M Monochrom (Typ 246) in all zoom steps, also with the M/M-P (Typ 240 and 262)• When using SD-cards that are too slow for movie recording, a message appears in the viewfinder display Bug Fixes:• Bugs, that led to a camera freeze when shooting fast sequences, have been fixed• The accuracy of the internal clock has been improved• When using „AUTO ISO in M mode“ the used exposure metering mode is now being displayed in play mode• Files larger than 2GB can now be transferred from the camera to the PC via USB• The display of the histogram has been optimized for high ISO values• The display of flash exposure compensation values has been improved in the menu• A misleading message (“check battery age”) has been removed• In case of Leica M Monochrom (Typ 246): A bug that led to black pixels in fine pattern has been fixed• Further system optimizations have been implemented Edited April 29, 2016 by LUF Admin Corrected links / Added Warning", "link": "https://www.l-camera-forum.com/topic/259897-firmware-update-leica-m240-m262-monochrom-246/?tab=comments#comment-3035765", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " just received the press release from leica: finally the new firmware for leica m240 / m262 / monochrom 246! first things first: the annoying message (“check battery age”) is gone leica m (typ 240) fw 2.0.3.0https://en.leica-camera.com/service-support/support/downloads?category=&subcategory=93711&type=108942&language=68389 leica m (typ 262) fw 1.0.0.6https://en.leica-camera.com/service-support/support/downloads?category=&subcategory=129115&type=108942&language=68389leica m monochrom (typ 246) fw 1.0.1.0https://en.leica-camera.com/service-support/support/downloads?category=&subcategory=124179&type=108942&language=68389important: don't forget to save your profiles before you update!performance improvements:• implemented optimizations that prevent the camera controls from becoming unresponsive after a series of continuous burst photos fills the buffer.• the selected user profile will be displayed even when exposure compensation has been adjusted. exposure compensation is no longer saved to the user profile.• memory cards with a capacity up to 512 gb are supported• the default file format settings upon camera reset have been changed from „jpg“ to „dng+jpg“• the time-out period for the last gps -----> position !!! , when no gps signal is received, has been extended to 2.5 hours (gps is not available with m (typ 262))• it is now possible to display dng files from the leica m monochrom (typ 246) in all zoom steps, also with the m/m-p (typ 240 and 262)• when using sd-cards that are too slow for movie recording, a message appears in the viewfinder display bug fixes:• bugs, that led to a camera freeze when shooting fast sequences, have been fixed• the accuracy of the internal clock has been improved• when using „auto iso in m mode“ the used exposure metering mode is now being displayed in play mode• files larger than 2gb can now be transferred from the camera to the pc via usb• the display of the histogram has been optimized for high iso values• the display of flash exposure compensation values has been improved in the menu• a misleading message (“check battery age”) has been removed• in case of leica m monochrom (typ 246): a bug that led to black pixels in fine pattern has been fixed• further system optimizations have been implemented edited april 29, 2016 by luf admin corrected links / added warning", "sortedWord": "None", "identifyer": 16847, "year": "2016"}, {"Unnamed: 0": 358661, "autor": "enboe", "date": 1465098900000, "content": " Leica has created a digital version of their M7 film offering. I was fortunate enough to purchase one of these cameras three weeks ago. I put my name on the local wait list even before the camera was announced, but was bumped a couple of positions by higher-priority customers and saw the opportunity to have a camera in hand in time for a planned vacation, so I bit. Shooting Leicas is a major entertainment outlet for me, and I have shot with every mainline production M I can think of, M1, M2, M3, M4, M5, M4-2, M4-P, M6, M6TTL, M7, MP, M-A, M8, M8.2, M9P, Monochrom, M-P240, M246, and M262. Still, the screen-less Leica digital sounded like loads of fun, and did not disappoint. I have had the chance to shoot my M-D for one day at Universal Studios Hollywood and for 8 days in the various attractions in Orlando, Florida. During this time, I averaged 150 frames per day, for a total of just under 1400 images. I shot the camera “naked” of any case or protector for the minimum bulk. I attached the new 35mm/2.0/ASPH/II lens and an E39 UVa and didn’t look back. The camera shoots like an M7. It meters like an M7, focuses like an M7, and uses the same muscle memories for the on/off switch that I developed with my M7. The big difference is not the extra depth, which is truly minimal, but rather the adjustable ISO dial on the back, which you don’t get to leverage on an M7 without changing rolls of film. Having any speed film from 200-6400 ISO at the twist of a dial is very handy. The rest of the body works like an M7, and the bump on the back of the top plate holds your thumb very much like a film winding lever. All in all, an excellent handling design. O.K., there is one tiny new item I need to train myself on, that is the use of the function button and rear control thumb wheel to adjust exposure compensation. Luckily the meter is good enough you don’t need to use it often. The shutter sound is discrete like an M should be, very much like the one in the M262, which has the current best M digital shutter. Several aspects of performance warrant discussion. First and foremost, the image quality is every bit as good as any of the other ‘240 class cameras. The default compressed DNG files are superb and offer lots of flexibility for image editing. The second area worth note is the metering. The pattern used is the ‘240-series “Classic” pattern, which uses reflections off of the central blades of the shutter curtain. Metering reflected off of curtain works very well and quickly, although the metering can occasionally be fooled by high or low-key lighting. The solution is what I term, “nodding the camera”. You simply point the camera down for lower shutter speeds, up for higher shutter speeds, then hold the exposure with a half-press of the shutter release and recompose your final shot. Using this approach, I achieved exposures that were around ½ stop underexposed 98-99% of the time. The slight underexposure is perfect for ensuring you don’t blow out your highlights, and the dynamic range of the sensor and resultant files pulls the details out of the rest of the image and the shadows without issue. The continuous burst buffer is good for 10 shots in a sequence. Battery consumption hovered around 15% per day for an average 150 photos, which extrapolates to 1000 photos on a full charge. These numbers were achieved by turning the camera off between periods of use. I did confirm the hard way, however, that the camera does not have an auto-off, and I would up with a dead battery one morning. I would recommend having a spare charged battery readily available in case you make a similar mistake. The M-D comes with a hard black paint finish over brass. I would have preferred a silver chrome version, and may pick one up in the future if offered, but the black paint chosen for the current version is very durable, with no signs of wear after 9 days in busy amusement parks. This is no MP black lacquer, and your camera will not resemble the Kravitz ‘240 for quite a long time of use. Other than the aforementioned dead battery, the camera was 100% reliable, with no crashes or hang-ups. It wrote every single image I took to SD card without error, something no other M digital I have owned can claim. It really is that good. If I were to make two changes, I would add silver chrome as an option for the top and bottom plates and hardware, and maybe a two-position on/off switch versus the current Off/S/C/Timer. I did overachieve and put the camera into Continuous mode when I wanted Single, but no harm came, and no images or opportunities were lost. Oh, and did I mention it had the cleanest sensor straight out of the box of the 11 digital Ms I’ve purchased since 2006? Not a speck of dust! I did have the chance to share the camera over lunch with a friend named Kevin who has made a career out of photography. He loves his M’s, but also shoots a lot of Canons for digital stills, and other gear for video. I explained the philosophy behind the camera as a reliable tool where you stay focused on your subject and environment to be ready for the next shot, not reviewing the past image. I caught him chimping the ISO dial a few times, and when I commented he said, “you’re right, this will take some getting used to, but it’s a good thing, and I need to get me one of these (M-D).” Kevin supervises a number of other photography professionals, and I would not be surprised to see their department adopting a no-screen shooters challenge as a way of capturing more “decisive moment” images. This, of course, requires equipment that is 100% reliable and predictable, and photographers with the skills to make the most out of the equipment on every image. The M-D is up to the task. So, who should buy this camera? This is a little bit hard to define. The camera is ultra-reliable, produces excellent images, and is totally predictable. It should be durable enough to last for decades. I would expect the batteries and SD cards will be the lifespan-limiting commodities, not the M-D. If you want a “decisive moment” Leica M digital for still images only, and have at least some skill with M cameras, this is an excellent selection, and could be your only M. If you need to work at the limits of M capabilities, lenses wider than 28 or longer than 90 (subjective), shoot macro, hold cameras overhead or away from your eye for perspective or safety,, shoot at f/0.95, or need to capture short video clips, then a ‘240 may be a better tool, but don’t forget the lessons the M-D and prior film M cameras teach us.", "link": "https://www.l-camera-forum.com/topic/261262-a-few-comments-based-upon-two-outings-with-the-leica-m-d-type-262-camera/?tab=comments#comment-3056848", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": " leica has created a digital version of their m7 film offering. i was fortunate enough to purchase one of these cameras three weeks ago. i put my name on the local wait list even before the camera was announced, but was bumped a couple of -----> positions !!!  by higher-priority customers and saw the opportunity to have a camera in hand in time for a planned vacation, so i bit. shooting leicas is a major entertainment outlet for me, and i have shot with every mainline production m i can think of, m1, m2, m3, m4, m5, m4-2, m4-p, m6, m6ttl, m7, mp, m-a, m8, m8.2, m9p, monochrom, m-p240, m246, and m262. still, the screen-less leica digital sounded like loads of fun, and did not disappoint. i have had the chance to shoot my m-d for one day at universal studios hollywood and for 8 days in the various attractions in orlando, florida. during this time, i averaged 150 frames per day, for a total of just under 1400 images. i shot the camera “naked” of any case or protector for the minimum bulk. i attached the new 35mm/2.0/asph/ii lens and an e39 uva and didn’t look back. the camera shoots like an m7. it meters like an m7, focuses like an m7, and uses the same muscle memories for the on/off switch that i developed with my m7. the big difference is not the extra depth, which is truly minimal, but rather the adjustable iso dial on the back, which you don’t get to leverage on an m7 without changing rolls of film. having any speed film from 200-6400 iso at the twist of a dial is very handy. the rest of the body works like an m7, and the bump on the back of the top plate holds your thumb very much like a film winding lever. all in all, an excellent handling design. o.k., there is one tiny new item i need to train myself on, that is the use of the function button and rear control thumb wheel to adjust exposure compensation. luckily the meter is good enough you don’t need to use it often. the shutter sound is discrete like an m should be, very much like the one in the m262, which has the current best m digital shutter. several aspects of performance warrant discussion. first and foremost, the image quality is every bit as good as any of the other ‘240 class cameras. the default compressed dng files are superb and offer lots of flexibility for image editing. the second area worth note is the metering. the pattern used is the ‘240-series “classic” pattern, which uses reflections off of the central blades of the shutter curtain. metering reflected off of curtain works very well and quickly, although the metering can occasionally be fooled by high or low-key lighting. the solution is what i term, “nodding the camera”. you simply point the camera down for lower shutter speeds, up for higher shutter speeds, then hold the exposure with a half-press of the shutter release and recompose your final shot. using this approach, i achieved exposures that were around ½ stop underexposed 98-99% of the time. the slight underexposure is perfect for ensuring you don’t blow out your highlights, and the dynamic range of the sensor and resultant files pulls the details out of the rest of the image and the shadows without issue. the continuous burst buffer is good for 10 shots in a sequence. battery consumption hovered around 15% per day for an average 150 photos, which extrapolates to 1000 photos on a full charge. these numbers were achieved by turning the camera off between periods of use. i did confirm the hard way, however, that the camera does not have an auto-off, and i would up with a dead battery one morning. i would recommend having a spare charged battery readily available in case you make a similar mistake. the m-d comes with a hard black paint finish over brass. i would have preferred a silver chrome version, and may pick one up in the future if offered, but the black paint chosen for the current version is very durable, with no signs of wear after 9 days in busy amusement parks. this is no mp black lacquer, and your camera will not resemble the kravitz ‘240 for quite a long time of use. other than the aforementioned dead battery, the camera was 100% reliable, with no crashes or hang-ups. it wrote every single image i took to sd card without error, something no other m digital i have owned can claim. it really is that good. if i were to make two changes, i would add silver chrome as an option for the top and bottom plates and hardware, and maybe a two-position on/off switch versus the current off/s/c/timer. i did overachieve and put the camera into continuous mode when i wanted single, but no harm came, and no images or opportunities were lost. oh, and did i mention it had the cleanest sensor straight out of the box of the 11 digital ms i’ve purchased since 2006? not a speck of dust! i did have the chance to share the camera over lunch with a friend named kevin who has made a career out of photography. he loves his m’s, but also shoots a lot of canons for digital stills, and other gear for video. i explained the philosophy behind the camera as a reliable tool where you stay focused on your subject and environment to be ready for the next shot, not reviewing the past image. i caught him chimping the iso dial a few times, and when i commented he said, “you’re right, this will take some getting used to, but it’s a good thing, and i need to get me one of these (m-d).” kevin supervises a number of other photography professionals, and i would not be surprised to see their department adopting a no-screen shooters challenge as a way of capturing more “decisive moment” images. this, of course, requires equipment that is 100% reliable and predictable, and photographers with the skills to make the most out of the equipment on every image. the m-d is up to the task. so, who should buy this camera? this is a little bit hard to define. the camera is ultra-reliable, produces excellent images, and is totally predictable. it should be durable enough to last for decades. i would expect the batteries and sd cards will be the lifespan-limiting commodities, not the m-d. if you want a “decisive moment” leica m digital for still images only, and have at least some skill with m cameras, this is an excellent selection, and could be your only m. if you need to work at the limits of m capabilities, lenses wider than 28 or longer than 90 (subjective), shoot macro, hold cameras overhead or away from your eye for perspective or safety,, shoot at f/0.95, or need to capture short video clips, then a ‘240 may be a better tool, but don’t forget the lessons the m-d and prior film m cameras teach us.", "sortedWord": "None", "identifyer": 19840, "year": "2016"}, {"Unnamed: 0": 358672, "autor": "Budfox", "date": 1465391880000, "content": "Enboe, nice review and thanks for the exposure tips. If you wanted an M-D with a two position only on/off switch you could have purchased an M60 - which also has auto power off and includes a free leather case and lens. All this for only double the price.", "link": "https://www.l-camera-forum.com/topic/261262-a-few-comments-based-upon-two-outings-with-the-leica-m-d-type-262-camera/?tab=comments#comment-3058585", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "enboe, nice review and thanks for the exposure tips. if you wanted an m-d with a two -----> position !!!  only on/off switch you could have purchased an m60 - which also has auto power off and includes a free leather case and lens. all this for only double the price.", "sortedWord": "None", "identifyer": 19851, "year": "2016"}, {"Unnamed: 0": 358676, "autor": "jcraf", "date": 1465476480000, "content": "Enboe, nice review and thanks for the exposure tips. If you wanted an M-D with a two position only on/off switch you could have purchased an M60 - which also has auto power off and includes a free leather case and lens. All this for only double the price. At least one dealer in the UK is now selling their remaining few used M60 sets for considerably less than the combined cost of a new M-D & 35 Summilux FLE. Tempting, eh?", "link": "https://www.l-camera-forum.com/topic/261262-a-few-comments-based-upon-two-outings-with-the-leica-m-d-type-262-camera/?tab=comments#comment-3059076", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "enboe, nice review and thanks for the exposure tips. if you wanted an m-d with a two -----> position !!!  only on/off switch you could have purchased an m60 - which also has auto power off and includes a free leather case and lens. all this for only double the price. at least one dealer in the uk is now selling their remaining few used m60 sets for considerably less than the combined cost of a new m-d & 35 summilux fle. tempting, eh?", "sortedWord": "None", "identifyer": 19855, "year": "2016"}, {"Unnamed: 0": 359680, "autor": "fweens", "date": 1458722820000, "content": "Thanks Peter for the tests! As you said flash head pointed at 45 degrees; yesterday in the shop we realized it was working with the head in that position but not if you keep the head pointed at 0 degrees... Weird! Best, Franck", "link": "https://www.l-camera-forum.com/topic/258431-leica-m-flash-sf-40/?tab=comments#comment-3012766", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks peter for the tests! as you said flash head pointed at 45 degrees; yesterday in the shop we realized it was working with the head in that -----> position !!!  but not if you keep the head pointed at 0 degrees... weird! best, franck", "sortedWord": "None", "identifyer": 20863, "year": "2016"}, {"Unnamed: 0": 359682, "autor": "Peter Kilmister", "date": 1458723300000, "content": "Franck, My flash also works with the head in a straight forward facing position (0 degrees).", "link": "https://www.l-camera-forum.com/topic/258431-leica-m-flash-sf-40/?tab=comments#comment-3012771", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "franck, my flash also works with the head in a straight forward facing -----> position !!!  (0 degrees).", "sortedWord": "None", "identifyer": 20865, "year": "2016"}, {"Unnamed: 0": 359709, "autor": "Ron Weissman", "date": 1471414740000, "content": "I tried the SF 40 flash on the M240 tonight (latest firmware). I rarely shoot flash at the zero degree (flash head pointing at subject). Normally use bounce flash, which works fine on my other Leicas (SL, T). On the M240 all I got was significant underexposure when bouncing in a less than brightly lit room, but perfect exposure with flash in zero degree (non bounce) position in the same room. To remedy this, I tried all of the suggestions made so far in this forum. The flash itself is not underpowered for the dark room and the other settings I was using. Switching to manual flash and 1/32 or 1/16 power (with all other settings remaining constant) resulted in beautiful, well-lit shots in the darkened room. Surprisingly, I did find one setting that worked in TTL mode with bounce flash: switching the shutter speed to 1/250. Using the supposed top sync speed of 1/180 (the red lightning bolt setting on the shutter speed dial) resulted in the typical underexposure of the other settings. But setting the shutter speed to 1/250 yielded a well exposed picture. Other settings were F4 (using the brightest aperture on a 35mm or 28mm or 50mm MATE--tried them all) and auto ISO (max 3200). This has me quite puzzled since max sync speed is supposed to be 1/180. Max sync yielded terrible results with bounce flash but fine results at 1/250.", "link": "https://www.l-camera-forum.com/topic/258431-leica-m-flash-sf-40/page/2/?tab=comments#comment-3097501", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i tried the sf 40 flash on the m240 tonight (latest firmware). i rarely shoot flash at the zero degree (flash head pointing at subject). normally use bounce flash, which works fine on my other leicas (sl, t). on the m240 all i got was significant underexposure when bouncing in a less than brightly lit room, but perfect exposure with flash in zero degree (non bounce) -----> position !!!  in the same room. to remedy this, i tried all of the suggestions made so far in this forum. the flash itself is not underpowered for the dark room and the other settings i was using. switching to manual flash and 1/32 or 1/16 power (with all other settings remaining constant) resulted in beautiful, well-lit shots in the darkened room. surprisingly, i did find one setting that worked in ttl mode with bounce flash: switching the shutter speed to 1/250. using the supposed top sync speed of 1/180 (the red lightning bolt setting on the shutter speed dial) resulted in the typical underexposure of the other settings. but setting the shutter speed to 1/250 yielded a well exposed picture. other settings were f4 (using the brightest aperture on a 35mm or 28mm or 50mm mate--tried them all) and auto iso (max 3200). this has me quite puzzled since max sync speed is supposed to be 1/180. max sync yielded terrible results with bounce flash but fine results at 1/250.", "sortedWord": "None", "identifyer": 20892, "year": "2016"}, {"Unnamed: 0": 359710, "autor": "fweens", "date": 1471464540000, "content": "Hi Ron, Thanks for your post :-) I'll try the 1/250 speed... However in my case, the flash in zero degree position didn't work for me but it worked bounced in other than zero degree positions... Best, Franck", "link": "https://www.l-camera-forum.com/topic/258431-leica-m-flash-sf-40/page/2/?tab=comments#comment-3097920", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi ron, thanks for your post :-) i'll try the 1/250 speed... however in my case, the flash in zero degree -----> position !!!  didn't work for me but it worked bounced in other than zero degree positions... best, franck", "sortedWord": "None", "identifyer": 20893, "year": "2016"}, {"Unnamed: 0": 359728, "autor": "FMB", "date": 1472039220000, "content": "Thanks Francisco ; when it was not completely locked, did you have fails but sometimes success ? I'll try that but some other people here have the same problem and when I went to the Leica Store, the guy took a new Leica M + new SF40 and could experiment the same problem... Franck Yes,of course, and it would depend on the position in every moment of the contacts that according the weight of the flash would force to touch one with another or not. Unless the flash fell. I full agree with Peter about using batteries.... Francisco.", "link": "https://www.l-camera-forum.com/topic/258431-leica-m-flash-sf-40/page/3/?tab=comments#comment-3101073", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks francisco ; when it was not completely locked, did you have fails but sometimes success ? i'll try that but some other people here have the same problem and when i went to the leica store, the guy took a new leica m + new sf40 and could experiment the same problem... franck yes,of course, and it would depend on the -----> position !!!  in every moment of the contacts that according the weight of the flash would force to touch one with another or not. unless the flash fell. i full agree with peter about using batteries.... francisco.", "sortedWord": "None", "identifyer": 20911, "year": "2016"}, {"Unnamed: 0": 381746, "autor": "dpitt", "date": 1481159280000, "content": "I think it will show the 50mm frame. The same as with the Summicron 40C. 50mm frames for the 40mm lenses are pretty much useless because they are much too tight IMO. However, you can hold the frame lever to 35mm with your finger and 35mm frames on the M8 or M8.2 are very accurate as long as you take the inside of the lines. You can have the bajonet modified to show the 35mm frames automatically or you can sort of ‘jam’ the frame lever into 35mm position with something if you do not want to do the mod. However, be careful not to apply to much force because the lever may come off. (for more details search for a post I made in 2009 if i remember it right) Edited December 8, 2016 by dpitt", "link": "https://www.l-camera-forum.com/topic/267169-voigtlander-40mm-f14-on-leica-882/?tab=comments#comment-3162579", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think it will show the 50mm frame. the same as with the summicron 40c. 50mm frames for the 40mm lenses are pretty much useless because they are much too tight imo. however, you can hold the frame lever to 35mm with your finger and 35mm frames on the m8 or m8.2 are very accurate as long as you take the inside of the lines. you can have the bajonet modified to show the 35mm frames automatically or you can sort of ‘jam’ the frame lever into 35mm -----> position !!!  with something if you do not want to do the mod. however, be careful not to apply to much force because the lever may come off. (for more details search for a post i made in 2009 if i remember it right) edited december 8, 2016 by dpitt", "sortedWord": "None", "identifyer": 43139, "year": "2016"}, {"Unnamed: 0": 381748, "autor": "roshuu", "date": 1481160000000, "content": "I think it will show the 50mm frame. The same as with the Summicron 40C. 50mm frames for the 40mm lenses are pretty much useless because they are much too tight IMO. However, you can hold the frame lever to 35mm with your finger and 35mm frames on the M8 or M8.2 are very accurate as long as you take the inside of the lines. You can have the bajonet modified to show the 35mm frames automatically or you can sort of ‘jam’ the frame lever into 35mm position with something if you do not want to do the mod. However, be careful not to apply to much force because the lever may come off. (for more details search for a post I made in 2009 if i remember it right) Summicron 40mm unless it is not detectable in the M ... This is not the glass to the CL?", "link": "https://www.l-camera-forum.com/topic/267169-voigtlander-40mm-f14-on-leica-882/?tab=comments#comment-3162584", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think it will show the 50mm frame. the same as with the summicron 40c. 50mm frames for the 40mm lenses are pretty much useless because they are much too tight imo. however, you can hold the frame lever to 35mm with your finger and 35mm frames on the m8 or m8.2 are very accurate as long as you take the inside of the lines. you can have the bajonet modified to show the 35mm frames automatically or you can sort of ‘jam’ the frame lever into 35mm -----> position !!!  with something if you do not want to do the mod. however, be careful not to apply to much force because the lever may come off. (for more details search for a post i made in 2009 if i remember it right) summicron 40mm unless it is not detectable in the m ... this is not the glass to the cl?", "sortedWord": "None", "identifyer": 43141, "year": "2016"}, {"Unnamed: 0": 384856, "autor": "anindyo", "date": 1468898580000, "content": "\"Hi, I am new comer. I am now considering amongst M8.2, A7II and X-Pro 2.\" Just sharing my experience, when my M8.2 was broken due to salt water, I am in position to decide whether to get another M8 or X-Pro2. I decided to get an M8u (couldn't afford an M8.2). It is because I like the Leica RF experience, that probably can't be replaced by any other cameras. I only ever tried X-Pro1 and found that its handling and feel still couldn't replace a Leica's. Is it worth it? Well, I didn't regret my purchase. I also have Fuji X-E1 that produced better image, technically speaking, but I shoot more with the M8u. X-Pro2 is now improved and better mimic the RF experience, allowing us to shoot manually through optical viewfinder. It has small patch in the viewfinder corner to help confirming the focus by focus peaking. If you want the latest technology and greater versatility while having somewhat RF experience, X-Pro2 may be the best option. How about go to camera shops and try those cameras in hand? Edited July 19, 2016 by anindyo", "link": "https://www.l-camera-forum.com/topic/261927-best-deal-ever-on-a-used-m82-used-market-price-range/?tab=comments#comment-3080979", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "\"hi, i am new comer. i am now considering amongst m8.2, a7ii and x-pro 2.\" just sharing my experience, when my m8.2 was broken due to salt water, i am in -----> position !!!  to decide whether to get another m8 or x-pro2. i decided to get an m8u (couldn't afford an m8.2). it is because i like the leica rf experience, that probably can't be replaced by any other cameras. i only ever tried x-pro1 and found that its handling and feel still couldn't replace a leica's. is it worth it? well, i didn't regret my purchase. i also have fuji x-e1 that produced better image, technically speaking, but i shoot more with the m8u. x-pro2 is now improved and better mimic the rf experience, allowing us to shoot manually through optical viewfinder. it has small patch in the viewfinder corner to help confirming the focus by focus peaking. if you want the latest technology and greater versatility while having somewhat rf experience, x-pro2 may be the best option. how about go to camera shops and try those cameras in hand? edited july 19, 2016 by anindyo", "sortedWord": "None", "identifyer": 46260, "year": "2016"}, {"Unnamed: 0": 385413, "autor": "pgk", "date": 1458814860000, "content": "M9 prices are slowly dropping especially if you are content to buy one which has signs of use. However ..... Any digital camera has a life span and how long this is is subject to debate here on the forum. In your position I would try to find as cheap a body as possible (M8 or M9) preferably from a dealer and with a warranty if at all possible OR buy one cheap and have it serviced by Leica (costly but then it should have a year's warranty) - avoid those with any issues. Then invest in decent Leica glass of which there is plenty available at reasonable costs if you are prepared to track it down and happy not to buy the latest version. Lastly, start saving for another used body as prices slowly drop so that, if your existing body finally has problems, you are in a position to replace it and can use the glass that you have bought on the replacement body. FWIW I bought an M9 before Christmas with a 6 month warranty for almost half the price of a mint example (and not much more than a mint M8). It is dented but had been fully repaired by Leica and accordingly has a 12 month warranty from Leica too. It looks a bit rough but its a good working camera. I'm not sure that its possible to buy Leicas really cheaply (rarely anyway) but then don't need to be as costly as all that --img--  .", "link": "https://www.l-camera-forum.com/topic/258521-an-update-to-my-saga/?tab=comments#comment-3013454", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "m9 prices are slowly dropping especially if you are content to buy one which has signs of use. however ..... any digital camera has a life span and how long this is is subject to debate here on the forum. in your -----> position !!!  i would try to find as cheap a body as possible (m8 or m9) preferably from a dealer and with a warranty if at all possible or buy one cheap and have it serviced by leica (costly but then it should have a year's warranty) - avoid those with any issues. then invest in decent leica glass of which there is plenty available at reasonable costs if you are prepared to track it down and happy not to buy the latest version. lastly, start saving for another used body as prices slowly drop so that, if your existing body finally has problems, you are in a position to replace it and can use the glass that you have bought on the replacement body. fwiw i bought an m9 before christmas with a 6 month warranty for almost half the price of a mint example (and not much more than a mint m8). it is dented but had been fully repaired by leica and accordingly has a 12 month warranty from leica too. it looks a bit rough but its a good working camera. i'm not sure that its possible to buy leicas really cheaply (rarely anyway) but then don't need to be as costly as all that --img--  .", "sortedWord": "None", "identifyer": 46817, "year": "2016"}, {"Unnamed: 0": 395059, "autor": "miric", "date": 1481294940000, "content": "Hi everybody. I'd like to share my small experience in lens coding. Now I have only two lenses: CZ C Sonnar 1.5/50 ZM and VM Color-Skopar 35/2.5 PII. Initial preparations took some time. I saw native Leica coded lenses and many DIY codes. Also I read some folks noticed some hand-made codes aren't readable by new cam bodies. So I decided to discover this topic deeply. I have M9 cam with straight reader. As well known M240/M262 have curved form reader. So I started to make drawings based on vector images from manuals and then moved to camera mount photos. I decided they're more real. I analyzed both type reader areas and found optimal point size and position to be read with both shapes of readers. I printed some amount of drawn mount templates on hard photo paper in a digital print service. The template had exact outer radius to fit with Leica and Zeiss lenses and lock mark. It's enough to position the template precisely on lens mount. Template has been cut out and temporary mounted to lens mount with double side stick tape. Then I started to drill slowly and accurate small holes with 1mm bit by fingers. The hard paper allows to avoid bit slipping in the very beginning. Then I removed the template and had noticeable holes. It's possible to continue with 1.5mm bit. During metering I measured an optimal diameter for point as 1.7mm. But 1.5mm bit OK as well due to relatively low diameter precision and a fluctuation during drilling. After I applied electric screw driver at low rotation rate and small drill time of each hole. I finished with 2mm bit in my fingers to make hole edges smooth. Sonnar was the first and very simple task due to it is recommended to code it as lux 50 asph. So it has only 1 left bit hole. That's it. The hole has been filled with black matte paint made by Revell I usually use to paint my railway models. --img--  Another deal was with Color-Skopar. Voigtlaender designers in some reason decided to put screw right at the end of 6-bit code --img--  After that I made a gutter from the screw hole towards mount edge. There's two black points so it is OK to just have fully painted gutter (hasn't show on the photo). Now Skopar is being read as Summarit 35/2.5. --img--  That's all. I still don't know if they will be read correctly with M240/M262 bodies. But I'll test it when I'll reach my buddy with such kind of cam. Edited December 9, 2016 by miric", "link": "https://www.l-camera-forum.com/topic/185433-m-lens-codes/page/6/?tab=comments#comment-3163431", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi everybody. i'd like to share my small experience in lens coding. now i have only two lenses: cz c sonnar 1.5/50 zm and vm color-skopar 35/2.5 pii. initial preparations took some time. i saw native leica coded lenses and many diy codes. also i read some folks noticed some hand-made codes aren't readable by new cam bodies. so i decided to discover this topic deeply. i have m9 cam with straight reader. as well known m240/m262 have curved form reader. so i started to make drawings based on vector images from manuals and then moved to camera mount photos. i decided they're more real. i analyzed both type reader areas and found optimal point size and -----> position !!!  to be read with both shapes of readers. i printed some amount of drawn mount templates on hard photo paper in a digital print service. the template had exact outer radius to fit with leica and zeiss lenses and lock mark. it's enough to position the template precisely on lens mount. template has been cut out and temporary mounted to lens mount with double side stick tape. then i started to drill slowly and accurate small holes with 1mm bit by fingers. the hard paper allows to avoid bit slipping in the very beginning. then i removed the template and had noticeable holes. it's possible to continue with 1.5mm bit. during metering i measured an optimal diameter for point as 1.7mm. but 1.5mm bit ok as well due to relatively low diameter precision and a fluctuation during drilling. after i applied electric screw driver at low rotation rate and small drill time of each hole. i finished with 2mm bit in my fingers to make hole edges smooth. sonnar was the first and very simple task due to it is recommended to code it as lux 50 asph. so it has only 1 left bit hole. that's it. the hole has been filled with black matte paint made by revell i usually use to paint my railway models. --img--  another deal was with color-skopar. voigtlaender designers in some reason decided to put screw right at the end of 6-bit code --img--  after that i made a gutter from the screw hole towards mount edge. there's two black points so it is ok to just have fully painted gutter (hasn't show on the photo). now skopar is being read as summarit 35/2.5. --img--  that's all. i still don't know if they will be read correctly with m240/m262 bodies. but i'll test it when i'll reach my buddy with such kind of cam. edited december 9, 2016 by miric", "sortedWord": "None", "identifyer": 7528, "year": "2016"}, {"Unnamed: 0": 399038, "autor": "Carduelis", "date": 1481226480000, "content": "Image 2: 21 SEM positioned flat on floor --img-- ", "link": "https://www.l-camera-forum.com/topic/253730-your-ultra-wide-angle-uwa-pictures-10mm-to-21mm/page/12/?tab=comments#comment-3162948", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "image 2: 21 sem -----> positioned !!!  flat on floor --img-- ", "sortedWord": "None", "identifyer": 11691, "year": "2016"}, {"Unnamed: 0": 406587, "autor": "Kazuhikonakayama", "date": 1456328220000, "content": "I find a way to attach hood on this lens !! Leica 11688 lens. 1) remove your hood from the lens. 2) insert a uv filter into lens hood from front side. 3) adjust position into most bottom in hood. 4) carefully move hood on lens, and attaché hood first. 5) and rotate uv filter's screw. Done ! It's perfect. No need thin hood. This lens is very beautiful and good quality. With only 11688+11689 set, I am happy : ) Please try it if you have 50sx. Kazu", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/5/?tab=comments#comment-2995821", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i find a way to attach hood on this lens !! leica 11688 lens. 1) remove your hood from the lens. 2) insert a uv filter into lens hood from front side. 3) adjust -----> position !!!  into most bottom in hood. 4) carefully move hood on lens, and attaché hood first. 5) and rotate uv filter's screw. done ! it's perfect. no need thin hood. this lens is very beautiful and good quality. with only 11688+11689 set, i am happy : ) please try it if you have 50sx. kazu", "sortedWord": "None", "identifyer": 19367, "year": "2016"}, {"Unnamed: 0": 406590, "autor": "asdfbill", "date": 1456441320000, "content": "I find a way to attach hood on this lens !! Leica 11688 lens. 1) remove your hood from the lens. 2) insert a uv filter into lens hood from front side. 3) adjust position into most bottom in hood. 4) carefully move hood on lens, and attaché hood first. 5) and rotate uv filter's screw. Done ! It's perfect. No need thin hood. This lens is very beautiful and good quality. With only 11688+11689 set, I am happy : ) Please try it if you have 50sx. Kazu if you're going to do this don't over tighten the hood, as this could dislodge the 2 white hinges on the side of the hood./ --img-- the vented part of the hood can be screwed off from the bottom part of the hood with the 2 white buttons --img--  Edited February 25, 2016 by asdfbill", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/5/?tab=comments#comment-2996965", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i find a way to attach hood on this lens !! leica 11688 lens. 1) remove your hood from the lens. 2) insert a uv filter into lens hood from front side. 3) adjust -----> position !!!  into most bottom in hood. 4) carefully move hood on lens, and attaché hood first. 5) and rotate uv filter's screw. done ! it's perfect. no need thin hood. this lens is very beautiful and good quality. with only 11688+11689 set, i am happy : ) please try it if you have 50sx. kazu if you're going to do this don't over tighten the hood, as this could dislodge the 2 white hinges on the side of the hood./ --img-- the vented part of the hood can be screwed off from the bottom part of the hood with the 2 white buttons --img--  edited february 25, 2016 by asdfbill", "sortedWord": "None", "identifyer": 19370, "year": "2016"}, {"Unnamed: 0": 406594, "autor": "NB23", "date": 1456594920000, "content": "I find a way to attach hood on this lens !! Leica 11688 lens. 1) remove your hood from the lens. 2) insert a uv filter into lens hood from front side. 3) adjust position into most bottom in hood. 4) carefully move hood on lens, and attaché hood first. 5) and rotate uv filter's screw. Done ! It's perfect. No need thin hood. This lens is very beautiful and good quality. With only 11688+11689 set, I am happy : ) Please try it if you have 50sx. Kazu What is 50sx?", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/5/?tab=comments#comment-2997928", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i find a way to attach hood on this lens !! leica 11688 lens. 1) remove your hood from the lens. 2) insert a uv filter into lens hood from front side. 3) adjust -----> position !!!  into most bottom in hood. 4) carefully move hood on lens, and attaché hood first. 5) and rotate uv filter's screw. done ! it's perfect. no need thin hood. this lens is very beautiful and good quality. with only 11688+11689 set, i am happy : ) please try it if you have 50sx. kazu what is 50sx?", "sortedWord": "None", "identifyer": 19374, "year": "2016"}, {"Unnamed: 0": 406605, "autor": "AllenMac", "date": 1457170560000, "content": " I find a way to attach hood on this lens !! Leica 11688 lens. 1) remove your hood from the lens. 2) insert a uv filter into lens hood from front side. 3) adjust position into most bottom in hood. 4) carefully move hood on lens, and attaché hood first. 5) and rotate uv filter's screw. Done ! It's perfect. No need thin hood. This lens is very beautiful and good quality. With only 11688+11689 set, I am happy : ) Please try it if you have 50sx. Kazu Thank you! I tried it and it worked.", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/6/?tab=comments#comment-3002006", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " i find a way to attach hood on this lens !! leica 11688 lens. 1) remove your hood from the lens. 2) insert a uv filter into lens hood from front side. 3) adjust -----> position !!!  into most bottom in hood. 4) carefully move hood on lens, and attaché hood first. 5) and rotate uv filter's screw. done ! it's perfect. no need thin hood. this lens is very beautiful and good quality. with only 11688+11689 set, i am happy : ) please try it if you have 50sx. kazu thank you! i tried it and it worked.", "sortedWord": "None", "identifyer": 19385, "year": "2016"}, {"Unnamed: 0": 415255, "autor": "thighslapper", "date": 1460750520000, "content": " Why it has not been fixed, end even gotten worse than previous FW is beyond me. Did not the beta FW testers discover this? Why has Leica made it even worse than before!? Best regards Trond ..... because the majority if Beta testers are not interested in a sensible numbering system and use LR or other software on import to generate new numbers....... I have (and have had) numerous Leicas and have my own system with LXX at the beginning changed to identify which camera the files originate from and sequential numbering within this system to avoid duplication. I had an invitation email to be a beta tester ....... but repeated replies to Andreas and Leon replying I would be very happy to help (as I have done with other Leica cameras) went unanswered for reasons never explained. (a polite reply saying no thanks would have been nice) Had I been a tester I would have actively pursued this and extracted acknowledgement that it was an issue and assurances it would be fixed in the future if not with this update. I emailed technical support months ago and they clearly could not understand what I was going on about. As it is, I am as fed up and disappointed as you are. I have spent half an hour resetting image numbering to get it to increment to my old folder setting of L130 XXXX ....... and then firing off 345 shots to get to my previous position for the last 3 digits....... so now I just have to batch change the remaining 4th digit to the current one before I put the files in their final directory (I use 'NameChanger' which works very well). ...... and the numbering still apparently only goes up to 999 before going to LXX1 0001 instead of LXXX 1000 ...... which anyone that could count would normally do. ...... and no-one has reported yet whether the bug that incremented the folder by 1 every time you format a card in the camera has been permanently fixed ....... and I'm certainly not going to test it as it will ruin everything again..... What a mess.... Edited April 15, 2016 by thighslapper", "link": "https://www.l-camera-forum.com/topic/253547-sl-image-numbering/page/2/?tab=comments#comment-3027379", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " why it has not been fixed, end even gotten worse than previous fw is beyond me. did not the beta fw testers discover this? why has leica made it even worse than before!? best regards trond ..... because the majority if beta testers are not interested in a sensible numbering system and use lr or other software on import to generate new numbers....... i have (and have had) numerous leicas and have my own system with lxx at the beginning changed to identify which camera the files originate from and sequential numbering within this system to avoid duplication. i had an invitation email to be a beta tester ....... but repeated replies to andreas and leon replying i would be very happy to help (as i have done with other leica cameras) went unanswered for reasons never explained. (a polite reply saying no thanks would have been nice) had i been a tester i would have actively pursued this and extracted acknowledgement that it was an issue and assurances it would be fixed in the future if not with this update. i emailed technical support months ago and they clearly could not understand what i was going on about. as it is, i am as fed up and disappointed as you are. i have spent half an hour resetting image numbering to get it to increment to my old folder setting of l130 xxxx ....... and then firing off 345 shots to get to my previous -----> position !!!  for the last 3 digits....... so now i just have to batch change the remaining 4th digit to the current one before i put the files in their final directory (i use 'namechanger' which works very well). ...... and the numbering still apparently only goes up to 999 before going to lxx1 0001 instead of lxxx 1000 ...... which anyone that could count would normally do. ...... and no-one has reported yet whether the bug that incremented the folder by 1 every time you format a card in the camera has been permanently fixed ....... and i'm certainly not going to test it as it will ruin everything again..... what a mess.... edited april 15, 2016 by thighslapper", "sortedWord": "None", "identifyer": 28192, "year": "2016"}, {"Unnamed: 0": 431028, "autor": "earleygallery", "date": 1477495980000, "content": "Although there is the Q I still think there's room for an APS-C fixed 35mm lens (equiv) camera, but include an optical finder and either a fixed position lens or manually collapsible if it must. The X Vario was hampered by the slow lens whilst a slow zoom on the T isn't such an issue as you have other options if you need faster lenses.", "link": "https://www.l-camera-forum.com/topic/265823-is-the-t2-meant-to-put-an-end-to-leicas-x-line-of-cameras/?tab=comments#comment-3135949", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "although there is the q i still think there's room for an aps-c fixed 35mm lens (equiv) camera, but include an optical finder and either a fixed -----> position !!!  lens or manually collapsible if it must. the x vario was hampered by the slow lens whilst a slow zoom on the t isn't such an issue as you have other options if you need faster lenses.", "sortedWord": "None", "identifyer": 44179, "year": "2016"}, {"Unnamed: 0": 448638, "autor": "BAASCH", "date": 1467662820000, "content": "Leica kindly sent me two replacement latches, but without the little springs; I did still have the original spring, but it fell into the opening that the latch covered the moment the latch snapped into place and couldn't be removed again (except by breaking it). So now I have a new latch, but it doesn't snap into its battery-holding position. I can manually pull it out, and then the big spring that is pushing the battery upward will keep it in place, and I guess it's better this way than without a latch, but it's not perfect. Anyway, if you're still reading this, you probably have the same problem, and I hope this helps, somehow :-) Edited July 4, 2016 by Mandemaker", "link": "https://www.l-camera-forum.com/topic/214314-broken-battery-latch-on-x2/?tab=comments#comment-3073379", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "leica kindly sent me two replacement latches, but without the little springs; i did still have the original spring, but it fell into the opening that the latch covered the moment the latch snapped into place and couldn't be removed again (except by breaking it). so now i have a new latch, but it doesn't snap into its battery-holding -----> position !!! . i can manually pull it out, and then the big spring that is pushing the battery upward will keep it in place, and i guess it's better this way than without a latch, but it's not perfect. anyway, if you're still reading this, you probably have the same problem, and i hope this helps, somehow :-) edited july 4, 2016 by mandemaker", "sortedWord": "None", "identifyer": 12124, "year": "2016"}, {"Unnamed: 0": 448767, "autor": "dshombert", "date": 1469061780000, "content": "Hi This is normal. Whem you switch on the camera and the SF 24D, independent of order, first the letter \"A\" will flash on the screen of the SF 24D. Then, the only action to take is: Half press the release button. This will initiate the first data transfer between your (and mine) very well-liked XVario and the SF 24D. ...And you will see the results on the back Screen of the SF 24D. Remember: Flash exposure corrections have to be performed on the SF 24D, the corresponding menue on the XVario will not show up. How long should it take? In my earlier attempts, I pressed the shutter halfway for at least long enough for the camera to acquire focus. On most of those attempts, I held it for a few seconds longer. Here's what I tried just now: Fresh batteries in camera and flash Flash set to TTL/GNC mode Press (and hold) shutter halfway. This results in flashing \"A\" on camera display, as previously described. Focus acquired by camera instantly. Hold shutter at halfway position for two minutes and 45 seconds. Display continues to show only the flashing \"A\". After 2:45 minutes, the flash display goes blank, as if it has an auto-off function. Immediately switch the flash to Manual mode, just to make sure the battery hasn't died. Charge indicator lights up and flash fires with shutter. Repeat this entire test; same result. Something is just not working right. I bought the flash used from a seller on FM forum. He's indicated that he'll refund my money if it's really defective. I'm trying to establish that fact, that it's not me overlooking something or that it's not the camera. Leica has not been able to offer any real help. Another thing: there's what appears to be an indicator light, labeled \"o.k.\" to the right of the display panel. What is that for? I've never seen it lit, under any circumstances. Edited July 21, 2016 by dshombert", "link": "https://www.l-camera-forum.com/topic/262677-sf-24d-flash-on-x-vario-something-wrong/?tab=comments#comment-3082147", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi this is normal. whem you switch on the camera and the sf 24d, independent of order, first the letter \"a\" will flash on the screen of the sf 24d. then, the only action to take is: half press the release button. this will initiate the first data transfer between your (and mine) very well-liked xvario and the sf 24d. ...and you will see the results on the back screen of the sf 24d. remember: flash exposure corrections have to be performed on the sf 24d, the corresponding menue on the xvario will not show up. how long should it take? in my earlier attempts, i pressed the shutter halfway for at least long enough for the camera to acquire focus. on most of those attempts, i held it for a few seconds longer. here's what i tried just now: fresh batteries in camera and flash flash set to ttl/gnc mode press (and hold) shutter halfway. this results in flashing \"a\" on camera display, as previously described. focus acquired by camera instantly. hold shutter at halfway -----> position !!!  for two minutes and 45 seconds. display continues to show only the flashing \"a\". after 2:45 minutes, the flash display goes blank, as if it has an auto-off function. immediately switch the flash to manual mode, just to make sure the battery hasn't died. charge indicator lights up and flash fires with shutter. repeat this entire test; same result. something is just not working right. i bought the flash used from a seller on fm forum. he's indicated that he'll refund my money if it's really defective. i'm trying to establish that fact, that it's not me overlooking something or that it's not the camera. leica has not been able to offer any real help. another thing: there's what appears to be an indicator light, labeled \"o.k.\" to the right of the display panel. what is that for? i've never seen it lit, under any circumstances. edited july 21, 2016 by dshombert", "sortedWord": "None", "identifyer": 12254, "year": "2016"}, {"Unnamed: 0": 448775, "autor": "Trivette", "date": 1469104920000, "content": "Steven, were you familiar with digital cameras before purchasing the X Vario? I found the camera to be very user friendly after adding the handgrip and an external viewfinder. I especially enjoy positioning my left hand under the lens to support the camera and control focal length and focus, just like in the old days of manual film cameras. Before digital came along, I used mostly manual, mechanical\\ film cameras, When I first started using digital cameras, I was always messing up because I wasn't used to having controls on the back of the camera, and often I would inadvertently activate unwanted functions. I would suggest trying to adapt to the X Vario. It is truly an amazing camera.", "link": "https://www.l-camera-forum.com/topic/262693-leica-x-vario-after-two-weeks/?tab=comments#comment-3082418", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "steven, were you familiar with digital cameras before purchasing the x vario? i found the camera to be very user friendly after adding the handgrip and an external viewfinder. i especially enjoy -----> positioning !!!  my left hand under the lens to support the camera and control focal length and focus, just like in the old days of manual film cameras. before digital came along, i used mostly manual, mechanical\\ film cameras, when i first started using digital cameras, i was always messing up because i wasn't used to having controls on the back of the camera, and often i would inadvertently activate unwanted functions. i would suggest trying to adapt to the x vario. it is truly an amazing camera.", "sortedWord": "None", "identifyer": 12262, "year": "2016"}, {"Unnamed: 0": 448827, "autor": "pop", "date": 1464934560000, "content": "Anyone know if the EVF2 works just as well? I guess I am after some real world user experience. I haven't the foggiest. Wouldn't it be a real world user experience if you bought the EVF2 just to find out that it doesn't work with the X? Actually, just a glance at the pictures of the rear sides of an X and an X Vario seems to show that the sockets for the EVF are quite different; just look at the relative positions of the electrical contacts. From that alone I would guess that the EVF2 was for the X2 and the X Vario, the other one for the \"plain\" X.", "link": "https://www.l-camera-forum.com/topic/261175-visoflex-for-x/?tab=comments#comment-3055773", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "anyone know if the evf2 works just as well? i guess i am after some real world user experience. i haven't the foggiest. wouldn't it be a real world user experience if you bought the evf2 just to find out that it doesn't work with the x? actually, just a glance at the pictures of the rear sides of an x and an x vario seems to show that the sockets for the evf are quite different; just look at the relative -----> positions !!!  of the electrical contacts. from that alone i would guess that the evf2 was for the x2 and the x vario, the other one for the \"plain\" x.", "sortedWord": "None", "identifyer": 12315, "year": "2016"}, {"Unnamed: 0": 448959, "autor": "BAASCH", "date": 1463035980000, "content": "Just to elucidate my position here, in case that's what some take issue with: the Vario fully lives up to my expectations (like I said). This doesn't mean some software adjustments couldn't/shouldn't make it even better. Leicas are built to last, which is another reason firmware development should not stop after a few years. They're also expensive, and customers are justified in expecting a high level of after-sales support. Why not improve a good thing? Edited May 12, 2016 by Mandemaker", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/4/?tab=comments#comment-3043280", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "just to elucidate my -----> position !!!  here, in case that's what some take issue with: the vario fully lives up to my expectations (like i said). this doesn't mean some software adjustments couldn't/shouldn't make it even better. leicas are built to last, which is another reason firmware development should not stop after a few years. they're also expensive, and customers are justified in expecting a high level of after-sales support. why not improve a good thing? edited may 12, 2016 by mandemaker", "sortedWord": "None", "identifyer": 12448, "year": "2016"}, {"Unnamed: 0": 449059, "autor": "McGirton", "date": 1458992280000, "content": "I didn't encounter this personally. Maybe the focussing ring didn't \"lock\" back in at infinity after manual focussing? Or is loosened up and wasn't properly in position? Either something like that or there is something wrong with your camera specifically. I'd check with Leica / your dealer about that.", "link": "https://www.l-camera-forum.com/topic/258441-leica-x-type-113-poor-focusing/?tab=comments#comment-3014788", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i didn't encounter this personally. maybe the focussing ring didn't \"lock\" back in at infinity after manual focussing? or is loosened up and wasn't properly in -----> position !!! ? either something like that or there is something wrong with your camera specifically. i'd check with leica / your dealer about that.", "sortedWord": "None", "identifyer": 12548, "year": "2016"}, {"Unnamed: 0": 449190, "autor": "wda", "date": 1455713700000, "content": "I use the lowest resolution Jpeg setting only because I cannot set DNG only. But it does allow me to set Mono for my Mono User Preset and get an idea of the potential of the subject to make a good monochrome picture. All jpeg settings I leave at their default. When capturing Raw files, Jpeg settings are irrelevant. Any of the focus modes can be mastered to give the results you seek. One zone suits me well. Learn how to adjust the position for offset focusing when using a tripod.", "link": "https://www.l-camera-forum.com/topic/256978-x-vario-settings-suggestions/?tab=comments#comment-2991239", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i use the lowest resolution jpeg setting only because i cannot set dng only. but it does allow me to set mono for my mono user preset and get an idea of the potential of the subject to make a good monochrome picture. all jpeg settings i leave at their default. when capturing raw files, jpeg settings are irrelevant. any of the focus modes can be mastered to give the results you seek. one zone suits me well. learn how to adjust the -----> position !!!  for offset focusing when using a tripod.", "sortedWord": "None", "identifyer": 12680, "year": "2016"}, {"Unnamed: 0": 449235, "autor": "jaapv", "date": 1453306860000, "content": "Greg Gray, on 04 Dec 2015 - 12:17, said:Greg Gray, on 04 Dec 2015 - 12:17, said:rated to 15m! not much use for diving in that case. It is a lot for this type of camera. Technically it is useful only for shallow snorkelling trips. Just try to use an LCD under water... The flash is in an impossible position too close to the lens, in 95% of the waters it will create a blizzard in front of the subject, and it is too weak to balance the colours under 5 meters anyway. Whatever else, it is not made for diving. It is a bit of an upmarket go-pro really.", "link": "https://www.l-camera-forum.com/topic/251965-any-news-about-113-u/page/2/?tab=comments#comment-2972858", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "greg gray, on 04 dec 2015 - 12:17, said:greg gray, on 04 dec 2015 - 12:17, said:rated to 15m! not much use for diving in that case. it is a lot for this type of camera. technically it is useful only for shallow snorkelling trips. just try to use an lcd under water... the flash is in an impossible -----> position !!!  too close to the lens, in 95% of the waters it will create a blizzard in front of the subject, and it is too weak to balance the colours under 5 meters anyway. whatever else, it is not made for diving. it is a bit of an upmarket go-pro really.", "sortedWord": "None", "identifyer": 12725, "year": "2016"}], "name": "positionL-Forum2016"}