{"interestingcomments": [{"Unnamed: 0": 355915, "autor": "sdk", "date": 1363194900000, "content": "RE the risk, I wonder how much wobble is there with older collapsible 50mms? It could be that if you don’t push the lens tube in precisely straight, the tube is more likely to run into the RF traveler & roller at the top or the bottom of the camera chamber. Anyway, why take unnecessary risks? Just leave the lens in the out position and your expensive camera and lens will be safe.--img-- ", "link": "https://www.l-camera-forum.com/topic/200419-collapsible-lens-on-leica-m240/?tab=comments#comment-2270259", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "re the risk, i wonder how much wobble is there with older collapsible 50mms? it could be that if you don’t push the lens tube in precisely straight, the tube is more likely to run into the rf traveler & roller at the top or the bottom of the camera chamber. anyway, why take unnecessary risks? just leave the lens in the out -----> position !!!  and your expensive camera and lens will be safe.--img-- ", "sortedWord": "None", "identifyer": 17081, "year": "2013"}, {"Unnamed: 0": 355916, "autor": "UliWer", "date": 1363195440000, "content": "... Also there is yet little room between the \"tube\" of the last 50/2.8 and the roller cam of previous Ms so it would be useful to know if something may have changed in the M240 from this standpoint. The caveat about collapsibe lenses in the manual is not new, the manual for the M8 and M9 were exactly the same on this topic. Since the M8 was there and people read the manual there have been questions about it here. So there is no evidence that something has been changed on the M 240. I doubt if the position of the roller cam can be changed at all, for otherwise the rangefinder coupling would not work properly anymore. Since the times of the Leica II the roller cam should always have had the same position towards the lenses. The idea not to look at the shutter, where everybody (me included) searched for the problem, but to pay attention instead on the distance between the retracted tube and the roller came after someone reported that an 50mm Elmar-M could not be collapsed on an M-E. I said: this makes no sense, since the M-E is the same as M 9, why should there be any problems now? Then a member in the german forum showed the photos of the collision between tube and roller. I tried myself with an M6 and found out that my example of a 50mm Elmar-M didn't touch it, but was very close: less than a millimeter space. There are variations in so many lenses, and the tube of the Elmar-M has some play when you move it. So I say: it is possible, that the tube touches the roller. It was always possible since the time of the Leica II, since any former type of a Leica M - but there has been only a warning by Leica since the M8. Everybody can decide: Leica is giving the warning, we can ignore it. People can describe the possible problem, we can look elsewhere and say the tube won't hit the sensor. If we know that the tube may hit the roller, we can say: no problem, it won't do harm. I collapsed many lenses into many camera bodies, I didn't feel or see any harm. Obviously Barnack and Berek didn't see any harm when the constructed the rangefinder coupling with collapsible lenses and didn't foresee the possibility that the tube may touch the roller. It is not the aim of this Forum to forbid anything, it can just try to give information.", "link": "https://www.l-camera-forum.com/topic/200419-collapsible-lens-on-leica-m240/?tab=comments#comment-2270276", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "... also there is yet little room between the \"tube\" of the last 50/2.8 and the roller cam of previous ms so it would be useful to know if something may have changed in the m240 from this standpoint. the caveat about collapsibe lenses in the manual is not new, the manual for the m8 and m9 were exactly the same on this topic. since the m8 was there and people read the manual there have been questions about it here. so there is no evidence that something has been changed on the m 240. i doubt if the -----> position !!!  of the roller cam can be changed at all, for otherwise the rangefinder coupling would not work properly anymore. since the times of the leica ii the roller cam should always have had the same position towards the lenses. the idea not to look at the shutter, where everybody (me included) searched for the problem, but to pay attention instead on the distance between the retracted tube and the roller came after someone reported that an 50mm elmar-m could not be collapsed on an m-e. i said: this makes no sense, since the m-e is the same as m 9, why should there be any problems now? then a member in the german forum showed the photos of the collision between tube and roller. i tried myself with an m6 and found out that my example of a 50mm elmar-m didn't touch it, but was very close: less than a millimeter space. there are variations in so many lenses, and the tube of the elmar-m has some play when you move it. so i say: it is possible, that the tube touches the roller. it was always possible since the time of the leica ii, since any former type of a leica m - but there has been only a warning by leica since the m8. everybody can decide: leica is giving the warning, we can ignore it. people can describe the possible problem, we can look elsewhere and say the tube won't hit the sensor. if we know that the tube may hit the roller, we can say: no problem, it won't do harm. i collapsed many lenses into many camera bodies, i didn't feel or see any harm. obviously barnack and berek didn't see any harm when the constructed the rangefinder coupling with collapsible lenses and didn't foresee the possibility that the tube may touch the roller. it is not the aim of this forum to forbid anything, it can just try to give information.", "sortedWord": "None", "identifyer": 17082, "year": "2013"}, {"Unnamed: 0": 355920, "autor": "thighslapper", "date": 1363204260000, "content": "The 50.2.8 does collapse into all digital M's...... including M (I posted a few pics with it a few days ago) ...... although the clearances are almost non existent ..... try measuring both (average 30.4mm) ........--img--  When locked the lens is rigid, but on collapsing there is a little side to side give which varies from lens to lens...... (I have 3) ..... as a result in some positions the lens clearly just catches the roller .... you can feel it .... but I have checked on numerous occasions and can't find and abrasions that suggest that it is anything significant. With the lens rotated in certain positions is collapses smoothly with no catching at all..... and generally if you do it carefully with no lateral pressure there is no noticeable catching. I have used this lens a lot on several M bodies and from a practical point of view there is no problem if you are careful. fairly obviously attaching or removing the lens when collapsed is asking for trouble.... this just confirms what Mark,Chris and Lct have said above....... use but be careful.... Edited March 13, 2013 by thighslapper", "link": "https://www.l-camera-forum.com/topic/200419-collapsible-lens-on-leica-m240/page/2/?tab=comments#comment-2270490", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "the 50.2.8 does collapse into all digital m's...... including m (i posted a few pics with it a few days ago) ...... although the clearances are almost non existent ..... try measuring both (average 30.4mm) ........--img--  when locked the lens is rigid, but on collapsing there is a little side to side give which varies from lens to lens...... (i have 3) ..... as a result in some -----> positions !!!  the lens clearly just catches the roller .... you can feel it .... but i have checked on numerous occasions and can't find and abrasions that suggest that it is anything significant. with the lens rotated in certain positions is collapses smoothly with no catching at all..... and generally if you do it carefully with no lateral pressure there is no noticeable catching. i have used this lens a lot on several m bodies and from a practical point of view there is no problem if you are careful. fairly obviously attaching or removing the lens when collapsed is asking for trouble.... this just confirms what mark,chris and lct have said above....... use but be careful.... edited march 13, 2013 by thighslapper", "sortedWord": "None", "identifyer": 17086, "year": "2013"}, {"Unnamed: 0": 355922, "autor": "TRIago", "date": 1363217040000, "content": "Hey, I've seen your pictures but I'm not sure which one you have used the Elmar-M 50mm. Can you please tell us? --img--  Thanks, Thiago. The 50.2.8 does collapse into all digital M's...... including M (I posted a few pics with it a few days ago) ...... although the clearances are almost non existent ..... try measuring both (average 30.4mm) ........--img--  When locked the lens is rigid, but on collapsing there is a little side to side give which varies from lens to lens...... (I have 3) ..... as a result in some positions the lens clearly just catches the roller .... you can feel it .... but I have checked on numerous occasions and can't find and abrasions that suggest that it is anything significant. With the lens rotated in certain positions is collapses smoothly with no catching at all..... and generally if you do it carefully with no lateral pressure there is no noticeable catching. I have used this lens a lot on several M bodies and from a practical point of view there is no problem if you are careful. fairly obviously attaching or removing the lens when collapsed is asking for trouble.... this just confirms what Mark,Chris and Lct have said above....... use but be careful....", "link": "https://www.l-camera-forum.com/topic/200419-collapsible-lens-on-leica-m240/page/2/?tab=comments#comment-2270733", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "hey, i've seen your pictures but i'm not sure which one you have used the elmar-m 50mm. can you please tell us? --img--  thanks, thiago. the 50.2.8 does collapse into all digital m's...... including m (i posted a few pics with it a few days ago) ...... although the clearances are almost non existent ..... try measuring both (average 30.4mm) ........--img--  when locked the lens is rigid, but on collapsing there is a little side to side give which varies from lens to lens...... (i have 3) ..... as a result in some -----> positions !!!  the lens clearly just catches the roller .... you can feel it .... but i have checked on numerous occasions and can't find and abrasions that suggest that it is anything significant. with the lens rotated in certain positions is collapses smoothly with no catching at all..... and generally if you do it carefully with no lateral pressure there is no noticeable catching. i have used this lens a lot on several m bodies and from a practical point of view there is no problem if you are careful. fairly obviously attaching or removing the lens when collapsed is asking for trouble.... this just confirms what mark,chris and lct have said above....... use but be careful....", "sortedWord": "None", "identifyer": 17088, "year": "2013"}, {"Unnamed: 0": 356076, "autor": "UliWer", "date": 1359062340000, "content": "Question: Is it safe to collapse a lens with retractable tube (e.g. 50mm Elmar) into the body of the M8 or M9? Answer: First of all, Leica says in the manuals for the M8 and M9: „Lenses with retractable tube can only be used with the tube extended, i.e. their tube must never be retracted into the LEICA M8/M9. This is not the case for the current Macro-Elmar-M 90mm f/4, whose tube does not protrude into the camera body even when retracted. It can therefore be used without any restrictions.“ On the other hand many users have reported in this forum that they regularly retracted the tubes of other lenses into the camera bodies without any problems. Let‘s look for some facts: There are two reasons for Leica‘s warning about collapsible lenses in the manuals: 1. The „throat“ of the digital M (the open space between the bayonet mount and the shutter) is much narrower than with film Ms. If someone would mount or dismount a lens with it‘s tube retracted and hold it in a certain angle it might touch and scratch the sides of the „thoat“. Therefore you should only mount or dismount a lens when the tube is extended. 2. The retracted tube might touch and damage the shutter. If you look into the body without a lens you see two black metal ridges above the shutter. The distance between those two ridges is approx. 25mm. The diameter of a retractable lens tube is at least 27mm (in most cases considerably more). So if the tube hits anything it will be the ridges and not directly the shutter. This does not make it safe, for pressure on these ridges, which are made of rather thin metal, might interfere with or even damage the shutter. Do the tubes of retractable lenses touch the ridges? I measured 24mm as the distance between the surface of the camera‘s bayonet and the ridge both for the M8 and M9. Let us stay on the safe side and say: a tube which enters 22mm or more into the body will be critical or dangerous. That is certainly the case for the collapsible 4/90 Elmar (old type ILNOO; 11631, 11131, which was produced from 1954 to 1968 - so not to be mixed up with the current Makro-Elmar-M, 4/90). How long are the tubes of other collapsible lenses entering into the body? Some examples: For the tube of the collapsible version of the 2/50mm Summicron (screw-mount) I measured less than 14mm when it is collapsed, so I see no risk at all that it could touch the ridges. For the Elmar-M 2.8/50 (last version) it‘s 20.5mm, same for the first version of the 2.8/5cm Elmar with M-mount or it‘s 3.5/5cm M-mount precedessor. But a „red dial“ 3.5/5cm from 1951 (screw-mount) gives a very risky result of 22.5mm; for a nickel 3.5/5cm from 1932 I measure 20.5mm again. The 2.5/5cm Hektor had the longest tube I know: 23mm, which is dangerous! The Summar‘s and the Summitar‘s tubes were shorter than those of the Elmar (18mm). For all screw-mount lenses the adapter, which is necessary to mount them on an M, gives 1mm more space. The different results for the 50mm- or 5cm-Elmars from different times show that individual measurements of certain lens types are not reliable for every other lens of this sort. There may be variants in the tube‘s design, even protruding sharp edges on the ends of a tube. So before retracting a lens into the body of a M8 or M9 one should measure the retracted tube (always fixed on infinity) looking especially for protruding edges. Anything which is 22mm or longer should be never retracted but the extended tube secured by a Dymo band that it won‘t retract accidentially. A new thread in the German forum about collapsible lenses for the M tought me that my explanations about collapsible lenses used with M-cameras are incomplete: http://www.l-camera-forum.com/leica-forum/forum-zur-leica-m9/269373-elmar-2-8-50mm-m9-2.html#post2295115 I dealt a lot with the risk of the tube touching the shutter or scratching the throat of the camera. Though these risks cannot be ruled out completely they are not the whole story. The real risk is caused by the broad end of the tube hitting the little roller of the focus sensor lever and its screw. You can see it on the photo here: http://www.l-camera-forum.com/leica-forum/forum-zur-leica-m9/269373-elmar-2-8-50mm-m9-2.html#post2295443 You can test this with a M-body for film when you open the rear window (without film) and look through the opened shutter and lens. When you push the collapsible lens tube inwards you may see it scratch at the roller or its screw. So this is no new problem for the digital M but for all M models as they all have the same roller and screw for the focus sensor lever at the same position. The 2.8/50 Elmar-M (last version) may cause the most trouble - with all Leica-M bodies! - as the black end of the tube is broader than on earlier collapsible lenses. The tube of the last version of the 50mm Elmar may also have more play in the lens mount than earlier collapsible lenses, so it may hit the roller at a \"bad\" angle. Older lenses are not completely free of this problem. I measure the same diameter of 3,04cm for the broad tube's end of a post-war Summitar. The other collapsible lenses seem to have about 1 millimeter less, though there may be variances. So to collapse a 2.8/50mm Elmar-M - or any other collapsible lens on an Leica-M-body - may cause a conflict between the end of the lens tube and the roller for the focus lever. Leica's caveat about using collapsible lenses in the M8 or M9 (M-E) is therefore justified - though the same caveat is true for any other Leica-M body.", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/4/?tab=comments#comment-2464157", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question: is it safe to collapse a lens with retractable tube (e.g. 50mm elmar) into the body of the m8 or m9? answer: first of all, leica says in the manuals for the m8 and m9: „lenses with retractable tube can only be used with the tube extended, i.e. their tube must never be retracted into the leica m8/m9. this is not the case for the current macro-elmar-m 90mm f/4, whose tube does not protrude into the camera body even when retracted. it can therefore be used without any restrictions.“ on the other hand many users have reported in this forum that they regularly retracted the tubes of other lenses into the camera bodies without any problems. let‘s look for some facts: there are two reasons for leica‘s warning about collapsible lenses in the manuals: 1. the „throat“ of the digital m (the open space between the bayonet mount and the shutter) is much narrower than with film ms. if someone would mount or dismount a lens with it‘s tube retracted and hold it in a certain angle it might touch and scratch the sides of the „thoat“. therefore you should only mount or dismount a lens when the tube is extended. 2. the retracted tube might touch and damage the shutter. if you look into the body without a lens you see two black metal ridges above the shutter. the distance between those two ridges is approx. 25mm. the diameter of a retractable lens tube is at least 27mm (in most cases considerably more). so if the tube hits anything it will be the ridges and not directly the shutter. this does not make it safe, for pressure on these ridges, which are made of rather thin metal, might interfere with or even damage the shutter. do the tubes of retractable lenses touch the ridges? i measured 24mm as the distance between the surface of the camera‘s bayonet and the ridge both for the m8 and m9. let us stay on the safe side and say: a tube which enters 22mm or more into the body will be critical or dangerous. that is certainly the case for the collapsible 4/90 elmar (old type ilnoo; 11631, 11131, which was produced from 1954 to 1968 - so not to be mixed up with the current makro-elmar-m, 4/90). how long are the tubes of other collapsible lenses entering into the body? some examples: for the tube of the collapsible version of the 2/50mm summicron (screw-mount) i measured less than 14mm when it is collapsed, so i see no risk at all that it could touch the ridges. for the elmar-m 2.8/50 (last version) it‘s 20.5mm, same for the first version of the 2.8/5cm elmar with m-mount or it‘s 3.5/5cm m-mount precedessor. but a „red dial“ 3.5/5cm from 1951 (screw-mount) gives a very risky result of 22.5mm; for a nickel 3.5/5cm from 1932 i measure 20.5mm again. the 2.5/5cm hektor had the longest tube i know: 23mm, which is dangerous! the summar‘s and the summitar‘s tubes were shorter than those of the elmar (18mm). for all screw-mount lenses the adapter, which is necessary to mount them on an m, gives 1mm more space. the different results for the 50mm- or 5cm-elmars from different times show that individual measurements of certain lens types are not reliable for every other lens of this sort. there may be variants in the tube‘s design, even protruding sharp edges on the ends of a tube. so before retracting a lens into the body of a m8 or m9 one should measure the retracted tube (always fixed on infinity) looking especially for protruding edges. anything which is 22mm or longer should be never retracted but the extended tube secured by a dymo band that it won‘t retract accidentially. a new thread in the german forum about collapsible lenses for the m tought me that my explanations about collapsible lenses used with m-cameras are incomplete: http://www.l-camera-forum.com/leica-forum/forum-zur-leica-m9/269373-elmar-2-8-50mm-m9-2.html#post2295115 i dealt a lot with the risk of the tube touching the shutter or scratching the throat of the camera. though these risks cannot be ruled out completely they are not the whole story. the real risk is caused by the broad end of the tube hitting the little roller of the focus sensor lever and its screw. you can see it on the photo here: http://www.l-camera-forum.com/leica-forum/forum-zur-leica-m9/269373-elmar-2-8-50mm-m9-2.html#post2295443 you can test this with a m-body for film when you open the rear window (without film) and look through the opened shutter and lens. when you push the collapsible lens tube inwards you may see it scratch at the roller or its screw. so this is no new problem for the digital m but for all m models as they all have the same roller and screw for the focus sensor lever at the same -----> position !!! . the 2.8/50 elmar-m (last version) may cause the most trouble - with all leica-m bodies! - as the black end of the tube is broader than on earlier collapsible lenses. the tube of the last version of the 50mm elmar may also have more play in the lens mount than earlier collapsible lenses, so it may hit the roller at a \"bad\" angle. older lenses are not completely free of this problem. i measure the same diameter of 3,04cm for the broad tube's end of a post-war summitar. the other collapsible lenses seem to have about 1 millimeter less, though there may be variances. so to collapse a 2.8/50mm elmar-m - or any other collapsible lens on an leica-m-body - may cause a conflict between the end of the lens tube and the roller for the focus lever. leica's caveat about using collapsible lenses in the m8 or m9 (m-e) is therefore justified - though the same caveat is true for any other leica-m body.", "sortedWord": "None", "identifyer": 17242, "year": "2013"}, {"Unnamed: 0": 356081, "autor": "luigi bertolotti", "date": 1362439440000, "content": "Question : does the std. Leica leather case (for M8/M9) fit also for M ? The tripod female screw (to which the case is fitted )is in the same position or not ? Answer: No, it is not; to fit the old tip case you must modify the tripod screw hole.", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/5/?tab=comments#comment-2464165", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question : does the std. leica leather case (for m8/m9) fit also for m ? the tripod female screw (to which the case is fitted )is in the same -----> position !!!  or not ? answer: no, it is not; to fit the old tip case you must modify the tripod screw hole.", "sortedWord": "None", "identifyer": 17247, "year": "2013"}, {"Unnamed: 0": 356099, "autor": "jaapv", "date": 1371561540000, "content": "Question: What is the underlying standard for the rangefinder focusing? . Answer: YesThe standard is based around a 50mm lens and it's no coincidence Leica use a 50mm lens when aligning rangefinders and I have a chrome 50mm Summicron which I use only for the purposes of establishing which of my cameras is correctly aligned. This is illustrated by the humble 50mm f2.8 Elmar, the simplest of all (recently) current lenses. In this lens, there is just a single helicoid and the rangefinder roller bears directly on the back of the lens barrel which does not itself rotate. When the lens is set to infinity, the barrel is as far back as it goes and at this point, the rangefinder should be coincident for objects at infinity. As the lens is focussed at closer distance, the lens barrel moves forward and the roller with it. The amount of lens extension is proportional to the focussing ring angle turned back from infinity which in turn depends on the pitch of the helicoid. There's a classic formula in optics: 1/f = 1/u + 1/v which is valid to a first approximation for camera lenses, f is the focal length, v and u are the object and image distance; plug the values in and you get a lens extension of 0.251mm at 10 metres distance, 2.631mm at 1 metre and 3.846mm at 0.7mm which defines the range of movement of the rangefinder roller required. You can plot a graph (I have one somewhere, I will publish it if I can find it) of lens extension against focussing distance. Interestingly, you can also plot the circumferential distances of the markings on the lens distance scale back from infinity against the marking values themselves and you get the same (approximately) graph. This is then the simplest coupling between lens and camera. The camera never sees any different - there is a defined relationship between roller displacement and coincident distance set by this humble 50mm lens. Any \"smarts\" to handle the characteristics of particular lenses are built into the lenses themselves. The most basic characteristic which has to be handled is focal length. The extension from infinity to close focus is much greater for a 90mm lens than for a 50mm lens and the extension for a 21mm lens is much less. However, for the rangefinder still to work, there has to be a surface on the back of the lens which moves through the same range as the lens barrel for the \"reference\" 50mm lens. This is accomplished in two main ways. First, there can be a second helicoid which moves the surface against which the roller is pressing at a different rate to the lens barrel. At infinity, the lens barrel helicoid is set so that the lens focusses to infinity and the focussing helicoid is set so that the rangefinder is coincident at infinity. As the focussing ring is turned, the lens moves forward at one rate and the focussing surface at another. They are both still linked to the angular rotation of the focussing ring. The 75mm Summicron is a good example. The second option if you don't want to go to the trouble of having a second helicoid is to arrange for the roller to press on a surface linked to the focussing ring which then rotates and is profiled so that as the focussing ring rotates, the roller moves as required. Examples are the 18mm Super-Elmar and the 90mm Elmar. The problem now is that the rangefinder roller can make contact at a slightly different lateral position depending on its own alignment and throw the focussing off, especially when the surface is steeply profiled. It works in the 90mm Elmar because the profiling is quite shallow and with the 18mm because of the depth of field available. Things get tricky when you have a difficult lens like the old Noctilux or 75mm Summilux because optical variations meant not all copies behaved in the same way and the Noctilux is reputed to have had a hand-ground cam profile. In the most complex lenses, such as the 21mm Summilux, it is not sufficient to just have the two helicoids because the lens has different focussing characteristics to the reference 50mm; in this case, they use a second focussing helicoid to get it in the right ball park AND profile the cam to get it exactly right. Fundamentally though, the rangefinder characteristic which defines roller displacement against coincident distance goes back to that basic 50mm lens. It's cameras and lenses both adhering to that characteristic which is essential to allow lens interchangeability.", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/6/?tab=comments#comment-2464197", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question: what is the underlying standard for the rangefinder focusing? . answer: yesthe standard is based around a 50mm lens and it's no coincidence leica use a 50mm lens when aligning rangefinders and i have a chrome 50mm summicron which i use only for the purposes of establishing which of my cameras is correctly aligned. this is illustrated by the humble 50mm f2.8 elmar, the simplest of all (recently) current lenses. in this lens, there is just a single helicoid and the rangefinder roller bears directly on the back of the lens barrel which does not itself rotate. when the lens is set to infinity, the barrel is as far back as it goes and at this point, the rangefinder should be coincident for objects at infinity. as the lens is focussed at closer distance, the lens barrel moves forward and the roller with it. the amount of lens extension is proportional to the focussing ring angle turned back from infinity which in turn depends on the pitch of the helicoid. there's a classic formula in optics: 1/f = 1/u + 1/v which is valid to a first approximation for camera lenses, f is the focal length, v and u are the object and image distance; plug the values in and you get a lens extension of 0.251mm at 10 metres distance, 2.631mm at 1 metre and 3.846mm at 0.7mm which defines the range of movement of the rangefinder roller required. you can plot a graph (i have one somewhere, i will publish it if i can find it) of lens extension against focussing distance. interestingly, you can also plot the circumferential distances of the markings on the lens distance scale back from infinity against the marking values themselves and you get the same (approximately) graph. this is then the simplest coupling between lens and camera. the camera never sees any different - there is a defined relationship between roller displacement and coincident distance set by this humble 50mm lens. any \"smarts\" to handle the characteristics of particular lenses are built into the lenses themselves. the most basic characteristic which has to be handled is focal length. the extension from infinity to close focus is much greater for a 90mm lens than for a 50mm lens and the extension for a 21mm lens is much less. however, for the rangefinder still to work, there has to be a surface on the back of the lens which moves through the same range as the lens barrel for the \"reference\" 50mm lens. this is accomplished in two main ways. first, there can be a second helicoid which moves the surface against which the roller is pressing at a different rate to the lens barrel. at infinity, the lens barrel helicoid is set so that the lens focusses to infinity and the focussing helicoid is set so that the rangefinder is coincident at infinity. as the focussing ring is turned, the lens moves forward at one rate and the focussing surface at another. they are both still linked to the angular rotation of the focussing ring. the 75mm summicron is a good example. the second option if you don't want to go to the trouble of having a second helicoid is to arrange for the roller to press on a surface linked to the focussing ring which then rotates and is profiled so that as the focussing ring rotates, the roller moves as required. examples are the 18mm super-elmar and the 90mm elmar. the problem now is that the rangefinder roller can make contact at a slightly different lateral -----> position !!!  depending on its own alignment and throw the focussing off, especially when the surface is steeply profiled. it works in the 90mm elmar because the profiling is quite shallow and with the 18mm because of the depth of field available. things get tricky when you have a difficult lens like the old noctilux or 75mm summilux because optical variations meant not all copies behaved in the same way and the noctilux is reputed to have had a hand-ground cam profile. in the most complex lenses, such as the 21mm summilux, it is not sufficient to just have the two helicoids because the lens has different focussing characteristics to the reference 50mm; in this case, they use a second focussing helicoid to get it in the right ball park and profile the cam to get it exactly right. fundamentally though, the rangefinder characteristic which defines roller displacement against coincident distance goes back to that basic 50mm lens. it's cameras and lenses both adhering to that characteristic which is essential to allow lens interchangeability.", "sortedWord": "None", "identifyer": 17265, "year": "2013"}, {"Unnamed: 0": 356100, "autor": "jaapv", "date": 1372368660000, "content": "By: Manolo Laguillo Athough written for the M9 it is very useful for M users. as you requested I have sent you some advice both for use and workflow for your 2.8/28 PC-Super-Angulon-R. Hopefully, you will find it useful. I am sure most, if not all, of what follows here is just common sense, and therefore redundant, but anyway here it goes: 1 Tripod I assume you will use the lens with the camera mounted on a tripod. This will eliminate the unavoidable small variations in camera positioning that occur when hand-held. This will also help to establish a fast and efficient technical routine (which is as broad and inclusive as possible in the sense that it is independent of any particular photogrpahic style) so that you won't need to think about the workflow every time. 2 Camera placement Initially you should try to define your image left-to-right, move around the scene you want to photograph, and adjust distance to and angle towards the subject, a well as height from ground. As always, the image is first defined in your mind, ie. deciding what you want even before having used the camera as a framing tool. This is especially important with the 28PC and M9, as without live-view you will need to review the image after having taken the photograph and then make any necessary adjustments. You first shoot in order to see what the photo will be like, and then, looking at the LCD, adjust the camera. The more experience you have with the 28mm focal length the better will be the initial positioning of the camera. Finally, you will have the right position for the camera, which is that which produces the correct geometry for the final image you want. This is a very important point so please bear with me whilst I digress to explain two possibilities. One can either be true to the geometry of the main plane of the subject (ie the true frontal view of the façade of the building), or not be true to it's geometry. With the latter there is a 'shortening', or Scorzo in Italian, or Verkürzung in German. There is only one way to produce a true frontal view, but many ways of producing a Scorzo. The Scorzo can be either a very small and almost unrecognizable departure from the true frontal view, or very large. In other words, the trapezoidal figure obtained from the original rectangle can be more or less irregular and bizarre depending on the degree of displacement from the true frontal view. The more from the side the photo is taken, the more bizarre the image and less recognizable will be the façade! This is why the most commonly sought image geometry is that delivered from the true frontal view, where the orthogonality of the façade is preserved, and the original rectangular front of the building becomes a true rectangle in the image. It takes some time and patience to develop the skill to achieve this more or less right from the beginning. 3 Level the Camera Align the camera with the aid of a bubble level. A 3D head is better for obvious reasons. The ideal tripod head is one that will allow a panoramic movement without losing the level, and where the panoramic movement is directly under the camera, not under the head. The Arca-Swiss d4 is the one I use precisely because of this feature. But it's not essential if you don't have it as it's only a minor inconvenience having to readjust the level after adjusting the camera for framing. It goes without saying that you will achieve the correct camera position and levelling by trial-and-error. Shoot and then go back to the LCD until you have the image you want. I find the quality of the M9's LCD to be adequate for this, but yes it could be better. Now, when the camera is correctly positioned for the image you want (from left-to-right), it is time to adjust the lens. 4 Lens Exposure and Focus Settings Meter the light with lens PC settings at zero. The diaphragm should be set to f11, but could be set to f8 if the shift is only going to be slight. There is a lever/switch on the lens that must be set to the down position - you will easily find this yourself. As the aperture setting of f11 is not variable, obviously only shutter speed (and ISO) is available to adjust for the correct exposure. I assume you are photographing landscapes and cityscapes/buildings so the focus is, by default, set to infinity. It is always worthwhile using the lens-hood. 5 Lens - Shift Settings So now let's shift! You are at ground level on the street and want to photograph a five storey building so you will need to shift the lens up. As the default lens position is for sideways shift it will need to be rotated. Personally, I like to have the knob pointing to the sky simply because it is convenient to have the f-stop and the distance scales to the right where the shutter-release is. In this way one only needs to move/look from behind the camera to the right of the lens and back again, rather than to both the left and right of the lens. Shifting is a very straightforward procedure, again done by trial-and-error because there is no live-view. If we think about it, this step is simply a means of framing up-and-down! If you are on the top of a building and want to shoot looking down the lens will obvioulsy be shifted down. However, for some strange reason I nearly always avoid correcting verticals when looking down: as I do not find verticals converging towards the ground didtrubing. You can of course shift laterally, applying the same principles as above. 6 Tips for Shift Settings a. After gaining some experience with up-down and left-right movements you can try diagonals. Diagonal adjustments will shift simultaneously through the two planes, for example right and up if the lens is shifted diagonally towards 1:30 on the clock. The example you saw in the forum was exactly this - right & up. Schneider recommends that with these combined diagonal shifts one should not shift beyond 9mm. b. There is a rule-of-thumb when working with a view camera that one should avoid shifting if tilting the lens axis more than ±30° such as with a taller building. This is because the resulting image would look 'artificial' but this is not a problem with 28 PC-R because it can only shift to a maximum of 11mm. Not that this is an inconsiderable shift being nearly 50% of 24mm which is of course the short length of a 24mmx36 full-frame. It is of course possible to combine lens shifting with tilting the camera up in these more extreme situations. The shift will lessen the convergence without totally eliminating it. c. In some instances it is better to avoid a 100% correction of vertical convergence because if overdone it can appear as if a vertical convergence towards the ground is happening. The classic example is a tall building seen in such a way that it appears as a ship's prow, ie. aggresively pointing towards the camera. Because of the 'fish spine' configuration of horizontal lines, even if vertical lines are perfectly parallel, the verticals seem to converge towards the ground. This effect can be avoided easily by not trying to attempt a full 100% correction of vertical convergence. This is comparable to the 'entasis' applied by the old greeks to their temple architecture. I hope you find this helpful! Warm regards from Barcelona. Manolo Epilogue This has been written for those who want to try using a PC lens on the M9 and already believes that this is worthwhile. For those who are still to be converted I include this final reflection on: Why use a PC lens on the M9? Which is easier, using a PC lens on a DSLR or on an M9? The answer is obvious - on a DSLR. But we are not speaking about the obvious, but of a solution that is much more interesting precisely because it is not obvious! I like the M9's quality, I like it's small size, and it's the camera I own. This is an important point! I don't own a Nikon 800 or Canon 5DIII or equivalent because I don't want or need them. The price of a 2nd hand PC such as the 28 PC-R is much lower than those camera bodies. This lens is an excellent compromise - with a trade-off of what I find to be only a minor inconveninece in use, it adds only 800 gm to my bag, and is like having a very small view camera at hand. Using this lens allows me to take advantage of the M9's small size and image quality but give me the option of a PC lens. I don't consider this as being against the 'M philosophy,' but actually quite the opposite. Everything can be looked at from different or divergent (pardon the PC lens pun) point of view. As photographers, we know this very well... The combination of a M9 with a PC lens may seem bizarre at first, but it isn't if we think a little bit about it, or better yet, try it. This combination requires experience and practice, but can be very rewarding if you are willing to climb that steep learning curve.", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/6/?tab=comments#comment-2464199", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "by: manolo laguillo athough written for the m9 it is very useful for m users. as you requested i have sent you some advice both for use and workflow for your 2.8/28 pc-super-angulon-r. hopefully, you will find it useful. i am sure most, if not all, of what follows here is just common sense, and therefore redundant, but anyway here it goes: 1 tripod i assume you will use the lens with the camera mounted on a tripod. this will eliminate the unavoidable small variations in camera positioning that occur when hand-held. this will also help to establish a fast and efficient technical routine (which is as broad and inclusive as possible in the sense that it is independent of any particular photogrpahic style) so that you won't need to think about the workflow every time. 2 camera placement initially you should try to define your image left-to-right, move around the scene you want to photograph, and adjust distance to and angle towards the subject, a well as height from ground. as always, the image is first defined in your mind, ie. deciding what you want even before having used the camera as a framing tool. this is especially important with the 28pc and m9, as without live-view you will need to review the image after having taken the photograph and then make any necessary adjustments. you first shoot in order to see what the photo will be like, and then, looking at the lcd, adjust the camera. the more experience you have with the 28mm focal length the better will be the initial positioning of the camera. finally, you will have the right -----> position !!!  for the camera, which is that which produces the correct geometry for the final image you want. this is a very important point so please bear with me whilst i digress to explain two possibilities. one can either be true to the geometry of the main plane of the subject (ie the true frontal view of the façade of the building), or not be true to it's geometry. with the latter there is a 'shortening', or scorzo in italian, or verkürzung in german. there is only one way to produce a true frontal view, but many ways of producing a scorzo. the scorzo can be either a very small and almost unrecognizable departure from the true frontal view, or very large. in other words, the trapezoidal figure obtained from the original rectangle can be more or less irregular and bizarre depending on the degree of displacement from the true frontal view. the more from the side the photo is taken, the more bizarre the image and less recognizable will be the façade! this is why the most commonly sought image geometry is that delivered from the true frontal view, where the orthogonality of the façade is preserved, and the original rectangular front of the building becomes a true rectangle in the image. it takes some time and patience to develop the skill to achieve this more or less right from the beginning. 3 level the camera align the camera with the aid of a bubble level. a 3d head is better for obvious reasons. the ideal tripod head is one that will allow a panoramic movement without losing the level, and where the panoramic movement is directly under the camera, not under the head. the arca-swiss d4 is the one i use precisely because of this feature. but it's not essential if you don't have it as it's only a minor inconvenience having to readjust the level after adjusting the camera for framing. it goes without saying that you will achieve the correct camera position and levelling by trial-and-error. shoot and then go back to the lcd until you have the image you want. i find the quality of the m9's lcd to be adequate for this, but yes it could be better. now, when the camera is correctly positioned for the image you want (from left-to-right), it is time to adjust the lens. 4 lens exposure and focus settings meter the light with lens pc settings at zero. the diaphragm should be set to f11, but could be set to f8 if the shift is only going to be slight. there is a lever/switch on the lens that must be set to the down position - you will easily find this yourself. as the aperture setting of f11 is not variable, obviously only shutter speed (and iso) is available to adjust for the correct exposure. i assume you are photographing landscapes and cityscapes/buildings so the focus is, by default, set to infinity. it is always worthwhile using the lens-hood. 5 lens - shift settings so now let's shift! you are at ground level on the street and want to photograph a five storey building so you will need to shift the lens up. as the default lens position is for sideways shift it will need to be rotated. personally, i like to have the knob pointing to the sky simply because it is convenient to have the f-stop and the distance scales to the right where the shutter-release is. in this way one only needs to move/look from behind the camera to the right of the lens and back again, rather than to both the left and right of the lens. shifting is a very straightforward procedure, again done by trial-and-error because there is no live-view. if we think about it, this step is simply a means of framing up-and-down! if you are on the top of a building and want to shoot looking down the lens will obvioulsy be shifted down. however, for some strange reason i nearly always avoid correcting verticals when looking down: as i do not find verticals converging towards the ground didtrubing. you can of course shift laterally, applying the same principles as above. 6 tips for shift settings a. after gaining some experience with up-down and left-right movements you can try diagonals. diagonal adjustments will shift simultaneously through the two planes, for example right and up if the lens is shifted diagonally towards 1:30 on the clock. the example you saw in the forum was exactly this - right & up. schneider recommends that with these combined diagonal shifts one should not shift beyond 9mm. b. there is a rule-of-thumb when working with a view camera that one should avoid shifting if tilting the lens axis more than ±30° such as with a taller building. this is because the resulting image would look 'artificial' but this is not a problem with 28 pc-r because it can only shift to a maximum of 11mm. not that this is an inconsiderable shift being nearly 50% of 24mm which is of course the short length of a 24mmx36 full-frame. it is of course possible to combine lens shifting with tilting the camera up in these more extreme situations. the shift will lessen the convergence without totally eliminating it. c. in some instances it is better to avoid a 100% correction of vertical convergence because if overdone it can appear as if a vertical convergence towards the ground is happening. the classic example is a tall building seen in such a way that it appears as a ship's prow, ie. aggresively pointing towards the camera. because of the 'fish spine' configuration of horizontal lines, even if vertical lines are perfectly parallel, the verticals seem to converge towards the ground. this effect can be avoided easily by not trying to attempt a full 100% correction of vertical convergence. this is comparable to the 'entasis' applied by the old greeks to their temple architecture. i hope you find this helpful! warm regards from barcelona. manolo epilogue this has been written for those who want to try using a pc lens on the m9 and already believes that this is worthwhile. for those who are still to be converted i include this final reflection on: why use a pc lens on the m9? which is easier, using a pc lens on a dslr or on an m9? the answer is obvious - on a dslr. but we are not speaking about the obvious, but of a solution that is much more interesting precisely because it is not obvious! i like the m9's quality, i like it's small size, and it's the camera i own. this is an important point! i don't own a nikon 800 or canon 5diii or equivalent because i don't want or need them. the price of a 2nd hand pc such as the 28 pc-r is much lower than those camera bodies. this lens is an excellent compromise - with a trade-off of what i find to be only a minor inconveninece in use, it adds only 800 gm to my bag, and is like having a very small view camera at hand. using this lens allows me to take advantage of the m9's small size and image quality but give me the option of a pc lens. i don't consider this as being against the 'm philosophy,' but actually quite the opposite. everything can be looked at from different or divergent (pardon the pc lens pun) point of view. as photographers, we know this very well... the combination of a m9 with a pc lens may seem bizarre at first, but it isn't if we think a little bit about it, or better yet, try it. this combination requires experience and practice, but can be very rewarding if you are willing to climb that steep learning curve.", "sortedWord": "None", "identifyer": 17266, "year": "2013"}, {"Unnamed: 0": 356102, "autor": "lct", "date": 1373703840000, "content": "Question: Auto ISO doesn't work. I've removed the battery, changed the card, reseted the camera and vilified Leica a couple times on the LUF, to no avail. Answer: 1. Don't panic dude; 2. Select the A position of your shutter speed dial; 3. If nothing changes, simply remove your lens; 4. Put your lens back on the camera; 5. That's all folk; 6. Don't ask me why it works. --img-- ", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/6/?tab=comments#comment-2464205", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question: auto iso doesn't work. i've removed the battery, changed the card, reseted the camera and vilified leica a couple times on the luf, to no avail. answer: 1. don't panic dude; 2. select the a -----> position !!!  of your shutter speed dial; 3. if nothing changes, simply remove your lens; 4. put your lens back on the camera; 5. that's all folk; 6. don't ask me why it works. --img-- ", "sortedWord": "None", "identifyer": 17268, "year": "2013"}, {"Unnamed: 0": 356107, "autor": "jaapv", "date": 1376902140000, "content": "On the m8.2 I have I: Turn the camera on. Press the right arrow key 4 times. Press the left arrow key 3 times. Press the right arrow key 1 more time. Press the info button. Scroll down to body debug data. Press Set. Scroll down to NUMEXPOSURES. Turn camera off to exit........ I will try to shed some light on the service menus on the M8 and M8.2 (they are almost identical, the M9 and M220 are similar as well, but not the M240). They are used regularly for diagnoses and for assuring a repair went ok. Select a service function by pressing SET. The rest of the camera does not know the service mode is activated and carries on as usual with light metering, preparing for data capture, etc. Firmware Info Names and compilation/build dates of on-board software. There are module dates for the boot loader FSL (RedBoot, loads first to load the other modules, should be from June 30, 2006), the main CPU (Intel PXA270, sw should be ver 2.014, May 30, 2011), the Blackfin BF-561 DSP (sw should be ver 2.60R, Jan 16, 2008), and the NEC/Renesas M16C/60 micro controller (sw should be ver 2.205, Dec 4, 2009), but not for the user interface (GUI) or the look-up table (LUTS). The most frequently updated one is the main CPU software module. Last on the screen will be your serial number. It should match the number on the accessory shoe, else there is a mismatch between chassis and main board. They are always aligned when changing a main board. Exit by pressing the shutter release gently. Calib Info Calibration of the D/A-converters for the CCD. Body Debug Data (Scroll up and down with arrow buttons) BVIntern shows the light value as seen through the lens and BVExtern as seen by the small light sensor on the front (the blue dot) seeing about the same as a 35 mm lens. Raw is the D/A readout and normal is the calculated normalised EV value. Temperature is the temp protection D/A readout from the CCD board and normal is the calculated normalised value. Battery state is the charge level 0-4 (also shown graphical on the top plate). Main switch is the position of the switch around the shutter release: Off, Single, Continous (yes, American spelling), and SelfTimer. Exposure mode: read from the shutter speed dial: Auto, Bulb, Manual, Simple (M8.2 only, we call it Stupid). Body exposure time: read from the shutter speed dial: from 1/4000 to 6. Auto and Simple are read as 1/4000. There is a bug in that it forgets to update this for Bulb. BodyAperture is the software’s guess on the lens aperture based on BVIntern and BVExtern. Fails sometimes, occasionally miserably. The M8 cannot know but tries to infer the current aperture from difference in light through lens and outside of lens. Of course prone to errors. The guess will stay within the f-stop boundaries of an identified lens. Coded as a logarithmic scale with f/1.0 as 0 and then an increment of 1 for each stop, for example f/2.8 is 3. Measured to nearest half stop, so f/0.95 is still 0. Interpreting software should know that a newer Noctilux is max f/0.95, not f/1.0. FlashPresent is the detection of a Leica flash. LensCode is a value derived from the lens type and the 6-bit code of the lens (from 000001 to 111110). The 6-bit code is read from left to right looking at the lens from behind. The 6-bit code 000000 is reserved for a non-coded lens and 111111 for future extensions so there are 62 possible encodings. The coding is white=0 and black=1, this way uncoded lenses with a blank bayonet becomes 000000 in case lens detection is left on. The LensCode consists of the LensType and the 6-bit code. The LensType for Leica M lenses is 01 if detected and 00 if undetected (=old Leica or other manufacturer). The LensCode is the 6-bit code shifted two positions left and the LensType added. Example: TriElmar MATE 28-35-50 is 6-bit=101010 of type Leica=01. Shift two positions left and add 00000001 yields 10101001. Read this as binary to obtain 169 as the LensCode. Note: If Lens detection + IV/UR is On, the LensCode 65 (Tri-Elmar WATE 16-18-21) brings up the focal length selection dialogue even in diagnostic mode due to it being implemented in the software as an interrupt upon lens mounting, not as part of the normal lens code interpretation software function. Also note: In the EXIF MakerNote data, LensType is replaced by FrameLines (00-11). ReleaseSwitch is the state of the shutter release button. Four states possible: Idle, Active, Store, Release. (If you try Release, it will actually record an image…) You find the most popular entry here, NumExposures = number of pictures taken. Last is the conversion ratio (BVSlope) between the D/A readout (of BVIntern) and the normalised value. This is calibrated individually to match the body. For example, if BVSlope = 36.50 and BVIntern Raw = 350 yields a normalised EV value of 0.50, then Raw = 600 yields 0.50 + (600-350)/36.50 = 7.35 rounded to the nearest quarter = 7.25. (Real numbers are shown in German, using ‘,’ instead of ‘.’ for the decimal point). Exit Body Debug Data by pressing SET. Production Test Here you can test all the switches on the body. The red LED will blink constantly. In the VF, all display segments flash in a dual pattern. Pressing buttons will be echoed on the graphic of the body on the display. 6 back buttons, 4 directional buttons. The thumbwheel will be seen as an arrow up or down depending on the direction rotated. The power switch will display its state (same as in Body Debug Data: Off, Single, Continous, SelfTimer). The shutter speed dial will display its state (same as in Body Debug Data: Auto, Bulb, Simple (M8.2 only), or manual which shows as M plus the speed). The shutter release is shown in colour for the four states possible: Idle=green, Active=orange, Store=red, Release=disappears. (If you press to Release, it will not record an image here.) The SD card detection switch is displayed as a white “card” below the directional pad if a card is inserted. The bottom lid switch is displayed as an extra underlining under the graphic of the body if the lid is in place. Finally, you find the test of the landscape/portrait switch which shows as a white square in the graphic “screen” showing one of its three positions together with a funny sound. Exit by power off. Sensor test Initially displays the LensCode (explained above), the name of the lens (in German spelling: “Objektiv Name”) and its lens data and Leica parts number (but “Uncoded” in English if LensType=00 such as Zeiss, Voigtlander and uncoded Leica) plus the BodyAperture from Body Debug Data. For example “Objektiv Name: 4/16-18-21 11626” or “Objektiv Name: 2.0/50; 11819/11825/11826/11816”. Inconsistent, some with half-stop after focal length, some not. Some with decimal f-stop, some not. Do not run this test. Exit by pressing SET. Display test Tests all pixels on the LCD screen. Cycles through 6 screens by pressing the left and right arrow buttons. White, black, red, green, blue, white with frame. Exit by pressing the shutter release. EEPROM check Performs a test of the EEPROM on entry. Writes a test data pattern, reads the data, compares the data read to what was written. Displays a green square for each successful step, a red square for a failed step. Overwrites essential data in memory. You should exit by power off, not by pressing the release button to take a picture. Hardware IDs CCD ID: 0 = Kodak KAF-10500 CCD, the only one used in M8 / M8.2. CCD Board ID: There are three CCD board versions, 0-2, all introduced during M8. No change for M8.2. Control board ID: Only one version = 0. M16C ID: Only one flash memory version = 0. Exit by pressing the shutter release. BF Status On/Off Toggles showing the Blackfin DSP operation status on the display or not. Shows read/write operations at the top and the auto white balance plus exposure value at the bottom of the screen. Shows the read/write operations of the color channels in real time as an image is processed after the shutter closes. Bars grow from left to right as each image completes. They are in blue if the read/write goes on without interruption and in red if there is an error (for example due to overruns or processor congestion). This mode remains active until set off. No exiting as this is a toggle switch. Two Channel Corr. Off (On) The CCD readout can be made in different ways/modes yielding different levels of noise and/or risk of banding. There is a correction function to minimise the effect without reducing speed. which is normally activated. This function toggles the correction on and off by pressing SET. I’m sorry there is very little documentation on this, not used during service. If I find out more, I will edit this post. Finally, note that the service menu is called up by the INFO button that normally starts the guide function in the Stupid (sorry, meant Simple) mode. When these two collide, the service menu takes precedence due to its implementation overriding the button interpretation function. Hope this does help. Play at your own risk. .", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/6/?tab=comments#comment-2464210", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on the m8.2 i have i: turn the camera on. press the right arrow key 4 times. press the left arrow key 3 times. press the right arrow key 1 more time. press the info button. scroll down to body debug data. press set. scroll down to numexposures. turn camera off to exit........ i will try to shed some light on the service menus on the m8 and m8.2 (they are almost identical, the m9 and m220 are similar as well, but not the m240). they are used regularly for diagnoses and for assuring a repair went ok. select a service function by pressing set. the rest of the camera does not know the service mode is activated and carries on as usual with light metering, preparing for data capture, etc. firmware info names and compilation/build dates of on-board software. there are module dates for the boot loader fsl (redboot, loads first to load the other modules, should be from june 30, 2006), the main cpu (intel pxa270, sw should be ver 2.014, may 30, 2011), the blackfin bf-561 dsp (sw should be ver 2.60r, jan 16, 2008), and the nec/renesas m16c/60 micro controller (sw should be ver 2.205, dec 4, 2009), but not for the user interface (gui) or the look-up table (luts). the most frequently updated one is the main cpu software module. last on the screen will be your serial number. it should match the number on the accessory shoe, else there is a mismatch between chassis and main board. they are always aligned when changing a main board. exit by pressing the shutter release gently. calib info calibration of the d/a-converters for the ccd. body debug data (scroll up and down with arrow buttons) bvintern shows the light value as seen through the lens and bvextern as seen by the small light sensor on the front (the blue dot) seeing about the same as a 35 mm lens. raw is the d/a readout and normal is the calculated normalised ev value. temperature is the temp protection d/a readout from the ccd board and normal is the calculated normalised value. battery state is the charge level 0-4 (also shown graphical on the top plate). main switch is the -----> position !!!  of the switch around the shutter release: off, single, continous (yes, american spelling), and selftimer. exposure mode: read from the shutter speed dial: auto, bulb, manual, simple (m8.2 only, we call it stupid). body exposure time: read from the shutter speed dial: from 1/4000 to 6. auto and simple are read as 1/4000. there is a bug in that it forgets to update this for bulb. bodyaperture is the software’s guess on the lens aperture based on bvintern and bvextern. fails sometimes, occasionally miserably. the m8 cannot know but tries to infer the current aperture from difference in light through lens and outside of lens. of course prone to errors. the guess will stay within the f-stop boundaries of an identified lens. coded as a logarithmic scale with f/1.0 as 0 and then an increment of 1 for each stop, for example f/2.8 is 3. measured to nearest half stop, so f/0.95 is still 0. interpreting software should know that a newer noctilux is max f/0.95, not f/1.0. flashpresent is the detection of a leica flash. lenscode is a value derived from the lens type and the 6-bit code of the lens (from 000001 to 111110). the 6-bit code is read from left to right looking at the lens from behind. the 6-bit code 000000 is reserved for a non-coded lens and 111111 for future extensions so there are 62 possible encodings. the coding is white=0 and black=1, this way uncoded lenses with a blank bayonet becomes 000000 in case lens detection is left on. the lenscode consists of the lenstype and the 6-bit code. the lenstype for leica m lenses is 01 if detected and 00 if undetected (=old leica or other manufacturer). the lenscode is the 6-bit code shifted two positions left and the lenstype added. example: trielmar mate 28-35-50 is 6-bit=101010 of type leica=01. shift two positions left and add 00000001 yields 10101001. read this as binary to obtain 169 as the lenscode. note: if lens detection + iv/ur is on, the lenscode 65 (tri-elmar wate 16-18-21) brings up the focal length selection dialogue even in diagnostic mode due to it being implemented in the software as an interrupt upon lens mounting, not as part of the normal lens code interpretation software function. also note: in the exif makernote data, lenstype is replaced by framelines (00-11). releaseswitch is the state of the shutter release button. four states possible: idle, active, store, release. (if you try release, it will actually record an image…) you find the most popular entry here, numexposures = number of pictures taken. last is the conversion ratio (bvslope) between the d/a readout (of bvintern) and the normalised value. this is calibrated individually to match the body. for example, if bvslope = 36.50 and bvintern raw = 350 yields a normalised ev value of 0.50, then raw = 600 yields 0.50 + (600-350)/36.50 = 7.35 rounded to the nearest quarter = 7.25. (real numbers are shown in german, using ‘,’ instead of ‘.’ for the decimal point). exit body debug data by pressing set. production test here you can test all the switches on the body. the red led will blink constantly. in the vf, all display segments flash in a dual pattern. pressing buttons will be echoed on the graphic of the body on the display. 6 back buttons, 4 directional buttons. the thumbwheel will be seen as an arrow up or down depending on the direction rotated. the power switch will display its state (same as in body debug data: off, single, continous, selftimer). the shutter speed dial will display its state (same as in body debug data: auto, bulb, simple (m8.2 only), or manual which shows as m plus the speed). the shutter release is shown in colour for the four states possible: idle=green, active=orange, store=red, release=disappears. (if you press to release, it will not record an image here.) the sd card detection switch is displayed as a white “card” below the directional pad if a card is inserted. the bottom lid switch is displayed as an extra underlining under the graphic of the body if the lid is in place. finally, you find the test of the landscape/portrait switch which shows as a white square in the graphic “screen” showing one of its three positions together with a funny sound. exit by power off. sensor test initially displays the lenscode (explained above), the name of the lens (in german spelling: “objektiv name”) and its lens data and leica parts number (but “uncoded” in english if lenstype=00 such as zeiss, voigtlander and uncoded leica) plus the bodyaperture from body debug data. for example “objektiv name: 4/16-18-21 11626” or “objektiv name: 2.0/50; 11819/11825/11826/11816”. inconsistent, some with half-stop after focal length, some not. some with decimal f-stop, some not. do not run this test. exit by pressing set. display test tests all pixels on the lcd screen. cycles through 6 screens by pressing the left and right arrow buttons. white, black, red, green, blue, white with frame. exit by pressing the shutter release. eeprom check performs a test of the eeprom on entry. writes a test data pattern, reads the data, compares the data read to what was written. displays a green square for each successful step, a red square for a failed step. overwrites essential data in memory. you should exit by power off, not by pressing the release button to take a picture. hardware ids ccd id: 0 = kodak kaf-10500 ccd, the only one used in m8 / m8.2. ccd board id: there are three ccd board versions, 0-2, all introduced during m8. no change for m8.2. control board id: only one version = 0. m16c id: only one flash memory version = 0. exit by pressing the shutter release. bf status on/off toggles showing the blackfin dsp operation status on the display or not. shows read/write operations at the top and the auto white balance plus exposure value at the bottom of the screen. shows the read/write operations of the color channels in real time as an image is processed after the shutter closes. bars grow from left to right as each image completes. they are in blue if the read/write goes on without interruption and in red if there is an error (for example due to overruns or processor congestion). this mode remains active until set off. no exiting as this is a toggle switch. two channel corr. off (on) the ccd readout can be made in different ways/modes yielding different levels of noise and/or risk of banding. there is a correction function to minimise the effect without reducing speed. which is normally activated. this function toggles the correction on and off by pressing set. i’m sorry there is very little documentation on this, not used during service. if i find out more, i will edit this post. finally, note that the service menu is called up by the info button that normally starts the guide function in the stupid (sorry, meant simple) mode. when these two collide, the service menu takes precedence due to its implementation overriding the button interpretation function. hope this does help. play at your own risk. .", "sortedWord": "None", "identifyer": 17273, "year": "2013"}, {"Unnamed: 0": 356108, "autor": "jaapv", "date": 1379838420000, "content": "Question: by bab Just an FYI..... I find my M240 when set to Classic and Center Weighted shooting in the vertical position exposes +1/3 to +2/3 to the right. And when in the Horizontal position it exposes -1/3 to -2/3 to the left underexposed. I also see that with the background being mostly white or a lot of the background white the image tends to overexpose from the meter reading when shooting with my 50 lux but when I'm shooting with my 21mm its still underexposed by -1/3 to -2/3 of a stop. Answer:by Jaapv The metering field in centreweighed mode is oval ( see the FAQ: http://www.l-camera-forum.com/leica-forum/leica-m9-forum/130720-leica-m8-m8-2-m9-m9p-4.html#post1997160 ) When you hold the camera vertical considerably more of fore- and background will be considered for the exposure than when you hold the camera horizontally. So yes, your findings are logical. An exposure meter will measure objectively. It is up to the user to understand the system and interpret the readings. Images which have a pronounced light intensity difference ( the proverbial black horse in the snow,or the bright light in the night) will need to be interpreted by the user and have an appropriate correction of the measured value applied. Due to the wider angle of view this effect is more pronounced on wideangles.", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/6/?tab=comments#comment-2464213", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question: by bab just an fyi..... i find my m240 when set to classic and center weighted shooting in the vertical -----> position !!!  exposes +1/3 to +2/3 to the right. and when in the horizontal position it exposes -1/3 to -2/3 to the left underexposed. i also see that with the background being mostly white or a lot of the background white the image tends to overexpose from the meter reading when shooting with my 50 lux but when i'm shooting with my 21mm its still underexposed by -1/3 to -2/3 of a stop. answer:by jaapv the metering field in centreweighed mode is oval ( see the faq: http://www.l-camera-forum.com/leica-forum/leica-m9-forum/130720-leica-m8-m8-2-m9-m9p-4.html#post1997160 ) when you hold the camera vertical considerably more of fore- and background will be considered for the exposure than when you hold the camera horizontally. so yes, your findings are logical. an exposure meter will measure objectively. it is up to the user to understand the system and interpret the readings. images which have a pronounced light intensity difference ( the proverbial black horse in the snow,or the bright light in the night) will need to be interpreted by the user and have an appropriate correction of the measured value applied. due to the wider angle of view this effect is more pronounced on wideangles.", "sortedWord": "None", "identifyer": 17274, "year": "2013"}, {"Unnamed: 0": 358853, "autor": "jaapv", "date": 1377199080000, "content": "I always add copyright info on import; the camera has too few positions anyway and it lacks the © symbol!--img-- ", "link": "https://www.l-camera-forum.com/topic/211236-m240-copyright-info-and-lr5/?tab=comments#comment-2403277", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i always add copyright info on import; the camera has too few -----> positions !!!  anyway and it lacks the © symbol!--img-- ", "sortedWord": "None", "identifyer": 20034, "year": "2013"}, {"Unnamed: 0": 358859, "autor": "theno23", "date": 1377237240000, "content": "I always add copyright info on import; the camera has too few positions anyway and it lacks the © symbol!--img--  That's fine because the © symbol isn't necessary (or sufficient?) for a copyright notice. \"Copyright\" is though. Rules might be different in Copyright fields, but here's an excerpt from some well-known instructions in copyrighting your work: \" Always use the English word “Copyright”; by international convention, this is used worldwide, even for material in other languages. The copyright symbol “©” can be included if you wish (and your character set supports it), but it's not necessary. There is no legal significance to using the three-character sequence “©”, although it does no harm.\"", "link": "https://www.l-camera-forum.com/topic/211236-m240-copyright-info-and-lr5/?tab=comments#comment-2403453", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i always add copyright info on import; the camera has too few -----> positions !!!  anyway and it lacks the © symbol!--img--  that's fine because the © symbol isn't necessary (or sufficient?) for a copyright notice. \"copyright\" is though. rules might be different in copyright fields, but here's an excerpt from some well-known instructions in copyrighting your work: \" always use the english word “copyright”; by international convention, this is used worldwide, even for material in other languages. the copyright symbol “©” can be included if you wish (and your character set supports it), but it's not necessary. there is no legal significance to using the three-character sequence “©”, although it does no harm.\"", "sortedWord": "None", "identifyer": 20040, "year": "2013"}, {"Unnamed: 0": 374126, "autor": "250swb", "date": 1383724980000, "content": "Thanks kdriceman for working out a fix. I thought my Lee Big Stopper or filter holder was defective. The only thing I can't explain is why the problem isn't more consistent. I'll guess it occurs in about a third of sequential long exposure shots done back to back. I agree it is inconsistent, one shot OK, the next with the flare, but the light hasn't changed enough for me to notice. I had considered it may be an accumulative effect caused by the size of the image circle, the 'excess' reflecting off something inside the camera for the length of the exposure, and perhaps equally lens dependent as some lenses are shinier on their inner faces than others. What I don't understand is why there is no gradual trace of the 'flare' increasing as you increase exposure, it is either on or off. Another thought regarding light leaking in is that it would be doing it where the focusing cam is, so does focus affect the leak, either the position of the cam or the position of the rear barrel? Steve", "link": "https://www.l-camera-forum.com/topic/212964-monochrom-long-exposure-issue/page/3/?tab=comments#comment-2458967", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks kdriceman for working out a fix. i thought my lee big stopper or filter holder was defective. the only thing i can't explain is why the problem isn't more consistent. i'll guess it occurs in about a third of sequential long exposure shots done back to back. i agree it is inconsistent, one shot ok, the next with the flare, but the light hasn't changed enough for me to notice. i had considered it may be an accumulative effect caused by the size of the image circle, the 'excess' reflecting off something inside the camera for the length of the exposure, and perhaps equally lens dependent as some lenses are shinier on their inner faces than others. what i don't understand is why there is no gradual trace of the 'flare' increasing as you increase exposure, it is either on or off. another thought regarding light leaking in is that it would be doing it where the focusing cam is, so does focus affect the leak, either the -----> position !!!  of the cam or the -----> position !!!  of the rear barrel? steve", "sortedWord": "None", "identifyer": 35432, "year": "2013"}, {"Unnamed: 0": 374127, "autor": "MarkP", "date": 1383726600000, "content": "I had considered it may be an accumulative effect caused by the size of the image circle, the 'excess' reflecting off something inside the camera for the length of the exposure, and perhaps equally lens dependent as some lenses are shinier on their inner faces than others. No, it's definately a light leak at about 2-3 o'clock at the lens mount, obviously with further internal reflections. When I discussed this recently with someone from Leica Australia he was aware of it and had actually described it before in the RFF. I wonder whether the leak occurs near the screw hole in the mount ring, perhaps made worse if there is a similar screw hole in the lens mount. What I don't understand is why there is no gradual trace of the 'flare' increasing as you increase exposure, it is either on or off.Steve With different ambient light and exposure times, or testing with a strong torch, the intensity, duration, and angle of the light source affects the degree of this flare in the image. It's just that in normal daylight and exposure times the amount of light entering does not vary much. Test it yourself with a high intensity focussed light source as I did. It takes only a few minutes to reproduce the problem. Another thought regarding light leaking in is that it would be doing it where the focusing cam is, so does focus affect the leak, either the position of the cam or the position of the rear barrel? No.", "link": "https://www.l-camera-forum.com/topic/212964-monochrom-long-exposure-issue/page/3/?tab=comments#comment-2458991", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i had considered it may be an accumulative effect caused by the size of the image circle, the 'excess' reflecting off something inside the camera for the length of the exposure, and perhaps equally lens dependent as some lenses are shinier on their inner faces than others. no, it's definately a light leak at about 2-3 o'clock at the lens mount, obviously with further internal reflections. when i discussed this recently with someone from leica australia he was aware of it and had actually described it before in the rff. i wonder whether the leak occurs near the screw hole in the mount ring, perhaps made worse if there is a similar screw hole in the lens mount. what i don't understand is why there is no gradual trace of the 'flare' increasing as you increase exposure, it is either on or off.steve with different ambient light and exposure times, or testing with a strong torch, the intensity, duration, and angle of the light source affects the degree of this flare in the image. it's just that in normal daylight and exposure times the amount of light entering does not vary much. test it yourself with a high intensity focussed light source as i did. it takes only a few minutes to reproduce the problem. another thought regarding light leaking in is that it would be doing it where the focusing cam is, so does focus affect the leak, either the -----> position !!!  of the cam or the -----> position !!!  of the rear barrel? no.", "sortedWord": "None", "identifyer": 35433, "year": "2013"}, {"Unnamed: 0": 376733, "autor": "k_g_wolf ✝", "date": 1387531020000, "content": "No, but you could agree they can use another type of covering. There should be several to chose from. Have a look at the >>a la carte menu<< for the LEICA MP, these materials ought to be available for the M9 as well. Your dealer might be in a position to arrange this for you. If they hear >>GINZA<< in the german province they will do anything for you and your dealership. Best GEORG", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/4/?tab=comments#comment-2491274", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "no, but you could agree they can use another type of covering. there should be several to chose from. have a look at the >>a la carte menu<< for the leica mp, these materials ought to be available for the m9 as well. your dealer might be in a -----> position !!!  to arrange this for you. if they hear >>ginza<< in the german province they will do anything for you and your dealership. best georg", "sortedWord": "None", "identifyer": 38044, "year": "2013"}, {"Unnamed: 0": 376735, "autor": "jaapv", "date": 1387569180000, "content": "No, but you could agree they can use another type of covering. There should be several to chose from. Have a look at the >>a la carte menu<< for the LEICA MP, these materials ought to be available for the M9 as well. Your dealer might be in a position to arrange this for you. If they hear >>GINZA<< in the german province they will do anything for you and your dealership. Best GEORG There are - at a price….", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/4/?tab=comments#comment-2491728", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "no, but you could agree they can use another type of covering. there should be several to chose from. have a look at the >>a la carte menu<< for the leica mp, these materials ought to be available for the m9 as well. your dealer might be in a -----> position !!!  to arrange this for you. if they hear >>ginza<< in the german province they will do anything for you and your dealership. best georg there are - at a price….", "sortedWord": "None", "identifyer": 38046, "year": "2013"}, {"Unnamed: 0": 384592, "autor": "X-Paula", "date": 1376585640000, "content": "I will try to shed some light on the service menus on the M8 and M8.2 (they are almost identical, the M9 and M220 are similar as well, but not the M240). They are used regularly for diagnoses and for assuring a repair went ok. Select a service function by pressing SET. The rest of the camera does not know the service mode is activated and carries on as usual with light metering, preparing for data capture, etc. Firmware Info Names and compilation/build dates of on-board software. There are module dates for the boot loader FSL (RedBoot, loads first to load the other modules, should be from June 30, 2006), the main CPU (Intel PXA270, sw should be ver 2.014, May 30, 2011), the Blackfin BF-561 DSP (sw should be ver 2.60R, Jan 16, 2008), and the NEC/Renesas M16C/60 micro controller (sw should be ver 2.205, Dec 4, 2009), but not for the user interface (GUI) or the look-up table (LUTS). The most frequently updated one is the main CPU software module. Last on the screen will be your serial number. It should match the number on the accessory shoe, else there is a mismatch between chassis and main board. They are always aligned when changing a main board. Exit by pressing the shutter release gently. Calib Info Calibration of the D/A-converters for the CCD. Body Debug Data (Scroll up and down with arrow buttons) BVIntern shows the light value as seen through the lens and BVExtern as seen by the small light sensor on the front (the blue dot) seeing about the same as a 35 mm lens. Raw is the D/A readout and normal is the calculated normalised EV value. Temperature is the temp protection D/A readout from the CCD board and normal is the calculated normalised value. Battery state is the charge level 0-4 (also shown graphical on the top plate). Main switch is the position of the switch around the shutter release: Off, Single, Continous (yes, American spelling), and SelfTimer. Exposure mode: read from the shutter speed dial: Auto, Bulb, Manual, Simple (M8.2 only, we call it Stupid). Body exposure time: read from the shutter speed dial: from 1/4000 to 6. Auto and Simple are read as 1/4000. There is a bug in that it forgets to update this for Bulb. BodyAperture is the software’s guess on the lens aperture based on BVIntern and BVExtern. Fails sometimes, occasionally miserably. The M8 cannot know but tries to infer the current aperture from difference in light through lens and outside of lens. Of course prone to errors. The guess will stay within the f-stop boundaries of an identified lens. Coded as a logarithmic scale with f/1.0 as 0 and then an increment of 1 for each stop, for example f/2.8 is 3. Measured to nearest half stop, so f/0.95 is still 0. Interpreting software should know that a newer Noctilux is max f/0.95, not f/1.0. FlashPresent is the detection of a Leica flash. LensCode is a value derived from the lens type and the 6-bit code of the lens (from 000001 to 111110). The 6-bit code is read from left to right looking at the lens from behind. The 6-bit code 000000 is reserved for a non-coded lens and 111111 for future extensions so there are 62 possible encodings. The coding is white=0 and black=1, this way uncoded lenses with a blank bayonet becomes 000000 in case lens detection is left on. The LensCode consists of the LensType and the 6-bit code. The LensType for Leica M lenses is 01 if detected and 00 if undetected (=old Leica or other manufacturer). The LensCode is the 6-bit code shifted two positions left and the LensType added. Example: TriElmar MATE 28-35-50 is 6-bit=101010 of type Leica=01. Shift two positions left and add 00000001 yields 10101001. Read this as binary to obtain 169 as the LensCode. Note: If Lens detection + IV/UR is On, the LensCode 65 (Tri-Elmar WATE 16-18-21) brings up the focal length selection dialogue even in diagnostic mode due to it being implemented in the software as an interrupt upon lens mounting, not as part of the normal lens code interpretation software function. Also note: In the EXIF MakerNote data, LensType is replaced by FrameLines (00-11). ReleaseSwitch is the state of the shutter release button. Four states possible: Idle, Active, Store, Release. (If you try Release, it will actually record an image…) You find the most popular entry here, NumExposures = number of pictures taken. Last is the conversion ratio (BVSlope) between the D/A readout (of BVIntern) and the normalised value. This is calibrated individually to match the body. For example, if BVSlope = 36.50 and BVIntern Raw = 350 yields a normalised EV value of 0.50, then Raw = 600 yields 0.50 + (600-350)/36.50 = 7.35 rounded to the nearest quarter = 7.25. (Real numbers are shown in German, using ‘,’ instead of ‘.’ for the decimal point). Exit Body Debug Data by pressing SET. Production Test Here you can test all the switches on the body. The red LED will blink constantly. In the VF, all display segments flash in a dual pattern. Pressing buttons will be echoed on the graphic of the body on the display. 6 back buttons, 4 directional buttons. The thumbwheel will be seen as an arrow up or down depending on the direction rotated. The power switch will display its state (same as in Body Debug Data: Off, Single, Continous, SelfTimer). The shutter speed dial will display its state (same as in Body Debug Data: Auto, Bulb, Simple (M8.2 only), or manual which shows as M plus the speed). The shutter release is shown in colour for the four states possible: Idle=green, Active=orange, Store=red, Release=disappears. (If you press to Release, it will not record an image here.) The SD card detection switch is displayed as a white “card” below the directional pad if a card is inserted. The bottom lid switch is displayed as an extra underlining under the graphic of the body if the lid is in place. Finally, you find the test of the landscape/portrait switch which shows as a white square in the graphic “screen” showing one of its three positions together with a funny sound. Exit by power off. Sensor test Initially displays the LensCode (explained above), the name of the lens (in German spelling: “Objektiv Name”) and its lens data and Leica parts number (but “Uncoded” in English if LensType=00 such as Zeiss, Voigtlander and uncoded Leica) plus the BodyAperture from Body Debug Data. For example “Objektiv Name: 4/16-18-21 11626” or “Objektiv Name: 2.0/50; 11819/11825/11826/11816”. Inconsistent, some with half-stop after focal length, some not. Some with decimal f-stop, some not. Do not run this test. Exit by pressing SET. Display test Tests all pixels on the LCD screen. Cycles through 6 screens by pressing the left and right arrow buttons. White, black, red, green, blue, white with frame. Exit by pressing the shutter release. EEPROM check Performs a test of the EEPROM on entry. Writes a test data pattern, reads the data, compares the data read to what was written. Displays a green square for each successful step, a red square for a failed step. Overwrites essential data in memory. You should exit by power off, not by pressing the release button to take a picture. Hardware IDs CCD ID: 0 = Kodak KAF-10500 CCD, the only one used in M8 / M8.2. CCD Board ID: There are three CCD board versions, 0-2, all introduced during M8. No change for M8.2. Control board ID: Only one version = 0. M16C ID: Only one flash memory version = 0. Exit by pressing the shutter release. BF Status On/Off Toggles showing the Blackfin DSP operation status on the display or not. Shows read/write operations at the top and the auto white balance plus exposure value at the bottom of the screen. Shows the read/write operations of the color channels in real time as an image is processed after the shutter closes. Bars grow from left to right as each image completes. They are in blue if the read/write goes on without interruption and in red if there is an error (for example due to overruns or processor congestion). This mode remains active until set off. No exiting as this is a toggle switch. Two Channel Corr. Off (On) The CCD readout can be made in different ways/modes yielding different levels of noise and/or risk of banding. There is a correction function to minimise the effect without reducing speed. which is normally activated. This function toggles the correction on and off by pressing SET. I’m sorry there is very little documentation on this, not used during service. If I find out more, I will edit this post. Finally, note that the service menu is called up by the INFO button that normally starts the guide function in the Stupid (sorry, meant Simple) mode. When these two collide, the service menu takes precedence due to its implementation overriding the button interpretation function. Hope this does help. Play at your own risk.", "link": "https://www.l-camera-forum.com/topic/178936-m8-shutter-actuation-count/page/2/?tab=comments#comment-2398254", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i will try to shed some light on the service menus on the m8 and m8.2 (they are almost identical, the m9 and m220 are similar as well, but not the m240). they are used regularly for diagnoses and for assuring a repair went ok. select a service function by pressing set. the rest of the camera does not know the service mode is activated and carries on as usual with light metering, preparing for data capture, etc. firmware info names and compilation/build dates of on-board software. there are module dates for the boot loader fsl (redboot, loads first to load the other modules, should be from june 30, 2006), the main cpu (intel pxa270, sw should be ver 2.014, may 30, 2011), the blackfin bf-561 dsp (sw should be ver 2.60r, jan 16, 2008), and the nec/renesas m16c/60 micro controller (sw should be ver 2.205, dec 4, 2009), but not for the user interface (gui) or the look-up table (luts). the most frequently updated one is the main cpu software module. last on the screen will be your serial number. it should match the number on the accessory shoe, else there is a mismatch between chassis and main board. they are always aligned when changing a main board. exit by pressing the shutter release gently. calib info calibration of the d/a-converters for the ccd. body debug data (scroll up and down with arrow buttons) bvintern shows the light value as seen through the lens and bvextern as seen by the small light sensor on the front (the blue dot) seeing about the same as a 35 mm lens. raw is the d/a readout and normal is the calculated normalised ev value. temperature is the temp protection d/a readout from the ccd board and normal is the calculated normalised value. battery state is the charge level 0-4 (also shown graphical on the top plate). main switch is the -----> position !!!  of the switch around the shutter release: off, single, continous (yes, american spelling), and selftimer. exposure mode: read from the shutter speed dial: auto, bulb, manual, simple (m8.2 only, we call it stupid). body exposure time: read from the shutter speed dial: from 1/4000 to 6. auto and simple are read as 1/4000. there is a bug in that it forgets to update this for bulb. bodyaperture is the software’s guess on the lens aperture based on bvintern and bvextern. fails sometimes, occasionally miserably. the m8 cannot know but tries to infer the current aperture from difference in light through lens and outside of lens. of course prone to errors. the guess will stay within the f-stop boundaries of an identified lens. coded as a logarithmic scale with f/1.0 as 0 and then an increment of 1 for each stop, for example f/2.8 is 3. measured to nearest half stop, so f/0.95 is still 0. interpreting software should know that a newer noctilux is max f/0.95, not f/1.0. flashpresent is the detection of a leica flash. lenscode is a value derived from the lens type and the 6-bit code of the lens (from 000001 to 111110). the 6-bit code is read from left to right looking at the lens from behind. the 6-bit code 000000 is reserved for a non-coded lens and 111111 for future extensions so there are 62 possible encodings. the coding is white=0 and black=1, this way uncoded lenses with a blank bayonet becomes 000000 in case lens detection is left on. the lenscode consists of the lenstype and the 6-bit code. the lenstype for leica m lenses is 01 if detected and 00 if undetected (=old leica or other manufacturer). the lenscode is the 6-bit code shifted two positions left and the lenstype added. example: trielmar mate 28-35-50 is 6-bit=101010 of type leica=01. shift two positions left and add 00000001 yields 10101001. read this as binary to obtain 169 as the lenscode. note: if lens detection + iv/ur is on, the lenscode 65 (tri-elmar wate 16-18-21) brings up the focal length selection dialogue even in diagnostic mode due to it being implemented in the software as an interrupt upon lens mounting, not as part of the normal lens code interpretation software function. also note: in the exif makernote data, lenstype is replaced by framelines (00-11). releaseswitch is the state of the shutter release button. four states possible: idle, active, store, release. (if you try release, it will actually record an image…) you find the most popular entry here, numexposures = number of pictures taken. last is the conversion ratio (bvslope) between the d/a readout (of bvintern) and the normalised value. this is calibrated individually to match the body. for example, if bvslope = 36.50 and bvintern raw = 350 yields a normalised ev value of 0.50, then raw = 600 yields 0.50 + (600-350)/36.50 = 7.35 rounded to the nearest quarter = 7.25. (real numbers are shown in german, using ‘,’ instead of ‘.’ for the decimal point). exit body debug data by pressing set. production test here you can test all the switches on the body. the red led will blink constantly. in the vf, all display segments flash in a dual pattern. pressing buttons will be echoed on the graphic of the body on the display. 6 back buttons, 4 directional buttons. the thumbwheel will be seen as an arrow up or down depending on the direction rotated. the power switch will display its state (same as in body debug data: off, single, continous, selftimer). the shutter speed dial will display its state (same as in body debug data: auto, bulb, simple (m8.2 only), or manual which shows as m plus the speed). the shutter release is shown in colour for the four states possible: idle=green, active=orange, store=red, release=disappears. (if you press to release, it will not record an image here.) the sd card detection switch is displayed as a white “card” below the directional pad if a card is inserted. the bottom lid switch is displayed as an extra underlining under the graphic of the body if the lid is in place. finally, you find the test of the landscape/portrait switch which shows as a white square in the graphic “screen” showing one of its three positions together with a funny sound. exit by power off. sensor test initially displays the lenscode (explained above), the name of the lens (in german spelling: “objektiv name”) and its lens data and leica parts number (but “uncoded” in english if lenstype=00 such as zeiss, voigtlander and uncoded leica) plus the bodyaperture from body debug data. for example “objektiv name: 4/16-18-21 11626” or “objektiv name: 2.0/50; 11819/11825/11826/11816”. inconsistent, some with half-stop after focal length, some not. some with decimal f-stop, some not. do not run this test. exit by pressing set. display test tests all pixels on the lcd screen. cycles through 6 screens by pressing the left and right arrow buttons. white, black, red, green, blue, white with frame. exit by pressing the shutter release. eeprom check performs a test of the eeprom on entry. writes a test data pattern, reads the data, compares the data read to what was written. displays a green square for each successful step, a red square for a failed step. overwrites essential data in memory. you should exit by power off, not by pressing the release button to take a picture. hardware ids ccd id: 0 = kodak kaf-10500 ccd, the only one used in m8 / m8.2. ccd board id: there are three ccd board versions, 0-2, all introduced during m8. no change for m8.2. control board id: only one version = 0. m16c id: only one flash memory version = 0. exit by pressing the shutter release. bf status on/off toggles showing the blackfin dsp operation status on the display or not. shows read/write operations at the top and the auto white balance plus exposure value at the bottom of the screen. shows the read/write operations of the color channels in real time as an image is processed after the shutter closes. bars grow from left to right as each image completes. they are in blue if the read/write goes on without interruption and in red if there is an error (for example due to overruns or processor congestion). this mode remains active until set off. no exiting as this is a toggle switch. two channel corr. off (on) the ccd readout can be made in different ways/modes yielding different levels of noise and/or risk of banding. there is a correction function to minimise the effect without reducing speed. which is normally activated. this function toggles the correction on and off by pressing set. i’m sorry there is very little documentation on this, not used during service. if i find out more, i will edit this post. finally, note that the service menu is called up by the info button that normally starts the guide function in the stupid (sorry, meant simple) mode. when these two collide, the service menu takes precedence due to its implementation overriding the button interpretation function. hope this does help. play at your own risk.", "sortedWord": "None", "identifyer": 45995, "year": "2013"}, {"Unnamed: 0": 405656, "autor": "IWC Doppel", "date": 1377502320000, "content": "Hi all, I'm after some advice and help. Well I'm having fun with my 18mm and have managed to source a Leica 18mm viewfinder. This solves the guessing problem with my 21/25 which was in the too difficult box.. But I just haven't been overly impressed with the viewfinder. I have to be really careful with the position of my eye as slightly off centre and the image becomes blurred. It also flares terribly and I am finding it disappointing to use in comparison to my Voigtlander 21/25. I'm wondering if there might be a problem with my secondhand viewfinder. When I'm back from hols ill head into London and pop into Mayfair but any thoughts would be appreciated I remember months back trying the viewfinder and thought it was really nice when I tried it in Mayfair", "link": "https://www.l-camera-forum.com/topic/200674-18mm-super-elmar/page/2/?tab=comments#comment-2405512", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi all, i'm after some advice and help. well i'm having fun with my 18mm and have managed to source a leica 18mm viewfinder. this solves the guessing problem with my 21/25 which was in the too difficult box.. but i just haven't been overly impressed with the viewfinder. i have to be really careful with the -----> position !!!  of my eye as slightly off centre and the image becomes blurred. it also flares terribly and i am finding it disappointing to use in comparison to my voigtlander 21/25. i'm wondering if there might be a problem with my secondhand viewfinder. when i'm back from hols ill head into london and pop into mayfair but any thoughts would be appreciated i remember months back trying the viewfinder and thought it was really nice when i tried it in mayfair", "sortedWord": "None", "identifyer": 18423, "year": "2013"}, {"Unnamed: 0": 449794, "autor": "barjohn", "date": 1377099180000, "content": "The following is my Leica X Vario Test Plan for this evening: LEICA X VARIO TEST PLAN The Leica X Vario (XV) has seen numerous reports by users to exhibit erratic focusing and white balance behaviors. The purpose of this test plan is to attempt to conduct controlled sets of tests to determine if these observations are caused by human error or by anomalies in the camera’s firmware. Additionally, the tests will attempt to discern whether the anomalies observed are random in nature or repeatable under a given scenario such that they could be easily corrected by a firmware update. Focus tests will be conducted using two types of focus targets. One will be the standard ruler test where a ruler is photographed with a specified point on the ruler as the focus target and the other will be a large photograph of a human face where the eye will be the focus target. The WB tests will consist of shooting a blank grey wall under two different lighting scenarios, low light and brightly lit conditions. The same test will be repeated using a white target that fills the frame. The camera will be mounted on a tripod so that its position and movement is fixed and cannot be attributed to be the cause of any anomalies that may occur. Only one variable will be altered per test and each test will be repeated 3 times. The variables to be tested are: 1. Focal length (28mm, 35mm, 50mm and 70mm) 2. Shutter speed (1/30, 1/125) 3. ISO (100, Auto) The variables to be left constant are: 1. Distance to target of 3’ 2. Aperture (A) Testing all combination with no repeats will require 56 individual tests repeated four times, twice for focus and twice for WB for a total of 224 tests. If an anomaly is encountered, the test will be repeated to determine if it is a random event or a repeatable event. Prior to repeating the test, testing would continue for at least two tests where the condition did not arise and then the failed test would be repeated to discern whether it was a random event or a repeatable one. Comments or suggestions welcome. Edited August 21, 2013 by barjohn", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/?tab=comments#comment-2402411", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the following is my leica x vario test plan for this evening: leica x vario test plan the leica x vario (xv) has seen numerous reports by users to exhibit erratic focusing and white balance behaviors. the purpose of this test plan is to attempt to conduct controlled sets of tests to determine if these observations are caused by human error or by anomalies in the camera’s firmware. additionally, the tests will attempt to discern whether the anomalies observed are random in nature or repeatable under a given scenario such that they could be easily corrected by a firmware update. focus tests will be conducted using two types of focus targets. one will be the standard ruler test where a ruler is photographed with a specified point on the ruler as the focus target and the other will be a large photograph of a human face where the eye will be the focus target. the wb tests will consist of shooting a blank grey wall under two different lighting scenarios, low light and brightly lit conditions. the same test will be repeated using a white target that fills the frame. the camera will be mounted on a tripod so that its -----> position !!!  and movement is fixed and cannot be attributed to be the cause of any anomalies that may occur. only one variable will be altered per test and each test will be repeated 3 times. the variables to be tested are: 1. focal length (28mm, 35mm, 50mm and 70mm) 2. shutter speed (1/30, 1/125) 3. iso (100, auto) the variables to be left constant are: 1. distance to target of 3’ 2. aperture (a) testing all combination with no repeats will require 56 individual tests repeated four times, twice for focus and twice for wb for a total of 224 tests. if an anomaly is encountered, the test will be repeated to determine if it is a random event or a repeatable event. prior to repeating the test, testing would continue for at least two tests where the condition did not arise and then the failed test would be repeated to discern whether it was a random event or a repeatable one. comments or suggestions welcome. edited august 21, 2013 by barjohn", "sortedWord": "None", "identifyer": 13285, "year": "2013"}, {"Unnamed: 0": 449797, "autor": "waloszek", "date": 1377106920000, "content": "I would like to join the focus and WB issues reports. Usually, my unsharp photos are \"operator errors\", but there are also a few unsharp photos that surprise me -- luckily these are only very few. Below you will find a recent example, where one photo is unsharp and a very similar one is sharp (there is a slight difference in focal length, position, and distance). I used GraphicConverter to inspect the EXIF data, and interestingly the distance (described as hyperfocal distance) seems to be correct for the fuzzy photo. This might explain why there focus confirmation was green (as far as I remember... But otherwise I would not have taken the shot). Here are the two photos side-by-side with the respective section of the EXIF data: --img--  Maybe, this information hints already where to search for the problem... From time to time, I also have shifts in white balance (using auto WB), but I experienced this issue with other cameras, as well. Regrettably, I do not have two similar photos available at the moment that would demonstrate this issue convincingly... Best regards, Gerd", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/?tab=comments#comment-2402490", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i would like to join the focus and wb issues reports. usually, my unsharp photos are \"operator errors\", but there are also a few unsharp photos that surprise me -- luckily these are only very few. below you will find a recent example, where one photo is unsharp and a very similar one is sharp (there is a slight difference in focal length, -----> position !!! , and distance). i used graphicconverter to inspect the exif data, and interestingly the distance (described as hyperfocal distance) seems to be correct for the fuzzy photo. this might explain why there focus confirmation was green (as far as i remember... but otherwise i would not have taken the shot). here are the two photos side-by-side with the respective section of the exif data: --img--  maybe, this information hints already where to search for the problem... from time to time, i also have shifts in white balance (using auto wb), but i experienced this issue with other cameras, as well. regrettably, i do not have two similar photos available at the moment that would demonstrate this issue convincingly... best regards, gerd", "sortedWord": "None", "identifyer": 13288, "year": "2013"}], "name": "positionL-Forum2013"}