{"interestingcomments": [{"Unnamed: 0": 353533, "autor": "ECohen", "date": 1458314400000, "content": " \"Perfect - if you get the right one\".........\"I couldn't even think about using an M without one....\" yep I agree with these statements. I shoot with progressive lenses and you need to hit the right spot......shooting without eye glasses and just the correct diopter slowed me up too much. Its a very personal decision how you \"see\" the focus square. For me once I figured out the combination what works best for me ...problem solved. Be careful diopters unscrew on there own.....expensive accessory to lose", "link": "https://www.l-camera-forum.com/topic/258125-leica-dioptre/?tab=comments#comment-3009786", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " \"perfect - if you get the right one\".........\"i couldn't even think about using an m without one....\" yep i agree with these statements. i shoot with progressive lenses and you need to hit the right -----> spot !!! ......shooting without eye glasses and just the correct diopter slowed me up too much. its a very personal decision how you \"see\" the focus square. for me once i figured out the combination what works best for me ...problem solved. be careful diopters unscrew on there own.....expensive accessory to lose", "sortedWord": "None", "identifyer": 14686, "year": "2016"}, {"Unnamed: 0": 353555, "autor": "ECohen", "date": 1458403140000, "content": "I took up this very subject with the forum when I first got my M. I also took this up with my eye doc bringing him the camera and explaining exactly what I needed to know . He did some calculations talked a little BS the gave me a number that didn't work. Having my glass made the same week I asked the same question to them. Her number was different and correct.....although I think it was luck.....When I say correct I mean I could work with it. This subject if not as cut and dry to the average photographer trusting an eye doc that doesn't care about photography.......my question really threw off my doc, I could tell he didn't want to be bothered. I think with all this confusion,the only way to get an accurate number is to go into the Leica store and try them. Also being past 60 my eyes are different in the morning than in the evening. The problem with having the wrong # is your eyes get tired quicker....at least for me. I currently have a system that works, I know its not the perfect #. I use a dioptor on the camera and focus through my glasses and most of the time I hit the correct spot (on my progressive glasses). Without my glasses I cant seem to find the correct #. See attached: So what dioptor do I need without glasses? If I choose to shoot through my glasses what would the best # be? --img--  Edited March 19, 2016 by ECohen", "link": "https://www.l-camera-forum.com/topic/258125-leica-dioptre/page/2/?tab=comments#comment-3010399", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i took up this very subject with the forum when i first got my m. i also took this up with my eye doc bringing him the camera and explaining exactly what i needed to know . he did some calculations talked a little bs the gave me a number that didn't work. having my glass made the same week i asked the same question to them. her number was different and correct.....although i think it was luck.....when i say correct i mean i could work with it. this subject if not as cut and dry to the average photographer trusting an eye doc that doesn't care about photography.......my question really threw off my doc, i could tell he didn't want to be bothered. i think with all this confusion,the only way to get an accurate number is to go into the leica store and try them. also being past 60 my eyes are different in the morning than in the evening. the problem with having the wrong # is your eyes get tired quicker....at least for me. i currently have a system that works, i know its not the perfect #. i use a dioptor on the camera and focus through my glasses and most of the time i hit the correct -----> spot !!!  (on my progressive glasses). without my glasses i cant seem to find the correct #. see attached: so what dioptor do i need without glasses? if i choose to shoot through my glasses what would the best # be? --img--  edited march 19, 2016 by ecohen", "sortedWord": "None", "identifyer": 14708, "year": "2016"}, {"Unnamed: 0": 353619, "autor": "scott kirkpatrick", "date": 1460014020000, "content": "Hmmm. I'm in a different category. My basic corrections go the other way. -0.25 on the left and -1.75 on the right. (Far-sighted, I guess, with better vision on the left, although I use my right eye with a camera.) Reading correction is age-appropriate: +3. But when I did more flying, trying to spot a small airplane at 5 miles and read panel steam gauges in turbulence at 18 inches got complicated. And I gather the virtual image in a camera's EVF is at about six feet? scott", "link": "https://www.l-camera-forum.com/topic/258125-leica-dioptre/page/5/?tab=comments#comment-3021962", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hmmm. i'm in a different category. my basic corrections go the other way. -0.25 on the left and -1.75 on the right. (far-sighted, i guess, with better vision on the left, although i use my right eye with a camera.) reading correction is age-appropriate: +3. but when i did more flying, trying to -----> spot !!!  a small airplane at 5 miles and read panel steam gauges in turbulence at 18 inches got complicated. and i gather the virtual image in a camera's evf is at about six feet? scott", "sortedWord": "None", "identifyer": 14772, "year": "2016"}, {"Unnamed: 0": 353620, "autor": "jonoslack", "date": 1460023680000, "content": "But when I did more flying, trying to spot a small airplane at 5 miles and read panel steam gauges in turbulence at 18 inches got complicated. And I gather the virtual image in a camera's EVF is at about six feet? scott I wasn't suggesting it would work necessarily, just that if, as Rick suggests, mono vision is the best solution, then it would certainly be worth trying. Added to which, that scenario would seem to me to be one where it does work really well. ie looking at your LCD for chimping from 18\" and then looking at a subject nesr infinity.", "link": "https://www.l-camera-forum.com/topic/258125-leica-dioptre/page/5/?tab=comments#comment-3022046", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "but when i did more flying, trying to -----> spot !!!  a small airplane at 5 miles and read panel steam gauges in turbulence at 18 inches got complicated. and i gather the virtual image in a camera's evf is at about six feet? scott i wasn't suggesting it would work necessarily, just that if, as rick suggests, mono vision is the best solution, then it would certainly be worth trying. added to which, that scenario would seem to me to be one where it does work really well. ie looking at your lcd for chimping from 18\" and then looking at a subject nesr infinity.", "sortedWord": "None", "identifyer": 14773, "year": "2016"}, {"Unnamed: 0": 354794, "autor": "Leicabuff", "date": 1466015160000, "content": " I was watching the Leica videos on Vimeo yesterday and remembered one annoying issue I had very often, which is: After taking a photo and press the \"PLAY\" button and then \"Zoom In\" to check the photo for details, it becomes \"Extremely Slow\" to navigate/scroll through the photo. It moves so SLOW up or down that I have to zoom out and go to the spot (e.g. Face) I want to check and then zoom in again to check the sharpness of the eye. Does anyone know this issue? Does it have anything to do with my SD cards or is it the RAM installed in the camera faulty or slow? Unfortunately I reported the issue today to Leica, while receiving the repair confirmation order from Wetzler to change the faulty shutter for my M-P. I mean, the good thing is the camera is in Wetzler/Germany but I hope that won't slow the repair process. Edited June 15, 2016 by Leicabuff", "link": "https://www.l-camera-forum.com/topic/261603-slow-navigationscrolling-through-the-zoomed-in-photos/?tab=comments#comment-3062109", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " i was watching the leica videos on vimeo yesterday and remembered one annoying issue i had very often, which is: after taking a photo and press the \"play\" button and then \"zoom in\" to check the photo for details, it becomes \"extremely slow\" to navigate/scroll through the photo. it moves so slow up or down that i have to zoom out and go to the -----> spot !!!  (e.g. face) i want to check and then zoom in again to check the sharpness of the eye. does anyone know this issue? does it have anything to do with my sd cards or is it the ram installed in the camera faulty or slow? unfortunately i reported the issue today to leica, while receiving the repair confirmation order from wetzler to change the faulty shutter for my m-p. i mean, the good thing is the camera is in wetzler/germany but i hope that won't slow the repair process. edited june 15, 2016 by leicabuff", "sortedWord": "None", "identifyer": 15952, "year": "2016"}, {"Unnamed: 0": 356530, "autor": "bocaburger", "date": 1459563600000, "content": "Same as Jaapv here. Been using Leicas since around 1970. I can't even recall how many I've had, pretty much one of every model and pairs of a few, plus a few screwmounts. Lenses, I have over a dozen at present, and have bought and sold at least three dozen over the years. In that entire time I have had one body and 2 lenses which needed adjustment. The body was an M9, which arrived new in the box with a totally maladjusted rangefinder. Once I put it right myself it stayed that way for the duration. The lenses were a tabbed 50 Summicron and an old version 135 T-E. Both were bought used and both have been spot on since being adjusted to specs.", "link": "https://www.l-camera-forum.com/topic/259865-the-leica-m-d-thread-merged/page/5/?tab=comments#comment-3018971", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "same as jaapv here. been using leicas since around 1970. i can't even recall how many i've had, pretty much one of every model and pairs of a few, plus a few screwmounts. lenses, i have over a dozen at present, and have bought and sold at least three dozen over the years. in that entire time i have had one body and 2 lenses which needed adjustment. the body was an m9, which arrived new in the box with a totally maladjusted rangefinder. once i put it right myself it stayed that way for the duration. the lenses were a tabbed 50 summicron and an old version 135 t-e. both were bought used and both have been -----> spot !!!  on since being adjusted to specs.", "sortedWord": "None", "identifyer": 17696, "year": "2016"}, {"Unnamed: 0": 356587, "autor": "JonPB", "date": 1461283200000, "content": "I honestly don't understand why checking your work is considered a bad practice? I've got an open mind and can see there are enough of you on this threat ......Help me out. As others have said, this is an issue that applies differently to different photographers. But, since you asked, chimping allows me to review the exposure and framing from each shot. With exposure, chimping helps me see whether I'm clipping important highlights (and how much contrast there is in a scene when I might want to stop down and thereby increase internal reflections and boost the blacks on lenses that behave that way). After using my camera for a while, I'm comfortable with how the meter usually operates so that I can visualize which scenes will require manual intervention before I raise the camera to my eye in the first place; therefore, chimping is only useful in a few edge cases for me, and I can walk away from those images (or manipulate them appropriately in post if the image warrants it, which they never yet have). For framing from shot to shot, chimping requires moving the camera away from the eye; therefore, the camera is no longer in the same spot; therefore, precise framing is unlikely to be achieved; therefore, chimping has little value to me. Again, there are edge cases where boundary subjects are important and need to be balanced, but then I know this, balance them, and take the picture. For studio work, especially work that requires thin depth of field and/or multiple and precise lighting sources, I can see chimping as an invaluable asset. For anyone getting paid to create images: yes, being able to review in seconds rather than minutes can make all the difference between \"professional\" and \"amateur.\" I make no argument that others should be willing to walk away from chimping. Personally, though, for how I shoot, if a camera only had enough of a display for menu options, I'd be fine; but then, might as well add a review screen, and then you get to the M9, which is what I (happily) shoot. I use the screen to set ISO (obviated by the Edition 60's wheel), check battery life, play with menu options (because I'm of the Nintendo generation and that's what I do), and occasionally review images in the field when I'm not sure what my eye is telling me. (Not to say that my eye is neigh on infallible; it isn't, by a long shot; just, I'm not aware of its failings as much as I'd like to be, so I don't know when I really ought to have chimped that last shot.) In other words, chimping for me isn't just unnecessary, it is a distraction. I adore the \"flow\" that the window-finder helps me achieve in relation to a subject, particularly moving subjects. Reviewing images, whether on Polaroid, tethered, or the back of the camera, simply breaks that continuity. My images seem to be, and my experience of shooting definitely is, superior when I disregard what I've already done and simply focus on what I want to do next. I hope that contained a sufficient number of caveats, yet was still useful. I'd be happy to read replies as to how I'm off my rocker from those who disagree. :-) One of the beautiful things about being a fan of photographic gear is that I get to learn how other people have put their gear to different or even better use than I do. Cheers, Jon", "link": "https://www.l-camera-forum.com/topic/259865-the-leica-m-d-thread-merged/page/8/?tab=comments#comment-3031049", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i honestly don't understand why checking your work is considered a bad practice? i've got an open mind and can see there are enough of you on this threat ......help me out. as others have said, this is an issue that applies differently to different photographers. but, since you asked, chimping allows me to review the exposure and framing from each shot. with exposure, chimping helps me see whether i'm clipping important highlights (and how much contrast there is in a scene when i might want to stop down and thereby increase internal reflections and boost the blacks on lenses that behave that way). after using my camera for a while, i'm comfortable with how the meter usually operates so that i can visualize which scenes will require manual intervention before i raise the camera to my eye in the first place; therefore, chimping is only useful in a few edge cases for me, and i can walk away from those images (or manipulate them appropriately in post if the image warrants it, which they never yet have). for framing from shot to shot, chimping requires moving the camera away from the eye; therefore, the camera is no longer in the same -----> spot !!! ; therefore, precise framing is unlikely to be achieved; therefore, chimping has little value to me. again, there are edge cases where boundary subjects are important and need to be balanced, but then i know this, balance them, and take the picture. for studio work, especially work that requires thin depth of field and/or multiple and precise lighting sources, i can see chimping as an invaluable asset. for anyone getting paid to create images: yes, being able to review in seconds rather than minutes can make all the difference between \"professional\" and \"amateur.\" i make no argument that others should be willing to walk away from chimping. personally, though, for how i shoot, if a camera only had enough of a display for menu options, i'd be fine; but then, might as well add a review screen, and then you get to the m9, which is what i (happily) shoot. i use the screen to set iso (obviated by the edition 60's wheel), check battery life, play with menu options (because i'm of the nintendo generation and that's what i do), and occasionally review images in the field when i'm not sure what my eye is telling me. (not to say that my eye is neigh on infallible; it isn't, by a long shot; just, i'm not aware of its failings as much as i'd like to be, so i don't know when i really ought to have chimped that last shot.) in other words, chimping for me isn't just unnecessary, it is a distraction. i adore the \"flow\" that the window-finder helps me achieve in relation to a subject, particularly moving subjects. reviewing images, whether on polaroid, tethered, or the back of the camera, simply breaks that continuity. my images seem to be, and my experience of shooting definitely is, superior when i disregard what i've already done and simply focus on what i want to do next. i hope that contained a sufficient number of caveats, yet was still useful. i'd be happy to read replies as to how i'm off my rocker from those who disagree. :-) one of the beautiful things about being a fan of photographic gear is that i get to learn how other people have put their gear to different or even better use than i do. cheers, jon", "sortedWord": "None", "identifyer": 17754, "year": "2016"}, {"Unnamed: 0": 356590, "autor": "ECohen", "date": 1461285060000, "content": " As others have said, this is an issue that applies differently to different photographers. But, since you asked, chimping allows me to review the exposure and framing from each shot. With exposure, chimping helps me see whether I'm clipping important highlights (and how much contrast there is in a scene when I might want to stop down and thereby increase internal reflections and boost the blacks on lenses that behave that way). After using my camera for a while, I'm comfortable with how the meter usually operates so that I can visualize which scenes will require manual intervention before I raise the camera to my eye in the first place; therefore, chimping is only useful in a few edge cases for me, and I can walk away from those images (or manipulate them appropriately in post if the image warrants it, which they never yet have). For framing from shot to shot, chimping requires moving the camera away from the eye; therefore, the camera is no longer in the same spot; therefore, precise framing is unlikely to be achieved; therefore, chimping has little value to me. Again, there are edge cases where boundary subjects are important and need to be balanced, but then I know this, balance them, and take the picture. For studio work, especially work that requires thin depth of field and/or multiple and precise lighting sources, I can see chimping as an invaluable asset. For anyone getting paid to create images: yes, being able to review in seconds rather than minutes can make all the difference between \"professional\" and \"amateur.\" I make no argument that others should be willing to walk away from chimping. Personally, though, for how I shoot, if a camera only had enough of a display for menu options, I'd be fine; but then, might as well add a review screen, and then you get to the M9, which is what I (happily) shoot. I use the screen to set ISO (obviated by the Edition 60's wheel), check battery life, play with menu options (because I'm of the Nintendo generation and that's what I do), and occasionally review images in the field when I'm not sure what my eye is telling me. (Not to say that my eye is neigh on infallible; it isn't, by a long shot; just, I'm not aware of its failings as much as I'd like to be, so I don't know when I really ought to have chimped that last shot.) In other words, chimping for me isn't just unnecessary, it is a distraction. I adore the \"flow\" that the window-finder helps me achieve in relation to a subject, particularly moving subjects. Reviewing images, whether on Polaroid, tethered, or the back of the camera, simply breaks that continuity. My images seem to be, and my experience of shooting definitely is, superior when I disregard what I've already done and simply focus on what I want to do next. I hope that contained a sufficient number of caveats, yet was still useful. I'd be happy to read replies as to how I'm off my rocker from those who disagree. :-) One of the beautiful things about being a fan of photographic gear is that I get to learn how other people have put their gear to different or even better use than I do. Cheers, Jon In other words, chimping for me isn't just unnecessary, it is a distraction. I adore the \"flow\" that the window-finder helps me achieve in relation to a subject, particularly moving subjects. ​Very helpful...next shoot .....I'm turning off the screen ....I've been working this way for so long maybe I don't even notice the distraction? Really good explication ..... Thanks You", "link": "https://www.l-camera-forum.com/topic/259865-the-leica-m-d-thread-merged/page/8/?tab=comments#comment-3031063", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " as others have said, this is an issue that applies differently to different photographers. but, since you asked, chimping allows me to review the exposure and framing from each shot. with exposure, chimping helps me see whether i'm clipping important highlights (and how much contrast there is in a scene when i might want to stop down and thereby increase internal reflections and boost the blacks on lenses that behave that way). after using my camera for a while, i'm comfortable with how the meter usually operates so that i can visualize which scenes will require manual intervention before i raise the camera to my eye in the first place; therefore, chimping is only useful in a few edge cases for me, and i can walk away from those images (or manipulate them appropriately in post if the image warrants it, which they never yet have). for framing from shot to shot, chimping requires moving the camera away from the eye; therefore, the camera is no longer in the same -----> spot !!! ; therefore, precise framing is unlikely to be achieved; therefore, chimping has little value to me. again, there are edge cases where boundary subjects are important and need to be balanced, but then i know this, balance them, and take the picture. for studio work, especially work that requires thin depth of field and/or multiple and precise lighting sources, i can see chimping as an invaluable asset. for anyone getting paid to create images: yes, being able to review in seconds rather than minutes can make all the difference between \"professional\" and \"amateur.\" i make no argument that others should be willing to walk away from chimping. personally, though, for how i shoot, if a camera only had enough of a display for menu options, i'd be fine; but then, might as well add a review screen, and then you get to the m9, which is what i (happily) shoot. i use the screen to set iso (obviated by the edition 60's wheel), check battery life, play with menu options (because i'm of the nintendo generation and that's what i do), and occasionally review images in the field when i'm not sure what my eye is telling me. (not to say that my eye is neigh on infallible; it isn't, by a long shot; just, i'm not aware of its failings as much as i'd like to be, so i don't know when i really ought to have chimped that last shot.) in other words, chimping for me isn't just unnecessary, it is a distraction. i adore the \"flow\" that the window-finder helps me achieve in relation to a subject, particularly moving subjects. reviewing images, whether on polaroid, tethered, or the back of the camera, simply breaks that continuity. my images seem to be, and my experience of shooting definitely is, superior when i disregard what i've already done and simply focus on what i want to do next. i hope that contained a sufficient number of caveats, yet was still useful. i'd be happy to read replies as to how i'm off my rocker from those who disagree. :-) one of the beautiful things about being a fan of photographic gear is that i get to learn how other people have put their gear to different or even better use than i do. cheers, jon in other words, chimping for me isn't just unnecessary, it is a distraction. i adore the \"flow\" that the window-finder helps me achieve in relation to a subject, particularly moving subjects. ​very helpful...next shoot .....i'm turning off the screen ....i've been working this way for so long maybe i don't even notice the distraction? really good explication ..... thanks you", "sortedWord": "None", "identifyer": 17757, "year": "2016"}, {"Unnamed: 0": 356594, "autor": "menos I M6", "date": 1461308520000, "content": "The issue with chimping is not for everyone to be judged by others as per being glued to that LCD screen (who cares really?). For me the problem with chimping is that IT (chimping) is taking over subconsciously and does indeed distract me from the actual process of photographing. It is a weakness of character maybe, that distracts me. With film cameras this issue of course simply does not exist. With some really well designed digital cameras it can be largely ignored but still as long as the possibility of checking up the image on the LCD exists I find myself taking a peek from time to time even though it really gives me nothing. the image I took doesn't magically transmorph into a masterpiece by the act of simply looking at it immediately on the back of my camera - it has already been taken after all! On all my digital cameras, image review is shut off. The very only two photographic disciplines where I do use the benefit of chimping conciously is when doing product shots or when doing motor sports shots but both of them under certain quite strict rules (you don't want to chimp at the racetrack and actually miss an important shot or waste your time chimping instead of getting a move on to the next spot, … For such purposes I do have specialized cameras. The Leica M is not such a camera - I want the Leica M to be as unobtrusive to my process as possible. The very best match so far for this purpose is actually my M7 but I simply do love the output of my old MM yet cannot have that currently without the annoyance of that LCD screen. If Leica will offer a reasonably priced production model of a back to basics digital M that removes all the clutter the M10 generation of cameras have introduced, and make it work like one of my film M bodies, I won't hesitate to buy one. I really do see Leica reasonably diversifying the Leica M lineup with an additional screen- less back to basics model as simply put their slogan \"Das Wesentliche\" used with the M10 generation cameras is simply a straight lie as these cameras do not at all resemble \"Das Wesentliche\" but rather \"Das Kuddelmuddel -iche\".", "link": "https://www.l-camera-forum.com/topic/259865-the-leica-m-d-thread-merged/page/8/?tab=comments#comment-3031158", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the issue with chimping is not for everyone to be judged by others as per being glued to that lcd screen (who cares really?). for me the problem with chimping is that it (chimping) is taking over subconsciously and does indeed distract me from the actual process of photographing. it is a weakness of character maybe, that distracts me. with film cameras this issue of course simply does not exist. with some really well designed digital cameras it can be largely ignored but still as long as the possibility of checking up the image on the lcd exists i find myself taking a peek from time to time even though it really gives me nothing. the image i took doesn't magically transmorph into a masterpiece by the act of simply looking at it immediately on the back of my camera - it has already been taken after all! on all my digital cameras, image review is shut off. the very only two photographic disciplines where i do use the benefit of chimping conciously is when doing product shots or when doing motor sports shots but both of them under certain quite strict rules (you don't want to chimp at the racetrack and actually miss an important shot or waste your time chimping instead of getting a move on to the next -----> spot !!! , … for such purposes i do have specialized cameras. the leica m is not such a camera - i want the leica m to be as unobtrusive to my process as possible. the very best match so far for this purpose is actually my m7 but i simply do love the output of my old mm yet cannot have that currently without the annoyance of that lcd screen. if leica will offer a reasonably priced production model of a back to basics digital m that removes all the clutter the m10 generation of cameras have introduced, and make it work like one of my film m bodies, i won't hesitate to buy one. i really do see leica reasonably diversifying the leica m lineup with an additional screen- less back to basics model as simply put their slogan \"das wesentliche\" used with the m10 generation cameras is simply a straight lie as these cameras do not at all resemble \"das wesentliche\" but rather \"das kuddelmuddel -iche\".", "sortedWord": "None", "identifyer": 17761, "year": "2016"}, {"Unnamed: 0": 356728, "autor": "elgenper", "date": 1461858960000, "content": "Don´t quite get it, after all... I hardly ever \"chimp\", but once in a while it is a boon to be able to see a histogram, or even the image itself, while still on the spot. And since this newcomer isn´t any thinner (that ISO wheel with its innards is probably as thick as a display), I fail to see any significant plus value. A bit more rugged, perhaps, but a big, rotating wheel should be harder to weatherseal than a display w/o moving parts....", "link": "https://www.l-camera-forum.com/topic/259865-the-leica-m-d-thread-merged/page/15/?tab=comments#comment-3035193", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "don´t quite get it, after all... i hardly ever \"chimp\", but once in a while it is a boon to be able to see a histogram, or even the image itself, while still on the -----> spot !!! . and since this newcomer isn´t any thinner (that iso wheel with its innards is probably as thick as a display), i fail to see any significant plus value. a bit more rugged, perhaps, but a big, rotating wheel should be harder to weatherseal than a display w/o moving parts....", "sortedWord": "None", "identifyer": 17896, "year": "2016"}, {"Unnamed: 0": 358695, "autor": "Exodies", "date": 1465769880000, "content": "So, what are the settings you make? For your style of photography, sounds like the M-D would not change your technique at all. More critically, I'm not sure anyone is trying to persuade you to buy this camera. Unless I missed something. Correct, no one is trying to persuade me about anything. I'm trying to get to grips with the appeal of this camera. To decide now that for as long as I use an M I will not want to look at a photograph or histogram or horizon or spot meter or record a movie is outside my world view. I know what I think now, I have no idea what I will think in ten minutes (though it will probably be the same). The fact that you and others can make this choice, buy the camera and live with it is a mystery which if I could understand it would help explain other mysterious behaviours (including some of my own). The settings I make are DNG only, no preview, classic centre weighted meter, 2 second selfie timer.", "link": "https://www.l-camera-forum.com/topic/261262-a-few-comments-based-upon-two-outings-with-the-leica-m-d-type-262-camera/page/2/?tab=comments#comment-3060628", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "so, what are the settings you make? for your style of photography, sounds like the m-d would not change your technique at all. more critically, i'm not sure anyone is trying to persuade you to buy this camera. unless i missed something. correct, no one is trying to persuade me about anything. i'm trying to get to grips with the appeal of this camera. to decide now that for as long as i use an m i will not want to look at a photograph or histogram or horizon or -----> spot !!!  meter or record a movie is outside my world view. i know what i think now, i have no idea what i will think in ten minutes (though it will probably be the same). the fact that you and others can make this choice, buy the camera and live with it is a mystery which if i could understand it would help explain other mysterious behaviours (including some of my own). the settings i make are dng only, no preview, classic centre weighted meter, 2 second selfie timer.", "sortedWord": "None", "identifyer": 19874, "year": "2016"}, {"Unnamed: 0": 358696, "autor": "IkarusJohn", "date": 1465775160000, "content": "Correct, no one is trying to persuade me about anything. I'm trying to get to grips with the appeal of this camera. To decide now that for as long as I use an M I will not want to look at a photograph or histogram or horizon or spot meter or record a movie is outside my world view. I know what I think now, I have no idea what I will think in ten minutes (though it will probably be the same). The fact that you and others can make this choice, buy the camera and live with it is a mystery which if I could understand it would help explain other mysterious behaviours (including some of my own). The settings I make are DNG only, no preview, classic centre weighted meter, 2 second selfie timer. The self-timer/cable release was the only thing which bothered me about the M Edition 60, after I'd worked through all the menu options and realised that with DNG only output, I didn't need any of it. I don't really agree that the M-D is all about not chimping. There's more to it than that, but when it comes down to it, not being able to check the histogram etc is really the biggest difference in practice. I do find myself checking photos after the event (long after, rather than after each shot) with my Monochrom and SL, but that is curiosity more than anything (like Peter H, wanting to see what I've taken). When walking about with a camera, I want the camera to be ready set how I want it, and to be able to raise the camera, take the picture and move on, thinking about the next shot - the M60 works very well for me in this way. Not having a self timer or cable release (the M-D does have a threaded shutter release) means I don't use a tripod with this camera - to be honest, that's no loss as the SL is a better choice in this respect. Cheers John", "link": "https://www.l-camera-forum.com/topic/261262-a-few-comments-based-upon-two-outings-with-the-leica-m-d-type-262-camera/page/2/?tab=comments#comment-3060651", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "correct, no one is trying to persuade me about anything. i'm trying to get to grips with the appeal of this camera. to decide now that for as long as i use an m i will not want to look at a photograph or histogram or horizon or -----> spot !!!  meter or record a movie is outside my world view. i know what i think now, i have no idea what i will think in ten minutes (though it will probably be the same). the fact that you and others can make this choice, buy the camera and live with it is a mystery which if i could understand it would help explain other mysterious behaviours (including some of my own). the settings i make are dng only, no preview, classic centre weighted meter, 2 second selfie timer. the self-timer/cable release was the only thing which bothered me about the m edition 60, after i'd worked through all the menu options and realised that with dng only output, i didn't need any of it. i don't really agree that the m-d is all about not chimping. there's more to it than that, but when it comes down to it, not being able to check the histogram etc is really the biggest difference in practice. i do find myself checking photos after the event (long after, rather than after each shot) with my monochrom and sl, but that is curiosity more than anything (like peter h, wanting to see what i've taken). when walking about with a camera, i want the camera to be ready set how i want it, and to be able to raise the camera, take the picture and move on, thinking about the next shot - the m60 works very well for me in this way. not having a self timer or cable release (the m-d does have a threaded shutter release) means i don't use a tripod with this camera - to be honest, that's no loss as the sl is a better choice in this respect. cheers john", "sortedWord": "None", "identifyer": 19875, "year": "2016"}, {"Unnamed: 0": 360228, "autor": "convexferret", "date": 1473533940000, "content": " --img--  Taken today in the Scottish National Portrait Gallery. My first serious image with a Monochrom. And, given that I don't want to create another thread I'll add a few comments on my first day with the camera. As a photographer I've had an M4-2 and some other Leica kit since the late 90s. Since digital took over I've been using more conventional kit, A Canon 5D III and now a Sony A7 II. It was trying out some of my Leica and Voigtlander lenses on the latter and seeing how good and how bad they could be that convinced me finally to return to my roots. On Friday a brand new 246 arrived at my door and I've not stopped shooting since. Rather than writing an in depth review I'll just run through some points. The camera is dense And because it doesn't have a grip a-la the typical DSLR, I've found myself suffering from tired fingers. I usually prefer a wrist strap so I'll just have to get used to this. Image review on holding shutter button Is a work of genius. I usually don't chimp every picture but given the metering system and highlight clipping sensitivity I've been spending much more time than normal staring at the back screen. The screen is dark, very dark I tried automatic but now have brightness on high. Images are very dim and I struggle to see any detail below approx zone 4. I'm wondering if this is just me? Where is the noise? I'm travelling right now and so have nothing to compare it with, but I'm happy to use ISO 25600 for anything short of a shot requiring extreme detail. The noise is that fine. I usually add light grain in Silver Efex and even my conservative setting masks any noise from the camera. Highlight clipping is dangerous I'm back in the world of transparencies. Having been used to EVFs or at least colour files with recoverable highlights I now have to judge my exposures that little bit more carefully. A lack of familiarity with the meter and the previously mentioned dark screen means that I'm relying heavily on 1/255 clipping indicators and the thankfully very accurate histogram. This just means a few tries at the moment for any image with bright skies. Live view is wonderful for diagnosing RF problems I only have 3 Voigtlander lenses with me, my Summicrons are at home. I ran through the 3 comparing live view and RF at infinity and close focus. My 50mm f1.5 and 90mm f3.5 are very sharp and spot on throughout the range. My 28mm f1.9 is fine at infinity but miles off (1/3 RF patch width) at 1 meter. I'll need to get that seen to. At least I've not lost any photos finding this out and can be confident that any problems can be quickly dignosed, unlike with film or older digital cameras The included strap Is fine, but the stiff rubber bit for the shoulder precludes it from wrapping around my wrist properly. I'm putting on a wrist strap right now.. The box it came in Would make a fine jewelry dresser. Todays photos Were not my best, but that's not the camera's fault. And I got a couple I'm very happy with. Most importantly the images are sharp and noise-free, and I had fun. Nobody spotted me I spent the day wandering around the centre of tourist-infested Edinburgh with the camera in hand or on shoulder. From other threads I was expecting a rush of respectful nods and Freemason-like secret handshakes. I'm only partially relieved. Maybe I should invest in a red dot? Edited September 10, 2016 by convexferret", "link": "https://www.l-camera-forum.com/topic/280481-m246-image-thread/page/11/?tab=comments#comment-3110003", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " --img--  taken today in the scottish national portrait gallery. my first serious image with a monochrom. and, given that i don't want to create another thread i'll add a few comments on my first day with the camera. as a photographer i've had an m4-2 and some other leica kit since the late 90s. since digital took over i've been using more conventional kit, a canon 5d iii and now a sony a7 ii. it was trying out some of my leica and voigtlander lenses on the latter and seeing how good and how bad they could be that convinced me finally to return to my roots. on friday a brand new 246 arrived at my door and i've not stopped shooting since. rather than writing an in depth review i'll just run through some points. the camera is dense and because it doesn't have a grip a-la the typical dslr, i've found myself suffering from tired fingers. i usually prefer a wrist strap so i'll just have to get used to this. image review on holding shutter button is a work of genius. i usually don't chimp every picture but given the metering system and highlight clipping sensitivity i've been spending much more time than normal staring at the back screen. the screen is dark, very dark i tried automatic but now have brightness on high. images are very dim and i struggle to see any detail below approx zone 4. i'm wondering if this is just me? where is the noise? i'm travelling right now and so have nothing to compare it with, but i'm happy to use iso 25600 for anything short of a shot requiring extreme detail. the noise is that fine. i usually add light grain in silver efex and even my conservative setting masks any noise from the camera. highlight clipping is dangerous i'm back in the world of transparencies. having been used to evfs or at least colour files with recoverable highlights i now have to judge my exposures that little bit more carefully. a lack of familiarity with the meter and the previously mentioned dark screen means that i'm relying heavily on 1/255 clipping indicators and the thankfully very accurate histogram. this just means a few tries at the moment for any image with bright skies. live view is wonderful for diagnosing rf problems i only have 3 voigtlander lenses with me, my summicrons are at home. i ran through the 3 comparing live view and rf at infinity and close focus. my 50mm f1.5 and 90mm f3.5 are very sharp and -----> spot !!!  on throughout the range. my 28mm f1.9 is fine at infinity but miles off (1/3 rf patch width) at 1 meter. i'll need to get that seen to. at least i've not lost any photos finding this out and can be confident that any problems can be quickly dignosed, unlike with film or older digital cameras the included strap is fine, but the stiff rubber bit for the shoulder precludes it from wrapping around my wrist properly. i'm putting on a wrist strap right now.. the box it came in would make a fine jewelry dresser. todays photos were not my best, but that's not the camera's fault. and i got a couple i'm very happy with. most importantly the images are sharp and noise-free, and i had fun. nobody spotted me i spent the day wandering around the centre of tourist-infested edinburgh with the camera in hand or on shoulder. from other threads i was expecting a rush of respectful nods and freemason-like secret handshakes. i'm only partially relieved. maybe i should invest in a red dot? edited september 10, 2016 by convexferret", "sortedWord": "None", "identifyer": 21441, "year": "2016"}, {"Unnamed: 0": 360229, "autor": "Giulio Zanni", "date": 1473535620000, "content": "Taken today in the Scottish National Portrait Gallery. My first serious image with a Monochrom. And, given that I don't want to create another thread I'll add a few comments on my first day with the camera. As a photographer I've had an M4-2 and some other Leica kit since the late 90s. Since digital took over I've been using more conventional kit, A Canon 5D III and now a Sony A7 II. It was trying out some of my Leica and Voigtlander lenses on the latter and seeing how good and how bad they could be that convinced me finally to return to my roots. On Friday a brand new 246 arrived at my door and I've not stopped shooting since. Rather than writing an in depth review I'll just run through some points. The camera is dense And because it doesn't have a grip a-la the typical DSLR, I've found myself suffering from tired fingers. I usually prefer a wrist strap so I'll just have to get used to this. Image review on holding shutter button Is a work of genius. I usually don't chimp every picture but given the metering system and highlight clipping sensitivity I've been spending much more time than normal staring at the back screen. The screen is dark, very dark I tried automatic but now have brightness on high. Images are very dim and I struggle to see any detail below approx zone 4. I'm wondering if this is just me? Where is the noise? I'm travelling right now and so have nothing to compare it with, but I'm happy to use ISO 25600 for anything short of a shot requiring extreme detail. The noise is that fine. I usually add light grain in Silver Efex and even my conservative setting masks any noise from the camera. Highlight clipping is dangerous I'm back in the world of transparencies. Having been used to EVFs or at least colour files with recoverable highlights I now have to judge my exposures that little bit more carefully. A lack of familiarity with the meter and the previously mentioned dark screen means that I'm relying heavily on 1/255 clipping indicators and the thankfully very accurate histogram. This just means a few tries at the moment for any image with bright skies. Live view is wonderful for diagnosing RF problems I only have 3 Voigtlander lenses with me, my Summicrons are at home. I ran through the 3 comparing live view and RF at infinity and close focus. My 50mm f1.5 and 90mm f3.5 are very sharp and spot on throughout the range. My 28mm f1.9 is fine at infinity but miles off (1/3 RF patch width) at 1 meter. I'll need to get that seen to. At least I've not lost any photos finding this out and can be confident that any problems can be quickly dignosed, unlike with film or older digital cameras The included strap Is fine, but the stiff rubber bit for the shoulder precludes it from wrapping around my wrist properly. I'm putting on a wrist strap right now.. The box it came in Would make a fine jewelry dresser. Todays photos Were not my best, but that's not the camera's fault. And I got a couple I'm very happy with. Most importantly the images are sharp and noise-free, and I had fun. Nobody spotted me I spent the day wandering around the centre of tourist-infested Edinburgh with the camera in hand or on shoulder. From other threads I was expecting a rush of respectful nods and Freemason-like secret handshakes. I'm only partially relieved. Maybe I should invest in a red dot? The 246 is a great camera. I have two of them! My only grief is the 1 minute maximum exposure. It will grow on you. Just keep an eye on the histogram and I didn't find the highlights to be much of a problem, just shoot conservative, like -0.3. I don't find the screen to be particularly dark rather than having a sepia cast. I replaced the straps with an Annie Barton braided pitch black strap, the more sexy strap in the world to me. I do use the EVF a lot and, for what I do, is good enough. Leica glass it's why we bought into Leica, isn't it? That's what it will drain your bank account. As for the grip, I am getting the multifunctional grip, hoping to get one where the gps works properly. In the future you can post bigger files, I resize to long size 1024 and is good for the forum. Keep it coming. Edited September 10, 2016 by Giulio Zanni", "link": "https://www.l-camera-forum.com/topic/280481-m246-image-thread/page/11/?tab=comments#comment-3110018", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "taken today in the scottish national portrait gallery. my first serious image with a monochrom. and, given that i don't want to create another thread i'll add a few comments on my first day with the camera. as a photographer i've had an m4-2 and some other leica kit since the late 90s. since digital took over i've been using more conventional kit, a canon 5d iii and now a sony a7 ii. it was trying out some of my leica and voigtlander lenses on the latter and seeing how good and how bad they could be that convinced me finally to return to my roots. on friday a brand new 246 arrived at my door and i've not stopped shooting since. rather than writing an in depth review i'll just run through some points. the camera is dense and because it doesn't have a grip a-la the typical dslr, i've found myself suffering from tired fingers. i usually prefer a wrist strap so i'll just have to get used to this. image review on holding shutter button is a work of genius. i usually don't chimp every picture but given the metering system and highlight clipping sensitivity i've been spending much more time than normal staring at the back screen. the screen is dark, very dark i tried automatic but now have brightness on high. images are very dim and i struggle to see any detail below approx zone 4. i'm wondering if this is just me? where is the noise? i'm travelling right now and so have nothing to compare it with, but i'm happy to use iso 25600 for anything short of a shot requiring extreme detail. the noise is that fine. i usually add light grain in silver efex and even my conservative setting masks any noise from the camera. highlight clipping is dangerous i'm back in the world of transparencies. having been used to evfs or at least colour files with recoverable highlights i now have to judge my exposures that little bit more carefully. a lack of familiarity with the meter and the previously mentioned dark screen means that i'm relying heavily on 1/255 clipping indicators and the thankfully very accurate histogram. this just means a few tries at the moment for any image with bright skies. live view is wonderful for diagnosing rf problems i only have 3 voigtlander lenses with me, my summicrons are at home. i ran through the 3 comparing live view and rf at infinity and close focus. my 50mm f1.5 and 90mm f3.5 are very sharp and -----> spot !!!  on throughout the range. my 28mm f1.9 is fine at infinity but miles off (1/3 rf patch width) at 1 meter. i'll need to get that seen to. at least i've not lost any photos finding this out and can be confident that any problems can be quickly dignosed, unlike with film or older digital cameras the included strap is fine, but the stiff rubber bit for the shoulder precludes it from wrapping around my wrist properly. i'm putting on a wrist strap right now.. the box it came in would make a fine jewelry dresser. todays photos were not my best, but that's not the camera's fault. and i got a couple i'm very happy with. most importantly the images are sharp and noise-free, and i had fun. nobody spotted me i spent the day wandering around the centre of tourist-infested edinburgh with the camera in hand or on shoulder. from other threads i was expecting a rush of respectful nods and freemason-like secret handshakes. i'm only partially relieved. maybe i should invest in a red dot? the 246 is a great camera. i have two of them! my only grief is the 1 minute maximum exposure. it will grow on you. just keep an eye on the histogram and i didn't find the highlights to be much of a problem, just shoot conservative, like -0.3. i don't find the screen to be particularly dark rather than having a sepia cast. i replaced the straps with an annie barton braided pitch black strap, the more sexy strap in the world to me. i do use the evf a lot and, for what i do, is good enough. leica glass it's why we bought into leica, isn't it? that's what it will drain your bank account. as for the grip, i am getting the multifunctional grip, hoping to get one where the gps works properly. in the future you can post bigger files, i resize to long size 1024 and is good for the forum. keep it coming. edited september 10, 2016 by giulio zanni", "sortedWord": "None", "identifyer": 21442, "year": "2016"}, {"Unnamed: 0": 360232, "autor": "docmoore", "date": 1473578880000, "content": "--img-- 20160910_120808_L1000381-Edit.jpg Taken today in the Scottish National Portrait Gallery. My first serious image with a Monochrom. And, given that I don't want to create another thread I'll add a few comments on my first day with the camera. As a photographer I've had an M4-2 and some other Leica kit since the late 90s. Since digital took over I've been using more conventional kit, A Canon 5D III and now a Sony A7 II. It was trying out some of my Leica and Voigtlander lenses on the latter and seeing how good and how bad they could be that convinced me finally to return to my roots. On Friday a brand new 246 arrived at my door and I've not stopped shooting since. Rather than writing an in depth review I'll just run through some points. The camera is dense And because it doesn't have a grip a-la the typical DSLR, I've found myself suffering from tired fingers. I usually prefer a wrist strap so I'll just have to get used to this. Image review on holding shutter button Is a work of genius. I usually don't chimp every picture but given the metering system and highlight clipping sensitivity I've been spending much more time than normal staring at the back screen. The screen is dark, very dark I tried automatic but now have brightness on high. Images are very dim and I struggle to see any detail below approx zone 4. I'm wondering if this is just me? Where is the noise? I'm travelling right now and so have nothing to compare it with, but I'm happy to use ISO 25600 for anything short of a shot requiring extreme detail. The noise is that fine. I usually add light grain in Silver Efex and even my conservative setting masks any noise from the camera. Highlight clipping is dangerous I'm back in the world of transparencies. Having been used to EVFs or at least colour files with recoverable highlights I now have to judge my exposures that little bit more carefully. A lack of familiarity with the meter and the previously mentioned dark screen means that I'm relying heavily on 1/255 clipping indicators and the thankfully very accurate histogram. This just means a few tries at the moment for any image with bright skies. Live view is wonderful for diagnosing RF problems I only have 3 Voigtlander lenses with me, my Summicrons are at home. I ran through the 3 comparing live view and RF at infinity and close focus. My 50mm f1.5 and 90mm f3.5 are very sharp and spot on throughout the range. My 28mm f1.9 is fine at infinity but miles off (1/3 RF patch width) at 1 meter. I'll need to get that seen to. At least I've not lost any photos finding this out and can be confident that any problems can be quickly dignosed, unlike with film or older digital cameras The included strap Is fine, but the stiff rubber bit for the shoulder precludes it from wrapping around my wrist properly. I'm putting on a wrist strap right now.. The box it came in Would make a fine jewelry dresser. Todays photos Were not my best, but that's not the camera's fault. And I got a couple I'm very happy with. Most importantly the images are sharp and noise-free, and I had fun. Nobody spotted me I spent the day wandering around the centre of tourist-infested Edinburgh with the camera in hand or on shoulder. From other threads I was expecting a rush of respectful nods and Freemason-like secret handshakes. I'm only partially relieved. Maybe I should invest in a red dot? Try 1972 Barton for wrist strap with a thumbs-up on the camera .... Very secure. Oh, red dot would help but a t shirt cap with logo and the biggest Hadley you can carry will let them know you are one In the know. Me .. Its mainly landscape so when anyone approaches I hide my cameras and pretend the monopod is a walking stick. Enjoy the 246 .... Does not get much better than that. Bob", "link": "https://www.l-camera-forum.com/topic/280481-m246-image-thread/page/11/?tab=comments#comment-3110208", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "--img-- 20160910_120808_l1000381-edit.jpg taken today in the scottish national portrait gallery. my first serious image with a monochrom. and, given that i don't want to create another thread i'll add a few comments on my first day with the camera. as a photographer i've had an m4-2 and some other leica kit since the late 90s. since digital took over i've been using more conventional kit, a canon 5d iii and now a sony a7 ii. it was trying out some of my leica and voigtlander lenses on the latter and seeing how good and how bad they could be that convinced me finally to return to my roots. on friday a brand new 246 arrived at my door and i've not stopped shooting since. rather than writing an in depth review i'll just run through some points. the camera is dense and because it doesn't have a grip a-la the typical dslr, i've found myself suffering from tired fingers. i usually prefer a wrist strap so i'll just have to get used to this. image review on holding shutter button is a work of genius. i usually don't chimp every picture but given the metering system and highlight clipping sensitivity i've been spending much more time than normal staring at the back screen. the screen is dark, very dark i tried automatic but now have brightness on high. images are very dim and i struggle to see any detail below approx zone 4. i'm wondering if this is just me? where is the noise? i'm travelling right now and so have nothing to compare it with, but i'm happy to use iso 25600 for anything short of a shot requiring extreme detail. the noise is that fine. i usually add light grain in silver efex and even my conservative setting masks any noise from the camera. highlight clipping is dangerous i'm back in the world of transparencies. having been used to evfs or at least colour files with recoverable highlights i now have to judge my exposures that little bit more carefully. a lack of familiarity with the meter and the previously mentioned dark screen means that i'm relying heavily on 1/255 clipping indicators and the thankfully very accurate histogram. this just means a few tries at the moment for any image with bright skies. live view is wonderful for diagnosing rf problems i only have 3 voigtlander lenses with me, my summicrons are at home. i ran through the 3 comparing live view and rf at infinity and close focus. my 50mm f1.5 and 90mm f3.5 are very sharp and -----> spot !!!  on throughout the range. my 28mm f1.9 is fine at infinity but miles off (1/3 rf patch width) at 1 meter. i'll need to get that seen to. at least i've not lost any photos finding this out and can be confident that any problems can be quickly dignosed, unlike with film or older digital cameras the included strap is fine, but the stiff rubber bit for the shoulder precludes it from wrapping around my wrist properly. i'm putting on a wrist strap right now.. the box it came in would make a fine jewelry dresser. todays photos were not my best, but that's not the camera's fault. and i got a couple i'm very happy with. most importantly the images are sharp and noise-free, and i had fun. nobody spotted me i spent the day wandering around the centre of tourist-infested edinburgh with the camera in hand or on shoulder. from other threads i was expecting a rush of respectful nods and freemason-like secret handshakes. i'm only partially relieved. maybe i should invest in a red dot? try 1972 barton for wrist strap with a thumbs-up on the camera .... very secure. oh, red dot would help but a t shirt cap with logo and the biggest hadley you can carry will let them know you are one in the know. me .. its mainly landscape so when anyone approaches i hide my cameras and pretend the monopod is a walking stick. enjoy the 246 .... does not get much better than that. bob", "sortedWord": "None", "identifyer": 21445, "year": "2016"}, {"Unnamed: 0": 360327, "autor": "relms", "date": 1479683160000, "content": "I have gotten pretty good at U-turns. Driving south through Alabama today, I spotted Doc's Country Store with old Ford pickup parked out front. I made the U-turn, went back, took a few shots, and had lunch there. All good. [MM (Typ 246) + Apo Summicron-M 1.2 /50 ASPH] --img--  Edited November 20, 2016 by relms", "link": "https://www.l-camera-forum.com/topic/280481-m246-image-thread/page/16/?tab=comments#comment-3152874", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "i have gotten pretty good at u-turns. driving south through alabama today, i -----> spotted !!!  doc's country store with old ford pickup parked out front. i made the u-turn, went back, took a few shots, and had lunch there. all good. [mm (typ 246) + apo summicron-m 1.2 /50 asph] --img--  edited november 20, 2016 by relms", "sortedWord": "None", "identifyer": 21543, "year": "2016"}, {"Unnamed: 0": 383805, "autor": "farnz", "date": 1482979800000, "content": "I regularly use my 50/1 Noctilux with my M240 and my M9P before that and I've had no problems nailing focus wide open once I'd got the hang of it. make sure that your rangefinder is spot on, which you can easily check with LiveView on the M240. The important thing I found for nailing focus was that you have to 'find' the technique that works best for you and then practice it. I find that if I haven't used the Noctilux for a while I get out of practice and it takes some time before my hit rate returns to where it should be. Either way, imo a correctly calibrated rangefinder system is more accurate than trying to focus with a SLR/dSLR; I know this from the frustration of being unable to regularly nail focus using my 80/1.4 Summilux-R with my Canon 5D MkII. Pete.", "link": "https://www.l-camera-forum.com/topic/257164-is-the-used-market-supply-of-m8s-drying-up/page/2/?tab=comments#comment-3174776", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i regularly use my 50/1 noctilux with my m240 and my m9p before that and i've had no problems nailing focus wide open once i'd got the hang of it. make sure that your rangefinder is -----> spot !!!  on, which you can easily check with liveview on the m240. the important thing i found for nailing focus was that you have to 'find' the technique that works best for you and then practice it. i find that if i haven't used the noctilux for a while i get out of practice and it takes some time before my hit rate returns to where it should be. either way, imo a correctly calibrated rangefinder system is more accurate than trying to focus with a slr/dslr; i know this from the frustration of being unable to regularly nail focus using my 80/1.4 summilux-r with my canon 5d mkii. pete.", "sortedWord": "None", "identifyer": 45206, "year": "2016"}, {"Unnamed: 0": 384433, "autor": "dpitt", "date": 1479139920000, "content": "Comparing the D109 to the M8 is a bit strange. They are not in the same category. If you like to use a rangefinder, the M8 is of course the one to choose. If you like to play with DOF a 1,33 crop is a world of difference with a 2x crop The M8 allows use of a vast range of M lenses, the D109 only has one. OTOH the D109 does things the M8 can not... like video, zoom, auto focus, high ISO.... But all these have nothing to do with IQ. Put your M8 at ISO 160 and it will beat the D109 hands down (only if you are prepared to shoot RAW and PP properly of course) With the M8 you will have to work harder to get good results, but when you hit the sweet spot, there is no comparison. So if you are prepared to work around the limitations of the M8 it is the better choice. the M8 produces the best B&W images apart from the monochrom. It is probably the sharpest 10MP camera ever. For color, the M8 always needs a good UV/IR filter on the lens IMO. Even then the color is fine, but not on par of the M9 (which is among the best of Leica digital Ms) Some PP skills will be required to get the most of it, certainly in color.", "link": "https://www.l-camera-forum.com/topic/266500-leica-m8-2016-do-you-stay-with-the-d-lux-109/?tab=comments#comment-3148912", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "comparing the d109 to the m8 is a bit strange. they are not in the same category. if you like to use a rangefinder, the m8 is of course the one to choose. if you like to play with dof a 1,33 crop is a world of difference with a 2x crop the m8 allows use of a vast range of m lenses, the d109 only has one. otoh the d109 does things the m8 can not... like video, zoom, auto focus, high iso.... but all these have nothing to do with iq. put your m8 at iso 160 and it will beat the d109 hands down (only if you are prepared to shoot raw and pp properly of course) with the m8 you will have to work harder to get good results, but when you hit the sweet -----> spot !!! , there is no comparison. so if you are prepared to work around the limitations of the m8 it is the better choice. the m8 produces the best b&w images apart from the monochrom. it is probably the sharpest 10mp camera ever. for color, the m8 always needs a good uv/ir filter on the lens imo. even then the color is fine, but not on par of the m9 (which is among the best of leica digital ms) some pp skills will be required to get the most of it, certainly in color.", "sortedWord": "None", "identifyer": 45836, "year": "2016"}, {"Unnamed: 0": 384519, "autor": "david strachan", "date": 1476486180000, "content": "Welcome Cristian. The 24mm frame-lines are the widest shown in the M8 viewfinder. Note that the frame-line designations are as shown on the lens...they automatically take into account the 1.33 crop on the APS-H sensor. If you don't want to use an extra viewfinder, a 24 mm focal length lens is as wide as you can go. The very edges of the viewfinder would approximate the 21mm lens, and would work if you don't wear glasses, allowing your eye close to the viewfinder. The framing lines are only set for 1m so the framing can be somewhat arbitrary...you'll get used to it. Try the camera on a tripod and chimp your images to see the image framing, compared to the viewfinder. You won't get colour distortions with wide angle lenses on the M8 as one does on the full size sensor of the M9, because the M8 uses the central \"sweet spot\" of the lens. Enjoy your new Leica..cheers..", "link": "https://www.l-camera-forum.com/topic/265519-the-frame-of-a-biogon-2145-on-a-leica-m8-and-possible-color-problem/?tab=comments#comment-3128916", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "welcome cristian. the 24mm frame-lines are the widest shown in the m8 viewfinder. note that the frame-line designations are as shown on the lens...they automatically take into account the 1.33 crop on the aps-h sensor. if you don't want to use an extra viewfinder, a 24 mm focal length lens is as wide as you can go. the very edges of the viewfinder would approximate the 21mm lens, and would work if you don't wear glasses, allowing your eye close to the viewfinder. the framing lines are only set for 1m so the framing can be somewhat arbitrary...you'll get used to it. try the camera on a tripod and chimp your images to see the image framing, compared to the viewfinder. you won't get colour distortions with wide angle lenses on the m8 as one does on the full size sensor of the m9, because the m8 uses the central \"sweet -----> spot !!! \" of the lens. enjoy your new leica..cheers..", "sortedWord": "None", "identifyer": 45922, "year": "2016"}, {"Unnamed: 0": 384839, "autor": "jesenovec", "date": 1466709780000, "content": " Hey guys! A new member here --img--  As stupid as it may sound I still cannot believe I finally got a Leica camera myself. Been waiting for this moment a very long time, gone through a \"GAS cloud\" switching systems from A7II, X100T, X-Pro1 and finally settled with an M8.2 which I got in mint condition, 105 shutter count, for only 1100€! I first thought there's gotta be something wrong with it, for the price to be set so low, but due to irresistable price I immediatly bought it and did not regret a single €. I'm using it with previously acquired Minolta M-Rokkor 28mm f2.8 coded, and without the common white spots problem, which I won on Ebay for 310€ incl. hood, uv/ir cut filter and I find the combo superb in it's performance. I'm wondering what's the actual price range now in mid 2016 for a used M8.2 as I can't seem to find any, anywhere. Seems like I had lots of luck --img--  Best regards, Andrej Edited June 23, 2016 by jesenovec", "link": "https://www.l-camera-forum.com/topic/261927-best-deal-ever-on-a-used-m82-used-market-price-range/?tab=comments#comment-3067019", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " hey guys! a new member here --img--  as stupid as it may sound i still cannot believe i finally got a leica camera myself. been waiting for this moment a very long time, gone through a \"gas cloud\" switching systems from a7ii, x100t, x-pro1 and finally settled with an m8.2 which i got in mint condition, 105 shutter count, for only 1100€! i first thought there's gotta be something wrong with it, for the price to be set so low, but due to irresistable price i immediatly bought it and did not regret a single €. i'm using it with previously acquired minolta m-rokkor 28mm f2.8 coded, and without the common white -----> spots !!!  problem, which i won on ebay for 310€ incl. hood, uv/ir cut filter and i find the combo superb in it's performance. i'm wondering what's the actual price range now in mid 2016 for a used m8.2 as i can't seem to find any, anywhere. seems like i had lots of luck --img--  best regards, andrej edited june 23, 2016 by jesenovec", "sortedWord": "None", "identifyer": 46243, "year": "2016"}, {"Unnamed: 0": 384846, "autor": "jesenovec", "date": 1466783700000, "content": "Hi! I know your struggle, the market is basically dry. I found it on local Balkan advertising site similar to Ebay-kleineinzeigen if you know that one. Austrian willhaben.at had a few good offers a while ago. Google's time search seems to do a pretty good job too. But I have to mention I took a risk with buying one without trying it out. Also where are you from? If I happen to spot one cheap, ill pm you. Best wishes!", "link": "https://www.l-camera-forum.com/topic/261927-best-deal-ever-on-a-used-m82-used-market-price-range/?tab=comments#comment-3067598", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi! i know your struggle, the market is basically dry. i found it on local balkan advertising site similar to ebay-kleineinzeigen if you know that one. austrian willhaben.at had a few good offers a while ago. google's time search seems to do a pretty good job too. but i have to mention i took a risk with buying one without trying it out. also where are you from? if i happen to -----> spot !!!  one cheap, ill pm you. best wishes!", "sortedWord": "None", "identifyer": 46250, "year": "2016"}, {"Unnamed: 0": 384995, "autor": "Doc Henry", "date": 1464029580000, "content": "Hi David, Usually it's at the center. From Pete, this may be due to dust which falls inside the screen . See this thread http://www.l-camera-forum.com/topic/240298-coffee-stain-in-2015/My M8 was purchased new in 2007 with an average use of the camera(I currently have 5000 triggers) because I also have 2 analog MI believe IMO that it is the frequent use of the screen (heat and poor heat removal ? ) which triggers the CS. Then I cut the screen when I use ... and one day spot disappeared Otherwise it is a very good camera being the best of Leica IMO specially in b&w This is a Kodak CCD sensor and the color is like Kodak Portra film ie \"vivid\"(as said Erwin Puts) and not \"neutral\" case of the CMOS M240 sensor. Best Henry Edited May 23, 2016 by Doc Henry", "link": "https://www.l-camera-forum.com/topic/260764-m8-coffee-stain-a-question/?tab=comments#comment-3049925", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi david, usually it's at the center. from pete, this may be due to dust which falls inside the screen . see this thread http://www.l-camera-forum.com/topic/240298-coffee-stain-in-2015/my m8 was purchased new in 2007 with an average use of the camera(i currently have 5000 triggers) because i also have 2 analog mi believe imo that it is the frequent use of the screen (heat and poor heat removal ? ) which triggers the cs. then i cut the screen when i use ... and one day -----> spot !!!  disappeared otherwise it is a very good camera being the best of leica imo specially in b&w this is a kodak ccd sensor and the color is like kodak portra film ie \"vivid\"(as said erwin puts) and not \"neutral\" case of the cmos m240 sensor. best henry edited may 23, 2016 by doc henry", "sortedWord": "None", "identifyer": 46399, "year": "2016"}, {"Unnamed: 0": 385012, "autor": "Jeff S", "date": 1462906860000, "content": "Leica folks often care about the edge rendering of their lenses....that's lost with the crop. That's why many M8 users rejoiced when the lenses they already owned (designed for 'full frame' 35mm film Ms) could be used again to their full potential on the M9. I personally loved using the 'sweet spot' of those lenses on the M8.2. Jeff", "link": "https://www.l-camera-forum.com/topic/260230-crop-or-full-frame-nikon-vs-leica/?tab=comments#comment-3042503", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "leica folks often care about the edge rendering of their lenses....that's lost with the crop. that's why many m8 users rejoiced when the lenses they already owned (designed for 'full frame' 35mm film ms) could be used again to their full potential on the m9. i personally loved using the 'sweet -----> spot !!! ' of those lenses on the m8.2. jeff", "sortedWord": "None", "identifyer": 46416, "year": "2016"}, {"Unnamed: 0": 385015, "autor": "david strachan", "date": 1462955460000, "content": "I'd love a revamped M8... With live view so I can use some macro lenses. My lenses go from 20mm equivalence to 180mm equivalence...that's fine (for me) The crop is of no concern, I love the sweet spot and my photography doesn't need \"full frame\". I print large and I am happy with them. After all it is always about the moment, doesn't matter what lens or camera you are using. I'm happy to have the filters, tuning the light for a particular sensor...makes sense. With the modern trend it would have to be a CMOS sensor. Which means better ISO which I'd like. Video which I'd use occasionally...and that's about it for CMOS. The CCD is OK too...just love to have live view as I like to do macro...and chimp like crazy, with a better screen... --img--  But, I'm a realist, and know the chances are....zero. PS black paint with Leica script Edited May 11, 2016 by david strachan", "link": "https://www.l-camera-forum.com/topic/260230-crop-or-full-frame-nikon-vs-leica/?tab=comments#comment-3042801", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i'd love a revamped m8... with live view so i can use some macro lenses. my lenses go from 20mm equivalence to 180mm equivalence...that's fine (for me) the crop is of no concern, i love the sweet -----> spot !!!  and my photography doesn't need \"full frame\". i print large and i am happy with them. after all it is always about the moment, doesn't matter what lens or camera you are using. i'm happy to have the filters, tuning the light for a particular sensor...makes sense. with the modern trend it would have to be a cmos sensor. which means better iso which i'd like. video which i'd use occasionally...and that's about it for cmos. the ccd is ok too...just love to have live view as i like to do macro...and chimp like crazy, with a better screen... --img--  but, i'm a realist, and know the chances are....zero. ps black paint with leica script edited may 11, 2016 by david strachan", "sortedWord": "None", "identifyer": 46419, "year": "2016"}, {"Unnamed: 0": 385016, "autor": "Ernstk", "date": 1462965300000, "content": "I'd love a revamped M8... With live view so I can use some macro lenses. My lenses go from 20mm equivalence to 180mm equivalence...that's fine (for me) The crop is of no concern, I love the sweet spot and my photography doesn't need \"full frame\". I print large and I am happy with them. After all it is always about the moment, doesn't matter what lens or camera you are using. I'm happy to have the filters, tuning the light for a particular sensor...makes sense. With the modern trend it would have to be a CMOS sensor. Which means better ISO which I'd like. Video which I'd use occasionally...and that's about it for CMOS. The CCD is OK too...just love to have live view as I like to do macro...and chimp like crazy, with a better screen... --img--  But, I'm a realist, and know the chances are....zero. PS black paint with Leica script Apart from the crop, you've pretty much described the M-P Dave!", "link": "https://www.l-camera-forum.com/topic/260230-crop-or-full-frame-nikon-vs-leica/?tab=comments#comment-3042849", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i'd love a revamped m8... with live view so i can use some macro lenses. my lenses go from 20mm equivalence to 180mm equivalence...that's fine (for me) the crop is of no concern, i love the sweet -----> spot !!!  and my photography doesn't need \"full frame\". i print large and i am happy with them. after all it is always about the moment, doesn't matter what lens or camera you are using. i'm happy to have the filters, tuning the light for a particular sensor...makes sense. with the modern trend it would have to be a cmos sensor. which means better iso which i'd like. video which i'd use occasionally...and that's about it for cmos. the ccd is ok too...just love to have live view as i like to do macro...and chimp like crazy, with a better screen... --img--  but, i'm a realist, and know the chances are....zero. ps black paint with leica script apart from the crop, you've pretty much described the m-p dave!", "sortedWord": "None", "identifyer": 46420, "year": "2016"}, {"Unnamed: 0": 385017, "autor": "arno_nyhm", "date": 1462986060000, "content": "I'd love a revamped M8... With live view so I can use some macro lenses. My lenses go from 20mm equivalence to 180mm equivalence...that's fine (for me) The crop is of no concern, I love the sweet spot and my photography doesn't need \"full frame\". I print large and I am happy with them. After all it is always about the moment, doesn't matter what lens or camera you are using. I'm happy to have the filters, tuning the light for a particular sensor...makes sense. With the modern trend it would have to be a CMOS sensor. Which means better ISO which I'd like. Video which I'd use occasionally...and that's about it for CMOS. The CCD is OK too...just love to have live view as I like to do macro...and chimp like crazy, with a better screen... --img--  But, I'm a realist, and know the chances are....zero. PS black paint with Leica script if you could cope with a camera without the rangefinder or OVF (wich i coudn't) you should try out a Fuji X-E1. they go for almost nothing in the bay and do all this with almost any manual lense and adapter you'd like.", "link": "https://www.l-camera-forum.com/topic/260230-crop-or-full-frame-nikon-vs-leica/?tab=comments#comment-3043041", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i'd love a revamped m8... with live view so i can use some macro lenses. my lenses go from 20mm equivalence to 180mm equivalence...that's fine (for me) the crop is of no concern, i love the sweet -----> spot !!!  and my photography doesn't need \"full frame\". i print large and i am happy with them. after all it is always about the moment, doesn't matter what lens or camera you are using. i'm happy to have the filters, tuning the light for a particular sensor...makes sense. with the modern trend it would have to be a cmos sensor. which means better iso which i'd like. video which i'd use occasionally...and that's about it for cmos. the ccd is ok too...just love to have live view as i like to do macro...and chimp like crazy, with a better screen... --img--  but, i'm a realist, and know the chances are....zero. ps black paint with leica script if you could cope with a camera without the rangefinder or ovf (wich i coudn't) you should try out a fuji x-e1. they go for almost nothing in the bay and do all this with almost any manual lense and adapter you'd like.", "sortedWord": "None", "identifyer": 46421, "year": "2016"}, {"Unnamed: 0": 385389, "autor": "Ernstk", "date": 1463182380000, "content": " Braver than me Gungadin, . We're you able to get at the inside of the top plate, to push out that ghastly dent? Next job, see if you can \"fix\" the LCD, I find it incomprehensible that this is not possible. Good work. Gary Thanks Gary. Yes, I could get inside the top plate. However, at the exact spot where the dent is, a flexible circuit board is cemented in place and I really didn't want to remove that to beat out the dent. I've been thinking the same thing about the LCD. I'll try to dismantle the damaged one to see what I can unearth. Ernst", "link": "https://www.l-camera-forum.com/topic/259525-replace-m8-shutter-or-lcd-rear-screen/page/3/?tab=comments#comment-3044409", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " braver than me gungadin, . we're you able to get at the inside of the top plate, to push out that ghastly dent? next job, see if you can \"fix\" the lcd, i find it incomprehensible that this is not possible. good work. gary thanks gary. yes, i could get inside the top plate. however, at the exact -----> spot !!!  where the dent is, a flexible circuit board is cemented in place and i really didn't want to remove that to beat out the dent. i've been thinking the same thing about the lcd. i'll try to dismantle the damaged one to see what i can unearth. ernst", "sortedWord": "None", "identifyer": 46793, "year": "2016"}, {"Unnamed: 0": 385589, "autor": "sc_rufctr", "date": 1461661140000, "content": "That looks like oil spots to me. (Same shape, uniform size, varying levels of translucency) I hope I'm wrong.", "link": "https://www.l-camera-forum.com/topic/259734-is-this-dust-on-sensor/?tab=comments#comment-3033624", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "that looks like oil -----> spots !!!  to me. (same shape, uniform size, varying levels of translucency) i hope i'm wrong.", "sortedWord": "None", "identifyer": 46994, "year": "2016"}, {"Unnamed: 0": 385590, "autor": "Ernstk", "date": 1461661320000, "content": " That looks like oil spots to me. (Same shape, uniform size, varying levels of translucency) I hope I'm wrong. If it's oil, where might that have come from? Ernst", "link": "https://www.l-camera-forum.com/topic/259734-is-this-dust-on-sensor/?tab=comments#comment-3033631", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " that looks like oil -----> spots !!!  to me. (same shape, uniform size, varying levels of translucency) i hope i'm wrong. if it's oil, where might that have come from? ernst", "sortedWord": "None", "identifyer": 46995, "year": "2016"}, {"Unnamed: 0": 385592, "autor": "jaapv", "date": 1461661620000, "content": "Hah! Is there a 'remove sensor dust' option in Lightroom? I was happy with the photo, til I saw the dust. Yes - there is. It is called spot removal, You'll find it in the develop module under \"tools\", For these few spots I would not be in real hurry to clean the sensor.", "link": "https://www.l-camera-forum.com/topic/259734-is-this-dust-on-sensor/?tab=comments#comment-3033636", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hah! is there a 'remove sensor dust' option in lightroom? i was happy with the photo, til i saw the dust. yes - there is. it is called -----> spot !!!  removal, you'll find it in the develop module under \"tools\", for these few spots i would not be in real hurry to clean the sensor.", "sortedWord": "None", "identifyer": 46997, "year": "2016"}, {"Unnamed: 0": 385599, "autor": "menos I M6", "date": 1461777000000, "content": "That's sensor dust - when you are in Lightroom's development module, hit \"Q\" and you can use the spot removal tool. While being in the spot removal tool hit \"T\" which will display a tool bar at the bottom where you have another nifty tool to display an inverted contrasty mask which can be adjusted with a slider. This makes finding certain \"hidden\" dust spots very easy. You can do your dust spotting in one of your photographs that makes this very easy (a blank wall, shot at f16 or the bright sky) and then copy over the dust spotting information from one photograph to a bulk of photographs. Easy: select all photographs, you want to apply the dust spotting information in the library grid view (or in any module that shows you the film roll at the bottom of the screen). Make sure the one photo which does have your dust spotting already applied is the selected photo of the entire bulk. Now go to the development module (hit \"D\" on your keyboard) and click the \"sync\" button in your development tool ribbon on the very bottom right of the screen (it is the left button of the two buttons). A pop up menu will be displayed where you can select what settings from your selected master photo you wish to sync - you want to select only the dust spotting option, if that is what you want to apply to all selected photographs in the group from your master photograph in focus. After applying, let Lightroom calculate new 1:1 previews of the group of photos and quickly check them all if any of the dust spots have ill effects (easiest to do in the development module, while pressing activating \"Q\" and deactivating \"Q\" as necessary to see the dust spots) Easy photographs are those of dust in the sky - Lightroom will often simply correct them easily. More difficult ones are those with irregular structures (hair, grass, etc …) or regular structures with repeating patterns (like a panning shot at very slow shutter speeds or architecture shots) - Lightroom will often not properly realize the patterns and will place a wrong correction which is easily spotted and has to be adjusted manually. Best practice is to clean the sensor once Lightroom dust spotting becomes to tedious. BTW - if you run also Adobe Photoshop and work with tiff files, a faster way to dust spot is to use a selection tool (I prefer the free form selection tool), multi select all dust spots in an area and then \"shift +F5\" and use the \"fill content-aware\" option to remove dust spots. This is how I spot my film scans for dust, water spots and scratches and it is both much, much faster than Lightroom's spotting tool and does not slow the computer down as much as a photograph with lots of dust spots in Lightroom (as it is not non-destructive as Lightroom, but will correct the image per pixel immediately). Happy dust spotting! PS: if you are on a Mac, download the app \"Cheatsheet\" - it allows you to see all keyboard shortcuts of the active app by simply holding the command key for a few seconds - makes learning those shortcuts and working in Adobe products so much easier.", "link": "https://www.l-camera-forum.com/topic/259734-is-this-dust-on-sensor/?tab=comments#comment-3034598", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "that's sensor dust - when you are in lightroom's development module, hit \"q\" and you can use the -----> spot !!!  removal tool. while being in the spot removal tool hit \"t\" which will display a tool bar at the bottom where you have another nifty tool to display an inverted contrasty mask which can be adjusted with a slider. this makes finding certain \"hidden\" dust spots very easy. you can do your dust spotting in one of your photographs that makes this very easy (a blank wall, shot at f16 or the bright sky) and then copy over the dust spotting information from one photograph to a bulk of photographs. easy: select all photographs, you want to apply the dust spotting information in the library grid view (or in any module that shows you the film roll at the bottom of the screen). make sure the one photo which does have your dust spotting already applied is the selected photo of the entire bulk. now go to the development module (hit \"d\" on your keyboard) and click the \"sync\" button in your development tool ribbon on the very bottom right of the screen (it is the left button of the two buttons). a pop up menu will be displayed where you can select what settings from your selected master photo you wish to sync - you want to select only the dust spotting option, if that is what you want to apply to all selected photographs in the group from your master photograph in focus. after applying, let lightroom calculate new 1:1 previews of the group of photos and quickly check them all if any of the dust spots have ill effects (easiest to do in the development module, while pressing activating \"q\" and deactivating \"q\" as necessary to see the dust spots) easy photographs are those of dust in the sky - lightroom will often simply correct them easily. more difficult ones are those with irregular structures (hair, grass, etc …) or regular structures with repeating patterns (like a panning shot at very slow shutter speeds or architecture shots) - lightroom will often not properly realize the patterns and will place a wrong correction which is easily spotted and has to be adjusted manually. best practice is to clean the sensor once lightroom dust spotting becomes to tedious. btw - if you run also adobe photoshop and work with tiff files, a faster way to dust spot is to use a selection tool (i prefer the free form selection tool), multi select all dust spots in an area and then \"shift +f5\" and use the \"fill content-aware\" option to remove dust spots. this is how i spot my film scans for dust, water spots and scratches and it is both much, much faster than lightroom's spotting tool and does not slow the computer down as much as a photograph with lots of dust spots in lightroom (as it is not non-destructive as lightroom, but will correct the image per pixel immediately). happy dust spotting! ps: if you are on a mac, download the app \"cheatsheet\" - it allows you to see all keyboard shortcuts of the active app by simply holding the command key for a few seconds - makes learning those shortcuts and working in adobe products so much easier.", "sortedWord": "None", "identifyer": 47004, "year": "2016"}, {"Unnamed: 0": 385708, "autor": "tobey bilek", "date": 1460152500000, "content": " Of course, if you are specialized on infrared photography. But I am missing the special correction dot for infrared photography on most (all?) Leica M-lenses. My old Canon-FD-lenses have such dots - or is this not necessary for M? The proper focus point is easy to find experimentally. It does depend on the particular lens, but usually around the 5.6 mark. I put a red ink spot there. The spot moves depending on the film sensitivity and filter in use. Settle on one combination.", "link": "https://www.l-camera-forum.com/topic/168978-did-ken-rockwell-a-m8-hater/page/3/?tab=comments#comment-3022968", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " of course, if you are specialized on infrared photography. but i am missing the special correction dot for infrared photography on most (all?) leica m-lenses. my old canon-fd-lenses have such dots - or is this not necessary for m? the proper focus point is easy to find experimentally. it does depend on the particular lens, but usually around the 5.6 mark. i put a red ink -----> spot !!!  there. the spot moves depending on the film sensitivity and filter in use. settle on one combination.", "sortedWord": "None", "identifyer": 47113, "year": "2016"}, {"Unnamed: 0": 385709, "autor": "pico", "date": 1460152740000, "content": "The proper focus point is easy to find experimentally. It does depend on the particular lens, but usually around the 5.6 mark. I put a red ink spot there. The spot moves depending on the film sensitivity and filter in use. Settle on one combination. I don't worry about any of those things. Use one film, do the best we can and all is good. The technicalities trickle down to the vociferous nerds who don't even look at the images. . Edited April 8, 2016 by pico", "link": "https://www.l-camera-forum.com/topic/168978-did-ken-rockwell-a-m8-hater/page/3/?tab=comments#comment-3022970", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the proper focus point is easy to find experimentally. it does depend on the particular lens, but usually around the 5.6 mark. i put a red ink -----> spot !!!  there. the spot moves depending on the film sensitivity and filter in use. settle on one combination. i don't worry about any of those things. use one film, do the best we can and all is good. the technicalities trickle down to the vociferous nerds who don't even look at the images. . edited april 8, 2016 by pico", "sortedWord": "None", "identifyer": 47114, "year": "2016"}, {"Unnamed: 0": 387753, "autor": "TomB_tx", "date": 1457231880000, "content": "Very nice! I bought my M4 in 1968 as I was getting out of college, when it was the new model and the M3 and M2 were still available new. I liked the M4 better then, and still do. Mine is no longer pristine - but you have to look close to see the character spots. Finally had it serviced a few years ago, and it's still a joy to use, with its original 50 & 35 Summicrons and 90 TE.", "link": "https://www.l-camera-forum.com/topic/141350-i-love-my-m4/page/15/?tab=comments#comment-3002554", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "very nice! i bought my m4 in 1968 as i was getting out of college, when it was the new model and the m3 and m2 were still available new. i liked the m4 better then, and still do. mine is no longer pristine - but you have to look close to see the character -----> spots !!! . finally had it serviced a few years ago, and it's still a joy to use, with its original 50 & 35 summicrons and 90 te.", "sortedWord": "None", "identifyer": 202, "year": "2016"}, {"Unnamed: 0": 397543, "autor": "Exodies", "date": 1477294440000, "content": "A Miller - \"News Stand\" is a fantastic moment. Well spotted. Should be placed with \"Morrow's Nut Shop\" by Steven Shore.", "link": "https://www.l-camera-forum.com/topic/265598-leica-summaron-28-image-thread/page/9/?tab=comments#comment-3134368", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "a miller - \"news stand\" is a fantastic moment. well -----> spotted !!! . should be placed with \"morrow's nut shop\" by steven shore.", "sortedWord": "None", "identifyer": 10133, "year": "2016"}, {"Unnamed: 0": 397651, "autor": "james.liam", "date": 1477749900000, "content": "Have to hand it to the Leica marketing people. If you look at the threads here, most on the M side have steadily grown silent since the arrival of the SL, except for this one on this little lens. Whether it's for everyone, is readily available or even reallly merits its lofty price, they have succeeded in creating quite a buzz. Hari must be BFF with Peter Karbe by now --img-- We should petition Wetzlar for a permanent parking spot for \"Herr Doktor Hari\". Our inside man at the Mothership Edited October 29, 2016 by james.liam", "link": "https://www.l-camera-forum.com/topic/265598-leica-summaron-28-image-thread/page/14/?tab=comments#comment-3137836", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "have to hand it to the leica marketing people. if you look at the threads here, most on the m side have steadily grown silent since the arrival of the sl, except for this one on this little lens. whether it's for everyone, is readily available or even reallly merits its lofty price, they have succeeded in creating quite a buzz. hari must be bff with peter karbe by now --img-- we should petition wetzlar for a permanent parking -----> spot !!!  for \"herr doktor hari\". our inside man at the mothership edited october 29, 2016 by james.liam", "sortedWord": "None", "identifyer": 10241, "year": "2016"}, {"Unnamed: 0": 409548, "autor": "stray cat", "date": 1483154220000, "content": "Pico, I find your review most perplexing. I have a copy of the M3 version from 1958 and it is an absolutely delightful little lens. I don't like to compare such things as a rule but I would happily use this lens anywhere I'd choose to use my Summicron version IV 35mm - and that is my all-time favourite lens. It might well be that you have a bad copy. Then again, I use mine with film, in the manner for which it was intended, and perhaps you are using yours with digital - that might account for the disparity, although I doubt it, as most lenses seem to perform well either way. Please be sure to update this thread on the results of your further investigation. And if possible, perhaps try to beg, borrow or steal another example to compare the performance. I hope it is OK to quote this here - I forget where I found it, and it might mean nothing, but this is came from internet wisdom when I was researching before I bought my copy: I just compared in equal conditions three double-Gauss-type lenses: the Summaron 35mm f2.8, the Summaron (2 items) 35mm f3.5 (both with eyes, coated, 6e/4g), and the Summicron 35mm f2.0 (the first version of 1958, 8 elements in 6 groups). The film: Kodak 100 Pro, cameras: two M3 and the M4P. All three lenses are in perfect condition, absolutely clean and clear with no any cleaning marks, spots and fog. The conditions of shooting: 1) sun shining, slightly cloudy, F-stop: full open, 4.0, 5.6, 8.0, 16; lens shade; 2) interior, F-stop: full open only, lens shade, the heavy Linhof tripod, no flash.All three films were developed and printed in the same pro lab on format 15 X 21.5cm.Results of expertise by three (including me) independent experts made: there is no any flare at all on the pics having either the sun or its water reflections in the frame along with full resolving of fine details in deep shadows. There is no any* difference between shots made with ‘cron and both (+1) Summaron’s: a very crisp rendering with subtle color saturation, high contrast and resolving power either wide open or stopped down. *The Summicron shows very slightly less contrast in any conditions, as two experts (including me) do notice (issue of 12 borders air/glass vs 8 ones). The pics taken with Summaron’s full open have no any difference between them, while they differ a bit from the ones taken with the Summicron full open: the last make slightly less contrast. All three lenses make a good-looking bokeh. The pics made in the interior have less contrast than ones taken in exterior, while they still show a very good resolving of fine details and color rendition. The bottom line: all three lens are great performers. (Edit: I found the original link - http://www.greenspun.com/bboard/q-and-a-fetch-msg.tcl?msg_id=007KmD). Edited December 31, 2016 by stray cat", "link": "https://www.l-camera-forum.com/topic/267809-critique-35mm-summaron-f35/?tab=comments#comment-3176152", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "pico, i find your review most perplexing. i have a copy of the m3 version from 1958 and it is an absolutely delightful little lens. i don't like to compare such things as a rule but i would happily use this lens anywhere i'd choose to use my summicron version iv 35mm - and that is my all-time favourite lens. it might well be that you have a bad copy. then again, i use mine with film, in the manner for which it was intended, and perhaps you are using yours with digital - that might account for the disparity, although i doubt it, as most lenses seem to perform well either way. please be sure to update this thread on the results of your further investigation. and if possible, perhaps try to beg, borrow or steal another example to compare the performance. i hope it is ok to quote this here - i forget where i found it, and it might mean nothing, but this is came from internet wisdom when i was researching before i bought my copy: i just compared in equal conditions three double-gauss-type lenses: the summaron 35mm f2.8, the summaron (2 items) 35mm f3.5 (both with eyes, coated, 6e/4g), and the summicron 35mm f2.0 (the first version of 1958, 8 elements in 6 groups). the film: kodak 100 pro, cameras: two m3 and the m4p. all three lenses are in perfect condition, absolutely clean and clear with no any cleaning marks, -----> spots !!!  and fog. the conditions of shooting: 1) sun shining, slightly cloudy, f-stop: full open, 4.0, 5.6, 8.0, 16; lens shade; 2) interior, f-stop: full open only, lens shade, the heavy linhof tripod, no flash.all three films were developed and printed in the same pro lab on format 15 x 21.5cm.results of expertise by three (including me) independent experts made: there is no any flare at all on the pics having either the sun or its water reflections in the frame along with full resolving of fine details in deep shadows. there is no any* difference between shots made with ‘cron and both (+1) summaron’s: a very crisp rendering with subtle color saturation, high contrast and resolving power either wide open or stopped down. *the summicron shows very slightly less contrast in any conditions, as two experts (including me) do notice (issue of 12 borders air/glass vs 8 ones). the pics taken with summaron’s full open have no any difference between them, while they differ a bit from the ones taken with the summicron full open: the last make slightly less contrast. all three lenses make a good-looking bokeh. the pics made in the interior have less contrast than ones taken in exterior, while they still show a very good resolving of fine details and color rendition. the bottom line: all three lens are great performers. (edit: i found the original link - http://www.greenspun.com/bboard/q-and-a-fetch-msg.tcl?msg_id=007kmd). edited december 31, 2016 by stray cat", "sortedWord": "None", "identifyer": 22372, "year": "2016"}, {"Unnamed: 0": 419544, "autor": "wlaidlaw", "date": 1454917740000, "content": "So, I got a response from leica Australia who forwarded my email to the SL team in Germany. The reply was very nice and pro-active about the issue. Short answer is they acknowledge the TTL system isn't right and they're looking to address it sooner than later but no promises of a fixed date. Happy with the response and looking forward to getting it sorted. Bring on those firmware updates... --img--  Gordon Thinking about this, it is a bit surprising that we have had to tell Leica about this (as of 9th December they thought that it all worked just fine and at worst was only a problem with the legacy flashes). You would have thought that the team writing the manual, who presumably had an SL and prototype SF40 or 64 to hand, did not say: \"hang on a minute guys, this doesn't work like we are writing down.\" I would assume it is supposed to work exactly like the M240 does, so you would have thought that 1) the code was the same and 2) that it would have been spotted more quickly. If not by Leica then at least by the Metz-Mecablitz or Nissin teams, who have a greater stake in the flash working properly. Wilson Edited February 8, 2016 by wlaidlaw", "link": "https://www.l-camera-forum.com/topic/256231-flash-performance-very-disappointing-on-the-sl/page/2/?tab=comments#comment-2985182", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "so, i got a response from leica australia who forwarded my email to the sl team in germany. the reply was very nice and pro-active about the issue. short answer is they acknowledge the ttl system isn't right and they're looking to address it sooner than later but no promises of a fixed date. happy with the response and looking forward to getting it sorted. bring on those firmware updates... --img--  gordon thinking about this, it is a bit surprising that we have had to tell leica about this (as of 9th december they thought that it all worked just fine and at worst was only a problem with the legacy flashes). you would have thought that the team writing the manual, who presumably had an sl and prototype sf40 or 64 to hand, did not say: \"hang on a minute guys, this doesn't work like we are writing down.\" i would assume it is supposed to work exactly like the m240 does, so you would have thought that 1) the code was the same and 2) that it would have been -----> spotted !!!  more quickly. if not by leica then at least by the metz-mecablitz or nissin teams, who have a greater stake in the flash working properly. wilson edited february 8, 2016 by wlaidlaw", "sortedWord": "None", "identifyer": 32556, "year": "2016"}, {"Unnamed: 0": 439797, "autor": "Lucena", "date": 1467199500000, "content": "This morning, on the beach, a medusa with beautiful spots... --img--  ISO 100 f/2.8 1/320", "link": "https://www.l-camera-forum.com/topic/260179-leica-q-leica-q2-macro-image-thread/page/7/?tab=comments#comment-3070415", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "this morning, on the beach, a medusa with beautiful -----> spots !!! ... --img--  iso 100 f/2.8 1/320", "sortedWord": "None", "identifyer": 53127, "year": "2016"}, {"Unnamed: 0": 439822, "autor": "SonomaBear", "date": 1469741100000, "content": "Updated to firmware 2.0, I'm noticing an improvement in image quality. Q in macro mode, even left it all in auto (Program mode, AF) and desk kitty turned back toward camera... Focus spot on hair above eye. DNG into LR. -- f2.8 @ 1/60 -- ISO1250 --img-- ", "link": "https://www.l-camera-forum.com/topic/260179-leica-q-leica-q2-macro-image-thread/page/8/?tab=comments#comment-3086952", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "updated to firmware 2.0, i'm noticing an improvement in image quality. q in macro mode, even left it all in auto (program mode, af) and desk kitty turned back toward camera... focus -----> spot !!!  on hair above eye. dng into lr. -- f2.8 @ 1/60 -- iso1250 --img-- ", "sortedWord": "None", "identifyer": 53153, "year": "2016"}, {"Unnamed: 0": 439823, "autor": "Lucena", "date": 1469741400000, "content": "Updated to firmware 2.0, I'm noticing an improvement in image quality. Q in macro mode, even left it all in auto (Program mode, AF) and desk kitty turned back toward camera... Focus spot on hair above eye. DNG into LR. -- f2.8 @ 1/60 -- ISO1250 Very well done, just updated mine but did not yet had time to test it...", "link": "https://www.l-camera-forum.com/topic/260179-leica-q-leica-q2-macro-image-thread/page/8/?tab=comments#comment-3086957", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "updated to firmware 2.0, i'm noticing an improvement in image quality. q in macro mode, even left it all in auto (program mode, af) and desk kitty turned back toward camera... focus -----> spot !!!  on hair above eye. dng into lr. -- f2.8 @ 1/60 -- iso1250 very well done, just updated mine but did not yet had time to test it...", "sortedWord": "None", "identifyer": 53154, "year": "2016"}, {"Unnamed: 0": 439874, "autor": "Leica Guy", "date": 1474146360000, "content": "Aspen leaf and shadow. I originally took a photo similar to this of an aspen leaf that had fallen in our birdbath. This one was more staged, I put a flat 12\" x 12\" pan in the sun with about 2\" of water in it and with an old Epson printed background submerged in the water. I then tried about a dozen aspen leafs until I found one with the desired shadow pattern. I think it's kind of unique. I did have to do some clean up in Photoshop to remove debris that was in the water and the resulting spots. I did not in any way alter the aspen leaf or shadow except normal exposure, sharpening and a little saturation. All in LR. I love the way that light is refracted by the edge of the leaf. My take is it's differences in how the leaf lays on the water and the surface tension of the water affecting how far off the water the leaf is setting. Other thoughts? Of course it was handheld in macro mode with the Q, --img-- ", "link": "https://www.l-camera-forum.com/topic/260179-leica-q-leica-q2-macro-image-thread/page/11/?tab=comments#comment-3114128", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "aspen leaf and shadow. i originally took a photo similar to this of an aspen leaf that had fallen in our birdbath. this one was more staged, i put a flat 12\" x 12\" pan in the sun with about 2\" of water in it and with an old epson printed background submerged in the water. i then tried about a dozen aspen leafs until i found one with the desired shadow pattern. i think it's kind of unique. i did have to do some clean up in photoshop to remove debris that was in the water and the resulting -----> spots !!! . i did not in any way alter the aspen leaf or shadow except normal exposure, sharpening and a little saturation. all in lr. i love the way that light is refracted by the edge of the leaf. my take is it's differences in how the leaf lays on the water and the surface tension of the water affecting how far off the water the leaf is setting. other thoughts? of course it was handheld in macro mode with the q, --img-- ", "sortedWord": "None", "identifyer": 53206, "year": "2016"}, {"Unnamed: 0": 444802, "autor": "Big T", "date": 1480228020000, "content": "Had my Q for 14 months now. Gets used in \"ALL\" conditions. I do not baby the camera. A month ago I noticed a \"spot\" in my pics but only under \"abnormal\" conditions. Camera sent to the Australian Leica service agent and came back all clean and serviced. And the best bit \"no charge\". I will continue to use my Q in all conditions. PS: I have had two other fixed lens cameras that had the same dust issue (X100 & G9) and they were fixed by the manufactures at no charge. PSS: I don't blame any of the cameras for the spots. As I said I do not baby my cameras. They are made to be used.", "link": "https://www.l-camera-forum.com/topic/266824-cleaning-of-sensor-dust/?tab=comments#comment-3156375", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "had my q for 14 months now. gets used in \"all\" conditions. i do not baby the camera. a month ago i noticed a \"-----> spot !!! \" in my pics but only under \"abnormal\" conditions. camera sent to the australian leica service agent and came back all clean and serviced. and the best bit \"no charge\". i will continue to use my q in all conditions. ps: i have had two other fixed lens cameras that had the same dust issue (x100 & g9) and they were fixed by the manufactures at no charge. pss: i don't blame any of the cameras for the spots. as i said i do not baby my cameras. they are made to be used.", "sortedWord": "None", "identifyer": 8202, "year": "2016"}, {"Unnamed: 0": 448466, "autor": "gbealnz", "date": 1471216920000, "content": "Ah, sorry Toshi, well spotted, I'll blame the spell-checker, but ultimately the blame falls on me, that's two for this post alone, time to retreat to my cave. Gary", "link": "https://www.l-camera-forum.com/topic/262935-x-vario-mk-ii/page/2/?tab=comments#comment-3096368", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "ah, sorry toshi, well -----> spotted !!! , i'll blame the spell-checker, but ultimately the blame falls on me, that's two for this post alone, time to retreat to my cave. gary", "sortedWord": "None", "identifyer": 11951, "year": "2016"}, {"Unnamed: 0": 448470, "autor": "TMorita", "date": 1471296900000, "content": "Ah, sorry Toshi, well spotted, I'll blame the spell-checker, but ultimately the blame falls on me, that's two for this post alone, time to retreat to my cave. Gary Just teasing you. Not necessary to retreat to a cave. --img-- ", "link": "https://www.l-camera-forum.com/topic/262935-x-vario-mk-ii/page/2/?tab=comments#comment-3096832", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "ah, sorry toshi, well -----> spotted !!! , i'll blame the spell-checker, but ultimately the blame falls on me, that's two for this post alone, time to retreat to my cave. gary just teasing you. not necessary to retreat to a cave. --img-- ", "sortedWord": "None", "identifyer": 11955, "year": "2016"}, {"Unnamed: 0": 448520, "autor": "serirama", "date": 1474780380000, "content": " Dear all, I just received X Vario purchased thru eBay a few days ago. I was super exited but due to work, I havent had the chance to fully test the camera. I work in office and would see clear sky on weekends only.. (yeah.. bummer!! :-P) When shooting clear sky, I would see these clusters of spots. I have contacted the buyer and he said that he has never experience these spots on any of the pictures he's taken. He sounded genuine and as a good seller, he offered full refund or AUD100 for repair. (which is I dont know how much yet) The cluster of spots will move with auto focus movement (when I move between the contrast area of tree/clouds) I have fallen in love with the camera and would like to keep it is the problem can be fixed easily.. (I live in Malaysia Kuala Lumpur.. and the nearest Leica service center is in Singapore). Now, I'd like to get advise with these photos if the X Vario is worth keeping? how much would Leica charge to have the sensor cleaned, presumably it is the dirt crud on the sensor? Would I be able to claim warranty? I've called Leica Malaysia but the answers are between 1-2 years only for X Vario? Is this true? I dont see any warranty card in the box except a test certificate. https://www.flickr.com/gp/zul-fawie/5071y2 Would these cluster of spots develop overnight or during shipping? is the ex-owner is telling me the truth?. it was shipped well in original box and bubbles. Appreciate your kind help as this is my first Leica. no cluster of spots if taken a faster aperture. Kind regards, SR", "link": "https://www.l-camera-forum.com/topic/264898-new-to-leica-and-black-spots/?tab=comments#comment-3118227", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " dear all, i just received x vario purchased thru ebay a few days ago. i was super exited but due to work, i havent had the chance to fully test the camera. i work in office and would see clear sky on weekends only.. (yeah.. bummer!! :-p) when shooting clear sky, i would see these clusters of -----> spots !!! . i have contacted the buyer and he said that he has never experience these spots on any of the pictures he's taken. he sounded genuine and as a good seller, he offered full refund or aud100 for repair. (which is i dont know how much yet) the cluster of spots will move with auto focus movement (when i move between the contrast area of tree/clouds) i have fallen in love with the camera and would like to keep it is the problem can be fixed easily.. (i live in malaysia kuala lumpur.. and the nearest leica service center is in singapore). now, i'd like to get advise with these photos if the x vario is worth keeping? how much would leica charge to have the sensor cleaned, presumably it is the dirt crud on the sensor? would i be able to claim warranty? i've called leica malaysia but the answers are between 1-2 years only for x vario? is this true? i dont see any warranty card in the box except a test certificate. https://www.flickr.com/gp/zul-fawie/5071y2 would these cluster of spots develop overnight or during shipping? is the ex-owner is telling me the truth?. it was shipped well in original box and bubbles. appreciate your kind help as this is my first leica. no cluster of spots if taken a faster aperture. kind regards, sr", "sortedWord": "None", "identifyer": 12006, "year": "2016"}, {"Unnamed: 0": 448521, "autor": "pop", "date": 1474784820000, "content": "I had exactly the same phenomenon with my XV. It grew those dust spots overnight, possibly during a flight. Before the trip there was no dust visible. After the flight there it was. I had bought my X Vario secondhand from one of the local dealers. Leica (Switzerland) removed the dust free of charge and within a short time.", "link": "https://www.l-camera-forum.com/topic/264898-new-to-leica-and-black-spots/?tab=comments#comment-3118238", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i had exactly the same phenomenon with my xv. it grew those dust -----> spots !!!  overnight, possibly during a flight. before the trip there was no dust visible. after the flight there it was. i had bought my x vario secondhand from one of the local dealers. leica (switzerland) removed the dust free of charge and within a short time.", "sortedWord": "None", "identifyer": 12007, "year": "2016"}, {"Unnamed: 0": 448522, "autor": "serirama", "date": 1474850100000, "content": "I had exactly the same phenomenon with my XV. It grew those dust spots overnight, possibly during a flight. Before the trip there was no dust visible. After the flight there it was. I had bought my X Vario secondhand from one of the local dealers. Leica (Switzerland) removed the dust free of charge and within a short time. Dear Philip, Many thanks for you kind response. Would Swiss Leica be able to clean my sensor even if it was purchased via eBay? Does your VX still under warranty at that time? I don't min shipping it to Leica Swiss if it is the case. Appreciate if you could provide me the contact. Many many thanks in advance. kind regards, SR", "link": "https://www.l-camera-forum.com/topic/264898-new-to-leica-and-black-spots/?tab=comments#comment-3118717", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i had exactly the same phenomenon with my xv. it grew those dust -----> spots !!!  overnight, possibly during a flight. before the trip there was no dust visible. after the flight there it was. i had bought my x vario secondhand from one of the local dealers. leica (switzerland) removed the dust free of charge and within a short time. dear philip, many thanks for you kind response. would swiss leica be able to clean my sensor even if it was purchased via ebay? does your vx still under warranty at that time? i don't min shipping it to leica swiss if it is the case. appreciate if you could provide me the contact. many many thanks in advance. kind regards, sr", "sortedWord": "None", "identifyer": 12008, "year": "2016"}, {"Unnamed: 0": 448600, "autor": "Musotographer", "date": 1469050440000, "content": "Thanks very much all of you, most helpful. I should have been clearer about the exposure/focus indicator. I suppose I meant that there doesn't seem to be an exposure lock; i.e using spot metering, if you expose centrally for a certain part of the frame and then use central AF, the exposure value will change to wherever the focus indicator is. You don't always want to take focus and exposure from the same place. The way round it I suppose is to use MF and then set the exposure for wherever you want it - or, as you say move the focus indicator around using the arrows - but that's a bit slow and fiddly for my taste. There's clearly lots to learn - it all makes the M seem wonderfully simple and instinctive :-)", "link": "https://www.l-camera-forum.com/topic/262671-new-x-vario-user/?tab=comments#comment-3082074", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thanks very much all of you, most helpful. i should have been clearer about the exposure/focus indicator. i suppose i meant that there doesn't seem to be an exposure lock; i.e using -----> spot !!!  metering, if you expose centrally for a certain part of the frame and then use central af, the exposure value will change to wherever the focus indicator is. you don't always want to take focus and exposure from the same place. the way round it i suppose is to use mf and then set the exposure for wherever you want it - or, as you say move the focus indicator around using the arrows - but that's a bit slow and fiddly for my taste. there's clearly lots to learn - it all makes the m seem wonderfully simple and instinctive :-)", "sortedWord": "None", "identifyer": 12086, "year": "2016"}, {"Unnamed: 0": 448617, "autor": "BAASCH", "date": 1471188240000, "content": " Our beloved X Vario, with its almost equally beloved beloved quirks (\"almost\"... see the first link in my signature, below), forces us to devise cunning exposure strategies. We have no exposure lock (holding the shutter release doesn't count if you want to focus after setting the exposure) and manual shutter speed is set in full stops only. How to achieve perfect exposures? After using center weighted metering for a while, lately I've been experimenting with spot metering. This seems to give me considerably more control. I use it in conjunction with aperture priority and exposure compensation; sometimes also in full manual mode (but then the full stop shutter speed dial quickly becomes a problem again). Most of the time I don't bother to pick a part of the scene that I want to place in a certain Adams' Zone — this would be feasible with exposure lock, or again with full manual — but instead I just decide where the spot area that I am focusing on should be placed, Zone-wise, and dial in exposure compensation, a little on the conservative side (0 for V, ⅔ for VI, 1⅓ for VII and 2 for VIII, which is often too much already, at least in the jpegs; the negative compensation follows a mirrored pattern). I find this works quite well. Only when there is an important highlight outside the focus rectangle (that coincides with the metering 'spot') will I revert to full manual and meter off that highlight, and hope that my full stop shutter speeds will fit the bill. How are others' experiences with this approach?", "link": "https://www.l-camera-forum.com/topic/263498-best-exposure-strategy/?tab=comments#comment-3096119", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " our beloved x vario, with its almost equally beloved beloved quirks (\"almost\"... see the first link in my signature, below), forces us to devise cunning exposure strategies. we have no exposure lock (holding the shutter release doesn't count if you want to focus after setting the exposure) and manual shutter speed is set in full stops only. how to achieve perfect exposures? after using center weighted metering for a while, lately i've been experimenting with -----> spot !!!  metering. this seems to give me considerably more control. i use it in conjunction with aperture priority and exposure compensation; sometimes also in full manual mode (but then the full stop shutter speed dial quickly becomes a problem again). most of the time i don't bother to pick a part of the scene that i want to place in a certain adams' zone — this would be feasible with exposure lock, or again with full manual — but instead i just decide where the spot area that i am focusing on should be placed, zone-wise, and dial in exposure compensation, a little on the conservative side (0 for v, ⅔ for vi, 1⅓ for vii and 2 for viii, which is often too much already, at least in the jpegs; the negative compensation follows a mirrored pattern). i find this works quite well. only when there is an important highlight outside the focus rectangle (that coincides with the metering 'spot') will i revert to full manual and meter off that highlight, and hope that my full stop shutter speeds will fit the bill. how are others' experiences with this approach?", "sortedWord": "None", "identifyer": 12103, "year": "2016"}, {"Unnamed: 0": 448618, "autor": "Manoleica", "date": 1471188720000, "content": "Cor Blimey\" - watta performance\" are you taking pictures or preparing to write a Thesis! -- I use Aperture Priority, Spot and chimp if I think it's necessary...", "link": "https://www.l-camera-forum.com/topic/263498-best-exposure-strategy/?tab=comments#comment-3096130", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "cor blimey\" - watta performance\" are you taking pictures or preparing to write a thesis! -- i use aperture priority, -----> spot !!!  and chimp if i think it's necessary...", "sortedWord": "None", "identifyer": 12104, "year": "2016"}, {"Unnamed: 0": 448619, "autor": "BAASCH", "date": 1471190040000, "content": "Cor Blimey\" - watta performance\" are you taking pictures or preparing to write a Thesis! -- I use Aperture Priority, Spot and chimp if I think it's necessary... Haha, yes, writing a thesis, too. But on a different subject.", "link": "https://www.l-camera-forum.com/topic/263498-best-exposure-strategy/?tab=comments#comment-3096153", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "cor blimey\" - watta performance\" are you taking pictures or preparing to write a thesis! -- i use aperture priority, -----> spot !!!  and chimp if i think it's necessary... haha, yes, writing a thesis, too. but on a different subject.", "sortedWord": "None", "identifyer": 12105, "year": "2016"}, {"Unnamed: 0": 448620, "autor": "teb1013", "date": 1471202880000, "content": "Great post!! I mostly use spot. I've never been one for center weighting, in any camera. I usually use aperture priority but sometimes use \"chimp mode\" if I'm lazy or in a hurry. I need to use this camera a bit longer to get into exposure compensation. Thanks for the tips, the X-Vario has me back taking pictures again after slacking off with other equipment to \"special events only\".", "link": "https://www.l-camera-forum.com/topic/263498-best-exposure-strategy/?tab=comments#comment-3096249", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "great post!! i mostly use -----> spot !!! . i've never been one for center weighting, in any camera. i usually use aperture priority but sometimes use \"chimp mode\" if i'm lazy or in a hurry. i need to use this camera a bit longer to get into exposure compensation. thanks for the tips, the x-vario has me back taking pictures again after slacking off with other equipment to \"special events only\".", "sortedWord": "None", "identifyer": 12106, "year": "2016"}, {"Unnamed: 0": 448693, "autor": "Trivette", "date": 1464329040000, "content": "......I take the camera off of automatic aperture exposure and set it for f5.6 or f8. I let the shutter speed be determined automatically. The reason for the above shooting method is that the auto focus is a little slow and it tends to sometimes focus on something closer than I want. Having a bigger depth of field yields a great result each time...... I think sometimes people use 11 point AF as a snapshot mode without tweaking it manually to focus on the subject. It helps to increase the DoF by choosing a smaller aperture, but I have found that using 1 point or spot AF in conjunction with focus lock is very reliable, even in program exposure mode.", "link": "https://www.l-camera-forum.com/topic/259727-is-an-original-x1-still-worth-buying/page/2/?tab=comments#comment-3051945", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "......i take the camera off of automatic aperture exposure and set it for f5.6 or f8. i let the shutter speed be determined automatically. the reason for the above shooting method is that the auto focus is a little slow and it tends to sometimes focus on something closer than i want. having a bigger depth of field yields a great result each time...... i think sometimes people use 11 point af as a snapshot mode without tweaking it manually to focus on the subject. it helps to increase the dof by choosing a smaller aperture, but i have found that using 1 point or -----> spot !!!  af in conjunction with focus lock is very reliable, even in program exposure mode.", "sortedWord": "None", "identifyer": 12180, "year": "2016"}, {"Unnamed: 0": 448741, "autor": "acuba777", "date": 1469607480000, "content": "and folks, what about focussing? how do you prefer it: spot, 1 or 11 points? Any tips here? How reliable spot focussing works? I have tried solar only 1 point focussing...", "link": "https://www.l-camera-forum.com/topic/259727-is-an-original-x1-still-worth-buying/page/4/?tab=comments#comment-3085958", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "and folks, what about focussing? how do you prefer it: -----> spot !!! , 1 or 11 points? any tips here? how reliable spot focussing works? i have tried solar only 1 point focussing...", "sortedWord": "None", "identifyer": 12228, "year": "2016"}, {"Unnamed: 0": 448745, "autor": "Trivette", "date": 1469617980000, "content": "Assuming that the AF on the X2 uses contrast detection, 1 point should be more reliable than spot, so I use mostly 1 point. For landscapes, I may zone focus using MF, usually at hyperfocal or even greater distance. Edited July 27, 2016 by Trivette", "link": "https://www.l-camera-forum.com/topic/259727-is-an-original-x1-still-worth-buying/page/4/?tab=comments#comment-3086049", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "assuming that the af on the x2 uses contrast detection, 1 point should be more reliable than -----> spot !!! , so i use mostly 1 point. for landscapes, i may zone focus using mf, usually at hyperfocal or even greater distance. edited july 27, 2016 by trivette", "sortedWord": "None", "identifyer": 12232, "year": "2016"}, {"Unnamed: 0": 448831, "autor": "BAASCH", "date": 1462370880000, "content": " Having noticed that my (wonderful) new Vario tends to overexpose more often than I'm used to, I decided to test the camera's light meter using the Sunny/16 rule. Using a high quality 18 percent grey card in direct sunlight, I made a series of measurements that raise more questions than I myself can answer, so I'm hoping some of you may be able to help. The idea is that the camera, using aperture priority, should pick a shutter speed equal to the ISO value. Instead, with spot metering, the shutter speeds are double the expected value: ISO 100 : 1/200 ISO 200 : 1/400 ISO 400 : 1/800 etcetera With centre-weighted metering the results are different (though they should be the same, having taken care to fill the frame with the grey card): ISO 100 : 1/160 ISO 200 : 1/320 ISO 400 : 1/640 etcetera Now to make things even more complicated, I found that in manual mode, the on screen exposure meter reads zero at a third set of values: ISO 100 : 1/125 ISO 200 : 1/250 ISO 400 : 1/500 etcetera With this final test, there was no difference between spot and centre-weighted metering, which presents us with yet another riddle... Can anyone explain this? Or try to replicate these results with their Vario, just to rule out that I have a faulty item? Also, I'd welcome advice about adjusting exposure strategies in light (pun intended) of these irregularities. I use spot metering most of the time, and my thinking about exposure is largely in terms of Adams' Zones. Edited May 4, 2016 by Mandemaker", "link": "https://www.l-camera-forum.com/topic/260148-unexpected-results-when-testing-the-x-vario-light-meter/?tab=comments#comment-3039010", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " having noticed that my (wonderful) new vario tends to overexpose more often than i'm used to, i decided to test the camera's light meter using the sunny/16 rule. using a high quality 18 percent grey card in direct sunlight, i made a series of measurements that raise more questions than i myself can answer, so i'm hoping some of you may be able to help. the idea is that the camera, using aperture priority, should pick a shutter speed equal to the iso value. instead, with -----> spot !!!  metering, the shutter speeds are double the expected value: iso 100 : 1/200 iso 200 : 1/400 iso 400 : 1/800 etcetera with centre-weighted metering the results are different (though they should be the same, having taken care to fill the frame with the grey card): iso 100 : 1/160 iso 200 : 1/320 iso 400 : 1/640 etcetera now to make things even more complicated, i found that in manual mode, the on screen exposure meter reads zero at a third set of values: iso 100 : 1/125 iso 200 : 1/250 iso 400 : 1/500 etcetera with this final test, there was no difference between spot and centre-weighted metering, which presents us with yet another riddle... can anyone explain this? or try to replicate these results with their vario, just to rule out that i have a faulty item? also, i'd welcome advice about adjusting exposure strategies in light (pun intended) of these irregularities. i use spot metering most of the time, and my thinking about exposure is largely in terms of adams' zones. edited may 4, 2016 by mandemaker", "sortedWord": "None", "identifyer": 12319, "year": "2016"}, {"Unnamed: 0": 448832, "autor": "pop", "date": 1462376940000, "content": "First of all, Sunny16 is a rule of thumb which is not legally binding for digital cameras. It's certainly fine for photographing on film and it's perfectly good for an informed guess. You say that your camera overexposes with respect to what you expect, given the Sunny16 rule. However, the exposure times you name indicate an underexposure by one f-stop. 1/200sec admits half as much light as 1/100sec. The different values the camera arrives at between spot metering and center-weighted metering do not - in practice - matter much, being much less than a third of a stop. I have no idea as to the cause of the difference. When I do similar tests in my office, I see no difference in the metering results. However, I take great care not to change my position with respect to the light source and the grey card (which is the door of a cupboard in my case). Just moving by a few centimeters will result in a quite different reading. I can't explain the difference you obtain between manual and automatic exposure, either, as I can not reliably reproduce it. Again, the position of my body with respect to the light source and the gray card has the largest influence. On the whole, I'd think your X Vario performs perfectly well. When trying to apply the zone system, I think you'd to well to perform a few tests in order to determine how much light the sensor needs for rendering zone X. That's IMO the most important thing to determine so as not to blow your highlights. That's commonly called ETTR, \"Expose To The Right\".", "link": "https://www.l-camera-forum.com/topic/260148-unexpected-results-when-testing-the-x-vario-light-meter/?tab=comments#comment-3039055", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "first of all, sunny16 is a rule of thumb which is not legally binding for digital cameras. it's certainly fine for photographing on film and it's perfectly good for an informed guess. you say that your camera overexposes with respect to what you expect, given the sunny16 rule. however, the exposure times you name indicate an underexposure by one f-stop. 1/200sec admits half as much light as 1/100sec. the different values the camera arrives at between -----> spot !!!  metering and center-weighted metering do not - in practice - matter much, being much less than a third of a stop. i have no idea as to the cause of the difference. when i do similar tests in my office, i see no difference in the metering results. however, i take great care not to change my position with respect to the light source and the grey card (which is the door of a cupboard in my case). just moving by a few centimeters will result in a quite different reading. i can't explain the difference you obtain between manual and automatic exposure, either, as i can not reliably reproduce it. again, the position of my body with respect to the light source and the gray card has the largest influence. on the whole, i'd think your x vario performs perfectly well. when trying to apply the zone system, i think you'd to well to perform a few tests in order to determine how much light the sensor needs for rendering zone x. that's imo the most important thing to determine so as not to blow your highlights. that's commonly called ettr, \"expose to the right\".", "sortedWord": "None", "identifyer": 12320, "year": "2016"}, {"Unnamed: 0": 448835, "autor": "mikeodial", "date": 1464454560000, "content": "Having noticed that my (wonderful) new Vario tends to overexpose more often than I'm used to, I decided to test the camera's light meter using the Sunny/16 rule. Using a high quality 18 percent grey card in direct sunlight, I made a series of measurements that raise more questions than I myself can answer, so I'm hoping some of you may be able to help. The idea is that the camera, using aperture priority, should pick a shutter speed equal to the ISO value. Instead, with spot metering, the shutter speeds are double the expected value: ISO 100 : 1/200 ISO 200 : 1/400 ISO 400 : 1/800 etcetera With centre-weighted metering the results are different (though they should be the same, having taken care to fill the frame with the grey card): ISO 100 : 1/160 ISO 200 : 1/320 ISO 400 : 1/640 etcetera Now to make things even more complicated, I found that in manual mode, the on screen exposure meter reads zero at a third set of values: ISO 100 : 1/125 ISO 200 : 1/250 ISO 400 : 1/500 etcetera With this final test, there was no difference between spot and centre-weighted metering, which presents us with yet another riddle... Can anyone explain this? Or try to replicate these results with their Vario, just to rule out that I have a faulty item? Also, I'd welcome advice about adjusting exposure strategies in light (pun intended) of these irregularities. I use spot metering most of the time, and my thinking about exposure is largely in terms of Adams' Zones. I have been shocked in my now three months with the camera how good the light meter is. After playing with my tenedency to \"underexpose\" a little (I have Sigma cameras and always trying to avoid blowing the highlights), I have come to trust the X Vario implicitly. The only change I like is a little extra shapening on the color RAW images when needed. So perhaps you have a problem with the camera; again I am not an expert, but there is seems very little you have to do with an X Vario image if correctly exposed. BTW I shoot manual ALL the time.", "link": "https://www.l-camera-forum.com/topic/260148-unexpected-results-when-testing-the-x-vario-light-meter/?tab=comments#comment-3052708", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "having noticed that my (wonderful) new vario tends to overexpose more often than i'm used to, i decided to test the camera's light meter using the sunny/16 rule. using a high quality 18 percent grey card in direct sunlight, i made a series of measurements that raise more questions than i myself can answer, so i'm hoping some of you may be able to help. the idea is that the camera, using aperture priority, should pick a shutter speed equal to the iso value. instead, with -----> spot !!!  metering, the shutter speeds are double the expected value: iso 100 : 1/200 iso 200 : 1/400 iso 400 : 1/800 etcetera with centre-weighted metering the results are different (though they should be the same, having taken care to fill the frame with the grey card): iso 100 : 1/160 iso 200 : 1/320 iso 400 : 1/640 etcetera now to make things even more complicated, i found that in manual mode, the on screen exposure meter reads zero at a third set of values: iso 100 : 1/125 iso 200 : 1/250 iso 400 : 1/500 etcetera with this final test, there was no difference between spot and centre-weighted metering, which presents us with yet another riddle... can anyone explain this? or try to replicate these results with their vario, just to rule out that i have a faulty item? also, i'd welcome advice about adjusting exposure strategies in light (pun intended) of these irregularities. i use spot metering most of the time, and my thinking about exposure is largely in terms of adams' zones. i have been shocked in my now three months with the camera how good the light meter is. after playing with my tenedency to \"underexpose\" a little (i have sigma cameras and always trying to avoid blowing the highlights), i have come to trust the x vario implicitly. the only change i like is a little extra shapening on the color raw images when needed. so perhaps you have a problem with the camera; again i am not an expert, but there is seems very little you have to do with an x vario image if correctly exposed. btw i shoot manual all the time.", "sortedWord": "None", "identifyer": 12323, "year": "2016"}, {"Unnamed: 0": 448857, "autor": "Trivette", "date": 1464235320000, "content": "Thank you for this information. I specify to you that all this is in the excellent site of X Vario of Gerd Waloszek : http://www.waloszek.de/overview_lxv_e.php Guytou This is a very comprehensive in-depth discussion of the X Vario, one of the best I have seen about any camera. Especially interesting to me were his comparisons between images focused at infinity and at hyperfocal distance. Also, he found that one point AF was generally more dependable than spot AF. I have incorporated his findings into my own shooting methods. My simplified hyperfocal table is merely an edited version of the one he worked out. Anyone who appreciates technical information regarding the X Vario can benefit from this site.", "link": "https://www.l-camera-forum.com/topic/257559-manual-focusing-techniques-for-the-x-vario-with-an-leica-evf2/page/2/?tab=comments#comment-3051264", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thank you for this information. i specify to you that all this is in the excellent site of x vario of gerd waloszek : http://www.waloszek.de/overview_lxv_e.php guytou this is a very comprehensive in-depth discussion of the x vario, one of the best i have seen about any camera. especially interesting to me were his comparisons between images focused at infinity and at hyperfocal distance. also, he found that one point af was generally more dependable than -----> spot !!!  af. i have incorporated his findings into my own shooting methods. my simplified hyperfocal table is merely an edited version of the one he worked out. anyone who appreciates technical information regarding the x vario can benefit from this site.", "sortedWord": "None", "identifyer": 12345, "year": "2016"}, {"Unnamed: 0": 448952, "autor": "tri", "date": 1460888700000, "content": "Why don't you check http://www.dxomark.com/Cameras/Ratings ? You'll be able to compare low light (they call it \"Sports\") capabilities of a variety of cameras. Of course, the X Vario is no match for the Q but it's not bad either. Strong bias for Sony, at the moment beyond seriosity (spot number on their \"list\"): in \"Sports\" the Sony RX1 II (5) is ahead of the Nikon D4S (6) and Canon 1Dx (15) only two spots ahead of the AF-desaster Sony RX1 (old)", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/4/?tab=comments#comment-3028278", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "why don't you check http://www.dxomark.com/cameras/ratings ? you'll be able to compare low light (they call it \"sports\") capabilities of a variety of cameras. of course, the x vario is no match for the q but it's not bad either. strong bias for sony, at the moment beyond seriosity (-----> spot !!!  number on their \"list\"): in \"sports\" the sony rx1 ii (5) is ahead of the nikon d4s (6) and canon 1dx (15) only two spots ahead of the af-desaster sony rx1 (old)", "sortedWord": "None", "identifyer": 12441, "year": "2016"}, {"Unnamed: 0": 448953, "autor": "BAASCH", "date": 1461827880000, "content": "I received my new Vario a few days ago, did one shoot with a model with it, and it fully lives up to my expectations. It's a wonderful piece of photographic machinery. It really is like having four primes. The Canon and its lenses didn't leave their bag during the shoot. So is the Vario perfect? Of course not. But I agree with some of the participants here that a firmware update would probably suffice to 'renew' it. A few weeks ago, I exchanged a few emails with a very friendly person working at Leica concerning my X2, and I am compiling a list of requests/suggestions that I intend to send to him. Here's what I have so far. Comments and additional items welcome (but bear in mind that, being the one who sends it, I will only include the ones that I agree with). When using spot for light metering in conjunction with manual focus, provide a mark at the center of the image indicating the size of the area that is used for metering (the X2 has this, but on the Vario there is no mark at all). Auto ISO in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. Make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing a user profile or the light metering mode, and perhaps other functions. Make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). Allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add ISO and f-stop values to the information that can be shown. Add focus type (manual/auto) to the EXIF information written with the image files. Add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. Improve live view to reflect the chosen exposure more accurately (when half-pressing the shutter button). Shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off'. Enable user to enter basic copyright information that will be added to all images automatically. These improvements, or any subset of them, would make the Vario even more wonderful than it already is. And Leica would score goodwill points all over the place with a firmware update like this. I'll be sending the email in a week or so, and will report back on the reply.", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/4/?tab=comments#comment-3034897", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i received my new vario a few days ago, did one shoot with a model with it, and it fully lives up to my expectations. it's a wonderful piece of photographic machinery. it really is like having four primes. the canon and its lenses didn't leave their bag during the shoot. so is the vario perfect? of course not. but i agree with some of the participants here that a firmware update would probably suffice to 'renew' it. a few weeks ago, i exchanged a few emails with a very friendly person working at leica concerning my x2, and i am compiling a list of requests/suggestions that i intend to send to him. here's what i have so far. comments and additional items welcome (but bear in mind that, being the one who sends it, i will only include the ones that i agree with). when using -----> spot !!!  for light metering in conjunction with manual focus, provide a mark at the center of the image indicating the size of the area that is used for metering (the x2 has this, but on the vario there is no mark at all). auto iso in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing a user profile or the light metering mode, and perhaps other functions. make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add iso and f-stop values to the information that can be shown. add focus type (manual/auto) to the exif information written with the image files. add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. improve live view to reflect the chosen exposure more accurately (when half-pressing the shutter button). shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off'. enable user to enter basic copyright information that will be added to all images automatically. these improvements, or any subset of them, would make the vario even more wonderful than it already is. and leica would score goodwill points all over the place with a firmware update like this. i'll be sending the email in a week or so, and will report back on the reply.", "sortedWord": "None", "identifyer": 12442, "year": "2016"}, {"Unnamed: 0": 448954, "autor": "Sho-Bud", "date": 1462189680000, "content": "I received my new Vario a few days ago, did one shoot with a model with it, and it fully lives up to my expectations. It's a wonderful piece of photographic machinery. It really is like having four primes. The Canon and its lenses didn't leave their bag during the shoot. So is the Vario perfect? Of course not. But I agree with some of the participants here that a firmware update would probably suffice to 'renew' it. A few weeks ago, I exchanged a few emails with a very friendly person working at Leica concerning my X2, and I am compiling a list of requests/suggestions that I intend to send to him. Here's what I have so far. Comments and additional items welcome (but bear in mind that, being the one who sends it, I will only include the ones that I agree with). When using spot for light metering in conjunction with manual focus, provide a mark at the center of the image indicating the size of the area that is used for metering (the X2 has this, but on the Vario there is no mark at all). Auto ISO in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. Make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing a user profile or the light metering mode, and perhaps other functions. Make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). Allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add ISO and f-stop values to the information that can be shown. Add focus type (manual/auto) to the EXIF information written with the image files. Add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. Improve live view to reflect the chosen exposure more accurately (when half-pressing the shutter button). Shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off'. Enable user to enter basic copyright information that will be added to all images automatically. These improvements, or any subset of them, would make the Vario even more wonderful than it already is. And Leica would score goodwill points all over the place with a firmware update like this. I'll be sending the email in a week or so, and will report back on the reply. And maybe also: 1. A buttonguard, eg. sometimes accidentally one of the buttons left of the screen are pressed. So an option that you would have to press the 6 o'clock of the 4-way button simultanious would be great. 2.Continuous auto focus, ( I also have an Olympus XZ-1, everyone was raving about it's focus speed, but actually, it has a permanent continuous auto focus, which speeds up things considerably) 3. Focus peaking 4. When face detection is switched on, and the camera fails to recognize a face, it falls back to multi-point auto focus. I would like it to choose to what mode it falls back. The easiest way would be if face detection isn't a separate mode, but an option you can switch on or of. So you can choose your preferred focus mode, and additionally switch on or of the face detection. 5. Face detection with nearest eye detection. 6. More precise auto focus algorithm. 7. Multi-point spot metering", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/4/?tab=comments#comment-3037519", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i received my new vario a few days ago, did one shoot with a model with it, and it fully lives up to my expectations. it's a wonderful piece of photographic machinery. it really is like having four primes. the canon and its lenses didn't leave their bag during the shoot. so is the vario perfect? of course not. but i agree with some of the participants here that a firmware update would probably suffice to 'renew' it. a few weeks ago, i exchanged a few emails with a very friendly person working at leica concerning my x2, and i am compiling a list of requests/suggestions that i intend to send to him. here's what i have so far. comments and additional items welcome (but bear in mind that, being the one who sends it, i will only include the ones that i agree with). when using -----> spot !!!  for light metering in conjunction with manual focus, provide a mark at the center of the image indicating the size of the area that is used for metering (the x2 has this, but on the vario there is no mark at all). auto iso in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing a user profile or the light metering mode, and perhaps other functions. make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add iso and f-stop values to the information that can be shown. add focus type (manual/auto) to the exif information written with the image files. add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. improve live view to reflect the chosen exposure more accurately (when half-pressing the shutter button). shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off'. enable user to enter basic copyright information that will be added to all images automatically. these improvements, or any subset of them, would make the vario even more wonderful than it already is. and leica would score goodwill points all over the place with a firmware update like this. i'll be sending the email in a week or so, and will report back on the reply. and maybe also: 1. a buttonguard, eg. sometimes accidentally one of the buttons left of the screen are pressed. so an option that you would have to press the 6 o'clock of the 4-way button simultanious would be great. 2.continuous auto focus, ( i also have an olympus xz-1, everyone was raving about it's focus speed, but actually, it has a permanent continuous auto focus, which speeds up things considerably) 3. focus peaking 4. when face detection is switched on, and the camera fails to recognize a face, it falls back to multi-point auto focus. i would like it to choose to what mode it falls back. the easiest way would be if face detection isn't a separate mode, but an option you can switch on or of. so you can choose your preferred focus mode, and additionally switch on or of the face detection. 5. face detection with nearest eye detection. 6. more precise auto focus algorithm. 7. multi-point spot metering", "sortedWord": "None", "identifyer": 12443, "year": "2016"}, {"Unnamed: 0": 448955, "autor": "Sho-Bud", "date": 1462215120000, "content": "And maybe also: 1. A buttonguard, eg. sometimes accidentally one of the buttons left of the screen are pressed. So an option that you would have to press the 6 o'clock of the 4-way button simultanious would be great. 2.Continuous auto focus, ( I also have an Olympus XZ-1, everyone was raving about it's focus speed, but actually, it has a permanent continuous auto focus, which speeds up things considerably) 3. Focus peaking 4. When face detection is switched on, and the camera fails to recognize a face, it falls back to multi-point auto focus. I would like it to choose to what mode it falls back. The easiest way would be if face detection isn't a separate mode, but an option you can switch on or of. So you can choose your preferred focus mode, and additionally switch on or of the face detection. 5. Face detection with nearest eye detection. 6. More precise auto focus algorithm. 7. Multi-point spot metering I forgot no. 8: make the usb port support a cable release", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/4/?tab=comments#comment-3037754", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "and maybe also: 1. a buttonguard, eg. sometimes accidentally one of the buttons left of the screen are pressed. so an option that you would have to press the 6 o'clock of the 4-way button simultanious would be great. 2.continuous auto focus, ( i also have an olympus xz-1, everyone was raving about it's focus speed, but actually, it has a permanent continuous auto focus, which speeds up things considerably) 3. focus peaking 4. when face detection is switched on, and the camera fails to recognize a face, it falls back to multi-point auto focus. i would like it to choose to what mode it falls back. the easiest way would be if face detection isn't a separate mode, but an option you can switch on or of. so you can choose your preferred focus mode, and additionally switch on or of the face detection. 5. face detection with nearest eye detection. 6. more precise auto focus algorithm. 7. multi-point -----> spot !!!  metering i forgot no. 8: make the usb port support a cable release", "sortedWord": "None", "identifyer": 12444, "year": "2016"}, {"Unnamed: 0": 448956, "autor": "TMorita", "date": 1462516200000, "content": "And maybe also: 1. A buttonguard, eg. sometimes accidentally one of the buttons left of the screen are pressed. So an option that you would have to press the 6 o'clock of the 4-way button simultanious would be great. 2.Continuous auto focus, ( I also have an Olympus XZ-1, everyone was raving about it's focus speed, but actually, it has a permanent continuous auto focus, which speeds up things considerably) 3. Focus peaking 4. When face detection is switched on, and the camera fails to recognize a face, it falls back to multi-point auto focus. I would like it to choose to what mode it falls back. The easiest way would be if face detection isn't a separate mode, but an option you can switch on or of. So you can choose your preferred focus mode, and additionally switch on or of the face detection. 5. Face detection with nearest eye detection. 6. More precise auto focus algorithm. 7. Multi-point spot metering 1. Zebras so I can see which regions are clipping. 2. Disable setting effect preview when the shutter is half-pressed. 3. Selectable focus region sizes - small, medium, large", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/4/?tab=comments#comment-3040112", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "and maybe also: 1. a buttonguard, eg. sometimes accidentally one of the buttons left of the screen are pressed. so an option that you would have to press the 6 o'clock of the 4-way button simultanious would be great. 2.continuous auto focus, ( i also have an olympus xz-1, everyone was raving about it's focus speed, but actually, it has a permanent continuous auto focus, which speeds up things considerably) 3. focus peaking 4. when face detection is switched on, and the camera fails to recognize a face, it falls back to multi-point auto focus. i would like it to choose to what mode it falls back. the easiest way would be if face detection isn't a separate mode, but an option you can switch on or of. so you can choose your preferred focus mode, and additionally switch on or of the face detection. 5. face detection with nearest eye detection. 6. more precise auto focus algorithm. 7. multi-point -----> spot !!!  metering 1. zebras so i can see which regions are clipping. 2. disable setting effect preview when the shutter is half-pressed. 3. selectable focus region sizes - small, medium, large", "sortedWord": "None", "identifyer": 12445, "year": "2016"}, {"Unnamed: 0": 448962, "autor": "BAASCH", "date": 1463396340000, "content": "Here's the full text of the email I just sent to Leica. I didn't copy most of the suggestions provided by some of you, because I thought they were either unfeasible or low priority (sorry!). Now let's see what happens... I do hope Leica will allocate some resources to implement at least the most important improvements. We exchanged a few emails earlier, and I am taking the liberty to approach you again. After acquiring a second hand X2 last month, I now bought a new X Vario. I am positively stunned by the image quality. This camera is not much loved by many, but it deserves high praise! However, it also deserves… a 1.2 (or 2.0) firmware update. I know Leica would make many loyal X Vario users very happy (and even more loyal) with an update that would take care of the following things. A subset of these improvements would also be very welcome, to be sure, which is why I put the items in order of importance, as I see it. I also asked for improvement suggestions at the Leica forum, and it seems my initiative was well received there. Add exposure lock. Half-pressing the shutter button is not always an option, because the user may want to focus on a different part of the scene than the part that the exposure should be based on. When using spot for light metering in conjunction with manual focus, provide a mark at the center of the image so user knows which area is used for metering (the X2 has this). Make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing user profile or light metering mode, or perhaps other functions. Make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). Allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add ISO and f-stop to the information that can be shown. For example, I’d like to see the histogram, but not the rule of thirds grid. Allow user to choose to have the exposure bar (I mean the display feature showing light measurement in third stops relative to a zero point in the middle) visible at all times (now it disappears after about 12 seconds, which is inconvenient when using spot metering to measure different light values in a scene). Auto ISO in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. Make the shutter speed adjustable in smaller increments through use of a button/dial. When using an incident light meter, precise shutter speed values sometimes need to be set on the camera. Get rid of the semi-transparent bars on top and bottom of the most information-rich display view. They obscure parts of the target frame, and seem to serve no real purpose. Change the histogram to the one seen on the X2 with the horizontal bar showing Adams’ Zones. Improve live view to reflect the chosen exposure more accurately (when half-pressing the shutter button), and/or allow user to turn it off completely, making the viewfinder, whether LCD or EFV, function more like an optical viewfinder. Add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. The jpegs this camera produces are excellent, and for some situations, having film simulation bracketing would remove the need for shooting DNG. Add focus type (manual/auto) to the EXIF information written with the image files. Shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off’. Enable user to enter basic copyright information that will be added to all images automatically. Leica is in a position to make this amazing camera even better. Many people are still buying the X Vario, new, and I am sure they are all hoping for improvements like those listed above. Please, take the X Vario from “sehr gut” to “fabelhaft”!", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/5/?tab=comments#comment-3045766", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "here's the full text of the email i just sent to leica. i didn't copy most of the suggestions provided by some of you, because i thought they were either unfeasible or low priority (sorry!). now let's see what happens... i do hope leica will allocate some resources to implement at least the most important improvements. we exchanged a few emails earlier, and i am taking the liberty to approach you again. after acquiring a second hand x2 last month, i now bought a new x vario. i am positively stunned by the image quality. this camera is not much loved by many, but it deserves high praise! however, it also deserves… a 1.2 (or 2.0) firmware update. i know leica would make many loyal x vario users very happy (and even more loyal) with an update that would take care of the following things. a subset of these improvements would also be very welcome, to be sure, which is why i put the items in order of importance, as i see it. i also asked for improvement suggestions at the leica forum, and it seems my initiative was well received there. add exposure lock. half-pressing the shutter button is not always an option, because the user may want to focus on a different part of the scene than the part that the exposure should be based on. when using -----> spot !!!  for light metering in conjunction with manual focus, provide a mark at the center of the image so user knows which area is used for metering (the x2 has this). make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing user profile or light metering mode, or perhaps other functions. make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add iso and f-stop to the information that can be shown. for example, i’d like to see the histogram, but not the rule of thirds grid. allow user to choose to have the exposure bar (i mean the display feature showing light measurement in third stops relative to a zero point in the middle) visible at all times (now it disappears after about 12 seconds, which is inconvenient when using spot metering to measure different light values in a scene). auto iso in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. make the shutter speed adjustable in smaller increments through use of a button/dial. when using an incident light meter, precise shutter speed values sometimes need to be set on the camera. get rid of the semi-transparent bars on top and bottom of the most information-rich display view. they obscure parts of the target frame, and seem to serve no real purpose. change the histogram to the one seen on the x2 with the horizontal bar showing adams’ zones. improve live view to reflect the chosen exposure more accurately (when half-pressing the shutter button), and/or allow user to turn it off completely, making the viewfinder, whether lcd or efv, function more like an optical viewfinder. add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. the jpegs this camera produces are excellent, and for some situations, having film simulation bracketing would remove the need for shooting dng. add focus type (manual/auto) to the exif information written with the image files. shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off’. enable user to enter basic copyright information that will be added to all images automatically. leica is in a position to make this amazing camera even better. many people are still buying the x vario, new, and i am sure they are all hoping for improvements like those listed above. please, take the x vario from “sehr gut” to “fabelhaft”!", "sortedWord": "None", "identifyer": 12451, "year": "2016"}, {"Unnamed: 0": 449048, "autor": "okli", "date": 1456996320000, "content": "What I saw with very limited tests so far is that the camera tries to keep the highlights very strictly - the initial tests with the standard film produced dull / cold jpegs to me too. After that I switched to Vivid and the colours were here very pleasing (oranges, apples and bananas as test subjects) - really vivid but not oversaturated. The jpegs OOC were ok, the DNGs from LR clearly with blown out highlights at the spots where the light source reflected on the orange surface for example. I'm waiting here for the sun to come out for more tests. Regarding histogram - is it possible to turn it on on the lcd all the time? I think I turned everything on in the settings, but I can only verify the exposure AFTER the shot and not BEFORE I take the shot? Will be very helpful.", "link": "https://www.l-camera-forum.com/topic/240599-leica-x-type-113-and-lightroom/?tab=comments#comment-3000765", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "what i saw with very limited tests so far is that the camera tries to keep the highlights very strictly - the initial tests with the standard film produced dull / cold jpegs to me too. after that i switched to vivid and the colours were here very pleasing (oranges, apples and bananas as test subjects) - really vivid but not oversaturated. the jpegs ooc were ok, the dngs from lr clearly with blown out highlights at the -----> spots !!!  where the light source reflected on the orange surface for example. i'm waiting here for the sun to come out for more tests. regarding histogram - is it possible to turn it on on the lcd all the time? i think i turned everything on in the settings, but i can only verify the exposure after the shot and not before i take the shot? will be very helpful.", "sortedWord": "None", "identifyer": 12537, "year": "2016"}, {"Unnamed: 0": 449096, "autor": "prk60091", "date": 1453047120000, "content": "When I used the X1 I used 'spot focus' and 'center weighted' metering.", "link": "https://www.l-camera-forum.com/topic/255708-is-there-a-secret-to-unlock-the-magic-of-the-x1/?tab=comments#comment-2970619", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "when i used the x1 i used '-----> spot !!!  focus' and 'center weighted' metering.", "sortedWord": "None", "identifyer": 12586, "year": "2016"}, {"Unnamed: 0": 449105, "autor": "tom0511", "date": 1453121700000, "content": "also maybe use spot focus more often to make sure you dont focus behind the subject", "link": "https://www.l-camera-forum.com/topic/255708-is-there-a-secret-to-unlock-the-magic-of-the-x1/?tab=comments#comment-2971263", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "also maybe use -----> spot !!!  focus more often to make sure you dont focus behind the subject", "sortedWord": "None", "identifyer": 12595, "year": "2016"}, {"Unnamed: 0": 449132, "autor": "Trivette", "date": 1454666040000, "content": "I have the grip which is very useful, I also have the VF but since there is no information about focus than a green light, there is no way to know you are focusing correctly so I decided to use it as is. As with all my cameras I only shoot raw and process the files in Lightroom, with jpgs I never get the look I love in BW pics. It is a very nice little camera indeed --img--  It's important to take into consideration the focus mode being used. The best AF in the world cannot read the mind of the photographer. I have found spot focus to be dependable and accurate if used correctly. Agree. The real magic resides in what is in front of the lens. I can take a crappy pic with or without the vf attached --img--  The magic of the photograph is in the person behind the camera, not the object in front of the lens. --img-- ", "link": "https://www.l-camera-forum.com/topic/255708-is-there-a-secret-to-unlock-the-magic-of-the-x1/page/3/?tab=comments#comment-2983352", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have the grip which is very useful, i also have the vf but since there is no information about focus than a green light, there is no way to know you are focusing correctly so i decided to use it as is. as with all my cameras i only shoot raw and process the files in lightroom, with jpgs i never get the look i love in bw pics. it is a very nice little camera indeed --img--  it's important to take into consideration the focus mode being used. the best af in the world cannot read the mind of the photographer. i have found -----> spot !!!  focus to be dependable and accurate if used correctly. agree. the real magic resides in what is in front of the lens. i can take a crappy pic with or without the vf attached --img--  the magic of the photograph is in the person behind the camera, not the object in front of the lens. --img-- ", "sortedWord": "None", "identifyer": 12622, "year": "2016"}, {"Unnamed: 0": 449141, "autor": "leicadude", "date": 1458314280000, "content": "It's important to take into consideration the focus mode being used. The best AF in the world cannot read the mind of the photographer. I have found spot focus to be dependable and accurate if used correctly. The magic of the photograph is in the person behind the camera, not the object in front of the lens. Nice photo! What's that large object the photographer is holding in front of his face? --img-- ", "link": "https://www.l-camera-forum.com/topic/255708-is-there-a-secret-to-unlock-the-magic-of-the-x1/page/3/?tab=comments#comment-3009785", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "it's important to take into consideration the focus mode being used. the best af in the world cannot read the mind of the photographer. i have found -----> spot !!!  focus to be dependable and accurate if used correctly. the magic of the photograph is in the person behind the camera, not the object in front of the lens. nice photo! what's that large object the photographer is holding in front of his face? --img-- ", "sortedWord": "None", "identifyer": 12631, "year": "2016"}, {"Unnamed: 0": 450987, "autor": "prk60091", "date": 1483156380000, "content": "--img--  Last photo taken with my C before it developed some spots (condensation ?) on the sensor Taken in Aruba", "link": "https://www.l-camera-forum.com/topic/237139-leica-c-images-post-them-here/page/12/?tab=comments#comment-3176167", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "--img--  last photo taken with my c before it developed some -----> spots !!!  (condensation ?) on the sensor taken in aruba", "sortedWord": "None", "identifyer": 14485, "year": "2016"}], "name": "spotL-Forum2016"}