{"interestingcomments": [{"Unnamed: 0": 205611, "autor": "Bill Livingston", "date": 1484858940000, "content": "I looked at both DNG and thought there was much less purple fringing on the M10 (beard, his right ear, left on photo) and I thought the colour was a little better, not much... certainly not enough on those images to make any definitive comment, so I will wait for those who have more experience with detail evaluation. Not a massive difference though. I saw much bigger differences in the SL. (That just gets to be a better and better camera in my view). The more I look at the M10, the nicer it looks. Video isn't an issue for me... so the M10 would be a good fit, but I'm not remotely concerned about the thinner body (perhaps because I have never owned a Leica film M, so body size isn't an unconsciously learned 'thing' for me (I suspect most wonders complaining about M8/9240 body width are previous or existing film owners). I will still wait for the M10-P as I like my M240P too much to be able to justify the expense of changing right now... I may not even change then, I'll just keep my powder dry for a while. Had it been an EVF or hybrid viewfinder, I would have bought one immediately as I have said before... so if an M EVF or an ML or QL or whatever, appears in the next few months, maybe Leica will get my money then. But it looks like a great camera and it will please a LOT of Leica owners who have had a M8/9 or returned to film as they thought the M digitals were too bloated (not that I agree). Congratulations to Leica though. It seems that the Q, the SL and now the newest M have all hit the spot for the majority of potential customers - which is no mean feat given the customer base they have!!! --img--  Edited January 19, 2017 by Bill Livingston", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/?tab=comments#comment-3191318", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i looked at both dng and thought there was much less purple fringing on the m10 (beard, his right ear, left on photo) and i thought the colour was a little better, not much... certainly not enough on those images to make any definitive comment, so i will wait for those who have more experience with detail evaluation. not a massive difference though. i saw much bigger differences in the sl. (that just gets to be a better and better camera in my view). the more i look at the m10, the nicer it looks. video isn't an issue for me... so the m10 would be a good fit, but i'm not remotely concerned about the thinner body (perhaps because i have never owned a leica film m, so body size isn't an unconsciously learned 'thing' for me (i suspect most wonders complaining about m8/9240 body width are previous or existing film owners). i will still wait for the m10-p as i like my m240p too much to be able to justify the expense of changing right now... i may not even change then, i'll just keep my powder dry for a while. had it been an evf or hybrid viewfinder, i would have bought one immediately as i have said before... so if an m evf or an ml or ql or whatever, appears in the next few months, maybe leica will get my money then. but it looks like a great camera and it will please a lot of leica owners who have had a m8/9 or returned to film as they thought the m digitals were too bloated (not that i agree). congratulations to leica though. it seems that the q, the sl and now the newest m have all hit the -----> spot !!!  for the majority of potential customers - which is no mean feat given the customer base they have!!! --img--  edited january 19, 2017 by bill livingston", "sortedWord": "None", "identifyer": 99089, "year": "2017"}, {"Unnamed: 0": 205675, "autor": "A miller", "date": 1485043680000, "content": "Hi Everyone Some more images here: https://adobe.ly/2kc1DJl Some of the colors are really spot on. But so many of them are not. And perhaps its the exposure and lack of editing time, but the blown highlights seem to pervade and they are not very charming (IMHO). I agree with the comment that the images look very similar to those from the SL. It would have been nice to see more examples that don't have added vignetting.", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/page/4/?tab=comments#comment-3193343", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi everyone some more images here: https://adobe.ly/2kc1djl some of the colors are really -----> spot !!!  on. but so many of them are not. and perhaps its the exposure and lack of editing time, but the blown highlights seem to pervade and they are not very charming (imho). i agree with the comment that the images look very similar to those from the sl. it would have been nice to see more examples that don't have added vignetting.", "sortedWord": "None", "identifyer": 99153, "year": "2017"}, {"Unnamed: 0": 339861, "autor": "250swb", "date": 1513929960000, "content": "...as well as up against any convenient vertical support, such as a tree, building, light pole, streetlamp, etc. If you have a tree, lamppost etc. on exactly the spot you would normally chose to take a snap from why would you need a tripod, wouldn't it be as effective to brace the camera against the tree? And then the mini tripod 'braced against one's chest' idea, so how about brace the camera against one's face? Really, you don't need a tripod if all you want to do is invalidate the function of a tripod, a bean bag is more useful.", "link": "https://www.l-camera-forum.com/topic/278237-m10-what-tripods-do-you-use/page/3/?tab=comments#comment-3423287", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "...as well as up against any convenient vertical support, such as a tree, building, light pole, streetlamp, etc. if you have a tree, lamppost etc. on exactly the -----> spot !!!  you would normally chose to take a snap from why would you need a tripod, wouldn't it be as effective to brace the camera against the tree? and then the mini tripod 'braced against one's chest' idea, so how about brace the camera against one's face? really, you don't need a tripod if all you want to do is invalidate the function of a tripod, a bean bag is more useful.", "sortedWord": "None", "identifyer": 928, "year": "2017"}, {"Unnamed: 0": 340230, "autor": "tangfj", "date": 1494650580000, "content": "I have owned a lot of camera bags and currently own a Ona Brixton, Filson Magnum Messenger bag, Filson Harvey Backpack, and Filson Harvey Camera Messenger bag... In the past I've also owned camera bags from Thinktank, Wotancraft, Billingham, Tom Bihn and others that I'm sure I'm not remembering. As you can see I have a bit of a soft spot when it comes to bags... --img--  Anyway, right now my favorite bag by far is the Filson Harvey Messenger. It's discontinued right now but from time to time you can find one on eBay. I like it because it's lightweight and comes with a padded insert and has just enough room inside for a 13\" laptop or large iPad Pro in a back section of the bag and the rest of the bag still allows space for a M + 2-3 lenses and even another rangefinder sized body if needed. I also like that it does not look like a traditional camera bag and if I take out the insert then it can indeed be used as just a regular old messenger bag. Filson is also great with customer support... In fact, I just sent it back to get a few little holes repaired free of charge!", "link": "https://www.l-camera-forum.com/topic/268434-what-bag-for-the-m10/page/8/?tab=comments#comment-3273922", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have owned a lot of camera bags and currently own a ona brixton, filson magnum messenger bag, filson harvey backpack, and filson harvey camera messenger bag... in the past i've also owned camera bags from thinktank, wotancraft, billingham, tom bihn and others that i'm sure i'm not remembering. as you can see i have a bit of a soft -----> spot !!!  when it comes to bags... --img--  anyway, right now my favorite bag by far is the filson harvey messenger. it's discontinued right now but from time to time you can find one on ebay. i like it because it's lightweight and comes with a padded insert and has just enough room inside for a 13\" laptop or large ipad pro in a back section of the bag and the rest of the bag still allows space for a m + 2-3 lenses and even another rangefinder sized body if needed. i also like that it does not look like a traditional camera bag and if i take out the insert then it can indeed be used as just a regular old messenger bag. filson is also great with customer support... in fact, i just sent it back to get a few little holes repaired free of charge!", "sortedWord": "None", "identifyer": 1297, "year": "2017"}, {"Unnamed: 0": 341586, "autor": "OR120", "date": 1506256320000, "content": "It almost looks like wear from the way you carry you camera, where it hangs on you. Like it's constantly hitting the same spot. Not a normal wear mark. You know???", "link": "https://www.l-camera-forum.com/topic/277169-m10-wear/?tab=comments#comment-3364265", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "it almost looks like wear from the way you carry you camera, where it hangs on you. like it's constantly hitting the same -----> spot !!! . not a normal wear mark. you know???", "sortedWord": "None", "identifyer": 2656, "year": "2017"}, {"Unnamed: 0": 341592, "autor": "M10 for me", "date": 1506263160000, "content": "You did not tell us if this happened while the camera was in your bag or while you were carrying it on your shoulder. I believe its the latter. In that case the length of the strap is permanently the same and the camera touches your body constantly at the same spot. If that spot is a metal zip or metal button on jeans etc. then this happens whithin very short time. I had exactly that same problem a few years ago with my new Canon 5D Mk III. I was quite upset when I saw it but it was obviously too late.", "link": "https://www.l-camera-forum.com/topic/277169-m10-wear/?tab=comments#comment-3364311", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "you did not tell us if this happened while the camera was in your bag or while you were carrying it on your shoulder. i believe its the latter. in that case the length of the strap is permanently the same and the camera touches your body constantly at the same -----> spot !!! . if that spot is a metal zip or metal button on jeans etc. then this happens whithin very short time. i had exactly that same problem a few years ago with my new canon 5d mk iii. i was quite upset when i saw it but it was obviously too late.", "sortedWord": "None", "identifyer": 2662, "year": "2017"}, {"Unnamed: 0": 342259, "autor": "Steve Spencer", "date": 1486123680000, "content": "As a full frame sensor, I'd always want it to stay at the Goldilocks 24MP. Doing so would ensure that there will be exponential improvement in IQ and ISO performance, rather than ISO and IQ continually playing catch-up with ever increasing MP counts. If I ever wanted higher MP count, and why not, I'd be looking at medium format. I agree very much on the sentiment, but I think 30-36 MP is more likely to be the Goldilocks FF 35mm in my opinion. As Sony and Canon went from 24 to 36 MP and 24 to 30 MP respectively, they not only got more resolution but they increased the IQ (with better dynamic range) and the high ISO ability (less noise at high ISO), and the colour depth if anything increased slightly. Across sensor sizes pixels that are about 5 microns seems to be a sweet spot and that is in that 30-36 MP range. It is also in this range that diffraction starts to naturally suppress moire so a bit higher MP sensor would have that advantage too.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/3/?tab=comments#comment-3203507", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "as a full frame sensor, i'd always want it to stay at the goldilocks 24mp. doing so would ensure that there will be exponential improvement in iq and iso performance, rather than iso and iq continually playing catch-up with ever increasing mp counts. if i ever wanted higher mp count, and why not, i'd be looking at medium format. i agree very much on the sentiment, but i think 30-36 mp is more likely to be the goldilocks ff 35mm in my opinion. as sony and canon went from 24 to 36 mp and 24 to 30 mp respectively, they not only got more resolution but they increased the iq (with better dynamic range) and the high iso ability (less noise at high iso), and the colour depth if anything increased slightly. across sensor sizes pixels that are about 5 microns seems to be a sweet -----> spot !!!  and that is in that 30-36 mp range. it is also in this range that diffraction starts to naturally suppress moire so a bit higher mp sensor would have that advantage too.", "sortedWord": "None", "identifyer": 3330, "year": "2017"}, {"Unnamed: 0": 342319, "autor": "james.liam", "date": 1486238700000, "content": "Stop with the pixel envy. I've got an MM v.1 @ 18MP. I have never found it lacking nor would my life be better with a 42 MP a7. Just big-ass files needing more storage and a better computer. 24MP is a sweet-spot; improve dynamic range, advance high-ISO performance without compromising low-ISO color performance.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/6/?tab=comments#comment-3204669", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "stop with the pixel envy. i've got an mm v.1 @ 18mp. i have never found it lacking nor would my life be better with a 42 mp a7. just big-ass files needing more storage and a better computer. 24mp is a sweet------> spot !!! ; improve dynamic range, advance high-iso performance without compromising low-iso color performance.", "sortedWord": "None", "identifyer": 3390, "year": "2017"}, {"Unnamed: 0": 342329, "autor": "Paulus", "date": 1486536000000, "content": "Another akwardice I noticed with the SL was, it's inability to move the viewfinder fast from one spot to the another. The view distorts a fraction of a second. With \" normal eyes \" viewfinder, you can spin as fast as you want.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/7/?tab=comments#comment-3207374", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "another akwardice i noticed with the sl was, it's inability to move the viewfinder fast from one -----> spot !!!  to the another. the view distorts a fraction of a second. with \" normal eyes \" viewfinder, you can spin as fast as you want.", "sortedWord": "None", "identifyer": 3400, "year": "2017"}, {"Unnamed: 0": 342330, "autor": "Tmuussoni", "date": 1486649340000, "content": "I agree very much on the sentiment, but I think 30-36 MP is more likely to be the Goldilocks FF 35mm in my opinion. As Sony and Canon went from 24 to 36 MP and 24 to 30 MP respectively, they not only got more resolution but they increased the IQ (with better dynamic range) and the high ISO ability (less noise at high ISO), and the colour depth if anything increased slightly. Across sensor sizes pixels that are about 5 microns seems to be a sweet spot and that is in that 30-36 MP range. It is also in this range that diffraction starts to naturally suppress moire so a bit higher MP sensor would have that advantage too. Stop with the pixel envy. I've got an MM v.1 @ 18MP. I have never found it lacking nor would my life be better with a 42 MP a7. Just big-ass files needing more storage and a better computer. 24MP is a sweet-spot; improve dynamic range, advance high-ISO performance without compromising low-ISO color performance. In my opinion there is no such thing as a sweet spot. It's an internet myth blown way out of proportions. Sensors evolve all the time. Sony A7r II already demonstrated this with BSI sensor architecture: Better High ISO and Dynamic range than Leica SL despite having 18 MP more resolution. A7r II is BSI sensor is based on 5th generation Exmor R BSI sensor. It will be interesting what the upcoming Sony A9 will bring us. Rumors say it will be 70MP and most likely 6th generation Exmor RS BSI technology. My guess it will do just as fine as Leica M10 regarding high ISO/dynamic range despite trumping it with much more MP. My point is: BSI sensors are awesome and bring some real advantages to the table. Now the real question is this: will Leica evolve and get access to BSI sensor architecture with M11? It would get some real nice benefits for Leica. Less need for software color correction (vignetting, color shading), more higher performance lenses, more resolution. Or perhaps there is already something more interesting in 4 years. Time will tell. I certainly would love to see M11 with 40-50+ MP BSI sensor, or more, and see how well Apo-50 would perform on M11. A dream combo. Disclaimer: I use M 240 and I do love it. But I just want Leica to not fall too much behind with sensor technology as it is the heart and brain of any digital camera system. It makes no difference that it's a rangefinder camera. To me that is irrelevant. P.S. If you can afford 6500 € Leica M10, I'm sure you can also afford an additional 100 € hard drive for new hard drive for additional storage. Your computer will handle them just the same.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/7/?tab=comments#comment-3208651", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i agree very much on the sentiment, but i think 30-36 mp is more likely to be the goldilocks ff 35mm in my opinion. as sony and canon went from 24 to 36 mp and 24 to 30 mp respectively, they not only got more resolution but they increased the iq (with better dynamic range) and the high iso ability (less noise at high iso), and the colour depth if anything increased slightly. across sensor sizes pixels that are about 5 microns seems to be a sweet -----> spot !!!  and that is in that 30-36 mp range. it is also in this range that diffraction starts to naturally suppress moire so a bit higher mp sensor would have that advantage too. stop with the pixel envy. i've got an mm v.1 @ 18mp. i have never found it lacking nor would my life be better with a 42 mp a7. just big-ass files needing more storage and a better computer. 24mp is a sweet-spot; improve dynamic range, advance high-iso performance without compromising low-iso color performance. in my opinion there is no such thing as a sweet spot. it's an internet myth blown way out of proportions. sensors evolve all the time. sony a7r ii already demonstrated this with bsi sensor architecture: better high iso and dynamic range than leica sl despite having 18 mp more resolution. a7r ii is bsi sensor is based on 5th generation exmor r bsi sensor. it will be interesting what the upcoming sony a9 will bring us. rumors say it will be 70mp and most likely 6th generation exmor rs bsi technology. my guess it will do just as fine as leica m10 regarding high iso/dynamic range despite trumping it with much more mp. my point is: bsi sensors are awesome and bring some real advantages to the table. now the real question is this: will leica evolve and get access to bsi sensor architecture with m11? it would get some real nice benefits for leica. less need for software color correction (vignetting, color shading), more higher performance lenses, more resolution. or perhaps there is already something more interesting in 4 years. time will tell. i certainly would love to see m11 with 40-50+ mp bsi sensor, or more, and see how well apo-50 would perform on m11. a dream combo. disclaimer: i use m 240 and i do love it. but i just want leica to not fall too much behind with sensor technology as it is the heart and brain of any digital camera system. it makes no difference that it's a rangefinder camera. to me that is irrelevant. p.s. if you can afford 6500 € leica m10, i'm sure you can also afford an additional 100 € hard drive for new hard drive for additional storage. your computer will handle them just the same.", "sortedWord": "None", "identifyer": 3401, "year": "2017"}, {"Unnamed: 0": 342331, "autor": "Steve Spencer", "date": 1486654140000, "content": "In my opinion there is no such thing as a sweet spot. It's an internet myth blown way out of proportions. Sensors evolve all the time. Sony A7r II already demonstrated this with BSI sensor architecture: Better High ISO and Dynamic range than Leica SL despite having 18 MP more resolution. A7r II is BSI sensor is based on 5th generation Exmor R BSI sensor. It will be interesting what the upcoming Sony A9 will bring us. Rumors say it will be 70MP and most likely 6th generation Exmor RS BSI technology. My guess it will do just as fine as Leica M10 regarding high ISO/dynamic range despite trumping it with much more MP. My point is: BSI sensors are awesome and bring some real advantages to the table. Now the real question is this: will Leica evolve and get access to BSI sensor architecture with M11? It would get some real nice benefits for Leica. Less need for software color correction (vignetting, color shading), more higher performance lenses, more resolution. Or perhaps there is already something more interesting in 4 years. Time will tell. I certainly would love to see M11 with 40-50+ MP BSI sensor, or more, and see how well Apo-50 would perform on M11. A dream combo. Disclaimer: I use M 240 and I do love it. But I just want Leica to not fall too much behind with sensor technology as it is the heart and brain of any digital camera system. It makes no difference that it's a rangefinder camera. To me that is irrelevant. P.S. If you can afford 6500 € Leica M10, I'm sure you can also afford an additional 100 € hard drive for new hard drive for additional storage. Your computer will handle them just the same. I don't necessarily disagree with you. More resolution is an advantage, but I think it has diminishing returns, and other problems can create a sweet spot. I am not basing this perspective on an internet myth either. I was influenced by this article: http://www.clarkvision.com/articles/digital.sensor.performance.summary/ It is a bit old at this point, but I still think it makes good points. New technology can help in many respects and increase dynamic range, reduce noise and improve colour, but all these new advances don't necessarily mean that you increase resolution without penalties that overwhelm the diminishing returns. A technology like BSI, which I think is a nice advance, could easily improve performance at 24 MP, 36 MP, 42MP, 70 MP, and 140MP and increase the performance equally at each resolution. The sweet spot could still be at 36 MP, but the sensor with 36 MP and BSI would be better than the sensor with 36 MP and no BSI. It could also be true that a 36 MP BSI sensor would have a bit better dynamic range and colour than a 42MP BSI sensor. Keep in mind the 42MP BSI is just a tiny bit over the proposed sweet spot for FF 35mm, and at least one reason that Sony picked 42MP was for it facility for video and shooting Super 35 format. I have the a7rII and it is a great sensor. I too hope that Leica will bring newer technology including BSI and lower base ISO to their cameras. Another new technology is the Aptina coversion that improves high ISO in the A7rII (if you haven't notice the A7rII at 640 ISO is about as clean as at 200 ISO and this advantage continues at higher ISOs, because of this new technology). I hope Leica can incorporate that new technology too. I am all for the inclusion of any sensor improvement, but I think that is a separate issue from just how many MP will work best for the camera.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/7/?tab=comments#comment-3208701", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "in my opinion there is no such thing as a sweet -----> spot !!! . it's an internet myth blown way out of proportions. sensors evolve all the time. sony a7r ii already demonstrated this with bsi sensor architecture: better high iso and dynamic range than leica sl despite having 18 mp more resolution. a7r ii is bsi sensor is based on 5th generation exmor r bsi sensor. it will be interesting what the upcoming sony a9 will bring us. rumors say it will be 70mp and most likely 6th generation exmor rs bsi technology. my guess it will do just as fine as leica m10 regarding high iso/dynamic range despite trumping it with much more mp. my point is: bsi sensors are awesome and bring some real advantages to the table. now the real question is this: will leica evolve and get access to bsi sensor architecture with m11? it would get some real nice benefits for leica. less need for software color correction (vignetting, color shading), more higher performance lenses, more resolution. or perhaps there is already something more interesting in 4 years. time will tell. i certainly would love to see m11 with 40-50+ mp bsi sensor, or more, and see how well apo-50 would perform on m11. a dream combo. disclaimer: i use m 240 and i do love it. but i just want leica to not fall too much behind with sensor technology as it is the heart and brain of any digital camera system. it makes no difference that it's a rangefinder camera. to me that is irrelevant. p.s. if you can afford 6500 € leica m10, i'm sure you can also afford an additional 100 € hard drive for new hard drive for additional storage. your computer will handle them just the same. i don't necessarily disagree with you. more resolution is an advantage, but i think it has diminishing returns, and other problems can create a sweet spot. i am not basing this perspective on an internet myth either. i was influenced by this article: http://www.clarkvision.com/articles/digital.sensor.performance.summary/ it is a bit old at this point, but i still think it makes good points. new technology can help in many respects and increase dynamic range, reduce noise and improve colour, but all these new advances don't necessarily mean that you increase resolution without penalties that overwhelm the diminishing returns. a technology like bsi, which i think is a nice advance, could easily improve performance at 24 mp, 36 mp, 42mp, 70 mp, and 140mp and increase the performance equally at each resolution. the sweet spot could still be at 36 mp, but the sensor with 36 mp and bsi would be better than the sensor with 36 mp and no bsi. it could also be true that a 36 mp bsi sensor would have a bit better dynamic range and colour than a 42mp bsi sensor. keep in mind the 42mp bsi is just a tiny bit over the proposed sweet spot for ff 35mm, and at least one reason that sony picked 42mp was for it facility for video and shooting super 35 format. i have the a7rii and it is a great sensor. i too hope that leica will bring newer technology including bsi and lower base iso to their cameras. another new technology is the aptina coversion that improves high iso in the a7rii (if you haven't notice the a7rii at 640 iso is about as clean as at 200 iso and this advantage continues at higher isos, because of this new technology). i hope leica can incorporate that new technology too. i am all for the inclusion of any sensor improvement, but i think that is a separate issue from just how many mp will work best for the camera.", "sortedWord": "None", "identifyer": 3402, "year": "2017"}, {"Unnamed: 0": 342336, "autor": "Tmuussoni", "date": 1486676100000, "content": "Hmmm - if that's the case, why is it that the A7rii still doesn't perform well with many M lenses. Maybe I'm missing something, but I wasn't aware that the excellent new Sony sensors had come anywhere near solving those problems (even with the Kolari mods) It's quite simple: Sony bodies are designed with thicker filter stack in front of the sensor. Sony is something like 1.6 mm, while Leica bodies are designed with something like 0.5mmm (M8) to 0.9mm (M 240). And when you introduce unnecessary objects in the optical pathway the performance naturally suffers. In addition Leica micro lenses are configured differently than the Sony ones. Anyway, this is not the point. This has nothing to do with this performance of the Sony sensor, it is truly exceptional sensor. I consider it a better sensor than the Leica one, yes. My point is I just see some great potential if Leica someday decides to opt for BSI sensors as well (M11). BSI sensors gather light more efficiently from broader angle than traditional sensors. This means less vignetting, less color shading, less pink corners, perhaps it would even eliminate the need for 6 Bit coding. So the old rules about pixel pitch, and megapixel sweet spot, do not really apply in the same way as few years before. What is even more interesting is there is evidence that A7r II actually had less vignetting and color shading than M 240 with lens corrections turned off. And I find it truly fascinating. Obviously the smearing is still there, but it's for a different reason.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/7/?tab=comments#comment-3209012", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hmmm - if that's the case, why is it that the a7rii still doesn't perform well with many m lenses. maybe i'm missing something, but i wasn't aware that the excellent new sony sensors had come anywhere near solving those problems (even with the kolari mods) it's quite simple: sony bodies are designed with thicker filter stack in front of the sensor. sony is something like 1.6 mm, while leica bodies are designed with something like 0.5mmm (m8) to 0.9mm (m 240). and when you introduce unnecessary objects in the optical pathway the performance naturally suffers. in addition leica micro lenses are configured differently than the sony ones. anyway, this is not the point. this has nothing to do with this performance of the sony sensor, it is truly exceptional sensor. i consider it a better sensor than the leica one, yes. my point is i just see some great potential if leica someday decides to opt for bsi sensors as well (m11). bsi sensors gather light more efficiently from broader angle than traditional sensors. this means less vignetting, less color shading, less pink corners, perhaps it would even eliminate the need for 6 bit coding. so the old rules about pixel pitch, and megapixel sweet -----> spot !!! , do not really apply in the same way as few years before. what is even more interesting is there is evidence that a7r ii actually had less vignetting and color shading than m 240 with lens corrections turned off. and i find it truly fascinating. obviously the smearing is still there, but it's for a different reason.", "sortedWord": "None", "identifyer": 3407, "year": "2017"}, {"Unnamed: 0": 342407, "autor": "Gattamelata", "date": 1487423340000, "content": "My main preference here and now would be a Leica M10 MONOCHROME. I'd buy it on the spot, if it became available soon and not in two or three years.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/11/?tab=comments#comment-3215839", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my main preference here and now would be a leica m10 monochrome. i'd buy it on the -----> spot !!! , if it became available soon and not in two or three years.", "sortedWord": "None", "identifyer": 3478, "year": "2017"}, {"Unnamed: 0": 342412, "autor": "cirke", "date": 1487576220000, "content": "I don't know who is Roy P here https://diglloyd.com/blog/2017/20170127_1058-IsLeicaViable.html ... but spot-on ! Roy P : This would be my open letter to Andreas Kaufman: 1. Stop pretending Sony is a competitor. You have a 0.5% market share in photography, compared to Sony, which has some 20+% market share, and is a supplier of image sensors to camera makers ranging from Apple (iPhone, iPad) to PhaseOne (100MP). The list includes Nikon, Pentax and Hasselblad. 2. Visit Sony, get an audience with Hirai san (CEO), if possible, and work out a sourcing deal for Sony’s flagship 35mm FF sensors, as they become available. Remember to bring a pair of knee pads to the meeting. 3. To the RF purists, offer M cameras with the RF. But for those who don’t care for it, see if you can use the same space used by the RF to install a fast, high res EVF. 4. Upgrade other parts of the camera, like a retina-grade LCD back, scratch-resistant gorilla glass cover, a few customizable buttons (not the idiotic S / SL interface), fast processor, 5-axis image stabilization, pixel shifting, weather proofing, etc. 5. Shut down all other R&D, anything not related to the M system. Sell the S lens designs and technologies to either Hasselblad or Pentax. Get rid of the silly SL line before you are laughed out of the market, after sinking a lot more money into it. 6. Offer the M in at multiple resolutions (24, 36, 42, 50+ MP) with different prices, by essentially continuing to sell older models at lower prices. Offer other M variations (monochrome, limited editions, psychedelic colors, pearl capped shutter release buttons, etc. for the luxury end of the market). 7. Build up the M lens line, which has been stagnant for years now. Perhaps a 75 or 85mm Summilux, a 135mm f/2, a couple of ultra wide angles, a 16mm fisheye, a 100mm macro, maybe a 70-200mm f/4 zoom, and a few more compact f/2.8 and f/4 lenses. 8. Continue to make your specialty lenses for niche markets (cine, Micro 4/3, Leicasonic cameras) as your only non-M business. 9. Get some serious help in improving production quality and reliability of your gear, so things don’t fall apart after a couple of years of serious use. Engineer products not just for clever design and aesthetic appeal, but also for rugged performance year after year. 10. Invest some serious money into a better service infrastructure. Sell a priority service plan membership for $100 a year – I am sure a lot of customers would be willing to pay that. Above all, increase repair turnaround times from months to days. Now you have a very sharply focused (pun intended) and highly defendable boutique company, but one that you can really excel in, and stay on top of your game, and that gets your customers delighted. You are also going to be far, far more profitable. Edited February 20, 2017 by siangue", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/11/?tab=comments#comment-3217005", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i don't know who is roy p here https://diglloyd.com/blog/2017/20170127_1058-isleicaviable.html ... but -----> spot !!! -on ! roy p : this would be my open letter to andreas kaufman: 1. stop pretending sony is a competitor. you have a 0.5% market share in photography, compared to sony, which has some 20+% market share, and is a supplier of image sensors to camera makers ranging from apple (iphone, ipad) to phaseone (100mp). the list includes nikon, pentax and hasselblad. 2. visit sony, get an audience with hirai san (ceo), if possible, and work out a sourcing deal for sony’s flagship 35mm ff sensors, as they become available. remember to bring a pair of knee pads to the meeting. 3. to the rf purists, offer m cameras with the rf. but for those who don’t care for it, see if you can use the same space used by the rf to install a fast, high res evf. 4. upgrade other parts of the camera, like a retina-grade lcd back, scratch-resistant gorilla glass cover, a few customizable buttons (not the idiotic s / sl interface), fast processor, 5-axis image stabilization, pixel shifting, weather proofing, etc. 5. shut down all other r&d, anything not related to the m system. sell the s lens designs and technologies to either hasselblad or pentax. get rid of the silly sl line before you are laughed out of the market, after sinking a lot more money into it. 6. offer the m in at multiple resolutions (24, 36, 42, 50+ mp) with different prices, by essentially continuing to sell older models at lower prices. offer other m variations (monochrome, limited editions, psychedelic colors, pearl capped shutter release buttons, etc. for the luxury end of the market). 7. build up the m lens line, which has been stagnant for years now. perhaps a 75 or 85mm summilux, a 135mm f/2, a couple of ultra wide angles, a 16mm fisheye, a 100mm macro, maybe a 70-200mm f/4 zoom, and a few more compact f/2.8 and f/4 lenses. 8. continue to make your specialty lenses for niche markets (cine, micro 4/3, leicasonic cameras) as your only non-m business. 9. get some serious help in improving production quality and reliability of your gear, so things don’t fall apart after a couple of years of serious use. engineer products not just for clever design and aesthetic appeal, but also for rugged performance year after year. 10. invest some serious money into a better service infrastructure. sell a priority service plan membership for $100 a year – i am sure a lot of customers would be willing to pay that. above all, increase repair turnaround times from months to days. now you have a very sharply focused (pun intended) and highly defendable boutique company, but one that you can really excel in, and stay on top of your game, and that gets your customers delighted. you are also going to be far, far more profitable. edited february 20, 2017 by siangue", "sortedWord": "None", "identifyer": 3483, "year": "2017"}, {"Unnamed: 0": 342413, "autor": "jmahto", "date": 1487577720000, "content": "I don't know who is Roy P here https://diglloyd.com/blog/2017/20170127_1058-IsLeicaViable.html ... but spot-on ! Roy P : It is easy to advise others how to run a business.... --img-- ", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/11/?tab=comments#comment-3217018", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i don't know who is roy p here https://diglloyd.com/blog/2017/20170127_1058-isleicaviable.html ... but -----> spot !!! -on ! roy p : it is easy to advise others how to run a business.... --img-- ", "sortedWord": "None", "identifyer": 3484, "year": "2017"}, {"Unnamed: 0": 342416, "autor": "jaapv", "date": 1487581620000, "content": "I don't know who is Roy P here https://diglloyd.com/blog/2017/20170127_1058-IsLeicaViable.html ... but spot-on ![/size] Roy P : I know it is unlikely on DL's site, mostly the weird items are meant seriously, but I think this one is actually supposed to be a joke.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/11/?tab=comments#comment-3217056", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i don't know who is roy p here https://diglloyd.com/blog/2017/20170127_1058-isleicaviable.html ... but -----> spot !!! -on ![/size] roy p : i know it is unlikely on dl's site, mostly the weird items are meant seriously, but i think this one is actually supposed to be a joke.", "sortedWord": "None", "identifyer": 3487, "year": "2017"}, {"Unnamed: 0": 342464, "autor": "Jager", "date": 1493901300000, "content": "Regarding resolution, 24mp or thereabouts is likely to be the ceiling. Until/unless Leica decides to incorporate on-sensor vibration reduction, I wouldn't expect to see anything significantly beyond that. It seems that 24mp is, indeed, the sweet spot for a camera designed primarily to be used handheld. Some might recall the wailing and gnashing of teeth when Nikon released its 36mp D800. Images were soft. They were soft because Nikon, in its hurry to embrace the megapixel arms race, put marketing in front of physics. The M8 had a pixel pitch of 6.87um. The M9/Monochrom essentially maintained that pixel pitch (actually bumping it a hair to 6.89um). The M240/M246 dropped considerably, to 5.97um. The M10 also rings in at 6um. It would seem that that - ~6um - is the floor. There is no denying the advantages of resolution. When I look at the 50mp files from my Hasselblad CFV-50c digital back, I'm entranced. Alas, those benefits come at a cost. That digital back with its 5.3um pixel pitch requires a tripod (or strobes) in order to consistently realize its resolution. Yes, I can and do handhold it. But the keeper rate versus film (which, with its much larger \"sensor\" area, serves as an analog to a larger pixel pitch) plummets. It's notable that Nikon shoots for marketing braggadocio in its prosumer models, but retains a very conservative 21mp/6.41um pixel pitch in its flagship D5. There's a reason for that. And it would seem that Leica's engineers have come to the same conclusion.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/14/?tab=comments#comment-3268352", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "regarding resolution, 24mp or thereabouts is likely to be the ceiling. until/unless leica decides to incorporate on-sensor vibration reduction, i wouldn't expect to see anything significantly beyond that. it seems that 24mp is, indeed, the sweet -----> spot !!!  for a camera designed primarily to be used handheld. some might recall the wailing and gnashing of teeth when nikon released its 36mp d800. images were soft. they were soft because nikon, in its hurry to embrace the megapixel arms race, put marketing in front of physics. the m8 had a pixel pitch of 6.87um. the m9/monochrom essentially maintained that pixel pitch (actually bumping it a hair to 6.89um). the m240/m246 dropped considerably, to 5.97um. the m10 also rings in at 6um. it would seem that that - ~6um - is the floor. there is no denying the advantages of resolution. when i look at the 50mp files from my hasselblad cfv-50c digital back, i'm entranced. alas, those benefits come at a cost. that digital back with its 5.3um pixel pitch requires a tripod (or strobes) in order to consistently realize its resolution. yes, i can and do handhold it. but the keeper rate versus film (which, with its much larger \"sensor\" area, serves as an analog to a larger pixel pitch) plummets. it's notable that nikon shoots for marketing braggadocio in its prosumer models, but retains a very conservative 21mp/6.41um pixel pitch in its flagship d5. there's a reason for that. and it would seem that leica's engineers have come to the same conclusion.", "sortedWord": "None", "identifyer": 3535, "year": "2017"}, {"Unnamed: 0": 342465, "autor": "Steve Spencer", "date": 1493903520000, "content": "Regarding resolution, 24mp or thereabouts is likely to be the ceiling. Until/unless Leica decides to incorporate on-sensor vibration reduction, I wouldn't expect to see anything significantly beyond that. It seems that 24mp is, indeed, the sweet spot for a camera designed primarily to be used handheld. Some might recall the wailing and gnashing of teeth when Nikon released its 36mp D800. Images were soft. They were soft because Nikon, in its hurry to embrace the megapixel arms race, put marketing in front of physics. The M8 had a pixel pitch of 6.87um. The M9/Monochrom essentially maintained that pixel pitch (actually bumping it a hair to 6.89um). The M240/M246 dropped considerably, to 5.97um. The M10 also rings in at 6um. It would seem that that - ~6um - is the floor. There is no denying the advantages of resolution. When I look at the 50mp files from my Hasselblad CFV-50c digital back, I'm entranced. Alas, those benefits come at a cost. That digital back with its 5.3um pixel pitch requires a tripod (or strobes) in order to consistently realize its resolution. Yes, I can and do handhold it. But the keeper rate versus film (which, with its much larger \"sensor\" area, serves as an analog to a larger pixel pitch) plummets. It's notable that Nikon shoots for marketing braggadocio in its prosumer models, but retains a very conservative 21mp/6.41um pixel pitch in its flagship D5. There's a reason for that. And it would seem that Leica's engineers have come to the same conclusion. There are two simple solutions if handholding is an issue. First, as I think we all recognize it is simple enough to increase the shutter speed for the shot. It is not hard to get sharp shots with a 36mp sensor handheld if you shoot at 1/2X focal length for most people. Second, you can always downsize a bigger file to 24mp and it will have exactly the same handhold ability. For those times you can use the 36mp, like when high shutter speeds are easy or on a tripod the extra mp would help, and for those times handhold would cause an issue you can just downsize to 24mp. I see no reason at all that using a camera primarily handheld should limit the resolution. The problem with a few people (and it was mainly a tempest in a teapot among some forum participants and not a widespread issue -- the camera has sold very well and has high ratings of satisfaction) had handholding the Nikon D800 is that they simply didn't adjust to the higher mps by increasing the shutter speed. This is really a user problem and not a camera problem. Oh, and by the way the reason the Nikon D5 is 21mp is because this camera is used for things like sports Nikon wants very high frames per second and the limitation is computing power and not handhold ability. You just can't push enough data with camera's current computing power for more mp if you want to keep the fps up. That has and will change as computing power in cameras improves. In 8 years as computing power increase fully expect a 36mp D7.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/14/?tab=comments#comment-3268372", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "regarding resolution, 24mp or thereabouts is likely to be the ceiling. until/unless leica decides to incorporate on-sensor vibration reduction, i wouldn't expect to see anything significantly beyond that. it seems that 24mp is, indeed, the sweet -----> spot !!!  for a camera designed primarily to be used handheld. some might recall the wailing and gnashing of teeth when nikon released its 36mp d800. images were soft. they were soft because nikon, in its hurry to embrace the megapixel arms race, put marketing in front of physics. the m8 had a pixel pitch of 6.87um. the m9/monochrom essentially maintained that pixel pitch (actually bumping it a hair to 6.89um). the m240/m246 dropped considerably, to 5.97um. the m10 also rings in at 6um. it would seem that that - ~6um - is the floor. there is no denying the advantages of resolution. when i look at the 50mp files from my hasselblad cfv-50c digital back, i'm entranced. alas, those benefits come at a cost. that digital back with its 5.3um pixel pitch requires a tripod (or strobes) in order to consistently realize its resolution. yes, i can and do handhold it. but the keeper rate versus film (which, with its much larger \"sensor\" area, serves as an analog to a larger pixel pitch) plummets. it's notable that nikon shoots for marketing braggadocio in its prosumer models, but retains a very conservative 21mp/6.41um pixel pitch in its flagship d5. there's a reason for that. and it would seem that leica's engineers have come to the same conclusion. there are two simple solutions if handholding is an issue. first, as i think we all recognize it is simple enough to increase the shutter speed for the shot. it is not hard to get sharp shots with a 36mp sensor handheld if you shoot at 1/2x focal length for most people. second, you can always downsize a bigger file to 24mp and it will have exactly the same handhold ability. for those times you can use the 36mp, like when high shutter speeds are easy or on a tripod the extra mp would help, and for those times handhold would cause an issue you can just downsize to 24mp. i see no reason at all that using a camera primarily handheld should limit the resolution. the problem with a few people (and it was mainly a tempest in a teapot among some forum participants and not a widespread issue -- the camera has sold very well and has high ratings of satisfaction) had handholding the nikon d800 is that they simply didn't adjust to the higher mps by increasing the shutter speed. this is really a user problem and not a camera problem. oh, and by the way the reason the nikon d5 is 21mp is because this camera is used for things like sports nikon wants very high frames per second and the limitation is computing power and not handhold ability. you just can't push enough data with camera's current computing power for more mp if you want to keep the fps up. that has and will change as computing power in cameras improves. in 8 years as computing power increase fully expect a 36mp d7.", "sortedWord": "None", "identifyer": 3536, "year": "2017"}, {"Unnamed: 0": 342466, "autor": "wlaidlaw", "date": 1493904360000, "content": " Regarding resolution, 24mp or thereabouts is likely to be the ceiling. Until/unless Leica decides to incorporate on-sensor vibration reduction, I wouldn't expect to see anything significantly beyond that. It seems that 24mp is, indeed, the sweet spot for a camera designed primarily to be used handheld. Some might recall the wailing and gnashing of teeth when Nikon released its 36mp D800. Images were soft. They were soft because Nikon, in its hurry to embrace the megapixel arms race, put marketing in front of physics. The M8 had a pixel pitch of 6.87um. The M9/Monochrom essentially maintained that pixel pitch (actually bumping it a hair to 6.89um). The M240/M246 dropped considerably, to 5.97um. The M10 also rings in at 6um. It would seem that that - ~6um - is the floor. There is no denying the advantages of resolution. When I look at the 50mp files from my Hasselblad CFV-50c digital back, I'm entranced. Alas, those benefits come at a cost. That digital back with its 5.3um pixel pitch requires a tripod (or strobes) in order to consistently realize its resolution. Yes, I can and do handhold it. But the keeper rate versus film (which, with its much larger \"sensor\" area, serves as an analog to a larger pixel pitch) plummets. It's notable that Nikon shoots for marketing braggadocio in its prosumer models, but retains a very conservative 21mp/6.41um pixel pitch in its flagship D5. There's a reason for that. And it would seem that Leica's engineers have come to the same conclusion. While no fan of the Sony A series FF mirrorless cameras, they seem to manage their 40MP sensors pretty well. Extra pixels confers \"crop-ability\" and more flexibility on an image in PP. However if more pixels would be at the expense of extra noise, I would understand sticking with 24 but extending the usable ISO even further. I wonder if there might be a middle ground of say 34MP with noise a bit less than the M10, for the next generation of sensor. The problem Leica has is that with its volumes, it is going to be very lucky to get the \"bleeding edge\" of sensor technology. Sometimes they can surprise us with things like the retina resolution EVF on the SL, which I think I am correct in saying, that nobody has yet surpassed. Having an M240, an M10, though an improvement in some areas, was not enough to tempt me. Would an M240 successor (I do use video occasionally) with the same 24MP but other improvements tempt me? I slightly doubt it. So in the end, more pixels may be needed to tempt repeat customers like me, into the dealers. Wilson", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/14/?tab=comments#comment-3268379", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " regarding resolution, 24mp or thereabouts is likely to be the ceiling. until/unless leica decides to incorporate on-sensor vibration reduction, i wouldn't expect to see anything significantly beyond that. it seems that 24mp is, indeed, the sweet -----> spot !!!  for a camera designed primarily to be used handheld. some might recall the wailing and gnashing of teeth when nikon released its 36mp d800. images were soft. they were soft because nikon, in its hurry to embrace the megapixel arms race, put marketing in front of physics. the m8 had a pixel pitch of 6.87um. the m9/monochrom essentially maintained that pixel pitch (actually bumping it a hair to 6.89um). the m240/m246 dropped considerably, to 5.97um. the m10 also rings in at 6um. it would seem that that - ~6um - is the floor. there is no denying the advantages of resolution. when i look at the 50mp files from my hasselblad cfv-50c digital back, i'm entranced. alas, those benefits come at a cost. that digital back with its 5.3um pixel pitch requires a tripod (or strobes) in order to consistently realize its resolution. yes, i can and do handhold it. but the keeper rate versus film (which, with its much larger \"sensor\" area, serves as an analog to a larger pixel pitch) plummets. it's notable that nikon shoots for marketing braggadocio in its prosumer models, but retains a very conservative 21mp/6.41um pixel pitch in its flagship d5. there's a reason for that. and it would seem that leica's engineers have come to the same conclusion. while no fan of the sony a series ff mirrorless cameras, they seem to manage their 40mp sensors pretty well. extra pixels confers \"crop-ability\" and more flexibility on an image in pp. however if more pixels would be at the expense of extra noise, i would understand sticking with 24 but extending the usable iso even further. i wonder if there might be a middle ground of say 34mp with noise a bit less than the m10, for the next generation of sensor. the problem leica has is that with its volumes, it is going to be very lucky to get the \"bleeding edge\" of sensor technology. sometimes they can surprise us with things like the retina resolution evf on the sl, which i think i am correct in saying, that nobody has yet surpassed. having an m240, an m10, though an improvement in some areas, was not enough to tempt me. would an m240 successor (i do use video occasionally) with the same 24mp but other improvements tempt me? i slightly doubt it. so in the end, more pixels may be needed to tempt repeat customers like me, into the dealers. wilson", "sortedWord": "None", "identifyer": 3537, "year": "2017"}, {"Unnamed: 0": 342467, "autor": "jmahto", "date": 1493923860000, "content": "Regarding resolution, 24mp or thereabouts is likely to be the ceiling. Until/unless Leica decides to incorporate on-sensor vibration reduction, I wouldn't expect to see anything significantly beyond that. It seems that 24mp is, indeed, the sweet spot for a camera designed primarily to be used handheld. Some might recall the wailing and gnashing of teeth when Nikon released its 36mp D800. Images were soft. They were soft because Nikon, in its hurry to embrace the megapixel arms race, put marketing in front of physics. The M8 had a pixel pitch of 6.87um. The M9/Monochrom essentially maintained that pixel pitch (actually bumping it a hair to 6.89um). The M240/M246 dropped considerably, to 5.97um. The M10 also rings in at 6um. It would seem that that - ~6um - is the floor. There is no denying the advantages of resolution. When I look at the 50mp files from my Hasselblad CFV-50c digital back, I'm entranced. Alas, those benefits come at a cost. That digital back with its 5.3um pixel pitch requires a tripod (or strobes) in order to consistently realize its resolution. Yes, I can and do handhold it. But the keeper rate versus film (which, with its much larger \"sensor\" area, serves as an analog to a larger pixel pitch) plummets. It's notable that Nikon shoots for marketing braggadocio in its prosumer models, but retains a very conservative 21mp/6.41um pixel pitch in its flagship D5. There's a reason for that. And it would seem that Leica's engineers have come to the same conclusion. Solution is to stitch. It is easy to get 50mp files by stitching three 24mp frames of slightly longer lens (40mm to 28mm fov, 90mm to 60mm fov). Of course it works only for limited scenes but I will happily carry M for landscapes over Hassy.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/14/?tab=comments#comment-3268555", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "regarding resolution, 24mp or thereabouts is likely to be the ceiling. until/unless leica decides to incorporate on-sensor vibration reduction, i wouldn't expect to see anything significantly beyond that. it seems that 24mp is, indeed, the sweet -----> spot !!!  for a camera designed primarily to be used handheld. some might recall the wailing and gnashing of teeth when nikon released its 36mp d800. images were soft. they were soft because nikon, in its hurry to embrace the megapixel arms race, put marketing in front of physics. the m8 had a pixel pitch of 6.87um. the m9/monochrom essentially maintained that pixel pitch (actually bumping it a hair to 6.89um). the m240/m246 dropped considerably, to 5.97um. the m10 also rings in at 6um. it would seem that that - ~6um - is the floor. there is no denying the advantages of resolution. when i look at the 50mp files from my hasselblad cfv-50c digital back, i'm entranced. alas, those benefits come at a cost. that digital back with its 5.3um pixel pitch requires a tripod (or strobes) in order to consistently realize its resolution. yes, i can and do handhold it. but the keeper rate versus film (which, with its much larger \"sensor\" area, serves as an analog to a larger pixel pitch) plummets. it's notable that nikon shoots for marketing braggadocio in its prosumer models, but retains a very conservative 21mp/6.41um pixel pitch in its flagship d5. there's a reason for that. and it would seem that leica's engineers have come to the same conclusion. solution is to stitch. it is easy to get 50mp files by stitching three 24mp frames of slightly longer lens (40mm to 28mm fov, 90mm to 60mm fov). of course it works only for limited scenes but i will happily carry m for landscapes over hassy.", "sortedWord": "None", "identifyer": 3538, "year": "2017"}, {"Unnamed: 0": 342477, "autor": "pgh", "date": 1502560860000, "content": "Regarding resolution, 24mp or thereabouts is likely to be the ceiling. Until/unless Leica decides to incorporate on-sensor vibration reduction, I wouldn't expect to see anything significantly beyond that. It seems that 24mp is, indeed, the sweet spot for a camera designed primarily to be used handheld. Some might recall the wailing and gnashing of teeth when Nikon released its 36mp D800. Images were soft. They were soft because Nikon, in its hurry to embrace the megapixel arms race, put marketing in front of physics. The M8 had a pixel pitch of 6.87um. The M9/Monochrom essentially maintained that pixel pitch (actually bumping it a hair to 6.89um). The M240/M246 dropped considerably, to 5.97um. The M10 also rings in at 6um. It would seem that that - ~6um - is the floor. There is no denying the advantages of resolution. When I look at the 50mp files from my Hasselblad CFV-50c digital back, I'm entranced. Alas, those benefits come at a cost. That digital back with its 5.3um pixel pitch requires a tripod (or strobes) in order to consistently realize its resolution. Yes, I can and do handhold it. But the keeper rate versus film (which, with its much larger \"sensor\" area, serves as an analog to a larger pixel pitch) plummets. It's notable that Nikon shoots for marketing braggadocio in its prosumer models, but retains a very conservative 21mp/6.41um pixel pitch in its flagship D5. There's a reason for that. And it would seem that Leica's engineers have come to the same conclusion. My thousands of sharp, hand held pictures from my 645D, D800, A7rII (the only one with stabilization) and Rx1rII disagree. The 645D was the hardest to get sharp handheld, but still not really a problem. Hell, I hardly ever use a tripod. If anything you can do 1/1.5-2 focal length if you want. No big deal. A 40 mp M would be great, and completely useable. It's not Leica's priority, fine - but if you're getting to pure IQ - Leica still isn't at the top. If 24 mp was truly a ceiling you wouldn't see the success of these other cameras. Edited August 12, 2017 by pgh", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/14/?tab=comments#comment-3335531", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "regarding resolution, 24mp or thereabouts is likely to be the ceiling. until/unless leica decides to incorporate on-sensor vibration reduction, i wouldn't expect to see anything significantly beyond that. it seems that 24mp is, indeed, the sweet -----> spot !!!  for a camera designed primarily to be used handheld. some might recall the wailing and gnashing of teeth when nikon released its 36mp d800. images were soft. they were soft because nikon, in its hurry to embrace the megapixel arms race, put marketing in front of physics. the m8 had a pixel pitch of 6.87um. the m9/monochrom essentially maintained that pixel pitch (actually bumping it a hair to 6.89um). the m240/m246 dropped considerably, to 5.97um. the m10 also rings in at 6um. it would seem that that - ~6um - is the floor. there is no denying the advantages of resolution. when i look at the 50mp files from my hasselblad cfv-50c digital back, i'm entranced. alas, those benefits come at a cost. that digital back with its 5.3um pixel pitch requires a tripod (or strobes) in order to consistently realize its resolution. yes, i can and do handhold it. but the keeper rate versus film (which, with its much larger \"sensor\" area, serves as an analog to a larger pixel pitch) plummets. it's notable that nikon shoots for marketing braggadocio in its prosumer models, but retains a very conservative 21mp/6.41um pixel pitch in its flagship d5. there's a reason for that. and it would seem that leica's engineers have come to the same conclusion. my thousands of sharp, hand held pictures from my 645d, d800, a7rii (the only one with stabilization) and rx1rii disagree. the 645d was the hardest to get sharp handheld, but still not really a problem. hell, i hardly ever use a tripod. if anything you can do 1/1.5-2 focal length if you want. no big deal. a 40 mp m would be great, and completely useable. it's not leica's priority, fine - but if you're getting to pure iq - leica still isn't at the top. if 24 mp was truly a ceiling you wouldn't see the success of these other cameras. edited august 12, 2017 by pgh", "sortedWord": "None", "identifyer": 3548, "year": "2017"}, {"Unnamed: 0": 342481, "autor": "Jon Warwick", "date": 1502569980000, "content": "Only thing on my wish list is more MPs. I print large, and find 24mp to be very limiting for a 300dpi printer output. I can only imagine how good my 50 APO would be on a higher MP body for large prints. That lens (by itself) has certainly bumped up image quality from my M240 markedly, and the 50 APO lens for me has been worth every penny of cost, but for landscapes (and subjects with fine detail) the main weak spot for me of this \"system\" is low megapixel count. I've tried the Nikon D800, and even with a flapping DSLR mirror, there was no problem at all with getting pin sharp images off that 36mp sensor. I'd guess this would be even easier off a lower vibration rangefinder. If not an M with higher megapixel count, i would really hope that such resolution progress is made in the auto-focused SL or S ranges.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/15/?tab=comments#comment-3335593", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "only thing on my wish list is more mps. i print large, and find 24mp to be very limiting for a 300dpi printer output. i can only imagine how good my 50 apo would be on a higher mp body for large prints. that lens (by itself) has certainly bumped up image quality from my m240 markedly, and the 50 apo lens for me has been worth every penny of cost, but for landscapes (and subjects with fine detail) the main weak -----> spot !!!  for me of this \"system\" is low megapixel count. i've tried the nikon d800, and even with a flapping dslr mirror, there was no problem at all with getting pin sharp images off that 36mp sensor. i'd guess this would be even easier off a lower vibration rangefinder. if not an m with higher megapixel count, i would really hope that such resolution progress is made in the auto-focused sl or s ranges.", "sortedWord": "None", "identifyer": 3552, "year": "2017"}, {"Unnamed: 0": 354237, "autor": "sblutter", "date": 1489590540000, "content": "Spotting digital in post is so much easier than what we had to do with silver prints. Is my last step before finalizing / printing. That said, compressed air (upright & gently!) + gel stick for the stubborn bits works for me", "link": "https://www.l-camera-forum.com/topic/270401-typ-240-sensor-cleaning/?tab=comments#comment-3234214", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "-----> spotting !!!  digital in post is so much easier than what we had to do with silver prints. is my last step before finalizing / printing. that said, compressed air (upright & gently!) + gel stick for the stubborn bits works for me", "sortedWord": "None", "identifyer": 15393, "year": "2017"}, {"Unnamed: 0": 354243, "autor": "jaapv", "date": 1489617780000, "content": "Spotting digital in post is so much easier than what we had to do with silver prints. Is my last step before finalizing / printing. That said, compressed air (upright & gently!) + gel stick for the stubborn bits works for me Not a safe advice. Using compressed air from a can has led to a number of cases of serious sensor damage, ranging from non-removable deposits to cracked sensors from thermal shock by the cold spray. Additionally the high pressure may transport dust between the filter layers of the sensor, impossible to remove. Use a blower bulb or vacuum system instead.", "link": "https://www.l-camera-forum.com/topic/270401-typ-240-sensor-cleaning/?tab=comments#comment-3234498", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "-----> spotting !!!  digital in post is so much easier than what we had to do with silver prints. is my last step before finalizing / printing. that said, compressed air (upright & gently!) + gel stick for the stubborn bits works for me not a safe advice. using compressed air from a can has led to a number of cases of serious sensor damage, ranging from non-removable deposits to cracked sensors from thermal shock by the cold spray. additionally the high pressure may transport dust between the filter layers of the sensor, impossible to remove. use a blower bulb or vacuum system instead.", "sortedWord": "None", "identifyer": 15399, "year": "2017"}, {"Unnamed: 0": 354246, "autor": "Steve Ricoh", "date": 1489881000000, "content": "I've noticed dust bunnies on my M240, and I'm really careful how and where I change lenses. Watching the video of the gel, the technician seems to clean it by transferring the dirt from the gel stick onto some form of sticky paper, but to be successful it needs to be paper a bit stickier. I wonder if this comes with the kit (Is it the Sony gel stick referred to above ?). Having 'spotted' with the gel stick I notice there's no final wet wipe to get the sensor uniformly clean, I find it surprising, plus she seems to wipe the around the lens mount on the body before sending it on its way. Again rather surprising since pretty easy to transfer dust etc from the cloth into the shutter cavity, and then like magnetism onto the sensor. Edited March 19, 2017 by Steve Ricoh", "link": "https://www.l-camera-forum.com/topic/270401-typ-240-sensor-cleaning/?tab=comments#comment-3236591", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "i've noticed dust bunnies on my m240, and i'm really careful how and where i change lenses. watching the video of the gel, the technician seems to clean it by transferring the dirt from the gel stick onto some form of sticky paper, but to be successful it needs to be paper a bit stickier. i wonder if this comes with the kit (is it the sony gel stick referred to above ?). having '-----> spotted !!! ' with the gel stick i notice there's no final wet wipe to get the sensor uniformly clean, i find it surprising, plus she seems to wipe the around the lens mount on the body before sending it on its way. again rather surprising since pretty easy to transfer dust etc from the cloth into the shutter cavity, and then like magnetism onto the sensor. edited march 19, 2017 by steve ricoh", "sortedWord": "None", "identifyer": 15403, "year": "2017"}, {"Unnamed: 0": 358433, "autor": "Exodies", "date": 1493785320000, "content": "You can't. Jaapv was suspecting wrong. You use the spot picture displayed on the camera to drive your cleaning efforts.", "link": "https://www.l-camera-forum.com/topic/267715-sensor-cleaning-menudust-detection-not-working/?tab=comments#comment-3267368", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "you can't. jaapv was suspecting wrong. you use the -----> spot !!!  picture displayed on the camera to drive your cleaning efforts.", "sortedWord": "None", "identifyer": 19612, "year": "2017"}, {"Unnamed: 0": 358434, "autor": "tri", "date": 1493787060000, "content": "Isn't in this case any sky/white wall photo taken at small diaphragm, at 200ISO and exposed correctly a spot picture? The reason I'm asking is because I have a one year old pristine bp M-P from the first owner for half the price. Got to love the M10. Edited May 3, 2017 by tri", "link": "https://www.l-camera-forum.com/topic/267715-sensor-cleaning-menudust-detection-not-working/?tab=comments#comment-3267376", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "isn't in this case any sky/white wall photo taken at small diaphragm, at 200iso and exposed correctly a -----> spot !!!  picture? the reason i'm asking is because i have a one year old pristine bp m-p from the first owner for half the price. got to love the m10. edited may 3, 2017 by tri", "sortedWord": "None", "identifyer": 19613, "year": "2017"}, {"Unnamed: 0": 358435, "autor": "pop", "date": 1493790960000, "content": "Isn't in this case any sky/white wall photo taken at small diaphragm, at 200ISO and exposed correctly a spot picture?... Yes, it is. Spot on, as they say.", "link": "https://www.l-camera-forum.com/topic/267715-sensor-cleaning-menudust-detection-not-working/?tab=comments#comment-3267404", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "isn't in this case any sky/white wall photo taken at small diaphragm, at 200iso and exposed correctly a -----> spot !!!  picture?... yes, it is. spot on, as they say.", "sortedWord": "None", "identifyer": 19614, "year": "2017"}, {"Unnamed: 0": 358436, "autor": "jaapv", "date": 1493793540000, "content": "You can't. Jaapv was suspecting wrong. You use the spot picture displayed on the camera to drive your cleaning efforts. Pity, it would have been usefdul. You can tell that I never use the feature --img-- ", "link": "https://www.l-camera-forum.com/topic/267715-sensor-cleaning-menudust-detection-not-working/?tab=comments#comment-3267425", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "you can't. jaapv was suspecting wrong. you use the -----> spot !!!  picture displayed on the camera to drive your cleaning efforts. pity, it would have been usefdul. you can tell that i never use the feature --img-- ", "sortedWord": "None", "identifyer": 19615, "year": "2017"}, {"Unnamed: 0": 359288, "autor": "Hamad", "date": 1486152180000, "content": "--img--  Spotted the new M10 in Bahrain... i believe its first M10 in the country. Checked with local dealer its not available yet. Looks good to be honest but from M9 to M10 move makes sense. But from M to M10 ... i don't think so. Sent from my iPhone using Tapatalk Pro", "link": "https://www.l-camera-forum.com/topic/268389-why-m240-users-will-not-switch-to-m10/page/14/?tab=comments#comment-3203868", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "--img--  -----> spotted !!!  the new m10 in bahrain... i believe its first m10 in the country. checked with local dealer its not available yet. looks good to be honest but from m9 to m10 move makes sense. but from m to m10 ... i don't think so. sent from my iphone using tapatalk pro", "sortedWord": "None", "identifyer": 20470, "year": "2017"}, {"Unnamed: 0": 359289, "autor": "lucerne", "date": 1486160040000, "content": "Spotted the new M10 in Bahrain... i believe its first M10 in the country. Checked with local dealer its not available yet. Looks good to be honest but from M9 to M10 move makes sense. But from M to M10 ... i don't think so. Sent from my iPhone using Tapatalk Pro You are implying (I think) that an upgrade of my M9 to m240 would be worthwhile. I'm considering such a move. But If the difference between the M240 and the M10 is so minimal, why do that? That's the impression I'm getting from the comments made by many M240 owners on this forum. It's all very confusing. And I'm even getting the impression that after 4 years of the M240, users didn't actually like it. Is it that bad? Comments very welcome. I want to make a good decision. Plenty of second hand 240's and variants available now. I'm interested in the 240M-P. Thanks Edited February 3, 2017 by lucerne", "link": "https://www.l-camera-forum.com/topic/268389-why-m240-users-will-not-switch-to-m10/page/14/?tab=comments#comment-3203976", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "-----> spotted !!!  the new m10 in bahrain... i believe its first m10 in the country. checked with local dealer its not available yet. looks good to be honest but from m9 to m10 move makes sense. but from m to m10 ... i don't think so. sent from my iphone using tapatalk pro you are implying (i think) that an upgrade of my m9 to m240 would be worthwhile. i'm considering such a move. but if the difference between the m240 and the m10 is so minimal, why do that? that's the impression i'm getting from the comments made by many m240 owners on this forum. it's all very confusing. and i'm even getting the impression that after 4 years of the m240, users didn't actually like it. is it that bad? comments very welcome. i want to make a good decision. plenty of second hand 240's and variants available now. i'm interested in the 240m-p. thanks edited february 3, 2017 by lucerne", "sortedWord": "None", "identifyer": 20471, "year": "2017"}, {"Unnamed: 0": 368218, "autor": "Big_g", "date": 1485374520000, "content": "We have moved slightly off topic now but yes, I have tested my lenses on both bodies and there is not a lot of correlation between them!. Nocti is close on both, Summicron is way off on the 240 and almost spot on with the 246, 50 Lux is spot on with both. Seems strange. Anyway, 240 is heading to Wetzlar sometime in the next few months as the rangefinder is sticking so needs sorting. Will have to wait until I am back in the UK to get it sent off. Will use EVF for the Summicron for now Edited January 25, 2017 by Big_g", "link": "https://www.l-camera-forum.com/topic/268358-poor-results-with-filters-m246/?tab=comments#comment-3196775", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "we have moved slightly off topic now but yes, i have tested my lenses on both bodies and there is not a lot of correlation between them!. nocti is close on both, summicron is way off on the 240 and almost -----> spot !!!  on with the 246, 50 lux is -----> spot !!!  on with both. seems strange. anyway, 240 is heading to wetzlar sometime in the next few months as the rangefinder is sticking so needs sorting. will have to wait until i am back in the uk to get it sent off. will use evf for the summicron for now edited january 25, 2017 by big_g", "sortedWord": "None", "identifyer": 29494, "year": "2017"}, {"Unnamed: 0": 369586, "autor": "chlky0001", "date": 1502545200000, "content": "I just shot quickly a makro and I see now that I was only half right. The wheel is made for an allen wrench after all. I did not see this when I just looked without magnification. On the other hand the left screw's construction has definitely changed and a normal screwdriver does not fit anymore. Further there is that lacquer applied . . . M262 has the same coupling set up, I adjusted the wheel with allen key while turned the screw and arm (didn't see the glue initially). the focus is spot on now.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/12/?tab=comments#comment-3335402", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i just shot quickly a makro and i see now that i was only half right. the wheel is made for an allen wrench after all. i did not see this when i just looked without magnification. on the other hand the left screw's construction has definitely changed and a normal screwdriver does not fit anymore. further there is that lacquer applied . . . m262 has the same coupling set up, i adjusted the wheel with allen key while turned the screw and arm (didn't see the glue initially). the focus is -----> spot !!!  on now.", "sortedWord": "None", "identifyer": 30883, "year": "2017"}, {"Unnamed: 0": 374317, "autor": "lm_user", "date": 1494891060000, "content": "Don't know what to look for - but many look like dust spots to me. I get them on my M8. The spots with the irregular halos look like they may be of concern I would clean the sensor before sending to Leica. No need to wait 2 months for Leica to clean the sensor and tell you the camera is fine. If you don't know what you are doing - find someone you trust to clean the sensor. That is what I do", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/2/?tab=comments#comment-3275743", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "don't know what to look for - but many look like dust -----> spots !!!  to me. i get them on my m8. the spots with the irregular halos look like they may be of concern i would clean the sensor before sending to leica. no need to wait 2 months for leica to clean the sensor and tell you the camera is fine. if you don't know what you are doing - find someone you trust to clean the sensor. that is what i do", "sortedWord": "None", "identifyer": 35623, "year": "2017"}, {"Unnamed: 0": 374319, "autor": "earleygallery", "date": 1494892800000, "content": " Hard to tell but one of those spots looks like it could be 'corrosion' - it has a kind of halo effect around the spot. If you've just bought the camera and you bought from a dealer you could return it as faulty, or just send it to Leica now and get a new sensor while you still can.", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/3/?tab=comments#comment-3275751", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " hard to tell but one of those -----> spots !!!  looks like it could be 'corrosion' - it has a kind of halo effect around the spot. if you've just bought the camera and you bought from a dealer you could return it as faulty, or just send it to leica now and get a new sensor while you still can.", "sortedWord": "None", "identifyer": 35625, "year": "2017"}, {"Unnamed: 0": 374320, "autor": "Aguilera85", "date": 1494893160000, "content": "Hard to tell but one of those spots looks like it could be 'corrosion' - it has a kind of halo effect around the spot. If you've just bought the camera and you bought from a dealer you could return it as faulty, or just send it to Leica now and get a new sensor while you still can. Its hard to tell on the low grade picture they let me post here, but several spots around the complete image have the halo around it. So now i have to try to figure out about sending it. Do the new sensors they put currently have the corrosions problem fixed?", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/3/?tab=comments#comment-3275752", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "hard to tell but one of those -----> spots !!!  looks like it could be 'corrosion' - it has a kind of halo effect around the spot. if you've just bought the camera and you bought from a dealer you could return it as faulty, or just send it to leica now and get a new sensor while you still can. its hard to tell on the low grade picture they let me post here, but several spots around the complete image have the halo around it. so now i have to try to figure out about sending it. do the new sensors they put currently have the corrosions problem fixed?", "sortedWord": "None", "identifyer": 35626, "year": "2017"}, {"Unnamed: 0": 374336, "autor": "janjon", "date": 1494918360000, "content": "Horrible news, can any of you m9 old-timers give your opinion over my sensor, this shot is from blue sky over stockholm with f16 this morning. My understanding is that the black spot is dust the other ones can be corrosion. What's the best way to send the camera to Leica from Sweden, I can not see that we have any certified service centers or dealers here --img--  Brgds Janne", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/3/?tab=comments#comment-3275853", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "horrible news, can any of you m9 old-timers give your opinion over my sensor, this shot is from blue sky over stockholm with f16 this morning. my understanding is that the black -----> spot !!!  is dust the other ones can be corrosion. what's the best way to send the camera to leica from sweden, i can not see that we have any certified service centers or dealers here --img--  brgds janne", "sortedWord": "None", "identifyer": 35642, "year": "2017"}, {"Unnamed: 0": 374389, "autor": "petermullett", "date": 1494963060000, "content": "Horrible news, can any of you m9 old-timers give your opinion over my sensor, this shot is from blue sky over stockholm with f16 this morning. My understanding is that the black spot is dust the other ones can be corrosion. What's the best way to send the camera to Leica from Sweden, I can not see that we have any certified service centers or dealers here --img-- m9-sensor-corrision.JPG Brgds Janne Yes Janne, that's sensor corrosion, and a pretty bad case too….Get it into Leica right away. I've had two sensor replacements on my MM1, now the camera has the newest version of the sensor installed which I hope will prove to be as \"corrosion resistant\" as Leica promises it to be. I would really hate to lose the CCD \"look\" of the MM1 if the camera failed once again.", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/6/?tab=comments#comment-3276304", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "horrible news, can any of you m9 old-timers give your opinion over my sensor, this shot is from blue sky over stockholm with f16 this morning. my understanding is that the black -----> spot !!!  is dust the other ones can be corrosion. what's the best way to send the camera to leica from sweden, i can not see that we have any certified service centers or dealers here --img-- m9-sensor-corrision.jpg brgds janne yes janne, that's sensor corrosion, and a pretty bad case too….get it into leica right away. i've had two sensor replacements on my mm1, now the camera has the newest version of the sensor installed which i hope will prove to be as \"corrosion resistant\" as leica promises it to be. i would really hate to lose the ccd \"look\" of the mm1 if the camera failed once again.", "sortedWord": "None", "identifyer": 35695, "year": "2017"}, {"Unnamed: 0": 374407, "autor": "jaapv", "date": 1495016400000, "content": "I had a long conversation with some people at Leica, and I think now that I (we) are being a little harsh on them. Their sin is the old and well-known one: inept communication both now and in 2014 (although 2014 may be excusable in the scramble to save their reputation in the face of the Internet storm) Facts of the matter: As the M9 gets older, Customer Service has more and more work repairing all the other problems they find in cameras sent in for sensor swap. After all, 5 years of intensive use will have a digital-mechanical piece of gear in need of a check-up and overhaul. The sensor is still supplied for free. ( It costs 1300 Euro net!), but Leica decided that they had to charge the average labour cost. Which is at least defensible. I still don't like the fact that they promised one thing in 2014 and retract it three years later, but it would have helped a lot if they had communicated the underlying reason at the same time. Luigi was spot-on in his post, BTW.", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/7/?tab=comments#comment-3276653", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i had a long conversation with some people at leica, and i think now that i (we) are being a little harsh on them. their sin is the old and well-known one: inept communication both now and in 2014 (although 2014 may be excusable in the scramble to save their reputation in the face of the internet storm) facts of the matter: as the m9 gets older, customer service has more and more work repairing all the other problems they find in cameras sent in for sensor swap. after all, 5 years of intensive use will have a digital-mechanical piece of gear in need of a check-up and overhaul. the sensor is still supplied for free. ( it costs 1300 euro net!), but leica decided that they had to charge the average labour cost. which is at least defensible. i still don't like the fact that they promised one thing in 2014 and retract it three years later, but it would have helped a lot if they had communicated the underlying reason at the same time. luigi was -----> spot !!! -on in his post, btw.", "sortedWord": "None", "identifyer": 35713, "year": "2017"}, {"Unnamed: 0": 376325, "autor": "antigallican", "date": 1513867920000, "content": "I got it spot on using this so thanks - the photo helped", "link": "https://www.l-camera-forum.com/topic/278343-m9-adjustment/?tab=comments#comment-3422833", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i got it -----> spot !!!  on using this so thanks - the photo helped", "sortedWord": "None", "identifyer": 37635, "year": "2017"}, {"Unnamed: 0": 376498, "autor": "Erik Gunst Lund", "date": 1485083460000, "content": "It's quite easy to spot the non-Leica battery's --img--  They are cheap or says 'for Leica' on them. Equally easy to tell when you have the real thing, they come in the usual silver Leica box. If you really want to be double safe buy it at you Leica store or one of the big online stores,,,", "link": "https://www.l-camera-forum.com/topic/268499-m9-battery-life/?tab=comments#comment-3193648", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "it's quite easy to -----> spot !!!  the non-leica battery's --img--  they are cheap or says 'for leica' on them. equally easy to tell when you have the real thing, they come in the usual silver leica box. if you really want to be double safe buy it at you leica store or one of the big online stores,,,", "sortedWord": "None", "identifyer": 37808, "year": "2017"}, {"Unnamed: 0": 377397, "autor": "Jean-Michel", "date": 1512918840000, "content": "That small lonely speck is the dreaded corrosion invader! The halo around the spot is the giveaway. It is just one spot and if no other show up it is easy enough to correct. In my case the number of spots grew - on the original sensor and then on the first replacement. All ok now.", "link": "https://www.l-camera-forum.com/topic/279688-m9-sensor-cleaning-report/?tab=comments#comment-3414981", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "that small lonely speck is the dreaded corrosion invader! the halo around the -----> spot !!!  is the giveaway. it is just one spot and if no other show up it is easy enough to correct. in my case the number of spots grew - on the original sensor and then on the first replacement. all ok now.", "sortedWord": "None", "identifyer": 38709, "year": "2017"}, {"Unnamed: 0": 377398, "autor": "rsms", "date": 1512939660000, "content": "That small lonely speck is the dreaded corrosion invader! The halo around the spot is the giveaway. It is just one spot and if no other show up it is easy enough to correct. In my case the number of spots grew - on the original sensor and then on the first replacement. All ok now. Oh no! I feared this could be corrosion. Oh well, I'll live with it. Thanks for letting me know. :–)", "link": "https://www.l-camera-forum.com/topic/279688-m9-sensor-cleaning-report/?tab=comments#comment-3415206", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "that small lonely speck is the dreaded corrosion invader! the halo around the -----> spot !!!  is the giveaway. it is just one spot and if no other show up it is easy enough to correct. in my case the number of spots grew - on the original sensor and then on the first replacement. all ok now. oh no! i feared this could be corrosion. oh well, i'll live with it. thanks for letting me know. :–)", "sortedWord": "None", "identifyer": 38710, "year": "2017"}, {"Unnamed: 0": 377793, "autor": "sixteen pads", "date": 1510084740000, "content": "I remember hearing it would cost around £1000+ I guess you must factor in that the camera will be serviced with rangefinder adjusted, cleaned, lubricated and new leather fitted. You also get a years warranty on the work, your camera will be as good as new when it comes back. Not sure if they are doing a \"paid\" replacement though, I'd be interested to know. I couldn't go without my M9 so chose not to send it in - I couldn't see any sign of corrosion anyway. I guess if your sensor looks clean and you're not planning on selling then probably no need to rush, waiting times are way too long due to sensor availability anyway. Hey Chris, Thanks for your input. I am not sure I understand fully however. So neither option would be available now ? Paid nor free ? That would be horrible. I am not seeing any corrosion on my M9, but just noticed corrosion spots on friend's Monochrom. So sadly I am thinking it is only a matter of time. Edited November 7, 2017 by sixteen pads", "link": "https://www.l-camera-forum.com/topic/278556-how-much-for-m9-sensor-job-today/?tab=comments#comment-3391153", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i remember hearing it would cost around £1000+ i guess you must factor in that the camera will be serviced with rangefinder adjusted, cleaned, lubricated and new leather fitted. you also get a years warranty on the work, your camera will be as good as new when it comes back. not sure if they are doing a \"paid\" replacement though, i'd be interested to know. i couldn't go without my m9 so chose not to send it in - i couldn't see any sign of corrosion anyway. i guess if your sensor looks clean and you're not planning on selling then probably no need to rush, waiting times are way too long due to sensor availability anyway. hey chris, thanks for your input. i am not sure i understand fully however. so neither option would be available now ? paid nor free ? that would be horrible. i am not seeing any corrosion on my m9, but just noticed corrosion -----> spots !!!  on friend's monochrom. so sadly i am thinking it is only a matter of time. edited november 7, 2017 by sixteen pads", "sortedWord": "None", "identifyer": 39106, "year": "2017"}, {"Unnamed: 0": 377801, "autor": "leonasj", "date": 1510983420000, "content": "Replacement of defective sensor, as written in the title and in the first post of this thread.hello.my camera still has old sensor and i see corrosion spots,serial 420***** it is 2012year produced,can they replace sensor for free now?", "link": "https://www.l-camera-forum.com/topic/278556-how-much-for-m9-sensor-job-today/?tab=comments#comment-3397895", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "replacement of defective sensor, as written in the title and in the first post of this thread.hello.my camera still has old sensor and i see corrosion -----> spots !!! ,serial 420***** it is 2012year produced,can they replace sensor for free now?", "sortedWord": "None", "identifyer": 39114, "year": "2017"}, {"Unnamed: 0": 377904, "autor": "Robert M Poole", "date": 1507017060000, "content": "Mine had no dust on the sensor ever till I got it replaced earlier this year. Not long after a few spots appeared. Leica Store Manchester will wet clean an M for free for customers which they did. Some spots reappeared so I'm guessing it's coming from inside? www.robertpoolephotography.com", "link": "https://www.l-camera-forum.com/topic/277482-light-grey-dots-on-the-newly-replaced-ccd-sensor-on-the-m9/?tab=comments#comment-3369317", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "mine had no dust on the sensor ever till i got it replaced earlier this year. not long after a few -----> spots !!!  appeared. leica store manchester will wet clean an m for free for customers which they did. some spots reappeared so i'm guessing it's coming from inside? www.robertpoolephotography.com", "sortedWord": "None", "identifyer": 39219, "year": "2017"}, {"Unnamed: 0": 377911, "autor": "howareyoukk", "date": 1507203240000, "content": "You really should learn to clean your sensor yourself. It is a five-minute DIY job. Look in the FAQ at the top of this forum. It is all fine when you don't mind missing your camera for days, but what are you going to do when it develops dust halfway your holiday? You can take it into one of the many camerashops that offer this service whilst you wait as well. Hi thanks for the input. I notice you are the moderator with a great depth of knowledge with Leica cameras. Admittedly, I do reckon being able to perform sensor cleaning is a vital skill but putting this aside, would you comment on the nature of the dots that they are dusts and not spots caused by sensor corrosion once again? thanks.", "link": "https://www.l-camera-forum.com/topic/277482-light-grey-dots-on-the-newly-replaced-ccd-sensor-on-the-m9/?tab=comments#comment-3370760", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "you really should learn to clean your sensor yourself. it is a five-minute diy job. look in the faq at the top of this forum. it is all fine when you don't mind missing your camera for days, but what are you going to do when it develops dust halfway your holiday? you can take it into one of the many camerashops that offer this service whilst you wait as well. hi thanks for the input. i notice you are the moderator with a great depth of knowledge with leica cameras. admittedly, i do reckon being able to perform sensor cleaning is a vital skill but putting this aside, would you comment on the nature of the dots that they are dusts and not -----> spots !!!  caused by sensor corrosion once again? thanks.", "sortedWord": "None", "identifyer": 39226, "year": "2017"}, {"Unnamed: 0": 377913, "autor": "jaapv", "date": 1507203720000, "content": "Hi thanks for the input. I notice you are the moderator with a great depth of knowledge with Leica cameras. Admittedly, I do reckon being able to perform sensor cleaning is a vital skill but putting this aside, would you comment on the nature of the dots that they are dusts and not spots caused by sensor corrosion once again? thanks. I'd have to have a look at the sensor itself. I advise you to take the camera into Leica Mayfair and let them have a look at it.", "link": "https://www.l-camera-forum.com/topic/277482-light-grey-dots-on-the-newly-replaced-ccd-sensor-on-the-m9/?tab=comments#comment-3370764", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "hi thanks for the input. i notice you are the moderator with a great depth of knowledge with leica cameras. admittedly, i do reckon being able to perform sensor cleaning is a vital skill but putting this aside, would you comment on the nature of the dots that they are dusts and not -----> spots !!!  caused by sensor corrosion once again? thanks. i'd have to have a look at the sensor itself. i advise you to take the camera into leica mayfair and let them have a look at it.", "sortedWord": "None", "identifyer": 39228, "year": "2017"}, {"Unnamed: 0": 377914, "autor": "M9reno", "date": 1507204260000, "content": "hi thanks for the input --img--  just wondering what you meant by getting better after a few hundred shots? The oil stains will dry out and disappear after long term usage? thanks. And please refer to my latest update as the leica trained technician didnt seem to manage to eliminate the dots. Would you recommend me sending in back in again? I have troubled my local leica store several times already.. What I meant is that after several hundred actuations, the lubricants on the shutter 'bed in', as it were, and the shutter ceases to splatter the sensor with new drops, which is what I think you are seeing. Corrosion marks are very easy to spot - they look like round blobs, with a black dot in the middle, kind of like a cell with a nucleus, if that makes sense.", "link": "https://www.l-camera-forum.com/topic/277482-light-grey-dots-on-the-newly-replaced-ccd-sensor-on-the-m9/?tab=comments#comment-3370770", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi thanks for the input --img--  just wondering what you meant by getting better after a few hundred shots? the oil stains will dry out and disappear after long term usage? thanks. and please refer to my latest update as the leica trained technician didnt seem to manage to eliminate the dots. would you recommend me sending in back in again? i have troubled my local leica store several times already.. what i meant is that after several hundred actuations, the lubricants on the shutter 'bed in', as it were, and the shutter ceases to splatter the sensor with new drops, which is what i think you are seeing. corrosion marks are very easy to -----> spot !!!  - they look like round blobs, with a black dot in the middle, kind of like a cell with a nucleus, if that makes sense.", "sortedWord": "None", "identifyer": 39229, "year": "2017"}, {"Unnamed: 0": 377915, "autor": "howareyoukk", "date": 1507205880000, "content": "What I meant is that after several hundred actuations, the lubricants on the shutter 'bed in', as it were, and the shutter ceases to splatter the sensor with new drops, which is what I think you are seeing. Corrosion marks are very easy to spot - they look like round blobs, with a black dot in the middle, kind of like a cell with a nucleus, if that makes sense. yeah it does makes sense. I reckon i will just settle with few grease spots for now and use it for a few months before sending it in for cleaning.. though i think they didnt wet clean my sensor this time.", "link": "https://www.l-camera-forum.com/topic/277482-light-grey-dots-on-the-newly-replaced-ccd-sensor-on-the-m9/?tab=comments#comment-3370783", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what i meant is that after several hundred actuations, the lubricants on the shutter 'bed in', as it were, and the shutter ceases to splatter the sensor with new drops, which is what i think you are seeing. corrosion marks are very easy to -----> spot !!!  - they look like round blobs, with a black dot in the middle, kind of like a cell with a nucleus, if that makes sense. yeah it does makes sense. i reckon i will just settle with few grease spots for now and use it for a few months before sending it in for cleaning.. though i think they didnt wet clean my sensor this time.", "sortedWord": "None", "identifyer": 39230, "year": "2017"}, {"Unnamed: 0": 378409, "autor": "n8fyn", "date": 1505883120000, "content": " May be dust. Perhaps having it cleaned. The new sensor comes with new firmware. That's the best way to tell. It does have the new firmware, and i also have documentation. The black spots seem too dark to be dust, dont u think?", "link": "https://www.l-camera-forum.com/topic/276119-another-m9-ccd-repair-question/page/3/?tab=comments#comment-3362173", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " may be dust. perhaps having it cleaned. the new sensor comes with new firmware. that's the best way to tell. it does have the new firmware, and i also have documentation. the black -----> spots !!!  seem too dark to be dust, dont u think?", "sortedWord": "None", "identifyer": 39725, "year": "2017"}, {"Unnamed: 0": 378410, "autor": "pop", "date": 1505885520000, "content": "...The black spots seem too dark to be dust, dont u think? No, I don't think so. Dust blocks light from reaching the sensor and will, hence, leave dark spots. None of the specks on your picture that I could see looks anything like sensor corrosion. If you think one of the dark spots looks particularly suspicious, you should point it out to us.", "link": "https://www.l-camera-forum.com/topic/276119-another-m9-ccd-repair-question/page/3/?tab=comments#comment-3362179", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "...the black -----> spots !!!  seem too dark to be dust, dont u think? no, i don't think so. dust blocks light from reaching the sensor and will, hence, leave dark spots. none of the specks on your picture that i could see looks anything like sensor corrosion. if you think one of the dark spots looks particularly suspicious, you should point it out to us.", "sortedWord": "None", "identifyer": 39726, "year": "2017"}, {"Unnamed: 0": 378413, "autor": "n8fyn", "date": 1505924640000, "content": "absolutely dirty sensor, and not that dirty either, you should see my M8. Looks like a dirty sensor to me. Have it cleaned first and then look again. No, I don't think so. Dust blocks light from reaching the sensor and will, hence, leave dark spots. None of the specks on your picture that I could see looks anything like sensor corrosion. If you think one of the dark spots looks particularly suspicious, you should point it out to us. thanks everyone, i'll bring it in for a cleaning and have another look --img-- ", "link": "https://www.l-camera-forum.com/topic/276119-another-m9-ccd-repair-question/page/3/?tab=comments#comment-3362510", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "absolutely dirty sensor, and not that dirty either, you should see my m8. looks like a dirty sensor to me. have it cleaned first and then look again. no, i don't think so. dust blocks light from reaching the sensor and will, hence, leave dark -----> spots !!! . none of the specks on your picture that i could see looks anything like sensor corrosion. if you think one of the dark spots looks particularly suspicious, you should point it out to us. thanks everyone, i'll bring it in for a cleaning and have another look --img-- ", "sortedWord": "None", "identifyer": 39729, "year": "2017"}, {"Unnamed: 0": 382511, "autor": "a.noctilux", "date": 1508854620000, "content": "When I used M8, my best portrait lens was Summarit 1.5/50 or Summilux 1.4/50 first formula (almost same rendering as Summarit at 1.5/1.4 to f/2.8) . Nice with light spots in backgraw thanks to round aperture opening. Eventually, I used x1.25 or x1.4 magnifier on M8 to have more accurate focus and bigger finder to compose.", "link": "https://www.l-camera-forum.com/topic/278045-portrait-lens-for-m8/page/2/?tab=comments#comment-3381411", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "when i used m8, my best portrait lens was summarit 1.5/50 or summilux 1.4/50 first formula (almost same rendering as summarit at 1.5/1.4 to f/2.8) . nice with light -----> spots !!!  in backgraw thanks to round aperture opening. eventually, i used x1.25 or x1.4 magnifier on m8 to have more accurate focus and bigger finder to compose.", "sortedWord": "None", "identifyer": 43910, "year": "2017"}, {"Unnamed: 0": 382995, "autor": "Jeff S", "date": 1511816400000, "content": "Pick a focal length first. And remember that the M 8.2 has a 1.33x crop factor, so that a 35mm lens will have an angle of view equal to a 47mm lens. The focal length doesn't change, but the edges of the pic are cropped off, using only the center 'sweet spot' of your lens. Virtually all Leica lenses are fully capable of rendering fine pics. Pick one within your buget, and don't ignore the Summarits. I prefer to shop reputable dealers, with warranty and service backup. Not sure if you followed that practice with your camera. Try before you buy, or get a return policy. Jeff", "link": "https://www.l-camera-forum.com/topic/279272-just-bought-my-first-ever-leica-m82-now-what-lens-should-i-buy/?tab=comments#comment-3405134", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "pick a focal length first. and remember that the m 8.2 has a 1.33x crop factor, so that a 35mm lens will have an angle of view equal to a 47mm lens. the focal length doesn't change, but the edges of the pic are cropped off, using only the center 'sweet -----> spot !!! ' of your lens. virtually all leica lenses are fully capable of rendering fine pics. pick one within your buget, and don't ignore the summarits. i prefer to shop reputable dealers, with warranty and service backup. not sure if you followed that practice with your camera. try before you buy, or get a return policy. jeff", "sortedWord": "None", "identifyer": 44395, "year": "2017"}, {"Unnamed: 0": 383817, "autor": "Graham (G4FUJ)", "date": 1491639000000, "content": "There is an M8 for sale a Leica Store Manchester. Under £1000 Sterling. Only spotted as I was looking at used lenses, then, just for info prices of M9...", "link": "https://www.l-camera-forum.com/topic/257164-is-the-used-market-supply-of-m8s-drying-up/page/3/?tab=comments#comment-3250541", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "there is an m8 for sale a leica store manchester. under £1000 sterling. only -----> spotted !!!  as i was looking at used lenses, then, just for info prices of m9...", "sortedWord": "None", "identifyer": 45218, "year": "2017"}, {"Unnamed: 0": 393792, "autor": "250swb", "date": 1512806820000, "content": " The only thing that would have changed would be shutter or aperture: The other thing that could have changed is how long it was between shots. So if one photo doesn't have the leak it could be because the film didn't linger in the gate long enough. I agree with Philipp and Ian as to the most likely cause, the leak is hitting the back of the film, and always in the same spot. So check the door, is it located correctly, and if you remove the rear door there should be a length of undamaged foam running along the hinge line side to side along the top edge of the rebate in the body (this is the only foam seal). If this is damaged it is a very simple DIY job to replace it with a light seal kit from eBay. If the leak is moving across the frame in other photos that you haven't shown also check the strap lug. Edited December 9, 2017 by 250swb", "link": "https://www.l-camera-forum.com/topic/279646-m6-light-leak-maybe-help/?tab=comments#comment-3414188", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " the only thing that would have changed would be shutter or aperture: the other thing that could have changed is how long it was between shots. so if one photo doesn't have the leak it could be because the film didn't linger in the gate long enough. i agree with philipp and ian as to the most likely cause, the leak is hitting the back of the film, and always in the same -----> spot !!! . so check the door, is it located correctly, and if you remove the rear door there should be a length of undamaged foam running along the hinge line side to side along the top edge of the rebate in the body (this is the only foam seal). if this is damaged it is a very simple diy job to replace it with a light seal kit from ebay. if the leak is moving across the frame in other photos that you haven't shown also check the strap lug. edited december 9, 2017 by 250swb", "sortedWord": "None", "identifyer": 6256, "year": "2017"}, {"Unnamed: 0": 393793, "autor": "heycadet", "date": 1512833280000, "content": "The M6 has a back door, if I'm not mistaken. You could try and stick a piece of opaqe tape over the edge of the back door, on the top right hand side, i.e. under the film advancing lever. Very good idea. Will give it a go. The other thing that could have changed is how long it was between shots. So if one photo doesn't have the leak it could be because the film didn't linger in the gate long enough. I agree with Philipp and Ian as to the most likely cause, the leak is hitting the back of the film, and always in the same spot. So check the door, is it located correctly, and if you remove the rear door there should be a length of undamaged foam running along the hinge line side to side along the top edge of the rebate in the body (this is the only foam seal). If this is damaged it is a very simple DIY job to replace it with a light seal kit from eBay. If the leak is moving across the frame in other photos that you haven't shown also check the strap lug. You're right. It's also possible that I could have blocked the leak sometimes with my hand if I was taking the photos back to back. I have a few rolls from the start of this development run that have no leak at all; but now that I'm thinking about it. I had the M6 in a leather case then, that blocked the back door completely. So this must be the issue. I took it out of the case because it was too bulky; but that could have easily exposed this issue. Will look into this all tonight. Thanks very much everyone!", "link": "https://www.l-camera-forum.com/topic/279646-m6-light-leak-maybe-help/?tab=comments#comment-3414379", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the m6 has a back door, if i'm not mistaken. you could try and stick a piece of opaqe tape over the edge of the back door, on the top right hand side, i.e. under the film advancing lever. very good idea. will give it a go. the other thing that could have changed is how long it was between shots. so if one photo doesn't have the leak it could be because the film didn't linger in the gate long enough. i agree with philipp and ian as to the most likely cause, the leak is hitting the back of the film, and always in the same -----> spot !!! . so check the door, is it located correctly, and if you remove the rear door there should be a length of undamaged foam running along the hinge line side to side along the top edge of the rebate in the body (this is the only foam seal). if this is damaged it is a very simple diy job to replace it with a light seal kit from ebay. if the leak is moving across the frame in other photos that you haven't shown also check the strap lug. you're right. it's also possible that i could have blocked the leak sometimes with my hand if i was taking the photos back to back. i have a few rolls from the start of this development run that have no leak at all; but now that i'm thinking about it. i had the m6 in a leather case then, that blocked the back door completely. so this must be the issue. i took it out of the case because it was too bulky; but that could have easily exposed this issue. will look into this all tonight. thanks very much everyone!", "sortedWord": "None", "identifyer": 6257, "year": "2017"}, {"Unnamed: 0": 395070, "autor": "harleybob", "date": 1495744800000, "content": "Is there anyone who can help interpret the lens code chart listed in the forum. There are two lines of code for the 6 spaces. However, there is no clear key to how those are entered on the round lens ring? I have purchased new flanges with the coding spots for two lenses. However, it is not apparent how to translate the chart to the lens itself. The instructions say orient at 12 oclock. the photo shows them at 6 oclock and the codes themselves are on two lines. Any help is appreciated. I specifically want to code: 21 mm Elmarit 2.8 ASPH 28mm Summicron 2.0 ASPH Thank you", "link": "https://www.l-camera-forum.com/topic/185433-m-lens-codes/page/6/?tab=comments#comment-3282630", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "is there anyone who can help interpret the lens code chart listed in the forum. there are two lines of code for the 6 spaces. however, there is no clear key to how those are entered on the round lens ring? i have purchased new flanges with the coding -----> spots !!!  for two lenses. however, it is not apparent how to translate the chart to the lens itself. the instructions say orient at 12 oclock. the photo shows them at 6 oclock and the codes themselves are on two lines. any help is appreciated. i specifically want to code: 21 mm elmarit 2.8 asph 28mm summicron 2.0 asph thank you", "sortedWord": "None", "identifyer": 7539, "year": "2017"}, {"Unnamed: 0": 396159, "autor": "ropo54", "date": 1494091860000, "content": "On a morning walk with my SL and Noctilux I spotted a small bird with a dragon fly in its mouth. --img--  Edited May 6, 2017 by ropo54", "link": "https://www.l-camera-forum.com/topic/270708-nifty-fifty-please-share-some-50-mm-pictures/page/7/?tab=comments#comment-3269755", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "on a morning walk with my sl and noctilux i -----> spotted !!!  a small bird with a dragon fly in its mouth. --img--  edited may 6, 2017 by ropo54", "sortedWord": "None", "identifyer": 8640, "year": "2017"}, {"Unnamed: 0": 399317, "autor": "lik", "date": 1512589200000, "content": " Ok - call me crazy, weird, mad, bored, out of focus, trend follower - what ever you like. I have it. Sorry - only iPhone photos. Unpacking and first impressions: Beauty - compared to many others. Impractical - compared to state of the art in handling. Unique - compared to many nowadays bubble-swirly-something bokeh cameras. Unexpected - in its characteristics and rendering. The beauty - I like it’s look on a silver M. Yes - it’s impractical. Turning the aperture ring means turning the focus ring too. Too much rotation for focussing. Hood fixing - OMG. Removing lens cap means removing hood unintentionally. So it gives an idea what photography meant in 30’s…. However - I accept it. It’s an impractical beauty. And the first guy I showed it said: „Wow - a real historical camera an looking brand new!“ Unique - as far as I can see after just a few shots in the city. I have a Petzval 58 and a Meyer Görlitz Trioplan 100mm. I’m going to sell them now to make my Thambar a little bit cheaper to me. Because it’s far beyond these lenses. All these \"swirly-bokeh-pieces\" are nothing against the bokeh and the glow of this lens. Unexpected - in street lights at night wide open IMO shows an ugly and a beautiful side: With center spot filter ugly rings or donuts. Without interesting glow around lights and nice or at least acceptable bokeh-bubbles out of focus. Yes - it is sharp - even wide open - eh - somehow. Kind of „soft sharp“. Low micro contrast but letters can be read - in center. To me it's really amazing. And as mentioned - glow everywhere where a bit of light comes across. In short: This lens is crazy. And I seem to become Thambar-crazy. Unfortunately the subject which this lens is made for - portrait and nature - I can't take before later this month. Of course I’ll show some examples here then. For the moment I have just a few shots made on my way from my friendly dealer - and just to see the effects of rendering. After all this partly boring examples in the web I hardly dare to add some others. OK - I do. --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/?tab=comments#comment-3412416", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " ok - call me crazy, weird, mad, bored, out of focus, trend follower - what ever you like. i have it. sorry - only iphone photos. unpacking and first impressions: beauty - compared to many others. impractical - compared to state of the art in handling. unique - compared to many nowadays bubble-swirly-something bokeh cameras. unexpected - in its characteristics and rendering. the beauty - i like it’s look on a silver m. yes - it’s impractical. turning the aperture ring means turning the focus ring too. too much rotation for focussing. hood fixing - omg. removing lens cap means removing hood unintentionally. so it gives an idea what photography meant in 30’s…. however - i accept it. it’s an impractical beauty. and the first guy i showed it said: „wow - a real historical camera an looking brand new!“ unique - as far as i can see after just a few shots in the city. i have a petzval 58 and a meyer görlitz trioplan 100mm. i’m going to sell them now to make my thambar a little bit cheaper to me. because it’s far beyond these lenses. all these \"swirly-bokeh-pieces\" are nothing against the bokeh and the glow of this lens. unexpected - in street lights at night wide open imo shows an ugly and a beautiful side: with center -----> spot !!!  filter ugly rings or donuts. without interesting glow around lights and nice or at least acceptable bokeh-bubbles out of focus. yes - it is sharp - even wide open - eh - somehow. kind of „soft sharp“. low micro contrast but letters can be read - in center. to me it's really amazing. and as mentioned - glow everywhere where a bit of light comes across. in short: this lens is crazy. and i seem to become thambar-crazy. unfortunately the subject which this lens is made for - portrait and nature - i can't take before later this month. of course i’ll show some examples here then. for the moment i have just a few shots made on my way from my friendly dealer - and just to see the effects of rendering. after all this partly boring examples in the web i hardly dare to add some others. ok - i do. --img-- --img-- --img-- ", "sortedWord": "None", "identifyer": 11995, "year": "2017"}, {"Unnamed: 0": 399325, "autor": "lik", "date": 1512591060000, "content": "And last: Light-comparison between ugly donuts center spot filter and quite OK bubble bokeh... --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/?tab=comments#comment-3412441", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "and last: light-comparison between ugly donuts center -----> spot !!!  filter and quite ok bubble bokeh... --img-- --img-- ", "sortedWord": "None", "identifyer": 12003, "year": "2017"}, {"Unnamed: 0": 399366, "autor": "Wonzo", "date": 1512659160000, "content": "Lik, I have a few questions: have you already used the Center Spot Filter ? Did you take some of these fotos stopped down or were they all taken fully open ? Have you been using the EVF ? What is it like without using the EVF ? Thank you !", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/3/?tab=comments#comment-3413018", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lik, i have a few questions: have you already used the center -----> spot !!!  filter ? did you take some of these fotos stopped down or were they all taken fully open ? have you been using the evf ? what is it like without using the evf ? thank you !", "sortedWord": "None", "identifyer": 12044, "year": "2017"}, {"Unnamed: 0": 399368, "autor": "lik", "date": 1512660360000, "content": "Lik, I have a few questions: have you already used the Center Spot Filter ? Did you take some of these fotos stopped down or were they all taken fully open ? Have you been using the EVF ? What is it like without using the EVF ? Thank you !Hi Wonzo,sitting in taxi let me answer in short: All daylight are with the center spot Night without - except those I wanted to show the ugly donuts bokeh All wide open. One at 6.3 with Center spot and it worked! Unfortunately I don’t have it with me now. EVF - I’m glad I already have one - otherwise I would buy one. It seems to have some little focus shift at far distance focus. But it’s very little and I must have some more experience. The good news is: even as soft as it is - often through EVF I could manage to find focus peaking Best regards lik Gesendet von iPhone mit Tapatalk Pro", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/3/?tab=comments#comment-3413028", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "lik, i have a few questions: have you already used the center -----> spot !!!  filter ? did you take some of these fotos stopped down or were they all taken fully open ? have you been using the evf ? what is it like without using the evf ? thank you !hi wonzo,sitting in taxi let me answer in short: all daylight are with the center spot night without - except those i wanted to show the ugly donuts bokeh all wide open. one at 6.3 with center spot and it worked! unfortunately i don’t have it with me now. evf - i’m glad i already have one - otherwise i would buy one. it seems to have some little focus shift at far distance focus. but it’s very little and i must have some more experience. the good news is: even as soft as it is - often through evf i could manage to find focus peaking best regards lik gesendet von iphone mit tapatalk pro", "sortedWord": "None", "identifyer": 12046, "year": "2017"}, {"Unnamed: 0": 399375, "autor": "IkarusJohn", "date": 1512674580000, "content": "What a tricky lens! Interesting, though. I assume that if you use the centre spot, you have to shoot wide open, otherwise the spot becomes visible in the image? I would think the lens is better suited to dreamy strong composition with a single subject; a youth lounging about on a sultry afternoon (shades of Lolita), those slightly formal portraits with a 1,000 yard stare popular in the 1930s ... that sort of thing. Controling highlights will be a challenge; and using the lens to effect where it gives an interesting image of the subject, rather than a technical example of the quality of the lens. Good luck with this, Lik. Not a challenge I would rise to, but I salute your enthusiasm!", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/3/?tab=comments#comment-3413163", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what a tricky lens! interesting, though. i assume that if you use the centre -----> spot !!! , you have to shoot wide open, otherwise the -----> spot !!!  becomes visible in the image? i would think the lens is better suited to dreamy strong composition with a single subject; a youth lounging about on a sultry afternoon (shades of lolita), those slightly formal portraits with a 1,000 yard stare popular in the 1930s ... that sort of thing. controling highlights will be a challenge; and using the lens to effect where it gives an interesting image of the subject, rather than a technical example of the quality of the lens. good luck with this, lik. not a challenge i would rise to, but i salute your enthusiasm!", "sortedWord": "None", "identifyer": 12053, "year": "2017"}, {"Unnamed: 0": 399376, "autor": "pop", "date": 1512676860000, "content": "What a tricky lens! Interesting, though. I assume that if you use the centre spot, you have to shoot wide open, otherwise the spot becomes visible in the image? ... Stopping down by more than a very few stops will make the aperture smaller than the spot, resulting in total darkness.", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/3/?tab=comments#comment-3413189", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what a tricky lens! interesting, though. i assume that if you use the centre -----> spot !!! , you have to shoot wide open, otherwise the -----> spot !!!  becomes visible in the image? ... stopping down by more than a very few stops will make the aperture smaller than the spot, resulting in total darkness.", "sortedWord": "None", "identifyer": 12054, "year": "2017"}, {"Unnamed: 0": 399380, "autor": "lik", "date": 1512684300000, "content": "What a tricky lens! Interesting, though. I assume that if you use the centre spot, you have to shoot wide open, otherwise the spot becomes visible in the image?The center spot definitely works until 6.3. Closing more makes a big black spot on the image. Thanks your wishes - it’s a challenge with lot of fun! Gesendet von iPhone mit Tapatalk Pro", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/4/?tab=comments#comment-3413267", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what a tricky lens! interesting, though. i assume that if you use the centre -----> spot !!! , you have to shoot wide open, otherwise the -----> spot !!!  becomes visible in the image?the center -----> spot !!!  definitely works until 6.3. closing more makes a big black spot on the image. thanks your wishes - it’s a challenge with lot of fun! gesendet von iphone mit tapatalk pro", "sortedWord": "None", "identifyer": 12058, "year": "2017"}, {"Unnamed: 0": 399405, "autor": "Wonzo", "date": 1512751020000, "content": "Today I had the opportunity to hold the Thambar in my hands. My local Leica dealer had arranged a presentation of Leica products and I was very happy to realize, that the Leica representative could follow my request for a Thambar. I was informed about this special opportunity yesterday and as you can imagine, I was very excited and very much looking forward to test the lens. Unfortunately the weather conditions were bad but anyway I took it outside for about an hour. What can I say after this short period of time ... the Thambar is amazing – if you have an idea of what you hold in your hands .... It produces dreamy pictures with the center spot filter as well as without it wide open. The lens can be stopped down until 6,3 before the center spot filter produces a black picture. If you focus precisely wide open, the lens is medium sharp and light sources are medium blurry. All in all you have a dreamy effect this way. The more you go out of focus, the more blurry the lights get as you can also see from the first picture which Lic has presented in this thread. It`s up to you, how dreamy and blurry you want to create your picture. Without the center spot filter, pictures are really sharp the more you stop down. The resumé after this short testing is, that the Thambar still keeps surprises hidden which need some more testing. My first impression is, that it is much more versatile than I had imagined. Fortunately, the representative offered me another opportunity of testing tomorrow. Hopefully, the weather is going to be a bit better with a little sunshine ....", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/5/?tab=comments#comment-3413805", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "today i had the opportunity to hold the thambar in my hands. my local leica dealer had arranged a presentation of leica products and i was very happy to realize, that the leica representative could follow my request for a thambar. i was informed about this special opportunity yesterday and as you can imagine, i was very excited and very much looking forward to test the lens. unfortunately the weather conditions were bad but anyway i took it outside for about an hour. what can i say after this short period of time ... the thambar is amazing – if you have an idea of what you hold in your hands .... it produces dreamy pictures with the center -----> spot !!!  filter as well as without it wide open. the lens can be stopped down until 6,3 before the center spot filter produces a black picture. if you focus precisely wide open, the lens is medium sharp and light sources are medium blurry. all in all you have a dreamy effect this way. the more you go out of focus, the more blurry the lights get as you can also see from the first picture which lic has presented in this thread. it`s up to you, how dreamy and blurry you want to create your picture. without the center spot filter, pictures are really sharp the more you stop down. the resumé after this short testing is, that the thambar still keeps surprises hidden which need some more testing. my first impression is, that it is much more versatile than i had imagined. fortunately, the representative offered me another opportunity of testing tomorrow. hopefully, the weather is going to be a bit better with a little sunshine ....", "sortedWord": "None", "identifyer": 12083, "year": "2017"}, {"Unnamed: 0": 399427, "autor": "lik", "date": 1512854280000, "content": "Hello again, these days I have really very few opportunity to takes photos as I like - so I'm really sorry - again no portrait. They will come later. Nevertheless I just stopped the car to take one and want to share with you one pic at 2.2, about 4 and 6.3 'ish all without center spot filter (let's call it CSF). Of course it's not a APO Cron but I think the difference is remarkable and makes it also a choice for 90 mm \"as usual\" pics. --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/6/?tab=comments#comment-3414568", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hello again, these days i have really very few opportunity to takes photos as i like - so i'm really sorry - again no portrait. they will come later. nevertheless i just stopped the car to take one and want to share with you one pic at 2.2, about 4 and 6.3 'ish all without center -----> spot !!!  filter (let's call it csf). of course it's not a apo cron but i think the difference is remarkable and makes it also a choice for 90 mm \"as usual\" pics. --img-- --img-- --img-- ", "sortedWord": "None", "identifyer": 12105, "year": "2017"}, {"Unnamed: 0": 399452, "autor": "lik", "date": 1512933600000, "content": "Anybody remember the Rodenstock Imagon ? Had a look at it right now. Interesting. Seems to be kind of the opposite of the Thambar - sharp in the center instead of center spot filter... ?", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/7/?tab=comments#comment-3415147", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "anybody remember the rodenstock imagon ? had a look at it right now. interesting. seems to be kind of the opposite of the thambar - sharp in the center instead of center -----> spot !!!  filter... ?", "sortedWord": "None", "identifyer": 12132, "year": "2017"}, {"Unnamed: 0": 399454, "autor": "Susie", "date": 1512986520000, "content": "Anybody remember the Rodenstock Imagon ? I used to have them in 250mm and 350mm sizes, both in large Compound (pneumatic) shutters, when I messed about with a 5x7 Linhof Super Technika. The \"tea strainers\" are there to vary the halo effect by cutting out some of the outer light rays. Of course they also reduce the aperture, much the same way as the central spot filter on the Thambar, which is the reason they have an f-stop rating on them, but they do not act as a diaphram. As one cannot stop down as normal, the full set also included a neutral density filter, and lens hood. Once again, a look that is sometimes regarded as dated, or to some, just out of focus (which is actually very different), and like the Thambar requires experimentation to achieve the required result, which is an image that is only produced in camera, by a lens designed to do that job - unless one happens to have a jar of Vaseline or toffee wrapper handy... Happy snapping, Susie", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/7/?tab=comments#comment-3415510", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "anybody remember the rodenstock imagon ? i used to have them in 250mm and 350mm sizes, both in large compound (pneumatic) shutters, when i messed about with a 5x7 linhof super technika. the \"tea strainers\" are there to vary the halo effect by cutting out some of the outer light rays. of course they also reduce the aperture, much the same way as the central -----> spot !!!  filter on the thambar, which is the reason they have an f-stop rating on them, but they do not act as a diaphram. as one cannot stop down as normal, the full set also included a neutral density filter, and lens hood. once again, a look that is sometimes regarded as dated, or to some, just out of focus (which is actually very different), and like the thambar requires experimentation to achieve the required result, which is an image that is only produced in camera, by a lens designed to do that job - unless one happens to have a jar of vaseline or toffee wrapper handy... happy snapping, susie", "sortedWord": "None", "identifyer": 12134, "year": "2017"}, {"Unnamed: 0": 399489, "autor": "wattsy", "date": 1513158720000, "content": "What are your expectations, and what are you hoping to photograph with the lens? Susie, I'm not entirely sure but I suppose I'm thinking of bringing a whiff of pictorialism into my landscape photography. I have been hoping that, used at the right aperture (either with or perhaps more likely without the spot filter) and in the right light, this lens might be able to introduce a controlled 'glow' into an otherwise basically sharp photograph. I'm also intrigued about the possibilities for portraiture but that wouldn't be my primary interest. It might be that I'm intrigued by this lens largely because the reintroduction has been met with a mixture of opprobrium and condescension by the orthodox digital photography crowd. I tend to feel that anything that the \"sharpness/megapixels/bokeh/IQ\" bunch don't like is something worth looking at. At the moment I'm seeing a little bit too much kitsch. I dare say a lens of this nature requires a great deal of experimentation but I'm beginning to wonder if this kind of photography is better served by a larger format than 35mm. Leica at Bruton Place haven't got a demo lens in yet (at least they didn't when I was there recently) but I will certainly try it out with a roll or two of film as much as I can within the limitations of borrowing it for half an hour within strolling distance of the shop. At £5,000, it's far too expensive for me to take a punt on without having tested it on a number of occasions but I remain open minded. But all these thoughts are useless anyway if I`m excited about this lens, if I have an idea of how to use it and it I have fun with it. I won`t waste a minute on how much the value of this lens might decline just as I don`t brood on the decline in value of my car, TV or computer or what else – you name it. We are lucky enough with collecting Leica lenses, which usually keep their value or even increase their value, why not the Thambar ? I take your point and certainly agree with you for Leica gear that is likely to be owned for the long haul. However, for equipment that I am far less sure about, the resale value can be relevant. In my experience, some of the more specialised lenses (like, for instance, the Macro Elmar-M) can be difficult to sell unless sold at a substantial discount to the RRP.", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/9/?tab=comments#comment-3416913", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "what are your expectations, and what are you hoping to photograph with the lens? susie, i'm not entirely sure but i suppose i'm thinking of bringing a whiff of pictorialism into my landscape photography. i have been hoping that, used at the right aperture (either with or perhaps more likely without the -----> spot !!!  filter) and in the right light, this lens might be able to introduce a controlled 'glow' into an otherwise basically sharp photograph. i'm also intrigued about the possibilities for portraiture but that wouldn't be my primary interest. it might be that i'm intrigued by this lens largely because the reintroduction has been met with a mixture of opprobrium and condescension by the orthodox digital photography crowd. i tend to feel that anything that the \"sharpness/megapixels/bokeh/iq\" bunch don't like is something worth looking at. at the moment i'm seeing a little bit too much kitsch. i dare say a lens of this nature requires a great deal of experimentation but i'm beginning to wonder if this kind of photography is better served by a larger format than 35mm. leica at bruton place haven't got a demo lens in yet (at least they didn't when i was there recently) but i will certainly try it out with a roll or two of film as much as i can within the limitations of borrowing it for half an hour within strolling distance of the shop. at £5,000, it's far too expensive for me to take a punt on without having tested it on a number of occasions but i remain open minded. but all these thoughts are useless anyway if i`m excited about this lens, if i have an idea of how to use it and it i have fun with it. i won`t waste a minute on how much the value of this lens might decline just as i don`t brood on the decline in value of my car, tv or computer or what else – you name it. we are lucky enough with collecting leica lenses, which usually keep their value or even increase their value, why not the thambar ? i take your point and certainly agree with you for leica gear that is likely to be owned for the long haul. however, for equipment that i am far less sure about, the resale value can be relevant. in my experience, some of the more specialised lenses (like, for instance, the macro elmar-m) can be difficult to sell unless sold at a substantial discount to the rrp.", "sortedWord": "None", "identifyer": 12169, "year": "2017"}, {"Unnamed: 0": 399499, "autor": "derleicaman", "date": 1513290840000, "content": "Here are some quick and dirty test shots I did with my ltm Thambar #226061 (1934). This is an early chrome trim version with clean elements. I used an Oskar Barnack commemorative plaque that some of you may be familiar with. I used my M10 and converted the images to B&W, but no other manipulation was done. I did three images from wide open with and without the spot filter. I then stopped the lens down to the next indicated stop on the lens barrel (2.5/2.4) and then the next one after that (2.8/2.6). Hopefully this will give some idea of the Thambar rendering from wide open with and without spot and slightly stopped down. Wide Open with Spot Filter --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/10/?tab=comments#comment-3417982", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "here are some quick and dirty test shots i did with my ltm thambar #226061 (1934). this is an early chrome trim version with clean elements. i used an oskar barnack commemorative plaque that some of you may be familiar with. i used my m10 and converted the images to b&w, but no other manipulation was done. i did three images from wide open with and without the -----> spot !!!  filter. i then stopped the lens down to the next indicated stop on the lens barrel (2.5/2.4) and then the next one after that (2.8/2.6). hopefully this will give some idea of the thambar rendering from wide open with and without spot and slightly stopped down. wide open with spot filter --img-- ", "sortedWord": "None", "identifyer": 12179, "year": "2017"}, {"Unnamed: 0": 399506, "autor": "albertknappmd", "date": 1513446060000, "content": "Here are some quick and dirty test shots I did with my ltm Thambar #226061 (1934). This is an early chrome trim version with clean elements. I used an Oskar Barnack commemorative plaque that some of you may be familiar with. I used my M10 and converted the images to B&W, but no other manipulation was done. I did three images from wide open with and without the spot filter. I then stopped the lens down to the next indicated stop on the lens barrel (2.5/2.4) and then the next one after that (2.8/2.6). Hopefully this will give some idea of the Thambar rendering from wide open with and without spot and slightly stopped down. Wide Open with Spot Filter --img-- L1001478.jpg Bill Are you sure that 186 and 187 are not reversed? Barnack seems sharper with spot filter... Albert", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/10/?tab=comments#comment-3419157", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "here are some quick and dirty test shots i did with my ltm thambar #226061 (1934). this is an early chrome trim version with clean elements. i used an oskar barnack commemorative plaque that some of you may be familiar with. i used my m10 and converted the images to b&w, but no other manipulation was done. i did three images from wide open with and without the -----> spot !!!  filter. i then stopped the lens down to the next indicated stop on the lens barrel (2.5/2.4) and then the next one after that (2.8/2.6). hopefully this will give some idea of the thambar rendering from wide open with and without spot and slightly stopped down. wide open with spot filter --img-- l1001478.jpg bill are you sure that 186 and 187 are not reversed? barnack seems sharper with spot filter... albert", "sortedWord": "None", "identifyer": 12186, "year": "2017"}, {"Unnamed: 0": 399517, "autor": "farnz", "date": 1513594560000, "content": ". I'm not sure I'd be ready to consign the Thambar to being a 'B&W lens'. All lenses handle colours slightly differently (of course) and the Thambar can produce engaging pastel colours that, to my mind, sit somewhere between my 1947 Carl Zeiss Jena 50/2 Sonnar and my 50/1 Noctilux v4; they're not 'in your face' colours but gentler and more subdued and perhaps suited better to some subjects than others. I had the pleasure of using Susie's LTM Thambar at a forum get together on Saturday (the first time I've used this lens). Here is a portrait of forum member Myvalko taken with my M10 and the Thambar with centre spot filter at about f/2.4 (there are no aperture click stops on this lens) and at about the closest focus distance. The raw file had a distinctive blue cast, probably owing to AWB and the complex soup of ambient lighting (tungsten, LED, and daylight), so I rebalanced it in post, dodged lightly to bring the face forward a little from the strong background and applied very light global sharpening to adjust for natural raw 'unsharpness'. It's not a particularly strong portrait but, to my mind, it does show that the Thambar can produce pleasing colour pictures. Pete. --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/11/?tab=comments#comment-3420398", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": ". i'm not sure i'd be ready to consign the thambar to being a 'b&w lens'. all lenses handle colours slightly differently (of course) and the thambar can produce engaging pastel colours that, to my mind, sit somewhere between my 1947 carl zeiss jena 50/2 sonnar and my 50/1 noctilux v4; they're not 'in your face' colours but gentler and more subdued and perhaps suited better to some subjects than others. i had the pleasure of using susie's ltm thambar at a forum get together on saturday (the first time i've used this lens). here is a portrait of forum member myvalko taken with my m10 and the thambar with centre -----> spot !!!  filter at about f/2.4 (there are no aperture click stops on this lens) and at about the closest focus distance. the raw file had a distinctive blue cast, probably owing to awb and the complex soup of ambient lighting (tungsten, led, and daylight), so i rebalanced it in post, dodged lightly to bring the face forward a little from the strong background and applied very light global sharpening to adjust for natural raw 'unsharpness'. it's not a particularly strong portrait but, to my mind, it does show that the thambar can produce pleasing colour pictures. pete. --img-- ", "sortedWord": "None", "identifyer": 12197, "year": "2017"}, {"Unnamed: 0": 399532, "autor": "hmathias", "date": 1513997400000, "content": "I have been following this tread with great interest. I have not tried the new Thambar yet, but I am very interested to do that. Based on what I have seen on the examples here, I will venture a modestly informed guess as to what is optically at work here. This lens is designed to exhibit an \"excessive\" amount of spherical aberration. Which makes it similar to many very early lens designs, on often uncoated lens. Such spherical aberration would naturally improve (reduce) when the lens is stooped down, (which you can see in most of these pictures) and therefore the image would also get sharper when stopped down. A lens designed to perform this way would naturally be extra sensitive to bright light sources and to lens flare from highlights and hot backlight, as you can see. You would also expect this lens to respond with more sharpness to contrasty lighting on subjects and on portraits, which it does in these examples. The Center Spot Filter makes this halo effect more independent of lens flare and the lens aperture being used. but the downside of the CSF is that it leads to circular \"donut\" bokeh, due to the shape of center spot. The same way that 5-bladed apertures in old Japanese lenses used to lead to pentagonal shaped bokeh. I am guessing (not having tested this lens) that the circular \"donut\" bokeh only occurs when the CSF is used. Is this correct?", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/11/?tab=comments#comment-3423880", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have been following this tread with great interest. i have not tried the new thambar yet, but i am very interested to do that. based on what i have seen on the examples here, i will venture a modestly informed guess as to what is optically at work here. this lens is designed to exhibit an \"excessive\" amount of spherical aberration. which makes it similar to many very early lens designs, on often uncoated lens. such spherical aberration would naturally improve (reduce) when the lens is stooped down, (which you can see in most of these pictures) and therefore the image would also get sharper when stopped down. a lens designed to perform this way would naturally be extra sensitive to bright light sources and to lens flare from highlights and hot backlight, as you can see. you would also expect this lens to respond with more sharpness to contrasty lighting on subjects and on portraits, which it does in these examples. the center -----> spot !!!  filter makes this halo effect more independent of lens flare and the lens aperture being used. but the downside of the csf is that it leads to circular \"donut\" bokeh, due to the shape of center spot. the same way that 5-bladed apertures in old japanese lenses used to lead to pentagonal shaped bokeh. i am guessing (not having tested this lens) that the circular \"donut\" bokeh only occurs when the csf is used. is this correct?", "sortedWord": "None", "identifyer": 12212, "year": "2017"}, {"Unnamed: 0": 399546, "autor": "Princess Leica", "date": 1514520900000, "content": "DK Moore's question is a good one. Because while Lik's pictures are beautiful when the glow in them is soft and milky, a few of the images seem to me too mushy. I wonder if the coming Noctilux 75 will achieve that sweet spot of blur and realism and deliver what we hope to get from the Thambar which the Thambar may not be capable of actually delivering?", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/12/?tab=comments#comment-3427540", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dk moore's question is a good one. because while lik's pictures are beautiful when the glow in them is soft and milky, a few of the images seem to me too mushy. i wonder if the coming noctilux 75 will achieve that sweet -----> spot !!!  of blur and realism and deliver what we hope to get from the thambar which the thambar may not be capable of actually delivering?", "sortedWord": "None", "identifyer": 12226, "year": "2017"}, {"Unnamed: 0": 399554, "autor": "farnz", "date": 1514550120000, "content": "DK Moore's question is a good one. Because while Lik's pictures are beautiful when the glow in them is soft and milky, a few of the images seem to me too mushy. I wonder if the coming Noctilux 75 will achieve that sweet spot of blur and realism and deliver what we hope to get from the Thambar which the Thambar may not be capable of actually delivering? Well, different lenses, different characters, different hope, and different abilities. The Thambar was/is designed to be a soft focus lens but the 75 Noctilux produces quite similar performance to the 75 Summilux (a month or so ago I mistook unnamed 75 Noctilux pictures to be from the Summilux) but quite different from the Thambar's. The Thambar's 'glowiness', blur, and sharpness can be controlled to an extent through the centre spot filter, aperture, and ambient lighting conditions - as with any other lens - but it always has a 'Thambar signature' (glow and soft focus perhaps?) that the 75 Noctilux can't produce. The Thambar's design is based on a Cook Triplet, which prevents much control because there are few lens elements and and there is little correction and which produces the special look in Thambar pictures. Pete.", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/12/?tab=comments#comment-3427746", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "dk moore's question is a good one. because while lik's pictures are beautiful when the glow in them is soft and milky, a few of the images seem to me too mushy. i wonder if the coming noctilux 75 will achieve that sweet -----> spot !!!  of blur and realism and deliver what we hope to get from the thambar which the thambar may not be capable of actually delivering? well, different lenses, different characters, different hope, and different abilities. the thambar was/is designed to be a soft focus lens but the 75 noctilux produces quite similar performance to the 75 summilux (a month or so ago i mistook unnamed 75 noctilux pictures to be from the summilux) but quite different from the thambar's. the thambar's 'glowiness', blur, and sharpness can be controlled to an extent through the centre spot filter, aperture, and ambient lighting conditions - as with any other lens - but it always has a 'thambar signature' (glow and soft focus perhaps?) that the 75 noctilux can't produce. the thambar's design is based on a cook triplet, which prevents much control because there are few lens elements and and there is little correction and which produces the special look in thambar pictures. pete.", "sortedWord": "None", "identifyer": 12234, "year": "2017"}, {"Unnamed: 0": 403370, "autor": "MT0227", "date": 1510075800000, "content": "Leica M6 Noctilux f/1 (V4) Portra 160 Scanned with Nikon LS-9000 --img--  \"Reading Spot\" by Marc Tauber, on Flickr", "link": "https://www.l-camera-forum.com/topic/266277-show-us-some-mandler-magic/page/12/?tab=comments#comment-3391076", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "leica m6 noctilux f/1 (v4) portra 160 scanned with nikon ls-9000 --img--  \"reading -----> spot !!! \" by marc tauber, on flickr", "sortedWord": "None", "identifyer": 16119, "year": "2017"}, {"Unnamed: 0": 404184, "autor": "adan", "date": 1503894960000, "content": "Regarding coogee's \"ring flare\" - post 11 and 12 - I have seen that with the 35mm SUMMILUX f/1.4 ASPH. Not specifically with the Summicron ASPH though. As I recall with the Summilux, it was from a streetlight above and just outside the frame, in an otherwise night-dark picture. But I've also seen it with the Summilux NON-ASPH at least once. So I think that it may be more of a \"fast 35\" than an \"ASPH\" thing. It is fairly simple to detect internal barrel flare, by just taking the lens off the camera, and looking through it from the back from 6 inches away or so. While pointing it near (but not directly at) a bright light source in an otherwise dark room. Fairly easy to see a bright crescent inside the lens barrel if light outside the picture edge is bouncing off that. As to whether the filter contributed - just go back to that \"cat kitchen\" at the same time of day/lighting (with or without cat) and make some tests with and without the filter. If coogee was using a digital M instead of film, I might suspect the concave rear elements of the ASPH 35s. Like a curved mirror lens, they can reflect and focus bright image areas from the shiny sensor back to the sensor, and cause flare spots - that don't occur with dull film. | <) I have eliminated the lenses with concave rear elements (certain 28/35/50/75 ASPHs) from my stable, for use on digital sensors.", "link": "https://www.l-camera-forum.com/topic/215282-35mm-f2-summicron-asph-flaring-issues/?tab=comments#comment-3346478", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "regarding coogee's \"ring flare\" - post 11 and 12 - i have seen that with the 35mm summilux f/1.4 asph. not specifically with the summicron asph though. as i recall with the summilux, it was from a streetlight above and just outside the frame, in an otherwise night-dark picture. but i've also seen it with the summilux non-asph at least once. so i think that it may be more of a \"fast 35\" than an \"asph\" thing. it is fairly simple to detect internal barrel flare, by just taking the lens off the camera, and looking through it from the back from 6 inches away or so. while pointing it near (but not directly at) a bright light source in an otherwise dark room. fairly easy to see a bright crescent inside the lens barrel if light outside the picture edge is bouncing off that. as to whether the filter contributed - just go back to that \"cat kitchen\" at the same time of day/lighting (with or without cat) and make some tests with and without the filter. if coogee was using a digital m instead of film, i might suspect the concave rear elements of the asph 35s. like a curved mirror lens, they can reflect and focus bright image areas from the shiny sensor back to the sensor, and cause flare -----> spots !!!  - that don't occur with dull film. | <) i have eliminated the lenses with concave rear elements (certain 28/35/50/75 asphs) from my stable, for use on digital sensors.", "sortedWord": "None", "identifyer": 16944, "year": "2017"}, {"Unnamed: 0": 406644, "autor": "Ernest", "date": 1493015400000, "content": "Yes, Overgaard deserves applause for his E43 Ventilated Lens Shade specifically designed for the black chrome 50mm Summilux-M. Made of black painted aluminum, the E43 hood (about 65 mm O.D. x 20mm h) is more shallow and lightweight than Leica's black chromed brass lens hood (65mm x 29mm h). The E43 hood screws into the lens, whereas the Leica hood mounts with hood catches, which we all know does not permit the use of a filter with the hood attached to the lens. Here, Overgaard solves the problem that escaped Leica and frustrated all of us. That Leica would design a lens that would not permit attaching a filter and the Leica lens hood simultaneously is perplexing. Leica announced that the limited edition black chrome Lux was inspired by the 1959 Summilux, somehow forgetting that the original design accepted only slim E43 Leica filters, as described by Ken Rockwell: \"The maximum outside diameter of these 43mm-threaded filters is just 43.8mm, and they extend only 3.00mm forward from the lens' front filter-mounting flange.\" These filters cannot be used on the black chrome Lux because their thread pitch is 0.5 mm. For this reason, current filters cannot be switched out into the older 43.8mm x 3mm x 0.5mm p mounts, which will cross thread the black chrome Lux. B & H 43mm filters, on the other hand, are 45mm x 4mm x 0.75mm p. Instead of buying Overgaard's E43 Black Paint Ventilated Shade for $159 (E43 Silver Ventilated Shade $169 or E43 Red Ventilated Shade $189), there is the Amazon option of a 43mm vented lens hood, black anodized aluminum, (23mm x 55mm) for $10 or less. These don't have the cool factor of the Overgaard E43s, though I was disappointed in the quality control of my Black Paint E43 when it arrived, which had two rough spots that were simply not finished well. Even so, one can only appreciate that the E43 meets the demand of a narrow market and will probably sell out in short order. A useful feature of Overgaard's E43 hood is the built-in step up ring that accommodates 46mm filters. Two lens filter caps are included with the package: 43mm and 46mm. Sent from my iPhone using Tapatalk", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/8/?tab=comments#comment-3261072", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "yes, overgaard deserves applause for his e43 ventilated lens shade specifically designed for the black chrome 50mm summilux-m. made of black painted aluminum, the e43 hood (about 65 mm o.d. x 20mm h) is more shallow and lightweight than leica's black chromed brass lens hood (65mm x 29mm h). the e43 hood screws into the lens, whereas the leica hood mounts with hood catches, which we all know does not permit the use of a filter with the hood attached to the lens. here, overgaard solves the problem that escaped leica and frustrated all of us. that leica would design a lens that would not permit attaching a filter and the leica lens hood simultaneously is perplexing. leica announced that the limited edition black chrome lux was inspired by the 1959 summilux, somehow forgetting that the original design accepted only slim e43 leica filters, as described by ken rockwell: \"the maximum outside diameter of these 43mm-threaded filters is just 43.8mm, and they extend only 3.00mm forward from the lens' front filter-mounting flange.\" these filters cannot be used on the black chrome lux because their thread pitch is 0.5 mm. for this reason, current filters cannot be switched out into the older 43.8mm x 3mm x 0.5mm p mounts, which will cross thread the black chrome lux. b & h 43mm filters, on the other hand, are 45mm x 4mm x 0.75mm p. instead of buying overgaard's e43 black paint ventilated shade for $159 (e43 silver ventilated shade $169 or e43 red ventilated shade $189), there is the amazon option of a 43mm vented lens hood, black anodized aluminum, (23mm x 55mm) for $10 or less. these don't have the cool factor of the overgaard e43s, though i was disappointed in the quality control of my black paint e43 when it arrived, which had two rough -----> spots !!!  that were simply not finished well. even so, one can only appreciate that the e43 meets the demand of a narrow market and will probably sell out in short order. a useful feature of overgaard's e43 hood is the built-in step up ring that accommodates 46mm filters. two lens filter caps are included with the package: 43mm and 46mm. sent from my iphone using tapatalk", "sortedWord": "None", "identifyer": 19425, "year": "2017"}, {"Unnamed: 0": 422991, "autor": "LocalHero1953", "date": 1511522880000, "content": "First shots with the CL, picked up yesterday from Leica Mayfair. I traded in the TL2 and 23mm, so these are all with the 60mm for the moment. All shots raw SOOC, converted in LR (embedded profile - no Adobe profile available), A-mode, AWB, spot focus, spot exposure (with exposure compensation where necessary). A couple of comments on focus. As one might anticipate, field focus struggled to pick up the small targets in these shots. Spot focus was generally fine, but I forgot I had it set on range-limited focus; for macro shots, I had to manually focus the 60mm into the macro range (half press on the shutter button, turn the focus ring) before AF would pick up the target. I'll try again later with range-limited focus switched off. Moving the focus point on such a small camera with a smallish dial is fiddly, but I'll get used to it. f/2.8, 1/640s, ISO100 --img--  f/2.8, 1/250s, ISO100 --img-- ", "link": "https://www.l-camera-forum.com/topic/320292-cl-the-image-thread/page/2/?tab=comments#comment-3402564", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "first shots with the cl, picked up yesterday from leica mayfair. i traded in the tl2 and 23mm, so these are all with the 60mm for the moment. all shots raw sooc, converted in lr (embedded profile - no adobe profile available), a-mode, awb, -----> spot !!!  focus, -----> spot !!!  exposure (with exposure compensation where necessary). a couple of comments on focus. as one might anticipate, field focus struggled to pick up the small targets in these shots. spot focus was generally fine, but i forgot i had it set on range-limited focus; for macro shots, i had to manually focus the 60mm into the macro range (half press on the shutter button, turn the focus ring) before af would pick up the target. i'll try again later with range-limited focus switched off. moving the focus point on such a small camera with a smallish dial is fiddly, but i'll get used to it. f/2.8, 1/640s, iso100 --img--  f/2.8, 1/250s, iso100 --img-- ", "sortedWord": "None", "identifyer": 36041, "year": "2017"}, {"Unnamed: 0": 422993, "autor": "LocalHero1953", "date": 1511523360000, "content": "Homage to Ken Dodd Spot AF appeared to pick up cobwebs, once in the macro focusing range f/5.6, 1/60s, ISO200 --img--  Trying to warm up on a cold day f/11, 1/60s, ISO200, -1 stop exposure compensation --img-- ", "link": "https://www.l-camera-forum.com/topic/320292-cl-the-image-thread/page/2/?tab=comments#comment-3402568", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "homage to ken dodd -----> spot !!!  af appeared to pick up cobwebs, once in the macro focusing range f/5.6, 1/60s, iso200 --img--  trying to warm up on a cold day f/11, 1/60s, iso200, -1 stop exposure compensation --img-- ", "sortedWord": "None", "identifyer": 36043, "year": "2017"}, {"Unnamed: 0": 422997, "autor": "scott kirkpatrick", "date": 1511526360000, "content": "Homage to Ken Dodd Spot AF appeared to pick up cobwebs, once in the macro focusing range f/5.6, 1/60s, ISO200 --img-- untitled 24-11-17 -27.jpg Trying to warm up on a cold day f/11, 1/60s, ISO200, -1 stop exposure compensation --img-- untitled 24-11-17 -35.jpg Very nice, but what lens were you using? Sorry, reading back to front, now I see that you are using the TL 60 macro, which makes sense. Edited November 24, 2017 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/320292-cl-the-image-thread/page/2/?tab=comments#comment-3402610", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "homage to ken dodd -----> spot !!!  af appeared to pick up cobwebs, once in the macro focusing range f/5.6, 1/60s, iso200 --img-- untitled 24-11-17 -27.jpg trying to warm up on a cold day f/11, 1/60s, iso200, -1 stop exposure compensation --img-- untitled 24-11-17 -35.jpg very nice, but what lens were you using? sorry, reading back to front, now i see that you are using the tl 60 macro, which makes sense. edited november 24, 2017 by scott kirkpatrick", "sortedWord": "None", "identifyer": 36047, "year": "2017"}, {"Unnamed: 0": 423080, "autor": "LocalHero1953", "date": 1512558120000, "content": "Good to see more images taken with the CL now it is getting out into the wild. CL+60mm. Queens' College, Cambridge. As I mentioned in another thread, the CL failed to lock focus on the windows with spot or field, but managed it with multi-field. The original shot was much contrastier than this, with no visible detail on the wall. Moments later it had no trouble focusing on lights reflected in rippling water. --img-- ", "link": "https://www.l-camera-forum.com/topic/320292-cl-the-image-thread/page/6/?tab=comments#comment-3412059", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "good to see more images taken with the cl now it is getting out into the wild. cl+60mm. queens' college, cambridge. as i mentioned in another thread, the cl failed to lock focus on the windows with -----> spot !!!  or field, but managed it with multi-field. the original shot was much contrastier than this, with no visible detail on the wall. moments later it had no trouble focusing on lights reflected in rippling water. --img-- ", "sortedWord": "None", "identifyer": 36130, "year": "2017"}, {"Unnamed: 0": 423226, "autor": "Guest VVJ", "date": 1513987620000, "content": "December in Miami... (Apologies to those who are in cold weather!) --img--  If you were to spot another CL in the wild in Miami feel free to come over and say hi... --img-- ", "link": "https://www.l-camera-forum.com/topic/320292-cl-the-image-thread/page/13/?tab=comments#comment-3423842", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "december in miami... (apologies to those who are in cold weather!) --img--  if you were to -----> spot !!!  another cl in the wild in miami feel free to come over and say hi... --img-- ", "sortedWord": "None", "identifyer": 36276, "year": "2017"}, {"Unnamed: 0": 423270, "autor": "vikasmg", "date": 1514326260000, "content": "Thank you, Louis and yes the decision is quite difficult. I appreciate your input. I find the AF with the CL to be much quicker, IQ may be the same but the ooc jpegs seem to be more warm (which I like), and the built in evf is a real plus. So, perhaps \"capturing the moment\" is just a bit better. Otoh, the build does not have the same feel as the T/TL2, and the T/TL2, to my eyes, is just a beautiful piece of sculpture. (I see myself using either the TL2 or the CL with just AF lenses). I was going to stick with the TL2 for the above reasons (and thinking that they will do a software update to better the AF), but I'm now thinking I will keep both, use them for awhile, and then sell the one which I do not enjoy as much. Decisions, decisions. I’m not sure about the TL2 now, but withe the CL the 35mm 1.4 seems lighting fast to focus. And the spot focus is accurate! The one issue I have is that sometimes, because of the small size of the camera, my hand accidentally pushes the direction buttons and moves the point of focus to the side. And the cross indicating the focus point is so small I don’t realize it moved till I try and focus and it focuses on something I don’t expect! Easy enough to correct and not a major problem, but still an irritant. - Vikas", "link": "https://www.l-camera-forum.com/topic/320292-cl-the-image-thread/page/16/?tab=comments#comment-3425951", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thank you, louis and yes the decision is quite difficult. i appreciate your input. i find the af with the cl to be much quicker, iq may be the same but the ooc jpegs seem to be more warm (which i like), and the built in evf is a real plus. so, perhaps \"capturing the moment\" is just a bit better. otoh, the build does not have the same feel as the t/tl2, and the t/tl2, to my eyes, is just a beautiful piece of sculpture. (i see myself using either the tl2 or the cl with just af lenses). i was going to stick with the tl2 for the above reasons (and thinking that they will do a software update to better the af), but i'm now thinking i will keep both, use them for awhile, and then sell the one which i do not enjoy as much. decisions, decisions. i’m not sure about the tl2 now, but withe the cl the 35mm 1.4 seems lighting fast to focus. and the -----> spot !!!  focus is accurate! the one issue i have is that sometimes, because of the small size of the camera, my hand accidentally pushes the direction buttons and moves the point of focus to the side. and the cross indicating the focus point is so small i don’t realize it moved till i try and focus and it focuses on something i don’t expect! easy enough to correct and not a major problem, but still an irritant. - vikas", "sortedWord": "None", "identifyer": 36321, "year": "2017"}, {"Unnamed: 0": 423271, "autor": "LocalHero1953", "date": 1514327040000, "content": "I’m not sure about the TL2 now, but withe the CL the 35mm 1.4 seems lighting fast to focus. And the spot focus is accurate! The one issue I have is that sometimes, because of the small size of the camera, my hand accidentally pushes the direction buttons and moves the point of focus to the side. And the cross indicating the focus point is so small I don’t realize it moved till I try and focus and it focuses on something I don’t expect! Easy enough to correct and not a major problem, but still an irritant. - Vikas +1 IMO, it needs either an option for a quick button press to recentre, or (in the CL2) a joystick instead of a direction pad, so you know when your touching it by accident. I don't have the same problem with the SL.", "link": "https://www.l-camera-forum.com/topic/320292-cl-the-image-thread/page/16/?tab=comments#comment-3425957", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i’m not sure about the tl2 now, but withe the cl the 35mm 1.4 seems lighting fast to focus. and the -----> spot !!!  focus is accurate! the one issue i have is that sometimes, because of the small size of the camera, my hand accidentally pushes the direction buttons and moves the point of focus to the side. and the cross indicating the focus point is so small i don’t realize it moved till i try and focus and it focuses on something i don’t expect! easy enough to correct and not a major problem, but still an irritant. - vikas +1 imo, it needs either an option for a quick button press to recentre, or (in the cl2) a joystick instead of a direction pad, so you know when your touching it by accident. i don't have the same problem with the sl.", "sortedWord": "None", "identifyer": 36322, "year": "2017"}, {"Unnamed: 0": 423272, "autor": "jaapv", "date": 1514334060000, "content": "I’m not sure about the TL2 now, but withe the CL the 35mm 1.4 seems lighting fast to focus. And the spot focus is accurate! The one issue I have is that sometimes, because of the small size of the camera, my hand accidentally pushes the direction buttons and moves the point of focus to the side. And the cross indicating the focus point is so small I don’t realize it moved till I try and focus and it focuses on something I don’t expect! Easy enough to correct and not a major problem, but still an irritant. - Vikas It is an irritation with all touchscreen cameras, whatever brand. The best thing they can have is a reversible screen. --img-- ", "link": "https://www.l-camera-forum.com/topic/320292-cl-the-image-thread/page/16/?tab=comments#comment-3426012", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i’m not sure about the tl2 now, but withe the cl the 35mm 1.4 seems lighting fast to focus. and the -----> spot !!!  focus is accurate! the one issue i have is that sometimes, because of the small size of the camera, my hand accidentally pushes the direction buttons and moves the point of focus to the side. and the cross indicating the focus point is so small i don’t realize it moved till i try and focus and it focuses on something i don’t expect! easy enough to correct and not a major problem, but still an irritant. - vikas it is an irritation with all touchscreen cameras, whatever brand. the best thing they can have is a reversible screen. --img-- ", "sortedWord": "None", "identifyer": 36323, "year": "2017"}, {"Unnamed: 0": 428107, "autor": "hunterspoint", "date": 1499962500000, "content": " Am on vacation and hope someone can answer a question. I am taking a picture of someone. The person is seated in the covered shade with a very bright background- the sea and bright sun in the background. I tried to use fill flash . Put it on force flash and used spot metering. The flash did not fire - tried a few times. Of course the pic came out with my subject being dark. I may be able to fix in post but wanted to do this in camera. Any help would be appreciated Thanks in advance", "link": "https://www.l-camera-forum.com/topic/274405-leica-t-flash-question/?tab=comments#comment-3315098", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " am on vacation and hope someone can answer a question. i am taking a picture of someone. the person is seated in the covered shade with a very bright background- the sea and bright sun in the background. i tried to use fill flash . put it on force flash and used -----> spot !!!  metering. the flash did not fire - tried a few times. of course the pic came out with my subject being dark. i may be able to fix in post but wanted to do this in camera. any help would be appreciated thanks in advance", "sortedWord": "None", "identifyer": 41218, "year": "2017"}, {"Unnamed: 0": 439495, "autor": "Leica Guy", "date": 1512361500000, "content": " How about we start a digiscoping thread? I know there are a couple more people out there experimenting with this. How about a few more join in? It is great for birds and wildlife as well as some astronomical objects. Super Moon this evening in Colorado. Shutter speed 1/125, ISO 100, F/7.1. Taken using the Leica digiscoping adapter (Type 116) on my Q and through a 20X eyepiece on a Swarovski ATS-80 spotting scope. Mounted on a Gitzo tripod with a Gitzo video head. Processed in LR for exposure, contrast, sharpening. Digiscoping is fun! Challenging too! --img-- ", "link": "https://www.l-camera-forum.com/topic/279496-leica-q-digiscoping-thread/?tab=comments#comment-3410253", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": " how about we start a digiscoping thread? i know there are a couple more people out there experimenting with this. how about a few more join in? it is great for birds and wildlife as well as some astronomical objects. super moon this evening in colorado. shutter speed 1/125, iso 100, f/7.1. taken using the leica digiscoping adapter (type 116) on my q and through a 20x eyepiece on a swarovski ats-80 -----> spotting !!!  scope. mounted on a gitzo tripod with a gitzo video head. processed in lr for exposure, contrast, sharpening. digiscoping is fun! challenging too! --img-- ", "sortedWord": "None", "identifyer": 52811, "year": "2017"}, {"Unnamed: 0": 439497, "autor": "HighlandK", "date": 1512379440000, "content": "How about we start a digiscoping thread? I know there are a couple more people out there experimenting with this. How about a few more join in? It is great for birds and wildlife as well as some astronomical objects. Super Moon this evening in Colorado. Shutter speed 1/125, ISO 100, F/7.1. Taken using the Leica digiscoping adapter (Type 116) on my Q and through a 20X eyepiece on a Swarovski ATS-80 spotting scope. Mounted on a Gitzo tripod with a Gitzo video head. Processed in LR for exposure, contrast, sharpening. Digiscoping is fun! Challenging too! Well, I have recently got the adapter but am not getting things as sharp as I would like. I suspect getting the camera/tripod set up rock steady so pressing shutter button does not induce shake might be the issue. Perhaps using smartphone app better? In short some advice on the basic procedure would be welcomed.", "link": "https://www.l-camera-forum.com/topic/279496-leica-q-digiscoping-thread/?tab=comments#comment-3410357", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "how about we start a digiscoping thread? i know there are a couple more people out there experimenting with this. how about a few more join in? it is great for birds and wildlife as well as some astronomical objects. super moon this evening in colorado. shutter speed 1/125, iso 100, f/7.1. taken using the leica digiscoping adapter (type 116) on my q and through a 20x eyepiece on a swarovski ats-80 -----> spotting !!!  scope. mounted on a gitzo tripod with a gitzo video head. processed in lr for exposure, contrast, sharpening. digiscoping is fun! challenging too! well, i have recently got the adapter but am not getting things as sharp as i would like. i suspect getting the camera/tripod set up rock steady so pressing shutter button does not induce shake might be the issue. perhaps using smartphone app better? in short some advice on the basic procedure would be welcomed.", "sortedWord": "None", "identifyer": 52813, "year": "2017"}, {"Unnamed: 0": 443583, "autor": "Leica Guy", "date": 1497273960000, "content": "I contacted Germany to ask them to deal with my dust problem. They replied and told me to contact the London main dealer. London dealer hasn't replied. Nothing resolved so far. I'm not happy. Lucerne. Disappointing that Wexlar didn't accept responsibility. Good luck. It requires patience which I'm usually short of in such situations. Do you have a blue sky image of the dust spots that you could post here? Thanks.", "link": "https://www.l-camera-forum.com/topic/272045-will-i-regret-selling-my-leica-q/page/3/?tab=comments#comment-3293811", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i contacted germany to ask them to deal with my dust problem. they replied and told me to contact the london main dealer. london dealer hasn't replied. nothing resolved so far. i'm not happy. lucerne. disappointing that wexlar didn't accept responsibility. good luck. it requires patience which i'm usually short of in such situations. do you have a blue sky image of the dust -----> spots !!!  that you could post here? thanks.", "sortedWord": "None", "identifyer": 6965, "year": "2017"}, {"Unnamed: 0": 448020, "autor": "MacSpikes", "date": 1500278340000, "content": " I have been tinkering with the Leica X-U for about 2 weeks now. I really like the results so far. The image quality is stunning above and under water and the high dynamic range makes it possible to make proper adjustments in Lightroom. There is one thing that does not work as I want to is the AF. On three occasions I made portrait pictures of my children, outside with lots of light. The AF is focusing on stuff behind the kids like a tree, a car or a chair, but not on the kids face. This happened several times, either in spot, 11-field or portrait mode. I point to the kid, wait for the camera to focus (it beeps when it does) and take a picture. But on several occasion the results are a blurry face and a sharp background. Does this sound familiar to anyone and if so, how did you solve this?", "link": "https://www.l-camera-forum.com/topic/274529-leica-x-u-misfocusing/?tab=comments#comment-3317406", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " i have been tinkering with the leica x-u for about 2 weeks now. i really like the results so far. the image quality is stunning above and under water and the high dynamic range makes it possible to make proper adjustments in lightroom. there is one thing that does not work as i want to is the af. on three occasions i made portrait pictures of my children, outside with lots of light. the af is focusing on stuff behind the kids like a tree, a car or a chair, but not on the kids face. this happened several times, either in -----> spot !!! , 11-field or portrait mode. i point to the kid, wait for the camera to focus (it beeps when it does) and take a picture. but on several occasion the results are a blurry face and a sharp background. does this sound familiar to anyone and if so, how did you solve this?", "sortedWord": "None", "identifyer": 11504, "year": "2017"}, {"Unnamed: 0": 451047, "autor": "Keith (M)", "date": 1493979480000, "content": "on what tropical isle was this taken (i am in the midst of vacation envy and need a place to dream about) --img--  No tropical island involved! Beachside restaurant in a hamlet approx 100km N of Valencia. A very pleasant spot for a refreshing drink after a stroll along the long beach.", "link": "https://www.l-camera-forum.com/topic/237139-leica-c-images-post-them-here/page/15/?tab=comments#comment-3268916", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "on what tropical isle was this taken (i am in the midst of vacation envy and need a place to dream about) --img--  no tropical island involved! beachside restaurant in a hamlet approx 100km n of valencia. a very pleasant -----> spot !!!  for a refreshing drink after a stroll along the long beach.", "sortedWord": "None", "identifyer": 14546, "year": "2017"}, {"Unnamed: 0": 451077, "autor": "Graham (G4FUJ)", "date": 1507207800000, "content": "Stopped at the Severn Smokery for a coffee with friends last week. Nice sunny day, so sat outside. I spotted this carving perched above the shop/cafe entrance. --img-- Wasn't until I got home and looked more closely that I spotted that security light which rather spoils things, so this was the only image I kept...", "link": "https://www.l-camera-forum.com/topic/237139-leica-c-images-post-them-here/page/16/?tab=comments#comment-3370806", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "stopped at the severn smokery for a coffee with friends last week. nice sunny day, so sat outside. i -----> spotted !!!  this carving perched above the shop/cafe entrance. --img-- wasn't until i got home and looked more closely that i spotted that security light which rather spoils things, so this was the only image i kept...", "sortedWord": "None", "identifyer": 14576, "year": "2017"}], "name": "spotL-Forum2017"}