{"interestingcomments": [{"Unnamed: 0": 356012, "autor": "jaapv", "date": 1278934140000, "content": "Question: There are spots on my images, especially at small apertures. This is sensor dirt. All digital cameras with interchangable lenses have this problem, but a Leica is particularly prone, because there is no mirror as extra barrier and the lack of an AA filter makes the dirt more visible. One should prevent dust from entering the camera as much as possible. There are a number of strategies. 1. Avoid changing lenses more than necessary. 2. Change lenses in as much of a dust-free environment as possible 3. Keep the rear end of the lens as clean as possible 4. Change the lens with the camera mouth facing downwards 5. (This may be a myth) Switch off the camera before changing lenses. But dust will come on the sensor anyway. Consult the manual to find the sensor cleaning item in the menu and use a FULLY charged battery. Before opening the shutter blow out the camera (using a bulb blower, not compressed air or your mouth!) to dislodge any loose dust. If the dust on the sensor is loose one can blow off the sensor using a good bulb blower, (Rocket Blower by Giotto for instance) with the camera mouth facing downwards. If that does not clear the problem there are sensor brushes like the Arctic Butterfly by Visible Dust that are quite effective or the little vacuum cleaner by Green Clean. At this stage the use of a Sensor Loupe can be very helpful. If spots on the sensor persist you are dealing with stuck dirt like pollen or oil spots and need to revert to wet cleaning. There are numerous threads on the subject. The Visible Dust products are highly recommended or the Green Clean wet-and-dry method. Use a proper solvent for grease if you think you are dealing with oil etc. (Visible Dust Smear Away or Dust-Aid Sensor Clean (my preference) Open the shutter for cleaning and blow it once again with a bulb blower or vacuum clean it, to remove any loose particles which might be dragged across the sensor and cause scratches. Although the camera is full frame and there are size 1 sensor swabs on the market, I prefer using the swabs for 1.3 sensors (and APS-C swabs for the M8) Take a clean swab, put on three small drops of Sensor Cleaning Fluid and in two sweeps, top and bottow go to one side - do not over-press!!- and sweep back again, using the other side of the swab automatically. Or, using the wet-and-dry system, swab with the wet sponge and dry with a couple of sweeps with the dry swab. Don't let the fluid spill over the edge of the sensor too much - there are electronic connections there. That is all - close the shutter and test the camera by taking an unfocussed image of an evenly lit surface at the smallest aperture. In the unlikely case it is needed, repeat. There are other cleaning systems, such as stamping tools. I find them quite effective, as long as there are no greasy spots on the sensor. Just stamp, don't rub. They are a bit scary as one pulls the cover glass. Leica Customer Service seem to be quite happy using them, so they should be safe. Use a gel stick designed for Sony sensors. One thing: when releasing the blob from the sensor glass, don't pull straight up. Wobble. . There are also sensor cleaning services or Leica Customer Service, but those are expensive and will keep the camera for a while. They may also not be readily available if one is travelling. Sensor cleaning is something any owner should be able to do himself. If you are fairly certain your spots are oil or grease, it may be wise to omit the step with the Arctic Butterfly, as it may become contaminated by the grease. In case that happens it can be cleaned with the special fluid provided.", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/?tab=comments#comment-2464057", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "question: there are -----> spots !!!  on my images, especially at small apertures. this is sensor dirt. all digital cameras with interchangable lenses have this problem, but a leica is particularly prone, because there is no mirror as extra barrier and the lack of an aa filter makes the dirt more visible. one should prevent dust from entering the camera as much as possible. there are a number of strategies. 1. avoid changing lenses more than necessary. 2. change lenses in as much of a dust-free environment as possible 3. keep the rear end of the lens as clean as possible 4. change the lens with the camera mouth facing downwards 5. (this may be a myth) switch off the camera before changing lenses. but dust will come on the sensor anyway. consult the manual to find the sensor cleaning item in the menu and use a fully charged battery. before opening the shutter blow out the camera (using a bulb blower, not compressed air or your mouth!) to dislodge any loose dust. if the dust on the sensor is loose one can blow off the sensor using a good bulb blower, (rocket blower by giotto for instance) with the camera mouth facing downwards. if that does not clear the problem there are sensor brushes like the arctic butterfly by visible dust that are quite effective or the little vacuum cleaner by green clean. at this stage the use of a sensor loupe can be very helpful. if spots on the sensor persist you are dealing with stuck dirt like pollen or oil spots and need to revert to wet cleaning. there are numerous threads on the subject. the visible dust products are highly recommended or the green clean wet-and-dry method. use a proper solvent for grease if you think you are dealing with oil etc. (visible dust smear away or dust-aid sensor clean (my preference) open the shutter for cleaning and blow it once again with a bulb blower or vacuum clean it, to remove any loose particles which might be dragged across the sensor and cause scratches. although the camera is full frame and there are size 1 sensor swabs on the market, i prefer using the swabs for 1.3 sensors (and aps-c swabs for the m8) take a clean swab, put on three small drops of sensor cleaning fluid and in two sweeps, top and bottow go to one side - do not over-press!!- and sweep back again, using the other side of the swab automatically. or, using the wet-and-dry system, swab with the wet sponge and dry with a couple of sweeps with the dry swab. don't let the fluid spill over the edge of the sensor too much - there are electronic connections there. that is all - close the shutter and test the camera by taking an unfocussed image of an evenly lit surface at the smallest aperture. in the unlikely case it is needed, repeat. there are other cleaning systems, such as stamping tools. i find them quite effective, as long as there are no greasy spots on the sensor. just stamp, don't rub. they are a bit scary as one pulls the cover glass. leica customer service seem to be quite happy using them, so they should be safe. use a gel stick designed for sony sensors. one thing: when releasing the blob from the sensor glass, don't pull straight up. wobble. . there are also sensor cleaning services or leica customer service, but those are expensive and will keep the camera for a while. they may also not be readily available if one is travelling. sensor cleaning is something any owner should be able to do himself. if you are fairly certain your spots are oil or grease, it may be wise to omit the step with the arctic butterfly, as it may become contaminated by the grease. in case that happens it can be cleaned with the special fluid provided.", "sortedWord": "None", "identifyer": 17178, "year": "2010"}, {"Unnamed: 0": 369350, "autor": "Julian Thompson", "date": 1271103780000, "content": "It is really important. If the infinity is off then you can't truly evaluate focus elsewhere because the infinity is the 'reference' point. From this point the length of the roller cam arm itself determines how much the rangefinder patch moves as the lens rotates. In my experience of 5 digital M's (2 x M8.2 and 2 x M8 and 1 x M9) I have never had a camera with a spot on infinity/roller arm length combination from the factory, and have learned how to adjust them myself rather than send them back. If you don't want to touch it yourself then you'll have to bite the bullet and send it back to Leica for adjustment. Sorry its not better news! Edited April 12, 2010 by Julian Thompson", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/?tab=comments#comment-1291968", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "it is really important. if the infinity is off then you can't truly evaluate focus elsewhere because the infinity is the 'reference' point. from this point the length of the roller cam arm itself determines how much the rangefinder patch moves as the lens rotates. in my experience of 5 digital m's (2 x m8.2 and 2 x m8 and 1 x m9) i have never had a camera with a -----> spot !!!  on infinity/roller arm length combination from the factory, and have learned how to adjust them myself rather than send them back. if you don't want to touch it yourself then you'll have to bite the bullet and send it back to leica for adjustment. sorry its not better news! edited april 12, 2010 by julian thompson", "sortedWord": "None", "identifyer": 30646, "year": "2010"}, {"Unnamed: 0": 369382, "autor": "glenerrolrd", "date": 1271192880000, "content": "Julian This is an excellent post and I believe that small calibration errors are often overlooked when testing at close distances . At mid distances these become clear misses. I would tell you that I have three sources of intelligence on calibration of the leica M rangefinder and none of them put any emphasis on checking infinity . 1. In NJ the primary test is at about 10M . The body is placed on a large heavy looking fixture and the target is a backlit piece of test equipment hung on a wall about 10 m away. Thats the primary test. A wall chart is used at about 2M and this is a handheld test. Finally the distance test is a few shots of a nearby building that is clearly not at infinity. I stood there and watched the process and discussed the details with the technician. A reference 50mm and 90mm lenses were used . The process was similar to tuning a violin. 2. Having had the infinity focus issue in a big way with a 135apo ...I went thru this with DAG. It took 3 tries to get the 135apo to focus at infinity. When we discussed the testing DAG indicated that he has found that if it focuses accurately up close ..it will hold up thru infinity. He does not have a good infinity test available. I had to send him a file of images of mailboxes at 100ft spacing. 3. If you look at the video of those that went to the factory to see the M9 being produced you can see the Lens Align rulers at different distances ..all seem to be at close or medium range. I think your logic is sound but this isn t how the professionals appear to be calibrating the M rangefinder. It is an ongoing challenge and small variances in bodies and lens can easily create misconceptions about ones equipment. Lens you think are spot on may be slightly off and the body is off to zero out the variance. And again I am not challenging your POV but just pointing out what I learned talking with Leica and DAG. I am sure I have much to learn. I do completely agree that when the system is on.. it is superbly accurate .", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/2/?tab=comments#comment-1293140", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "julian this is an excellent post and i believe that small calibration errors are often overlooked when testing at close distances . at mid distances these become clear misses. i would tell you that i have three sources of intelligence on calibration of the leica m rangefinder and none of them put any emphasis on checking infinity . 1. in nj the primary test is at about 10m . the body is placed on a large heavy looking fixture and the target is a backlit piece of test equipment hung on a wall about 10 m away. thats the primary test. a wall chart is used at about 2m and this is a handheld test. finally the distance test is a few shots of a nearby building that is clearly not at infinity. i stood there and watched the process and discussed the details with the technician. a reference 50mm and 90mm lenses were used . the process was similar to tuning a violin. 2. having had the infinity focus issue in a big way with a 135apo ...i went thru this with dag. it took 3 tries to get the 135apo to focus at infinity. when we discussed the testing dag indicated that he has found that if it focuses accurately up close ..it will hold up thru infinity. he does not have a good infinity test available. i had to send him a file of images of mailboxes at 100ft spacing. 3. if you look at the video of those that went to the factory to see the m9 being produced you can see the lens align rulers at different distances ..all seem to be at close or medium range. i think your logic is sound but this isn t how the professionals appear to be calibrating the m rangefinder. it is an ongoing challenge and small variances in bodies and lens can easily create misconceptions about ones equipment. lens you think are -----> spot !!!  on may be slightly off and the body is off to zero out the variance. and again i am not challenging your pov but just pointing out what i learned talking with leica and dag. i am sure i have much to learn. i do completely agree that when the system is on.. it is superbly accurate .", "sortedWord": "None", "identifyer": 30678, "year": "2010"}, {"Unnamed: 0": 377326, "autor": "dpattinson", "date": 1268279100000, "content": " assuming you get past the focus-shift issue, I'd say the 35lux. I use it at 1.4 quite a lot in low light and the extra stop makes a lot of difference. In 'normal' low lighting, it makes the difference between 1/30 and 1/15 at 2500iso, which for me means reasonable hit rate vs. too much subject motion. (Normal for me means I can still see ok to focus) I recently tested mine, it is slightly front focused at 1.4 and then spot on at f2, after that DOF handles the focus shift well enough that I find it hard to detect. If I'm worried about perfect focus - I shoot it at f2, problem solved. In any case when shooting at 2500iso and f1.4, exact focus is the least of my worries --img-- ", "link": "https://www.l-camera-forum.com/topic/112548-which-35mm-lens-is-the-best-for-m/page/2/?tab=comments#comment-1255341", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " assuming you get past the focus-shift issue, i'd say the 35lux. i use it at 1.4 quite a lot in low light and the extra stop makes a lot of difference. in 'normal' low lighting, it makes the difference between 1/30 and 1/15 at 2500iso, which for me means reasonable hit rate vs. too much subject motion. (normal for me means i can still see ok to focus) i recently tested mine, it is slightly front focused at 1.4 and then -----> spot !!!  on at f2, after that dof handles the focus shift well enough that i find it hard to detect. if i'm worried about perfect focus - i shoot it at f2, problem solved. in any case when shooting at 2500iso and f1.4, exact focus is the least of my worries --img-- ", "sortedWord": "None", "identifyer": 38638, "year": "2010"}, {"Unnamed: 0": 378522, "autor": "atufte", "date": 1264004520000, "content": "ive posted this in the photo forum, but i too love my m8 so heres my contribution! I love this photo, and since i'm a pool skater myself, i'm really looking forward to summer... (But i think this photo looks even better with some slight adjustments, i find it a bit dark in the foreground, so i took a shot at adjusting it for you, hope you don't mind ;-) (And BTW you need to clean your sensor, there i lot's of dust spot's on it;-) Here's a lighter version: --img-- ", "link": "https://www.l-camera-forum.com/topic/305820-m8-photographs-post-them-here/page/4/?tab=comments#comment-1193898", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "ive posted this in the photo forum, but i too love my m8 so heres my contribution! i love this photo, and since i'm a pool skater myself, i'm really looking forward to summer... (but i think this photo looks even better with some slight adjustments, i find it a bit dark in the foreground, so i took a shot at adjusting it for you, hope you don't mind ;-) (and btw you need to clean your sensor, there i lot's of dust -----> spot !!! 's on it;-) here's a lighter version: --img-- ", "sortedWord": "None", "identifyer": 39839, "year": "2010"}, {"Unnamed: 0": 378566, "autor": "underground", "date": 1264124940000, "content": "Huntington Beach! I was there a couple of weeks ago in just about the same spot and i didn't take any photo's. you captured it perfectly. small world.", "link": "https://www.l-camera-forum.com/topic/305820-m8-photographs-post-them-here/page/6/?tab=comments#comment-1195742", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "huntington beach! i was there a couple of weeks ago in just about the same -----> spot !!!  and i didn't take any photo's. you captured it perfectly. small world.", "sortedWord": "None", "identifyer": 39884, "year": "2010"}, {"Unnamed: 0": 378686, "autor": "wilfredo", "date": 1267936920000, "content": "Istanbul January 2010/ M8.2 + Elmarit 28 Small world. I recognize this spot from my trip there last year. Here's something from inside a mall in Istanbul. --img-- ", "link": "https://www.l-camera-forum.com/topic/305820-m8-photographs-post-them-here/page/12/?tab=comments#comment-1250030", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "istanbul january 2010/ m8.2 + elmarit 28 small world. i recognize this -----> spot !!!  from my trip there last year. here's something from inside a mall in istanbul. --img-- ", "sortedWord": "None", "identifyer": 40004, "year": "2010"}, {"Unnamed: 0": 378731, "autor": "menos I M6", "date": 1271216160000, "content": "Enrico - love the BW conversion of the young talking lady! Everything is there - great tones, spot on contrast and plenty of biting detail! Redridge - really like the toning of the 2nd frame and your nightshot - beautiful!", "link": "https://www.l-camera-forum.com/topic/305820-m8-photographs-post-them-here/page/14/?tab=comments#comment-1293387", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "enrico - love the bw conversion of the young talking lady! everything is there - great tones, -----> spot !!!  on contrast and plenty of biting detail! redridge - really like the toning of the 2nd frame and your nightshot - beautiful!", "sortedWord": "None", "identifyer": 40050, "year": "2010"}, {"Unnamed: 0": 382754, "autor": "rhom", "date": 1274553540000, "content": "I previously posted parts of this in a M9 thread. I have had a persistent dust spot problem with my used M8. My first step was to set the M8 on Sensor Cleaning, trip the shutter, remove the lens and, holding the camera in a face-down position, blowing gently upward around all areas of the open camera with a rocket blower without sticking the blower nozzle inside of the camera. This removed many dust spots, but not all. I then tried a sensor brush after charging the brush by blowing air through it. A few dust spots still remained. Next, I cleaned the sensor with Eclipse and a Sensor Swab. My experience is that the FF swabs are clumsy. This got the sensor clean, but I had dust again the next day. My camera is not used in a dusty environment, either. After thinking about it, it seemed logical that there might be a few small \"dust bunnies\" lodged within the body of my M8, just before the shutter curtain. After cleaning the sensor with Eclipse/SSwab again, I rigged my Shop-Vac vacuum with a narrow cleaning tip, attached the nozzle wand to my workbench with the tip pointing straight up, set the M8 on Sensor Cleaning, tripped the shutter to expose the sensor, held the camera so that the sensor and open body were facing sensor-down at the vacuum tip, about 8 inches above it, turned on the vacuum, and then used my rocket blower pointing upward into the camera body and blew air toward the sensor and surrounding area for about 30 seconds. I figured that the blower would dislodge any dust and the vacuum would pick it up before it could re-settle within the camera or on the sensor. Anyway, I have been dust-free for more than a month. I have changed or removed the lenses at least several dozen times since, so I am knocking on wood that this \"technique\" will keep sensor cleaning down to a minimum. Unconventional, yes, but it seems to work. Best Wishes, Rick", "link": "https://www.l-camera-forum.com/topic/121661-m8-sensor-cleaning/?tab=comments#comment-1331730", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i previously posted parts of this in a m9 thread. i have had a persistent dust -----> spot !!!  problem with my used m8. my first step was to set the m8 on sensor cleaning, trip the shutter, remove the lens and, holding the camera in a face-down position, blowing gently upward around all areas of the open camera with a rocket blower without sticking the blower nozzle inside of the camera. this removed many dust spots, but not all. i then tried a sensor brush after charging the brush by blowing air through it. a few dust spots still remained. next, i cleaned the sensor with eclipse and a sensor swab. my experience is that the ff swabs are clumsy. this got the sensor clean, but i had dust again the next day. my camera is not used in a dusty environment, either. after thinking about it, it seemed logical that there might be a few small \"dust bunnies\" lodged within the body of my m8, just before the shutter curtain. after cleaning the sensor with eclipse/sswab again, i rigged my shop-vac vacuum with a narrow cleaning tip, attached the nozzle wand to my workbench with the tip pointing straight up, set the m8 on sensor cleaning, tripped the shutter to expose the sensor, held the camera so that the sensor and open body were facing sensor-down at the vacuum tip, about 8 inches above it, turned on the vacuum, and then used my rocket blower pointing upward into the camera body and blew air toward the sensor and surrounding area for about 30 seconds. i figured that the blower would dislodge any dust and the vacuum would pick it up before it could re-settle within the camera or on the sensor. anyway, i have been dust-free for more than a month. i have changed or removed the lenses at least several dozen times since, so i am knocking on wood that this \"technique\" will keep sensor cleaning down to a minimum. unconventional, yes, but it seems to work. best wishes, rick", "sortedWord": "None", "identifyer": 44153, "year": "2010"}, {"Unnamed: 0": 382795, "autor": "dNorm", "date": 1263781440000, "content": "Just wanted to follow up. I ended up ordering a new 50mm f/1.1 Nokton from the second batch, which supposedly corrected the back-focus issue on the digital M's. All I can say is that the lens I received is spot-on at f/1.1 on my M8.2. Awesome lens! Cheers. -Norm", "link": "https://www.l-camera-forum.com/topic/107823-nokton-50mm-f11-backfocus/page/2/?tab=comments#comment-1190700", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "just wanted to follow up. i ended up ordering a new 50mm f/1.1 nokton from the second batch, which supposedly corrected the back-focus issue on the digital m's. all i can say is that the lens i received is -----> spot !!! -on at f/1.1 on my m8.2. awesome lens! cheers. -norm", "sortedWord": "None", "identifyer": 44194, "year": "2010"}, {"Unnamed: 0": 382837, "autor": "Xmas", "date": 1273517520000, "content": " Hi First step is to try the rangefinder on a planet as it gets dark. If as you focus to infinity the image is only offset a little, I'd not bother. If the focus spot is less clear you can still use the outside of the spot with the inside of the spot. It may be the rangefinder optical path is fogged with outgassed lube. If you get two isolated images that you can see are separate but they align at infinity, I'd be temped to leave it unless you can afford a pro repair. It the rangefinder is off vertically it may be also off horizontally at infinity or close up, the finder has individual adjustments, for each. Lastly try and lift the red dot without crinkling it. Noel", "link": "https://www.l-camera-forum.com/topic/120623-vertical-alignment-how-easy-to-do-it-yourself-with-tool/?tab=comments#comment-1319998", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " hi first step is to try the rangefinder on a planet as it gets dark. if as you focus to infinity the image is only offset a little, i'd not bother. if the focus -----> spot !!!  is less clear you can still use the outside of the -----> spot !!!  with the inside of the -----> spot !!! . it may be the rangefinder optical path is fogged with outgassed lube. if you get two isolated images that you can see are separate but they align at infinity, i'd be temped to leave it unless you can afford a pro repair. it the rangefinder is off vertically it may be also off horizontally at infinity or close up, the finder has individual adjustments, for each. lastly try and lift the red dot without crinkling it. noel", "sortedWord": "None", "identifyer": 44236, "year": "2010"}, {"Unnamed: 0": 446194, "autor": "fotografr", "date": 1281624180000, "content": "Spot metering with the X1. --img-- ", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/3/?tab=comments#comment-1404393", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "-----> spot !!!  metering with the x1. --img-- ", "sortedWord": "None", "identifyer": 9629, "year": "2010"}, {"Unnamed: 0": 446209, "autor": "RichardM8", "date": 1282214640000, "content": " @phancj, are those images from Bangkok and maybe even near/at Patpong?... If so, I was very on that spot exactly 2 days ago! Good thing the X1 doesn't record smell I must say... --img--  Richard.", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/4/?tab=comments#comment-1410626", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " @phancj, are those images from bangkok and maybe even near/at patpong?... if so, i was very on that -----> spot !!!  exactly 2 days ago! good thing the x1 doesn't record smell i must say... --img--  richard.", "sortedWord": "None", "identifyer": 9644, "year": "2010"}, {"Unnamed: 0": 446210, "autor": "phancj", "date": 1282281480000, "content": "@phancj, are those images from Bangkok and maybe even near/at Patpong?... If so, I was very on that spot exactly 2 days ago! Good thing the X1 doesn't record smell I must say... --img--  Richard. Yes Richard, it is at the heart of sleaze in Bangkok, and since I finish my work around late evening, this will be the only place for nite street night photography! This was taken at the suriwongse road/patpong junction, I used to stay opposite the other end of patpong at Silom Road where it is very much cleaner and where the financial district is(I lived in Bangkok for two years many years ago). here the smell is less:D With the X1, it is so discrete you can capture people haggling with working girls on prices it is hilarious...I kid you not, this camera is a real gem and an invisibility device for sure!--img-- ", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/4/?tab=comments#comment-1411428", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "@phancj, are those images from bangkok and maybe even near/at patpong?... if so, i was very on that -----> spot !!!  exactly 2 days ago! good thing the x1 doesn't record smell i must say... --img--  richard. yes richard, it is at the heart of sleaze in bangkok, and since i finish my work around late evening, this will be the only place for nite street night photography! this was taken at the suriwongse road/patpong junction, i used to stay opposite the other end of patpong at silom road where it is very much cleaner and where the financial district is(i lived in bangkok for two years many years ago). here the smell is less:d with the x1, it is so discrete you can capture people haggling with working girls on prices it is hilarious...i kid you not, this camera is a real gem and an invisibility device for sure!--img-- ", "sortedWord": "None", "identifyer": 9645, "year": "2010"}, {"Unnamed: 0": 446234, "autor": "phancj", "date": 1283662260000, "content": "Hey Harry, Your photos with the X1 are superb, sharpness, tonality, colors, everything is spot on and perfect. As for the perceived \"shutter lag\" here are my thoughts with the X1: - The AF though a tad slow is superbly accurate, I find its AF much better than even my Nikon D300 coz the % of perfectly sharply focused shots are actually HIGHER with the X1, so i guess what is loses in speed it gains in accuracy; - The X1 is not really like a P&S in the sense that you just press the trigger, it is a more \"considered\" photographic method not unlike the Ms which I tried but do not own (I think I need AF:)). Though not a rangefinder, the operation of the X1 requires one to really think and compose before shooting. Therefore it is not a lightning fast DSLR so may not be suitable for action/sports, but to me even the M is not really for that. These are cameras which are for that leisurely shots with the best IQ around, and the X1 being the tiniest of the large sensors is kind of that crop. You are coming from an M user, and me being a DSLR user if anything I should be more bothered with the relatively slow speed of the X1 since Nikon 3D predictively active matrix blah blah is lightning fast and all but I am not impressed with the IQ. But I love the pictures I get from this little gem, and I like those pictures you took, as I think you do too. At the end of the day, one needs to examine what one wants in a camera but in your case, I suspect you are not used to the X1 yet, with so many years with the Ms you probably have some fixation with it. Don't. Compare the two cams based on their sole merits, and spend a little more time with your X1. I think you won't be disappointed. I have never enjoyed a camera as much as with the X1, it's the smallest and best camera I have had, and I do not miss any of my other cameras at all(I use them for macro only). I still believe it's the best travel camera BAR NONE, except for shooting of birds. :)CJ", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/5/?tab=comments#comment-1428632", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hey harry, your photos with the x1 are superb, sharpness, tonality, colors, everything is -----> spot !!!  on and perfect. as for the perceived \"shutter lag\" here are my thoughts with the x1: - the af though a tad slow is superbly accurate, i find its af much better than even my nikon d300 coz the % of perfectly sharply focused shots are actually higher with the x1, so i guess what is loses in speed it gains in accuracy; - the x1 is not really like a p&s in the sense that you just press the trigger, it is a more \"considered\" photographic method not unlike the ms which i tried but do not own (i think i need af:)). though not a rangefinder, the operation of the x1 requires one to really think and compose before shooting. therefore it is not a lightning fast dslr so may not be suitable for action/sports, but to me even the m is not really for that. these are cameras which are for that leisurely shots with the best iq around, and the x1 being the tiniest of the large sensors is kind of that crop. you are coming from an m user, and me being a dslr user if anything i should be more bothered with the relatively slow speed of the x1 since nikon 3d predictively active matrix blah blah is lightning fast and all but i am not impressed with the iq. but i love the pictures i get from this little gem, and i like those pictures you took, as i think you do too. at the end of the day, one needs to examine what one wants in a camera but in your case, i suspect you are not used to the x1 yet, with so many years with the ms you probably have some fixation with it. don't. compare the two cams based on their sole merits, and spend a little more time with your x1. i think you won't be disappointed. i have never enjoyed a camera as much as with the x1, it's the smallest and best camera i have had, and i do not miss any of my other cameras at all(i use them for macro only). i still believe it's the best travel camera bar none, except for shooting of birds. :)cj", "sortedWord": "None", "identifyer": 9669, "year": "2010"}, {"Unnamed: 0": 446304, "autor": "h00ligan", "date": 1289096280000, "content": "Hi Rick, nice shots! I have been doing some testing and it seems to me that shooting at f8 is the sweet spot for landscapes.. not that there's much of a difference.. have you tried that and would you agree? Did you add any contrast and saturation - were they jpgs? Sorry for so many questions I'm trying to see if other photographers' experiences are the same as mine. Usually in lightroom, for landscapes I bump contrast to 45-50 and up the saturation just a touch before sharpening. I'd be interested in knowing what your and others' thoughts are. Thanks for sharing.", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/9/?tab=comments#comment-1494800", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi rick, nice shots! i have been doing some testing and it seems to me that shooting at f8 is the sweet -----> spot !!!  for landscapes.. not that there's much of a difference.. have you tried that and would you agree? did you add any contrast and saturation - were they jpgs? sorry for so many questions i'm trying to see if other photographers' experiences are the same as mine. usually in lightroom, for landscapes i bump contrast to 45-50 and up the saturation just a touch before sharpening. i'd be interested in knowing what your and others' thoughts are. thanks for sharing.", "sortedWord": "None", "identifyer": 9742, "year": "2010"}, {"Unnamed: 0": 446333, "autor": "phancj", "date": 1291558800000, "content": "Phancj - I won't get into whether or not your photo here is banal......earlier in the thread that took up more space than photos --img--  but your water reflections are better managed than mine on the East River there. Still, better to admit it being banal before some uninvited guests pounce on it...and spoil this low light discussion..--img--  The reflections are okay in your shot, I tend to see it as some difference when sizing down for posting. ^^^ Actually, I think your water reflections look beautfiul in your photo of the East River. Since both of these shots are night shots and of water, they do invite comparisons. How I feel about these two photos, I have experienced myself. Please, though, correct me if I am wrong. The photo of the fountain was shot at ISO 800 and the photo of the bridge, I'm guessing, was shot at ISO 1600 or higher. My theory is that, even though everyone knows this, shooting at ISO 800 will create far less noise than at ISO 1600. It has been my experiece that with these outdoor shots, using the X1, shot at ISO 1600 is not desirable. Halve the IS0 to 800, double the exposure time, use a tripod, and voila, you have a smooth outdoor lowlight exposure, without noticable grain. I have yet to conclude what the X1 can do with indoor low lighting situations but anything outdoors above ISO 800, I am going to have to find a work-a-round. The X1's low light capabilities are very good but they are not as prodigious as I had hoped. YEs, I agree completely, iso 800 seems to be the max for the X1, same for the D300. But I tend NOT to use a tripod with the X1, since any size/portability advantage will have been negated. One thing I notice (in my subjective opinion) is that the X1 fares a whole lot better than my D300 in the shadow department, and hence the files are much more pliable especially in darker tones. Hence my overall strategy of shooting with the X1 having the camera since feb is to always underexpose significantly when in doubt so much so that the raw files (like in the fountain shot) looks like nothing but some specks of light on the camera LCD. But when you recover the photo in LR, just bum up shadow, exposure, brightness and everything is fine, no additional noise, and highlights like the lighted signs and torch are not blown. For my nikon, I realize that this strategy cannot be applied consistently, often if I underexpose to he same extent as the X1, my D300 shots upon recovery has shadow regions looking murky, noisy and bad. Altho it has been said many times that the X1 &D300 probably has the same sensor, Leica probably got it more right at least as far as low light shots are concerned. And mind you I shoot with top prime lenses and still experience the same, even with f1.4s. Nikon is far less forgiving so you have to make sure that exposure is spot-on to have the same image integrity and quality in dark regions for the X1. With the X1 I hardly use exposure compensation, just 3 adjustments speed, aperture and iso, and often even the jpegs with a little adjustment produces very nice photos. If not, the DNG provides for great photos just pushing a few sliders.--img-- ", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/10/?tab=comments#comment-1522079", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "phancj - i won't get into whether or not your photo here is banal......earlier in the thread that took up more space than photos --img--  but your water reflections are better managed than mine on the east river there. still, better to admit it being banal before some uninvited guests pounce on it...and spoil this low light discussion..--img--  the reflections are okay in your shot, i tend to see it as some difference when sizing down for posting. ^^^ actually, i think your water reflections look beautfiul in your photo of the east river. since both of these shots are night shots and of water, they do invite comparisons. how i feel about these two photos, i have experienced myself. please, though, correct me if i am wrong. the photo of the fountain was shot at iso 800 and the photo of the bridge, i'm guessing, was shot at iso 1600 or higher. my theory is that, even though everyone knows this, shooting at iso 800 will create far less noise than at iso 1600. it has been my experiece that with these outdoor shots, using the x1, shot at iso 1600 is not desirable. halve the is0 to 800, double the exposure time, use a tripod, and voila, you have a smooth outdoor lowlight exposure, without noticable grain. i have yet to conclude what the x1 can do with indoor low lighting situations but anything outdoors above iso 800, i am going to have to find a work-a-round. the x1's low light capabilities are very good but they are not as prodigious as i had hoped. yes, i agree completely, iso 800 seems to be the max for the x1, same for the d300. but i tend not to use a tripod with the x1, since any size/portability advantage will have been negated. one thing i notice (in my subjective opinion) is that the x1 fares a whole lot better than my d300 in the shadow department, and hence the files are much more pliable especially in darker tones. hence my overall strategy of shooting with the x1 having the camera since feb is to always underexpose significantly when in doubt so much so that the raw files (like in the fountain shot) looks like nothing but some specks of light on the camera lcd. but when you recover the photo in lr, just bum up shadow, exposure, brightness and everything is fine, no additional noise, and highlights like the lighted signs and torch are not blown. for my nikon, i realize that this strategy cannot be applied consistently, often if i underexpose to he same extent as the x1, my d300 shots upon recovery has shadow regions looking murky, noisy and bad. altho it has been said many times that the x1 &d300 probably has the same sensor, leica probably got it more right at least as far as low light shots are concerned. and mind you i shoot with top prime lenses and still experience the same, even with f1.4s. nikon is far less forgiving so you have to make sure that exposure is -----> spot !!! -on to have the same image integrity and quality in dark regions for the x1. with the x1 i hardly use exposure compensation, just 3 adjustments speed, aperture and iso, and often even the jpegs with a little adjustment produces very nice photos. if not, the dng provides for great photos just pushing a few sliders.--img-- ", "sortedWord": "None", "identifyer": 9773, "year": "2010"}, {"Unnamed: 0": 448091, "autor": "leicashot", "date": 1276064460000, "content": "I'm glad someone brought up both the back protrusion and the AF light's viewability in conjunction with the viewfinder. Looking at pictures of the Leica VF and the Voigt VF the Leica definitely protrudes back form the camera while the Voigt is flush with the camera. Also, the Voigt has a much smaller viewing hole while the Leica has a much larger one. Is it too hard to view through the Voigt viewfinder since it's flush? Are you able to see the AF light? Anyone with both it'd be really useful to hear your thoughts. Thanks. From my points above I was stating that the voigtlander isn't as good in usability. It's hotshoe is smaller and sits forward in the hotshoe with a gap behind it, making it NOT sit flush, but too far forward on the hotshoe. The Leica nad Olympus are better because they stick out so your nose isn't pushed so hard against the screen, and therefor the AF light is much easier to see. In daylight the AF light using the voigtlander can be tricky to spot. Hope this helps", "link": "https://www.l-camera-forum.com/topic/112325-voigtlander-or-leica-viewfinder/page/4/?tab=comments#comment-1347179", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i'm glad someone brought up both the back protrusion and the af light's viewability in conjunction with the viewfinder. looking at pictures of the leica vf and the voigt vf the leica definitely protrudes back form the camera while the voigt is flush with the camera. also, the voigt has a much smaller viewing hole while the leica has a much larger one. is it too hard to view through the voigt viewfinder since it's flush? are you able to see the af light? anyone with both it'd be really useful to hear your thoughts. thanks. from my points above i was stating that the voigtlander isn't as good in usability. it's hotshoe is smaller and sits forward in the hotshoe with a gap behind it, making it not sit flush, but too far forward on the hotshoe. the leica nad olympus are better because they stick out so your nose isn't pushed so hard against the screen, and therefor the af light is much easier to see. in daylight the af light using the voigtlander can be tricky to -----> spot !!! . hope this helps", "sortedWord": "None", "identifyer": 11575, "year": "2010"}, {"Unnamed: 0": 448096, "autor": "Guest Chris M", "date": 1276151520000, "content": "Never have, never will, compared to say Canon. But Mercedes and BMW will also never do the same compared to a Toyota. I just bought a brand new TOYOTA LANDCRUISER 2010, $80,000.00 large with rims plus tax, and your absolutely rite, I would never buy a beamer or benz for light off road or heavy towing, Toyota hit it spot on with this one;) I love it. chris m.", "link": "https://www.l-camera-forum.com/topic/112325-voigtlander-or-leica-viewfinder/page/4/?tab=comments#comment-1348161", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "never have, never will, compared to say canon. but mercedes and bmw will also never do the same compared to a toyota. i just bought a brand new toyota landcruiser 2010, $80,000.00 large with rims plus tax, and your absolutely rite, i would never buy a beamer or benz for light off road or heavy towing, toyota hit it -----> spot !!!  on with this one;) i love it. chris m.", "sortedWord": "None", "identifyer": 11580, "year": "2010"}, {"Unnamed: 0": 448097, "autor": "ChiILX1", "date": 1276222980000, "content": "From my points above I was stating that the voigtlander isn't as good in usability. It's hotshoe is smaller and sits forward in the hotshoe with a gap behind it, making it NOT sit flush, but too far forward on the hotshoe. The Leica nad Olympus are better because they stick out so your nose isn't pushed so hard against the screen, and therefor the AF light is much easier to see. In daylight the AF light using the voigtlander can be tricky to spot. Hope this helps How hard would it be to add an item a couple millimeters wide to the front of the voigtlander hotshoe so that it would sit back past the back of the camera? Any ideas?", "link": "https://www.l-camera-forum.com/topic/112325-voigtlander-or-leica-viewfinder/page/4/?tab=comments#comment-1349016", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "from my points above i was stating that the voigtlander isn't as good in usability. it's hotshoe is smaller and sits forward in the hotshoe with a gap behind it, making it not sit flush, but too far forward on the hotshoe. the leica nad olympus are better because they stick out so your nose isn't pushed so hard against the screen, and therefor the af light is much easier to see. in daylight the af light using the voigtlander can be tricky to -----> spot !!! . hope this helps how hard would it be to add an item a couple millimeters wide to the front of the voigtlander hotshoe so that it would sit back past the back of the camera? any ideas?", "sortedWord": "None", "identifyer": 11581, "year": "2010"}, {"Unnamed: 0": 448100, "autor": "NZDavid", "date": 1276238820000, "content": "I just bought a brand new TOYOTA LANDCRUISER 2010, $80,000.00 large with rims plus tax, and your absolutely rite, I would never buy a beamer or benz for light off road or heavy towing, Toyota hit it spot on with this one;) I love it. chris m. Nothing against Toyota (so long as you keep your feet clear of the gas pedal) but have you ever tried a Mercedes G-Wagen? Your rite? Rite of passage? I reckon the Voigtländer is excellent quality. The brand really does deserve an umlaut. --img-- ", "link": "https://www.l-camera-forum.com/topic/112325-voigtlander-or-leica-viewfinder/page/4/?tab=comments#comment-1349120", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i just bought a brand new toyota landcruiser 2010, $80,000.00 large with rims plus tax, and your absolutely rite, i would never buy a beamer or benz for light off road or heavy towing, toyota hit it -----> spot !!!  on with this one;) i love it. chris m. nothing against toyota (so long as you keep your feet clear of the gas pedal) but have you ever tried a mercedes g-wagen? your rite? rite of passage? i reckon the voigtländer is excellent quality. the brand really does deserve an umlaut. --img-- ", "sortedWord": "None", "identifyer": 11584, "year": "2010"}, {"Unnamed: 0": 448164, "autor": "JanCderidder", "date": 1282240260000, "content": "I even think Leica might buy it's OVF from VC .... they say \"made in Japan\" and are visibly/optically not any brighter than the VC ones. One argument which I contemplated was the \"tightness of specs\" or whatever you might call it, that the Leica would be more specked towards the X1 in terms of centering and such ... This is clearly not the case, unlike with the Oly OVF which I sent back immediately. I sent the Leica OVF back as well (in Germany there is a 30 day exchange period where one can ship anything back and get full refund) after having tried the VC \"round\" OVF which I think is perfect and not all that expensive. I have had a marking engraved on the exact center of the OVF, use single spot-AF and this works fine. Best of all the VC is about 140€ cheaper than the Leica, and I think, but this is subjective, looks better on the X1", "link": "https://www.l-camera-forum.com/topic/112325-voigtlander-or-leica-viewfinder/page/8/?tab=comments#comment-1410980", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i even think leica might buy it's ovf from vc .... they say \"made in japan\" and are visibly/optically not any brighter than the vc ones. one argument which i contemplated was the \"tightness of specs\" or whatever you might call it, that the leica would be more specked towards the x1 in terms of centering and such ... this is clearly not the case, unlike with the oly ovf which i sent back immediately. i sent the leica ovf back as well (in germany there is a 30 day exchange period where one can ship anything back and get full refund) after having tried the vc \"round\" ovf which i think is perfect and not all that expensive. i have had a marking engraved on the exact center of the ovf, use single -----> spot !!! -af and this works fine. best of all the vc is about 140€ cheaper than the leica, and i think, but this is subjective, looks better on the x1", "sortedWord": "None", "identifyer": 11648, "year": "2010"}], "name": "spotL-Forum2010"}