{"interestingcomments": [{"Unnamed: 0": 339686, "autor": "waigx", "date": 1636378500000, "content": " Hi there. I got my M10-R one month ago and recently got a used VisoFlex (Type 020). I enable GPS / GPS time in the settings. Everytime after a few shots (involves auto-sleep/wakeup), the M10-R would start freezing: nothing works except the OVF still shows shutter speed (the shutter speed still responsive to environment lights) The only fix is to remove/insert the battery. The main reason for the EVF is because I like to have GPS tagging for traveling. It is easier for me to organize my exported photos in iOS. In middle of last traveling I stopped using the VisoFlex because I missed a few shots due to such freezing. Also I don’t like reinsert the battery in a busy street. Does someone experience similar issue or have suggestions? Thanks. Edited November 8 by waigx", "link": "https://www.l-camera-forum.com/topic/326295-m10-r-visoflex-type-020-causes-freezing/?tab=comments#comment-4309510", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": " hi there. i got my m10-r one month ago and recently got a used visoflex (type 020). i enable gps / gps time in the settings. everytime after a few shots (involves auto-sleep/wakeup), the m10-r would start freezing: nothing works except the ovf still shows shutter speed (the shutter speed still responsive to environment lights) the only fix is to remove/insert the battery. the main reason for the evf is because i like to have gps -----> tagging !!!  for traveling. it is easier for me to organize my exported photos in ios. in middle of last traveling i stopped using the visoflex because i missed a few shots due to such freezing. also i don’t like reinsert the battery in a busy street. does someone experience similar issue or have suggestions? thanks. edited november 8 by waigx", "sortedWord": "None", "identifyer": 753, "year": "2021"}, {"Unnamed: 0": 339688, "autor": "Malcolm Kays", "date": 1636381080000, "content": "37 minutes ago, waigx said: Hi there. I got my M10-R one month ago and recently got a used VisoFlex (Type 020). I enable GPS / GPS time in the settings. Everytime after a few shots (involves auto-sleep/wakeup), the M10-R would start freezing: nothing works except the OVF still shows shutter speed (the shutter speed still responsive to environment lights) The only fix is to remove/insert the battery. The main reason for the EVF is because of I like to have GPS tagging for traveling. It is easier for me to organize my export photos in iOS. But in middle of last traveling I stopped using the VisoFlex because I missed a few shots due to such freezing. Also I don’t like reinsert the battery in a busy street. Does someone experience similar issue or have suggestions? Thanks. This problem exists with M10, M10-R and M10-M. Only happens when using the Visoflex 020 and Leica have failed to solve the problem despite releasing firmware updates after it was reported by numerous users. Maybe the new version rumoured to be announced with the M11 will solve the problem, if you feel like chancing about £500 on one. Of course if the new one works properly the 020 will have very little resale value with this problem.", "link": "https://www.l-camera-forum.com/topic/326295-m10-r-visoflex-type-020-causes-freezing/?tab=comments#comment-4309525", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "37 minutes ago, waigx said: hi there. i got my m10-r one month ago and recently got a used visoflex (type 020). i enable gps / gps time in the settings. everytime after a few shots (involves auto-sleep/wakeup), the m10-r would start freezing: nothing works except the ovf still shows shutter speed (the shutter speed still responsive to environment lights) the only fix is to remove/insert the battery. the main reason for the evf is because of i like to have gps -----> tagging !!!  for traveling. it is easier for me to organize my export photos in ios. but in middle of last traveling i stopped using the visoflex because i missed a few shots due to such freezing. also i don’t like reinsert the battery in a busy street. does someone experience similar issue or have suggestions? thanks. this problem exists with m10, m10-r and m10-m. only happens when using the visoflex 020 and leica have failed to solve the problem despite releasing firmware updates after it was reported by numerous users. maybe the new version rumoured to be announced with the m11 will solve the problem, if you feel like chancing about £500 on one. of course if the new one works properly the 020 will have very little resale value with this problem.", "sortedWord": "None", "identifyer": 755, "year": "2021"}, {"Unnamed: 0": 414266, "autor": "trickness", "date": 1629658020000, "content": "2 hours ago, farnz said: Note: I know that among other lenses Milan also uses a 75/1.25 Noctilux-M asph so some of his pictures are likely to be taken with it. Pete. Yep, he is very detailed in his tagging as to what lens he uses.", "link": "https://www.l-camera-forum.com/topic/321876-noctilux-sl-users/page/3/?tab=comments#comment-4261509", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "2 hours ago, farnz said: note: i know that among other lenses milan also uses a 75/1.25 noctilux-m asph so some of his pictures are likely to be taken with it. pete. yep, he is very detailed in his -----> tagging !!!  as to what lens he uses.", "sortedWord": "None", "identifyer": 27201, "year": "2021"}, {"Unnamed: 0": 414430, "autor": "Fang", "date": 1631460900000, "content": "Built in GPS Tagging", "link": "https://www.l-camera-forum.com/topic/324389-let%E2%80%99s-start-a-new-wish-list-for-a-sl3/?tab=comments#comment-4274144", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "built in gps -----> tagging !!! ", "sortedWord": "None", "identifyer": 27366, "year": "2021"}, {"Unnamed: 0": 416724, "autor": "Bernd B.", "date": 1613238720000, "content": " I do not think it is the firmware only. See, Leica promised and advertised the GPS-system working with the Leica-app, when the SL2 came to market. But they never made the app work properly. There may be problems e.g. when the iphone goes to sleep - anyway, I use a simple geo-tagging app, upload the file to my Onedrive and import it to Lightroom. This works and saves time and nerves.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/6/?tab=comments#comment-4140107", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": " i do not think it is the firmware only. see, leica promised and advertised the gps-system working with the leica-app, when the sl2 came to market. but they never made the app work properly. there may be problems e.g. when the iphone goes to sleep - anyway, i use a simple geo------> tagging !!!  app, upload the file to my onedrive and import it to lightroom. this works and saves time and nerves.", "sortedWord": "None", "identifyer": 29725, "year": "2021"}, {"Unnamed: 0": 416756, "autor": "JulianHalliday", "date": 1624124940000, "content": "So. I 1. Exported profiles 2. Deleted FOTOS from my iPhone 3. Reset camera 4. Went through pairing sequence 5. Saw the blue light, got connected (though the sequence of pairing events remains inscrutable) 6. Allowed both phone and camera to go to sleep 7. Woke camera to find no connection (FOTOS: \"Camera not connected.\") 8. Woke phone, made FOTOS foreground 9. Got a restored connection It appears that in order to have geotagging on my SL2-S photos, I shall have to go through a series of phone manipulations (confirm to connect, it appears) every single time I start up the camera. This is effectively useless for me; I'd hoped the FW 2 would help, but it does not seem to have been changed. There is something deeply counterintuitive about the whole process -- \"Select CANCEL...\" -- and I say this as someone who writes, among other things, software documentation for a living. I'm going to try some more real-world scenarios and see if I'm getting tagging -- at one point just now the phone was saying that the connection had failed, but the camera still showed the GPS logo on screen.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/7/?tab=comments#comment-4222986", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "so. i 1. exported profiles 2. deleted fotos from my iphone 3. reset camera 4. went through pairing sequence 5. saw the blue light, got connected (though the sequence of pairing events remains inscrutable) 6. allowed both phone and camera to go to sleep 7. woke camera to find no connection (fotos: \"camera not connected.\") 8. woke phone, made fotos foreground 9. got a restored connection it appears that in order to have geotagging on my sl2-s photos, i shall have to go through a series of phone manipulations (confirm to connect, it appears) every single time i start up the camera. this is effectively useless for me; i'd hoped the fw 2 would help, but it does not seem to have been changed. there is something deeply counterintuitive about the whole process -- \"select cancel...\" -- and i say this as someone who writes, among other things, software documentation for a living. i'm going to try some more real-world scenarios and see if i'm getting -----> tagging !!!  -- at one point just now the phone was saying that the connection had failed, but the camera still showed the gps logo on screen.", "sortedWord": "None", "identifyer": 29757, "year": "2021"}, {"Unnamed: 0": 416763, "autor": "hotshew", "date": 1624218120000, "content": "13 hours ago, Bernd B. said: I know some folks working for Leica and they say they will stick to this app/smartphone-solution. Please tell your friends they are fooling themselves (and some of their customers) if they think what is implemented in the SL2 is a solution, or that everything will somehow come together correctly for the next camera release. Having a feature that is untrustworthy is worse than none at all IMO. For a lot of photographers (esp. landscape), cameras and GPS tagging go together like salt and pepper and Leica's customers will invent their own solutions if the \"in-camera\" solution cannot be trusted. A solution that results in data loss, on the other hand, is unforgivable, which is exactly what Leica has given us in the SL2. At $6,600 (US), I'll say again, it is disappointing Leica chose not to include an integrated GPS reciever similar to the SL (and Hasselblad X1Dii and Canon 1DXiii). The Leica brand is supposed to be about quality and simplicity, and yet they're letting the GPS feature tarnish their brand on both fronts (poor quality, added complexity). If Leica is concerned about the \"ugly\" GPS hump, I suggest their designers revisit the basics of design by having form follow function. Edited June 20 by hotshew typo", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/8/?tab=comments#comment-4223603", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "13 hours ago, bernd b. said: i know some folks working for leica and they say they will stick to this app/smartphone-solution. please tell your friends they are fooling themselves (and some of their customers) if they think what is implemented in the sl2 is a solution, or that everything will somehow come together correctly for the next camera release. having a feature that is untrustworthy is worse than none at all imo. for a lot of photographers (esp. landscape), cameras and gps -----> tagging !!!  go together like salt and pepper and leica's customers will invent their own solutions if the \"in-camera\" solution cannot be trusted. a solution that results in data loss, on the other hand, is unforgivable, which is exactly what leica has given us in the sl2. at $6,600 (us), i'll say again, it is disappointing leica chose not to include an integrated gps reciever similar to the sl (and hasselblad x1dii and canon 1dxiii). the leica brand is supposed to be about quality and simplicity, and yet they're letting the gps feature tarnish their brand on both fronts (poor quality, added complexity). if leica is concerned about the \"ugly\" gps hump, i suggest their designers revisit the basics of design by having form follow function. edited june 20 by hotshew typo", "sortedWord": "None", "identifyer": 29764, "year": "2021"}, {"Unnamed: 0": 416767, "autor": "hotshew", "date": 1624233960000, "content": "2 hours ago, SonomaBear said: What possible reason (other than engineering stubbornness or cheapness) could Leica have? My guess is they're \"shipping the org\" instead of making the best design choices for their customers. The Leica FOTOS team probably sees this as their problem to solve and pitches proxying GPS function via the smartphone as an equivalent solution to integrated GPS while reducing COGS. It sounds good on paper, and the Leica FOTOS team probably has some impressive looking data based on limited testing to address any reliability concerns, but that does not accurately reflect what customers are experiencing over time. The SL2 GPS feature simply cannot be trusted. FOTOS use-case scenarios like camera control and photo transfer are interactive, so if they fail you know it in real-time and can re-try. For GPS tagging, however, you don't learn about the problem until it's too late to do anything about it. This is a feature best integrated into the camera. I suspect many Leica engineers know this and the problem probably has company politics and accountants to blame.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/8/?tab=comments#comment-4223682", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "2 hours ago, sonomabear said: what possible reason (other than engineering stubbornness or cheapness) could leica have? my guess is they're \"shipping the org\" instead of making the best design choices for their customers. the leica fotos team probably sees this as their problem to solve and pitches proxying gps function via the smartphone as an equivalent solution to integrated gps while reducing cogs. it sounds good on paper, and the leica fotos team probably has some impressive looking data based on limited testing to address any reliability concerns, but that does not accurately reflect what customers are experiencing over time. the sl2 gps feature simply cannot be trusted. fotos use-case scenarios like camera control and photo transfer are interactive, so if they fail you know it in real-time and can re-try. for gps -----> tagging !!! , however, you don't learn about the problem until it's too late to do anything about it. this is a feature best integrated into the camera. i suspect many leica engineers know this and the problem probably has company politics and accountants to blame.", "sortedWord": "None", "identifyer": 29768, "year": "2021"}, {"Unnamed: 0": 416770, "autor": "Simone_DF", "date": 1624259100000, "content": "I had a Panasonic S5 for a couple of weeks and GPS tagging via Panasonic mobile app worked flawlessly from day 1. The problem is either in the Leica app or in the SL firmware.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/8/?tab=comments#comment-4223746", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "i had a panasonic s5 for a couple of weeks and gps -----> tagging !!!  via panasonic mobile app worked flawlessly from day 1. the problem is either in the leica app or in the sl firmware.", "sortedWord": "None", "identifyer": 29771, "year": "2021"}, {"Unnamed: 0": 416772, "autor": "Simone_DF", "date": 1624277700000, "content": "56 minutes ago, Bernd B. said: Yes, the problem is somewhere out there, between Leica‘ Firmware and the Leica-app. A Leica-engineer explained to me some details about a year ago. It all depends, too, on legal issues about connecting, copyrights, patents etc. To make it short: IF I want my photos tagged with gps-data, I use the solution via gps-app, smartphone and Lightroom CC. Looks like all other brands solved these \"legal\" issues many years ago, but a 6500€ camera apparently cannot. Even my old A7rII had zero connection issues and full GPS tagging via app.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/8/?tab=comments#comment-4223851", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "56 minutes ago, bernd b. said: yes, the problem is somewhere out there, between leica‘ firmware and the leica-app. a leica-engineer explained to me some details about a year ago. it all depends, too, on legal issues about connecting, copyrights, patents etc. to make it short: if i want my photos tagged with gps-data, i use the solution via gps-app, smartphone and lightroom cc. looks like all other brands solved these \"legal\" issues many years ago, but a 6500€ camera apparently cannot. even my old a7rii had zero connection issues and full gps -----> tagging !!!  via app.", "sortedWord": "None", "identifyer": 29773, "year": "2021"}, {"Unnamed: 0": 416773, "autor": "hotshew", "date": 1624305300000, "content": "12 hours ago, Simone_DF said: I had a Panasonic S5 for a couple of weeks and GPS tagging via Panasonic mobile app worked flawlessly from day 1. You may have needed more time with the camera. The issue is reliability, not function. The SL2 system also works flawlessly, when it works. I have yet to come across a camera that proxies GPS location via smartphone to reliably geotag photos (and I also previously owned the S1R). It's a complex solution to a simple problem that lets you down when you need it most -- like a copy machine. Like others on this forum, I've resorted to using an external GPS logger for geotagging SL2 photos because the SL2 system results in data loss. Edited June 21 by hotshew", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/8/?tab=comments#comment-4224118", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "12 hours ago, simone_df said: i had a panasonic s5 for a couple of weeks and gps -----> tagging !!!  via panasonic mobile app worked flawlessly from day 1. you may have needed more time with the camera. the issue is reliability, not function. the sl2 system also works flawlessly, when it works. i have yet to come across a camera that proxies gps location via smartphone to reliably geotag photos (and i also previously owned the s1r). it's a complex solution to a simple problem that lets you down when you need it most -- like a copy machine. like others on this forum, i've resorted to using an external gps logger for geotagging sl2 photos because the sl2 system results in data loss. edited june 21 by hotshew", "sortedWord": "None", "identifyer": 29774, "year": "2021"}, {"Unnamed: 0": 416776, "autor": "hotshew", "date": 1632648600000, "content": "Possibly old news since I haven't been paying attention to this topic as of late and have all but given up on hopes of a GPS solution for SL2, but I just updated to the latest SL2 v3 firmware and updated my Leica Fotos app, and I noticed an option in Fotos to \"always tag\" photos, which is listed as Beta. This is certainly a step in the right direction. Requiring the user to be (actively) using the app for GeoTag to work (as was previously the case IIRC) is indicative of not thinking through the use case very well, IMO. However, based on very limited usage and experimentation, it appears that the app process still needs to be running in order for the GPS tagging feature to work (as indicated by the satellite icon on the camera's display). It need not in the foreground (i.e, actively using), but if (1) you kill the app by swiping it up or (2) iOS memory management kicks in and closes the app to reclaim memory, then the feature no longer works. I don't have any mileage on the latest updates, but will see how goes. Hopefully, I suspect, if loading up the app at the start of a day of shooting, and occasionally through out day to keep it from getting closed in the background, then should be OK, assuming everything else is OK. Of course, Bluetooth needs to be enabled and Camera paired too -- so the Bluetooth icon showing on the Camera display is a precondition for the GPS satellite icon/indicator to show. Edited September 26 by hotshew", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/8/?tab=comments#comment-4281764", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "possibly old news since i haven't been paying attention to this topic as of late and have all but given up on hopes of a gps solution for sl2, but i just updated to the latest sl2 v3 firmware and updated my leica fotos app, and i noticed an option in fotos to \"always tag\" photos, which is listed as beta. this is certainly a step in the right direction. requiring the user to be (actively) using the app for geotag to work (as was previously the case iirc) is indicative of not thinking through the use case very well, imo. however, based on very limited usage and experimentation, it appears that the app process still needs to be running in order for the gps -----> tagging !!!  feature to work (as indicated by the satellite icon on the camera's display). it need not in the foreground (i.e, actively using), but if (1) you kill the app by swiping it up or (2) ios memory management kicks in and closes the app to reclaim memory, then the feature no longer works. i don't have any mileage on the latest updates, but will see how goes. hopefully, i suspect, if loading up the app at the start of a day of shooting, and occasionally through out day to keep it from getting closed in the background, then should be ok, assuming everything else is ok. of course, bluetooth needs to be enabled and camera paired too -- so the bluetooth icon showing on the camera display is a precondition for the gps satellite icon/indicator to show. edited september 26 by hotshew", "sortedWord": "None", "identifyer": 29777, "year": "2021"}, {"Unnamed: 0": 416782, "autor": "hotshew", "date": 1632776100000, "content": "Quote Does it drain the battery significantly more, do you think? Enabling bluetooth is going increase battery drain, but the incremental power draw should be small (sort of like turning on the A/C in your car). Since GPS location is being proxied via the phone over the Bluetooth connection, there'll be very little or no additional draw on your camera (your smartphone pays that tax). Quote However, I still have the same problem as what I’ve had in the past where my use case involves me turning on the camera and taking a few shots, then shutting it off immediately after I’m done to conserve battery life if I know I don’t plan to take another shot for more than a couple minutes. This behavior exists even when the camera auto-powers off (does not need to be flipping the ON/OFF switch), so will need to disable auto-power to avoid the constant service reconnection lag. When it \"works\", it takes my SL2 (FW v3.0, Fotos 2.4.0) about 8s for Bluetooth to reconnect (based on the Bluetooth indictor appearing) and another 4-30s for the GPS indicator to appear, signaling that the GPS tagging feature is available. Often times I need to intervene by brining re-opening the Fotos app to get a GPS tagging working in again. In a nutshell, what I've seen so far is that the GPS function works OK after the camera is powered on (and stays on) once the initial GPS service connection in established. If the camera powers off (automatically or via ON/OFF switch), then it can take some interaction on the user's part to get the GPS up and going again, resulting in a poor user experience and, inevitably, untagged photos. If possible, it would be best if Leica persisted the Bluetooth connection even while the camera is off to address the startup latency issue. Or even better yet, go back to providing integrated GPS function into their cameras. Much simpler and more reliable.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4282667", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "quote does it drain the battery significantly more, do you think? enabling bluetooth is going increase battery drain, but the incremental power draw should be small (sort of like turning on the a/c in your car). since gps location is being proxied via the phone over the bluetooth connection, there'll be very little or no additional draw on your camera (your smartphone pays that tax). quote however, i still have the same problem as what i’ve had in the past where my use case involves me turning on the camera and taking a few shots, then shutting it off immediately after i’m done to conserve battery life if i know i don’t plan to take another shot for more than a couple minutes. this behavior exists even when the camera auto-powers off (does not need to be flipping the on/off switch), so will need to disable auto-power to avoid the constant service reconnection lag. when it \"works\", it takes my sl2 (fw v3.0, fotos 2.4.0) about 8s for bluetooth to reconnect (based on the bluetooth indictor appearing) and another 4-30s for the gps indicator to appear, signaling that the gps -----> tagging !!!  feature is available. often times i need to intervene by brining re-opening the fotos app to get a gps tagging working in again. in a nutshell, what i've seen so far is that the gps function works ok after the camera is powered on (and stays on) once the initial gps service connection in established. if the camera powers off (automatically or via on/off switch), then it can take some interaction on the user's part to get the gps up and going again, resulting in a poor user experience and, inevitably, untagged photos. if possible, it would be best if leica persisted the bluetooth connection even while the camera is off to address the startup latency issue. or even better yet, go back to providing integrated gps function into their cameras. much simpler and more reliable.", "sortedWord": "None", "identifyer": 29783, "year": "2021"}, {"Unnamed: 0": 416784, "autor": "hotshew", "date": 1632784500000, "content": " 1 hour ago, beewee said: The camera is never completely powered down even when the power switch is set to off. If you enable the remote wake-up feature via the bluetooth settings on the camera, it will try to maintain a connection to the phone as I mentioned earlier. I haven’t had a chance to test with this feature enabled on the latest v2.1 firmware on the SL2-S but it didn’t seem to help on the earlier v2.0 firmware. I previously enabled the remote wake feature, but it makes not difference AFAICT, except that provides the ability to remotely turn on the camera from the Leica app. Nice feature, which does exactly what it says it does, but it does not appear to help with addressing the connectivity issues and start-up latency for GPS tagging to become available after the camera powers on. Edited September 27 by hotshew", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4282745", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": " 1 hour ago, beewee said: the camera is never completely powered down even when the power switch is set to off. if you enable the remote wake-up feature via the bluetooth settings on the camera, it will try to maintain a connection to the phone as i mentioned earlier. i haven’t had a chance to test with this feature enabled on the latest v2.1 firmware on the sl2-s but it didn’t seem to help on the earlier v2.0 firmware. i previously enabled the remote wake feature, but it makes not difference afaict, except that provides the ability to remotely turn on the camera from the leica app. nice feature, which does exactly what it says it does, but it does not appear to help with addressing the connectivity issues and start-up latency for gps -----> tagging !!!  to become available after the camera powers on. edited september 27 by hotshew", "sortedWord": "None", "identifyer": 29785, "year": "2021"}, {"Unnamed: 0": 416785, "autor": "beewee", "date": 1632788160000, "content": "58 minutes ago, hotshew said: I previously enabled the remote wake feature, but it makes not difference AFAICT, except that provides the ability to remotely turn on the camera from the Leica app. Nice feature, which does exactly what it says it does, but it does not appear to help with addressing the connectivity issues and start-up latency for GPS tagging to become available after the camera powers on. That’s good to know. I’ll test it out in my next outing but your observations doesn’t completely surprise me. It all depends on how the geotagging and bluetooth connection mechanism is implemented on both ends of the connection.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4282762", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "58 minutes ago, hotshew said: i previously enabled the remote wake feature, but it makes not difference afaict, except that provides the ability to remotely turn on the camera from the leica app. nice feature, which does exactly what it says it does, but it does not appear to help with addressing the connectivity issues and start-up latency for gps -----> tagging !!!  to become available after the camera powers on. that’s good to know. i’ll test it out in my next outing but your observations doesn’t completely surprise me. it all depends on how the geotagging and bluetooth connection mechanism is implemented on both ends of the connection.", "sortedWord": "None", "identifyer": 29786, "year": "2021"}, {"Unnamed: 0": 419507, "autor": "LBJ2", "date": 1630261380000, "content": "On 5/15/2020 at 8:20 PM, Jared said: For those who are interested, Geo Tagging for the SL2 has been enabled via the latest release of Fotos. Here is how it works: 1) Make sure Bluetooth is enabled in your SL2 2) Turn on Fotos in your iPhone 3) Connect to your SL2 in Fotos 4) Press the “Remote” button in Fotos. The satellite icon should appear on your top plate and in your EVF. Pictures you take will now be tagged with GPS info, regardless of whether the picture is taken through Fotos or with the shutter release on the camera. Note that the connection between Fotos and the camera over WiFi must remain active for the geo tagging to work. The satellite data remains active for some seconds after you disconnect, but not minutes. Not the most elegant solution Inhave seen, but it does appear to work, and at least you can use the camera to release the shutter, not just Fotos. Wish it just required a low power Bluetooth connection and active Fotos connection. Thank you! I'm just trying geotagging with SL2 and iPhone Fotos app and couldn't figure out how to enable after some googling until I found your post. Very helpful. The only difference from your post is I see the satellite symbol at the right bottom of the view on the back LCD or when looking through the EVF.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/page/2/?tab=comments#comment-4265888", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "on 5/15/2020 at 8:20 pm, jared said: for those who are interested, geo -----> tagging !!!  for the sl2 has been enabled via the latest release of fotos. here is how it works: 1) make sure bluetooth is enabled in your sl2 2) turn on fotos in your iphone 3) connect to your sl2 in fotos 4) press the “remote” button in fotos. the satellite icon should appear on your top plate and in your evf. pictures you take will now be tagged with gps info, regardless of whether the picture is taken through fotos or with the shutter release on the camera. note that the connection between fotos and the camera over wifi must remain active for the geo tagging to work. the satellite data remains active for some seconds after you disconnect, but not minutes. not the most elegant solution inhave seen, but it does appear to work, and at least you can use the camera to release the shutter, not just fotos. wish it just required a low power bluetooth connection and active fotos connection. thank you! i'm just trying geotagging with sl2 and iphone fotos app and couldn't figure out how to enable after some googling until i found your post. very helpful. the only difference from your post is i see the satellite symbol at the right bottom of the view on the back lcd or when looking through the evf.", "sortedWord": "None", "identifyer": 32519, "year": "2021"}, {"Unnamed: 0": 441823, "autor": "iRandom", "date": 1626622920000, "content": "13 hours ago, SergiyG said: Did anyone try https://www.geotagphotos.net? It uses date and time to associate geolocation data in the post-processing phase. I've used it on a couple of vacations and did the tagging in LR. I see that they now have their own desktop app to do the tagging if you aren't using LR. It did give me a days worth of tagged photos. My only issues were remembering to turn it on and being worried about the battery life since I was also using my phone for photos and other stuff. Both issues also apply to the Leica app. Battery life may no longer be a concern as phones as evolved and external batteries are now readily available. I think I'll give it another try since I don't have much luck with the Leica app. Got one out of twenty photos tagged yesterday. The reason I stopped using Geotag Photos was that I've moved away from LR and hadn't taken the time to track down an app to tag the photos.", "link": "https://www.l-camera-forum.com/topic/299680-geotagging-for-leica-q2/?tab=comments#comment-4240447", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "13 hours ago, sergiyg said: did anyone try https://www.geotagphotos.net? it uses date and time to associate geolocation data in the post-processing phase. i've used it on a couple of vacations and did the -----> tagging !!!  in lr. i see that they now have their own desktop app to do the tagging if you aren't using lr. it did give me a days worth of tagged photos. my only issues were remembering to turn it on and being worried about the battery life since i was also using my phone for photos and other stuff. both issues also apply to the leica app. battery life may no longer be a concern as phones as evolved and external batteries are now readily available. i think i'll give it another try since i don't have much luck with the leica app. got one out of twenty photos tagged yesterday. the reason i stopped using geotag photos was that i've moved away from lr and hadn't taken the time to track down an app to tag the photos.", "sortedWord": "None", "identifyer": 5172, "year": "2021"}, {"Unnamed: 0": 441824, "autor": "iRandom", "date": 1626649980000, "content": "I took a mile walk around the fire-roads in the neighborhood to test GeoTag Photos since I haven't used it in a while. Every photo I took now has geolocation info in the DNG. I used the iPhone app to setup the session, used the watch app to control the session and used the Mac app to tag the photos prior importing into Photos. I don't mind the extra step to tag the photos prior to importing since my workflow already includes using FastRawViewer to do the initial pruning prior to going to Photos. Looks like the GeoTag Photos folks also have an app to apply the geolocation tagging to the photos in iCloud Photos Library if you import directly from an SD into Photos on your iPhone/iPad. There's also the option to apply the tagging in LR. I used this in the past and it was quick and easy.", "link": "https://www.l-camera-forum.com/topic/299680-geotagging-for-leica-q2/?tab=comments#comment-4240706", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "i took a mile walk around the fire-roads in the neighborhood to test geotag photos since i haven't used it in a while. every photo i took now has geolocation info in the dng. i used the iphone app to setup the session, used the watch app to control the session and used the mac app to tag the photos prior importing into photos. i don't mind the extra step to tag the photos prior to importing since my workflow already includes using fastrawviewer to do the initial pruning prior to going to photos. looks like the geotag photos folks also have an app to apply the geolocation -----> tagging !!!  to the photos in icloud photos library if you import directly from an sd into photos on your iphone/ipad. there's also the option to apply the tagging in lr. i used this in the past and it was quick and easy.", "sortedWord": "None", "identifyer": 5173, "year": "2021"}], "name": "taggingL-Forum2021"}