{"interestingcomments": [{"Unnamed: 0": 416642, "autor": "Bernd B.", "date": 1578313680000, "content": "I use the SL2 (had the SL before) with iPhone X and iPad Pro 2018 (both latest firmware) and the photo-app provided by Leica. Yes, Leica promised the photo-app would provide GPS-data when the smartphone is connected to the camera. But it does not. I mailed to Leica, complaining about this. Their answer/advice: Go and connect the iPhone and the SL2 via the app, then take the photo via the app (not directly from the camera) and you will get the GPS-data. I tried it - and failed. I do until today not get any GPS-data via Leica's (updated) photo-app. This is not an app, this is a disgrace. As a workaround I now use an outdoor-app which lets me export the gpx-data to my Onedrive-account. From there I import the gpx-data into Lightroom. From there I can provide my photos with the GPS-Data. Problem there: Lightroom would add all these data automatically from the gpx-data but due to legal restrictions it seems Lightroom can't do it right now (\"tagging photos automatically\" is gray) - i have to do it manually photo per photo. Oh, how I miss the GPS of the Leica SL ...", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/2/?tab=comments#comment-3886058", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "i use the sl2 (had the sl before) with iphone x and ipad pro 2018 (both latest firmware) and the photo-app provided by leica. yes, leica promised the photo-app would provide gps-data when the smartphone is connected to the camera. but it does not. i mailed to leica, complaining about this. their answer/advice: go and connect the iphone and the sl2 via the app, then take the photo via the app (not directly from the camera) and you will get the gps-data. i tried it - and failed. i do until today not get any gps-data via leica's (updated) photo-app. this is not an app, this is a disgrace. as a workaround i now use an outdoor-app which lets me export the gpx-data to my onedrive-account. from there i import the gpx-data into lightroom. from there i can provide my photos with the gps-data. problem there: lightroom would add all these data automatically from the gpx-data but due to legal restrictions it seems lightroom can't do it right now (\"-----> tagging !!!  photos automatically\" is gray) - i have to do it manually photo per photo. oh, how i miss the gps of the leica sl ...", "sortedWord": "None", "identifyer": 29643, "year": "2020"}, {"Unnamed: 0": 416645, "autor": "SrMi", "date": 1578330960000, "content": "On 11/25/2019 at 6:15 AM, Exodies said: Have your Garmin GPS make a track log, Lightroom can read it and tag the photographs. A small gps will run for over eight hours on one battery; you don’t need to load a map in it. Other solutions are too inconvenient - phone battery can’t cope with it, camera internal gps’s take too long to find the satellites. I use tagging with phone via BTLE on several cameras. Never had any issues with phone battery (not using Wi-Fi or BT, but BTLE). I used to cary Garmin GPS handhelds and watches with me to collect location data. I found it too cumbersome: check that it is charged, check that it is turned on, check that the time on the cameras matches the GPS time. The built-in GPS or phone GPS (via BTLE) is for me the most convenient way of tagging photos.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/2/?tab=comments#comment-3886239", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "on 11/25/2019 at 6:15 am, exodies said: have your garmin gps make a track log, lightroom can read it and tag the photographs. a small gps will run for over eight hours on one battery; you don’t need to load a map in it. other solutions are too inconvenient - phone battery can’t cope with it, camera internal gps’s take too long to find the satellites. i use -----> tagging !!!  with phone via btle on several cameras. never had any issues with phone battery (not using wi-fi or bt, but btle). i used to cary garmin gps handhelds and watches with me to collect location data. i found it too cumbersome: check that it is charged, check that it is turned on, check that the time on the cameras matches the gps time. the built-in gps or phone gps (via btle) is for me the most convenient way of tagging photos.", "sortedWord": "None", "identifyer": 29646, "year": "2020"}, {"Unnamed: 0": 416649, "autor": "rfunnell", "date": 1578350340000, "content": "I also had the Leica Q2 from launch and GPS tagging was promised there but nothing yet so don't get your hopes up now we are almost one year on. They also had the same Wifi bluetooth arrangement working only for a few minutes within your wifi area on the Q2 (BTLE). Love my new SL2. but disappointed regarding the implementation and delay of this promised feature. Edited January 6, 2020 by rfunnell", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/2/?tab=comments#comment-3886453", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "i also had the leica q2 from launch and gps -----> tagging !!!  was promised there but nothing yet so don't get your hopes up now we are almost one year on. they also had the same wifi bluetooth arrangement working only for a few minutes within your wifi area on the q2 (btle). love my new sl2. but disappointed regarding the implementation and delay of this promised feature. edited january 6, 2020 by rfunnell", "sortedWord": "None", "identifyer": 29650, "year": "2020"}, {"Unnamed: 0": 416652, "autor": "Fang", "date": 1596594180000, "content": "I have just decided to stay with my SL and not get the SL2 because of the lack of GPS tagging. I travelled to the remote places in SIberia with the nomads Reindeer Herders and to the Eagle Hunters in the Altai Mountains of Mongolia and my SL was great in tagging the location. I cannot imagine travelling with a camera without GPS tagging since I do review my photos years later and I don't have to worry about trying to recall the location. I don't like the idea of depending on another device for GPS tagging in my photos. I don't even use any handphone apps to view my photos.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/2/?tab=comments#comment-4021662", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "i have just decided to stay with my sl and not get the sl2 because of the lack of gps -----> tagging !!! . i travelled to the remote places in siberia with the nomads reindeer herders and to the eagle hunters in the altai mountains of mongolia and my sl was great in tagging the location. i cannot imagine travelling with a camera without gps tagging since i do review my photos years later and i don't have to worry about trying to recall the location. i don't like the idea of depending on another device for gps tagging in my photos. i don't even use any handphone apps to view my photos.", "sortedWord": "None", "identifyer": 29653, "year": "2020"}, {"Unnamed: 0": 416653, "autor": "hotshew", "date": 1596596940000, "content": "\"I don't like the idea of depending on another device for GPS tagging in my photos.\" Agreed. As a landscape shooter, GPS tagging is a must-have. For all the the marginally useful the features manufacturers are adding to cameras these days, the trend away from integrated GPS tagging is unfortunate. Smartphone pairing adds complexity and is unreliable. I was really happy to learn the SL included GPS tagging when I first onboarded to the system last year, thinking, \"Great! Leica gets it!\", only to then be let down to learn the SL2 does not. Two steps forward, one step back. --img--  Edited August 5, 2020 by hotshew", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/2/?tab=comments#comment-4021672", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "\"i don't like the idea of depending on another device for gps -----> tagging !!!  in my photos.\" agreed. as a landscape shooter, gps tagging is a must-have. for all the the marginally useful the features manufacturers are adding to cameras these days, the trend away from integrated gps tagging is unfortunate. smartphone pairing adds complexity and is unreliable. i was really happy to learn the sl included gps tagging when i first onboarded to the system last year, thinking, \"great! leica gets it!\", only to then be let down to learn the sl2 does not. two steps forward, one step back. --img--  edited august 5, 2020 by hotshew", "sortedWord": "None", "identifyer": 29654, "year": "2020"}, {"Unnamed: 0": 416663, "autor": "Bernd B.", "date": 1598698980000, "content": "As far as a Leica-employee told me, there are technical and software-related issues using the Leica-app, the SL2 and a smartphone, when it comes to „long term connection“. In short: when they started with this app-solution they did not consider it would be that tricky in the end. Sorry for my English, by the way. Even with new iOs, new SL2-firmware the GPS-issue persists: The „gps-connection“ between SL2 and smsrtphone/Leica-App quits after some 2 minutes. My solution: Using a gps-tracker on the iPhone, send the data to my Onedrive-Cloud and import the data to Lightroom, doing the geo-tagging from there. Kind of unworthy, but it works.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/3/?tab=comments#comment-4035592", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "as far as a leica-employee told me, there are technical and software-related issues using the leica-app, the sl2 and a smartphone, when it comes to „long term connection“. in short: when they started with this app-solution they did not consider it would be that tricky in the end. sorry for my english, by the way. even with new ios, new sl2-firmware the gps-issue persists: the „gps-connection“ between sl2 and smsrtphone/leica-app quits after some 2 minutes. my solution: using a gps-tracker on the iphone, send the data to my onedrive-cloud and import the data to lightroom, doing the geo------> tagging !!!  from there. kind of unworthy, but it works.", "sortedWord": "None", "identifyer": 29664, "year": "2020"}, {"Unnamed: 0": 416664, "autor": "hesyversen", "date": 1598800560000, "content": " On 8/29/2020 at 1:03 PM, Bernd B. said: As far as a Leica-employee told me, there are technical and software-related issues using the Leica-app, the SL2 and a smartphone, when it comes to „long term connection“. In short: when they started with this app-solution they did not consider it would be that tricky in the end. Sorry for my English, by the way. Even with new iOs, new SL2-firmware the GPS-issue persists: The „gps-connection“ between SL2 and smsrtphone/Leica-App quits after some 2 minutes. My solution: Using a gps-tracker on the iPhone, send the data to my Onedrive-Cloud and import the data to Lightroom, doing the geo-tagging from there. Kind of unworthy, but it works. Can you please explain more in detail how to do this?", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/3/?tab=comments#comment-4036342", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": " on 8/29/2020 at 1:03 pm, bernd b. said: as far as a leica-employee told me, there are technical and software-related issues using the leica-app, the sl2 and a smartphone, when it comes to „long term connection“. in short: when they started with this app-solution they did not consider it would be that tricky in the end. sorry for my english, by the way. even with new ios, new sl2-firmware the gps-issue persists: the „gps-connection“ between sl2 and smsrtphone/leica-app quits after some 2 minutes. my solution: using a gps-tracker on the iphone, send the data to my onedrive-cloud and import the data to lightroom, doing the geo------> tagging !!!  from there. kind of unworthy, but it works. can you please explain more in detail how to do this?", "sortedWord": "None", "identifyer": 29665, "year": "2020"}, {"Unnamed: 0": 416666, "autor": "Bernd B.", "date": 1598818440000, "content": "It‘s quite simple: installing a gps-tracker-app on the smartphone, running it while talking pics. Then copying the file to my cloud (in my case: microsoft onedrive), it‘s synced with a folder on my computer. As soon as I start the computer, the file is copied to a folder there. Then I start Lightroom, using the geo-tagging option (just google it, works quite easily).", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/3/?tab=comments#comment-4036488", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "it‘s quite simple: installing a gps-tracker-app on the smartphone, running it while talking pics. then copying the file to my cloud (in my case: microsoft onedrive), it‘s synced with a folder on my computer. as soon as i start the computer, the file is copied to a folder there. then i start lightroom, using the geo------> tagging !!!  option (just google it, works quite easily).", "sortedWord": "None", "identifyer": 29667, "year": "2020"}, {"Unnamed: 0": 416667, "autor": "SrMi", "date": 1598820360000, "content": "8 minutes ago, Bernd B. said: It‘s quite simple: installing a gps-tracker-app on the smartphone, running it while talking pics. Then copying the file to my cloud (in my case: microsoft onedrive), it‘s synced with a folder on my computer. As soon as I start the computer, the file is copied to a folder there. Then I start Lightroom, using the geo-tagging option (just google it, works quite easily). I use a GPS tracking app as well, but I prefer a built-in GPS. The main issue with GPS tracking app is to remember to turn it on and to synchronize the time between camera and phone.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/3/?tab=comments#comment-4036510", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "8 minutes ago, bernd b. said: it‘s quite simple: installing a gps-tracker-app on the smartphone, running it while talking pics. then copying the file to my cloud (in my case: microsoft onedrive), it‘s synced with a folder on my computer. as soon as i start the computer, the file is copied to a folder there. then i start lightroom, using the geo------> tagging !!!  option (just google it, works quite easily). i use a gps tracking app as well, but i prefer a built-in gps. the main issue with gps tracking app is to remember to turn it on and to synchronize the time between camera and phone.", "sortedWord": "None", "identifyer": 29668, "year": "2020"}, {"Unnamed: 0": 416674, "autor": "SrMi", "date": 1599267660000, "content": "15 minutes ago, hotshew said: Agreed, external is suboptimal (also need to remember to turn them on), but a better solution than Smartphone IMO. I am uncertain, which I prefer. The smartphone tagging has the advantage to be always on; there is no wait for GPS acquisition once you turn on the camera. On the other hand, with smartphone tagging, you need to manage the GPX tracks and turn the tracking on/off on the phone.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/3/?tab=comments#comment-4040145", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "15 minutes ago, hotshew said: agreed, external is suboptimal (also need to remember to turn them on), but a better solution than smartphone imo. i am uncertain, which i prefer. the smartphone -----> tagging !!!  has the advantage to be always on; there is no wait for gps acquisition once you turn on the camera. on the other hand, with smartphone tagging, you need to manage the gpx tracks and turn the tracking on/off on the phone.", "sortedWord": "None", "identifyer": 29675, "year": "2020"}, {"Unnamed: 0": 416675, "autor": "hirohhhh", "date": 1599268740000, "content": "Yeah, I read couple times about the \"hump\", which I didn't even notice for 5 years owning SL and using it daily. Compromising GPS to remove the hump is something beyond my understanding. I'd understand if it's the iPhone with no humps and buttons and zero distraction, but that's not the case with any camera. Anyway, smartphone app is impractical to me because I occasionally take the camera dozens of time a day to shoot each and everything, and I won't think about the app every time. I'm a bit sticker about geo-tagging and I have a smart collection that lists all untagged photos so I have to tag them manually, and this collection always have to be zeroed. It will make almost impossible with SL2 and I'll have to learn to ignore that and live with untagged photos Edited September 5, 2020 by hirohhhh", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/3/?tab=comments#comment-4040148", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "yeah, i read couple times about the \"hump\", which i didn't even notice for 5 years owning sl and using it daily. compromising gps to remove the hump is something beyond my understanding. i'd understand if it's the iphone with no humps and buttons and zero distraction, but that's not the case with any camera. anyway, smartphone app is impractical to me because i occasionally take the camera dozens of time a day to shoot each and everything, and i won't think about the app every time. i'm a bit sticker about geo------> tagging !!!  and i have a smart collection that lists all untagged photos so i have to tag them manually, and this collection always have to be zeroed. it will make almost impossible with sl2 and i'll have to learn to ignore that and live with untagged photos edited september 5, 2020 by hirohhhh", "sortedWord": "None", "identifyer": 29676, "year": "2020"}, {"Unnamed: 0": 416677, "autor": "SrMi", "date": 1599271500000, "content": "41 minutes ago, hirohhhh said: Yeah, I read couple times about the \"hump\", which I didn't even notice for 5 years owning SL and using it daily. Compromising GPS to remove the hump is something beyond my understanding. I'd understand if it's the iPhone with no humps and buttons and zero distraction, but that's not the case with any camera. Anyway, smartphone app is impractical to me because I occasionally take the camera dozens of time a day to shoot each and everything, and I won't think about the app every time. I'm a bit sticker about geo-tagging and I have a smart collection that lists all untagged photos so I have to tag them manually, and this collection always have to be zeroed. It will make almost impossible with SL2 and I'll have to learn to ignore that and live with untagged photos I doubt that the GPS was removed because of the 'hump.' Has Leica commented on the reason for removal in SL2? You can start the GPS tagging app in the morning and let it run the whole day. It does not consume the phone battery that much. It is still not as convenient as the built-in one.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/3/?tab=comments#comment-4040155", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "41 minutes ago, hirohhhh said: yeah, i read couple times about the \"hump\", which i didn't even notice for 5 years owning sl and using it daily. compromising gps to remove the hump is something beyond my understanding. i'd understand if it's the iphone with no humps and buttons and zero distraction, but that's not the case with any camera. anyway, smartphone app is impractical to me because i occasionally take the camera dozens of time a day to shoot each and everything, and i won't think about the app every time. i'm a bit sticker about geo------> tagging !!!  and i have a smart collection that lists all untagged photos so i have to tag them manually, and this collection always have to be zeroed. it will make almost impossible with sl2 and i'll have to learn to ignore that and live with untagged photos i doubt that the gps was removed because of the 'hump.' has leica commented on the reason for removal in sl2? you can start the gps tagging app in the morning and let it run the whole day. it does not consume the phone battery that much. it is still not as convenient as the built-in one.", "sortedWord": "None", "identifyer": 29678, "year": "2020"}, {"Unnamed: 0": 416679, "autor": "hirohhhh", "date": 1599274200000, "content": "43 minutes ago, SrMi said: I doubt that the GPS was removed because of the 'hump.' Has Leica commented on the reason for removal in SL2? You can start the GPS tagging app in the morning and let it run the whole day. It does not consume the phone battery that much. It is still not as convenient as the built-in one. If only is that reliable that works throughout the day without disconnecting. Whenever I tried Fotos app, it worked after third attempt to connect, and it usually ended with me deleting the app after 5 minutes. So yeah, it's possible but far from convenient.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/4/?tab=comments#comment-4040168", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "43 minutes ago, srmi said: i doubt that the gps was removed because of the 'hump.' has leica commented on the reason for removal in sl2? you can start the gps -----> tagging !!!  app in the morning and let it run the whole day. it does not consume the phone battery that much. it is still not as convenient as the built-in one. if only is that reliable that works throughout the day without disconnecting. whenever i tried fotos app, it worked after third attempt to connect, and it usually ended with me deleting the app after 5 minutes. so yeah, it's possible but far from convenient.", "sortedWord": "None", "identifyer": 29680, "year": "2020"}, {"Unnamed: 0": 416684, "autor": "hotshew", "date": 1599438960000, "content": " 53 minutes ago, Manicouagan1 said: The technical limitations were apparently not understood until the testing phase. By then I suspect that there was hope that the software team could solve the loss of connection problem with changes in the FOTO's application in the cell phone, camera or both.. Obviously they did not. But with software there is always hope of a solution in another version if management will pay for it. A better approach would have been for Leica to keep the integrated GPS receiver and augment it with a smartphone connection. This would help ensure a reliable signal while outdoors (i.e., when persons are most likely to want GPS tagging) while also enabling tagging in scenarios were a GPS fix is not possible (indoors, under cover, etc.). It would have also enabled Leica to work through connectivity issues without regressing functionality already found in the SL2's predecessor. At the SL2's price point, the added cost shouldn't have been an issue (or Leica customers not likely sensitive to the added costs if passed on). As is often the case with software development, taking a dependency on external software or hardware leads to integration challenges. Smartphones in particular are a challenge because they're a constantly moving target as major software updates are applied annually, and are subject to policy changes addressing privacy concerns and security threats. In other words, even if you have it working reliably today, that could all change tomorrow. For something like GPS tagging, the smartphone provides very little incremental value over what an integrated receiver can provide and is not worth the tradeoff (unless to complement the receiver as previously indicated). For other things, like remote control and posting to Instagram (i.e., that are interactive), the smartphone is a great solution.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/4/?tab=comments#comment-4041342", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": " 53 minutes ago, manicouagan1 said: the technical limitations were apparently not understood until the testing phase. by then i suspect that there was hope that the software team could solve the loss of connection problem with changes in the foto's application in the cell phone, camera or both.. obviously they did not. but with software there is always hope of a solution in another version if management will pay for it. a better approach would have been for leica to keep the integrated gps receiver and augment it with a smartphone connection. this would help ensure a reliable signal while outdoors (i.e., when persons are most likely to want gps -----> tagging !!! ) while also enabling -----> tagging !!!  in scenarios were a gps fix is not possible (indoors, under cover, etc.). it would have also enabled leica to work through connectivity issues without regressing functionality already found in the sl2's predecessor. at the sl2's price point, the added cost shouldn't have been an issue (or leica customers not likely sensitive to the added costs if passed on). as is often the case with software development, taking a dependency on external software or hardware leads to integration challenges. smartphones in particular are a challenge because they're a constantly moving target as major software updates are applied annually, and are subject to policy changes addressing privacy concerns and security threats. in other words, even if you have it working reliably today, that could all change tomorrow. for something like gps tagging, the smartphone provides very little incremental value over what an integrated receiver can provide and is not worth the tradeoff (unless to complement the receiver as previously indicated). for other things, like remote control and posting to instagram (i.e., that are interactive), the smartphone is a great solution.", "sortedWord": "None", "identifyer": 29685, "year": "2020"}, {"Unnamed: 0": 416687, "autor": "hotshew", "date": 1599585600000, "content": "5 hours ago, caissa said: With the SL many users commented that usually they turn gps off to save energy. Probably most users had it always turned off. Many commented that they would rather like IBIS than gps. Leica who listened to customers wishes therefore thought gps is not crucial and removed it. (It probably also made the camera cheaper, the SL2 is clearly less expensive than the SL was.) If you look at the comments in this forum, very few users complain about the missing gps. There were maybe more complaints about the missing 3rd dimension in the SL. If you really need it, there are several ways to solve the problem. One could be to use the old SL (with a control photo) to get the gps coordinates and at the same time as backup camera. (This is not convenient for hikers, but I wonder how many photographers reach their destination by car or other vehicle. Very few on foot.) It's harder to remove a feature than add one from customer satisfaction perspective. We can only speculate if Leica did their homework -- monitoring forum feedback is a helpful but insufficient. Regardless, just making my voice heard and there are clearly other customers who care about it. A few other comments: - Having IBIS and GPS is not mutually exclusive. People often turn off IBIS when mounting on a tripod. There's a time and place for everything. - Leica didn't remove the geotagging feature from the SL2. Rather, they replaced a reliable solution with an unreliable one. - Agreed there are ways to workaround the issue -- none as easy and good of an experience as in-camera tagging. - Less expensive is always nice, but I would have happily paid the extra $10-$30 USD (est.) on a $6K camera if cost was the reason for abandoning GPS. I can, of course, only speak for myself. Edited September 8, 2020 by hotshew", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/4/?tab=comments#comment-4042288", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "5 hours ago, caissa said: with the sl many users commented that usually they turn gps off to save energy. probably most users had it always turned off. many commented that they would rather like ibis than gps. leica who listened to customers wishes therefore thought gps is not crucial and removed it. (it probably also made the camera cheaper, the sl2 is clearly less expensive than the sl was.) if you look at the comments in this forum, very few users complain about the missing gps. there were maybe more complaints about the missing 3rd dimension in the sl. if you really need it, there are several ways to solve the problem. one could be to use the old sl (with a control photo) to get the gps coordinates and at the same time as backup camera. (this is not convenient for hikers, but i wonder how many photographers reach their destination by car or other vehicle. very few on foot.) it's harder to remove a feature than add one from customer satisfaction perspective. we can only speculate if leica did their homework -- monitoring forum feedback is a helpful but insufficient. regardless, just making my voice heard and there are clearly other customers who care about it. a few other comments: - having ibis and gps is not mutually exclusive. people often turn off ibis when mounting on a tripod. there's a time and place for everything. - leica didn't remove the geotagging feature from the sl2. rather, they replaced a reliable solution with an unreliable one. - agreed there are ways to workaround the issue -- none as easy and good of an experience as in-camera -----> tagging !!! . - less expensive is always nice, but i would have happily paid the extra $10-$30 usd (est.) on a $6k camera if cost was the reason for abandoning gps. i can, of course, only speak for myself. edited september 8, 2020 by hotshew", "sortedWord": "None", "identifyer": 29688, "year": "2020"}, {"Unnamed: 0": 416691, "autor": "hotshew", "date": 1599714600000, "content": "@caissa, you're assuming I'm unhappy with the camera (or at least that how I read it). Quite the contrary actually. The SL2 is perhaps the nicest and most versatile camera I've ever owned. The ergonomics and industrial design are second to none, except for possibly the X1D. IMO, of course. In fact, if the SL2 had a focusing system on par with Canon or Sony, and reliable GPS tagging 🙂, then I would consider it \"the perfect camera\". But such unicorns do not exist. I was aware the SL2 forwent a GPS receiver prior to purchase -- and that using a smartphone as a proxy is unreliable. GPS tagging was and still is not a deal breaker for me. Yes, complaining about lack of GPS tagging is a first world problem, as is anything having to do with the SL2 or Leica brand in general. The alternative is to shut-up and put-up, which I firmly believe would be disservice to Leica, assuming they're listening to their customers. Customers shouldn't have to \"work around\" problems. If you're working around the unreliable GPS tagging issue, then you're acknowledging the feature has value. Hopefully Leica will take this feedback and continuously improve so that they can stay relevant in an increasingly competitive marketplace. -Roland.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/4/?tab=comments#comment-4043107", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "@caissa, you're assuming i'm unhappy with the camera (or at least that how i read it). quite the contrary actually. the sl2 is perhaps the nicest and most versatile camera i've ever owned. the ergonomics and industrial design are second to none, except for possibly the x1d. imo, of course. in fact, if the sl2 had a focusing system on par with canon or sony, and reliable gps -----> tagging !!!  🙂, then i would consider it \"the perfect camera\". but such unicorns do not exist. i was aware the sl2 forwent a gps receiver prior to purchase -- and that using a smartphone as a proxy is unreliable. gps tagging was and still is not a deal breaker for me. yes, complaining about lack of gps tagging is a first world problem, as is anything having to do with the sl2 or leica brand in general. the alternative is to shut-up and put-up, which i firmly believe would be disservice to leica, assuming they're listening to their customers. customers shouldn't have to \"work around\" problems. if you're working around the unreliable gps tagging issue, then you're acknowledging the feature has value. hopefully leica will take this feedback and continuously improve so that they can stay relevant in an increasingly competitive marketplace. -roland.", "sortedWord": "None", "identifyer": 29692, "year": "2020"}, {"Unnamed: 0": 419477, "autor": "Jared", "date": 1589588400000, "content": " For those who are interested, Geo Tagging for the SL2 has been enabled via the latest release of Fotos. Here is how it works: 1) Make sure Bluetooth is enabled in your SL2 2) Turn on Fotos in your iPhone 3) Connect to your SL2 in Fotos 4) Press the “Remote” button in Fotos. The satellite icon should appear on your top plate and in your EVF. Pictures you take will now be tagged with GPS info, regardless of whether the picture is taken through Fotos or with the shutter release on the camera. Note that the connection between Fotos and the camera over WiFi must remain active for the geo tagging to work. The satellite data remains active for some seconds after you disconnect, but not minutes. Not the most elegant solution Inhave seen, but it does appear to work, and at least you can use the camera to release the shutter, not just Fotos. Wish it just required a low power Bluetooth connection and active Fotos connection.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/?tab=comments#comment-3974189", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": " for those who are interested, geo -----> tagging !!!  for the sl2 has been enabled via the latest release of fotos. here is how it works: 1) make sure bluetooth is enabled in your sl2 2) turn on fotos in your iphone 3) connect to your sl2 in fotos 4) press the “remote” button in fotos. the satellite icon should appear on your top plate and in your evf. pictures you take will now be tagged with gps info, regardless of whether the picture is taken through fotos or with the shutter release on the camera. note that the connection between fotos and the camera over wifi must remain active for the geo tagging to work. the satellite data remains active for some seconds after you disconnect, but not minutes. not the most elegant solution inhave seen, but it does appear to work, and at least you can use the camera to release the shutter, not just fotos. wish it just required a low power bluetooth connection and active fotos connection.", "sortedWord": "None", "identifyer": 32489, "year": "2020"}, {"Unnamed: 0": 419478, "autor": "meerec", "date": 1589595540000, "content": "The clunkiest and most useless or least useable implementation of tagging I’ve seen in modern cameras. I can imagine using it occasionally for landscape shooting when I have all the time in the world, otherwise it’s just inconvenient and senseless. Leica failed here by removing the GPS unit from SL2 while Hasselblad added the same to its X1D II. Disappointing on Leica part.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/?tab=comments#comment-3974230", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "the clunkiest and most useless or least useable implementation of -----> tagging !!!  i’ve seen in modern cameras. i can imagine using it occasionally for landscape shooting when i have all the time in the world, otherwise it’s just inconvenient and senseless. leica failed here by removing the gps unit from sl2 while hasselblad added the same to its x1d ii. disappointing on leica part.", "sortedWord": "None", "identifyer": 32490, "year": "2020"}, {"Unnamed: 0": 419479, "autor": "Jared", "date": 1589610420000, "content": "4 hours ago, meerec said: The clunkiest and most useless or least useable implementation of tagging I’ve seen in modern cameras. I can imagine using it occasionally for landscape shooting when I have all the time in the world, otherwise it’s just inconvenient and senseless. Leica failed here by removing the GPS unit from SL2 while Hasselblad added the same to its X1D II. Disappointing on Leica part. The first implementation on the Q2 was even worse—requiring the shutter to be released within Fotos. Yes, it’s clunky enough that I can’t imagine actually using it for anything. Easier to just whip out my iPhone and take a pic with it, then transfer the geo tag into the Leica images after the fact in software. That would, literally, be easier.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/?tab=comments#comment-3974301", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "4 hours ago, meerec said: the clunkiest and most useless or least useable implementation of -----> tagging !!!  i’ve seen in modern cameras. i can imagine using it occasionally for landscape shooting when i have all the time in the world, otherwise it’s just inconvenient and senseless. leica failed here by removing the gps unit from sl2 while hasselblad added the same to its x1d ii. disappointing on leica part. the first implementation on the q2 was even worse—requiring the shutter to be released within fotos. yes, it’s clunky enough that i can’t imagine actually using it for anything. easier to just whip out my iphone and take a pic with it, then transfer the geo tag into the leica images after the fact in software. that would, literally, be easier.", "sortedWord": "None", "identifyer": 32491, "year": "2020"}, {"Unnamed: 0": 419499, "autor": "scott kirkpatrick", "date": 1589874120000, "content": "We're all trying to say what would make Geo-tagging work better for US. We seem to care about reliability, getting an accurate fix within a short time after waking up the camera, not having to keep multiple devices in the right and not obvious active state, and battery power. Our battery power limits seem to be carrying one extra battery and shooting over part of a day, recharging at night. That makes sense. Now how do we make our arguments match up with the priorities of Mr. Stefan Daniel and his team in Wetzlar? They probably want to see Leica Camera AG produce and maintain products that bring in enough revenue at a low enough cost to keep Mr Kaufmann and his heirs happy, so that they do not retreat to Salzburg, leaving behind an empty palace like the elegant buildings Hasselblad abandoned a few years ago in Gothenburg. And each of them is responsible for the continued employment of a fair number of people who are Leica's institutional memory. In this framework, it is possible to see why Fotos is doing the following: Write one app, which talks to a consistent interface for BT and WiFi in each camera line. I hope they are doing this in Wetzlar, where the camera engineers can talk to the app programmers, but the temptation to let it all get done by contractors in India must have been strong. Every country has a ministry of communications that only lets products be shipped into their country if they don't endanger the nation, so stick to standard chips with embedded firmware and protocols that have international acceptance. (I lost 2 months during a beta test once in such a ministry because I failed to let them think that this was just an existing product on loan.) Let the phone makers (Samsung, Motorola, HuaWei, etc) deal with the complexity of writing GPS and localization code that is fast and accurate yet still complies with national requirements not to operate too close to borders, reeducation centers in the far west, or sensitive military institutions. Then work with whatever smart phones achieve worldwide distribution. I think the next iteration will be improvements in camera firmware, not just to keep the interfaces fully standard (and standards are multifold, and evolving, so it may be necessary to get them all to a common standard standard). We can help by providing details of cases where different cameras seem to work differently, or different phones make this easy or hard. We also can help by sharing what has to be done at the phone to make connection work in fewer tries and to keep the localization interface alive while moving around. Leica is risking its reputation for only doing things in a simple, \"right\" way by allowing a public beta, and we can help if we keep their needs in mind as well as our own.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/page/2/?tab=comments#comment-3976267", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "we're all trying to say what would make geo------> tagging !!!  work better for us. we seem to care about reliability, getting an accurate fix within a short time after waking up the camera, not having to keep multiple devices in the right and not obvious active state, and battery power. our battery power limits seem to be carrying one extra battery and shooting over part of a day, recharging at night. that makes sense. now how do we make our arguments match up with the priorities of mr. stefan daniel and his team in wetzlar? they probably want to see leica camera ag produce and maintain products that bring in enough revenue at a low enough cost to keep mr kaufmann and his heirs happy, so that they do not retreat to salzburg, leaving behind an empty palace like the elegant buildings hasselblad abandoned a few years ago in gothenburg. and each of them is responsible for the continued employment of a fair number of people who are leica's institutional memory. in this framework, it is possible to see why fotos is doing the following: write one app, which talks to a consistent interface for bt and wifi in each camera line. i hope they are doing this in wetzlar, where the camera engineers can talk to the app programmers, but the temptation to let it all get done by contractors in india must have been strong. every country has a ministry of communications that only lets products be shipped into their country if they don't endanger the nation, so stick to standard chips with embedded firmware and protocols that have international acceptance. (i lost 2 months during a beta test once in such a ministry because i failed to let them think that this was just an existing product on loan.) let the phone makers (samsung, motorola, huawei, etc) deal with the complexity of writing gps and localization code that is fast and accurate yet still complies with national requirements not to operate too close to borders, reeducation centers in the far west, or sensitive military institutions. then work with whatever smart phones achieve worldwide distribution. i think the next iteration will be improvements in camera firmware, not just to keep the interfaces fully standard (and standards are multifold, and evolving, so it may be necessary to get them all to a common standard standard). we can help by providing details of cases where different cameras seem to work differently, or different phones make this easy or hard. we also can help by sharing what has to be done at the phone to make connection work in fewer tries and to keep the localization interface alive while moving around. leica is risking its reputation for only doing things in a simple, \"right\" way by allowing a public beta, and we can help if we keep their needs in mind as well as our own.", "sortedWord": "None", "identifyer": 32511, "year": "2020"}, {"Unnamed: 0": 431691, "autor": "HuntingSand", "date": 1598395620000, "content": "I'm a big fan of GPS tagging. I go all over the place (the world, really), and really appreciate retracing my steps in post production. The Viso of my TL2 has it, and so does my S camera. The SL had it, too, but for one reason or other it got dropped for the SL2. And no, it's not a firmware thing, this is an actual piece of hardware (chip, etc.) which requires calibration and opens up (in certain countries and locations) an interesting can of legal worms.", "link": "https://www.l-camera-forum.com/topic/312548-gps/?tab=comments#comment-4033365", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "i'm a big fan of gps -----> tagging !!! . i go all over the place (the world, really), and really appreciate retracing my steps in post production. the viso of my tl2 has it, and so does my s camera. the sl had it, too, but for one reason or other it got dropped for the sl2. and no, it's not a firmware thing, this is an actual piece of hardware (chip, etc.) which requires calibration and opens up (in certain countries and locations) an interesting can of legal worms.", "sortedWord": "None", "identifyer": 44852, "year": "2020"}], "name": "taggingL-Forum2020"}