{"interestingcomments": [{"Unnamed: 0": 360973, "autor": "wilfredo", "date": 1356129720000, "content": "Lots of wonderful shots here like the one above. Excellent tones and IQ. Thank you all for posting. I can see that this digital M produces slightly sharper images than the M9 but convinced that my M8 can easily compete, except of course with regards to file size and inferior ISO at the higher numbers. Other than that, not much different -- which to me means that Leica's signature stamp remains pretty much the same. The price tag is another matter. Having said that, if it were within my means, I would purchase one! Edited December 21, 2012 by wilfredo", "link": "https://www.l-camera-forum.com/topic/188046-leica-monochrom-type-1-shots-post-them-here/page/16/?tab=comments#comment-2195074", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "lots of wonderful shots here like the one above. excellent tones and iq. thank you all for posting. i can see that this digital m produces slightly sharper images than the m9 but convinced that my m8 can easily compete, except of course with regards to file size and inferior iso at the higher numbers. other than that, not much different -- which to me means that leica's signature stamp remains pretty much the same. the price -----> tag !!!  is another matter. having said that, if it were within my means, i would purchase one! edited december 21, 2012 by wilfredo", "sortedWord": "None", "identifyer": 22193, "year": "2012"}, {"Unnamed: 0": 371451, "autor": "dwbell", "date": 1351236960000, "content": "Not one to shy away from flogging any horse, even dead ones! Does the in camera amplification actually \"apply\" the amplification with increased ISO or does it tag the file to receive a boost in the raw convertor? (A poor comparison would be in camera jpeg sharpening) What I'm getting at is if I expose a shot at 1/60 f/4 ISO 800 and there appears to be clipping of highlights, are they actually clipped, gone? Exposing the same shot at ISO200 would \"look\" two stops under on the LCD but would it contain information in the highlight areas that the ISO 800 shot.", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/11/?tab=comments#comment-2151060", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "not one to shy away from flogging any horse, even dead ones! does the in camera amplification actually \"apply\" the amplification with increased iso or does it -----> tag !!!  the file to receive a boost in the raw convertor? (a poor comparison would be in camera jpeg sharpening) what i'm getting at is if i expose a shot at 1/60 f/4 iso 800 and there appears to be clipping of highlights, are they actually clipped, gone? exposing the same shot at iso200 would \"look\" two stops under on the lcd but would it contain information in the highlight areas that the iso 800 shot.", "sortedWord": "None", "identifyer": 32752, "year": "2012"}, {"Unnamed: 0": 384586, "autor": "cbretteville", "date": 1341342900000, "content": "Thanks for posting this LCT, I heard rumors a couple of years ago of this existing but didn't know the key sequence, then forgot about it. It works on my upgraded M8 too. As with the ImageUniqueID the number in the Body debug data/num exposures count does not reflect a replaced shutter. In fact I'll vager a beer on the number being shown here being the source for what is stored in the ImageUniqueID tag in the exif block. This info actually confirms a lot of the research I did in 2007 and presented in my metadata paper. That feels OK. Had I known that trick while doing the research I could probably have done it in less than half the time, but it wouldn't have been quite as much fun.... Carl", "link": "https://www.l-camera-forum.com/topic/178936-m8-shutter-actuation-count/page/2/?tab=comments#comment-2054677", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "thanks for posting this lct, i heard rumors a couple of years ago of this existing but didn't know the key sequence, then forgot about it. it works on my upgraded m8 too. as with the imageuniqueid the number in the body debug data/num exposures count does not reflect a replaced shutter. in fact i'll vager a beer on the number being shown here being the source for what is stored in the imageuniqueid -----> tag !!!  in the exif block. this info actually confirms a lot of the research i did in 2007 and presented in my metadata paper. that feels ok. had i known that trick while doing the research i could probably have done it in less than half the time, but it wouldn't have been quite as much fun.... carl", "sortedWord": "None", "identifyer": 45989, "year": "2012"}, {"Unnamed: 0": 394657, "autor": "farnz", "date": 1346745900000, "content": "Pete, I really like this photo - most beautiful rendering of the Sonnar as well! ... THank you, Dirk.--img--  ... the 85/1.5 ... has the most beautiful Sonnar rendering, I have ever seen. ... Is the 85/1.5 a Sonnar? I'm not questioning your knowledge I just mentally had it tagged as an Ernostat. Pete.", "link": "https://www.l-camera-forum.com/topic/268173-the-view-through-older-glass/page/2/?tab=comments#comment-2104466", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "pete, i really like this photo - most beautiful rendering of the sonnar as well! ... thank you, dirk.--img--  ... the 85/1.5 ... has the most beautiful sonnar rendering, i have ever seen. ... is the 85/1.5 a sonnar? i'm not questioning your knowledge i just mentally had it -----> tagged !!!  as an ernostat. pete.", "sortedWord": "None", "identifyer": 7124, "year": "2012"}, {"Unnamed: 0": 394658, "autor": "menos I M6", "date": 1346752020000, "content": "THank you, Dirk.--img--  Is the 85/1.5 a Sonnar? I'm not questioning your knowledge I just mentally had it tagged as an Ernostat. Pete. Yes, it is a Sonnar design - I love fast Sonnar lenses! Here is another favorite Sonnar lens of mine - the Canon 100 f2 LTM from the late 60's: --img-- Le Mans 24h 2012 - no.2 Audi Sport Team Joest - Audi R18 e-tron Quattro by teknopunk.com, on Flickr", "link": "https://www.l-camera-forum.com/topic/268173-the-view-through-older-glass/page/2/?tab=comments#comment-2104528", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "thank you, dirk.--img--  is the 85/1.5 a sonnar? i'm not questioning your knowledge i just mentally had it -----> tagged !!!  as an ernostat. pete. yes, it is a sonnar design - i love fast sonnar lenses! here is another favorite sonnar lens of mine - the canon 100 f2 ltm from the late 60's: --img-- le mans 24h 2012 - no.2 audi sport team joest - audi r18 e-tron quattro by teknopunk.com, on flickr", "sortedWord": "None", "identifyer": 7125, "year": "2012"}], "name": "tagL-Forum2012"}