{"interestingcomments": [{"Unnamed: 0": 356039, "autor": "mby", "date": 1297073100000, "content": "Question: Adobe Lightroom shows lens type and aperture of photos taken with M9, but other products like Apple Aperture do not do this; how to fix this shortcoming? Answer: Adobe Lightroom (and DNG Converter) interpret Leica's custom coding; said coding is not part of the standardized EXIF tags but included in the vendor-specific MakerNotes, like here for Leica/Panasonic. The information about the lens used is available in the attribute Leica:LensType, the aperture used is not directly available, due to lack of coupling between aperture blades in the lens and the camera writing the EXIF, instead the M9 (and M8) are estimating the aperture by indirect measurement via the 'blue dot'; this estimate is available at Leica:ApproximateFNumber. Here is an example: ---- Leica ---- LensType: Noctilux-M 50mm f/1 ApproximateFNumber: 0.0 Apple's Aperture is displaying the standard EXIF attributes Lens and ApertureValue, which are left empty by Leica, so Aperture is not wrong here. In order to get the information accessible, you can use an EXIF editor like EXIFtool and convert LensType into Lens and ApproximateFNumber into ApertureValue; for EXIFtool, the statement (for MacOS Terminal app) is exiftool -tagsfromfile @ '-xmp-aux:Lens<LensType' -tagsfromfile @ '-xmp-exif:ApertureValue<ApproximateFNumber' -ext .DNG -r followed by the respective file or directory. If you have all your photos to be imported in a folder <folder> and would like to get all of them converted without creating additional copies, you should type exiftool -overwrite_original_in_place -tagsfromfile @ '-xmp-aux:Lens<LensType' -tagsfromfile @ '-xmp-exif:ApertureValue<ApproximateFNumber' -P -ext .DNG -r into Apple's Terminal app and then drag that very Folder <folder> onto the Terminal windows (which inserts the correct link to said folder automatically. Further information and interesting reading can be found here: http://www.l-camera-forum.com/leica-forum/digital-post-processing-forum/117334-aperture-3-0-1-metadata-information.html", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/3/?tab=comments#comment-2464089", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "question: adobe lightroom shows lens type and aperture of photos taken with m9, but other products like apple aperture do not do this; how to fix this shortcoming? answer: adobe lightroom (and dng converter) interpret leica's custom coding; said coding is not part of the standardized exif -----> tags !!!  but included in the vendor-specific makernotes, like here for leica/panasonic. the information about the lens used is available in the attribute leica:lenstype, the aperture used is not directly available, due to lack of coupling between aperture blades in the lens and the camera writing the exif, instead the m9 (and m8) are estimating the aperture by indirect measurement via the 'blue dot'; this estimate is available at leica:approximatefnumber. here is an example: ---- leica ---- lenstype: noctilux-m 50mm f/1 approximatefnumber: 0.0 apple's aperture is displaying the standard exif attributes lens and aperturevalue, which are left empty by leica, so aperture is not wrong here. in order to get the information accessible, you can use an exif editor like exiftool and convert lenstype into lens and approximatefnumber into aperturevalue; for exiftool, the statement (for macos terminal app) is exiftool -tagsfromfile @ '-xmp-aux:lens<lenstype' -tagsfromfile @ '-xmp-exif:aperturevalue<approximatefnumber' -ext .dng -r followed by the respective file or directory. if you have all your photos to be imported in a folder <folder> and would like to get all of them converted without creating additional copies, you should type exiftool -overwrite_original_in_place -tagsfromfile @ '-xmp-aux:lens<lenstype' -tagsfromfile @ '-xmp-exif:aperturevalue<approximatefnumber' -p -ext .dng -r into apple's terminal app and then drag that very folder <folder> onto the terminal windows (which inserts the correct link to said folder automatically. further information and interesting reading can be found here: http://www.l-camera-forum.com/leica-forum/digital-post-processing-forum/117334-aperture-3-0-1-metadata-information.html", "sortedWord": "None", "identifyer": 17205, "year": "2011"}], "name": "tagL-Forum2011"}