{"interestingcomments": [{"Unnamed: 0": 205711, "autor": "scott kirkpatrick", "date": 1485285900000, "content": "@Chris -- thanks for posting these. Your files look quite like the files obtained from DPReview and the ones that Leica provides as demonstration shots for the M10. They are different from the two files that Tobers took away from the store with him on his SD card and uploaded directly to a website. They have a lot more Adobe stuff in them. There's a tag Software: \"1.0.1.0\" in the Tobers files, identifying the firmware. In your files, that tag says Software: \"Adobe Photoshop Lightroom 6.8 (Windows)\" . Your files have two time stamps. For example, xmp:ModifyDate=\"2017-01-24T15:35:20.763+00:00\" xmp:CreateDate=\"2017-01-24T14:54:57\" Now, (in my best police accent) please tell us what was your data doing on or about 15:35:20 on the 24th of January, 2017? This will help us identify the source of the extra xmp information. Sandy's theory is that it might be done by Leica if you read it out over a tether or by WiFi. Another possibility is that you slid the chip into your laptop and Light Room's ingestor grabbed the files and put them into its DAM files, adding a few helpful things along the way. scott Edited January 24, 2017 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/page/6/?tab=comments#comment-3195947", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "@chris -- thanks for posting these. your files look quite like the files obtained from dpreview and the ones that leica provides as demonstration shots for the m10. they are different from the two files that tobers took away from the store with him on his sd card and uploaded directly to a website. they have a lot more adobe stuff in them. there's a -----> tag !!!  software: \"1.0.1.0\" in the tobers files, identifying the firmware. in your files, that tag says software: \"adobe photoshop lightroom 6.8 (windows)\" . your files have two time stamps. for example, xmp:modifydate=\"2017-01-24t15:35:20.763+00:00\" xmp:createdate=\"2017-01-24t14:54:57\" now, (in my best police accent) please tell us what was your data doing on or about 15:35:20 on the 24th of january, 2017? this will help us identify the source of the extra xmp information. sandy's theory is that it might be done by leica if you read it out over a tether or by wifi. another possibility is that you slid the chip into your laptop and light room's ingestor grabbed the files and put them into its dam files, adding a few helpful things along the way. scott edited january 24, 2017 by scott kirkpatrick", "sortedWord": "None", "identifyer": 99189, "year": "2017"}, {"Unnamed: 0": 205721, "autor": "scott kirkpatrick", "date": 1485343380000, "content": "Chris, thanks. Your flower set of files are all smaller (average around 28 MB while the kitchen shots were all over 30 MB). Not all of that is less metadata, since high ISO files have a lot more noise which doesn't compress well. But all of this morning's files have only the 10 line template that gets expanded once the file is read into LightRoom. So these are the files that any other program would be dealing with. In particular, the lines in which the noise handling recommendations are spelled out that were seen in the earlier files have not appeared at this point. Incidentally, your firmware says \"1.0.2.0\" while Tober's (from a demo camera) was identified as 1.0.1.0. That tag gets replaced by Adobe's identifier when the file has been touched by LightRoom, so the firmware may be evolving continuously as shipments go out. scott Edited January 25, 2017 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/268528-m10-the-image-thread/page/6/?tab=comments#comment-3196397", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "chris, thanks. your flower set of files are all smaller (average around 28 mb while the kitchen shots were all over 30 mb). not all of that is less metadata, since high iso files have a lot more noise which doesn't compress well. but all of this morning's files have only the 10 line template that gets expanded once the file is read into lightroom. so these are the files that any other program would be dealing with. in particular, the lines in which the noise handling recommendations are spelled out that were seen in the earlier files have not appeared at this point. incidentally, your firmware says \"1.0.2.0\" while tober's (from a demo camera) was identified as 1.0.1.0. that -----> tag !!!  gets replaced by adobe's identifier when the file has been touched by lightroom, so the firmware may be evolving continuously as shipments go out. scott edited january 25, 2017 by scott kirkpatrick", "sortedWord": "None", "identifyer": 99199, "year": "2017"}, {"Unnamed: 0": 340287, "autor": "Simon", "date": 1497148260000, "content": "Great choice and colour Erik! If you can manage to spring for the shoulder pad and name tag in tan it really sets it off!", "link": "https://www.l-camera-forum.com/topic/268434-what-bag-for-the-m10/page/11/?tab=comments#comment-3293040", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "great choice and colour erik! if you can manage to spring for the shoulder pad and name -----> tag !!!  in tan it really sets it off!", "sortedWord": "None", "identifyer": 1354, "year": "2017"}, {"Unnamed: 0": 340331, "autor": "Eoin", "date": 1510183140000, "content": "I have a new found fetish for ONA leather bags --img--  . It all started with a leather Union Street as my daily work brief case carrying a 15\" MacBook Pro and 12\" iPad Pro and whatever else photography I cared to put in there. It is without doubt an expensive bag at full tag price but given the offer I found it at, it has proved to be a wonderful stylish and hard wearing daily carry for the past 2 years. I then found an immaculate, but very cheap Leather Princess St on eBay and that was used for my camera & lenses at the weekend, Not as large as the Union St, but still capable of carrying Leica or Sony setups with plenty of room. The only thing I don't like about it is the open 2 front pockets (less secure and the fact there is no side pockets. Overall the bag is lacking in any storage dedicated to cards, leads or batteries. Rather just two large pockets and a document slip back pocket. I also found a very cheap ONA Berlin II Leica edition on eBay and that has become my preferred weekend bag. A smaller version of my Union St with all the organisation I've been accustomed to with that bag. Zipped front pocket and 2 slip side pockets and the slip rear document pocket. Not as roomy as the Princess St, but Ideal as a Leica + 2/3 Lenses and plenty of accessories and personal stuff. In answer to your question, the Princess St could easily carry Q, M10 with lens attached and another lens. Everything else you add after that iPad, cards, battery, leads, personal items will just add to the bulk.", "link": "https://www.l-camera-forum.com/topic/268434-what-bag-for-the-m10/page/13/?tab=comments#comment-3392039", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i have a new found fetish for ona leather bags --img--  . it all started with a leather union street as my daily work brief case carrying a 15\" macbook pro and 12\" ipad pro and whatever else photography i cared to put in there. it is without doubt an expensive bag at full -----> tag !!!  price but given the offer i found it at, it has proved to be a wonderful stylish and hard wearing daily carry for the past 2 years. i then found an immaculate, but very cheap leather princess st on ebay and that was used for my camera & lenses at the weekend, not as large as the union st, but still capable of carrying leica or sony setups with plenty of room. the only thing i don't like about it is the open 2 front pockets (less secure and the fact there is no side pockets. overall the bag is lacking in any storage dedicated to cards, leads or batteries. rather just two large pockets and a document slip back pocket. i also found a very cheap ona berlin ii leica edition on ebay and that has become my preferred weekend bag. a smaller version of my union st with all the organisation i've been accustomed to with that bag. zipped front pocket and 2 slip side pockets and the slip rear document pocket. not as roomy as the princess st, but ideal as a leica + 2/3 lenses and plenty of accessories and personal stuff. in answer to your question, the princess st could easily carry q, m10 with lens attached and another lens. everything else you add after that ipad, cards, battery, leads, personal items will just add to the bulk.", "sortedWord": "None", "identifyer": 1398, "year": "2017"}, {"Unnamed: 0": 348563, "autor": "pico", "date": 1502238780000, "content": "Oh, by all means leave the price tag hanging off it. --img-- ", "link": "https://www.l-camera-forum.com/topic/275518-which-accessorys-to-get/?tab=comments#comment-3333121", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "oh, by all means leave the price -----> tag !!!  hanging off it. --img-- ", "sortedWord": "None", "identifyer": 9664, "year": "2017"}, {"Unnamed: 0": 377940, "autor": "Archiver", "date": 1510126020000, "content": "For bags, it is hard to go wrong with a Billingham Hadley Pro. If the computer is slim (like the latest MB Pro) it will fit. A black or darker color is quite discrete and they age beautifully. I really, really wanted to like my Hadley Pro because it is beautiful, sturdy, and cost a chunk of money. But it just didn't go with my preferred method of working, nor did it feel that comfortable on my shoulder. I carry at least two cameras, one compact and one larger, usually a rangefinder or mirrorless camera. The compact goes in the front of my bag and I want to be able to access it instantly at any time. And if I'm out, I like to be able to stow the larger camera at a moments notice, like the first touch of rain or seeing some unsavoury people ahead. The Hadley Pro design makes this difficult. The front pockets are buttoned, and are covered by the main flap, so keeping a compact camera secure in the front pocket means snapping a button shut. And keeping the main compartment secure means having to seal the buckle straps, which adds another layer of stuff to get through before being able to unsnap a front pocket. And to stash a larger camera inside, I have to unsnap the buckle straps, pull across the flap, drop in the camera, pull the flap back into place and seal it up again. Whereas with a zippered bag, there is no flap to get in the way, nor am I fiddling with two buckle straps. If you want to carry the bag by the handle, it must be properly cinched up or the bag - and potentially contents - flop around. And for some reason, even with the shoulder pad, the strap seems to dig into my shoulder. Maybe it's because it's not that wide, and the weight isn't spread across a larger area. The padded insert means that the bag doesn't mould to the contours of your body, either. I've tried taking out the insert but this just makes the bag floppy and lack any kind of structure. It's so aggravating. Not to mention the first world problem of mistaken baggage: I had my Hadley Pro in a camera shop that specialized in Leica gear. Two other customers also carried Hadley Pros, and they put them on a chair. It suddenly occurred to me that if I put mine near them, they might accidentally take it. I'd have to customize it somehow with ribbons or tassels or big colourful luggage tags, just to make it obvious that it wasn't theirs. I still have the Hadley Pro and I use it on very rare occasions, mainly to convince myself that I didn't waste my money.", "link": "https://www.l-camera-forum.com/topic/277761-everyday-bag/?tab=comments#comment-3391420", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "for bags, it is hard to go wrong with a billingham hadley pro. if the computer is slim (like the latest mb pro) it will fit. a black or darker color is quite discrete and they age beautifully. i really, really wanted to like my hadley pro because it is beautiful, sturdy, and cost a chunk of money. but it just didn't go with my preferred method of working, nor did it feel that comfortable on my shoulder. i carry at least two cameras, one compact and one larger, usually a rangefinder or mirrorless camera. the compact goes in the front of my bag and i want to be able to access it instantly at any time. and if i'm out, i like to be able to stow the larger camera at a moments notice, like the first touch of rain or seeing some unsavoury people ahead. the hadley pro design makes this difficult. the front pockets are buttoned, and are covered by the main flap, so keeping a compact camera secure in the front pocket means snapping a button shut. and keeping the main compartment secure means having to seal the buckle straps, which adds another layer of stuff to get through before being able to unsnap a front pocket. and to stash a larger camera inside, i have to unsnap the buckle straps, pull across the flap, drop in the camera, pull the flap back into place and seal it up again. whereas with a zippered bag, there is no flap to get in the way, nor am i fiddling with two buckle straps. if you want to carry the bag by the handle, it must be properly cinched up or the bag - and potentially contents - flop around. and for some reason, even with the shoulder pad, the strap seems to dig into my shoulder. maybe it's because it's not that wide, and the weight isn't spread across a larger area. the padded insert means that the bag doesn't mould to the contours of your body, either. i've tried taking out the insert but this just makes the bag floppy and lack any kind of structure. it's so aggravating. not to mention the first world problem of mistaken baggage: i had my hadley pro in a camera shop that specialized in leica gear. two other customers also carried hadley pros, and they put them on a chair. it suddenly occurred to me that if i put mine near them, they might accidentally take it. i'd have to customize it somehow with ribbons or tassels or big colourful luggage -----> tags !!! , just to make it obvious that it wasn't theirs. i still have the hadley pro and i use it on very rare occasions, mainly to convince myself that i didn't waste my money.", "sortedWord": "None", "identifyer": 39255, "year": "2017"}, {"Unnamed: 0": 391378, "autor": "almoore", "date": 1504774680000, "content": "I was told last year by the service guy at Leica UK that Wetzlar had introduced a policy where any repair or service request would involve a mandatory CLA at around £600 or so. There are a number of anecdotal stories in this forum that back that up... There's a strange sense of unreality that's clouded Leica ownership in recent times - at least if this forum is representative - and I guess it's understandable that the company are attempting to tap into it. There are obviously people who find Leica's recent aggressiveness on pricing reassuring, as shown by the howls of outrage when the SL price dropped and 'devalued their investments'. Right now, over on the TL forum there's a guy claiming that the 35mm Summilux can't be considered anything other than a 'consumer level' lens due to its apparently modest $2,500 price tag. It's fantasy land. It's possible that this is a good long-term strategy for Leica, but in the event of another financial crash they might find themselves regretting the loss of their more traditional user base. Edited September 7, 2017 by almoore", "link": "https://www.l-camera-forum.com/topic/275842-i-burnt-through-my-shutter-cloth/page/4/?tab=comments#comment-3353919", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i was told last year by the service guy at leica uk that wetzlar had introduced a policy where any repair or service request would involve a mandatory cla at around £600 or so. there are a number of anecdotal stories in this forum that back that up... there's a strange sense of unreality that's clouded leica ownership in recent times - at least if this forum is representative - and i guess it's understandable that the company are attempting to tap into it. there are obviously people who find leica's recent aggressiveness on pricing reassuring, as shown by the howls of outrage when the sl price dropped and 'devalued their investments'. right now, over on the tl forum there's a guy claiming that the 35mm summilux can't be considered anything other than a 'consumer level' lens due to its apparently modest $2,500 price -----> tag !!! . it's fantasy land. it's possible that this is a good long-term strategy for leica, but in the event of another financial crash they might find themselves regretting the loss of their more traditional user base. edited september 7, 2017 by almoore", "sortedWord": "None", "identifyer": 3835, "year": "2017"}, {"Unnamed: 0": 406661, "autor": "reddot925", "date": 1495811400000, "content": "For what's it worth, I ordered Thorsten Overgaard's hood for the Summilux Black Chrome and couldn't be happier, once I got over the price tag of course.", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/9/?tab=comments#comment-3283176", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "for what's it worth, i ordered thorsten overgaard's hood for the summilux black chrome and couldn't be happier, once i got over the price -----> tag !!!  of course.", "sortedWord": "None", "identifyer": 19442, "year": "2017"}, {"Unnamed: 0": 406663, "autor": "MarkP", "date": 1495861440000, "content": "For what's it worth, I ordered Thorsten Overgaard's hood for the Summilux Black Chrome and couldn't be happier, once I got over the price tag of course. Were you happy with the quality and finish of the hood?", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/9/?tab=comments#comment-3283521", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "for what's it worth, i ordered thorsten overgaard's hood for the summilux black chrome and couldn't be happier, once i got over the price -----> tag !!!  of course. were you happy with the quality and finish of the hood?", "sortedWord": "None", "identifyer": 19444, "year": "2017"}, {"Unnamed: 0": 422159, "autor": "Steve McGarrett", "date": 1511201520000, "content": "Investing 700 € to be able to properly use 10 R lenses is not the same as for one lens. Even more so if the majority of those 10 lenses are ROM. By the way currently the SL + R-Adapter L is almost 1.000 Euros cheaper than the R9 + DMR was and that without adjusting to the inflation rate. Of course, it was just a joke. Still, it's way overpriced, surely it makes sense if you have many lenses (unfortunately indeed I've just ordered one..) but price tag is outrageously high for something without optical glass into it. Edited November 20, 2017 by Steve McGarrett", "link": "https://www.l-camera-forum.com/topic/271825-leica-r-adapter-just-a-tube/page/3/?tab=comments#comment-3399620", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "investing 700 € to be able to properly use 10 r lenses is not the same as for one lens. even more so if the majority of those 10 lenses are rom. by the way currently the sl + r-adapter l is almost 1.000 euros cheaper than the r9 + dmr was and that without adjusting to the inflation rate. of course, it was just a joke. still, it's way overpriced, surely it makes sense if you have many lenses (unfortunately indeed i've just ordered one..) but price -----> tag !!!  is outrageously high for something without optical glass into it. edited november 20, 2017 by steve mcgarrett", "sortedWord": "None", "identifyer": 35199, "year": "2017"}, {"Unnamed: 0": 443535, "autor": "etk", "date": 1493663520000, "content": "I would say that the bigger concern as regards it being a \"point and shoot\" would be the price tag! Why would anyone who wants a point and shoot even look at a camera like this?", "link": "https://www.l-camera-forum.com/topic/272045-will-i-regret-selling-my-leica-q/?tab=comments#comment-3266467", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i would say that the bigger concern as regards it being a \"point and shoot\" would be the price -----> tag !!! ! why would anyone who wants a point and shoot even look at a camera like this?", "sortedWord": "None", "identifyer": 6916, "year": "2017"}], "name": "tagL-Forum2017"}