{"interestingcomments": [{"Unnamed: 0": 206241, "autor": "Knipsknecht", "date": 1618409100000, "content": "Hmm, never had an issue with the bottom plate (actually I've gotten used to it). I never felt the need of an IBIS even though I had a pretty good one back in the day when I was shooting Olympus gear. 36 MP is nice but definitely not a must. Think I can wait until it's not longer a rumor but a real camera. Then I will have a look (especially on the price tag) and decide if I will upgrade from my M10 or not.", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/?tab=comments#comment-4181131", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "hmm, never had an issue with the bottom plate (actually i've gotten used to it). i never felt the need of an ibis even though i had a pretty good one back in the day when i was shooting olympus gear. 36 mp is nice but definitely not a must. think i can wait until it's not longer a rumor but a real camera. then i will have a look (especially on the price -----> tag !!! ) and decide if i will upgrade from my m10 or not.", "sortedWord": "None", "identifyer": 99760, "year": "2021"}, {"Unnamed: 0": 206474, "autor": "Martin B", "date": 1619031840000, "content": "To answer the question of the thread \"Leica M11 - Your next camera?\" - very likely no just assuming the price tag will remain about $8K for a new Leica M. The M10-R remains the most attractive to me regarding the rumored specs of the M11. Since even with the potential release of the M11 the M10-R price tag will stay too high for my taste, I will keep shooting with my M 240 for years to come.", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/page/13/?tab=comments#comment-4186114", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "to answer the question of the thread \"leica m11 - your next camera?\" - very likely no just assuming the price -----> tag !!!  will remain about $8k for a new leica m. the m10-r remains the most attractive to me regarding the rumored specs of the m11. since even with the potential release of the m11 the m10-r price tag will stay too high for my taste, i will keep shooting with my m 240 for years to come.", "sortedWord": "None", "identifyer": 99993, "year": "2021"}, {"Unnamed: 0": 338942, "autor": "Adam Bonn", "date": 1619042280000, "content": "5 hours ago, Steven said: I’ve always been intrigued by this way of shooting. I understand there is no disadvantage compared to auto iso (capped at 1600, like me), but is there rang advantage to this ? On older sensors, \"ISO\" (aka signal amplification) was performed pre-ADC (analogue to digital conversion) Kinda like the RAW software on your computer was given a recipe with the RAW file that indicated how much it needed brightening as it was demosaiced. If you under exposed in camera, then you got noise. If you then brightened that image in LR/PS/whatever you amplified the noise to a level that was worse than if you'd told the camera to brighten the image at time of capture Modern sensors are known as ISO invariant. Which means there's no pre-ADC amplification at all, which means push it x stops on the ISO dial or push it x stops on the exposure slider in front of your computer = all roads lead to Rome. But that said, there's often still tags/instructions in the RAW that say (sic) things to the RAW software like if the ISO is >x, then apply z amount of NR. So under exposing in camera and sorting it all out in post can leave you a little more in control of the NR process. But you're not going to see a night and day difference between doing one or the other on a modern camera. There's a slight complication that some sensors have dual gain, which means two levels of amplification (Sony sensors IIRC), with a swap at iso800 or whatever, so it can sometimes pay to be mindful of the cut over point... But really this is just geeky stuff and it doesn't really matter (the photo does not the camera setting) It's a little bit like the SS dial vs aperture mode with the EV dial. Both ways use the camera's light meter, both ways give the photographer the opportunity to direct the shutter speed to their desired value. It's just two different ways of achieving the same thing TL:DR (don't blame you) Old cameras were like a cake recipe that needed 3 eggs, if you only used two you were kinda screwed to get the third egg in there after the cake came out of the oven 😅 New cameras are like a prebaked cake that needs icing. You can add and subtract the icing to your heart's content, doesn't change the baked cake.", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/page/13/?tab=comments#comment-4186228", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "5 hours ago, steven said: i’ve always been intrigued by this way of shooting. i understand there is no disadvantage compared to auto iso (capped at 1600, like me), but is there rang advantage to this ? on older sensors, \"iso\" (aka signal amplification) was performed pre-adc (analogue to digital conversion) kinda like the raw software on your computer was given a recipe with the raw file that indicated how much it needed brightening as it was demosaiced. if you under exposed in camera, then you got noise. if you then brightened that image in lr/ps/whatever you amplified the noise to a level that was worse than if you'd told the camera to brighten the image at time of capture modern sensors are known as iso invariant. which means there's no pre-adc amplification at all, which means push it x stops on the iso dial or push it x stops on the exposure slider in front of your computer = all roads lead to rome. but that said, there's often still -----> tags !!! /instructions in the raw that say (sic) things to the raw software like if the iso is >x, then apply z amount of nr. so under exposing in camera and sorting it all out in post can leave you a little more in control of the nr process. but you're not going to see a night and day difference between doing one or the other on a modern camera. there's a slight complication that some sensors have dual gain, which means two levels of amplification (sony sensors iirc), with a swap at iso800 or whatever, so it can sometimes pay to be mindful of the cut over point... but really this is just geeky stuff and it doesn't really matter (the photo does not the camera setting) it's a little bit like the ss dial vs aperture mode with the ev dial. both ways use the camera's light meter, both ways give the photographer the opportunity to direct the shutter speed to their desired value. it's just two different ways of achieving the same thing tl:dr (don't blame you) old cameras were like a cake recipe that needed 3 eggs, if you only used two you were kinda screwed to get the third egg in there after the cake came out of the oven 😅 new cameras are like a prebaked cake that needs icing. you can add and subtract the icing to your heart's content, doesn't change the baked cake.", "sortedWord": "None", "identifyer": 4, "year": "2021"}, {"Unnamed: 0": 338961, "autor": "Tailwagger", "date": 1619088900000, "content": "54 minutes ago, lct said: What Sony could not do is implementing 6-bit coding for patent reasons explained above. I've frankly wondered for a while now, why Leica persists in its use of optical encoding. One can imagine an RFID tag and sensor system that could provide the identity for any lens they've ever made (via retrofit) along with all the necessary correction info, suitably encoded against use by other platforms should they wish. They could potentially support both methods. Just replace one dot with a black or white chip and newly minted lenses would continue to work with older cameras. Continuing to rely on a mere sixty-four unique identities seems rather imprecise for a company that prides itself on precision.", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/page/14/?tab=comments#comment-4186441", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "54 minutes ago, lct said: what sony could not do is implementing 6-bit coding for patent reasons explained above. i've frankly wondered for a while now, why leica persists in its use of optical encoding. one can imagine an rfid -----> tag !!!  and sensor system that could provide the identity for any lens they've ever made (via retrofit) along with all the necessary correction info, suitably encoded against use by other platforms should they wish. they could potentially support both methods. just replace one dot with a black or white chip and newly minted lenses would continue to work with older cameras. continuing to rely on a mere sixty-four unique identities seems rather imprecise for a company that prides itself on precision.", "sortedWord": "None", "identifyer": 23, "year": "2021"}, {"Unnamed: 0": 340693, "autor": "Artin", "date": 1635605460000, "content": " If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX improved buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? Edited October 30 by Artin", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/?tab=comments#comment-4302931", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " if or when say m11 is out..ok traditional leica m with rangefinder say 40-50 mpx improved buffer and all same size and same layout as always price -----> tag !!!  $9500 us .. great all good now along side they release another camera for the m no range finder .. high rez evf.. ibis .. 40-50mpx..electronic shutter, stacked sensor .. video.. manual focus m mount ... made in japan not germany.. but high quality standards. relatively same size and layout of the m ...at $3500.00 us. would you buy one ?? edited october 30 by artin", "sortedWord": "None", "identifyer": 1762, "year": "2021"}, {"Unnamed: 0": 340695, "autor": "a.noctilux", "date": 1635605820000, "content": "5 minutes ago, Artin said: If or when say M11 is lunched Ok Traditional Leica M with Rangefinder say 40-50 MPX improved buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they Lunch another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? Launch ? Edited October 30 by a.noctilux", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/?tab=comments#comment-4302935", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "5 minutes ago, artin said: if or when say m11 is lunched ok traditional leica m with rangefinder say 40-50 mpx improved buffer and all same size and same layout as always price -----> tag !!!  $9500 us .. great all good now along side they lunch another camera for the m no range finder .. high rez evf.. ibis .. 40-50mpx..electronic shutter, stacked sensor .. video.. manual focus m mount ... made in japan not germany.. but high quality standards. relatively same size and layout of the m ...at $3500.00 us. would you buy one ?? launch ? edited october 30 by a.noctilux", "sortedWord": "None", "identifyer": 1764, "year": "2021"}, {"Unnamed: 0": 340699, "autor": "Anbaric", "date": 1635608760000, "content": " 51 minutes ago, Artin said: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX improved buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? Why not just shove an adapter on the mirrorless camera of your choice, or wait for the SL3?", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/?tab=comments#comment-4302974", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " 51 minutes ago, artin said: if or when say m11 is out..ok traditional leica m with rangefinder say 40-50 mpx improved buffer and all same size and same layout as always price -----> tag !!!  $9500 us .. great all good now along side they release another camera for the m no range finder .. high rez evf.. ibis .. 40-50mpx..electronic shutter, stacked sensor .. video.. manual focus m mount ... made in japan not germany.. but high quality standards. relatively same size and layout of the m ...at $3500.00 us. would you buy one ?? why not just shove an adapter on the mirrorless camera of your choice, or wait for the sl3?", "sortedWord": "None", "identifyer": 1768, "year": "2021"}, {"Unnamed: 0": 340704, "autor": "Herr Barnack", "date": 1635612120000, "content": "1 hour ago, Artin said: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX improved buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? Since this is a hypothetical question, my answer would be a \"yes\" - hypothetically, of course. I would not buy the hypothetical Japan made camera instead of an M11 but as an adjunct to the M11. All the above is contingent upon my suddenly experiencing an unexpected financial windfall so that I would have the hard currency to buy both hypothetical cameras. As it turns out, attempting to buy any M camera or lens with hypothetical money yields the same end result as attempting to buy with the much ballyhooed \"exposure dollars\" that companies who want photographers to work for free always dangle in front of us. Edited October 30 by Herr Barnack", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/?tab=comments#comment-4303017", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1 hour ago, artin said: if or when say m11 is out..ok traditional leica m with rangefinder say 40-50 mpx improved buffer and all same size and same layout as always price -----> tag !!!  $9500 us .. great all good now along side they release another camera for the m no range finder .. high rez evf.. ibis .. 40-50mpx..electronic shutter, stacked sensor .. video.. manual focus m mount ... made in japan not germany.. but high quality standards. relatively same size and layout of the m ...at $3500.00 us. would you buy one ?? since this is a hypothetical question, my answer would be a \"yes\" - hypothetically, of course. i would not buy the hypothetical japan made camera instead of an m11 but as an adjunct to the m11. all the above is contingent upon my suddenly experiencing an unexpected financial windfall so that i would have the hard currency to buy both hypothetical cameras. as it turns out, attempting to buy any m camera or lens with hypothetical money yields the same end result as attempting to buy with the much ballyhooed \"exposure dollars\" that companies who want photographers to work for free always dangle in front of us. edited october 30 by herr barnack", "sortedWord": "None", "identifyer": 1773, "year": "2021"}, {"Unnamed: 0": 340705, "autor": "M8X2", "date": 1635615240000, "content": "vor 2 Stunden schrieb Artin: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX improved buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? I would buy a Q with an M-mount in a split second. Edited October 30 by M8X2", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/?tab=comments#comment-4303049", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "vor 2 stunden schrieb artin: if or when say m11 is out..ok traditional leica m with rangefinder say 40-50 mpx improved buffer and all same size and same layout as always price -----> tag !!!  $9500 us .. great all good now along side they release another camera for the m no range finder .. high rez evf.. ibis .. 40-50mpx..electronic shutter, stacked sensor .. video.. manual focus m mount ... made in japan not germany.. but high quality standards. relatively same size and layout of the m ...at $3500.00 us. would you buy one ?? i would buy a q with an m-mount in a split second. edited october 30 by m8x2", "sortedWord": "None", "identifyer": 1774, "year": "2021"}, {"Unnamed: 0": 340712, "autor": "LBJ2", "date": 1635618960000, "content": "3 hours ago, Artin said: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX improved buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? For me the second option is well covered with so many other mirrorless cameras on the market for some years now. Besides if your mystery camera is Leica FF @ $3500...hell did in fact freeze over and we have other problems to deal with 😉🙃 Seriously, IMO the SL2/S are such great options with all the mirrorless bells and whistles for adapting M lenses and on the shelves available for purchase as I type its really hard to dream of anything else. The Leica Rangefinder is however a completely different love affair for me. Not really looking for another lovely at the moment. As the M10-R is Simply Irresistible according to Robert Palmer's definition. *May he RIP.", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/?tab=comments#comment-4303107", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "3 hours ago, artin said: if or when say m11 is out..ok traditional leica m with rangefinder say 40-50 mpx improved buffer and all same size and same layout as always price -----> tag !!!  $9500 us .. great all good now along side they release another camera for the m no range finder .. high rez evf.. ibis .. 40-50mpx..electronic shutter, stacked sensor .. video.. manual focus m mount ... made in japan not germany.. but high quality standards. relatively same size and layout of the m ...at $3500.00 us. would you buy one ?? for me the second option is well covered with so many other mirrorless cameras on the market for some years now. besides if your mystery camera is leica ff @ $3500...hell did in fact freeze over and we have other problems to deal with 😉🙃 seriously, imo the sl2/s are such great options with all the mirrorless bells and whistles for adapting m lenses and on the shelves available for purchase as i type its really hard to dream of anything else. the leica rangefinder is however a completely different love affair for me. not really looking for another lovely at the moment. as the m10-r is simply irresistible according to robert palmer's definition. *may he rip.", "sortedWord": "None", "identifyer": 1781, "year": "2021"}, {"Unnamed: 0": 340731, "autor": "LBJ2", "date": 1635630600000, "content": "6 hours ago, Artin said: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX improved buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? NO is my hypothetical answer. Edited October 30 by LBJ2", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/page/2/?tab=comments#comment-4303233", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "6 hours ago, artin said: if or when say m11 is out..ok traditional leica m with rangefinder say 40-50 mpx improved buffer and all same size and same layout as always price -----> tag !!!  $9500 us .. great all good now along side they release another camera for the m no range finder .. high rez evf.. ibis .. 40-50mpx..electronic shutter, stacked sensor .. video.. manual focus m mount ... made in japan not germany.. but high quality standards. relatively same size and layout of the m ...at $3500.00 us. would you buy one ?? no is my hypothetical answer. edited october 30 by lbj2", "sortedWord": "None", "identifyer": 1800, "year": "2021"}, {"Unnamed: 0": 340755, "autor": "SrMi", "date": 1635695760000, "content": "46 minutes ago, charlesphoto99 said: You have got to be kidding.... no wonder Leica now gets the badge of overpriced jewelry for jet setters. Why bother with owning an expensive camera in the first place if it sits at home dependent on the 'weather' outside? Sure, if you don't feel like you have the street savvy to not lose it or get ripped off, leave it at home, but then why also risk a $4000 investment? Anyway, we already have a lower priced M, the Leica CL - or at even less risk an iPhone 13 Pro or Pixel 6 Pro. Leica CL, a mighty little camera, is no M. Maybe Leica M11 will have an Air Tag built in .... not likely.", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/page/4/?tab=comments#comment-4303741", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "46 minutes ago, charlesphoto99 said: you have got to be kidding.... no wonder leica now gets the badge of overpriced jewelry for jet setters. why bother with owning an expensive camera in the first place if it sits at home dependent on the 'weather' outside? sure, if you don't feel like you have the street savvy to not lose it or get ripped off, leave it at home, but then why also risk a $4000 investment? anyway, we already have a lower priced m, the leica cl - or at even less risk an iphone 13 pro or pixel 6 pro. leica cl, a mighty little camera, is no m. maybe leica m11 will have an air -----> tag !!!  built in .... not likely.", "sortedWord": "None", "identifyer": 1824, "year": "2021"}, {"Unnamed: 0": 340759, "autor": "Artin", "date": 1635698340000, "content": " 19 minutes ago, SrMi said: Based on your posts, it seemed to matter to you (Artin: I personally would pay 10k + for a Camera like that made in Germany). It seems I was wrong. You are. That was in response to a previous poster. I do care where , I care about the quality, technology, Craftsmanship, If they make something that is worth it For me I would purchase it. Example .. The Nikon Z9. I have no Idea where it will be made could be Japan , Malaysia , China .. does not matter .. technology yes , Craftsmanship possibly good , Overall quality ahh so so based on their past models like the D5, I hate all the plastic and rubber that comes with them. 5500 us I find it a good Value for what they are giving me .. I will purchase it. Now if they made it in the same level of the SL2 Craftsmanship. I will gladly pay double. I would care less about the Name tag or where it’s made", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/page/4/?tab=comments#comment-4303780", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " 19 minutes ago, srmi said: based on your posts, it seemed to matter to you (artin: i personally would pay 10k + for a camera like that made in germany). it seems i was wrong. you are. that was in response to a previous poster. i do care where , i care about the quality, technology, craftsmanship, if they make something that is worth it for me i would purchase it. example .. the nikon z9. i have no idea where it will be made could be japan , malaysia , china .. does not matter .. technology yes , craftsmanship possibly good , overall quality ahh so so based on their past models like the d5, i hate all the plastic and rubber that comes with them. 5500 us i find it a good value for what they are giving me .. i will purchase it. now if they made it in the same level of the sl2 craftsmanship. i will gladly pay double. i would care less about the name -----> tag !!!  or where it’s made", "sortedWord": "None", "identifyer": 1828, "year": "2021"}, {"Unnamed: 0": 340844, "autor": "pippy", "date": 1635807180000, "content": "On 10/30/2021 at 3:51 PM, Artin said: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX improved buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? Sorry to drag the thread back to the opening post but... No. OK; back to where you were! Philip.", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/page/8/?tab=comments#comment-4304881", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 10/30/2021 at 3:51 pm, artin said: if or when say m11 is out..ok traditional leica m with rangefinder say 40-50 mpx improved buffer and all same size and same layout as always price -----> tag !!!  $9500 us .. great all good now along side they release another camera for the m no range finder .. high rez evf.. ibis .. 40-50mpx..electronic shutter, stacked sensor .. video.. manual focus m mount ... made in japan not germany.. but high quality standards. relatively same size and layout of the m ...at $3500.00 us. would you buy one ?? sorry to drag the thread back to the opening post but... no. ok; back to where you were! philip.", "sortedWord": "None", "identifyer": 1913, "year": "2021"}, {"Unnamed: 0": 340854, "autor": "Camaro5", "date": 1635816720000, "content": "On 10/30/2021 at 7:51 AM, Artin said: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX improved buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? What it sounds like to me is a hybrid SL2 with an M mount. With just manual focus and no rangefinder you would just have focus peaking or nothing. Might not be too bad with a focus-zoom aid, but it seems like critical focus might be hard to achieve. All the other specs sound good but it wouldn't be for me without a decent focusing system.", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/page/9/?tab=comments#comment-4304933", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 10/30/2021 at 7:51 am, artin said: if or when say m11 is out..ok traditional leica m with rangefinder say 40-50 mpx improved buffer and all same size and same layout as always price -----> tag !!!  $9500 us .. great all good now along side they release another camera for the m no range finder .. high rez evf.. ibis .. 40-50mpx..electronic shutter, stacked sensor .. video.. manual focus m mount ... made in japan not germany.. but high quality standards. relatively same size and layout of the m ...at $3500.00 us. would you buy one ?? what it sounds like to me is a hybrid sl2 with an m mount. with just manual focus and no rangefinder you would just have focus peaking or nothing. might not be too bad with a focus-zoom aid, but it seems like critical focus might be hard to achieve. all the other specs sound good but it wouldn't be for me without a decent focusing system.", "sortedWord": "None", "identifyer": 1923, "year": "2021"}, {"Unnamed: 0": 340860, "autor": "cboy", "date": 1635821820000, "content": "On 10/31/2021 at 12:51 AM, Artin said: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX improved buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? Panasonic and leica made equivalent compacts as i recall. So if ever this would come to reality then it'd be an evf rangefinder in L mount. A japanese leica. Sound like this was done before lol", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/page/9/?tab=comments#comment-4304944", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 10/31/2021 at 12:51 am, artin said: if or when say m11 is out..ok traditional leica m with rangefinder say 40-50 mpx improved buffer and all same size and same layout as always price -----> tag !!!  $9500 us .. great all good now along side they release another camera for the m no range finder .. high rez evf.. ibis .. 40-50mpx..electronic shutter, stacked sensor .. video.. manual focus m mount ... made in japan not germany.. but high quality standards. relatively same size and layout of the m ...at $3500.00 us. would you buy one ?? panasonic and leica made equivalent compacts as i recall. so if ever this would come to reality then it'd be an evf rangefinder in l mount. a japanese leica. sound like this was done before lol", "sortedWord": "None", "identifyer": 1929, "year": "2021"}, {"Unnamed: 0": 340952, "autor": "cirke", "date": 1636373220000, "content": "On 10/30/2021 at 4:51 PM, Artin said: If or when say M11 is out..Ok Traditional Leica M with Rangefinder say 40-50 MPX improved buffer and all same size and same layout as always price tag $9500 us .. Great all good Now along side they release another camera for the M No range finder .. high Rez EVF.. Ibis .. 40-50MPX..electronic shutter, stacked sensor .. Video.. manual focus M mount ... Made in Japan not Germany.. But high quality standards. Relatively same size and layout of the M ...at $3500.00 US. Would you Buy one ?? the one with EVF of course", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/page/13/?tab=comments#comment-4309439", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 10/30/2021 at 4:51 pm, artin said: if or when say m11 is out..ok traditional leica m with rangefinder say 40-50 mpx improved buffer and all same size and same layout as always price -----> tag !!!  $9500 us .. great all good now along side they release another camera for the m no range finder .. high rez evf.. ibis .. 40-50mpx..electronic shutter, stacked sensor .. video.. manual focus m mount ... made in japan not germany.. but high quality standards. relatively same size and layout of the m ...at $3500.00 us. would you buy one ?? the one with evf of course", "sortedWord": "None", "identifyer": 2021, "year": "2021"}, {"Unnamed: 0": 341004, "autor": "adan", "date": 1636493220000, "content": "1 hour ago, SrMi said: I wish I could reply to individual paragraphs instead of to the whole post :). You can reply to any subset of a post (down to individual letters, if you choose ). Just select the specific text to respond to, and a pop-up tag will appear under the end of your selection that reads \"Quote Selection.\" As I just did above. You can do that multiple times within one post, and then drag and arrange/stack the partial quotes in any way you want. 1 hour ago, SrMi said: I use many different cameras 1 hour ago, SrMi said: AFAIK 1 hour ago, SrMi said: I", "link": "https://www.l-camera-forum.com/topic/325898-hypothetical-question-this-should-stir-the-pot/page/16/?tab=comments#comment-4310402", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1 hour ago, srmi said: i wish i could reply to individual paragraphs instead of to the whole post :). you can reply to any subset of a post (down to individual letters, if you choose ). just select the specific text to respond to, and a pop-up -----> tag !!!  will appear under the end of your selection that reads \"quote selection.\" as i just did above. you can do that multiple times within one post, and then drag and arrange/stack the partial quotes in any way you want. 1 hour ago, srmi said: i use many different cameras 1 hour ago, srmi said: afaik 1 hour ago, srmi said: i", "sortedWord": "None", "identifyer": 2073, "year": "2021"}, {"Unnamed: 0": 345303, "autor": "Printmaker", "date": 1628361720000, "content": "On 8/6/2021 at 4:07 AM, Jeff S said: If you ever change your mind, you can feel reasonably secure (to same degree as any M) about an M9M that has had the ‘permanent’ sensor replacement and service by Leica. Good dealers like Leica Miami sell them only that way, sometimes with Leica warranty in addition to store warranty. That’s how I bought my mint M9M, still here despite adding an M10M, more for nostalgia than practical results. Jeff Thanks Jeff. I'm sure I'll add a M10M to the stable when the M11M is released. I do like everything about the M10 body but the price tag. $5k is my budget for M bodies and, between the pandemic and remodeling a house, I'm spending more time with a hammer than a camera. Were I to get another M9M right now, it would probably sit unused for months.", "link": "https://www.l-camera-forum.com/topic/323303-opinion-the-m10-three-months-in/?tab=comments#comment-4253020", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 8/6/2021 at 4:07 am, jeff s said: if you ever change your mind, you can feel reasonably secure (to same degree as any m) about an m9m that has had the ‘permanent’ sensor replacement and service by leica. good dealers like leica miami sell them only that way, sometimes with leica warranty in addition to store warranty. that’s how i bought my mint m9m, still here despite adding an m10m, more for nostalgia than practical results. jeff thanks jeff. i'm sure i'll add a m10m to the stable when the m11m is released. i do like everything about the m10 body but the price -----> tag !!! . $5k is my budget for m bodies and, between the pandemic and remodeling a house, i'm spending more time with a hammer than a camera. were i to get another m9m right now, it would probably sit unused for months.", "sortedWord": "None", "identifyer": 6392, "year": "2021"}, {"Unnamed: 0": 345651, "autor": "jdlaing", "date": 1626294180000, "content": "1 hour ago, MikeMyers said: Sure - either maybe you can post them here, so everyone can see them, or if you prefer you can email me at michaeljessemyers at gm ail dot c om. It might even work with my Nikon Df camera, with a second lens. Thanks very much to you, and everyone else who has posted - I doubt I'd have found this on my own. The price, around $200, is no problem, since it doesn't even look expensive, more like a $30 bag, which is fine with me. It’s not really branded Leica. There are no Leica identifiers on the bag other than a tag inside the flap that says Billingham for Leica. It’s an excellent small bag. --img-- ", "link": "https://www.l-camera-forum.com/topic/322676-looking-for-a-small-travel-bag-for-a-m10-preferably-available-from-amazon-with-bh-being-second-choice/page/3/?tab=comments#comment-4238368", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1 hour ago, mikemyers said: sure - either maybe you can post them here, so everyone can see them, or if you prefer you can email me at michaeljessemyers at gm ail dot c om. it might even work with my nikon df camera, with a second lens. thanks very much to you, and everyone else who has posted - i doubt i'd have found this on my own. the price, around $200, is no problem, since it doesn't even look expensive, more like a $30 bag, which is fine with me. it’s not really branded leica. there are no leica identifiers on the bag other than a -----> tag !!!  inside the flap that says billingham for leica. it’s an excellent small bag. --img-- ", "sortedWord": "None", "identifyer": 6740, "year": "2021"}, {"Unnamed: 0": 345833, "autor": "Cobram", "date": 1610444340000, "content": "On ‎8‎/‎1‎/‎2020 at 12:29 PM, kegon said: Well this reflects my experiences so far... Biggest exception from this rule was a Mercedes, I drove... Worst car I ever had... Leica seems to be the second exception from this rule. When it comes to beer, I agree... But being a German, I have a special perception of quality, when it comes to beer 😉 I have posted a comment in the past regarding quality, globalisation, mass consumer products etc... which ended in disputes and angry replies. I'm really sorry and wish I never did it. I realised internet communication (forums, social media,...) is very very different to personal one. At the end I think Leica is no different to any other company regarding quality of their products. I came from Fuji X system primarly due to service problems and realised Leica is even worse in this regard 🙂 (much worse in fact). But at the end we buy and use Leica because of THE experience, manual controls and great lenses. If this justifies high price tag I don't know. Definetely Leica Achilles heel is service department. Sometimes THE experience is ruined for few months even half a year.", "link": "https://www.l-camera-forum.com/topic/311850-leica-m10-r-freezing-issues/page/3/?tab=comments#comment-4116670", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on ‎8‎/‎1‎/‎2020 at 12:29 pm, kegon said: well this reflects my experiences so far... biggest exception from this rule was a mercedes, i drove... worst car i ever had... leica seems to be the second exception from this rule. when it comes to beer, i agree... but being a german, i have a special perception of quality, when it comes to beer 😉 i have posted a comment in the past regarding quality, globalisation, mass consumer products etc... which ended in disputes and angry replies. i'm really sorry and wish i never did it. i realised internet communication (forums, social media,...) is very very different to personal one. at the end i think leica is no different to any other company regarding quality of their products. i came from fuji x system primarly due to service problems and realised leica is even worse in this regard 🙂 (much worse in fact). but at the end we buy and use leica because of the experience, manual controls and great lenses. if this justifies high price -----> tag !!!  i don't know. definetely leica achilles heel is service department. sometimes the experience is ruined for few months even half a year.", "sortedWord": "None", "identifyer": 6922, "year": "2021"}, {"Unnamed: 0": 345840, "autor": "rtai", "date": 1625445240000, "content": "On 1/12/2021 at 5:39 PM, Cobram said: I have posted a comment in the past regarding quality, globalisation, mass consumer products etc... which ended in disputes and angry replies. I'm really sorry and wish I never did it. I realised internet communication (forums, social media,...) is very very different to personal one. At the end I think Leica is no different to any other company regarding quality of their products. I came from Fuji X system primarly due to service problems and realised Leica is even worse in this regard 🙂 (much worse in fact). But at the end we buy and use Leica because of THE experience, manual controls and great lenses. If this justifies high price tag I don't know. Definetely Leica Achilles heel is service department. Sometimes THE experience is ruined for few months even half a year. I am very paranoid about broken cameras on photography trips because it happened to me on four different occasions using Rolleiflex 6008 and Hasselblad 203FE cameras. After travelling thousands of miles and a hundred rolls of 120 film later I got no images. Most recently my Leica R9 gave me crazy shutter speed readings on auto mode on a trip to Arizona but luckily I only wasted a roll and had an R8 back up. I use my now only Leica an M10M for street photography close to home but for long trips I either want a back up or use something else entirely.", "link": "https://www.l-camera-forum.com/topic/311850-leica-m10-r-freezing-issues/page/3/?tab=comments#comment-4231958", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 1/12/2021 at 5:39 pm, cobram said: i have posted a comment in the past regarding quality, globalisation, mass consumer products etc... which ended in disputes and angry replies. i'm really sorry and wish i never did it. i realised internet communication (forums, social media,...) is very very different to personal one. at the end i think leica is no different to any other company regarding quality of their products. i came from fuji x system primarly due to service problems and realised leica is even worse in this regard 🙂 (much worse in fact). but at the end we buy and use leica because of the experience, manual controls and great lenses. if this justifies high price -----> tag !!!  i don't know. definetely leica achilles heel is service department. sometimes the experience is ruined for few months even half a year. i am very paranoid about broken cameras on photography trips because it happened to me on four different occasions using rolleiflex 6008 and hasselblad 203fe cameras. after travelling thousands of miles and a hundred rolls of 120 film later i got no images. most recently my leica r9 gave me crazy shutter speed readings on auto mode on a trip to arizona but luckily i only wasted a roll and had an r8 back up. i use my now only leica an m10m for street photography close to home but for long trips i either want a back up or use something else entirely.", "sortedWord": "None", "identifyer": 6929, "year": "2021"}, {"Unnamed: 0": 346497, "autor": "Adam Bonn", "date": 1624435020000, "content": "IIRC / AFAIK Leica has added some tag in the DNG that calls upon LR/ACR to add NR based on ISO, which they didn’t do with previous cameras. (also IIRC / AFAIK, LR’s default numerical setting eg ‘sharpening 25’ might be the same value for all/many cameras but it doesn’t have the same intensity, ie 25 on Fuji might be less sharpening than 25 on a Nikon or whatever) IIRC C1 has always added whatever sharpening/NR it felt was needed based on as-shot parameters", "link": "https://www.l-camera-forum.com/topic/321522-m10-dng-files-automatic-noise-reduction-applied-in-lightroom-classic/?tab=comments#comment-4224811", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "iirc / afaik leica has added some -----> tag !!!  in the dng that calls upon lr/acr to add nr based on iso, which they didn’t do with previous cameras. (also iirc / afaik, lr’s default numerical setting eg ‘sharpening 25’ might be the same value for all/many cameras but it doesn’t have the same intensity, ie 25 on fuji might be less sharpening than 25 on a nikon or whatever) iirc c1 has always added whatever sharpening/nr it felt was needed based on as-shot parameters", "sortedWord": "None", "identifyer": 7588, "year": "2021"}, {"Unnamed: 0": 347086, "autor": "LBJ2", "date": 1611341580000, "content": "I am not typically attracted to high fashion special editions nor high fashion price tags, but I must admit this kevlar/green M10-P \"Reporter\" looks cool, cool, cool to me. Even the camera strap looks like something I would actually use. The idea that the kevlar through exposure to light, will eventually turn green as the body paint, is well...pretty damn cool too Ha Ha. For me, just virtual window shopping since I am perfectly fine with my M10, but I bet all 450 units will get snapped up pretty quickly.", "link": "https://www.l-camera-forum.com/topic/317208-new-special-edition-the-leica-m10-p-reporter-in-kevlar-cover/page/2/?tab=comments#comment-4123367", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "i am not typically attracted to high fashion special editions nor high fashion price -----> tags !!! , but i must admit this kevlar/green m10-p \"reporter\" looks cool, cool, cool to me. even the camera strap looks like something i would actually use. the idea that the kevlar through exposure to light, will eventually turn green as the body paint, is well...pretty damn cool too ha ha. for me, just virtual window shopping since i am perfectly fine with my m10, but i bet all 450 units will get snapped up pretty quickly.", "sortedWord": "None", "identifyer": 8182, "year": "2021"}, {"Unnamed: 0": 348671, "autor": "Shu_downunder", "date": 1617973140000, "content": "9 hours ago, ravinj said: This is for the OP. Copy/paste of texts from a person I sold my M10 to. Bottom line, no camera is \"bulletproof\". I just got back from Mexico and it won't turn on , I suspect condensation and damp air may have affected it Simply wondering from you if it is still under warranty , unlikely but possible !! Any idea ?? thanks I suggested he take it to Leica NJ: So , I said I would get back to you I drove out to Leica NJ and luckily they took the camera from me , that was a struggle but head of customer relations was sweet The camera is not able to tolerate heavy humidity , it was damaged internally and replacing the sensor Will run me $2,350 Ouch But better than saying goodbye which is what would have happened had I not drove out there , another few days and it would have been totaled Thanks for your helpful nature I was in Tulum when Zeta was brewing off shore , it was close to hurricane force 1 but never hit shore The air was very humid for 34 hours , but it was never in the rain , yet I stayed in an eco friendly lodge so no AC . . I was shocked also , just wanted you to know there is a tolerance for this weather I'll check out the above later Thanks mate End of story. Thanks for sharing. I know it’s not fair to require Leica camera, even pre-digital ones to last forever. But there is very few tools that has been used to created so many histories and stories linking to humanity like Leica has. And the anticipation to it has been further consolidated by the high price tag. As first time buyers, we naturally want to find as many points as possible to justify the decision. Actually for me personally the requirements are straight forward: - I need a decent camera that is really lightweight and compact. Decent means full frame, good image quality. Lightweight means a body and a lens, filters, spare batteries and charger etc altogether no more than 1250g. Compact means can be within my arm reach in all situations, in car, walking, in cafe, on a slow boat, in an airplane etc. - I need it to survive a 6 month long trip without any professional service. I really can’t find anything else but a M. Please do give me some advice if you know or have experiences on other cameras. Edited April 9 by Shu_downunder", "link": "https://www.l-camera-forum.com/topic/319662-leica-m10-mm-durability-and-toughness/page/2/?tab=comments#comment-4177669", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "9 hours ago, ravinj said: this is for the op. copy/paste of texts from a person i sold my m10 to. bottom line, no camera is \"bulletproof\". i just got back from mexico and it won't turn on , i suspect condensation and damp air may have affected it simply wondering from you if it is still under warranty , unlikely but possible !! any idea ?? thanks i suggested he take it to leica nj: so , i said i would get back to you i drove out to leica nj and luckily they took the camera from me , that was a struggle but head of customer relations was sweet the camera is not able to tolerate heavy humidity , it was damaged internally and replacing the sensor will run me $2,350 ouch but better than saying goodbye which is what would have happened had i not drove out there , another few days and it would have been totaled thanks for your helpful nature i was in tulum when zeta was brewing off shore , it was close to hurricane force 1 but never hit shore the air was very humid for 34 hours , but it was never in the rain , yet i stayed in an eco friendly lodge so no ac . . i was shocked also , just wanted you to know there is a tolerance for this weather i'll check out the above later thanks mate end of story. thanks for sharing. i know it’s not fair to require leica camera, even pre-digital ones to last forever. but there is very few tools that has been used to created so many histories and stories linking to humanity like leica has. and the anticipation to it has been further consolidated by the high price -----> tag !!! . as first time buyers, we naturally want to find as many points as possible to justify the decision. actually for me personally the requirements are straight forward: - i need a decent camera that is really lightweight and compact. decent means full frame, good image quality. lightweight means a body and a lens, filters, spare batteries and charger etc altogether no more than 1250g. compact means can be within my arm reach in all situations, in car, walking, in cafe, on a slow boat, in an airplane etc. - i need it to survive a 6 month long trip without any professional service. i really can’t find anything else but a m. please do give me some advice if you know or have experiences on other cameras. edited april 9 by shu_downunder", "sortedWord": "None", "identifyer": 9772, "year": "2021"}, {"Unnamed: 0": 349121, "autor": "scott kirkpatrick", "date": 1615709940000, "content": "The perspective control information is passed to any postprocessing software in a set of XML tags which Adobe and Leica have specified. They are not encrypted or disguised in any way. You can read them in a text editor, or use Adobe's dng_validate software to print them out along with lots of other stuff. The information that is stored is the pitch and roll angles measured at the camera, plus the four corner positions that Leica has selected for remapping into a 3:2 rectangle. Capture One also has a mode in which you select four corners for simultaneous vertical and horizontal de-keystoning, so they could use all of this information, or do their own calculation of the PC frame. (Since you see the PC frame in the viewfinder, it would be best to use what you saw.) So it's likely that this could be supported in other places than ACR, PS, and LR.", "link": "https://www.l-camera-forum.com/topic/318885-question-about-leica-perspective-control/?tab=comments#comment-4160158", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "the perspective control information is passed to any postprocessing software in a set of xml -----> tags !!!  which adobe and leica have specified. they are not encrypted or disguised in any way. you can read them in a text editor, or use adobe's dng_validate software to print them out along with lots of other stuff. the information that is stored is the pitch and roll angles measured at the camera, plus the four corner positions that leica has selected for remapping into a 3:2 rectangle. capture one also has a mode in which you select four corners for simultaneous vertical and horizontal de-keystoning, so they could use all of this information, or do their own calculation of the pc frame. (since you see the pc frame in the viewfinder, it would be best to use what you saw.) so it's likely that this could be supported in other places than acr, ps, and lr.", "sortedWord": "None", "identifyer": 10223, "year": "2021"}, {"Unnamed: 0": 349578, "autor": "Bikie John", "date": 1612779660000, "content": "As far as I can see with the M10-P - it writes the metadata whether the camera setting is on or off, and whether Live View is active or not. Then, in both Lightroom and ACR/Photoshop: - IF the camera setting is \"On\", AND Live View is active, the perspective correction will be applied by default to the raw file. It can be switched off or modified. - In all other cases, the raw file will be displayed without adjustment, selecting the \"Guided\" option in the transform section will apply it. This is pretty much what I would expect and hope for and very nice. With the M10 Monochrom, the in-camera stuff is fine, but neither Lightroom or ACR/Photoshop can be persuaded to take any notice of it. Since other users have said that the M10M files contain the same metadata tags as the other bodies, I think we can say with a fair degree of confidence that the screw-up is Adobe's and not Leica's. Leica's only screw-up is to launch it with a great fanfare saying how it has ben developed in conjunction with Adobe. I suspect that they are guinea-pigging it with the Ms before incorporating it in the rest of the line-up, so at least there will more pressure on Adobe to extract the digit. John", "link": "https://www.l-camera-forum.com/topic/317447-firmware-update-perspective-correction-for-the-leica-m10-p-m10-r-and-m10-monochrom/page/4/?tab=comments#comment-4136206", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "as far as i can see with the m10-p - it writes the metadata whether the camera setting is on or off, and whether live view is active or not. then, in both lightroom and acr/photoshop: - if the camera setting is \"on\", and live view is active, the perspective correction will be applied by default to the raw file. it can be switched off or modified. - in all other cases, the raw file will be displayed without adjustment, selecting the \"guided\" option in the transform section will apply it. this is pretty much what i would expect and hope for and very nice. with the m10 monochrom, the in-camera stuff is fine, but neither lightroom or acr/photoshop can be persuaded to take any notice of it. since other users have said that the m10m files contain the same metadata -----> tags !!!  as the other bodies, i think we can say with a fair degree of confidence that the screw-up is adobe's and not leica's. leica's only screw-up is to launch it with a great fanfare saying how it has ben developed in conjunction with adobe. i suspect that they are guinea-pigging it with the ms before incorporating it in the rest of the line-up, so at least there will more pressure on adobe to extract the digit. john", "sortedWord": "None", "identifyer": 10682, "year": "2021"}, {"Unnamed: 0": 349581, "autor": "Eesand", "date": 1612795500000, "content": "4 hours ago, Bikie John said: As far as I can see with the M10-P - it writes the metadata whether the camera setting is on or off, and whether Live View is active or not. Then, in both Lightroom and ACR/Photoshop: - IF the camera setting is \"On\", AND Live View is active, the perspective correction will be applied by default to the raw file. It can be switched off or modified. - In all other cases, the raw file will be displayed without adjustment, selecting the \"Guided\" option in the transform section will apply it. This is pretty much what I would expect and hope for and very nice. With the M10 Monochrom, the in-camera stuff is fine, but neither Lightroom or ACR/Photoshop can be persuaded to take any notice of it. Since other users have said that the M10M files contain the same metadata tags as the other bodies, I think we can say with a fair degree of confidence that the screw-up is Adobe's and not Leica's. Leica's only screw-up is to launch it with a great fanfare saying how it has ben developed in conjunction with Adobe. I suspect that they are guinea-pigging it with the Ms before incorporating it in the rest of the line-up, so at least there will more pressure on Adobe to extract the digit. John Yes, further observing indicates that this is correct, it's not quite clear what the behavior of the various previews is (in bridge, or the LCD, etc) across the various cameras with live view on or off. But I now observe that the metadata is written in the dng's. I think an update to acr still is needed for complete implementation, I think it's coming.", "link": "https://www.l-camera-forum.com/topic/317447-firmware-update-perspective-correction-for-the-leica-m10-p-m10-r-and-m10-monochrom/page/4/?tab=comments#comment-4136358", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "4 hours ago, bikie john said: as far as i can see with the m10-p - it writes the metadata whether the camera setting is on or off, and whether live view is active or not. then, in both lightroom and acr/photoshop: - if the camera setting is \"on\", and live view is active, the perspective correction will be applied by default to the raw file. it can be switched off or modified. - in all other cases, the raw file will be displayed without adjustment, selecting the \"guided\" option in the transform section will apply it. this is pretty much what i would expect and hope for and very nice. with the m10 monochrom, the in-camera stuff is fine, but neither lightroom or acr/photoshop can be persuaded to take any notice of it. since other users have said that the m10m files contain the same metadata -----> tags !!!  as the other bodies, i think we can say with a fair degree of confidence that the screw-up is adobe's and not leica's. leica's only screw-up is to launch it with a great fanfare saying how it has ben developed in conjunction with adobe. i suspect that they are guinea-pigging it with the ms before incorporating it in the rest of the line-up, so at least there will more pressure on adobe to extract the digit. john yes, further observing indicates that this is correct, it's not quite clear what the behavior of the various previews is (in bridge, or the lcd, etc) across the various cameras with live view on or off. but i now observe that the metadata is written in the dng's. i think an update to acr still is needed for complete implementation, i think it's coming.", "sortedWord": "None", "identifyer": 10685, "year": "2021"}, {"Unnamed: 0": 349608, "autor": "scott kirkpatrick", "date": 1615120740000, "content": "To expand on SrMi's explanation, there are several ways in which data is stored in a DNG file. Much of it is tagged information, specified as part of the TIFF data standard from the late 1990s. EXIF tools can read that. Some of it is manufacturer's private data, which can only be read if your have a contract with the manufacturer, as it is encrypted. You won't get to see that. Then there is an intermediate class of XMP tags, which are filled in to Adobe's specifications, not encrypted, but not standardized either. Adobe and Leica seem to have created some of these for the perspective frame definition. Some tools can see them, starting with a text editor. They contain the pitch and roll angles that the camera measures, and the four calculated corners of the PC frame, plus a few more tokens which Leica and Adobe have agreed on to specify how the image is to be handled. Those are not all that mysterious, but other companies may have to speak to Adobe to ensure that they understand what they do and are kept informed of any changes. Edited March 7 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/317447-firmware-update-perspective-correction-for-the-leica-m10-p-m10-r-and-m10-monochrom/page/6/?tab=comments#comment-4155520", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "to expand on srmi's explanation, there are several ways in which data is stored in a dng file. much of it is -----> tagged !!!  information, specified as part of the tiff data standard from the late 1990s. exif tools can read that. some of it is manufacturer's private data, which can only be read if your have a contract with the manufacturer, as it is encrypted. you won't get to see that. then there is an intermediate class of xmp tags, which are filled in to adobe's specifications, not encrypted, but not standardized either. adobe and leica seem to have created some of these for the perspective frame definition. some tools can see them, starting with a text editor. they contain the pitch and roll angles that the camera measures, and the four calculated corners of the pc frame, plus a few more tokens which leica and adobe have agreed on to specify how the image is to be handled. those are not all that mysterious, but other companies may have to speak to adobe to ensure that they understand what they do and are kept informed of any changes. edited march 7 by scott kirkpatrick", "sortedWord": "None", "identifyer": 10712, "year": "2021"}, {"Unnamed: 0": 349609, "autor": "rramesh", "date": 1615123140000, "content": "41 minutes ago, scott kirkpatrick said: To expand on SrMi's explanation, there are several ways in which data is stored in a DNG file. Much of it is tagged information, specified as part of the TIFF data standard from the late 1990s. EXIF topls can read that. Some of it is manufacturer's private data, which can only be read if your have a contract with the manufacturer, as it is encrypted. You won't get to see that. Then there is an intermediate class of XMP tags, which are filled in to Adobe's specifications, not encrypted, but not standardized either. Adobe and Leica seem to have created some of these for the perspective frame definition. Some tools can see them, starting with a text editor. They contain the pitch and roll angles that the camera measures, and the four calculated corners of the PC frame, plus a few more tokens which Leica and Adobe have agreed on to specify how the image is to be handled. Those are not all that mysterious, but other companies may have to speak to Adobe to ensure that they understand what they do and are kept informed of any changes. Thanks for the clear explanation. Is this the same as Adobe Upright? Edited March 7 by rramesh", "link": "https://www.l-camera-forum.com/topic/317447-firmware-update-perspective-correction-for-the-leica-m10-p-m10-r-and-m10-monochrom/page/6/?tab=comments#comment-4155543", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "41 minutes ago, scott kirkpatrick said: to expand on srmi's explanation, there are several ways in which data is stored in a dng file. much of it is -----> tagged !!!  information, specified as part of the tiff data standard from the late 1990s. exif topls can read that. some of it is manufacturer's private data, which can only be read if your have a contract with the manufacturer, as it is encrypted. you won't get to see that. then there is an intermediate class of xmp tags, which are filled in to adobe's specifications, not encrypted, but not standardized either. adobe and leica seem to have created some of these for the perspective frame definition. some tools can see them, starting with a text editor. they contain the pitch and roll angles that the camera measures, and the four calculated corners of the pc frame, plus a few more tokens which leica and adobe have agreed on to specify how the image is to be handled. those are not all that mysterious, but other companies may have to speak to adobe to ensure that they understand what they do and are kept informed of any changes. thanks for the clear explanation. is this the same as adobe upright? edited march 7 by rramesh", "sortedWord": "None", "identifyer": 10713, "year": "2021"}, {"Unnamed: 0": 350215, "autor": "Casey Jefferson", "date": 1613120520000, "content": "I'm a professional violinist. Like many violinists, we are pretty anal(ysis) about our instruments and would pay a hefty price tag for a well made one. The longer I work for the industry, the more I realize when you deliver to your paying clients, you get the job done, be it a cheapo student instrument or a million dollars Stradivarius. As a matter of fact, the instrument that earn the most money for me, is my cheapest one around $500, while my $22,000 Italian violin mostly just to please myself. Often clients even preferred my cheapest instrument for recording because my expensive violin doesn't suit the track well. Did I waste my money buying the expensive violin? Nope, I learned a lot from using one, it's much less forgiving on mistakes as it'll amplify everything, but once I work on the violin harder I'll get more rewards on creating more nuances and details. This actually helped me to improve my playing so I can do a lot more once I move to a cheap instrument. I felt so much the same when I switch between Fuji X and Leica M. When it comes to shooting for a session or a job, you just want to deliver. Will the client notice the difference? Maybe yes, or maybe not, depends on the task. If Leica M is the right tool for the job, by all means use them to deliver the best. Some people shoot better through RF, some through SLR, some through Live view at arms length or waist level. They're all tools for the job. Now, it'll be a different story when I just want to please ourself. We can shoot brick wall all day, or coffee mugs, or your favorite kitchen sink and analyze the heck our of the field curvature, purple fringing, transition zone, perspective distortion, tonal seperation...", "link": "https://www.l-camera-forum.com/topic/317627-leica-m-or-q-for-pro-and-serious-work/page/2/?tab=comments#comment-4139064", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i'm a professional violinist. like many violinists, we are pretty anal(ysis) about our instruments and would pay a hefty price -----> tag !!!  for a well made one. the longer i work for the industry, the more i realize when you deliver to your paying clients, you get the job done, be it a cheapo student instrument or a million dollars stradivarius. as a matter of fact, the instrument that earn the most money for me, is my cheapest one around $500, while my $22,000 italian violin mostly just to please myself. often clients even preferred my cheapest instrument for recording because my expensive violin doesn't suit the track well. did i waste my money buying the expensive violin? nope, i learned a lot from using one, it's much less forgiving on mistakes as it'll amplify everything, but once i work on the violin harder i'll get more rewards on creating more nuances and details. this actually helped me to improve my playing so i can do a lot more once i move to a cheap instrument. i felt so much the same when i switch between fuji x and leica m. when it comes to shooting for a session or a job, you just want to deliver. will the client notice the difference? maybe yes, or maybe not, depends on the task. if leica m is the right tool for the job, by all means use them to deliver the best. some people shoot better through rf, some through slr, some through live view at arms length or waist level. they're all tools for the job. now, it'll be a different story when i just want to please ourself. we can shoot brick wall all day, or coffee mugs, or your favorite kitchen sink and analyze the heck our of the field curvature, purple fringing, transition zone, perspective distortion, tonal seperation...", "sortedWord": "None", "identifyer": 11320, "year": "2021"}, {"Unnamed: 0": 353521, "autor": "Anbaric", "date": 1624842240000, "content": "This is expected behaviour. The lens menu just makes sure the files are tagged with the correct metadata, and appropriate digital corrections are applied. For framelines, even the digital M cameras use a version of the mechanical frameline selection system that dates back to the 1950s. The only Leica with a 40mm frameline is the original film CL from the 1970s, and this frameline is always visible rather than selected by the lens (you'll see both 40mm and 50mm framelines when a 40mm lens is mounted on that body). I've always been slightly horrified by the idea of taking a file to the mount to get a different frameline; it's a fairly common modification, but will devalue your lens.", "link": "https://www.l-camera-forum.com/topic/322200-m240-voigtl%C3%A4nder-lens-how-to-bring-up-correct-framelines/?tab=comments#comment-4227570", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "this is expected behaviour. the lens menu just makes sure the files are -----> tagged !!!  with the correct metadata, and appropriate digital corrections are applied. for framelines, even the digital m cameras use a version of the mechanical frameline selection system that dates back to the 1950s. the only leica with a 40mm frameline is the original film cl from the 1970s, and this frameline is always visible rather than selected by the lens (you'll see both 40mm and 50mm framelines when a 40mm lens is mounted on that body). i've always been slightly horrified by the idea of taking a file to the mount to get a different frameline; it's a fairly common modification, but will devalue your lens.", "sortedWord": "None", "identifyer": 14674, "year": "2021"}, {"Unnamed: 0": 362127, "autor": "AndreasG", "date": 1620552000000, "content": "vor 2 Minuten schrieb newtoleica: Though it should have been a pretty easy 'a la carte' option..... This would be perfect, even against a substantially higher price tag or long lead time", "link": "https://www.l-camera-forum.com/topic/320754-m10-d-monochrom-m10m-d/?tab=comments#comment-4197474", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "vor 2 minuten schrieb newtoleica: though it should have been a pretty easy 'a la carte' option..... this would be perfect, even against a substantially higher price -----> tag !!!  or long lead time", "sortedWord": "None", "identifyer": 23370, "year": "2021"}, {"Unnamed: 0": 362472, "autor": "steveBK", "date": 1616981640000, "content": "7 hours ago, dgc said: jplomley - I am now where you were back in August but I am torn between the M10 M and the Hasselblad 907x. I have sufficient lenses for both the M series and the V system but will need to invest in a new printer. Did you ever pull the trigger and what are your thoughts if you did? The cost of the M10 M is ludicrous but having the M7 and MP (having sold the M240 and I may well sell the MP to subsidise the M10 M) the temptation of digital B&W images would be a natural progression for me. However, for landscapes and architecture photography the 907x would complement my V system. I have read a few threads where users are happy with the quality of digital prints from the M10 M (some being as good as darkroom printing) but is the quality of the rendering better than can be gained from converting colour images to B&W? All very subjective I know. I would be pleased to hear from others and their experiences of M10 M for landscape/ architecture (and any 907x users as well!). I got the M10M just as COVID hit last year, and instead of using it for street&travel, ended up being mostly landscape (and cats) due to the circumstances. Here are all my photos tagged m10m if you want to browse - https://www.flickr.com/search/?user_id=xx573v3xx&tags=leicam10monochrom&sort=date-posted-desc I’ve been quite happy, the resolution is high, the low light sensitivity is great..the form factor and quietness are awesome.", "link": "https://www.l-camera-forum.com/topic/312315-m10m-for-landscapes/?tab=comments#comment-4169980", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "7 hours ago, dgc said: jplomley - i am now where you were back in august but i am torn between the m10 m and the hasselblad 907x. i have sufficient lenses for both the m series and the v system but will need to invest in a new printer. did you ever pull the trigger and what are your thoughts if you did? the cost of the m10 m is ludicrous but having the m7 and mp (having sold the m240 and i may well sell the mp to subsidise the m10 m) the temptation of digital b&w images would be a natural progression for me. however, for landscapes and architecture photography the 907x would complement my v system. i have read a few threads where users are happy with the quality of digital prints from the m10 m (some being as good as darkroom printing) but is the quality of the rendering better than can be gained from converting colour images to b&w? all very subjective i know. i would be pleased to hear from others and their experiences of m10 m for landscape/ architecture (and any 907x users as well!). i got the m10m just as covid hit last year, and instead of using it for street&travel, ended up being mostly landscape (and cats) due to the circumstances. here are all my photos -----> tagged !!!  m10m if you want to browse - https://www.flickr.com/search/?user_id=xx573v3xx&tags=leicam10monochrom&sort=date-posted-desc i’ve been quite happy, the resolution is high, the low light sensitivity is great..the form factor and quietness are awesome.", "sortedWord": "None", "identifyer": 23716, "year": "2021"}, {"Unnamed: 0": 362519, "autor": "Anakronox", "date": 1614097560000, "content": "The EXIF data for the lens (when coded) and any other adjustments made based on the lens are embedded in the raw. Your post-processing software reads these tags and makes adjustments. This is why C1 and LR know what lens you’ve used and can apply a profile automatically. With color digital Leicas, color shifts and casts are baked into the raw by the camera and as far as I’m aware can’t be changed in post.", "link": "https://www.l-camera-forum.com/topic/318174-lens-detection-what-does-it-do/?tab=comments#comment-4147444", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "the exif data for the lens (when coded) and any other adjustments made based on the lens are embedded in the raw. your post-processing software reads these -----> tags !!!  and makes adjustments. this is why c1 and lr know what lens you’ve used and can apply a profile automatically. with color digital leicas, color shifts and casts are baked into the raw by the camera and as far as i’m aware can’t be changed in post.", "sortedWord": "None", "identifyer": 23763, "year": "2021"}, {"Unnamed: 0": 362520, "autor": "blackdot", "date": 1614097680000, "content": "Just now, Anakronox said: The EXIF data for the lens (when coded) and any other adjustments made based on the lens are embedded in the raw. Your post-processing software reads these tags and makes adjustments. This is why C1 and LR know what lens you’ve used and can apply a profile automatically. With color digital Leicas, color shifts and casts are baked into the raw by the camera and as far as I’m aware can’t be changed in post. Thanks. I picked up an M10 the other day, and see what's happening much more clearly now. The M246 lets you defeat the vignetting correction, so I wasn't seeing anything happening and thought it required further action from me.", "link": "https://www.l-camera-forum.com/topic/318174-lens-detection-what-does-it-do/?tab=comments#comment-4147449", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "just now, anakronox said: the exif data for the lens (when coded) and any other adjustments made based on the lens are embedded in the raw. your post-processing software reads these -----> tags !!!  and makes adjustments. this is why c1 and lr know what lens you’ve used and can apply a profile automatically. with color digital leicas, color shifts and casts are baked into the raw by the camera and as far as i’m aware can’t be changed in post. thanks. i picked up an m10 the other day, and see what's happening much more clearly now. the m246 lets you defeat the vignetting correction, so i wasn't seeing anything happening and thought it required further action from me.", "sortedWord": "None", "identifyer": 23764, "year": "2021"}, {"Unnamed: 0": 362900, "autor": "John Black", "date": 1611902220000, "content": "Updated the M10-M and M10-R without issue. The perspective correction adds tags for Lightroom, so Lightroom users will benefit. I use Capture One, so no upside there. Considering that the level guides in the M10-M and M10-R aren't very sensitive / accurate, it'll be interesting to see what people think of the perspective correction results.", "link": "https://www.l-camera-forum.com/topic/317432-m10m-firmware-update/?tab=comments#comment-4127818", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "updated the m10-m and m10-r without issue. the perspective correction adds -----> tags !!!  for lightroom, so lightroom users will benefit. i use capture one, so no upside there. considering that the level guides in the m10-m and m10-r aren't very sensitive / accurate, it'll be interesting to see what people think of the perspective correction results.", "sortedWord": "None", "identifyer": 24146, "year": "2021"}, {"Unnamed: 0": 362905, "autor": "SrMi", "date": 1611966480000, "content": " 5 hours ago, erudolph said: The perspective control feature is not being recognized by Lightroom classic 10.1.1 You are correct, it does not work with the latest LrC or ACR. The tags are in the DNG file, but Adobe is not able to apply the changes. It works great with M10-R files. (Of course, PC works on JPG files) Edited January 30 by SrMi", "link": "https://www.l-camera-forum.com/topic/317432-m10m-firmware-update/?tab=comments#comment-4128621", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": " 5 hours ago, erudolph said: the perspective control feature is not being recognized by lightroom classic 10.1.1 you are correct, it does not work with the latest lrc or acr. the -----> tags !!!  are in the dng file, but adobe is not able to apply the changes. it works great with m10-r files. (of course, pc works on jpg files) edited january 30 by srmi", "sortedWord": "None", "identifyer": 24151, "year": "2021"}, {"Unnamed: 0": 362907, "autor": "dkmoore", "date": 1612102740000, "content": "On 1/29/2021 at 7:28 PM, SrMi said: You are correct, it does not work with the latest LrC or ACR. The tags are in the DNG file, but Adobe is not able to apply the changes. It works great with M10-R files. (Of course, PC works on JPG files) That is strange. It works for me in LR classic. There are some Adobe updates that were pushed. Did you update ? I have the subscription model so I’m assuming I have 10.1.1 but I’ll double check.", "link": "https://www.l-camera-forum.com/topic/317432-m10m-firmware-update/?tab=comments#comment-4129866", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "on 1/29/2021 at 7:28 pm, srmi said: you are correct, it does not work with the latest lrc or acr. the -----> tags !!!  are in the dng file, but adobe is not able to apply the changes. it works great with m10-r files. (of course, pc works on jpg files) that is strange. it works for me in lr classic. there are some adobe updates that were pushed. did you update ? i have the subscription model so i’m assuming i have 10.1.1 but i’ll double check.", "sortedWord": "None", "identifyer": 24153, "year": "2021"}, {"Unnamed: 0": 370507, "autor": "boojum", "date": 1612556160000, "content": "10 hours ago, costa43 said: I just picked up an M9-p after enjoying my recent m8 purchase so much. Whilst doing my research it seemed that the cameras with the old sensors were still hovering around the 2000 euro mark. Those that had corrosion already were closer to the 1000 euro mark. There is an argument to pick up a corroded sensor and have it replaced by a company like Kolari who offer the replacement service still. Unless the camera you buy at 2000 Euros has the upgraded sensor you are likely to be looking at the US$1000 to US$1500 price tag for an upgrade to the new sensor cover glass.", "link": "https://www.l-camera-forum.com/topic/315712-leica-m9-to-be-or-not-to-be/?tab=comments#comment-4134448", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "10 hours ago, costa43 said: i just picked up an m9-p after enjoying my recent m8 purchase so much. whilst doing my research it seemed that the cameras with the old sensors were still hovering around the 2000 euro mark. those that had corrosion already were closer to the 1000 euro mark. there is an argument to pick up a corroded sensor and have it replaced by a company like kolari who offer the replacement service still. unless the camera you buy at 2000 euros has the upgraded sensor you are likely to be looking at the us$1000 to us$1500 price -----> tag !!!  for an upgrade to the new sensor cover glass.", "sortedWord": "None", "identifyer": 31807, "year": "2021"}, {"Unnamed: 0": 370508, "autor": "costa43", "date": 1612559820000, "content": "1 hour ago, boojum said: Unless the camera you buy at 2000 Euros has the upgraded sensor you are likely to be looking at the US$1000 to US$1500 price tag for an upgrade to the new sensor cover glass. That's my point. You could be better off buying a corroded m9 and paying the 1000 dollars to replace the sensor.", "link": "https://www.l-camera-forum.com/topic/315712-leica-m9-to-be-or-not-to-be/?tab=comments#comment-4134485", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1 hour ago, boojum said: unless the camera you buy at 2000 euros has the upgraded sensor you are likely to be looking at the us$1000 to us$1500 price -----> tag !!!  for an upgrade to the new sensor cover glass. that's my point. you could be better off buying a corroded m9 and paying the 1000 dollars to replace the sensor.", "sortedWord": "None", "identifyer": 31808, "year": "2021"}, {"Unnamed: 0": 388958, "autor": "Ouroboros", "date": 1631607900000, "content": "I bought my MP new in 2006. It always seems to tag along with me when I go away or out for a walk and it's reached the status of an Old Friend to me now. Never had any serious thoughts of buying an older film M, I'd rather put the money into expanding my M lens options, which happens very infrequently. I wouldn't rule out buying a new MA at some point, I just don't 'need' one.", "link": "https://www.l-camera-forum.com/topic/320623-of-all-the-film-m-cameras-you-own/page/5/?tab=comments#comment-4274980", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i bought my mp new in 2006. it always seems to -----> tag !!!  along with me when i go away or out for a walk and it's reached the status of an old friend to me now. never had any serious thoughts of buying an older film m, i'd rather put the money into expanding my m lens options, which happens very infrequently. i wouldn't rule out buying a new ma at some point, i just don't 'need' one.", "sortedWord": "None", "identifyer": 1413, "year": "2021"}, {"Unnamed: 0": 390867, "autor": "plasticman", "date": 1622134140000, "content": " 55 minutes ago, Steven said: Have you hear of instagram filters? It's a pretty dark world. As an anecdote, a friend of mind create in less than 10 minutes an instagram filters. In 2 months only, it was used 2,4 billion times. young people like filters. Back in 2013 one of my best friends created a website called filter-fakers which crawled Instagram and auto-posted images that had been tagged by the user with the #nofilter tag (pretending to be an unfiltered image) and then listing which filters had actually been used (from the metadata). It was pretty hilarious. It stopped working about 5 years ago I think - when insta blocked that type of scraping. My impression is that kids using film cameras genuinely want a tactile, authentic, real experience when they use film, which is so different to their otherwise digital existence.", "link": "https://www.l-camera-forum.com/topic/321215-a-film-look-in-the-near-future/page/6/?tab=comments#comment-4208930", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": " 55 minutes ago, steven said: have you hear of instagram filters? it's a pretty dark world. as an anecdote, a friend of mind create in less than 10 minutes an instagram filters. in 2 months only, it was used 2,4 billion times. young people like filters. back in 2013 one of my best friends created a website called filter-fakers which crawled instagram and auto-posted images that had been -----> tagged !!!  by the user with the #nofilter tag (pretending to be an unfiltered image) and then listing which filters had actually been used (from the metadata). it was pretty hilarious. it stopped working about 5 years ago i think - when insta blocked that type of scraping. my impression is that kids using film cameras genuinely want a tactile, authentic, real experience when they use film, which is so different to their otherwise digital existence.", "sortedWord": "None", "identifyer": 3323, "year": "2021"}, {"Unnamed: 0": 391609, "autor": "adan", "date": 1620281160000, "content": "The US (and EU) suspended the tariff war that include German-made lenses - but I expect it may take many months for all the lenses already \"Made in Portugal\" (or still in progress as of March 3) to get sold off dealers shelves. For the $500 difference, it is probably not economical for Leica to call them all back, swap out the parts engraved \"Portugal,\" and then re-sell them at the \"German\" price. They'll just slowly get tagged \"no longer available\" as folks buy the last of them.", "link": "https://www.l-camera-forum.com/topic/320586-analog-leica-produced-in-portugal/page/2/?tab=comments#comment-4195307", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "the us (and eu) suspended the tariff war that include german-made lenses - but i expect it may take many months for all the lenses already \"made in portugal\" (or still in progress as of march 3) to get sold off dealers shelves. for the $500 difference, it is probably not economical for leica to call them all back, swap out the parts engraved \"portugal,\" and then re-sell them at the \"german\" price. they'll just slowly get -----> tagged !!!  \"no longer available\" as folks buy the last of them.", "sortedWord": "None", "identifyer": 4070, "year": "2021"}, {"Unnamed: 0": 392336, "autor": "odeon", "date": 1618658760000, "content": "23 hours ago, earthphoto said: As far as I know, APO are made to reduce colour fringing on digital cameras. There should not be any fringing with film, because the film layers are already correct. Just my 2 cents. Actually, not... If you scan the negative in using a drum scanner whose resolving power is effectively above 3200 ppi, you will be able to see the chromatic aberration whether the lens has been labelled as APO or not. APO-tagged lenses facilitate to reduce the chromatic aberration, not to remove. --img--  Edited April 17 by odeon", "link": "https://www.l-camera-forum.com/topic/306474-experience-with-50-apo-on-film/page/2/?tab=comments#comment-4183161", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "23 hours ago, earthphoto said: as far as i know, apo are made to reduce colour fringing on digital cameras. there should not be any fringing with film, because the film layers are already correct. just my 2 cents. actually, not... if you scan the negative in using a drum scanner whose resolving power is effectively above 3200 ppi, you will be able to see the chromatic aberration whether the lens has been labelled as apo or not. apo------> tagged !!!  lenses facilitate to reduce the chromatic aberration, not to remove. --img--  edited april 17 by odeon", "sortedWord": "None", "identifyer": 4799, "year": "2021"}, {"Unnamed: 0": 393074, "autor": "nitroplait", "date": 1614242580000, "content": "Shoot a mail to Leica directly, only they will be able to inform you their preferred method of receiving the camera. Be warned however. Their service will come with quite a price tag - which you may want to inquirer about before submitting your camera. There are qualified independent repair techs in the EU that will do as good or perhaps even better job, at a lower price (but none are exactly cheap).", "link": "https://www.l-camera-forum.com/topic/318343-leica-m6-repairingcla-advice/?tab=comments#comment-4148412", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "shoot a mail to leica directly, only they will be able to inform you their preferred method of receiving the camera. be warned however. their service will come with quite a price -----> tag !!!  - which you may want to inquirer about before submitting your camera. there are qualified independent repair techs in the eu that will do as good or perhaps even better job, at a lower price (but none are exactly cheap).", "sortedWord": "None", "identifyer": 5538, "year": "2021"}, {"Unnamed: 0": 402489, "autor": "cboy", "date": 1625074320000, "content": "On 6/29/2021 at 5:05 PM, Cobram said: As per Voigtländer lenses in general: I think they are making a marvelous job. The only thing that is holding them back is proper M mount \"budget\" camera. It would be great idea if voigtlander made digital bodies to suit their lenses. All the better for competition and to promote their brand even though its a niche market. A digital body calibrated for their own lenses would have huge appeal as it did for their film line. The epson rd series was a great camera to rival leica later down the track, despite being the first digital rangefinder with a high price tag at the start. The complaints of the fuji xpro and x100v is that the lack of manual / coupled controls will never give a rangefinder experience that many want. Imho the Pixii and Zx1 really are aimed too high a price to allow consumers to enter the digital rangefinder market and so are left to compromise to the above or a second hand m body....its a shame. Maybe because the r&d of first gen products are always high i guess. Perhaps a collaboration with Pixii/Epson and Voigtlander in the future? Im quite sure many would shift off from leica if there was company would provide a similar product offering... The status quo will forever be Auto everything... Apologies for the rant.", "link": "https://www.l-camera-forum.com/topic/322241-voigtlanderthe-best-leica-lenses-in-the-world/page/2/?tab=comments#comment-4229067", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 6/29/2021 at 5:05 pm, cobram said: as per voigtländer lenses in general: i think they are making a marvelous job. the only thing that is holding them back is proper m mount \"budget\" camera. it would be great idea if voigtlander made digital bodies to suit their lenses. all the better for competition and to promote their brand even though its a niche market. a digital body calibrated for their own lenses would have huge appeal as it did for their film line. the epson rd series was a great camera to rival leica later down the track, despite being the first digital rangefinder with a high price -----> tag !!!  at the start. the complaints of the fuji xpro and x100v is that the lack of manual / coupled controls will never give a rangefinder experience that many want. imho the pixii and zx1 really are aimed too high a price to allow consumers to enter the digital rangefinder market and so are left to compromise to the above or a second hand m body....its a shame. maybe because the r&d of first gen products are always high i guess. perhaps a collaboration with pixii/epson and voigtlander in the future? im quite sure many would shift off from leica if there was company would provide a similar product offering... the status quo will forever be auto everything... apologies for the rant.", "sortedWord": "None", "identifyer": 15226, "year": "2021"}, {"Unnamed: 0": 402502, "autor": "Ko.Fe.", "date": 1625159340000, "content": "23 hours ago, cboy said: It would be great idea if voigtlander made digital bodies to suit their lenses. All the better for competition and to promote their brand even though its a niche market. A digital body calibrated for their own lenses would have huge appeal as it did for their film line. The epson rd series was a great camera to rival leica later down the track, despite being the first digital rangefinder with a high price tag at the start. The complaints of the fuji xpro and x100v is that the lack of manual / coupled controls will never give a rangefinder experience that many want. Imho the Pixii and Zx1 really are aimed too high a price to allow consumers to enter the digital rangefinder market and so are left to compromise to the above or a second hand m body....its a shame. Maybe because the r&d of first gen products are always high i guess. Perhaps a collaboration with Pixii/Epson and Voigtlander in the future? Im quite sure many would shift off from leica if there was company would provide a similar product offering... The status quo will forever be Auto everything... Apologies for the rant. Cosina is using more effective way than doing something they not really up to speed. They are making lenses for not just M mount. It makes more sense, rather than making digital rangefinder for very tiny market. I'd rather see EVF in the corner body with sensor accepting wide M lenses. IBIS, dust reduction. My Canon RP with Nokton 35 1.4 II M is totally fine on IQ and EVF focusing is superior to RF.", "link": "https://www.l-camera-forum.com/topic/322241-voigtlanderthe-best-leica-lenses-in-the-world/page/3/?tab=comments#comment-4229681", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "23 hours ago, cboy said: it would be great idea if voigtlander made digital bodies to suit their lenses. all the better for competition and to promote their brand even though its a niche market. a digital body calibrated for their own lenses would have huge appeal as it did for their film line. the epson rd series was a great camera to rival leica later down the track, despite being the first digital rangefinder with a high price -----> tag !!!  at the start. the complaints of the fuji xpro and x100v is that the lack of manual / coupled controls will never give a rangefinder experience that many want. imho the pixii and zx1 really are aimed too high a price to allow consumers to enter the digital rangefinder market and so are left to compromise to the above or a second hand m body....its a shame. maybe because the r&d of first gen products are always high i guess. perhaps a collaboration with pixii/epson and voigtlander in the future? im quite sure many would shift off from leica if there was company would provide a similar product offering... the status quo will forever be auto everything... apologies for the rant. cosina is using more effective way than doing something they not really up to speed. they are making lenses for not just m mount. it makes more sense, rather than making digital rangefinder for very tiny market. i'd rather see evf in the corner body with sensor accepting wide m lenses. ibis, dust reduction. my canon rp with nokton 35 1.4 ii m is totally fine on iq and evf focusing is superior to rf.", "sortedWord": "None", "identifyer": 15239, "year": "2021"}, {"Unnamed: 0": 405757, "autor": "Dennis", "date": 1633017300000, "content": "3 hours ago, Simone_DF said: Voigtlander VM 35mm f/2,5 Color Skopar Pancake II Voigtlander Nokton 35mm f/1,4 VM II No experience with the Color-Skopar, but the Nokton, wow, it's a bargain and a must-have glass. It's like to have two lenses in one: at f/4 and f/8 is super sharp and modern, sharp enough at f/2, and dreamy and a bit glowy (but fantastic) at f/1.4. All of this is in one of the smaller fast 35mm available for M-mount (at a \"ridiculous' price tag). I tried a Color-Skopar once, for a bit of while: lovely tiny lens, but it doesn't compete (for me) with the Nokton. . If you shoot only at f/4-5.6-8, maybe the Skopar could be the best choice. Cheaper, lighter, smaller. If you want to shoot at any apertures, Nokton is the one. My 2 cents. P.s. get the MC Edited September 30 by Dennis", "link": "https://www.l-camera-forum.com/topic/324981-voigtlander-35mm-color-skopar-ii-vs-nokton-35mm-f14-vm-ii/?tab=comments#comment-4284209", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "3 hours ago, simone_df said: voigtlander vm 35mm f/2,5 color skopar pancake ii voigtlander nokton 35mm f/1,4 vm ii no experience with the color-skopar, but the nokton, wow, it's a bargain and a must-have glass. it's like to have two lenses in one: at f/4 and f/8 is super sharp and modern, sharp enough at f/2, and dreamy and a bit glowy (but fantastic) at f/1.4. all of this is in one of the smaller fast 35mm available for m-mount (at a \"ridiculous' price -----> tag !!! ). i tried a color-skopar once, for a bit of while: lovely tiny lens, but it doesn't compete (for me) with the nokton. . if you shoot only at f/4-5.6-8, maybe the skopar could be the best choice. cheaper, lighter, smaller. if you want to shoot at any apertures, nokton is the one. my 2 cents. p.s. get the mc edited september 30 by dennis", "sortedWord": "None", "identifyer": 18525, "year": "2021"}, {"Unnamed: 0": 406266, "autor": "Milan_S", "date": 1632294180000, "content": "3 hours ago, roverover said: This is splendid. Thank You for the information. Are these offered in some particular place to LHSA members or does the LHSA promote special editions on the LHSA home page when they are made available? I am a recent LHSA member. There is a difference between LHSA and Leica Historica, these are two different organizations. This lens is offered by Leica Historica and only 50 will be produced which could only be bought by Historica members. I have reserved one and I am sure these will pop up later with a much higher price tag...", "link": "https://www.l-camera-forum.com/topic/324740-50mm-apo-summicron-m-%E2%80%9Clhsa-silver-edition-hard-to-find/?tab=comments#comment-4279323", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "3 hours ago, roverover said: this is splendid. thank you for the information. are these offered in some particular place to lhsa members or does the lhsa promote special editions on the lhsa home page when they are made available? i am a recent lhsa member. there is a difference between lhsa and leica historica, these are two different organizations. this lens is offered by leica historica and only 50 will be produced which could only be bought by historica members. i have reserved one and i am sure these will pop up later with a much higher price -----> tag !!! ...", "sortedWord": "None", "identifyer": 19045, "year": "2021"}, {"Unnamed: 0": 406267, "autor": "Steven", "date": 1632295320000, "content": "18 minutes ago, Milan_S said: There is a difference between LHSA and Leica Historica, these are two different organizations. This lens is offered by Leica Historica and only 50 will be produced which could only be bought by Historica members. I have reserved one and I am sure these will pop up later with a much higher price tag... Hi, do you already know the price of the lens paired with the blue mp ? thanks", "link": "https://www.l-camera-forum.com/topic/324740-50mm-apo-summicron-m-%E2%80%9Clhsa-silver-edition-hard-to-find/?tab=comments#comment-4279333", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "18 minutes ago, milan_s said: there is a difference between lhsa and leica historica, these are two different organizations. this lens is offered by leica historica and only 50 will be produced which could only be bought by historica members. i have reserved one and i am sure these will pop up later with a much higher price -----> tag !!! ... hi, do you already know the price of the lens paired with the blue mp ? thanks", "sortedWord": "None", "identifyer": 19046, "year": "2021"}, {"Unnamed: 0": 410103, "autor": "solamnus", "date": 1622560320000, "content": "1 minute ago, jaeger said: oops, didn't have my morning coffee yet. Well... 50 Summilux I, II & III will do. heh cheers, yeh thought the summilux was a bit out of that price range , although id be ecstatic if i did found any at all there thank you. I found a summicron Rigid version for around 1000 EU, is that an ok price tag?", "link": "https://www.l-camera-forum.com/topic/321423-my-first-leica-lens-some-suggestions-are-welcome/?tab=comments#comment-4211838", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1 minute ago, jaeger said: oops, didn't have my morning coffee yet. well... 50 summilux i, ii & iii will do. heh cheers, yeh thought the summilux was a bit out of that price range , although id be ecstatic if i did found any at all there thank you. i found a summicron rigid version for around 1000 eu, is that an ok price -----> tag !!! ?", "sortedWord": "None", "identifyer": 22931, "year": "2021"}, {"Unnamed: 0": 410106, "autor": "a.noctilux", "date": 1622561820000, "content": "26 minutes ago, solamnus said: heh cheers, yeh thought the summilux was a bit out of that price range , although id be ecstatic if i did found any at all there thank you. I found a summicron Rigid version for around 1000 EU, is that an ok price tag? My good opinion on Rigid can not cancell it's heavy, focus only to 1m 😉. Very good lens now a bit old so be aware of some flaws in glasses, focus mechanism, etc. Just in case, I never hear Summarit-M lenses \"real\" flaws (... only user faults in most case). Edited June 1 by a.noctilux", "link": "https://www.l-camera-forum.com/topic/321423-my-first-leica-lens-some-suggestions-are-welcome/?tab=comments#comment-4211867", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "26 minutes ago, solamnus said: heh cheers, yeh thought the summilux was a bit out of that price range , although id be ecstatic if i did found any at all there thank you. i found a summicron rigid version for around 1000 eu, is that an ok price -----> tag !!! ? my good opinion on rigid can not cancell it's heavy, focus only to 1m 😉. very good lens now a bit old so be aware of some flaws in glasses, focus mechanism, etc. just in case, i never hear summarit-m lenses \"real\" flaws (... only user faults in most case). edited june 1 by a.noctilux", "sortedWord": "None", "identifyer": 22934, "year": "2021"}, {"Unnamed: 0": 410432, "autor": "Gobert", "date": 1612192020000, "content": " I’m somewhat puzzled, because it has a similar price tag as the 50/2.0 Edited February 1 by Gobert", "link": "https://www.l-camera-forum.com/topic/315754-voigtlander-apo-lanthar-50mm-f2-aspherical-vm-lens-to-be-announced-soon/page/9/?tab=comments#comment-4130830", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " i’m somewhat puzzled, because it has a similar price -----> tag !!!  as the 50/2.0 edited february 1 by gobert", "sortedWord": "None", "identifyer": 23267, "year": "2021"}, {"Unnamed: 0": 412936, "autor": "adan", "date": 1625376660000, "content": "1) always remember that the digital Ms allow you to \"tag\" a lens from a menu-list of lenses - they don't have to be coded to be cataloged. So long as you go into the lens list and change the setting with every lens change. The M10 (at least) will allow you to select the pre-ASPH 35 Summilux from the menu, even though that is not a codable lens: \"35 f/1.4 11869/11870/11860.\" Same for the 50mm Summiluxes 11868/11856/11114 2) If you are using an M10 variant, you effectively get ONE \"freebie\" lens ID to intermix with your coded lenses. The M10 firmware will swap automatically between coded lenses - and any one uncoded lens that remains \"permanently\" assigned in the lens menu (until you change the lens menu setting yourself). E.G. I have coded lenses 21/28/35/75/90 - and an \"uncodable\" 135 TE. I leave the camera's lens menu set to Manual M - \"135mm Tele-Elmar f/4.0\" If I mount any of my coded lenses, the M10 automatically detects the coding, and uses that, ignoring the menu setting. If I switch to my 135 (or any uncoded lens), the M10 automatically detects an uncoded lens. And automatically uses the current menu selection. So using the 135 is as \"seamless\" as if it were coded (just swap and shoot - no menu-diving at all). 3) For the most part, the critical effects of the coding or menu selection (correction of Italian-flag color stains with wide-angles) are reasonably swappable between similar optical designs. I.E. the menu setting for the 35 Summicron v.4 works just fine with a 35mm Summicron v.3 or v.2 (and probably fine for the v.1 8-element as well, although I haven't tried it). They are all 6/7/8-element double-gauss lenses. And the Leica 35mm Summilux pre-ASPH menu (or hand-coding, with Sharpie pen) works equally well for the Voigtländer 35mm Nokton \"Classic\" f/1.4 - which is nearly a dead-ringer (optically) for the original Leica lens. The 135 TE setting will work fine for a Hektor 135 or an Elmar 135. Or an old Nikon or Canon LTM one, for that matter.", "link": "https://www.l-camera-forum.com/topic/322255-lenses-that-leica-will-6-bit-code/?tab=comments#comment-4231320", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1) always remember that the digital ms allow you to \"-----> tag !!! \" a lens from a menu-list of lenses - they don't have to be coded to be cataloged. so long as you go into the lens list and change the setting with every lens change. the m10 (at least) will allow you to select the pre-asph 35 summilux from the menu, even though that is not a codable lens: \"35 f/1.4 11869/11870/11860.\" same for the 50mm summiluxes 11868/11856/11114 2) if you are using an m10 variant, you effectively get one \"freebie\" lens id to intermix with your coded lenses. the m10 firmware will swap automatically between coded lenses - and any one uncoded lens that remains \"permanently\" assigned in the lens menu (until you change the lens menu setting yourself). e.g. i have coded lenses 21/28/35/75/90 - and an \"uncodable\" 135 te. i leave the camera's lens menu set to manual m - \"135mm tele-elmar f/4.0\" if i mount any of my coded lenses, the m10 automatically detects the coding, and uses that, ignoring the menu setting. if i switch to my 135 (or any uncoded lens), the m10 automatically detects an uncoded lens. and automatically uses the current menu selection. so using the 135 is as \"seamless\" as if it were coded (just swap and shoot - no menu-diving at all). 3) for the most part, the critical effects of the coding or menu selection (correction of italian-flag color stains with wide-angles) are reasonably swappable between similar optical designs. i.e. the menu setting for the 35 summicron v.4 works just fine with a 35mm summicron v.3 or v.2 (and probably fine for the v.1 8-element as well, although i haven't tried it). they are all 6/7/8-element double-gauss lenses. and the leica 35mm summilux pre-asph menu (or hand-coding, with sharpie pen) works equally well for the voigtländer 35mm nokton \"classic\" f/1.4 - which is nearly a dead-ringer (optically) for the original leica lens. the 135 te setting will work fine for a hektor 135 or an elmar 135. or an old nikon or canon ltm one, for that matter.", "sortedWord": "None", "identifyer": 25788, "year": "2021"}, {"Unnamed: 0": 413919, "autor": "Simone_DF", "date": 1634385420000, "content": "1 hour ago, Chris Nebard said: I’m definitely thinking of adding that little 24mm f3.5 Daniel speaks so highly of though, and possibly the new 90! 🤦🏼‍♂️😂 Do get the 24mm, a small little gem. Punches way above its price tag.", "link": "https://www.l-camera-forum.com/topic/320668-jonos-review-leica-vario-elmarit-sl-24-70-f28-asph/page/8/?tab=comments#comment-4293821", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1 hour ago, chris nebard said: i’m definitely thinking of adding that little 24mm f3.5 daniel speaks so highly of though, and possibly the new 90! 🤦🏼‍♂️😂 do get the 24mm, a small little gem. punches way above its price -----> tag !!! .", "sortedWord": "None", "identifyer": 26853, "year": "2021"}, {"Unnamed: 0": 413920, "autor": "Chris Nebard", "date": 1634394000000, "content": "2 hours ago, Simone_DF said: Do get the 24mm, a small little gem. Punches way above its price tag. Thanks Simone_DF, I will 👍", "link": "https://www.l-camera-forum.com/topic/320668-jonos-review-leica-vario-elmarit-sl-24-70-f28-asph/page/8/?tab=comments#comment-4293906", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "2 hours ago, simone_df said: do get the 24mm, a small little gem. punches way above its price -----> tag !!! . thanks simone_df, i will 👍", "sortedWord": "None", "identifyer": 26854, "year": "2021"}, {"Unnamed: 0": 414969, "autor": "caissa", "date": 1636980060000, "content": " Who cares ? Or rather why should anyone care ? Probably all zooms are designed by other companies than Leica. Leica never had the skills to design/invent the latest and greatest zooms. There are specialists for that and it is wise to use this specialist knowledge instead of inventing something inferior on one’s own. The quality of the lenses comes from the precision of tolerances in manufacturing. And as far as that the zooms are fine. There are specialists, so there are different specialists for different lenses. So the zooms are designed by several different designers. (Panasonic, Konica, Sigma, ...). Leica is the “customer” who decides which priorities will be selected, so in this sense they are still Leica designed, with a “Leica look” and quality. But also with a Leica price tag. Edited November 15 by caissa", "link": "https://www.l-camera-forum.com/topic/319852-sve-16-35-or-summilux-m-21-14/page/3/?tab=comments#comment-4313791", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " who cares ? or rather why should anyone care ? probably all zooms are designed by other companies than leica. leica never had the skills to design/invent the latest and greatest zooms. there are specialists for that and it is wise to use this specialist knowledge instead of inventing something inferior on one’s own. the quality of the lenses comes from the precision of tolerances in manufacturing. and as far as that the zooms are fine. there are specialists, so there are different specialists for different lenses. so the zooms are designed by several different designers. (panasonic, konica, sigma, ...). leica is the “customer” who decides which priorities will be selected, so in this sense they are still leica designed, with a “leica look” and quality. but also with a leica price -----> tag !!! . edited november 15 by caissa", "sortedWord": "None", "identifyer": 27905, "year": "2021"}, {"Unnamed: 0": 415007, "autor": "hansvons", "date": 1636668420000, "content": "No. Not for the SL2-S, whose colour is Rec2020 based. But I had to check how Canon Log2 looks in Rec2020. I'd search for a LUT LUT that transforms Canon Log2 to Rec2020. Quite likely that Canon provides such a LUT; rec2020 is the future video space, after all. The best would be to look out for a colour managing common denominator like ACES. That way, you tag the Leica footage with Rec2020 in the IDT list and the Canon Log2 footage with Canons proprietary ACES Canon Log2 IDT. Mixing camera brands is a typical use case for why ACES has been developed.", "link": "https://www.l-camera-forum.com/topic/326445-sl2-s-color-space-question-in-editing/?tab=comments#comment-4311604", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "no. not for the sl2-s, whose colour is rec2020 based. but i had to check how canon log2 looks in rec2020. i'd search for a lut lut that transforms canon log2 to rec2020. quite likely that canon provides such a lut; rec2020 is the future video space, after all. the best would be to look out for a colour managing common denominator like aces. that way, you -----> tag !!!  the leica footage with rec2020 in the idt list and the canon log2 footage with canons proprietary aces canon log2 idt. mixing camera brands is a typical use case for why aces has been developed.", "sortedWord": "None", "identifyer": 27943, "year": "2021"}, {"Unnamed: 0": 415436, "autor": "hansvons", "date": 1636739940000, "content": " From time to time, I create social media campaigns on landscape conservation and climate protection. A snippet of my last campaign can be seen below. These gigs are mostly one-man-band endeavours that I really enjoy (often, travelling and tons of hiking involved). In March, I bought the SL2-S for such projects. Why the SL2-S and not a Sony, Canon or Panasonic camera? First, I'm a skin tone aficionado; and I have a clear idea of what sky blue should look like. For me, Arri is the only manufacturer who nails that convincingly. Their price tag is prohibitive, plus there are millions of other reasons why not to carry such a camera with you. Overall, after looking intensively over half a year into the primary Japanese cameras, I ended up with Leica because Leica's take on colours closely matches my idea of colour. Plus, the SL-line feels unbreakable and shows no issues with inclement weather (following my star, I tend to take my gear to unpleasant places without much thinking). Secondly, I needed a zoom lens that renders particularly dimensional images, helping to draw the audience into the video's story. I've worked with Canon's and Nikon's offerings in the 24-70 area. I find that they don't have much of a personality besides being sharp. However, the 24-90 Elmarit SL zoom tics the dimensionality box impressively, showing some character. Still, it sports the usual AF-based, dreadful fly-by-wire focusing that makes manual focussing a woeful experience, albeit the adjustable focus-throw settings help a bit. But after some time, I adjusted to the 24-90's manual focusing and stopped complaining. But why is the focus peaking turned down when the camera isn't rolling but works in its full glory (almost too much) when shooting? That should be fixed in a firmware update. I use Leica's L-log because it offers the broadest dynamic range, leaving no questions. It took me some time to figure out what exactly L-log is. Long story short: L-log is a 10 bit-optimised log curve living in the large HDR Rec 2020 colour space. That's why, without the Rec 709 LUT, the colours are way off in regular SDR HD. But for the best colours and best dynamic range, working in the camera's native colour space Rec 2020 is advisable (could also be ACES). Most NLE support that large colour space; after all, it's the future's video standard. On the footage side, the Sl2-S delivers footage like a little cine camera. The best dynamic range with a subtle texture can be obtained at ISO 800, my go-to ISO setting for almost everything. At ISO 6400, the footage looks still pretty good. In that area, the SL2-S outperforms Arri and any other cine camera I know. Deliberate underexposed by two stops, video sequences with ISO set at 800 can be brought back without any colour shifts and noticeable noise. Four stops underexposed will show some colour shift in the footage and noise. At 6 stops, the video image is grainy, shows pronounced colour shifts and isn't usable anymore. That is pretty remarkable. I've shot this video with the SL2-S, including the stills. A few easy to spot stock scenes are included. As I would do with an Arri Alexa, the exposure factored in the sky's bright highlights: A wish list for the next firmware update: In L-Log, focus peaking when idle as pronounced as when rolling Braw or ProRes Raw recording via HDMI Improved AF-C (in its current state, it's unusable in video mode) When thinking about a future SL3-S, I could imagine this: 6K/4K ProRes 444 and ProRes Raw internally Snappy and harmoniously moving AF-C, mimicking manual focus pulls ACES IDT and a 12 Bit log curve similar to Arri C-Log. --img-- ", "link": "https://www.l-camera-forum.com/topic/326478-video-and-stills-sl2-s-as-a-hybrid-camera/?tab=comments#comment-4312074", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " from time to time, i create social media campaigns on landscape conservation and climate protection. a snippet of my last campaign can be seen below. these gigs are mostly one-man-band endeavours that i really enjoy (often, travelling and tons of hiking involved). in march, i bought the sl2-s for such projects. why the sl2-s and not a sony, canon or panasonic camera? first, i'm a skin tone aficionado; and i have a clear idea of what sky blue should look like. for me, arri is the only manufacturer who nails that convincingly. their price -----> tag !!!  is prohibitive, plus there are millions of other reasons why not to carry such a camera with you. overall, after looking intensively over half a year into the primary japanese cameras, i ended up with leica because leica's take on colours closely matches my idea of colour. plus, the sl-line feels unbreakable and shows no issues with inclement weather (following my star, i tend to take my gear to unpleasant places without much thinking). secondly, i needed a zoom lens that renders particularly dimensional images, helping to draw the audience into the video's story. i've worked with canon's and nikon's offerings in the 24-70 area. i find that they don't have much of a personality besides being sharp. however, the 24-90 elmarit sl zoom tics the dimensionality box impressively, showing some character. still, it sports the usual af-based, dreadful fly-by-wire focusing that makes manual focussing a woeful experience, albeit the adjustable focus-throw settings help a bit. but after some time, i adjusted to the 24-90's manual focusing and stopped complaining. but why is the focus peaking turned down when the camera isn't rolling but works in its full glory (almost too much) when shooting? that should be fixed in a firmware update. i use leica's l-log because it offers the broadest dynamic range, leaving no questions. it took me some time to figure out what exactly l-log is. long story short: l-log is a 10 bit-optimised log curve living in the large hdr rec 2020 colour space. that's why, without the rec 709 lut, the colours are way off in regular sdr hd. but for the best colours and best dynamic range, working in the camera's native colour space rec 2020 is advisable (could also be aces). most nle support that large colour space; after all, it's the future's video standard. on the footage side, the sl2-s delivers footage like a little cine camera. the best dynamic range with a subtle texture can be obtained at iso 800, my go-to iso setting for almost everything. at iso 6400, the footage looks still pretty good. in that area, the sl2-s outperforms arri and any other cine camera i know. deliberate underexposed by two stops, video sequences with iso set at 800 can be brought back without any colour shifts and noticeable noise. four stops underexposed will show some colour shift in the footage and noise. at 6 stops, the video image is grainy, shows pronounced colour shifts and isn't usable anymore. that is pretty remarkable. i've shot this video with the sl2-s, including the stills. a few easy to spot stock scenes are included. as i would do with an arri alexa, the exposure factored in the sky's bright highlights: a wish list for the next firmware update: in l-log, focus peaking when idle as pronounced as when rolling braw or prores raw recording via hdmi improved af-c (in its current state, it's unusable in video mode) when thinking about a future sl3-s, i could imagine this: 6k/4k prores 444 and prores raw internally snappy and harmoniously moving af-c, mimicking manual focus pulls aces idt and a 12 bit log curve similar to arri c-log. --img-- ", "sortedWord": "None", "identifyer": 28375, "year": "2021"}, {"Unnamed: 0": 415840, "autor": "Slender", "date": 1615378860000, "content": "Hey you know waht should we find people and write a joint email to Lockcircle pledging to buy their cages together (they make a nice grouped sale) if they take the \"stupid\" label off the price tag? Edited March 10 by Slender", "link": "https://www.l-camera-forum.com/topic/318684-sl2s-looking-for-an-affordable-camera-cage/?tab=comments#comment-4157567", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "hey you know waht should we find people and write a joint email to lockcircle pledging to buy their cages together (they make a nice grouped sale) if they take the \"stupid\" label off the price -----> tag !!! ? edited march 10 by slender", "sortedWord": "None", "identifyer": 28780, "year": "2021"}, {"Unnamed: 0": 416236, "autor": "davidmknoble", "date": 1634560140000, "content": "Late to this thread, but I have spent the last 8 months using some R lenses on both the SL2 and SL2-S along with my R9 and R6.2. Similar to the early 2000’s shooting an M-4 with film and the 50 Summicron (v 4) and 35 Summicron ASPH, I shoot many of the R lenses at f/4 or f/5.6. In this range the R lenses are superb. No, they are not crisp on the corners like the SL primes, but they are 20 to 30 years older. The fact that they hold up now is incredible (IMHO). I even played with the (R’s) 50 cron at 2.8 and 28mm v1 at 2.8 and they were excellent in the middle. If I am concerned with corners, I use newer R lenses at f/8 or so. For example, the 35-70 f/4 lens (a lot like the M MATE) is great at f/8 for crisp outlines. The APO 90 is incredible, but one of the newest R lenses and like the M. The 35 elmarit v2 has a lot of distortion, so I shoot it level, but the 28 elmarit v1 is so incredibly small that I prefer it over the v2 larger with the unwieldy lens hood that pulls out and doesn’t lock. Other incredible lenses are the APO 180 f/2.8 at all f/stops. I like the 280 f/2.8, early version with the APO 1.4x for wildlife, again not for landscapes and corners, but middle focus. The best part about R lenses is the color correction. It was originally set for slide film and I actually set the saturation in lightroom to zero or negative just a little. Also, because it is set for slide film, my opinion is the shadows are a little darker and harder to recapture. But I know that going in and set my exposure accordingly. The colors are just super. I think this is what translated over to the S glass, because of the OVF of the S system, distortion was a priority as was color rendition. What you see is what you get (after the sensor plays with it of course). Overall, I echo the 60mm f/2.8 macro is a great lens and much sharper corner to corner than the 50 cron, but a little harsher on bokeh. For a great, inexpensive R lens the 90 Elmarit v2 is great and just about the same as the M lens (which I also love). It’s harder to find ROM lenses now, but the ROM adds a lot to using with the SL series because it records the lens. I got lucky and found a really clean version of the 28 Elmarit v1 lense with ROM. I want a 280 f/2.8 with ROM but its too expensive just to get the ROM. I have a 70-180 AP f/2.8, which is “affordable” compared to the 35-70 f/2.8 (crazy expensive) and that lens is really nice with colors at the beach. I’d say, if you can give up weather sealing., autofocus and absolute corner sharpness wide open, the R lenses are great alternatives. I mix and match and bring a film camera along lot keep the kit fairly small (larger than M, but still efficient). Nice thread! Thanks for letting me tag in so late.", "link": "https://www.l-camera-forum.com/topic/304988-r-lenses-vs-modern-m-lenses-for-the-sl2/page/2/?tab=comments#comment-4295033", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "late to this thread, but i have spent the last 8 months using some r lenses on both the sl2 and sl2-s along with my r9 and r6.2. similar to the early 2000’s shooting an m-4 with film and the 50 summicron (v 4) and 35 summicron asph, i shoot many of the r lenses at f/4 or f/5.6. in this range the r lenses are superb. no, they are not crisp on the corners like the sl primes, but they are 20 to 30 years older. the fact that they hold up now is incredible (imho). i even played with the (r’s) 50 cron at 2.8 and 28mm v1 at 2.8 and they were excellent in the middle. if i am concerned with corners, i use newer r lenses at f/8 or so. for example, the 35-70 f/4 lens (a lot like the m mate) is great at f/8 for crisp outlines. the apo 90 is incredible, but one of the newest r lenses and like the m. the 35 elmarit v2 has a lot of distortion, so i shoot it level, but the 28 elmarit v1 is so incredibly small that i prefer it over the v2 larger with the unwieldy lens hood that pulls out and doesn’t lock. other incredible lenses are the apo 180 f/2.8 at all f/stops. i like the 280 f/2.8, early version with the apo 1.4x for wildlife, again not for landscapes and corners, but middle focus. the best part about r lenses is the color correction. it was originally set for slide film and i actually set the saturation in lightroom to zero or negative just a little. also, because it is set for slide film, my opinion is the shadows are a little darker and harder to recapture. but i know that going in and set my exposure accordingly. the colors are just super. i think this is what translated over to the s glass, because of the ovf of the s system, distortion was a priority as was color rendition. what you see is what you get (after the sensor plays with it of course). overall, i echo the 60mm f/2.8 macro is a great lens and much sharper corner to corner than the 50 cron, but a little harsher on bokeh. for a great, inexpensive r lens the 90 elmarit v2 is great and just about the same as the m lens (which i also love). it’s harder to find rom lenses now, but the rom adds a lot to using with the sl series because it records the lens. i got lucky and found a really clean version of the 28 elmarit v1 lense with rom. i want a 280 f/2.8 with rom but its too expensive just to get the rom. i have a 70-180 ap f/2.8, which is “affordable” compared to the 35-70 f/2.8 (crazy expensive) and that lens is really nice with colors at the beach. i’d say, if you can give up weather sealing., autofocus and absolute corner sharpness wide open, the r lenses are great alternatives. i mix and match and bring a film camera along lot keep the kit fairly small (larger than m, but still efficient). nice thread! thanks for letting me -----> tag !!!  in so late.", "sortedWord": "None", "identifyer": 29179, "year": "2021"}, {"Unnamed: 0": 416706, "autor": "Photoworks", "date": 1612532880000, "content": "2 hours ago, MediaFotografie said: yes, I'm supposing iOS power saving machanism as an important part of the problem too - but others like Nikon solved all these problems completely. Not sure that is the case. The Leica q2 tags the GPS data well. the SL2 icon shows up and does not record the GPS location. I did many test with the iOS app. there is a problem somewhere.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/5/?tab=comments#comment-4134152", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "2 hours ago, mediafotografie said: yes, i'm supposing ios power saving machanism as an important part of the problem too - but others like nikon solved all these problems completely. not sure that is the case. the leica q2 -----> tags !!!  the gps data well. the sl2 icon shows up and does not record the gps location. i did many test with the ios app. there is a problem somewhere.", "sortedWord": "None", "identifyer": 29707, "year": "2021"}, {"Unnamed: 0": 416734, "autor": "Bernd B.", "date": 1613751840000, "content": "Just coming home from a studio-shooting (as usual with a pretty girl who is young and needs the money 😇😂) and was really curious because I had used the new version of the Foto-App (with GPS turned always on) on my iPhone (with everything „always on“ for Leica-App). What can I tell you? As I expected: not one single photo has been tagged with the GPS data, even so there the GPS-logo and the BluRay-logo both were visible on the top-screen of my Leica SL2 and the GPS was enabled in the app. Hey, Leica, this sucks!", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/6/?tab=comments#comment-4144710", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "just coming home from a studio-shooting (as usual with a pretty girl who is young and needs the money 😇😂) and was really curious because i had used the new version of the foto-app (with gps turned always on) on my iphone (with everything „always on“ for leica-app). what can i tell you? as i expected: not one single photo has been -----> tagged !!!  with the gps data, even so there the gps-logo and the bluray-logo both were visible on the top-screen of my leica sl2 and the gps was enabled in the app. hey, leica, this sucks!", "sortedWord": "None", "identifyer": 29735, "year": "2021"}, {"Unnamed: 0": 416748, "autor": "JulianHalliday", "date": 1617206340000, "content": "On 11/24/2019 at 7:01 PM, hotshew said: Unless Leica implements some changes, I'm going to resign myself to the SL2 being a GPS-less camera as nicci78 indicated. For GPS to be of value to me it needs to be on all the time and reliable... Yup. I've followed all the connection steps, seen the blue light, kept the FOTOS app foreground on my phone, and have so far failed to create a single geo-tagged image -- not one photo from my SL2-S shows up on the map in Lightroom. I'm eager to see what the impending firmware revision brings; functional GPS connectivity would be a critical upgrade so that I can once more use GPS data to correlate my movements with the photographs I make. Edit: I note the reset method of getting this to work, and will give that a go, with thanks to Photoworks and Ausimo for the information. Edited March 31 by JulianHalliday", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/7/?tab=comments#comment-4171505", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "on 11/24/2019 at 7:01 pm, hotshew said: unless leica implements some changes, i'm going to resign myself to the sl2 being a gps-less camera as nicci78 indicated. for gps to be of value to me it needs to be on all the time and reliable... yup. i've followed all the connection steps, seen the blue light, kept the fotos app foreground on my phone, and have so far failed to create a single geo------> tagged !!!  image -- not one photo from my sl2-s shows up on the map in lightroom. i'm eager to see what the impending firmware revision brings; functional gps connectivity would be a critical upgrade so that i can once more use gps data to correlate my movements with the photographs i make. edit: i note the reset method of getting this to work, and will give that a go, with thanks to photoworks and ausimo for the information. edited march 31 by julianhalliday", "sortedWord": "None", "identifyer": 29749, "year": "2021"}, {"Unnamed: 0": 416771, "autor": "Bernd B.", "date": 1624274220000, "content": "Yes, the problem is somewhere out there, between Leica‘ Firmware and the Leica-app. A Leica-engineer explained to me some details about a year ago. It all depends, too, on legal issues about connecting, copyrights, patents etc. To make it short: IF I want my photos tagged with gps-data, I use the solution via gps-app, smartphone and Lightroom CC.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/8/?tab=comments#comment-4223829", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "yes, the problem is somewhere out there, between leica‘ firmware and the leica-app. a leica-engineer explained to me some details about a year ago. it all depends, too, on legal issues about connecting, copyrights, patents etc. to make it short: if i want my photos -----> tagged !!!  with gps-data, i use the solution via gps-app, smartphone and lightroom cc.", "sortedWord": "None", "identifyer": 29772, "year": "2021"}, {"Unnamed: 0": 416788, "autor": "Bernd B.", "date": 1632849660000, "content": "See, not matter what firmware, this geotagging-thing is not working. Leica does not get it done, that‘s it. So I keep on using a gps-tracker with my iPhone and tag the data later via Lightroom to my photo-files. Life‘s too short to waste time on crappy apps.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4283190", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "see, not matter what firmware, this geotagging-thing is not working. leica does not get it done, that‘s it. so i keep on using a gps-tracker with my iphone and -----> tag !!!  the data later via lightroom to my photo-files. life‘s too short to waste time on crappy apps.", "sortedWord": "None", "identifyer": 29789, "year": "2021"}, {"Unnamed: 0": 416791, "autor": "LBJ2", "date": 1632914220000, "content": "17 hours ago, Bernd B. said: See, not matter what firmware, this geotagging-thing is not working. Leica does not get it done, that‘s it. So I keep on using a gps-tracker with my iPhone and tag the data later via Lightroom to my photo-files. Life‘s too short to waste time on crappy apps. I am not so quick to blame geotagging on the Fotos apps alone when these problems occur. It could very well be the iPhone ! For example. I typically pair the iPhone to my Apple watch and my car on a daily/regular basis. Occasionally, that connection just stops working for no known reason. I can see the iPhone is connected to either my car or Apple watch in their respective menus, but in reality the devices are not paired and not functioning. So I have to go through similar motions I described earlier and turn off the car or Apple Watch and turn off the iPhone and then restart everything for a complete pairing again. Sometimes I have to do this a few times and of course always a PITA because I rely daily on these devices syncing with each other. Lot of moving pieces to consider HW and SW and regular firmware updates particularly on the iPhone and each of these devices relies on the other to maintain a consistent connection.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4283543", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "17 hours ago, bernd b. said: see, not matter what firmware, this geotagging-thing is not working. leica does not get it done, that‘s it. so i keep on using a gps-tracker with my iphone and -----> tag !!!  the data later via lightroom to my photo-files. life‘s too short to waste time on crappy apps. i am not so quick to blame geotagging on the fotos apps alone when these problems occur. it could very well be the iphone ! for example. i typically pair the iphone to my apple watch and my car on a daily/regular basis. occasionally, that connection just stops working for no known reason. i can see the iphone is connected to either my car or apple watch in their respective menus, but in reality the devices are not paired and not functioning. so i have to go through similar motions i described earlier and turn off the car or apple watch and turn off the iphone and then restart everything for a complete pairing again. sometimes i have to do this a few times and of course always a pita because i rely daily on these devices syncing with each other. lot of moving pieces to consider hw and sw and regular firmware updates particularly on the iphone and each of these devices relies on the other to maintain a consistent connection.", "sortedWord": "None", "identifyer": 29792, "year": "2021"}, {"Unnamed: 0": 416797, "autor": "Simone_DF", "date": 1633165080000, "content": "It's not just geotagging. The most recent versions of iOS and Android have enhanced natural language processing. Go to your photo app and search \"beach\" or \"flower\" or \"dog\" or whatever, and you'll get quite a lot of positive search results. Photos are scanned and auto tagged through ML. I don't think we'll see anything similar in Lightroom or C1 for the foreseeable future.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4285101", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "it's not just geotagging. the most recent versions of ios and android have enhanced natural language processing. go to your photo app and search \"beach\" or \"flower\" or \"dog\" or whatever, and you'll get quite a lot of positive search results. photos are scanned and auto -----> tagged !!!  through ml. i don't think we'll see anything similar in lightroom or c1 for the foreseeable future.", "sortedWord": "None", "identifyer": 29798, "year": "2021"}, {"Unnamed: 0": 417555, "autor": "Tom B", "date": 1623373680000, "content": "- improvement of the AF: it should pe (per minimum) the level of the competitors on the market in that price tag..... I don't want to say: sorry, it's only a Leica - the af isn't that fast as - power managment: it should be possible taking 500 pictures over one day with one battery. Actually this takes me per minimum 3 batterys - that's not only inconvenient it's also expensive. ... just my two cents Leica should improve their software leadership!", "link": "https://www.l-camera-forum.com/topic/321024-news-about-the-firmware-update-30-for-the-sl2/?tab=comments#comment-4217812", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "- improvement of the af: it should pe (per minimum) the level of the competitors on the market in that price -----> tag !!! ..... i don't want to say: sorry, it's only a leica - the af isn't that fast as - power managment: it should be possible taking 500 pictures over one day with one battery. actually this takes me per minimum 3 batterys - that's not only inconvenient it's also expensive. ... just my two cents leica should improve their software leadership!", "sortedWord": "None", "identifyer": 30559, "year": "2021"}, {"Unnamed: 0": 417560, "autor": "caissa", "date": 1623587820000, "content": "On 6/11/2021 at 3:08 AM, Tom B said: - improvement of the AF: it should pe (per minimum) the level of the competitors on the market in that price tag..... I don't want to say: sorry, it's only a Leica - the af isn't that fast as - power managment: it should be possible taking 500 pictures over one day with one battery. Actually this takes me per minimum 3 batterys - that's not only inconvenient it's also expensive. ... just my two cents Leica should improve their software leadership! Use AFs then you will see that Leicas AF is excellent. Use AFc only after the next update, or if you are not able to find the button where to turn AFc off. I use these cameras since several years and have no real problems. Some newcomers have nothing to do than to complain about these small details. And they are so busy about it that they completely forget that a new camera requires also a certain amount of flexibility (on the side of the user). If flexibility is no acceptable idea, then nobody can help. How much flexibility is needed to try to switch from AFc to AFs, at least for a trial period ? The battery story is also eternally repeating. Still some users have not heard that usb power devs are much cheaper and much richer in energy than internal batteries. You can ask video users of almost any brand that this is the modern way to go. And that complaints (the same old complaints repeated) will never be in any way useful. Edited June 13 by caissa", "link": "https://www.l-camera-forum.com/topic/321024-news-about-the-firmware-update-30-for-the-sl2/page/2/?tab=comments#comment-4219296", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 6/11/2021 at 3:08 am, tom b said: - improvement of the af: it should pe (per minimum) the level of the competitors on the market in that price -----> tag !!! ..... i don't want to say: sorry, it's only a leica - the af isn't that fast as - power managment: it should be possible taking 500 pictures over one day with one battery. actually this takes me per minimum 3 batterys - that's not only inconvenient it's also expensive. ... just my two cents leica should improve their software leadership! use afs then you will see that leicas af is excellent. use afc only after the next update, or if you are not able to find the button where to turn afc off. i use these cameras since several years and have no real problems. some newcomers have nothing to do than to complain about these small details. and they are so busy about it that they completely forget that a new camera requires also a certain amount of flexibility (on the side of the user). if flexibility is no acceptable idea, then nobody can help. how much flexibility is needed to try to switch from afc to afs, at least for a trial period ? the battery story is also eternally repeating. still some users have not heard that usb power devs are much cheaper and much richer in energy than internal batteries. you can ask video users of almost any brand that this is the modern way to go. and that complaints (the same old complaints repeated) will never be in any way useful. edited june 13 by caissa", "sortedWord": "None", "identifyer": 30564, "year": "2021"}, {"Unnamed: 0": 420045, "autor": "hansvons", "date": 1620161820000, "content": "25 minutes ago, Hazesus said: This 24-70 lens is the gate way for new customers to their product lines. Absolutely. I own the 24-90. And while it's a gem of a lens, it's prohibitively expensive for many advanced prosumers, which are probably the leading target group of the SL-line. The SL2-S, together with the 3k 24-70, will be a 7.5k or even lower package. That can be a viable option for anyone who wants to enter the Leica universe without much compromise. 33 minutes ago, Hazesus said: Leica can't make them selfs look bad on May 6 knowing theirs other lenses in the market that people will do a comparison on YouTube. Many YouTube pundits with their lens tests are the plague. More than often, it's all about price tags and specs. But that's precisely what Leica is not about and other great products in the world neither. They are meant to inspire and not to function under the bleak regiment of price-performance ratios. The whole of YouTube will pounce on the lens like vultures. It's going to be a massacre. Just read this thread.", "link": "https://www.l-camera-forum.com/topic/319984-leica-vario-elmarit-sl-24%E2%80%9370mm-f28-asph/page/6/?tab=comments#comment-4194468", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "25 minutes ago, hazesus said: this 24-70 lens is the gate way for new customers to their product lines. absolutely. i own the 24-90. and while it's a gem of a lens, it's prohibitively expensive for many advanced prosumers, which are probably the leading target group of the sl-line. the sl2-s, together with the 3k 24-70, will be a 7.5k or even lower package. that can be a viable option for anyone who wants to enter the leica universe without much compromise. 33 minutes ago, hazesus said: leica can't make them selfs look bad on may 6 knowing theirs other lenses in the market that people will do a comparison on youtube. many youtube pundits with their lens tests are the plague. more than often, it's all about price -----> tags !!!  and specs. but that's precisely what leica is not about and other great products in the world neither. they are meant to inspire and not to function under the bleak regiment of price-performance ratios. the whole of youtube will pounce on the lens like vultures. it's going to be a massacre. just read this thread.", "sortedWord": "None", "identifyer": 33060, "year": "2021"}, {"Unnamed: 0": 420966, "autor": "Aaron Daniel", "date": 1623939780000, "content": "Appreciate the tag, @Slender ! I'm blushing to see that you've put me listed me among these professional idols of mine as well @ahendy good question! I think it starts with setting your expectations for yourself and how much you'd like to put into your grade– because it can take as long as you want or as short as you want. For me, in a nutshell, I'm nowhere near experienced with high-end commercial work. My background is in quite simple wedding films or run-and-gun online content, so I don't have too much experience diving deep into industry standard software like resolve or avid or whatever else is out there that I am naïve to 😅 But it's funny you mention Final Cut Pro. That is my editor of choice for both speed and relative features for editing. My workflow is this: 1. Shoot in L-log, either internally (highest/decent bitrate for your needs) or externally (to the Atomos Ninja V; ProRes) 2. Once imported into FCP, I don't actually use the LUT option provided by FCP for each clip. I currently use Color Finale and this plugin has the option to apply your custom LUTs or work in an ACES environment. I use the custom LUT option. 3. I then apply any correcting curves within the plugin. I trust the plugin to apply these curve adjustments in the right order with use of the LUT I do also notice how there can be a magenta shift when recording L-Log internally after applying Leica's provided LUTs, but I've always found this a relative easy fix to adjust. I always thought it was just me not setting my white balance properly in camera 😅 It sounds like you have experience with Canon and Sony log files, so I find it safe to assume you know what you're doing while working with flat footage like this haha. Something specific I found was that some LUTs designated for Fuji F-Log works really well with L-log. That might just be me and my subjective look at it, but I'd suggest playing around with some F-log LUTs if you have any (which should be easy to find online somewhere too) Here is my latest example video of using the above workflow: I hope this helps!", "link": "https://www.l-camera-forum.com/topic/321912-sl2-s-l-log-grading/?tab=comments#comment-4221610", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "appreciate the -----> tag !!! , @slender ! i'm blushing to see that you've put me listed me among these professional idols of mine as well @ahendy good question! i think it starts with setting your expectations for yourself and how much you'd like to put into your grade– because it can take as long as you want or as short as you want. for me, in a nutshell, i'm nowhere near experienced with high-end commercial work. my background is in quite simple wedding films or run-and-gun online content, so i don't have too much experience diving deep into industry standard software like resolve or avid or whatever else is out there that i am naïve to 😅 but it's funny you mention final cut pro. that is my editor of choice for both speed and relative features for editing. my workflow is this: 1. shoot in l-log, either internally (highest/decent bitrate for your needs) or externally (to the atomos ninja v; prores) 2. once imported into fcp, i don't actually use the lut option provided by fcp for each clip. i currently use color finale and this plugin has the option to apply your custom luts or work in an aces environment. i use the custom lut option. 3. i then apply any correcting curves within the plugin. i trust the plugin to apply these curve adjustments in the right order with use of the lut i do also notice how there can be a magenta shift when recording l-log internally after applying leica's provided luts, but i've always found this a relative easy fix to adjust. i always thought it was just me not setting my white balance properly in camera 😅 it sounds like you have experience with canon and sony log files, so i find it safe to assume you know what you're doing while working with flat footage like this haha. something specific i found was that some luts designated for fuji f-log works really well with l-log. that might just be me and my subjective look at it, but i'd suggest playing around with some f-log luts if you have any (which should be easy to find online somewhere too) here is my latest example video of using the above workflow: i hope this helps!", "sortedWord": "None", "identifyer": 33986, "year": "2021"}, {"Unnamed: 0": 421384, "autor": "hamey", "date": 1626177900000, "content": "You also forgot to mention Minolta, so except for the Tampon adaptall ,the Angenieux, Schneder and Minolta lenses were all made for Leitz and were all sold under the Leitz banner. As well as the hefty price tag. If Tamron, Vivitar, Sigma etc produce R lenses they would have been cheaper and independently sold and could have been bought in any photo store not just a Leica stockist. It's a pity that Leitz. didn't encourage other manufactories to do so like Leica M Lenses in the case of Zeiss ZM and Voigtlander are still made independently and distributed in any photo store for Leica M. Now to the Sigma case, we have quite a few lawyers on this forum, I am sure somebody knows. perhaps they could enlighten me on what did occur. Going back to the Leica Promotion, all Camera brands are promoting something especially on mirrorless cameras and lenses., things are not to good as people are holding on to their Wallets and not spending on luxary cameras during this covid virus. Edited July 13 by hamey", "link": "https://www.l-camera-forum.com/topic/322331-interesting-promotion-%E2%80%93-leica-m-to-l-special/page/2/?tab=comments#comment-4237362", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "you also forgot to mention minolta, so except for the tampon adaptall ,the angenieux, schneder and minolta lenses were all made for leitz and were all sold under the leitz banner. as well as the hefty price -----> tag !!! . if tamron, vivitar, sigma etc produce r lenses they would have been cheaper and independently sold and could have been bought in any photo store not just a leica stockist. it's a pity that leitz. didn't encourage other manufactories to do so like leica m lenses in the case of zeiss zm and voigtlander are still made independently and distributed in any photo store for leica m. now to the sigma case, we have quite a few lawyers on this forum, i am sure somebody knows. perhaps they could enlighten me on what did occur. going back to the leica promotion, all camera brands are promoting something especially on mirrorless cameras and lenses., things are not to good as people are holding on to their wallets and not spending on luxary cameras during this covid virus. edited july 13 by hamey", "sortedWord": "None", "identifyer": 34414, "year": "2021"}, {"Unnamed: 0": 422605, "autor": "Slender", "date": 1622718240000, "content": "@beeweeI can only imagine there is only so many results you can get from the automated computer design softwares and centuries of optical-handbooks, be it in Japan or Germany.... to get a \"great-to-perfect\" zoom lens design (and let's not forget France with Angenieux... USA with Panavision....etc) According to Karbe and oher lens designers from Arri, nowadays the computer assisted design programs will give you \"the perfect lens\" but without size/weight/cost constraints. The human engineer's job is then to apply some of those constraints to skrink/compromise the desing/performances within what they deem acceptable for the intented use/product line/price point/size.... etc. That's where Leica is not afraid of high prices... and in the case of the 24-90 a larger than average size/weight... in the name of performance. And it shows. It is very expensive for a photo lens/zoom but it feels near-on-par as great cine-lenses from Arri or Angenieux. It's not parfocal but that is not important for still-shooters with AF. I know that if you turn-off inDNG corrections it will show a bit more distortion/CA but it is negligeable anyway. Off course Sigma/Tamron can make glass as good as Leica/Zeiss and design \"samey and perfect\" lenses... but to make them happen in real-life it has to match your marketing aims. Panasonic could never sell a still-lens like the 90-280 at this price and clearly Sigma is not going the luxury road either... and since most people wrongly associate variable aperture design with nasty kit lenses.... so yeah... all the extra cash saved on plastic lenses sold to Sony/Canon shooters can help make \"ultimate designs\" happen on paper.... and then maybe those crazy germans will put their \"savoir-faire\" in action to make it real at the exacting level we expect with price tag. 😅 Edited June 3 by Slender", "link": "https://www.l-camera-forum.com/topic/321156-is-the-24-90-a-companion-an-m-shooter-can-fall-in-love-with/page/2/?tab=comments#comment-4212963", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "@beeweei can only imagine there is only so many results you can get from the automated computer design softwares and centuries of optical-handbooks, be it in japan or germany.... to get a \"great-to-perfect\" zoom lens design (and let's not forget france with angenieux... usa with panavision....etc) according to karbe and oher lens designers from arri, nowadays the computer assisted design programs will give you \"the perfect lens\" but without size/weight/cost constraints. the human engineer's job is then to apply some of those constraints to skrink/compromise the desing/performances within what they deem acceptable for the intented use/product line/price point/size.... etc. that's where leica is not afraid of high prices... and in the case of the 24-90 a larger than average size/weight... in the name of performance. and it shows. it is very expensive for a photo lens/zoom but it feels near-on-par as great cine-lenses from arri or angenieux. it's not parfocal but that is not important for still-shooters with af. i know that if you turn-off indng corrections it will show a bit more distortion/ca but it is negligeable anyway. off course sigma/tamron can make glass as good as leica/zeiss and design \"samey and perfect\" lenses... but to make them happen in real-life it has to match your marketing aims. panasonic could never sell a still-lens like the 90-280 at this price and clearly sigma is not going the luxury road either... and since most people wrongly associate variable aperture design with nasty kit lenses.... so yeah... all the extra cash saved on plastic lenses sold to sony/canon shooters can help make \"ultimate designs\" happen on paper.... and then maybe those crazy germans will put their \"savoir-faire\" in action to make it real at the exacting level we expect with price -----> tag !!! . 😅 edited june 3 by slender", "sortedWord": "None", "identifyer": 35649, "year": "2021"}, {"Unnamed: 0": 424090, "autor": "EUSe", "date": 1636051380000, "content": "Gerade eben schrieb gotium: Well thank you both. Shame, I was more interested in the CL/APS-C line than anything else from Leica at this point. Sounds like it really it time to move on to other brands. Really unfortunate. I don‘t know. Blame the pandemic and global economical crisis. I am both keeping the CL and TL lenses (and keep using them) for what they can do and swapped to a different brand because of the things the TL system can‘t do as well. They all have their pros and cons. I never succeeded in convincing anybody to buy a Leica - mostly a price tag problem, I think. I feel like a traitor! For me it is the choice between an object that I like to use and touch and the colours I prefer on one hand and very good AF and reliable stabilisation plus low light usability on the other hand. Size also matters, but a light-weight mirrorless with a 24-105 mm zoom may be easier to carry than a CL with handgrip and a 35 mm Summilux TL, not to speak of the focal range. In the end it comes down to the question which images you prefer. A question of the heart, if I may say so.", "link": "https://www.l-camera-forum.com/topic/326136-ohoh-future-of-cl/page/2/?tab=comments#comment-4307072", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "gerade eben schrieb gotium: well thank you both. shame, i was more interested in the cl/aps-c line than anything else from leica at this point. sounds like it really it time to move on to other brands. really unfortunate. i don‘t know. blame the pandemic and global economical crisis. i am both keeping the cl and tl lenses (and keep using them) for what they can do and swapped to a different brand because of the things the tl system can‘t do as well. they all have their pros and cons. i never succeeded in convincing anybody to buy a leica - mostly a price -----> tag !!!  problem, i think. i feel like a traitor! for me it is the choice between an object that i like to use and touch and the colours i prefer on one hand and very good af and reliable stabilisation plus low light usability on the other hand. size also matters, but a light-weight mirrorless with a 24-105 mm zoom may be easier to carry than a cl with handgrip and a 35 mm summilux tl, not to speak of the focal range. in the end it comes down to the question which images you prefer. a question of the heart, if i may say so.", "sortedWord": "None", "identifyer": 37166, "year": "2021"}, {"Unnamed: 0": 424710, "autor": "IkarusJohn", "date": 1636050660000, "content": "I thought the product survey was all rather pointless, to be honest. They want to know if we want a tilt screen and induction charging SL - they’re really hitting the big ticket items. What is it we want in digital Leicas? It isn’t the price … Putting a sensor into an M camera, and keeping a significant premium over electronically superior Canons and Nikons was a neat trick - until the electronics started to fail, and the justification for the Leica premium started to wear a bit thin. The “sensible” people said Leica for life was just marketing - don’t be credulous. That made the premium, and Made in Wetzlar tag a bit implausible. So, now the CL/TL seems in doubt, and Leica is drifting into direct competition with the opposition with the SL? I like the 601. I have a feeling that the next iteration of the SL cameras will have lost all its unique selling point, and the justification for wearing the Leica premium will have gone - the monstrous Z9 might have suddenly become attractive … I can carry the TL2 til it dies - it’s a nice little camera, and it’s useful. I’m sure CL owners feel the same way. My SL is a user, and I am down to one SL lens. That will also be enjoyed, til sold for scrap. If I was looking to upgrade, it would be another lens for my M-A, or to look again at Nikon. When I joined this forum 10 or so years ago, Jaap would reliably buy each new M camera - now he’s talking Panasonic and Sigma …", "link": "https://www.l-camera-forum.com/topic/325292-my-message-to-leica-ag-in-regards-to-cl/page/8/?tab=comments#comment-4307059", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i thought the product survey was all rather pointless, to be honest. they want to know if we want a tilt screen and induction charging sl - they’re really hitting the big ticket items. what is it we want in digital leicas? it isn’t the price … putting a sensor into an m camera, and keeping a significant premium over electronically superior canons and nikons was a neat trick - until the electronics started to fail, and the justification for the leica premium started to wear a bit thin. the “sensible” people said leica for life was just marketing - don’t be credulous. that made the premium, and made in wetzlar -----> tag !!!  a bit implausible. so, now the cl/tl seems in doubt, and leica is drifting into direct competition with the opposition with the sl? i like the 601. i have a feeling that the next iteration of the sl cameras will have lost all its unique selling point, and the justification for wearing the leica premium will have gone - the monstrous z9 might have suddenly become attractive … i can carry the tl2 til it dies - it’s a nice little camera, and it’s useful. i’m sure cl owners feel the same way. my sl is a user, and i am down to one sl lens. that will also be enjoyed, til sold for scrap. if i was looking to upgrade, it would be another lens for my m-a, or to look again at nikon. when i joined this forum 10 or so years ago, jaap would reliably buy each new m camera - now he’s talking panasonic and sigma …", "sortedWord": "None", "identifyer": 37789, "year": "2021"}, {"Unnamed: 0": 424978, "autor": "Boojay", "date": 1636020780000, "content": "10 hours ago, aksclix said: Thanks for the sample images.. I don’t have the 18-56.. only have the 11-23 and 23.. I am really interested in this one.. constant f2.8 is kinda the only temptation for me.. MFD is also a really nice added value.. with the CL being not so good with noise, lacking IS, I don’t know how and why the 18-56 became such a popular and well liked lens.. optically it might be very good but the modest aperture range might become an issue in remotely challenging lighting conditions.. Is there a difference in sharpness or just colors between the 18-56 and this one? Given the cost of this lens compared to the TL 18-56 it's really a no-brainer if you want a longer and more flexible lens than your 23mm. Yes, some difference in colour rendition, I'm not seeing any lack of sharpness, I'm guessing for those using the Sony mount version on bodies with IBIS it's a real treat. It feels like this lens changes things around given that most 18-56 kit lenses come at a lower price with aperture range of 3.5/5.6 as with the TL, but the TL's optical quality is the best I've ever seen from a so called kit lens. Most manufacturers come along later with a 2.8 version that have a significantly higher price tag and a better optical performance, Fuji's 16-55, Canon's old 17-55 for example. Here we get the 2.8 and very useful MFD, at about a third of the cost with maybe a tiny tiny loss of IQ. As it seems Leica has pretty much abandoned aps-c at this point, thank goodness for Sigma I say and if I was starting today with the CL or TL I'd save a bundle and forgo pretty much any of the TL lenses, and use my M lenses when I want that Leica colour and rendition. Couple more samples.. if you click through to my flickr stream for better viewing, last dozen or so images are from the 18-50. --img--  Chasing Whippets at 2.8 --img-- ", "link": "https://www.l-camera-forum.com/topic/325527-new-sigma-18-50mm-f28-for-aps-c/page/2/?tab=comments#comment-4306659", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "10 hours ago, aksclix said: thanks for the sample images.. i don’t have the 18-56.. only have the 11-23 and 23.. i am really interested in this one.. constant f2.8 is kinda the only temptation for me.. mfd is also a really nice added value.. with the cl being not so good with noise, lacking is, i don’t know how and why the 18-56 became such a popular and well liked lens.. optically it might be very good but the modest aperture range might become an issue in remotely challenging lighting conditions.. is there a difference in sharpness or just colors between the 18-56 and this one? given the cost of this lens compared to the tl 18-56 it's really a no-brainer if you want a longer and more flexible lens than your 23mm. yes, some difference in colour rendition, i'm not seeing any lack of sharpness, i'm guessing for those using the sony mount version on bodies with ibis it's a real treat. it feels like this lens changes things around given that most 18-56 kit lenses come at a lower price with aperture range of 3.5/5.6 as with the tl, but the tl's optical quality is the best i've ever seen from a so called kit lens. most manufacturers come along later with a 2.8 version that have a significantly higher price -----> tag !!!  and a better optical performance, fuji's 16-55, canon's old 17-55 for example. here we get the 2.8 and very useful mfd, at about a third of the cost with maybe a tiny tiny loss of iq. as it seems leica has pretty much abandoned aps-c at this point, thank goodness for sigma i say and if i was starting today with the cl or tl i'd save a bundle and forgo pretty much any of the tl lenses, and use my m lenses when i want that leica colour and rendition. couple more samples.. if you click through to my flickr stream for better viewing, last dozen or so images are from the 18-50. --img--  chasing whippets at 2.8 --img-- ", "sortedWord": "None", "identifyer": 38063, "year": "2021"}, {"Unnamed: 0": 424980, "autor": "aksclix", "date": 1636039980000, "content": "5 hours ago, Boojay said: Given the cost of this lens compared to the TL 18-56 it's really a no-brainer if you want a longer and more flexible lens than your 23mm. Yes, some difference in colour rendition, I'm not seeing any lack of sharpness, I'm guessing for those using the Sony mount version on bodies with IBIS it's a real treat. It feels like this lens changes things around given that most 18-56 kit lenses come at a lower price with aperture range of 3.5/5.6 as with the TL, but the TL's optical quality is the best I've ever seen from a so called kit lens. Most manufacturers come along later with a 2.8 version that have a significantly higher price tag and a better optical performance, Fuji's 16-55, Canon's old 17-55 for example. Here we get the 2.8 and very useful MFD, at about a third of the cost with maybe a tiny tiny loss of IQ. As it seems Leica has pretty much abandoned aps-c at this point, thank goodness for Sigma I say and if I was starting today with the CL or TL I'd save a bundle and forgo pretty much any of the TL lenses, and use my M lenses when I want that Leica colour and rendition Thanks again.. I had a used 18-56 for a while and I returned it.. it was only usable in good lighting conditions and that was a deal breaker for me. I was giving away the CL as well but then decided otherwise.. even with the 11-23 at home in normal ambient light, it is dark up until ISO 3200!! And the CL for me becomes too noisy starting at 1600.. Anyway, I’ve ordered my 18-50 now and I know I won’t be disappointed.. I think the sigma has come very late.. better late than never though.. also, it’s hard to say if Leica has abandoned the CL.. they’re always super slow.. since the introduction of the SL, they’re yet to complete the lens line up.. the 21 is coming forever!! it seems like they care more about the M than any other models anyway", "link": "https://www.l-camera-forum.com/topic/325527-new-sigma-18-50mm-f28-for-aps-c/page/2/?tab=comments#comment-4306898", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "5 hours ago, boojay said: given the cost of this lens compared to the tl 18-56 it's really a no-brainer if you want a longer and more flexible lens than your 23mm. yes, some difference in colour rendition, i'm not seeing any lack of sharpness, i'm guessing for those using the sony mount version on bodies with ibis it's a real treat. it feels like this lens changes things around given that most 18-56 kit lenses come at a lower price with aperture range of 3.5/5.6 as with the tl, but the tl's optical quality is the best i've ever seen from a so called kit lens. most manufacturers come along later with a 2.8 version that have a significantly higher price -----> tag !!!  and a better optical performance, fuji's 16-55, canon's old 17-55 for example. here we get the 2.8 and very useful mfd, at about a third of the cost with maybe a tiny tiny loss of iq. as it seems leica has pretty much abandoned aps-c at this point, thank goodness for sigma i say and if i was starting today with the cl or tl i'd save a bundle and forgo pretty much any of the tl lenses, and use my m lenses when i want that leica colour and rendition thanks again.. i had a used 18-56 for a while and i returned it.. it was only usable in good lighting conditions and that was a deal breaker for me. i was giving away the cl as well but then decided otherwise.. even with the 11-23 at home in normal ambient light, it is dark up until iso 3200!! and the cl for me becomes too noisy starting at 1600.. anyway, i’ve ordered my 18-50 now and i know i won’t be disappointed.. i think the sigma has come very late.. better late than never though.. also, it’s hard to say if leica has abandoned the cl.. they’re always super slow.. since the introduction of the sl, they’re yet to complete the lens line up.. the 21 is coming forever!! it seems like they care more about the m than any other models anyway", "sortedWord": "None", "identifyer": 38065, "year": "2021"}, {"Unnamed: 0": 433106, "autor": "01maciel", "date": 1635616020000, "content": "vor 5 Stunden schrieb Alberti: how did you automatically get the lens-data in the Exif? Unfortunately it is a manual process. I tagged the Summicron-35 images in the camera. When I am home I run a bash script to get the information into the Exif data. #!/bin/bash #New: LModel_New=\"Summicron-M 1:2/35 ASPH\" LMake_New=\"Leica Camera AG\" LInfo_New=\"35mm f/2\" MaxAp_New=\"2.0\" #LLensTypeMake=\"Leica-M\" #does not work LLensType=\"Fixed Focal Length\" LLensAttached=\"Yes\" LLens=\"35.0mm\" LminFocalLength=\"35\" LmaxFocalLength=\"35\" for thefile in *RW2; do exiftool -q -q -m -LensModel=\"$LModel_New\" $myfile \\ -LensMake=\"$LMake_New\" $thefile \\ -LensType=\"$LModel_New\" $thefile \\ -LensInfo=\"$LInfo_New\" $thefile -MaxApertureValue=\"$MaxAp_New\" $thefile \"-FileModifyDate<DateTimeOriginal\" \"-FileModifyDate<CreateDate\" $thefile \\ -FLength=\"$LLens\" \\ -FocalLength=\"$LLens\" -Lens=\"$LLens\" -minFocalLength=\"$LminFocalLength\" -maxFocalLength=\"$LmaxFocalLength\" $thefile done Sure it's Linux. I suppose LR or Capture One can do similar things with simple mouse clicks. How are things with the new camera, S5 and L-mount?", "link": "https://www.l-camera-forum.com/topic/325572-panasonic-s-performance-with-rangefinder-lenses-including-imagesmerged/page/4/?tab=comments#comment-4303066", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "vor 5 stunden schrieb alberti: how did you automatically get the lens-data in the exif? unfortunately it is a manual process. i -----> tagged !!!  the summicron-35 images in the camera. when i am home i run a bash script to get the information into the exif data. #!/bin/bash #new: lmodel_new=\"summicron-m 1:2/35 asph\" lmake_new=\"leica camera ag\" linfo_new=\"35mm f/2\" maxap_new=\"2.0\" #llenstypemake=\"leica-m\" #does not work llenstype=\"fixed focal length\" llensattached=\"yes\" llens=\"35.0mm\" lminfocallength=\"35\" lmaxfocallength=\"35\" for thefile in *rw2; do exiftool -q -q -m -lensmodel=\"$lmodel_new\" $myfile \\ -lensmake=\"$lmake_new\" $thefile \\ -lenstype=\"$lmodel_new\" $thefile \\ -lensinfo=\"$linfo_new\" $thefile -maxaperturevalue=\"$maxap_new\" $thefile \"-filemodifydate<datetimeoriginal\" \"-filemodifydate<createdate\" $thefile \\ -flength=\"$llens\" \\ -focallength=\"$llens\" -lens=\"$llens\" -minfocallength=\"$lminfocallength\" -maxfocallength=\"$lmaxfocallength\" $thefile done sure it's linux. i suppose lr or capture one can do similar things with simple mouse clicks. how are things with the new camera, s5 and l-mount?", "sortedWord": "None", "identifyer": 46281, "year": "2021"}, {"Unnamed: 0": 433107, "autor": "Alberti", "date": 1635682380000, "content": " 13 hours ago, 01maciel said: Unfortunately it is a manual process. I tagged the Summicron-35 images in the camera. When I am home I run a bash script to get the information into the Exif data. #!/bin/bash #New: LModel_New=\"Summicron-M 1:2/35 ASPH\" LMake_New=\"Leica Camera AG\" LInfo_New=\"35mm f/2\" MaxAp_New=\"2.0\" #LLensTypeMake=\"Leica-M\" #does not work LLensType=\"Fixed Focal Length\" LLensAttached=\"Yes\" LLens=\"35.0mm\" LminFocalLength=\"35\" LmaxFocalLength=\"35\" for thefile in *RW2; do exiftool -q -q -m -LensModel=\"$LModel_New\" $myfile \\ -LensMake=\"$LMake_New\" $thefile \\ -LensType=\"$LModel_New\" $thefile \\ -LensInfo=\"$LInfo_New\" $thefile -MaxApertureValue=\"$MaxAp_New\" $thefile \"-FileModifyDate<DateTimeOriginal\" \"-FileModifyDate<CreateDate\" $thefile \\ -FLength=\"$LLens\" \\ -FocalLength=\"$LLens\" -Lens=\"$LLens\" -minFocalLength=\"$LminFocalLength\" -maxFocalLength=\"$LmaxFocalLength\" $thefile done Sure it's Linux. I suppose LR or Capture One can do similar things with simple mouse clicks. How are things with the new camera, S5 and L-mount? To me that is rocket science (not really, but I'm not into it. As a student I made a chess program in LISP (AI) and it was good in solving mate in two moves . . .) My understanding what you do, is to drop the files on the icon with this script - and presto, it is tagged; and you have a line-up of such scripts on your desktop, one for each lens. Today the weather was better so I had a walk outside. The M-Rokkor 28mm performs exceptionally good (forget the haze), the 40mm M-R has problems in the corners. The Summicron 50 V5 was superb. The Summicron 35mm V4 also, sometimes with a few difficulties.", "link": "https://www.l-camera-forum.com/topic/325572-panasonic-s-performance-with-rangefinder-lenses-including-imagesmerged/page/5/?tab=comments#comment-4303542", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": " 13 hours ago, 01maciel said: unfortunately it is a manual process. i -----> tagged !!!  the summicron-35 images in the camera. when i am home i run a bash script to get the information into the exif data. #!/bin/bash #new: lmodel_new=\"summicron-m 1:2/35 asph\" lmake_new=\"leica camera ag\" linfo_new=\"35mm f/2\" maxap_new=\"2.0\" #llenstypemake=\"leica-m\" #does not work llenstype=\"fixed focal length\" llensattached=\"yes\" llens=\"35.0mm\" lminfocallength=\"35\" lmaxfocallength=\"35\" for thefile in *rw2; do exiftool -q -q -m -lensmodel=\"$lmodel_new\" $myfile \\ -lensmake=\"$lmake_new\" $thefile \\ -lenstype=\"$lmodel_new\" $thefile \\ -lensinfo=\"$linfo_new\" $thefile -maxaperturevalue=\"$maxap_new\" $thefile \"-filemodifydate<datetimeoriginal\" \"-filemodifydate<createdate\" $thefile \\ -flength=\"$llens\" \\ -focallength=\"$llens\" -lens=\"$llens\" -minfocallength=\"$lminfocallength\" -maxfocallength=\"$lmaxfocallength\" $thefile done sure it's linux. i suppose lr or capture one can do similar things with simple mouse clicks. how are things with the new camera, s5 and l-mount? to me that is rocket science (not really, but i'm not into it. as a student i made a chess program in lisp (ai) and it was good in solving mate in two moves . . .) my understanding what you do, is to drop the files on the icon with this script - and presto, it is tagged; and you have a line-up of such scripts on your desktop, one for each lens. today the weather was better so i had a walk outside. the m-rokkor 28mm performs exceptionally good (forget the haze), the 40mm m-r has problems in the corners. the summicron 50 v5 was superb. the summicron 35mm v4 also, sometimes with a few difficulties.", "sortedWord": "None", "identifyer": 46282, "year": "2021"}, {"Unnamed: 0": 433281, "autor": "Boojay", "date": 1630188540000, "content": " Will share first few shots I took on the CL, because I was pleased with them, need to improve my handholding technique for this lens on the small body of the CL, and keep an eye on SS, but with 900mm equivalent I got closer to a few creatures round the garden. --img--  --img--  --img--  Better viewed on flickr and I included settings in the tags if it's of interest. Closer inspection of the little sparrow shows he has a nasty tic probably not doing him a lot of good!", "link": "https://www.l-camera-forum.com/topic/324142-sigma-150-600-dg-dn-f5-63-merged/page/2/?tab=comments#comment-4265492", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": " will share first few shots i took on the cl, because i was pleased with them, need to improve my handholding technique for this lens on the small body of the cl, and keep an eye on ss, but with 900mm equivalent i got closer to a few creatures round the garden. --img--  --img--  --img--  better viewed on flickr and i included settings in the -----> tags !!!  if it's of interest. closer inspection of the little sparrow shows he has a nasty tic probably not doing him a lot of good!", "sortedWord": "None", "identifyer": 46460, "year": "2021"}, {"Unnamed: 0": 433465, "autor": "01maciel", "date": 1635958080000, "content": "vor 46 Minuten schrieb scrollt: Leistenschneider? indeed. They are quite nice and willing to discuss the price tag. I have a few fixed focal length lenses for the M10. Most of them are exceptional but sometimes I miss a zoom lens for sport events or concerts. For other purposes I miss a min focal distance < 0.5m. Both can do the Sigma. Compared to the Leica lenses the Sigma is clinical sharp and I miss a special character. Edited November 3 by 01maciel", "link": "https://www.l-camera-forum.com/topic/325909-the-new-sigma-24-70mm-f28-dg-dn-art/?tab=comments#comment-4306139", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "vor 46 minuten schrieb scrollt: leistenschneider? indeed. they are quite nice and willing to discuss the price -----> tag !!! . i have a few fixed focal length lenses for the m10. most of them are exceptional but sometimes i miss a zoom lens for sport events or concerts. for other purposes i miss a min focal distance < 0.5m. both can do the sigma. compared to the leica lenses the sigma is clinical sharp and i miss a special character. edited november 3 by 01maciel", "sortedWord": "None", "identifyer": 46650, "year": "2021"}, {"Unnamed: 0": 439639, "autor": "Al Brown", "date": 1633413780000, "content": "Well gentlemen, according to data he is an active member and supporter ot this forum, just tag him with @ and his last name or send him a message in the inbox.", "link": "https://www.l-camera-forum.com/topic/302590-overgaard-lens-shade-not-received/page/2/?tab=comments#comment-4286682", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "well gentlemen, according to data he is an active member and supporter ot this forum, just -----> tag !!!  him with @ and his last name or send him a message in the inbox.", "sortedWord": "None", "identifyer": 52956, "year": "2021"}, {"Unnamed: 0": 439640, "autor": "farnz", "date": 1633433460000, "content": "5 hours ago, Al Brown said: Well gentlemen, according to data he is an active member and supporter ot this forum, just tag him with @ and his last name or send him a message in the inbox. I'd already done it in October 2019 - please refer to post #17 in this thread. No response so far. Pete.", "link": "https://www.l-camera-forum.com/topic/302590-overgaard-lens-shade-not-received/page/2/?tab=comments#comment-4286851", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "5 hours ago, al brown said: well gentlemen, according to data he is an active member and supporter ot this forum, just -----> tag !!!  him with @ and his last name or send him a message in the inbox. i'd already done it in october 2019 - please refer to post #17 in this thread. no response so far. pete.", "sortedWord": "None", "identifyer": 52957, "year": "2021"}, {"Unnamed: 0": 440119, "autor": "johonew", "date": 1638153300000, "content": "I recently bought a 3D printed case for my Q2M on Etsy that has a place already printed into the case for the Air Tag. I intend to use it when traveling.", "link": "https://www.l-camera-forum.com/topic/326922-airtaging-my-camera/?tab=comments#comment-4322322", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i recently bought a 3d printed case for my q2m on etsy that has a place already printed into the case for the air -----> tag !!! . i intend to use it when traveling.", "sortedWord": "None", "identifyer": 53456, "year": "2021"}, {"Unnamed: 0": 441123, "autor": "gteague", "date": 1633378140000, "content": " ... it's true. to buying camera bags. you can never get a perfect one and when you do then you buy a new accessory or a spare battery and then things don't fit. so i have dozens and dozens of them lying around and you'd think one i already have would work, but it never does. what i've been looking for for quite some time is a bag just big enough for the q2 and one or two spare batteries and a couple of memory cards for when i wanted to take the camera with me in the car and wanted a safer way to carry it until i put it around my neck. i tried a binocular case which proved just a little too small and i tried that very small billingham bag, but it has no room left over for anything and i really detest the flap closures on those bags--i wish i'd never bought any of them. anyway, this one popped up on the amazon pages the other day and the size seemed perfect and the price was so cheap i didn't mind trying it as amazon has a great returns policy anyway. it came in just now and the q2 fits perfectly in it and you can even put the supplied divider in to create a space at the lens end of the camera for at least one battery, maybe two. it also has a pocket in front with two divided pockets inside which has plenty of room for batteries, cards, and filters if you wish. the quality seems very good for the price as it uses a heavier canvas comparable to billingham or domke and a tag even says it's waterproof or weatherproof, although i don't think i'd test the claim--with everything zipped up i'm pretty sure it'll survive and light sprinkling though. there's a flap at top which zips up and then a cover over that which closes with velcro and the top cover is a little awkward, but no more so than the thinktank ones with magnetic closures. it comes with a wide shoulder strap and has a velcro belt loop on the back because it's so small you could carry it that way. i also found that my s1 with 85/1.8 lens would fit inside with just a little deformation around the 'hump'. it fits nearly perfectly if i wanted to put it lens down/back up, but i dislike that because you have to work your fingers around to dig it out. i always put my cameras in sideways with the 'handle' facing up so i can just grab and go.https://shrtm.nu/QY1A /guy", "link": "https://www.l-camera-forum.com/topic/325089-q2-i-have-an-addiction/?tab=comments#comment-4286494", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " ... it's true. to buying camera bags. you can never get a perfect one and when you do then you buy a new accessory or a spare battery and then things don't fit. so i have dozens and dozens of them lying around and you'd think one i already have would work, but it never does. what i've been looking for for quite some time is a bag just big enough for the q2 and one or two spare batteries and a couple of memory cards for when i wanted to take the camera with me in the car and wanted a safer way to carry it until i put it around my neck. i tried a binocular case which proved just a little too small and i tried that very small billingham bag, but it has no room left over for anything and i really detest the flap closures on those bags--i wish i'd never bought any of them. anyway, this one popped up on the amazon pages the other day and the size seemed perfect and the price was so cheap i didn't mind trying it as amazon has a great returns policy anyway. it came in just now and the q2 fits perfectly in it and you can even put the supplied divider in to create a space at the lens end of the camera for at least one battery, maybe two. it also has a pocket in front with two divided pockets inside which has plenty of room for batteries, cards, and filters if you wish. the quality seems very good for the price as it uses a heavier canvas comparable to billingham or domke and a -----> tag !!!  even says it's waterproof or weatherproof, although i don't think i'd test the claim--with everything zipped up i'm pretty sure it'll survive and light sprinkling though. there's a flap at top which zips up and then a cover over that which closes with velcro and the top cover is a little awkward, but no more so than the thinktank ones with magnetic closures. it comes with a wide shoulder strap and has a velcro belt loop on the back because it's so small you could carry it that way. i also found that my s1 with 85/1.8 lens would fit inside with just a little deformation around the 'hump'. it fits nearly perfectly if i wanted to put it lens down/back up, but i dislike that because you have to work your fingers around to dig it out. i always put my cameras in sideways with the 'handle' facing up so i can just grab and go.https://shrtm.nu/qy1a /guy", "sortedWord": "None", "identifyer": 54465, "year": "2021"}, {"Unnamed: 0": 441597, "autor": "19Markus68", "date": 1625645100000, "content": "For my brand new Q2 I also considered the Oberwerth Q bag, however the price tag seemed kind of ridiculous. Finally I tried out the Billingham Hadley Digital and this looks like the perfect solution for me a price of less than 1/3 of the Q bag. It's waterproof, compact, with enough space for the camera (incl. hand grip and thumbs support), the charger (if needed), spare batterie(s) and SD card(s) - the perfect solution for me at a reasonnable price.", "link": "https://www.l-camera-forum.com/topic/255988-camera-bag/page/6/?tab=comments#comment-4233498", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "for my brand new q2 i also considered the oberwerth q bag, however the price -----> tag !!!  seemed kind of ridiculous. finally i tried out the billingham hadley digital and this looks like the perfect solution for me a price of less than 1/3 of the q bag. it's waterproof, compact, with enough space for the camera (incl. hand grip and thumbs support), the charger (if needed), spare batterie(s) and sd card(s) - the perfect solution for me at a reasonnable price.", "sortedWord": "None", "identifyer": 54946, "year": "2021"}, {"Unnamed: 0": 441680, "autor": "en604550", "date": 1631042340000, "content": " My son pulled the Leica Q that was mounted on a tripod and it dropped on the asphalt ground at a National Park. The camera body experience 2 small dings, no dings on the lens and I thought that was it, yet when I turned on the camera, it displayed SYSTEM ERROR OIS. The error message shows up around 10 seconds after I turned on the camera and nothing is allowed after the message shows up, not even the accessing the menu or reviewing photos in the SD card. Prior to the error message showing up, I can still get to the menu and review photos within that 10 seconds. I brought it to the Leica store and it was sent back for repair estimate. The estimate came back to be replacing the entire lens ($1250.00) plus labor ($312.50), and if I want to get the two dings fixed, it would also require new parts, top plate ($265) and bottom plate ($275). A $2100 to basically replace all the parts, include the lens, basically not a repair. I am wondering if there are other options out there, since I basically can buy a used Leica Q with that price tag. The Q have served me well, and I have taken a lot of photos with it during family trips. I really want to get it fixed so don't end up with a useless piece of metal in the house.", "link": "https://www.l-camera-forum.com/topic/324316-leica-q-repair-estimate/?tab=comments#comment-4271325", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " my son pulled the leica q that was mounted on a tripod and it dropped on the asphalt ground at a national park. the camera body experience 2 small dings, no dings on the lens and i thought that was it, yet when i turned on the camera, it displayed system error ois. the error message shows up around 10 seconds after i turned on the camera and nothing is allowed after the message shows up, not even the accessing the menu or reviewing photos in the sd card. prior to the error message showing up, i can still get to the menu and review photos within that 10 seconds. i brought it to the leica store and it was sent back for repair estimate. the estimate came back to be replacing the entire lens ($1250.00) plus labor ($312.50), and if i want to get the two dings fixed, it would also require new parts, top plate ($265) and bottom plate ($275). a $2100 to basically replace all the parts, include the lens, basically not a repair. i am wondering if there are other options out there, since i basically can buy a used leica q with that price -----> tag !!! . the q have served me well, and i have taken a lot of photos with it during family trips. i really want to get it fixed so don't end up with a useless piece of metal in the house.", "sortedWord": "None", "identifyer": 5029, "year": "2021"}, {"Unnamed: 0": 441684, "autor": "prk60091", "date": 1631064600000, "content": "17 minutes ago, higa said: Man, my condolences. Hopefully, maybe insurance or homeowener's policy might cover some of it? If not, you may be able to get a few bucks on ebay for a dead one. I fell on my Canon 80D with the flash in the hotshoe and the flash went into the prism top of the camera and left a big hole where the flash she used to sit. Flash was fine, camera was not. Ended up selling it like that on ebay with the charger and the battery for almost $200. It's worth a try if you ebay. 6 hours ago, en604550 said: My son pulled the Leica Q that was mounted on a tripod and it dropped on the asphalt ground at a National Park. The camera body experience 2 small dings, no dings on the lens and I thought that was it, yet when I turned on the camera, it displayed SYSTEM ERROR OIS. The error message shows up around 10 seconds after I turned on the camera and nothing is allowed after the message shows up, not even the accessing the menu or reviewing photos in the SD card. Prior to the error message showing up, I can still get to the menu and review photos within that 10 seconds. I brought it to the Leica store and it was sent back for repair estimate. The estimate came back to be replacing the entire lens ($1250.00) plus labor ($312.50), and if I want to get the two dings fixed, it would also require new parts, top plate ($265) and bottom plate ($275). A $2100 to basically replace all the parts, include the lens, basically not a repair. I am wondering if there are other options out there, since I basically can buy a used Leica Q with that price tag. The Q have served me well, and I have taken a lot of photos with it during family trips. I really want to get it fixed so don't end up with a useless piece of metal in the house. if you had your Q scheduled on your homeowners/renters/condo policy it may be covered for accidental damage and loss... call your insurance agent and ask.. this is a very good reason to schedule your cameras on your home policy... Edited September 8 by prk60091", "link": "https://www.l-camera-forum.com/topic/324316-leica-q-repair-estimate/?tab=comments#comment-4271486", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "17 minutes ago, higa said: man, my condolences. hopefully, maybe insurance or homeowener's policy might cover some of it? if not, you may be able to get a few bucks on ebay for a dead one. i fell on my canon 80d with the flash in the hotshoe and the flash went into the prism top of the camera and left a big hole where the flash she used to sit. flash was fine, camera was not. ended up selling it like that on ebay with the charger and the battery for almost $200. it's worth a try if you ebay. 6 hours ago, en604550 said: my son pulled the leica q that was mounted on a tripod and it dropped on the asphalt ground at a national park. the camera body experience 2 small dings, no dings on the lens and i thought that was it, yet when i turned on the camera, it displayed system error ois. the error message shows up around 10 seconds after i turned on the camera and nothing is allowed after the message shows up, not even the accessing the menu or reviewing photos in the sd card. prior to the error message showing up, i can still get to the menu and review photos within that 10 seconds. i brought it to the leica store and it was sent back for repair estimate. the estimate came back to be replacing the entire lens ($1250.00) plus labor ($312.50), and if i want to get the two dings fixed, it would also require new parts, top plate ($265) and bottom plate ($275). a $2100 to basically replace all the parts, include the lens, basically not a repair. i am wondering if there are other options out there, since i basically can buy a used leica q with that price -----> tag !!! . the q have served me well, and i have taken a lot of photos with it during family trips. i really want to get it fixed so don't end up with a useless piece of metal in the house. if you had your q scheduled on your homeowners/renters/condo policy it may be covered for accidental damage and loss... call your insurance agent and ask.. this is a very good reason to schedule your cameras on your home policy... edited september 8 by prk60091", "sortedWord": "None", "identifyer": 5033, "year": "2021"}, {"Unnamed: 0": 442743, "autor": "nwphil", "date": 1626117000000, "content": "at one point does not matter if the bag is white or black - leaving the bag under strong direct sunlight for hours is likely to potentially damage some electronics or dry the lube ( on mechanicals) - but who really does that? The thing with black bags is that they get dirty so easy but less prone to show rubbing wear. since most cameras are black, it's way more important to me is the inside color. There are plenty of choices in shapes, and sizes, some less of materials and colors, but in the end, they all shared the same overpriced tag for what they are.", "link": "https://www.l-camera-forum.com/topic/322082-what%E2%80%98s-the-smallest-bag-possible-for-the-leica-q2/page/2/?tab=comments#comment-4236976", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "at one point does not matter if the bag is white or black - leaving the bag under strong direct sunlight for hours is likely to potentially damage some electronics or dry the lube ( on mechanicals) - but who really does that? the thing with black bags is that they get dirty so easy but less prone to show rubbing wear. since most cameras are black, it's way more important to me is the inside color. there are plenty of choices in shapes, and sizes, some less of materials and colors, but in the end, they all shared the same overpriced -----> tag !!!  for what they are.", "sortedWord": "None", "identifyer": 6121, "year": "2021"}, {"Unnamed: 0": 443449, "autor": "alexstelma", "date": 1622497260000, "content": "After extensive troubleshooting I have come to the following conclusions, for anyone that may be able to help .... 1. The issue does not show in camera or in the embedded preview, only when opening the raw DNG format 2. The strip of pixels does not appear in the JPG equivalent of the problematic image 3. I can't yet tell what triggers it but it seems to be a combination of a particular memory card and the electronic shutter If i can determine that it is in fact just a faulty memory card I am a happy boy, but this is of course alarming given the price tag of the camera so if anyone has any further ideas or insight it'd be appreciated.", "link": "https://www.l-camera-forum.com/topic/321384-leica-q2-pixel-strip-issue/?tab=comments#comment-4211435", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "after extensive troubleshooting i have come to the following conclusions, for anyone that may be able to help .... 1. the issue does not show in camera or in the embedded preview, only when opening the raw dng format 2. the strip of pixels does not appear in the jpg equivalent of the problematic image 3. i can't yet tell what triggers it but it seems to be a combination of a particular memory card and the electronic shutter if i can determine that it is in fact just a faulty memory card i am a happy boy, but this is of course alarming given the price -----> tag !!!  of the camera so if anyone has any further ideas or insight it'd be appreciated.", "sortedWord": "None", "identifyer": 6830, "year": "2021"}, {"Unnamed: 0": 443726, "autor": "Anakronox", "date": 1620768600000, "content": "Perspective control tags the raw with the geometry to correct. It is reversible in post. If shooting jpeg, the image is cropped after the correction applied and is not reversible. The feature relies on the built-in level of the M10-P, M10-M, and M10-R. It is not available on the M10 and I am not sure the Q2 and Q2 Monochrom will get this software update, but one can always hope (and write Leica).", "link": "https://www.l-camera-forum.com/topic/320797-lpc-leica-perspective-control-on-q2-and-q2m/?tab=comments#comment-4199232", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "perspective control -----> tags !!!  the raw with the geometry to correct. it is reversible in post. if shooting jpeg, the image is cropped after the correction applied and is not reversible. the feature relies on the built-in level of the m10-p, m10-m, and m10-r. it is not available on the m10 and i am not sure the q2 and q2 monochrom will get this software update, but one can always hope (and write leica).", "sortedWord": "None", "identifyer": 7108, "year": "2021"}, {"Unnamed: 0": 444071, "autor": "Guest", "date": 1616298660000, "content": "1 hour ago, Faravahar said: Small update to my question above. I have figured out how to reproduce the issue. Unfortunately, the sensor on my Q2M also generates stuck white pixels, quite a few in each photo. Well, I guess, its's not acceptable, particularly for the price tag Leica set. What a disappointment! --img--  Edited March 21 by Guest", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/9/?tab=comments#comment-4164971", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1 hour ago, faravahar said: small update to my question above. i have figured out how to reproduce the issue. unfortunately, the sensor on my q2m also generates stuck white pixels, quite a few in each photo. well, i guess, its's not acceptable, particularly for the price -----> tag !!!  leica set. what a disappointment! --img--  edited march 21 by guest", "sortedWord": "None", "identifyer": 7456, "year": "2021"}], "name": "tagL-Forum2021"}