{"interestingcomments": [{"Unnamed: 0": 341283, "autor": "derleicaman", "date": 1590703980000, "content": "I'll admit I am a bagaholic. I have numerous bags by Billinham, FOGG, Domke and Brady. I also have back pack style bags in nylon when I would carry my Nikon kit. At one time, I was a US retailer for FOGG, which did not help my addiction. My other bag that I rotate with the Brady is a FOGG b-Sharp or b-Minor. They are the perfect size for an M kit. Here's my current carry. I have used Brady bags for years, this one is the Brady Ariel Trout Small. I have another in all black and another in tan and khaki. Little known fact is that the founder of Billingham, Martin Billingham, used to work as the Chief Cutter for Brady, hence the resemblance on the two bag lines. Brady does not make inserts, so I picked up a nice padded one for about $15 on that auction site. Billingham is great, but there is something about Brady that appeals to me more. Maybe it is the perception that the materials used are slightly nicer than Billingham or perhaps that my good friends Tom A and Sal DiMarco used to use them exclusively. Contents: M10 with half case and Rock N Roll strap and several lenses. My lenses are stored and carried in small nylon mesh pouches I found on Amazon. I added the Leica Red drawstring with an ID tag to identify which lens is inside. You can also feel the lens through the mesh to tell by touch which lens is which. I also carry extra batteries, lens clothes, business cards, etc. in see through mesh pouches which keep things organized. I use a small folding leather card holder from Leica that carries my memory cards. I also have an additional insert from Brady that snaps into place, and is an organizer with zipper and with small pockets for pens, passport and papers. This bag can also accommodate my iPad as well. All in a fairly discrete, comfortable and space efficient size. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/309018-whats-in-your-leica-m10-camera-bag/page/4/?tab=comments#comment-3982352", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i'll admit i am a bagaholic. i have numerous bags by billinham, fogg, domke and brady. i also have back pack style bags in nylon when i would carry my nikon kit. at one time, i was a us retailer for fogg, which did not help my addiction. my other bag that i rotate with the brady is a fogg b-sharp or b-minor. they are the perfect size for an m kit. here's my current carry. i have used brady bags for years, this one is the brady ariel trout small. i have another in all black and another in tan and khaki. little known fact is that the founder of billingham, martin billingham, used to work as the chief cutter for brady, hence the resemblance on the two bag lines. brady does not make inserts, so i picked up a nice padded one for about $15 on that auction site. billingham is great, but there is something about brady that appeals to me more. maybe it is the perception that the materials used are slightly nicer than billingham or perhaps that my good friends tom a and sal dimarco used to use them exclusively. contents: m10 with half case and rock n roll strap and several lenses. my lenses are stored and carried in small nylon mesh pouches i found on amazon. i added the leica red drawstring with an id -----> tag !!!  to identify which lens is inside. you can also feel the lens through the mesh to tell by touch which lens is which. i also carry extra batteries, lens clothes, business cards, etc. in see through mesh pouches which keep things organized. i use a small folding leather card holder from leica that carries my memory cards. i also have an additional insert from brady that snaps into place, and is an organizer with zipper and with small pockets for pens, passport and papers. this bag can also accommodate my ipad as well. all in a fairly discrete, comfortable and space efficient size. --img-- --img-- ", "sortedWord": "None", "identifyer": 2353, "year": "2020"}, {"Unnamed: 0": 341284, "autor": "lucerne", "date": 1590772080000, "content": "18 hours ago, derleicaman said: I'll admit I am a bagaholic. I have numerous bags by Billinham, FOGG, Domke and Brady. I also have back pack style bags in nylon when I would carry my Nikon kit. At one time, I was a US retailer for FOGG, which did not help my addiction. My other bag that I rotate with the Brady is a FOGG b-Sharp or b-Minor. They are the perfect size for an M kit. Here's my current carry. I have used Brady bags for years, this one is the Brady Ariel Trout Small. I have another in all black and another in tan and khaki. Little known fact is that the founder of Billingham, Martin Billingham, used to work as the Chief Cutter for Brady, hence the resemblance on the two bag lines. Brady does not make inserts, so I picked up a nice padded one for about $15 on that auction site. Billingham is great, but there is something about Brady that appeals to me more. Maybe it is the perception that the materials used are slightly nicer than Billingham or perhaps that my good friends Tom A and Sal DiMarco used to use them exclusively. Contents: M10 with half case and Rock N Roll strap and several lenses. My lenses are stored and carried in small nylon mesh pouches I found on Amazon. I added the Leica Red drawstring with an ID tag to identify which lens is inside. You can also feel the lens through the mesh to tell by touch which lens is which. I also carry extra batteries, lens clothes, business cards, etc. in see through mesh pouches which keep things organized. I use a small folding leather card holder from Leica that carries my memory cards. I also have an additional insert from Brady that snaps into place, and is an organizer with zipper and with small pockets for pens, passport and papers. This bag can also accommodate my iPad as well. All in a fairly discrete, comfortable and space efficient size. --img--  --img--  This is a solution that interests me. The Brady bag looks good. I’ve located an insert but it would be helpful to know the dimensions of the insert you have acquired. I don’t want the height of the insert to exceed the capacity of the bag. What iPad are you using. 7” or 9” Thanks.", "link": "https://www.l-camera-forum.com/topic/309018-whats-in-your-leica-m10-camera-bag/page/4/?tab=comments#comment-3982773", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "18 hours ago, derleicaman said: i'll admit i am a bagaholic. i have numerous bags by billinham, fogg, domke and brady. i also have back pack style bags in nylon when i would carry my nikon kit. at one time, i was a us retailer for fogg, which did not help my addiction. my other bag that i rotate with the brady is a fogg b-sharp or b-minor. they are the perfect size for an m kit. here's my current carry. i have used brady bags for years, this one is the brady ariel trout small. i have another in all black and another in tan and khaki. little known fact is that the founder of billingham, martin billingham, used to work as the chief cutter for brady, hence the resemblance on the two bag lines. brady does not make inserts, so i picked up a nice padded one for about $15 on that auction site. billingham is great, but there is something about brady that appeals to me more. maybe it is the perception that the materials used are slightly nicer than billingham or perhaps that my good friends tom a and sal dimarco used to use them exclusively. contents: m10 with half case and rock n roll strap and several lenses. my lenses are stored and carried in small nylon mesh pouches i found on amazon. i added the leica red drawstring with an id -----> tag !!!  to identify which lens is inside. you can also feel the lens through the mesh to tell by touch which lens is which. i also carry extra batteries, lens clothes, business cards, etc. in see through mesh pouches which keep things organized. i use a small folding leather card holder from leica that carries my memory cards. i also have an additional insert from brady that snaps into place, and is an organizer with zipper and with small pockets for pens, passport and papers. this bag can also accommodate my ipad as well. all in a fairly discrete, comfortable and space efficient size. --img--  --img--  this is a solution that interests me. the brady bag looks good. i’ve located an insert but it would be helpful to know the dimensions of the insert you have acquired. i don’t want the height of the insert to exceed the capacity of the bag. what ipad are you using. 7” or 9” thanks.", "sortedWord": "None", "identifyer": 2354, "year": "2020"}, {"Unnamed: 0": 341910, "autor": "T25UFO", "date": 1584186360000, "content": "Oh, and I forgot to mention a Fogg Bumble bee dating back to the 1980s. This was when Fogg bags were made in the UK and it has the Wanstead Place address tag inside! They may be expensive, but they do last . . . --img-- ", "link": "https://www.l-camera-forum.com/topic/307354-camera-bag-again-and-again/page/2/?tab=comments#comment-3931053", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "oh, and i forgot to mention a fogg bumble bee dating back to the 1980s. this was when fogg bags were made in the uk and it has the wanstead place address -----> tag !!!  inside! they may be expensive, but they do last . . . --img-- ", "sortedWord": "None", "identifyer": 2980, "year": "2020"}, {"Unnamed: 0": 342013, "autor": "ChrisL", "date": 1605725160000, "content": "Too many bags and backpacks sit in my closet unused. These are what I actually use: Ona Bowery (Canvas) - my EDC for two M10s, each with a lens, spare batteries et al. Very comfortable and light (8.5 pounds loaded). With me every day. Ona Prince St. (Leather) - 2 M10s, 4 lenses, Visoflex, spare batteries, et al. Comfortable, beautiful, a tag heavy (11 pounds loaded). Handle doubles as a roller case handle sleeve. What I use when I know I’ll need the whole kit. WaterField Designs Pro Executive Laptop Backpack (Leather & Nylon). My travel bag - holds all photography gear (I use separate pouches) and electronics (16” MacBook Pro, 11” iPad Pro). Incredibly well made, durable as hell, beautiful, doesn’t look like a camera bag, comfortable (if a bit heavy loaded), has a roller case handle sleeve. This thing holds everything and the kitchen sink. --img-- ", "link": "https://www.l-camera-forum.com/topic/307354-camera-bag-again-and-again/page/7/?tab=comments#comment-4082743", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "too many bags and backpacks sit in my closet unused. these are what i actually use: ona bowery (canvas) - my edc for two m10s, each with a lens, spare batteries et al. very comfortable and light (8.5 pounds loaded). with me every day. ona prince st. (leather) - 2 m10s, 4 lenses, visoflex, spare batteries, et al. comfortable, beautiful, a -----> tag !!!  heavy (11 pounds loaded). handle doubles as a roller case handle sleeve. what i use when i know i’ll need the whole kit. waterfield designs pro executive laptop backpack (leather & nylon). my travel bag - holds all photography gear (i use separate pouches) and electronics (16” macbook pro, 11” ipad pro). incredibly well made, durable as hell, beautiful, doesn’t look like a camera bag, comfortable (if a bit heavy loaded), has a roller case handle sleeve. this thing holds everything and the kitchen sink. --img-- ", "sortedWord": "None", "identifyer": 3084, "year": "2020"}, {"Unnamed: 0": 344142, "autor": "FlashGordonPhotography", "date": 1598566800000, "content": "27 minutes ago, 250swb said: No it wasn't rude, it was 'amazed'. Promoting the spending of thousands of dollars on a new camera based on a bit more headroom drops my jaw, if you don't see the irony when you are a beta tester for Leica then there is no hope for anybody listening to you. Sure some people will follow the scent, but the M10R is even more temporary and even more pointless for the majority of photographers than most of Leica's offerings in recent times. If this was a specialist discussion about theatre photography or similar I could imagine the extra headroom of an M10R may be a vital element, but for 99% of Leica photographers on this forum it won't make any difference at all other than the bank balance, even if they pixel peep. Thousands of dollars for that? It is symptomatic across the industry that the old camera is now not fit for purpose because hey, you may just meet those situations you never even considered or complained about before. Big revolutions have gone on continually in photography for near on 180 years and only in recent times has the previous work of photographers been cast in doubt, largely driven by marketing and the next best sensor. Now is the age when a tiny improvement costs thousands and appeals to people who want to tick the box to say they are riding the crest of the wave. Do they make better photographs, no, they make the same photograph time after time, every Summer holiday and every Christmas. That is the sink hole of new cameras unless they offer a proper step change, and that is the hole reviewers dig for their fans. I see it this way. Who cares if it's thousands of dollars for an incremental upgrade? The decision to spend or not spend the money is up to the individual who's money it is. Not to an audience with no knowledge of the purchaser. I am not the richest person on these forums. Nor am I the poorest. But I will spend my money how I please and no one else gets a say in what I do with my hard earned cash. So what if I like shiny new things and I'm an awful photographer. It's my money and I'm not hurting anyone. Discretionary purchases don't have to make sense. They almost never do. That's daft and a good way to kill an economy. People buy a Mercedes instead of a Toyota or a Tag instead of a Casio. A big TV or a new set of golf clubs. I know people who spend more on a road bike than an M10 just to save 500 grams. Won't make them faster but it makes them feel good. So why not? There's a thing called *pride of ownership*. People like shiny stuff. I don't buy my girl a piece of jewelry (actually in her case a pair of shoes....) because is functions better than the piece she already has. If we were being purely logical the Leica wouldn't exist. We'd still be shooting Canikony! We're so far from logical purchases it's laughable so arguing that upgrading from a M10 to M10R because you don't need it is laughable in itself. I'm sure you wanted to say \"I don't see the point and I'm not going to spend my money on what I see as an incremental upgrade\". Great. But that's not how it reads. It reads that you think we're idiots for upgrading and wasting or money on something that's not going to make any difference to our photography. Which is (a) wrong and (b) the whole point of Leica to begin with. Most of us work stupidly hard for our money and we really don't like being told how to spend it or that we're stupid for doing it. We're not. We get enough people telling us we're stupid for buying Leica from outside the Leica community that we really don't appreciate it from within. Gordon", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/page/5/?tab=comments#comment-4034715", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "27 minutes ago, 250swb said: no it wasn't rude, it was 'amazed'. promoting the spending of thousands of dollars on a new camera based on a bit more headroom drops my jaw, if you don't see the irony when you are a beta tester for leica then there is no hope for anybody listening to you. sure some people will follow the scent, but the m10r is even more temporary and even more pointless for the majority of photographers than most of leica's offerings in recent times. if this was a specialist discussion about theatre photography or similar i could imagine the extra headroom of an m10r may be a vital element, but for 99% of leica photographers on this forum it won't make any difference at all other than the bank balance, even if they pixel peep. thousands of dollars for that? it is symptomatic across the industry that the old camera is now not fit for purpose because hey, you may just meet those situations you never even considered or complained about before. big revolutions have gone on continually in photography for near on 180 years and only in recent times has the previous work of photographers been cast in doubt, largely driven by marketing and the next best sensor. now is the age when a tiny improvement costs thousands and appeals to people who want to tick the box to say they are riding the crest of the wave. do they make better photographs, no, they make the same photograph time after time, every summer holiday and every christmas. that is the sink hole of new cameras unless they offer a proper step change, and that is the hole reviewers dig for their fans. i see it this way. who cares if it's thousands of dollars for an incremental upgrade? the decision to spend or not spend the money is up to the individual who's money it is. not to an audience with no knowledge of the purchaser. i am not the richest person on these forums. nor am i the poorest. but i will spend my money how i please and no one else gets a say in what i do with my hard earned cash. so what if i like shiny new things and i'm an awful photographer. it's my money and i'm not hurting anyone. discretionary purchases don't have to make sense. they almost never do. that's daft and a good way to kill an economy. people buy a mercedes instead of a toyota or a -----> tag !!!  instead of a casio. a big tv or a new set of golf clubs. i know people who spend more on a road bike than an m10 just to save 500 grams. won't make them faster but it makes them feel good. so why not? there's a thing called *pride of ownership*. people like shiny stuff. i don't buy my girl a piece of jewelry (actually in her case a pair of shoes....) because is functions better than the piece she already has. if we were being purely logical the leica wouldn't exist. we'd still be shooting canikony! we're so far from logical purchases it's laughable so arguing that upgrading from a m10 to m10r because you don't need it is laughable in itself. i'm sure you wanted to say \"i don't see the point and i'm not going to spend my money on what i see as an incremental upgrade\". great. but that's not how it reads. it reads that you think we're idiots for upgrading and wasting or money on something that's not going to make any difference to our photography. which is (a) wrong and (b) the whole point of leica to begin with. most of us work stupidly hard for our money and we really don't like being told how to spend it or that we're stupid for doing it. we're not. we get enough people telling us we're stupid for buying leica from outside the leica community that we really don't appreciate it from within. gordon", "sortedWord": "None", "identifyer": 5224, "year": "2020"}, {"Unnamed: 0": 345914, "autor": "LBJ2", "date": 1605617640000, "content": "6 hours ago, Ktsa5239 said: Sorry for another M10 to M10R post... In Australia, the trade in is fairly costly. I could potentially trade my M10 and the 16-18-21 WATE (used twice in the last 2 years) for the M10R, I'll still need to top up 3k so its a rather substantial investment. Ive hopped onto the SL2 earlier in the year, while it opened up new opportunities like long lenses for birds and macro for floral. I cant help but feel its not giving me the same experience I got from the M. I also find it too heavy as a system to carry for long hikes and trips and I really miss the M at those times. The reason I really want to upgrade are: 1) Higher Dynamic Range (from reviews and photo samples) 2) Better highlight recovery (from reviews and photo samples) 3) Ability to crop with higher MP so I could travel with just a 35mm and maybe a 90mm The reasons against it: 1) Tie up a whole bunch of funds (I can only afford to this once really so if anything new comes along I wont be able to afford it) 2) About the same sensor MP count as SL2 3) M11 might have ibis.... or what if CL2 comes along with EVF and ibis and light Oh man....what should I do..... Time heals even the most severe GAS ! I don't think I've read many comments that don't praise the M10-R, highly. Many of us already know the M10 form factor is a beauty to behold and to use and now with an even better sensor that ups the DR and highlight recovery in the -R...all very compelling for those of us that appreciate such things. But when push comes to shove aka the M10-R price tag, I do wonder what many who do take the plunge is doing with the slightly better DR, Highlight Recovery, more pixels and and as some claim, better skin tones? Surely these nuanced improvements can't be wasted on just posting severely downsized jpeg files to the forum or to show friends and family on our smart phones or social media. Trust me, I do love to pixel peep all the MPs and marvel at all the detail I can snatch out of the shadows in post, but then what? BTW, I think your current setup of the SL2 and the M10 is more than a fine even enviable kit. You get your high MP fix with the SL2 and your Rangefinder fix with your humble 24MP M10 wink, wink. My guess is you've got some beautiful SL and M glass too. Also, keep in mind that our shops easy trade in programs = the ability to make even more money on us twice 🤔. If you can, resell any gear you don't use or want yourself is almost always a better ROI than trade-ins. Of course selling used gear can also be a PITA, but if you are not happy with your SL2, M10 and WATE, then I'd say you can raise some serious cash by selling these yourself.", "link": "https://www.l-camera-forum.com/topic/315203-to-trade-or-not-to-trade/?tab=comments#comment-4081955", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "6 hours ago, ktsa5239 said: sorry for another m10 to m10r post... in australia, the trade in is fairly costly. i could potentially trade my m10 and the 16-18-21 wate (used twice in the last 2 years) for the m10r, i'll still need to top up 3k so its a rather substantial investment. ive hopped onto the sl2 earlier in the year, while it opened up new opportunities like long lenses for birds and macro for floral. i cant help but feel its not giving me the same experience i got from the m. i also find it too heavy as a system to carry for long hikes and trips and i really miss the m at those times. the reason i really want to upgrade are: 1) higher dynamic range (from reviews and photo samples) 2) better highlight recovery (from reviews and photo samples) 3) ability to crop with higher mp so i could travel with just a 35mm and maybe a 90mm the reasons against it: 1) tie up a whole bunch of funds (i can only afford to this once really so if anything new comes along i wont be able to afford it) 2) about the same sensor mp count as sl2 3) m11 might have ibis.... or what if cl2 comes along with evf and ibis and light oh man....what should i do..... time heals even the most severe gas ! i don't think i've read many comments that don't praise the m10-r, highly. many of us already know the m10 form factor is a beauty to behold and to use and now with an even better sensor that ups the dr and highlight recovery in the -r...all very compelling for those of us that appreciate such things. but when push comes to shove aka the m10-r price -----> tag !!! , i do wonder what many who do take the plunge is doing with the slightly better dr, highlight recovery, more pixels and and as some claim, better skin tones? surely these nuanced improvements can't be wasted on just posting severely downsized jpeg files to the forum or to show friends and family on our smart phones or social media. trust me, i do love to pixel peep all the mps and marvel at all the detail i can snatch out of the shadows in post, but then what? btw, i think your current setup of the sl2 and the m10 is more than a fine even enviable kit. you get your high mp fix with the sl2 and your rangefinder fix with your humble 24mp m10 wink, wink. my guess is you've got some beautiful sl and m glass too. also, keep in mind that our shops easy trade in programs = the ability to make even more money on us twice 🤔. if you can, resell any gear you don't use or want yourself is almost always a better roi than trade-ins. of course selling used gear can also be a pita, but if you are not happy with your sl2, m10 and wate, then i'd say you can raise some serious cash by selling these yourself.", "sortedWord": "None", "identifyer": 7003, "year": "2020"}, {"Unnamed: 0": 346420, "autor": "magixaxeman", "date": 1580603940000, "content": "My experiences with the Sony A7RIII has taught me that the extra resolution comes with a hidden price tag, it shows up the flaws in your technique, so when I turned of the IBIS and all the gadgetry and manual focused any advantage the extra resolution gave me was lost, OK for someone younger than my 61yrs with better eyesight and who doesn't have to contend with physical disability as well maybe they can take advantage of the extra resolution, but I can't and this is why I was so heartbroken when the new M10M came out with the larger sensor, its just not for me.", "link": "https://www.l-camera-forum.com/topic/305898-how-many-with-sell-their-m10-for-the-m10r/page/2/?tab=comments#comment-3904277", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "my experiences with the sony a7riii has taught me that the extra resolution comes with a hidden price -----> tag !!! , it shows up the flaws in your technique, so when i turned of the ibis and all the gadgetry and manual focused any advantage the extra resolution gave me was lost, ok for someone younger than my 61yrs with better eyesight and who doesn't have to contend with physical disability as well maybe they can take advantage of the extra resolution, but i can't and this is why i was so heartbroken when the new m10m came out with the larger sensor, its just not for me.", "sortedWord": "None", "identifyer": 7511, "year": "2020"}, {"Unnamed: 0": 348951, "autor": "gettons", "date": 1599304020000, "content": "1 hour ago, scott kirkpatrick said: I've used an M10-D since 2018. It minimizes your impact on the people around you, since it looks a lot like an M6 or 7. Of course that factor depends even more on you, but I live in a country where some people object to being captured in a photo, and not being able to stop for inspection comes in handy. Purchased new from existing unsold stock won't save any money, but they may be available used from time to time. Inside the camera, it's an M10-P with the quiet shutter. Thank you Scott! The workflow with an m10-D appears very similar to analog to some extent. And because I have an m6 and develop at home, that specific side things are not super attractive to me (because essentially I can do with the film camera). However the discreetness and the lack of lcd display it’s something I like. At the end of the day I have a film camera, and the idea of having a modern one with lcd also does not seem like a bad idea in case I need to frame at very weird angles. And this is where the m10-p comes into play. I am only wondering if I go for the m10-p, is it going to be easy to resell one day if I need to (provided the m10-r is almost the same price)? Who should go for a new m10-p as opposed to a new m10-r these days? Cause I am sure there is people who prefers a brand new m10-p even at the same price tag (which is not exactly the same here in the UK though, there is a £600 difference).", "link": "https://www.l-camera-forum.com/topic/313012-m10-p-or-m10-r-for-my-first-digital-leica/?tab=comments#comment-4040318", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1 hour ago, scott kirkpatrick said: i've used an m10-d since 2018. it minimizes your impact on the people around you, since it looks a lot like an m6 or 7. of course that factor depends even more on you, but i live in a country where some people object to being captured in a photo, and not being able to stop for inspection comes in handy. purchased new from existing unsold stock won't save any money, but they may be available used from time to time. inside the camera, it's an m10-p with the quiet shutter. thank you scott! the workflow with an m10-d appears very similar to analog to some extent. and because i have an m6 and develop at home, that specific side things are not super attractive to me (because essentially i can do with the film camera). however the discreetness and the lack of lcd display it’s something i like. at the end of the day i have a film camera, and the idea of having a modern one with lcd also does not seem like a bad idea in case i need to frame at very weird angles. and this is where the m10-p comes into play. i am only wondering if i go for the m10-p, is it going to be easy to resell one day if i need to (provided the m10-r is almost the same price)? who should go for a new m10-p as opposed to a new m10-r these days? cause i am sure there is people who prefers a brand new m10-p even at the same price -----> tag !!!  (which is not exactly the same here in the uk though, there is a £600 difference).", "sortedWord": "None", "identifyer": 10053, "year": "2020"}, {"Unnamed: 0": 348952, "autor": "250swb", "date": 1599307440000, "content": "51 minutes ago, gettons said: Thank you Scott! The workflow with an m10-D appears very similar to analog to some extent. And because I have an m6 and develop at home, that specific side things are not super attractive to me (because essentially I can do with the film camera). However the discreetness and the lack of lcd display it’s something I like. At the end of the day I have a film camera, and the idea of having a modern one with lcd also does not seem like a bad idea in case I need to frame at very weird angles. And this is where the m10-p comes into play. I am only wondering if I go for the m10-p, is it going to be easy to resell one day if I need to (provided the m10-r is almost the same price)? Who should go for a new m10-p as opposed to a new m10-r these days? Cause I am sure there is people who prefers a brand new m10-p even at the same price tag (which is not exactly the same here in the UK though, there is a £600 difference). If you are doing landscape and want to get the best out of any camera you'll sometimes use a tripod and an LCD is invaluable if you are stood waiting for the light to change. It will also allow you to compose the picture accurately. But are you sure you can't still get an M10 and forget the 'P', after all a roll of black tape is much cheaper than paying so much more for cosmetic differences?", "link": "https://www.l-camera-forum.com/topic/313012-m10-p-or-m10-r-for-my-first-digital-leica/?tab=comments#comment-4040354", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "51 minutes ago, gettons said: thank you scott! the workflow with an m10-d appears very similar to analog to some extent. and because i have an m6 and develop at home, that specific side things are not super attractive to me (because essentially i can do with the film camera). however the discreetness and the lack of lcd display it’s something i like. at the end of the day i have a film camera, and the idea of having a modern one with lcd also does not seem like a bad idea in case i need to frame at very weird angles. and this is where the m10-p comes into play. i am only wondering if i go for the m10-p, is it going to be easy to resell one day if i need to (provided the m10-r is almost the same price)? who should go for a new m10-p as opposed to a new m10-r these days? cause i am sure there is people who prefers a brand new m10-p even at the same price -----> tag !!!  (which is not exactly the same here in the uk though, there is a £600 difference). if you are doing landscape and want to get the best out of any camera you'll sometimes use a tripod and an lcd is invaluable if you are stood waiting for the light to change. it will also allow you to compose the picture accurately. but are you sure you can't still get an m10 and forget the 'p', after all a roll of black tape is much cheaper than paying so much more for cosmetic differences?", "sortedWord": "None", "identifyer": 10054, "year": "2020"}, {"Unnamed: 0": 354546, "autor": "Martin B", "date": 1601986020000, "content": "I just bought a mint \"used\" M-E 240 a few months ago, and I am very happy with it so far in combination with all kind of M and LTM lenses. I am not a high ISO shooter, so the realistic cap of ISO 1600 is not an issue for me. I just wish the M 240 had a bit better low ISO performance with real ISO 100 and pushed ISO 50. But I have my workarounds for this, so I am fine here, too. Regarding resolution, I am using also the 36 MP FF Sony A7R in parallel - one reason why I bought the M-E 240 is ideal performance with wide and ultra-wide lenses which gave me issues on the A7R. Even the M-E 240 is only 24 MP, photos taken with wide M and LTM lenses are better in resolution especially in the corners of the frame than on the higher resolution A7R camera. But yes, there is a difference in resolution when looking at image details in 200% on a large screen. But the difference is not huge either. I can print 20x30\" with photos from both cameras easily. I admit that the M10R is my \"dream\" camera, but I cannot justify its severe price tag. Getting the M-E 240 for less than 1/4th of the price of a new M10R was a no-brainer for me. I would benefit in my style of photography from the higher resolution and DR of the M10R but honestly a camera never holds me back from getting the shot done. The M 240 series is pretty good in pushing shadows already just has the limitation in highlight DR. I simply use exposure bracketing here when this is needed and use HDR in a realistic way to post-process these digital files. I don't expect M10 series prices to drop significantly to the level where I would consider buying for several years to come. I personally believe that the M 240 series currently has the best price/quality ratio when interested in buying a digital Leica M. There likely won't be much future depreciation in value of several years for what I already got my M-E 240 for. Just my 2 Cents. Edited October 6, 2020 by Martin B", "link": "https://www.l-camera-forum.com/topic/313204-m240-to-the-new-m10-r-is-it-really-worth-the-upgrade/page/3/?tab=comments#comment-4058140", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i just bought a mint \"used\" m-e 240 a few months ago, and i am very happy with it so far in combination with all kind of m and ltm lenses. i am not a high iso shooter, so the realistic cap of iso 1600 is not an issue for me. i just wish the m 240 had a bit better low iso performance with real iso 100 and pushed iso 50. but i have my workarounds for this, so i am fine here, too. regarding resolution, i am using also the 36 mp ff sony a7r in parallel - one reason why i bought the m-e 240 is ideal performance with wide and ultra-wide lenses which gave me issues on the a7r. even the m-e 240 is only 24 mp, photos taken with wide m and ltm lenses are better in resolution especially in the corners of the frame than on the higher resolution a7r camera. but yes, there is a difference in resolution when looking at image details in 200% on a large screen. but the difference is not huge either. i can print 20x30\" with photos from both cameras easily. i admit that the m10r is my \"dream\" camera, but i cannot justify its severe price -----> tag !!! . getting the m-e 240 for less than 1/4th of the price of a new m10r was a no-brainer for me. i would benefit in my style of photography from the higher resolution and dr of the m10r but honestly a camera never holds me back from getting the shot done. the m 240 series is pretty good in pushing shadows already just has the limitation in highlight dr. i simply use exposure bracketing here when this is needed and use hdr in a realistic way to post-process these digital files. i don't expect m10 series prices to drop significantly to the level where i would consider buying for several years to come. i personally believe that the m 240 series currently has the best price/quality ratio when interested in buying a digital leica m. there likely won't be much future depreciation in value of several years for what i already got my m-e 240 for. just my 2 cents. edited october 6, 2020 by martin b", "sortedWord": "None", "identifyer": 15704, "year": "2020"}, {"Unnamed: 0": 354716, "autor": "adan", "date": 1605469500000, "content": "Only after the fact, with an EXIF editing app. (Along with some external manual note-taking technique at the moment of exposure, from paper-and-pen to a smartphone \"notes\" app). But it depends on exactly why you need to know the lens type later. For example, I was just yesterday comparing my 28mm Elmarit-M v.3 (available in the M menu) with a 28mm Elmarit v.2 (not supported by the coding system at all). I simply used the camera menu to tag the v.2 pictures as made with a 28mm v.4 (which I don't own). Thus I can tell which is which, straight from the camera, for my comparisons. And later use an EXIF editor to correct the EXIF to \"Elmarit 28mm/Leitz type II\" or something similar - if I wanted to bother. Back in the day, Ansel Adams and Edward Weston kept diaries of which lens they used for each picture. Weston's \"Daybooks\" record things like \"I placed it in the funnel, focused with the Zeiss [210mm at f/36], and knowing just the viewpoint, recognizing a perfect light, made an exposure of six minutes, with but a few moments' preliminary work, the real preliminary was on in hours passed. I have a great negative....\" https://en.wikipedia.org/wiki/Pepper_No._30 Edited November 15, 2020 by adan", "link": "https://www.l-camera-forum.com/topic/315151-exifmetadata/?tab=comments#comment-4080921", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "only after the fact, with an exif editing app. (along with some external manual note-taking technique at the moment of exposure, from paper-and-pen to a smartphone \"notes\" app). but it depends on exactly why you need to know the lens type later. for example, i was just yesterday comparing my 28mm elmarit-m v.3 (available in the m menu) with a 28mm elmarit v.2 (not supported by the coding system at all). i simply used the camera menu to -----> tag !!!  the v.2 pictures as made with a 28mm v.4 (which i don't own). thus i can tell which is which, straight from the camera, for my comparisons. and later use an exif editor to correct the exif to \"elmarit 28mm/leitz type ii\" or something similar - if i wanted to bother. back in the day, ansel adams and edward weston kept diaries of which lens they used for each picture. weston's \"daybooks\" record things like \"i placed it in the funnel, focused with the zeiss [210mm at f/36], and knowing just the viewpoint, recognizing a perfect light, made an exposure of six minutes, with but a few moments' preliminary work, the real preliminary was on in hours passed. i have a great negative....\" https://en.wikipedia.org/wiki/pepper_no._30 edited november 15, 2020 by adan", "sortedWord": "None", "identifyer": 15874, "year": "2020"}, {"Unnamed: 0": 362466, "autor": "Keith (M)", "date": 1597442340000, "content": "Just now, ymc226 said: I agree that those pictures are very nice. Did you use filters on your 21 SEM? Thanks. Filter? Mostly orange, sometimes medium yellow. I've (probably) added a relevant tag to most of the Flickr selection.", "link": "https://www.l-camera-forum.com/topic/312315-m10m-for-landscapes/?tab=comments#comment-4027239", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "just now, ymc226 said: i agree that those pictures are very nice. did you use filters on your 21 sem? thanks. filter? mostly orange, sometimes medium yellow. i've (probably) added a relevant -----> tag !!!  to most of the flickr selection.", "sortedWord": "None", "identifyer": 23710, "year": "2020"}, {"Unnamed: 0": 364010, "autor": "Jeff S", "date": 1601475960000, "content": "28 minutes ago, wilfredo said: This has remained a most enjoyable thread. Going back to my original question connected to selling the M Monochrom (for those who own one or have owned one) I'm in the company of those who hold onto this camera. In my case it has become a challenge to use it because I've lost some use of my left hand, making focusing difficult and slow, and like many of us who are in their sixties, my eyesight has gotten worse. My second camera is a Sony A7RIII, not an intuitive camera but the ability of this camera to nail the focus, especially eye focus, is amazing. Nonetheless, my Black and White Sony conversions, although very satisfying, still sometimes lack that certain Je Ne Sais Quoi. It is the unique CCD sensor in the M Monocrom that keeps me married to this camera. I will probably hold onto it until it dies, meaning it can no longer be repaired. I mostly do Black and White photography and my favorite Black and White photographs remain those produced by my M Monochrom, and before that my M8. I bought my M8 when it first hit the market, and what caught my eye regarding this camera were the B&W photos posted on the Leica Forum. I see a change in esthetics as camera sensors become more \"clinical\" and perfect. I realize that profits dictate what the photo industry produces and so the CCD sensor has run its life cycle. Mystery is a constant theme in my photography, the search for meaning and answers, and the M Monochrom remains my most trusted photographic companion in that regard. --img--  It’s good to have a style and a vision, and even better to have the tools and the workflow to support that end. And better still if you enjoy working with those tools and are encouraged to use them frequently. I can relate to aging (70), left hand tremor and need for eye corrections. So far, M use is still pleasurable and effective. I only wish that the M Monochrom had the more modern M10 body improvements... better VF, 2m frame line optimization, quietness, robust build and better weather sealing, slimness, etc. But I don’t need the high resolution, or the high price tag, of the current M10 Monochrom, so the old machine sticks around. It still provides the all-b&w workflow experience, with superb results. Jeff", "link": "https://www.l-camera-forum.com/topic/313364-leica-monochrom-ccd-who%E2%80%99s-selling-why/page/4/?tab=comments#comment-4054829", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "28 minutes ago, wilfredo said: this has remained a most enjoyable thread. going back to my original question connected to selling the m monochrom (for those who own one or have owned one) i'm in the company of those who hold onto this camera. in my case it has become a challenge to use it because i've lost some use of my left hand, making focusing difficult and slow, and like many of us who are in their sixties, my eyesight has gotten worse. my second camera is a sony a7riii, not an intuitive camera but the ability of this camera to nail the focus, especially eye focus, is amazing. nonetheless, my black and white sony conversions, although very satisfying, still sometimes lack that certain je ne sais quoi. it is the unique ccd sensor in the m monocrom that keeps me married to this camera. i will probably hold onto it until it dies, meaning it can no longer be repaired. i mostly do black and white photography and my favorite black and white photographs remain those produced by my m monochrom, and before that my m8. i bought my m8 when it first hit the market, and what caught my eye regarding this camera were the b&w photos posted on the leica forum. i see a change in esthetics as camera sensors become more \"clinical\" and perfect. i realize that profits dictate what the photo industry produces and so the ccd sensor has run its life cycle. mystery is a constant theme in my photography, the search for meaning and answers, and the m monochrom remains my most trusted photographic companion in that regard. --img--  it’s good to have a style and a vision, and even better to have the tools and the workflow to support that end. and better still if you enjoy working with those tools and are encouraged to use them frequently. i can relate to aging (70), left hand tremor and need for eye corrections. so far, m use is still pleasurable and effective. i only wish that the m monochrom had the more modern m10 body improvements... better vf, 2m frame line optimization, quietness, robust build and better weather sealing, slimness, etc. but i don’t need the high resolution, or the high price -----> tag !!! , of the current m10 monochrom, so the old machine sticks around. it still provides the all-b&w workflow experience, with superb results. jeff", "sortedWord": "None", "identifyer": 25265, "year": "2020"}, {"Unnamed: 0": 364133, "autor": "balooo", "date": 1579278420000, "content": "I know the pics files have been reduced for the post, but i'm sorry to say that it looks incredibly bad, and even worst, uninteresting... In addition, there is no way - except greed - that can justify a $8500 price tag for this camera, even with a 41MP sensor. I’ll give it $4000/4500 because, hey, it’s a Leica, but not more. It don't worth more, i'm sorry.", "link": "https://www.l-camera-forum.com/topic/305409-jono-slack-leica-m10-monochrom-field-report/?tab=comments#comment-3893224", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i know the pics files have been reduced for the post, but i'm sorry to say that it looks incredibly bad, and even worst, uninteresting... in addition, there is no way - except greed - that can justify a $8500 price -----> tag !!!  for this camera, even with a 41mp sensor. i’ll give it $4000/4500 because, hey, it’s a leica, but not more. it don't worth more, i'm sorry.", "sortedWord": "None", "identifyer": 25388, "year": "2020"}, {"Unnamed: 0": 364146, "autor": "SrMi", "date": 1579291800000, "content": "3 hours ago, balooo said: I know the pics files have been reduced for the post, but i'm sorry to say that it looks incredibly bad, and even worst, uninteresting... In addition, there is no way - except greed - that can justify a $8500 price tag for this camera, even with a 41MP sensor. I’ll give it $4000/4500 because, hey, it’s a Leica, but not more. It don't worth more, i'm sorry. DPR reports that the M10M sensor was \"designed from the ground up with Mono in mind.\" If that is true, then Leica will lose money on M10M, as it will never be able to recover the cost of development. Yes, M10M is a steal in that context :-).", "link": "https://www.l-camera-forum.com/topic/305409-jono-slack-leica-m10-monochrom-field-report/page/2/?tab=comments#comment-3893467", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "3 hours ago, balooo said: i know the pics files have been reduced for the post, but i'm sorry to say that it looks incredibly bad, and even worst, uninteresting... in addition, there is no way - except greed - that can justify a $8500 price -----> tag !!!  for this camera, even with a 41mp sensor. i’ll give it $4000/4500 because, hey, it’s a leica, but not more. it don't worth more, i'm sorry. dpr reports that the m10m sensor was \"designed from the ground up with mono in mind.\" if that is true, then leica will lose money on m10m, as it will never be able to recover the cost of development. yes, m10m is a steal in that context :-).", "sortedWord": "None", "identifyer": 25401, "year": "2020"}, {"Unnamed: 0": 364185, "autor": "thrid", "date": 1579375920000, "content": "On 1/17/2020 at 8:27 AM, balooo said: I know the pics files have been reduced for the post, but i'm sorry to say that it looks incredibly bad, and even worst, uninteresting... In addition, there is no way - except greed - that can justify a $8500 price tag for this camera, even with a 41MP sensor. I’ll give it $4000/4500 because, hey, it’s a Leica, but not more. It don't worth more, i'm sorry. it's a limited production camera. Leica will be lucky if they break even given the expense of R&D and production. Frankly $8500 is a steal for a proper BW 41MP digital camera. Aside from the older Leica Monochrome cameras your only other option is a Phase One back that costs $50,000. I would not be surprised if you see a few of these 10M bodies be used in film scanning rigs. At $8500 it's a bargain compared to the now discontinued Hasselblad X5. If you make three passes with R, G, B filters you can even scan in color. This would result in a true pixel for pixel resolution of 41MP, not an interpolated 41MP, which really is only about a 1/3rd of that resolution, because of the Bayer Pattern interpolation process.", "link": "https://www.l-camera-forum.com/topic/305409-jono-slack-leica-m10-monochrom-field-report/page/4/?tab=comments#comment-3894214", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 1/17/2020 at 8:27 am, balooo said: i know the pics files have been reduced for the post, but i'm sorry to say that it looks incredibly bad, and even worst, uninteresting... in addition, there is no way - except greed - that can justify a $8500 price -----> tag !!!  for this camera, even with a 41mp sensor. i’ll give it $4000/4500 because, hey, it’s a leica, but not more. it don't worth more, i'm sorry. it's a limited production camera. leica will be lucky if they break even given the expense of r&d and production. frankly $8500 is a steal for a proper bw 41mp digital camera. aside from the older leica monochrome cameras your only other option is a phase one back that costs $50,000. i would not be surprised if you see a few of these 10m bodies be used in film scanning rigs. at $8500 it's a bargain compared to the now discontinued hasselblad x5. if you make three passes with r, g, b filters you can even scan in color. this would result in a true pixel for pixel resolution of 41mp, not an interpolated 41mp, which really is only about a 1/3rd of that resolution, because of the bayer pattern interpolation process.", "sortedWord": "None", "identifyer": 25440, "year": "2020"}, {"Unnamed: 0": 364773, "autor": "Manicouagan1", "date": 1591409760000, "content": "I mostly use my M10 and my M10M to shoot landscapes and the 24mm f 2.8 lens is one of my favorites. I normally focus with the coincidence rangefinder and then compose with the Visoflex 020. With that approach I avoid surprises of unintended things getting in the corners or my composition. I like to tag my photos with GPS location and the Visoflex does a decent job of that.", "link": "https://www.l-camera-forum.com/topic/307985-visoflex-020-on-m10m/page/2/?tab=comments#comment-3988015", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i mostly use my m10 and my m10m to shoot landscapes and the 24mm f 2.8 lens is one of my favorites. i normally focus with the coincidence rangefinder and then compose with the visoflex 020. with that approach i avoid surprises of unintended things getting in the corners or my composition. i like to -----> tag !!!  my photos with gps location and the visoflex does a decent job of that.", "sortedWord": "None", "identifyer": 26033, "year": "2020"}, {"Unnamed: 0": 365023, "autor": "chasdfg", "date": 1589428200000, "content": "Regarding the SL2 vs M10M resolution, I was surprised by the difference between 41mp and 47mp at 100% too (the bottle label makes it rather evident). However because these are 100% crops, I'd contend this is actually unfair to the M10M. The M10M supposedly resolves the same detail as a 56-60mp sensor and I think this still holds true. You just won't see it when you have 100% crops of sensors of different resolutions. You'd see if it you cropped the M10M picture magnified to the same degree as the SL2 (e.g. 125% crop of M10M vs 100% crop of SL2). I've never done such a test myself so I can't be certain. On the ISO bit, because the M10M retains so much detail it does absolve it of the higher background noise I'm seeing. In my shooting I see a relatively high amount of grain over 6400 but the amount of detail is extraordinary, even at ISO 100,000. I never thought a Leica M would successfully address the triumvirate of high ISO performance, wide dynamic range and resolution all in one, just that it doesn't do colour. I suspect the M10R will remedy the colour bit but as usual won't excel as well in high ISO performance and possibly dynamic range as the M10M does. My view is that the SL line will continue to carry IBIS in Leica FF cameras whilst the M continues to leave it out, which will allow the SL line to carry the tag as the all rounded/flexible Leica FF camera and further differentiate the product lines. IBIS is definitely more useful than 1 stop of higher ISO performance.", "link": "https://www.l-camera-forum.com/topic/309507-bw-iso-showdown/?tab=comments#comment-3972956", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "regarding the sl2 vs m10m resolution, i was surprised by the difference between 41mp and 47mp at 100% too (the bottle label makes it rather evident). however because these are 100% crops, i'd contend this is actually unfair to the m10m. the m10m supposedly resolves the same detail as a 56-60mp sensor and i think this still holds true. you just won't see it when you have 100% crops of sensors of different resolutions. you'd see if it you cropped the m10m picture magnified to the same degree as the sl2 (e.g. 125% crop of m10m vs 100% crop of sl2). i've never done such a test myself so i can't be certain. on the iso bit, because the m10m retains so much detail it does absolve it of the higher background noise i'm seeing. in my shooting i see a relatively high amount of grain over 6400 but the amount of detail is extraordinary, even at iso 100,000. i never thought a leica m would successfully address the triumvirate of high iso performance, wide dynamic range and resolution all in one, just that it doesn't do colour. i suspect the m10r will remedy the colour bit but as usual won't excel as well in high iso performance and possibly dynamic range as the m10m does. my view is that the sl line will continue to carry ibis in leica ff cameras whilst the m continues to leave it out, which will allow the sl line to carry the -----> tag !!!  as the all rounded/flexible leica ff camera and further differentiate the product lines. ibis is definitely more useful than 1 stop of higher iso performance.", "sortedWord": "None", "identifyer": 26284, "year": "2020"}, {"Unnamed: 0": 365234, "autor": "Herr Barnack", "date": 1579365060000, "content": "https://www.bhphotovideo.com/explora/photography/hands-on-review/hands-on-review-of-the-incredible-leica-m10-monochrom?utm_medium=Email 1781133&utm_campaign=NewAnnouncement&utm_source=Leica 200117&utm_content=Explora&utm_term=hands-on-review-of-the&encEmail=30423046384643363833393232353542454233463235424436463437363634453439313732364639383234304332423830354334343438434545324630384542 $8300 USD - another price tag for \"practical\" people to scoff at and more fuel for the raging inferno that burns within the Leica haters. I once read an article where Leica cameras & lenses described as passion products. That statement rings true to my ear; they certainly have become one of my passions in this too short, too bland life. Too bland only if we settle for bland and let it be that way. The fact is, the vast majority of people living on this planet have no understanding of the concept of passion. I'm just happy and fortunate to not be one of them, even when I can't immediately afford every new camera and lens with which Leica rocks the photographic world, key word being immediately. Passion requires planning, effort, sacrifice and work. It's just a matter of time till the FedEx guy hands me a box containing my new M 10 Monochrom. 😊 JMHO/YMMV. Don't shoot me, I'm just the piano player.", "link": "https://www.l-camera-forum.com/topic/305415-leica-m10-monochrom-%E2%80%93-41-mp-in-black-white/?tab=comments#comment-3894062", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "https://www.bhphotovideo.com/explora/photography/hands-on-review/hands-on-review-of-the-incredible-leica-m10-monochrom?utm_medium=email 1781133&utm_campaign=newannouncement&utm_source=leica 200117&utm_content=explora&utm_term=hands-on-review-of-the&encemail=30423046384643363833393232353542454233463235424436463437363634453439313732364639383234304332423830354334343438434545324630384542 $8300 usd - another price -----> tag !!!  for \"practical\" people to scoff at and more fuel for the raging inferno that burns within the leica haters. i once read an article where leica cameras & lenses described as passion products. that statement rings true to my ear; they certainly have become one of my passions in this too short, too bland life. too bland only if we settle for bland and let it be that way. the fact is, the vast majority of people living on this planet have no understanding of the concept of passion. i'm just happy and fortunate to not be one of them, even when i can't immediately afford every new camera and lens with which leica rocks the photographic world, key word being immediately. passion requires planning, effort, sacrifice and work. it's just a matter of time till the fedex guy hands me a box containing my new m 10 monochrom. 😊 jmho/ymmv. don't shoot me, i'm just the piano player.", "sortedWord": "None", "identifyer": 26495, "year": "2020"}, {"Unnamed: 0": 365741, "autor": "frame-it", "date": 1584351480000, "content": "also: if you have exiftool installed run: exiftool -BitsPerSample Filename Exif ID TAG is 0x0102 [BitsPerSampleint16u[n]!IFD0]", "link": "https://www.l-camera-forum.com/topic/307465-m10m-12bit-or-14bit/page/2/?tab=comments#comment-3932531", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "also: if you have exiftool installed run: exiftool -bitspersample filename exif id -----> tag !!!  is 0x0102 [bitspersampleint16u[n]!ifd0]", "sortedWord": "None", "identifyer": 27005, "year": "2020"}, {"Unnamed: 0": 365742, "autor": "SrMi", "date": 1584373500000, "content": "5 hours ago, frame-it said: also: if you have exiftool installed run: exiftool -BitsPerSample Filename Exif ID TAG is 0x0102 [BitsPerSampleint16u[n]!IFD0] BitsPerSampleint16u is 16 for M10M's DNG files and 8 for M10M's JPG files. That field describes \"The number of bits per image component\" not the number of bits used by the camera. In Rawdigger, check the max values (or mouse over the brightest parts). It will be about 16000 for 14-bit and around 4000 for 12-bits.", "link": "https://www.l-camera-forum.com/topic/307465-m10m-12bit-or-14bit/page/2/?tab=comments#comment-3932720", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "5 hours ago, frame-it said: also: if you have exiftool installed run: exiftool -bitspersample filename exif id -----> tag !!!  is 0x0102 [bitspersampleint16u[n]!ifd0] bitspersampleint16u is 16 for m10m's dng files and 8 for m10m's jpg files. that field describes \"the number of bits per image component\" not the number of bits used by the camera. in rawdigger, check the max values (or mouse over the brightest parts). it will be about 16000 for 14-bit and around 4000 for 12-bits.", "sortedWord": "None", "identifyer": 27006, "year": "2020"}, {"Unnamed: 0": 365763, "autor": "UliWer", "date": 1581518280000, "content": "vor 1 Stunde schrieb proenca: One thing that I do not see anywhere, is lenses selection and how valid is the M10m with all its 42mp glory in BW when 97% or more of the Leica lenses lineup are not nearly optimized or can handle that resolution and take full advantage of it. ... Now let us imagine just for a moment that there was really anything like a sensor \"outresolving\" a lens: What would happen to your photos using an \"outresolved\" lens? Would the \"old\" lenses stop delivering light to the sensor, or would the sensor refuse to accept the \"bad\" light from such a lens? If a newer lens design shows more resolution than its precedssor, would this not be visible on film or an M8, M9, M (Typ 240), M10 - but only with a \"high resolution\" sensor? I think we already found out that a 50 Summilux asph showed higher resolution than a non-asph with \"traditional\" sensors. But we did not stop using the non-asph lenses then and those old lenses delivered what one expected from them and I see now reason at all to act different now. If one day there will be a new Summilux asph with much higher resolution than the present one (and an obvious price tag …) it will be bought. Until then all other lenses going back to the Hektor from 1930 can and will be used (more or less). Edited February 12, 2020 by UliWer", "link": "https://www.l-camera-forum.com/topic/306395-monochrom-m-lenses-and-future/?tab=comments#comment-3911621", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "vor 1 stunde schrieb proenca: one thing that i do not see anywhere, is lenses selection and how valid is the m10m with all its 42mp glory in bw when 97% or more of the leica lenses lineup are not nearly optimized or can handle that resolution and take full advantage of it. ... now let us imagine just for a moment that there was really anything like a sensor \"outresolving\" a lens: what would happen to your photos using an \"outresolved\" lens? would the \"old\" lenses stop delivering light to the sensor, or would the sensor refuse to accept the \"bad\" light from such a lens? if a newer lens design shows more resolution than its precedssor, would this not be visible on film or an m8, m9, m (typ 240), m10 - but only with a \"high resolution\" sensor? i think we already found out that a 50 summilux asph showed higher resolution than a non-asph with \"traditional\" sensors. but we did not stop using the non-asph lenses then and those old lenses delivered what one expected from them and i see now reason at all to act different now. if one day there will be a new summilux asph with much higher resolution than the present one (and an obvious price -----> tag !!!  …) it will be bought. until then all other lenses going back to the hektor from 1930 can and will be used (more or less). edited february 12, 2020 by uliwer", "sortedWord": "None", "identifyer": 27027, "year": "2020"}, {"Unnamed: 0": 365769, "autor": "UliWer", "date": 1581631320000, "content": "Well, I presume that we'll see quite a lot of marketing (professional or armchair) talk about super-lenses (with equivalent price tags) which alone will show the real advantage of a sensor with so many megapixels. And I also presume not so few people will follow this marketing strategy and buy some new super-lenses for their super sensors. We already had this talk the other way round - even by some people who recently decided that Leica left their Zen or Taoist or Aristotelian or Platonic approach to lens design. They told us that a 24 MP sensor would not make appropriate use of the resolving capacity of modern lenses. Leica Camera AG will not make any profit with lenses if people go on using their Summarons, or Elmarits or even Jupiters. It is up to the users if they bother about this or if they say: I like what I see and don't mind about optimized glass for maximized silicon.", "link": "https://www.l-camera-forum.com/topic/306395-monochrom-m-lenses-and-future/?tab=comments#comment-3912488", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "well, i presume that we'll see quite a lot of marketing (professional or armchair) talk about super-lenses (with equivalent price -----> tags !!! ) which alone will show the real advantage of a sensor with so many megapixels. and i also presume not so few people will follow this marketing strategy and buy some new super-lenses for their super sensors. we already had this talk the other way round - even by some people who recently decided that leica left their zen or taoist or aristotelian or platonic approach to lens design. they told us that a 24 mp sensor would not make appropriate use of the resolving capacity of modern lenses. leica camera ag will not make any profit with lenses if people go on using their summarons, or elmarits or even jupiters. it is up to the users if they bother about this or if they say: i like what i see and don't mind about optimized glass for maximized silicon.", "sortedWord": "None", "identifyer": 27033, "year": "2020"}, {"Unnamed: 0": 366128, "autor": "Herr Barnack", "date": 1579885260000, "content": "12 minutes ago, epand56 said: I saw many different pictures from the M 10M and none of them was so dramatically different from any other picture I've seen converted from a color DNG. At 8350 €, to me it looks like a very expensive toy for maniacs. Viewing images on a computer screen is not the best way to evaluate them; that having been said, the advances in image quality that the M10 Monochrom offers may be more of a matter of degrees rather than a night and day difference. Not many people print these days, but I think that in the Leica lineup, M10M could be thought of as the premier camera for making fine prints. And yes, there's no two ways about it: 8350€ is a price tag that causes the knees to give way for most of us. Leica M cameras and lenses are about passion, not about economic practicality. A Toyota Camry will get you to your destination with practicality. A Ferrari 812 GTS will get you to your destination with passion, elegance and euphoria.", "link": "https://www.l-camera-forum.com/topic/305695-lets-have-a-look-at-some-dng-files-from-the-m10m/?tab=comments#comment-3898499", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "12 minutes ago, epand56 said: i saw many different pictures from the m 10m and none of them was so dramatically different from any other picture i've seen converted from a color dng. at 8350 €, to me it looks like a very expensive toy for maniacs. viewing images on a computer screen is not the best way to evaluate them; that having been said, the advances in image quality that the m10 monochrom offers may be more of a matter of degrees rather than a night and day difference. not many people print these days, but i think that in the leica lineup, m10m could be thought of as the premier camera for making fine prints. and yes, there's no two ways about it: 8350€ is a price -----> tag !!!  that causes the knees to give way for most of us. leica m cameras and lenses are about passion, not about economic practicality. a toyota camry will get you to your destination with practicality. a ferrari 812 gts will get you to your destination with passion, elegance and euphoria.", "sortedWord": "None", "identifyer": 27393, "year": "2020"}, {"Unnamed: 0": 366143, "autor": "epand56", "date": 1579906020000, "content": " 5 hours ago, Herr Barnack said: And yes, there's no two ways about it: 8350€ is a price tag that causes the knees to give way for most of us. Leica M cameras and lenses are about passion, not about economic practicality. Indeed it is. Since the M8, that I still have, the price of any new M camera following has grown of about 1000 € each time. I stopped at the M240 that was, if I remember, 6200 €. Now we are at 8350 € and, I suppose, growing. I'm almost sure that will take my M240 in the grave with me. Gave the M8 to my son.", "link": "https://www.l-camera-forum.com/topic/305695-lets-have-a-look-at-some-dng-files-from-the-m10m/page/2/?tab=comments#comment-3898758", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " 5 hours ago, herr barnack said: and yes, there's no two ways about it: 8350€ is a price -----> tag !!!  that causes the knees to give way for most of us. leica m cameras and lenses are about passion, not about economic practicality. indeed it is. since the m8, that i still have, the price of any new m camera following has grown of about 1000 € each time. i stopped at the m240 that was, if i remember, 6200 €. now we are at 8350 € and, i suppose, growing. i'm almost sure that will take my m240 in the grave with me. gave the m8 to my son.", "sortedWord": "None", "identifyer": 27408, "year": "2020"}, {"Unnamed: 0": 366360, "autor": "geoffreyg", "date": 1581950760000, "content": "Without doubt, the M10M’s new capabilities have a bunch of us gobsmacked. Hi res, hi iso, easier usability, svelte. What’s not to like, except the price tag? At some point, the dust will settle, and maybe then it will be possible to see how much of a game changer this camera really is. Personally I’m torn: either this is the camera of dreams or..... there are just too many nighttime shots flooding the net. 😅 Edited February 17, 2020 by geoffreyg", "link": "https://www.l-camera-forum.com/topic/305735-medium-format-quality-test-results-m10p-vs-m10m-vs-sony-a7riv-vs-phase-one-iq4-with-optimum-lenses/page/2/?tab=comments#comment-3914602", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "without doubt, the m10m’s new capabilities have a bunch of us gobsmacked. hi res, hi iso, easier usability, svelte. what’s not to like, except the price -----> tag !!! ? at some point, the dust will settle, and maybe then it will be possible to see how much of a game changer this camera really is. personally i’m torn: either this is the camera of dreams or..... there are just too many nighttime shots flooding the net. 😅 edited february 17, 2020 by geoffreyg", "sortedWord": "None", "identifyer": 27629, "year": "2020"}, {"Unnamed: 0": 366655, "autor": "Eoin", "date": 1579626120000, "content": "I'm loving the M10 for the past 2.5 years, best handling Digital Leica M by far. I have held off looking for a Monochrome until the M10M was released exactly for the reason above. However the eye watering price tag has made me wonder if I really want to drop €8200 for pure B&W. Don't get me wrong, I appreciate the technology and the capabilities native B&W sensors offer, but the colour M10's files convert to B&W with lovely results. I might wait until the M11 is released and take stock of what it offers, upgrade to that, or pick up a 2nd hand M10M for significantly less than the current asking price. By then, perhaps the M11 will touch the 10K mark and I'll be questioning if I even need 40 - 60 Mpx upgrade or has Leica just simply priced its self out of my realm. Edited January 21, 2020 by Eoin", "link": "https://www.l-camera-forum.com/topic/305530-your-opinion-about-the-leica-m10-monochrom/page/3/?tab=comments#comment-3896297", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i'm loving the m10 for the past 2.5 years, best handling digital leica m by far. i have held off looking for a monochrome until the m10m was released exactly for the reason above. however the eye watering price -----> tag !!!  has made me wonder if i really want to drop €8200 for pure b&w. don't get me wrong, i appreciate the technology and the capabilities native b&w sensors offer, but the colour m10's files convert to b&w with lovely results. i might wait until the m11 is released and take stock of what it offers, upgrade to that, or pick up a 2nd hand m10m for significantly less than the current asking price. by then, perhaps the m11 will touch the 10k mark and i'll be questioning if i even need 40 - 60 mpx upgrade or has leica just simply priced its self out of my realm. edited january 21, 2020 by eoin", "sortedWord": "None", "identifyer": 27926, "year": "2020"}, {"Unnamed: 0": 367084, "autor": "UliWer", "date": 1578995820000, "content": "vor 7 Stunden schrieb dkmoore: have you been able to confirm the 8000 euro price? I hope this will be the price, or even more expensive. Then I'll not have to make a decision which might be totally unreasonable. I fear that Leica might think of an \"incentive\" price tag to lure some people into making a very unreasonable decision.", "link": "https://www.l-camera-forum.com/topic/304973-do-we-finally-have-a-new-monochrome-yes-i-think-so/page/4/?tab=comments#comment-3891121", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "vor 7 stunden schrieb dkmoore: have you been able to confirm the 8000 euro price? i hope this will be the price, or even more expensive. then i'll not have to make a decision which might be totally unreasonable. i fear that leica might think of an \"incentive\" price -----> tag !!!  to lure some people into making a very unreasonable decision.", "sortedWord": "None", "identifyer": 28356, "year": "2020"}, {"Unnamed: 0": 367320, "autor": "romanus53", "date": 1578485400000, "content": "ok, I'm shooting color but had the non-apo, tried the apo and came back to the previous. The apo is slightliy \"clearer\" on f2 but not that much to my eyes to justify 2K-plus on the price-tag. Nailing the focus depends on adjustment of the lens to your body, all my 90mm are back in focus and I had no problem shooting with the 50 Summilux at f1.4. Wellcome back to some light-weight equipment!", "link": "https://www.l-camera-forum.com/topic/305165-back-to-leica-after-brand-jumping/?tab=comments#comment-3887401", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "ok, i'm shooting color but had the non-apo, tried the apo and came back to the previous. the apo is slightliy \"clearer\" on f2 but not that much to my eyes to justify 2k-plus on the price------> tag !!! . nailing the focus depends on adjustment of the lens to your body, all my 90mm are back in focus and i had no problem shooting with the 50 summilux at f1.4. wellcome back to some light-weight equipment!", "sortedWord": "None", "identifyer": 28593, "year": "2020"}, {"Unnamed: 0": 368962, "autor": "Herr Barnack", "date": 1600267380000, "content": "Saw this article the other day: https://petapixel.com/2020/09/12/leica-m9-sensor-corrosion-due-to-dumb-design-decision-report-claims/ Leica M9 Sensor ‘Corrosion’ Due to Dumb Design Decision, Report Claims Quote \"...Manufactured between 2009 and 2014, an estimated 180,000 Leica M9 cameras were produced and sold with a price tag of $8,000. Inside the camera was an 18-megapixel Kodak full-frame CCD sensor. Covering the image sensor itself is an IR Cut Filter (ICF) which also serves as the coverglass. “Typically, the ICF is a separate piece of glass held in front of the clear sensor coverglass,” writes Dan Llewellyn, president of LDP LLC. “I don’t know if Kodak did that to lower costs or perhaps increase optical performance since every piece of glass light has to go through degrades the image somewhat.”...\" And - Quote \"...What I found was a filter that extended down to 300nm,” Llewellyn writes. “That filter doesn’t have coatings! […] Leica / Kodak used an uncoated Schott BG type glass! The coatings seal the glass. Somebody really screwed up. “All those BG and UG types of glasses are susceptible to oxidization. Variable include time, temperature, humidity, ozone, and even the particular glass melt, but you would never put uncoated BG or UG glass in a camera and not think that one day you are going to have a problem. That Leica / Kodak would do that boggles the mind...\" I would agree that \"somebody\" really screwed up. The question is this: Was it Leica or was it Kodak? Quote \"...Kodak sold its image sensor business to the Platinum Equity-owned Truesense in 2011, and Platinum Equity sold the business to On Semi in 2014...\" Given that Kodak/Truesense/Semi were playing hot potato with Kodak's image sensor business (and the liabilities attached to it) tells us something IMHO. Edited September 16, 2020 by Herr Barnack", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/6/?tab=comments#comment-4046984", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "saw this article the other day: https://petapixel.com/2020/09/12/leica-m9-sensor-corrosion-due-to-dumb-design-decision-report-claims/ leica m9 sensor ‘corrosion’ due to dumb design decision, report claims quote \"...manufactured between 2009 and 2014, an estimated 180,000 leica m9 cameras were produced and sold with a price -----> tag !!!  of $8,000. inside the camera was an 18-megapixel kodak full-frame ccd sensor. covering the image sensor itself is an ir cut filter (icf) which also serves as the coverglass. “typically, the icf is a separate piece of glass held in front of the clear sensor coverglass,” writes dan llewellyn, president of ldp llc. “i don’t know if kodak did that to lower costs or perhaps increase optical performance since every piece of glass light has to go through degrades the image somewhat.”...\" and - quote \"...what i found was a filter that extended down to 300nm,” llewellyn writes. “that filter doesn’t have coatings! […] leica / kodak used an uncoated schott bg type glass! the coatings seal the glass. somebody really screwed up. “all those bg and ug types of glasses are susceptible to oxidization. variable include time, temperature, humidity, ozone, and even the particular glass melt, but you would never put uncoated bg or ug glass in a camera and not think that one day you are going to have a problem. that leica / kodak would do that boggles the mind...\" i would agree that \"somebody\" really screwed up. the question is this: was it leica or was it kodak? quote \"...kodak sold its image sensor business to the platinum equity-owned truesense in 2011, and platinum equity sold the business to on semi in 2014...\" given that kodak/truesense/semi were playing hot potato with kodak's image sensor business (and the liabilities attached to it) tells us something imho. edited september 16, 2020 by herr barnack", "sortedWord": "None", "identifyer": 30258, "year": "2020"}, {"Unnamed: 0": 369025, "autor": "BrianS", "date": 1602963420000, "content": " On 10/13/2020 at 7:23 PM, jaapv said: Note that the Monochrom M9 uses Linear DNG whereas the M9 uses Raw DNG. The Linear DNG format can hold more non-image data. I do not know why Leica made this choice. I ended up writing my own DNG processing code, including converting the color files from the M8 and M9 to monochrome and writing them in the \"LinearRaw\" format. This requires demosaicing the image, eliminating DNG Tags for the color filter array and associated fields, changing the value of Tag 6 from 32803 to 34892. Both file formats can use the same tags for storing information. They are both in the same DNG spec, just different values for Tag 6 \"photometric interpretation\" and then filling in the other tags as they make sense. PHOTOMETRIC INTERPRETATION Page 20 of the DNG 1.4.0 spec.https://www.adobe.com/content/dam/acom/en/products/photoshop/pdfs/dng_spec_1.4.0.0.pdf The DNG Spec uses Tag 6 to set the DNG format. The Specification uses two terms for the Raw IFD, A value of 32803(dec), '8023'x (hex), specifies CFA (Color Filter Array) A value of 34892(dec), '884C'x (hex), specifies LinearRaw. CFA is used for the M9, LinearRaw is used for the M Monochrom. The CFA format has Tag settings to demosaic the image, typically using a Bayer filter pattern. More patterns are available. LinearRaw does not have the information required to demosaic the image, which is fine for thr M Monochrom. You would have to demosaic the image in the camera to store as LinearRaw. Code listing and examples of the conversion here- https://cameraderie.org/threads/experiments-in-leica-m8-and-m9-conversions.38737/page-2 I've seen some sites use the terms \"Linear\" DNG and \"Raw\" DNG- but the actual DNG specification uses \"LinearRaw\" and \"CFA\". Edited October 17, 2020 by BrianS", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/10/?tab=comments#comment-4064294", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": " on 10/13/2020 at 7:23 pm, jaapv said: note that the monochrom m9 uses linear dng whereas the m9 uses raw dng. the linear dng format can hold more non-image data. i do not know why leica made this choice. i ended up writing my own dng processing code, including converting the color files from the m8 and m9 to monochrome and writing them in the \"linearraw\" format. this requires demosaicing the image, eliminating dng -----> tags !!!  for the color filter array and associated fields, changing the value of tag 6 from 32803 to 34892. both file formats can use the same tags for storing information. they are both in the same dng spec, just different values for tag 6 \"photometric interpretation\" and then filling in the other tags as they make sense. photometric interpretation page 20 of the dng 1.4.0 spec.https://www.adobe.com/content/dam/acom/en/products/photoshop/pdfs/dng_spec_1.4.0.0.pdf the dng spec uses tag 6 to set the dng format. the specification uses two terms for the raw ifd, a value of 32803(dec), '8023'x (hex), specifies cfa (color filter array) a value of 34892(dec), '884c'x (hex), specifies linearraw. cfa is used for the m9, linearraw is used for the m monochrom. the cfa format has tag settings to demosaic the image, typically using a bayer filter pattern. more patterns are available. linearraw does not have the information required to demosaic the image, which is fine for thr m monochrom. you would have to demosaic the image in the camera to store as linearraw. code listing and examples of the conversion here- https://cameraderie.org/threads/experiments-in-leica-m8-and-m9-conversions.38737/page-2 i've seen some sites use the terms \"linear\" dng and \"raw\" dng- but the actual dng specification uses \"linearraw\" and \"cfa\". edited october 17, 2020 by brians", "sortedWord": "None", "identifyer": 30321, "year": "2020"}, {"Unnamed: 0": 370685, "autor": "Ko.Fe.", "date": 1609027080000, "content": "No bouncing and odd batteries for flash under this price tag. I have Leica flash which came after it. Forgot the model. It is with titlting head and using two AAA batteries. SF26, found it from my review https://leicameandme.wordpress.com/2016/12/21/sf-26-flashlight-for-leica-m-system/ For direct flash any old film era flash with dual range will do. I have old Vivitar made and it is just as good as Leica labeled on my M-E 220. Edited December 27, 2020 by Ko.Fe.", "link": "https://www.l-camera-forum.com/topic/316426-leica-flash-unit-for-m9/?tab=comments#comment-4106354", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "no bouncing and odd batteries for flash under this price -----> tag !!! . i have leica flash which came after it. forgot the model. it is with titlting head and using two aaa batteries. sf26, found it from my review https://leicameandme.wordpress.com/2016/12/21/sf-26-flashlight-for-leica-m-system/ for direct flash any old film era flash with dual range will do. i have old vivitar made and it is just as good as leica labeled on my m-e 220. edited december 27, 2020 by ko.fe.", "sortedWord": "None", "identifyer": 31985, "year": "2020"}, {"Unnamed: 0": 370686, "autor": "Edwin Ho", "date": 1609127940000, "content": "On 12/27/2020 at 7:58 AM, Ko.Fe. said: No bouncing and odd batteries for flash under this price tag. Thank you for sharing your thoughts. Fine with non-bounce; I do not need it, but fill-in feature on SF24D is a bonus. CR123A 3 volt batteries are readily available online. I am inclined towards Panasonic (known and trusted brand). Unlike AAA or AA batteries, they are not the \"common\" type but as I have mentioned, it is readily available. I have just committed to purchase a \"used\" SF 24D. While I have the Olympus S20 (still usable), the SF 24D will seat nicely on the M9. Price aside, I am passionate about Leica product.", "link": "https://www.l-camera-forum.com/topic/316426-leica-flash-unit-for-m9/?tab=comments#comment-4107009", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 12/27/2020 at 7:58 am, ko.fe. said: no bouncing and odd batteries for flash under this price -----> tag !!! . thank you for sharing your thoughts. fine with non-bounce; i do not need it, but fill-in feature on sf24d is a bonus. cr123a 3 volt batteries are readily available online. i am inclined towards panasonic (known and trusted brand). unlike aaa or aa batteries, they are not the \"common\" type but as i have mentioned, it is readily available. i have just committed to purchase a \"used\" sf 24d. while i have the olympus s20 (still usable), the sf 24d will seat nicely on the m9. price aside, i am passionate about leica product.", "sortedWord": "None", "identifyer": 31986, "year": "2020"}, {"Unnamed: 0": 371238, "autor": "martinot", "date": 1599681540000, "content": "On 9/8/2020 at 1:50 PM, DandA said: Although both cameras (the M240 and M262) are essentially the same with regards to still images...I have heard from some that supposedly the M262 was tweaked regarding its output. I'm not sure of the validity of this. Dave (D&A) According to Leica rep. it is the exact same sensor (LEICA MAX 24 MP-Still CMOS Sensor) and i principal the same type of DNG RAW-files between the M240 and the M262 (just tagged differently). Shutter is different, and might also be different tweaks to the JPEG in camera development. Should be easy to verify by importing RAW files from both cameras to Lr and C1, and without applying any camera specific presets, compare the images.", "link": "https://www.l-camera-forum.com/topic/311556-m9m-e-to-m262/?tab=comments#comment-4042956", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "on 9/8/2020 at 1:50 pm, danda said: although both cameras (the m240 and m262) are essentially the same with regards to still images...i have heard from some that supposedly the m262 was tweaked regarding its output. i'm not sure of the validity of this. dave (d&a) according to leica rep. it is the exact same sensor (leica max 24 mp-still cmos sensor) and i principal the same type of dng raw-files between the m240 and the m262 (just -----> tagged !!!  differently). shutter is different, and might also be different tweaks to the jpeg in camera development. should be easy to verify by importing raw files from both cameras to lr and c1, and without applying any camera specific presets, compare the images.", "sortedWord": "None", "identifyer": 32538, "year": "2020"}, {"Unnamed: 0": 371549, "autor": "carbon_dragon", "date": 1597238100000, "content": "On 8/9/2020 at 12:28 PM, rivi1969 said: My Canon 5D is 100% functional and it was made in 2005, 15 years and working as new. Apparently there are no more replacement shutters, but if my camera has maybe 5000 clicks I doubt I will ever take it beyond its 300k limit. If it dies at least it didn't cost me $6000. If Canon makes Cameras who can last that long I guess Leica can do too. And the cost of service and repairs is not even close. Yes that was kind of my point. My 5d is still fully functional too. \"Regular\" camera manufacturers make pretty long lived cameras and tough ones too, and they do it without $8000 price tags. Granted Leicas are works of art in many ways with hand crafting and fine mechanical precision, and so on. There are certainly Canon Ps and Nikon rangefinders still working too, but MOST Leicas from that period are still functional (or at least a heck of a lot of them). I think Leica takes pride in cameras living longer than their owners and not just one or two but most of them. It's a mindset you can embrace when the camera is all mechanical (much as we embrace it with mechanical watches). But once you add electronics, well you can't make new electronic components once the production line stops. What do you do if you're Leica and you take pride in your cameras outliving their owners? Do you give up on that notion and still make cameras that SHOULD last that long but won't because what is inside will fail long before the outer shell? Or do you do crazy things to keep up the spirit of that long life (like upgrading camera internals)? I expect they will quietly transition to letting those Ms slowly become shelf queens when there are no more electronic parts from the original cameras.", "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/page/2/?tab=comments#comment-4025923", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "on 8/9/2020 at 12:28 pm, rivi1969 said: my canon 5d is 100% functional and it was made in 2005, 15 years and working as new. apparently there are no more replacement shutters, but if my camera has maybe 5000 clicks i doubt i will ever take it beyond its 300k limit. if it dies at least it didn't cost me $6000. if canon makes cameras who can last that long i guess leica can do too. and the cost of service and repairs is not even close. yes that was kind of my point. my 5d is still fully functional too. \"regular\" camera manufacturers make pretty long lived cameras and tough ones too, and they do it without $8000 price -----> tags !!! . granted leicas are works of art in many ways with hand crafting and fine mechanical precision, and so on. there are certainly canon ps and nikon rangefinders still working too, but most leicas from that period are still functional (or at least a heck of a lot of them). i think leica takes pride in cameras living longer than their owners and not just one or two but most of them. it's a mindset you can embrace when the camera is all mechanical (much as we embrace it with mechanical watches). but once you add electronics, well you can't make new electronic components once the production line stops. what do you do if you're leica and you take pride in your cameras outliving their owners? do you give up on that notion and still make cameras that should last that long but won't because what is inside will fail long before the outer shell? or do you do crazy things to keep up the spirit of that long life (like upgrading camera internals)? i expect they will quietly transition to letting those ms slowly become shelf queens when there are no more electronic parts from the original cameras.", "sortedWord": "None", "identifyer": 32850, "year": "2020"}, {"Unnamed: 0": 371556, "autor": "rivi1969", "date": 1597247940000, "content": "2 hours ago, carbon_dragon said: Yes that was kind of my point. My 5d is still fully functional too. \"Regular\" camera manufacturers make pretty long lived cameras and tough ones too, and they do it without $8000 price tags. Granted Leicas are works of art in many ways with hand crafting and fine mechanical precision, and so on. There are certainly Canon Ps and Nikon rangefinders still working too, but MOST Leicas from that period are still functional (or at least a heck of a lot of them). I think Leica takes pride in cameras living longer than their owners and not just one or two but most of them. It's a mindset you can embrace when the camera is all mechanical (much as we embrace it with mechanical watches). But once you add electronics, well you can't make new electronic components once the production line stops. What do you do if you're Leica and you take pride in your cameras outliving their owners? Do you give up on that notion and still make cameras that SHOULD last that long but won't because what is inside will fail long before the outer shell? Or do you do crazy things to keep up the spirit of that long life (like upgrading camera internals)? I expect they will quietly transition to letting those Ms slowly become shelf queens when there are no more electronic parts from the original cameras. Correct. If my 15 year-old 5D fails (which by the way works as new, looks as new and it doesn't even have one single dead pixel) I won't be pissed. It cost me very little money so I can live with that. However, in the case of our friend Ko.Fe. who has a 5-year old M-E that cost him a few grands and might turn into a $6000 paper weight any day, Leica really should do something better than their trade-in scheme with him. I would expect a full camera replacement, like a demo M262 or similar.", "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/page/3/?tab=comments#comment-4026018", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "2 hours ago, carbon_dragon said: yes that was kind of my point. my 5d is still fully functional too. \"regular\" camera manufacturers make pretty long lived cameras and tough ones too, and they do it without $8000 price -----> tags !!! . granted leicas are works of art in many ways with hand crafting and fine mechanical precision, and so on. there are certainly canon ps and nikon rangefinders still working too, but most leicas from that period are still functional (or at least a heck of a lot of them). i think leica takes pride in cameras living longer than their owners and not just one or two but most of them. it's a mindset you can embrace when the camera is all mechanical (much as we embrace it with mechanical watches). but once you add electronics, well you can't make new electronic components once the production line stops. what do you do if you're leica and you take pride in your cameras outliving their owners? do you give up on that notion and still make cameras that should last that long but won't because what is inside will fail long before the outer shell? or do you do crazy things to keep up the spirit of that long life (like upgrading camera internals)? i expect they will quietly transition to letting those ms slowly become shelf queens when there are no more electronic parts from the original cameras. correct. if my 15 year-old 5d fails (which by the way works as new, looks as new and it doesn't even have one single dead pixel) i won't be pissed. it cost me very little money so i can live with that. however, in the case of our friend ko.fe. who has a 5-year old m-e that cost him a few grands and might turn into a $6000 paper weight any day, leica really should do something better than their trade-in scheme with him. i would expect a full camera replacement, like a demo m262 or similar.", "sortedWord": "None", "identifyer": 32857, "year": "2020"}, {"Unnamed: 0": 371629, "autor": "martinot", "date": 1599161760000, "content": "On 8/12/2020 at 3:15 PM, carbon_dragon said: Yes that was kind of my point. My 5d is still fully functional too. \"Regular\" camera manufacturers make pretty long lived cameras and tough ones too, and they do it without $8000 price tags. Granted Leicas are works of art in many ways with hand crafting and fine mechanical precision, and so on. There are certainly Canon Ps and Nikon rangefinders still working too, but MOST Leicas from that period are still functional (or at least a heck of a lot of them). I think Leica takes pride in cameras living longer than their owners and not just one or two but most of them. It's a mindset you can embrace when the camera is all mechanical (much as we embrace it with mechanical watches). But once you add electronics, well you can't make new electronic components once the production line stops. What do you do if you're Leica and you take pride in your cameras outliving their owners? Do you give up on that notion and still make cameras that SHOULD last that long but won't because what is inside will fail long before the outer shell? Or do you do crazy things to keep up the spirit of that long life (like upgrading camera internals)? I expect they will quietly transition to letting those Ms slowly become shelf queens when there are no more electronic parts from the original cameras. I understand your point. Leicas well build cameras made for long mechanical life did make good sense in the film age, but not so much in rapidly advancing digital age. This is something that Leica needs to address sooner or later (possibly the first). Maybe they can come up with a body and an exchangeable sensor module (just like old Hasselblad with digital backs, or how Ricoh did it in their GXR)?", "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/page/6/?tab=comments#comment-4039272", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "on 8/12/2020 at 3:15 pm, carbon_dragon said: yes that was kind of my point. my 5d is still fully functional too. \"regular\" camera manufacturers make pretty long lived cameras and tough ones too, and they do it without $8000 price -----> tags !!! . granted leicas are works of art in many ways with hand crafting and fine mechanical precision, and so on. there are certainly canon ps and nikon rangefinders still working too, but most leicas from that period are still functional (or at least a heck of a lot of them). i think leica takes pride in cameras living longer than their owners and not just one or two but most of them. it's a mindset you can embrace when the camera is all mechanical (much as we embrace it with mechanical watches). but once you add electronics, well you can't make new electronic components once the production line stops. what do you do if you're leica and you take pride in your cameras outliving their owners? do you give up on that notion and still make cameras that should last that long but won't because what is inside will fail long before the outer shell? or do you do crazy things to keep up the spirit of that long life (like upgrading camera internals)? i expect they will quietly transition to letting those ms slowly become shelf queens when there are no more electronic parts from the original cameras. i understand your point. leicas well build cameras made for long mechanical life did make good sense in the film age, but not so much in rapidly advancing digital age. this is something that leica needs to address sooner or later (possibly the first). maybe they can come up with a body and an exchangeable sensor module (just like old hasselblad with digital backs, or how ricoh did it in their gxr)?", "sortedWord": "None", "identifyer": 32930, "year": "2020"}, {"Unnamed: 0": 371855, "autor": "Ko.Fe.", "date": 1590505080000, "content": "I also have and use Canon. This is why I see no reason to update my M-E 220 to M10 at this moment. If I wouldn't use it as OP I would also discover my M-E 220 sensor corroded too late. So, think about it. Why save for another Leica if you are most likely not going to use it? I have seen used M10 for sale under 4200 USD price tag recently. Not abused cameras. Doesn't looks like C-19 related sales. Might be also sitting in storage cameras, with owners realized it is not worth to keep most expensive cameras and not using them.", "link": "https://www.l-camera-forum.com/topic/309953-upgrade-m9-sensor-or-save-up-and-trade-in-for-m10m10p/?tab=comments#comment-3980982", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i also have and use canon. this is why i see no reason to update my m-e 220 to m10 at this moment. if i wouldn't use it as op i would also discover my m-e 220 sensor corroded too late. so, think about it. why save for another leica if you are most likely not going to use it? i have seen used m10 for sale under 4200 usd price -----> tag !!!  recently. not abused cameras. doesn't looks like c-19 related sales. might be also sitting in storage cameras, with owners realized it is not worth to keep most expensive cameras and not using them.", "sortedWord": "None", "identifyer": 33156, "year": "2020"}, {"Unnamed: 0": 380285, "autor": "boojum", "date": 1603008300000, "content": "40 minutes ago, pop said: Yes, I can understand that. I did not think of a fractional case. However, you also have to do all of that in order to charge the battery. We don't know yet whose shortcomings we are whining at. Both Mac and Win can see the pictures just fine. If it still works with Windows, it's not an electronic failure. Presumably, it's a peculiar application of a standard for showing directories on an attached USB device (if there even was a standard and not a mere convention). The peculiarity could even lie with Mint, who knows. Besides, the M8 was Leica's first digital camera. It is a well-known fact that it takes Microsoft three attempts to get any new product barely working. Remember Windows 1 and Windows 2? Utter rubbish and not fit for use, and Windows was not even their first product. Windows 3 finally could be made to work, after a fashion, Windows 3.1, that is. Compared with Microsoft, Leica did a splendid job with a first digital product, even if it also has a large helping of (understandable) faults. Keep on trying, you'll make it yet. The defense strategy of saying that I am nor as bad as the other guy does not wash. It is like a staggering drunk talking about another drunk passed out on the floor. There are lots of capable circuit board designers and manufacturers. Circuit board instability within a Leica camera does not point to good design or QC. Did they really put their best effort into it? And lets face it, almost anything will look good alongside of MS. That's why I use Linux. It works. If Leica was unused to electronics they could have hired a good team. Look at Miele, German hardware and software which does not fail. I like Leicas, I just bought another, but I am sure disappointed in their CMOS strategies. Now that the spleen is vented on to the USB transfer. Trying to have a clean slate I formatted the SD in W10, full format not quick format, and then put it in the M8.2 and formatted it there. Then I transferred the files which had been on the SD back to it, put it in the camera and hooked up the USB cable. Hallelujah! Now it fails in W10 just as it does in Linux. I get RAMDISK but I cannot see the DCIM folder. Lucky with hardware, unlucky with software. Back in the dim recesses of my past there is a career of writing software. I was never a star but I paid the rent and put food on the table. My experience in a good shop is that hardware failures like those Leica experiences would be flagged, red-lighted, and that part of the project stopped until it was fixed. Against the background of Leica's history it looks awful. My old SONY DSC S70 works without a whimper and it is 20 years old. It has never failed and has tagged along all over the US, Canada and Mexico. I kind of thought that Leica's hardware and software would at least be as good if not better. So while I still like Leicas - I've bought three in a month - there is little doubt in my mind that they failed with their electronics. The cameras? One M8.2 and two M240's. Here's a camera which has not failed in 20 years. --img-- ", "link": "https://www.l-camera-forum.com/topic/314273-usb-xfer-in-linux-mint/?tab=comments#comment-4064499", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "40 minutes ago, pop said: yes, i can understand that. i did not think of a fractional case. however, you also have to do all of that in order to charge the battery. we don't know yet whose shortcomings we are whining at. both mac and win can see the pictures just fine. if it still works with windows, it's not an electronic failure. presumably, it's a peculiar application of a standard for showing directories on an attached usb device (if there even was a standard and not a mere convention). the peculiarity could even lie with mint, who knows. besides, the m8 was leica's first digital camera. it is a well-known fact that it takes microsoft three attempts to get any new product barely working. remember windows 1 and windows 2? utter rubbish and not fit for use, and windows was not even their first product. windows 3 finally could be made to work, after a fashion, windows 3.1, that is. compared with microsoft, leica did a splendid job with a first digital product, even if it also has a large helping of (understandable) faults. keep on trying, you'll make it yet. the defense strategy of saying that i am nor as bad as the other guy does not wash. it is like a staggering drunk talking about another drunk passed out on the floor. there are lots of capable circuit board designers and manufacturers. circuit board instability within a leica camera does not point to good design or qc. did they really put their best effort into it? and lets face it, almost anything will look good alongside of ms. that's why i use linux. it works. if leica was unused to electronics they could have hired a good team. look at miele, german hardware and software which does not fail. i like leicas, i just bought another, but i am sure disappointed in their cmos strategies. now that the spleen is vented on to the usb transfer. trying to have a clean slate i formatted the sd in w10, full format not quick format, and then put it in the m8.2 and formatted it there. then i transferred the files which had been on the sd back to it, put it in the camera and hooked up the usb cable. hallelujah! now it fails in w10 just as it does in linux. i get ramdisk but i cannot see the dcim folder. lucky with hardware, unlucky with software. back in the dim recesses of my past there is a career of writing software. i was never a star but i paid the rent and put food on the table. my experience in a good shop is that hardware failures like those leica experiences would be flagged, red-lighted, and that part of the project stopped until it was fixed. against the background of leica's history it looks awful. my old sony dsc s70 works without a whimper and it is 20 years old. it has never failed and has -----> tagged !!!  along all over the us, canada and mexico. i kind of thought that leica's hardware and software would at least be as good if not better. so while i still like leicas - i've bought three in a month - there is little doubt in my mind that they failed with their electronics. the cameras? one m8.2 and two m240's. here's a camera which has not failed in 20 years. --img-- ", "sortedWord": "None", "identifyer": 41673, "year": "2020"}, {"Unnamed: 0": 389572, "autor": "swordmanc", "date": 1595402760000, "content": " Actually it's the 4th brand new M-A I've touched so far. I noticed the latch on the bottom plate has changed its finish from chrome to black, and there's a WEEE symbol (no trashcan) sticker. --img--  Like all previous 3 brand new M-As, this M-A also has some minor issues, e.g. its frame counter doesn't reset and gets stuck at \"20\". I have to hold the camera tight and push the top plate from back, to somehow release the tension inside and then it will reset. --img--  Another thing I notice is the front facing viewfinder glass is now more embedded in the frame, rather than almost perfectly level to the frame in my previous M-A. --img--  After a couple M-As, I am not expecting a perfect camera anymore. They all have some issues here and there. The first one has a loose lens mount, though I got it fixed by Leica later, it took months. Besides, its shutter release button is still not the smoothest. The bottom plate of the second M-A has a lot of play and makes an annoying cracking sound when you hold the camera to change lens. The third one has the same issue with the bottom plate, plus a big dust specs in the brand new view finder, and the frame counter doesn't reset. That's why I returned it and exchanged for the fourth one, which I think I will keep it despite the extra effort to reset the frame counter, and its release button is a bit tight. I still like the M-A, its viewfinder is really bright and enjoyable, although I wish it can have a 0.9x version for 50mm lenses (without extra magnifier), and that's why I'm getting a second one. However, it's really not easy to get a great copy of it these days. The price of M-A even increased this year, but based on my experience so far, I really doubt it's living up to the price tag. So just share my experience with you. Edited July 22, 2020 by swordmanc", "link": "https://www.l-camera-forum.com/topic/311567-got-my-second-m-a-and-its-a-little-different/?tab=comments#comment-4013325", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " actually it's the 4th brand new m-a i've touched so far. i noticed the latch on the bottom plate has changed its finish from chrome to black, and there's a weee symbol (no trashcan) sticker. --img--  like all previous 3 brand new m-as, this m-a also has some minor issues, e.g. its frame counter doesn't reset and gets stuck at \"20\". i have to hold the camera tight and push the top plate from back, to somehow release the tension inside and then it will reset. --img--  another thing i notice is the front facing viewfinder glass is now more embedded in the frame, rather than almost perfectly level to the frame in my previous m-a. --img--  after a couple m-as, i am not expecting a perfect camera anymore. they all have some issues here and there. the first one has a loose lens mount, though i got it fixed by leica later, it took months. besides, its shutter release button is still not the smoothest. the bottom plate of the second m-a has a lot of play and makes an annoying cracking sound when you hold the camera to change lens. the third one has the same issue with the bottom plate, plus a big dust specs in the brand new view finder, and the frame counter doesn't reset. that's why i returned it and exchanged for the fourth one, which i think i will keep it despite the extra effort to reset the frame counter, and its release button is a bit tight. i still like the m-a, its viewfinder is really bright and enjoyable, although i wish it can have a 0.9x version for 50mm lenses (without extra magnifier), and that's why i'm getting a second one. however, it's really not easy to get a great copy of it these days. the price of m-a even increased this year, but based on my experience so far, i really doubt it's living up to the price -----> tag !!! . so just share my experience with you. edited july 22, 2020 by swordmanc", "sortedWord": "None", "identifyer": 2027, "year": "2020"}, {"Unnamed: 0": 389600, "autor": "StephenH", "date": 1599391740000, "content": "On 7/22/2020 at 3:26 AM, swordmanc said: Actually it's the 4th brand new M-A I've touched so far. I noticed the latch on the bottom plate has changed its finish from chrome to black, and there's a WEEE symbol (no trashcan) sticker. --img--  Like all previous 3 brand new M-As, this M-A also has some minor issues, e.g. its frame counter doesn't reset and gets stuck at \"20\". I have to hold the camera tight and push the top plate from back, to somehow release the tension inside and then it will reset. --img--  Another thing I notice is the front facing viewfinder glass is now more embedded in the frame, rather than almost perfectly level to the frame in my previous M-A. --img--  After a couple M-As, I am not expecting a perfect camera anymore. They all have some issues here and there. The first one has a loose lens mount, though I got it fixed by Leica later, it took months. Besides, its shutter release button is still not the smoothest. The bottom plate of the second M-A has a lot of play and makes an annoying cracking sound when you hold the camera to change lens. The third one has the same issue with the bottom plate, plus a big dust specs in the brand new view finder, and the frame counter doesn't reset. That's why I returned it and exchanged for the fourth one, which I think I will keep it despite the extra effort to reset the frame counter, and its release button is a bit tight. I still like the M-A, its viewfinder is really bright and enjoyable, although I wish it can have a 0.9x version for 50mm lenses (without extra magnifier), and that's why I'm getting a second one. However, it's really not easy to get a great copy of it these days. The price of M-A even increased this year, but based on my experience so far, I really doubt it's living up to the price tag. So just share my experience with you. I think you’d be much happier with a CLA’d M3. Any imperfections found in that camera could be considered part of its personality.. Loose lens mounts and cracking sounds? I wouldn’t call those imperfections, they are defects. As far as finder magnification, the M3 has its standard .93–almost as good as my Nikon SP!", "link": "https://www.l-camera-forum.com/topic/311567-got-my-second-m-a-and-its-a-little-different/page/2/?tab=comments#comment-4040908", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 7/22/2020 at 3:26 am, swordmanc said: actually it's the 4th brand new m-a i've touched so far. i noticed the latch on the bottom plate has changed its finish from chrome to black, and there's a weee symbol (no trashcan) sticker. --img--  like all previous 3 brand new m-as, this m-a also has some minor issues, e.g. its frame counter doesn't reset and gets stuck at \"20\". i have to hold the camera tight and push the top plate from back, to somehow release the tension inside and then it will reset. --img--  another thing i notice is the front facing viewfinder glass is now more embedded in the frame, rather than almost perfectly level to the frame in my previous m-a. --img--  after a couple m-as, i am not expecting a perfect camera anymore. they all have some issues here and there. the first one has a loose lens mount, though i got it fixed by leica later, it took months. besides, its shutter release button is still not the smoothest. the bottom plate of the second m-a has a lot of play and makes an annoying cracking sound when you hold the camera to change lens. the third one has the same issue with the bottom plate, plus a big dust specs in the brand new view finder, and the frame counter doesn't reset. that's why i returned it and exchanged for the fourth one, which i think i will keep it despite the extra effort to reset the frame counter, and its release button is a bit tight. i still like the m-a, its viewfinder is really bright and enjoyable, although i wish it can have a 0.9x version for 50mm lenses (without extra magnifier), and that's why i'm getting a second one. however, it's really not easy to get a great copy of it these days. the price of m-a even increased this year, but based on my experience so far, i really doubt it's living up to the price -----> tag !!! . so just share my experience with you. i think you’d be much happier with a cla’d m3. any imperfections found in that camera could be considered part of its personality.. loose lens mounts and cracking sounds? i wouldn’t call those imperfections, they are defects. as far as finder magnification, the m3 has its standard .93–almost as good as my nikon sp!", "sortedWord": "None", "identifyer": 2055, "year": "2020"}, {"Unnamed: 0": 394042, "autor": "Keops", "date": 1608492960000, "content": " 27 minutes ago, Matlock said: Actually that is a very good strap, I have a couple. With a half case it is not a problem Yes it is. And it has a vey nice and clever locking design. I would like to buy a Arte di Mano Shell Cordovan half case but when I saw its price tag I couldn't justify purchasing it. I also liked the brown color of Rally Volpe. Maybe I will buy it in near future but eventhough if I buy a half case I would think of using it in travel because I like the proportions and handling of the naked camera. And eventhough I like the idea of brassing the camera I am stressed over the possibility of not being able to buy a new Leica in my lifetime because of the failing economic situation of my country. So I guess I will use it more carefully than many people and it will gather a \"humble\" amount of \"memories\"", "link": "https://www.l-camera-forum.com/topic/316063-opinions-on-half-cases/page/2/?tab=comments#comment-4102667", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " 27 minutes ago, matlock said: actually that is a very good strap, i have a couple. with a half case it is not a problem yes it is. and it has a vey nice and clever locking design. i would like to buy a arte di mano shell cordovan half case but when i saw its price -----> tag !!!  i couldn't justify purchasing it. i also liked the brown color of rally volpe. maybe i will buy it in near future but eventhough if i buy a half case i would think of using it in travel because i like the proportions and handling of the naked camera. and eventhough i like the idea of brassing the camera i am stressed over the possibility of not being able to buy a new leica in my lifetime because of the failing economic situation of my country. so i guess i will use it more carefully than many people and it will gather a \"humble\" amount of \"memories\"", "sortedWord": "None", "identifyer": 6506, "year": "2020"}, {"Unnamed: 0": 394043, "autor": "Matlock", "date": 1608493440000, "content": "1 minute ago, Keops said: Yes it is. And it has a vey nice and clever locking design. I would like to buy a Arte di Mano Shell Cordovan half case but when I saw its price tag I couldn't justify purchasing it. I also liked the brown color of Rally Volpe. Maybe I will buy it in near future but eventhough if I buy a half case I would think of using it in travel because I like the proportions and handling of the naked camera. And eventhough I like the idea of brassing the camera I am stressed over the possibility of not being able to buy a new Leica in my lifetime because of the failing economic situation of my country. So I guess I will use it more carefully than many people and it will gather a \"humble\" amount of \"memories\" I usually go for the Luigi cases but it is a personal choice. As for brassing, I believe that it should be achieved over a fairly long period of use, I just can't understand people who go to work on their camera with sandpaper etc. I saw one camera with brassing in places that no part of the human body could possibly reach and it just looked ridiculous.", "link": "https://www.l-camera-forum.com/topic/316063-opinions-on-half-cases/page/2/?tab=comments#comment-4102676", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1 minute ago, keops said: yes it is. and it has a vey nice and clever locking design. i would like to buy a arte di mano shell cordovan half case but when i saw its price -----> tag !!!  i couldn't justify purchasing it. i also liked the brown color of rally volpe. maybe i will buy it in near future but eventhough if i buy a half case i would think of using it in travel because i like the proportions and handling of the naked camera. and eventhough i like the idea of brassing the camera i am stressed over the possibility of not being able to buy a new leica in my lifetime because of the failing economic situation of my country. so i guess i will use it more carefully than many people and it will gather a \"humble\" amount of \"memories\" i usually go for the luigi cases but it is a personal choice. as for brassing, i believe that it should be achieved over a fairly long period of use, i just can't understand people who go to work on their camera with sandpaper etc. i saw one camera with brassing in places that no part of the human body could possibly reach and it just looked ridiculous.", "sortedWord": "None", "identifyer": 6507, "year": "2020"}, {"Unnamed: 0": 394388, "autor": "logan2z", "date": 1605550500000, "content": "4 minutes ago, Nowhereman said: I believe Kanto file down to the brass, removing the chrome plating. ________________________Frog Leaping photobook Interesting, I was wondering if they would do that. That may account for the $1000 price tag 😉 Edited November 16, 2020 by logan2z", "link": "https://www.l-camera-forum.com/topic/315161-is-this-really-the-going-rate-for-bp-m3s/?tab=comments#comment-4081473", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "4 minutes ago, nowhereman said: i believe kanto file down to the brass, removing the chrome plating. ________________________frog leaping photobook interesting, i was wondering if they would do that. that may account for the $1000 price -----> tag !!!  😉 edited november 16, 2020 by logan2z", "sortedWord": "None", "identifyer": 6853, "year": "2020"}, {"Unnamed: 0": 400839, "autor": "rivi1969", "date": 1582909440000, "content": "10 hours ago, Ecar said: Without getting into \"better or worse\" arguments (lenses, new or old, are just like different brushes IMO), I'd suggest to search the forum and/or Flickr, where numerous examples of pictures taken with this lens are available. FWIW, I have posted a few recently in \"The View Through Older Glass\" thread. Whilst it's easy to find, clean copies aren't (scratches and cleaning marks due to soft coatings and, more importantly, a propensity to develop haze over time). A CLA is almost inevitable if one wants the lens to perform as intended. If you are getting a screw mount copy, you will need an LTM to M adapter. Also, the lens features an infinity lock: make sure you are comfortable with that. Yes, I usually check Flickr for references but it is plagued with fake tags (fake meaning people add tags even though they are not the same camera or lens that actually were use take the pictures) and sometimes is hard to find good material of interest.", "link": "https://www.l-camera-forum.com/topic/306908-summarit-5cm-f15-image-character/?tab=comments#comment-3921385", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "10 hours ago, ecar said: without getting into \"better or worse\" arguments (lenses, new or old, are just like different brushes imo), i'd suggest to search the forum and/or flickr, where numerous examples of pictures taken with this lens are available. fwiw, i have posted a few recently in \"the view through older glass\" thread. whilst it's easy to find, clean copies aren't (scratches and cleaning marks due to soft coatings and, more importantly, a propensity to develop haze over time). a cla is almost inevitable if one wants the lens to perform as intended. if you are getting a screw mount copy, you will need an ltm to m adapter. also, the lens features an infinity lock: make sure you are comfortable with that. yes, i usually check flickr for references but it is plagued with fake -----> tags !!!  (fake meaning people add -----> tags !!!  even though they are not the same camera or lens that actually were use take the pictures) and sometimes is hard to find good material of interest.", "sortedWord": "None", "identifyer": 13565, "year": "2020"}, {"Unnamed: 0": 402106, "autor": "JMF", "date": 1591570560000, "content": "1 hour ago, pgk said: But it will allow you to see into the shadows better. Lower contrast means a lower ability to record tonality from the original scene. So a contrastier lens will actually allow more shadow tonality to be recorded. A lower contrast lens will record less. That is the whole point. As I said before, a very low contrast (old) lens produces a limited tonal range. A low contrast lens cannot produce better shadow detail. Its about both overall contrast and micro-contrast. Modulation Transfer Function charts will show this too, and to quote from Nikon \"An MTF chart plots the contrast and resolution of a lens from the center to its edges against a \"perfect\" lens that would transmit 100% of the light that passes through it. The contrast of a lens is important as this works in correlation to lens resolution.\" In turn this means that a lower contrast lens is not passing 100% of the light which enters it and so shadows will lack tonality if the highlights are retained. So from this it is obvious that a lower contrast lens can only provide better shadow information if exposure is increased - but then highlight data will be deficient. True ! Initially the discussion was about the overall rendition of the lenses. More detail on faces might not be desired at all times . So as no lens can fit all the situations, we were discussing their pros and cons and price tags.", "link": "https://www.l-camera-forum.com/topic/310164-show-me-your-favorite-lenses/page/5/?tab=comments#comment-3989428", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "1 hour ago, pgk said: but it will allow you to see into the shadows better. lower contrast means a lower ability to record tonality from the original scene. so a contrastier lens will actually allow more shadow tonality to be recorded. a lower contrast lens will record less. that is the whole point. as i said before, a very low contrast (old) lens produces a limited tonal range. a low contrast lens cannot produce better shadow detail. its about both overall contrast and micro-contrast. modulation transfer function charts will show this too, and to quote from nikon \"an mtf chart plots the contrast and resolution of a lens from the center to its edges against a \"perfect\" lens that would transmit 100% of the light that passes through it. the contrast of a lens is important as this works in correlation to lens resolution.\" in turn this means that a lower contrast lens is not passing 100% of the light which enters it and so shadows will lack tonality if the highlights are retained. so from this it is obvious that a lower contrast lens can only provide better shadow information if exposure is increased - but then highlight data will be deficient. true ! initially the discussion was about the overall rendition of the lenses. more detail on faces might not be desired at all times . so as no lens can fit all the situations, we were discussing their pros and cons and price -----> tags !!! .", "sortedWord": "None", "identifyer": 14841, "year": "2020"}, {"Unnamed: 0": 406350, "autor": "RayD28", "date": 1600806180000, "content": " 4 hours ago, nwphil said: It's a community built around trust and reputation - to be earned and maintained. Sure, as anything else, nothing is perfect, and even in-person, local transactions can go wrong. Spammers, scammers, repeated offenders are quickly banned/barred and plenty of people paying attention and whiling to blow the whistle - Fred and other moderators try hard to stay on top things. Often it's a bit difficult for a newcomer to buy and sell stuff there - but there are ways to overcome that, with emails, phone calls and other ways to show having a a solid clean reputation and trustworthy behavior. Been using the site for quite a while, and yes, once in a while there are issues ( I never had one - over 40 transactions of B&S). Bad experiences are an exception, while on EBay a norm, and yes, PayPal is just one (of many layers) of protection, also not without issues Good to know. I’ve seen some ads where previous customers were not shy about tagging a seller’s ad when the previous customer had a bad experience. Appreciate the insight. Ray", "link": "https://www.l-camera-forum.com/topic/313459-selling-m-lenses/page/3/?tab=comments#comment-4050573", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": " 4 hours ago, nwphil said: it's a community built around trust and reputation - to be earned and maintained. sure, as anything else, nothing is perfect, and even in-person, local transactions can go wrong. spammers, scammers, repeated offenders are quickly banned/barred and plenty of people paying attention and whiling to blow the whistle - fred and other moderators try hard to stay on top things. often it's a bit difficult for a newcomer to buy and sell stuff there - but there are ways to overcome that, with emails, phone calls and other ways to show having a a solid clean reputation and trustworthy behavior. been using the site for quite a while, and yes, once in a while there are issues ( i never had one - over 40 transactions of b&s). bad experiences are an exception, while on ebay a norm, and yes, paypal is just one (of many layers) of protection, also not without issues good to know. i’ve seen some ads where previous customers were not shy about -----> tagging !!!  a seller’s ad when the previous customer had a bad experience. appreciate the insight. ray", "sortedWord": "None", "identifyer": 19129, "year": "2020"}, {"Unnamed: 0": 406937, "autor": "RF’sDelight", "date": 1600446300000, "content": "Since I’m not interested to buy a M10 Safari or M-P Safari here is my the black body green lens combo. PS: Admittedly a M8.2 Safari with a reasonable price tag would be very tempting to me—especially combined with this lens. --img-- ", "link": "https://www.l-camera-forum.com/topic/310454-summicron-28mm-edition-safari-%E2%80%93-real-life-pictures/page/2/?tab=comments#comment-4048209", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "since i’m not interested to buy a m10 safari or m-p safari here is my the black body green lens combo. ps: admittedly a m8.2 safari with a reasonable price -----> tag !!!  would be very tempting to me—especially combined with this lens. --img-- ", "sortedWord": "None", "identifyer": 19723, "year": "2020"}, {"Unnamed: 0": 406939, "autor": "m410", "date": 1600716240000, "content": "On 9/18/2020 at 9:25 AM, RF’sDelight said: Since I’m not interested to buy a M10 Safari or M-P Safari here is my the black body green lens combo. PS: Admittedly a M8.2 Safari with a reasonable price tag would be very tempting to me—especially combined with this lens. --img--  Thank you for posting a photo. I was wondering how and if you received (purchased) the 28mm Safari Summicron you were looking for. I enjoy the different camera/lens color combinations as opposed to just the prescribed chrome-chrome or black-black. Wondering #2: How is the round-telescoping lenshade to use? Prefer it versus the screw-in rectangular style?", "link": "https://www.l-camera-forum.com/topic/310454-summicron-28mm-edition-safari-%E2%80%93-real-life-pictures/page/2/?tab=comments#comment-4050020", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 9/18/2020 at 9:25 am, rf’sdelight said: since i’m not interested to buy a m10 safari or m-p safari here is my the black body green lens combo. ps: admittedly a m8.2 safari with a reasonable price -----> tag !!!  would be very tempting to me—especially combined with this lens. --img--  thank you for posting a photo. i was wondering how and if you received (purchased) the 28mm safari summicron you were looking for. i enjoy the different camera/lens color combinations as opposed to just the prescribed chrome-chrome or black-black. wondering #2: how is the round-telescoping lenshade to use? prefer it versus the screw-in rectangular style?", "sortedWord": "None", "identifyer": 19725, "year": "2020"}, {"Unnamed: 0": 416668, "autor": "Bernd B.", "date": 1598845620000, "content": "The time-sync between phone and camera is no problem, when both are set to the same time. And Lightroom automatically tags time and fitting photos by reading the exif-data. But of course, this is no compare to built-in-gps, which we are going to find for sure in the SL3 ...", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/3/?tab=comments#comment-4036629", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "the time-sync between phone and camera is no problem, when both are set to the same time. and lightroom automatically -----> tags !!!  time and fitting photos by reading the exif-data. but of course, this is no compare to built-in-gps, which we are going to find for sure in the sl3 ...", "sortedWord": "None", "identifyer": 29669, "year": "2020"}, {"Unnamed: 0": 416680, "autor": "SrMi", "date": 1599275400000, "content": "18 minutes ago, hirohhhh said: If only is that reliable that works throughout the day without disconnecting. Whenever I tried Fotos app, it worked after third attempt to connect, and it usually ended with me deleting the app after 5 minutes. So yeah, it's possible but far from convenient. I am not thinking of Fotos app, but of a third party app , running on smartphone collecting coordinates and timestamps in a GPX file that you can use in LrC to tag the photos.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/4/?tab=comments#comment-4040171", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "18 minutes ago, hirohhhh said: if only is that reliable that works throughout the day without disconnecting. whenever i tried fotos app, it worked after third attempt to connect, and it usually ended with me deleting the app after 5 minutes. so yeah, it's possible but far from convenient. i am not thinking of fotos app, but of a third party app , running on smartphone collecting coordinates and timestamps in a gpx file that you can use in lrc to -----> tag !!!  the photos.", "sortedWord": "None", "identifyer": 29681, "year": "2020"}, {"Unnamed: 0": 420387, "autor": "Jared", "date": 1586921820000, "content": "12 hours ago, BernardC said: Here is Erwin Puts' recent observation: https://photo.imx.nl/blog/files/09454a45366c36dd20255a07bf49ff55-149.html He then tests the same lenses with earlier generations of cameras that do not have this \"optimization\" feature. The results are different, in that they vary by aperture (lower contrast wide-open, peak contrast at middle apertures). It is improbable that Panasonic (and every other major brand) does not do this. They also correct for geometric distortion, colour fringing, etc. They do correct for distortion and vignetting (Leica, Panasonic, and virtually everyone else), but that is via op codes that are tagged to the file so that image processing software after the fact can make corrections. It’s not done in-camera to raw files at 10+ frames per second. Heck, the color fringing correction he alleges isn’t even possible in a raw file since debayer hasn’t occurred yet. All one can do, and all ano of them DO do, is tag the files. And I saw nothing in Irwin’s post even speculating that the camera is “watching” for resolution charts in the images so it can apply extra sharpening (which you mentioned previously). As far as resolutions being different on previous generations of cameras... The simple fact that a completely different sensor is used with different micro lenses, pixel pitch, and anti aliasing filter makes it impossible to draw any conclusions related to raw processing. The manufacturers have generally been less clear than I would like about their dependence on lens profiles for correcting distortion and the like, but that’s about it. It’s just op codes and curves applied in the raw files as far as I am aware.", "link": "https://www.l-camera-forum.com/topic/299136-panasonic-50-s-pro-vs-leica-50-sl/page/2/?tab=comments#comment-3954065", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "12 hours ago, bernardc said: here is erwin puts' recent observation: https://photo.imx.nl/blog/files/09454a45366c36dd20255a07bf49ff55-149.html he then tests the same lenses with earlier generations of cameras that do not have this \"optimization\" feature. the results are different, in that they vary by aperture (lower contrast wide-open, peak contrast at middle apertures). it is improbable that panasonic (and every other major brand) does not do this. they also correct for geometric distortion, colour fringing, etc. they do correct for distortion and vignetting (leica, panasonic, and virtually everyone else), but that is via op codes that are -----> tagged !!!  to the file so that image processing software after the fact can make corrections. it’s not done in-camera to raw files at 10+ frames per second. heck, the color fringing correction he alleges isn’t even possible in a raw file since debayer hasn’t occurred yet. all one can do, and all ano of them do do, is tag the files. and i saw nothing in irwin’s post even speculating that the camera is “watching” for resolution charts in the images so it can apply extra sharpening (which you mentioned previously). as far as resolutions being different on previous generations of cameras... the simple fact that a completely different sensor is used with different micro lenses, pixel pitch, and anti aliasing filter makes it impossible to draw any conclusions related to raw processing. the manufacturers have generally been less clear than i would like about their dependence on lens profiles for correcting distortion and the like, but that’s about it. it’s just op codes and curves applied in the raw files as far as i am aware.", "sortedWord": "None", "identifyer": 33404, "year": "2020"}, {"Unnamed: 0": 422696, "autor": "Mr.Q", "date": 1579827600000, "content": "2 hours ago, thighslapper said: Well as far as I can see the overrall 'score' of 'goodness' depends entirely of the weighting of the 5 arbitrary parameters that DXO have chosen to assess lens quality by. A lens may be stonkingly sharp at f5.6 but crap at other apertures .... so quite how you score that as 'good' sharpness beats me. The whole point of the SL 35/2 is that it is almost optically perfect from f2 .... and is designed with the same high focal plane contrast and rapid drop off that show more pronounced subject modelling than other lenses not in the same SL stable. The MTF's are pretty well flat throughout. Colour rendition is perfect. AF is fast and accurate. It's built like a tank. I'd hesitate to say that any of DXO's test results are wrong ..... but their interpretation of what makes a 'good' lens seems to differ from the criteria Leica use. I know who I would rather believe. Well for a lot of landscape photographers, performance in the F2-F4 range doesn't really add much to their photography. Even if the 35SL has the best wide-open performance on the planet, if it's performance in the F5.6-F8 range is good to average, it doesn't warrant the high price tag for folks that always shoot in that range. It's good to have different interpretations and criteria by independent testers.", "link": "https://www.l-camera-forum.com/topic/305622-leica-apo-summicron-sl2035mm-average-performer/page/4/?tab=comments#comment-3898102", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "2 hours ago, thighslapper said: well as far as i can see the overrall 'score' of 'goodness' depends entirely of the weighting of the 5 arbitrary parameters that dxo have chosen to assess lens quality by. a lens may be stonkingly sharp at f5.6 but crap at other apertures .... so quite how you score that as 'good' sharpness beats me. the whole point of the sl 35/2 is that it is almost optically perfect from f2 .... and is designed with the same high focal plane contrast and rapid drop off that show more pronounced subject modelling than other lenses not in the same sl stable. the mtf's are pretty well flat throughout. colour rendition is perfect. af is fast and accurate. it's built like a tank. i'd hesitate to say that any of dxo's test results are wrong ..... but their interpretation of what makes a 'good' lens seems to differ from the criteria leica use. i know who i would rather believe. well for a lot of landscape photographers, performance in the f2-f4 range doesn't really add much to their photography. even if the 35sl has the best wide-open performance on the planet, if it's performance in the f5.6-f8 range is good to average, it doesn't warrant the high price -----> tag !!!  for folks that always shoot in that range. it's good to have different interpretations and criteria by independent testers.", "sortedWord": "None", "identifyer": 35742, "year": "2020"}, {"Unnamed: 0": 422697, "autor": "jplomley", "date": 1579827720000, "content": "1 minute ago, Mr.Q said: Well for a lot of landscape photographers, performance in the F2-F4 range doesn't really add much to their photography. Even if the 35SL has the best wide-open performance on the planet, if it's performance in the F5.6-F8 range is good to average, it doesn't warrant the high price tag for folks that always shoot in that range. It's good to have different interpretations and criteria by independent testers. And that is where the 16-35 comes into play. A fantastic performer for the landscape photographer", "link": "https://www.l-camera-forum.com/topic/305622-leica-apo-summicron-sl2035mm-average-performer/page/4/?tab=comments#comment-3898104", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1 minute ago, mr.q said: well for a lot of landscape photographers, performance in the f2-f4 range doesn't really add much to their photography. even if the 35sl has the best wide-open performance on the planet, if it's performance in the f5.6-f8 range is good to average, it doesn't warrant the high price -----> tag !!!  for folks that always shoot in that range. it's good to have different interpretations and criteria by independent testers. and that is where the 16-35 comes into play. a fantastic performer for the landscape photographer", "sortedWord": "None", "identifyer": 35743, "year": "2020"}, {"Unnamed: 0": 422705, "autor": "jaapv", "date": 1579863120000, "content": "9 hours ago, Mr.Q said: Well for a lot of landscape photographers, performance in the F2-F4 range doesn't really add much to their photography. Even if the 35SL has the best wide-open performance on the planet, if it's performance in the F5.6-F8 range is good to average, it doesn't warrant the high price tag for folks that always shoot in that range. It's good to have different interpretations and criteria by independent testers. Which only means that such an aggregate score is completely meaningless, and as DXO does not reveal their methods of scoring and criteria, the only place to put the final figure is the rubbish bin. To quote Roger Cicala on this: Quote Well, if you assume internal consistency, that would be true. But really, it would be more like \"we combine EPA gas mileage, 0-60 times, curb weight, luggage space, cornering ability, subjective attractiveness, and seat comfort as measured by our ideal ass size\" and rate this car a 92, so it's the car you should buy. Even if it's valid, are many people really interested in that ideal combination of cornering ability and luggage space?", "link": "https://www.l-camera-forum.com/topic/305622-leica-apo-summicron-sl2035mm-average-performer/page/4/?tab=comments#comment-3898289", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "9 hours ago, mr.q said: well for a lot of landscape photographers, performance in the f2-f4 range doesn't really add much to their photography. even if the 35sl has the best wide-open performance on the planet, if it's performance in the f5.6-f8 range is good to average, it doesn't warrant the high price -----> tag !!!  for folks that always shoot in that range. it's good to have different interpretations and criteria by independent testers. which only means that such an aggregate score is completely meaningless, and as dxo does not reveal their methods of scoring and criteria, the only place to put the final figure is the rubbish bin. to quote roger cicala on this: quote well, if you assume internal consistency, that would be true. but really, it would be more like \"we combine epa gas mileage, 0-60 times, curb weight, luggage space, cornering ability, subjective attractiveness, and seat comfort as measured by our ideal ass size\" and rate this car a 92, so it's the car you should buy. even if it's valid, are many people really interested in that ideal combination of cornering ability and luggage space?", "sortedWord": "None", "identifyer": 35751, "year": "2020"}, {"Unnamed: 0": 429621, "autor": "nicci78", "date": 1596112620000, "content": "Olympus failed because of the too small sensor choice and other perks, like the inability to renew its menu system. But every other choice has been good and copy/adopted by the rest of the industry. CL is not the M with its loyal customers : faithful to optical rangefinder and mighty M lenses. In that range, Leica can answer every small niches with very very high price tag. CL is the Leica for the rest of us. And in that field. It has to compete with every other brands. With Nikon & Fujifilm joining the Olympus, Pentax, Panasonic and Sony IBIS bandwagon. Leica did not have any other choice than to add IBIS to SL2. Now with Canon launching its first cameras with IBIS. Launching a CL2 without IBIS will be suicidal. How many SL owners upgrade to SL2 for IBIS alone ? I guess many more than for 47MP sensor. I was even ready to buy SL2 for IBIS... IBIS will solve a real problem for me, by adding stabilisation for hand holding long R lenses. Stable viewing = more accurate manual focusing + lower shutter speed, allowing lower ISO. IBIS is even more important, when Leica only sold 3 lenses with OIS : Summilux-Q 28mm asph of Q/Q2 + Vario-Elmarit-SL 24-90mm Asph + APO-Vario-Elmarit-SL 90-280mm. So 99% of Leica’s lenses do not any form of stabilisation. Hopefully Leica already knew all of this and will release CL2 with weather sealing and IBIS.", "link": "https://www.l-camera-forum.com/topic/311632-hoping-that-cl2-mini-sl2/page/4/?tab=comments#comment-4018173", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "olympus failed because of the too small sensor choice and other perks, like the inability to renew its menu system. but every other choice has been good and copy/adopted by the rest of the industry. cl is not the m with its loyal customers : faithful to optical rangefinder and mighty m lenses. in that range, leica can answer every small niches with very very high price -----> tag !!! . cl is the leica for the rest of us. and in that field. it has to compete with every other brands. with nikon & fujifilm joining the olympus, pentax, panasonic and sony ibis bandwagon. leica did not have any other choice than to add ibis to sl2. now with canon launching its first cameras with ibis. launching a cl2 without ibis will be suicidal. how many sl owners upgrade to sl2 for ibis alone ? i guess many more than for 47mp sensor. i was even ready to buy sl2 for ibis... ibis will solve a real problem for me, by adding stabilisation for hand holding long r lenses. stable viewing = more accurate manual focusing + lower shutter speed, allowing lower iso. ibis is even more important, when leica only sold 3 lenses with ois : summilux-q 28mm asph of q/q2 + vario-elmarit-sl 24-90mm asph + apo-vario-elmarit-sl 90-280mm. so 99% of leica’s lenses do not any form of stabilisation. hopefully leica already knew all of this and will release cl2 with weather sealing and ibis.", "sortedWord": "None", "identifyer": 42740, "year": "2020"}, {"Unnamed: 0": 430954, "autor": "ramarren", "date": 1602383760000, "content": "Fuji? Hmm. My body cap lenses are Olympus products. The Funleader looks like a single element lens, or a doublet at best, from your photos with it. I can't tell whether it has a focusing mount or not. I'll have to look it up, I'm always interested in entertaining lenses and such if they're cheap enough, many of which are mostly junk. LOL! The Olympus Body Cap Lenses are a triplet (15mm) and a 5-element (9mm fisheye, two aspheric elements), and have an adjustable focusing mount. They're quite sharp, the 9mm fish-eye in particular, and produce attractive bokeh (although deep DoF) due to their fixed circular aperture. They perform way beyond what their $70-$110 price tags (when I bought them) imply. Edited October 11, 2020 by ramarren", "link": "https://www.l-camera-forum.com/topic/313406-small-lens-alternative-for-the-cl/page/2/?tab=comments#comment-4060828", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "fuji? hmm. my body cap lenses are olympus products. the funleader looks like a single element lens, or a doublet at best, from your photos with it. i can't tell whether it has a focusing mount or not. i'll have to look it up, i'm always interested in entertaining lenses and such if they're cheap enough, many of which are mostly junk. lol! the olympus body cap lenses are a triplet (15mm) and a 5-element (9mm fisheye, two aspheric elements), and have an adjustable focusing mount. they're quite sharp, the 9mm fish-eye in particular, and produce attractive bokeh (although deep dof) due to their fixed circular aperture. they perform way beyond what their $70-$110 price -----> tags !!!  (when i bought them) imply. edited october 11, 2020 by ramarren", "sortedWord": "None", "identifyer": 44104, "year": "2020"}, {"Unnamed: 0": 430955, "autor": "pocholin", "date": 1602384240000, "content": "5 minutes ago, Ktsa5239 said: Interesting! It popped up on my Facebook and I was thinking about it for the past week! Where abouts are you located? I might be interested to buy it off you since my wife is into the Lo-fi point and shoot stuff. Is it at least sharp in the center? I'm in the University of Chicago area, I'd be interested on getting this thing off my hands, send me a message if indeed interested. Soft sharpness is all over the frame, never very sharp, I'm sure I (or someone) can find inventive ways to take advantage of it, like black and white. 3 minutes ago, ramarren said: Fuji? Hmm. My body cap lenses are Olympus products. The Funleader looks like a single element lens, or a doublet at best. I can't tell whether it has a focusing mount or not. The Olympus Body Cap Lenses are a triplet (15mm) and a 5-element (9mm fisheye, two aspheric elements), and have an adjustable focusing mount. They're quite sharp, the 9mm fish-eye in particular, and produce attractive bokeh (although deep DoF) due to their fixed circular aperture. They perform way beyond what their $70-$110 price tags (when I bought them) imply. Sorry, you're right, Olympus. This lens is advertised as 6 elements in 4 groups.", "link": "https://www.l-camera-forum.com/topic/313406-small-lens-alternative-for-the-cl/page/2/?tab=comments#comment-4060829", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "5 minutes ago, ktsa5239 said: interesting! it popped up on my facebook and i was thinking about it for the past week! where abouts are you located? i might be interested to buy it off you since my wife is into the lo-fi point and shoot stuff. is it at least sharp in the center? i'm in the university of chicago area, i'd be interested on getting this thing off my hands, send me a message if indeed interested. soft sharpness is all over the frame, never very sharp, i'm sure i (or someone) can find inventive ways to take advantage of it, like black and white. 3 minutes ago, ramarren said: fuji? hmm. my body cap lenses are olympus products. the funleader looks like a single element lens, or a doublet at best. i can't tell whether it has a focusing mount or not. the olympus body cap lenses are a triplet (15mm) and a 5-element (9mm fisheye, two aspheric elements), and have an adjustable focusing mount. they're quite sharp, the 9mm fish-eye in particular, and produce attractive bokeh (although deep dof) due to their fixed circular aperture. they perform way beyond what their $70-$110 price -----> tags !!!  (when i bought them) imply. sorry, you're right, olympus. this lens is advertised as 6 elements in 4 groups.", "sortedWord": "None", "identifyer": 44105, "year": "2020"}, {"Unnamed: 0": 431407, "autor": "Einst_Stein", "date": 1599219060000, "content": "2 hours ago, jaapv said: Which only means that they will be able to make even more compact APS systems in the future. The real challenge lies in the size of the lenses. Agree. Although smaller sensor no longer (at all) means smaller camera body of price tag (soon, as semiconductor tech improves, the volume is the king), it does imply smaller lens. And, when lens is larger, so would be the camera body just to keep the balance.", "link": "https://www.l-camera-forum.com/topic/312975-the-end-of-aps-c-and-m43-cameras/?tab=comments#comment-4039726", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "2 hours ago, jaapv said: which only means that they will be able to make even more compact aps systems in the future. the real challenge lies in the size of the lenses. agree. although smaller sensor no longer (at all) means smaller camera body of price -----> tag !!!  (soon, as semiconductor tech improves, the volume is the king), it does imply smaller lens. and, when lens is larger, so would be the camera body just to keep the balance.", "sortedWord": "None", "identifyer": 44566, "year": "2020"}, {"Unnamed: 0": 431412, "autor": "earleygallery", "date": 1599222360000, "content": "I guess a lot of people who get into photography with whatever camera to start with will always aspire to a FF system because they think it's 'better' and that's the line pushed by most of the manufacturers. People love the 'pro' tag too, even though it doesn't really mean anything relevant to them. Of course if your business is selling cameras then you're not going to dissuade people from forking out for a FF system when actually even APSC is actually far more than they could ever need.", "link": "https://www.l-camera-forum.com/topic/312975-the-end-of-aps-c-and-m43-cameras/page/2/?tab=comments#comment-4039756", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i guess a lot of people who get into photography with whatever camera to start with will always aspire to a ff system because they think it's 'better' and that's the line pushed by most of the manufacturers. people love the 'pro' -----> tag !!!  too, even though it doesn't really mean anything relevant to them. of course if your business is selling cameras then you're not going to dissuade people from forking out for a ff system when actually even apsc is actually far more than they could ever need.", "sortedWord": "None", "identifyer": 44571, "year": "2020"}, {"Unnamed: 0": 431413, "autor": "nicci78", "date": 1599224100000, "content": "1 hour ago, Einst_Stein said: Although smaller sensor no longer (at all) means smaller camera body of price tag (soon, as semiconductor tech improves, the volume is the king), it does imply smaller lens. But where is the smaller lenses ?? That’s all the problem. I would love to buy the smaller lenses for my CL. But there are only 11 APS-C lenses in L-mount alliance. Everything else is full frame ! In theory, APS-C should yield to smaller lenses. But hypothetical lens is useless to me. Leica is not invested anymore into the TL lenses business. What’s left for CL ? Being a 1.5x teleconverter only ? Handy for long focal length for sure. But a nightmare in ultra wide angle with lack of proper lens. Even as teleconverter, the days of APS-C is counted. Being stuck to 24 or 26MP, make them redundant against full frame 47MP (crop mode at 20MP) and 60MP (crop mode at 26MP) Please bring more APS-C lenses or kill the system and provide us small full frame bodies and lenses instead. I guess that most manufacturers already made their mind about that", "link": "https://www.l-camera-forum.com/topic/312975-the-end-of-aps-c-and-m43-cameras/page/2/?tab=comments#comment-4039770", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "1 hour ago, einst_stein said: although smaller sensor no longer (at all) means smaller camera body of price -----> tag !!!  (soon, as semiconductor tech improves, the volume is the king), it does imply smaller lens. but where is the smaller lenses ?? that’s all the problem. i would love to buy the smaller lenses for my cl. but there are only 11 aps-c lenses in l-mount alliance. everything else is full frame ! in theory, aps-c should yield to smaller lenses. but hypothetical lens is useless to me. leica is not invested anymore into the tl lenses business. what’s left for cl ? being a 1.5x teleconverter only ? handy for long focal length for sure. but a nightmare in ultra wide angle with lack of proper lens. even as teleconverter, the days of aps-c is counted. being stuck to 24 or 26mp, make them redundant against full frame 47mp (crop mode at 20mp) and 60mp (crop mode at 26mp) please bring more aps-c lenses or kill the system and provide us small full frame bodies and lenses instead. i guess that most manufacturers already made their mind about that", "sortedWord": "None", "identifyer": 44572, "year": "2020"}, {"Unnamed: 0": 431668, "autor": "Marac", "date": 1598699460000, "content": "I have made several high quality video productions including a feature. These were shot many years ago on a Black Magic camera using a mix of Sigma and Leica R lenses. I am aware that Leica produce some excellent Video lenses but the price tag is beyond anything that I have ever worked on. would love to take those Leica C lenses and put them on a RED. Again it all boils down to personal acceptance, if the video function on the Leica cameras fits with what you are doing then go for it. Some people are so talented they can produce excellent results on any camera or phone even.", "link": "https://www.l-camera-forum.com/topic/280497-video-with-cl/?tab=comments#comment-4035594", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i have made several high quality video productions including a feature. these were shot many years ago on a black magic camera using a mix of sigma and leica r lenses. i am aware that leica produce some excellent video lenses but the price -----> tag !!!  is beyond anything that i have ever worked on. would love to take those leica c lenses and put them on a red. again it all boils down to personal acceptance, if the video function on the leica cameras fits with what you are doing then go for it. some people are so talented they can produce excellent results on any camera or phone even.", "sortedWord": "None", "identifyer": 44829, "year": "2020"}, {"Unnamed: 0": 432112, "autor": "earleygallery", "date": 1596634500000, "content": "Are all TL and SL lenses made in Germany? Leica had said previously that the TL lenses (and therefore most likely SL) are made by a third party company in the Far East. Much of any 'real' Leica is now made elsewhere, the electronics, the sensors etc. Final assembly is carried out in Germany to qualify for the 'Made in Germany' tag where it applies. It's the modern way.", "link": "https://www.l-camera-forum.com/topic/294615-leica-t-crazy-cheap-any-good/page/3/?tab=comments#comment-4021899", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "are all tl and sl lenses made in germany? leica had said previously that the tl lenses (and therefore most likely sl) are made by a third party company in the far east. much of any 'real' leica is now made elsewhere, the electronics, the sensors etc. final assembly is carried out in germany to qualify for the 'made in germany' -----> tag !!!  where it applies. it's the modern way.", "sortedWord": "None", "identifyer": 45273, "year": "2020"}, {"Unnamed: 0": 432399, "autor": "EUSe", "date": 1593585600000, "content": "Am 29.6.2020 um 19:49 schrieb kalifornier: Hello All, I'm trying to decide whether to go the Leica-R 60/2.8 or the Sigma 70/2.8 route for macro on my TL2. If you have used either/both, I'd greatly appreciate your thoughts on pros/cons/handling. Thanks., Abhi Have you considered the 60 mm Apo-Macro-Elmarit TL? It is a stellar performer, rhe best in the TL.lens bunch. The price tag might play a role, though. Edited July 1, 2020 by EUSe", "link": "https://www.l-camera-forum.com/topic/310978-leica-6028-r-vs-sigma-7028-for-macro/?tab=comments#comment-4002130", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "am 29.6.2020 um 19:49 schrieb kalifornier: hello all, i'm trying to decide whether to go the leica-r 60/2.8 or the sigma 70/2.8 route for macro on my tl2. if you have used either/both, i'd greatly appreciate your thoughts on pros/cons/handling. thanks., abhi have you considered the 60 mm apo-macro-elmarit tl? it is a stellar performer, rhe best in the tl.lens bunch. the price -----> tag !!!  might play a role, though. edited july 1, 2020 by euse", "sortedWord": "None", "identifyer": 45560, "year": "2020"}, {"Unnamed: 0": 432404, "autor": "kalifornier", "date": 1593620100000, "content": "9 hours ago, EUSe said: Have you considered the 60 mm Apo-Macro-Elmarit TL? It is a stellar performer, rhe best in the TL.lens bunch. The price tag might play a role, though. I did consider it, but as you pointed out, price did play a role.", "link": "https://www.l-camera-forum.com/topic/310978-leica-6028-r-vs-sigma-7028-for-macro/?tab=comments#comment-4002321", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "9 hours ago, euse said: have you considered the 60 mm apo-macro-elmarit tl? it is a stellar performer, rhe best in the tl.lens bunch. the price -----> tag !!!  might play a role, though. i did consider it, but as you pointed out, price did play a role.", "sortedWord": "None", "identifyer": 45565, "year": "2020"}, {"Unnamed: 0": 433772, "autor": "tritentrue", "date": 1596774900000, "content": "CL + Sigma . . . Oriental Magpie Robin juvenile, after a game of \"tag\" with her two siblings . . . --img-- ", "link": "https://www.l-camera-forum.com/topic/312024-sigma-100-400-f5-63-dg-dn/?tab=comments#comment-4022758", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "cl + sigma . . . oriental magpie robin juvenile, after a game of \"-----> tag !!! \" with her two siblings . . . --img-- ", "sortedWord": "None", "identifyer": 46969, "year": "2020"}, {"Unnamed: 0": 435711, "autor": "tom.w.bn", "date": 1601207520000, "content": "I still have to find out how the EVF compares to the EVF of the S1. The reduction of the size of the S5 comes with a price tag: they removed the shoulder display. When I grab my S1 I can see instantly without turning the camera on, if the battery is full and a card is inserted and has enough space. For the shooting experience, I like to set the parameters while looking on the shoulder display. Then I raise the camera to my eye. Never liked setting all this via the back display.", "link": "https://www.l-camera-forum.com/topic/312473-new-lumix-s5-merged/page/4/?tab=comments#comment-4053174", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i still have to find out how the evf compares to the evf of the s1. the reduction of the size of the s5 comes with a price -----> tag !!! : they removed the shoulder display. when i grab my s1 i can see instantly without turning the camera on, if the battery is full and a card is inserted and has enough space. for the shooting experience, i like to set the parameters while looking on the shoulder display. then i raise the camera to my eye. never liked setting all this via the back display.", "sortedWord": "None", "identifyer": 48944, "year": "2020"}, {"Unnamed: 0": 435741, "autor": "Tailwagger", "date": 1599271440000, "content": " 2 minutes ago, nico4444 said: I am assuming the Crons are SL APOs, which if it is the case, it would make your set of lenses incredibly enviable. I am indeed very fortunate, no argument there. But, for me, the 'cron APO lenses where the whole point of buying into the L mount in the first place. I wouldn't have bought into the system otherwise. These lens are indeed as expensive as they are spectacular, but they serve as the core of a system I expect to shoot with for many, many years. Bodies come and go, but assuming you don't become disenchanted with the system, good glass will be with you over the very long haul. Those years takes a bit of the sting out of the price tag after a while. But far more important, I tend to wind up shooting thousands of frames a year with optics I love, as opposed to a few hundred with those I don't. The cost per shot tilts dramatically, becoming pennies a capture over the lifetime of the lens. In the end, an expensive optic you use is a far better value proposition than a cheaper one you don't. After 10 months with the 75mm, half a year with the 35, I've shot roughly 8000 frames between the two. By year's end I'll be under a $1 a capture for the pair. That doesn't alter the entry fee of course, but usage does speak to the wisdom or foolishness of having ponied up in the first place. When it comes to photographic gear, there are easily as many paths to misery as there are happiness. The less enjoyable ones have taught me over time that glass selection is key. I avoided the L until the intro of the alliance, as there simply was no clear path forward early on unless one committed to zooms, which, as an M shooter, I was unprepared to do. I entered, once I was convinced that a satisfying set of optics could be assembled over time. The crucial decision became whether to build around the 35/75 pairing, versus 50/90. Everything else would follow from that. In my case, the deciding factor came down to complimenting the glass I had available on my M, not merely from a focal length POV, but a character one as well. Certainly your calculations will be different. But given you're already in the L fold and assuming you've committed to it long term, I'd take a deep breadth and consider where you'd like to be in a couple of years. Figuring out where you want to wind up over time might help shed substantial light on the best course of action today.", "link": "https://www.l-camera-forum.com/topic/312993-first-everyday-lens-suggestions-for-sl-typ-601/page/2/?tab=comments#comment-4040154", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " 2 minutes ago, nico4444 said: i am assuming the crons are sl apos, which if it is the case, it would make your set of lenses incredibly enviable. i am indeed very fortunate, no argument there. but, for me, the 'cron apo lenses where the whole point of buying into the l mount in the first place. i wouldn't have bought into the system otherwise. these lens are indeed as expensive as they are spectacular, but they serve as the core of a system i expect to shoot with for many, many years. bodies come and go, but assuming you don't become disenchanted with the system, good glass will be with you over the very long haul. those years takes a bit of the sting out of the price -----> tag !!!  after a while. but far more important, i tend to wind up shooting thousands of frames a year with optics i love, as opposed to a few hundred with those i don't. the cost per shot tilts dramatically, becoming pennies a capture over the lifetime of the lens. in the end, an expensive optic you use is a far better value proposition than a cheaper one you don't. after 10 months with the 75mm, half a year with the 35, i've shot roughly 8000 frames between the two. by year's end i'll be under a $1 a capture for the pair. that doesn't alter the entry fee of course, but usage does speak to the wisdom or foolishness of having ponied up in the first place. when it comes to photographic gear, there are easily as many paths to misery as there are happiness. the less enjoyable ones have taught me over time that glass selection is key. i avoided the l until the intro of the alliance, as there simply was no clear path forward early on unless one committed to zooms, which, as an m shooter, i was unprepared to do. i entered, once i was convinced that a satisfying set of optics could be assembled over time. the crucial decision became whether to build around the 35/75 pairing, versus 50/90. everything else would follow from that. in my case, the deciding factor came down to complimenting the glass i had available on my m, not merely from a focal length pov, but a character one as well. certainly your calculations will be different. but given you're already in the l fold and assuming you've committed to it long term, i'd take a deep breadth and consider where you'd like to be in a couple of years. figuring out where you want to wind up over time might help shed substantial light on the best course of action today.", "sortedWord": "None", "identifyer": 48974, "year": "2020"}, {"Unnamed: 0": 439483, "autor": "Leica Guy", "date": 1587683220000, "content": "On 4/13/2020 at 7:25 PM, Leica Guy said: Where did you find the beautiful little magnifier? I like it. The GMT Master is also nice. I used to have one until it was stolen. 😩 On 4/12/2020 at 7:24 PM, Magic said: --img--  Magic, Tag, You're it! I found a magnifier that was picked up for me at Wetzlar last year. Mine is not nearly as powerful as yours, but the glass is much larger. Leica Q2, 4 sec, f/16, ISO 200, eliminated shadows and cleaned up details in photoshop. Once again I found that product photography is very challenging. Managing light and reflections is very difficult. I used a white soft box and still there were many areas that I had to work on. --img-- ", "link": "https://www.l-camera-forum.com/topic/303743-macroclose-up-filters-for-the-q2/page/3/?tab=comments#comment-3959790", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on 4/13/2020 at 7:25 pm, leica guy said: where did you find the beautiful little magnifier? i like it. the gmt master is also nice. i used to have one until it was stolen. 😩 on 4/12/2020 at 7:24 pm, magic said: --img--  magic, -----> tag !!! , you're it! i found a magnifier that was picked up for me at wetzlar last year. mine is not nearly as powerful as yours, but the glass is much larger. leica q2, 4 sec, f/16, iso 200, eliminated shadows and cleaned up details in photoshop. once again i found that product photography is very challenging. managing light and reflections is very difficult. i used a white soft box and still there were many areas that i had to work on. --img-- ", "sortedWord": "None", "identifyer": 52799, "year": "2020"}, {"Unnamed: 0": 446733, "autor": "crawley5503", "date": 1607369340000, "content": "Don't be lead astray by the slow lens naysayers. They are a bunch who hated the Mini M tag pasted onto the launch of this marvelous camera by Leica marketing. I've shot a bunch in low light with my X Vario and it works fine. The camera is a marvel in output. Pix files are beautiful in either JPEG or Raw. Easy to use and a charmer once you learn to operate it... manually, of course.", "link": "https://www.l-camera-forum.com/topic/311657-opinion-about-x-vario-and-x-typ-113-in-2020/?tab=comments#comment-4094137", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "don't be lead astray by the slow lens naysayers. they are a bunch who hated the mini m -----> tag !!!  pasted onto the launch of this marvelous camera by leica marketing. i've shot a bunch in low light with my x vario and it works fine. the camera is a marvel in output. pix files are beautiful in either jpeg or raw. easy to use and a charmer once you learn to operate it... manually, of course.", "sortedWord": "None", "identifyer": 10201, "year": "2020"}, {"Unnamed: 0": 446835, "autor": "Peter_S", "date": 1596718620000, "content": "Simplicity can be a charm, and the X series excels at that. It is a shame Leica stopped the series. I firmly believe the X1 was one their best cameras, and I think the 113 is as well. The Q is all fine and such, but that price tag...", "link": "https://www.l-camera-forum.com/topic/295889-is-leica-x-type-114-still-worth-getting-in-2019/page/2/?tab=comments#comment-4022463", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "simplicity can be a charm, and the x series excels at that. it is a shame leica stopped the series. i firmly believe the x1 was one their best cameras, and i think the 113 is as well. the q is all fine and such, but that price -----> tag !!! ...", "sortedWord": "None", "identifyer": 10304, "year": "2020"}], "name": "tagL-Forum2020"}