{"interestingcomments": [{"autor": "pheonix_bird", "date": "2021-07-31 18:18:16", "content": "1850s Daguerreotype colorized and brought to life using -----> AI !!! ", "link": "https://www.reddit.com/r/photography/comments/ovc4n5/1850s_daguerreotype_colorized_and_brought_to_life/"}, {"autor": "rrhuleva", "date": "2021-08-31 21:46:27", "content": "Have we gone a bit insane? /!/ So I am a bit confused…maybe even a completely confused.\n\nGoing back to my early photography days we were shooting with film. I’m sure a good number of you have at least some experience shooting film as well!\n\nRemember how there was kind of an unspoken rule…maybe an understanding, if you will, that you should usually choose the slowest film speed you could for a given shoot? Of course, if you were not using flash you would try to choose a film speed that would match the expected natural light conditions.\n\nThe caveat was always that you did not want any faster film than necessary as faster film speeds would introduce more film grain! Back then, apparently we thought grain was bad!\n\nDecades later we have amazing digital sensors to capture extraordinarily clean images…even at somewhat high ISO (the digital similarity to film speed). But even as good as they are we still get digital noise (the digital similarity to grain) at times. So to further clean all noise from our images, we engage in a multitude of noise reduction techniques…and even spend additional money to purchase the latest generation of -----> AI !!!  noise reduction tools!\n\nAt the end of all of this digital technology and artist’s efforts, we have some amazing, clean and crisp images! They are stunning!\n\nBut we don’t stop there…at least not any,ore! Now we are being told we can create a more generic look by…you guessed it…adding digitally created grain into the image!\n\nThis is where I’m lost! Why did I spend thousands of dollars and hundreds of hours purchasing and practicing my digital photography equipment and skills…including post processing?\n\nThis seems to be the same lunacy that drives us to buy an 80” TV and then watch Netflix on a smartphone! Or, replace our entire audio system and music collection with CDs…only to now say we prefer the sound of vinyl!\n\n\nAre we just a restless lot who can never find anything satisfactory? I write some of this a bit satirically, however I am seriously looking for someone who can shed a light on why people, photographers in our case, are never satisfied?\n\nChange for something better os progress…but change JUST for something different seems insane!", "link": "https://www.reddit.com/r/photography/comments/pffnoq/have_we_gone_a_bit_insane/"}, {"autor": "Drama79", "date": "2021-08-31 17:32:55", "content": "Interested in people’s experiences with Luminar -----> AI !!!  as their photo editor of choice? /!/ Particularly with regards to long term cataloguing, but also just as an editor day to day? I’m lazy - I’ve been with Adobe for years, I’ve flirted with capture1, but haven’t ever jumped. I’d love to though - so all thoughts and experiences welcomed!", "link": "https://www.reddit.com/r/photography/comments/pfanxq/interested_in_peoples_experiences_with_luminar_ai/"}, {"autor": "thenerdpulse", "date": "2021-01-29 18:37:13", "content": "Is Samsung's Galaxy S21 Ultra using -----> AI !!!  to fake detailed Moon photos?", "link": "https://www.reddit.com/r/photography/comments/l80a73/is_samsungs_galaxy_s21_ultra_using_ai_to_fake/"}, {"autor": "KinnerNevada", "date": "2021-03-30 17:07:00", "content": "-----> AI !!!  photo restoration shines a light on life in old Ireland", "link": "https://www.reddit.com/r/photography/comments/mgkscw/ai_photo_restoration_shines_a_light_on_life_in/"}, {"autor": "giuliomagnifico", "date": "2021-06-15 17:43:59", "content": "New -----> ML !!!  technique by University of Washington produces, from a still photo of any flowing material, a short video that loops seamlessly", "link": "https://www.reddit.com/r/photography/comments/o0k3p1/new_ml_technique_by_university_of_washington/"}, {"autor": "GreenChocolate_", "date": "2021-08-15 19:47:02", "content": "Offline Photo Organizer application request /!/ Hello, I wanted to know if there is any software similar to Google Photos -----> AI !!! , to sort all of my family's pictures but locally (in my windows pc) and without having to pay monthly for a cloud service. Thanks!", "link": "https://www.reddit.com/r/photography/comments/p50btq/offline_photo_organizer_application_request/"}, {"autor": "eniporta", "date": "2021-10-15 10:17:26", "content": "Thoughts on strange issue - DOF preview button fixing Canon ERR01 code on 5D MkIII /!/ So my 5d3 has had ERR01 issues for a while - \"communication between the camera and lens is faulty\" for those unaware. It could go for a while without issue but once it hit the only option to fix it was to remove and reattach the lens. \n\nFinally got sick of it enough to try to clean the lens and camera contacts.. and this made it worse. Now the ERR01 would hit on the first attempt every time. \n\nOut of curiosity I wondered if the DOF preview button would still work. I figured there was only so much communication occuring between the camera and lens. AF was working fine so aperture control seemed to be the offender. I had switched the DOF preview button to be hold for -----> AI !!!  SERVO in the past so hadn't used DOF preview since well the error started. \n\nSwitched the button back to its default, tested it out, worked fine. Aaaand have now gone through hundreds of photos without the error coming back. Hoping I'm not jinxing myself here. \n\nAnyone else had this experience of other odd ones before? Anyone know why the hell manually uses the DOF preview button to stop down the aperture could fix the communication between the camera and lens?", "link": "https://www.reddit.com/r/photography/comments/q8lfxd/thoughts_on_strange_issue_dof_preview_button/"}, {"autor": "RandompersoninUS", "date": "2021-10-08 01:49:21", "content": "\"Norwegian Coast\" , -----> AI !!!  generated Image, came out lovely I must say.", "link": "https://www.reddit.com/r/photography/comments/q3nrt3/norwegian_coast_ai_generated_image_came_out/"}, {"autor": "pranjallk1995", "date": "2021-10-28 02:50:52", "content": "Professional photographers will have a hard time in future and is a dying art. /!/ Hi,\n\nI would want to know your opinions on this topic, \"Professional photographers will have a hard time in future\". And I would go one step beyond and even claim that it is soon going to die.\n\nLet me explain my point of view and why I believe so. I will start with some trivial reasons and then move on the main reason in the latter half of this discussion post. \n\nFirst of all I am really worried with the advancement in camera technology happening these days and it getting cheaper and more accessible every day. There are so many hobbyist (like me) that are coming up due to this and they like to take their pictures themselves. They don't need a lot of fancy gear and can get what they want even from their smartphones and software techniques without much pain. There are already cameras in smartphones that can open up to f/1.4 (Vivo X60 pro) giving tremendous low light performance for example. So be it, but the most worrisome part is that they are ready to sell their pictures (again like me) for peanuts. I for example sell my photos for less than a dollar per picture. May be this doesn't pose a lot of threat to professionals but keep up with me.\n\nNext issue that I would like to point out is that of websites like unsplash and pexels. People including some top notch photographers post their pictures here for free. Individuals and more importantly major companies/industries now have an access to large amount of stock photos for free! I myself was shocked to see my photos reaching far and wide to websites like Buzzfeed, WordPress, Flickr etc and I gained nothing in return apart from come graphs and stats showing my reach, views and downloads.\n\nAll these things are eating up the photography market from inside out like a parasite I believe. But as if this was not enough, let me introduce you to GANs (Generative Adversarial Networks). So far you might be wondering that there is still scope for specialization in fields like weddings, fashion, product, food, landscape, wildlife, portraits etc. If so, then I request you to kindly read further into this discussion.\n\nGANs are a -----> deep learning !!!  based set of algorithm that can literally do magic. They will change the dynamics completely. **Photos will soon be created** (not taken). Once trained against a large set of database (which is available for free as mentioned before), they can make new photos. restore old photos, include what you want in a scene (like yourself), replace something that you want in a scene and what not!\n\nSome applications already available are:\n\n* Generation of random realistic portraits/models completely wiping out fashion photography.\n* Generation of cartoon characters, wiping out graphics/vector designers.\n* Image to image translation. (restoring old photos as high definition new photos, black and white to color images, sketches to realistic images)\n* Text to image translation. wiping out landscape/wildlife photography. (literally converting text like, \"A small Indian ringneck sitting on a branch\" into multiple image choices.)\n* Face repositioning and regeneration. (generate/reorient a face into required position)\n\nGANs are no joke. The results are already staggering. You must have seen deepfake challenges inviting you to find the difference between fake and original images.\n\n I would like to know your thoughts on it. Are you concerned? or things are not as grim as I portray. These GANs are only gonna get better with time.", "link": "https://www.reddit.com/r/photography/comments/qhd7zr/professional_photographers_will_have_a_hard_time/"}, {"autor": "Horror_Plankton_9282", "date": "2021-01-03 13:44:52", "content": "deepnude.to - -----> AI !!!  that removes clothes from images", "link": "https://www.reddit.com/r/photography/comments/kpku9m/deepnudeto_ai_that_removes_clothes_from_images/"}, {"autor": "SaltyTsunami", "date": "2021-01-02 22:03:35", "content": "How does the Plustek OpticFilm 8200i -----> Ai !!!  film scanner compare to the Nikon CoolScan 5000? /!/ I’ve just acquired a large amount of slides, both mounted and strips of film, from the 1960’s and onward. I used to own a Nikon CoolScan 5000 many years ago and thought it was excellent, albeit a bit slow to use. \n\nIn shopping for a new slide scanner, I realized Nikon no longer makes theirs. The alternative I found is the Plustek Opticfilm 8200i Ai. As well as the slightly less expensive SE version of the same brand. I am unclear on what the difference between the two (Ai/SE) models are. If anyone has any insight on this, that would be very helpful as well. \n\nI’m not at all familiar with Plustek, and I’m inclined to just try to find a used Nikon CoolScan to purchase, since that is what I’m used to, and I know what quality to expect. \n\nBut if anyone has used both the Plustek and the old Nikon CoolScan 5000, please share your personal review/comparison of the two. I use macOS, so the scanner/software will need to be Mac compatible. \n\nThank you in advance!", "link": "https://www.reddit.com/r/photography/comments/kp6ttc/how_does_the_plustek_opticfilm_8200i_ai_film/"}, {"autor": "Roibuk", "date": "2021-01-12 13:42:21", "content": "Hi, my name is Roi. I lately started using a tool called ImagenAI. They use -----> AI !!!  that learns my editing style, it edits the photos automatically based on my previous edits and leaves me spare time to do extra things 😊 you should really try their free trial: http://bit.ly/join_Imagen-----> AI !!!  /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/kvrv6n/hi_my_name_is_roi_i_lately_started_using_a_tool/"}, {"autor": "jfsky2018", "date": "2021-02-18 09:55:18", "content": "LR vs Luminar - Seem to be getting better results using LR mobile app w/ JPEG than editing with Luminar and RAW..Why?? /!/ So, I bought Luminar and have been using it for about a year. I like it, but its like I can get the photo to 80% to 90% how I want it but not exactly... never fully happy with it... this is using Luminar 4 and RAW.   \n  Mostly it is for Landscape and also Astrophotography which even exaggerates this problem, where I cannot get a satisfactory image exactly how I want.\n\n&amp;#x200B;\n\nThen, I went on holidays and didn't have my laptop/luminar, so I was editing the photos I took directly on my phone on the free LR app (only supports JPEG).  I expected bad results but shockingly these are the photos that I like the most and have recieved the best feedback from family / friends...In general it felt way easier, faster to get exactly the result I was going for.. \n\n&amp;#x200B;\n\nSo..I am not sure if editing on the phone was actually a help rather than the laptop.. or LR is indeed miles ahead of Luminar and even editing JPEGs with LR is superior than RAW with Luminar\n\n&amp;#x200B;\n\nAnyone have any ideas?  Or using / familiar with both Lightroom and Luminar (4)\n\n&amp;#x200B;\n\nPS (my thoughts on Luminar is that it is a nice tool, excellent folder structure for storage, but way too much -----> AI !!!  etc whereif you use you don't know exactly what parameters are changing what)", "link": "https://www.reddit.com/r/photography/comments/lmj7qj/lr_vs_luminar_seem_to_be_getting_better_results/"}, {"autor": "adamantsun", "date": "2021-03-11 23:46:50", "content": "Is adobe worth it? /!/ Hubby bought me adobe premiere elements for Christmas. Despite how expensive it was we were disappointed to learn it only came with a hobbled -----> AI !!!  version of photoshop but there was access to more adobe features like portfolio and Lightroom. Hubby tried to buy me photoshop and that's when we learned it's subscription only now and costs for the year total what it used to cost to buy it so I've stuck with what I have. \n\nI went to use Lightroom today only to find my access was only more of a \"free trial.\" I'm annoyed at being pricked for cash every time I try to use something. I am moving more seriously into photography as a business, I don't know that I want to get in bed with this vampire program if there's a better option.", "link": "https://www.reddit.com/r/photography/comments/m34593/is_adobe_worth_it/"}, {"autor": "TrendiSanders", "date": "2021-04-04 08:19:34", "content": "Wild West Portraits Brought To Life Using -----> AI !!!  Technology", "link": "https://www.reddit.com/r/photography/comments/mjs5o6/wild_west_portraits_brought_to_life_using_ai/"}, {"autor": "Professional_Star871", "date": "2021-04-28 00:46:04", "content": "Looking to make as high def a video as possible with a budget. I want to use a phone in tandem with corrective -----> AI !!!  but I am open to camera suggestions. Newbie videographer, but with a substantial understanding of theoretical physics. /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/n02zsf/looking_to_make_as_high_def_a_video_as_possible/"}, {"autor": "FUDGEPOOP", "date": "2021-05-05 04:20:11", "content": "Gigapixel - removed black backgrounds? /!/ I’m giving Gigapixel a try to upscale old artwork in .PNG format and the preview and output always results in removing the black background .\n\nAnyone how to stop it and leave it as source? I was thinking or buying it after testing the trial but this odd behavior makes me not want to and use a online -----> AI !!!  service for same price", "link": "https://www.reddit.com/r/photography/comments/n574le/gigapixel_removed_black_backgrounds/"}, {"autor": "videoalex", "date": "2021-05-07 20:04:17", "content": "Best place and practice to host/share/organize a glut of family photographs? /!/ My father passed a couple of months ago, and I took all of the family photo albums from his house. I have hundreds of photos to scan, so I bought a sheet-fed style photo scanner that does a good job. But now I want to share these with my family of older, non-techy people. Some have PCs, android phones, etc, so I need something that is Mac-friendly, but not Mac-only. \n\nIn my dream I am able to tag all of them with some amount of metadata and create albums for people-my sister's high school boyfriend, for instance, can have all these photos of himself that we have had for 40 years-I would LOVE to be able to just say \"grab all the pictures of Peter\" and make them into a zip. \n\nI have looked at Flickr and done some experiments with it-using a desktop (Mac) app (which was very outdated) I was able to tag the pics but it's slow and clunky. Doesn't look like google photos is much better, although if it is able to tag with -----> AI !!!  that'd be a real win. It seems unclear to me what it can do.\n\nI'm willing to pay a reasonable amount for this-just don't know where to start and I'm afraid to blow full steam ahead without a good workflow. Can you pros set me in the best direction?\n\n&amp;#x200B;\n\ntl;dr: platform and workflow suggestions for a glut of old family photographs I'm scanning?", "link": "https://www.reddit.com/r/photography/comments/n77kso/best_place_and_practice_to_hostshareorganize_a/"}, {"autor": "alexmorello", "date": "2021-06-07 07:42:15", "content": "Aperture v. Lightroom v. Capture One v. RAW Power, etc. /!/ So, folks - how do these measure up to the classics? Been using Aperture almost exclusively for a long while, and it certainly is handier than, say, the likes of *Fotor*. However, I don't expect it to last for much longer, as the tools required to run it on modern computers are fan-developed and may break any time now.\n\nI barely need -----> AI !!!  or 'computed photography', nor do I want any filters. What I need are powerful manual / semi-automatic tools married to a simple, elegant interface. Also, subscriptions are no-go. Take Lightroom, for one - is it snappy and easy to use as Aperture, or is it over-saturated with features and has a steeper learning curve in typical Adobe fashion?", "link": "https://www.reddit.com/r/photography/comments/nu6u8z/aperture_v_lightroom_v_capture_one_v_raw_power_etc/"}, {"autor": "cjohnsonuk", "date": "2021-07-21 13:01:31", "content": "-----> AI !!!  face replacement of faces for photos in public places /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/ooperb/ai_face_replacement_of_faces_for_photos_in_public/"}, {"autor": "GambitSucks", "date": "2021-08-06 14:09:29", "content": "Gadget \"Arsenal\" one of the most funded kickstarter projects is a SCAM. Prove me wrong. /!/ The second I heard about it I knew something wasn't right. But other than people complaining it makes Instagram-esque photos, nobody I've seen really talks about why this product is completely pointless. I'm not commenting on the actual output of the photos in this post, but more about the need for a piece of hardware to accomplish their goal.\n\nFrom my perspective, 100% of their customers could have actually been served a mobile app only version of their product or simply an OTG cable and had the exact same features. So why are they selling a piece of hardware? To make money and create massive ewaste.\n\nI tried to open a discussion about this with their sales time, and they mostly shut it down with vague terminology like \" it has advanced -----> AI !!!  processing technology\" when in actuality, I bet most of that work is offloaded to your phone anyway (if anyone owns one and wants to open it up and show us the inside, that would be awesome).\n\nThey're a software solution, selling a piece of hardware that does basically nothing, except give your camera wifi.\n\nBut looking at their compatibility list, I've still yet to find a camera that doesn't support wifi \n\n[https://witharsenal.com/supported-cameras](https://witharsenal.com/supported-cameras)\n\nAnd if it doesn't have wifi, an OTG cable can connect to the camera and use the same PTP protocol.\n\nCan anyone explain to me what it is this \"intelligent camera assistant\" actually does, that your phone (which it requires to function anyway) can't do?", "link": "https://www.reddit.com/r/photography/comments/oz7dj5/gadget_arsenal_one_of_the_most_funded_kickstarter/"}, {"autor": "Electronic-Rice-9871", "date": "2021-08-06 11:31:03", "content": "Luminar -----> AI !!!  - -----> AI !!!  photo editing for Mac &amp; PC /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/oz4s2l/luminar_ai_ai_photo_editing_for_mac_pc/"}, {"autor": "turley97", "date": "2021-08-09 20:39:28", "content": "Topaz Denoise Over-Sharpening /!/ I am a complete photography noob and decided to try using the trial version of Topaz Denoise -----> AI !!!  (with the watermark). It looks good in the preview, but once it actually processes the image and saves it to my computer, the result has very jagged edges. I keep reading so much good stuff about it and Sharpen AI and would buy the package they have right now, but the results I get are worse than the original. My 11 year old even made a joke that it should be called ReNoise AI. I’ve tried multiple different settings and adjusted all the sliderswith no change. Im using a 2020 Apple M1 MacBook Air (base model) and using older photos mostly taken with various models of iPhones if any of that makes a difference. Any help will be greatly appreciated.", "link": "https://www.reddit.com/r/photography/comments/p19znw/topaz_denoise_oversharpening/"}, {"autor": "unknown-one", "date": "2021-09-09 20:44:22", "content": "Skylum introduces new application Luminar Neo for \"advanced\" photo editing. /!/ [https://skylum.com/luminar-neo](https://skylum.com/luminar-neo)\n\n&amp;#x200B;\n\nLuminar -----> AI !!!  won't probably get any more functionality, maybe some future updates", "link": "https://www.reddit.com/r/photography/comments/pl68ji/skylum_introduces_new_application_luminar_neo_for/"}, {"autor": "[deleted]", "date": "2021-09-09 20:42:56", "content": "Skylum introduces Luminar Neo, new application for more \"advanced\" photo editing. Luminar -----> AI !!!  won't probably get any more new functionality /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/pl67lv/skylum_introduces_luminar_neo_new_application_for/"}, {"autor": "samcornwell", "date": "2021-08-20 22:53:21", "content": "Discussion: Facebook -----> AI !!!  bans professional photographer for 30 days after “inciting violence” after this comment", "link": "https://www.reddit.com/r/photography/comments/p8fw3h/discussion_facebook_ai_bans_professional/"}, {"autor": "PXCRYTICAL", "date": "2021-10-20 01:42:03", "content": "Editing Software /!/ I am looking for a good editing software, without a subscription - adobe \\*cough cough\\*.\n\nI have tried the trial for affinity photo, Luminar -----> AI !!! , Correl PaintShop Pro, and Capture Pro 21. I liked capture pro and have used gimp to great avale. I was wondering if there were any other very good options?\n\nI primarily use the software for enhancements, less so layering, adding, etc. However, those features would be nice as well.", "link": "https://www.reddit.com/r/photography/comments/qbq4hs/editing_software/"}, {"autor": "villainousgamgee", "date": "2021-01-09 02:07:17", "content": "Shutter Priority Mode on D700 /!/ Just got a new-to-me Nikon D700. I'm trying to modify shutter speed in Shutter Priority mode, but it won't let me. The shutter speed number disappears when I get into S mode. Does it have something to do with the fact I'm using an older -----> AI !!!  manual focus lens? Or could there be a setting that I need to change? Changing shutter speed in Manual mode works just fine so I don't think it's anything like it's completely busted. Sorry if this is the wrong sub for this.", "link": "https://www.reddit.com/r/photography/comments/kthjhj/shutter_priority_mode_on_d700/"}, {"autor": "cantonbecker", "date": "2021-01-19 16:30:25", "content": "If you fix an out-of-focus portrait with -----> AI !!! , is it ethical to give it to your client without a disclaimer of some sort? And why isn't the FBI using this technology on their WANTED posters? /!/ Have you played around with the Remini IOS/Android app yet? It uses AI/neural net tech to make blurry portraits tack-sharp. It's space age. It's creepy. AI was my major in university, and the advent of this software still caught me off guard.\n\nThese results are something I didn't think I would see in my lifetime. If anyone ever asked you if there's a way to save an out-of-focus picture and you answered 'no', you now have to reconsider that answer.\n\nBut I'm not sure that the results are so much \"pictures\" as they are computer illustrations. Remini even adds eyelashes, skin pores, eye lights where there were none before...\n\nWhat do you think? If you fix a blurry portrait with AI, is it ethical to give it to your client without a disclaimer of some sort, e.g. \"BTW this isn't a \"real\" picture? Or if it looks real to them, do you just treat the AI-fixed photo like you would any other?\n\nIf you haven't seen examples of Remini in action yet, [here's a good article](https://fstoppers.com/apps/fstoppers-reviews-remini-ai-photo-enhancing-app-can-resurrect-images-where-you-536459). Also, look at how I salvaged the sharpness/focus [on these awful FBI video captures from the Capitol](https://imgur.com/a/frMlbyF)", "link": "https://www.reddit.com/r/photography/comments/l0navk/if_you_fix_an_outoffocus_portrait_with_ai_is_it/"}, {"autor": "cantonbecker", "date": "2021-01-19 16:05:12", "content": "Maybe someone should tell the FBI about the Remini app. Or: what do YOU think about the advent of -----> AI !!!  software that reconstructs out-of-focus portraits?", "link": "https://www.reddit.com/r/photography/comments/l0ms74/maybe_someone_should_tell_the_fbi_about_the/"}, {"autor": "Mojo884ever", "date": "2021-01-25 16:24:11", "content": "What are your thoughts on using -----> AI !!!  apps to correct noise/missed focus? /!/ Hey guys,\n\nI recently saw an app on a youtube video that touted the ability to recover details from old, blurry photographs. I've played with the app and have been pretty impressed so far, and have been wondering at the possibility of using this app for photography.\n\nI'm not gonna name the app here - not sure if it would violate the rules... If I get the Ok from a mod I'll be happy to share. But I'm sure most of you have seen or heard of it...\n\nIf I missed focus in the face in an otherwise great shot, this app appears to be able to fix it using AI. It is also really good at removing noise.\n\nMy hang up here is that the app can put details where there were none. It uses a database of facial features to match what it thinks should be there. I've used it on photos of my family and have been pretty shocked with the accuracy of it.\n\nAnyway, I am very much a novice and have never charged anyone for photographs. Mostly I just take my camera around and snap pictures of whatever grabs my eye. I do plan on eventually making this a side gig, and I was just wondering where the ethical line is in editing for a client. Is it 'only touch up what is there,' or is 'whatever it takes to deliver a good shot' acceptable?\n\nHere's a picture of James Franco just to show you what the app does.\n\nhttp://imgur.com/a/gKnoNiJ", "link": "https://www.reddit.com/r/photography/comments/l4r8wf/what_are_your_thoughts_on_using_ai_apps_to/"}, {"autor": "maad0000", "date": "2021-02-20 17:56:31", "content": "-----> AI !!!  the next frontier in creative expression? /!/ Hello,\n\nA few years ago I started to find myself uninspired and bored with the predictable nature of how and what I photographed. After shooting Advertising and Editorial photography for over 20 years I felt like I was running on \"creative auto-pilot\".\n\nI stopped bringing my camera with me as it felt like I already knew what the photos were going to look like. Similar to what other members of this forum have mentioned, the initial excitement of just going on to shoot in order to discover was long gone. \n\nA few years ago I began to look for ways to get the motivation back again - basically trying to “rewire” my brain to take photos I’ve never taken before, not because I didn’t like my work but more as a creative exercise. \n\nI decided to learn how to code(!) and built an app that uses Machine Learning to essentially prevent myself from ever taking the same photo twice. \n\nI wrote a [post](https://www.insanelittleprojects.com/blog/2021/1/27/y15cs0qs0x1f6hrfkd66eqzns58tj6) about my journey into writing code and machine learning as a Photographer and why I think AI assistance creativity bots will become the next step in creative expression.", "link": "https://www.reddit.com/r/photography/comments/lockow/ai_the_next_frontier_in_creative_expression/"}, {"autor": "parsons525", "date": "2021-04-24 03:25:29", "content": "How good will phone/computational photography get? /!/ Phones have come a long way in the past 20 years. Portrait mode now rivals what you get from an expensive prime. And the ultra wide modes are pretty good too for landscape. One area I find traditional will wins hands down is telephoto/sport photography. A phone still trails far behind my DSLR and 400mm lens.\n\nWill that gap be closed sooner or later? How far can little phone lenses plus -----> AI !!!  take us? In 30 years might we have 30 camera modules on each device that can do everything (and more) that today’s interchangeable systems can do?", "link": "https://www.reddit.com/r/photography/comments/mxbpyv/how_good_will_phonecomputational_photography_get/"}, {"autor": "Gong_Ryu", "date": "2021-04-26 03:34:23", "content": "What is a good stock footage website to get into? /!/ Shuttershock -----> AI !!!  sucks don't even try.", "link": "https://www.reddit.com/r/photography/comments/myoobw/what_is_a_good_stock_footage_website_to_get_into/"}, {"autor": "Illustrious_Row_9971", "date": "2021-05-05 19:18:45", "content": "-----> AI !!!  for removing backgrounds", "link": "https://www.reddit.com/r/photography/comments/n5o3ny/ai_for_removing_backgrounds/"}, {"autor": "Chernobog_7", "date": "2021-05-18 02:38:33", "content": "Is the Nikon F worth it? /!/ I have the nikon FM but i would love to own this one as well. For now im just judging looks, i assume pre -----> AI !!!  lenses are worst but other than that is the body worth it?", "link": "https://www.reddit.com/r/photography/comments/nez0vh/is_the_nikon_f_worth_it/"}, {"autor": "Chernobog_7", "date": "2021-05-18 02:21:00", "content": "Is the nikon F worth it? /!/ I have the nikon FM but i would love to own this one as well. For now im just judging looks, i assume pre -----> AI !!!  lenses are worst but other than that is the body worth it?", "link": "https://www.reddit.com/r/photography/comments/neyo8y/is_the_nikon_f_worth_it/"}, {"autor": "jupetoh", "date": "2021-06-02 17:54:11", "content": "Workflow question regarding p/s, gigapixel /!/ Am I correct in this workflow understanding:\n\n- Photoshop super resolution is best used at the start of a raw workflow (outputs a dng)\n\n- Gigapixel -----> AI !!!  is best used at the end of a workflow (doesn't output a raw format)\n\nSo for a heavily edited image, I guess super resolution would be preferable? Even if it means larger working files?", "link": "https://www.reddit.com/r/photography/comments/nqrtzt/workflow_question_regarding_ps_gigapixel/"}, {"autor": "Comprehensive_Row914", "date": "2021-06-12 10:59:02", "content": "New business here🙋‍♂️ /!/ Hey there! Welcome to my service store!\n\nWhenever you use -----> AI !!!  to remove the background of your photo, it usually messes up since it leave a couple of marks from your original background. Erasing the background manually would also take forever for you and you definitely don’t want to waste hours erasing every pixel. \n\nThat’s why I am here to help! If you need or want to remove the background of any of your photos and/or add a green screen, then you are at the right place :D I am providing a service where I can remove the background of your photo manually to make it look neat and I can also add a green screen to your photo. \n\nI will charge:\n$0.99 for erasing the background\n$1.19 for erasing the background and adding a green screen\n\nIf you are interested in my service, email me your photo here: moeasim07@gmail.com\n\nPLEASE NOTE: If there is hair in your photo, then it might be a little bit messed, since I erase the background manually but I will definitely try my best :D. I will accept PayPal payments and I will email you my PayPal :D", "link": "https://www.reddit.com/r/photography/comments/ny470u/new_business_here/"}, {"autor": "shitcointrader", "date": "2021-08-05 04:42:40", "content": "How to recreate this photo /!/ Hi All,\n\n&amp;#x200B;\n\nI would like to seriously get into portrait and lifestyle photography, and want to recreate this image I have attached. Would appreciate pointers.\n\n&amp;#x200B;\n\nI have a similar cruiser motorcycle and being a native Londoner I know lots of cool backdrops in mind already and think I could make a really cool picture.\n\n&amp;#x200B;\n\nI am wondering if I can get this sort of image using a 48MP mobile phone camera? I would rather not invest in an expensive DSLR as I do not have anyone to help me take photos.\n\n&amp;#x200B;\n\nShould I use Pro mode or let the phones -----> AI !!!  sensor automatically judge and than use an editing software afterwards which I presume I would need anyway.\n\n&amp;#x200B;\n\nAre there direct filters available that get this affect in one of the big software packages, or will I need to do something else?\n\n&amp;#x200B;\n\nThanks for reading!", "link": "https://www.reddit.com/r/photography/comments/oyab4h/how_to_recreate_this_photo/"}, {"autor": "krishnivas", "date": "2021-09-05 00:04:21", "content": "Do photo editing programs make use of discrete graphics? /!/ I’m currently planning to get a new computer mainly for photo editing purposes. I knew that in the past Lightroom did not use the power of discrete gpu. So my question is, does Lightroom or Capture One or Luminar -----> AI !!!  use take advantage of discrete gpu? If they don’t, I’m planning to get the M1 Air or Samsung Galaxy Book Pro and if they do, I need to look for one with discrete gpu.\n\nAny help in this regard is greatly appreciated.", "link": "https://www.reddit.com/r/photography/comments/pi2l8r/do_photo_editing_programs_make_use_of_discrete/"}, {"autor": "papatonepictures", "date": "2021-09-22 18:18:47", "content": "Made a “Living Portrait” by comping -----> AI !!!  with vintage wedding photo in Premiere. Super easy…could add value for your client packages, or be a service you offer independently.", "link": "https://www.reddit.com/r/photography/comments/ptdkcp/made_a_living_portrait_by_comping_ai_with_vintage/"}, {"autor": "Denis_withanA", "date": "2021-10-11 04:54:53", "content": "Hey!😃 Eu cu echipa mea am creat un video foarte fain despre EMPATIE în cadrul unui concurs și avem nevoie de cât mai multe like-uri ca să câștigăm!🏆 -----> Ai !!!  link către video mai jos👇👇👇", "link": "https://www.reddit.com/r/photography/comments/q5ojbf/hey_eu_cu_echipa_mea_am_creat_un_video_foarte/"}, {"autor": "jpgnicky", "date": "2021-08-23 03:58:19", "content": "hiii what's the difference between Luminar -----> AI !!!  vs. Pixelmator Pro? /!/ trying to escape Adobe Suite and finding replacements for Photoshop &amp; Lightroom.", "link": "https://www.reddit.com/r/photography/comments/p9rya3/hiii_whats_the_difference_between_luminar_ai_vs/"}, {"autor": "tjm003", "date": "2021-10-25 21:34:30", "content": "Best Image Organizing Software/app for 100,000+ image library /!/ I'm looking for a Mac friendly service or app that can organize a massive library of images (jpeg, png, tiff, GIF, mp4 friendly)\n\n[Eagle.cool](https://Eagle.cool) is NEAR perfect for what I need but does not have an autotag/ -----> AI !!!  tag feature. Since I have so many photos hand tagging is too tedious - so an AI tag feature is necessary. As well as being able to store GIFs and videos along with photo.\n\nMost services I'm finding or being recommended are a DAM service that is mad expensive, $12,000 annually (Canto LOL) so I'm not sure that is necessary but if anyone had any insight on DAM services that weren't more than $500 annually that would be great too. ( DigiKam, Bynder have tried)\n\nAlso, not needing services that provide photo editing.\n\nLightroom was an option but cannot store GIFs. If anyone has any recommendations that would be great!", "link": "https://www.reddit.com/r/photography/comments/qfr0hm/best_image_organizing_softwareapp_for_100000/"}, {"autor": "bootsbarley", "date": "2021-10-25 21:28:04", "content": "Best Image Organizing Software/app for 100,000+ image library /!/ I'm looking for a Mac friendly service or app that can organize a massive library of images (jpeg, png, tiff, GIF, mp4 friendly) \n\n[Eagle.cool](https://Eagle.cool) is NEAR perfect for what I need but does not have an autotag/ -----> AI !!!  tag feature. Since I have so many photos hand tagging is too tedious - so an AI tag feature is necessary. As well as being able to store GIFs and videos along with photo.\n\nMost services I'm finding or being recommended are a DAM service that is mad expensive,  $12,000 annually (Canto LOL) so I'm not sure that is necessary but if anyone had any insight on DAM services that weren't more than $500 annually that would be great too. ( DigiKam, Bynder have tried)\n\nAlso, not needing services that provide photo editing. \n\nLightroom was an option but cannot store GIFs. If anyone has any recommendations that would be great!", "link": "https://www.reddit.com/r/photography/comments/qfqvn1/best_image_organizing_softwareapp_for_100000/"}, {"autor": "PanBoiAsh", "date": "2021-05-26 14:09:01", "content": "Am I The Only One Annoyed With Colorized Photos? (Mild rant) /!/ First off I don't mean this to be an attack on artist who colorize photos; the work you do is beautiful and awe inspiring.\n\nThat being said, I was watching a video showing a street photo from every year from 1838 to 2019, and right when it with the 20th century, suddenly the photos became colorized and I had to stop. This annoyed me for 2 reasons: The first is that it creates a mental dissociation between the end of the 19th and beginning of the 20th century, when its not like things magically changed overnight. Secondly, the process of artists inserting their own interpretation of the world onto what was already there. It is not documentation, it's a painting. This is the heart of what has always bugged me about colorized photographs; they aren't true reflections of the real world and they fool us into thinking they are. Now, I would like to say that yes, I understand that there are new ways of colorizing images using -----> AI !!!  to separate out the different wavelengths of light colorize it that way. While this process annoys me slightly less as human painted ones, it still does.\n\n&amp;#x200B;\n\nDoes anyone share this opinion or is it just me? I'm genuinely curious.", "link": "https://www.reddit.com/r/photography/comments/nlhx89/am_i_the_only_one_annoyed_with_colorized_photos/"}, {"autor": "IchoTolotos", "date": "2021-07-02 17:24:31", "content": "Luminar -----> AI !!!  worth it? /!/ Hey guys! \n\nI‘m a filmmaker, not a photographer. I just got an ad for like 20% off on Luminar AI and took a look at the feature set. It seems really cool. \n\nI won’t even go into the whole “art” and “where does it stop” debate. I just want to pimp some photos for the fun of it. \n\nAre the advertised features really working, and seamlessly? Does anyone have experience with Luminar AI?\n\nI’d love to hear from your experiences :)\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/ocetlx/luminar_ai_worth_it/"}, {"autor": "daaaaamnsheshot", "date": "2021-06-26 00:48:45", "content": "Realistic re-lighting of profile photos with green-screened backgrounds? /!/ Hi,\n\nare there any ways of achieving realistic re-lighting of profile photos with green-screened backgrounds similar to this?\n\nGoogle’s New -----> AI !!!  Puts Video Calls On Steroids! - [https://www.youtube.com/watch?v=SEsYo9L5lOo](https://www.youtube.com/watch?v=SEsYo9L5lOo)\n\nMany thanks!", "link": "https://www.reddit.com/r/photography/comments/o80g2t/realistic_relighting_of_profile_photos_with/"}, {"autor": "potatowoman", "date": "2021-09-18 12:48:52", "content": "Does anyone know if it is possible to upscale/increase the resolution of an image which is already over 150MB large? /!/ I have been looking into -----> AI !!!  upscaling but it only applies to small images it seems - not sure what to do to make a big file less blurry. \n\nFor anyone curious why the large format it is wrap artwork for a building.", "link": "https://www.reddit.com/r/photography/comments/pqltoj/does_anyone_know_if_it_is_possible_to/"}], "name": "Subreddit_photography_01_01_2021-01_11_2021"}