{"interestingcomments": [{"autor": "Goggi-Bice", "date": "2018-09-11 18:54:35", "content": "For all the hate Canikon get for their -----> ML !!!  bodies, their lenses are more promising than what Sony is offering /!/ Im not a Body person anyway, but i get that the first gen. bodies arent what people wanted to have, mainly because the one card slot. For me though, the lenses is what sells the brand/system and in that regard, Canikon have the better stance. A standard zoom with f2.0 and an 50 f0.95 is just insane !", "link": "https://www.reddit.com/r/photography/comments/9f0aey/for_all_the_hate_canikon_get_for_their_ml_bodies/"}, {"autor": "GreenGeese", "date": "2018-04-17 16:40:30", "content": "Can we talk Anamorphic stills? /!/ Hi Friends,\n\nI really enjoy trying new/old photo techniques. My newest fascination is anamorphic portraits and landscapes. I've been doing lots of research but I was hoping some of the pro's could offer some real-life advice on what I should expect. I've done a fair amount of reading across the web and on /r/anamorphic but maybe there's something that you've encounter that's not been brought up.\n\n.\n\nHere's my strategy:\n\nI'm selling my Gen 1 Nikon 70-200mm f/2.8 to finance this project (will upgrade that lens at a later date).\nI'm using an already-owned Nikon D810 with (eventually) a [nikon 85mm f/2 -----> AI !!! -S](https://kenrockwell.com/nikon/85f2ais.htm) . Then I plan on using an Isco (either mini or not) 2x anamorphic lens on top of that, preferably with a screw-less attachment system. \n\nFrom what I can tell, that would be all I needed to get started. Am I wrong?\n\nSo here are my questions...\n\n1) Can I practically use this setup handheld? Is it sturdy enough to walk around with or should I only attach the Isco when I'm ready to use it? I've seen some complex follow-focus setups with custom tripod mounts that seem really daunting.\n\n2) How convenient are the single-focus systems? They are roughly another $500 investment to implement. Does it save that much time? It seems like an overklll purchase for stills but I can see why for video it would be really great for workflow.\n\n3) Because anamorphic lenses really shine at wide-open apertures, is it worth investing in a screw-on filter mount for the front-end? \n\n4) Am I being an idiot for not just buying a flare filter and letterboxing my images in post?\n\nThanks ya'll. I'm excited to try this but I'd love any advice you can offer. Cheers!", "link": "https://www.reddit.com/r/photography/comments/8cxyjr/can_we_talk_anamorphic_stills/"}, {"autor": "Threethreefivee", "date": "2018-03-30 15:11:11", "content": "What does everyone think about this Arsenal -----> AI !!!  device? /!/ They must have taken all the kick starter money and put it in to Instagram and Facebook advertising because that thing is everywhere lol. \n\nAs someone with limited time the focus stacking and multiple exposure workflows spark my interest, but I already know how to my camera so it doesn’t do much else for me. \n\nAnyone with a deeper knowledge of mechanics care to share their opinions? ", "link": "https://www.reddit.com/r/photography/comments/88b1fo/what_does_everyone_think_about_this_arsenal_ai/"}, {"autor": "[deleted]", "date": "2018-03-12 07:47:28", "content": "An -----> AI !!!  Photo Enhancer - DSLR quality photos from low-quality images. /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/83t9i0/an_ai_photo_enhancer_dslr_quality_photos_from/"}, {"autor": "Jennifer_go1", "date": "2018-02-01 03:43:35", "content": "-----> AI !!! -powered automatic adjustment to capture amazing images in any conditions, store data &amp; share instantly?", "link": "https://www.reddit.com/r/photography/comments/7ufxri/aipowered_automatic_adjustment_to_capture_amazing/"}, {"autor": "guanaco55", "date": "2018-04-07 17:54:06", "content": "-----> Ai !!! n't No Mountain High Enough: Oregon Field Guide Photographer Todd Sonflieth Likes To Climb Things", "link": "https://www.reddit.com/r/photography/comments/8ajriv/aint_no_mountain_high_enough_oregon_field_guide/"}, {"autor": "Caoji", "date": "2018-04-15 20:56:22", "content": "Proofread my tutorials /!/ Hey guys,\n\nI wrote some tutorials for a very specific community, as it may needs some help on getting somehow into photography, even for a short period. This is something that would have helped me when I started this is why I've done it. So, if you can help me correct any kind of issues, or add/delete anything, please do. This is actually longer than I expected so ... thanks if you read it, even a bit.\n\nSome context clarification, this is a [fansign](https://youtu.be/80AlcdW3FoM?t=1m19s), this is a [fanmeeting](https://youtu.be/25ioUx_whlg?t=5s), and well, dance performance and concert are pretty self explanatory.\n\n_____\n\n    **[TUTORIAL] CAMERA GEARING GUIDE FOR K-POP – BASIC NOTIONS BEFORE BUYING (PART 1/3)**\n\nThis is the first part of different tutorials on camera gearing for K-Pop related uses. I’ll start by focusing on the different notions that you have to know to understand the settings and the features of a camera. This will help you decide which camera might be the one for you, and how to use it.\n\nDisclaimer: I’m not a specialist, but I have done a lot of research to get my stuff, and I’ve made mistakes by the past, so I’m here to help you guys avoid those.\n\n    Camera gear vocabulary\n\n* DSLR: This term is used to point at the bulky black camera you usually see. Those are the most commons I would say, and you usually can detect them by the distinct sounds they make when taking a picture. We can also call a camera, a body.\n \n* Mirrorless: A camera is considered mirrorless when it got … no mirror. This is the thing that makes the sound and take the picture in a DSLR. In a mirrorless system, everything is dealt with electronics. They are smaller in general, feel less tough, but image quality wise, no major difference with DSLRs.\n \n* Full Frame: Regardless of body type, a camera is also distinguished by its sensor. The full frame type got the biggest sensor for the SLR fragment. Full frame sensors are usually seen in high end cameras.\n \n* APS-C: This kind of camera got a smaller sensor than a full frame one. A coefficient is usually used to get the full frame equivalent (x1.6 for Canon and x1.5 for Nikon and Sony, meaning a full frame sensor is 1.6 bigger than the Canon APS-C one). Most of entry level and mid-level cameras are using APS-C sensors. The kind of sensors will have mainly impacts on two things:\n \n * Light: there will be more luminosity gathered in a full frame camera. More light = better picture. For instance, a lens that has a f-stop of f/2.8, will have an equivalent of f/4 on an APS-C body. (2.8 * 1.6 = 4.5). Using the same lens will have different results depending on the camera used, solely based on sensor size.\n * Range: at the same distance, when looking at something, the aps-c user will get a tighten view. It means, that if the full frame user wants to get the view of the APS-C user, he’s gonna have to move forward quite a bit. This is why people are reffering to different range on APS-C sometimes, for instance, a 70-200mm lens is gonna have an equivalent of 112-320mm for APS-C user. However, all the lenses range are based on full frame, even the ones only compatible for APS-C.\n\n* MFT: For micro four third, or 4/3, is another type of sensor which is twice smaller than one of a full frame, so the crop factor (ratio) is x2. It’s a sensor usually seen in mirrorless cameras. I will not talk much about those because they are lacking in low light which is needed for K-Pop in general.\n \n* kitLens: This white thing on the picture, is a lens. This is what you need to attach to the body so it can capture photos. The quality of a photo will depend on the lens first, then on the camera. This is why, if you have to invest in one thing, it’s the lens.\n\n* Focal lenght: This is the range of a lens basically. The higher the number, the closer you can look at something without moving. As a point of comparison, the human eye got a range of around 42mm.\n\n* Zoom lens: When a lens got a variety of focal lenght, it’s a zoom lens, it means that it can go from one range to another.\n \n* Prime lens: Or fixed range, is to determine a lens that can’t change its range … There are pros and cons to use either prime or zoom tho … I would recommend zoom because of versatility.\n \n* Aperture: It’s the opening inside a lens that let the light go through. A big aperture (or wide to be precise) will let through more light. The aperture can also be called f-stop, and is mentionned on the lens by “f/xx”, xx being a number. You can have lenses with fixed aperture (ex: f/2.8) or variable aperture (ex: f/3.5-5.6). The lower the number, the bigger the aperture. A wide aperture lens tend to be more expensive as light is a very important feature in photography.\n \n* Image stabilization: This is a feature on lens (and on mirrorless bodies) that appease the natural shake of your hands when taking pictures, this is very interesting feature, because if you don’t have it, you are gonna have to increase the shutter speed to compensate, so less light.\n\n* Shutter count: This is the number of shots a camera can take before being subject to failure, it’s some kind of approximate lifespan. Most DSLRs got between 100 000 and 150 000. It doesn’t mean that it gonna stop working once this number is reached, just that it’s most likely to fail than a new one. If you are buying used gear, you have to check for this. (high shutter count = lower price)\n\n* Viewfinder: It’s where you put your eye to see through the lens. You also have a diopter close to it, that you can adjust to see more clearly. (so people with glasses can shoot without them), since the diopter will simulate the correction of the glasses.\n \n* Liveview: There is a button dedicated to activate that, it’s so you can view through the lens on the back screen of the camera instead of the viewfinder. Certain features of your camera will change when it’s in liveview (for instance, the Canon 1DX Mark II got 16fps in liveview compared to the usual 14fps).\n \n\n         Camera settings vocabulary\n\n* ISO: This is the light sensitivity. When you go up, the image get brighter, but noise increase as well. So, it’s about finding the compromise. We call base ISO, the lowest your camera can go, in a lot of photo dslr, it’s 100.\n \n* White balance: It’s the colors of the photo, expressed with numbers. Go toward 0 and the photo get colder, more blue-ish, go toward 9999, and the photo get warmer, more reddish. It’s a camera settings that you shouldn’t bother too much about, it can easily be changed afterward in post process.\n \n* Shutter speed: It’s the time the sensor of the camera stays open to capture the light. The longer it stays, the more light it captures, but since it doesn’t stop time … if things move (enough) during the trigger, things can get blurry. So, the settings have to be different depending on what the subject is doing. Dance performance ? It has to be faster, so you can freeze the moment like this. You can see that the hair is not blurry, so the speed was appropriate. However, in this picture, Chaeyeon wasn’t moving fast enough so it’s ok, but Heehyeon’s hand was faster, so it appears blurry. To avoid confusion, 1′ is one second, 1/30 is one thirthyth of a second, and 1/400 is one four hundredth of a second,so 1/30 is longer than 1/400.\n \n* RAW: Like the name suggest, this is the pure file without any kind of alteration. A raw file will have a lot of information saved within it, so it will be easier to process later on. However, because of all the data, a raw file is heavier. I suggest you to capture Raw in any case.\n \n* Focus: It’s pretty self explanatory, the focus is when you target an element so that your camera know what to shoot, and your target appears sharp. For instance, in this picture, I focused on Yoohyeon so she appears more sharp than Sua, who is more blurry. It’s very important to hit your focus right, otherwise, it will ruin your pictures. In general, put your target in the middle of the screen, with experience, you can direct the focus with precision.\n \n* Focus mode: In a camera, you have different mode to what you want to capture, moving subject or still subject ? Either way, I would suggest you to choose the moving subject focus mode, called -----> AI !!!  Servo on Canon and AF-C on Nikon (I don’t know about others).\n \n* Framerate: or FPS is the frame per seconds in which you record a video. 30FPS, 60FPS, 120FPS, etc. This will impact the smoothness of a video. You need at least 24FPS so the eye can track and understand motions, lower and it will look ugly as fuck. 60FPS is a sweet spot for dance performance. Here is a comparison, the 60FPS of God dancing, and the not-60FPS video of God dancing, so yeah, the 60FPS looks smoother but not all cameras can do that.\n \n* For photos, the FPS refers to the speed you can take pictures in a chain (also called FPS continuous shooting), for instance, this dude is showing the speed of his camera. As a reference the Canon 80D got 7fps which is good.\n \n* Buffer size: This is the numbers of photos you can take before your camera slow down. (for Sony, they stopped entirely, waiting) The photos have to write themselves on the storage, and this take some times, thus this buffer size notion. It depends on the speed of your camera and the memory card used. You can shoot longer depending on the file chosen (since jpeg file weight less). Here is an example of a guy filling the buffer size on his 80D. Something along 10/15 for Raw is quite standard, higher end cameras can shoot longer.\n \n* Bitrate: This is a number that defines the flow of data when recording a video. The higher the number, the higher the data, consider this data as details. So, if the video has a high bitrate like 100 MBps (megabytes per second), the video will be more detailled, better quality. High bitrate = high storage needed.\n\n\n           Photo vocabulary\n\n* Noise: When a picture looks grainy, it’s noise… This thing appears when it’s lacking light in general. Example.\n \n* Sharp: We call a picture sharp when there is no blur, when we can see all details, and everything is pretty and shit. Sharp = clear. Here is a sharp photo of God.\n \n* Soft: When it’s not sharp, it’s soft. It’s usually a bit blurry, it doesn’t mean that the photo is bad but sometimes, softness can’t be avoided because of lens, environment, etc. Here is an example. Soyeon is in focus (more or less…), however, it’s not sharp because of gear and light. Usually, when you want to reduce noise, you introduce softness, it’s about a compromise, how much softness and noise you want in your picture.\n \n* Bokeh: It’s the background blurr, how isolate is your subject from the background. Example. You can see that Qri is sharp but we can’t distinguish the leaves behind her. The bokeh, also related to the notion of depth of field, is affected by the focal lenght, and the aperture.\n\n* Megapixels: This is the resolution of a camera. For instance, 24 megapixels (mpx) is 6000×4000 resolution on a computer. (6000*4000=24M). Usually, something around 20 is more than enough to get good looking pictures. Having higher will allow you to crop better tho, but that comes to a price.\n\n\n        **[TUTORIAL] CAMERA GEARING GUIDE FOR K-POP – GEAR ADVICES AND RECOMMENDATIONS (PART 2/3)**\n\nIf you are willing to shoot photos or videos of your idols and invest in an appropriate camera gear, this guide will help you decide.\n\nFirst thing is to decide the budget you want to use, then the type of things you want to do (photo, video or both ?). Note: camera gear is really expensive.\n\nIf you want to get pics like the usual fansites, be prepared to invest quite a lot. You often see those Canon white lens ? Well, it costs that much. However, do you need this to get quality photos or videos ? Well, not necessarily, there are alternatives.\n\nI will mostly focus on full frame and APS-C cameras, as MFT and point and shoot cameras are not perfectly suited for K-Pop as you usually need range and low light capabilities, that those two are lacking.\n\nFirst of all, the brand you are choosing, I’m gonna stick to three, as I consider them to be the most suitable for what we shoot.\n\n* Canon:\n * Decent camera bodies, with decent performance in photos and videos\n * Good variety of lenses\n * the most used in general, so easier to get used stuff at good price\n* Nikon:\n * Better camera bodies than Canon, better value at least\n * Lenses are not as good as the Canon counterpart in general\n * Bad for videos because of the focus\n* Sony:\n * recent mirrorless cameras has been really good, for both photos and videos\n * low variety of lens, you can’t go over 200mm easily\n * Lenses are really expensive, but camera bodies are ok\n\nThose are the brands for cameras, they also make their own lenses (native lens), but there are also other brands that can make lenses for those systems, they are called third parties manufacturers. You mostly have to care about Sigma and Tamron as for now.\n\n    General tips\n\n* Used cameras: you have to look for the shutter count.  The higher the shutter count, the lower the price, obviously, but you shouldn’t buy a camera that has a too high count. Under 30 000 would be pretty decent while providing a good discount on the price. If it’s too high, you might have to include the cost of renewing the shutter, but it’s another step and hassle. (cost varies depending on cameras)\n \n* Warranty: we called grey market, any product coming from export (usually asia). Those products are cheaper (even brand new), but if something happens, it’s gonna be harder for you to claim warranty. I would suggest to buy grey market lens but stick to classic market bodies (buy the camera in an approved retailer in your country for instance). Well, the product is the same, so it’s up to you, is the price gap worth it ? Personally, all my gear is grey market.\n \n* Kit lenses: in general, avoid them, I’m talking about the 18-55mm you usually get with your cameras. This lens is gonna be useless for K-pop and the quality is usually bad. I would suggest you to buy a prime lens instead (50mm f/1.8 is a good one, regardless of cameras as each brand got their own affordable option). For K-pop uses, 18-55mm is not enough range in general anyway so you don’t need it. Here is a photo I took using my very first set-up with a 18-55mm. (at 55mm range), and here is the zoomed version. On another hand, here is a picture I took using a Canon 50mm f/1.8 STM on a crop sensor, you can see that I’m lacking a bit of range, but the quality is way better. My advise: buy a 70-200mm instead and get yourself a 35mm or 50mm for wider shoot. (as those primes are usually between 100/200€ so quite affordable.)\n \n* Used lens: a lot of lenses, especially the professional ones are built like tanks so they have quite a long lifespan so it’s quite easy to buy a used lens. However, what you have to check is the state of the glass, is it ok ? Check for fungus  and any defect possible, look from one end and the other, is there dust inside ? Also, try the lens if you can, especially the focus system as it can go off if there is an issue inside.\n* \nAccronyms:\n\n* Image stabilization: it got different names depending on manufacturers:\n * Canon: IS = Image stabilization\n * Nikon: VR = Vibration reduction\n * Sony: OSS = Optical steady shot\n * Sigma: OS = Optical stabilization\n * Tamron: VC = Vibration control\n* Lens format: Full frame and APS-C designed lenses got their names as well:\n * Canon: EF for full frame and EF-S for APS-C\n * Nikon: FX for full frame and DX for APS-C\n * Sony: FE for full frame and E for APS-C\n* Quality indicator: for expensive shits\n * Canon: got an “L” after the aperture to indicate professional oriented lens,\n * Sony: G Master serie\n * Tamron: SP for Super Performance\n * Sigma: A = art, S = sport, C = contempory ; it’s the uses for which the lens was designed for\n * Nikon: I have no fucking idea, they don’t have one I think\nThey are also other accronyms but they are less important I would say.\n\n            What to buy beside camera+lens ?\n\n* Batteries: If you are using a DSLR camera, I would suggest you to buy at least one additionnal battery, because if you are shooting non stop during a fansign, you will end low on battery after 2 hours (talking from experience), so just in case, have some safety measure. Also, get official batteries, the third batteries are cheaper but their lifespan is way shorter. When shooting mirrorless, you might need more because the batteries don’t usually last as long as the DSLR counterparts.\n \n* Battery grip: It’s an accessory that you put at the bottom of you camera that brings 2 things. One, is a slot for another battery, your camera will have 2 batteries in it, so you don’t have to change it during a session. Two, is the ease to shoot vertical photos since they are additional commands on a battery grip. This is why for Dreamcatcher London, all my photos are horizontal, but for Dreamcatcher Amsterdam, I have some vertical shots as I have the grip with me. I would also suggest to get official battery grip since it’s linked to the camera system, but it’s expensive as fuck for what it is, it’s up to you eventually. You can still shoot vertically, it’s just not as convenient.\n \n* Memory cards: depending on your cameras, you might need to use SD cards (most frequent nowadays), Cfast cards or XQD. Check that your computer can read those cards, would be sad if you can’t, don’t forget to get an adapter then. For your memory card, you need something that can handle the storage needed, and the speed. For a lot of cameras, the SD card you want needs to have a UHS-I written on it (or U1), it’s a speed norm that quite some cameras have right now. UHS-II is for high-end cameras, so just ignore as it’s not that common anyway. If you’re planning on shooting non-stop during an event, the memory card is gonna have to be handle more, as a reference, for a fansign of 2 hours, with a Canon 80D (which have a good speed and buffer), I have almost 6000 photos for 150GO. However, this is me and I’m an insane shooter, spamming that fucking button. I would recommend 2 64GO cards or a single 128GO card, this is a good start and should be able to handle all your needs.\n \n* Flashes: Clearly not needed in almost all situations, but it might come handy in some rare situations, like airport or exterior night shooting. Do not use them during dance performance, and fansigns, it’s bad etiquette and you’ll probably be asked to get it off or worse, be kicked. Don’t need to buy an official flash (Canon, Nikon, Sony) as they are too expensive for the uses we have, instead, get a third party one that can be as good, like any Yongnuo one. Flash should be the least of your worry anyway. An example for what flash can bring: Handong after the Amsterdam concert.\n \n* Tripod/monopod: A tripod is a stand for your camera to rest, this is an extremly convenient item and I suggest you to buy one if you can, they are especially useful in fansigns. The tripod will allow you to reduce the shake since you don’t have to carry your camera anymore, and it’s more … energy friendly, holding a dslr for hours is tiring, believe me. A monopod has the same purpose but it’s on one leg instead, so, less stable as you can’t just leave the camera there, but you’re more mobile so if you have to move, it’s good.\n\n        What do we need for K-Pop ?\n\nMost of K-Pop events can be either outdoor or indoor, so you should stick to the worse scenarios to base your purchase on, which is : indoor and low light. So you need something that can be used in this situation.\n\n* Aperture: f/2.8 is a good aperture in low light without an inconvenient depth of field, so this should be your go to aperture. f/1.8 or f/2 are also good options but those lenses are not as common beside the prime.\n \n* Focal lenght: 70-200mm should be your go-to lens, it’s an extremly versatile focal lenght and should cover a great part of your needs. In very rare situation, where you are really close, a 35mm prime should be great to compensate or a standard zoom (24-70mm). This applies for APS-C as well, but you can find  yourself a bit tight by 70 (as it’s about 110mm full frame equivalent), so a wider lens might be needed, although, in most cases, it’s ok. For the Kard showcase, I was at second line, so very close and the 70-200mm on my crop sensor felt a bit tight sometimes, I couldn’t get a full body shot of Somin when she was in front for instance.\n \n* Extra focal lenght: In some situations, 200mm may not be enough, for instance if your seat is far in a fansign, or during a dance performance. There are two options:\n \n * Extender: It’s something you put between the camera and the lens, they usually increase the range by 1.4 or 2. However, there will be a degradation of the image quality, and if you are using a 1.4 extender, you will lose one stop of ligt (f/2.8 to f/4, f/4 to f/5.6, etc.). The focus speed will also be slower.\n * Another lens… Sigma 150-600mm , Nikon 200-500mm, Tamron 150-600mm should be the main ones unless you have thousands of euros, then go for prime telefoto lens, but it’s above my knowledge (considering that a lens can go over 6000€ so …).\n\n* ISO performance: You are gonna need a camera that can get a maximum ISO of at least 6400, because in dark environment (concert room for instance), you’re gonna reach that maximum…\n \n* Video: Something that can film 1080p at 60FPS is a sweet spot, most cameras can do 1080p 30fps so it should be fine, but if you’re aiming to get fancams, over photos, 60fps is needed. Unless you go 4k 30fps, but getting into 4K is more expensive.\n\n        Camera Bodies recommendations\n\nI will focus most likely on APS-C and full frame bodies, and all the price will be new and grey market, and without the kit lens. So you’re gonna have to adjust the price for your country if don’t want grey market (add something like 20/25%). Also, you are gonna have to do your own research, i’m just leading you on a path, as they are more to just what I show there.\n\n \n\n\nCanon 60D :\n270€\nAPS-C / 18mpx / 5.3fps / 1080p 30fps / 9 focus points\n\nCanon 750D:\n430€\nAPS-C / 24mpx / 5fps / 1080p 30fps / 19 focus points\n\nCanon 800D:\n560€\nAPS-C / 24mpx / 6fps / 1080p 60fps / 45 focus points / dual pixel\n\nCanon 6D: \n830€\nFull frame / 20mpx / 4.5fps / 1080p 30fps / 9 focus points\n\nCanon 80D:\n690€\nAPS-C / 24mpx / 7fps / 1080p 60 fps / 45 focus points / dual pixel\n\nCanon 7D Mark II:\n950€\nAPS-C / 20mpx / 10fps / 1080p 60fps / 69 focus points / dual pixel\n\nCanon 6D Mark II :\n1300€\nFull frame / 26mpx / 6.5fps / 1080p 60fps / 45 focus points / dual pixel\n\nCanon 5D Mark IV:\n2400€\nFull frame / 30mpx / 7fps / 4k 30fps (cropped) / 61 focus points / dual pixel\n\nCanon 1DX Mark II:\n4300€\nFull frame / 20mpx / 14fps / 4k 60fps / 61 focus points\n \n\n\n\nNikon D3400:\n320€\nAPS-C / 24mpx / 5fps / 1080p 60fps / 11 focus points\n\nNikon D5600:\n460€\nAPS-C / 24mpx / 5fps / 1080p 60fps / 39 focus points\n\nNikon D610: \n890€\nFull frame / 24mpx / 6fps / 1080p 30fps / 39 focus points\n\nNikon D750:\n1200€\nFull frame / 24mpx / 6.5fps / 1080p 60fps / 51 focus points\n\nNikon D500:\n1350€\nAPS-C / 21mpx / 10fps / 4k 30fps (cropped) / 153 focus points\n\nNikon D810:\n1700€\nFull frame / 36mpx / 5fps / 1080p 60fps / 51 focus points\n\nNikon D850:\n2900€\nFull frame / 45mpx / 7fps and 9fps with battery grip / 4k 30fps / 153 focus points\n\n\nSony A7 III:\n2200€ – retail price, not grey market as it’s a very recent camera\nFull frame / 24mpx / 10fps / 4k 30fps / 693 focus points\n\nSony A7R III:\n2800€\nFull frame / 42mpx / 10fps / 4k 30fps / 399 focus points\n\nSony A9:\n3500€\nFull frame / 24mpx / 20fps / 4k 30fps / 693 focus points\n\n    Lenses recommendations\n\nIn general, a full frame lens will work on an APS-C body, (although you won’t get the same range because of the crop factor), but the other way around won’t work well. If it does, you will have some serious quality drop so, is it worth it ?\n\nThe lenses I recommend, all prices will be new, and grey market, so you might notice some differences, and buying a lens used isn’t an issue at all: (sorted from cheaper to out of mind)\n\n* Canon EF-S 55-250mm f/4-5.6 IS STM:\n * 150€ (Only get the STM version, the previous ones are dipshit)\n * insane value for the buck and very good range overall\n * only compatible with Canon APS-C cameras\n \n* Tamron SP 70-300 f/4-5.6 Di VC USD: \n * 260€\n * Good range and value for its price\n * In either Canon, Nikon or Sony version (+30€)\n\n* Nikon 55-300mm f/4.5-5.6 ED VR:\n * 230€\n * Good range and value, although more expensive than the Canon counterpart\n * Only for Nikon APS-C\n\n* Tamron 100-400mm f/4.5-6.3 Di VC USD: \n * 570€\n * Good range overall, with decent quality and value\n * it’s lacking indoor because of the aperture but at this price point, not much possible at this range\n\n* Tamron 70-200mm f/2.8 Di VC USD (also called G1 or A009): \n * 680€ (Do not get the macro version, it’s utter bullshit)\n * good value, good performance\n * compatible with either Canon, Nikon or Sony\n\n* Sigma 150-600mm f/5-6.3 DG OS HSM C:\n * 700€\n * Long telefoto lens, very good value for the range it can reach\n * It shouldn’t be used for under 300mm, you should just get a 70-200mm instead\n * in either Canon or Nikon mount\n\n* Tamron 70-200mm f/2.8 Di VC USD G2 (A025):\n * 1000€\n * good value, performance is almost equal to the native lens\n * in either Canon or Nikon edition\n\n* Nikon 200-500 f/5.6E ED VR:\n * 1000€\n * Good value, with good focus overall\n * fixed aperture, nice on a long range telefoto lens\n\n* Canon EF 70-200mm f/2.8L IS USM II:\n * 1400€\n * worse value than the tamron one, but better at long range and slightly faster focus speed\n * the classic white lens you see everywhere\n\n* Sony FE 70-200 f/4 GM OSS: \n * 1400€\n * The cheap alternative for Sony xD\n * Lens is good despite the f/4\n\n* Canon EF 100-400 f/4.5-5.6L IS USM II: \n * 1500€\n * good range, ok value, image quality is not as good as the 70-200 f/2.8 but compensate with the extra range\n * because of the aperture, it kinda sucks in low light, but it should do ok in fansigns and outdoor fanmeeting\n\n* Nikon 70-200 f/2.8 ED VR II: \n * 1700€\n * Nikon native lens for this range, all the previous version are obsolete compared to the tamron version\n * worse value than the tamron one for not an actual better option but if you want proprietaire option, it’s this one\n\n* Canon EF 28-300mm f/3.5-5.6L IS USM:\n * 1700€\n * It’s an extremly versatile lens, but at the cost of image quality, but at least, you won’t need any other lens. It’s still an L lens, so quality is enough in most situation.\n * The wide end is very so-so\n\n* Sony FE 70-200mm f/2.8 GM OSS:\n * 2000€\n * not much possibilities with Sony cameras, lens is excellent though\n\n* Sony FE 100-400 f/4.5-5.6 GM OSS: \n * 2200€\n * If you want to reach past 200mm, you don’t have much choice with Sony\n\n* Sigma 120-300mm f/2.8 DG OS HSM:\n * 2800€\n * Really good range, especially at f/2.8\n * really heavy and expensive, and not as sharp as the 70-200mm but image quality is still nice\n * Canon or Nikon option\n\n* Sidenote: For Sony bodies, you can use a converter to get Canon mount lenses on the Sony bodies, you don’t lose much on image quality, but the issue is focus speed as it’s not as reliable, also, it can varies quite a bit from a lens to another. Look for Metabones speedboosters and Sigma converter.\n\n        Tripod recommendations\n\nAnything that that suit all the below characteristic :\n\n* it can reach your eye level while being seated\n* it can withstand twice the weight of your heavier camera set up\n* is aluminium (because cheaper)\n* you shouldn’t go over 150€, and a lot of good options around 100€\n\nThe manfrotto befree is quite popular, really light, good enough height, and can support 4KG, which is enough for a 70-200mm set up.\n\nFor anything standing, I would suggest a monopod, some tripod can have some leg converted as a monopod, so, why not. Also, you can just stick to a monopod, instead of a tripod, it’s fine, but I personally like having the option to just leave the camera there. You can also look up for video monopod that can stand on their own but they are quite expensive for the good ones.\n\n    **[TUTORIAL] CAMERA GEARING GUIDE FOR K-POP – SETTINGS, SHOOTING, AND POST PROCESS (PART 3/3)**\n\nThe last part of the camera tutorials will be focused on settings and to use your cameras for what we need.\n\nFirst of all, go and set the camera on M mode, which is the manual mode.\n\n    Camera settings\n\n* White balance: You should just put it on auto. This is one less thing to worry about, as it can change from a scene to another quite frequently, and since it can be easily corrected in post process, it’s ok.\n \n* ISO: In most cases, you should put it on auto as well, however, you can still tune it a bit. You can set a maximum ISO for the auto mode to reach, the max you set is gonna depend on situation. For the dreamcatcher concert, I set it at 8000 max in Amsterdam, because I got some shots at 10 000 in London, and it was too much. Since in a dance performance, the lights are gonna change a lot, auto iso is necessary. For more calm scene, like, in a fanmeeting or fansign, you can fix the ISO yourself for a better control of the image. However, in a fansign, from one member to another, the light can be different so keep that in mind.\n \n* Exposure composition: it’s the black and white +/- symbol combo, in general, it’s best to have a slightly underexposed picture, so you can go to -0.3 to -1, don’t go too much. Letting it at 0 is also fine, this is not a decisive factor in image quality anyway.\n \n* Shutter Speed: You need something fast enough to freeze the moments (no blurr), and something slow enough to let enough light and limit noise. What I use right now:\n \n * 1/125 for posing idols, where the subject will freeze himself for a shot time\n * 1/200 and 1/250 for talking and reaction capture, slow paced stuff in general\n * 1/400 and 1/640 for dance performance, depending on dance, you can also change it, but for Dreamcatcher for instance, I find those two shutter speeds to be in a sweet spot. The hair are sometimes a bit soft on 1/400, this is why I’m also using 1/640 depending on songs.\n\n* Aperture: Always go to the lowest value possible, it’s especially true with variable aperture lens, as it change depending on the range. It can happen to forget to put it back to the lowest. One exception is that you have a really fast lens (below f/1.8) and you are close enough to the subject, you might want to tune it a bit. But considering that f/2.8 is quite the standard, it shouldn’t happen much.\n \n* File: Shoot Raw in priority, and if you are lacking storage … yeah, go jpg. If you have two cards slot, one good option is to shoot Raw on main card and jpeg on second card as you have a back up just in case the main card die. However, this will add a strain on the camera so it will be slower (buffer size), so it’s up to you. I personnaly set my second card on overload option as I want to keep my momentum while shooting.\n \n* Focus mode: depending on the camera, try to get the focus mode dedicated to moving subject, this will help you track the subject across your screen more accurately. Also, choose the largest possible area (highest numer of cross focus points) to focus. In mirrorless, you also have face detect and eye detect, those are good options in general. You might want to try the settings yourself to see what suits you the most.\n\n* Button configuration: In general, to get a photo on a fresh camera, you push the trigger halfway, it focuses, then, you fully push and it shoot. What I find more convenient tho is to configure one button to focus, and let the trigger to shoot pictures, regardless of the focus. You have to choose a conveniently placed button (under the thumb ideally), and that is not important in general, and configure it to AF-ON (autofocus on). On my Nikon, it’s the AE-L button that I decided to switch off. Note: you also have to configure it on the battery grip if you have one and the camera settings propose this option.\n \n* Video settings: I would suggest to shoot at least at 1080p 60fps, but if you can, shoot 4K, even if it’s 30fps. When shooting video, you can change the shutter speed to adapt to the record.\n \n * 25fps = 1/50 / 50fps = 1/100\n * 30fps = 1/60 / 60fps = 1/120\n* Then, the bitrate, if your memory card can handle it, choose the higher bitrate everytime. This will put a strain on your memory card, and the post process since the video will weight more, but better have good quality from the start than regretting it later.\n \n* Shooting mode: You can have different modes: single shot, quiet single shot,  continuous high speed, continious low speed, continuous quiet, delay, bulb. It can be a bi", "link": "https://www.reddit.com/r/photography/comments/8ci67i/proofread_my_tutorials/"}, {"autor": "mgsy1104", "date": "2018-03-02 17:46:42", "content": "Canon’s New Automatic Bounce Flash Speedlite: 470EX------> AI !!! ", "link": "https://www.reddit.com/r/photography/comments/81g2kh/canons_new_automatic_bounce_flash_speedlite/"}, {"autor": "[deleted]", "date": "2018-03-02 17:36:30", "content": "See How the Canon Speedlite 470EX------> AI !!!  Works /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/81fzn3/see_how_the_canon_speedlite_470exai_works/"}, {"autor": "VanCityMac", "date": "2018-11-02 08:46:43", "content": "How do you guys feel about the trend of software/hardware companies bringing -----> AI !!!  to photography and editing? /!/ As a Software Engineer I find it fascinating that AI can be applied to such a broad range of topics but as a person who enjoys photography I am not so sure I like it becoming a standard on more and more tools.  \n\n\nI find some tools really interesting such as [Arsenal](https://www.kickstarter.com/projects/2092430307/arsenal-the-intelligent-camera-assistant-0) as a great way to help people to get into more complex parts of photography for the first time.  \n\n\nOther tools like [Luminar](https://skylum.com/luminar) use AI to apply changes in the editing process. Luminar claims to adjust yo your style so I suppose it could cut down on work needed to get images to have the same feel as others in a set.  \n\n\nThe part of me that loves browsing other peoples work and seeing the personality of each photographer conveyed in their images is worried that this trend will lead to a loss of personal style in images which we already see on platforms like Instagram where you can brows thousands of profiles and see the same colours, the same deep dark greens, and whatever else is trendy at the moment. I do really enjoy the images, but it feels to me like the art of photography is getting lost with more and more tools that promote AI or generic filters and presets that so many people use and leave.  \nI also understand that these tools can help get to a decent starting point for editing but then the editor/photographer can adjust them to make it their own with a bit less effort.  \n\n\nThe other part of me that likes an easy and efficient process sees it as a great way to help professionals cut down on post processing work and help in other aspects of their workflow.  \n\n\nI see the benefit of such tools but I also feel like it could lead to a place where AI will just generate images and people will be passing it off as their work because they pressed a button.  \n\n\nI also know many people will use these tools to help them improve or be more efficient, and probably a large amount of people will not use tools like this because they find joy in making every adjustment or setting reflect their vision for the viewers.  \n\n\nAnyway, what are your thoughts on tools like this and the general trend we are seeing of more and more tools appearing?", "link": "https://www.reddit.com/r/photography/comments/9tia69/how_do_you_guys_feel_about_the_trend_of/"}, {"autor": "xinhkxoan", "date": "2018-12-19 10:23:44", "content": "10 Cách chụp ảnh đẹp này không phải -----> ai !!!  cũng biết", "link": "https://www.reddit.com/r/photography/comments/a7l89i/10_cách_chụp_ảnh_đẹp_này_không_phải_ai_cũng_biết/"}, {"autor": "Advantix-man", "date": "2018-12-19 06:08:03", "content": "Nikon -----> AI !!!  to G lens aperture control ring adapter ? /!/ Is there any type of of adapter or something that can be used to allow aperture control of g lenses on older f mount cameras ? I have an F3 and I also have a 50 1.8 G, but as we all know there’s no aperture control between the camera and the lens because then we’re lenses rely on communication with the lens, is there any sick device that can allow aperture control on newer lenses ? ", "link": "https://www.reddit.com/r/photography/comments/a7jqtq/nikon_ai_to_g_lens_aperture_control_ring_adapter/"}, {"autor": "GrisTooki", "date": "2018-03-24 03:49:22", "content": "A systematic comparison of 49 normal lenses (40-58mm). Includes many vintage Nikon, Mamiya 645, Canon FD, Voigtlander, Olympus, Minolta, Asahi/Pentax, Ricoh, Yashica, Konica, and more. /!/ *EDIT:  I'm about 99% sure that I missed focus with Nikon 50/1.8 G.  I will redo that portion of the test at some point.\n\n\nOver the years I have gradually amassed quite a collection of lenses which, until now, I have never really taken the time to compare.  So with the recent warm-up I decided to take advantage of the nice weather to systematically test the normal lenses in my collection out of both curiosity and a desire to downsize.  I thought you guys might be interested to see the results.\n\nFor this test I set up a tripod approximately 6ft from the brick wall at the corner of my house with wall taking up the left half of the frame and my yard taking up the right (so as to show both the sharpness and bokeh of each lens). To the best of my ability, I made sure that the plane of focus was parallel to the wall and shot away from the sun.  The cameras used were a D800 (for Nikon -----> Ai !!! , -----> Ai !!! -S, and AF-S lenses, as well as Mamiya 645 lenses) and an a7 II (for everything else).  ISO was set between Low (below 100) and 200, depending on lighting.  The photos were imported using Lightroom and minimal adjustments were made for exposure differences (a few photos were obviously underexposed, probably due to user error).  Because these tests were done over the course of an afternoon, there are changes in lighting due to time of day and cloud cover that should be ignored as much as possible.\n\nThe table of my results is here: https://docs.google.com/spreadsheets/d/1d8CCxhR3Iuz8GWyyDHuFX_PUVbECOQrqLA2ZaBKSze0/edit?usp=sharing\n\nAnd the Flickr album is here:\nhttps://www.flickr.com/photos/139290056@N04/albums/72157664989063267/page1\n\nA shot of all the lenses: https://www.flickr.com/photos/139290056@N04/40270599304/\n\nPlease note that the first result in each row is at the maximum aperture, regardless of what the column title is.  In other words, for lenses with unusual maximum apertures f/1.7, the result in the f/1.8 column is actually for f/1.7.\n\n&amp;nbsp;\n\nA complete list of lenses in this comparison:\n\n&amp;nbsp;\n\n&gt;Nikon AF-S Nikkor 24-70 f/2.8 G ED\n\n&gt;Nippon Kogaku Nikkor-H Auto 50mm f/2 Non-Ai\n\n&gt;Nippon Kogaku Nikkor-S Auto f/1.4 Non-Ai\n\n&gt;Nikon Nikkor-S Auto 55mm f/1.2 Non-Ai\n\n&gt;Nikon Nikkor 50mm f1.2 Ai-S\n\n&gt;Nikon Nikkor 50mm f/1.4 Ai\n\n&gt;Nikon Nikkor 50mm f/1.8 Ai\n\n&gt;Nikon Micro-Nikkor 55mm f/2.8 Ai-S\n\n&gt;Nikon AF-S Nikkor 50mm f/1.4 G\n\n&gt;Nikon AF-S Nikkor 50mm f/1.8 G\n\n&gt;Voigtlander Ultron 40mm f/2 SL Aspherical\n\n&gt;Canon FD 50mm f/1.8\n\n&gt;Canon FD 50mm f/1.8\n\n&gt;Canon FD 50mm f/1.8\n\n&gt;Mamiya-Sekor C Zoom 55-110mm f/4.5 N\n\n&gt;Mamiya-Sekor C 55mm f/2.8 S\n\n&gt;Mamiya-Sekor C 55mm f/2.8 S\n\n&gt;Mamiya-Sekor C 55mm f/2.8\n\n&gt;Olympus Zuiko Auto-S 50mm f/1.8\n\n&gt;Olympus Zuiko Auto-S 50mm f/1.8\n\n&gt;Olympus F.Zuiko Auto-S 50mm f/1.8 Silver Nose\n\n&gt;Olympus G.Zuiko Auto-S 50mm f/1.4\n\n&gt;Voigtlander Nokton Classic 40mm f/1.4 MC\n\n&gt;Minolta MD 50mm f/2\n\n&gt;Minolta MD Rokkor-X 50mm f/1.7\n\n&gt;Minolta MD Rokkor-X 50mm f/1.7\n\n&gt;Minolta MC Rokkor-PF 58mm f/1.4\n\n&gt;Minolta MC Rokkor-PF 58mm f/1.4\n\n&gt;Unmarked 50mm f/1.8 Takumar\n\n&gt;Asahi SMC Takumar 55mm f/2\n\n&gt;Asahi Super-Takumar 50mm f/1.4\n\n&gt;Asahi Super-Takumar 50mm f/1.4\n\n&gt;Asahi Super-Takumar 50mm f/1.4\n\n&gt;Asahi Super-Takumar-Coated 50mm f/1.4\n\n&gt;Yashica Auto Yashinon DS-M 50mm f/1.4\n\n&gt;Yashica Auto Yashinon-DX 50mm f/2\n\n&gt;Ricoh Auto Rikenon EE 50mm f/1.4\n\n&gt;Auto Sears / Sekor SX 55mm f/1.8\n\n&gt;Auto Sears 55mm f/1.4\n\n&gt;Konica Hexanon AR 40mm f/1.8\n\n&gt;Konica Hexanon AR 40mm f/1.8\n\n&gt;Konica Hexanon AR 50mm f/1.7\n\n&gt;Konica Hexanon AR 57mm f/1.4\n\n&gt;SMC Pentax-M 50mm f/2\n\n&gt;SMC Pentax-M 50mm f/2\n\n&gt;SMC Pentax-A 50mm f/1.7\n\n&gt;Auto Sears MC 50mm f/1.7\n\n&gt;Ricoh Rikenon P 50mm f/2\n\n&gt;E. Ludwig V Meritar 50mm f/2.9\n\n", "link": "https://www.reddit.com/r/photography/comments/86qo3u/a_systematic_comparison_of_49_normal_lenses/"}, {"autor": "ResoStrike", "date": "2018-02-26 04:23:52", "content": "470ex -----> AI !!!  \"auto-bounce\" demo from B&amp;H", "link": "https://www.reddit.com/r/photography/comments/80a9ho/470ex_ai_autobounce_demo_from_bh/"}, {"autor": "AllegedSleazebag", "date": "2018-05-09 13:37:01", "content": "Learning to See in the Dark (shocking video demo of -----> machine learning !!!  pipeline for low light image processing)", "link": "https://www.reddit.com/r/photography/comments/8i60xz/learning_to_see_in_the_dark_shocking_video_demo/"}, {"autor": "macmyth1", "date": "2018-05-12 17:58:11", "content": "Google Duplex: An -----> AI !!!  System for Accomplishing Real-World Tasks Over the Phone /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/8ixq3c/google_duplex_an_ai_system_for_accomplishing/"}, {"autor": "Wander54321", "date": "2018-06-26 03:44:32", "content": "Shutter Priority in -----> AI !!!  Servo Mode in Canon 5D Mark II /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/8twuu0/shutter_priority_in_ai_servo_mode_in_canon_5d/"}, {"autor": "ZoidbergRage", "date": "2018-07-28 22:59:43", "content": "I worked as a photographer at a sports camp for two weeks and this is what I learned /!/ Hello everyone, I just got back from working at the National Ultimate Training Camp as a photographer for the past two weeks. I learned a lot about what makes good sports photography as well as how to effectively document the “summer camp life”. Hopefully some of the info in this post can help people who are interested in doing something like this or just are interested in sports photography in general.\n\nTo start things off this is not my first time shooting sports. I have a lots of experience working as a photographer for my college newspaper where I documented pretty much all the sports teams over four years. So coming into working this camp I was definitely in my element. Secondly I know the sport of Ultimate Frisbee very well. I have been playing the sport for over a decade (I will touch on the importance of this later in the post) and have a good knowledge of how the flow of the game goes.\n\n[Some of my best shots](https://imgur.com/a/pcL8C10)\n\n**My Gear:**\n\nCanon 6D / Canon 5D mk II\n\nTamron 24-70 f/2.8\n\nTamron 150-600 f/5-6.3 G2\n\nYongnuo 85 1.8\n\nUSA Gear Double Camera Harness\n\nDell Inspiron i7, 16gb RAM, 250gb SSD laptop\n\nKingston Multi Card Reader USB 3.0\n\nNew Balance running shoes\n\nMy gear was pretty standard for long form documentation of any sporting event. One body with a wide to medium telephoto (5d mk2 + 24-70) and another body with a super telephoto to capture the downfield action (6D + 150-600). I used a double camera harness off amazon and in retrospect it’s pretty bad. I should have dropped the money to get the Black Rapid harness because the one I used was slightly uncomfortable and needed to be readjusted on a regular basis. While it was bad, it got the job done so I can’t really complain. My laptop is no beast but I could process all my photos with little to no slowdown. Also get a pair of running shoes with good support because standing all day with heavy equipment can wreck your feet.\n\n**How to Capture Sports 101:**\n\nThe most important part of shooting sports is understanding the game. With my experience with Ultimate Frisbee, I knew how the game flowed so I could accurately predict what kind of plays were about to happen. This helped with my positioning around the field as well. I would camp out in the corner of the endzones and alternate from having the disc moving away from to the disc moving towards me. Each approach helped me achieve certain types of photos. The long “hail-mary” type plays were easier to capture when the disc was moving towards me while the defensive plays were much easier to catch when the disc was moving away. As a “one man band” I couldn’t possibly capture every exciting moment but putting myself in the right spots and reading the game helped me capture things at a higher percentage.\n\nWhen it came to focal length, shooting at the farthest was the most ideal. With the Tamron 150-600 I stayed around 400-300 because it would be tight enough to be close to the action but also wide enough where I could crop tighter if need be. Most of the time I shoot on shutter priority at 1/1000th with Auto ISO. This guaranteed that I could freeze any motion and seeing as though it was very bright out my ISO never moved past 800. The exception was that once a week the camp had a night game where I moved down to 1/800 so I could get a little more light and ease up on the ISO. Burst mode and -----> AI !!!  Servo mode for AF were a necessity for this kind of shooting. Back button autofocus also made it much easier to pre-focus on an area and then track subjects when needed. For the more detailed and close up shots I would have my 24-70 at my hip mostly locked at 24mm. This was important because if two kids were having a laugh or the counselors were giving advice to a camper I could quickly pull up my wide angle and snap a few shots before the moment went away. I would mostly keep this at 2.8 and a relatively high shutter speed. Some famous photographer said that if your photos suck you probably aren’t close enough. This is possibly the one thing I would want people to get out of this post. With my wide angle shots I was mostly down on the ground and very close to my subject and this raised the level of my photos tremendously. Also with the long telephoto the closer I could get physically to the action, the less compression I got and that would lead to less flat photos. Don’t be afraid to get down and dirty to get a shot, by the end of the day my clothes were covered in dirt and grass just from being on the ground so much. With that being said, prepare for the work that you will be doing later. I would delete any photo that I thought would not be a keeper. Missed, focus, boring moment, generally uninteresting were all reasons for me to delete a photo. Instead of having to go through hundreds of photos at the end of the night, I would have a few dozen of photos that I knew were good enough. I did a lot of “chimping” while out at the fields so I could save time in processing later.\n\nMy philosophy for what photos to keep was basically “did it encapsulate the atmosphere of the camp?” Sometimes the best plays or highlights don’t show what the camp is actually like. I would take a lot of photos of just the kids laughing or all around being happy. Focus on the fun moments and also the exciting moments for a good balance. Get to know the campers as well because then it makes them feel more comfortable around you. Find the personal moments because those are the ones that really show what the camp atmosphere is all about. One aspect of the photography that I tried to focus on was keep the photos aesthetically simple. The background is just as important as the foreground. Even an out of focus cluttered background will make a good shot look bad. Search out clean and simple backgrounds for your photos because it makes the subject standout.\n\n**Workflow:**\n\nSince it was my job to not just document the action on the field but to capture off field activities as well, I was working pretty much all day with little time for breaks. The most important piece of advice from me in this regard would be to shoot JPEG. Not only did it save me a lot of time importing and processing, I could focus on getting the exposure correct in camera so I wouldn’t need to spend lots of time correcting lazy mistakes after the fact. Also Canon JPEG have enough latitude that most exposure imperfections could be fixed with a few adjustments of the slider. Whenever I was not obligated to be somewhere taking photos I would be ingesting all my photos onto my laptop to be processed. If I had time I would process the photos and the importance of getting the exposure right in camera was that all I really had to do was crop most of the keepers. Learning Lightroom’s shortcuts will make your processing so much faster. Cropping, tagging, and copying/pasting settings becomes so much faster when all you have to do is press a key combo.\n\n**Final Thoughts:\n**\nThis was probably the most fun I have ever had working a job. They say if you like what you do that you’ll never work a day in your life. While the hours were long and the constant work stressed me out, I had a smile on my face the whole time. I recommend everyone try to get involved with some kind of summer camp or after school activity because seeing the kids so happy to see your photos was something I’ll remember for a long time. At the end of the day it’s all about showing what the camp is about and enjoying and experiencing it firsthand will only let you do your job better. Please feel free to ask questions in the comments because I for sure did not cover everything. Thanks for reading and feel free to check out my other work on my website or follow me on my street photography Instagram.\n\nNUTC Website: http://nutc.net/\n\nMy Website: http://www.aleczabrecky.com\n\nMy Instagram: www.instagram.com/zabreklz/", "link": "https://www.reddit.com/r/photography/comments/92q9i0/i_worked_as_a_photographer_at_a_sports_camp_for/"}, {"autor": "Gnurx", "date": "2018-09-07 06:29:09", "content": "-----> AI !!!  sees into the dark", "link": "https://www.reddit.com/r/photography/comments/9drljl/ai_sees_into_the_dark/"}, {"autor": "shian243", "date": "2018-09-14 12:20:35", "content": "Where do you think the future of photography is heading towards? /!/ I think this can be a very interesting topic as a user. I remembered when the lytro camera came out, it was ahead of its time, but too ahead. I'll love to have that tech back in modern cameras (though smartphones does it to some extend)\n\nDo you think -----> AI !!!  will truly take over the future of professional cameras? I look forward to more options of affordable medium format cameras, because for alot of people, phase ones are way out of the question(I know there's pentax)", "link": "https://www.reddit.com/r/photography/comments/9frisa/where_do_you_think_the_future_of_photography_is/"}, {"autor": "taixhi", "date": "2018-10-21 15:40:27", "content": "This -----> AI !!!  app will help you compose photos better", "link": "https://www.reddit.com/r/photography/comments/9q4ghe/this_ai_app_will_help_you_compose_photos_better/"}, {"autor": "lordatlas", "date": "2018-12-18 12:34:44", "content": "These Portraits Were Made by -----> AI !!! : None of These People Exist", "link": "https://www.reddit.com/r/photography/comments/a7aocn/these_portraits_were_made_by_ai_none_of_these/"}, {"autor": "GosuGamerL", "date": "2018-11-26 12:41:21", "content": "Photolemur feedback request /!/ Hi guys,   \n\n\nmy company is preparing to launch our own -----> AI !!!  PhotoRetouching product, which is technically superior to anything else on the market(demoversion coming soon).  \n\n\nHence, we'd like to collect some feedback from those using Photolemur or other AI retouching products.   \n\n\nWhat features do you like?  \nWhat do you think it can do better?  \nHow many pictures do you retouch on average?  \nWould you like to see a product with additional features? What are they?  \n\n\nI would appreciate if you could share your experiences openly. In return, we will distribute a free license to each fellow-redditor who answers this request. ", "link": "https://www.reddit.com/r/photography/comments/a0j067/photolemur_feedback_request/"}, {"autor": "photonsintime", "date": "2018-11-29 16:22:13", "content": "Pixel 3 resolution testing /!/ Interesting to see the improvements in smartphone photo technology. In this case, the new Pixel 3. The -----> AI !!!  tends to over process some photos at times (especially for portrait or night modes) but overall I find it an excellent alternative to my Nikon D90. You may disagree with me. Anyone else out there play around with their Pixel 3 (or iPhone X)?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[Ava Pixel 3](https://i.redd.it/dvjc94orpa121.png)", "link": "https://www.reddit.com/r/photography/comments/a1irqt/pixel_3_resolution_testing/"}, {"autor": "HenryUTA", "date": "2018-12-23 02:10:31", "content": "7D mk3 and 85mm 1.4 - Autofocus /!/ Just got the Canon 85mm f1.4 and it's been a fantastic lens. I saw that it's supposedly fast enough for sports but I've had a really had time with it. I was using it in a Gym with crap lighting (glad i brought this lens along) \n\nI had the lens wide open at 1.4, ISO 1600 and -----> AI !!!  Servo and 1/1000 shutter. About 1/3 of the pictures i took were in focus. I was using the center point plus 4 adjacent (cross-looking setup). The camera had a real hard time focusing. Even with shooting at one shot AF at 1/320 i couldn't get the camera to focus on subjects about 60 feet away. \n\n&amp;#x200B;\n\nAny ideas? The lens is fantastic as a portrait lens and it gets amazing shots but I am hoping to be able to use it for indoor sports because the lights are always awful and you need a wide aperture.", "link": "https://www.reddit.com/r/photography/comments/a8qw7u/7d_mk3_and_85mm_14_autofocus/"}, {"autor": "jessenat0r", "date": "2018-01-12 03:53:19", "content": "I feel like I'm on a plateau and don't have the first clue about how to improve. /!/ Title says it all ...mostly.\n\nI'm trying to branch out and improve my photography, but feel I'm at not just a creative, but also a technical plateau. I feel like I've gotten better over the last few years, but a recent community rejection (I won't say which) has sort of set off my anxiety/self-doubt reflex. Usually I'm able to just bounce back--my 9-5 is in the creative/marketing industry, so I'm no stranger to rejection. I don't understand why this rejection happened (I was asked to \"apply to join\" this group so I kinda felt set up...), but can only assume, as no specific reason was given, that there's a lack of something in my work.\n\n**I'm not fishing for compliments-- I'm trying to solve this problem** (that's what I do) of not even knowing what is wrong with my photos in general, or my methodology (as much as can be evident in my photos). I don't feel like a single-image critique has gotten me far (in fact I've submitted to /r/photocritique under a different username in the past). The criticisms were pretty subjective, rather than objective.\n\nThe conundrum in all of this is: *I don't know what the \"problem\" truly is and what way to even go about rectifying it.*\n\nMost of my work has been for clients from my 9-5 who've needed, however I've done some outside projects as well. \n\n[a small sampling of what I've done since 2014](https://imgur.com/a/fmXF6)\n\n**I'm happy to give a little history of my workflow also:**\n\nI've been shooting since high school. University took me into strictly graphic design and into the real world in 2007. But photo, in hindsight, might have been a better avenue to go down. I had been shooting casually all up until 2013 when I left film behind for good. 2014 is when I decided not to be afraid of lighting--I somehow believed only in natural light --facepalm-- for every type of photography. I rented a lot, since they were client gigs. I finally got my own rig in 2015/16 and have been using that ever since. My first actual client gig was the Foundry posts in that gallery link above. It was very seat-of-the-pants. Slowly I learned to get better with my tools--helped when I had my own stuff to use.\n\nAs a matter of course, I don't like retouching--I can do it alright, but it feels dishonest. I do edit, but as little as possible. I feel like I can get some decent workable results from Lightroom. I don't want to be a slave to it, but I often wonder if I can push it more.\n\nI've watched numerous online courses, (tried to) listen to youtubers, just to make sure my books weren't woefully behind the times. I follow people whose work I've seen and admire. In our office there are two photographers, and I've been doing my best to \"not suck\" as a person toward them, as Don Giannatti said [in this article](https://petapixel.com/2014/11/12/aspiring-professional-photographers-problem-suck) .\n\nMy gear--various Nikon bodies and lenses rented, but here's what I own as of 2018:\n* Nikon D700\n* Nikkor lenses: 35mm f/2 D; 50mm f/1,8 -----> Ai !!! ; 85mm f/1,8 G; 105mm f/2,5 -----> Ai !!! S; 105mm f/2 DC\n* Nikon SB-28 (2); SB-26 (2); Vello Freewave LR trigger\n* 2x thru-brolly; 2x bounce brolly; 2x 120cm octobox w/ grids\n\nWishlist: Tamron 70-200mm G2 / Tamron 15-30mm / Tokina 100mm macro / normal brain\n\nAnyhow, thanks for the consideration and advice.\n-C", "link": "https://www.reddit.com/r/photography/comments/7ptyte/i_feel_like_im_on_a_plateau_and_dont_have_the/"}, {"autor": "[deleted]", "date": "2018-03-18 19:45:54", "content": "Magic Lantern: If you hold \"SET\" while powering on your camera, it bypasses the -----> ML !!!  software. But how can you make it so that it bypasses by default? And can you make it so that if you hold \"SET\" while powering on it enables it?", "link": "https://www.reddit.com/r/photography/comments/85dmde/magic_lantern_if_you_hold_set_while_powering_on/"}, {"autor": "BlackHoleTec", "date": "2018-04-24 11:31:25", "content": "Nvidia's -----> AI !!!  Realistically Reconstructs Photos", "link": "https://www.reddit.com/r/photography/comments/8ejozm/nvidias_ai_realistically_reconstructs_photos/"}, {"autor": "craftyrafter", "date": "2018-07-10 14:12:54", "content": "Nvidia Taught an -----> AI !!!  to Flawlessly Erase Watermarks From Photos", "link": "https://www.reddit.com/r/photography/comments/8xpi0o/nvidia_taught_an_ai_to_flawlessly_erase/"}, {"autor": "KevinBlowsGoats", "date": "2018-07-10 14:11:47", "content": "Nvidia -----> AI !!!  removes grain and watermarks from photos", "link": "https://www.reddit.com/r/photography/comments/8xphn5/nvidia_ai_removes_grain_and_watermarks_from_photos/"}, {"autor": "ZoidbergRage", "date": "2018-07-28 18:10:33", "content": "I worked as a photographer for a sports camp for two weeks and this is what I learned /!/ Hello everyone, I just got back from working at the National Ultimate Training Camp as a photographer for the past two weeks. I learned a lot about what makes good sports photography as well as how to effectively document the “summer camp life”. Hopefully some of the info in this post can help people who are interested in doing something like this or just are interested in sports photography in general.\n\nTo start things off this is not my first time shooting sports. I have a lots of experience working as a photographer for my college newspaper where I documented pretty much all the sports teams over four years. So coming into working this camp I was definitely in my element. Secondly I know the sport of Ultimate Frisbee very well. I have been playing the sport for over a decade (I will touch on the importance of this later in the post) and have a good knowledge of how the flow of the game goes.\n\n[Some of my best shots](https://imgur.com/a/pcL8C10)\n\nMy Gear:\n\nCanon 6D / Canon 5D mk II\n\nTamron 24-70 f/2.8\n\nTamron 150-600 f/5-6.3 G2\n\nYongnuo 85 1.8\n\nUSA Gear Double Camera Harness\n\nDell Inspiron i7, 16gb RAM, 250gb SSD laptop\n\nKingston Multi Card Reader USB 3.0\n\nNew Balance running shoes\n\nMy gear was pretty standard for long form documentation of any sporting event. One body with a wide to medium telephoto (5d mk2 + 24-70) and another body with a super telephoto to capture the downfield action (6D + 150-600). I used a double camera harness off amazon and in retrospect it’s pretty bad. I should have dropped the money to get the Black Rapid harness because the one I used was slightly uncomfortable and needed to be readjusted on a regular basis. While it was bad, it got the job done so I can’t really complain. My laptop is no beast but I could process all my photos with little to no slowdown. Also get a pair of running shoes with good support because standing all day with heavy equipment can wreck your feet.\n\nHow to Capture Sports 101:\n\nThe most important part of shooting sports is understanding the game. With my experience with Ultimate Frisbee, I knew how the game flowed so I could accurately predict what kind of plays were about to happen. This helped with my positioning around the field as well. I would camp out in the corner of the endzones and alternate from having the disc moving away from to the disc moving towards me. Each approach helped me achieve certain types of photos. The long “hail-mary” type plays were easier to capture when the disc was moving towards me while the defensive plays were much easier to catch when the disc was moving away. As a “one man band” I couldn’t possibly capture every exciting moment but putting myself in the right spots and reading the game helped me capture things at a higher percentage.\n\nWhen it came to focal length, shooting at the farthest was the most ideal. With the Tamron 150-600 I stayed around 400-300 because it would be tight enough to be close to the action but also wide enough where I could crop tighter if need be. Most of the time I shoot on shutter priority at 1/1000th with Auto ISO. This guaranteed that I could freeze any motion and seeing as though it was very bright out my ISO never moved past 800. The exception was that once a week the camp had a night game where I moved down to 1/800 so I could get a little more light and ease up on the ISO. Burst mode and -----> AI !!!  Servo mode for AF were a necessity for this kind of shooting. Back button autofocus also made it much easier to pre-focus on an area and then track subjects when needed. For the more detailed and close up shots I would have my 24-70 at my hip mostly locked at 24mm. This was important because if two kids were having a laugh or the counselors were giving advice to a camper I could quickly pull up my wide angle and snap a few shots before the moment went away. I would mostly keep this at 2.8 and a relatively high shutter speed. Some famous photographer said that if your photos suck you probably aren’t close enough. This is possibly the one thing I would want people to get out of this post. With my wide angle shots I was mostly down on the ground and very close to my subject and this raised the level of my photos tremendously. Also with the long telephoto the closer I could get physically to the action, the less compression I got and that would lead to less flat photos. Don’t be afraid to get down and dirty to get a shot, by the end of the day my clothes were covered in dirt and grass just from being on the ground so much. With that being said, prepare for the work that you will be doing later. I would delete any photo that I thought would not be a keeper. Missed, focus, boring moment, generally uninteresting were all reasons for me to delete a photo. Instead of having to go through hundreds of photos at the end of the night, I would have a few dozen of photos that I knew were good enough. I did a lot of “chimping” while out at the fields so I could save time in processing later.\n\nMy philosophy for what photos to keep was basically “did it encapsulate the atmosphere of the camp?” Sometimes the best plays or highlights don’t show what the camp is actually like. I would take a lot of photos of just the kids laughing or all around being happy. Focus on the fun moments and also the exciting moments for a good balance. Get to know the campers as well because then it makes them feel more comfortable around you. Find the personal moments because those are the ones that really show what the camp atmosphere is all about. One aspect of the photography that I tried to focus on was keep the photos aesthetically simple. The background is just as important as the foreground. Even an out of focus cluttered background will make a good shot look bad. Search out clean and simple backgrounds for your photos because it makes the subject standout.\n\nWorkflow:\n\nSince it was my job to not just document the action on the field but to capture off field activities as well, I was working pretty much all day with little time for breaks. The most important piece of advice from me in this regard would be to shoot JPEG. Not only did it save me a lot of time importing and processing, I could focus on getting the exposure correct in camera so I wouldn’t need to spend lots of time correcting lazy mistakes after the fact. Also Canon JPEG have enough latitude that most exposure imperfections could be fixed with a few adjustments of the slider. Whenever I was not obligated to be somewhere taking photos I would be ingesting all my photos onto my laptop to be processed. If I had time I would process the photos and the importance of getting the exposure right in camera was that all I really had to do was crop most of the keepers. Learning Lightroom’s shortcuts will make your processing so much faster. Cropping, tagging, and copying/pasting settings becomes so much faster when all you have to do is press a key combo.\n\nFinal Thoughts:\n\nThis was probably the most fun I have ever had working a job. They say if you like what you do that you’ll never work a day in your life. While the hours were long and the constant work stressed me out, I had a smile on my face the whole time. I recommend everyone try to get involved with some kind of summer camp or after school activity because seeing the kids so happy to see your photos was something I’ll remember for a long time. At the end of the day it’s all about showing what the camp is about and enjoying and experiencing it firsthand will only let you do your job better. Please feel free to ask questions in the comments because I for sure did not cover everything. Thanks for reading and feel free to check out my other work on my website or follow me on my street photography Instagram.\n\nNUTC Website: http://nutc.net/\n\nMy Website: http://www.aleczabrecky.com\n\nMy Instagram: www.instagram.com/zabreklz/", "link": "https://www.reddit.com/r/photography/comments/92o582/i_worked_as_a_photographer_for_a_sports_camp_for/"}, {"autor": "ZoidbergRage", "date": "2018-07-28 18:09:22", "content": "New Post /!/ Hello everyone, I just got back from working at the National Ultimate Training Camp as a photographer for the past two weeks. I learned a lot about what makes good sports photography as well as how to effectively document the “summer camp life”. Hopefully some of the info in this post can help people who are interested in doing something like this or just are interested in sports photography in general.\n\nTo start things off this is not my first time shooting sports. I have a lots of experience working as a photographer for my college newspaper where I documented pretty much all the sports teams over four years. So coming into working this camp I was definitely in my element. Secondly I know the sport of Ultimate Frisbee very well. I have been playing the sport for over a decade (I will touch on the importance of this later in the post) and have a good knowledge of how the flow of the game goes.\n\n[Some of my best shots](https://imgur.com/a/pcL8C10)\n\n**My Gear:**\n\nCanon 6D / Canon 5D mk II\n\nTamron 24-70 f/2.8\n\nTamron 150-600 f/5-6.3 G2\n\nYongnuo 85 1.8\n\nUSA Gear Double Camera Harness\n\nDell Inspiron i7, 16gb RAM, 250gb SSD laptop\n\nKingston Multi Card Reader USB 3.0\n\nNew Balance running shoes\n\n\nMy gear was pretty standard for long form documentation of any sporting event. One body with a wide to medium telephoto (5d mk2 + 24-70) and another body with a super telephoto to capture the downfield action (6D + 150-600). I used a double camera harness off amazon and in retrospect it’s pretty bad. I should have dropped the money to get the Black Rapid harness because the one I used was slightly uncomfortable and needed to be readjusted on a regular basis. While it was bad, it got the job done so I can’t really complain. My laptop is no beast but I could process all my photos with little to no slowdown. Also get a pair of running shoes with good support because standing all day with heavy equipment can wreck your feet. \n\n**How to Capture Sports 101:**\n\nThe most important part of shooting sports is understanding the game. With my experience with Ultimate Frisbee, I knew how the game flowed so I could accurately predict what kind of plays were about to happen. This helped with my positioning around the field as well. I would camp out in the corner of the endzones and alternate from having the disc moving away from to the disc moving towards me. Each approach helped me achieve certain types of photos. The long “hail-mary” type plays were easier to capture when the disc was moving towards me while the defensive plays were much easier to catch when the disc was moving away. As a “one man band” I couldn’t possibly capture every exciting moment but putting myself in the right spots and reading the game helped me capture things at a higher percentage.\n\nWhen it came to focal length, shooting at the farthest was the most ideal. With the Tamron 150-600 I stayed around 400-300 because it would be tight enough to be close to the action but also wide enough where I could crop tighter if need be. Most of the time I shoot on shutter priority at 1/1000th with Auto ISO. This guaranteed that I could freeze any motion and seeing as though it was very bright out my ISO never moved past 800. The exception was that once a week the camp had a night game where I moved down to 1/800 so I could get a little more light and ease up on the ISO. Burst mode and -----> AI !!!  Servo mode for AF were a necessity for this kind of shooting. Back button autofocus also made it much easier to pre-focus on an area and then track subjects when needed. For the more detailed and close up shots I would have my 24-70 at my hip mostly locked at 24mm. This was important because if two kids were having a laugh or the counselors were giving advice to a camper I could quickly pull up my wide angle and snap a few shots before the moment went away. I would mostly keep this at 2.8 and a relatively high shutter speed. \nSome famous photographer said that if your photos suck you probably aren’t close enough. This is possibly the one thing I would want people to get out of this post. With my wide angle shots I was mostly down on the ground and very close to my subject and this raised the level of my photos tremendously. Also with the long telephoto the closer I could get physically to the action, the less compression I got and that would lead to less flat photos. Don’t be afraid to get down and dirty to get a shot, by the end of the day my clothes were covered in dirt and grass just from being on the ground so much. With that being said, prepare for the work that you will be doing later. I would delete any photo that I thought would not be a keeper. Missed, focus, boring moment, generally uninteresting were all reasons for me to delete a photo. Instead of having to go through hundreds of photos at the end of the night, I would have a few dozen of photos that I knew were good enough. I did a lot of “chimping” while out at the fields so I could save time in processing later.\n\nMy philosophy for what photos to keep was basically “did it encapsulate the atmosphere of the camp?” Sometimes the best plays or highlights don’t show what the camp is actually like. I would take a lot of photos of just the kids laughing or all around being happy. Focus on the fun moments and also the exciting moments for a good balance.  Get to know the campers as well because then it makes them feel more comfortable around you.  Find the personal moments because those are the ones that really show what the camp atmosphere is all about. One aspect of the photography that I tried to focus on was keep the photos aesthetically simple. The background is just as important as the foreground. Even an out of focus cluttered background will make a good shot look bad. Search out clean and simple backgrounds for your photos because it makes the subject standout.  \n\n**Workflow:**\n\nSince it was my job to not just document the action on the field but to capture off field activities as well, I was working pretty much all day with little time for breaks. The most important piece of advice from me in this regard would be to shoot JPEG. Not only did it save me a lot of time importing and processing, I could focus on getting the exposure correct in camera so I wouldn’t need to spend lots of time correcting lazy mistakes after the fact. Also Canon JPEG have enough latitude that most exposure imperfections could be fixed with a few adjustments of the slider. Whenever I was not obligated to be somewhere taking photos I would be ingesting all my photos onto my laptop to be processed. If I had time I would process the photos and the importance of getting the exposure right in camera was that all I really had to do was crop most of the keepers. Learning Lightroom’s shortcuts will make your processing so much faster. Cropping, tagging, and copying/pasting settings becomes so much faster when all you have to do is press a key combo.\n\n**Final Thoughts:**\n\nThis was probably the most fun I have ever had working a job. They say if you like what you do that you’ll never work a day in your life. While the hours were long and the constant work stressed me out, I had a smile on my face the whole time. I recommend everyone try to get involved with some kind of summer camp or after school activity because seeing the kids so happy to see your photos was something I’ll remember for a long time. At the end of the day it’s all about showing what the camp is about and enjoying and experiencing it firsthand will only let you do your job better. Please feel free to ask questions in the comments because I for sure did not cover everything. Thanks for reading and feel free to check out my other work on my website or follow me on my street photography Instagram.\n\nNUTC Website: http://nutc.net/\n\nMy Website: http://www.aleczabrecky.com\n\nMy Instagram: www.instagram.com/zabreklz/\n\n", "link": "https://www.reddit.com/r/photography/comments/92o4vj/new_post/"}, {"autor": "SquatzMagoo", "date": "2018-08-16 20:40:02", "content": "Autofocus on the Canon 7D Mark II /!/ Hey guys, I enjoy taking pictures of dogs in motion. i was wondering if there was any insight or tips on what I could be doing to help the autofocus catch the dogs? The mark ii has what canon wants to consider a “sophisticated” AF system but I just haven’t seen those results yet. I can take like 10 frames per second and have some look really cool but if i wasn’t already focused on the dog before it starts running, i can’t seem to get it to focus in motion and i’m just simply not quick enough to manual focus on something like that yet. I’m aware of “-----> AI !!!  SERVO” and i’m going to use that tonight but anything else i’m just overlooking?", "link": "https://www.reddit.com/r/photography/comments/97vyqe/autofocus_on_the_canon_7d_mark_ii/"}, {"autor": "InvisibleMaster1977", "date": "2018-08-24 22:19:27", "content": "What the Nikon F to Z Adaptor does /!/ Although the Nikon Z system was pretty extensively covered in this sub for the past days, I found almost nothing on the funcionality of the Nikon FTZ Adaptor, so here is what I found out up to now: \n\n- Full compatibility with AF-S and E lenses\n- No Autofocus with AF-D lenses (aka screwdrive AF), but metering is available. Shooting in P, S, A and M mode possible. \n- Obviously no Autofocus with -----> AI !!! -s lenses, metering available. Shooting in M and A mode possible. \n\nUnfortunately a compatibility chart from Nikon doesn't seem to be available now and there seem to be some quirks on how metering with Ai-s lenses works. The FTZ Adaptor has no aperture feeling lever on the outside of the F-Mount but can set the aperture via a lever inside the mount (this is how all Nikon lenses except for the AF-E work). Metering is done the moment you press the shutter, but I wonder how that works when shooting in manual. Does anyone of you know that?\nAnother question I have is the electronic rangefinder, which seems to be availabe only with AF-S, E and AF-D lenses. Is there a reason why it is limited to these lenses?", "link": "https://www.reddit.com/r/photography/comments/9a1roc/what_the_nikon_f_to_z_adaptor_does/"}, {"autor": "alokda2", "date": "2018-09-24 08:55:38", "content": "Polarr Deep Crop Uses -----> AI !!!  to Auto-Crop Your Photos 'Like a Pro'", "link": "https://www.reddit.com/r/photography/comments/9igc7g/polarr_deep_crop_uses_ai_to_autocrop_your_photos/"}, {"autor": "IAMYourFatherAMAA", "date": "2018-10-01 05:18:19", "content": "Sports and autofocus at wide apertures /!/ Hello all,\n\nI'm a fairly experienced sports photographer and I do coverage for my school's student newspaper. I've done a lot of soccer, basketball, and baseball, but I just transferred to a new school and have been doing football for the first time. After my first game, my cheap but trusty EF90-300 f/3.5-5.6 shit the bed and I decided to replace it with a used first gen EF70-200 f/2.8L to get that sweet sweet bokeh and a better build quality. But after my first football game with that lens, I ran into lots of autofocus problems. \n\nI figured since I was moving to a larger aperture, I might have problems with the autofocus would hit slightly off. However, when my camera got the focus, it usually hit it spot-on. What I really ended up having a problem with was my camera not focusing on what was directly in front of me and instead focusing on the background or mid-ground. Normally with my old lens after a shot or two the autofocus would get with the program and focus on what I wanted. But after I got back from the game, I had whole series or 5 or 7 images, all of which were focused on the wrong thing. \n\nAnyone have any ideas of how to circumvent this? I'm shooting on a 5D Classic, -----> AI !!!  Servo, and back button focus. I believe I've got all autofocus points activated, but I'm thinking about maybe moving to center-only. I don't think I've ever used the joystick on the back to select a focus point manually, but if you think that would solve my problem, do you have any suggestions on how you use it when you shoot? Especially since my thumb is being used for back button focus. Any and all advice and anecdotes are appreciated!\n\nTL;DR: 5D Classic, 70-200 f/2.8L, shooting football, missing focus like hell", "link": "https://www.reddit.com/r/photography/comments/9kdkb9/sports_and_autofocus_at_wide_apertures/"}, {"autor": "bnm777", "date": "2018-10-13 11:05:34", "content": "Anyone else impressed by the software gigapixel that increases photo size by creating new pixels using -----> AI !!! ? /!/ Saw a description of it on luminous-landscape and have been playing with the trial. \nApparently it uses AI/machine learning (from analysing a million or whatever images) to analyse your image, then add pixels to blow it up by 600%.\n\nHere's a test I performed. Took a photo with an 85mm 1.8 and used the software. On the left is the photo at 400% magnification, on the right is the gigapixel image. Try zooming in further, and further.\n\nSometimes the software creates something that doesn't look real, but most of the time it's scarily realistic.\n\nhttps://imgur.com/a/MT6NQm2\n\nBTW I have nothing to do with the company. Thinking of using it on landscapes prints though I need to test it out further in case it creates garbage, non-realistic pixels.", "link": "https://www.reddit.com/r/photography/comments/9nszan/anyone_else_impressed_by_the_software_gigapixel/"}, {"autor": "marketingthongminh", "date": "2018-11-10 07:33:14", "content": "[Digital Marketing] P2: Đâu là xu hướng Digital ảnh hưởng lớn tới kinh doanh nửa cuối 2017? /!/ Hẳn là mọi người đang quan tâm đến:”[Digital Marketing] P2: Đâu là xu hướng Digital ảnh hưởng lớn tới kinh doanh nửa cuối 2017?”. Bài viết này nằm trong chuỗi bài viết về Digital Marketing. còn chờ gì nữa, chúng ta hãy cùng tìm hiểu ngay nào!\n\nMột số các xu hướng Digital xuất hiện vào đầu năm 2017 đang đi đến thời đỉnh cao. Và nếu nói rằng đây là năm của các thiết bị di động thì hoàn toàn không có gì sai. “Cuối cùng thì chúng ta cũng sẵn sàng lột bỏ lớp áo cũ kỹ” – trích lời Greg Paull, đồng sáng lập và chủ tịch của tập đoàn R3 Worldwide.\n\nVR (Công nghệ thực tế ảo) chỉ là một yếu tố nổi bật trong hàng loạt các công nghệ nổi trội\n------------------------------------------------------------------------------------------\n\nSau cơn sốt ban đầu, thì công nghệ thực tế ảo hiện nay đã dần được phổ biến. Tại buổi họp báo NewFronts 2017, công nghệ thực tế ảo được trình bày như là chỉ là một công cụ không hơn không kém trong khối các công cụ tiên tiến; không thể thừa nhận VR là nghiên cứu thành công nhưng không phải là ưu tiên hàng đầu cho sự phát triển nội dung. VR đặt trọng tâm vào việc tạo nên những nội dung phù hợp và tinh tế thay vì tập trung phô diễn công nghệ độc đáo. “Chúng tôi đang chờ đợi phiên bản 3.0,” Paull nói.\n\nDù vậy cũng đừng cảm thấy tiếc cho VR. Hình thức công nghệ này đã được áp dụng trong game và video, được dự kiến sẽ tăng lên khoảng 2 tỷ $ doanh thu mỗi năm, theo dự báo của PwC – một trong bốn công ty kiểm toán hàng đầu thế giới. Trong dự báo cũng tiên đoán rằng doanh thu toàn thị trường VR sẽ tăng trưởng đến hơn $ 15 tỷ vào năm 2021. Sau thời điểm đó, hơn 257 triệu tai nghe có cài đặt VR sẽ được sử dụng rộng rãi, và hơn 88% trong số họ sẽ được kính thực tế ảo tích hợp với điện thoại di động.\n\nGame là một công cụ phố biến nhất cho VR phát huy công dụng, tuy nhiên bất ngờ hơn hết, khi những chiếc headsets giá rẻ tấn công thị trường, kéo theo đó video sẽ bắt đầu phát triển với một tốc độ nhanh hơn. PwC dự đoán công nghệ video trực tuyến VR sẽ có doanh thu tăng cao hơn game VR, đồng thời nó trở thành mảng chiếm phân khúc lớn nhất của thị trường công nghệ VR vào năm 2019.\n\n“Thách thức với VR là nó cần được xã hội hóa”, Paull nói. “Sẽ rất hữu ích nếu bạn có thể nắm bắt mọi thứ ngoài xã hội nhanh chóng nếu bạn có trong tay một công nghệ có tốc độ cao.”\n\n  - Công nghệ thực tế ảo – Một cuộc cách mạng cho ngành Bất Động Sản\n\nTập trung nói về bản thân\n-------------------------\n\nTrong năm 2017, hợp tác và liên doanh giữa các doanh nghiệp – ngay cả những người là đối thủ cạnh tranh của nhau – là cách nhiều người chọn. Nhìn xung quanh chúng ta có ngay Twitter, đã công bố 15 đối tác giao dịch khác nhau tại sự kiện NewFronts và hy vọng sẽ có thể mở kênh thời sự livestream 24/7 hợp tác cùng Bloomberg trong năm nay. Đó là ý tưởng “tái định vị hình ảnh thể thao, tin tức và chương trình giải trí cho một đối tượng đầu tiên qua điện thoại di động”, ông Matt Derella, phó giám đốc kinh doanh cho biết.\n\nNhiều nền tảng nhấn mạnh rằng các nhu cầu hiện giờ là sản xuất nội dung chất lượng cho nhiều kênh khác nhau và cần áp dụng nhiều công nghệ thường xuyên hơn là để một bộ phận xử lý toàn bộ. Nền tảng social và streaming cần nội dung, và các bên được thuê quảng cáo, tiếp thị (publisher) đi sau cần để phát triển khả năng công nghệ; trong khi đó, các agency cần kết nối cả hai bên khách hàng của họ, ngay cả khi họ cho ra đời các thử nghiệm nhằm cạnh tranh.\n\nCác publisher cần lưu ý của danh thiếp là ấn phẩm tạo nên ấn tượng thương hiệu. Nhưng hiện nay khi người dùng ngày càng có xu hướng tiếp nhận thông tin một cách vô ý và ngẫu nhiên, hầu hết các thông tin của họ từ các phương tiện Internet, truyền thông xã hội, và chỉ cần sử dụng điện thoại là có thể thấy được thông tin đầy đủ, thì các publisher cần lưu ý để cập nhật thông tin công ty mình qua những kênh này.\n\nBrad Elders – Giám đốc bộ phận kinh doanh của Time Inc đánh giá cao các giá trị nền tảng giao dịch, do đó, ông sẽ tập trung nguồn lực để tiếp thị nó. “Cuối cùng, thành công của chúng tôi vẫn gắn liền với bạn,” ông nói trong sự kiện Newfronts. “Chúng tôi có đầu tư vào mảng game.”\n\nThời đại của Live!\n------------------\n\nNội dung Live stream là tất cả những cơn thịnh nộ. Gần như mọi nền tảng trình bày tại NewFronts hoặc nội dung được mở rộng thành video trực tiếp thông qua các nền tảng truyền thông xã hội khác nhau, chẳng hạn như Facebook Live và Twitter Feeds, hoặc của riêng mình.\n\nTại Newfronts ông Chris Kuist, SVP nghiên cứu và tác động tại Cục Quảng cáo tương tác trình bày “Thời điểm là bước ngoặt cho ngành công nghiệp của chúng tôi,”. Ứng dụng Over the top – các ứng dụng và các nội dung như âm thanh, video được cung cấp trên nền tảng Internet và không một nhà cung cấp hoặc bất kỳ cơ quan nào có thể can thiệp vào thành xu hướng chủ đạo, và vì vậy chúng ta có video trên điện thoại di động của ngày nay, ông nói.\n\n“Hulu bây giờ có thể là web xem phim truyền hình ưu tiên hàng đầu của bạn”- CEO Mike Hopkins nói, tung ra một loạt dịch vụ mới trên nền tảng truy cập trực tiếp, dựa vào nhu cầu xem của Scripps Networks, chẳng hạn như Food Network, HGTV và The Travel Channel.\n\n“Chúng tôi không cần Nielsen cho chúng tôi biết OTT đang tăng nhanh,” ông Keith Grossman giám đốc kinh doanh của Bloomberg cho hay. Công ty đã hợp tác với Twitter như là một cách khác để tiếp cận đối tượng không xem truyền hình ngày một tăng cao.\n\n“Tất cả đều dựa trên hành vi người dùng”. Dorsey chia sẻ. “Người xem tìm đến họ vì nội dung hấp dẫn nhưng có quyết định gắn bó lâu dài hay không còn ở bởi sự tương tác”.\n\nLấy cảm tình khách hàng bằng chiêu “cá nhân hóa”\n------------------------------------------------\n\nGiữa làn sóng mạnh mẽ của sự phản đối với chính quyền mới ở Mỹ, những phản ứng dữ dội chống Brexit trong cuộc bầu cử của Anh mới nhất, và kết quả của cuộc bầu cử Pháp, sự phân cực của xã hội phương Tây, những mâu thuẫn gay gắt này dường như diễn ra và không có hồi kết.\n\nTrong môi trường đầy tính đụng chạm này, các chuyên gia cho biết cá nhân hóa không chỉ là về đặc điểm nhân khẩu học hoặc thậm chí bối cảnh nữa. Đó là về kêu gọi niềm tin. Christopher Graves, Chủ tịch Ogilvy Center for Behavioral Science, lưu ý rằng mọi người hiện nay luôn có niềm tin mãnh liệt trong họ, và họ sẽ nghe thông điệp đồng điệu với quan điểm của họ. Giai đoạn này, các công nghệ mới cho phép -----> AI !!!  để đánh giá đặc điểm của nội dung trực tuyến dựa vào cảm xúc và giai điệu, nhắm đến mục tiêu dựa trên thái độ và tâm trạng.\n\nNhờ các thuật toán tương tự mà các công cụ tìm kiếm mạng xã hội lớn đã vô tình xây dựng “buồng cách ly” của người dùng, tức là ở trong một cộng đồng khép kín, chỉ toàn những người cùng lối suy nghĩ trao đổi với nhau những ý kiến mà tất cả đều đồng tình, và thế là không có chỗ cho những quan điểm đối trọng. Họ chọn lọc và xếp sắp những thông tin cung cấp cho người dùng, phỏng đoán nhu cầu và mong muốn của họ dựa trên nhân khẩu học, nhận thức, hoạt động trước đó của người sử dụng: người này từng nêu câu hỏi gì, đã chọn những nguồn nào v.v… – Graves cho biết.\n\n_Hà Nguyễn / Marketingai.admicro.vn_\n_Nguồn: R3_\n\nCảm ơn bạn đã đọc đến dòng cuối cùng này. Vừa rồi bạn vừa đọc bài viết: “[Digital Marketing] P2: Đâu là xu hướng Digital ảnh hưởng lớn tới kinh doanh nửa cuối 2017?” do đội ngũ Marketing Thông Minh biên tập và tổng hợp. Rất mong những thông tin trên có ích cho bạn. Nếu bạn có bất cứ câu hỏi hoặc có góp ý gì hãy Comment xuống phía dưới nhé! \n\n   \n   \n from WordPress https://ift.tt/2Dxss8H\n   \n", "link": "https://www.reddit.com/r/photography/comments/9vsjdr/digital_marketing_p2_đâu_là_xu_hướng_digital_ảnh/"}, {"autor": "cryptoz", "date": "2018-11-09 17:52:49", "content": "Google is using -----> AI !!!  to help The New York Times digitize 5 million historical photos", "link": "https://www.reddit.com/r/photography/comments/9vmm9q/google_is_using_ai_to_help_the_new_york_times/"}, {"autor": "JadedSharpie", "date": "2018-04-23 18:21:41", "content": "New NVIDIA -----> AI !!!  clone/healing tool looks amazing.", "link": "https://www.reddit.com/r/photography/comments/8ednwu/new_nvidia_ai_clonehealing_tool_looks_amazing/"}, {"autor": "johnwayne2413", "date": "2018-05-30 03:05:36", "content": "This -----> AI !!!  Learned To See In The Dark | Two Minute Papers #253", "link": "https://www.reddit.com/r/photography/comments/8n589i/this_ai_learned_to_see_in_the_dark_two_minute/"}, {"autor": "iamPause", "date": "2018-05-29 21:04:26", "content": "-----> AI !!!  Allows for Un-paralleled Low-Light Photography", "link": "https://www.reddit.com/r/photography/comments/8n2p6m/ai_allows_for_unparalleled_lowlight_photography/"}, {"autor": "cryptoz", "date": "2018-09-16 02:43:33", "content": "Project: My goal is to turn every outdoor photo ever taken into usable, numerical weather data that can be used in weather models for storm prediction. Here is my progress. /!/ Hello,\n\nI am frustrated at the lack of good weather data in this day and age of connected cameras and sensors etc. So I am making projects to assimilate and analyze sources of data that could be used in weather forecasting but are not yet. An obvious one is photos outside.\n\nI'm starting with a simpler target, which is: using labelled photos of the sky, can we train a machine-learning algorithm to do basic classification on the weather conditions on the photo. For example, in a photo of the sky with clouds, and at the bottom trees and roofs, if those items are tagged in the photo then the algorithm can learn about future photos.\n\nA stretch goal is to use all photos taken outside, even if they don't include the sky in them - ground conditions, shadows, etc will all give clues as to the weather outside at the time the photo was taken.\n\nI have asked the -----> machine learning !!!  communities what they think and they deem the basic premise of auto-tagging the photos do-able. The main issue, of course, is finding or creating a large enough training data set for this to work.\n\nSo that's where I am now. I'm estimated to need maybe a few thousand tagged photos of sky conditions at a minimum to begin work on the training algorithm. To that end and others, I've made an Android app that lets people send in tagged photos of the sky. So far I've only collected around 30 photos - and the labeling is dubious. \n\nThe app I made for this is called [All Clear Weather](https://play.google.com/store/apps/details?id=com.allclearweather.android) (US, Android for now, long story, expanding later). The app contains multiple other weather experiments as well not related to photography.\n\nClosing Thoughts and final points\n\n----\n\nI'm not sure I made a wise decision making a weather app that contains this small photography feature to use. I think it will be under-utilized. Is there interest in the photography community to contribute something like this? Should I make a separate app for you?\n\n----\n\nIt occurs to me that smartphone cameras are getting much better year over year. What kind of sensory/light details am I missing from smartphone pictures that might resolve features in the sky if a more advanced camera were used? Are smartphone cameras technically capable of more or less than I'm hoping? I'm thinking about things like [this article on cosmic rays](https://gizmodo.com/turn-your-smartphone-into-a-particle-detector-for-cosmi-1697286872), showing that the cameras can help in scientific research more than people might expect!\n\nThanks!!", "link": "https://www.reddit.com/r/photography/comments/9g7aqj/project_my_goal_is_to_turn_every_outdoor_photo/"}, {"autor": "thegeezuss", "date": "2018-10-18 09:58:05", "content": "Píxel 3 vs iPhone Xs camera face-off: the -----> AI !!!  makes a difference", "link": "https://www.reddit.com/r/photography/comments/9p7ub9/píxel_3_vs_iphone_xs_camera_faceoff_the_ai_makes/"}, {"autor": "suntoryBOSS_", "date": "2018-12-06 00:41:35", "content": "Gear dilemma, what's your thoughts? /!/ So I bought a 6D Mark II from Canon on Black Friday, with the intention of shooting some video with it (I am a photographer first but I want to start making cinematic vlogs/filmswhatever) . The 6D Mark II is wonderful, but I am left a bit disappointed by it's video specs. I could sell this camera on my local classifieds and get pretty much what I paid for it back and I was wondering if I should switch to something like a Nikon D610 for photo and maybe buy a 35mm 1.4 ART (I already have -----> AI !!!  lenses) and split that money in half so I can get a dedicated video camera like a panasonic G7 and adapt some -----> AI !!!  lenses I got from my film kit. Is this a good/bad idea? ", "link": "https://www.reddit.com/r/photography/comments/a3imwu/gear_dilemma_whats_your_thoughts/"}, {"autor": "brunotaut", "date": "2018-12-15 00:27:52", "content": "The Ultimate List of photo editing tools in 2018. 210 pieces of software (excluding mobile) /!/ Hey, photo lovers!\n\nAnother year passed and I’m here with the renewed list of photo editing software.\n\nThe short story behind this list: I’ve started this research for my project [Photolemur](https://photolemur.sjv.io/nLVm6) in July 2016.\n\nThe first list was '61 Photo Editing Tools and Apps'. After the very first post in 2016, I’ve got a lot of suggestions from redditors and decided to complete another list [104 Photo Editing Tools You Should Know About](https://www.reddit.com/r/photography/comments/50613q/104_photo_editing_tools_you_should_know_about/).\n\nThen, Michael Zhang, Petapixel’s Editor, asked me to repost this list on Petapixel. The article got 5,419 shares and tons of comments with a new portion of great tools for photo editing. The next list came with [148 photo editing tools](https://petapixel.com/2016/11/01/148-photo-editing-tools-apps/) Then, ten months after, I’ve published a new list [186 photo editing tools and apps. The biggest list ever existed](https://www.reddit.com/r/photography/comments/72sg6a/186_photo_editing_tools_and_apps_the_biggest_list/).\n\nToday I’m no longer with Photolemur (I’ve left Photolemur a week ago). But I decided to continue doing this research. And the next steps will be putting all this software to the website with filters and user rating option. Actually, I’ve already bought the domain :) [photo-index.com](http://www.photo-index.com)\n\nIf someone of you, redditors wants to help me with building the website - just send me a message.\n\n**What has changed in the new list:**\n\nSome of the apps had gone away from the market (you’ll find them in the list). Also, during my new research, I’ve found that there is almost 100 photo editing mobile apps on the market (in the previous list there were only 31 mobile apps). And I decided to create the separate list of photo editing mobile apps. It will be live very soon! So, there is no mobile apps section in this list. I’ve got a lot of comments about including some kind of recommendations to the list. So, the first 5 to 10 items in each section are the best one (in my personal opinion).\n\nAs always, I want to say thank you, redditors!\n\nIn the beginning, there were only 61 photo tools, and I thought that it’s a huge list!  :)\n\n**Now we have the list of 210 tools for photo editing and photo manipulation (excluding 97 mobile apps)!**\n\n* Enhancers (10)\n* Cross-platform image editors (5)\n* Online photo editors (16)\n* Paid Desktop Photo Editors (26)\n* Free Desktop Photo Editors (14)\n* RAW Processors (21)\n* HDR photo editors (15)\n* Photo viewers and managers (17)\n* Face Editing Software (9)\n* Image Enlargers &amp; Resizing Software (15) ^(new)\n* Photo Utilities, Plugins, Filters &amp; Effects (62)\n\n**Photo Enhancers**\n\n1.[Photolemur](https://photolemur.sjv.io/nLVm6) Fully automated photo enhancement solution to make all photos perfect. It is powered by an -----> AI !!!  algorithm that fixes imperfections on images without human involvement. From $35 ($30 in 2017)\n\n2.[Perfectly Clear](http://www.athentech.com) photo editor with a set of automatic correction presets for Windows&amp;Mac. $129 ($149 in 2017)\n\n3.[Ashampoo Photo Optimizer 6](https://www.ashampoo.com/en/usd/pin/1157/multimedia-software/Ashampoo-Photo-Optimizer-6) Software revitalizes photos at the click of a button. Optimize colors and contrasts, adjust the sharpness, remove scratches and noise and realign photos - fast, simple, no prior knowledge required. $8.99 ($20 in 2017)\n\n4.[Photosense](http://veprit.com/photosense) Quick and easy batch photo enhancement software for Mac &amp; iOS. $19.99 ($18.97 in 2017)\n\n5.[Akvis Enhancer](https://www.cleverbridge.com/250/?affiliate=43964&amp;scope=checkout&amp;cart=25808) the program offers a fast method to fix a dark picture, improve detail on an image, increase contrast and brightness, and adjust tones. $69\n\n6.[Enhance Pho.to](http://enhance.pho.to) online photo enhancer. Lets to fix the most such problems of digital pictures: fix dull colors and bad color balance; remove digital noise; remove red-eye in photos of people\n\n7.[PhotoEQ](https://www.softcolorsoftware.com/photoeq/) SoftColor PhotoEQ makes digital image improvement simpler on your PC. PhotoEQ works with a variety of photo formats, including RAW files. $69\n\n8.^(new) [Vivd Pix Restore](https://www.vivid-pix.com/restore/buy.html) Provides 1-click improvement for scanned Color Slides, Prints (Color, Black &amp; White, Sepia) and Digital Photos. Fine-tune with easy-to-use sliders. For Mac &amp; Windows. $49.99\n\n9.^(new) [FixAnyColor](http://www.srs1software.com/FixAnyColor.aspx) Lets you selectively adjust colors in your digital photos. It combines sophisticated L*C*h\\* color processing and fuzzy logic technology with an easy-to-use interface. For Windows. $59.99\n\n10. ^(new) [PictureSpeed](https://ai.skylum.com/) Cloud-based solution for Businesses to automatically enhance images, using the power of artificial intelligence\n\n&amp;#x200B;\n\n**Cross-platform image editors**\n\n1.[Lightroom](https://lightroom.adobe.com) There is no need to present Lightroom. Now it becomes a really cross-platform photo editor. $9.99/Mo. for Adobe CC Photography Plan (Lr+Ps).\n\n2.[Photoshop](https://lightroom.adobe.com) The second photo editing masterpiece from Adobe. The same story: it becomes a really cross-platform photo editor. $9.99/Mo. for Adobe CC Photography Plan (Lr+Ps)\n\n3.[polarr](https://www.polarr.co) Pro photo editor designed for everyone $2.49/Mo. (old price - $19.99)\n\n4.[Pixlr](https://pixlr.com) Online+mobile photo editor. High-end photo editing and quick filtering. $5/Mo. for Pro Subscription. (in 2017 it was Free)\n\n5.[Fotor Pro](http://www.fotor.com) cross-platform editor and designer, available on every major mobile device, desktop computer and online with One-Tap Enhance’ tool and RAW file processing. $3.33/Mo. for Pro Subscr. (in 2017 it was Free)\n\n&amp;#x200B;\n\n**Online photo editors**\n\n1.[PicMonkey](https://www.picmonkey.com/photo-editor) one of the most popular online picture editors. $7.99/Mo.\n\n2.[Befunky](https://www.befunky.com) free online photo editor and collage maker. $4.99/Mo.( Plus Plan)\n\n3.[pho.to](http://editor.pho.to) free simple online photo editor with pre-set photo effects for an instant photo fix\n\n4.[Ribbet](http://www.ribbet.com) Ribbet lets you edit all your photos online, and love every second of it. From $4.95\n\n5.[Canva](https://www.canva.com/photo-editor/) Online photo editor to filter, resize or adjust the images. Free for personal use. From $12.95/Mo.\n\n6.[Sumopaint](http://www.sumopaint.com/home/) the most versatile photo editor and painting application that works in a browser. From $9/Mo. (in 2017 it was Free)\n\n[~~Preloadr~~](http://www.preloadr.com)\n\n7.[Lunapic](http://lunapic.com/editor/) simple free online editor\n\n8.[Picture2life](https://www.picture2life.com/welcome/Default.aspx?auth=NotLoggedIn) An Ajax-based photo editor. It’s focused on grabbing and editing images that are already online. The tool selection is average\n\n[~~Pics.io~~](http://pics.io)\n\n9.[pizap](http://www.pizap.com) online photo editor and collage maker. $2.99 for Pro Plan. (in 2017 it was $29.99/year)\n\n10.[Fotostars](https://fotostars.me/en-US/) Edit your photos using stylish photo effects. Free\n\n11.[Avatan](http://avatan.ru/#/) free online photo editor&amp;collage maker\n\n12.[FotoFlexer](http://fotoflexer.com) photo editor and advanced photo effects for free\n\n[~~Image Enhancer by Canon~~](https://edge.canon.co.in/ImageEnhencer.aspx)\n\n13.^(new) [Fotojet](https://www.fotojet.com/features/photo-editor/photo-enhance.html) Software has everything you need to enhance your photos! Such as improving photos' colors, lights, sharpness etc. From $6.99/Mo.\n\n14.^(new) [FreeOnlinePhotoEditor](https://www.freeonlinephotoeditor.com) Upload your picture or photo or enter the URL of an image on the Internet. After uploading, you can resize, sharpen and/or rotate your photo. Plus several filters. Free\n\n15.^(new) [Film Emulator](https://29a.ch/film-emulator/) Online photo editor with a set of filters.  Free\n\n16.^(new) [Fun Photo Box](http://photoeditor.funphotobox.com/) Edit photos online: crop, resize, enhance, change focus, brightness, contrast, saturation &amp; warmth, add text, add stickers. Free\n\n# Desktop Photo Editors\n\n**Paid Desktop Photo Editors**\n\n1.[Photoshop](http://www.photoshop.com) mother of all photo editors. $9.99/Mo. for Adobe CC Photography Plan (Lr+Ps).\n\n2.[Lightroom](http://www.adobe.com/products/photoshop-lightroom.html) a photo processor and image organizer developed by Adobe Systems. $9.99/Mo. for Adobe CC Photography Plan (Lr+Ps).\n\n3.[ON1 Photo RAW](https://www.on1.com/) professional photo editor with an easy-to-use interface. $99.99 per license. ($90 in 2017).\n\n4.[Luminar 3](https://macphun.evyy.net/c/1328824/320119/3255) powerful photo editor for Mac and Windows with more powerful controls than in Lightroom and the world's first AI-powered photo filter. $69\n\n5.[Affinity](https://affinity.serif.com/en-gb/photo/) Professional photo editing software for Mac. $49.99\n\n6.[DXO Photo Suite](http://www.dxo.com/us/photography) Powerful photo editing software. From 129€\n\n7.[Pixelmator](http://www.pixelmator.com/mac/) Powerful, fast, and easy-to-use image editor. $29.99\n\n8.[Capture One](https://www.phaseone.com/en/Products/Software/Capture-One-Pro/Highlights.aspx) Professional raw converter and image editing software designed for professional photographers who need to process large volumes of high-quality images in a fast and efficient workflow. $299\n\n9.[Pictorial](http://www.picktorial.com) Editor with an impressive array of powerful professional tools, such as non­destructive RAW editing, and high­ quality retouching. From $9.99/Mo ($24.99 in 2017)\n\n10.[Corel Paintshop Pro](https://store.paintshoppro.com/1184/cookie?affiliate=43964&amp;redirectto=https%3A%2F%2Fwww.paintshoppro.com%2Fen%2Fproducts%2Fpaintshop-pro%2F&amp;redirecthash=EF5E25C0206CBB9458E502D5FEAAF596) Professional photo editor with the world's fastest RAW photo processor. $80\n\n11.[Zoner](https://www.zoner.com) Everything from downloading onto your computer to editing and sharing, all in one place. For Windows only. $99\n\n12.[Radlab](https://www.gettotallyrad.com/radlab) combines intuitive browsing, gorgeous effects and a lightning-fast processing engine for image editing. $149\n\n13.[Acorn 5](http://www.flyingmeat.com/acorn/) an image editor for macOS 10.10 and later. $29.99\n\n14.[Photo Plus](http://www.serif.com/photoplus/) Easy-to-use professional photo editor for PC. $99.99\n\n15.[Photomizer](http://www.engelmann.com/en-us/photomizer.php?affChecked=1) Optimize and repair digital photos. $34.99\n\n16.[Picture Window Pro](http://www.dl-c.com) powerful photo editing tool for Win, designed for serious photographers with demanding creative and quality standards. $89.95\n\n17.[PhotoLine](http://www.pl32.net) Raster and vector graphics editor for Win&amp;Mac. Its features include 16 bits of color depth, full-color management, support of RGB, CMYK, and Lab color models, layer support, and non-destructive image manipulation. 59.00€\n\n18.[Inpixio](https://www.inpixio.com) A set of tools for photo editing including Photo Clip, Photo Editor, Photo Focus, Photo Maximizer, Photo Eraser. The software helps photo enthusiasts to delete,  cut out objects, create photo montages and optimize images. From $19.9\n\n19.[Photo Lab 4](http://www.selteco.com/photolab/) easy photo editing software for Win. $49\n\n20.[Home Photo Studio](http://home-photo-studio.com) desktop photo editing software for Windows. The program includes photo editing options, such as auto enhancement, retouching, red-eye removal, etc. More than 100 special effects can be applied to the images. From $29\n\n21.^(new) [Photoscape X Pro](http://x.photoscape.org) All-in-one photo editing software which provides photo-related features such as Photo Viewer, Editor, Cut Out, Batch, Collage, Screen Capture, RAW images and More. For Win only. $29\n\n22.^(new) [Movavi Photo Editor](https://www.movavi.com/mac-photo-editor/) Enhance image quality manually or automatically. Erase unwanted objects from photos. Remove and change image backgrounds. Crop, flip, rotate, resize and straighten pictures. For Mac &amp; Win. $19\n\n23.^(new) [Ashampoo Photo Commander 16](https://shop.ashampoo.com/10/cookie?affiliate=43964&amp;expiry=30&amp;redirectto=https%3A%2F%2Fwww.ashampoo.com%2Fp%2F2118&amp;redirecthash=E23C8D057EC1F35D355D55606C699B69) The complete solution to view, edit and organize your photos. For Win. From $49.99\n\n24.^(new) [Pixeluvo](http://www.pixeluvo.com/) A Beautifully Designed Image and Photo Editor for Win&amp;Linux. $34\n\n25.^(new) [Xara PHOTO &amp; GRAPHIC DESIGNER](http://www.xara.com/us/photo-graphic-designer/) The software choice for photo and graphic design work, with powerful photo editing and enhancement features, and flexible illustration and design tools. For Win. $59.99\n\n26.^(new) [CyberLink PhotoDirector Ultra](https://www.cyberlink.com/products/photodirector-ultra/) A wide range of easy-to-use, professional-quality tools built specifically for turning your photos into stunning artwork. $14.99/Mo.\n\n&amp;#x200B;\n\n**Free Desktop editors**\n\n1.[Apple Photos](https://www.apple.com/osx/photos/) Photos in macOS helps you keep your growing library organized and accessible. Powerful and intuitive editing tools help you perfect your images. Free\n\n2.^(new) [Microsoft Photos](https://www.apple.com/osx/photos/) View and edit your photos and videos, make movies, and create albums. Free\n\n3.[G’MIC](http://gmic.eu) Full featured framework for image processing with different user interfaces, including a GIMP plugin to convert, manipulate, filter, and visualize image data. For Win&amp;Mac\n\n4.[GIMP](http://www.gimp.org) Cross-platform image editor. Free software, you can change its source code and distribute your changes.\n\n5.[Krita](https://krita.org/en/) Digital painting and illustration application with CMYK support, HDR painting, G’MIC integration and more\n\n6.[Pinta](https://pinta-project.com/pintaproject/pinta/) Pinta is a free, open source program for drawing and image editing.\n\n7.[Photoscape](http://www.photoscape.org) a simple, unusual editor that can handle more than just photos.\n\n8.[Paint.net](http://www.getpaint.net/index.html) Free image and photo editing software for PC.\n\n9.[Imagemagick](http://www.imagemagick.org/script/index.php) A software suite to create, edit, compose or convert images on the command line.\n\n10.[Picture.st](http://picture.st) Edit, crop and share your photos.\n\n11.[Photodemon](http://photodemon.org) Free portable photo editor for Win\n\n12.^(new) [Fotoxx](https://kornelix.net/fotoxx/fotoxx.html) Free open source Linux program for image editing and collection management.\n\n13.^(new) [GraphicsMagick](http://www.graphicsmagick.org/) Comprised of 267K physical lines of source code in the base package GM provides a robust and efficient collection of tools and libraries which support reading, writing, and manipulating an image in over 88 major formats.\n\n14.^(new) [Beauty &amp; Face Photo Editor](https://www.microsoft.com/en-us/p/beauty-face-photo-editor/9ng1r7g8rh2t?activetab=pivot:overviewtab) Software lets you create amazing collages using your photos, cool stickers, backgrounds, emojis, text with fun fonts.\n\n&amp;#x200B;\n\n**RAW Processors**\n\n1.[Lightroom](http://www.adobe.com/products/photoshop-lightroom.html) cross-platform photo processor and image organizer developed by Adobe Systems. $9.99/Mo. (Lr+Ps).\n\n2.[Luminar 3](https://macphun.evyy.net/c/1328824/320119/3255) Powerful photo editor for Mac&amp;Win with more powerful controls than in Lightroom and proprietary RAW processing algorithms. $69\n\n3.[Rawtherapee](http://rawtherapee.com) A cross-platform raw image processing program, released under the GNU General Public License Version 3\n\n4.[Darktable](http://www.darktable.org) An open source photography workflow application and RAW developer.\n\n5.[Aftershot Pro 3](https://store.aftershotpro.com/1184/cookie?affiliate=43964&amp;redirectto=http%3A%2F%2Fwww.aftershotpro.com%2Fen%2Fproducts%2Faftershot%2Fpro%2F&amp;redirecthash=F40CACF847344C9C859EB594109386B7) Edit faster and get back behind your camera where you belong with the world's fastest RAW photo-editing software. $69\n\n6.[RAW Pics.io](https://raw.pics.io/ru/) The most popular in-browser RAW files viewer and converter. Support the most DSLR RAW camera formats. $1.99/Mo.\n\n7.[UFRaw](http://ufraw.sourceforge.net) Utility to read and manipulate raw images from digital cameras. It can be used on its own or as a GIMP plug-in.\n\n8.[Photivo](http://photivo.org) Handles your raw files, as well as your bitmap files, in a non-destructive 16-bit processing pipeline.\n\n9.[Filmulator](https://github.com/CarVac/filmulator-gui) Streamlined raw management and editing application centered around a film-simulating tone mapping algorithm.\n\n10.[PhotoFlow](http://aferrero2707.github.io/PhotoFlow) Raw and raster image processor featuring non-destructive adjustment layers and 32-bit floating-point accuracy.\n\n11.[LightZone](http://www.lightzoneproject.org) Open-source digital darkroom software for Windows/Mac/Linux\n\n12.[RAW Photo Processor](https://www.raw-photo-processor.com/RPP/Overview.html) Raw converter for Mac OS X, supporting almost all available digital Raw formats. Free\n\n13.[Iridient Developer](http://www.iridientdigital.com/products/rawdeveloper.html) Powerful RAW image conversion application designed and optimized specifically for Mac OS X. Supports RAW image formats from over 620 digital camera models. $99\n\n14.[Photoninja](http://www.picturecode.com/index.php) Professional-grade RAW converter that delivers exceptional detail, outstanding image quality, and a distinctive, natural look. $129\n\n15.[RawDigger](http://www.rawdigger.com) Raw Image Analyzer. $19.99\n\n16.[Fastrawviewer](http://www.fastrawviewer.com) WYSIWYG RAW viewer that allows to see RAW exactly as a converter will \"see\" it, and provides RAW-based tools to estimate what a converter will be able to squeeze from the shot. From $19.99\n\n17.[Silkypix Developer Studio Pro 9](https://silkypix.isl.co.jp/en/product/dsp9/) RAW development software for professionals to enable a partial color correction by circular/gradual filter, or equips with completely new sharpness from superior outline detection algorithm. $175 ($213.90 in 2017).\n\n18.[Exposure X4](https://www.alienskin.com?rfsn=900412.b77ab) Advanced creative photo editor and organizer that improves every step in your editing workflow. $149\n\n19.[Canon Digital Photo Professional](http://www.canon-europe.com/support/camera_software/) High-performance RAW image processing, viewing and editing software for EOS digital cameras and PowerShot models with RAW capability. Free\n\n20.[Hasselblad Phocus](http://www.hasselblad.com/software/phocus) Free image processing software, which delivers the best quality RAW file processing, has been updated and expanded with new features that work seamlessly with the Hasselblad cameras.\n\n21.^(new) [DxO PhotoLab](https://www.dxo.com/dxo-photolab/) Powerful photo editing software for. From 129€\n\n&amp;#x200B;\n\n**HDR Photo Editors**\n\n1.[Aurora HDR](https://macphun.evyy.net/c/1328824/309505/3255) The most advanced HDR photo editor for Mac&amp;Win. $99\n\n2.[Photomatix](https://www.hdrsoft.com) One of the first HDR photo editors in the world for Windows and Mac. From $39\n\n3.[Hydra](http://www.creaceed.com/hydra) Lets you create beautiful HDR images by merging multiple exposures, effectively capturing both dark and bright subjects to make it more natural or to enhance scene drama. $49.99 ($60 in 2017)\n\n4.[Machinery HDR](http://www.machineryhdr.com) Easy and powerful HDR photo editor. $39\n\n5.[HDR Darkroom](http://www.everimaging.com/software/hdr-darkroom/) Fast and easy-to-use software for Mac&amp;Win for creating impressive landscape images. $89 ($90 in 2017).\n\n6.[EasyHDR](http://www.easyhdr.com) HDR image processing software for Win&amp;Mac. $35 ($39 in 2017)\n\n7.[HDRExpress](http://pinnacleimagingsystems.com/products/hdr-express-3) easy to use HDR processing software for Mac&amp;Win. $79\n\n8.[Photo-kako](http://www.photo-kako.com/en/hdr.cgi) The free online photo editor, a photo-like composite can be processed into HDR images.\n\n9.[Light Compressor](http://lightcompressor.com) Simple post processing app that lets you combine multiple exposures into a high dynamic range image for Mac. $3.99\n\n10.[Photo Engine](http://www.oloneo.com) Professional HDR Imaging, RAW Processing &amp; Dynamic Relighting. Application to offer digital photographers full control over light and exposure in real-time, as if they were still behind the lens. $149\n\n11.[Fotor HDR](http://www.fotor.com/features/hdr.html) Free online HDR photo editor.\n\n12.[Dynamic Photo HDR](http://www.mediachance.com/hdri) Next generation HDR Software with Anti-Ghosting, HDR Fusion and Unlimited Effects for Win. $59 ($65 in 2017)\n\n13.[LuminanceHDR](http://qtpfsgui.sourceforge.net) Free application to provide a workflow for HDR imaging, creation, and tone mapping.\n\n14.[HDRMerge](http://jcelaya.github.io/hdrmerge/) Free software, that combines two or more raw images into a single raw with an extended dynamic range.\n\n15.[EnfuseGUI](http://software.bergmark.com/enfusegui/Main.html) An Open Source command-line application for creating images with a better dynamic range by blending images with different exposures. Free\n\n&amp;#x200B;\n\n**Photo viewers and managers**\n\n1.[Lightroom](http://www.adobe.com/products/photoshop-lightroom.html) cross-platform photo processor and image organiser developed by Adobe Systems. $9.99/Mo. for Adobe CC Plan (Lr+Ps).\n\n2.[Acdsee](http://www.acdsee.com/en/products/acdsee-ultimate-9) Photo manager, editor and RAW processor with non destructive layer adjustments all in one. Quick straighten/rotate, rename, batch tools etc. $50\n\n3.[Apple Photos](https://www.apple.com/osx/photos/) Helps you keep your growing library organized and accessible. Powerful and intuitive editing tools help you perfect your images. Free\n\n4.[Microsoft Photos](https://www.apple.com/osx/photos/) View and edit your photos and videos on Windows, make movies, and create albums. Free\n\n[~~Phase One MediaPro1~~](https://www.phaseone.com/MediaProSE)\n\n5.^(new) [Luminar 3](https://macphun.evyy.net/c/1328824/320119/3255) powerful photo editor for Mac and Windows with more powerful controls than in Lightroom and the world's first AI-powered photo filter. In December 2018 comes out with Asset Manager. $69\n\n6.[Digicam](https://www.digikam.org) Advanced digital photo management application for importing and organizing photos. Free\n\n7.[gThumb](https://wiki.gnome.org/Apps/gthumb) Image viewer and browser. Also includes an importer tool for transferring photos from cameras. Free\n\n8.[Nomacs](http://nomacs.org) Free, open source image viewer, which supports multiple platforms. You can use it for viewing all common image formats including raw and psd images.\n\n9.[Google Photos](https://photos.google.com) All your photos are backed up safely, organized and labeled automatically, so you can find them fast, and share them how you like. Free\n\n10.[FastStone](http://www.faststone.org/FSViewerDetail.htm) Fast, stable, user-friendly image browser, converter and editor. Free for Home Users. $35\n\n12.[Auslogics](http://www.auslogics.com/en/software/duplicate-file-finder/) Software for finding exact duplicate images. Free\n\n13.[Irfanview](http://www.irfanview.com)  An image-viewer with added batch editing and conversion. Rename a huge number of files in seconds, as well as resize them. Free\n\n14.[XnViewMP](http://www.xnview.com/en/) Free software for reading, viewing, and processing all your images on Mac, Win, Linux, iOS and Android\n\n15.^(new) [Cannon Irista](https://www.irista.com/)\n\n16.^(new) [Magix Photo Manager Deluxe](http://www.magix.com/us/photo-manager-deluxe/) Allows you to easily browse, sort and rediscover your most beautiful photos &amp; videos. Breathe new life into your most beautiful moments. $49.99\n\n17.^(new) [KPhotoAlbum](https://www.kphotoalbum.org/) Free tool which you can use to easily sort your images.\n\n&amp;#x200B;\n\n**Face Retouching Software**\n\n1.[PortraitPro](http://www.portraitprofessional.com) The world’s best-selling retouching software, that intelligently enhances every aspect of a portrait for beautiful results. $44.95 ($80 in 2017)\n\n2.[Portraiture](http://www.imagenomic.com/pt.aspx) Professional skin retouching software. A Photoshop, Lightroom and Aperture plugin that eliminates the tedious manual labor of selective masking and pixel-by-pixel treatments to help you achieve excellence in portrait retouching. $199.95\n\n3.[ImprovePhoto](http://improvephoto.net) basic automatic free online face retouching software.\n\n4.[Pinkmirror](https://pinkmirror.com) Online photo retouching app that automatically slims the face, lift cheeks and cleans the skin. Subscription from $30/6 Mo.\n\n5.^(new) [Picmonkey](https://www.picmonkey.com/touchup) Face editor is perfect for light photo retouching or full on digital makeup. $7.99/Mo.\n\n6.^(new) [Photolemur](https://photolemur.sjv.io/nLVm6) Fully automated photo enhancement solution to make all photos perfect. v.3 of the software includes automatic face retouching functions. $35 (old price $30)\n\n7.^(new) [Makeup Pho.to](http://makeup.pho.to/) Virtual makeup in a click: remove red eyes, get rid of acne and wrinkles and whiten the teeth. Free\n\n8.^(new) [Photo Makeup Editor](http://www.softsea.com/review/Photo-Makeup-Editor.html) Software that will make you look gorgeous in no time. It's all about making photographed people look better. For Windows only. Free\n\n9.^(new) [Makeover](http://makeovr.com/modiface/index.php) Feature the world's most advanced virtual makeover technology with industry leading facial recognition. Online, Mac, Android.\n\n&amp;#x200B;\n\n**Image Enlargers &amp; Resizing Software**\n\n1.[A.I.Gigapixel](https://topazlabs.com/ai-gigapixel/) Desktop software for Mac &amp; Win that enlarges images up to 600% with A.I. upsampling technology. $99.99\n\n2.[Inpixio Photo Maximizer](https://www.inpixio.com/photo-maximizer/) An easy to use photo editor that allows users to produce high resolution photos from any digital picture you have on your device. $59\n\n3.[ON1 Resize 2018](https://www.on1.com/products/resize/) Desktop Image Resizer for Big Prints. For Mac&amp;Win. $79.99\n\n4.[Blowup (by Alienskin)](https://www.alienskin.com/blowup/) Image enlargement app that enables you to easily create sharp enlargements at any size. $99\n\n5.[AKVIS Magnifier](https://www.cleverbridge.com/250/?affiliate=43964&amp;scope=checkout&amp;cart=30645) The program allows enlarging an image to a super-high resolution of up to 300,000 x 300,000 pixels, making a 90 gigapixel poster. $89\n\n6.[Let's Enhance](https://letsenhance.io) Cloud solution for upscaling images 4x times + noise removal. $6.99/Mo.\n\n7.[Fotophire Maximizer](https://photo.wondershare.com/photo-maximizer.html) Desktop software for Windows that enlarge your photo by 1000% without losing quality. $29.99 / 1 Year Subscr.\n\n8.[PhotoEnlarger](https://www.photoenlarger.com/) Free online image enlarge service.\n\n9.[ImageEnlarger](https://www.imageenlarger.com/) Another free online image enlarge service.\n\n10.[A Sharper Scaling](http://a-sharper-scaling.com/) A high-quality image scaling technology mainly developed for upscaling. An implementation for Win is available as freeware.\n\n11.[SmillaEnlarger](https://smillaenlarger.soft112.com/) Small graphical tool (based on Qt) to resize, especially magnify bitmaps in high quality. The app is currently available in English and it was last updated on 2010-04-08. The program can be installed on OS X Linux Vista. Free\n\n12.[Reshade](http://reshade.com/) Free desktop image enlarger (up to 400%) for Win\n\n13.[PhotoZoom Pro 7](https://www.benvista.com/photozoompro) Desktop software for Mac&amp;Win. Software not only creates larger images than any other software (up to 1 million by 1 million pixels), it also produces higher quality results. €159.00\n\n14.[Stoik Start resizer](http://www.stoik.com/products/photo/STOIK-Smart-Resizer/) Reduce or Enlarge Images up to 1000% Without Losing Quality. $49\n\n15.[Super Resolution](https://superresolution.skylum.com/) The new generation of image upscaling for Businesses, powered by Artificial Intelligence. Cloud solution. Price by the request\n\n&amp;#x200B;\n\n", "link": "https://www.reddit.com/r/photography/comments/a6ak27/the_ultimate_list_of_photo_editing_tools_in_2018/"}], "name": "Subreddit_photography_01_01_2018-30_12_2018"}