{"interestingcomments": [{"autor": "JanuaryOrchid", "date": "2018-10-18 00:10:14", "content": "Does the wireless remote drain the battery a lot? /!/ Running a Nikon D5300 with an -----> ML !!! -L3 remote. I feel like the batter drains super fast when using the remote, like maybe 3 times faster. Is that normal?", "link": "https://www.reddit.com/r/Nikon/comments/9p43y1/does_the_wireless_remote_drain_the_battery_a_lot/"}, {"autor": "chulgor", "date": "2018-10-15 06:51:17", "content": "Nikkor 43-86mm f/3.5 -----> AI !!!  /!/ Raise your hand if you know this lens!\n\nThe [first version of the 43-86mm f/3.5](http://www.mir.com.my/rb/photography/companies/nikon/nikkoresources/zoomsMF/4386mm.htm), introduced in 1963, was one of Nikon's first zoom lenses. According to historians of the brand, it was huge hit. But, optically, it was not very good...and once zooms became commonplace, the original 43-86 came to be known as one of Nikon's *worst* lenses.\n\nNikon improved the lens markedly with a 1976 redesign. The revised optical formula was carried over to the [AI model of 1979](http://www.mir.com.my/rb/photography/companies/nikon/nikkoresources/zoomsMF/4386mm1.htm), which is the version that is subject of this post.\n\nAs [Bjørn Rørslett](http://www.naturfotograf.com/lens_zoom_02.html#MF43-86) writes, the new version, although much improved over the original, could not overcome its horrendous reputation. But I've always been curious about this lens, and I finally decided to acquire a sample. It's the one pictured here. I bought it on eBay for $39 plus shipping.\n\nSo, how is it? It's actually not that bad! I quite like it.\n\nFirst, the lens is a very handy size. It's a push-pull zoom that extends with increasing focal length. At the minimum of 43mm, it's about the same length as the AF-S Nikkor 24-85mm f/3.5-4.5G when that lens is at its shortest—but *much* slimmer. Zooming in to 86mm adds less than an inch to the length. The weight of the two lenses is almost the same; but the 43-86, being much more compact, is much denser, and this translates to feeling of impressive heft in the hand. It balances very nicely when mounted on my FX body.\n\nThe ergonomics of the lens are excellent. It's a one-touch design: the same ring controls focus by turning, and focal length by sliding. The focus action is second to none—the feel is wonderfully slick, yet well-damped; and there is *zero* play in the helicoids. The sliding zoom action feels similarly luxurious. And the aperture ring on this lens is the best I have ever used. The detentes are impossibly clicky and positive; they emit a wonderful \"snick-snick\" sound as you turn the ring.\n\nNow, optically, the lens is a far cry from the objective (pun intended!) perfection of the latest $2K pro zooms. Wide open, the uneven field curvature and undercorrected coma of the design is quite apparent. At f/3.5 the image center is only a bit soft, but IQ degrades significantly about halfway out to the edges before coming back a little at the extremes. There's not a *lot* of the dreamy glow that some other old Nikkors (such as the 50mm f/1.2 and the 35mm f/1.4) are well known for, but there is an indefinable, unique quality to images shot wide open that I'm quite partial to. [Here is an example involving breakfast](https://c2.staticflickr.com/2/1938/45272479482_94c0c57f15_o.jpg), taken at 86mm and f/3.5.\n\nStop down to f/8, though, and the lens produces uniformly sharp images with good contrast. Check out this [photo of a fine-dining restaurant](https://c2.staticflickr.com/2/1904/45272478192_5081ede991_o.jpg), taken at f/8 (also at 86mm). Examine it at 100% magnification on a 4K display: do you really need a sharper image than that?\n\nMany, if not most, shooters balk at the idea of a 2x zoom range that begins at the odd-duck focal length of 43mm and ends at 86mm: it's far too long at the short end, or doesn't go far enough on the long. What good is such a range for? Well, if you don't think of the lens as an alternative to a 24-70, but instead think of it as a normal lens and a portrait lens in one, you might find it useful after all. I know I do.\n\nDon't let this lens's junk-like price dissuade you from giving it a try. Admittedly, I'm a bargain-glass fetishist whose most expensive lens *was* an AF-S 24-120mm f/4G—before I sold it to support my manual-focus addiction. Not exactly a high-end lens. So, I'm accustomed to working with—even cherishing—old, imperfect gear. There are those who would think it morally offensive, or at best just childish, to waste time putting a $40 piece of shitty glass on an FX body...and they're right! But who cares. You might have some fun with it.", "link": "https://www.reddit.com/r/Nikon/comments/9oad1i/nikkor_4386mm_f35_ai/"}, {"autor": "fixitwolfe7", "date": "2018-09-09 20:26:41", "content": "Good grease for super stiff focus - Nikkor micro 55m f/2.8 -----> Ai !!! -s /!/ [removed]", "link": "https://www.reddit.com/r/Nikon/comments/9eg6s7/good_grease_for_super_stiff_focus_nikkor_micro/"}, {"autor": "vmflair", "date": "2018-09-07 03:35:20", "content": "Heron Daydreaming [D700 + ED 400/2.8 -----> AI !!! -S]", "link": "https://www.reddit.com/r/Nikon/comments/9dqfw7/heron_daydreaming_d700_ed_40028_ais/"}, {"autor": "XDenzelMoshingtonX", "date": "2018-09-06 10:53:20", "content": "What legacy tele prime should I get? /!/ Hey guys!\nI'm looking for input on vintage tele primes to add some flavour to my portraiture. Currently looking at both the 180mm -----> AI !!! -S 2.8 and 135mm -----> AI !!! -S 2.8. \nI know of the 105 2.5 but it's too close to my 85mm to really make a difference so the lens should ideally be longer than 105mm. What lenses do you suggest? \nI don't need the AF as this will be more of a gimmicky toy I want to try out.  ", "link": "https://www.reddit.com/r/Nikon/comments/9dhb48/what_legacy_tele_prime_should_i_get/"}, {"autor": "jipvk", "date": "2018-02-04 11:51:03", "content": "Friends on HP5+ with Nikon FM3a and Nikkor -----> Ai !!! -S 1:1.2/50mm", "link": "https://www.reddit.com/r/Nikon/comments/7v6bxb/friends_on_hp5_with_nikon_fm3a_and_nikkor_ais/"}, {"autor": "Broken_Perfectionist", "date": "2018-02-01 14:23:05", "content": "Yesterday's Lunar Eclipse/Blue Moon setting over EAGLES green lit Philly skyline ! (Nikon D810, 600mm -----> Ai !!!  f/5.6, ISO1000, F5.6, 1/100s, Single Shot (not a composite), tripod with gimbal head looking over 6 miles away)• r/philadelphia", "link": "https://www.reddit.com/r/Nikon/comments/7uj1fh/yesterdays_lunar_eclipseblue_moon_setting_over/"}, {"autor": "Vlaitor", "date": "2018-04-18 20:35:01", "content": "Voigtlander 58mm 1.4 SL II on DX? /!/ Hello everyone,\nThis might seems like a weird question but I am at two clicks to do the move.\nBasically, I've stumbled a review of some 58mm fast glass and this model came up quite often.\nI have many lenses but only the 50mm 1.8 -----> AI !!! -S when it comes to that range. \nSince I like the focal of 58mm for portrait on DX and the 1.4 + the cheap price I am very interested in this lens. \nAnyone here has any experience with this lens on a DX body?\nThank you!", "link": "https://www.reddit.com/r/Nikon/comments/8d8xhm/voigtlander_58mm_14_sl_ii_on_dx/"}, {"autor": "Skvora", "date": "2018-04-14 23:38:26", "content": "Spring has sprung. Df, 45 -----> Ai !!! -P @ 2.8. Watermark moreso for testing a new one.", "link": "https://www.reddit.com/r/Nikon/comments/8cbfam/spring_has_sprung_df_45_aip_28_watermark_moreso/"}, {"autor": "ja647", "date": "2018-05-23 23:21:30", "content": "dug and old gem... /!/ [Not the poochie, or the yard in a big mess, but a 50 f/2.0 -----> ai !!! -s that I purchased in 1978  (maybe '79\\).](https://imgur.com/oqTcRbn)\n\nI had been thinking about getting a 50 1.8g but maybe I'll just keep it at f/9 and see what happens. ", "link": "https://www.reddit.com/r/Nikon/comments/8lnxir/dug_and_old_gem/"}, {"autor": "_420_Braise_It_", "date": "2018-11-19 02:32:40", "content": "Grin and Freckle It | F3 | 35mm f1.4 -----> Ai !!! -S | Portra 400 | 5.6’ish 1/500’ish", "link": "https://www.reddit.com/r/Nikon/comments/9yci5d/grin_and_freckle_it_f3_35mm_f14_ais_portra_400/"}, {"autor": "Moeen_tahir", "date": "2018-11-18 22:57:01", "content": "Nikon 16-35mm VR Full-Frame FX VR f/4 with Nikon D3100 /!/ Hi Guys,\n\nHope somebody can help me to decide if i should do this or not,\n\nLittle history: I have been using D3100 for almost 5 years now and been using it with its prime lens (which came along with it) and two very old few lenses like Nikon 80-200mm f/4.5 N ,-----> AI !!!  Zoom-NIKKOR (1977-1981) and  Nikon 18mm f/4 , NIKKOR (1974-1981) - these lenses are all manual (As you can see, they are very old)  but i have learned alot only by using them on every occasion.\n\nAnyhow, now i have decided to put some money in my hobby,\n\n1. so i am still confused, if i should buy a camera body (Nikon D750) along with new Nikon 16-35mm VR full frame (for landscape photograpy)  - its very expensive\n\nOR\n\n2) just buy new Lens and it will work just fine as it is suppose to with NIkon D3100 camera body? reasonable price of lens but still less expensive then the 1st option\n\n&amp;#x200B;\n\nI surely dont want to use my old lenses now , no plans to use them in future.\n\nThanks", "link": "https://www.reddit.com/r/Nikon/comments/9yar2r/nikon_1635mm_vr_fullframe_fx_vr_f4_with_nikon/"}, {"autor": "Moeen_tahir", "date": "2018-11-18 22:46:29", "content": "Nikon 16-35mm VR Full-Frame FX VR f/4 with Nikon D3200 /!/ Hi Guys, \n\nHope somebody can help me to decide if i should do this or not, \n\nLittle history: I have been using D3100 for almost 5 years now and been using it with its prime lens (which came along with it) and two very old few lenses like **Nikon 80-200mm f/4.5 N ,-----> AI !!!  Zoom-NIKKOR (1977-1981)** and  **Nikon 18mm f/4** , **NIKKOR (1974-1981)** \\- these lenses are all manual (As you can see, they are very old)  but i have learned alot only by using them on every occasion. \n\nAnyhow, now i have decided to put some money in my hobby, \n\n1) so i am still confused, if i should buy a camera body (Nikon D750) along with new Nikon 16-35mm VR full frame (for landscape photograpy)  - its very expensive \n\nOR \n\n2) just buy new Lens and it will work just fine as it is suppose to with NIkon D3100 camera body? reasonable price of lens but still less expensive then the 1st option \n\n&amp;#x200B;\n\nI surely dont want to use my old lenses now , no plans to use them in future.\n\nThanks ", "link": "https://www.reddit.com/r/Nikon/comments/9yanwh/nikon_1635mm_vr_fullframe_fx_vr_f4_with_nikon/"}, {"autor": "Cory55102", "date": "2018-12-29 16:43:52", "content": "D7100 with -----> AI !!!  or -----> AI !!! s lenses /!/ I am curious if anyone has used any older lenses in their D7100 and if any of those lenses are recommended. I would like to consider some older glass at a reasonable price if the performance is good. Thanks!", "link": "https://www.reddit.com/r/Nikon/comments/aamn4i/d7100_with_ai_or_ais_lenses/"}, {"autor": "foxliver", "date": "2018-12-25 18:56:24", "content": "New to digital photography- non-cpu lens question /!/ I just got a d7200 and I have an old -----> AI !!! -S lens I was hoping to use with it. It is a 70-210mm zoom lens and I'm not sure what to enter in the focal length field for the non-cpu lens data. I've tried using it without specifying the focal length and it seems to work--sort of. If I try to use it at any aperture other than f16 or f22 the aperture in the viewfinder reads fEE and even at those apertures it is displaying incorrect aperture readings and the images are a little washed out looking compared to with using an AF-S DX lens. I'm not sure though if the unspecified focal length is the issue here though or if there's something else I'm missing. This is my first \"big boy\" digital camera, I'm used to my film SLR!", "link": "https://www.reddit.com/r/Nikon/comments/a9habl/new_to_digital_photography_noncpu_lens_question/"}, {"autor": "Oklawolf", "date": "2018-12-24 23:00:49", "content": "Christmas at the Old House - D5100, Nikkor 50mm -----> AI !!! -S, f2.8, 1/100, ISO 800", "link": "https://www.reddit.com/r/Nikon/comments/a99oqx/christmas_at_the_old_house_d5100_nikkor_50mm_ais/"}, {"autor": "iamscrooge", "date": "2018-03-07 01:24:03", "content": "What mechanism makes G lenses stop down on older film cameras? /!/ My understanding is that the aperture feeler is spring loaded and will always default back to a position which tells the camera that the aperture ring is set to wide-open, unless the tab is forcefully displaced by the tab on an aperture ring on an -----> ai !!! /-----> ai !!! s/af/afd lens.\n\nThe aperture lever on the lens is always actuated to the fully-open state when attached to an F mount camera (so it’s nice and bright when we peep through the viewfinder). The design of the aperture lever does not appear (visually at least) to differ between G and AI lenses.\n\nSo, the function of the aperture ring and aperture feeler coupling is to control how far the camera’s actuator *releases* the aperture lever on the camera - taking no action unless the lens is stopped down from wide open.\n\nTherefore - why do G lenses stop down to their smallest aperture when mounted on older film cameras?", "link": "https://www.reddit.com/r/Nikon/comments/82kf4x/what_mechanism_makes_g_lenses_stop_down_on_older/"}, {"autor": "slowcaptain", "date": "2018-09-21 02:03:42", "content": "Trying to learn manual focusing with Nikon D7200 coupled to 50mm -----> AI !!! -S series e", "link": "https://www.reddit.com/r/Nikon/comments/9hl7b1/trying_to_learn_manual_focusing_with_nikon_d7200/"}, {"autor": "tehnodeda", "date": "2018-09-04 20:38:53", "content": "Looking to go FX with D700 with a 9200 shutter count /!/ Hello everyone  \n\n\nI am an amateur photographer looking to make a switch to FX. Although that is probably not neccessary at the point, I have been amused by the D700 for a very long time, and today while I was going through the local ads I saw one with 9200 shutter count. It looks like it is in great condition, and that shutter count is insanely low for a now old body, all for price of **650 euros.**  \n\n\nThere were these ones aswell:  \n\n\n1. D700 with a 148k shutter count, loose rubbers, price **380 euros**\n2. D700 with a  57585 shutter count, two batteries, charger, and a  MB-D10 grip, price **540 euros**\n3. D700 with a 156k shutter count,  **Nikon -----> Ai !!! -S 35-70** lens,  **MB-D10 grip** ,  **Nikon BM-9** screen protector, and two batteries(one is not the original), price **590 euros**\n\n  \nAlthough the ones listed above have more additional items, the shutter count of only 9200 is pretty tempting.  \n\n\nI am currently having D7000 with a Nikon AF-S DX Micro NIKKOR 40mm f/2.8G lens, I wanted to do macro photography, however the lens I bought seems to be the best for stock photography, and too short for insects etc. Naturaly I would be looking into event photography as that is acctualy profitable in comparison.  \n\n\nI would look into selling the body and the lens(D7000 is at around 20k shutter count) which should put me at/around the price of the D700 hopefully.   \n\n\nPlease consider the fact that the average salary in my country is around 200 euros, thus buying new generation bodies is pretty much out of reach for quite some time.  \n\n\nI do belive that D700 gets a lot of love around Nikon photographers, so I am looking forward to hearing from you, which will help me to make a final descision.  \n\n\nI am including the picture of the D700 with 9200 shutter count.  \n[Nikon D700](https://www.kupujemprodajem.com//photos/oglasi/0/43/64795430/64795430_5b6da7361acc15-75875474218098.jpg)  \n\n\nBest regards and thank you for taking the time to read this.  \n\n\n**TL:DR - Found a D700 with 9200 shutter count, thinking of selling D7000 with 20k shutter count and a Nikon AF-S DX Micro NIKKOR 40mm f/2.8G lens in order to buy it**", "link": "https://www.reddit.com/r/Nikon/comments/9czhun/looking_to_go_fx_with_d700_with_a_9200_shutter/"}, {"autor": "Broken_Perfectionist", "date": "2018-09-02 07:19:19", "content": "2400mm unlocked! [Nikon D810, 600mm f5.6 -----> AI !!!  w/ TC-301 + TC-200 = 2400mm equivalent - Image stacked - Virtually Uncropped]", "link": "https://www.reddit.com/r/Nikon/comments/9cacgv/2400mm_unlocked_nikon_d810_600mm_f56_ai_w_tc301/"}, {"autor": "Broken_Perfectionist", "date": "2018-09-02 06:18:34", "content": "2400mm unlocked! [Nikon D810, 600mm f5.6 -----> AI !!!  w/ TC-301 + TC-200 = 2400mm equivalent - Image stacked - Virtually Uncropped]", "link": "https://www.reddit.com/r/Nikon/comments/9ca2gw/2400mm_unlocked_nikon_d810_600mm_f56_ai_w_tc301/"}, {"autor": "chulgor", "date": "2018-08-18 23:00:38", "content": "Daisies, Bouquet of, $9.99 (D810, 35mm f/1.4 -----> AI !!!  @ f/2, 1/25s, ISO 64)", "link": "https://www.reddit.com/r/Nikon/comments/98fqkl/daisies_bouquet_of_999_d810_35mm_f14_ai_f2_125s/"}, {"autor": "burning1rr", "date": "2018-03-22 19:51:43", "content": "Nikon D70 Bayerectomy /!/ I'm in the process of building a dedicated DSLR for IR photography. I'm interested in getting some feedback, and sharing my experiences so far.\n\nA downside of of an IR conversion is that the resolution and light sensitivity of the camera is significantly reduced; the bayer filter blocks IR light to the green and blue pixels, effectively reducing resolution and light capture to 1/4 of the sensors original capabilities when paired with an IR passing filter.\n\nThe solution to this problem is to [de-bayer](https://petapixel.com/2013/08/04/scratching-the-color-filter-array-layer-off-a-dslr-sensor-for-sharper-bw-photos/) the image sensor, effectively converting the camera to true B&amp;W.\n\nThis process has the side-effects of dramatically increasing light gathering ability and eliminating the need to interpolate data from multiple pixels to re-construct a full resolution image.\n\nOur victim is a D70. This camera is a good candidate for two reasons:\n\n1. It's cheap\n2. The CCD sensor is much more sensitive to IR light than a CMOS sensor\n\n[Here's a photo album of my first surgery attempt](https://imgur.com/a/KGHOo). Gore warning; people who are sensitive to camera abuse should avert their eyes. When the robots overthrow humanity, they will punish me for this.\n\nI've made my first attempt at converting my D70. Unfortunately, the end result of the process was a non-functional camera. Afterwords, when I take a photo the camera reports that the 'CF card cannot be used.' Test images taken before the surgery display fine, however new photos are not written. The camera reports no other errors.\n\nThis appears to be a commonly reported problem with the D70 cameras, however it was working before I pulled the body apart, and I find it much more likely that I damaged the sensor rather than that I simply induced a write problem.\n\nPossible ways I could have damaged the camera:\n\n1. Too much heat while removing protective glass over CCD\n2. Too aggressive while removing bayer filter; damaged sensor electronics\n3. Use of alcohol to clean sensor\n4. Assembly / disassembly mistake\n5. CF card reader was boarder-line and failed during the operation (thanks /u/HerbertTarlek)\n\nI learned a few important things in this process:\n\n1. Next time, I should reassemble and test the camera after each step of the modification process.\n2. Next time I should be less aggressive with bayer removal; leave edges and test camera.\n2. The D70 has a glued-on sensor protector, making it non-ideal for de-bayering.\n3. The D70 has no live-view mode, making it non-ideal for IR photography\n4. The D70 has no -----> AI !!!  lever, making it non-ideal for use with a bunch of good MF IR glass\n\nQuestions:\n\n* Is there any way I can check for other possible causes of my write error?\n* Is anyone aware of a F-Mount body with a CCD that doesn't have a layer of glass glued over the image sensor?\n* Are there any good mirrorless bodies for this conversion? Maybe a MFT that can take a F adapter?\n\nAnyway, I hope everyone enjoyed this little experiment. If nothing else, it'll probably be worth some karma on /r/techsupportgore. I'll post an update when I've had another chance to try again.", "link": "https://www.reddit.com/r/Nikon/comments/86ehfg/nikon_d70_bayerectomy/"}, {"autor": "[deleted]", "date": "2018-04-03 23:46:41", "content": "Ferry on Lake Champlain - Burlington, VT - Nikkor 50mm f/1.8 -----> AI !!!  /!/ [deleted]", "link": "https://www.reddit.com/r/Nikon/comments/89k2g9/ferry_on_lake_champlain_burlington_vt_nikkor_50mm/"}, {"autor": "lifelesspeanut", "date": "2018-04-01 18:22:03", "content": "Lenses for analog Nikon FE /!/ Hey there, I've just bought the old analog Nikon FE and I'm waiting for it to arrive soon. :)\n\nMy question is, what lenses can I use on this camera and what would you recommend me as far as wide-angle (24-35 mm) and tele (something like 90,130 mm, ...) lenses go? It has the standard Nikkor 50mm f/1/8 -----> AI !!!  and I'm looking for some nice lenses to complete the set.\n\nThanks for all your replies :)", "link": "https://www.reddit.com/r/Nikon/comments/88sual/lenses_for_analog_nikon_fe/"}, {"autor": "fixitwolfe7", "date": "2018-07-13 05:37:37", "content": "Tulip-tree beauty moth - epimecis hortaria (D3400 + Nikkor 50mm 1.4 -----> Ai !!!  + XIT macro converter)", "link": "https://www.reddit.com/r/Nikon/comments/8yhc8g/tuliptree_beauty_moth_epimecis_hortaria_d3400/"}, {"autor": "fixitwolfe7", "date": "2018-07-10 18:41:26", "content": "Neighborhood Fireworks Malfunction (D3400 + Nikkor 50mm f/1.4 -----> Ai !!! )", "link": "https://www.reddit.com/r/Nikon/comments/8xs21e/neighborhood_fireworks_malfunction_d3400_nikkor/"}, {"autor": "fixitwolfe7", "date": "2018-07-08 04:17:24", "content": "Vintage MGB Roadster in the Woods [Nikon D3400, Nikkor 50mm -----> Ai !!! , 1/60 sec @ f/8, ISO 100]", "link": "https://www.reddit.com/r/Nikon/comments/8wz16y/vintage_mgb_roadster_in_the_woods_nikon_d3400/"}, {"autor": "corso923", "date": "2018-02-27 16:58:02", "content": "Is it safe to use a Non-AI lens with s fixed aperture on a modern digital body? /!/ So I have a 500mm f/6.3 lens that I don’t think it’s -----> AI !!!  converted, I’ll have to take another look at it later but I’m pretty sure it’s not. The thing is I don’t recall seeing an aperture ring on it and think the aperture may be fixed at 6.3. If that’s the case, is it safe to use on a modern body? I have a d5100.", "link": "https://www.reddit.com/r/Nikon/comments/80nzry/is_it_safe_to_use_a_nonai_lens_with_s_fixed/"}, {"autor": "dearest-chap", "date": "2018-02-25 03:26:17", "content": "Just bought a 40 year old 50mm f/1.2 -----> AI !!! , I could really use some help... /!/ So I just got this lens, and while it looks to be in pretty good shape, it has a few quirks I'm a little worried about. I'd never seen or used one before and have absolutely no reference, so I thought I'd ask you guys. So here's the issues:\n\n1. The focus ring has a little mechanical resistance, almost as if it needs lubrication, and makes a bit of a dragging noise when rotated. It still is very precise and probably the best I've ever used. Not sure at all if it's supposed to feel like that or if it needs some lube, it is 40 years old after all.\n\n2. It makes a bit of a rattle noise when shaken, almost as if something tiny was loose in there. I've read somewhere that it could be the aperture blades, but my 35mm f/1.8G doesn't make anywhere near as much noise when shaken, so I don't really know.\n\n3. It's not quite as sharp as I expected. At f/4 it does just about as well as my 35mm, if not a little softer. It may be something's gone misaligned in its long life.\n\nI'd really appreciate if you guy could weigh in on this, as it actually cost quite a bit of money and I still have some time to return it.", "link": "https://www.reddit.com/r/Nikon/comments/801w4j/just_bought_a_40_year_old_50mm_f12_ai_i_could/"}, {"autor": "fixitwolfe7", "date": "2018-07-23 18:23:02", "content": "Big Polar Sphinx Moth (D3400 + Nikkor 50mm 1.4 -----> Ai !!!  + XIT macro adapter + Lightroom)", "link": "https://www.reddit.com/r/Nikon/comments/919jrz/big_polar_sphinx_moth_d3400_nikkor_50mm_14_ai_xit/"}, {"autor": "Vlaitor", "date": "2018-07-23 00:29:44", "content": "Sooo I just got employed for a product shooting. First timer. Any tips?! /!/ Long story short, the owner of a specialized Tea shot wants to \"upscale\" her Instagram game and product pictures.\n\nMy sister in law works there and after looking at my [flickr ](https://www.flickr.com/photos/147295741@N02/)account, she called me directly and asked me if we I could have some time with her to do some shooting for her upcoming products.\n\nFirst, she is love with bokeh, that's what she really wants. This I can do but, I know there is a LOT more to it than just  point and shoot at big aperture. \n\nI would really, really appreciate any tips you guys might have concerning this type of photography.\n\nThanks guys,\n\n\\*\\*\\*\\*My gear\n\n\\-D7200\n\n\\-Sigma 18-35 1.8 ART\n\n\\-Macro Tokina 100 Atx 2.8\n\n\\-Nikon 105mm 2.5 -----> AI !!! \n\n\\-Nikon 135mm 2.8 -----> AI !!! S\n\n\\-Nikon 50mm 1.8 -----> AI !!! S\n\n\\-Nikon 70-300 AF-P VR 4.5-6.3", "link": "https://www.reddit.com/r/Nikon/comments/912i4u/sooo_i_just_got_employed_for_a_product_shooting/"}, {"autor": "nanderspanders", "date": "2018-08-10 20:38:19", "content": "A battle of 50mm manual focus lenses. /!/ So I recently found in my parents house a Nikon  FM with an -----> AI !!!  50mm 1.4 lens. Before this I had been using an AF 50mm 1.8 D with my F100 and my D5300 as well as an 18-105mm AF-S DX just on my D5300 so I had a couple of questions. I tried the 1.4 on my D5300 and quickly realized that while I loved the bigger aperture and smooth focus ring it will not meter with my camera. I haven't been able to try the metering on the FM or the F100 with the 1.4. I'm just wondering if it will at least meter with my F100? if not will the FM meter with the 1.8? I want to justify using the FM but if it means carrying around lenses just for the FM I'd rather sell them and buy another lens that works for my digital and F100 bodies.", "link": "https://www.reddit.com/r/Nikon/comments/96amhq/a_battle_of_50mm_manual_focus_lenses/"}, {"autor": "Sugar_Leg", "date": "2018-11-01 00:22:58", "content": "New old lens day. Non -----> AI !!!  50mm 1.4, film loaded. Excited to be analog again.", "link": "https://www.reddit.com/r/Nikon/comments/9t4lnf/new_old_lens_day_non_ai_50mm_14_film_loaded/"}, {"autor": "Twin-KSA-Turbo", "date": "2018-10-25 19:18:19", "content": "Shy moon [D3300 + Nikkor -----> Ai !!!  200mm F4]", "link": "https://www.reddit.com/r/Nikon/comments/9rdd1r/shy_moon_d3300_nikkor_ai_200mm_f4/"}, {"autor": "guywithblackcamera", "date": "2018-10-24 19:58:26", "content": "Is it safe to leave AF-D lens mounted in smallest aperture. /!/ It's not going to wear out the -----> ai !!!  indexing tab/spring is it? I know sounds like a dumb question. ", "link": "https://www.reddit.com/r/Nikon/comments/9r349o/is_it_safe_to_leave_afd_lens_mounted_in_smallest/"}, {"autor": "HowToChangeAUsername", "date": "2018-11-06 01:57:05", "content": "Looking for some Z help. /!/ Hey guys, recently picked up my Z7 and really enjoying it so far.  Last night I finally got around to trying to mount up some -----> AI !!! -S glass and while it mounts and shoots just fine, I can’t tell if I’m getting my IBIS stabilization.  When I menu dive, I see that VR is set to off and greyed out, but it’s on when using the 24-70.  Since the 24-70 is a non-Vr lens, I assume this menu option must be referring to the IBIS.  My legacy glass certainly doesn’t seem stabilized and even after memorizing the manual I still can’t for the life of me figure out how to get it active.  Any help is definitely appreciated.", "link": "https://www.reddit.com/r/Nikon/comments/9uk2iu/looking_for_some_z_help/"}, {"autor": "LittleByBlue", "date": "2018-12-15 13:05:17", "content": "Macro extension tube with AF/TTL/Automatic aperture support /!/ Hi folks.\n\nI have a Nikon 105mm f/2.8 macro lens on a D7500 for insects, however this lens sometimes does not give me the required reproduction scale.\n I also have an -----> AI !!!  macro extension tube and a pb-4 bellows, but I cannot use my autofocus with those.\n\nBecause lots of insects move I need the autofocus (and support for automatic exposure and ISO. \n\nDo you know an extension tube that fits my needs?\n\nI thought about the meike tube set, but I am not sure if it has really AF support.", "link": "https://www.reddit.com/r/Nikon/comments/a6f1xn/macro_extension_tube_with_afttlautomatic_aperture/"}, {"autor": "blitzangel", "date": "2018-06-11 17:43:53", "content": "Panoramic view from Mount Garfield, New Hampshire [D800E + Vivitar 75-205mm f/3.8 -----> AI !!! ]", "link": "https://www.reddit.com/r/Nikon/comments/8qbdhe/panoramic_view_from_mount_garfield_new_hampshire/"}, {"autor": "TheSnugggler", "date": "2018-06-10 01:39:31", "content": "Shutter Issues with Nikon F5 /!/ Recently picked up an F5 body, which seems to be in full working condition. The main issue I am finding with it is with the shutter.\n\nI am only using -----> Ai !!! -S manual lenses with the camera, do not have any AF. \n\nIn manual mode, I am unable to adjust the shutter speed of the camera. If I put it into any of the auto settings, it reads the aperture fine and adjust the shutter accordingly. But when in Manual Mode, it maxes out at \"250x\". \n\nCouldn't find any relevant help on the web on this issue.  ", "link": "https://www.reddit.com/r/Nikon/comments/8pxm02/shutter_issues_with_nikon_f5/"}, {"autor": "burning1rr", "date": "2018-03-15 06:34:16", "content": "Can anyone recommend lenses for IR photography? /!/ I have a Nikon F100 film camera, and a few rolls of Ilford SFX 200. I can shoot IR with my existing lenses, but if anyone knows some oldie-but-goodie lenses that suit my needs, I'd appreciate it.\n\nHere's what I'm looking for, ideally:\n\n* [IR focus distance marks](https://i.imgur.com/oDHZHMq.jpg)\n* Prime\n* 20mm-105mm focal length\n* Cheap\n* Fast\n* DOF lines\n\n-----> AI !!!  and other manual focus lenses are absolutely fine. I'm not looking to spend a lot of money.", "link": "https://www.reddit.com/r/Nikon/comments/84kfs1/can_anyone_recommend_lenses_for_ir_photography/"}, {"autor": "fixitwolfe7", "date": "2018-07-16 21:58:42", "content": "Evergreen in the rain (D3400 + Nikkor 50mm 1.4 -----> Ai !!!  + Lightroom)", "link": "https://www.reddit.com/r/Nikon/comments/8zfavb/evergreen_in_the_rain_d3400_nikkor_50mm_14_ai/"}, {"autor": "BlockedPitotTube", "date": "2018-05-27 21:22:56", "content": "Using vintage lenses? /!/ Hi guys,\n\nI have a d3400, with a standard 18-55mm lens. \n\n\nI just found a deal on a used Nikkor 50mm f1.4 -----> AI !!! (or -----> AI !!! -S?) - for about $50. \n\n\nWhat should I know about using this old lens on a modern DSLR?\n\nI don't think i need an adapter for this lens. But from what I understand there's no auto focus, and no electronic exposure control. \n\n\n", "link": "https://www.reddit.com/r/Nikon/comments/8mkv1o/using_vintage_lenses/"}, {"autor": "slowcaptain", "date": "2018-09-30 19:15:46", "content": "Santa Monica pier | D7200 | 50mm -----> AI !!! -S e series lens", "link": "https://www.reddit.com/r/Nikon/comments/9k935a/santa_monica_pier_d7200_50mm_ais_e_series_lens/"}, {"autor": "DarkMemeLord420", "date": "2018-09-30 14:41:47", "content": "Non -----> AI !!!  lens on D700? /!/ Hi, I have a D700 and I was looking at picking up a cheap prime lens. I am looking at the Nikkor 50mm F1.4 but it's an old non AI lens. Does anyone know if it would fit my d700? Thanks in advance ", "link": "https://www.reddit.com/r/Nikon/comments/9k6tu4/non_ai_lens_on_d700/"}, {"autor": "TheRedTopHat", "date": "2018-09-28 18:57:46", "content": "I need advice on a new camera, D600 or D610? /!/ I'm looking to get either a D600 or a D610 because of its full frame sensor and support for -----> AI !!!  lens, of which I have many.  I'm currently on a D3300, but I don't have any metering on my AI lenses, which I find a little annoying.  I'm also interested in moving to FX as opposed to DX.  My question is, should I get a D600 or 610? I can get a 600 for 600 dollars, and a 610 for 700.  I checked the 600 serial and I can send it in for a new shutter, which I might do if you guys think it's a good idea. If you think I should get another camera other than the 600/610, I am open to suggestions!\n\n Thanks so much!\n\n&amp;#x200B;\n\nTL;DR : Am looking for an AI lens supporting, FX camera.  Features aren't that important, as long as it takes a good image.  ", "link": "https://www.reddit.com/r/Nikon/comments/9jpqft/i_need_advice_on_a_new_camera_d600_or_d610/"}], "name": "Subreddit_nikon_01_01_2018-30_12_2018"}