{"interestingcomments": [{"autor": "din38ah", "date": "2021-05-31 06:29:29", "content": "Canon 5diii still a good camera for product photography? /!/ I need to take product photography, but not the typical commercial type. I use them for for -----> image recognition !!!  application. So I don’t need fancy/artsy look, but only most accurate presentation down to the tiniest flaws. I guess I need the sharpest details possible without edit (I’ll use the light box for lighting). \nThis is still an experiment and I don’t want to invest too much in equipment yet. Will the 5diii and the canon 100mm macro lens do the job? If not, please recommend what works for my situation.\nI’m open to all brands, but prefer canon due to the better support for customized software by canon.\n\nThanks!", "link": "https://www.reddit.com/r/Photography_Gear/comments/nowpt2/canon_5diii_still_a_good_camera_for_product/"}, {"autor": "onomazein", "date": "2021-05-16 00:12:01", "content": "Great digital stills camera w/o bells and whistles? /!/ I've been shooting for quite a few years, &gt;10, and started with digital. For the past couple years, I only do motorsports photography and the occasional light astro photography. My body is a D750 and my main lenses are a 70-200 f/2.8 and a 300 f/4. However, I find the D750 coming up short in a number of areas (list below)\n\nWhat I'm curious to know is, are there any awesome stills cameras that don't have all of this video, wi-fi, etc stuff tacked on? I want a digital camera that's just manual, no scenes modes, no need for -----> AI !!! , no need for face or eye detection, no need for 4k+ video, etc\n\nI'm guessing some are going to suggest a higher-end, but older body, which isn't a problem, but finding a used one that has good shutter life left may be a big ask (in the EU). I would prefer mirrorless if possible, but being newer means they'll just come with a ton of things I'll *never* use. I'd even be open to considering film; I actually prefer the color depth with film compared to digital\n\nMy limiting factors on the D750:\n\n* Low continuous burst\n* Buffer takes too long\n   * I know, there's more data with RAW, maybe I'm feeling Expeed 4 is dated/slow?\n   * I'm using SanDisk Extreme PRO cards, which are rated faster than the camera's transfer rate\n* I want faster than 1/4000 shutter speed\n   * I pan quite a bit, but sometimes I just want frozen stills or a killer sequence\n* I print my work and for my best prints I make them large\n   * Meaning I want to stay full frame, but doesn't mean I need more than 24MP\n   * I'd love to try medium format, but I have a modest budget and my income doesn't come from photography", "link": "https://www.reddit.com/r/Photography_Gear/comments/ndc4xp/great_digital_stills_camera_wo_bells_and_whistles/"}, {"autor": "baby--steps", "date": "2021-05-12 17:13:42", "content": "Advice about gear for time-lapse photography for research purposes /!/ I want to buy a camera that can take a frame every 1 sec or so for as long as the battery supply lasts or I can specify the amount of time. I also want to explore with fractions of sec or more seconds.\n\nThe purpose is to take sharp images of insects on flowers. I want to set the camera on a tripod, use a macro lens or a lens adapter, supply it with an external battery that can run for 3-6 hours and let it take the frames focused on a flower until basically the battery dies out. If the flower is too high, I will use a small poll to tie the plant to it so that the movement due to wind is as minimum as possible.\n\nLater I can sort out later which images contain insects by using some object detection software/-----> machine learning !!!  model.\n\nSo, I would like help with suggestions of such time-lapse cameras. Like what models would you recommend to buy. It should allow manual focus settings, together with ISO, aperture and shutter speed settings. Also it should have the option of interchangeable lenses and the option of a lens adapter for macro photography. \n\nAdvice about lenses and adapters is also appreciated.\n\nAlso it should allow long battery supply or possibility to be connected to some battery supply. Ideally this system should be able to work on a sunny/usual day in a grassland for up to 5-6 hours. Therefore, advice about what battery supply I can connect to such a camera is also needed.\n\nThank you!", "link": "https://www.reddit.com/r/Photography_Gear/comments/natyo3/advice_about_gear_for_timelapse_photography_for/"}, {"autor": "artiear", "date": "2021-08-16 22:54:16", "content": "Haze/blur on photos taken with Nikkor 180mm f/2.8 ED -----> AI !!! -s /!/ I have recently purchased online a second hand Nikkor 180mm f/2.8 ED AI-s to use for astro-photography with D7100. After a few test shots, I've noticed that with wider apertures the taken photos have this haze. It looks really bad. I tried inspecting the unit with a flashlight test and could not see any significant problem, except a few dust particles and regular wear and tear. I have couple of other modern lenses that obviously don't have this issue, therefore I ruled out the camera body being the problem.\n\nBased on my research this lens supposed to be one of the sharpest lenses from that era [https://www.kenrockwell.com/nikon/180f28.htm](https://www.kenrockwell.com/nikon/180f28.htm) but yet I was not able to produce anything near \"sharp\" image with my unit.  \nI am about to send it back to the seller for a refund, but wanted to double check if there could be some other reason causing the issue.", "link": "https://www.reddit.com/r/Photography_Gear/comments/p5r7lz/hazeblur_on_photos_taken_with_nikkor_180mm_f28_ed/"}, {"autor": "Huewhatsthis", "date": "2021-10-10 12:18:56", "content": "Prices for lenses that fit onto Nikon /!/ Hello,\n\nso this is a bit of a rant, but really i'm interested in knowing if this is something real i'm noticing or if i'm wrong with this. \n\nIn the countless hours i'm on ebay and similar platforms, trying to grap lenses for my Nikon D5300 for cheap(i can take N/-----> Ai !!!  stuff thankfully) i have noticed a trend i don't really like. It is basically that, if it fits onto Nikon F the price for the product is oftentimes way higher. \n\nFor instance in my latest search i set a strong focus on Tamrons adaptall lenses, because i was hoping them to be cheaper and sometimes they are(got a 28mm F2.8 for 30 bucks which is way better than the attrocious prices people demand for the Nikon version from the similar time period) but oftentimes and especially if people know about the capability of adaptall(well the name says it), prices go into similar directions of old Nikon gear, for which i have given up all hope to get my hands on. Presenting a Tamron Adaptall 180mm F2.5 for **700 Euros** or how about a 24-48mm F3.5 for **300 Euros**. To clarify those are good lenses, but they lack all modern features and for the same money demanded here i could sometimes get a modern F2.8 zoom used. \n\nOn the other side of the spectrum, many lenses for canon(i don't know much about canon mounts) or m42 can be had for dirt cheap. Especially them 50mm are widely available and apart from the collectors items, so the Takumars and Zeiss lenses, are almost always a bargain.\n\nTo add, i tried a lot in the recent time, i looked for Tamron lenses with Canon or Minolta mounts or those which are just described as lens for mount x y and i was successful once, but in most instances prices stay high.\n\nI know i want good quality for cheap, which sounds unrealistic, but the thing is M42 Mounts often have these characteristics, so i start to ask myself why lenses which were made for F Mount or are mountable on F Mount can't often be like that too.\n\nSo, what are your thoughts on this? Have you made similar experiences or would you say i'm wrong with this.\n\n\nAlso, i'm not quite sure if this fits into the subs, so mods, just delete it if it doesn't or someone tell me if it fits or not. I will delete it then.", "link": "https://www.reddit.com/r/Photography_Gear/comments/q56yq7/prices_for_lenses_that_fit_onto_nikon/"}, {"autor": "SuperCheapSheep", "date": "2021-05-06 10:19:36", "content": "Portrait Pro 21 In Depth REVIEW and GIVEAWAY! - -----> AI !!!  Image Editing Software /!/  I've teamed up with Anthropics to giveaway a copy of PortraitPro 21! To be in the draw, be sure to watch my in depth review and follow the link in the description! Good luck to all entries!  \n[https://www.youtube.com/watch?v=rfOWr8UGVYA](https://www.youtube.com/watch?v=rfOWr8UGVYA)", "link": "https://www.reddit.com/r/Photography_Gear/comments/n6424c/portrait_pro_21_in_depth_review_and_giveaway_ai/"}], "name": "Subreddit_Photography_Gear_01_01_2021-01_11_2021"}