{"interestingcomments": [{"autor": "sebisheep", "date": "2020-06-29 02:17:48", "content": "Best budget lenses for my new camera? /!/ Hey guys so I recently bought a Nikon fe2 and it came with a 50mm f/1.8 lens. I was researching up some more stuff on this camera and I definitely do want other lenses to use. I think I would be doing more on the street photography side and was wondering what are some budget lenses you guys recommend? I did hear good things about the 24mm f/2.8 and the 105mm f/2.5. \n\nAlso, what’s the difference between -----> ai !!!  and -----> ai !!! s lenses???", "link": "https://www.reddit.com/r/Cameras/comments/hhrg3x/best_budget_lenses_for_my_new_camera/"}, {"autor": "ParaOblivion001", "date": "2020-06-28 22:10:31", "content": "At least 25 year old Yashica lens. It says A8419347, also -----> ML !!!  Zoom 75-150mm 1:4 ..... know anything about this / value?", "link": "https://www.reddit.com/r/Cameras/comments/hhnkol/at_least_25_year_old_yashica_lens_it_says/"}, {"autor": "GRAYDOTLAB", "date": "2020-02-01 20:01:24", "content": "Nikon F3 with 50mm f1.4 Non -----> AI !!! ", "link": "https://www.reddit.com/r/Cameras/comments/exbp74/nikon_f3_with_50mm_f14_non_ai/"}, {"autor": "wajahat620", "date": "2020-02-22 04:30:53", "content": "What really is the difference between a phone camera and professional camera? /!/ Soooo idk why but I randomly started looking up cameras and now I can’t stop. I am not a photographer so I’d only be using the camera for birthdays and family events. I just wanna know what is the difference between an iPhone 11 camera or galaxy s20 plus ultra camera, or how much you have to spend on a camera to see the difference. Just by looking at the images from galaxy s20 ultra I don’t think that a $600-800 camera would be an upgrade but I could be wrong. \n\nI was looking at canon sl3 plus a 18-135 3.5-5.6 lens to quench my thirst but I don’t think I’ll see a difference in quality. Let me know if I am wrong. \n\nThen I was looking at Sony a7r2 + 24-70 f2.8 lens, even if I pick it up used it will cost me $1500 and that’s a hard pill to swallow for birthday and family pictures but I am willing to get it I am also willing to get a7iii for $2000 but nothing higher. \n\nLet’s say I get this sony a7r2 or a7iii with the lens (plus decent prime later) will I see a difference that’s worth $1,500-2,000? If I do then how long will this difference last? \n\nFrom my litter research I found out that iPhone X/XS/11/11pro and galaxy s10/note 10 were using a 25mm sensor and galaxy s20 ultra has a ~48mm sensor that’s almost double in size. If the pictures I’ve been taking were already half decent especially in day light or good lighting then won’t I be more than satisfied with a sensor that’s letting in double the light and also with this fake -----> AI !!!  low light stuff. \n\n\nShould I buy one? Should I get a cheap camera like the canon sl3 or Nikon 5600 kit? Or do you think If I spend $2000 on a camera+lens then I’ll be happy with it for a while (2-3 years)and the iPhone 12 camera won’t outshine it when it comes out?", "link": "https://www.reddit.com/r/Cameras/comments/f7nkmd/what_really_is_the_difference_between_a_phone/"}, {"autor": "photoexperts", "date": "2020-02-22 01:57:04", "content": "blurams 1080p Dome Security Camera | PTZ Surveillance System with Motion/Sound Detection, Smart -----> AI !!!  Alerts, Privacy Mode, Night Vision, Two-Way Audio | Cloud/Local Storage Available | Works with Alexa", "link": "https://www.reddit.com/r/Cameras/comments/f7lqab/blurams_1080p_dome_security_camera_ptz/"}, {"autor": "geo_mallory", "date": "2020-11-01 23:57:52", "content": "Help me decide: Film Camera to Nepal, 2021 /!/ I’m traveling to Kathmandu, and on to Everest Base Camp, in Nov., 2021.  \n\nPlease help me decide between two film cameras I own (I’ll also take a small digital camera—this post asks you to please choose between two film cameras and leave aside the digital camera.) \n\nI already own the following equipment.  Everything functions as it should. I have spent about the same amount of time with both cameras, but I’m less than expert at either.  That said, in college I spent a summer in Austria with an Canon AE-1 and a 28mm lens.  I’m comfortable with manual focus. I have considerable experience with a D7000 and a D800.  \n\nI want to photograph and make some good prints of the people and places of Nepal, including the mountains but also anything else that catches my eye. \n\nIn a separate post I’ll ask about film; for now I’m shooting rolls of Ektar 100 In both cameras to get familiar with it. \n\nIf I’m missing something essential in either set up, please let me know.  My plan is to take the one body and two lenses listed.  I’m open to input on this.  \n\nAnd please share your reasoning why you’d take one setup over the other. \n\n Thanks in advance! \n\nCamera 1: Nikon FE; 28mm f/2.8 -----> AI !!! -S Manual Focus; 50mm f/1.4 -----> AI !!! -S Manual Focus.\n\nCamera 2: Nikon F100; 28mm f/2.8 D AF; 50mm f/1.8 AF.", "link": "https://www.reddit.com/r/Cameras/comments/jmcz69/help_me_decide_film_camera_to_nepal_2021/"}, {"autor": "Littledoggie43", "date": "2020-07-14 07:08:43", "content": "Do the Nikkor -----> Ai !!!  and pre------> Ai !!!  lenses have a MOVING focus ring? And if so, is it possible to mount a follow focus gear and the motor function properly? /!/ I’m using vintage lenses for video.  I like their wide aperture (looking at a nikkor 55mm f/1.2 non-ai lens for lowlight work).\nDo some of them have moving focusing rings?  And how can you combat that in mounting a follow-focus gear?", "link": "https://www.reddit.com/r/Cameras/comments/hqwvja/do_the_nikkor_ai_and_preai_lenses_have_a_moving/"}, {"autor": "Mighty_Dighty22", "date": "2020-01-20 11:50:41", "content": "Upgrade from old Sony a300 /!/ Hey guys. \n\nI have been thinking for some time now that the time has come for an upgrade. Right now I got a Sony A300 which I got from my grandfather when he bought a new -----> ML !!!  sony something so that I could practice and learn what I need from a camera. \n\nThe things I really like to do is 'photo safary' with my bike. If you have held an A300 you know it is quite clunky, and especially with the very mediogre 18-200 kit lens (I think it is a kit at least). So size is a thing I am kinda concerned about. I really like to climb weird places, do street photography etc. \n\nThe other thing I feel the A300 is really a lackluster in is in poor light conditions. with its \"boosted\" ISO of 3400, which makes the pictures very grained BTW, and somewhat poor handling on multiple light sources and intensities, I really would like a camera with competent night time capabilities. \n\nThird: I live near a civilian and military airport. And I really like taking nice pictures of those magnificent birds (sweet falcons) when they are going in and out of the airport. A fast and reliable autofocus would be very desirable for me. My girlfriend also wants this as it means better pictures of her doing her gymnastic shenanigans.\n\nI am not a big fan of mirrorless cameras as they feel very flimsy and awkward to hold and handle for me. I have been looking at the Nikon D5600 a little as that thing is in the price range I have and still being able to get some good glass for it. But I haven't committet to anything but the price range. THe only thing I really know is that pictures come first and video second in my use. Also I am not brand loyal (yet) though I am not a fan of Sony's interface and rather expensive lenses.", "link": "https://www.reddit.com/r/Cameras/comments/erc95t/upgrade_from_old_sony_a300/"}, {"autor": "fasteddy959", "date": "2020-01-27 16:37:47", "content": "Some opinions on Medium Format /!/ I’m looking to restart my film photography and upgrade to something a little different for a medium format camera. I currently have a Mamiya 645 Pro, but during my move the body has stopped lifting the mirror properly. So it’s effectively useless since I cannot focus. \nSince I need to replace it I figured I could upgrade to something different. I want some more film real estate so 6x6 and up. \nI’m weighing the RZ67 ProII, Hasselblad 503xx and 203FE cameras, as well as Bronicas (SQ------> AI !!! ).\nI want the ability to have a meter built into the camera and be light. \nThe obvious choice is the 203FE since you get the use of both leaf shutters and focal plane shutters and their respective benefits. \nIt would be an all around camera I use for my more contemplative work inside and outside. \nIs the hefty price of the 203FE worth it or will the other cameras give me a pretty good run for my money?", "link": "https://www.reddit.com/r/Cameras/comments/euqbb3/some_opinions_on_medium_format/"}, {"autor": "flying-in", "date": "2020-05-16 19:56:33", "content": "Camera far reaching lens with computer interface /!/ Hello! I have an EOS M100 (15-45mm lens) and am very happy with the camera. I have used it for quite a bit, but mostly on automatic mode. I am learning to explore some of the settings in manual mode and slowly getting better. Here is a pic I took a while ago playing around with a tea cup\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ecwg5bfip6z41.png?width=1277&amp;format=png&amp;auto=webp&amp;s=b190ea5982ef27ec91261f53b33b06f903c5d6cb\n\nMy new obsession is not tea cups but trains and the graffiti on them. I have taken the following picture the other day of the train rolling through the city that is approx 360 meters away (45mm focal):\n\nhttps://preview.redd.it/7wjt2n2dp6z41.png?width=1276&amp;format=png&amp;auto=webp&amp;s=11836c6b4409f2ee167795c93e07d6e5f3929366\n\nand zoomed in (of previous image) on the train cart:\n\nhttps://preview.redd.it/wd7q3dm8d6z41.png?width=1187&amp;format=png&amp;auto=webp&amp;s=aa58ecc70c9f1c65bf6310ff67d91b65fd69c2e8\n\nThe resolution is good but I want much better. Say something like this(but perhaps better ) i found on google:\n\n&amp;#x200B;\n\n[https://i.pinimg.com/originals/64/3b/f7/643bf7a25d579ba70e6b3dc96a7e1206.jpg](https://i.pinimg.com/originals/64/3b/f7/643bf7a25d579ba70e6b3dc96a7e1206.jpg)\n\n&amp;#x200B;\n\n(ignore the messaging on it)\n\n&amp;#x200B;\n\nI want to be able to read the text on the cart and detailed picture of the grafitti. I could buy an additional lense for the EOS M100 as listed here ([https://travelfornoobs.com/best-lenses-for-canon-eos-m100/](https://travelfornoobs.com/best-lenses-for-canon-eos-m100/))  - in the 200mm range (will this be sufficient for my desired resolution?). However, the EOS M100 is not the best in my opinion in terms of software for my project.\n\n&amp;#x200B;\n\nFor my project I am looking to document and classify train graffiti. Perhaps I will identify various styles or artists...or whatever discovery I make -  I am not sure yet. Perhaps I will just make a big poster with composed of many train shots and gift it to a friend. I feel like I am exploring an ancient language in a Egyptian pyramid and do not know where the exploration will take me but I am very excited of all the possibilities.\n\n&amp;#x200B;\n\nI have lots of trains rolling in on this bridge and I am considering setting up two cameras. The first camera would be a very primitive camera with the purpose of identifying moving trains (this would be done with some sort of -----> machine learning !!!  type approach - I have never done something like this, but have enough experience in programming to tackle such a project and know that it is possible. For this camera I will use something cheap - my 8megapixel phone camera seems to be okay for this for picking up movement.\n\n&amp;#x200B;\n\nThe first camera will identify when the trains are rolling in (there are like 20 minutes breaks in between) and based on the computed speed of train the second camera will take picture of each train cart while it is on the clear shot area of the bridge. The images will then be transferred to a computer for post processing of some sort.\n\n&amp;#x200B;\n\nMy EOS m100 is not the best candidate for the second camera (assuming I had an appropriate lens). It is difficult to automate picture taking. I have done a rough test - eos m100 has a cell phone app provided by canon that is capable of taking pictures remotely through the cell phone on screen press. This can be hooked up to a laptop that just automates the pressing of a cellphone screen in order to take pictures ([https://www.rightpoint.com/rplabs/automating-input-events-abd-keyevent](https://www.rightpoint.com/rplabs/automating-input-events-abd-keyevent)) - the laptop can hypothetically use camera one's machine learning data to automate the press when required. However, after basic trials I am not sure I can really specify the image taking rate based  on different train speed (they don't go too fast so it is not the biggest concern but getting consistent shots of train carts on the exact same part of the bridge would be nice). The EOS sometimes needs to refocus between pictures and I don't think I can get too precise with the picture taking rate. For constant power I could buy something like this ([https://www.amazon.com/Glorich-ACK-E12-Replacement-Adapter-Mirrorless/dp/B00VNSD7LW](https://www.amazon.com/Glorich-ACK-E12-Replacement-Adapter-Mirrorless/dp/B00VNSD7LW)). In addition, it is difficult to extract images from the EOS m100 live without taking out the sd card and exiting the canon remote picture taking app which would require physical interference and not be able to allow my camera two to take pictures for many days at a time (I would like to take pictures for a few weeks minimum).\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nMy question to you guys:\n\n&amp;#x200B;\n\nWhat general lens do you recommend for getting the resolution that I desire?\n\nWhat camera core body (without the lens) do you recommend that could provide more effective interface with my computer for automated picture taking and image downloads while still being powered on for days on end?\n\nPerhaps I could combine the two questions together for a camera/lens combo.\n\n&amp;#x200B;\n\nMy budget is in Canadian. I want to hear all recommendations, I can  squeeze 1000-2000 dollars, but if it is a really good camera I can view it is an investment for future.", "link": "https://www.reddit.com/r/Cameras/comments/gl17mu/camera_far_reaching_lens_with_computer_interface/"}, {"autor": "dannylenwinn", "date": "2020-09-15 02:24:31", "content": "Sony launches new Alpha 7C camera, world’s smallest and lightest full-frame camera with Real-time -----> AI !!! /AF tracking, full-frame 6k oversampled 4k movie capabilities, and 5.0 step image stabilization", "link": "https://www.reddit.com/r/Cameras/comments/iszrtn/sony_launches_new_alpha_7c_camera_worlds_smallest/"}, {"autor": "m1900kang2", "date": "2020-11-17 14:26:51", "content": "Raspberry Pi -----> ML !!!  Camera with TensorFlow Lite", "link": "https://www.reddit.com/r/Cameras/comments/jvtuuq/raspberry_pi_ml_camera_with_tensorflow_lite/"}, {"autor": "cblackjeep98", "date": "2020-11-28 05:57:44", "content": "Is this a Nikon f-mount? -----> AI !!!  or non------> AI !!! ?", "link": "https://www.reddit.com/r/Cameras/comments/k2ifqj/is_this_a_nikon_fmount_ai_or_nonai/"}, {"autor": "MonkeySnipezz", "date": "2020-07-09 20:39:25", "content": "-----> AI !!!  Servo Mode Only Working through LCD???? /!/ AI SERVO works while im looking through the viewfinder, and it continues to focus on the subject while Im moving or the subject is moving, but when I try to focus with AI Servo through the LCD screen, and move, it loses focus as soon as I start moving closer or farther away. Im newer to photography and just trying to figure this out, is AI SERVO limited to the viewfinder? Camera is Rebel T7", "link": "https://www.reddit.com/r/Cameras/comments/hoausy/ai_servo_mode_only_working_through_lcd/"}, {"autor": "achieff10", "date": "2020-04-28 00:27:06", "content": "Nikon F5 Question? /!/ Will the Nikon remote -----> ML !!! -L3 work with my Nikon F5 film camera?", "link": "https://www.reddit.com/r/Cameras/comments/g9cxzf/nikon_f5_question/"}, {"autor": "Mina88fr", "date": "2020-08-23 15:38:52", "content": "Handheld Low light photography with mirrorless cameras? /!/ Almost all cell phones these days have advanced Night modes for taking pictures in low light, where the phone takes multiple photos and does some processing to create a sharper, brighter photo that would otherwise be extremely dim and noisy, they realize on -----> AI !!!  and other techniques leveraging the very capable processors on phones these days.\n\nMy question is whether mirrorless cameras have similar features to improve low light/Night photography without using a tripod, I believe mirrorless or DSLR's do not have processors as powerful as smartphones, but any hints on which camera has a better \"Night Mode\"? for example between Canon and Sony (APS-C lines).", "link": "https://www.reddit.com/r/Cameras/comments/if5akw/handheld_low_light_photography_with_mirrorless/"}, {"autor": "tacos-alpastor", "date": "2020-11-26 17:08:35", "content": "Pre -----> AI !!!  (non-ai), -----> AI !!!  or -----> AI !!! S 50mm 1.4 manual lens for the Nikon D3300 /!/ Still an amateur photographer and I'm planning to buy the lens for my camera because I've found all three revisions of the lens at a relatively cheap price and in rather nice conditions. But of course, I can only buy one.  For what I've read in other forums: \n\n∆ the Pre AI version can be mounted to the 3xxx and 5xxx without damaging them BUT these cameras models won't be able to measure the exposure or f-stop. So you pretty much have to guess the exposure.\n\nBut I'm wondering if it's the same situation for the AI and the AIS revisions. So my questions are:\n1. Can they be mounted without damaging my camera?\n2. 2. Is the AIS revision still not compatible with my D3300? (can it tell me the f-stop, exposure)\nSo yeah, in case that neither revision is compatible with my camera, I think I'm confident enough in my knowledge of the triangle of exposure to properly expose my photos. So what do y'all recommend?\nHave a good one!", "link": "https://www.reddit.com/r/Cameras/comments/k1izy7/pre_ai_nonai_ai_or_ais_50mm_14_manual_lens_for/"}], "name": "Subreddit_Cameras_01_01_2020-30_12_2020"}