{"interestingcomments": [{"autor": "jfsky2018", "date": "2020-04-18 17:01:25", "content": "Recommend a photo organiser - Full Collection for JPEG and RAW - -----> AI !!!  Search etc /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/g3qvcn/recommend_a_photo_organiser_full_collection_for/"}, {"autor": "karl_hagstrom", "date": "2020-02-05 19:28:10", "content": "Quickly organize 10000+ photos [tip] /!/ Yearly I have to sift through 10000+ photos from my families cellphone cameras with the single task of deciding which ones to save and which ones to delete (I usually end up deleting like 80 % of them).\n\nI have been searching for a good program to help me get more efficient with this task, but until today without any luck (tried lots!)\n\nSince I am a Software Developer I finally decided to make my own. Imagine the dating app Tinder, but for photos and on Windows that lets you \"swipe\" through all photos(/videos) in a folder and lets you decide which ones to save or delete with the press of a button.\n\nMy program is called [Easy Photo Organizer](https://www.microsoft.com/store/apps/9NSMB0R66PBB) (Microsoft store) and has a free trial (15 days) that includes all the features (even -----> AI !!! -autodeletion), then if you didn't have time to finish cleaning up you cluttered hard drive, its a single cost of 10$.\n\nI added features like:\n\n* **Swap current photo** with last saved or deleted photo (they are shown as thumbnails next to current photo)\n* **Compare mode:** lets you compare the last saved image with the current one, side by side, to help you keep only the best photo of a series of good similar photos.\n* **AI-AutoDeletion:** With the use of a neural network I have made a model that automatically can loop through all photos in a folder and auto delete the blurry/dark ones with a selectable threshold.\n* **Copy-mode:** great for selecting out photos for a specific project (doesn't touch the original photo, but instead makes a copy in the \"/save\" folder.\n* **RAW-conversion:** Not much effort put into this. It just saves a jpg (80% compression) copy of current image (if saved is selected) next to the original RAW (not all formats supported jet!)\n\nThe program actually **doesn't delete** any of your photos, but rather moves them into one of the subfolders: \"/save\", \"/delete\" or \"/autodeleted\"\n\nPlease let me know if you find a bug, have features that you'd want me to add or just if you liked it!\n\nHope that I can help some of you to finally take on the massive task of decluttering your hard drive from bad photos =)", "link": "https://www.reddit.com/r/photography/comments/ezevp9/quickly_organize_10000_photos_tip/"}, {"autor": "giuliomagnifico", "date": "2020-12-29 19:10:07", "content": "Blink-----> AI !!!  world’s first -----> AI !!! -powered ‘Night Mode’ for video (Xiaomi Mi 11)", "link": "https://www.reddit.com/r/photography/comments/kmkod2/blinkai_worlds_first_aipowered_night_mode_for/"}, {"autor": "pooooosldbgicsb", "date": "2020-11-22 21:28:17", "content": "Be my tester &amp; find more photo shoot spots /!/ Hi I’m a student who is looking for beta testers to try the app I have been working on throughout 2020. The app is a place to review, rate, and find local restaurants and hiking trails with the help of -----> AI !!! .\n\n\nIf anyone is interested, here is the signup link: https://docs.google.com/forms/d/12sYqlD51uKvx2Ip8xTrOeE8j4GqfEWjzHPbY3WhO9UQ", "link": "https://www.reddit.com/r/photography/comments/jz3xmw/be_my_tester_find_more_photo_shoot_spots/"}, {"autor": "iainmf", "date": "2020-08-23 04:31:58", "content": "This -----> AI !!!  Removes Shadows From Your Photos", "link": "https://www.reddit.com/r/photography/comments/iex3jn/this_ai_removes_shadows_from_your_photos/"}, {"autor": "User1N23456", "date": "2020-09-10 10:48:33", "content": "Topaz DeNoise -----> AI !!!  overlooks parts of the image /!/ When working in DeNoise, on some \\[astro\\] images the software will overlook certain spots and it ends up painfully obvious where a chunk of the sky or other area has barely been treated for noise. How can I manually point out to the program the regions it missed and fix them? Sometimes it's literally the same sky with nothing special and while 80% of it looks fine, there will be a portion of it almost completely ignored by AI.\n\nI've noticed there's a brush/mask tool there now but I'm not too clear on how to use it in my situation.", "link": "https://www.reddit.com/r/photography/comments/iq1064/topaz_denoise_ai_overlooks_parts_of_the_image/"}, {"autor": "kyle4beantown", "date": "2020-12-28 22:47:04", "content": "Xiaomi Mi 11 Features World's First -----> AI !!! -Powered 'Night Mode' for Video", "link": "https://www.reddit.com/r/photography/comments/km0yn9/xiaomi_mi_11_features_worlds_first_aipowered/"}, {"autor": "siege72a", "date": "2020-02-13 23:21:04", "content": "Topaz Labs is ending Free Upgrades /!/ TL;DR: Starting August 2020,  -----> AI !!!  products will require paid upgrades\n\nTopaz Labs ~~used their weasel-words for~~ made an announcement: [Some products will no longer get free upgrades](https://community.topazlabs.com/t/ongoing-product-value-and-paid-upgrades/13299)\n\nFree upgrades end in July 2020 for DeNoise AI, Sharpen AI, Gigapixel AI, and Mask AI. After that pricing for support/new versions is $49/year for a single app, or $99/year for multiple apps. \n\nUNLIKE Photoshop, if you jump off the support train, you can continue using the application version you have. \n\nMany of the customers are upset.  Topaz applications have been more expensive than their competitors, but lifetime free upgrades was a selling point.", "link": "https://www.reddit.com/r/photography/comments/f3iwe0/topaz_labs_is_ending_free_upgrades/"}, {"autor": "photoexperts", "date": "2020-02-22 01:57:07", "content": "blurams 1080p Dome Security Camera | PTZ Surveillance System with Motion/Sound Detection, Smart -----> AI !!!  Alerts, Privacy Mode, Night Vision, Two-Way Audio | Cloud/Local Storage Available | Works with Alexa", "link": "https://www.reddit.com/r/photography/comments/f7lqb4/blurams_1080p_dome_security_camera_ptz/"}, {"autor": "54815162342314159265", "date": "2020-02-21 17:56:32", "content": "Any alternatives to the Google Clips camera? /!/ I loved the concept but they never sold it in my country and then it was discontinued...\n\nAre there any cameras in the market that do similar things? Small size, automatic shots, wouldn't need to be powered by -----> AI !!!  even, like time lapse every 1 or 5 min would work also. Thank you.", "link": "https://www.reddit.com/r/photography/comments/f7euv5/any_alternatives_to_the_google_clips_camera/"}, {"autor": "jabes001", "date": "2020-01-26 16:48:00", "content": "G.A.S rangefinder or mediumformat? /!/ Good day fellow internet people, \n\nI was gifted a Nikon FM2 along with two lenses (Nikon 50mm f/1.4 -----> AI !!!  and Nikon 35mm f/2 AI-S) for Christmas from my Ex. Have been hooked on photography since.\n\nI’m a fan of Fan Ho, Brassaï and Sebastian Salgado. That rich contrast and vivid detail look. Please feel free to share similar photographers. I am always on the look out to learn more.\n\nTo the main point. I’ve caught the gear acquisition syndrome bug and am looking to either acquire a rangefinder or medium format camera. Preferably I would like to get a camera which will still operate without batteries\nFor rangefinders I’m looking at the Leica M6, Bessa R4M or Zeiss Ikon. (yes i know the Zeiss Ikon needs batteries to operate however from my research it seems like its worth putting into the mix)\nAs for medium format I’m looking at either the Mamiya 7ii or Pentax 67ii (yes i know both require batteries) \n\nAre any of the options i've listed the right direction if I want to get similar vibes as the great photographers I’ve mentioned above? If not what are your recommendations? \n\nI know that the camera doesn’t make the photographer but G.A.S and I’ve saved up a bit of money and feel like living it up a little.", "link": "https://www.reddit.com/r/photography/comments/eu93va/gas_rangefinder_or_mediumformat/"}, {"autor": "2daisychainz", "date": "2020-01-26 04:13:38", "content": "B&amp;W Film Restoration /!/ This evening I watched the restored version of Metropolis (1927), a black and white silent film. The original was lost then found in Buenos Aires, but, unfortunately, damaged. \n\nThe screening showed some scenes in the original then restored form. It was a stark contrast. The original scenes had poor contrast, heavy grain, vertical striping, and other blemishes.  I'm curious what modern techniques are used for this kind of restoration.\n\nBesides frame by frame manual processing, what techniques are used by pros?  For example, sophisticated image processing that'll preserve desired texture while smoothing grain, unsupervised learning approaches that predict missing data, surely -----> deep learning !!!  approaches would be useful for restoring at a large scale, too.\n\nWhat do you guys think? Googling about this topic only yielded results about colorizing B&amp;W films, so here I am. :)", "link": "https://www.reddit.com/r/photography/comments/eu1yab/bw_film_restoration/"}, {"autor": "reinfected", "date": "2020-05-14 12:38:59", "content": "Sony announces first -----> AI !!!  image sensor", "link": "https://www.reddit.com/r/photography/comments/gjljyf/sony_announces_first_ai_image_sensor/"}, {"autor": "h3xadecimal2", "date": "2020-06-10 15:00:15", "content": "-----> AI !!! s from -----> AI !!!  Dungeon 2 to sexy to funny and one based wholly on Reddit! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/h0cpvv/ais_from_ai_dungeon_2_to_sexy_to_funny_and_one/"}, {"autor": "NicoleGirl11", "date": "2020-06-27 17:15:18", "content": "New Camera Gear that uses -----> AI !!!  to enhance photos. Next generation.", "link": "https://www.reddit.com/r/photography/comments/hgxdj8/new_camera_gear_that_uses_ai_to_enhance_photos/"}, {"autor": "Diffrentiaali", "date": "2020-07-16 14:03:59", "content": "Any good -----> Ai !!!  photo organizers? /!/ Hello! I have tens of thousands of photos in my external hard drive and some of them in my PC. (win 10)  I realized that It's very huge job to find the one I am looking for.  \n   \nSo I figured out that to find the photo I am looking for, I would need to have some sort of an artificial intelligent tool that will tag all the photos automatically for me based on what's in the photo.   \n\n\nHowever, there is only few of those and I have no idea what would actually be good. I bet some of you have experiences of those, so please, if you can help me, it would be very helpful! :)", "link": "https://www.reddit.com/r/photography/comments/hsa7b3/any_good_ai_photo_organizers/"}, {"autor": "shian243", "date": "2020-09-26 17:41:50", "content": "This -----> AI !!!  Creates Real Scenes From Your Photos!", "link": "https://www.reddit.com/r/photography/comments/j0adh4/this_ai_creates_real_scenes_from_your_photos/"}, {"autor": "MEGALIGHTNINGTACO", "date": "2020-10-15 05:42:53", "content": "-----> AI !!!  Editing Will Ruin Photography As We Know It - Thomas Heaton", "link": "https://www.reddit.com/r/photography/comments/jbhsmq/ai_editing_will_ruin_photography_as_we_know_it/"}, {"autor": "Urbex_Badger", "date": "2020-12-10 10:00:14", "content": "-----> AI !!!  photo editing kills photographic talents. Change my mind. /!/ So a few days ago I've had an interesting conversation with a fellow photographer, from which I know that he shoots and edits on mobile. He recently started with \"astro photography\",  however, since I was wondering how he managed to take such detailed astro pictures like these on a smartphone camera, it looked kinda odd an out of place. I've taken a closer look and noticed that one of his pictures (taken at a different location) seems to have the exact same sky and clouds as the one he's taken a week before. Photo editing obviously. I asked him about it, and asked which software he used, turns out he had nearly no experience in photo editing, and used an automatic AI editing software on mobile. I don't blame him for knowing nothing about editing, that's okay, his decision. But I'm worried about the tools he's using, automatic photo editing designed with the intention to turn everything into a \"professional photo\" with the click of a button. I know that at first it seems to open up more possibilities for people with a creative mind without photoshop talents, however I think it doesn't. It might give them a headstart for a few designs and ideas, but these complex AI features are limited, and without photoshop (with endless possibilities) you'll end up running out of options, using the same AI design over and over (at least till the next update of the editor lol). And additionally, why'd these lazy creative minds (most cretive people are lazy, stop denying that fact) even bother to learn photoshop, if they have their filters? Effortless one tap editing kills the motivation to actually learn using photoshop, it keeps many people from expanding their horizons. And second, what's the point in giving a broad community of people these \"special\" possibilities? If all these pictures are edited with the same filters and algorithms by everyone, there'd actually be nothing special about their art anymore, it'd all be based on the same set of automatic filters and algorithms. \n\nThis topic is in fact the same moral as the movie \"The Incredibles\" wanted to tell us, \n\nQuote: \"when everyone is super, no one will be\"\n\nI hope y'all understand my point, any interesting different opinions on this topic are very welcome in the comment section below...", "link": "https://www.reddit.com/r/photography/comments/kacr83/ai_photo_editing_kills_photographic_talents/"}, {"autor": "apk71", "date": "2020-12-27 15:45:37", "content": "NR and Sharpening software. /!/ I have been using the NIK suite (DFine2 and Sharpener Pro 3) though Lightroom for years. Heard about the new -----> AI !!!  based software From Topaz and DxO. They both have 30% off sales going on for the next 4 days. I downloaded and installed trial versions of Denoise AI and Sharpener AI as well as PhotoLab 4 with the Deep Prime NR.\n\nWow!!! The Topaz stuff is awesome, and the PL4 NR is amazing. I found so far that the NR in Denoise AI and PL4 Deep Prime are about the same and SUBSTANTIALLY better than DFine2. I really wish PL 4 had an AI sharpener built into it as the program is very nice. Pretty much decided to go with the Topaz stuff through LR though.\n\nWhat do others use for Noise and Sharpening?", "link": "https://www.reddit.com/r/photography/comments/kl5pmm/nr_and_sharpening_software/"}, {"autor": "LittleDogFido", "date": "2020-12-27 14:25:12", "content": "360 degree photos, 3D photos, and -----> AI !!!  upscaling /!/ Apologies if this post is not right for this subreddit, but potentially more relevant ones seem more or less inactive. Disclaimer: I would strain to call myself even an amateur photographer so forgive my ignorance. \n\nHere is my situation/question. Last year I was experimenting with 360 photos via Cardboard VR with a cellphone camera. I was decently pleased with the results for the project. In experimenting with it I took a 360 photo of my dad in the living room. What I didn't know at the time is that it was the last photo I'd ever take of him as he passed away not long after. This is why I am determined to find a solution.\n\nI have noticed that apps such as Facebook can add a 3D effect to static images and others that claim to use AI to improve resolution. My hope is to combine all three: Improve the resolution of the relatively low res cellphone 360 image and add a 3D effect so that the final product simulates a VR environment.\n\nAgain apologies if this is innapropriate and for the lengthy post but under the circumstances I would me remiss if I didn't pursue all avenues. Thanks in advance for any advice(or bad news) you can offer.", "link": "https://www.reddit.com/r/photography/comments/kl4hfq/360_degree_photos_3d_photos_and_ai_upscaling/"}, {"autor": "hardypart", "date": "2020-11-12 07:11:41", "content": "Topazlabs Denoise worth it? /!/ I see lots of advertising on FB for the -----> AI !!!  driven denoise software from Topaz labs. I heard it's indeed really good, but the examples look too good to be true.\n\nDid anyone of you already try it? Is it really that good?", "link": "https://www.reddit.com/r/photography/comments/jsqa3m/topazlabs_denoise_worth_it/"}, {"autor": "Ghost-Hunter4", "date": "2020-11-12 06:23:12", "content": "The Humble Software Bundle: -----> AI !!! -Powered Photo Editor with Luminar 4 just launched on Wednesday, November 11, and will be live through Wednesday, December 2, 2020. Get software like Luminar, Aurora HDR, Photolemur 3, and more. This will help you to create amazing photos", "link": "https://www.reddit.com/r/photography/comments/jsppkz/the_humble_software_bundle_aipowered_photo_editor/"}, {"autor": "dangerousdingus", "date": "2020-01-25 15:18:44", "content": "Help with nikon fm and -----> Ai !!!  lenses! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/etrys9/help_with_nikon_fm_and_ai_lenses/"}, {"autor": "Chelsva", "date": "2020-04-21 23:28:22", "content": "-----> AI !!!  photo culling tool - beta testers needed /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/g5q7wu/ai_photo_culling_tool_beta_testers_needed/"}, {"autor": "foamoirefresher", "date": "2020-05-21 17:35:33", "content": "Struggling with Storytelling in photography - Discussion, Video, Images and Journal entry - Long Post! /!/ Im a part-time photographer and I used to have this real passion for landscape images.  I live on a relatively small island so seascapes, landscapes etc are abundant.  Anyway I have been feeling that I have exhausted all the spots on my island, visiting them throughout the years in different seasons, different light, times of day to get the best shots of the area.\n\nBut as of late, really since the beginning of the year it just doesn't seem to be cutting it anymore, I feel like its rinse and repeat, over and over again and since my other work has been slow since wedding have been cancelled and my other part time job I only work 10 hours a week it has got me into somewhat of a rut.\n\nI was looking back at my first few years of photographs from around 15-18 years ago, shooting on film, self developing and they all have such a quality to them, I look at them and I see this story, of my friends and I, hanging out, life growing up and it suddenly felt that I don't have this emotional connection with any of my current landscape images, my newer work or any photographs I have taken in the last 3-5 years.  \n\nI stopping picking up my camera, no clients and no desire to get out shooting so I just stopped.  This went on for a few weeks and I began to pick up my older DSLR and film camera and just casually shooting a couple of weeks ago, not really paying much attention but just trying to have fun, I watched a few youtube videos earlier this week and I began to think about what photography really meant to me.  I wanted to meditate on this idea and get some thoughts down on paper, this is what I wrote:\n\n&amp;#x200B;\n\n*‘What does photography mean to me?  Looking back at the beginning of my photography journey I’m not sure if it is nostalgia or just the great (but not always) memories but everything (the photographs) seem to have a more of a magical sparkle to them.  Things are just too easy now, I have every variable available to me at all times in post production that it seems to be a wish-list of skills and looks that is just rinse and repeat, image after image.*\n\n*Not photograph after photograph, these digital recreations of time is but a digital fingerprint of where I have been and what I have seen.  Emptiness, lifeless landscape image with nobody to share them with.  They only become photographs either when I print them to bring them into the physical world, or when that moment of capture is shared with somebody else.*\n\n*I have been a slave to the digital realm, focusing on sharpness, colour, micro-contrast, focus stacking, exposure bracketing, like seeking nothingness and it has not made me any happier, I think far from it.  And has it moulded me into an inferior photography?*\n\n*Maybe…*\n\n*Digital darkroom, photographic enhancement, luminosity masks and -----> AI !!!  algorithms to stitch 120 megapixel monsters, pointless.  Look at me, I have the latest PANIKONY MK7ii with XY2 lens and every other accessory available to man.  But it is ok to use these, the question is should I?*\n\n*The landscapes I create used to mean so much to me finding perfection everywhere I go, the best light, composition, what filters, how to process and it all very well said and done, I have learnt many skills along the way, but at what sacrifice?  To no longer look at the world with fresh eyes, but just to see a look, a feed, no story soul or meaning.*\n\n*I want to narrow my focus, and that focus has to be relevant and have meaning, at least to me.  It is all about the story after all isn’t it?  To narrow my focus on the things that really mean something to me, my friends, family and life.  Adventure is everywhere, I feel like I was in such a rush to quit Funky (old job) and have time, that I quit more than that job when I left.  My work ethic has changed inside me, my fuel and fire has dwindled as I have had more opportunities.*\n\n*Is it because I feel I must suffer to succeed, No.  But I need to be challenged, to be inquisitive, to be interested.  Maybe if I was more interested in my own landscape images then somebody else would be too.  I think thats why I made them, for others to look at, but I’m still not sure what they see when they look at them.  There is no story or meaning to them and I’m not sure if just beauty is enough.*\n\n*Im not sure that this is a moment of self doubt, nut more the lines of realisation that a photographer can be whoever they want to be.  They don’t need to fit into genres or follow trends.  They don’t need to create new trends or even bring back old ones.  They don’t need to be bold and think big, they don’t need to be perfect and have all the answers.  I think the only thing a photographer needs is the passion to tell a story.  And I think it's time I carried on telling the only story I know.  Mine.’*\n\n&amp;#x200B;\n\nI felt like this really challenged my beliefs on what I was trying to do and get out of my images, where I wanted to see them and question who I was really pleasing.  Myself, a random person, or another photographer.  I think that its important to take steps back and re-evaluate whats happening in your photographic journey at whatever skill level you might be at.\n\nIt has led me to believe that I am just not that bothered about landscapes anymore and I don't really want to carry on pursuing them.  I am going back to older projects and coming up with new ideas of projects I want to do in the future to create the work that really means something to me.  \n\nIf you are relatively new to photography I think you should ask yourself what kind of images would you like to look back on in 20 years, what will tell that story for you.  If you are picking up a camera just to get likes and follow trends then you might just be wasting your time, and money.\n\nIf you are an experienced photographer I ask you this; \n\nWhat does photography mean to you and what are your goals or projects you are working on that captivates you over long periods of time?\n\n&amp;#x200B;\n\nI made a follow up video about my journal entry the next day which is [here](https://www.youtube.com/watch?v=XktF0GMqFgQ) if you want to check it out.\n\nAnd I also made a blog post discussing the same thoughts and ideas behind my struggles with storytelling in photography [here](https://www.luismoraisphoto.com/blog/my-struggles-with-storytelling-in-photography) if you want to check it out.\n\n&amp;#x200B;\n\nThanks for reading and have a great day!\n\n&amp;#x200B;\n\nLuis", "link": "https://www.reddit.com/r/photography/comments/go1awk/struggling_with_storytelling_in_photography/"}, {"autor": "HI_CoBE", "date": "2020-05-29 05:43:14", "content": "UH Hilo CoBE data science students use -----> machine learning !!!  to predict college completion /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/gsmy1n/uh_hilo_cobe_data_science_students_use_machine/"}, {"autor": "a5s_s7r", "date": "2020-05-28 11:37:15", "content": "Review Workflow for small team /!/ Hi,\n\nwe are a small company (6 people) with a lot of photos and media to handle.\n\nWe use Catpure One, Ligthroom and Photoshop to edit our photos, also have a lot of grahic designs as -----> AI !!!  and EPS files.\n\nI am looking for a solution to do following workflow:\n\n* culling, taging and first editing\n* have a possibility to do a review for 1 or 2 team members. should be definable somehow who can do it\n* should be able to have user groups to limit who can see which gallery/image. photos can be mixed private and work related.\n* tagging manual and based on an AI would be great\n* running internally on our server\n* should not break the bank\n\nLightroome would do most of it, but only on one working place, but we need to have a browser based solution as we have team members working from home.\n\nDo you have any suggestions?\n\nThanks in advance", "link": "https://www.reddit.com/r/photography/comments/gs4nrb/review_workflow_for_small_team/"}, {"autor": "zxrooo", "date": "2020-06-22 23:24:56", "content": "Check out this new -----> Ai !!!  - ran Twitter account that posts photos..", "link": "https://www.reddit.com/r/photography/comments/he39yd/check_out_this_new_ai_ran_twitter_account_that/"}, {"autor": "cheesylasagne69", "date": "2020-06-26 20:16:46", "content": "This insane Youtuber uses neural networks (-----> ML !!! ) to upscale a B&amp;W era of George Eastman level (video)photography. Really corrects your vision that life in those days was definitely in color.", "link": "https://www.reddit.com/r/photography/comments/hgf4pq/this_insane_youtuber_uses_neural_networks_ml_to/"}, {"autor": "ThatsYourHomeBall", "date": "2020-07-07 09:00:21", "content": "Is there anything as good as Google Photos Facial Recognition -----> AI !!!  to replace it with? /!/ I use google photos a lot for the facial recognition feature and other AI features of automatically recognising photo types.\n\n&amp;#x200B;\n\nIs there anything as good i can replace it with? It needs to be online ideally so I can see my photos from anywhere and i know they are backed up\n\n&amp;#x200B;\n\nSo i want to tag someone's face then click on a picture of that persons face and it bring up all the photos of the person.\n\n  \nAny help appreciated please!", "link": "https://www.reddit.com/r/photography/comments/hmr19g/is_there_anything_as_good_as_google_photos_facial/"}, {"autor": "TellurideTeddy", "date": "2020-08-30 00:50:22", "content": "Cloud Workflow Advice - Video + Photos + Multiple Computers + Multiple Locations? /!/ Been struggling with this for years, I'm really wanting to finally come up with a \"best\" solution for my situation.\n\nI split my living time between different locations so I sometimes work for a few months on my Macbook before getting back to my hardcore editing rig. I have photos and videos coming in from Canon DSLRs, underwater camera rigs, iPhones, drones, 3D cameras, all the usual suspects. I also create heavy loads of -----> AI !!!  and PSD graphic assets but Creative Cloud storage has mostly solved that for me. \n\nWhat I'm looking for is a Git-like solution where after a shoot I can upload all of my images or videos to the cloud, and then \"check out\" whatever files I'm going to be working on for a while before checking them back in with their most current state. At the moment I really struggle with ensuring that all of my assets are even accessibly from one place and knowing that I'm not at risk of misplacing or forgetting about something, as well as ending up with multiple versions of files and later not knowing which ones are \"current.\"\n\nI've heard there's a way to mount a Google Drive folder to your local machine and then using Adobe Bridge to browse it for both photos and videos, I'm wondering if that might be the ticket. But I'm also hoping there's a more elegant solution out there, sort of a DAM-lite?\n\nAny advice would be greatly appreciated!", "link": "https://www.reddit.com/r/photography/comments/ij3s0s/cloud_workflow_advice_video_photos_multiple/"}, {"autor": "SciTroll", "date": "2020-09-25 13:18:08", "content": "Photoshop will soon use -----> AI !!!  to add dramatic skies to your boring photos", "link": "https://www.reddit.com/r/photography/comments/izj95k/photoshop_will_soon_use_ai_to_add_dramatic_skies/"}, {"autor": "prasadkirpekar", "date": "2020-09-24 12:50:57", "content": "Stock photo site but for raw files /!/ Hello, We are working on a photo site called [Rawshotz.com](https://rawshotz.com/). We are aiming to provide a lot of stock photos as well as raw files of it. Many stock photo sites have high resolutions jpeg available to download, but raw files will be the highest resolution and will contain all the information.   \nWe have launched the first version of the site at [rawshotz.com](https://rawshotz.com/). We have implemented general cool filters as well as we have one nice filter called \"RawShotz -----> AI !!! \". It makes images look more awesome.  \nYou can upload your photos at rawshotz.com/upload. We are looking for photographers to submit their raw files on the site. If you have raw files in the large number you can mail me for help at prasad@rawshotz.com.  \nPlease explore the site and give us feedback. Thank you.", "link": "https://www.reddit.com/r/photography/comments/iywnk7/stock_photo_site_but_for_raw_files/"}, {"autor": "DaveStutler", "date": "2020-10-05 07:54:12", "content": "Aspect ratio change using -----> AI !!!  /!/ Will it be possible to change the aspect ratio of a photo using AI (e.g expanding 1.33:1 photo to 1.78:1)?", "link": "https://www.reddit.com/r/photography/comments/j5fevd/aspect_ratio_change_using_ai/"}, {"autor": "DeddyDayag", "date": "2020-10-10 09:04:06", "content": "The right image is Hubble, the left is an amateur astrophotographer. What do you think about these guys, using Topaz -----> AI !!!  to create FAKE details in their images? I find this totally frustrating that I struggle for every arcsecond of details and these guys post images like this and get a lot of hype.", "link": "https://www.reddit.com/r/photography/comments/j8hccl/the_right_image_is_hubble_the_left_is_an_amateur/"}, {"autor": "Ghost-Hunter4", "date": "2020-11-29 23:51:55", "content": "Only 2 days and 19 hours left for the HUMBLE SOFTWARE BUNDLE: -----> AI !!! -POWERED PHOTO EDITOR WITH LUMINAR 4 Get Luminar 4, Aurora HDR, Photolemur 3, Skies: Power of Nature and more!", "link": "https://www.reddit.com/r/photography/comments/k3kbfi/only_2_days_and_19_hours_left_for_the_humble/"}, {"autor": "Starfocus81613", "date": "2020-12-17 07:22:35", "content": "Luminar 4 + -----> AI !!!  Review /!/ So I’ve been researching complimentary and competitive software to Adobe’s Lightroom ever since they’d shifted their model from perpetual licensing to subscriptions. I’d recently run across an article that compared Lightroom to a newer software from Skylum called Luminar 4 and Luminar AI, which was being designed to use neural networking strategies to develop images.\n\nFrom what I had read, not only was Luminar comparable to LR’s range of tools, the interface and learning curves were much better to get into. It offers a faster editing process compared to Lightroom, making it seem much more appealing. The AI capabilities that were touted in the reviews seemed to make it sound extremely impressive, especially being able to add solar rays or replace skies more easily. Heck, Jim Nix was even sponsoring Luminar 4 in recent videos to show off how to make his photography really pop!\n\nWhat everyone failed to mention, however, was the mediocre programming and processing capabilities of Luminar 4, in my opinion. Not only is it not a stable platform to work with, it’s endeavors to introduce simplicity and ease of use created shortcuts that cut corners and ultimately led to an inferior product. \n\n\nI’d downloaded the pair of software applications to try out and gauge if it met my needs. In the three says I’ve worked with it, I was left with the following impressions:\n- The main claims made about Luminar 4 and Luminar AI were that it was made to create faster post processing possible. This was offset by how often the application would crash, making all of the work put into it much MORE time consuming than using an alternative application!\n- The automated features such as the solar rays and sky replacement were a nice touch that I thought would be useful in the long run, especially dealing with mundane tasks like ray tracing, atmospheric effects, and so on. While these features sound great, I found that each felt out of place in the trial photographs I’d tested these tools with. The sky replacements felt out of place in the images, sometimes creating more issues trying to blend the replacement sky into the original image. The solar rays were too high luminosity too early on the slider, making adjustments (and their advanced adjustments) poorly scale.\n- RAW file formats, while supported, too a lot of memory to run. I’d found that while using my RAW library, my 16GB RAM was 40% idle and 90%+ while handling things such as multiple adjustment layers or running a luminosity mask. This often led to multiple crashes just prepping an image for layered adjustments!\n- One of my largest concerns was that edits were being made on the original files instead of the program creating a copy of the image it was editing. Instead, I’d found that while trying to avoid any edits to the original image before exporting, the image libraries and the image you work on were being preallocated to memory while the software was running. This was an issue when I was dealing with access to a portion of my image library— well over the capacity of my computer’s RAM. Supposedly, the image thumbnails are supposed to use a compression method to avoid any issues; however, I found that this was not necessarily the case and that the abundance of images in the library was overwhelming the software.\n- Since you’re limited to one version of your image, the only way to preview multiple versions was to create duplicates of the same image for as many revisions to the style or tone of the image as I would need. This was a feature that I sorely wished they would have added in (multiple virtual images with various styles); however, due to the memory issues, I doubt it would have made their customers happy.\n- Lastly, working on large volumes of photos requires a strong and stable foundation of building profiles or masks that can be applied to a whole range of similar photos. I felt that Luminar lacks the stability to really handle a typical day out. Due to consistently crashing, I was not able to get through a single album of photos in the time I’d set aside to do so, making it all the more frustrating trying to work with a product that didn’t want to work with me.\n\nOverall, I felt like the hype for AI driven technologies was what led to Skylum’s rise in popularity. The issue is that they were trying to reinvent the wheel and do too many things to really make a comparable or competitive product in today’s market.\n\nOpen-source applications felt more stable and had more features that make them competitive software applications. My main post process tool, RawTherapee, had a comprehensive list of available tools and features with a moderate learning curve. While it misses out on adjustment layers and masking, the software itself is ideal for large volumes of batch processing and individual edits. GIMP similarly feels like it has more community support and documentation than what Skylum has produced. Google Snapseed— used for mobile RAW processing and spot post-processing— feels easier to use. And while despite being limited to working on individual photos, I feel like it’s an excellent example of how to simplify post processing to streamline for faster methods.\n\nAll in all, I can’t say I’m impressed with Skylum’s current products. I hope to see their software grow and develop to fulfill their goals, I just don’t think they’re there yet.", "link": "https://www.reddit.com/r/photography/comments/kessqx/luminar_4_ai_review/"}, {"autor": "EagleFly_5", "date": "2020-10-28 18:51:21", "content": "Is Artificial Intelligence Destroying Art? | Fstoppers (discussing Luminar -----> AI !!!  + modern editing practices in photography/film + videos/tv shows) (29m57s long video)", "link": "https://www.reddit.com/r/photography/comments/jjttjw/is_artificial_intelligence_destroying_art/"}, {"autor": "OnlyProggingForFun", "date": "2020-11-07 13:23:10", "content": "This -----> AI !!!  can Colorize your Black &amp; White Photos with Full Photorealistic Renders! Try it yourself, for free on your own old family black and white photos, and tell me what you think about it! /!/ Watch how it is done and more results: [https://youtu.be/1EP\\_Lq04h4M](https://youtu.be/1EP_Lq04h4M)\n\nTry it yourself:\n\nFree DeepAI image colorization API using DeOldify: [https://deepai.org/machine-learning-model/colorizer](https://deepai.org/machine-learning-model/colorizer)\n\nMyHeritage colorization tool (the best version of DeOldify available, paid): [https://www.myheritage.com/incolor](https://www.myheritage.com/incolor)\n\nGitHub with full code, in-depth explanation, and Colabs: [https://github.com/jantic/DeOldify](https://github.com/jantic/DeOldify)", "link": "https://www.reddit.com/r/photography/comments/jpqr4f/this_ai_can_colorize_your_black_white_photos_with/"}, {"autor": "Iain_MS", "date": "2020-11-11 21:44:44", "content": "Humble Software Bundle: -----> AI !!! -Powered Photo Editor with Luminar 4", "link": "https://www.reddit.com/r/photography/comments/jsh691/humble_software_bundle_aipowered_photo_editor/"}, {"autor": "Plus_Ninja", "date": "2020-11-11 21:44:03", "content": "Support charity and get a great -----> AI !!!  driven software bundle and plugins for photography. These application will really help!", "link": "https://www.reddit.com/r/photography/comments/jsh5q4/support_charity_and_get_a_great_ai_driven/"}, {"autor": "aaronputman", "date": "2020-11-15 17:31:46", "content": "CURIOUS - -----> AI !!!  in photo editing /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/jupnp7/curious_ai_in_photo_editing/"}, {"autor": "AppleNikonBose", "date": "2020-11-20 03:02:34", "content": "Just discovered the Topaz Black Friday Preview. All products for 200-300usd (instead of 600). Even with Video Enhance -----> AI !!! !", "link": "https://www.reddit.com/r/photography/comments/jxh9uv/just_discovered_the_topaz_black_friday_preview/"}, {"autor": "Original_AI", "date": "2020-02-11 23:04:42", "content": "F-Mount -----> AI !!! -S Screw-drive Problem /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/f2gwte/fmount_ais_screwdrive_problem/"}, {"autor": "bramleyapple5", "date": "2020-02-07 12:47:07", "content": "Martina, Milano, 2020. Panasonic Lumix S1 + Nikkor 180mm f2.8 ED -----> AI !!! -s", "link": "https://www.reddit.com/r/photography/comments/f0a0bu/martina_milano_2020_panasonic_lumix_s1_nikkor/"}, {"autor": "illnevertell2", "date": "2020-04-01 08:30:17", "content": "Camera wouldn’t fire /!/ Hi all! I was recently shooting my baby cousin using my Canon T2i. The baby was moving around a lot and my camera wouldn’t fire, it just kept hunting for focus. I don’t know if the baby was falling out of the focus point or what. I tried using all of the focus points at once so that even if the baby moved he would hopefully still fall under one of the focus points, but I couldn’t figure out how to make my camera use all focus points at once versus just a single point. It is also important to note that the baby was not changing focal planes, he was just jumping up and down and throwing leaves. Therefore, the distance from the camera to the baby rem-----> ai !!! ned the same the entire time, so I don’t think using -----> ai !!!  servo would have helped? Not sure. It is also important to note that I was using the widest aperture. We were also outside in a brightly lit area. Would appreciate any insight as to why my camera wouldn’t fire! Thank you!", "link": "https://www.reddit.com/r/photography/comments/fsvsz1/camera_wouldnt_fire/"}, {"autor": "HistoryNerd", "date": "2020-04-24 14:17:55", "content": "Canon's new Image.canon cloud storage: You are giving Canon licensing rights. /!/ Initially, I was excited to hear what [Image.canon](https://Image.canon) offered, especially since my workflow integrates with Google Drive shared folders. I was reading through the TOS for the new service while I was signing up and found this gem:\n\n\"**12. Intellectual Property**\n\nA Member retains ownership of his or her Image. By uploading Image to the Service, a Member grants Canon (including its affiliated companies and third party service providers and business partners) right and license to copy or otherwise use, on a worldwide basis, free of charge, the Member’s Content for the purpose of (a) providing the Service, (b) improving the Service, and (c) improving and developing current and future Canon products and services, including supporting one (1) or more trainable datasets used in -----> AI !!!  engines. The right and license continue until relevant Content from the Service is deleted.\n\nEach Member represents and warrants that the Content is either owned by the Member and he or she has all permissions required to distribute the Content, and that Canon and its respective service providers are free to exercise the license rights granted herein without obtaining permission, consent or any license from any third party.\"\n\n&amp;#x200B;\n\nYes, I know Google's terms abstractly imply that they can access your data for AI purposes, especially if you're using the free storage photo mode, but this is straight up saying you're giving Canon permission to use your files for their advertising, free of charge, anywhere in the world. The takeaway is that if you're going to use Image.canon and do exclusive contracts, it might not be the platform for you given the risk. \n\nFor hobbyists and anyone just shooting for fun, I don't really see much of an issue here. The service isn't for me, but it's stuff you might want to know before you just click accept.", "link": "https://www.reddit.com/r/photography/comments/g795ll/canons_new_imagecanon_cloud_storage_you_are/"}, {"autor": "s0me0ne21483", "date": "2020-04-29 09:54:26", "content": "Help me with my Astrophotography -----> AI !!!  project /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/ga6lus/help_me_with_my_astrophotography_ai_project/"}, {"autor": "akbanx", "date": "2020-05-11 16:09:49", "content": "A Guide to Film Photography Feature Accounts on Instagram (originally posted on Analog Community) /!/ Hey r/photography! This is a guide I wrote to analog feature accounts on Instagram. I know there are a lot of useless hashtags out there, and I wanted to highlight some feature accounts that might be a good start for film photographers who are interesting in finding inspiring work and sharing their own with the IG community. \n\nThis list is in no way meant to be exhaustive, as that would be impossible, but for those of you who are starting out with film photography and wondering how to share your work, there are a number of accounts that have their own hashtags, and mostly feature photos that are tagged with those hashtags. There are so many of these accounts that it’s sometimes hard to tell them apart, so part of why I wanted to write this is to help demystify their differences.\n\nSome of these accounts are legitimate print outlets, though some of them just exist on Instagram. Some of them – particularly the larger accounts – may not rely on hashtags for discovering work at all, even though it seems like they do. Your mileage may vary, and to be honest, it’s sometimes a popularity contest, especially with accounts that have more than 200k followers. But other photographers may follow these hashtags and discover your work as a result.\n\nThere’s a lot of crossover with these accounts. You’ll see certain photos and photographers that are featured on multiple accounts, which is I guess the film photography version of going viral. You know the kind of photos I’m talking about – the kind that are peppered throughout Instagram’s “explore” section, or the ones that hit the top of [r/analog](https://www.reddit.com/r/analog/). The kind that win contests. The ones that make you wish that you too were a master of nailing exposure and stumbling across (or creating) scenes that take your breath away.\n\nAnyways, here’s a rough guide to curated feature accounts, sorted by the size of their follower-base. Instagram pages are linked. As a disclaimer, I think that curation is more important than popularity, and some of the smaller ones are run by people who are more involved in the analog community. Most of them are focused on film photography, but they’re not all exclusively analog. Some featured photos just have a film “vibe” or aesthetic, which may annoy some people here. Lastly, these are just my opinions. This is a subjective guide. I'm not an expert -- I'm just a fan.\n\nOne thing I want to say is that you should **NEVER PAY FOR FEATURES**. I know it's tempting, everybody wants to get their work seen, but these accounts are popular because of other people's work. If anything, they should pay YOU for the use of your photography. I haven't mentioned certain accounts here because of this.\n\nAnyways...\n\n**\\~ \\~ A LIST OF FILM PHOTOGRAPHY FEATURE ACCOUNTS \\~ \\~**\n\n[**Somewhere Magazine**](https://www.instagram.com/somewheremagazine/) **(#somewheremagazine) (861k followers)**\n\nSomewhere Magazine is one of the larger accounts out there. There’s a nice mixture of cinematic scenes and more abstract lens-based art on this page, and it lives up to its claim of being a “mood board”.\n\n[**Film Wave**](https://www.instagram.com/film.wave/) **(#filmwave) (275k)**\n\nThis account has a tendency to post photos that are in some ways related to the act of analog photography in a meta kind of way. You’ll find analog self portraits, photos of cameras, etc. on here. There’s obviously more to their curation than that, as it is a large account with a large fanbase, but if you have a beautifully shot gear pic, this might be the account for you to tag.\n\n[**Nowhere Diary**](https://www.instagram.com/nowherediary/) **(#nowherediary) (257k)**\n\nLots of night scenes and foggy, moody photography. Lots of beautiful, empty scenes with no people in them, though some photos do feature people. What I like about this account is their tendency to pair some of their posts with lengthy written blurbs about photography. They have a series of Nowhere Diary Legend posts where they introduce their audience to famous photographers, which is a cool way to find out about significant photographers if you’re new to photography and/or less plugged in to the historical side of things.\n\n[**Film Photographic**](https://www.instagram.com/filmphotographic/) **(#filmphotographic) (204k)**\n\nOne of the founders and curators is Jason Lee, which is cool. Also a gallery and book publisher. There’s an emphasis on more rural scenes here and landscapes. Many of the photos are people-less, which I like. I’m not sure how active it is, but it’s maybe worth checking out.\n\n[**If You Leave**](https://www.instagram.com/ifyouleavestagram/) **(#ifyouleave) (152k)**\n\nBig M O O D. Cinematic pics out the wazoo. Even the name is dramatic. This account has been around since 2009, before certain film cameras started costing more than cars. I like their curation.\n\n[**Film Photo Mag**](https://www.instagram.com/filmphotomag/) **(#filmphotomag) (137k)**\n\nThere seems to be an emphasis on grainy photos on this page, some of which are underexposed (but who cares!). Moody stuff. Lots of cities, lots of silhouettes. That kind of thing.\n\n[**Tainted Magazine**](https://www.instagram.com/taintedmag/) **(#taintedmag) (9k)**\n\nLots of fine art portraiture, sometimes of famous people. The curation seems to favor innovative poses and composition that wouldn’t be out of place in a fancy MFA program. Think Ryan McGinley, or someone whose work is more abstract than that. The photos here look like they could be in NY Mag or the NYT magazine. Or a museum, really.\n\n[**Film Shooters Collective**](https://www.instagram.com/filmshooterscollective/) **(#heyfsc) (80k)**\n\nThis account has been around for quite some time, and you’ll notice that some of their curation highlights photos that embrace the imperfections of film. By this, I mean photos shot on expired film, or photos with light leaks. If you like double exposures, this might be a good hashtag for you to use.\n\n[**Photo Filmy**](https://www.instagram.com/photo.filmy/) **(#photofilmy) (74k)**\n\nThere tends to be a focus on geometrically-pleasing images here. Lots of beautiful old buildings, some Americana-influenced stuff. There’s an interesting mix of curation here, and a number of the photos are densely layered.\n\n[**Ain't–Bad**](https://www.instagram.com/aintbad/) **(#aintbad) (70k)**\n\nThis is less of a feature account and more of a real-assed magazine/publisher. There’s more of an emphasis here on body of work (photo essays, photo books) than singles, which I really like because a cohesive body of work is what eventually sets you apart from the kind of photographers who just take pretty pictures.\n\n*NOTE: I found out after writing this that there are some* ***serious underlying issues with -----> Ai !!! n’t Bad***\\*, which you can find out about on Instagram. Notably, they have failed to support people of color and lack diversity in their programming. There are also accusations of sexual assault that have been brought up against people involved with Ain’t Bad. It’s\\* ***really*** *disappointing and disheartening to read about because I’ve found some great photographers through their site. Consider not using this hashtag.*\n\n[**Back 2 the Base**](https://www.instagram.com/back2thebase/) **(#back2thebase) (44k)**\n\nA mixture of Ian Howorth-esque emptiness, portraiture, and street photography. Quite artsy. I like their logo.\n\n[**Drive By Film**](https://www.instagram.com/drivebyfilm/) **(#drivebyfilm) (31k)**\n\nSpoiler alert: there are a lot of beautiful cars on this account’s page, along with some gas stations, and a little bit of night work. It seems to be very focused on American scenes, though to be fair, so are many other accounts.\n\n[**Restore from Backup**](https://www.instagram.com/restorefrombackup/) **(#restorefrombackup) (31k)**\n\nI’m biased in my love for this account because they’ve shared my photography on multiple occasions (and more than other feature accounts have), but they place a really high value on community-building, and in that way it’s like a mixture of [r/analog](https://www.reddit.com/r/analog/) and [r/analogcommunity](https://www.reddit.com/r/analogcommunity/). From what I can tell it’s run by good people who don’t have a superiority complex about photography. They also do a nice job of showcasing work from smaller accounts.\n\n[**Burbs on Film**](https://www.instagram.com/burbsonfilm/) **(#burbsonfilm) (26k)**\n\nThere are plenty of photos of suburbs on this page, but they’re not exclusively shot in suburban settings. A number of these photographs subvert traditional stereotypes of the United States, though some are pretty straightforward in their scope. Lots of these photos feel like they’re from another era.\n\n[**Make Me See Mag**](https://www.instagram.com/makemeseemag/) **(#makemeseemag) (24k)**\n\nWhat I’ve noticed with the photos that this account features is that they mostly feature photographs that have a dynamic subject that your eye zeroes in on immediately. There’s a little bit of flash photography thrown into the mix, which is nice. The curation is pretty varied and some of the photos are shot in quite innovative ways. It’s a great account that deserves a larger following.\n\n[**The Film Stead**](https://www.instagram.com/thefilmstead/) **(#thefilmstead) (11k)**\n\nSoothing, beautiful photography with a focus on architecture and landscapes. In a world where so many photographs are moody and dark, it’s nice to see photos that have a happier, more positive vibe.\n\n\\-----\n\n**Accounts with less than 10k followers that might be worth your time:**\n\n[**Every Day Rural America**](https://www.instagram.com/everydayruralamerica/) **(#everydayruralamerica) (6k)**\n\n[**Rural Exposures**](https://www.instagram.com/ruralexposures/) **(#ruralexposures) (6k)**\n\n[**The Film Renaissance**](https://www.instagram.com/thefilmrenaissance/) **(#thefilmrenaissance) (5k)**\n\n[**Film Leaders**](https://www.instagram.com/filmleaders/) **(#filmleaders) (4k)**\n\n[**Observation Magazine**](https://www.instagram.com/observationmag/) **(#observationmag) (3k)**\n\n[**Seasoned Film**](https://www.instagram.com/seasonedfilm/) **(#seasonedfilm) (2k)**\n\n[**Analog Drive**](https://www.instagram.com/analogdrive/) **(#analogdrivemag) (1.5k)**\n\nFeel free to post more accounts that you like in the comments, or share your thoughts on these accounts.\n\nFull disclosure: I am not involved with running any of these accounts. I’m just a person who loves photography of all kinds, and wanted to share my thoughts on feature accounts with new (and established) photographers.\n\nAnyways, thanks for reading.", "link": "https://www.reddit.com/r/photography/comments/ghqhgn/a_guide_to_film_photography_feature_accounts_on/"}, {"autor": "twindiesel77", "date": "2020-05-29 15:01:11", "content": "Topaz Sharpening -----> AI !!!  workflow /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/gsujph/topaz_sharpening_ai_workflow/"}, {"autor": "merwanedr", "date": "2020-06-17 09:29:39", "content": "Popbot - Apply color splash effects using -----> AI !!! . /!/ You can use Popbot to automatically apply color splash effects to photos by selecting a subject. I created it a few months ago as an experiment and now monetized it. \n\n[https://gumroad.com/l/jFOCU](https://gumroad.com/l/jFOCU)", "link": "https://www.reddit.com/r/photography/comments/hanxt5/popbot_apply_color_splash_effects_using_ai/"}, {"autor": "MostlyMonoMoto", "date": "2020-06-21 10:03:32", "content": "Have you ever bought a camera/lens/accessory/entire rig and ended up using it for an entirely different use/niche than what you got it for? What were the circumstances that lead you to the new use? /!/ For example:  A couple years ago I picked up a couple used Canon EOS M cameras for the express purpose of building a timelapse rig or two running on Magic Lantern firmware.  Long story short, for various reasons I didn't end up building them, though I did do some timelapses with other equipment.  Nowadays I have one mounted on a Monopod with a flash transceiver in the hotshoe, connected to the mic port acting as a shutter release and a 12mm MF lens.  I have -----> ML !!!  setup to do a burst of shots in a fashion I couldn't replicate with an IR remote.  I've taken to annoying mountain bike riders at local parks with this janky setup.  I use the monopod  and ballhead to get perspectives and angles that would otherwise be impossible/impossibly dangerous.  Quite the departure from the planned job of taking thousands of similar shots in sequence from inside an acrylic box connected to a big ol' battery.\n\nTL;DR: Tell me how you re-purposed a piece or three of camera equipment to a totally different use.", "link": "https://www.reddit.com/r/photography/comments/hd4glk/have_you_ever_bought_a_cameralensaccessoryentire/"}, {"autor": "felexfelen", "date": "2020-07-19 03:49:38", "content": "Deep Learning/Computational Effects /!/ I recently bought my first heavy-duty computer (24 cores, RTX 2080 ti) and am familiar with -----> deep learning !!!  and graphics (CS Ph.D.). I was wondering what cool effects y'all think I could try? I'm thinking of anything from [deep dream](https://www.youtube.com/watch?v=DgPaCWJL7XI) to image stitching. Just stuff that looks cool and \"requires\" some coding knowledge/heavy compute to standout. Thanks in advance!", "link": "https://www.reddit.com/r/photography/comments/htu66r/deep_learningcomputational_effects/"}, {"autor": "driftmark", "date": "2020-11-24 17:27:57", "content": "The controversy around Photoshop's -----> AI !!! -powered sky replacement: where is the line, and who draws it?", "link": "https://www.reddit.com/r/photography/comments/k09fqm/the_controversy_around_photoshops_aipowered_sky/"}, {"autor": "TimBelchamber", "date": "2020-11-24 02:37:37", "content": "My Attempt At Fixing A Double Exposed Film Photo /!/ **The Story**\n\nI recently took on fixing a double exposure of a film photo of my friends first day in the world. Her mum accidently took her birth photos on a used film, which damage them. I couldn't find much on how to go about this (A link for a reddit post in this sub has someone asking how to do this and the comments say either repaint the whole image or wait for someone to make an -----> AI !!!  in the future), so I thought I'd make a few posts for peoples searches.\n\n**My Background**\n\nI consider myself to be a novice at photoshop but have gained some experience over the years. This project was well beyond my ability. I thought I was going to have to admit defeat a few times.\n\n**Techniques I Used To Fix A Double Exposed Photo:**\n\n1. Collect all the data you can. other photos of the day, photos of the subjects at similar angles.\n2. Take good parts from other photos and blend them on to your main photo. I cut the better parts out, resized them on the main photo and then used the erase tool with a feathered edge/low hardness value to do this.\n3. Use content aware fill (Selecting source information from multiple photos if needed) to create and fix what you don't have.\n4. Use smudge tools lightly if you need to blend shapes or other outlines format the second exposure where content aware fails.\n5. Adjust and fix colours\n6. Make sure you save at every major stop along the way. My final piece was version 18 and took 4 days.\n\n**Image and Process Link**\n\nIf it interests you or you are t=thinking about trying to achieve this yourself, I have used YouTube to show my (Screen recorded and explained) process (Includes Before and After).\n\nWarning: I made this as a full YouTube video, so it could be considered self promotion. This is not what I am after and I hope that after your read through this, you will clearly understand my intentions.\n\n[https://www.youtube.com/watch?v=mjEqFHQmJPo&amp;t=335s](https://www.youtube.com/watch?v=mjEqFHQmJPo&amp;t=335s)", "link": "https://www.reddit.com/r/photography/comments/jzwexg/my_attempt_at_fixing_a_double_exposed_film_photo/"}, {"autor": "sourovdebmishu", "date": "2020-12-21 15:50:26", "content": "Which Software is the first to adopt -----> AI !!! ? has it changed your workflow or styles? /!/ Hope you are well. \nI have a couple of questions:\nWhich Photo Editing Softwares ,as first to adopt AI in their Photo Editing Software?\n\nDoes it have a future? \nReason for these questions:\nGenuine curiosity. These question has been playing in my head for a long time. And my other friends are as technical as I am about Photography. \n\nWhat I think:\n\nGood or bad, it is here to stay. Just like any other technology. It's like meeting someone via Tinder vs in a church or in a bar. \nAnd I have friends who met who met their love in all 3 the places. \nI have friends who met bad people in all 3 places. \n\nFor me, standard nos going to be higher than ever. I think, Photography is about to create few other genres. I think , ethics and honestly will be more important than ever. Because almost everyone now have access to the technology. Which means, we now have to have a wonderful imagination. \nOr we need a great story behind every beautiful Photograph. Like Thomas Heaton or Morton Hilmer.", "link": "https://www.reddit.com/r/photography/comments/khjxu8/which_software_is_the_first_to_adopt_ai_has_it/"}, {"autor": "MrVulnerable", "date": "2020-12-16 10:46:31", "content": "YES! You can enhance OUT OF FOCUS face photos. /!/ Almost everyone might have faced this situation where they took / got an awesome composition of someone but later noticed that focus was out. I've deleted many of my photos which were captured by my friends who didn't have enough experience in using a DSLR. \n\nI came to see this [android app Remini](https://play.google.com/store/apps/details?id=com.bigwinepot.nwdn.international) which does a pretty job using -----> AI !!!  to bring back those lost detail in ***someone's face.*** It's not 100% perfect, which is obvious, but very useful in MOST SCENARIO. I don't know how it works. May be they have a huge server with tonnes of samples inside. \n\nNOTE: I've attached 4 examples [here](http://imgur.com/a/ejzubbu), with before &amp; after enhancing.", "link": "https://www.reddit.com/r/photography/comments/ke71d7/yes_you_can_enhance_out_of_focus_face_photos/"}, {"autor": "AnkeetSol", "date": "2020-12-16 04:57:08", "content": "Skylum Luminar -----> AI !!!  With More Artificial Intelligence", "link": "https://www.reddit.com/r/photography/comments/ke2p2d/skylum_luminar_ai_with_more_artificial/"}, {"autor": "bluecopp3r", "date": "2020-12-16 03:40:27", "content": "Photo Enlargement for Print /!/ Greetings. Question for those who do large prints. What is your preferred method for enlarging images?\n\nI'm kinda familiar with Blow Up 3 from Exposure Software. Not sure if it has been updated over the years. I have seen mention of Gigapixel -----> AI !!!  from Topaz Labs. I saw one video about it but it seems to be taxing on a machine and takes hours.", "link": "https://www.reddit.com/r/photography/comments/ke1j2u/photo_enlargement_for_print/"}, {"autor": "AfcaMatthias", "date": "2020-10-27 09:32:16", "content": "So I'm testing the topaz noise reduction -----> AI !!!  the last week or so and I am truly amazed by the results. This was taken in the evening with 12800(!) Iso on a d7500(DX). This is the result after processing this little kookaburra.", "link": "https://www.reddit.com/r/photography/comments/jixzy2/so_im_testing_the_topaz_noise_reduction_ai_the/"}, {"autor": "AeroNice", "date": "2020-11-09 10:38:27", "content": "Are virtual studios in our future? /!/ How far do you think we are from the following being possible?\n\nOpen up a program, arrange a camera, lighting, and a rough 3d model of a human.\n\nA -----> deep learning !!!  GAN takes it from there and outputs your 'scene' in total photo realism in seconds.\n\nFrom there you can adjust things like smile, direction of light, eye shape, hair color, backdrop, catchlights, etc.\n\nI know this is already possible with programs like set-a-light, but what I'm picturing is set-a-light combined with thispersondoesnotexist type functionality. Pipe dream or 5 years down the road?", "link": "https://www.reddit.com/r/photography/comments/jqvdx7/are_virtual_studios_in_our_future/"}, {"autor": "Sleepylilbitcherooni", "date": "2020-02-23 23:47:48", "content": "Having photocell issues with Bowens 500DX /!/ So I have a single Bowens 500DX strobe light (without a manual) and I'm trying to get it sync up with my camera (Canon 5D mark iv).\n\nI'm trying to use the photocell mode to detect the flash from an on-camera speedlite (470EX------> AI !!! ), it works for triggering the strobe but the picture is being taken too late or too early and it doesn't catch the strobe flash in the image. \n\nAny tips at all would be greatly appreciated.\n\nDo you think this is worth trying to figure out or should I just get a phono to PC sync cable? \n\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/f8i6v9/having_photocell_issues_with_bowens_500dx/"}, {"autor": "tut_ankhamun", "date": "2020-01-05 22:10:48", "content": "Photography of items for retail /!/ Hello Fellas, \n\nI am an amateur photographer as well as starting my business as online store, I would if you have tips on what setting of lens and light is best to take shots of articles (Phone cases ..etc), I have looked on the internet for something specific for this with no success. I have tried on my own some look good but the same as I see on online stores. \n\nI have canon 700D, lens 50mm, sigma 18-35mm, 18-55mm . And 470ex------> AI !!!  flash.\n\nAny tips would yo like to give me? \n\nThanks in advance.", "link": "https://www.reddit.com/r/photography/comments/ekjum9/photography_of_items_for_retail/"}, {"autor": "GGuvroh", "date": "2020-05-29 06:34:45", "content": "[D750]Advice needed on daytime rocket launch plans📷 /!/ Hey there! I’m shooting a D750/28mm2.8 -----> AI !!!  on a tripod during the launch of the upcoming SpaceX launch. I’ll be quite a ways away, and won’t have an nd filter available. My plan is to expose for the sky(maybe slightly under expose?)and take maybe 100ish pictures at 1/50th or so around f8/f11, then combine them in Lightroom to create sort of a smoothed effect similar to that of a very long exposure. My question is this; do I under expose due to the addition of so many frames so that the final photo is exposed properly? I only have one shot(many🤷🏼‍♂️)at this and would love to get everything right in camera. Will also be shooting raw(of course), and using the built in intervalometer. Thanks again for any help🙏🏼", "link": "https://www.reddit.com/r/photography/comments/gsnkst/d750advice_needed_on_daytime_rocket_launch_plans/"}, {"autor": "lo0sepanda", "date": "2020-08-07 01:42:25", "content": "New Zealand wedding photographer's start-up harnessing -----> AI !!!  to ease image processing. It checks focus and facial expression and then provides a rating on the image so you can more easily select 'the best'", "link": "https://www.reddit.com/r/photography/comments/i54w3t/new_zealand_wedding_photographers_startup/"}, {"autor": "QuartzPuffyStar", "date": "2020-08-24 19:39:31", "content": "Is there any firmware hack (-----> ML !!! , NH) for Sony cameras? /!/ Trying to get some extra potential from my oldie :)", "link": "https://www.reddit.com/r/photography/comments/ifw4zo/is_there_any_firmware_hack_ml_nh_for_sony_cameras/"}, {"autor": "WalkinTalkinPorkins", "date": "2020-10-11 04:53:49", "content": "Any recommendations for old film camera to play around with? /!/ I'm looking to pick-up a cheap second hand film camera to play around with, nothing too serious, just a few fun picks. \n\nSub AUD$300 would be ideal. Any recommendations on what to look out for would be great. I have never owned a film camera!\n\nI found a few on eBay that may be OK:\n\n[Pentax K1000](https://www.ebay.com.au/itm/Pentax-K1000-35mm-SLR-Film-Camera-with-24-70mm-Rikenon-japan/383748922875?_trkparms=aid%3D111001%26algo%3DREC.SEED%26ao%3D1%26asc%3D20160811114145%26meid%3D082843f0b2c949e3a0c07a4fc55d7a80%26pid%3D100667%26rk%3D1%26rkt%3D8%26mehot%3Dnone%26sd%3D383748922875%26itm%3D383748922875%26pmt%3D1%26noa%3D1%26pg%3D2334524%26brand%3DPENTAX&amp;_trksid=p2334524.c100667.m2042) (this looks in pretty bad shape through) \n\n[CANON AE-1](https://www.ebay.com.au/itm/Exc-CANON-AE-1-PROGRAM-New-FD-50mm-F2-Lens-MF-SLR-35mm-from-Japan/353196162746?_trkparms=ispr%3D1&amp;hash=item523c21beba:g:Gj4AAOSwf2RfSZve&amp;amdata=enc%3AAQAFAAACYBaobrjLl8XobRIiIML1V4Imu%252Fn%252BzU5L90Z278x5ickkWpEuxXwAiCNKyBQsQ5%252Fe6xN%252FlC7EGsUk7Z%252B1bumh04T2Ei3NAvM16SN%252BusD9P0%252B01pnjZoEvZUR%252BVJZL1y8tMWqmBSUVz%252FWhhfA4ghFs8nELoC%252BkpW8nN0wt9Ch38d5bBPjJRDCG9BpoaaRZzXrseEptyaW3%252Fh5UZTu6xq3WAnet2VPz01yxCGbyJGJDhxSPH5ii%252B1ow506wX%252FcatJMaSr4KrlG3P3pxGm21K0CXc%252BbZvZekjxFOtpwaItv%252BEq4bWmN%252FRi6jmbhX4PKgPgHRIo%252FnO5s3NqHbAzd3t%252BgBK1z5t2MGfMTffJOHr9gjyBfoX4%252Fga6QhAGKiDXk5L82qDNMr6mQb5dLPMbANNTKUhTOwe86mhpjCovLW6ggNm%252FIgvkTdCV2L9bjuEPP37yhat9gXbH%252FeQIw6lf3xMW7cUWm5vZElJUPlgwJ9X76AGzE8lqQuMUVVASbYHs7TWwvj6AGpcFhl4Ot61j8nPKfYMEYDaqJyrJnCjLIbEhI%252FqyIBotPHyB%252FUcbffz7smRrZtCeufPvz5zf7n3HokWhJv2R8UQWsgsMRmJ4BBsGPMe8jxfgQz%252Bi519YGL%252FqyGEAsYEDAGymYyQpBtGGIlqubAkJqSiPs6Cz9q83d0xqsDOp8Ovp3dULTKm9AeJ8aN51ze3JObRkMq29vxGRkPqeWGu1bk2q%252BDZ97SyVpjZ9zeKeDyHZcm6ienR0Fo6hIIs6v%252FEgakWAePrf%252B7FwaTAeyT3jZ9PkP1UqDbzIr4N2yaJp6W%7Ccksum%3A353196162746aeb68e4154ca424e847872ac0a178b85%7Campid%3APL_CLK%7Cclp%3A2334524&amp;frcectupt=true) \n\n[Nikon FE](https://www.ebay.com.au/itm/Excellent-5-NIKON-FE-SLR-Film-Camera------> AI !!! -NIKKOR-28mm-F-3-5-From-Japan/124343953259?_trkparms=aid%3D555021%26algo%3DPL.SIMRVI%26ao%3D1%26asc%3D20190711100440%26meid%3D02c219dc46494320958288a3e3693eaa%26pid%3D100752%26rk%3D1%26rkt%3D16%26mehot%3Dpf%26sd%3D353196162746%26itm%3D124343953259%26pmt%3D1%26noa%3D0%26pg%3D2047675%26algv%3DSimplRVIAMLv5WebWithPLRVIOnTopCombiner&amp;_trksid=p2047675.c100752.m1982) \n\nAny advice would be great.", "link": "https://www.reddit.com/r/photography/comments/j8zabn/any_recommendations_for_old_film_camera_to_play/"}, {"autor": "Plane_Garbage", "date": "2020-12-13 00:21:07", "content": "Best software/workflow for scanning old prints and auto-enhancing using -----> AI !!! /Machine Learning /!/ I am about to embark on scanning our 2000+ family photo collection and would like to batch automate the editing process (denoising, upscaling, enhancing etc)?\n\nAny suggestions for the best way to do this? I haven't used Topaz Labs software before, but it looks like it'll do a good job. Maybe Skylum?", "link": "https://www.reddit.com/r/photography/comments/kc0d0l/best_softwareworkflow_for_scanning_old_prints_and/"}, {"autor": "velaazul", "date": "2020-12-24 00:19:42", "content": "Anybody tried \"Aftershoot\"? /!/ \"Free -----> AI !!! -Powered image culling for Photographers\" -- has anybody tried this? Looks pretty interesting but who knows...? Doesn't seem to be any buzz anywhere.\n\n[https://aftershoot.co/](https://aftershoot.co/)", "link": "https://www.reddit.com/r/photography/comments/kj4sdq/anybody_tried_aftershoot/"}], "name": "Subreddit_photography_01_01_2020-30_12_2020"}