{"interestingcomments": [{"autor": "Aussierob78", "date": "2018-04-18 03:25:52", "content": "Nikon D7100 or Canon 80D? /!/ Hi folks,\n\nA bit of history, I've owned many cameras in the past including a 70D and a D7100. I'm currently camera-less and on the hunt for something new.\n\nI've found 2 decent second hand deals here in Aus:\n\n1: Canon 80D, New in box, with 18-200 lens for $850 AUD (pretty much a zero shutter count)\n2: Nikon D7100 - around 7000 shutter count for $1100 but it comes with the following:\n\nNikon D7100 with Accessories.\n- Nikon AF-S 16-85mm Lens\n- Nikon AF 50mm f1.8D Lens\n- Nikon AF 70-300mm Lens\n- Flash for Nikon\n- Battery pack/Grip\n- UV Filters on all Lenses\n- Nikon -----> ML !!! -L3 Wireless Remote Control\n- Two SD card slots and two cards included, 64Gb and 8Gb respectively\n- Tripod also included(Not Pictured)\n- Comes with great carry Backpack with available laptop slot and compartments for easy and safe stowing.\n- Comes with charger and necessary cables.\n- Boxes included for Camera, and 2 of the lenses.\n\nThoughts?", "link": "https://www.reddit.com/r/Cameras/comments/8d2m18/nikon_d7100_or_canon_80d/"}, {"autor": "yzx321", "date": "2018-08-02 15:03:22", "content": "Using old -----> Ai !!!  lenses on new Nikons /!/ \nSo I have a Nikon D3200 and some Ai lenses (they mechanically are supposed to be OK to mount)\n\nI Attach the lens, and it says 'no lens attached'\n\nIs this supposed to happen... I know it's a non-cpu lens.\nIs it ok to manually adjust the aperture by turning the aperture ring on the lens?\n", "link": "https://www.reddit.com/r/Cameras/comments/9400ze/using_old_ai_lenses_on_new_nikons/"}, {"autor": "GrisTooki", "date": "2018-03-24 03:58:43", "content": "A systematic comparison of 49 normal lenses (40-58mm). Includes many vintage Nikon, Mamiya 645, Canon FD, Voigtlander, Olympus, Minolta, Asahi/Pentax, Ricoh, Yashica, Konica, and more. /!/ *EDIT:  I'm about 99% sure that I missed focus with Nikon 50/1.8 G.  I will redo that portion of the test at some point.\n\nOver the years I have gradually amassed quite a collection of lenses which, until now, I have never really taken the time to compare.  So with the recent warm-up I decided to take advantage of the nice weather to systematically test the normal lenses in my collection out of both curiosity and a desire to downsize.  I thought you guys might be interested to see the results.\n\nFor this test I set up a tripod approximately 6ft from the brick wall at the corner of my house with wall taking up the left half of the frame and my yard taking up the right (so as to show both the sharpness and bokeh of each lens). To the best of my ability, I made sure that the plane of focus was parallel to the wall and shot away from the sun.  The cameras used were a D800 (for Nikon -----> Ai !!! , -----> Ai !!! -S, and AF-S lenses, as well as Mamiya 645 lenses) and an a7 II (for everything else).  ISO was set between Low (below 100) and 200, depending on lighting.  The photos were imported using Lightroom and minimal adjustments were made for exposure differences (a few photos were obviously underexposed, probably due to user error).  Because these tests were done over the course of an afternoon, there are changes in lighting due to time of day and cloud cover that should be ignored as much as possible.\n\nThe table of my results is here: https://docs.google.com/spreadsheets/d/1d8CCxhR3Iuz8GWyyDHuFX_PUVbECOQrqLA2ZaBKSze0/edit?usp=sharing\n\nAnd the Flickr album is here:\nhttps://www.flickr.com/photos/139290056@N04/albums/72157664989063267/page1\n\nA shot of all the lenses: https://www.flickr.com/photos/139290056@N04/40270599304/\n\nPlease note that the first result in each row is at the maximum aperture, regardless of what the column title is.  In other words, for lenses with unusual maximum apertures f/1.7, the result in the f/1.8 column is actually for f/1.7.\n\n&amp;nbsp;\n\nA complete list of lenses in this comparison:\n\n&amp;nbsp;\n\n&gt;Nikon AF-S Nikkor 24-70 f/2.8 G ED\n\n&gt;Nippon Kogaku Nikkor-H Auto 50mm f/2 Non-Ai\n\n&gt;Nippon Kogaku Nikkor-S Auto f/1.4 Non-Ai\n\n&gt;Nikon Nikkor-S Auto 55mm f/1.2 Non-Ai\n\n&gt;Nikon Nikkor 50mm f1.2 Ai-S\n\n&gt;Nikon Nikkor 50mm f/1.4 Ai\n\n&gt;Nikon Nikkor 50mm f/1.8 Ai\n\n&gt;Nikon Micro-Nikkor 55mm f/2.8 Ai-S\n\n&gt;Nikon AF-S Nikkor 50mm f/1.4 G\n\n&gt;Nikon AF-S Nikkor 50mm f/1.8 G\n\n&gt;Voigtlander Ultron 40mm f/2 SL Aspherical\n\n&gt;Canon FD 50mm f/1.8\n\n&gt;Canon FD 50mm f/1.8\n\n&gt;Canon FD 50mm f/1.8\n\n&gt;Mamiya-Sekor C Zoom 55-110mm f/4.5 N\n\n&gt;Mamiya-Sekor C 55mm f/2.8 S\n\n&gt;Mamiya-Sekor C 55mm f/2.8 S\n\n&gt;Mamiya-Sekor C 55mm f/2.8\n\n&gt;Olympus Zuiko Auto-S 50mm f/1.8\n\n&gt;Olympus Zuiko Auto-S 50mm f/1.8\n\n&gt;Olympus F.Zuiko Auto-S 50mm f/1.8 Silver Nose\n\n&gt;Olympus G.Zuiko Auto-S 50mm f/1.4\n\n&gt;Voigtlander Nokton Classic 40mm f/1.4 MC\n\n&gt;Minolta MD 50mm f/2\n\n&gt;Minolta MD Rokkor-X 50mm f/1.7\n\n&gt;Minolta MD Rokkor-X 50mm f/1.7\n\n&gt;Minolta MC Rokkor-PF 58mm f/1.4\n\n&gt;Minolta MC Rokkor-PF 58mm f/1.4\n\n&gt;Unmarked 50mm f/1.8 Takumar\n\n&gt;Asahi SMC Takumar 55mm f/2\n\n&gt;Asahi Super-Takumar 50mm f/1.4\n\n&gt;Asahi Super-Takumar 50mm f/1.4\n\n&gt;Asahi Super-Takumar 50mm f/1.4\n\n&gt;Asahi Super-Takumar-Coated 50mm f/1.4\n\n&gt;Yashica Auto Yashinon DS-M 50mm f/1.4\n\n&gt;Yashica Auto Yashinon-DX 50mm f/2\n\n&gt;Ricoh Auto Rikenon EE 50mm f/1.4\n\n&gt;Auto Sears / Sekor SX 55mm f/1.8\n\n&gt;Auto Sears 55mm f/1.4\n\n&gt;Konica Hexanon AR 40mm f/1.8\n\n&gt;Konica Hexanon AR 40mm f/1.8\n\n&gt;Konica Hexanon AR 50mm f/1.7\n\n&gt;Konica Hexanon AR 57mm f/1.4\n\n&gt;SMC Pentax-M 50mm f/2\n\n&gt;SMC Pentax-M 50mm f/2\n\n&gt;SMC Pentax-A 50mm f/1.7\n\n&gt;Auto Sears MC 50mm f/1.7\n\n&gt;Ricoh Rikenon P 50mm f/2\n\n&gt;E. Ludwig V Meritar 50mm f/2.9\n\n", "link": "https://www.reddit.com/r/Cameras/comments/86qpsi/a_systematic_comparison_of_49_normal_lenses/"}, {"autor": "CaPeBaLo", "date": "2018-04-09 10:08:38", "content": "Some thoughts on multi cam setups in smartphones /!/ When the first smartphones with multi cam setups started rolling out, I considered it a fancy marketing strategy, only a feature that would its users to say \"your phone has only one cam? Mine has two\".\n\nThen Pixel 2 was launched and I confirmed that, since with only one camera it scored better than any other phone, be it a regular or multi camera setup.\n\nBut what if we combine the \"magic\" that Pixel 2 uses with (what I believe to be) the irreplaceable capabilities of different optical configurations?\n\nWhen you're out in a park and want to take a picture of that bird on a tree, you have two options - use the regular camera and take a beautiful picture of the tree or use the telephoto lens and take a nice picture of the bird.\n\nYou're still in that park and want to take a picture of the beautiful landscape. Again, you can use the regular camera to capture that scene, or you can use the wide-angle lens to capture more of that.\n\nGuess what? You're still in the park, but now you want to take a picture of your loved one. He/she is beautiful, but there are so much information in the background. Also, remember that beautiful landscape? Your soulmate is the focus here, not that cute dog pursuing that bird that just left the tree and came to the ground, nor that amazing sunset. So you can use the digital tricks from your regular camera to blur the background (and maybe some hair) or get it fully optical with the combination of the regular camera with the telephoto.\n\nWell, now you're home and want to take a nice picture of your baby making a mess with that colorful cake, and obviously you want to capture every color and detail, so you can take a great picture with your regular camera, or you can opt for the RGB + Monochrome setup to get an awesome picture.\n\nSo, I would like to know:\n\n- What do you think about my statements? Are they correct? What did I miss?\n\n- ‎What do you you think about multi camera setups for smartphones, do they worth the extra money and space the require or you can get perfectly equivalent pictures with a single camera setup?\n\n- What combination do you think is the best? RGB + Monochrome? Regular + telephoto? Regular + wide-angle?\n\n- Would it be possible to make the monochrome sensor work together with the telephoto or wide-angle lens to get the same level of details from when combining (the monochrome) with the RGB sensor? If yes, it would require the same lenses configuration from the system it is working with (tele mono + tele RGB, or wide mono + wide RGB), right?\n\n- Would a \"full system\" (RGB + Monochrome + telephoto + wide-angle + -----> AI !!! ) be reliable?\n\nThanks all.", "link": "https://www.reddit.com/r/Cameras/comments/8axbpi/some_thoughts_on_multi_cam_setups_in_smartphones/"}, {"autor": "taipeiboy", "date": "2018-01-24 07:41:18", "content": "Canon 80D or what else? /!/ I need a camera for about the price of Canon 80D (will purchase in Australia)\nI am an amateur, i need it for my social events, and also some times i like to walk around and take pics of people/buildings/animals/sunsets, also i travel a lot.\n\nHere's my list of do's and dont's\n\n* I care a lot about RAW, i enjoy editing in lightroom (also correct my many\n shooting mistakes)\n* Dont care video at all\n* Dont really care about weight, i saw 80d up close and it was ok.\n* Will buy 3 or 4 more lenses\n\n\n\nLittle more about me:\n\n\nMy first camera was a mirrorless, a **Samsung NX300**, i was absolutely amazed by it.\nI even bought a tripod, a prime a zoom lens, it was all good. \nBut the lack of viewfinder eventually got to me.\n\nSo i sold everything and got a**Canon 100D**, mostly because it was small, i thought i wanted a smaller camera.\n\nOf course, i was dissapointed because the -----> AI !!!  on this camera is bad, i constantly have to compensate exposure by a lot to get a decent pic..\n\nBut i like the canon style more than Nikon.\n\nIs there any other camera/system i should take into consideration?\n", "link": "https://www.reddit.com/r/Cameras/comments/7slj0h/canon_80d_or_what_else/"}, {"autor": "h4rdw0rk", "date": "2018-07-15 06:22:50", "content": "Deciding between EOS M and M2 /!/ Hi guys,\n\nI'm planning on retiring my 9 years old 1000D and looking for a compact mirorless camera. With the 3 Canon lenses that I currently owned (EF-S 18-55mm kit, EF 50mm II, and EF-S 55-250mn), I'm planning to stick with Canon. Looking at some market, I found used EOS M and M2 with an attractive price of ~$200. The price difference is about ~50 between the two.\n\nI also found out that EOS M is supported by -----> ML !!!  and it opened up many possibilities. Now I'm leaning towards M2 because of the newer sensor, wi-fi connectivity, and (a little) faster AF plus only ~$50 price difference.\n\nNeed some advice from you guys, should I go with it or there are other better mirrorless options (outside of Canon) with similar bugdet (~$200)?\n\nAdditional points for Canon for me is their EF-M 22mm F2 lense which has many great feedback.\n\nThanks.", "link": "https://www.reddit.com/r/Cameras/comments/8yzsf9/deciding_between_eos_m_and_m2/"}, {"autor": "suntoryBOSS_", "date": "2018-12-06 00:49:27", "content": "Gear dilemma, what's your thoughts? Going from 2017 to 2014? /!/ So I bought a 6D Mark II from Canon on Black Friday, with the intention of shooting some video with it (I am a photographer first but I want to start making cinematic vlogs/filmswhatever) . The 6D Mark II is wonderful and takes amazing photos (don't let reviews online fool you about the dynamic range), but I am left a bit disappointed by it's video specs. I could sell this camera on my local classifieds and get pretty much what I paid for it back and I was wondering if I should switch to something like a Nikon D610 for photo and maybe buy a 35mm 1.4 ART (I already have -----> AI !!!  lenses) and split that money in half so I can get a dedicated video camera like a panasonic G7 and adapt some -----> AI !!!  lenses I got from my film kit. Is this a good/bad idea?", "link": "https://www.reddit.com/r/Cameras/comments/a3ipe8/gear_dilemma_whats_your_thoughts_going_from_2017/"}, {"autor": "jrpierce", "date": "2018-12-01 00:03:55", "content": "4K on 5D MkIII /!/ Does the 5D MkIII shoot 4K with -----> ML !!! ? I’ve seen conflicting posts online. Anyone got the skinny?", "link": "https://www.reddit.com/r/Cameras/comments/a1xyj2/4k_on_5d_mkiii/"}, {"autor": "mysinfulstash", "date": "2018-09-19 11:55:53", "content": "3D Scanning &amp; 360 -----> AI !!!  Camera", "link": "https://www.reddit.com/r/Cameras/comments/9h4hpz/3d_scanning_360_ai_camera/"}, {"autor": "kozm0z", "date": "2018-02-25 18:36:34", "content": "I need some perspective...(camera decisions) /!/ So ive been shopping for a new personal camera. I haven't owned my own camera going on 4 or 5 years now. Last camera I owned was an fs700 (loved it, hated the ergonimics but it was a workhorse) tl;dr at bottom.\n\nI dont have much of a budget yet, so the cameras ive been looking at widely vary in price and tech so I guess I'm just trying to get my thoughts in order before I make a decision. Any input is most welcome! Good or bad.\n\nThis wont be a camera for professional level shoots, if I happen to get some jobs, awesome! If not, its whatever. I wanna shoot my own stuff for a little while, this could vary from action sports and events to weirdo montage type stuff maybe even some narrative and exploring my photography. 4k doesnt exactly entice me, my pc is a bit behind in technology these days so handling of 4k files would be rough at this point, in will be upgrading that down the road. I love high frame rates, the fs700 spoiled me, I know I won't get 240fps (short of Gh5s which i havent even considered, seems like a very niche camera) but 120fps would be awesome! If I'm being honest I never properly learned how to utilize 60fps for slow mo so I'm kinda seeing that as a challenge to take on with this new camera, limiting myself to a 1080@60fps cam could better for that.\n\nHere we go...\n\nGh3 - the lowest end of my totem, I used to own one, an amazing camera and can be picked up in the $350ish range (usually with a kit lens) in my area. 1080@60 can't really go wrong. Save a crap ton of money and invest in lenses. Get some of those sweet leica primes.\n\nGh4 - this is a shoe in...it doesn't excite me to spend a 1000 on a new one but I've seen used ones in the 650 to 750 range which is a lot of camera for the money. So i threw it in. The 96fps peaks my interest over 1080@60, even though its not great but for my purposes it wont matter. Takes decent photos for my skills.\n\nGh5 - obviously stays in my peripheral vision for many reasons. 10bit doesnt excite me atm as I'm not a big color grader. I love the vfr. Just like its predecessor, a lot of camera for the money here. I always felt this was the camera to upgrade to from my gh2/gh3.\n\nG9 - this has probably been the one ive been eyeing the hardest. I love the design over the gh5 its trying really hard to be a dslr and I think its cute. All jokes aside, it looks like an awesome camera, the photo options look great and certainly a solid learning curve for me in that aspect, I still get 4k@60p and vfr even if there is a recording cap which doesnt bother me that much and if I wanna get around it I can use an external recorder. The lack of 10bit is cool with me, keeps file sizes manageable. Again much more expensive not sure if its worth the money for me at this point. But it has been the one I keep going back to.\n\nCanon 80d - another I've been eyeing hard, I love Canons I always have. They feel great in the hands, the color is amazing, dual pixel af, lens selection is top notch and watching videos people create with it looks pretty damn good even if it is 1080...for internet stuff I dont think it really matters. Having a camera that spits out a fantastic image is great, I hate wasting time with color grading. Another camera if I could get in the $700 price range would be a strong contender for me BUT with gh4 in that range too, it almost seems silly, gh4 is much more video camera than an 80d but...Canon :/ I like canons. Theres one for sale local to me for $600 with kit lens which seems like a great deal, I could source a good L lens with that and be on my marry way.\n\nCanon 6d mk2 - I felt like I had to look at this one if I'm looking at comparably priced panasonics. Obviously it falls behind in features but can make up in other ways like being full frame and having that sweet canon color science.\n\nA6500 - ive looked at this one, the 1080 is shit and if that wasnt the case it'd probably be higher up on my list. Still dollar for dollar, 4k, is, hfr, good low light, great af, as for its limitations i could work around those, like any sony. This is probably a camera id prefer to score around the $900 mark.\n\nI've also looked at lot of entry level cams, like the g7 and g85 and lower end canons, Sony's etc. Even 7d mk2, 5dmk3 (utilizing -----> ML !!! ) hell looked at grey market 5d4. I can always rent a hfr camera if I need more than 60fps but at what cost? Ya know if every project I create turns into wanting to use 120fps, that gets expensive ...I suppose I could go back to the twixtor days I'm sure the quality of images these days has improved that program but what a pain in the ass that program was. I got some good stuff with my t2i back in the day but having a camera that actually shoots hfr is so much better.\n\nI think i really want a reason to not go m43 but its not easy to find. Panasonic leads the industry with cameras packed full of features, a lot of which I may not need right out of the gate. On the other hand I feel like I'm concerning myself with features when ultimately it comes down to content. When I watch something awesome I'm not wondering what they used to shoot it, I'm just engaged.\n\nIts funny if i take away the 4k aspect (not huge a selling factor for me) the only cameras that stay on this list are gh3 and 80d. Everything else goes away and these two meet the bare minimums and I can choose lenses over hardware. I like nice glass.\n\nI dunno....I keep going back and fourth. This is frustrating, I've been putting this off for a while too but the cost to keep renting cameras for my personal shit isnt effective. And id rent all these cameras and figure it out myself but by the time I'd gone through them, id probably have spent the money id use to buy one in which case that cost plus the actual purchase cost would be way higher than the initial dive in purchase\n\nThanks for reading if you did....tl;dr, having trouble picking out cameras, gh3/gh4/gh5/g9/80d/a6500 plus others in that sub $2k range, first world problems...\n\n\n\n\n", "link": "https://www.reddit.com/r/Cameras/comments/806dza/i_need_some_perspectivecamera_decisions/"}, {"autor": "pixelkarma", "date": "2018-11-10 00:55:26", "content": "Should I get the Bronica SQ-A or SQ-B? /!/ Before we start, the SQ------> Ai !!!  is out of my budget.\n\nI'm trying to decide between the SQ-A and SQ-B.  I'm leaning towards the B because of my photo habits and because it costs less.\n\nCan anyone convince me the SQ-A is the better choice (for almost twice the cost)?\n\n* I shoot 99% during the day with natural light\n* I haven't used bulb in years\n* I don't use strobes, but I might want to.\n* I only want the WLF, not the AE Prism. It's ghastly. I will use a hand-held meter with no issue.\n* I only shoot 120 film.\n\nAny thoughts?", "link": "https://www.reddit.com/r/Cameras/comments/9vq30o/should_i_get_the_bronica_sqa_or_sqb/"}], "name": "Subreddit_Cameras_01_01_2018-30_12_2018"}