{"interestingcomments": [{"autor": "gitarry", "date": "2021-03-31 17:11:04", "content": "HDMI resolution on 700d. need help /!/ i am trying to connect my canon 700d to the raveneye by dji. sadly it only allows for full hd hdmi inn, the canon 700d does only output 720p. im trying to use -----> ML !!!  to make it work but no success so far as im not experienced with -----> ML !!! . all ideas and tips are apriciated", "link": "https://www.reddit.com/r/canon/comments/mharqe/hdmi_resolution_on_700d_need_help/"}, {"autor": "HanziHinterbeer", "date": "2021-01-30 14:46:40", "content": "Reflections on the 5D classic and upgrade paths (long post) /!/ Disclaimer: this is will be a long one, with me waffling on about my thoughts. \n\nTL;DR: The camera world is confusing, I'm confused, and I should perhaps just make do with what I have until I get a real job. \n\nI'm going to start this post with a summary of the cameras I've owned since I got into photography in late 2019. Started with a 40D that died, got a t2i (550D) afterwards, expanded with a 7d mk I and then bought a 5D classic. \nThe improvements I saw in my images going to the 5D (or the improvements I made myself, I don't know) and the lack of need for video made me sell the 7d and my ef-s lenses, keeping the t2i as a backup and buying some more FF lenses instead. \n\nNow my main kit consists of the 5D, Canon 24-105 F4 L,  Tamron 70-210 F4 Di VC USD, Canon 50 F1.8 and 85 F1.8. I like the combination of the slightly slower zooms along with the two primes for low light and bokeh, but I would lie if the higher end Tamron G2 zooms and SP primes (or Sigma art primes for that matter) don't look mighty fine. For speedlights I have the 430ex II and 580ex II with a cheap radio trigger for off camera flash along with a wallimex umbrella and such. Most of the stuff has been bought second hand as I'm a student with a limited budget. \n\nThe pictures I take are mostly woodland landscapes and portraits, with the occasional dog photoshoot and jazz concert (when the country is not in lockdown) as some of my friends play in a trio. The zooms mentioned above are absolutely fine for most of the situations I find myself in; in fact the Tamron is the sharpest lens I've ever used. The primes, however, are coming out at the concerts. I caught myself wishing for a 35mm in some cases where I couldn't get the entire band in the frame though. Based on my exposures of 1/60-1/100s., F/1.8 and ISO 3200, I've calculated that the light at the venues is at 3 ev or thereabout. And the files only really look good in black &amp; white because of the noise. \n\nNow, while the outside portraits in natural light and the low light performance at ISO 3200 are better with the 5D, the t2i produces very crisp pictures in the studio with speedlights which is the only time I really use it. \n\nThe 5D is adequate for most of the photography that I do, but there are a few features I'd love to have that it doesn't provide: AFMA for the Canon lenses would be great, and I wouldn't mind a bump in resolution either. The center AF point and recompose method is fine for most situations, but tracking the neighbour's dog in motion is pretty tough in -----> AI !!! -servo, although doable given enough light and patience. Eye-AF would of course also be very welcome. \n\nWatching some of Richard Barleys videos on youtube has helped me stick with what I have, but of course I'm thinking about upgrading, and the posts with all the new mirrorless cameras with eye AF and 20 fps are fueling my GAS. But taking a step back, and looking at what I feel is limiting about the 5D, I've come to the following things a body upgrade would solve:\n\nA simple upgrade to the 5D mk II would give me AFMA and vastly higher resolution. It would also help with the 3 second delay when I want to chimp! ISO 6400 would also allow me to use the F4 zooms in more situations, although I expect that it would still be best in black &amp; white. \n\nThe 6D has gone down in price to match the 5D mk II on the second hand market at ~3000 kr. ($490), while beating it at  except weather sealing? This makes it a pretty attractive upgrade in my opinion. \n\nThis doesn't provide an upgrade in AF as such, so for that I would need to look at the 5D mk III or 6D mk II, which are going for at least twice the price of the above two options (&gt;6000 kr. or &gt;$980), unless severely used, patinaed and with very high shuttercounts. At that point I'd rather save up more and go for an EOS R, RP or perhaps look at switching systems to Fuji or Sony, which brings me to the following thoughts:\n\nA second hand EOS R + adapter  (~11000 kr. ($1795)) would by far be the easiest, as I wouldn't have to sell the old lenses and buy new ones (except perhaps the sexy rf 35 F1.8). The benefits of the mirrorless bodies without the need to sell and buy new lenses would honestly be amazing. \n\nFuji would present  a world of very nice lenses made specifically for crop sensors, and the X-T3 goes for the same as the 5D mk III now! The faster than usual, stabilized, variable aperture zooms and the F2 primes in this system seem to be of very high quality and very fairly priced. The optical quality of their F2.8 zooms seems to be lacking behind taking their price and the offerings in other systems into consideration perhaps. \n\nThe A7III is at the same second hand price point as the EOS R. The Sony system has some very nice FF zoom options from Tamron, taking advantage of the IBIS. I honestly don't see many arguments against this system, except for the hassle and expense of exchanging the lenses. \n\nAs for Sony crop, they are almost none-existing on the second hand market, except for the A6000. The price of a brand new a6600 is the same as a used a7III, so a brand new a6400 would be the only attractive choice, as it costs the same as the used 5D mk III and X-T3 mentioned above. The 17-70 F2.8 from Tamron is by all means a very attractive lens along with the Sigma 1.4 primes, but the lack of a dedicated F4ish stabilized aps-c telezoom makes the quite expensive FF 70-200 F4 G the only option here as far as I know. The a6600 would at least permit the use of the FF Tamron 70-180 F2.8 with its IBIS. \n\nI haven't considered Nikon, Panasonic, Olympus ans Pentax as I can only handle so much information at once before becoming completely overwhelmed by choice paralysis haha. \n\nSo yeah, I think perhaps I should just sell the 5D classic + t2i and get a 6D. Then upgrade to something more expensive once I get an actual job with (hopefully) disposable income. \n\nIf you've made it this far I applaud your patience and thank you for your time.", "link": "https://www.reddit.com/r/canon/comments/l8n4vx/reflections_on_the_5d_classic_and_upgrade_paths/"}, {"autor": "HanziHinterbeer", "date": "2021-01-30 14:46:24", "content": "Reflections on the 5D classic and upgrade paths (long post) /!/ Disclaimer: this is will be a long one, with me waffling on about my thoughts. \n\nTL;DR: The camera world is confusing, I'm confused, and I should perhaps just make do with what I have until I get a real job. \n\nI'm going to start this post with a summary of the cameras I've owned since I got into photography in late 2019. Started with a 40D that died, got a t2i (550D) afterwards, expanded with a 7d mk I and then bought a 5D classic. \nThe improvements I saw in my images going to the 5D (or the improvements I made myself, I don't know) and the lack of need for video made me sell the 7d and my ef-s lenses, keeping the t2i as a backup and buying some more FF lenses instead. \n\nNow my main kit consists of the 5D, Canon 24-105 F4 L,  Tamron 70-210 F4 Di VC USD, Canon 50 F1.8 and 85 F1.8. I like the combination of the slightly slower zooms along with the two primes for low light and bokeh, but I would lie if the higher end Tamron G2 zooms and SP primes (or Sigma art primes for that matter) don't look mighty fine. For speedlights I have the 430ex II and 580ex II with a cheap radio trigger for off camera flash along with a wallimex umbrella and such. Most of the stuff has been bought second hand as I'm a student with a limited budget. \n\nThe pictures I take are mostly woodland landscapes and portraits, with the occasional dog photoshoot and jazz concert (when the country is not in lockdown) as some of my friends play in a trio. The zooms mentioned above are absolutely fine for most of the situations I find myself in; in fact the Tamron is the sharpest lens I've ever used. The primes, however, are coming out at the concerts. I caught myself wishing for a 35mm in some cases where I couldn't get the entire band in the frame though. Based on my exposures of 1/60-1/100s., F/1.8 and ISO 3200, I've calculated that the light at the venues is at 3 ev or thereabout. And the files only really look good in black &amp; white because of the noise. \n\nNow, while the outside portraits in natural light and the low light performance at ISO 3200 are better with the 5D, the t2i produces very crisp pictures in the studio with speedlights which is the only time I really use it. \n\nThe 5D is adequate for most of the photography that I do, but there are a few features I'd love to have that it doesn't provide: AFMA for the Canon lenses would be great, and I wouldn't mind a bump in resolution either. The center AF point and recompose method is fine for most situations, but tracking the neighbour's dog in motion is pretty tough in -----> AI !!! -servo, although doable given enough light and patience. Eye-AF would of course also be very welcome. \n\nWatching some of Richard Barleys videos on youtube has helped me stick with what I have, but of course I'm thinking about upgrading, and the posts with all the new mirrorless cameras with eye AF and 20 fps are fueling my GAS. But taking a step back, and looking at what I feel is limiting about the 5D, I've come to the following things a body upgrade would solve:\n\nA simple upgrade to the 5D mk II would give me AFMA and vastly higher resolution. It would also help with the 3 second delay when I want to chimp! ISO 6400 would also allow me to use the F4 zooms in more situations, although I expect that it would still be best in black &amp; white. \n\nThe 6D has gone down in price to match the 5D mk II on the second hand market at ~3000 kr. ($490), while beating it at  except weather sealing? This makes it a pretty attractive upgrade in my opinion. \n\nThis doesn't provide an upgrade in AF as such, so for that I would need to look at the 5D mk III or 6D mk II, which are going for at least twice the price of the above two options (&gt;6000 kr. or &gt;$980), unless severely used, patinaed and with very high shuttercounts. At that point I'd rather save up more and go for an EOS R, RP or perhaps look at switching systems to Fuji or Sony, which brings me to the following thoughts:\n\nA second hand EOS R + adapter  (~11000 kr. ($1795)) would by far be the easiest, as I wouldn't have to sell the old lenses and buy new ones (except perhaps the sexy rf 35 F1.8). The benefits of the mirrorless bodies without the need to sell and buy new lenses would honestly be amazing. \n\nFuji would present  a world of very nice lenses made specifically for crop sensors, and the X-T3 goes for the same as the 5D mk III now! The faster than usual, stabilized, variable aperture zooms and the F2 primes in this system seem to be of very high quality and very fairly priced. The optical quality of their F2.8 zooms seems to be lacking behind taking their price and the offerings in other systems into consideration perhaps. \n\nThe A7III is at the same second hand price point as the EOS R. The Sony system has some very nice FF zoom options from Tamron, taking advantage of the IBIS. I honestly don't see many arguments against this system, except for the hassle and expense of exchanging the lenses. \n\nAs for Sony crop, they are almost none-existing on the second hand market, except for the A6000. The price of a brand new a6600 is the same as a used a7III, so a brand new a6400 would be the only attractive choice, as it costs the same as the used 5D mk III and X-T3 mentioned above. The 17-70 F2.8 from Tamron is by all means a very attractive lens along with the Sigma 1.4 primes, but the lack of a dedicated F4ish stabilized aps-c telezoom makes the quite expensive FF 70-200 F4 G the only option here as far as I know. The a6600 would at least permit the use of the FF Tamron 70-180 F2.8 with its IBIS. \n\nI haven't considered Nikon, Panasonic, Olympus ans Pentax as I can only handle so much information at once before becoming completely overwhelmed by choice paralysis haha. \n\nSo yeah, I think perhaps I should just sell the 5D classic + t2i and get a 6D. Then upgrade to something more expensive once I get an actual job with (hopefully) disposable income. \n\nIf you've made it this far I applaud your patience and thank you for your time.", "link": "https://www.reddit.com/r/canon/comments/l8n4pz/reflections_on_the_5d_classic_and_upgrade_paths/"}, {"autor": "puta_ebak", "date": "2021-06-01 03:23:02", "content": "Would upgrading to R6 help resolve autofocus issues with 6Dii? /!/ Seeking out the knowledge/experience of those who have owned a 6Dii and/or an R6. I am just a hobbyist and I use my 6Dii to mainly take photos of my kids playing outdoors during daytime. I use a 50mm at f4-8, auto ISO, SS 200-300 and -----> AI !!! -SERVO. \n \nI find myself tossing 30-50% of my shots due to out-of-focus issues. Is AF in R6 much much faster? Is the Face detection quick? If so, can this be said on both single shot and burst mode?\n\nI also find the condensed AF points on the 6Dii  limiting. I thought I could focus-recompose as a workaround but that doesn’t work all the time. \n\nAlso, is the dynamic range significantly better on the R6 than the 6Dii ? Sometimes I adjust the exposure 1-2 stops in post so this could be another selling point for me. \n\nTIA for taking the time to respond.", "link": "https://www.reddit.com/r/canon/comments/npkkag/would_upgrading_to_r6_help_resolve_autofocus/"}, {"autor": "JaimeAzorAhai", "date": "2021-08-01 12:24:29", "content": "Zoom H1n vs MagicLantern /!/ Hi, I have Canon 60D and use -----> ML !!!  to disable AGC. \nWill the quality be any better If I buy Zoom H1n?\nI tried testing ML analog gain settings but there's still a hiss (from Air con) when removed in post the sound quality is degraded.\n\nDoes h1n worth it or make a significant difference?\n\nPS. I have a couple of external microphones (Boya mm1) and (Takstar sgc-598)\n\nThanks", "link": "https://www.reddit.com/r/canon/comments/ovr6tk/zoom_h1n_vs_magiclantern/"}, {"autor": "Fineus", "date": "2021-04-27 11:00:27", "content": "Current Canon 6D (Mk 1) owner considering an upgrade (R6) or ecosystem move (Fuji X-T4) - help me sanity check this? /!/ Hi all,\n\nI'm currently invested in Canon with a 6D Mark 1 and range of prime / zoom lenses including L glass. Before that I owned a 5D Mark 1 and a 30D. \n\n**Why I'm looking:**\n\nThe above has worked well for me over the years but is now struggling to do what I want - particularly with the arrival of a young dog who loves to run around. The 6D really struggles to keep him in focus and I miss more shots than I nail. I'm frustrated. \n\nThat's not the only reason I'm thinking of a move... mirrorless seems more and more popular, the 6D is quite an old body now and I've been eying up what the likes of the Sony A7 III can do and wishing mine came close (if only it was ergonomically pleasant to hold!). It's also a bulky system to carry around (particularly with multiple lenses) so a more compact system is attractive. \n\n**My options:** \n\nI'm looking at going mirrorless and the Canon R / RP both have drawbacks I feel I can't ignore, leaving me the supremely expensive Canon R6 as an option. It's a superb camera, but £2,500 here in the UK and it's still a big / bulky system to carry for my daily dog walks. \n\nThis leads me to Fuji, whose XT-4 looks good and certainly cheaper... but at the sacrifice of full-frame and of course a complete ecosystem shift. \n\nOn top of my dog I also shoot events / music festivals which can involve some low-light work, so lack of noise is another thing I look for and I know FF generally helps there, plus there's the general FF 'feel'. It's been a while since I shot anything on a smaller sensor barring my phone, where -----> AI !!!  does a lot of the work.\n\nSo...\n\nHas anyone found themselves in a similar situation? \n\nI feel like I could buy a more complete Fuji system for a lot less than Canon - particularly if I have to look at R-mount lenses going forward as Canon is slowing/stopping production of some EF glass. \n\nBut I already have some EF glass and know Canon well, the R6 is a fantastic camera but it's *very* expensive for an enthusiast (I've done some paid work, wouldn't claim to be a professional though) and it's also bulky.", "link": "https://www.reddit.com/r/canon/comments/mzlvuk/current_canon_6d_mk_1_owner_considering_an/"}, {"autor": "Candlefoot", "date": "2021-05-12 13:40:09", "content": "Can't get my Canon EOS 1300D to auto-focus without holding down the shutter button /!/ I'm using my Canon EOS 1300D as a webcam through EOS Webcam Utility, and it works fine, but I can't get it to auto-focus without holding down the shutter, is there a way to do this? I've tried setting the focus to -----> AI !!!  Servo, but no luck.", "link": "https://www.reddit.com/r/canon/comments/naownh/cant_get_my_canon_eos_1300d_to_autofocus_without/"}, {"autor": "ma_che_ne_so", "date": "2021-03-14 10:17:56", "content": "Canon 5D -----> ml !!!  II shutter issue. When I try to shoot, mirror come up but the shutter doesn't open, but if I try to clean the sensor manually it does open, only for a second and then it closes again. I don't know what to do and I don't know if it's a shutter problem or something else", "link": "https://www.reddit.com/r/canon/comments/m4so15/canon_5d_ml_ii_shutter_issue_when_i_try_to_shoot/"}, {"autor": "antdude", "date": "2021-06-23 05:28:23", "content": "Canon Uses -----> AI !!!  Cameras That Only Let Smiling Workers Inside Offices", "link": "https://www.reddit.com/r/canon/comments/o66dl1/canon_uses_ai_cameras_that_only_let_smiling/"}, {"autor": "krum", "date": "2021-10-25 18:03:05", "content": "Canon 7D Webcam - Can't get autofocus to work /!/ For some reason I can't figure out exactly how to get autofocus to work when using my 7D with 50mm f/1.4 as a webcam.  One thing I've noticed is that when switching to webcam mode the AF goes from -----> AI !!!  Servo to Single Shot.  Any clues?", "link": "https://www.reddit.com/r/canon/comments/qfmkfq/canon_7d_webcam_cant_get_autofocus_to_work/"}, {"autor": "frowniehandface", "date": "2021-01-03 21:49:10", "content": "-----> AI !!! -Servo on Canon Rebel SL3 - help /!/ Hi! I received a Canon Rebel SL3 for Christmas and I love it so far! I had a question about AI-Continuous AF aka AI Servo on this camera. \n\nI'm trying to understand how to enable AI Servo versus AI One Shot. \n\nLooking at the user guide, page 106 seems to imply that it's automatically invoked when you hold the shutter halfway down (same as AI one shot?? really??). Yet further on page 205, it says to enable AI Continuous through the shooting settings in the menu. The guide says it's on tab 6 of shooting settings and I only have two tabs in Shooting settings. \n\nHere is the advanced user guide: [https://gdlp01.c-wss.com/gds/2/0300034502/01/eosrebelsl3-eos200d2-ug-en.pdf](https://gdlp01.c-wss.com/gds/2/0300034502/01/eosrebelsl3-eos200d2-ug-en.pdf)\n\nI tried to go to sport mode to see if that gave me the other tabs I was missing but it did not. How do I enable AI Servo? Am I missing a software update? Is it only available on certain modes? \n\nLet me know if I should post in a different subreddit and thanks for your help! I tried searching online and there isn't really much from 2020 about this, specific to this camera model.", "link": "https://www.reddit.com/r/canon/comments/kptwah/aiservo_on_canon_rebel_sl3_help/"}, {"autor": "buddyboris", "date": "2021-01-03 13:03:38", "content": "Unable to take photos with autofocus /!/ I just bought a used Canon 600D (Rebel T3i) and when i choose auto focus on whatever lense (18-55mm, 55-250mm, and a sigma 10-20mm) it will not take a photo. Instead it just focuses in and out, if I choose -----> AI !!!  Servo for a still object it will take the photo but it's not in focus. I'm a complete noob when it comes to dslr's so I'm hoping I'm doing something wrong and my camera isn't broken.", "link": "https://www.reddit.com/r/canon/comments/kpka5m/unable_to_take_photos_with_autofocus/"}, {"autor": "RandomBlokeFromMars", "date": "2021-01-09 20:35:30", "content": "Studio + occasional aquarium fish macro, and bird photography: R6 vs 1Dx m3 ? /!/ Hello!\n\ni am looking to upgrade my 5d mk3 to a better camera, and i am torn between 1dx mk3 and R6.\n\nthe 1dx looks so sexy, and it has the beefy look, also it is almost 3x the price of R6.\n\nbut the R6 has animal detection -----> AI !!!  AF, and eye tracking.\n\ndoes anyone of you have experience with both? is the animal detection ai worth it over the general AI AF of the 1dx m3?\n\nthanks for any input :)", "link": "https://www.reddit.com/r/canon/comments/ktyugo/studio_occasional_aquarium_fish_macro_and_bird/"}, {"autor": "Scootermann30", "date": "2021-01-17 15:16:31", "content": "Magic Lantern /!/ Pros/Cons regarding -----> ML !!!  Its for my 500D and Can I only use software 1.1.1 ??", "link": "https://www.reddit.com/r/canon/comments/kz84xx/magic_lantern/"}, {"autor": "rdoggioo", "date": "2021-01-16 22:02:53", "content": "Help with -----> AI !!!  SERVO setting /!/ Hi all wondering if I could get some help.\n\nI’ve recently got a 5D Mark IV and was playing around with it today, I switched to AI SERVO and noticed when I half hold the shutter down it stays on the first focus point I set and doesn’t move.\n\nOn all the tutorials I’ve watched when it gets a focus point (I’m using the 9point setting) the 9 squares move WITH the subject you have focused on. This does not happen when I’ve tried it?\n\nCan anyone help with this as it’s really frustrating, for example when I’ve tried to photograph wild animals, or anything moving for that matter.\n\nIf you need anymore info let me know and I’ll be happy to reply!", "link": "https://www.reddit.com/r/canon/comments/kysgzz/help_with_ai_servo_setting/"}, {"autor": "Heis93", "date": "2021-04-04 06:15:14", "content": "Post processing noise. /!/ I have taken a few photos recently that were indoors at 6400 iso with my r6(shooting raw). I understand this is a higher iso, but when looking at the photos on my camera lcd it looked like there was basically no noise and I was very surprised. I even zoomed in and it still seemed like there was not really any noise. But when I uploaded them to Skylum Luminar -----> AI !!!  and was reviewing them there was a decent amount of noise especially if I zoomed in. Just wondering if anyone else has also noticed this and why it’s happened, my guess is that the picture is blown up more than on the camera lcd but any help would be appreciated.", "link": "https://www.reddit.com/r/canon/comments/mjqkjr/post_processing_noise/"}, {"autor": "JA08879", "date": "2021-04-18 12:30:55", "content": "EOS T7 Rebel with 470EX------> AI !!!  question...what does this message mean when I put click if on -----> AI !!! .B and press the -----> AI !!! .B button. Is it not compatible? I was told by canon it is...any suggestions", "link": "https://www.reddit.com/r/canon/comments/mtby15/eos_t7_rebel_with_470exai_questionwhat_does_this/"}, {"autor": "at_ML", "date": "2021-04-22 08:49:13", "content": "User feedback about Canon Camera Connect App wanted /!/   Hello!  \n\n\nAsking for feedback from users running [Canon's Camera Connect App](https://www.canon.de/apps/canon-camera-connect/#camera_connect).  \nIt may be helpful to get [movie mode switch (or similiar function)](https://wiki.magiclantern.fm/faq#where_is_movie_mode_remap) back into Magic Lantern (-----> ML !!! ).   \nWhat  do I mean by that? ATM it is not possible for ML to switch from photo  mode to video (and back) without using physical switches (main dial,..).    \nCamera Connect allows to switch back and forth by software using my  250D/SL3. And it would be helpful to get some info if this function is  enabled on other cams, too. Esp. those with older Digic.  \n\n\nHow to test:  \nSet  cam into photo mode. Connect to app and take a pic. Now switch to video  and start recording. Stop recording and switch back to photo mode. Take  a pic.   \nIf you are able to record a video and cam take a pic test is successful completed.  \n\n\nList of cams to test:  \n\n\n\\[DIGIC 4+\\]  \n1300D/T5: y/n  \n\n\n\\[DIGIC 5\\]  \n70D y/n  \n6D y/n  \n\n\n\\[DIGIC 6\\]  \n750D/T6i y/n  \n760D/T6s y/n  \n80D y/n  \n\n\n\\[DIGIC 7\\]  \n200D/SL2 y/n  \n800D/T7i y/n  \n77D y/n  \n6D II y/n  \n\n\n\\[DIGIC8\\] -&gt; Done  \n250D/SL3: y  \n\n\nThanks for your support!  \n\n\nPS:  Don't ask for a time frame to make it happen. This is just an inquiry  and mode switch by ML will definitely not come into being any time soon!  \nPPS: For ML users it might be best to run this test without ML being active.", "link": "https://www.reddit.com/r/canon/comments/mw0isa/user_feedback_about_canon_camera_connect_app/"}, {"autor": "jacl3", "date": "2021-04-20 04:20:24", "content": "Help with Powersave in Liveview /!/  have a 7d with a broken USB port.\n\nI am trying to use it as a webcam, I have a HDMI capture device and a power tap for my 7D.\n\nIt actually works great for the most part but there doesn’t seem to be a way to stop the power save in Live view from happening.\n\nI was hoping MagicLantern could help, I disabled the power save in the canon menu and on -----> ML !!!  under preferences I checked power save in liveview and there are 3 options but no option to fully disable power saving in Liveview.\n\nIf I switch to video mode in liveview, every 30 minutes the shutter closes for about 5 seconds and then comes back, and in photo mode it turns off every 30 minutes.\n\nI’ve tried reading everywhere and I can’t find a solution. Thanks for any help!", "link": "https://www.reddit.com/r/canon/comments/muihnk/help_with_powersave_in_liveview/"}, {"autor": "SeventyFix", "date": "2021-06-07 17:13:16", "content": "Equipment Advice: Canon EOS R6 For Pet Photography /!/ Thank you in advance for the assistance.  In order to be as to-the-point as possible, I'm going to try to be brief.\n\n**Background**\n\n* Pet \"photographer\" - unpaid - I do this to help family and friends (in the United States).\n* I am a camera and photography novice - explain it to me like I am 5.\n* My camera is exclusively used to take photos of pets - 99% cats - at close range (2 to 6 feet).\n* I try to use artificial lighting as much as possible to help get better pictures.\n* Camera is used daily.\n\n**Previous Equipment**\n\n* I was using a Canon EOS 70D with a Canon EFS 18-135mm lens (macro 0.39m/1.3ft).  \n* I have been using this camera daily for pet pictures for about 10 years.  \n* I believe that it's broken (it's throwing a bunch of errors and making odd noises).  \n* The pictures that I took were \"OK\" quality.  I used Photoshop to lighten and sharpen the images just about every time.  I am fully willing to accept that this may be due to inexperience/operator error.  I am overwhelmed by all of the technical terms in photography.  I bought a Dummies book specific to this camera but found that I need the book for those people that are 1 step below \"dummy\".\n\nI am looking at replacing my camera with a Canon EOS R6.  From what I've been able to tell from the reviews, mirrorless is the way of the future, this is a good middle-to-high end camera, and I'm hoping that the eye/animal face recognition -----> AI !!!  will help me in what I do (pet pictures).  \n\n**Questions**\n\n1. Am I on the right track with the Canon EOS R6?  It's a lot of money but I'm willing to spend it if it helps me to take great pictures.\n2. What lens would you recommend?  I want to take a mix of close-up face shots and full body shots, mostly of domestic house cats, from 2 to 6 feet away.  These are posed pictures - not impromptu pictures of cats around the house.  Of course, animals don't always cooperate and hold poses.  The numbers and letters on the lenses, zoom, macro, prime, focal length - it's as complicated as the camera!\n\n**Budget**\n\n* I understand that the Canon EOS R6 is \\~$2,500 USD.  I got over the sticker shock last night (it wasn't easy).\n* I was hoping to keep the lens under $1,000 USD, but if there's a lens out there that will guaranty near perfect pictures each and every time, I'd be willing to spend more.  I know that this is an exaggeration but you know what I mean.\n\nThank you in advance for analyzing my situation and providing feedback.  I'm overwhelmed and I really do appreciate it.  My only other option is to walk into a camera store and go with whatever the clerk behind the counter recommends - not a likely recipe for success.", "link": "https://www.reddit.com/r/canon/comments/nuhv3r/equipment_advice_canon_eos_r6_for_pet_photography/"}, {"autor": "Lumpy-Studio", "date": "2021-06-06 05:20:09", "content": "EF 70-200 F4 IS continuous noise with R6. Why? /!/ I upgraded from an 80D to an EOS R6 just recently and I'm loving it. Picture quality and out-of-camera colour is way better; low light performance is jaw dropping; the -----> AI !!!  eye autofocus is superb; the controls fall more comfortably to my hands; and that I can still use my EF lenses equally well if not better made it an easy upgrade. I have no RF lenses —it'll be a while to recover from the cost of the body before I can think about that.\n\nBut when I attach an EF 70-200mm F4L, the IS continuously grumbles away for as long as the R6 is on. On the 80D it's just as noisy, but only for a little while after the shutter is half cocked, then it parks itself. It's definitely the IS making the noise. It goes away if I flip IS 'OFF' on the lens. It doesn't affect  my EF 24-70 F4L IS, or my 35mm F2 IS. Or if it does, the motors are so much quieter that I can't hear them.\n\nWhy does it do that? Is there some need for that behaviour? Because if not, it's going to eat the batteries unless I keep turning the camera off. Are Canon going to fix this? Or is it maybe an unsubtle hint to invest in some RF glass? Which would be a pity, because EF glass is plenty good enough for me and I was hoping to pick up more on the secondhand market ...", "link": "https://www.reddit.com/r/canon/comments/ntect7/ef_70200_f4_is_continuous_noise_with_r6_why/"}, {"autor": "tungvu256", "date": "2021-07-10 12:08:43", "content": "Good software with -----> AI !!!  for editing? /!/ What windows program are you using with AI to enhance photos with? My primary use will be removing noise from grainy images, especially at night with my lousy m6ii.\nThis looks promising AND no subscription. Is it any good?  https://photo-works.net/lp2/photoworks-10-for-petapixel.php", "link": "https://www.reddit.com/r/canon/comments/ohhjfa/good_software_with_ai_for_editing/"}, {"autor": "charlesyop", "date": "2021-08-05 02:52:24", "content": "Switched to R6, best part was unexpected /!/ Sold off my 6D Mark II and switched over to an R6. Tonight was my first actual use of it - and went great. Eye tracking is the real deal. Every. Single. Image. Was in focus. Normally I’d have quite a few throw aways with soft focus or missing the eye completely, but this camera literally nailed every single frame I shot. \n\nBut that wasn’t what has me most excited. My flash trigger is a Flashpoint clone of the canon ST-E3-RT and for 3+ years when using it, the camera would consistently give an “-----> ai !!!  bounce” message and I’d have to w-----> ai !!! t a few moments before I could take the shot our adjust anything (ss/aperture etc). Or the flashes wouldn’t trigger at all, probably 1 out of every 7/8 shots. But I just dealt with it. Tonight - no message on the R6 and flashes fired every single time. \n\nCan’t wait to get some more time in with this camera!", "link": "https://www.reddit.com/r/canon/comments/oy8lin/switched_to_r6_best_part_was_unexpected/"}, {"autor": "jmel79", "date": "2021-02-17 18:27:32", "content": "6D AutoFocus /!/ I have a 6D paired with a 1st gen 70-200 2.8L. Does the 6D AF suck as bad as I think it does with -----> AI !!!  Servo tracking? Or am I really bad at tracking things with it. My focus confirmation will be dead center (using center focusing point) on my subject but its consistently out of focus on a moving subject. Its starting to drive me crazy and I think the camera's AF tracking ts just too slow to keep up with anything going faster than a slow walking pace.", "link": "https://www.reddit.com/r/canon/comments/lm14f6/6d_autofocus/"}, {"autor": "player_vsa", "date": "2021-06-17 22:20:01", "content": "AF wants to move but it can't but MF is working fine - EOS 600D /!/ Hey there,\n\nI recently upgraded to a EOS 600D (2nd hand) with the kit lens (EF 18-55mm). I was only using the MF but now, when I was going to try the AF, is just can't move. I can hear a faint sound from the lens when I press halfway the shutter, but it does not complete it the movement to adjust the focus.\n\nSome of the things I did were:\n\n* Tried different fully charged batteries\n* Tried all the available modes with the different settings  (One shot | -----> AI !!!  Focus | -----> AI !!!  Servo)\n* I cleaned the body and lens with canned air \n* Formatted the settings\n\nSearching for a solutions, I saw some videos in which people disassemble the lens to fix a gear or a flex cable.\n\nCan anyone give some direction?\n\nAny help is appreciated and thanks a lot in advance!", "link": "https://www.reddit.com/r/canon/comments/o29ipz/af_wants_to_move_but_it_cant_but_mf_is_working/"}, {"autor": "pb_and_banana_toast", "date": "2021-09-01 17:33:11", "content": "Anyone know if info from the camera's digital level info is stored in EXIF? /!/ I've thought for awhile that if the info from the digital level is stored in EXIF data that programs like Lightroom could auto-level every image automatically according to that data. It only makes sense that if the camera knows if its level or not, this data should be able to be accessed later.\n\nI've been using an -----> AI !!!  editing company lately that straightens images using its own algorithm that might be able to incorporate this from EXIF data, but I can't actually find any concrete evidence on whether Canon cameras store this in the RAW files.", "link": "https://www.reddit.com/r/canon/comments/pfysmy/anyone_know_if_info_from_the_cameras_digital/"}], "name": "Subreddit_canon_01_01_2021-01_11_2021"}