{"interestingcomments": [{"autor": "hurrianccea", "date": "2019-05-19 18:00:55", "content": "What focus mode would you use on the EOS R for a safari? /!/ I'm bringing my EOS R and 100-400mm mark ii and I'm debating which of these makes most sense to have as my default for a safari:  \n1) Zone AF and use -----> AI !!!  Servo.\n\n2) Face/Subject Tracking and manually select a subject to track -- ( I Haven't tested how accurately it follows a non-face but it seems pretty accurate for face/eyes so far).\n\nI mostly do street photography and portraits so I'm usually in One Shot AF and select an AF point so wildlife and moving subjects is something I'm not that familiar with.  \n\nAny input would be appreciated as I'd love to have all of this taken care of before I go so that I don't have to experiment there there.", "link": "https://www.reddit.com/r/canon/comments/bqjwid/what_focus_mode_would_you_use_on_the_eos_r_for_a/"}, {"autor": "akusinlin", "date": "2019-10-14 10:41:47", "content": "EOS R compatibility issue with 470 EX -----> AI !!!  /!/ [removed]", "link": "https://www.reddit.com/r/canon/comments/dhossv/eos_r_compatibility_issue_with_470_ex_ai/"}, {"autor": "TheFoxPhyre", "date": "2019-03-03 18:34:57", "content": "Need some Canon EOS 6D Mark II help /!/ A little about what I'm looking for here. I'm looking for the settings comparison for the Canon EOS 6D Mark II. In the two supplied images, the configurations are as follows:\n\n&amp;#x200B;\n\nLeft: \n\nCamera - Nikon D3400 (crop sensor), Fine image quality, large image jpeg, Min Iso 200, auto-servo AF, 3D AF area mode, Matrix metering\n\nLens - AF-S Nikkor 70-200mm f/2.8E FL ED VR, 200 mm zoom, f/2.8 (might be about 4.0 in the picture, can't remember), VR on. \n\nRight:\n\nCamera - Canon EOS 6D Mark II, auto picture style, standard auto lighting optimizer, one-shot AF, Spot AF, Evaluative Metering, Fine/Large image Jpeg.\n\nLens - Canon EF 70-200mm f/2.8 IS II USM, 200 mm zoom, f/2.8 (this was probably about 3.5), Stabilizer mode 1. \n\n&amp;#x200B;\n\nI'm not sure if it's a setting issue or if it's just the lens itself which is causing the extremities blur on the picture on the right. I have since changed the autofocus to -----> AI !!!  Servo AF and went to the Zone AF setting. I'm hoping this helps. I won't have a chance to shoot a rugby match before this next Saturday but can try on some random stuff around town. \n\n&amp;#x200B;\n\nAny insight into the Canon camera and lens configuration would be great! Thanks!", "link": "https://www.reddit.com/r/canon/comments/awwwhs/need_some_canon_eos_6d_mark_ii_help/"}, {"autor": "DarthSceledrus", "date": "2019-02-16 21:36:50", "content": "How do I disable Auto Shut off after 30 minutes on Canon T5i? /!/ I've installed Magic Lantern and I've been in the settings and DISABLED off Auto Power Off and LCD auto off. Where do I go from here? Is there a setting in -----> ML !!!  to do this? Please help.", "link": "https://www.reddit.com/r/canon/comments/ardd0z/how_do_i_disable_auto_shut_off_after_30_minutes/"}, {"autor": "Stustaff", "date": "2019-01-13 11:42:38", "content": "Advice on organising/selling what camera and Lens I have. /!/ So over the years I have what feels like a very random assortment of kit. \n\n\nI’m moving to an M50 this week and wondering what stuff I should keep or sell? any advice much appreciated. \n\n\nI shoot generally travel and street photography with some occasional family and friend portraits in a home set up. \nI want to go smaller and lighter than my current set up of my 500D which is getting on a bit now. \n\n\nDo I have any overlap or anything that isn’t worth keeping? \n\nSo I have\n-m50 new\n-eos-m old and battered with -----> ML !!!  installed\n-500D\n\n\nLens\nCanon EFS 10-18mm 4.5 IS STM\nCanon EF 50mm 1.8\nCanon EFS 55-250mm 4.5 IS II\nSigma 28mm 1.8 EX DG\nCanon EFM 18-55mm 3.5 IS STM\nCanon EFM 22mm 2 STM\n\n\nSpeedlight 90ex\nSpeedlight 440ex\n\n\nThanks \n\nStu", "link": "https://www.reddit.com/r/canon/comments/afimng/advice_on_organisingselling_what_camera_and_lens/"}, {"autor": "johnbro27", "date": "2019-01-07 01:06:01", "content": "We don't need no stinkin' DPAF /!/ Been shooting in Mexico on a vacation trip. Go to setup is my 6D2 and Sigma Art 50mm. My standard AF setting is OVF with center 9 points, either -----> AI !!!  Servo or Single shot. The number of bad focus/missed focus shots is close to zero. The sharpness of this particular lens is somewhat awe-inspiring. Even though I'm hand-holding basically all my shots, by paying careful attention to holding very steady and making sure the aperture is set for a correct DOF, I'm getting almost no rejects for focus reasons. \n\n&amp;#x200B;\n\nI actually have no gripe with DPAF, it's an amazing system and the way you can zoom in to check focus is great for macro stuff. But in \"normal\" shooting I dislike holding the camera in front of my face (not as well braced up) and in daylight it's hard to see the screen. I may just be lucky, but this 6D2 has such better AF performance than my Mark I it's hard to beat.\n\nSome shots here: [https://flic.kr/s/aHsmtHfphJ](https://flic.kr/s/aHsmtHfphJ) ", "link": "https://www.reddit.com/r/canon/comments/adc8if/we_dont_need_no_stinkin_dpaf/"}, {"autor": "hurlepoow", "date": "2019-05-17 13:43:12", "content": "EOS R: do the tracking settings in the menu apply to video tracking or -----> AI !!!  Servo photo tracking ? /!/ In the AF menu, do these apply to video or to photo mode as well: Servo Tracking sensitive, acceleration/deceleration speeds, etc?  \n\nAlso, I noticed that if you are in face tracking mode and use the touch to drag feature, you can select anything to have it track.  Would it apply to this as well?", "link": "https://www.reddit.com/r/canon/comments/bprfl3/eos_r_do_the_tracking_settings_in_the_menu_apply/"}, {"autor": "FloralBison", "date": "2019-06-02 22:43:41", "content": "Canon A2e Autofocus Question /!/ Recently my father gifted me his old Canon EOS A2e, the first legit camera he ever bought.  Obviously the sentimental value is incredible, but it still functions and I'd like to start using it more.  The only issue is the autofocus.  Right now the only lens I have for it is a Sigma DL Zoom 35-80 1:4-5.6, which has an AF/M selector switch on it.  I followed the instructions in the manual to turn on the autofocus (press the AF button, use the wheel to select \"One Shot\" or \"-----> AI !!!  Servo\") but it seems like nothing is happening.  I assume that when I half-depress the shutter button it should suddenly focus something, but so far it does nothing (I've deliberately pointed it at out of focus things to see if they would focus, but nothing happened).  Obviously I know how to manually focus but there isn't anything in the viewfinder to let me know if it's precise (like one of those split circles).\n\n&amp;#x200B;\n\nIs there any chance that this is just the lens and that buying a canon lens would possible solve this (I want to get a 50mm soon), or is something wrong with the camera altogether?  Or am I just doing it wrong, I'm a nikon guy myself so quite frankly I am not as familiar with the more detailed buttons/settings of canon.", "link": "https://www.reddit.com/r/canon/comments/bw3bt7/canon_a2e_autofocus_question/"}, {"autor": "DoritoCookie", "date": "2019-02-21 18:55:01", "content": "Handheld Moon Photography (Process and Equipment Setup Explaination included) /!/ &amp;#x200B;\n\n[The Moon](https://i.redd.it/lcd6lmvkxyh21.jpg)\n\n\\[Equipment/Software Used\\]\n\n  \n\\- Canon 1200D (yes, an entry level Canon APS-C body)\n\n\\- Canon 300mm IS USM \"L\" Mk.I   \n\\- EF EXTENDER 2x  \n\\- EF EXTENDER 1.4x  \n\n\n\\[Setup\\]\n\n&amp;#x200B;\n\nMount both extenders and lens into your body (i'm using a crop body to push my effective focal length to 1344mm, but fullframe would work too if you crop it in post) \n\n&amp;#x200B;\n\n(Process)\n\n&amp;#x200B;\n\n-----> AI !!!  SERVO and High Speed Continuous Shooting   \nSPOT metering  \nUsing Manual Mode at f/6.3, 1/500 sec, ISO200  \nRAW file format  \nUsed Digital Photo Professional and adjusted brightness, manually retouched gamma adjustment and cropping before exporting as JPEG", "link": "https://www.reddit.com/r/canon/comments/at6vrb/handheld_moon_photography_process_and_equipment/"}, {"autor": "InitialTeacher", "date": "2019-03-28 20:59:44", "content": "Back button focusing in -----> AI !!!  Servo mode? /!/ I have been using back button focusing for a few years now but I shoot one-shot focus 99% of the time.  I'm going on safari in a few weeks with my Canon R and AI Servo will obviously be my prime focus mode.  With back button focusing, do I just hold down the focus button and click the shutter while continuously holding down the focus button?  Would that ever result in premature shots being taken while focus is still trying to be achieved?", "link": "https://www.reddit.com/r/canon/comments/b6o8yu/back_button_focusing_in_ai_servo_mode/"}, {"autor": "Seitenwerk", "date": "2019-06-12 11:22:08", "content": "Speedlight Canon 470ex -----> AI !!!  with Canon EOS RP /!/ Hi, as I recently purchased a EOS RP and a 470ex AI speedlight, I wondered if there is a way to acitvated its automated features via the camera instead of the speedlight button.\n\n&amp;#x200B;\n\nThe manual stated recent cameras (I think it was since 2017) can toggle this feature via the depth of field preview button. Now I now some cameras dont support this, but the EOS RP is listed as fully supported on the official homepage. I cusomized the depth of field preview feature to one of the buttons as i use it quiet often. It works as expected but it wont start the automated speedlight adjustment if I try to use it with the 470ex ai attached.\n\n&amp;#x200B;\n\nNow I wonder if the RP doesnt support it or if there is some trick to it. Maybe it only works if its mapped to specific buttons on the RP?", "link": "https://www.reddit.com/r/canon/comments/bzpz7e/speedlight_canon_470ex_ai_with_canon_eos_rp/"}, {"autor": "at_ML", "date": "2019-11-24 21:51:34", "content": "Call for 6D and 70D users: Firmware downgrade test, please! /!/  The  Magic Lantern community would be pleased to have a theory verified/falsified about newest firmware for these cams. Canon released 1.1.9 for 6D  and 1.1.3 for 70D fixing PTP vulnerability allowing remote code  exexution some days ago. See [https://research.checkpoint.com/2019/say-cheese-ransomware-ing-a-dslr-camera/](https://research.checkpoint.com/2019/say-cheese-ransomware-ing-a-dslr-camera/)\n\nThe  question is: Is it possible to downgrade to older versions without help  from Canon CPS? I suppose it will \\*not\\* be possible but this is just an  educated guess ... until someone tests it! Reply with your experiences. Would be really appriciated! \n\nBackground:  5D Mark III with newest firmware 1.3.6. (containing the PTP fix) will  deny any downgrade attempt in-cam (which is known behavior for 1.3.x) or  using EOS Utility (will work for 1.3.5 (or older) but not for 1.3.6). Canon CPS can downgrade from 1.3.6. We know because an ML user asked for it after service installed 1.3.6. leaving him without -----> ML !!! .  \nDev a1ex wrote he should be able to write a downgrade routine but there is no schedule for this.  \n\n\nWARNING:  Do this test only if you do not intend to use your cam with Magic  Lantern! For the foreseeable future there will be no ML version for  6D.119 and 70D.113!\n\nAnd that is the very reason I ask here. Because no ML user will risk getting stuck with an incompatible firmware version ...\n\nOlder firmware can be found here: [https://pel.hu/eoscard/](https://pel.hu/eoscard/)  \nmacOS users can use those files, too. Just expand them with a tool of your choice.", "link": "https://www.reddit.com/r/canon/comments/e15dvm/call_for_6d_and_70d_users_firmware_downgrade_test/"}], "name": "Subreddit_canon_01_01_2019-30_12_2019"}