{"interestingcomments": [{"autor": "global_tech", "date": "2019-02-04 13:18:58", "content": "-----> AI !!!  is disrupting. For the better.", "link": "https://www.reddit.com/r/Cameras/comments/an1l62/ai_is_disrupting_for_the_better/"}, {"autor": "patchlondon", "date": "2019-02-01 03:43:46", "content": "Help with a camera decision. /!/ Hey, I am trying to decide on a new camera. Rn I've been shooting on an old Nikon D40X for a while and I'm looking to upgrade. I have a bit of Nikon glass, but not a ton.  (AF-S 50 mm F/1.8G, -----> Ai !!! -S 50 F/1.4, 18-55 VR, 18-135 F3.5-5.6G, AF-D 35-70 F/3.3-4.5) Would it be worth it to buy a Sony A7ii used with the 28-70mm lens or a 50 f/1.8, or to just get a new D750 that I've been eyeing? I mostly shoot macro, wildlife, and landscapes but some portraiture and other stuff occasionally. ", "link": "https://www.reddit.com/r/Cameras/comments/alxwov/help_with_a_camera_decision/"}, {"autor": "hardarseman", "date": "2019-05-25 20:22:11", "content": "should i trade my nikon fm2n for a nikon f2? /!/ looking for a manual camera and already have an FM2n.\ni never seem to utilize the 1/4000th max shutter speed, and i never use a flash. also it doesn’t take non -----> ai !!!  lenses, and id rather not get them -----> ai !!!  converted each time. \nthe f2 also feels nicer.\nbut is it worth trading?\nadvice appreciated. thanks!", "link": "https://www.reddit.com/r/Cameras/comments/bsz4bq/should_i_trade_my_nikon_fm2n_for_a_nikon_f2/"}, {"autor": "Hicksman11", "date": "2019-08-02 19:35:45", "content": "Love my FA with the 50mm f1.4 -----> AI !!! -S lens", "link": "https://www.reddit.com/r/Cameras/comments/cl8skw/love_my_fa_with_the_50mm_f14_ais_lens/"}, {"autor": "frankieboss", "date": "2019-02-17 21:38:42", "content": "Someone in here shooting -----> ML !!!  raw on a 5Diii ?", "link": "https://www.reddit.com/r/Cameras/comments/arpexx/someone_in_here_shooting_ml_raw_on_a_5diii/"}, {"autor": "Deep_Fried_Hummus", "date": "2019-04-01 14:21:29", "content": "Looking for a camera mount that I can program to move /!/ I'm currently working on a -----> computer vision !!!  project and I need a camera mount that can be programmed to move horizontally and vertically. Does anyone have any recommendations or ideas for where I should start looking?", "link": "https://www.reddit.com/r/Cameras/comments/b830a4/looking_for_a_camera_mount_that_i_can_program_to/"}, {"autor": "miscunknown", "date": "2019-01-22 17:30:02", "content": "Canon Rebel SL2 vs Canon 7D (2009) /!/ Hey guys, I know this sounds like a weird comparison but I'm just curious what you guys think.  \n\n\nI currently have a Canon Rebel SL2 which I got in 2017 when I started getting into photography. At the time I didn't really know what kind of photography I would be into, but it had Dual Pixel AF, the new Digic 7 Processor, 24mp, and was small and easy to carry around...a perfect entry-level camera. Fast forward 2 years and I've found myself deeply in-love with wildlife photography and even more specifically smalls bird and bird's in flight photography. To be totally honest, the Rebel SL2 works relatively well considering it's ancient 9-point/1-Cross Type AF system in combination to my ef-s 55-250mm IS STM lens. The struggle is when I need to acquire focus on a moving bird. Even in -----> Ai !!!  Servo, unless it's a large slow flying bird such as a Vulture, there's no chance I'm acquiring focus.  \n\n\nNow clearly the smart upgrade would be to buy a the Sigma 100-400mm Contemporary lens to get more reach out of my camera, there-by improving the surface area my camera should be able to focus onto.  \n\n\nHowever, I also found a great deal for a sub-10K shutter count Canon 7D in near-mint condition for around $250. I don't really \"need\" it, but I mean for $250, that's still a pretty excellent camera even if it is 10 years old. Most importantly, it has 19-Cross Type AF points as well as much more advanced AF point selection system which would make it acquiring focus on a faster moving subject easier (in theory). Now it is a 2009 camera with 2009 technology, but I mean what do you guys think? Is that worth getting even if it's just a secondary camera?", "link": "https://www.reddit.com/r/Cameras/comments/aip5jr/canon_rebel_sl2_vs_canon_7d_2009/"}, {"autor": "Travistyse", "date": "2019-02-08 21:16:11", "content": "Portable Camera To Replace Galaxy S9+ ? /!/ I'm not a photographer per se but I take photos of indoor and outdoor scenes that I find pleasant enough that I might one day want to recreate the atmosphere in a game, still image creation, or animation. I also take pictures and videos of loved ones (mainly my cat if we're being honest) and for references (3D models, textures, atmosphere for post processing effects / inspiration, and so on).\n\n&amp;#x200B;\n\nFor this reason I find that I might keep having to buy a high end phone. And don't get me wrong - I'm a tech nerd and I love having this device but I've gotten by with a cheap Moto G series phone for the entirety of my life up until this point. The difference in price is stark and I can't help but feel like I might be able to get a better camera and a more reasonable phone and wind up saving money in the long run if I could just be certain that I'll always have the camera when I need it.\n\n&amp;#x200B;\n\nThis doesn't mean that I need it to be pocket sized but I'd want to to be able to fit comfortably in a backpack and either connect to my phone or have a viewfinder of some sorts. I also REALLY appreciate being able to snap some sane looking photos without having to get into the nitty gritty advanced details for each shot.\n\n&amp;#x200B;\n\nMy search hasn't gone so well thus far. My current phone - because of its processor and the fact that Samsung know that the camera is a key selling point - can take BEAUTIFUL slow motion (240FPS iirc) videos, HDR, fantastic colors, much better than 720P photos and videos, the built in mic is fantastic, and best of all it's ALWAYS on me. It even automatically syncs to the Google Photos \"cloud\" so that even if I lose or break the device (I have insurance) / SD card inside of it I only lose the high quality photos not backed up to my computer. I still have REALLY nice looking compressed photos stored online - I'd lose at most a day's worth of photos. They're also WONDERFULLY tagged via the -----> Ai !!!  and location and.. you get it.\n\n&amp;#x200B;\n\nIs there a device for me? Or is the right answer just to keep getting a high end phone every other year? Because thus far I just keep finding expensive cameras (like $500) that don't look like they'll give an experience on par with my nearly equal priced phone despite the larger lens. For texture recreation specifically color accuracy and proper detail capture REALLY matters. On my old phones, my cat would be a fairly blurred mess unless lit perfectly. On this one I can pick out every hair on her body even in a poorly lit room. I'm not trying to advertise this phone - I'm just really feeling \"stuck\" with it. Roughly $350 a year ($700 every 2 years) is roughly double what I'd like to be paying for a phone that I only use to take notes, photos, music, and basic web browsing. I'd only really be losing the Samsung Dark Mode and Samsung Pay (a magnetic strip spoofer basically). But for my work (still building my portfolio so nothing high stakes) these photos are important. I take pictures of dirty and broken objects just to have a library of references as to how things tend to break down, clutter, or \"get dirty\". The camera being as good as it is means that with just a couple of angles I can get a reference so good that I can recreate it near perfectly. \n\n&amp;#x200B;\n\nI'm aware that the convenience of backups will probably be dropped - as will slow motion - and that I'll have to be prepared to take photos - actually bringing my backpack, taking out the camera, and really taking the photo. Not just pulling my phone out excitedly on the bus when I realize a car backed into a building and this is a rare opportunity to capture an actually demolished building - albeit my backpack and camera would be there as well. I hope that I've provided enough information and that I'm not just 1 of 10,000 other people who've asked the same thing D:", "link": "https://www.reddit.com/r/Cameras/comments/aol7dw/portable_camera_to_replace_galaxy_s9/"}, {"autor": "OpeningAspect", "date": "2019-02-06 16:48:25", "content": "4K Auto tracking -----> AI !!!  camera on kickstarter, what you guys think? /!/ [removed]", "link": "https://www.reddit.com/r/Cameras/comments/ansneg/4k_auto_tracking_ai_camera_on_kickstarter_what/"}, {"autor": "22Argh", "date": "2019-12-15 05:44:27", "content": "Request: Fixed HDMI streaming / macro stills setup /!/ Hi! I'm looking for a camera that will work as a fixed HDMI streaming / macro stills rig. I'm out of the loop as far as modern photo/video equipment goes, so I was hoping you guys could offer some suggestions.\n\nMust have:\n*Interchangable lens, OR good quality integrated zoom/macro combo\n*&gt;= 10MP stills\n*Clean HDMI output, 1080P or better\n\nWould be REALLY nice to have:\n*Computer/remote control\n*Wired or WiFi immediate photo downloading\n*External power (battery pack adapter is ok)\n*&lt;$500\n*Manual settings for stills and/or hdmi out\n\nDon't care about:\n*image stabilization\n*video recording (although maybe...)\n*low light performance\n*burst shooting\n*portability\n*battery life\n*\"creative\" features (eg. sepia filters)\n*new, modern\n*style, aesthetics\n*ergonomics\n*fast autofocus, focus tracking\n*Flash, hotshoe\n*Raw format\n\nAcceptable examples:\n*Point and shoot\n*Entry level DSLR\n*Compact MFT\n*industrial -----> computer vision !!!  cameras\n*CCTV\n*Benchtop microscope\n\nThanks!", "link": "https://www.reddit.com/r/Cameras/comments/eav6rq/request_fixed_hdmi_streaming_macro_stills_setup/"}], "name": "Subreddit_Cameras_01_01_2019-30_12_2019"}