{"interestingcomments": [{"autor": "CaligulavN", "date": "2020-03-09 19:24:48", "content": "Canon Speedlite 470EX------> AI !!!  off-camera /!/ [removed]", "link": "https://www.reddit.com/r/canon/comments/fg06aw/canon_speedlite_470exai_offcamera/"}, {"autor": "ABrownCoat", "date": "2020-11-21 00:46:13", "content": "Computational Photography /!/ Cell phone makers are doing some amazing things with -----> AI !!!  and cameras. Increased dynamic range, LIDAR for autofocus, real time image stacking, and more. Why aren't camera companies like Canon doing something similar?", "link": "https://www.reddit.com/r/canon/comments/jy1aml/computational_photography/"}, {"autor": "rjmcaptures", "date": "2020-12-28 15:38:24", "content": "EOS-R 2020 Review - A Wildlife Photographer's Perspective /!/ I just finished my week with an EOS-R rental after some great conversation in here and figured I’d lend my quick impressions in return. I know this isn’t a new camera by any means, but with the new R5/R6 and RF lenses coming to fruition this year, the price-dropped first crack at Canon’s mirrorless system most certainly deserves another look for anyone looking to make the jump. Please note that this review is coming from the perspective of primarily a wild bird photographer, but I put it through the ringer with some products and people this week as well. \n\nOverall, it’s an amazing camera - as I suspected my reaction would be coming from an old T2i. However, there are certainly quirks and pitfalls worth discussing for certain purposes, and ones that make my decision and increasingly hard one. For what it’s worth, it seems Canon heard the chatter on many of these desires designing the R5/R6.\n\n**Ergonomics**\n\nThe first thing I noticed when picking this up is that it far surpassed my expectations for a mirrorless body. Having seen Sonys in the past, I assumed this will be a light, thin, compact body that would result in an awkward center of balance with my telephoto setup. Boy was I wrong! This thing has some good density to it. \n\nThe grip also runs deep, giving a great hand hold when handholding tele shots. I found this even more balanced than my APS-C. The body itself feels very solid, with a beautiful matte finish over a solid, weather sealed magnesium alloy body. \n\nThe articulating screen properly blew my mind my low crouched shots and video, as I suspect any camera from the past 7 years would do as well. High quality build all around.\n\n**Image Quality**\n\nThis is the primary concern of mine, and the 30mp sensor lifted from the 5DIV did not disappoint. Crisp detail, wonderful dynamic range all around. Advantages no doubt of the FF sensor in a (at the time) brand new mirrorless system. As a previous crop sensor shooter, I thoroughly enjoyed the increased framing and bokeh ability for still product shots and portraiture.\n\nVideo was also killer, in my limited test shots with it. The 4K is quite crisp, albeit in my limited experience with filming anything beyond short clips.\n\nThe higher resolution does point out some of the previously hidden flaws in my Teleconverter setup, as well as the need for slightly faster shutter speeds for that desired 100% zoom tack sharpness. More of a catalyst for personal improvement than anything.\n\n**Low Light/High ISO Performance**\n\nAnother win here. I was mindblown at the images I was able to salvage in borderline darkness, as well as how high I could crank the ISO to maintain the fast shutter speeds needed for clear wildlife photos. Even at 10,000 ISO, a full crop photo could take a little denoise in post and be a total keeper. Certainly a game changer.\n\nI did include a photo taken in nearly full darkness at one of the highest ISO settings, just so you can get a feel for that end of things too. Quite noisy/degraded at that point, as can be expected with any camera, but still incredibly useful for pure birding ID shots. Saved me once or twice in trying to get a glimpse at a floating shorebird that the binos and naked eyes could no longer distinguish. \n\n**AF Performance**\n\nHere’s where my glowing review gets a little mixed. I found the AF system overall to be a bit clunky. The touch and drag thumb system while using EVF seemed less than intuitive and ergonomically awkward. I often found myself tripping over my own fingers (and accidentally picking my own nose) trying to get the AF point where I wanted it to be, also often requiring multiple swipes to get across the whole screen. I messed around with both Top Right, Right Side, and even whole screen touch AF for the gamut. I’d say I liked them functionally in that order. I get the intent here was to mimic a joystick, but it seems like an afterthought.\n\nTouch AF in live view is a different story. Lightning fast, great ability to select exact focus points. However, as a wildlife photographer, I am rarely shooting in live view in the field. This was more useful at home testing out shallow depth of field product photography, as well as portraits.\n\nAs far as the actual performance of the AF accuracy, this was also a bit mixed. I felt I had less control over the exact focal point (i used to be able to focus dead on a birds eye much more often with my APS-C setup, despite having fixed focal points) but I am sure this is just a learning curve. I am also shooting on a Teleconverter setup, adapted from EF lenses, so I will not place much of the blame on the camera there. \n\n**Speed**\n\nHere’s the big failgrade on the report card. The continuous burst speed on the R is abysmal. Clocking in at 3fps while tracking in -----> AI !!!  Servo, it is on the same level as my decade-old T2i. Granted, the R is buffering image files over twice the size of my old APS-C, but I would expect more in this department for an upper prosumer-tier price tag. I’m not usually a ‘spray and pray’ person, but this is a huge consideration with birds in flight, resulting in a very hard time tracking/framing the birds. This is due to both slow bursts and the pronounced EVF stutter between shots (often referred to as the ‘stop motion effect’).\n\nI still got some keepers, but they were far less than I would expect I’d see with a faster camera like the R6 or 90D for example. Frankly, I might be able to forgive the speed if it weren’t for the EVF stutter making it hard to keep the subject in frame and in-focus.\n\n**EVF**\n\nA common conversation between DSLR folk jumping into mirrorless, but the EVF was a new experience with many positives and negatives. \n\nFirst off, I love the exposure approximation - adds a good layer of control vs, the standard light meter only in OVFs. \n\nThe fluid AF point selections vs the fixed AF points of OVFs certainly takes some getting used to, especially for bird photography. I think the joystick control of the R5 &amp; R6 really takes this to the next level. \n\nI will admit I suffered “EVF headache” while shooting on sunny days - but given more time I’d like to work with the diopter and, hopefully, give my eyes some more time to adapt. \n\nAs I touched on in the AF section, the shot lag is certainly real. Perhaps if the burst was faster I’d notice it less, but at 3fps is quite palpable and disruptive while tracking action.\n\n**Conclusions**\n\nWhere does this leave my final take? The EOS-R is a wonderful camera, now coming in at an even more affordable price point with the release of big brothers R5 &amp; R6. It captures wonderful stills and crisp video. Plus, the native R-mount lens line keeps blossoming. As an all-around camera, this would be a no-brainer at its current price point of $1,599.\n\nIs it a good budget fit for a wildlife photographer looking to switch to mirrorless? The jury is still out for me on that one, and I return my rental joyfully conflicted. \n\nThe loss of crop factor reach with the FF sensor is palpable, meaning an upgrade to this system would also bring about the need for a lens upgrade to go along with it. While aggressive cropping still yielded somewhat impressively usable results, it also yielded low final resolution specs. I have to wonder how the results would compare to the more megapixel-dense performance of the 90D, that would require much less cropping while (theoretically) retaining more detail. More ‘pixels on the bird’ as they say.\n\nThe AF system is clearly the first incarnation of something Canon looks to have moved further toward perfection with the R5/R6. The burst speed is less than satisfactory, leaving anything other than nearby, stationary birds to have a lower hit rate and harder tracking experience. Frankly, if it wasn’t for this factor I would likely bite the bullet and order both this and a new lens tomorrow. It’s just too big of a factor to ignore outright without testing other options.\n\nThe allure of the R5, with the higher MP count and improved speed/AF system, is high. Unfortunately so is the price - and the need for a longer lens still exists for me there.\n\nI think the next (and likely final) research move for me is going to be a quick rental of the 90D to compare the overall experience before making a final decision. The future may certainly be mirrorless, but until the used market starts to get an influx of R5/6 and RF lenses it also remains a cost prohibitive one for specialist/enthusiast use. With the seemingly eminent release of Canons APS-C R-series entry ([the rumored ‘R7’](https://www.techradar.com/news/canon-eos-r7-prototype-rumored-to-be-in-the-wild-ahead-of-2021-launch)) that may also be something to keep an eye on in early to mid 2021.\n\nObviously a review rooted heavily in compatibility with personal needs, but hopefully it provides some value to anyone in a similar consideration set. \n\nCheers folks!", "link": "https://www.reddit.com/r/canon/comments/klsntg/eosr_2020_review_a_wildlife_photographers/"}, {"autor": "jblizzaze", "date": "2020-06-26 04:44:04", "content": "Samyang/Rokinon 85mm MF 1.4 Rf with Speedlite 470ex------> AI !!!  and Canon RP Issue /!/ I just got the above lens and flash. My issue is when I’m in full auto intelligence bounce mode on the flash the depth of field preview button on my RP (I have the movie button custom set to DOF preview) doesn’t trigger the auto bounce sequence. I have to hit the auto bounce button on the flash itself to trigger it. I switched lenses to my 35mm RF and the depth of field button triggers the flash like it’s supposed to (the button on the flash works too). Anyone else had this issue or can help?\n\nThanks", "link": "https://www.reddit.com/r/canon/comments/hg172a/samyangrokinon_85mm_mf_14_rf_with_speedlite/"}, {"autor": "tifa3", "date": "2020-06-24 15:15:45", "content": "5dmarkiv glitch? /!/ I was shooting pictures with 24-70 mk2 on my 5dmarkiv when I suddenly saw that the top lcd screen showed “M Focus” , even though the lens was always switched to AF mode. I turned it off, reconnected the lens and it was gone. Should I be concerned that there’s an issue with the lens or body? or do you think it’s just a glitch where the camera thought it was on Manual focus? I was also shooting some video on M mode (still using -----> AI !!!  servo) before taking pictures so could this be the cause?", "link": "https://www.reddit.com/r/canon/comments/hf2s3s/5dmarkiv_glitch/"}, {"autor": "chrisfur", "date": "2020-07-16 23:20:51", "content": "Canon 90D Owners: Issue with bottom customization/back button focus. Anyone else have this glitch? /!/ Hi all,\n\nTemporarily renting a Canon 90D to replace my 60D and supplement my 5d4. I have my 5d4 set up to utilize back button focus with the AF-ON button initiating single point focus/one shot AF and the AE-LOCK (\\* button) set to large zone AF/-----> AI !!!  Servo. It works great and is perfect for flipping between the two modes on the fly.\n\nI understand the 90D can't be customized quite as much (although back button focus is still possible), but I did see there is a way to customize the buttons so one of them switches between ONE SHOT &lt;-&gt; AI SERVO/SERVO mode. I tested this binding with my 5d4 using the DoF preview button and it works like you'd expect. Press it once and it switches between ONE SHOT or AI SERVO, depending on what was originally set. There is a sub-option in the 5d4 that allows you to either set this as the new mode or to briefly switch and hold only this AF mode while the button is pressed.\n\nUnfortunately, on my 90D this feature tends to freeze/lock up the camera. Regardless of which button this option was bound to, after pressing it the camera wouldn't take a picture, wouldn't focus, wouldn't let me change any settings/shutter/aperture, etc. It didn't look like anything happened but suddenly nothing worked (never switched from one shot to AI Servo on the top LCD display). The only way to fix it was to either switch to Auto or to turn the camera off/on again.\n\nCanon support wasn't able to help me since the rep only had a 5d4 handy and the manual doesn't say anything much more in-depth about it. There are some combinations of half pressing the shutter (or whatever button is tied to AF) and using this switching mode that occasionally works, but it seems hit or miss and it still freezes half the time.\n\nIs it just my camera? Does anyone else have this issue? Firmware is up to date, but I don't want to mess with too much since it's a rental. I can't check the option on my 60D as it's not a customizable option.\n\nThanks in advance!", "link": "https://www.reddit.com/r/canon/comments/hskq7h/canon_90d_owners_issue_with_bottom/"}, {"autor": "100595", "date": "2020-06-18 14:05:48", "content": "EOS R firmware hack! /!/ If someone who writes C hacked the EOS R firmware to include an option to record 10bit, 4:2:2, 1080p externally using the full sensor (no crop) I’d pay hundreds of dollars for that product.\n\nI know Magic Lantern is the closest potential solution (although there’s no precedent for -----> ML !!!  10bit external), but I can’t help but feel there might be a much simpler solution than designing an entire new firmware and UI.\n\nIs anyone else yearning for 10bit uncropped on their EOS R? The only canon cameras that can do this at the moment are $10,000+", "link": "https://www.reddit.com/r/canon/comments/hbf7vn/eos_r_firmware_hack/"}, {"autor": "BlueCosmo5050", "date": "2020-07-07 07:13:02", "content": "Do any of you use dual pixel AF on the 5D4 for portraits? One shot vs -----> AI !!!  Servo /!/ I am curious how many of you do this? Being that it has no eye AF, in portraits you want the eye to be razor sharp. Does face detect mostly pick up the eye? Or does the small square?\n\nAnother question; How accurate is AI servo? It it accurate enough to just keep it on all the time? I'm speaking about the mirror and live view.", "link": "https://www.reddit.com/r/canon/comments/hmpsyi/do_any_of_you_use_dual_pixel_af_on_the_5d4_for/"}, {"autor": "big0bum", "date": "2020-10-04 11:01:21", "content": "Upgrading to 90D? /!/ Hello,\n\nI want to upgrade from my 70D and I was looking at buying a 90D. I'm not interested in anything but photography, I probably filmed out of curiosity and to test the camera no more than 3 or 4 times with my 70D.\n\nWhat I don't like of my 70D is that the noise in the shadows is pretty bad when you try to push the exposure and I'm also starting to dislike the general noise that the sensor has at high ISO (I was doing some astrophoto this summer). Almost all the lenses I have are designed for APS-C (*Meike 8mm* f/*3.5 Fisheye, EF*\\-*S 10-18mm f*/*4.5-5.6 IS STM, Sigma 17*\\-*50mm f/2.8*, *EF 50mm f/1.8 STM, EF 70-300mm f/4-5.6 II IS Nano USM*), so the only logical thing to do is buying a APS-C sensor again.\n\nWhat I like about 90D is that in all the IQ/ISO tests, it blows my 70D away. This new sensor doesn't have that ugly magenta/green banding when rasing the shadows too much or when shooting at high ISOs. The 90D also has all the functions that I use on my 70D with -----> ML !!!  (intervalometer, focus stacking, and sometimes focus peeking) and some functions that you can find on a mirrorless (I'm interested/curious about face/eye tracking even though I don't do portraits that often). \n\nMy question is: should I upgrade to 90D, should I stay away from it, should I wait more and maybe get one on BF?", "link": "https://www.reddit.com/r/canon/comments/j4x6f4/upgrading_to_90d/"}, {"autor": "MestreJonas_", "date": "2020-11-12 16:00:09", "content": "Vintage glass can be fun! Nikkor 55mm f/1.2 -----> Ai !!!  + EOS adapter", "link": "https://www.reddit.com/r/canon/comments/jsx4fv/vintage_glass_can_be_fun_nikkor_55mm_f12_ai_eos/"}, {"autor": "Talos404", "date": "2020-12-05 05:21:35", "content": "Canon Speedlite 470EX------> AI !!!  Diffuser, where to buy one? /!/ Hello everyone, I recently purchased the Canon 470 AI speedlite from eBay and it did not include the diffuser with it.  I have surged and I can't seem to find anywhere to buy one for this specific model. My boss uses this flash  and I fell in love with it.  He seemed puzzled that mine didn't come with one as well. \n\n Can someone please help me find one?  I'm sorry if this is such an obvious question, I have never owned a Flash before.  Any help would be more than appreciated!", "link": "https://www.reddit.com/r/canon/comments/k71rt9/canon_speedlite_470exai_diffuser_where_to_buy_one/"}, {"autor": "sefds16", "date": "2020-11-25 02:14:25", "content": "Canon t7i won't autofocus as webcam /!/ I'm trying to use my t7i + 18-200mm as a webcam with Canon Webcam Utility, and it won't autofocus, so my video is noticeably out of focus. I've set the AF to -----> AI !!!  servo, and it still doesn't work. How do I get it to autofocus? \n\nThanks", "link": "https://www.reddit.com/r/canon/comments/k0j35d/canon_t7i_wont_autofocus_as_webcam/"}, {"autor": "Spirit-S65", "date": "2020-12-11 06:42:25", "content": "Can anyone recommend some flashes? /!/ I just got this [Neewer soft umbrella kit](https://www.amazon.com/Neewer-Speedlight-ShoeMount-Umbrella-600EX-RT/dp/B01ABFSAPU/ref=pd_rhf_sc_p_img_10?_encoding=UTF8&amp;psc=1&amp;refRID=NZ9PN8G4VXZB8980NG45) to learn strobing, I'm looking for a flash that's around $300 so I can learn. That seems like a fair amount and I may need two. Beyond strobing it's going to be used for general photography, be nice if it was something with a strong enough gn for events but I can always upgrade. It's also needs to work wirelessly, via transmitters but that's a given. \n\nCanon flashes are more expensive than the competition, but [mpb.com](https://mpb.com) has [some used ones for a decent price](https://www.mpb.com/en-us/used-equipment/used-photo-and-video/used-flashguns/used-canon-dedicated-flashguns/) that I wouldn't mind getting. I'm willing to look at third party flashes, only thing that worries me is Canon pulling an SL3 again and removing a pin or something and rendering my kit useless when I upgrade. \n\nThe 470EX------> AI !!!  is interesting because of the auto bounce, which is very convient. Thing is, you can get more powerful flashes used for less than it goes for new, and it may just be worthwhile to learn how to do that on my own. I learned on 35mm cameras, and the Olympus T-20 &amp; Vivitar 283 were a lot simpler than these. I would appreciate some recommendations.", "link": "https://www.reddit.com/r/canon/comments/kaxmsn/can_anyone_recommend_some_flashes/"}, {"autor": "thestickle", "date": "2020-12-18 05:43:08", "content": "How to RAW Video w/o -----> ML !!!  on 5d MK4? /!/ Is there a way to do raw video on 5d mk4 without ML?", "link": "https://www.reddit.com/r/canon/comments/kff849/how_to_raw_video_wo_ml_on_5d_mk4/"}], "name": "Subreddit_canon_01_01_2020-30_12_2020"}