{"interestingcomments": [{"autor": "Br3xx0r", "date": "2019-03-26 21:09:18", "content": "Fujifilm X-T2 | Nikkor 50mm 1.2 -----> Ai !!! -s", "link": "https://www.reddit.com/r/fujifilm/comments/b5vbol/fujifilm_xt2_nikkor_50mm_12_ais/"}, {"autor": "Alonso-De-Entrerrios", "date": "2019-03-25 19:05:59", "content": "Love this cheap setup! Retro version (X-Pro1 + Nikkor 1.8 -----> AI !!! )", "link": "https://www.reddit.com/r/fujifilm/comments/b5ev0p/love_this_cheap_setup_retro_version_xpro1_nikkor/"}, {"autor": "D0ubleZer0", "date": "2019-03-22 12:46:56", "content": "Need feedback about usability of X-T20 vs X-T100 /!/ Hi everyone, this is really important for me and I hope you can help.\n\nUp to this day I've gone through (and still going through) a clunky Samsung mirrorless and some film cameras.  \nI may be young, but I am no beginner also now it might be the time to upgrade and I need your honest opinion.  \n\n\nI mentioned film cameras because I do like the FF depth of field and have learned to love their limits and straightforwardness, but also I've got the feeling that Fuji has some regards to the analog shooter.   \nThis said I do understand that it's not 1982 anymore and it's time to move on.\n\nWhy am I writing this post instead of buying the cheapest camera then? The thing is... I do want to spend my money well and I tend not to upgrade my stuff because photography is indeed expensive for me.  \n\nMy points:  \n- I own a few great old glass to adapt (Zeiss Planar 50mm 1.4 and Yashica -----> ML !!!  35MM 2.8 + various Minolta)   \n- My old glass made me consider the Sony A7, but then I discovered Fuji and MAYBE the possibility of using a speed booster/focal reducer (Kipon makes C/Y to FX. I prefer a 50mm over a 75) + more compact is great and the pop up flash is underrated IMO (the A7 does not have it).\n\n- If I get Fuji I'll probably also get the compact 15-45 kit. I like compact, though adapted lens are not.  \n- I shoot RAW, I would test the famous Fuji jpegs though. \n\nMy concerns:  \n- An enjoyable viewfinder and focus peaking are important to me, my current digital lacks both. How do they compare?\n\n- The  fully ariticulated screen on the X-T100 is DEFINITELY a PRO because I am into self portraits, but on the other hand the (ouch!) more expensive X-T20 seems to have more dials. Does it offer a more enjoyable shooting experience?  \n- Also how fast is changing the iso on both cameras? Do both offer separate dials for the speed, aperture and ISO?\n- Bonus question: Should I go Sony A7 anyway?", "link": "https://www.reddit.com/r/fujifilm/comments/b44nnv/need_feedback_about_usability_of_xt20_vs_xt100/"}, {"autor": "Nyc81", "date": "2019-05-26 13:49:15", "content": "Sunday Fuji GAS Discussion /!/ So I'm at a point where I have sold off some gear and lenses I wasn't using and freed up some funds for new gear that will \"absolutely make me a better photographer\" 😁\n\nCurrently enjoying an xe2 with the 23mm f2 and adapted Nikon 50mm 1.4 -----> AI !!! .  This is a very fun set up, especially with the manual lens.   \n\nSo the options:\n\n1. Fuji 50mm f2 to help when I don't have the time to manually focus.\n \n2.  Other 50ish mm AF lenses?  Any good options?\n\nAnd\n\n1.  Used Xpro2 - BS aside, its really down to the form factor.  OVF would be minimally used.   Could be more stealth for street use.\n\n2.  Used Xt2 - late entry.  Xpro2 guys with easier control access.  Cheaper and more plentiful than xpro2.  Bigger EVF for manual focusing since I really like the split screen focus option.\n\nAt some point looking to throw in a gr2 or gr3 as well bc I'm just miss the GR1 I sold.\n\nThat is all.", "link": "https://www.reddit.com/r/fujifilm/comments/bt843j/sunday_fuji_gas_discussion/"}], "name": "Subreddit_fujifilm_01_01_2019-30_12_2019"}