{"interestingcomments": [{"autor": "Matterchief", "date": "2019-06-30 18:20:02", "content": "How do you guys think \"the art of photography\" will fare in the next 10-15 years in competition with smartphones? /!/ Seeing all these computational photography techniques and being on the verge of zoom lenses built into smart phones, I'm sure we can all imagine a scenario where in 10-15 years, flagship smartphones will have eclipsed even consumer dslrs (in daylight) in terms of the their flexibility and the images they can create. \n\nAs Syndrome put it, \"when everyone is super, no one is\"\n\nDo you guys think that photography as an art will be hurt? Will it thrive? Will we be inundated with pictures that kind of sort of look like they were taken on a \"professional camera\" but upon closer inspection the -----> AI !!!  flaws are clear? Or will good compelling photography always standout? \n\nI'm curious if there will be a push back, similar to the short lived nofilter hashtag with images hashtagged \"noai\" or something similar\n\nI'm also interested in whether you guys think that people will value \"real\" pictures more than AI based pictures.  \n\nLemme hear your thoughts!", "link": "https://www.reddit.com/r/photography/comments/c7hoqi/how_do_you_guys_think_the_art_of_photography_will/"}, {"autor": "kuxkix", "date": "2019-10-17 04:57:01", "content": "Is the iPhone a good camera? Is software and -----> AI !!!  replacing the human component? I took this pic with the Live Photo feature of my iPhone. Then I chose the right pic between the 3 seconds capture. I didn’t have my camera at that moment, but I think the iPhone did pretty well...", "link": "https://www.reddit.com/r/photography/comments/dj1jfg/is_the_iphone_a_good_camera_is_software_and_ai/"}, {"autor": "teacherdave4", "date": "2019-11-23 08:08:56", "content": "Help setting up Godox X2Tc with V860 II &amp; Canon 470EX------> AI !!!  /!/ I can't seem to get my x2t flash trigger to wirelessly communicate with either my Godox flash V860II or my Canon 470EX-AI. I have them on the same group (A) as well as same channel and ID (1).\n\nDo I need additional hardware (transmitter/receiver) for either flashes assuming I don't want to only use optical transmission or should this work as is once I get my settings locked in correctly?\n\nThis is my first post so thank you for any assistance.", "link": "https://www.reddit.com/r/photography/comments/e0f1yd/help_setting_up_godox_x2tc_with_v860_ii_canon/"}, {"autor": "teacherdave4", "date": "2019-11-23 07:55:45", "content": "Help setting up Godox X2Tc with V860 II &amp; Canon 470EX------> AI !!!  /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/e0exzb/help_setting_up_godox_x2tc_with_v860_ii_canon/"}, {"autor": "tupdate", "date": "2019-04-18 05:12:41", "content": "How Africa can benefit from Google’s new -----> AI !!!  lab in Accra /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/behqw2/how_africa_can_benefit_from_googles_new_ai_lab_in/"}, {"autor": "McRedditerFace", "date": "2019-10-17 00:05:11", "content": "DAM Tagging Faces... what *is* a face? /!/ Hey all,  \n\n\nBeen going through my collection of family photos, tagging faces using Digikam.  Digikam, as with many other DAM softwares, includes facial recognition and face tagging.  However it's not exactly 100% accurate, not by a long shot.  \n\n\nAdditionally, a large number of tags were embedded into the meta data by Picassa, and some of those were mistranslated when brought into Digikam, and that required cleaning up.  But others just seem \"off\".  \n\n\nAt the end of the day, what this boils down to is that a large portion of tags weren't generated by Digikam's face-detection alogrithm, and those tags are being used as part of the base set of images which additional tags that are created automagically.  \n\n\nI want to ensure my tags are done right... and I've come up with a really stupid question to something that \\*should\\* be simple... what \\*is\\* a face?  \n\n\nShould a box that encompasses a face include the jawline?  How about the ears?  Is it really just the eyes, nose, and mouth?  \n\n\nShould I  even tag photos that have faces partially obscured, like by someone's arm, or a hat... etc... or does this run the risk of introducing bad data into the dataset the algorithms are pulling from?  \n\n\nWhat if it's a profile view?  How much of a face is still a face?  Two eyes?  One?  What if the eyes are closed?  \n\n\nAnd should I worry about bad tags creating bad data which gets used in the algorithms?  I hadn't initially been worried about this, but what I realized when a number of those tags that were improperly translated into Digikam from Picassa was that the areas they were being \"found\" in other images to detect additional faces.  So if a tag was translated incorrectly and wound up on a specific pattern of fabric, it'd find that kind of pattern all kinds of other places, and find \"faces\", because that was a \"face\" that was already tagged, and the software found similar ones.  The computer's only as smart as the person who programmed it, but it seems -----> AI !!!  is only as smart as the dataset it learnt from.", "link": "https://www.reddit.com/r/photography/comments/diy7tn/dam_tagging_faces_what_is_a_face/"}, {"autor": "its-not-that-bad", "date": "2019-03-22 06:49:07", "content": "I bought and received my -----> AI !!!  photographic assistant, Arsenal. AMA! /!/ I received this new device called Arsenal. Learn more at witharsenal.com and ask me what ever you want to know.", "link": "https://www.reddit.com/r/photography/comments/b41rdz/i_bought_and_received_my_ai_photographic/"}, {"autor": "bmack083", "date": "2019-03-03 13:06:08", "content": "Arsenal vs. CamRanger /!/ Hello all!  Just interested in hearing everyone's opinion on things like the [CamRanger](https://camranger.com/) and [Arsenal](https://witharsenal.com/).  They both seem like very similar products.  Arsenal looks to maybe have more \"smart features\" such as -----> machine learning !!!  and do it for you features, where as cam ranger looks more like an extension of the camera itself or a wireless tethered option.  \n\n&amp;#x200B;\n\nI am asking because I see a personal need in being able to quickly show clients what the back of the screen looks like.  ", "link": "https://www.reddit.com/r/photography/comments/awtu0o/arsenal_vs_camranger/"}, {"autor": "DimitryOle", "date": "2019-07-17 08:58:53", "content": "A (Very) Technical Look at Creating an -----> AI !!!  to Restore and Colorize Photos", "link": "https://www.reddit.com/r/photography/comments/ceaa9i/a_very_technical_look_at_creating_an_ai_to/"}, {"autor": "Nokoti", "date": "2019-10-06 22:23:02", "content": "I need some help. /!/ Recently I got some cheap older Nikkor lenses, which I found out are -----> AI !!!  mount style. My current camera uses an F mount, does anybody have an idea on where I can find an adapter. Thanks for all the help you can give.", "link": "https://www.reddit.com/r/photography/comments/deafvn/i_need_some_help/"}, {"autor": "rprabu1984", "date": "2019-08-31 02:53:52", "content": "License details of Topaz Labs Gigapixel -----> AI !!!  /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/cxqsv4/license_details_of_topaz_labs_gigapixel_ai/"}, {"autor": "lauferko", "date": "2019-11-03 11:04:11", "content": "Topaz Labs Sharpen -----> AI !!! , Denoise -----> AI !!!  worst performance... /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/dqyyed/topaz_labs_sharpen_ai_denoise_ai_worst_performance/"}, {"autor": "Wazie47", "date": "2019-11-12 18:39:14", "content": "Testing -----> AI !!!  upscaling on cropped-in shot of the moon", "link": "https://www.reddit.com/r/photography/comments/dve740/testing_ai_upscaling_on_croppedin_shot_of_the_moon/"}, {"autor": "Wazie47", "date": "2019-11-12 17:43:41", "content": "Testing -----> AI !!!  upscaling on a cropped pic shot with 300mm lens", "link": "https://www.reddit.com/r/photography/comments/dvddw6/testing_ai_upscaling_on_a_cropped_pic_shot_with/"}, {"autor": "10S_NE1", "date": "2019-11-11 23:38:23", "content": "Stand-alone image sharpening software? /!/ I tried Topaz Sharpen -----> AI !!!  and liked it, but before I buy it, I was wondering if there might be something even better out there that will help sharpen photos blurred due to camera stabilization issues and moving subjects.\n\nI use Affinity Photo for my editing and it doesn’t seem to have a sharpening function that works they way I would like it to.  Topaz Sharpen AI gives me a decent result, but the processing is quite slow, and it’s somewhat expensive for a piece of software that really only does one thing.   I also only allows sharpening of the entire photo - I’d prefer software that allows me to select areas of the photos to sharpen.  I’ll buy Topaz if there’s nothing else out there that works as well, but I just thought maybe someone had a better option.", "link": "https://www.reddit.com/r/photography/comments/dv155p/standalone_image_sharpening_software/"}, {"autor": "Sohaib_EL-Sallab", "date": "2019-11-20 13:31:08", "content": "Adobe تطلق تطبيق فوتوشوب الذكي المجاني مع -----> AI !!! ", "link": "https://www.reddit.com/r/photography/comments/dz22xa/adobe_تطلق_تطبيق_فوتوشوب_الذكي_المجاني_مع_ai/"}, {"autor": "afro-hustler", "date": "2019-04-16 17:04:55", "content": "Paxful Teams Up With Jumio To Roll Out -----> AI !!! -Powered Security To Africa’s Bitcoin Economy /!/ [Paxful](https://paxful.com/), a peer-to-peer (P2P) Bitcoin marketplace, has teamed up with[Jumio](http://www.jumio.com/), a digital identity and address verification company in order to improve Anti-Money Laundering (AML) procedures and implement Know Your Customer (KYC) requirements onto the marketplace.\n\nJumio’s AI-powered Trusted Identity Service and verification process will help minimize risk. It will also ensure all users have submitted proper documentation.\n\nJumio’s end-to-end identity verification and authentication technologies will be used to fight fraud. It will also help maintain compliance when onboarding users in order to continue to enrich the community that already exists on the Paxful platform.\n\nBy adding[Jumio’s ID verification](https://www.jumio.com/trusted-identity/netverify/id-verification/)to the platform, Paxful has taken a stance to improve its AML procedures and compliance program in every operating country.\n\nPaxful is constantly improving to protect honest customers in the marketplace. The company boasts a growing community of consumers in Africa. This community’s feedback has been vitally important in advancing security and compliance on Jumio’s peer-to-peer marketplace.\n\nThrough Jumio’s AI-powered Trusted Identity Service, Paxful will now be able to verify customers’ real-world identities.\n\nHow?\n\nWith a simple ID scan and real-time biometric authentication and liveness detection which will go into full effect this April.\n\nPaxful, therefore, will now require users around the world who reach an equivalent of USD $1,500 in trade volume or wallet activity to verify their accounts through ID verification. In addition, users who reach USD $10,000 in trade volume or wallet activity must provide ID verification and address verification.\n\nUpweighted global security team\n-------------------------------\n\nPaxful has also invested in the new Compliance and Information Security team. They have hired Lana Schwartzman as Chief Compliance Officer (CCO). Lana has 14 years of experience in compliance and anti-money laundering.\n\nPrior to joining Paxful, she was a manager in the Regulatory and Compliance Risk Group at Grant Thornton LLP. Her compliance experience included working in Deutsche Bank and Morgan Stanley.\n\nShe will be enhancing the current compliance program and growing the existing compliance team to better serve the needs of Paxful’s customer base.\n\nIn addition to Lana, Dmitry Moiseev also joined the Paxful team as Information Security Manager. Dmitry has over 12 years of experience in Information Security. He’s also an expert in high-risk personal data security in the financial sector. Prior to joining Paxful, he was an Information and Security Manager at Western Union.\n\n“We take compliance and security very seriously here at Paxful. We’re hoping that these and other upcoming changes will help our customers understand the importance of regulation and compliance when it comes to operating on a peer-to-peer finance marketplace,”said Lana Schwartzman, Chief Compliance Officer at Paxful.\n\n“Paxful now reaches over 2 million people worldwide through our P2P trading platform. When operating at such great numbers dedication to strong security measures that align with a future goal of enhanced oversight and compliance, will provide a better customer experience by affording a greater degree of trust and transparency for all customers,” she added.\n\nAbout Paxful\n------------\n\nPaxful’s mission is to give people a simple, fair, and secure platform for trading bitcoin. They aim to bring financial inclusion to the underbanked and unbanked through peer-to-peer finance. Every user gets a free digital wallet that lets them send, receive, and store bitcoin.\n\nThey’re cutting out the middleman with their secure escrow service and provide help to their users with 24/7 customer support system.\n\nAbout Jumio\n-----------\n\nWhen identity matters, trust Jumio. Jumio is the creator of Netverify which enables businesses to increase customer conversions while providing seamless customer experience and reducing fraud.\n\nBy combining the three core pillars of ID Verification, Identity Verification, and Document Verification, businesses now have a complete solution that allows them to establish the real-world identity of the consumer.\n\nLeveraging advanced technology including augmented AI, biometric facial recognition, machine learning, and human review, Jumio helps organizations to meet regulatory compliance including KYC, AML, and GDPR, and definitively establish the digital identity of their customers.\n\nJumio has verified more than 150 million identities issued by over 200 countries from real-time web and mobile transactions. Leading companies in the financial services, sharing economy, cryptocurrency, retail, travel, and online gaming sectors now use Jumio’s solutions.\n\nBased in Palo Alto, Jumio operates globally with offices in the U.S., Europe, and the Asia Pacific. It has also received numerous awards for innovation.\n\n \n\nThe post [Paxful Teams Up With Jumio To Roll Out AI-Powered Security To Africa’s Bitcoin Economy](https://www.afrohustler.com/paxful-jumio-roll-out-ai-powered-security-to-africas-bitcoin-economy/) appeared first on [Afro Hustler](https://www.afrohustler.com).\n\n   \n   \n from WordPress http://bit.ly/2v5CiZb", "link": "https://www.reddit.com/r/photography/comments/bdwdzt/paxful_teams_up_with_jumio_to_roll_out_aipowered/"}, {"autor": "OldTarwater", "date": "2019-04-04 18:16:55", "content": "Nikon Remote Shutter + Continuous Mode? /!/ Hi there,\n\nI am very much an amateur photographer and I was hoping someone could help me figure out if the following is possible. I have a Nikon D7000 and I have a remote shutter release (no cable) and I want to shoot bursts (continuous shots). I know there are specific remote shutter releases that have this capability, but I have the -----> ML !!! -L3. Is there a setting on the camera that I can change to make this happen? Thanks! ", "link": "https://www.reddit.com/r/photography/comments/b9gaev/nikon_remote_shutter_continuous_mode/"}, {"autor": "solomania9", "date": "2019-02-26 16:45:56", "content": "This Site Ranks the Attractiveness of -----> AI !!! -Generated Faces", "link": "https://www.reddit.com/r/photography/comments/av1j6g/this_site_ranks_the_attractiveness_of_aigenerated/"}, {"autor": "anonymoooooooose", "date": "2019-01-21 13:08:41", "content": "Upcoming AMA - Topaz Labs - -----> machine learning !!!  JPEG to RAW conversion software /!/ We've been approached by Topaz Labs to do an AMA, and the topic seem sure to be of interest to the sub!\n\n&gt;  Hi! I'm Eric from Topaz Labs - we make photo enhancement software. Our recent upscaler powered by machine learning was recently discussed on r/photography (pretty vigorously!) here: https://www.reddit.com/r/photography/comments/9nszan/anyone_else_impressed_by_the_software_gigapixel/\n\n&gt;    We're soon releasing a new product that will use machine learning to convert JPEGs to high-quality RAW files. This allows photographers to edit their JPEGs as if they originally shot them in RAW. It sounds pretty unbelievable and I'd be skeptical upon hearing it the first time (as people usually are before they see the results), but the technology actually works.\n\n&gt;    Join us on January 29th for an AMA at 10AM CST! We'll have a good mix of folks answering your questions (here we are: https://imgur.com/a/33dITXj) so feel free to get as technical as you like. We'll be on hand to answer your questions until 5PM CST!\n", "link": "https://www.reddit.com/r/photography/comments/ai9xsu/upcoming_ama_topaz_labs_machine_learning_jpeg_to/"}, {"autor": "giuliomagnifico", "date": "2019-02-02 09:41:36", "content": "How -----> AI !!!  is changing photography", "link": "https://www.reddit.com/r/photography/comments/amcod8/how_ai_is_changing_photography/"}, {"autor": "MacsFineArt", "date": "2019-01-29 17:16:11", "content": "JPEG to RAW -----> AI !!!  versus Adobe RAW conversion /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/al27d2/jpeg_to_raw_ai_versus_adobe_raw_conversion/"}, {"autor": "topaz_labs", "date": "2019-01-29 16:02:55", "content": "Hi, we're Topaz Labs. We believe -----> machine learning !!!  will play a huge role in photography in the next few years and just released an AI-powered tool to upgrade your JPEGs to RAWs. Ask us anything! /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/al1fpw/hi_were_topaz_labs_we_believe_machine_learning/"}, {"autor": "shekel_merchant", "date": "2019-06-15 11:44:55", "content": "Adobe trained -----> AI !!!  to detect facial manipulation in Photoshop", "link": "https://www.reddit.com/r/photography/comments/c0wfv7/adobe_trained_ai_to_detect_facial_manipulation_in/"}, {"autor": "Yelov", "date": "2019-05-09 15:26:26", "content": "What's your opinion on upscaling photos with -----> AI !!! ? /!/ I'm trying it out, the results depend on the photo and resolution of the original file, a few better examples below.\n\n**First:**\n\n[Original](https://drive.google.com/open?id=1h4tWZJOfn8LBFHX0dypJoFpTHrErk8nk) (Google Drive) &lt;- already high res / [Original](https://i.imgur.com/IuKgSjt.jpg) (Imgur)\n\n[Upscaled 2x](https://drive.google.com/open?id=1Z8NOFz5pMgeY7Lx83WagiKeoqHT8kSqB) (Google Drive) &lt;- 60 mpx / [Upscaled 2x](https://i.imgur.com/SIWPH3I.jpg) (Imgur)\n\n**Second:**\n\n[Original](https://drive.google.com/open?id=1qwhaewm8iHHCmc3yZI1GteAEE9HDkFur) (Google Drive) &lt;- cropped a lot / [Original](https://i.imgur.com/q2oRB1W.jpg) (Imgur)\n\n[Upscaled 4x](https://drive.google.com/open?id=1N9Tlljq2rGPSbSjbDZKJnjUjKlepyVnb) (Google Drive) / [Upscaled 4x](https://i.imgur.com/0wVIhfD.jpg) (Imgur)\n\nUsed Topaz Gigapixel.", "link": "https://www.reddit.com/r/photography/comments/bml58t/whats_your_opinion_on_upscaling_photos_with_ai/"}, {"autor": "Ahmednator14", "date": "2019-05-18 07:29:24", "content": "I Need a Lens Adapter /!/ I'm using the Canon EOS Rebel SL2, and the other day I found an old film camera with a Yashica -----> ML !!!  50mm 1:2 lens on it. I was hoping to use it, but can't find any adapters to use this type of lens with my camera. Does anyone know any adapters that will allow me to use the Yashica with my Canon?", "link": "https://www.reddit.com/r/photography/comments/bq1e4x/i_need_a_lens_adapter/"}, {"autor": "Yuqing7", "date": "2019-09-18 15:48:39", "content": "-----> AI !!!  can’t protect us from deepfakes, argues new report", "link": "https://www.reddit.com/r/photography/comments/d5zp3t/ai_cant_protect_us_from_deepfakes_argues_new/"}, {"autor": "jotunck", "date": "2019-10-21 02:17:59", "content": "Where is your line in computational photography? /!/ Between algorithms that make noise go away, make our faces more attractive, automatically HDR / stack exposures / whatever, where is the proverbial line in the sand where you will go \"this isn't photography anymore\"?\n\nAn app that uses -----> AI !!!  and high-resolution image samples to recreate your entire shot as a higher-res, cleaner and sharper image (some of Sony's TVs already have an upscaling algorithm that works like that)?\n\nAn app that replaces dull skies with perfect clouds and lighting?\n\nAn app that does \"astro\" by taking your GPS coordinates and superimposing a starry milky way core as it should be seen from that location and at that time?", "link": "https://www.reddit.com/r/photography/comments/dktrdj/where_is_your_line_in_computational_photography/"}, {"autor": "nextart-io", "date": "2019-10-24 12:33:13", "content": "Came across this new tool allows you to edit high res portrait photos. It seems to use some sort of -----> AI !!!  to edit your expressions. Check it out, could be super useful for editing photos.", "link": "https://www.reddit.com/r/photography/comments/dmfqu9/came_across_this_new_tool_allows_you_to_edit_high/"}, {"autor": "Prickly_Rick", "date": "2019-11-07 17:03:47", "content": "Adobe's About Face -----> AI !!!  can identify if a photo was altered", "link": "https://www.reddit.com/r/photography/comments/dt0lop/adobes_about_face_ai_can_identify_if_a_photo_was/"}, {"autor": "robvann", "date": "2019-11-10 14:07:53", "content": "Stock Photography Marketplace - current state /!/  I am re-assessing the Stock Photography marketplace, after being out of it for a decade. Things seem to have changed a lot.\n\n1. I had good success in the stock photography market in 2000-2010, after reading Rohn Engh's [SellPhotos.com](https://sellphotos.com/) book, getting on major photo buyers lists (Magazines and Publishers) and having diverse regional content. Rohn's site had lots of great tips and contacts that worked well for me. But I think he has retired now. **Is there a new place to go for similar contacts and information?**\n2. **Do photo buyers (Magazines and text books) still buy directly from photographer**s, or do they go through the big photo agencies like Shutterstock, Getty, Alamy?\n3. There used to be two markets. You could sell one photo for $1,000 or sell 1000 photos for $1. The dollar photos needed to be generic images that could be used multiple times for different purposes. Whereas the $1000 ones were very specific to a place and event. **It seems the $1000 photos have dropped in price now, maybe to $100?**\n4. I see that Getty is offering a custom photo option, which is totally exclusive to the customer for no-other re-uses, or licensing, for $200-400. (paying the photographer a small percentage of that). **Is this a common new model?** It seems to be totally opposite to my past marketing approach which meant keeping the rights protected model generating future revenue, for future editions of the same publication. I love getting those requests to please send me an invoice for $1000. :-)\n5. Micro stock players. **Who are the leading micro-stock players?** I have a bit on [CanStock.CA](https://canstock.ca/) which I was hoping would be more Canadian content oriented, but I find them very difficult to deal with. Seems like they use an -----> AI !!!  (artificial intelligence) robot for support.\n6. Is there a \"stock video\" marketplace now, to compliment Stock Photography?\n\nIn case you are curious, my site is [PerfectPhoto.CA](https://perfectphoto.ca/)\n\nAny feedback would be appreciated.\n\n\\- Rob\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cwi1xag59vx31.png?width=287&amp;format=png&amp;auto=webp&amp;s=c6c3c99f2b5c827352c4d92b827dc0572dc54a22", "link": "https://www.reddit.com/r/photography/comments/dubu9n/stock_photography_marketplace_current_state/"}, {"autor": "RickyMario986", "date": "2019-11-26 17:31:49", "content": "Luminar 4: -----> AI !!!  Photo Editor is now up to 75% off", "link": "https://www.reddit.com/r/photography/comments/e219pb/luminar_4_ai_photo_editor_is_now_up_to_75_off/"}, {"autor": "P650SE", "date": "2019-12-18 00:12:26", "content": "Cameras that allow fast switching to a sports-style configuration profile, like 'Recall Custom Hold' on Sony? /!/ Hi. Currently I shoot with a Canon 80D. Most of the time I use apature priority mode to photograph static subjects. \n\nHowever, sometimes I need to quickly switch the camera to a sports-style setup which consists of changing to shutter priority mode and switching to continuous shooting and continuous -----> AI !!! -Servo AF. To adjust all of these settings takes time and it results in me missing shots when a moment of action suddenly comes up.\n\nI am seeking an enthusiast-level mirrorless camera that will allow me to configure profiles of camera settings and switch between them instantly at the push of a button. From a bit of research I found that some of the latest Sony cameras have a feature called 'Recall Custom Hold' which does exactly this. But the A7 series cameras are bigger than I would like (I'm planning to downscale) and I don't particularly like the body style of the A6400.\n\nI'm wondering if there are any other cameras that have a similar feature?", "link": "https://www.reddit.com/r/photography/comments/ec4jl5/cameras_that_allow_fast_switching_to_a/"}, {"autor": "P650SE", "date": "2019-12-18 00:01:51", "content": "Cameras that allow fast switching to a sports-style configuration, like Recall Custom Hold on Sony? /!/ Hi. Currently I shoot with a Canon 80D. Most of the time I use apature priority mode to photograph static subjects. \n\nHowever, sometimes I need to quickly switch the camera to a sports-style setup which consists of changing to shutter priority mode and switching to continuous shooting and continuous -----> AI !!! -Servo AF. To adjust all of these settings takes time and it results in me missing shots when a moment of action suddenly comes up.\n\nI am seeking an enthusiast-level mirrorless camera that will allow me to configure profiles of camera settings and switch between them instantly at the push of a button. From a bit of research I found that some of the latest Sony cameras have a feature called 'Recall Custom Hold' which does exactly this. But the A7 series cameras are bigger than I would like (I'm planning to downscale) and I don't particularly like the body style of the A6400.\n\nI'm wondering if there are any other cameras that can achieve a similar thing?", "link": "https://www.reddit.com/r/photography/comments/ec4evn/cameras_that_allow_fast_switching_to_a/"}, {"autor": "strugglersaladotcom", "date": "2019-03-24 23:05:20", "content": "NVIDIA Latest -----> AI !!!  Software Transforms Doodles Into Photos In Seconds", "link": "https://www.reddit.com/r/photography/comments/b52w0u/nvidia_latest_ai_software_transforms_doodles_into/"}, {"autor": "DanChristan", "date": "2019-03-16 10:23:48", "content": "Polarr, an -----> AI !!!  photo start-up raises an $11.5 million series A", "link": "https://www.reddit.com/r/photography/comments/b1r192/polarr_an_ai_photo_startup_raises_an_115_million/"}, {"autor": "EnjoyFotos", "date": "2019-02-06 15:48:00", "content": "Machine-learning Autofocus vs. Database-driven Metering /!/ In talking about their new EM1X, Olympus says each mode of its -----> AI !!!  autofocus contains tens of thousands of manually tagged images from which the camera \"learns\" how to identify a specific subject. Very neat. \n\nBut for many years, camera manufacturers have used databases of tens of thousands of images in their metering systems ([for instance](https://www.nikonusa.com/en/learn-and-explore/a/products-and-innovation/3d-color-matrix-metering-ii.html)), comparing what the metering sensor sees to the database in order to determine the optimal exposure. \n\nI'm no computer scientist, but these two things seem very similar to me. Why is Olympus (and soon everyone else I'm sure) so cutting edge?", "link": "https://www.reddit.com/r/photography/comments/anrzr8/machinelearning_autofocus_vs_databasedriven/"}, {"autor": "jannne", "date": "2019-02-10 09:22:50", "content": "Lightroom 8.2 to add -----> machine learning !!!  based \"enhanced\" demosaicing method (update was released accidentally, then retracted)", "link": "https://www.reddit.com/r/photography/comments/ap2gpw/lightroom_82_to_add_machine_learning_based/"}, {"autor": "ageowns", "date": "2019-02-19 19:23:15", "content": "Canon 6D won't shoot, unless through App? /!/ I was shooting with my 6D all weekend on a ski trip. It was low 40s (I didn't need gloves at all, artificial snow)\n\nAfter being outside for a few hours, it stopped taking photos. The red square would find something in focus and beep, but when I held down all the way, nothing would happen. \n\n* I turned it off and on, and switched batteries\n* I traded lenses, and pulled the chip out and put it back in.\n* I switched between every possible shooting option (-----> AI !!! /One Shot/Burst/Single shot/manual focus/auto focus/live view/multiple autofocus points, single but moved to the sides, etc)\n* I did auto sensor clean, and then I locked up the mirror for manual cleaning, then switched it on and off again\n* I let it sit and \"get warmed up\" for about 40 minutes indoors\n* I turned on WiFi for remote shooting and it worked great. Even outside again. I could operate it like normal, by clicking the shutter button on my phone.\n\nI looked on Google, and couldn't find a specific answer where I could shoot via the app, but not the shutter button.\n\nIt started working again (on it's own? I don't recall anything specific making it work again) and then I shot indoors the next day with no issues. \n\nThen today it did the same thing and I had to do a paid photoshoot through triggering on my phone.  I played it off as a way to allow the mom watch better.\n\nI went through the whole gauntlet again, hoping something would work. After about 40 minutes or so it seemed to work again. But this time it hadn't been outside in the cold ahead of time. So I don't believe the cold had anything to do with it.\n\n&amp;#x200B;\n\nI'm hoping there is a series of steps I can do to fix this. Factor reset? Has anyone had any similar issues? I'd hate to have to send it in. Even though I have two bodies, this is the one with wifi and I need that capability on my shoots.\n\nThere was no (recent) trauma to the camera, it hasn't suffered any drops or spills. It's older, but this seemed to come out of the blue.\n\n&amp;#x200B;\n\nAm I not googling the issue correctly? The big thing is it works via the app, but not the shutter button, but right now it's fixed.\n\n&amp;#x200B;\n\nIt's working right now. But for how long?\n\n&amp;#x200B;\n\nThank you.", "link": "https://www.reddit.com/r/photography/comments/ase8vl/canon_6d_wont_shoot_unless_through_app/"}, {"autor": "lawsonpix", "date": "2019-02-25 21:05:20", "content": "This Site Ranks the Attractiveness of -----> AI !!! -Generated Faces", "link": "https://www.reddit.com/r/photography/comments/auqcrk/this_site_ranks_the_attractiveness_of_aigenerated/"}, {"autor": "shian243", "date": "2019-03-05 20:51:26", "content": "Colourise.sg Uses -----> AI !!!  to Colorize B&amp;W Photos", "link": "https://www.reddit.com/r/photography/comments/axq1yx/colourisesg_uses_ai_to_colorize_bw_photos/"}, {"autor": "neoofmatrix", "date": "2019-03-09 16:59:14", "content": "My views on upgrading from crop to full frame DSLR /!/ There are thousands of threads around the eternal question of should I upgrade to full frame. I did not want to add one more “hurray I got a full frame thread”.\n\nBut after a few months of using and comparing DX/FX, I hope this could serve for a few D7000 holdouts who are still validating and hopefully help a few who are considering a switch to full frame. To give a bit of background, I have been holding on to D7000, my first DSLR. And looking back, one of the reasons I bought the D7000 was a sagely advise I got on the internet “Buy your second camera first”. There could not have been a better advise. After many years of good service upgrading the D7000 was a challenge. The obvious upgrade candidates were D7200 or D7500 and by way of improvement, they were not compelling enough for me to upgrade.\nThe big draw of D7200 is the extra pixels and competent AF system, whereas D7500 was a mixed bag. It is a mini D500 with some of the high ISO images are astounding. However, barring the sensor and tilt screen, it is not what I was looking for. I could have overlooked the single card slot, but removal of -----> AI !!!  index tab was pretty much unacceptable for me. So, I decided to buy a full frame. \nD610 was ruled out since I wanted better autofocus and D750 seemed like a perfect fit. But the question remained on the associated cost of full frame lenses. For a while I contemplated, but what swung the decision was, I had been shooting pretty much with primes (35 1.8 /50 1.8 /85 1.4 ) out of which the 50 rarely comes out of the bag and the 35 was almost welded . So, it felt natural an upgrade would just mean the body and mostly one walk around lens. I was just hoping I could get a deal during holidays on D750 and waited patiently.\nOut of no-where I stumbled upon an ebay listing for used D810 and the rabbit hole took me to used D800s whose prices have dropped unbelievably low. The D800 meant I did not have to bother about lens as the DX crop would pretty much give me a D7000 image. I took the plunge on a mint D800 and with hardly a few thousand-shutter count, I am more than pleased with my upgrade. Now that I have been shooting with D800, I want to share some observations of someone who upgraded from DX to FX.\n\nHandling:\nWorse than D7000. The grip is not great. I hand held it without strap for a few days and I did not like the heavy and unbalanced body compared to by D7000 which in my opinion was better balanced for my pinky. I bought a holster and it feels a bit better now. The power button and Dpad are smoother, but the shutter sound is not crisp.\nControls:\nI do not like the ISO button placement, but Auto ISO on single flick is great. The metering buttons on D7000 was far better than the controls which are unusable on D800. I just assigned Fn2 for Matrix and leave it on Spot. However, I do not understand how anyone can shoot with this gimped button placement. If anyone knows how one can change ISO or metering modes while looking through the view finder, I will appreciate.\nI preferred the primary knobs of D7000 for its simplicity but not much to complain as I usually shoot Manual mode/single. Fortunately the AF selector works the same. So does exposure compensation. Overall, it’s a Nikon you expect it to be.\nAutofocus:\nComing from D7K, which has more mood swings than your pregnant wife, the AF is predictable. However, I can see the left AF issue is pretty strong to a point I cannot use 3D AF. I think the bad rap that Nikon got for D600 was deserved. After acknowledging the Left AF issue, Nikon never issued a service advisory for D800. Does it impact my shooting? Yes, I am forced to be conscious which I prefer not to be. But it is better than D7K.\nFirst impressions:\nIt is not faster or slower than D7000, I rarely go to CL/CH with D7K, but I think 4fps is not fast at any stretch so not worth switching. I was expecting to be blown away by the view finder, but it was just marginally better.\nWhen I realized it did not have an IR trigger, I could not believe it. At only $400 Nikon was offering a laughable solution. I plan to shoot tethered rather. (Connecting to digicam control and a powerpoint remote seems good to go).\nBattery life is worse. With the D7000; I never had to worry about charging my battery. But D800 is comparably half the endurance.\n\nIf you read this far, you would have assumed, I am mostly neutral or indifferent to the camera. But I wanted them to get out of the way before I say how much I like the D800.\nLens Image Quality:\nWhen I took the decision to upgrade, my primary reason was; an upgrade to full frame will also improve upon my lenses. So essentially it will be a body + lens upgrade. But I was not prepared to see the quality of files that I managed to get.\nSimply put, as I shot mostly portraits, I was able to get the shots I liked with way less effort I used to put on D7K. And this was not an exaggeration. The neglected 50mm suddenly became a thing of beauty. The 35DX was surprisingly sharp and crisp with acceptable vignetting (which I prefer for portraits). But the true revelation was the 85 1.4. It is the ultimate combination with full frame for portraits.\n\nDynamic Range:\nComing from D7000 it is not a day and night difference, but I can clearly see D800 holding up incredibly well for pushes in post processing. I have pretty much switched over to darktable/Gimp with D800 and I manage to get a lot better colors compared to D7000. \n\nColor, Sharpness and Tonality:\nI sometimes shoot jpeg small at 9MP and the images are sharp and crisp compared to my D7K raws. I am not very keen on sharpness usually, but I am impressed at D800 raw. It is not just the sharpness, but the beautiful roll over of tonality is a delight. I never saw any follies on my D7K until I compared it with D800. Now I know why some full frame users scoff at DX.\nBut what pleases me the most is the color. I no longer have to fight the jaundice that plagues skin tones from D7000. This is particularly true for images that are slightly out of focus where D7K used to demonstrate weird color shifts. This is the single most important advantage I relish with the upgrade.\n\nSo do I recommend an upgrade to full frame for anyone shooting DX ?\nI know this might sound a bit cliché but if you have to ask, you should not upgrade. Sometime about a couple of years ago, I took a photo in low light which I was both proud of and knew I would have gotten better if I had a full frame. I thought about it a long time and decided to watch over what I shoot. I limited my shutter count to ensure I get the shot right as much as possible. I knew I had come to the edge of what my camera can do and I made the decision to upgrade.\n\nI remember moving from point and shoot to DSLR and was underwhelmed at my inability to get the best out of D7K. It took a lot of practice and I did not want to repeat the same mistake. But at the current prices, a used D6xx or D800 are absolute no brainers. It costs lesser than a D7500 or even D7200 (though new vs used). Have a go and give yourself a treat. What if you prefer to buy only new? I suggest just wait. The age of sub $1000 full frame cameras are already here and it will only get better in the short term before bouncing away. Unless you are at the edge of what you can get out of DX, you may not appreciate much of what FX gives. It might sound a bit hypocritical. But remember it is only a small percentage of images you will see the difference between FX vs DX.\n\n\n", "link": "https://www.reddit.com/r/photography/comments/az5hoy/my_views_on_upgrading_from_crop_to_full_frame_dslr/"}, {"autor": "apolinariosteps", "date": "2019-01-02 21:58:09", "content": "I created a bot that selects a random photo from Wikipedia and colorizes it via -----> machine learning !!!  /!/ For all photo colorization enthusiasts, I created a bot that simply look for a random black &amp; white photo on Wikipedia, colorizes it automatically with a deep learning algorithm and posts it to this Twitter account: [https://twitter.com/wikicolorize](https://twitter.com/wikicolorize)\n\n*Processing img 9fnky99qz2821...*\n\nI think it is a nice way to observe state of the art automatic colorization with real examples extracted from a Wikipedia's vast royalty-free photo library ", "link": "https://www.reddit.com/r/photography/comments/aby9b3/i_created_a_bot_that_selects_a_random_photo_from/"}, {"autor": "delta_p_delta_x", "date": "2019-01-05 11:28:54", "content": "The rise of -----> AI !!! -powered bokeh...", "link": "https://www.reddit.com/r/photography/comments/acteqm/the_rise_of_aipowered_bokeh/"}, {"autor": "r16051studio", "date": "2019-01-31 02:25:53", "content": "Free trial -----> AI !!!  gigapixel watermark or error?", "link": "https://www.reddit.com/r/photography/comments/alkp20/free_trial_ai_gigapixel_watermark_or_error/"}, {"autor": "cryptoz", "date": "2019-01-31 16:01:20", "content": "How -----> AI !!!  is changing photography", "link": "https://www.reddit.com/r/photography/comments/alqwkc/how_ai_is_changing_photography/"}, {"autor": "Tobin79", "date": "2019-01-28 08:46:13", "content": "Will there be any photography jobs left in 10 years? /!/ Redditors and especially pro photographers. Where do you think the business of photography will be in 10 years with -----> AI !!!  and everyone having access to a good camera on their phone? What sort of jobs will be left?", "link": "https://www.reddit.com/r/photography/comments/aklmna/will_there_be_any_photography_jobs_left_in_10/"}, {"autor": "heheyu2018", "date": "2019-05-08 03:28:57", "content": "-----> AI !!!  help you gray photo /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/bm0d6z/ai_help_you_gray_photo/"}, {"autor": "takingpictures09_12", "date": "2019-05-07 07:06:41", "content": "Do you think -----> AI !!!  will replace advertising photography completely one day?", "link": "https://www.reddit.com/r/photography/comments/blnlck/do_you_think_ai_will_replace_advertising/"}, {"autor": "atomlib_com", "date": "2019-07-15 13:26:55", "content": "-----> AI !!! -based photo restoration: defects removal, inpainting, colorization", "link": "https://www.reddit.com/r/photography/comments/cdhghg/aibased_photo_restoration_defects_removal/"}, {"autor": "ITheodorou", "date": "2019-10-04 09:59:32", "content": "Introducing Adobe Photoshop Elements 2020 and Premiere Elements 2020 with new -----> AI !!!  features | Adobe Blog", "link": "https://www.reddit.com/r/photography/comments/dd599x/introducing_adobe_photoshop_elements_2020_and/"}, {"autor": "matamatamaro", "date": "2019-08-10 09:13:50", "content": "Are any pros using some non-mainstream RAW handling software? /!/ I am just curious about if any pro (doing photos for living / business) using other software than mainstream Lightroom / Capture1 or any other \"heavy\" hammer. Are some of pros using some Silkypix, nama5, RawTherapee, darktable or other \"light\" software or opensource software. If yes, are you using other software to do some post-processing after post-processing ? :) for example removing objects from photo if your software is not capable of doing so ? What is you workflow? Do you use some -----> AI !!!  powered tool to sort many photos by \"sharp one / blurry one\" or \"good composition / waste\" ?", "link": "https://www.reddit.com/r/photography/comments/cofvbe/are_any_pros_using_some_nonmainstream_raw/"}, {"autor": "Tb582", "date": "2019-08-15 23:04:45", "content": "-----> AI !!!  based organization /!/ Hi - I’ve tired searching the net for decent AI based photo recognition and organizing but haven’t really found much... \n\nI want something that does faces, objects, etc but doesn’t require storing photos in said apps cloud.\n\nThinking about maybe just using the Amazon Rekognition api. But would be nice if there was software out there that already handled this.", "link": "https://www.reddit.com/r/photography/comments/cqxllj/ai_based_organization/"}, {"autor": "armharm", "date": "2019-11-09 00:17:30", "content": "Sony A6000 vs iPhone 11 Pro /!/ My wife just got the iPhone 11 Pro and I'm amazed at how nice the pictures come out on it. I'm having a hard time competing with my Sony A6000. Even though the bokeh is totally fake on the iPhone, it still looks really good. The colors seem to pop more on it as well. \n\nI'm using the Sigma 16mm f1.4 and Sony 35mm f1.8 lenses mostly. \n\nDo I just need to improve my skills? Shoot three pics and blend for HDR? Start editing my shots to compete with the iPhone's -----> AI !!! ? Give up and move to full frame?\n\nLet me know what you guys think.", "link": "https://www.reddit.com/r/photography/comments/dtofd2/sony_a6000_vs_iphone_11_pro/"}, {"autor": "NeverStopWandering", "date": "2019-11-18 18:46:16", "content": "Luminar 4 launched today --- I did an in depth first look and review /!/ TLDR; for single photo editing, it is my go-to software. I haven't tried with large catalogs, I use LR6 for that. It is easy to interface face between them (via right-click, edit in...). It has a lot of cool features. The newest is -----> AI !!!  Sky Replacement, it's pretty impressive --- I went through about 15 different skies in the video, and even edited a final product with a new sky (crazy!)...   \nSee that photo [here](https://web.500px.com/photo/1006382155/last-light-by-eric-james-mcdermott?ctx_page=1&amp;from=user&amp;user_id=1002905252)  \nSee the review [here](https://www.youtube.com/watch?v=5jJoYClsvN8)\n\nHappy to answer any additional questions on the YouTube video or here on Reddit, too.", "link": "https://www.reddit.com/r/photography/comments/dy7e9k/luminar_4_launched_today_i_did_an_in_depth_first/"}, {"autor": "Not-Oliver", "date": "2019-11-29 08:24:40", "content": "A great app for many photographers. It’s name is Dreamscope and it is great for using -----> AI !!!  filters to add detail to your photo. Presenting my masterpiece “la vita fa schifo, borse pesanti” or just a photo of me carrying plastic bags.", "link": "https://www.reddit.com/r/photography/comments/e3c14v/a_great_app_for_many_photographers_its_name_is/"}, {"autor": "SmallHoneydew", "date": "2019-12-12 18:11:28", "content": "My camera is a little bit racist /!/ I am the proud owner of a new Nikon Z6 which I am tremendously enjoying. Since last week I have been taking pictures at a big international conference that I have been attending for my work - speakers, interventions from the floor, informal groups of people on the periphery, a few more formal group photos. Face focus and eye focus are great for this, especially when you want to pick out an individual in a crowd using a shallow depth of field.\n\nThe conference was incredibly diverse, with attendees from pretty nearly every country in the world. And it has been impossible not to notice that the face identification is terrible at recognising the faces of people with brown skin. Over and over, I have had to switch to other focus modes to focus on a non-white person. This morning I was no more than three metres from a gentleman from Zambia, who stood up from his chair to make a statement; the camera picked out the smaller, more distant faces in the background, but absolutely refused to recognise him as a person with a face even though he was right in front of me - just an example, and there have been so many over the past days.\n\nCoincidentally I read [this article](https://www.theguardian.com/technology/2019/dec/12/ai-end-uk-use-racially-biased-algorithms-noel-sharkey) on the bus home, in which an -----> AI !!!  specialist discusses the biases built into -----> AI !!!  systems and suggests that they should be subject to the same rigour of validation as pharmaceutical products. This doesn't seem like a bad idea.\n\nNikon, I hope you read this subreddit, and I hope you might consider looking at this. I have no reason to think this is a problem particular to Nikon products, and I love the Z6, so this isn't intended to call you out particularly. But it is an astonishingly obvious problem for me, and presumably for anyone who would like to take photos of non-white people. And perhaps it could be an opportunity for you. Want to be the first camera company with verifiably inclusive software?", "link": "https://www.reddit.com/r/photography/comments/e9r7r8/my_camera_is_a_little_bit_racist/"}, {"autor": "eij-", "date": "2019-12-14 23:54:42", "content": "A tiny dragonfly (Micro Nikkor -----> AI !!! -S 200mm f4 on APS-C)", "link": "https://www.reddit.com/r/photography/comments/earfbi/a_tiny_dragonfly_micro_nikkor_ais_200mm_f4_on_apsc/"}, {"autor": "vivawired", "date": "2019-12-03 18:42:49", "content": "Best way to automatically add keywords to over 30,000 photos? /!/ My predecessors at my current position has not done a great job of naming/categorizing pics in the past and we have over 30,000 photos. Is there some type of -----> AI !!!  software that can scan pictures and then add umbrella keywords to the images? \n\nFor example, if I'm looking for basketball game photos from some club event that happened 8 years ago, I want to be able to type in \"basketball\" and the software will show basketball related images.", "link": "https://www.reddit.com/r/photography/comments/e5liz1/best_way_to_automatically_add_keywords_to_over/"}, {"autor": "wasthespyingendless", "date": "2019-01-02 17:44:20", "content": "I anyone interested in a program that uses -----> AI !!!  to help keyword photos?", "link": "https://www.reddit.com/r/photography/comments/abvmpd/i_anyone_interested_in_a_program_that_uses_ai_to/"}, {"autor": "RiceFarmersAU", "date": "2019-07-19 23:34:05", "content": "Canon 7D Tracking Help /!/ I am trying to track objects in the viewfinder in AF Point Expansion, however the focus points are not moving. The focus points only move when it is set to AF Single Point. I have the initial focus points towards the left, and have the object move towards the right. The focus mode is in -----> AI !!!  Servo as well, with focus sensitivity at max. \n\n\nI am using the Canon 7D Mk1, Canon 50mm f/1.8. Any insight on how I can track with AF Point Expansion is appreciated :)", "link": "https://www.reddit.com/r/photography/comments/cfexsu/canon_7d_tracking_help/"}, {"autor": "bartekrutkowski", "date": "2019-09-20 16:14:56", "content": "100,000 free -----> AI !!! -generated headshots put stock photo companies on notice", "link": "https://www.reddit.com/r/photography/comments/d6x6lr/100000_free_aigenerated_headshots_put_stock_photo/"}, {"autor": "PieCake1234", "date": "2019-08-12 00:04:22", "content": "I want to buy a DSLR but dislike editing photos(lightroom, photoshop). What DSLR/lens is right for me? /!/ I want to take better photos than my iPhone of my car hobby but I really dislike editing photos using light room or Photoshop. Thinking to automatically let Google Photo's -----> AI !!!  edit them. What DSLR should I buy? I was thinking to either do a good starter Canon T7i kit or maybe go all in and get a Nikon D850? Not sure if it's worth triple the price on the D850 if I'm not truly editing photos?", "link": "https://www.reddit.com/r/photography/comments/cp4jmr/i_want_to_buy_a_dslr_but_dislike_editing/"}, {"autor": "m4xw311_d", "date": "2019-11-05 17:39:15", "content": "Is there any -----> image recognition !!!  software that might assist in photo archiving? /!/ Hey everyone,\n\nI am an archivist for a photographer. This means I am in charge of organizing his entire body of work which ranges from the mid-1950s to present. I am hoping someone can offer a short cut to one of my most time-consuming tasks.   \n\n\nI should start with some context. We identify each project with a number, beginning with the year, followed by the job number, followed by the roll number, and followed by the negative number of that role. So say it's the 15th project he did in 1967, the project number would be 67-15, then if I am identifying a single image, let's say on the 34th roll and it's the 15th negative of that roll, it would look like this 67-15-034-15.   \n\n\nThis actually has served me well as far as identification goes, the only thing I have added is a 3 letter abbreviation identifying the project at the end. For example, if it was for the New York Times it would read \"67-15-034-15 NYT\".  \n\n\nNow here lies the problem. For every project, there are x number of prints. All of these prints have been photographed. We then scan the negative rolls of each project at a relatively low-resolution jpeg to serve as a digital contact sheet. The issue is that the prints are not identified by negative numbers, and they need to be. Up until now this has meant going through all the negatives of a project, some of which have hundreds of rolls attached with an approximate average of at least 30 individual negatives per roll, and trying with my own eyes to identify an individual image. As you can imagine, this takes me hours and as my rate is not super low and I'd like to save my boss some money. \n\nI am hoping there is some sort of image recognition software that would allow me to ingest image files, and identify the individual images among the scans of the negative rolls. I am not so hopeful that there is any sort of consumer-grade software like this but I thought it couldn't hurt asking.   \n\n\nSorry if this is extremely hard to follow. If you have any questions, I can try to explain better.", "link": "https://www.reddit.com/r/photography/comments/ds2lfk/is_there_any_image_recognition_software_that/"}, {"autor": "spot4992", "date": "2019-11-28 06:27:54", "content": "Topaz -----> AI !!!  Coupon Code /!/ Anyone happen to have a coupon code for the Topaz AI site? I am really interested in their products, but even with the Black Friday deal, it is still too expensive for me.", "link": "https://www.reddit.com/r/photography/comments/e2tz0x/topaz_ai_coupon_code/"}], "name": "Subreddit_photography_01_01_2019-30_12_2019"}