{"interestingcomments": [{"autor": "Zapum", "date": "2018-03-14 10:20:00", "content": "Canon 7Dmk2 With EF100-400 L IS USM II /!/ Hi all,\n\nI'm hoping to upgrade my 300 F4L to the EF 100-400mm f/4.5-5.6 l is ii usm this weekend.  \n\nHowever, I just have one question for those using this combination.\n\nAssuming I meet all the other requirements for 10fps in -----> AI !!!  Servo (shutter, Aperture etc), is this lens capable of achieving 10fps in Ai Servo?\n\nI know my 300 F4L isn't (unless in One-Shot AF) and the manual states this is the same for the EF 100-400mm f/4.5-5.6L IS USM (I assume this means just the original version isn't capable in -----> AI !!!  Servo?)\n\nIts quite a layout money-wise for me so I want to make sure it will do as I hope.\n\nMany thanks in advance.\n\nEdit:  Happily purchased the new lens anyway.  Roll on weekend!:)", "link": "https://www.reddit.com/r/canon/comments/84catk/canon_7dmk2_with_ef100400_l_is_usm_ii/"}, {"autor": "IseeMORONS", "date": "2018-03-06 17:24:48", "content": "Preferred focus methods on a 6D in low light? /!/ I'm hoping to get some advice on how to shoot fast moving subjects in lower light. My setup is a 6D (original) with 10-year old Tamron 70-200mm f/2.8. Subjects are essentially dancers inside a school gym, so I pretty much shoot manual with the settings at 3200 iso, f/2.8, and 1/400th. I use BBF.\n\nI haven't had much time with the 6D, so I've carried over my focusing habits from the 30D/40D/60D I had before this. With those other cameras, I wasn't happy with the focus point selection or the hit-miss ratio of using -----> AI !!!  servo or -----> AI !!!  focus, so I still do the following:\n    1. I use \"one shot\" focus mode and just refocus for each shot (should I change this?)\n    2. I use center auto point focus only (should I change this?).\n\nRight now, I get about 75% with acceptable focus, so I'd like a better keeper ratio. It's also tiresome to refocus for every shot. I also realize much of this is also a factor of the slow focus on the Tamron lens.\n\nI realize these are basic questions and I might have to just experiment. But my kid's events are coming up and I'd hate to experiment and have the shots come out like shit.\n\nSo, what's your preferred focus setup in these situations.", "link": "https://www.reddit.com/r/canon/comments/82gsma/preferred_focus_methods_on_a_6d_in_low_light/"}, {"autor": "Wander54321", "date": "2018-06-26 03:58:14", "content": "Shutter priority in -----> AI !!!  Servo Mode (Canon EOS 5D Mark II) /!/ I own a canon EOS 5D Mark II and I am writing this message to ask for your help with the AI Servo autofocus mode. I heard that most modern DSLRs have either focus priority or shutter priority in autofocus modes such as AI servo. The camera waits until focus is achieved before activating this shutter in focus priority. The camera activates the shutter before proper focus is achieved in shutter priority.\n\nHow do I set my 5d Mark II for shutter priority in AI Servo mode?\n\nThank you in advance!", "link": "https://www.reddit.com/r/canon/comments/8twxva/shutter_priority_in_ai_servo_mode_canon_eos_5d/"}, {"autor": "bay-to-the-apple", "date": "2018-09-02 03:23:13", "content": "Anyone use \"focus priority\" for 1st/2nd Image Priority (instead of equal) with -----> AI !!!  Servo? /!/ Just curious if anyone here uses \"focus priority\" with the custom functions on a 6D, 7D, etc.  I'm trying to get more in-focus images when shooting my toddler and his friends/cousins (all under the age of 5) who rarely sit still.  I often have a bunch of soft images when shooting AiServo since the subjects keep moving around.  Sure I'll have much fewer shots but hopefully they will all be in focus.\n\nSo does anyone just always use \"focus priority\"?  Or is it better to just use the equal/neutral setting?  \n\nI haven't tried seeing the tracking acc/deceleration settings yet but wanted to start with focus priority.\nI understand that AiServo needs a decent amount of light to quickly get into focus when shooting fast and One Shot is better in low light.\n\nCanon 6D with 85mm f1.8 Tamron / 35mm f2 canon\nThanks in advance!", "link": "https://www.reddit.com/r/canon/comments/9c94fl/anyone_use_focus_priority_for_1st2nd_image/"}, {"autor": "IseeMORONS", "date": "2018-10-18 03:24:50", "content": "My 80D is arriving in a couple days. Should I change my habits? /!/ First DSLR I had was the XTi 10 years ago. Current DSLR is 6Di. Before that, the most modern Canon DSLRs I've had were the 60D, and T5i. Because of their limited focus points, and the inaccuracy of the non-center focus points, and other reasons, here's my practice for the last few years: \n1. Back button focus using the center point only, then recompose.\n2. Shoot full manual, exposing for the highlights. (Very rarely use aperture priority.)\n3. RAW\n\nI briefly played around with the 77D that I temporarily had, and realized how much more accurate, faster, and smarter the auto focus was. But didn't have it long enough to figure out if I should rely on some of more advanced focus options.\n\nSo, basically I'm looking for advice so I can shortcut the trial and error learning curve as far as the best autofocus method for the 80D. So here are my questions: \n1. If I'm shooting static subjects, I'll probably stick with with my center-focus point and recompose, because I figure there's no harm in that, right?\n2. If I'm shooting dynamic subjects, is there another focus point selection method I should use?\n3. If I'm tracking a subject coming at me or away from me, which -----> AI !!!  focus mode do you suggest?\n4. Anything other habit I should change coming from older Canons?", "link": "https://www.reddit.com/r/canon/comments/9p5ipc/my_80d_is_arriving_in_a_couple_days_should_i/"}, {"autor": "Jennifer_go1", "date": "2018-02-26 09:27:12", "content": "A camera gadget makes DSLR cameras point-and-shoot through -----> AI !!! ", "link": "https://www.reddit.com/r/canon/comments/80btej/a_camera_gadget_makes_dslr_cameras_pointandshoot/"}, {"autor": "codek_prod", "date": "2018-02-19 05:54:56", "content": "Magic Lantern Questions /!/ So I’m currently switching back to Canon from Sony. I’ll have a 60d within a week and I have a few questions.\n\nI want -----> ML !!!  mostly for video, can I record 1080p@60fps without RAW? (I bought a fast card but I’m curious how long it’ll last without raw.)\n\nAlso, what’s the easiest way to convert the raw footage if I decide to go that route?\n", "link": "https://www.reddit.com/r/canon/comments/7ykkn5/magic_lantern_questions/"}, {"autor": "the_watchkeeper", "date": "2018-03-31 19:39:45", "content": "Is there a problem with using -----> AI !!!  Servo for still subjects? /!/ I use back button focusing on my 6D and my subjects are sometimes stationary, sometimes moving. Is there any disadvantage to leaving it in AI servo mode? ", "link": "https://www.reddit.com/r/canon/comments/88l3nh/is_there_a_problem_with_using_ai_servo_for_still/"}, {"autor": "Nanatitesue", "date": "2018-08-26 02:49:42", "content": "Reasons not to buy a 470EX------> AI !!! ? /!/ I'm thinking about getting a Canon Speedlite 470EX-AI and I think that it looks like everything I need in a flash. Are there any reasons to get another Canon Speedlite (that's around the same price) over the 470EX-AI?", "link": "https://www.reddit.com/r/canon/comments/9acgix/reasons_not_to_buy_a_470exai/"}, {"autor": "GeneralGenital_", "date": "2018-11-05 12:27:06", "content": "[EOS 750D] Is there a workaround for the 30 minute recording limit? /!/ I‘m using the 750D with live view and OBS to record stuff. As most DSLRs sold in Europe it turns off after half an hour. MagicLantern isn’t available for this model, a capture card wouldn’t deactivate the turn off and software like SparkoCam would be my last resort, because it has s such a bloated program. Maybe anyone had the same issue and found another solution. I would be glad to hear it.\n\nIf this post is violating the sub rules for mentoning -----> ML !!! , sorry. I’m on mobile and can’t see the sideinfo. I will delete the post asap.", "link": "https://www.reddit.com/r/canon/comments/9ud2x1/eos_750d_is_there_a_workaround_for_the_30_minute/"}], "name": "Subreddit_canon_01_01_2018-30_12_2018"}