{"interestingcomments": [{"Unnamed: 0": 225683, "autor": "TDIGUY15", "date": 1585426880000, "content": "Flooded Yard /!/ Looking for some input, second year in our house now and second year the yard is flooding like this. Last summer I couldn't cut the grass until June in this area without getting stuck in the mud on the tractor. I have a long but narrow yard 100x900 and no access to connect to any drainage line or ditches on my property since I can not get to them. To the front, my house is almost to the property line on one side and my cement driveway is on the other so no room to get through without causing damage. To go to the back of the property I would need to cut through my forest and likely lose a bunch of trees which I would like to avoid.\n\nThe neibourgh to the left does have a drainage run from the barn out back to the road out front and I plan to ask if I can tie into it but have not had a chance to talk to him yet and not sure if it would even be possible to tie into it.\n\nLooking for ideas for a quick fix now to get rid of the water if possible as well as a long term plan to properly stop the flooding. \n\nTo the left of the picture I would like to add an additional garage/barn in the future just behind the current cement pad which is where the flooding is the worst of course.\n\nhttp://imgur.com/a/Hj9t7GG\n\nNot sure how much I can do this year since I am in the middle of a full basement renovation but I would like to get started on coming up with a plan for how to address this.", "link": "https://www.reddit.com/r/lawncare/comments/fqrpma/flooded_yard/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "flooded yard /!/ looking for some input, second year in our house now and second year the yard is flooding like this. last summer i couldn't cut the grass until june in this area without getting stuck in the mud on the tractor. i have a long but narrow yard 100x900 and no access to connect to any drainage line or ditches on my property since i can not get to them. to the front, my house is almost to the property line on one side and my cement driveway is on the other so no room to get through without causing damage. to go to the back of the property i would need to cut through my forest and likely lose a bunch of trees which i would like to avoid.\n\nthe neibourgh to the left does have a drainage run from the barn out back to the road out front and i plan to ask if i can tie into it but have not had a chance to talk to him yet and not sure if it would even be possible to tie into it.\n\nlooking for ideas for a quick fix now to get rid of the water if possible as well as a long term plan to properly stop the flooding. \n\nto the left of the picture i would like to add an additional garage/barn in the future just behind the current cement pad which is where the flooding is the worst of course.\n\nhttp://imgur.com/a/hj9t7gg\n\nnot sure how much i can do this year since i am in the middle of a full basement renovation but i would like to get started on -----> coming !!!  -----> up !!!  -----> with !!!  a plan for how to address this.", "sortedWord": "None", "removed": null, "score": 1, "comments": 4, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/fqrpma/flooded_yard/", "identifyer": 225683, "year": "2020"}, {"Unnamed: 0": 227111, "autor": "Jessalelo", "date": 1602711431000, "content": "How do I Fire the Lawn Guy I Never Really Hired? /!/ Seriously. I don't even know what to say to him anymore.\n\nMy husband left to go work out of town for a year (yes a year - military but not deployment.)\n\nWe had discussed in the past I might get a lawn/yard person while he was gone because that was generally his job, and I REALLY hate bugs (and Virginia is rampant with them...)\n\nAs it happened this 19 yo \"kid\" knocks on my door later in the day after my husband's flight leaves. He asks if I want my lawn mowed. I'm in no mood to do anything much less yardwork so \"Sure that'd be fantastic!\" He asks me for some water and I get it and go outside to show him the back yard too, asking what he'd charge for both. He has no clue and says \"I just ask that it be fair\" (I've never hired a yard person, I've no clue what's fair.) And I'm talking to him about maybe needing help on a more regular basis but wasn't fully sure yet, he's on board. I'd offered $40 for just the little front portion and to weed whack it (which didn't happen because I couldn't get it started but gave him the full $40 anyway.)\n\nOn my way back from locking up my back yard, I see the bottle of water on the trunk of my car. Not too big a deal except don't touch my car... my loves go in this order - husband, dog, car... don't touch my car. Didn't say anything, didn't want to be rude.\n\nKid gets done, I pay him, and he asks if I've got gas to fill his mower. I was shocked, but had some and filled it because hey, it's hard starting out, right? I tell him I'll let him know if I need him again and get his number and give him mine.\n\nA few days later, he calls me and asks to borrow my weed whacker to use on someone else's yard.\n\nAre. You. Kidding? I said no, pretty sure my husband wouldn't be happy if anything happened.\n\nThe next time he texted, I told him I was going to take care of the yard because I was short on money (not a lie, I put everything extra we get towards paying off debt and he caught me between paydays.)\n\nToday he texted me and asked if I wanted my lawn mowed.\n\nI just did it Friday (albeit on high because I didn't want to scalp my lawn.) When I said I'd just done it this weekend, and then asked if he'd come up with a figure for doing the front and back yard, the response I got was this:\n\n\"I’ll do 35 or 40 your choice and I’ve seen your yard today I’ve had to walk to pass to get to another consumer but just let me kno when if those are good prices for you.\"\n\nI just don't want anything to do with this moochy entitled kid. But I am having an issue with coming up with a tactful way to tell him to lose my number.\n\nTl:dr entitled kid wants to get paid to mow my lawn and seems to think (or at least imply) I'm lying about doing it myself.", "link": "https://www.reddit.com/r/lawncare/comments/jba6ec/how_do_i_fire_the_lawn_guy_i_never_really_hired/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how do i fire the lawn guy i never really hired? /!/ seriously. i don't even know what to say to him anymore.\n\nmy husband left to go work out of town for a year (yes a year - military but not deployment.)\n\nwe had discussed in the past i might get a lawn/yard person while he was gone because that was generally his job, and i really hate bugs (and virginia is rampant with them...)\n\nas it happened this 19 yo \"kid\" knocks on my door later in the day after my husband's flight leaves. he asks if i want my lawn mowed. i'm in no mood to do anything much less yardwork so \"sure that'd be fantastic!\" he asks me for some water and i get it and go outside to show him the back yard too, asking what he'd charge for both. he has no clue and says \"i just ask that it be fair\" (i've never hired a yard person, i've no clue what's fair.) and i'm talking to him about maybe needing help on a more regular basis but wasn't fully sure yet, he's on board. i'd offered $40 for just the little front portion and to weed whack it (which didn't happen because i couldn't get it started but gave him the full $40 anyway.)\n\non my way back from locking up my back yard, i see the bottle of water on the trunk of my car. not too big a deal except don't touch my car... my loves go in this order - husband, dog, car... don't touch my car. didn't say anything, didn't want to be rude.\n\nkid gets done, i pay him, and he asks if i've got gas to fill his mower. i was shocked, but had some and filled it because hey, it's hard starting out, right? i tell him i'll let him know if i need him again and get his number and give him mine.\n\na few days later, he calls me and asks to borrow my weed whacker to use on someone else's yard.\n\nare. you. kidding? i said no, pretty sure my husband wouldn't be happy if anything happened.\n\nthe next time he texted, i told him i was going to take care of the yard because i was short on money (not a lie, i put everything extra we get towards paying off debt and he caught me between paydays.)\n\ntoday he texted me and asked if i wanted my lawn mowed.\n\ni just did it friday (albeit on high because i didn't want to scalp my lawn.) when i said i'd just done it this weekend, and then asked if he'd -----> come !!!  -----> up !!!  -----> with !!!  a figure for doing the front and back yard, the response i got was this:\n\n\"i’ll do 35 or 40 your choice and i’ve seen your yard today i’ve had to walk to pass to get to another consumer but just let me kno when if those are good prices for you.\"\n\ni just don't want anything to do -----> with !!!  this moochy entitled kid. but i am having an issue with coming up with a tactful way to tell him to lose my number.\n\ntl:dr entitled kid wants to get paid to mow my lawn and seems to think (or at least imply) i'm lying about doing it myself.", "sortedWord": "None", "removed": null, "score": 1, "comments": 8, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/jba6ec/how_do_i_fire_the_lawn_guy_i_never_really_hired/", "identifyer": 227111, "year": "2020"}, {"Unnamed: 0": 228388, "autor": "Several-Series", "date": 1593135571000, "content": "My experiment with liquid urea and micro organisms using hose end Ortho. /!/ See pic with products- http://imgur.com/gallery/cqJ86GG\nAll purchased from Home Depot for around $50\nAlright boys I've been going down the rabbit hole here with the ortho dial in sprayer and liquid ferts..haha! My plan is to come up with a super fertilizer.  A fertilizer that is cheap, good for the soil and good for the grass blades...The first jug on the right is liquid urea nitrogen, I currently spray 20 oz on 2,500 sq ft and it's amazing! it really makes the yard a dark lush green usually within 24 to 48 hours! But.. now I want to work on the microbes in my soil for them roots! Second one from the right says it contains live microorganisms, and finally the jug on the left says it contains liquid fish, phosphoric acid, and sulfate of potash. So my plan is to mix them all together in my Ortho sprayer, currently I'm just trying to calculate the amount to spray on the other 2 jugs.. a couple questions I have, does the ortho dial in sprayer put out two gallons a minute? Does anyone feel like it's dangerous to mix all three of these together? Any advice would be appreciated cuz really I don't know what I'm doing but I'm having fun at least haha!", "link": "https://www.reddit.com/r/lawncare/comments/hfymk6/my_experiment_with_liquid_urea_and_micro/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "my experiment with liquid urea and micro organisms using hose end ortho. /!/ see pic with products- http://imgur.com/gallery/cqj86gg\nall purchased from home depot for around $50\nalright boys i've been going down the rabbit hole here with the ortho dial in sprayer and liquid ferts..haha! my plan is to -----> come !!!  -----> up !!!  -----> with !!!  a super fertilizer.  a fertilizer that is cheap, good for the soil and good for the grass blades...the first jug on the right is liquid urea nitrogen, i currently spray 20 oz on 2,500 sq ft and it's amazing! it really makes the yard a dark lush green usually within 24 to 48 hours! but.. now i want to work on the microbes in my soil for them roots! second one from the right says it contains live microorganisms, and finally the jug on the left says it contains liquid fish, phosphoric acid, and sulfate of potash. so my plan is to mix them all together in my ortho sprayer, currently i'm just trying to calculate the amount to spray on the other 2 jugs.. a couple questions i have, does the ortho dial in sprayer put out two gallons a minute? does anyone feel like it's dangerous to mix all three of these together? any advice would be appreciated cuz really i don't know what i'm doing but i'm having fun at least haha!", "sortedWord": "None", "removed": null, "score": 1, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/hfymk6/my_experiment_with_liquid_urea_and_micro/", "identifyer": 228388, "year": "2020"}, {"Unnamed: 0": 228557, "autor": "simuladdit", "date": 1594844609000, "content": "My lawn issues are causing marital issues. Help me answer my husband’s questions. /!/ So since my husband and I moved into our home, our yard has been an issue. We live in a pricey area and it costs $200/month for a lawn service. I bought an inexpensive mower and mowed myself a few times and, when I got pregnant, my husband took over. He only mows every 2 weeks and isnt a fan. When I’m not pregnant anymore I’ll be able to help out, but a biweekly mowing is pretty much all we do. Then the weeds took over. By the end of fall, half our yard was destroyed. In this picture you can see that a hay-like weed completely ravaged half the yard. There are also drainage issues. (https://i.imgur.com/QmPUGKq.jpg) In the spring, I enlisted my husband’s help and we managed to clear out a lot of the hay-like stuff, applied preemergent, and waited a couple weeks and seeded. This failed (because of the preemergent I’m told), and weeds completely took over. The big issue is that there is nutsedge and it is spreading everywhere (https://i.imgur.com/y5Mnd6p.jpg). I bought sedge-hammer and my husband returned it because I’m pregnant and he didn’t want me applying it and also didn’t want to apply it himself. Since then the nutsedge has flowered and is getting out of control. I want to solve these issues, but since I’m pregnant and my husband doesn’t have any time and doesn’t like lawn work or know anything about it, I need to hire people to help. The issue is, I need to come up with a plan and as I do so, he questions everything I suggest. So, basically I need help addressing his questions so I can then hire a weed service, landscaper, or both. I boiled it down to two main issues.\n\n1. Do we just use a weed-control lawn service like lawn doctor, ignore drainage issues, and attempt to overseed to establish a lawn? My husband sees no issue with the drainage because it eventually drains by the next day. What are the issues with leaving it as is? Does this cause any further weed issues?\n\n2. If we do a weed control service, but then also hire a landscaper to till and reseed this fall, do they need to amend the soil with sand and grade it or is it okay to just grade it? I have two different opinions on this from landscapers. The old owner had a garden here and the soil is all black soil.\n\nAny help on those two questions would be an enormous help! I know it’s asking a lot of reddit, but everyone trying to sell us something seems to give us an answer that lines up with their service, so I just don’t know who to listen to. On top of it, the quotes are very expensive, which prompts another round of questions from my husband.\n\nTldr: I don’t know how to answer my husband’s questions about why I’m hiring a lawn service or landscaper (see question 1 &amp; 2 above).", "link": "https://www.reddit.com/r/lawncare/comments/hrvash/my_lawn_issues_are_causing_marital_issues_help_me/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "my lawn issues are causing marital issues. help me answer my husband’s questions. /!/ so since my husband and i moved into our home, our yard has been an issue. we live in a pricey area and it costs $200/month for a lawn service. i bought an inexpensive mower and mowed myself a few times and, when i got pregnant, my husband took over. he only mows every 2 weeks and isnt a fan. when i’m not pregnant anymore i’ll be able to help out, but a biweekly mowing is pretty much all we do. then the weeds took over. by the end of fall, half our yard was destroyed. in this picture you can see that a hay-like weed completely ravaged half the yard. there are also drainage issues. (https://i.imgur.com/qmpugkq.jpg) in the spring, i enlisted my husband’s help and we managed to clear out a lot of the hay-like stuff, applied preemergent, and waited a couple weeks and seeded. this failed (because of the preemergent i’m told), and weeds completely took over. the big issue is that there is nutsedge and it is spreading everywhere (https://i.imgur.com/y5mnd6p.jpg). i bought sedge-hammer and my husband returned it because i’m pregnant and he didn’t want me applying it and also didn’t want to apply it himself. since then the nutsedge has flowered and is getting out of control. i want to solve these issues, but since i’m pregnant and my husband doesn’t have any time and doesn’t like lawn work or know anything about it, i need to hire people to help. the issue is, i need to -----> come !!!  -----> up !!!  -----> with !!!  a plan and as i do so, he questions everything i suggest. so, basically i need help addressing his questions so i can then hire a weed service, landscaper, or both. i boiled it down to two main issues.\n\n1. do we just use a weed-control lawn service like lawn doctor, ignore drainage issues, and attempt to overseed to establish a lawn? my husband sees no issue with the drainage because it eventually drains by the next day. what are the issues with leaving it as is? does this cause any further weed issues?\n\n2. if we do a weed control service, but then also hire a landscaper to till and reseed this fall, do they need to amend the soil with sand and grade it or is it okay to just grade it? i have two different opinions on this from landscapers. the old owner had a garden here and the soil is all black soil.\n\nany help on those two questions would be an enormous help! i know it’s asking a lot of reddit, but everyone trying to sell us something seems to give us an answer that lines up with their service, so i just don’t know who to listen to. on top of it, the quotes are very expensive, which prompts another round of questions from my husband.\n\ntldr: i don’t know how to answer my husband’s questions about why i’m hiring a lawn service or landscaper (see question 1 &amp; 2 above).", "sortedWord": "None", "removed": null, "score": 1, "comments": 26, "media": "self", "medialink": "https://www.reddit.com/r/lawncare/comments/hrvash/my_lawn_issues_are_causing_marital_issues_help_me/", "identifyer": 228557, "year": "2020"}, {"Unnamed: 0": 230553, "autor": "Internal-Antique", "date": 1600381828000, "content": "Cool Season Yearly Plan / Guide /!/ **The Guide:**\n\nThis guide servers to outline the timing only. In my mind its easier to split the product discussion and the timing discussion apart from each other. These timings are based on my location and preferences and are by no means perfect. Each lawn is different and must be treated as such. Remember, it is just grass, it will grow back! I have been honing this for a while and with the recent posts about putting a year round guide up I figured I would get it out into the community now and revise it as I go along. I will update this post with the product portion of the guide once I get it ironed out, enjoy!\n\n**Who:** I'm newer to lawncare but have spent a majority of my free time researching and coming up with my own full year guide for 2021, which I have provided below.\n\n**Where:** Missouri - Zone 6a\n\n**Grass Type:** Cool season primarily Tall Fescue right now\n\n&amp;#x200B;\n\nWithout further ado, here is my generalized yearly lawn care plan.\n\n**January 2021:** \n\n* Buy any tools that you may need for the upcoming season\n\n**February 2021:**\n\n* Buy any tools that you may need for the upcoming season\n* Potentially perform a soil test towards the end of February\\*\n\n**March 2021:**\n\n* Keep an eye on [soil temps](https://www.greencastonline.com/tools/soil-temperature) starting March 1st. This year soil temps were at 52F as of March 1st in my area,  which is significantly warmer than normal according to the historical data\n* When soil temps are CONSISTENTLY around 52F - 53F apply the first half of pre-emergent. This assumes that you will be doing a split application, if you are not doing a split application then you can skip this step\n\n**April 2021:**\n\n* Continue to monitor soil temps, once they get around 70F and/or the forsythia starts to bloom apply second application of pre-emergent, if you are performing a split application\n   *  If you choose not to do a split application of pre-emergent (which is fine) apply pre-emergent when the forsythia blooms, this is usually in April sometime\n\n*NOTE:* It is important to consider the rates at which you are dropping pre-emergent if you are going to be planning a fall overseed\n\n&amp;#x200B;\n\n* If you have issues with fungus you can start your fungicide regimen towards the end of April, remember to rotate your fungicides!\n* If you have issues with grubs, you can start grub treatments / prevention at the beginning of April\n\n**May 2021:**\n\n* Apply 1.0 lb N / 1k sq. ft., you can do this in a split application or all at once\n* Continue any grub or fungus treatments\n*  If you notice that weeds are starting to develop, you can spot apply a post emergent herbicide. Once again be mindful of you application rates if you are planning an overseed\n\n**June 2021:**\n\n* Continue any grub or fungus treatments\n* If the weather in your area is rainy, you can apply 0.5 lbs N / 1k sq. ft. ( Regardless of the weather I won't apply any N in June )\n\n**July 2021:**\n\n* Continue any grub or fungus treatments\n* If the weather in your area is rainy, you can apply 0.5 lbs N / 1k sq. ft. ( Regardless of the weather I won't apply any N in July )\n\n**August 2021:**\n\n* Continue any grub or fungus treatments\n* Overseed prep mid to end of august\n   * Scalp and bag\n   * Dethatch\n   * Aerate (if necessary)\n   *  Level\n* Depending on weather, overseed at end of august \n* IF NOT OVERSEEDING, early to middle of august you can apply another round pre-emergent. Once again check to see when soil temperatures start to cool down from the summer\n* IF NOT OVERSEEDING, start to drop nitrogen around mid august as well. The goal is to drop 1lb N / 1k sq. ft. per month.\\*\\*\n\n**September 2021:**\n\n*  If weather conditions were not favorable for overseeding at the end of august overseed at the start of September.\n   * First mow will be about 2 weeks after seeding\n   * After first mow apply 0.25 lbs of N / 1k sq. ft. each week for two weeks, then you can switch to 0.5 lbs of N / 1k sq. ft. every two weeks. \n* Continue any grub or fungus treatments\n* IF NOT OVERSEEDING, Continue nitrogen application targeting 1lb N / 1k sq. ft. per month\n\n**October 2021:**\n\n* Continue any grub or fungus treatments\n* Continue nitrogen application targeting 1lb of N / 1k sq. ft. per month\n\n**November 2021:**\n\n* Continue any grub or fungus treatments\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nAs I said above, this is a rough guide of what my plans are. I will continue to update it as needed. Once I have a little more time (hopefully tomorrow) I will lay out my specific product schedule as well.\n\n&amp;#x200B;\n\n\\*Soil tests can be performed at any time throughout the year but it is generally recommended to perform them in the spring sometime. I am planning on doing mine particularly early this year so that I can get a plan in place for any required soil remediation that may be required. The generalized advice is do one every year around the same time each year and soil remediation can be performed at any time.\n\n&amp;#x200B;\n\n\\*\\*Nitrogen can be dropped all at once or in split applications of 0.5 lbs N / 1k sq. ft. every two weeks. However you want to apply it, every 30 days you should be putting down a total of 1lb N / 1k sq. ft.", "link": "https://www.reddit.com/r/lawncare/comments/iutxo4/cool_season_yearly_plan_guide/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "cool season yearly plan / guide /!/ **the guide:**\n\nthis guide servers to outline the timing only. in my mind its easier to split the product discussion and the timing discussion apart from each other. these timings are based on my location and preferences and are by no means perfect. each lawn is different and must be treated as such. remember, it is just grass, it will grow back! i have been honing this for a while and with the recent posts about putting a year round guide up i figured i would get it out into the community now and revise it as i go along. i will update this post -----> with !!!  the product portion of the guide once i get it ironed out, enjoy!\n\n**who:** i'm newer to lawncare but have spent a majority of my free time researching and -----> coming !!!  -----> up !!!  -----> with !!!  my own full year guide for 2021, which i have provided below.\n\n**where:** missouri - zone 6a\n\n**grass type:** cool season primarily tall fescue right now\n\n&amp;#x200b;\n\nwithout further ado, here is my generalized yearly lawn care plan.\n\n**january 2021:** \n\n* buy any tools that you may need for the upcoming season\n\n**february 2021:**\n\n* buy any tools that you may need for the upcoming season\n* potentially perform a soil test towards the end of february\\*\n\n**march 2021:**\n\n* keep an eye on [soil temps](https://www.greencastonline.com/tools/soil-temperature) starting march 1st. this year soil temps were at 52f as of march 1st in my area,  which is significantly warmer than normal according to the historical data\n* when soil temps are consistently around 52f - 53f apply the first half of pre-emergent. this assumes that you will be doing a split application, if you are not doing a split application then you can skip this step\n\n**april 2021:**\n\n* continue to monitor soil temps, once they get around 70f and/or the forsythia starts to bloom apply second application of pre-emergent, if you are performing a split application\n   *  if you choose not to do a split application of pre-emergent (which is fine) apply pre-emergent when the forsythia blooms, this is usually in april sometime\n\n*note:* it is important to consider the rates at which you are dropping pre-emergent if you are going to be planning a fall overseed\n\n&amp;#x200b;\n\n* if you have issues with fungus you can start your fungicide regimen towards the end of april, remember to rotate your fungicides!\n* if you have issues with grubs, you can start grub treatments / prevention at the beginning of april\n\n**may 2021:**\n\n* apply 1.0 lb n / 1k sq. ft., you can do this in a split application or all at once\n* continue any grub or fungus treatments\n*  if you notice that weeds are starting to develop, you can spot apply a post emergent herbicide. once again be mindful of you application rates if you are planning an overseed\n\n**june 2021:**\n\n* continue any grub or fungus treatments\n* if the weather in your area is rainy, you can apply 0.5 lbs n / 1k sq. ft. ( regardless of the weather i won't apply any n in june )\n\n**july 2021:**\n\n* continue any grub or fungus treatments\n* if the weather in your area is rainy, you can apply 0.5 lbs n / 1k sq. ft. ( regardless of the weather i won't apply any n in july )\n\n**august 2021:**\n\n* continue any grub or fungus treatments\n* overseed prep mid to end of august\n   * scalp and bag\n   * dethatch\n   * aerate (if necessary)\n   *  level\n* depending on weather, overseed at end of august \n* if not overseeding, early to middle of august you can apply another round pre-emergent. once again check to see when soil temperatures start to cool down from the summer\n* if not overseeding, start to drop nitrogen around mid august as well. the goal is to drop 1lb n / 1k sq. ft. per month.\\*\\*\n\n**september 2021:**\n\n*  if weather conditions were not favorable for overseeding at the end of august overseed at the start of september.\n   * first mow will be about 2 weeks after seeding\n   * after first mow apply 0.25 lbs of n / 1k sq. ft. each week for two weeks, then you can switch to 0.5 lbs of n / 1k sq. ft. every two weeks. \n* continue any grub or fungus treatments\n* if not overseeding, continue nitrogen application targeting 1lb n / 1k sq. ft. per month\n\n**october 2021:**\n\n* continue any grub or fungus treatments\n* continue nitrogen application targeting 1lb of n / 1k sq. ft. per month\n\n**november 2021:**\n\n* continue any grub or fungus treatments\n\n&amp;#x200b;\n\n&amp;#x200b;\n\nas i said above, this is a rough guide of what my plans are. i will continue to update it as needed. once i have a little more time (hopefully tomorrow) i will lay out my specific product schedule as well.\n\n&amp;#x200b;\n\n\\*soil tests can be performed at any time throughout the year but it is generally recommended to perform them in the spring sometime. i am planning on doing mine particularly early this year so that i can get a plan in place for any required soil remediation that may be required. the generalized advice is do one every year around the same time each year and soil remediation can be performed at any time.\n\n&amp;#x200b;\n\n\\*\\*nitrogen can be dropped all at once or in split applications of 0.5 lbs n / 1k sq. ft. every two weeks. however you want to apply it, every 30 days you should be putting down a total of 1lb n / 1k sq. ft.", "sortedWord": "None", "removed": null, "score": 1, "comments": 1, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/iutxo4/cool_season_yearly_plan_guide/", "identifyer": 230553, "year": "2020"}, {"Unnamed: 0": 234657, "autor": "jdono927", "date": 1590950318000, "content": "Government Class Survey /!/ Hello Lawn care enthusiasts!\n\nIn my government class, our final project is to come up with a public policy that addresses a local issue.\n\nFor my policy, I decided to cover the topic of noise coming from lawn care in the morning. My policy dictates that, unless some type of permit is given or there is a circumstance involving the weather, nobody can use a lawn mower, whether it be a personal one or part of a lawn care service, from 10 P.M. until 10 A.M. between March 1 and November 1.\n\nObviously the ideal behind this is the issue that some people have of losing sleep because their neighbor is starting their lawn early in the morning, and with summer being a time of rest and relaxation for many, it can be very frustrating to be woken up at 7 A.M. by a lawn mower across the street.\n\nThe next part of this project is to receive information from two \"knowledgeable people\" on the topic of our policy, which is why I'm here. **I was wondering if any of you would be willing to shed some light with regards to how you'd feel if this type of policy came to your town**. It would be great if there was anyone who runs a lawn care business, but even if you have just mowed your own lawn for a number of years, that would classify you as \"knowledgeable\" in my eyes. The\n\nFor some context, I live in a small town in Central NY which is why the weather would be less of an issue as the heat isn't normally unbearable. Days that are especially hot would fall under the weather-related circumstances as would days that expect to see afternoon precipitation. Looking back on it, I'd probably push back the morning end of the \"quiet hours\" to 9 or 8 A.M. as 10 is quite late.\n\nTo add on to the original response I'm requesting, would pushing the time back that hour or two change your opinion at all or no?\n\nI appreciate any and every response and look forward to hearing what you have to say!\n\n*TLDR: How would you feel if there were \"quiet hours\" from 10 P.M to 10 A.M. where you couldn't mow your lawn and why? Would changing it from 10-10 to 10-9 or 10-8 have any effect on your opinion?*\n\n&amp;#x200B;\n\nPS: I think this sub is really great. There is so much helpful advice for all sorts of questions being asked and considering how broad of a topic lawn care is, it's great that there are so many people so passionate about it willing to share their knowledge on the subject! Thanks again for any help you may or may not be able to provide, I look forward to hearing your opinions!", "link": "https://www.reddit.com/r/lawncare/comments/gu4chp/government_class_survey/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "government class survey /!/ hello lawn care enthusiasts!\n\nin my government class, our final project is to -----> come !!!  -----> up !!!  -----> with !!!  a public policy that addresses a local issue.\n\nfor my policy, i decided to cover the topic of noise coming from lawn care in the morning. my policy dictates that, unless some type of permit is given or there is a circumstance involving the weather, nobody can use a lawn mower, whether it be a personal one or part of a lawn care service, from 10 p.m. until 10 a.m. between march 1 and november 1.\n\nobviously the ideal behind this is the issue that some people have of losing sleep because their neighbor is starting their lawn early in the morning, and with summer being a time of rest and relaxation for many, it can be very frustrating to be woken up at 7 a.m. by a lawn mower across the street.\n\nthe next part of this project is to receive information from two \"knowledgeable people\" on the topic of our policy, which is why i'm here. **i was wondering if any of you would be willing to shed some light with regards to how you'd feel if this type of policy came to your town**. it would be great if there was anyone who runs a lawn care business, but even if you have just mowed your own lawn for a number of years, that would classify you as \"knowledgeable\" in my eyes. the\n\nfor some context, i live in a small town in central ny which is why the weather would be less of an issue as the heat isn't normally unbearable. days that are especially hot would fall under the weather-related circumstances as would days that expect to see afternoon precipitation. looking back on it, i'd probably push back the morning end of the \"quiet hours\" to 9 or 8 a.m. as 10 is quite late.\n\nto add on to the original response i'm requesting, would pushing the time back that hour or two change your opinion at all or no?\n\ni appreciate any and every response and look forward to hearing what you have to say!\n\n*tldr: how would you feel if there were \"quiet hours\" from 10 p.m to 10 a.m. where you couldn't mow your lawn and why? would changing it from 10-10 to 10-9 or 10-8 have any effect on your opinion?*\n\n&amp;#x200b;\n\nps: i think this sub is really great. there is so much helpful advice for all sorts of questions being asked and considering how broad of a topic lawn care is, it's great that there are so many people so passionate about it willing to share their knowledge on the subject! thanks again for any help you may or may not be able to provide, i look forward to hearing your opinions!", "sortedWord": "None", "removed": null, "score": 0, "comments": 6, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/gu4chp/government_class_survey/", "identifyer": 234657, "year": "2020"}], "name": "withlawncare2020"}