{"interestingcomments": [{"Unnamed: 0": 218992, "autor": "LiMoTaLe", "date": 1623984346000, "content": "After 3 Years, finally solved a chronic moss problem /!/ Hi Folks.\n\nSorry, this is long. I'm new here without any background so please let me know if I'm out of line with this community.\n\nI am NOT a lawn expert, but did get lucky tackling a specific problem and want to share, hoping others in this community might benefit from a similar unconventional approach if they have the same issue.\n\nWe had a MAJOR issue with widespread moss.\n\n\\- - - - - - - - - - - - - - -\n\n**BACKSTORY**\n\n*(Skip to \"WHAT FINALLY WORKED\" if you don't care, and just want to know what I did)*\n\nIt started four years ago when a problem when our lawnmower (loose engine mount) began leaving heavy, unmulched clippings on the lawn. By the time the lawnmower was repaired the damage was done. The four or five weeks of bad cuts utterly destroyed my lawn and many areas. Moss began to grow and that fall the following spring completely flourished.\n\nEvery lawn care company told me the same thing: I need to work to strengthen the lawn and the moss will naturally go away: Fertilize, lime, water properly (not too much), and aerate/overseed each fall . I did this for 3 years (aeration/overseed every other), and each year the moss problem got WORSE. Some suggested cutting down trees and claimed I could NEVER grow grass in the shade. I knew this was untrue because we had thick healthy grass there 4 years ago. I'm not cutting down my shade.\n\nThere are products on the market like \"Moss Out!\" that claim to kill moss, but I was told by multiple lawn care specialists that those will simply turn the moss brown, not kill it, and your lawn will just look bad. The moss will just be dormant and brown and eventually come back to life. I did apply it once, two years ago, as directed with almost no impact.\n\nI did have the soil tested and it came back fine, no changes to be made.\n\nFor the 2019 and 2020 seasons, I switched to a new lawn company. They insisted the moss problem would steadily improve. It did not (they were friendly, just ineffective)\n\nI was devastated. The previous owner handed me a near-perfect lawn, and I had ruined it, with no improvement in sight.\n\n\\- - - - - - - - - - - - - - -\n\n**WHAT FINALLY WORKED**\n\nSo, here is what finally worked for us, starting with last fall:\n\n**Fall 2020**\n\n1. Aerate the lawn but have it done VERY thoroughly. Both directions (perpendicular). The lawn should look pretty bad when they are done: torn up everywhere and plugs littered about.\n2. Overseed right after the aeration (don't let the aeration guys pick the seed - do it yourself ! ), I \\*think\\* used a mixture of 1/2 URI2 and 1/2 Endophyte. I put down a TON of seed, I think $350 worth on about 9,000 square feet (2/3rds of the lawn). I saw very little growth in the fall. I was actually disappointed at the time, but patient.\n3. Lime. I think I did 6x 50 lb bags of pelletized for 14,000 sq feet of lawn.\n\n**Spring 2020**\n\nWe started normal fertilizer regiment, switching to a new lawn care company. They told the same sorry story \"Don't expect our service to help too much with the moss, you need to crowd it out over time\"\n\n1. March: Moss out! But ***5x*** the recommended amount, ***even more than that*** in moss-dense areas. This was risky. It turned all the moss an awful brown. Looked absolutely stupid by mid-April. Every lawn care expert I talked to said do NOT do this, and that I needed to need to instead strengthen the grass to crowd the moss out over time\n2. April: Dethatch the lawn with a vengeance. Had a guy run  the commercial grade dethatcher 4-5 times over the whole lawn. This picked up lots of the dead moss, but a lot still remained in place, brown and stupid. The guy who dethatched actually felt bad \"You sure this is ok?, I'm really tearing up the lawn.\" Yup, keep going!\n3. April: 3x 50 lb bags of lime\n4. Late April: Liquid aeration. I did 1/3 the lawn with this as an experiment and within 7 days, I could see the line defining where I applied it and where I did not. Lush dark green on one side, thinner light green on the other. I did another 1/3 and that grass popped another week later. I have not applied on the last 1/3 and that grass still looks like mediocre. We're going to take care of that next year (that section is a whole different story to tell)\n\nI've never even heard of ***Liquid aeration*** and I was *very* skeptical. Why aren't the lawn care services using this stuff? It's very cheap - I used about $15 worth total - and super easy to apply. It was like magic. So now the lawn is growing strong, and I had some momentum, and then......\n\nI went out about three weeks ago, late May and the moss has completely disintegrated. I have no idea where it went.  It was just . . . gone.\n\nIt's been causing me anguish for 3 years and it's entirely vanished. The grass is filling in the bare spots where it was removed and is as strong as ever everywhere else - right back to four years ago.\n\nYour mileage may vary, I am NOT an expert in lawn care, just got lucky solving for my specific problem while defying some advice along the way.\n\nIt probably helps that this year was a particularly good growing year and we had a really strong lawn foundation since *at one point* 4 years ago, it was very healthy.\n\nI'm going to follow the same plan this year, but add the liquid aeration in the fall as well, and maybe forgoing the mechanical aeration.\n\nI really hope someone else with the same affliction can benefit from this.\n\nIf anyone has any additional advice or thoughts, throw them in here\n\nBest of luck. I'm so happy this ordeal is over!", "link": "https://www.reddit.com/r/lawncare/comments/o2eqba/after_3_years_finally_solved_a_chronic_moss/", "origin": "Reddit", "suborigin": "lawncare", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "after 3 years, finally solved a chronic moss problem /!/ hi folks.\n\nsorry, this is long. i'm new here without any background so please let me know if i'm out of line with this community.\n\ni am not a lawn expert, but did get lucky tackling a specific problem and want to share, hoping others in this community might benefit from a similar unconventional approach if they have the same issue.\n\nwe had a major issue with widespread moss.\n\n\\- - - - - - - - - - - - - - -\n\n**backstory**\n\n*(skip to \"what finally worked\" if you don't care, and just want to know what i did)*\n\nit started four years ago when a problem when our lawnmower (loose engine mount) began leaving heavy, unmulched clippings on the lawn. by the time the lawnmower was repaired the damage was done. the four or five weeks of bad cuts utterly destroyed my lawn and many areas. moss began to grow and that fall the following spring completely flourished.\n\nevery lawn care company told me the same thing: i need to work to strengthen the lawn and the moss will naturally go away: fertilize, lime, water properly (not too much), and aerate/overseed each fall . i did this for 3 years (aeration/overseed every other), and each year the moss problem got worse. some suggested cutting down trees and claimed i could never grow grass in the shade. i knew this was untrue because we had thick healthy grass there 4 years ago. i'm not cutting down my shade.\n\nthere are products on the market like \"moss out!\" that claim to kill moss, but i was told by multiple lawn care specialists that those will simply turn the moss brown, not kill it, and your lawn will just look bad. the moss will just be dormant and brown and eventually come back to life. i did apply it once, two years ago, as directed with almost no impact.\n\ni did have the soil tested and it came back fine, no changes to be made.\n\nfor the 2019 and 2020 seasons, i switched to a new lawn company. they insisted the moss problem would steadily improve. it did not (they were friendly, just ineffective)\n\ni was devastated. the previous owner handed me a near-perfect lawn, and i had ruined it, with no improvement in sight.\n\n\\- - - - - - - - - - - - - - -\n\n**what finally worked**\n\nso, here is what finally worked for us, starting with last fall:\n\n**fall 2020**\n\n1. aerate the lawn but have it done very thoroughly. both directions (perpendicular). the lawn should look pretty bad when they are done: torn up everywhere and plugs littered about.\n2. overseed right after the aeration (-----> do !!! n't let the aeration guys pick the seed - -----> do !!!  -----> it !!!  -----> yourself !!!  ! ), i \\*think\\* used a mixture of 1/2 uri2 and 1/2 endophyte. i put down a ton of seed, i think $350 worth on about 9,000 square feet (2/3rds of the lawn). i saw very little growth in the fall. i was actually disappointed at the time, but patient.\n3. lime. i think i did 6x 50 lb bags of pelletized for 14,000 sq feet of lawn.\n\n**spring 2020**\n\nwe started normal fertilizer regiment, switching to a new lawn care company. they told the same sorry story \"don't expect our service to help too much with the moss, you need to crowd it out over time\"\n\n1. march: moss out! but ***5x*** the recommended amount, ***even more than that*** in moss-dense areas. this was risky. it turned all the moss an awful brown. looked absolutely stupid by mid-april. every lawn care expert i talked to said do not do this, and that i needed to need to instead strengthen the grass to crowd the moss out over time\n2. april: dethatch the lawn with a vengeance. had a guy run  the commercial grade dethatcher 4-5 times over the whole lawn. this picked up lots of the dead moss, but a lot still remained in place, brown and stupid. the guy who dethatched actually felt bad \"you sure this is ok?, i'm really tearing up the lawn.\" yup, keep going!\n3. april: 3x 50 lb bags of lime\n4. late april: liquid aeration. i did 1/3 the lawn with this as an experiment and within 7 days, i could see the line defining where i applied it and where i did not. lush dark green on one side, thinner light green on the other. i did another 1/3 and that grass popped another week later. i have not applied on the last 1/3 and that grass still looks like mediocre. we're going to take care of that next year (that section is a whole different story to tell)\n\ni've never even heard of ***liquid aeration*** and i was *very* skeptical. why aren't the lawn care services using this stuff? it's very cheap - i used about $15 worth total - and super easy to apply. it was like magic. so now the lawn is growing strong, and i had some momentum, and then......\n\ni went out about three weeks ago, late may and the moss has completely disintegrated. i have no idea where it went.  it was just . . . gone.\n\nit's been causing me anguish for 3 years and it's entirely vanished. the grass is filling in the bare spots where it was removed and is as strong as ever everywhere else - right back to four years ago.\n\nyour mileage may vary, i am not an expert in lawn care, just got lucky solving for my specific problem while defying some advice along the way.\n\nit probably helps that this year was a particularly good growing year and we had a really strong lawn foundation since *at one point* 4 years ago, it was very healthy.\n\ni'm going to follow the same plan this year, but add the liquid aeration in the fall as well, and maybe forgoing the mechanical aeration.\n\ni really hope someone else with the same affliction can benefit from this.\n\nif anyone has any additional advice or thoughts, throw them in here\n\nbest of luck. i'm so happy this ordeal is over!", "sortedWord": "None", "removed": null, "score": 2, "comments": 7, "media": null, "medialink": "https://www.reddit.com/r/lawncare/comments/o2eqba/after_3_years_finally_solved_a_chronic_moss/", "identifyer": 218992, "year": "2021"}], "name": "yourselflawncare2021"}