{"interestingcomments": [{"Unnamed: 0": 265924, "autor": "derektut", "date": 1536686837000, "content": "A conversation with Ivan Shaw - Condé Nast Archive", "link": "https://www.reddit.com/r/photography/comments/9ezkpl/a_conversation_with_ivan_shaw_condé_nast_archive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "a conversation with ivan shaw - condé nast -----> archive !!! ", "sortedWord": "None", "identifyer": 11537, "year": "2018"}, {"Unnamed: 0": 269291, "autor": "translunar_injection", "date": 1524825486000, "content": "\"Scenes Unseen: The Summer of ’78\" - a selection in the NYT from a recently discovered archive of thousands of unpublished photos.", "link": "https://www.reddit.com/r/photography/comments/8fanri/scenes_unseen_the_summer_of_78_a_selection_in_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "\"scenes unseen: the summer of ’78\" - a selection in the nyt from a recently discovered -----> archive !!!  of thousands of unpublished photos.", "sortedWord": "None", "identifyer": 15028, "year": "2018"}, {"Unnamed: 0": 270561, "autor": "droneworxs", "date": 1532591566000, "content": "Blog Archive | Droneworxs Aerial Photography", "link": "https://www.reddit.com/r/photography/comments/920akx/blog_archive_droneworxs_aerial_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "blog -----> archive !!!  | droneworxs aerial photography", "sortedWord": "None", "identifyer": 16342, "year": "2018"}, {"Unnamed: 0": 271966, "autor": "fromthere", "date": 1543586245000, "content": "We are Trying to Save one Of The Biggest Photographic Archive in Europe. /!/ Cameraphoto stores over 300 000 negatives, collected in the last 50 years. \n\nSome of them are really iconic, and you may have seen them before:\n\n&amp;#x200B;\n\n![img](uy4h6vtw3h121 \"Just, you know, Dalì on a Gondola in Venice\")\n\n&amp;#x200B;\n\n![img](nh4cjmqz3h121 \"Ernest Hemingway\")\n\n&amp;#x200B;\n\n![img](07ogbk974h121 \"Paul Newman\")\n\nIn order to preserve the negatives we thought about offering fine art prints directly from the original negatives:  [goo.gl/Rax5z2](https://goo.gl/Rax5z2) \n\nI didn't merely want to promote this project but rather collect ideas. The archive is located in (guess where?) Venice and for many of those negatives, we are running out of time.\n\nYes, that's sad.", "link": "https://www.reddit.com/r/photography/comments/a1smpe/we_are_trying_to_save_one_of_the_biggest/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "we are trying to save one of the biggest photographic -----> archive !!!  in europe. /!/ cameraphoto stores over 300 000 negatives, collected in the last 50 years. \n\nsome of them are really iconic, and you may have seen them before:\n\n&amp;#x200b;\n\n![img](uy4h6vtw3h121 \"just, you know, dalì on a gondola in venice\")\n\n&amp;#x200b;\n\n![img](nh4cjmqz3h121 \"ernest hemingway\")\n\n&amp;#x200b;\n\n![img](07ogbk974h121 \"paul newman\")\n\nin order to preserve the negatives we thought about offering fine art prints directly from the original negatives:  [goo.gl/rax5z2](https://goo.gl/rax5z2) \n\ni didn't merely want to promote this project but rather collect ideas. the archive is located in (guess where?) venice and for many of those negatives, we are running out of time.\n\nyes, that's sad.", "sortedWord": "None", "identifyer": 17785, "year": "2018"}, {"Unnamed: 0": 272562, "autor": "shveddy", "date": 1516363360000, "content": "I have a giant street and travel photography archive - what should I do with it? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/7rhv3j/i_have_a_giant_street_and_travel_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "i have a giant street and travel photography -----> archive !!!  - what should i do with it? /!/ [removed]", "sortedWord": "None", "identifyer": 18394, "year": "2018"}, {"Unnamed: 0": 273272, "autor": "ok-carla", "date": 1523735248000, "content": "Best practises for organizes multiple external hard drives /!/ I'm FINALLY getting around to organizes YEARS worth of work (photo + video) that has lived across multiple hard drives and is currently a mess. \n\nBasically, I want to know what is the best system, or the system that works best for you, when it comes to organizing years of work. ie. your entire archive. \n\nNo system is wrong, just want to see what works best for people. \n\nThank you!!! \n\n", "link": "https://www.reddit.com/r/photography/comments/8c9ydu/best_practises_for_organizes_multiple_external/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "best practises for organizes multiple external hard drives /!/ i'm finally getting around to organizes years worth of work (photo + video) that has lived across multiple hard drives and is currently a mess. \n\nbasically, i want to know what is the best system, or the system that works best for you, when it comes to organizing years of work. ie. your entire -----> archive !!! . \n\nno system is wrong, just want to see what works best for people. \n\nthank you!!! \n\n", "sortedWord": "None", "identifyer": 19135, "year": "2018"}, {"Unnamed: 0": 273306, "autor": "dontrescueme", "date": 1523690370000, "content": "Scanning Pics: 600 dpi TIFF or 1200dpi JPEG /!/ Not sure if this is the right sub but hope you help. Consider me a noob. I'm planning to archive all my pre-digital era pics. I'm taking smaller file size but better quality into consideration, wht should i choose? Is 1200 dpi overkill? The file size of a scan at 1200 dpi, png or tiff format is too much for me. Tnx. ", "link": "https://www.reddit.com/r/photography/comments/8c61zh/scanning_pics_600_dpi_tiff_or_1200dpi_jpeg/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "scanning pics: 600 dpi tiff or 1200dpi jpeg /!/ not sure if this is the right sub but hope you help. consider me a noob. i'm planning to -----> archive !!!  all my pre-digital era pics. i'm taking smaller file size but better quality into consideration, wht should i choose? is 1200 dpi overkill? the file size of a scan at 1200 dpi, png or tiff format is too much for me. tnx. ", "sortedWord": "None", "identifyer": 19170, "year": "2018"}, {"Unnamed: 0": 274246, "autor": "TheIndependentPhoto", "date": 1524405459000, "content": "\"DesArtification was born in 2015 and consists of 22 suggestive and very intimate portraits of the sand deserts from my private archive of works done over a 10 years period. It is the essence of what I saw and of what my soul has memorised.\" Nik Barte", "link": "https://www.reddit.com/r/photography/comments/8e3dov/desartification_was_born_in_2015_and_consists_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "\"desartification was born in 2015 and consists of 22 suggestive and very intimate portraits of the sand deserts from my private -----> archive !!!  of works done over a 10 years period. it is the essence of what i saw and of what my soul has memorised.\" nik barte", "sortedWord": "None", "identifyer": 20144, "year": "2018"}, {"Unnamed: 0": 274352, "autor": "CCtenor", "date": 1524663380000, "content": "Flickr rights attribution /!/ Hello all! (TL;DR at the end)\n\nI’m CC and I started getting more into photography at the beginning of this year. I’ve loved photography since the time my dad and brother got into it when I was younger, but it was not nearly as accessible at the time due to the cost of film and development, as well as the fear of making mistakes in a medium when I was never really as serious about photography as my aforementioned family were. \n\nHowever, I recently made a super cheap plunge into photography. I bought a Yi M1 in january, as I very quickly purchased a panasonic 20mm f1.7 lens for it, which has basically replaced the kit lens for everything. \n\nWith the camera, I also opened up a Flickr account where I upload what I consider my best work. It’s not really a portfolio, per se, because I don’t plan on limiting what I upload to there. It’s more like a high quality archive of what i’ve done, and I have taken down photos that have lost their shine as i’ve improved. \n\nEnough with the background, I just wanted to share my enthusiasm. \n\nMy question is this. I have a tentative goal of being able to sell prints one day. With this in mind, what rights/license should I upload my photos under? I see many people upload their photos with full copyright and all rights reserved. However, I’m personally a big believer in people being able to share things they like, as long as they give credit. \n\nCurrently, I share my photos on flickr with the most restrictive Creative Commons license. People can share my photos as long as they credit me, but they cannot use my photos for any commercial ventures or to make money etc. \n\nPerhaps I’m naive. Should I upload my photos with full copyright? Will my current scheme of uploading photos hinder my ability to sell those photos in the future? I definitely will ***not*** upload any photos under a less restrictive license, though.\n\nAlso, I upload my photos as TIFFs. What I’ve noticed is that, if people download the photo (as i’ve done at work to use my photos as desktop backgrounds), there are some noticeable artifacts on some of the photos. does Flickr do this if you upload a proper JPEG? If not, i’ll continue uploading as TIFF and letting Flickr convert the photo on download because, while the artifacts aren’t super noticeable,  i’ll exploit that as a small form of protection. \n\nTL;DR: here is a sample of some photos from my Flickr.\n\nhttps://www.flickr.com/photos/138098247@N05/shares/3z1w87\n\nI know people are willing to steal whatever get their hands on, but:\n\nDo these photos seem professional enough for someone to want to steal?\n\nConsidering the answer to the answer to my previous question, should I upload my photos under a more restrictive license?\n\nConsidering all of that, are there any other things I should keep in mind when uploading photos to Flickr, especially if there is a chance I might start selling prints in the future?\n\nThanks in advance for your advice.", "link": "https://www.reddit.com/r/photography/comments/8etlo6/flickr_rights_attribution/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "flickr rights attribution /!/ hello all! (tl;dr at the end)\n\ni’m cc and i started getting more into photography at the beginning of this year. i’ve loved photography since the time my dad and brother got into it when i was younger, but it was not nearly as accessible at the time due to the cost of film and development, as well as the fear of making mistakes in a medium when i was never really as serious about photography as my aforementioned family were. \n\nhowever, i recently made a super cheap plunge into photography. i bought a yi m1 in january, as i very quickly purchased a panasonic 20mm f1.7 lens for it, which has basically replaced the kit lens for everything. \n\nwith the camera, i also opened up a flickr account where i upload what i consider my best work. it’s not really a portfolio, per se, because i don’t plan on limiting what i upload to there. it’s more like a high quality -----> archive !!!  of what i’ve done, and i have taken down photos that have lost their shine as i’ve improved. \n\nenough with the background, i just wanted to share my enthusiasm. \n\nmy question is this. i have a tentative goal of being able to sell prints one day. with this in mind, what rights/license should i upload my photos under? i see many people upload their photos with full copyright and all rights reserved. however, i’m personally a big believer in people being able to share things they like, as long as they give credit. \n\ncurrently, i share my photos on flickr with the most restrictive creative commons license. people can share my photos as long as they credit me, but they cannot use my photos for any commercial ventures or to make money etc. \n\nperhaps i’m naive. should i upload my photos with full copyright? will my current scheme of uploading photos hinder my ability to sell those photos in the future? i definitely will ***not*** upload any photos under a less restrictive license, though.\n\nalso, i upload my photos as tiffs. what i’ve noticed is that, if people download the photo (as i’ve done at work to use my photos as desktop backgrounds), there are some noticeable artifacts on some of the photos. does flickr do this if you upload a proper jpeg? if not, i’ll continue uploading as tiff and letting flickr convert the photo on download because, while the artifacts aren’t super noticeable,  i’ll exploit that as a small form of protection. \n\ntl;dr: here is a sample of some photos from my flickr.\n\nhttps://www.flickr.com/photos/138098247@n05/shares/3z1w87\n\ni know people are willing to steal whatever get their hands on, but:\n\ndo these photos seem professional enough for someone to want to steal?\n\nconsidering the answer to the answer to my previous question, should i upload my photos under a more restrictive license?\n\nconsidering all of that, are there any other things i should keep in mind when uploading photos to flickr, especially if there is a chance i might start selling prints in the future?\n\nthanks in advance for your advice.", "sortedWord": "None", "identifyer": 20256, "year": "2018"}, {"Unnamed: 0": 276532, "autor": "jimsf", "date": 1533833729000, "content": "Protecting Your Data From Camera to Archive (Lensrentals Guest Post at Backblaze)", "link": "https://www.reddit.com/r/photography/comments/95y7da/protecting_your_data_from_camera_to_archive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "protecting your data from camera to -----> archive !!!  (lensrentals guest post at backblaze)", "sortedWord": "None", "identifyer": 22543, "year": "2018"}, {"Unnamed: 0": 277340, "autor": "ArchiveDump", "date": 1536010803000, "content": "AD_0001 It has begun. I will dump my archive of photos daily on reddit. Photos I hoard of my life, relationships, and travel. Shigu, China 2017 https://www.instagram.com/guinnphotography/", "link": "https://www.reddit.com/r/photography/comments/9cpi4k/ad_0001_it_has_begun_i_will_dump_my_archive_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "ad_0001 it has begun. i will dump my -----> archive !!!  of photos daily on reddit. photos i hoard of my life, relationships, and travel. shigu, china 2017 https://www.instagram.com/guinnphotography/", "sortedWord": "None", "identifyer": 23380, "year": "2018"}, {"Unnamed: 0": 278994, "autor": "91929192", "date": 1543916606000, "content": "Looking for: Archive Cloud Solution with description &amp; tags /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/a2z96p/looking_for_archive_cloud_solution_with/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "looking for: -----> archive !!!  cloud solution with description &amp; tags /!/ [removed]", "sortedWord": "None", "identifyer": 25088, "year": "2018"}, {"Unnamed: 0": 282409, "autor": "murkleton", "date": 1518893176000, "content": "Rekindling Lost Passion /!/ I'm in a huge rut at the moment and its one that I'm eager to get out of. I'm now 29. I started out taking photos of insects, I absolutely loved it. Built myself a nice little macro rig and spent my spare time with my head buried in the undergrowth. I then went on to study photography at university, I did really well and I produced work far beyond what I thought I was capable of. My third-year project was based on dance music, in particular, drum and bass and the culture that surrounded it. It was exciting. I made money taking photos to advertise my friends' raves, jumped into train yards with people I'd met at art college that were into graffiti and shot a lot of promotional stuff for DJs. Everyone I knew was creative and I was completely immersed. I was in such a state I wouldn't remember what I'd taken but when I reviewed it, it was fantastic. During the summer of my third year I had a house fire and lost everything. All of my gear, my editing suite and most importantly my entire archive of images from the past 7 years. It destroyed me.\n\nEither way, at this point, I was hopelessly addicted to drugs. I needed help. I then trudged through years of recovery and relapse. I was still taking photos. They were beautiful but they were sad. Looking back they were incredibly depressing. Empty bottles, medication and self-portraits to remind myself what rock bottom is. I look back at them sometimes when I'm down to remind me how far I've come but other than that they're buried on a hard drive in my cupboard. \n\nI got somewhat on my feet and I stopped taking photos altogether. In this time I have gotten better. I am happy and most importantly I am healthy. From the verge of liver failure to the top fifth percentile. I also found Buddhism and scuba diving - this progressed to deep technical diving and in the past 6 months I have started cave &amp; mine exploration.  This is where I want photography to end up but I haven't got the money to put my camera underwater yet. Photogammetry is something I'm really interested in after seeing some amazing work and it's something that will make money.\n\nMy question is - how can I kick start my photos? How do I rediscover what I enjoy and what I like taking? I want to get lost behind a lens again - I forget about the trials of life when I'm looking through a viewfinder. Have you got any exercises to simply start getting my hit rate up? I need briefs but can't think. A photo a day project would be great but I need a starting point, even just an emotion for each day. \n\nI know I need books. That is something I'm in dire need of is study. I really like Flickr for this - it's great for socialising online with other photographers.\n\nI can't sit around waiting to have enough money to put my camera in a flooded cave. I have an Olympus OMD EM-1 with a 12-40mm Pro lens. It's beautiful and it's collecting dust. I could do with extra equipment, it does somewhat limit my work - I would love to go full circle and start with insects but I need macro equipment and better lighting. Once I'm done with dive training/gear I'll be picking up a decent array of lenses and flash units.", "link": "https://www.reddit.com/r/photography/comments/7y8hju/rekindling_lost_passion/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "rekindling lost passion /!/ i'm in a huge rut at the moment and its one that i'm eager to get out of. i'm now 29. i started out taking photos of insects, i absolutely loved it. built myself a nice little macro rig and spent my spare time with my head buried in the undergrowth. i then went on to study photography at university, i did really well and i produced work far beyond what i thought i was capable of. my third-year project was based on dance music, in particular, drum and bass and the culture that surrounded it. it was exciting. i made money taking photos to advertise my friends' raves, jumped into train yards with people i'd met at art college that were into graffiti and shot a lot of promotional stuff for djs. everyone i knew was creative and i was completely immersed. i was in such a state i wouldn't remember what i'd taken but when i reviewed it, it was fantastic. during the summer of my third year i had a house fire and lost everything. all of my gear, my editing suite and most importantly my entire -----> archive !!!  of images from the past 7 years. it destroyed me.\n\neither way, at this point, i was hopelessly addicted to drugs. i needed help. i then trudged through years of recovery and relapse. i was still taking photos. they were beautiful but they were sad. looking back they were incredibly depressing. empty bottles, medication and self-portraits to remind myself what rock bottom is. i look back at them sometimes when i'm down to remind me how far i've come but other than that they're buried on a hard drive in my cupboard. \n\ni got somewhat on my feet and i stopped taking photos altogether. in this time i have gotten better. i am happy and most importantly i am healthy. from the verge of liver failure to the top fifth percentile. i also found buddhism and scuba diving - this progressed to deep technical diving and in the past 6 months i have started cave &amp; mine exploration.  this is where i want photography to end up but i haven't got the money to put my camera underwater yet. photogammetry is something i'm really interested in after seeing some amazing work and it's something that will make money.\n\nmy question is - how can i kick start my photos? how do i rediscover what i enjoy and what i like taking? i want to get lost behind a lens again - i forget about the trials of life when i'm looking through a viewfinder. have you got any exercises to simply start getting my hit rate up? i need briefs but can't think. a photo a day project would be great but i need a starting point, even just an emotion for each day. \n\ni know i need books. that is something i'm in dire need of is study. i really like flickr for this - it's great for socialising online with other photographers.\n\ni can't sit around waiting to have enough money to put my camera in a flooded cave. i have an olympus omd em-1 with a 12-40mm pro lens. it's beautiful and it's collecting dust. i could do with extra equipment, it does somewhat limit my work - i would love to go full circle and start with insects but i need macro equipment and better lighting. once i'm done with dive training/gear i'll be picking up a decent array of lenses and flash units.", "sortedWord": "None", "identifyer": 28630, "year": "2018"}, {"Unnamed: 0": 283665, "autor": "wikipal", "date": 1531577375000, "content": "Which RAW Format for Archives? /!/ I got the two physical and one cloud storage backup down to a tee. But I am anxious person by nature, so I always mull over the most unlikely of scenarios.\n\nI keep thinking about the end of my makers proprietary software:\n\nI have a nikon d3300 (its all I can afford really, and I am super comfortable with it since I shoot with it all the time.) and a nikon F65 (which was given to me this year by a family member as they never really used it.)\n\nSo if nikon shutdown due to entering into the mirrorless game too late, or simply being edged of the market due to forces that I am not aware of. Or if they decide to up and end NEF to bring in forced obsolescence. So in these scenarios I am no longer able to keep my raw files up to date. How do I combat this?\n\nI have looked up online if Dng is a good option and I have yet to come to a definitive conclusion. So any advice would be greatly appreciated.\n\nTldr: Proprietary software won't be around forever, so what's the best way to archive my RAW files?", "link": "https://www.reddit.com/r/photography/comments/8ytigi/which_raw_format_for_archives/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "which raw format for archives? /!/ i got the two physical and one cloud storage backup down to a tee. but i am anxious person by nature, so i always mull over the most unlikely of scenarios.\n\ni keep thinking about the end of my makers proprietary software:\n\ni have a nikon d3300 (its all i can afford really, and i am super comfortable with it since i shoot with it all the time.) and a nikon f65 (which was given to me this year by a family member as they never really used it.)\n\nso if nikon shutdown due to entering into the mirrorless game too late, or simply being edged of the market due to forces that i am not aware of. or if they decide to up and end nef to bring in forced obsolescence. so in these scenarios i am no longer able to keep my raw files up to date. how do i combat this?\n\ni have looked up online if dng is a good option and i have yet to come to a definitive conclusion. so any advice would be greatly appreciated.\n\ntldr: proprietary software won't be around forever, so what's the best way to -----> archive !!!  my raw files?", "sortedWord": "None", "identifyer": 29934, "year": "2018"}, {"Unnamed: 0": 287996, "autor": "xscientist", "date": 1543460589000, "content": "What is your workflow? Help me get started... /!/ I’m just getting back into photography after 20 years off. Bought an Xt2. Went to India. Now I’m home and have about 5000 shots on my cards and I’m like: what do I do next to make sense of it all? I will do most of my editing on an iMac, have an old copy of Photoshop, and I hear that Lightroom is awesome. Someone please walk me through how to set up image transfer, archive organization, culling out all the junk, then getting down to business with the good stuff. I feel like if I started off in the wrong direction, it could get overwhelmingly messy. ", "link": "https://www.reddit.com/r/photography/comments/a1dejw/what_is_your_workflow_help_me_get_started/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "what is your workflow? help me get started... /!/ i’m just getting back into photography after 20 years off. bought an xt2. went to india. now i’m home and have about 5000 shots on my cards and i’m like: what do i do next to make sense of it all? i will do most of my editing on an imac, have an old copy of photoshop, and i hear that lightroom is awesome. someone please walk me through how to set up image transfer, -----> archive !!!  organization, culling out all the junk, then getting down to business with the good stuff. i feel like if i started off in the wrong direction, it could get overwhelmingly messy. ", "sortedWord": "None", "identifyer": 34416, "year": "2018"}, {"Unnamed: 0": 289907, "autor": "Poland2985", "date": 1535415320000, "content": "Legality Question /!/ Hello. I looked for this questions in the archive already and didn't find my answer, so i'm gonna ask here. \n\n&amp;#x200B;\n\nI am interested in creating a coffee table photo book of peoples lawn ornaments. I ideally would like to publish it (Call it a stretch but i'm gonna dream, haha). My question is, if I take the photo from a street or sidewalk, can i sell the photo no big deal or do i need a release form still? If so, what are the photo release forms i'd need to ensure the owner of the lawn ornaments won't sue me for selling the photo? \n\n&amp;#x200B;\n\nThanks! \n\n&amp;#x200B;\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/9au7pw/legality_question/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "legality question /!/ hello. i looked for this questions in the -----> archive !!!  already and didn't find my answer, so i'm gonna ask here. \n\n&amp;#x200b;\n\ni am interested in creating a coffee table photo book of peoples lawn ornaments. i ideally would like to publish it (call it a stretch but i'm gonna dream, haha). my question is, if i take the photo from a street or sidewalk, can i sell the photo no big deal or do i need a release form still? if so, what are the photo release forms i'd need to ensure the owner of the lawn ornaments won't sue me for selling the photo? \n\n&amp;#x200b;\n\nthanks! \n\n&amp;#x200b;\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 36404, "year": "2018"}, {"Unnamed: 0": 290098, "autor": "maxman92", "date": 1536793978000, "content": "Can we start a weekly discussion on specific pieces of gear? /!/ On /r/headphones, there's a weekly discussion of a specific piece of gear (e.g. a headphone or amplifier), and people vote on what they want to discuss next. I think something like this would be a good thing for this sub. Given the fact that different brands have similar items, we could do it irrespective of brand, like discussing all 70-200 2.8's in one thread, or break it up by brand.\n\nPeople could post photos they've taken with the lens/body, share what they like and don't like about them, etc. It could be particularly useful to look back on as an archive for the purchase advice thread too. All in all I think it would add a lot of content to the sub.", "link": "https://www.reddit.com/r/photography/comments/9fcr32/can_we_start_a_weekly_discussion_on_specific/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "can we start a weekly discussion on specific pieces of gear? /!/ on /r/headphones, there's a weekly discussion of a specific piece of gear (e.g. a headphone or amplifier), and people vote on what they want to discuss next. i think something like this would be a good thing for this sub. given the fact that different brands have similar items, we could do it irrespective of brand, like discussing all 70-200 2.8's in one thread, or break it up by brand.\n\npeople could post photos they've taken with the lens/body, share what they like and don't like about them, etc. it could be particularly useful to look back on as an -----> archive !!!  for the purchase advice thread too. all in all i think it would add a lot of content to the sub.", "sortedWord": "None", "identifyer": 36604, "year": "2018"}, {"Unnamed: 0": 290323, "autor": "landwomble", "date": 1539271489000, "content": "Tool for merging multiple folders and removing dupes /!/ Hi Folks\n\nI've got 3 SSDs that each contain a different version of a backup of a photo archive in many folders and subfolders.  At some point in time in the later backups some stuff's gone missing that I'm hoping is present in the earlier backup.\n\nWhat I'd like to do is merge all this to one master copy that contains everything without duplicates. \n\nAny recommendations on software to do this?\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/9naxcy/tool_for_merging_multiple_folders_and_removing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "tool for merging multiple folders and removing dupes /!/ hi folks\n\ni've got 3 ssds that each contain a different version of a backup of a photo -----> archive !!!  in many folders and subfolders.  at some point in time in the later backups some stuff's gone missing that i'm hoping is present in the earlier backup.\n\nwhat i'd like to do is merge all this to one master copy that contains everything without duplicates. \n\nany recommendations on software to do this?\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 36838, "year": "2018"}, {"Unnamed: 0": 290530, "autor": "BTCyd", "date": 1540568729000, "content": "How do you guys organize/backup lightroom work and catalogs? /!/ I just finished my first year of photowork and realized that my photography has taken up a TB of space on my work drive, so I want to archive it all on a backup drive.  It got me thinking about what the best way to organize my photo work would be. Do you guys keep one giant catalog for your work, with all years of your work in one place? Or, do you prefer to break it out per year?\n\nIm just a hobbyist, so I could likely keep most of my work on one drive to work off of for a few years. My current photos folder is about 1 TB after a year of work, so it will take me a few years to fill up my current drive. That being said, lightroom is already very laggy for me, so not sure if it is worth trying to break it up to speed up the program.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/9rlvbu/how_do_you_guys_organizebackup_lightroom_work_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "how do you guys organize/backup lightroom work and catalogs? /!/ i just finished my first year of photowork and realized that my photography has taken up a tb of space on my work drive, so i want to -----> archive !!!  it all on a backup drive.  it got me thinking about what the best way to organize my photo work would be. do you guys keep one giant catalog for your work, with all years of your work in one place? or, do you prefer to break it out per year?\n\nim just a hobbyist, so i could likely keep most of my work on one drive to work off of for a few years. my current photos folder is about 1 tb after a year of work, so it will take me a few years to fill up my current drive. that being said, lightroom is already very laggy for me, so not sure if it is worth trying to break it up to speed up the program.\n\nthanks!", "sortedWord": "None", "identifyer": 37057, "year": "2018"}, {"Unnamed: 0": 290691, "autor": "ericericsonistaken", "date": 1541717830000, "content": "Taken with a HUAWEI Mate 10 Pro. Feels like an archive photo. Love to hear your thoughts", "link": "https://www.reddit.com/r/photography/comments/9vewlk/taken_with_a_huawei_mate_10_pro_feels_like_an/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "taken with a huawei mate 10 pro. feels like an -----> archive !!!  photo. love to hear your thoughts", "sortedWord": "None", "identifyer": 37220, "year": "2018"}], "name": "archivephotography2018"}