{"interestingcomments": [{"Unnamed: 0": 95730, "autor": "Monkeyglue13", "date": 1614301807000, "content": "How do y'all store/organize your photos? /!/ I am taking an architectural photography class and quickly learning that some final photo shots are 40-50 images stitched together. As a result, I'm taking between 300-500 photos of each building that I shoot.\n\nI don't feel safe keeping everything on an SD card or an external hard drive, and uploading to google drive takes way too long (not to mention the storage limits).\n\nHow do y'all store your photos for post production and archive them for the future?", "link": "https://www.reddit.com/r/photography/comments/lsm3j9/how_do_yall_storeorganize_your_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "how do y'all store/organize your photos? /!/ i am taking an architectural photography class and quickly learning that some final photo shots are 40-50 images stitched together. as a result, i'm taking between 300-500 photos of each building that i shoot.\n\ni don't feel safe keeping everything on an sd card or an external hard drive, and uploading to google drive takes way too long (not to mention the storage limits).\n\nhow do y'all store your photos for post production and -----> archive !!!  them for the future?", "sortedWord": "None", "identifyer": 98301, "year": "2021"}, {"Unnamed: 0": 110538, "autor": "aqueouserror", "date": 1613063423000, "content": "Scanning a bunch of family photos? /!/ Hi everyone,\n\nI was looking into scanning a bunch of family photos to keep a digital archive. Most of them are the standard photo size 4x6 or 5x7, and we have a few either bigger or smaller than that. They don't require retouching as most of them are from the early 80s to 00s, so I want to do this myself.\n\n**I was wondering what's the best scanner out there? Looking for both speed and quality, I have hundreds if not THOUSANDS of photos to go through.** \n\nI currently have my eyes on the Epson FastFoto FF 680W, but that's just from seeing a YouTube review from two years ago. Just wanna see if there's another option out there. If not, I am fine settling with the Epson FastFoto FF 680W.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/lhpai5/scanning_a_bunch_of_family_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "scanning a bunch of family photos? /!/ hi everyone,\n\ni was looking into scanning a bunch of family photos to keep a digital -----> archive !!! . most of them are the standard photo size 4x6 or 5x7, and we have a few either bigger or smaller than that. they don't require retouching as most of them are from the early 80s to 00s, so i want to do this myself.\n\n**i was wondering what's the best scanner out there? looking for both speed and quality, i have hundreds if not thousands of photos to go through.** \n\ni currently have my eyes on the epson fastfoto ff 680w, but that's just from seeing a youtube review from two years ago. just wanna see if there's another option out there. if not, i am fine settling with the epson fastfoto ff 680w.\n\nthanks!", "sortedWord": "None", "identifyer": 483, "year": "2021"}, {"Unnamed: 0": 110965, "autor": "PauloPatricio", "date": 1614928933000, "content": "Edward Chambré Hardman: National Trust in ‘race against time’ to save Liverpool photographer’s archive", "link": "https://www.reddit.com/r/photography/comments/ly6mfg/edward_chambré_hardman_national_trust_in_race/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "edward chambré hardman: national trust in ‘race against time’ to save liverpool photographer’s -----> archive !!! ", "sortedWord": "None", "identifyer": 926, "year": "2021"}, {"Unnamed: 0": 113036, "autor": "Franmendez_", "date": 1632262798000, "content": "The Alec Gill Hessle Road photo archive /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/pstmi3/the_alec_gill_hessle_road_photo_archive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "the alec gill hessle road photo -----> archive !!!  /!/ [removed]", "sortedWord": "None", "identifyer": 3068, "year": "2021"}, {"Unnamed: 0": 113767, "autor": "mmmoctopie", "date": 1635390154000, "content": "I'm a lazy photographer. Is there a way to automate posting to blogs, stock sites, instagram from an archive? Or outsource? /!/ I like taking photos, but hate the admin. I think there's some good stuff in my archive but I just can't be bothered investing time to post it. Coming up with taglines, hashtags, ugh. The worst.\n\nHas anyone developed like an auto posting tool yet!? Or how about outsourcing it to someone? Any experience there?", "link": "https://www.reddit.com/r/photography/comments/qhdfme/im_a_lazy_photographer_is_there_a_way_to_automate/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "i'm a lazy photographer. is there a way to automate posting to blogs, stock sites, instagram from an -----> archive !!! ? or outsource? /!/ i like taking photos, but hate the admin. i think there's some good stuff in my archive but i just can't be bothered investing time to post it. coming up with taglines, hashtags, ugh. the worst.\n\nhas anyone developed like an auto posting tool yet!? or how about outsourcing it to someone? any experience there?", "sortedWord": "None", "identifyer": 3831, "year": "2021"}, {"Unnamed: 0": 114174, "autor": "huntnal", "date": 1610947166000, "content": "Online storage options? /!/ Who do you all use for your online storage as a secondary archive of photos and other data?", "link": "https://www.reddit.com/r/photography/comments/kzny0n/online_storage_options/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "online storage options? /!/ who do you all use for your online storage as a secondary -----> archive !!!  of photos and other data?", "sortedWord": "None", "identifyer": 4255, "year": "2021"}, {"Unnamed: 0": 114673, "autor": "SanDiegoDean", "date": 1611769877000, "content": "Advice needed for how to manage my archive /!/  \n\nHi Everyone, this is my fist time posting to this sub. I need some advice on how to manage my digital photo archive. I have over 75K photos spanning 22 years that is now taking 185 GBytes of storage. As you can imagine the resolution of these photos vary widely, starting at 640x720 but the bulk of them are 2592x3872.\n\nI want to keep a couple of copies of the archive at home but I also want to store them in the cloud. The overall storage size is now a problem and I've been doing a little research on how to batch resize just the larger photos and leave the low resolution photos alone while preserving the aspect ratio. Ideally something like a ceiling function, such as, if a photo is larger than x (short edge) or y (long edge) then resize to these maximums. It is unlikely these photos will ever be printed and certainly never larger than 8x10.\n\nMy question is, what are good values for x and y and is there any recommendations on software that will batch process all these photos?", "link": "https://www.reddit.com/r/photography/comments/l6a8ut/advice_needed_for_how_to_manage_my_archive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "advice needed for how to manage my -----> archive !!!  /!/  \n\nhi everyone, this is my fist time posting to this sub. i need some advice on how to manage my digital photo archive. i have over 75k photos spanning 22 years that is now taking 185 gbytes of storage. as you can imagine the resolution of these photos vary widely, starting at 640x720 but the bulk of them are 2592x3872.\n\ni want to keep a couple of copies of the archive at home but i also want to store them in the cloud. the overall storage size is now a problem and i've been doing a little research on how to batch resize just the larger photos and leave the low resolution photos alone while preserving the aspect ratio. ideally something like a ceiling function, such as, if a photo is larger than x (short edge) or y (long edge) then resize to these maximums. it is unlikely these photos will ever be printed and certainly never larger than 8x10.\n\nmy question is, what are good values for x and y and is there any recommendations on software that will batch process all these photos?", "sortedWord": "None", "identifyer": 4775, "year": "2021"}, {"Unnamed: 0": 114674, "autor": "SanDiegoDean", "date": 1611769354000, "content": "Practical advise on photo archiving needed /!/ Hi Everyone, this is my fist time posting to this sub.  I need some advice on how to manage my digital photo archive.  I have over 75K photos spanning 12 years that is now taking 185 GBytes of storage.   As you can imagine the resolution of these photos vary widely, starting at 640x720 but the bulk of them are 2592x3872.\n\nI want to keep a couple of copies of the archive at home  but I also want to store them in the cloud.  The  overall storage size is now a problem and I've been doing a little research on how to batch resize just the larger photos and leave the low resolution photos alone while preserving the aspect ratio.  Ideally something like a ceiling function, such as, if a photo is larger than x (short edge) or y (long edge) then resize to these maximums.  It is unlikely these photos will ever be printed and certainly never larger than 8x10. \n\nMy question is, what are good values for x and y and is there any recommendations on software that will batch process all these photos?", "link": "https://www.reddit.com/r/photography/comments/l6a1a9/practical_advise_on_photo_archiving_needed/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "practical advise on photo archiving needed /!/ hi everyone, this is my fist time posting to this sub.  i need some advice on how to manage my digital photo -----> archive !!! .  i have over 75k photos spanning 12 years that is now taking 185 gbytes of storage.   as you can imagine the resolution of these photos vary widely, starting at 640x720 but the bulk of them are 2592x3872.\n\ni want to keep a couple of copies of the archive at home  but i also want to store them in the cloud.  the  overall storage size is now a problem and i've been doing a little research on how to batch resize just the larger photos and leave the low resolution photos alone while preserving the aspect ratio.  ideally something like a ceiling function, such as, if a photo is larger than x (short edge) or y (long edge) then resize to these maximums.  it is unlikely these photos will ever be printed and certainly never larger than 8x10. \n\nmy question is, what are good values for x and y and is there any recommendations on software that will batch process all these photos?", "sortedWord": "None", "identifyer": 4776, "year": "2021"}, {"Unnamed: 0": 115864, "autor": "AliShlaibeq", "date": 1618411730000, "content": "Advice Needed for Mass Digitization of Physical Photo Archive /!/ Hello,\n\nI currently have a few storage boxes full of pictures to scan and archive. I have started and it has taken me 2 or 3 hours to do 40 pictures, and at this rate I'll die before I finish this lot.\n\nI have been scanning 6 pictures at a time on my scanner bed (1200dpi TIFF). That time doesn't bother me so much as I can read and change the pictures periodically. However, I then have to go into Photoshop, automate crop and straighten them, touch up to the edges (which I am willing to forgo), name them one-by-one and then enter the dates in the metadata so they order properly.\n\nI know the fixing of the edges is ridiculous and I will stop that, but simply opening the files one by one, automating the crop and straighten and saving the files individually is very time consuming. is there any program that will automate this for me? I would be happy so long as it saved the pictures in the order I put them in the scanner (i.e. top to bottom).\n\nAlso, is there a program to mass name the images, for example select 10 pictures name them X and have them be named X (1), X (2), X (3) and so on, rather than do them one-by-one?\n\nMany thanks for any assistance offered.", "link": "https://www.reddit.com/r/photography/comments/mqs4v1/advice_needed_for_mass_digitization_of_physical/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "advice needed for mass digitization of physical photo -----> archive !!!  /!/ hello,\n\ni currently have a few storage boxes full of pictures to scan and archive. i have started and it has taken me 2 or 3 hours to do 40 pictures, and at this rate i'll die before i finish this lot.\n\ni have been scanning 6 pictures at a time on my scanner bed (1200dpi tiff). that time doesn't bother me so much as i can read and change the pictures periodically. however, i then have to go into photoshop, automate crop and straighten them, touch up to the edges (which i am willing to forgo), name them one-by-one and then enter the dates in the metadata so they order properly.\n\ni know the fixing of the edges is ridiculous and i will stop that, but simply opening the files one by one, automating the crop and straighten and saving the files individually is very time consuming. is there any program that will automate this for me? i would be happy so long as it saved the pictures in the order i put them in the scanner (i.e. top to bottom).\n\nalso, is there a program to mass name the images, for example select 10 pictures name them x and have them be named x (1), x (2), x (3) and so on, rather than do them one-by-one?\n\nmany thanks for any assistance offered.", "sortedWord": "None", "identifyer": 6001, "year": "2021"}, {"Unnamed: 0": 116852, "autor": "mmmoctopie", "date": 1621619323000, "content": "Lazy photographers - how are you optimising / minimising time spent posting to Instagram? /!/ Hey all, wondering how any photographers out there are optimising their time spent on posting to instagram?\n\nI get it's a high visibility platform and all and I've only got a couple hundred followers, but as an amateur, I'm too lazy / don't want to spend time on screens to spend a ton of time engaging on it.\n\nMy dream would be if I could have an app or something randomly pull a photo from a selected archive of my shots, then I can just hit post after writing a snappy blurb. Then every now and then I'd override the selected photo for say Christmas, seasonal events, etc.\n\nI get that engagement and the like are critical, but I'm trying to address just making the habit easier of posting content. Again, amateur here, so it's not my financial lifeblood but would like to share more of my stuff, and don't want to ruin the vibe of it being a hobby.", "link": "https://www.reddit.com/r/photography/comments/nhyi1t/lazy_photographers_how_are_you_optimising/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "lazy photographers - how are you optimising / minimising time spent posting to instagram? /!/ hey all, wondering how any photographers out there are optimising their time spent on posting to instagram?\n\ni get it's a high visibility platform and all and i've only got a couple hundred followers, but as an amateur, i'm too lazy / don't want to spend time on screens to spend a ton of time engaging on it.\n\nmy dream would be if i could have an app or something randomly pull a photo from a selected -----> archive !!!  of my shots, then i can just hit post after writing a snappy blurb. then every now and then i'd override the selected photo for say christmas, seasonal events, etc.\n\ni get that engagement and the like are critical, but i'm trying to address just making the habit easier of posting content. again, amateur here, so it's not my financial lifeblood but would like to share more of my stuff, and don't want to ruin the vibe of it being a hobby.", "sortedWord": "None", "identifyer": 7035, "year": "2021"}, {"Unnamed: 0": 117089, "autor": "doobiemoth", "date": 1622167658000, "content": "suggests for a website that arranges photos of varies dimensions similarly to a tumblr archive? /!/ basically i just want to have photos of varies dimensions or vertical vs horizontal that are arranged &amp; evenly spaced/staggered as you scroll. any suggestions?", "link": "https://www.reddit.com/r/photography/comments/nmncr4/suggests_for_a_website_that_arranges_photos_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "suggests for a website that arranges photos of varies dimensions similarly to a tumblr -----> archive !!! ? /!/ basically i just want to have photos of varies dimensions or vertical vs horizontal that are arranged &amp; evenly spaced/staggered as you scroll. any suggestions?", "sortedWord": "None", "identifyer": 7284, "year": "2021"}, {"Unnamed: 0": 117737, "autor": "Pencil-Art", "date": 1625623233000, "content": "Photo storage and Archive /!/ I would like to pose a question. Not sure how many serious photo people are out there. I have been into photography for more than 25 years. Most of my film and slide photos I scanned digitally. My current photo library is just over 500GB in size. It is getting way to large to manage. I have had some scary moments when I thought I lost it all. I have the library on external drive because it is too big. I back it up to another external drive. I was backing up to the cloud but now that is difficult. What are some storage ideas? I was using a Drobo for a while when that came out, but they stopped updating the drivers so it no longer works. I have filtered out some stuff and burned them to disc. This helps but takes up a lot of discs.", "link": "https://www.reddit.com/r/photography/comments/of9cmu/photo_storage_and_archive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "photo storage and -----> archive !!!  /!/ i would like to pose a question. not sure how many serious photo people are out there. i have been into photography for more than 25 years. most of my film and slide photos i scanned digitally. my current photo library is just over 500gb in size. it is getting way to large to manage. i have had some scary moments when i thought i lost it all. i have the library on external drive because it is too big. i back it up to another external drive. i was backing up to the cloud but now that is difficult. what are some storage ideas? i was using a drobo for a while when that came out, but they stopped updating the drivers so it no longer works. i have filtered out some stuff and burned them to disc. this helps but takes up a lot of discs.", "sortedWord": "None", "identifyer": 7950, "year": "2021"}, {"Unnamed: 0": 119105, "autor": "A-Lotta-Things", "date": 1630597674000, "content": "Does anyone have good cheap photobook recommendations for printing a lot of pages? (UK/EU) /!/ I just found an internet archive of all my granddad's photos that he took as a press photographer (most he hasn't seen for 50 years) and I want to make them into a photobook. Problem is there's 1472 photos of his and that's quite expensive to print.   \n\n\nSo any recommendations for cheap photobook printing (or even high quality document printing) that would do around 368 pages of printing in the UK/EU? I see Blurb would do it for around £160 and I'm hoping there's cheaper out there.  \n\n\nMany thanks!", "link": "https://www.reddit.com/r/photography/comments/pgkixd/does_anyone_have_good_cheap_photobook/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "does anyone have good cheap photobook recommendations for printing a lot of pages? (uk/eu) /!/ i just found an internet -----> archive !!!  of all my granddad's photos that he took as a press photographer (most he hasn't seen for 50 years) and i want to make them into a photobook. problem is there's 1472 photos of his and that's quite expensive to print.   \n\n\nso any recommendations for cheap photobook printing (or even high quality document printing) that would do around 368 pages of printing in the uk/eu? i see blurb would do it for around £160 and i'm hoping there's cheaper out there.  \n\n\nmany thanks!", "sortedWord": "None", "identifyer": 9377, "year": "2021"}, {"Unnamed: 0": 120373, "autor": "BeanMan1206", "date": 1629328632000, "content": "Am I crazy for keeping ALL of my RAW files? /!/ Am I crazy for keeping ALL of my RAW files? I have never deleted my RAW files. It has paid off for me a few times when I've been really happy that I have the RAWs to go back and re-edit, but it does use up so much space. I'm going back right now and sorting my archive of files from the last few years and it's dawning on me how much space this is using up, and how much that space costs. Am I (or we) crazy for keeping all of this? I'm a videographer as well, and I KNOW it's worth keeping all of my old clips to make reels and such down the line. What's your opinion on this?", "link": "https://www.reddit.com/r/photography/comments/p72qee/am_i_crazy_for_keeping_all_of_my_raw_files/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "am i crazy for keeping all of my raw files? /!/ am i crazy for keeping all of my raw files? i have never deleted my raw files. it has paid off for me a few times when i've been really happy that i have the raws to go back and re-edit, but it does use up so much space. i'm going back right now and sorting my -----> archive !!!  of files from the last few years and it's dawning on me how much space this is using up, and how much that space costs. am i (or we) crazy for keeping all of this? i'm a videographer as well, and i know it's worth keeping all of my old clips to make reels and such down the line. what's your opinion on this?", "sortedWord": "None", "identifyer": 10699, "year": "2021"}, {"Unnamed: 0": 121661, "autor": "sfwythe", "date": 1611334602000, "content": "Looking for a studio management software /!/ My husband and I are looking for studio management software that has the ability to track client info as well as create and archive session information. The last company we worked for had something custom built through FileMaker, but I’m curious if anybody has something like that that wasn’t made specially for their business. Any recommendations?", "link": "https://www.reddit.com/r/photography/comments/l2rsiu/looking_for_a_studio_management_software/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "looking for a studio management software /!/ my husband and i are looking for studio management software that has the ability to track client info as well as create and -----> archive !!!  session information. the last company we worked for had something custom built through filemaker, but i’m curious if anybody has something like that that wasn’t made specially for their business. any recommendations?", "sortedWord": "None", "identifyer": 12044, "year": "2021"}, {"Unnamed: 0": 121766, "autor": "andyday_", "date": 1612086805000, "content": "Magnum Photos and the Exploitation of Children (TRIGGER WARNING) /!/ [https://www.duckrabbit.info/blog/2021/01/olivia-arthur-now-can-we-talk-about-magnum-photos-and-child-abuse/](https://www.duckrabbit.info/blog/2021/01/olivia-arthur-now-can-we-talk-about-magnum-photos-and-child-abuse/)\n\nThis article is more than 7,000 words detailing Magnum's use of images of exploited and sexually abused women and children. TRIGGER WARNING: The article contains images and accounts that some might find upsetting. \n\nIt examines the presence of problematic photographs in Magnum's archive taken by David Alan Harvey, Chris Steele-Perkins, Christopher Anderson, Paul Zachmann, Antoine D'Agata Stuart Franklin, Larry Towell, and Paolo Pellegrin, and editorial decisions by Martin Parr and Christina De Middel.\n\nAmong other things, it explores how some of these images ended up on paedophilia websites. Others revealed the identity of HIV positive children.\n\n\\[Full disclosure: My own research (published on a photography website) is mentioned in this article. I do not gain anything financially from any clicks on the above link.\\]", "link": "https://www.reddit.com/r/photography/comments/l99bzl/magnum_photos_and_the_exploitation_of_children/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "magnum photos and the exploitation of children (trigger warning) /!/ [https://www.duckrabbit.info/blog/2021/01/olivia-arthur-now-can-we-talk-about-magnum-photos-and-child-abuse/](https://www.duckrabbit.info/blog/2021/01/olivia-arthur-now-can-we-talk-about-magnum-photos-and-child-abuse/)\n\nthis article is more than 7,000 words detailing magnum's use of images of exploited and sexually abused women and children. trigger warning: the article contains images and accounts that some might find upsetting. \n\nit examines the presence of problematic photographs in magnum's -----> archive !!!  taken by david alan harvey, chris steele-perkins, christopher anderson, paul zachmann, antoine d'agata stuart franklin, larry towell, and paolo pellegrin, and editorial decisions by martin parr and christina de middel.\n\namong other things, it explores how some of these images ended up on paedophilia websites. others revealed the identity of hiv positive children.\n\n\\[full disclosure: my own research (published on a photography website) is mentioned in this article. i do not gain anything financially from any clicks on the above link.\\]", "sortedWord": "None", "identifyer": 12153, "year": "2021"}, {"Unnamed: 0": 122606, "autor": "Boogada42", "date": 1617623304000, "content": "How do you deal with your website / archive? /!/ tl;dr: Whats the best way to organize a website to feature a large archive of images, divided into single events/shoots? \n\n\nI have been doing this photo thing for a while now and have assembled quite the back catalogue. First I used basically a gallery software, later I moved to a wordpress based site. Individual events/shoots became single blog entries. Some of the old stuff was moved to the new, some never made it. \n\nA decade later its again time for an update and while I'm at it, I may just finally bring the old stuff back into it. \n\nHowever, quite a bit of websites/templates that are marketed to photographers are basically designed to show a portfolio. A very limited amount of stuff. That doesn't work for me. I have hundreds of items to deal with. And would love to be able to organize these better. \n\nAnything out there, that beats using wordpress blog entries? (Just using entries of a different CMS seems like too little of an improvement, but I'm open to ideas)", "link": "https://www.reddit.com/r/photography/comments/mkisi5/how_do_you_deal_with_your_website_archive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "how do you deal with your website / -----> archive !!! ? /!/ tl;dr: whats the best way to organize a website to feature a large archive of images, divided into single events/shoots? \n\n\ni have been doing this photo thing for a while now and have assembled quite the back catalogue. first i used basically a gallery software, later i moved to a wordpress based site. individual events/shoots became single blog entries. some of the old stuff was moved to the new, some never made it. \n\na decade later its again time for an update and while i'm at it, i may just finally bring the old stuff back into it. \n\nhowever, quite a bit of websites/templates that are marketed to photographers are basically designed to show a portfolio. a very limited amount of stuff. that doesn't work for me. i have hundreds of items to deal with. and would love to be able to organize these better. \n\nanything out there, that beats using wordpress blog entries? (just using entries of a different cms seems like too little of an improvement, but i'm open to ideas)", "sortedWord": "None", "identifyer": 13030, "year": "2021"}, {"Unnamed: 0": 127072, "autor": "catherinecc", "date": 1629407749000, "content": "Are you using Google Drive with Google Photos for photo backup? Don't upgrade your client until you read this! /!/ So, for example, if you were being cheap and saving your entire library on your desktop PC as \"High Quality\" and just not syncing the \"Google Photos\" folder on your laptop.\n\nWith the latest client, you don't have the ability to exclude folders from Google Drive file mirroring. \n\nSo either you lose the ability to have an offline copy of your Google Drive (i.e. \"streaming\") or you have to have a disk big enough to mirror everything including your \"Google Photos\" folder. \n\nThe Google Photos folder is ~250Gb for me, which is big enough to fill a good portion of laptop drives out there. \n\nThe client also isn't able to deal with a ton of files and hangs while downloading your Google Photos folder (or does for me, repeatedly - I do have ~130,000 files with the google photos folder and ~40,000 without) \n\nWhich means google folder mirroring basically doesn't work if you have a large amount of files in your Google Photos archive.\n\nI've had to restart the client like a dozen times to get it to resume downloading Google Photos files but it keeps hanging here and there, requiring me to manually kill and restart it.\n\nAlso Google Takeout is still fundamentally broken.\n\nI honestly never thought I'd be one of the people saying \"don't use online services to back up photos\" but here I am.", "link": "https://www.reddit.com/r/photography/comments/p7nuvi/are_you_using_google_drive_with_google_photos_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "are you using google drive with google photos for photo backup? don't upgrade your client until you read this! /!/ so, for example, if you were being cheap and saving your entire library on your desktop pc as \"high quality\" and just not syncing the \"google photos\" folder on your laptop.\n\nwith the latest client, you don't have the ability to exclude folders from google drive file mirroring. \n\nso either you lose the ability to have an offline copy of your google drive (i.e. \"streaming\") or you have to have a disk big enough to mirror everything including your \"google photos\" folder. \n\nthe google photos folder is ~250gb for me, which is big enough to fill a good portion of laptop drives out there. \n\nthe client also isn't able to deal with a ton of files and hangs while downloading your google photos folder (or does for me, repeatedly - i do have ~130,000 files with the google photos folder and ~40,000 without) \n\nwhich means google folder mirroring basically doesn't work if you have a large amount of files in your google photos -----> archive !!! .\n\ni've had to restart the client like a dozen times to get it to resume downloading google photos files but it keeps hanging here and there, requiring me to manually kill and restart it.\n\nalso google takeout is still fundamentally broken.\n\ni honestly never thought i'd be one of the people saying \"don't use online services to back up photos\" but here i am.", "sortedWord": "None", "identifyer": 17711, "year": "2021"}, {"Unnamed: 0": 128226, "autor": "mofosyne", "date": 1633343397000, "content": "Best program for batch resizing photos? (preferably free) /!/ Posting this message as the original discussion is 10 years ago in https://www.reddit.com/r/photography/comments/kccq2/best_program_for_batch_resizing_photos_preferably/ and it has a link to a useful program that is starting to linkrot.\n\n&gt; The very simple Image Resizer from PX Powertoys is my favorite. Microsoft abandoned it for Windows 7 but someone made a replacement: http://imageresizer.codeplex.com/ Just select the image(s) in Windows Explorer, right click and choose Resize Picture. Then you select the new image size and let the computer do its thing.\n\nLink above is to an archive that said \"CodePlex Archive will be shut down after July 1st, 2021.\", but the original author said that \"This project may now be found at http://bricelam.net/ImageResizer\"\n\nWhich now links to https://www.bricelam.net/ImageResizer/ and which turns out is now part of https://github.com/microsoft/PowerToys microsoft's opensource powertoy!\n\nAnyway it turns out to be useful enough and I like that it integrates itself as a right click in directories.\n\n------\n\nBut anyway 10 years later and I'm sure there is other software to consider now. Give you 10c?", "link": "https://www.reddit.com/r/photography/comments/q12r1o/best_program_for_batch_resizing_photos_preferably/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "best program for batch resizing photos? (preferably free) /!/ posting this message as the original discussion is 10 years ago in https://www.reddit.com/r/photography/comments/kccq2/best_program_for_batch_resizing_photos_preferably/ and it has a link to a useful program that is starting to linkrot.\n\n&gt; the very simple image resizer from px powertoys is my favorite. microsoft abandoned it for windows 7 but someone made a replacement: http://imageresizer.codeplex.com/ just select the image(s) in windows explorer, right click and choose resize picture. then you select the new image size and let the computer do its thing.\n\nlink above is to an -----> archive !!!  that said \"codeplex -----> archive !!!  will be shut down after july 1st, 2021.\", but the original author said that \"this project may now be found at http://bricelam.net/imageresizer\"\n\nwhich now links to https://www.bricelam.net/imageresizer/ and which turns out is now part of https://github.com/microsoft/powertoys microsoft's opensource powertoy!\n\nanyway it turns out to be useful enough and i like that it integrates itself as a right click in directories.\n\n------\n\nbut anyway 10 years later and i'm sure there is other software to consider now. give you 10c?", "sortedWord": "None", "identifyer": 18918, "year": "2021"}], "name": "archivephotography2021"}