{"interestingcomments": [{"Unnamed: 0": 95963, "autor": "DanielJStein", "date": 1618580305000, "content": "Tired of pesky noise messing up your Milky Way shots? Let’s fix that with a little technique called image stacking. I wrote a guide on how to setup your camera to shoot a stack and clean up that noise in post! /!/ Aloha and welcome back to my derpy astro tutorial write-ups. As you may have recalled, [I wrote a piece last month on Milky Way photograpghy basics](https://www.reddit.com/r/photography/comments/lwucza/milky_way_core_season_is_right_around_the_corner/). Today I am going to continue this series and tell you about a game changing technique that you have probably maybe have already heard about. It is known as “image stacking.” The idea is to take several images over time out in the field and then use processing software later on to reduce the noise as a result of a darker, higher ISO image. **This tutorial uses a program called StarryLandscapeStacker. It is a paid Mac app**. *Rest assured, a Windoge version is coming soon, as is a version to do this in Photoshop*. **Plus, the most important part of stacking starts with getting it right when shooting.**\n\nTake a look at [this example of a 1:1 crop of what an image looks like before and after stacking.](https://i.imgur.com/lBqJKsT.jpg)\n\nThe technique requires more work, but as you can see the results speak for themselves. Some phones even have sophisticated programming to compute this process for you. Stacking is becoming more common with computational photography today, but it has been around since the film days of astrophotography. \n\nFirst of all, if you have not done so already, please [read my post](https://danieljstein.com/tutorials/milkywaybasics) on how to find and shoot the Milky Way to familiarize yourself with the techniques we will be discussing here. (Oh yeah and pls shoot RAW ok) Now, let’s move onto stacking, from start to finish. I will first be going over the core basics and describing parts of the process, then I will put everything altogether and summarize. Here we go00oo0000ooo:\n\n# Planning:\n\nStacking requires you stick to a shot for a few minutes. In other words, with single exposures, you can shoot one composition and move on to another immediately thereafter. But with stacking, you will need to setup your shot and shoot several exposures of it over time. This means leaving your camera in the same position for minutes at a time. It’s like standing in a line at a coffee shop or something.\n\nYou will really want to make sure you nail your composition before you begin this process, so take a few quick test shots before shooting your stack sequence to ensure you will be happy with the outcome. These don’t need to be long, just a few seconds with a ridiculously high ISO to understand your framing will do. Like crank it up to sandpaper levels and just do a 3 second shot.\n\nYou may have seen or heard of something called an “[intervalometer](https://www.bhphotovideo.com/c/search?InitialSearch=yes&amp;N=0&amp;Ntt=intervalometer&amp;sts=ma).” Complicated fancy word I know, but basically this is just a programmable remote that can control your camera’s shutter. They come in all different shapes and sizes. #realintervalometershavecurves Some cameras today even have this built in. Having one of these will greatly assist in this process.\n\nIf your camera has a built-in intervalometer, it is best if you familiarize yourself with this function prior to shooting your stack. Most Canon’s and Nikon’s have this built-in, as well as some Sony’s (I think?). They all operate differently, so I suggest you consult your camera’s manual or some YouTuber tutorials on how to use yours.\n\nI personally still prefer using an external intervalometer. I feel like the interface is a lot easier to control my camera versus the built-in ones. Plus, I can always see how many more shots are left in the stack. But, no pressure to get one of these if you have the function built in, use what makes you feel the most comfortable. If your camera does not have a built-in intervalometer however, I really do highly recommend getting one as it will make shooting stacks fully automated. Doing this process manually can be annoying af.\n\n# Calculating how many shots you need\n\nThe more shots you take, the cleaner the output stacked image will be. But, there is a point where diminishing returns kicks in. To keep things simple for this post though, I do not think that is something to worry about. Focus on shooting anywhere between 2 minutes to 30 minutes worth of shots, depending on what and how you are shooting.\n\nUse your intervalometer to figure out how long the sequence will take.  So let’s say according to the [NPF Rule](https://www.lonelyspeck.com/advanced-astrophotography-shutter-time-calculator/) you are going to have a 15 second shutter speed at f/2.8 and ISO 3200. If you dial in that you want 7 shots with a 1 second interval in between, that would be 112 seconds spend shooting. That is a pretty good chunk of data, but you can still get some more and get an even cleaner shot.\n\n**A few hot notes:** \n\n* Like I said, the more shots you get the better. If you find you are using a higher ISO like 6400 and above, it would be wise to get more shots.\n* If you are pressed for time in any way. For example clouds are rolling in, you gotta leave, you want to take other shots, you sandwich is getting cold, etc. then shoot less.\n* The tradeoff of shooting more shots is less noise and thus more detail.\n* If I personally am stacking I will usually go for 10-30 minutes of data for my nightscapes. Deep space is whole other ball game. For the purposes of this tut, we are focusing on nightscapes and the Milky Way with a wider lens.\n\nOnce you have toyed around with your intervalometer, shoot! Let the technology do the work for you. Set it and forget it. This is where not having the intervalometer will be dingly, because you will need to trigger the camera manually for each shot. \n\n### Now the biggy, programming your camera to shoot!!!1111!!!111!!1!11011001!!!!\n\nThere are two ways to do this as discussed. Either use your external intervalometer or your cameras built-in one. I will go over both, but just know that many intervalometers and cameras work differently. This is intended to be a guideline and the methods discussed here may not directly correlate to your setup. However, the concepts are very similar between cameras and remotes and this should help give you an idea of how to program. \n\n### Method 1: external remote:\n\n1. [Plug in your remote and set your camera to bulb mode](https://i.imgur.com/rQMkmoj.jpg). We want to give all shutter control to the remote.\n2. **Ensure long exposure noise reduction and self-timer are both off.**\n3. Dial in your other settings, such as ISO, aperture, white balance, and make sure your lens is in focus.\n4. Head over to your remote and power it on. [The first screen may indicate a delay.](https://i.imgur.com/bKeToa9.jpg) We do not need that for this so make sure everything shows a “0.”\n5. [The next screen](https://i.imgur.com/SjHtrZT.jpg)may show as “long” like my dog. He is long. This is your shutter speed. Dial it in according to the NPF rule.\n6. [The following is the interval.](https://i.imgur.com/VEnFq0Y.jpg) This is the duration between each shot. We want this as short as possible for easier processing. I set mine to “01” for 1 second.\n7. [The final screen is marked as “n.”](https://i.imgur.com/W43uaLq.jpg) This is the number of shots to do. I will do 20 for this round, giving me a total of 100 seconds of data. Eh, should probably do more.\n8. Press start and sit back while the technology does the work for you. \n\n### Method 2: Built-In\n\n1. Built-in intervalometers work a little differently to external. We want the camera to have full control here, so first step is to dial in your shutter speed. \n2. **Ensure long exposure noise reduction and self-timer are both off.**\n3. [Then dial in all your other settings, again ensure you are in focus.](https://i.imgur.com/So2MHhk.jpg)\n4. [Navigate to where the interval timer function is in you camera.](https://i.imgur.com/QOabPly.jpg)\n5. Make sure the time is set to[the time now](https://i.imgur.com/eEGnOG1.jpg)if your camera has that option. \n6. [Programming the interval is a bit different here](https://i.imgur.com/sABGQ2t.jpg). Unlike with the remote where the shutter speed was separate from the time between each shot, here it is integrated and can be a little confusing. In other words, my shutter speed is 5 seconds, but I sill want a 1 second interval beteen each shot. This means the total interval needs to be set to “6 seconds”\n7. [Set the number of shots to do, in my case again, 20.](https://i.imgur.com/EQqi714.jpg)\n\n# Processing\n\nAfter the shoot it is time to process. I mean yeah that is normally how it works but you get what I mean. There are loads of different pieces of free and paid stacking softwares out there. I personally use StarryLandscapeStacker (SLS), which is a **paid Mac application**. I will be creating an additional tutorial to use the Windoge free equivalent, Sequator as well. Both pieces of software are very similar however so if you have a basic understanding of a processing workflow you may be able to easily transfer this tutorial over to that one.\n\n1. First, we need to catalog everything in Lightroom or another similar raw image processor. While SLS can read RAW files, it is often easier to make some minor adjustments in something like LR or CaptureOne prior to loading into SLS.\n2. According to the SLS user guide, it is best to lower the contrast all the way, as well as turn off any sort of lens and vignette corrections. You also need to turn off noise reduction and sharpening. **My take:** Turn off sharpening and noise reduction, yes. But as far as contrast goes I find that sometimes dropping it down all the way and then trying to add it back in again later creates strange artifacts in the image. I would just leave this at 0. For lens corrections, your mileage may vary. Sometimes I get unwanted results with them on, sometimes with them off. You will need to experiment with this. I would first start with them **off.**\n3. I would also lower your highlights a bit and bump up the shadows a bit. I would adjust the exposure here as well if your image is too bright or too dark. **Do not** add any sort of clarity/texture/saturation adjustments however.\n4. Select all your images and apply your adjustments. \n5. Export as 16 bit TIFFs in the ProphotoRGB color space. **Do not resize your images!** Below are my export settings. If I were you, group your set of shots in a folder. This makes file management much easier to work with.\n6. Once complete, open up StarryLandscapeStacker and it will automatically prompt you to import your images. Locate the folder you made in the previous step and let em rip.\n7. SLS will automatically analyze your shots. If it detects any discrepancies, it will prompt you. It may ask you to select dark/light/flat frames. Don’t worry about these for now. Everything here is considered a “light” frame. I will talk about these other frames in a future tut.\n8. Once complete, you will notice red dottts all over your image. Red dots are what SLS uses to determine where the sky is and isn’t. With that in mind, you need to erase red dots where they are present in the foreground. Do this by clicking “erase red dots” over on the left. Wild, I know.\n9. The next thing that needs to be done in order for the software to work properly is some red dots actually need to be drawn back in following the horizon. Do so by clicking add red dots on the left. Draw your dots following your horizon line. It doesn’t need to be perfect. What we are doing here is telling the software where the foreground stops and the sky begins. This will improve how it aligns and stacks your images.\n10. Now it is time to make the sky mask. Click the “Find Sky” button on the left and watch SLS do magic.\n11. The mask will most likely not be clean right outta the box, so it needs to be cleaned up. At this point, we need to use the blue paint to make sure the entire sky is covered. Likewise, the ground needs to be completely blue free. Eifel 65 would not be proud of the ground. The sky on the other hand…\n12. If you are familiar with Photoshop, the brush works similarly to the one found in there. You can use the brackets to increase or decrease the brush size. You can also increase or decrease the opacity of the blue overlay if that helps you clean up the mask.\n13. In the end, only the sky should be blue. Try your best to clean up the horizon. It doesn’t need to be perfect (unlike my dog, who is perfect), there just needs to be absolutely no blue in the foreground. If you are not sure if you missed a spot, crank up the opacity of the blue. Missed a spot.\n14. Once the mask is ready to rave, mash that “Align and Composite” button on the left and let the show begin.\n15. At this point, SLS has used the mask to create two different photos which have been seamlessly blended together. The first is the sky photo, which has been aligned using the stars in each photo. Since the stars move relative to the Earth’s rotation, they need to be aligned.\n16. The second image is the foreground which does not move. There is no need to align these images. Doing so relative to the star layer would actually cause it to be blurred. Thus, it is stacked separately.\n17. There is a lot going on in the background of this software. In my opinion I feel like it is crazy how quick and effective it is. 2021 man. (altho pretty sure this joint came out in 2014)\n18. At this point, the software presents several algorithms you can choose from over on the left. If you hover over them, you will find a brief explanation of what they do. Play around with these and see which algo fits your image best. **My take:** I have had the best results with “Mean Min Horizon Noise,” and “Mean Min Horizon Star Dupe.” Again play around with these, your mileage may vary.\n19. Use the “Z” key to zoom in 100% while messing with these. This can help determine which one works best.\n20. Once complete, press “Save the Current” image. You can also save the mask you created with the blue paint. This can be helpful if you are masking in a different foreground image, for example if you took a blue hour foreground shot.\n21. Images will be saved as a 16-bit TIFF. Once you are done, continue with your edits by importing in an image editor of your choice.\n\n# Let’s Recap\n\nOkay so here is what we learned in boating school today kids. \n\n1. Plan out your shot by taking quick test compositions of what you want to shoot.\n2. Figure out how long it is going to take to shoot your stack. The more shots you shoot, the cleaner your image will be, but the longer it will take.\n3. Use an external intervalometer or your camera’s built-in function to take your shots.\n4. Once you get back to your computer, apply the same edits to each RAW file and export.\n5. Open the files in StarryLandscapeStacker and let it work its magic.\n6. Erase the dots in your foreground, and add dots in your sky and horizon where applicable.\n7. Find the sky and refine the mask with your brush, ensuring nothing in your foreground is painted.\n8. Composite your image and select an algorithm that works best for your shot.\n9. Save your image and enjoy an astro image that has significantly less noise than a single exposure. Continue working with your shot in your processing software of choice.", "link": "https://www.reddit.com/r/photography/comments/ms3bv1/tired_of_pesky_noise_messing_up_your_milky_way/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "tired of pesky noise messing up your milky way shots? let’s fix that with a little technique called image stacking. i wrote a guide on how to setup your camera to shoot a stack and clean up that noise in post! /!/ aloha and welcome back to my derpy astro tutorial write-ups. as you may have recalled, [i wrote a piece last month on milky way photograpghy basics](https://www.reddit.com/r/photography/comments/lwucza/milky_way_core_season_is_right_around_the_corner/). today i am going to continue this series and tell you about a game changing technique that you have probably maybe have already heard about. it is known as “image stacking.” the idea is to take several images over time out in the field and then use processing software later on to reduce the noise as a result of a darker, higher iso image. **this tutorial uses a program called starrylandscapestacker. it is a paid mac app**. *rest assured, a windoge version is coming soon, as is a version to do this in photoshop*. **plus, the most important part of stacking starts with getting it right when shooting.**\n\ntake a look at [this example of a 1:1 crop of what an image looks like before and after stacking.](https://i.imgur.com/lbqjkst.jpg)\n\nthe technique requires more work, but as you can see the results speak for themselves. some phones even have sophisticated programming to compute this process for you. stacking is becoming more common with computational photography today, but it has been around since the film days of astrophotography. \n\nfirst of all, if you have not done so already, please [read my post](https://danieljstein.com/tutorials/milkywaybasics) on how to find and shoot the milky way to familiarize yourself with the techniques we will be discussing here. (oh yeah and pls shoot raw ok) now, let’s move onto stacking, from start to finish. i will first be going over the core basics and describing parts of the process, then i will put everything altogether and summarize. here we go00oo0000ooo:\n\n# planning:\n\nstacking requires you stick to a shot for a few minutes. in other words, with single exposures, you can shoot one composition and move on to another immediately thereafter. but with stacking, you will need to setup your shot and shoot several exposures of it over time. this means leaving your camera in the same position for minutes at a time. it’s like standing in a line at a coffee shop or something.\n\nyou will really want to make sure you nail your composition before you begin this process, so take a few quick test shots before shooting your stack sequence to ensure you will be happy with the outcome. these don’t need to be long, just a few seconds with a ridiculously high iso to understand your framing will do. like crank it up to sandpaper levels and just do a 3 second shot.\n\nyou may have seen or heard of something called an “[intervalometer](https://www.bhphotovideo.com/c/search?initialsearch=yes&amp;n=0&amp;ntt=intervalometer&amp;sts=ma).” complicated fancy word i know, but basically this is just a programmable remote that can control your camera’s shutter. they come in all different shapes and sizes. #realintervalometershavecurves some cameras today even have this built in. having one of these will greatly assist in this process.\n\nif your camera has a built-in intervalometer, it is best if you familiarize yourself with this function prior to shooting your stack. most canon’s and nikon’s have this built-in, as well as some sony’s (i think?). they all operate differently, so i suggest you consult your camera’s manual or some youtuber tutorials on how to use yours.\n\ni personally still prefer using an external intervalometer. i feel like the interface is a lot easier to control my camera versus the built-in ones. plus, i can always see how many more shots are left in the stack. but, no pressure to get one of these if you have the function built in, use what makes you feel the most comfortable. if your camera does not have a built-in intervalometer however, i really do highly recommend getting one as it will make shooting stacks fully automated. doing this process manually can be annoying af.\n\n# calculating how many shots you need\n\nthe more shots you take, the cleaner the output stacked image will be. but, there is a point where diminishing returns kicks in. to keep things simple for this post though, i do not think that is something to worry about. focus on shooting anywhere between 2 minutes to 30 minutes worth of shots, depending on what and how you are shooting.\n\nuse your intervalometer to figure out how long the sequence will take.  so let’s say according to the [npf rule](https://www.lonelyspeck.com/advanced-astrophotography-shutter-time-calculator/) you are going to have a 15 second shutter speed at f/2.8 and iso 3200. if you dial in that you want 7 shots with a 1 second interval in between, that would be 112 seconds spend shooting. that is a pretty good chunk of data, but you can still get some more and get an even cleaner shot.\n\n**a few hot notes:** \n\n* like i said, the more shots you get the better. if you find you are using a higher iso like 6400 and above, it would be wise to get more shots.\n* if you are pressed for time in any way. for example clouds are rolling in, you gotta leave, you want to take other shots, you sandwich is getting cold, etc. then shoot less.\n* the tradeoff of shooting more shots is less noise and thus more detail.\n* if i personally am stacking i will usually go for 10-30 minutes of data for my nightscapes. deep space is whole other ball game. for the purposes of this tut, we are focusing on nightscapes and the milky way with a wider lens.\n\nonce you have toyed around with your intervalometer, shoot! let the technology do the work for you. set it and forget it. this is where not having the intervalometer will be dingly, because you will need to trigger the camera manually for each shot. \n\n### now the biggy, programming your camera to shoot!!!1111!!!111!!1!11011001!!!!\n\nthere are two ways to do this as discussed. either use your external intervalometer or your cameras built-in one. i will go over both, but just know that many intervalometers and cameras work differently. this is intended to be a guideline and the methods discussed here may not directly correlate to your setup. however, the concepts are very similar between cameras and remotes and this should help give you an idea of how to program. \n\n### method 1: external remote:\n\n1. [plug in your remote and set your camera to bulb mode](https://i.imgur.com/rqmkmoj.jpg). we want to give all shutter control to the remote.\n2. **ensure long exposure noise reduction and self-timer are both off.**\n3. dial in your other settings, such as iso, aperture, white balance, and make sure your lens is in focus.\n4. head over to your remote and power it on. [the first screen may indicate a delay.](https://i.imgur.com/bketoa9.jpg) we do not need that for this so make sure everything shows a “0.”\n5. [the next screen](https://i.imgur.com/sjhtrzt.jpg)may show as “long” like my dog. he is long. this is your shutter speed. dial it in according to the npf rule.\n6. [the following is the interval.](https://i.imgur.com/venfq0y.jpg) this is the duration between each shot. we want this as short as possible for easier processing. i set mine to “01” for 1 second.\n7. [the final screen is marked as “n.”](https://i.imgur.com/w43ualq.jpg) this is the number of shots to do. i will do 20 for this round, giving me a total of 100 seconds of data. eh, should probably do more.\n8. press start and sit back while the technology does the work for you. \n\n### method 2: built-in\n\n1. built-in intervalometers work a little differently to external. we want the camera to have full control here, so first step is to dial in your shutter speed. \n2. **ensure long exposure noise reduction and self-timer are both off.**\n3. [then dial in all your other settings, again ensure you are in focus.](https://i.imgur.com/so2mhhk.jpg)\n4. [navigate to where the interval timer function is in you camera.](https://i.imgur.com/qoabply.jpg)\n5. make sure the time is set to[the time now](https://i.imgur.com/eegnog1.jpg)if your camera has that option. \n6. [programming the interval is a bit different here](https://i.imgur.com/sabgq2t.jpg). unlike with the remote where the shutter speed was separate from the time between each shot, here it is integrated and can be a little confusing. in other words, my shutter speed is 5 seconds, but i sill want a 1 second interval beteen each shot. this means the total interval needs to be set to “6 seconds”\n7. [set the number of shots to do, in my case again, 20.](https://i.imgur.com/eqqi714.jpg)\n\n# processing\n\nafter the shoot it is time to process. i mean yeah that is normally how it works but you get what i mean. there are loads of different pieces of free and paid stacking softwares out there. i personally use starrylandscapestacker (sls), which is a **paid mac application**. i will be creating an additional tutorial to use the windoge free equivalent, sequator as well. both pieces of software are very similar however so if you have a basic understanding of a processing workflow you may be able to easily transfer this tutorial over to that one.\n\n1. first, we need to catalog everything in lightroom or another similar raw image processor. while sls can read raw files, it is often easier to make some minor adjustments in something like lr or captureone prior to loading into sls.\n2. according to the sls user guide, it is best to lower the contrast all the way, as well as turn off any sort of lens and vignette corrections. you also need to turn off noise reduction and sharpening. **my take:** turn off sharpening and noise reduction, yes. but as far as contrast goes i find that sometimes dropping it down all the way and then trying to add it back in again later creates strange artifacts in the image. i would just leave this at 0. for lens corrections, your mileage may vary. sometimes i get unwanted results with them on, sometimes with them off. you will need to experiment with this. i would first start with them **off.**\n3. i would also lower your highlights a bit and bump up the shadows a bit. i would adjust the exposure here as well if your image is too bright or too dark. **do not** add any sort of clarity/texture/saturation adjustments however.\n4. select all your images and apply your adjustments. \n5. export as 16 bit tiffs in the prophotorgb color space. **do not resize your images!** below are my export settings. if i were you, group your set of shots in a folder. this makes -----> file !!!  -----> management !!!  much easier to work with.\n6. once complete, open up starrylandscapestacker and it will automatically prompt you to import your images. locate the folder you made in the previous step and let em rip.\n7. sls will automatically analyze your shots. if it detects any discrepancies, it will prompt you. it may ask you to select dark/light/flat frames. don’t worry about these for now. everything here is considered a “light” frame. i will talk about these other frames in a future tut.\n8. once complete, you will notice red dottts all over your image. red dots are what sls uses to determine where the sky is and isn’t. with that in mind, you need to erase red dots where they are present in the foreground. do this by clicking “erase red dots” over on the left. wild, i know.\n9. the next thing that needs to be done in order for the software to work properly is some red dots actually need to be drawn back in following the horizon. do so by clicking add red dots on the left. draw your dots following your horizon line. it doesn’t need to be perfect. what we are doing here is telling the software where the foreground stops and the sky begins. this will improve how it aligns and stacks your images.\n10. now it is time to make the sky mask. click the “find sky” button on the left and watch sls do magic.\n11. the mask will most likely not be clean right outta the box, so it needs to be cleaned up. at this point, we need to use the blue paint to make sure the entire sky is covered. likewise, the ground needs to be completely blue free. eifel 65 would not be proud of the ground. the sky on the other hand…\n12. if you are familiar with photoshop, the brush works similarly to the one found in there. you can use the brackets to increase or decrease the brush size. you can also increase or decrease the opacity of the blue overlay if that helps you clean up the mask.\n13. in the end, only the sky should be blue. try your best to clean up the horizon. it doesn’t need to be perfect (unlike my dog, who is perfect), there just needs to be absolutely no blue in the foreground. if you are not sure if you missed a spot, crank up the opacity of the blue. missed a spot.\n14. once the mask is ready to rave, mash that “align and composite” button on the left and let the show begin.\n15. at this point, sls has used the mask to create two different photos which have been seamlessly blended together. the first is the sky photo, which has been aligned using the stars in each photo. since the stars move relative to the earth’s rotation, they need to be aligned.\n16. the second image is the foreground which does not move. there is no need to align these images. doing so relative to the star layer would actually cause it to be blurred. thus, it is stacked separately.\n17. there is a lot going on in the background of this software. in my opinion i feel like it is crazy how quick and effective it is. 2021 man. (altho pretty sure this joint came out in 2014)\n18. at this point, the software presents several algorithms you can choose from over on the left. if you hover over them, you will find a brief explanation of what they do. play around with these and see which algo fits your image best. **my take:** i have had the best results with “mean min horizon noise,” and “mean min horizon star dupe.” again play around with these, your mileage may vary.\n19. use the “z” key to zoom in 100% while messing with these. this can help determine which one works best.\n20. once complete, press “save the current” image. you can also save the mask you created with the blue paint. this can be helpful if you are masking in a different foreground image, for example if you took a blue hour foreground shot.\n21. images will be saved as a 16-bit tiff. once you are done, continue with your edits by importing in an image editor of your choice.\n\n# let’s recap\n\nokay so here is what we learned in boating school today kids. \n\n1. plan out your shot by taking quick test compositions of what you want to shoot.\n2. figure out how long it is going to take to shoot your stack. the more shots you shoot, the cleaner your image will be, but the longer it will take.\n3. use an external intervalometer or your camera’s built-in function to take your shots.\n4. once you get back to your computer, apply the same edits to each raw file and export.\n5. open the files in starrylandscapestacker and let it work its magic.\n6. erase the dots in your foreground, and add dots in your sky and horizon where applicable.\n7. find the sky and refine the mask with your brush, ensuring nothing in your foreground is painted.\n8. composite your image and select an algorithm that works best for your shot.\n9. save your image and enjoy an astro image that has significantly less noise than a single exposure. continue working with your shot in your processing software of choice.", "sortedWord": "None", "identifyer": 98544, "year": "2021"}, {"Unnamed: 0": 114495, "autor": "Sensitive-Hair9303", "date": 1611504236000, "content": "An all-in-one photo and file management organizer with face and environment recognition. /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/l422x7/an_allinone_photo_and_file_management_organizer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "an all-in-one photo and -----> file !!!  -----> management !!!  organizer with face and environment recognition. /!/ [removed]", "sortedWord": "None", "identifyer": 4589, "year": "2021"}, {"Unnamed: 0": 117908, "autor": "MrStealY0Meme", "date": 1624856487000, "content": "Any recommendation for a Lightroom alternative? /!/ I just need file management and basic editing.\n\nI don’t mind subscribing to another, just that i don’t want to pay a fee if I want to cancel anytime.", "link": "https://www.reddit.com/r/photography/comments/o9ddtf/any_recommendation_for_a_lightroom_alternative/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "any recommendation for a lightroom alternative? /!/ i just need -----> file !!!  -----> management !!!  and basic editing.\n\ni don’t mind subscribing to another, just that i don’t want to pay a fee if i want to cancel anytime.", "sortedWord": "None", "identifyer": 8130, "year": "2021"}], "name": "managementphotography2021"}