{"interestingcomments": [{"Unnamed: 0": 274134, "autor": "theo_sontag", "date": 1525361160000, "content": "Best method for collaborative photo album /!/ Hi all, I am working to create a photo book for my son's teacher's retirement. I have a lot of photos \\(300\\) from a lot of people. They are currently located in a Facebook Group album. \n\nMy goal is to, as seamlessly as possible, find the best way to \\(1\\) manage the photo files, captions, and photographer name, and \\(2\\) create a decent photobook uploading the photo with the caption and photographer.\n\nSo far, I've downloaded the photos from FB \\(300 of them\\), and renamed them 1.jpg to 300.jpg. Captions and photographer info have yet to be copied. I'm having difficulty knowing how best to juggle this info.\n\nOn file management, my first thought is to create a spreadsheet with three columns \\(A: Photo #, B: Caption, C: Photographer\\), and then find a site to upload &amp; arrange the photos, then copy/paste the caption info.\n\nI'm feeling overwhelmed by the prospect of a million copy/pastes between websites. I haven't created a book like this, and looking for guidance from some more experienced people. Thanks!", "link": "https://www.reddit.com/r/photography/comments/8gr70b/best_method_for_collaborative_photo_album/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "best method for collaborative photo album /!/ hi all, i am working to create a photo book for my son's teacher's retirement. i have a lot of photos \\(300\\) from a lot of people. they are currently located in a facebook group album. \n\nmy goal is to, as seamlessly as possible, find the best way to \\(1\\) manage the photo files, captions, and photographer name, and \\(2\\) create a decent photobook uploading the photo with the caption and photographer.\n\nso far, i've downloaded the photos from fb \\(300 of them\\), and renamed them 1.jpg to 300.jpg. captions and photographer info have yet to be copied. i'm having difficulty knowing how best to juggle this info.\n\non -----> file !!!  -----> management !!! , my first thought is to create a spreadsheet with three columns \\(a: photo #, b: caption, c: photographer\\), and then find a site to upload &amp; arrange the photos, then copy/paste the caption info.\n\ni'm feeling overwhelmed by the prospect of a million copy/pastes between websites. i haven't created a book like this, and looking for guidance from some more experienced people. thanks!", "sortedWord": "None", "identifyer": 20025, "year": "2018"}, {"Unnamed: 0": 290946, "autor": "judefinisterra", "date": 1542467226000, "content": "File management program for videos /!/ I really like the file management of lightroom and find that it significantly cuts back on my work flow. However, I have begun shooting videos and, while Lightroom file management technically works with these files, it doesn't work very well and isn't very useful. Is there another program that will allow me to quickly scan through imported video files, flag the files I like, and then upload them to Premier Pro?", "link": "https://www.reddit.com/r/photography/comments/9xx0xc/file_management_program_for_videos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "-----> file !!!  -----> management !!!  program for videos /!/ i really like the file management of lightroom and find that it significantly cuts back on my work flow. however, i have begun shooting videos and, while lightroom file management technically works with these files, it doesn't work very well and isn't very useful. is there another program that will allow me to quickly scan through imported video files, flag the files i like, and then upload them to premier pro?", "sortedWord": "None", "identifyer": 37483, "year": "2018"}], "name": "managementphotography2018"}