{"interestingcomments": [{"Unnamed: 0": 60094, "autor": "Rhododendrites", "date": 1596554228000, "content": "Iowa's county map must be a panorama -- can't believe they didn't notice the stitching errors", "link": "https://www.reddit.com/r/photography/comments/i3l5c8/iowas_county_map_must_be_a_panorama_cant_believe/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "iowa's county -----> map !!!  must be a panorama -- can't believe they didn't notice the stitching errors", "sortedWord": "None", "identifyer": 61556, "year": "2020"}, {"Unnamed: 0": 60840, "autor": "fasteddy959", "date": 1583206391000, "content": "Choosing a Monitor for Photographic Editing /!/ I spent a lot of time researching and studying monitor specs, color science, and photographic capabilities to try and decide what the best monitor for my needs would be. I have recently updated my computer set up and decided it was time to get a professional spec monitor to really step up my abilities. \n\n**TL;DR** Color Gamut and Bit Depth are probably the most important for some photographers, understand your output and that will dictate your requirements! Online only really means sRGB and 8bit, Online + Printing you'll need AdobeRGB and 10bit. Resolution is up to you\n\nI had a pretty strict budget and reasonable expectations (I didn’t want to spend $4,000+ on an Eizo or Pro Display XDR) and wanted to spend that money as reasonably as possible. My needs were decent resolution, a wide color gamut, and a large display surface. I am printing more of my photos and find myself being disappointed that I don’t produce what my screen shows. For reference I am coming from a 2011 iMac and 2012 MacBook Pro Retina. \n\n*Note: This is not a review of a monitor or a personal recommendation, this is a synopsis of the information I learned when trying to make my own decision.* \n\n**Color Gamut**: This was the most important thing I found to improve my photography. A lot of research was done on my part into the science of color, which is a post for another day. \n\nMy decision was between two color gamut capabilities, sRGB and AdobeRGB. Most monitors you can purchase today are capable of sRGB. More professional oriented monitors expand the gamut capabilities to AdobeRGB. AdobeRGB is a larger color gamut than sRGB, it was created to encompass the color gamut of CMYK printers to more accurately represent the colors captured. Using sRGB for printing can leave colors out, for example you lose some green and cyan output ability if you print a photo in sRGB. Because of this I wanted a monitor that was capable of displaying the AdobeRGB gamut to accurately depict what my printer is capable of and therefore when I edit a photograph I will be editing within the capabilities of my printer and not my monitor. The below image shows the AdobeRGB gamut, sRGB, and a CMYK generic gamut. Notice that the CMYK is capable of showing more shades than sRGB, so capturing in sRGB and printing means you are not getting the fully \"picture.\"\n\n&amp;#x200B;\n\n[AbodeRGB, CMYK, and sRGB gamuts mapped on the CIE 1931 Chromaticity plot \\(original source unknown\\)](https://preview.redd.it/iqltitn7ndk41.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=7f34fba0e5720e9caf002bb41c19ecfbc2b12918)\n\nIf however you consume and output your photographs digitally and find your prints to be acceptable (if you even care about printing) than an sRGB monitor will be perfect and will not break the bank. A huge number of monitors exist that can display 100% of sRGB that are very inexpensive.\n\nIf you are like me and want to be able to see all of the colors your outputs are capable of (you can set most AdobeRGB monitors to display sRGB for digital editing) then you should be looking for not just a wide gamut monitor, but one capable of 95% or more of the AdobeRGB gamut. \n\n**Bit Depth**: There is A LOT of confusion about Bit Depth on monitors. There are three options generally out there for people who are advanced photographers, but maybe not a studio professional using a medium format camera. 8 Bit, “10 Bit”, and 10 Bit. The bit depth determines how many shades of one of the components of the display (Red, Green, Blue) can do from 100% brightness to 0%. 8 bit divides each color into 256 discrete values of brightness. Combining these 256 levels of Red, Green, and Blue leads to 16,777,216 “colors.” \n\n*Note: This is something that is in contention, the meaning of number of colors, I prescribe to the notion that it is 16.7 million discrete color values, which is the more technical definition and more accurate.*\n\nThere are two versions of 10 bit, true 10 bit and “10 bit”, otherwise known as 8 bit + FRC (Frame Rate Control). 10 bit depth means the device is capable of displaying 1,073,741,824 shades of color (in whatever gamut you have). \n\nFRC is a fancy trick monitors play with the frame rate of each pixel and surrounding pixels, effectively creating 4 shades (100%,75%, etc) behind the 256 shades of each pixel component (bringing the total to 1024 shades for each component). Some people have no issues with this, since technically the human eye can only perceive around 16 million shades of color, so 8 bit is all we can perceive. The issue however is when the color gamut gets larger. That means the Red, Green, and Blue components are further away from each other. If we send the signal to show shade 200 Green and 201 Green we can barely perceive the difference on an sRGB display, but since AdobeRGB has expanded into the Green region more, the difference between shade 200 and 201 of Green is larger, exacerbating the difference in shades. When comparing 8 bit to 10 bit, 1 shade in 8 bit color could be 4 different shades in 10 bit.\n\nUsing 10bit color then allows a more precise representation of colors with a finer resolution. Gradients will be smoother, which is the biggest benefit. Posterization will not be visible. In my situation having AdobeRGB required me to have a 10 bit capable monitor to avoid posterization. \n\n***ACHTUNG****: 10 bit displays need 10 bit output from your graphics card. Check your machines capabilities before purchasing a 10 bit monitor, unless you are future-proofing your setup. For your information, the MacBook Pro 16\" is capable of outputting 10 bit color on DisplayPort 1.4 (through the Thunderbolt Alt Mode).*\n\n**Resolution**: This is purely a personal preference in general. If you want 4K, then go for it. There are tons of 4K monitors on the market with sRGB coverage, there are fewer when you are looking for 4K and AdobeRGB. And then they start to get somewhat expensive. \n\nIn my search I worried over whether I needed 4K since so many screens have very large PPI (pixels per inch) and have some incredible perceived sharpness. There are arguments for and against these large resolution monitors. Some photographers prefer 1440p (2560x1440) on 27” screens as this allows then to view photos at 100%, which effectively would make them larger than on a 4K monitor. In addition some find it easier to judge critical focus on these 108 PPI screens (as opposed to &gt;150PPI on a 4K screen). That being said, if you want a 32” monitor then a 4K resolution is very acceptable. \n\nAgain, resolution is a personal preference. I got over the worries that I NEEDED 4K, it opened up a lot more possibilities for monitors with AdobeRGB gamuts.\n\n**Size**: Again personal preference, I chose a 27” monitor. I felt 32” was excessive at the distance I would view it at, and found myself turning my head to view things at the edge of display. \n\nI think Resolution and Screen Size are something that should go hand in hand, shoot for a minimum of 108PPI. Balance your wants with your budget.\n\nMy Choice: I chose the BenQ SW270C. It is AdobeRGB 99% coverage, 1440p, 27”, and 10 bit capable. In addition it has USB-C connections making it easy for me to connect to. A nifty inclusion, which comes with a number of Professional grade monitors, is the monitor hood. It really cuts the side glare I get from the windows in my studio area and makes the screen really pop. I recommend that you consider all of your needs and how you shoot and distribute your photos.\n\nIn my opinion there are two true requirements that need to be balanced: Color Gamut-Bit Depth and Resolution-Size. This wasn’t very obvious to me at first, but these are things that should go hand in hand. Wider gamuts should have higher bit depths, and larger screens need larger resolutions (of course this is more of a personal preference)\n\nThere is nothing wrong with shooting and displaying in sRGB, really an AdobeRGB monitor is only going to be useful for some photographers. \n\nA Few Notes:\n\n&amp;#x200B;\n\n1. Color Gamut: There are hundreds of publications that explain the science of color. I recommend doing some research if you enjoy linear algebra and the science of human perception. However, the point I want to make is that if you set your camera to auto and leave it in JPEG you are probably capturing things in sRGB. Unless your camera is capable of capturing RAW or AdobeRGB and high color bit depth, a AdobeRGB monitor is not going to be very useful for you. Save your money and invest it in a RAW capable camera or some more education if you want to get into that level of photography. \n2. Color Calibration: Out of the box most monitors are great, including the professional ones. However, calibration of a monitor can improve the performance and is necessary when you start printing fine art. Calibrating your monitor and your printer will make the outputs between the monitor and printer match more closely, making it much easier to edit your photos and get a great print sooner. If you plan on calibrating it is a good idea to find a monitor that allows for \"Hardware Calibration.\" This is calibrating the internal Look Up Tables (LUTs) of the monitor that allows for better and more accurate processing of the input signal from the computer (10bit to 16bit to 10bit). The LUTs allow the display to **accurately** display the colors from the computer. Each monitor does not have a linear response to each component, so increasing the depth to 16bit during the translation means that the output will be better matched to the displays capabilities.", "link": "https://www.reddit.com/r/photography/comments/fcoiqc/choosing_a_monitor_for_photographic_editing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "choosing a monitor for photographic editing /!/ i spent a lot of time researching and studying monitor specs, color science, and photographic capabilities to try and decide what the best monitor for my needs would be. i have recently updated my computer set up and decided it was time to get a professional spec monitor to really step up my abilities. \n\n**tl;dr** color gamut and bit depth are probably the most important for some photographers, understand your output and that will dictate your requirements! online only really means srgb and 8bit, online + printing you'll need adobergb and 10bit. resolution is up to you\n\ni had a pretty strict budget and reasonable expectations (i didn’t want to spend $4,000+ on an eizo or pro display xdr) and wanted to spend that money as reasonably as possible. my needs were decent resolution, a wide color gamut, and a large display surface. i am printing more of my photos and find myself being disappointed that i don’t produce what my screen shows. for reference i am coming from a 2011 imac and 2012 macbook pro retina. \n\n*note: this is not a review of a monitor or a personal recommendation, this is a synopsis of the information i learned when trying to make my own decision.* \n\n**color gamut**: this was the most important thing i found to improve my photography. a lot of research was done on my part into the science of color, which is a post for another day. \n\nmy decision was between two color gamut capabilities, srgb and adobergb. most monitors you can purchase today are capable of srgb. more professional oriented monitors expand the gamut capabilities to adobergb. adobergb is a larger color gamut than srgb, it was created to encompass the color gamut of cmyk printers to more accurately represent the colors captured. using srgb for printing can leave colors out, for example you lose some green and cyan output ability if you print a photo in srgb. because of this i wanted a monitor that was capable of displaying the adobergb gamut to accurately depict what my printer is capable of and therefore when i edit a photograph i will be editing within the capabilities of my printer and not my monitor. the below image shows the adobergb gamut, srgb, and a cmyk generic gamut. notice that the cmyk is capable of showing more shades than srgb, so capturing in srgb and printing means you are not getting the fully \"picture.\"\n\n&amp;#x200b;\n\n[abodergb, cmyk, and srgb gamuts -----> mapped !!!  on the cie 1931 chromaticity plot \\(original source unknown\\)](https://preview.redd.it/iqltitn7ndk41.jpg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=7f34fba0e5720e9caf002bb41c19ecfbc2b12918)\n\nif however you consume and output your photographs digitally and find your prints to be acceptable (if you even care about printing) than an srgb monitor will be perfect and will not break the bank. a huge number of monitors exist that can display 100% of srgb that are very inexpensive.\n\nif you are like me and want to be able to see all of the colors your outputs are capable of (you can set most adobergb monitors to display srgb for digital editing) then you should be looking for not just a wide gamut monitor, but one capable of 95% or more of the adobergb gamut. \n\n**bit depth**: there is a lot of confusion about bit depth on monitors. there are three options generally out there for people who are advanced photographers, but maybe not a studio professional using a medium format camera. 8 bit, “10 bit”, and 10 bit. the bit depth determines how many shades of one of the components of the display (red, green, blue) can do from 100% brightness to 0%. 8 bit divides each color into 256 discrete values of brightness. combining these 256 levels of red, green, and blue leads to 16,777,216 “colors.” \n\n*note: this is something that is in contention, the meaning of number of colors, i prescribe to the notion that it is 16.7 million discrete color values, which is the more technical definition and more accurate.*\n\nthere are two versions of 10 bit, true 10 bit and “10 bit”, otherwise known as 8 bit + frc (frame rate control). 10 bit depth means the device is capable of displaying 1,073,741,824 shades of color (in whatever gamut you have). \n\nfrc is a fancy trick monitors play with the frame rate of each pixel and surrounding pixels, effectively creating 4 shades (100%,75%, etc) behind the 256 shades of each pixel component (bringing the total to 1024 shades for each component). some people have no issues with this, since technically the human eye can only perceive around 16 million shades of color, so 8 bit is all we can perceive. the issue however is when the color gamut gets larger. that means the red, green, and blue components are further away from each other. if we send the signal to show shade 200 green and 201 green we can barely perceive the difference on an srgb display, but since adobergb has expanded into the green region more, the difference between shade 200 and 201 of green is larger, exacerbating the difference in shades. when comparing 8 bit to 10 bit, 1 shade in 8 bit color could be 4 different shades in 10 bit.\n\nusing 10bit color then allows a more precise representation of colors with a finer resolution. gradients will be smoother, which is the biggest benefit. posterization will not be visible. in my situation having adobergb required me to have a 10 bit capable monitor to avoid posterization. \n\n***achtung****: 10 bit displays need 10 bit output from your graphics card. check your machines capabilities before purchasing a 10 bit monitor, unless you are future-proofing your setup. for your information, the macbook pro 16\" is capable of outputting 10 bit color on displayport 1.4 (through the thunderbolt alt mode).*\n\n**resolution**: this is purely a personal preference in general. if you want 4k, then go for it. there are tons of 4k monitors on the market with srgb coverage, there are fewer when you are looking for 4k and adobergb. and then they start to get somewhat expensive. \n\nin my search i worried over whether i needed 4k since so many screens have very large ppi (pixels per inch) and have some incredible perceived sharpness. there are arguments for and against these large resolution monitors. some photographers prefer 1440p (2560x1440) on 27” screens as this allows then to view photos at 100%, which effectively would make them larger than on a 4k monitor. in addition some find it easier to judge critical focus on these 108 ppi screens (as opposed to &gt;150ppi on a 4k screen). that being said, if you want a 32” monitor then a 4k resolution is very acceptable. \n\nagain, resolution is a personal preference. i got over the worries that i needed 4k, it opened up a lot more possibilities for monitors with adobergb gamuts.\n\n**size**: again personal preference, i chose a 27” monitor. i felt 32” was excessive at the distance i would view it at, and found myself turning my head to view things at the edge of display. \n\ni think resolution and screen size are something that should go hand in hand, shoot for a minimum of 108ppi. balance your wants with your budget.\n\nmy choice: i chose the benq sw270c. it is adobergb 99% coverage, 1440p, 27”, and 10 bit capable. in addition it has usb-c connections making it easy for me to connect to. a nifty inclusion, which comes with a number of professional grade monitors, is the monitor hood. it really cuts the side glare i get from the windows in my studio area and makes the screen really pop. i recommend that you consider all of your needs and how you shoot and distribute your photos.\n\nin my opinion there are two true requirements that need to be balanced: color gamut-bit depth and resolution-size. this wasn’t very obvious to me at first, but these are things that should go hand in hand. wider gamuts should have higher bit depths, and larger screens need larger resolutions (of course this is more of a personal preference)\n\nthere is nothing wrong with shooting and displaying in srgb, really an adobergb monitor is only going to be useful for some photographers. \n\na few notes:\n\n&amp;#x200b;\n\n1. color gamut: there are hundreds of publications that explain the science of color. i recommend doing some research if you enjoy linear algebra and the science of human perception. however, the point i want to make is that if you set your camera to auto and leave it in jpeg you are probably capturing things in srgb. unless your camera is capable of capturing raw or adobergb and high color bit depth, a adobergb monitor is not going to be very useful for you. save your money and invest it in a raw capable camera or some more education if you want to get into that level of photography. \n2. color calibration: out of the box most monitors are great, including the professional ones. however, calibration of a monitor can improve the performance and is necessary when you start printing fine art. calibrating your monitor and your printer will make the outputs between the monitor and printer match more closely, making it much easier to edit your photos and get a great print sooner. if you plan on calibrating it is a good idea to find a monitor that allows for \"hardware calibration.\" this is calibrating the internal look up tables (luts) of the monitor that allows for better and more accurate processing of the input signal from the computer (10bit to 16bit to 10bit). the luts allow the display to **accurately** display the colors from the computer. each monitor does not have a linear response to each component, so increasing the depth to 16bit during the translation means that the output will be better matched to the displays capabilities.", "sortedWord": "None", "identifyer": 62321, "year": "2020"}, {"Unnamed: 0": 63576, "autor": "BCT88", "date": 1602035635000, "content": "How are the fall colors looking around Bishop/June Lake/High Sierras? /!/ I saw the predictor map posted a while back, I'm curious if it's accurate that colors will peak in 1-2 weeks in that area?", "link": "https://www.reddit.com/r/photography/comments/j6ib5z/how_are_the_fall_colors_looking_around_bishopjune/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "how are the fall colors looking around bishop/june lake/high sierras? /!/ i saw the predictor -----> map !!!  posted a while back, i'm curious if it's accurate that colors will peak in 1-2 weeks in that area?", "sortedWord": "None", "identifyer": 65130, "year": "2020"}, {"Unnamed: 0": 66405, "autor": "kerriem01", "date": 1579106683000, "content": "Theme ideas ? /!/ I need to take 20 photos for the below \nConfectionary \nLaundry \nMaps\nHot weather (currently rain in the uk)\nAquatic life \n\nDoes anyone have any ideas of interesting picture ideas I can take ? Thanks in advance 😁", "link": "https://www.reddit.com/r/photography/comments/ep4oan/theme_ideas/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "maps", "selectorShort": "map", "MarkedSent": "theme ideas ? /!/ i need to take 20 photos for the below \nconfectionary \nlaundry \n-----> maps !!! \nhot weather (currently rain in the uk)\naquatic life \n\ndoes anyone have any ideas of interesting picture ideas i can take ? thanks in advance 😁", "sortedWord": "None", "identifyer": 68041, "year": "2020"}, {"Unnamed: 0": 68038, "autor": "OnlyJuanCannoli", "date": 1592222034000, "content": "Going to a bunch of National Parks across the continental US, what's my best bet for low light pollution? /!/ Howdy friends. Planning on going on a trip next month following this route. Anyone have any suggestions of good places where I can do some astrophotography? Ideally looking to do landscape/milky way shots. I know Salt Flats will be good, but I'm not too sure about the other parks and light pollution. Map -&gt;[https://imgur.com/a/u4FB0gm](https://imgur.com/a/u4FB0gm)\n\nBonus Question: Can someone recommend a budget friendly telephoto!? I'm taking a D750 with me and so far have: Nikon 50 1.8D, Nikon 18-35 3.5-4.5G, and a Rokinon 24 1.4 for astro stuff.", "link": "https://www.reddit.com/r/photography/comments/h9eucf/going_to_a_bunch_of_national_parks_across_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "going to a bunch of national parks across the continental us, what's my best bet for low light pollution? /!/ howdy friends. planning on going on a trip next month following this route. anyone have any suggestions of good places where i can do some astrophotography? ideally looking to do landscape/milky way shots. i know salt flats will be good, but i'm not too sure about the other parks and light pollution. -----> map !!!  -&gt;[https://imgur.com/a/u4fb0gm](https://imgur.com/a/u4fb0gm)\n\nbonus question: can someone recommend a budget friendly telephoto!? i'm taking a d750 with me and so far have: nikon 50 1.8d, nikon 18-35 3.5-4.5g, and a rokinon 24 1.4 for astro stuff.", "sortedWord": "None", "identifyer": 69726, "year": "2020"}, {"Unnamed: 0": 70838, "autor": "Polaris44", "date": 1606781475000, "content": "Wildlife Photog's, how do you plan? /!/ I've never 'done' a photo trip specifically looking for a certain animal. I'll be lucky to see some wildlife when I go on my landscape trips and will obviously snap what I can when I'm out there.\n\nFor example, if I'm planning a trip to Mt. Rainier for a specific style of shot and I'm taking hiking trails, I'll keep an eye on current weather patterns, historical weather patterns during 'X' time of year, any astrological news as a bonus, hiking trail conditions, roughly scout with Google Maps, etc. etc. and I'll even make myself a timeframe for things (in some cases I'll even download Topo maps to bring with)  &lt;--- This is very fun for me\n\n But I'm curious, for those that are REALLY into wildlife, how do you plan? Do you plan? What is your equivalent to my example? \n\nI ask because I *really* want to photograph Owls (I know, not the easiest) while I live in the PNW and aside from looking where 'X' animal is commonly scene...not sure where to go.", "link": "https://www.reddit.com/r/photography/comments/k490hk/wildlife_photogs_how_do_you_plan/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "wildlife photog's, how do you plan? /!/ i've never 'done' a photo trip specifically looking for a certain animal. i'll be lucky to see some wildlife when i go on my landscape trips and will obviously snap what i can when i'm out there.\n\nfor example, if i'm planning a trip to mt. rainier for a specific style of shot and i'm taking hiking trails, i'll keep an eye on current weather patterns, historical weather patterns during 'x' time of year, any astrological news as a bonus, hiking trail conditions, roughly scout with -----> google !!!  -----> maps !!! , etc. etc. and i'll even make myself a timeframe for things (in some cases i'll even download topo maps to bring with)  &lt;--- this is very fun for me\n\n but i'm curious, for those that are really into wildlife, how do you plan? do you plan? what is your equivalent to my example? \n\ni ask because i *really* want to photograph owls (i know, not the easiest) while i live in the pnw and aside from looking where 'x' animal is commonly scene...not sure where to go.", "sortedWord": "None", "identifyer": 72612, "year": "2020"}, {"Unnamed: 0": 71042, "autor": "JoeYuriMike_42069", "date": 1607501438000, "content": "The “Google Maps Glitches”.", "link": "https://www.reddit.com/r/photography/comments/k9nzdu/the_google_maps_glitches/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "the “-----> google !!!  -----> maps !!!  glitches”.", "sortedWord": "None", "identifyer": 72824, "year": "2020"}, {"Unnamed: 0": 73929, "autor": "cryptodesign", "date": 1584616790000, "content": "Stuck at home as a Photographer? Here are 10 things to do! /!/ Hi all,\n\nHere's a little article I wrote for Reddit because as most of you, I am just sitting at home here :) \n\nNow that most of us are stuck at home with possibly no income, times are tough. But we can use these times to our ‘advantage’ and do things we normally wouldn’t do or don’t have time for. Some of us can’t even go out anymore to take pictures in nature because we’re grounded. I live in the Netherlands and we’re still allowed to go out of the house, but other countries like Italy and France for example, are completely grounded. \n\nI spend a lot of time in front of my computer for my photography anyway and I know not everyone is the same. However, in these times we are kind of forced to do some work from behind our desk. So in this small article, I’ll be giving some ‘things to do’ for you while you’re stuck at home!\n\n&amp;#x200B;\n\n1. **Work on your website**. Lots of us are super busy and often don’t have time to update our website. Now we do! Do basic stuff like updating your site with your most recent work, maybe start a blog (some people always tell me they plan to start one, but never have time), and in general: just make your website look good for potential future clients. It will also be useful to work on the SEO of your website to make it more ‘reachable’ by search engines. Feel free to check out my own [website](https://www.albertdros.com).\n2. **Work on your social media.** I love social media (i know some people don’t). In my opinion it’s important to be basically EVERYWHERE. You don’t have to be super active, but just have an account and some of your work everywhere is important for visibility. Example of social media channels : Instagram, Facebook (Photography page), Twitter, Flickr, 500px, VERO (app), Behance, Viewbug, etc. Feel free to add more to this list. And make sure you’re website is listed in every one of them! Maintaining social media can be a day job. But if you are sitting at home and have nothing to do? Why not work on them!\n3. **Spend some time checking other’s work!** I prefer to check people’s work on high quality websites like [Behance](https://www.behance.net/albertdros). I can browse a website like this for hours. Not only regarding photography, but also all kinds of digital art like drawing, 3d, etc. It’s great for inspiration.\n4. **Process unprocessed or (reprocess) old images**. This goes especially for landscape photographers (like me) who are often traveling and have a HUGE backlog of images that are still laying around for processing. I could spend weeks on my workstation processing images from my backlog. Also look at your super old images! I recently found an old hard drive with a lot of good images from 2014 that I processed at the time, but I would like to reprocess because my processing skills were quite bad at the time.\n5. **Clean up and structure your files on your hard drive.** I literally have hundreds of thousands of RAW files on my hard drive. 80% I will probably never use. I have a good year/month/day structure but I know many people don’t. These times are great to spend some time in making a good directory structure, sort your images, delete a bunch. Not only regarding photography by the way. Sometimes my hard drive/desktop/workstation is a mess in general. I am going through my hard drive with software like GrandPerspective (free) to see where all my big files are that I don’t use, and clean up my drives\n6. **Increase your skills.** The internet is an endless resource of information and we can increase our skills - especially when you’re a beginner - greatly with just learning online. I’d say the biggest resource of information is YouTube. These days can be great to work on your processing skills by watching some tutorials. Or support a photographer in these times by buying a tutorial or book. And if you’re a professional photographer yourself: try doing it the other way around. Offer (paid) teaching online via Skype or other channels.\n7. **Prepare (photography) projects from home.** As a landscape photographer I still have lots of places I want to visits and I constantly have lots of ideas that I want to do ‘when I have time’. These days I am working on making these ‘ideas’ actually happen and put them in potential products. I simply look at the world map checking which locations I still I need to go, figure out the costs, think of how I am going to pay for it and see if I can find potential ways to work with companies to make these projects happen commercially. This is just an example from my own point of view, but I see these (extra) times at home as a good opportunity to prepare a bunch of projects so that I can start them when all of this is over.\n8. **Sort out your gear and see what you can get rid of.** Many of us have countless of gear from doing years and years of photography. Some of it we never use. Think of old lenses, old bodies, tripods, etc. Spend some time to sort everything and see what you can give away or sell.\n9. **Work on (properly) printing your work.** Some of you probably already do this, but even for me as a professional photographer I am so busy that I hardly spend proper time to make some good prints of my work. Great prints of your work are just another level to your photography. It’s one thing to see the photo on your screen, but an entirely different thing to hold a 1-2 meter print and hang it up in your house. Printing is also an entirely different form of art. When you’re new to printing, the print rarely comes out how you want. This has to do with different kinds of paper, print profiles and calibrated screens. There’s lot to learn about this (Youtube) and it’s something you can easily spend a few days on!\n10. **Write something yourself.** It’s always interesting to put your thoughts on paper. It doesn’t even have to do with photography, but writing can be a great outlet in general. I’m writing this article for all of you, so if you have something ‘interesting’ to write about: go for it! There are always people interested in reading, especially here on Reddit!\n\nI hope you enjoyed these 10 things to do! And of course feel free to add some things yourself :) I'm sure we can all use some guidance right now!\n\nCheers!\n\nAlbert", "link": "https://www.reddit.com/r/photography/comments/fl8eoo/stuck_at_home_as_a_photographer_here_are_10/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "stuck at home as a photographer? here are 10 things to do! /!/ hi all,\n\nhere's a little article i wrote for reddit because as most of you, i am just sitting at home here :) \n\nnow that most of us are stuck at home with possibly no income, times are tough. but we can use these times to our ‘advantage’ and do things we normally wouldn’t do or don’t have time for. some of us can’t even go out anymore to take pictures in nature because we’re grounded. i live in the netherlands and we’re still allowed to go out of the house, but other countries like italy and france for example, are completely grounded. \n\ni spend a lot of time in front of my computer for my photography anyway and i know not everyone is the same. however, in these times we are kind of forced to do some work from behind our desk. so in this small article, i’ll be giving some ‘things to do’ for you while you’re stuck at home!\n\n&amp;#x200b;\n\n1. **work on your website**. lots of us are super busy and often don’t have time to update our website. now we do! do basic stuff like updating your site with your most recent work, maybe start a blog (some people always tell me they plan to start one, but never have time), and in general: just make your website look good for potential future clients. it will also be useful to work on the seo of your website to make it more ‘reachable’ by search engines. feel free to check out my own [website](https://www.albertdros.com).\n2. **work on your social media.** i love social media (i know some people don’t). in my opinion it’s important to be basically everywhere. you don’t have to be super active, but just have an account and some of your work everywhere is important for visibility. example of social media channels : instagram, facebook (photography page), twitter, flickr, 500px, vero (app), behance, viewbug, etc. feel free to add more to this list. and make sure you’re website is listed in every one of them! maintaining social media can be a day job. but if you are sitting at home and have nothing to do? why not work on them!\n3. **spend some time checking other’s work!** i prefer to check people’s work on high quality websites like [behance](https://www.behance.net/albertdros). i can browse a website like this for hours. not only regarding photography, but also all kinds of digital art like drawing, 3d, etc. it’s great for inspiration.\n4. **process unprocessed or (reprocess) old images**. this goes especially for landscape photographers (like me) who are often traveling and have a huge backlog of images that are still laying around for processing. i could spend weeks on my workstation processing images from my backlog. also look at your super old images! i recently found an old hard drive with a lot of good images from 2014 that i processed at the time, but i would like to reprocess because my processing skills were quite bad at the time.\n5. **clean up and structure your files on your hard drive.** i literally have hundreds of thousands of raw files on my hard drive. 80% i will probably never use. i have a good year/month/day structure but i know many people don’t. these times are great to spend some time in making a good directory structure, sort your images, delete a bunch. not only regarding photography by the way. sometimes my hard drive/desktop/workstation is a mess in general. i am going through my hard drive with software like grandperspective (free) to see where all my big files are that i don’t use, and clean up my drives\n6. **increase your skills.** the internet is an endless resource of information and we can increase our skills - especially when you’re a beginner - greatly with just learning online. i’d say the biggest resource of information is youtube. these days can be great to work on your processing skills by watching some tutorials. or support a photographer in these times by buying a tutorial or book. and if you’re a professional photographer yourself: try doing it the other way around. offer (paid) teaching online via skype or other channels.\n7. **prepare (photography) projects from home.** as a landscape photographer i still have lots of places i want to visits and i constantly have lots of ideas that i want to do ‘when i have time’. these days i am working on making these ‘ideas’ actually happen and put them in potential products. i simply look at the world -----> map !!!  checking which locations i still i need to go, figure out the costs, think of how i am going to pay for it and see if i can find potential ways to work with companies to make these projects happen commercially. this is just an example from my own point of view, but i see these (extra) times at home as a good opportunity to prepare a bunch of projects so that i can start them when all of this is over.\n8. **sort out your gear and see what you can get rid of.** many of us have countless of gear from doing years and years of photography. some of it we never use. think of old lenses, old bodies, tripods, etc. spend some time to sort everything and see what you can give away or sell.\n9. **work on (properly) printing your work.** some of you probably already do this, but even for me as a professional photographer i am so busy that i hardly spend proper time to make some good prints of my work. great prints of your work are just another level to your photography. it’s one thing to see the photo on your screen, but an entirely different thing to hold a 1-2 meter print and hang it up in your house. printing is also an entirely different form of art. when you’re new to printing, the print rarely comes out how you want. this has to do with different kinds of paper, print profiles and calibrated screens. there’s lot to learn about this (youtube) and it’s something you can easily spend a few days on!\n10. **write something yourself.** it’s always interesting to put your thoughts on paper. it doesn’t even have to do with photography, but writing can be a great outlet in general. i’m writing this article for all of you, so if you have something ‘interesting’ to write about: go for it! there are always people interested in reading, especially here on reddit!\n\ni hope you enjoyed these 10 things to do! and of course feel free to add some things yourself :) i'm sure we can all use some guidance right now!\n\ncheers!\n\nalbert", "sortedWord": "None", "identifyer": 75825, "year": "2020"}, {"Unnamed: 0": 77606, "autor": "LuisPinaIII", "date": 1589692359000, "content": "How can I digitally put photos together to make a big image? /!/ To make a map for example. I don't own any photo editing software, so hopefully I could do this with free software.", "link": "https://www.reddit.com/r/photography/comments/gl9r8q/how_can_i_digitally_put_photos_together_to_make_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "how can i digitally put photos together to make a big image? /!/ to make a -----> map !!!  for example. i don't own any photo editing software, so hopefully i could do this with free software.", "sortedWord": "None", "identifyer": 79637, "year": "2020"}, {"Unnamed: 0": 78737, "autor": "Rontheking", "date": 1592298081000, "content": "Drone laws in Italy /!/ Hi guys, \n\nAfter 6 months of being away from home my girlfriend and I are gonna visit her family for a while in Rome this week and stay there for a while. Now I'm a photographer that's thinking about driving around Italy for a bit, specially the country side. Now I'm thinking about brining a drone a long for the ride but I can't seem to find a good understanding of the local laws and regulations. One flight map tells me I can fly over Rome (which I doubt, honestly), one article says I don't need a plate on my drone and the other says I do. \n\nIs there any drone flyer here that can help me out here? Is it worth it to bring a drone to Italy?", "link": "https://www.reddit.com/r/photography/comments/ha0azw/drone_laws_in_italy/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "drone laws in italy /!/ hi guys, \n\nafter 6 months of being away from home my girlfriend and i are gonna visit her family for a while in rome this week and stay there for a while. now i'm a photographer that's thinking about driving around italy for a bit, specially the country side. now i'm thinking about brining a drone a long for the ride but i can't seem to find a good understanding of the local laws and regulations. one flight -----> map !!!  tells me i can fly over rome (which i doubt, honestly), one article says i don't need a plate on my drone and the other says i do. \n\nis there any drone flyer here that can help me out here? is it worth it to bring a drone to italy?", "sortedWord": "None", "identifyer": 80820, "year": "2020"}, {"Unnamed: 0": 79015, "autor": "TheLearningShip", "date": 1592821292000, "content": "Photoshop : Displacement Map | Wrap Anything on Blank Fabric | Write on ...", "link": "https://www.reddit.com/r/photography/comments/hdprve/photoshop_displacement_map_wrap_anything_on_blank/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "photoshop : displacement -----> map !!!  | wrap anything on blank fabric | write on ...", "sortedWord": "None", "identifyer": 81114, "year": "2020"}, {"Unnamed: 0": 82580, "autor": "DasPony2", "date": 1606908984000, "content": "Tripod/Setup for taking indoor birds eye pictures /!/ I'm looking for a setup that gives me a bird-eye view of a factory shop floor.\n\nMy goal is to get something like the satellite view of google maps, but for indoor.\n\n&amp;#x200B;\n\nI need something like a flexible tripod (Bamboo stick) or a 90 degree frame to be able to hold the camera above and in front of me, so that I'm not in the photo.\n\nAnd then probably stitch it together with Photoshop?\n\nHas anyone done something similar?\n\nFactory is about 150 x 50 meters large\n\nhttps://preview.redd.it/3kaibfpsfr261.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=1ec8b2b2f92ac6904e15537497eaa16c723af90a", "link": "https://www.reddit.com/r/photography/comments/k57o0j/tripodsetup_for_taking_indoor_birds_eye_pictures/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "tripod/setup for taking indoor birds eye pictures /!/ i'm looking for a setup that gives me a bird-eye view of a factory shop floor.\n\nmy goal is to get something like the satellite view of -----> google !!!  -----> maps !!! , but for indoor.\n\n&amp;#x200b;\n\ni need something like a flexible tripod (bamboo stick) or a 90 degree frame to be able to hold the camera above and in front of me, so that i'm not in the photo.\n\nand then probably stitch it together with photoshop?\n\nhas anyone done something similar?\n\nfactory is about 150 x 50 meters large\n\nhttps://preview.redd.it/3kaibfpsfr261.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=1ec8b2b2f92ac6904e15537497eaa16c723af90a", "sortedWord": "None", "identifyer": 84823, "year": "2020"}, {"Unnamed: 0": 85067, "autor": "strange_orbit", "date": 1586113033000, "content": "Create a map from my RAW photos? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/fvj3lz/create_a_map_from_my_raw_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "create a -----> map !!!  from my raw photos? /!/ [removed]", "sortedWord": "None", "identifyer": 87414, "year": "2020"}, {"Unnamed: 0": 87126, "autor": "dinowand", "date": 1598288792000, "content": "New MS Flight Simulator 2020 is an amazing tool for travel and landscape photographers /!/ I was playing this game all weekend and realized something.  It's absolutely awesome for photographers who want to scope out an area in preparation for a shoot. I'm into landscape photography but it could apply to other types of photography too.\n\nAnyways, I go on google maps, find the location and grab the coordinates, then spawn into the game at that spot.  I put it in active pause mode, switch to drone mode which allows really easy and free movement to a specific spot. \n\nNow here's the best part. I can adjust time of year (exact date), time of day, weather conditions to my liking (cloud layers, precipitation, snow coverage)! How does this help? Well now I know exactly where the sun position will be, what time golden hour is, how the light will affect the environment, if in a mountainous area - how the shadows will come into play.  Here's an example of scoping out a spot at Yosemite in the game: [Yosemite - half dome\n](https://imgur.com/lO7vZGB)\n\nIt gets better - if you want to do astrophotography, you can change it to night time and see where the milky way, or moon will be and how it will line up with your subject.", "link": "https://www.reddit.com/r/photography/comments/ift243/new_ms_flight_simulator_2020_is_an_amazing_tool/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "new ms flight simulator 2020 is an amazing tool for travel and landscape photographers /!/ i was playing this game all weekend and realized something.  it's absolutely awesome for photographers who want to scope out an area in preparation for a shoot. i'm into landscape photography but it could apply to other types of photography too.\n\nanyways, i go on -----> google !!!  -----> maps !!! , find the location and grab the coordinates, then spawn into the game at that spot.  i put it in active pause mode, switch to drone mode which allows really easy and free movement to a specific spot. \n\nnow here's the best part. i can adjust time of year (exact date), time of day, weather conditions to my liking (cloud layers, precipitation, snow coverage)! how does this help? well now i know exactly where the sun position will be, what time golden hour is, how the light will affect the environment, if in a mountainous area - how the shadows will come into play.  here's an example of scoping out a spot at yosemite in the game: [yosemite - half dome\n](https://imgur.com/lo7vzgb)\n\nit gets better - if you want to do astrophotography, you can change it to night time and see where the milky way, or moon will be and how it will line up with your subject.", "sortedWord": "None", "identifyer": 89550, "year": "2020"}], "name": "mapphotography2020"}