{"interestingcomments": [{"Unnamed: 0": 98220, "autor": "light-hunter", "date": 1569940255000, "content": "Saving Locations - What Apps/Methods do you Use? /!/ I'm a landscape photographer and I've been using Google MyMaps to save locations for awhile but I'm looking for other possible solutions.\n\nMy workflow has been to saving locations to a custom Google MyMap and add a picture of the location to remember why it's of interest. Sometime I might add a quick note or description. It's worked fairly well but there's a few things that bug me so I figured I'd see what other folks are using. Google seems to discontinue apps often and I'm also a bit worried they may kill MyMaps off in favor of regular Google Maps. I looked into using Maps w/ the Lists and Saved locations but it lacks the ability to add a picture.\n\n&amp;#x200B;\n\nWhat does everyone else use for saving shoot locations? Hopefully I'm not the only one who likes to create databases...", "link": "https://www.reddit.com/r/photography/comments/dbu7jt/saving_locations_what_appsmethods_do_you_use/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "saving locations - what apps/methods do you use? /!/ i'm a landscape photographer and i've been using google mymaps to save locations for awhile but i'm looking for other possible solutions.\n\nmy workflow has been to saving locations to a custom google mymap and add a picture of the location to remember why it's of interest. sometime i might add a quick note or description. it's worked fairly well but there's a few things that bug me so i figured i'd see what other folks are using. -----> google !!!  seems to discontinue apps often and i'm also a bit worried they may kill mymaps off in favor of regular -----> google !!!  -----> maps !!! . i looked into using maps w/ the lists and saved locations but it lacks the ability to add a picture.\n\n&amp;#x200b;\n\nwhat does everyone else use for saving shoot locations? hopefully i'm not the only one who likes to create databases...", "sortedWord": "None", "identifyer": 882, "year": "2019"}, {"Unnamed: 0": 98868, "autor": "Flayrah4Life", "date": 1565972361000, "content": "Hey entrepreneurs, free business plan outline! /!/ [https://drive.google.com/file/d/1tkYrAUhdwQAkOlJns0Z8WtupcpvxEqf1/view?usp=sharing](https://drive.google.com/file/d/1tkYrAUhdwQAkOlJns0Z8WtupcpvxEqf1/view?usp=sharing)  \n\n\n**To be clear:** **I'm not selling anything or promoting myself**, just looking to help other photographers who may be interested in pursuing photography professionally, but don't have a comprehensive base to work from. :) I'm going a different direction professionally myself and updated my business plan outline to reflect that. Wanted to share with others who could benefit from a solid road map to get them started, because as we all know business in art is not as simple as hanging a shingle out and telling people they can buy your pretty pictures. Hope this helps you, and don't forget to your write your marketing plan too.", "link": "https://www.reddit.com/r/photography/comments/cr8n34/hey_entrepreneurs_free_business_plan_outline/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "hey entrepreneurs, free business plan outline! /!/ [https://drive.google.com/file/d/1tkyrauhdwqakoljns0z8wtupcpvxeqf1/view?usp=sharing](https://drive.google.com/file/d/1tkyrauhdwqakoljns0z8wtupcpvxeqf1/view?usp=sharing)  \n\n\n**to be clear:** **i'm not selling anything or promoting myself**, just looking to help other photographers who may be interested in pursuing photography professionally, but don't have a comprehensive base to work from. :) i'm going a different direction professionally myself and updated my business plan outline to reflect that. wanted to share with others who could benefit from a solid road -----> map !!!  to get them started, because as we all know business in art is not as simple as hanging a shingle out and telling people they can buy your pretty pictures. hope this helps you, and don't forget to your write your marketing plan too.", "sortedWord": "None", "identifyer": 1549, "year": "2019"}, {"Unnamed: 0": 99479, "autor": "QuestionerAnswerer", "date": 1567803915000, "content": "Panorama images from video? Automated map making of linear game world? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/d0ml8i/panorama_images_from_video_automated_map_making/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "panorama images from video? automated -----> map !!!  making of linear game world? /!/ [removed]", "sortedWord": "None", "identifyer": 2178, "year": "2019"}, {"Unnamed: 0": 99487, "autor": "[deleted]", "date": 1567798859000, "content": "Automated map making of linear game world? /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/d0lhv1/automated_map_making_of_linear_game_world/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "automated -----> map !!!  making of linear game world? /!/ [deleted]", "sortedWord": "None", "identifyer": 2187, "year": "2019"}, {"Unnamed: 0": 102055, "autor": "g1ng3r_nut", "date": 1551797553000, "content": "Do you ever just go to google maps to find locations of old photos?", "link": "https://www.reddit.com/r/photography/comments/axlyw9/do_you_ever_just_go_to_google_maps_to_find/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "do you ever just go to -----> google !!!  -----> maps !!!  to find locations of old photos?", "sortedWord": "None", "identifyer": 4826, "year": "2019"}, {"Unnamed: 0": 318235, "autor": "nychubris", "date": 1553981034000, "content": "GPS Photo Viewer /!/ I recently purchased my first GPS-enabled camera (the A6400) and am looking for a program to show my photos on a map view them.  I know that Lightroom has this functionality, but I'm a Capture One Pro user.  What are my options?\n\nDesired functionality:\n-Local PC program, not a website that I need to upload photos to.  (Unless Flickr can do that.)\n-Detailed local map, e.g. showing roads\n-Plot pins on the map for my JPEG photos\n-Allow me to click through the icons to view photos", "link": "https://www.reddit.com/r/photography/comments/b7g6yn/gps_photo_viewer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "gps photo viewer /!/ i recently purchased my first gps-enabled camera (the a6400) and am looking for a program to show my photos on a -----> map !!!  view them.  i know that lightroom has this functionality, but i'm a capture one pro user.  what are my options?\n\ndesired functionality:\n-local pc program, not a website that i need to upload photos to.  (unless flickr can do that.)\n-detailed local map, e.g. showing roads\n-plot pins on the map for my jpeg photos\n-allow me to click through the icons to view photos", "sortedWord": "None", "identifyer": 65399, "year": "2019"}, {"Unnamed: 0": 320277, "autor": "citygray", "date": 1554804079000, "content": "Photographing The Decaying Buildings In The City (Possible Project - Need Ideas) /!/ Before starting I would like to point out that this is not an \"urban exploration\" project (unlike the title might imply), but rather a crossover between my fascinations photography, history and the city.\n\nI'm living in a culturally and historically rich city where there are multiple layers of culture, identity and history. My aim is to document buildings which were beautiful and spectacular once upon a time but abandoned and left to ruin &amp; decay now. There are tons of buildings like that in my city and whenever I walk past them it breaks my heart to see them in that state. Perhaps I can take their photos, document every one of them, dig up their history, acknowledge their worth and preserve whatever detail is available now. My city keeps changing so fast that I'm quite sure there will not be there in 5-10 years.\n\nEven if it generates no interest, I will keep doing it. But I need some ideas and general tips regarding how to do it in practice. Should I start with a Flickr page and maybe move on to a new blog if people are interested? Or should I directly build a website? Wordpress? Should I add a map to visualize &amp; pinpoint the buildings on the map?\n\nOr this is all just nonsense?", "link": "https://www.reddit.com/r/photography/comments/bb62u8/photographing_the_decaying_buildings_in_the_city/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "photographing the decaying buildings in the city (possible project - need ideas) /!/ before starting i would like to point out that this is not an \"urban exploration\" project (unlike the title might imply), but rather a crossover between my fascinations photography, history and the city.\n\ni'm living in a culturally and historically rich city where there are multiple layers of culture, identity and history. my aim is to document buildings which were beautiful and spectacular once upon a time but abandoned and left to ruin &amp; decay now. there are tons of buildings like that in my city and whenever i walk past them it breaks my heart to see them in that state. perhaps i can take their photos, document every one of them, dig up their history, acknowledge their worth and preserve whatever detail is available now. my city keeps changing so fast that i'm quite sure there will not be there in 5-10 years.\n\neven if it generates no interest, i will keep doing it. but i need some ideas and general tips regarding how to do it in practice. should i start with a flickr page and maybe move on to a new blog if people are interested? or should i directly build a website? wordpress? should i add a -----> map !!!  to visualize &amp; pinpoint the buildings on the -----> map !!! ?\n\nor this is all just nonsense?", "sortedWord": "None", "identifyer": 67509, "year": "2019"}, {"Unnamed: 0": 320551, "autor": "tlaw223", "date": 1550062757000, "content": "registered 501c3 seeking photographers to help military families /!/ (admin, I apologize if this breaks rules... i read them and didn't see anything against.)  \n\n\nHi!  \n\nI'm the president of Operation Love Reunited.  We've been around since 2006, but registered 501c3 since 2009.  We are the original organization to do such a program and as far as I know, are the only 501c3 like us to have our by-laws, forms, everything reviewed by the DoD (in 2009).  OpLove (for short) is a network of professional photographers that support military families during deployments and upon homecomings thru photography.  We capture their sweet welcome homes at the site of arrival, tears, and hugs at their departure or before their deployment.  The organization then prints the images for the clients and sends them overseas free of charge for morale boosting.  If the session was a homecoming, we give the client 15 digital files to download.\n\nOur organization also offers a yearly scholarship and we have a program that supports fallen military with printed canvases immediately shipped to the service/memorial sites called the Sgt. Soto Memorial Fund.\n\nI, myself, am a military spouse and have been shooting professionally since 2005, even thru 3 cross country moves.\n\nWe are REALLY in need of supporting photographers.  In 2009 we had 2000 photographers worldwide.  We are down to 33 active.  Our organization and members have donated over $2million dollars worth of services and prints with the help of our sponsoring lab H&amp;H Color.  We hope to open our services up to DoD Civilians and Retired Veterans this year and eventually would like to support 1st responders.  \n\nI cannot do this until we have more support for our current photographers.  Most are turning away sessions because they are already booked and they need help covering families going thru deployments.  Photographers are able to upsell to their clients after the OpLove obligation has been met, and many of the clients come back to them later for additional services.\n\nIf you are a photographer of any level and want to give back to people who give us everything, please consider joining OpLove or telling your photographer friends!  We request a $25 yearly membership due to help pay for the printing and operational needs of the organization which is a tax write-off.  Photographers are also able to write-off their OpLove specific service/session fees as a donation.  Photographers are placed on a networked map.  We print for you, ship for you, host for you... I will happily answer any questions for anyone if you have them.\n\n&amp;#x200B;\n\nThank you for your support!\n\nTonee Lawrence\n\n[http://www.oplove.org](http://www.oplove.org)", "link": "https://www.reddit.com/r/photography/comments/aq6c51/registered_501c3_seeking_photographers_to_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "registered 501c3 seeking photographers to help military families /!/ (admin, i apologize if this breaks rules... i read them and didn't see anything against.)  \n\n\nhi!  \n\ni'm the president of operation love reunited.  we've been around since 2006, but registered 501c3 since 2009.  we are the original organization to do such a program and as far as i know, are the only 501c3 like us to have our by-laws, forms, everything reviewed by the dod (in 2009).  oplove (for short) is a network of professional photographers that support military families during deployments and upon homecomings thru photography.  we capture their sweet welcome homes at the site of arrival, tears, and hugs at their departure or before their deployment.  the organization then prints the images for the clients and sends them overseas free of charge for morale boosting.  if the session was a homecoming, we give the client 15 digital files to download.\n\nour organization also offers a yearly scholarship and we have a program that supports fallen military with printed canvases immediately shipped to the service/memorial sites called the sgt. soto memorial fund.\n\ni, myself, am a military spouse and have been shooting professionally since 2005, even thru 3 cross country moves.\n\nwe are really in need of supporting photographers.  in 2009 we had 2000 photographers worldwide.  we are down to 33 active.  our organization and members have donated over $2million dollars worth of services and prints with the help of our sponsoring lab h&amp;h color.  we hope to open our services up to dod civilians and retired veterans this year and eventually would like to support 1st responders.  \n\ni cannot do this until we have more support for our current photographers.  most are turning away sessions because they are already booked and they need help covering families going thru deployments.  photographers are able to upsell to their clients after the oplove obligation has been met, and many of the clients come back to them later for additional services.\n\nif you are a photographer of any level and want to give back to people who give us everything, please consider joining oplove or telling your photographer friends!  we request a $25 yearly membership due to help pay for the printing and operational needs of the organization which is a tax write-off.  photographers are also able to write-off their oplove specific service/session fees as a donation.  photographers are placed on a networked -----> map !!! .  we print for you, ship for you, host for you... i will happily answer any questions for anyone if you have them.\n\n&amp;#x200b;\n\nthank you for your support!\n\ntonee lawrence\n\n[http://www.oplove.org](http://www.oplove.org)", "sortedWord": "None", "identifyer": 67797, "year": "2019"}, {"Unnamed: 0": 320880, "autor": "CharlesBrooks", "date": 1546988717000, "content": "The Same Panorama, Projected Three Different Ways. /!/  These three images are all the same panorama, made using the same photos, just stitched differently:\n\nThe shot where you can see both headlands is mapped using Stereographic projection.  \nThe wide one with the straight milkyway is mapped using Transverse Mercator.  \nThe tall one uses Stereographic Down.\n\nMilkyway season upon us and the galactic kiwi is making his return... we're about to see a whole lot of milkyway arches, lots of them stitched with the default Photoshop settings (look for a typical arch with stretchy stars along the top)  \nI'd really like to encourage people to play around with dedicated stitching software - the possibilities when you can alter your projection are endless.\n\nI personally prefer ptGui pro, it's definitely the fastest, but Hugin, and Autopano are both great.\n\nThese three photos are from the same set of RAW shots, just stitched differently....\n\nShot on a Panasonic GH5S with the Leica Summilux 12mm 1.4. 36 x 20 second exposures. ISO 5000.  \n\n\n[Stereographic Down Projection](https://i.redd.it/54u1aezy5a921.jpg)\n\n[Transverse Mercator Projection](https://i.redd.it/32l0a7zy5a921.jpg)\n\n[Strerographic Projection](https://i.redd.it/s8juz6zy5a921.jpg)", "link": "https://www.reddit.com/r/photography/comments/ae05mh/the_same_panorama_projected_three_different_ways/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "the same panorama, projected three different ways. /!/  these three images are all the same panorama, made using the same photos, just stitched differently:\n\nthe shot where you can see both headlands is -----> mapped !!!  using stereographic projection.  \nthe wide one with the straight milkyway is mapped using transverse mercator.  \nthe tall one uses stereographic down.\n\nmilkyway season upon us and the galactic kiwi is making his return... we're about to see a whole lot of milkyway arches, lots of them stitched with the default photoshop settings (look for a typical arch with stretchy stars along the top)  \ni'd really like to encourage people to play around with dedicated stitching software - the possibilities when you can alter your projection are endless.\n\ni personally prefer ptgui pro, it's definitely the fastest, but hugin, and autopano are both great.\n\nthese three photos are from the same set of raw shots, just stitched differently....\n\nshot on a panasonic gh5s with the leica summilux 12mm 1.4. 36 x 20 second exposures. iso 5000.  \n\n\n[stereographic down projection](https://i.redd.it/54u1aezy5a921.jpg)\n\n[transverse mercator projection](https://i.redd.it/32l0a7zy5a921.jpg)\n\n[strerographic projection](https://i.redd.it/s8juz6zy5a921.jpg)", "sortedWord": "None", "identifyer": 68140, "year": "2019"}, {"Unnamed: 0": 321101, "autor": "Oreoloveboss", "date": 1548461853000, "content": "Olympus announces development of a 150-400mm F4.5 lens with built in 1.25x teleconverter and image stabilization (up to 1000mm full frame equivalent) as well as future lens road map", "link": "https://www.reddit.com/r/photography/comments/ajvm5x/olympus_announces_development_of_a_150400mm_f45/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "olympus announces development of a 150-400mm f4.5 lens with built in 1.25x teleconverter and image stabilization (up to 1000mm full frame equivalent) as well as future lens road -----> map !!! ", "sortedWord": "None", "identifyer": 68372, "year": "2019"}, {"Unnamed: 0": 321103, "autor": "Oreoloveboss", "date": 1548461747000, "content": "Olympus announces 150-400mm F4.5 lens with built in 1.25x teleconverter and image stabilization (up to 1000mm full frame equivalent) as well as future lens road map", "link": "https://www.reddit.com/r/photography/comments/ajvljz/olympus_announces_150400mm_f45_lens_with_built_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "olympus announces 150-400mm f4.5 lens with built in 1.25x teleconverter and image stabilization (up to 1000mm full frame equivalent) as well as future lens road -----> map !!! ", "sortedWord": "None", "identifyer": 68374, "year": "2019"}, {"Unnamed: 0": 321733, "autor": "PsychicDelilah", "date": 1561747391000, "content": "Scientists / photographers of r/photography: What's the relationship between photon count and the final picture? /!/ Hi r/photography. \n\n&amp;#x200B;\n\nI've been looking around fruitlessly and I'm very curious. How are photons mapped to the final image in photography?\n\n&amp;#x200B;\n\nI'm in astronomy and would like to put together a demo. Most images of space are logarithmic in terms of photon count to pixel value because linear mappings obscure all but the brightest stars. I assume most cameras work the same way, but I can't seem to verify", "link": "https://www.reddit.com/r/photography/comments/c6nxm8/scientists_photographers_of_rphotography_whats/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "scientists / photographers of r/photography: what's the relationship between photon count and the final picture? /!/ hi r/photography. \n\n&amp;#x200b;\n\ni've been looking around fruitlessly and i'm very curious. how are photons -----> mapped !!!  to the final image in photography?\n\n&amp;#x200b;\n\ni'm in astronomy and would like to put together a demo. most images of space are logarithmic in terms of photon count to pixel value because linear mappings obscure all but the brightest stars. i assume most cameras work the same way, but i can't seem to verify", "sortedWord": "None", "identifyer": 69022, "year": "2019"}, {"Unnamed: 0": 321770, "autor": "franc_rizz", "date": 1561724471000, "content": "How to \"steal\" color grading from every photo you want! /!/ Hi all!\n\nDid you fall in love with some particular artist's colorgrading and you want to replicate it in your photo?\n\nThings are easy!\n\n&amp;#x200B;\n\nFollow my personal \"guide\" and you will be able to produce your art!\n\nIt will be write step by step in order to be **Noob-friendly!**\n\n&amp;#x200B;\n\nI use Photoshop cc 2019 (latest version) but this guide works for every editing software do you use.\n\n&amp;#x200B;\n\nWhat you need:\n\n* Source image (image that you want to \"color-grading copy\" )\n* Destination image ( your image )\n\n&amp;#x200B;\n\n&gt;!I will now type SI as Source Image and DI as destination image!&lt;\n\n&amp;#x200B;\n\nFirst step:\n\nDownload image from your favorite artist. (I use instagram a lot then i download image from there) - google it and you find a site that download image from instagram-\n\n&amp;#x200B;\n\nSecond step (*we're in photoshop now*)\n\nOpen the image you've just downloaded and open your personal image you want to edit.\n\nThey must remain in two different windows.\n\n&amp;#x200B;\n\n**Now the work is gonna start:**\n\n&amp;#x200B;\n\n**SI:**\n\n* Click on **Eyedropper Tool** (Press I on keyboard for shortcut) then move the mouse over the darkest area of the image. (Sample size 3by3 - Sample: All layers)\n* Foreground color now changes and its set to this color.\n* Create a new **empty layer** (SHIFT-CTRL.-N) or go to Layer-New-Layer and press Ok\n* Press now B on keyboard to **Brush** shortcut. Opacity 100% Flow 100% Smoothing 100% Standard brush is ok. Click now on the image to create a circle of color.\n* Click on the layer of the main image.\n* **Repeat** Eyedropper on the image selecting the lighten color (usually over the face if its a portrait) then click on the empty layer and create the circle of the color. NOTE: in case of portraits, we have to pick 2 colors in order to create a good mix of skin tone.\n* Click on the layer of the main image.\n* (we need to sample midtones). Create a copy layer of the image (CTRL + J on WIN) then go to SELECT -&gt; **COLOR RANGE**. Select: midtones. Expand a little bit the range of the midtones (left and right) then click OK.\n* You now could see a selection on the image.\n* Go to **FILTER- BLUR- AVERAGE**\n* Click on **Eyedropper Tool** and sample the color\n* Click on the empty layer and use the brush to create the last one circle.\n* We need to create a palette of colors (explain later): Click on the image then Go to FILE- EXPORT-&gt; **SAVE FOR WEB.**\n* A new windows is not opened.\n* Change the format of the image to **GIF** (top right, Jpeg should be default value) and Set COLORS to 3 (three).\n* Inside the **Color Table** there are those 3 colors. Click on the top right of this Color Table and Click on SAVE COLOR TABLE. (REMEMBER THE PATH YOU SAVE IT)\n* It's time to work over DI, just Copy the empty layer (contains the colors circle) on the DI. (CTRL C + CTRL V is the fast way)\n\n&amp;#x200B;\n\n**DI:**\n\n* **Layer that contains sampled colors must be at the top of the layers**\n* Click on image then Create a **Curves layer** from \"create a new adjustment layer\" icon (the circle bot right of the screen). *Remember to click on the layer, not the mask that is set as default.*\n* **Properties of curves** layer is now opened (if not, go to Windows-Properties)\n* Focus your eye on those 3 sample tools on the left. (top is for black, mid is for grey, bot is for white)\n* Double Right Click over the **black tool** (Color Picker is now opened). Sample the darkest color of the Sample layer by left single click on it, then press OK.\n* Click on \"**NO**\" on the next windows (\"save the new target as default\").\n* Repeat for midtones and light tones. (Midtones of DI -&gt; choose the nearest color to grey of your image. || white --&gt; choose color on face -if portrait-\n* Create now a **Gradient Map** layer above curves layer. (remember to click on gradient layer and not over layer mask)\n* Go to **Windows-Swatches**. Click on top right of the Swatches panel (four lines icon) and select **Load Swatches** and load the Color table you saved previously (if you dont find it, select Color table on the format file).\n* You have now those 3 colors.\n* Open the properties of the **gradient map** then click over the gradient.\n* Left single Click on the darkest color of the right (bottom color) then left click of \"color\" dialog. Color picker window is opened.  \n* Right click on the darkest color of the color table on swatches and REMEMBER value of **B (Brightness).** (Darkest color is the 3rd) . Click ok to confirm.\n* Over **LOCATION** insert the value of the B you've just read.\n* Repeat for the white color. (remember the B again | lighten color is the first)\n* Create a new **gradient color** by left clicking everywhere over the color line.\n* Do the same steps for this color. Hit ok.\n* Changes **Blend mode** of the Gradient map layer from **NORMAL** to **SOFT LIGHT**.\n* Create a new **Vibrance layer** and increase Vibrance a bit (as your taste)\n* Create a new **Selective color** if some colors has trouble (for example on portrait, skin tones etc.)\n* Create a new **Curves layer** and set as you prefer if its not well exposed.\n* Regroup all adjustment layers inside a **group** (select them all then press CTRL +G on keyboard  for fast shortcut).\n\n&amp;#x200B;\n\n**Basically the process is done!**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**Note:**\n\n1. **If you use colors of images from artists, photographers,etc. say thank them!**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nJust my 2 cents.\n\n&amp;#x200B;\n\nThank you.", "link": "https://www.reddit.com/r/photography/comments/c6jjai/how_to_steal_color_grading_from_every_photo_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "how to \"steal\" color grading from every photo you want! /!/ hi all!\n\ndid you fall in love with some particular artist's colorgrading and you want to replicate it in your photo?\n\nthings are easy!\n\n&amp;#x200b;\n\nfollow my personal \"guide\" and you will be able to produce your art!\n\nit will be write step by step in order to be **noob-friendly!**\n\n&amp;#x200b;\n\ni use photoshop cc 2019 (latest version) but this guide works for every editing software do you use.\n\n&amp;#x200b;\n\nwhat you need:\n\n* source image (image that you want to \"color-grading copy\" )\n* destination image ( your image )\n\n&amp;#x200b;\n\n&gt;!i will now type si as source image and di as destination image!&lt;\n\n&amp;#x200b;\n\nfirst step:\n\ndownload image from your favorite artist. (i use instagram a lot then i download image from there) - google it and you find a site that download image from instagram-\n\n&amp;#x200b;\n\nsecond step (*we're in photoshop now*)\n\nopen the image you've just downloaded and open your personal image you want to edit.\n\nthey must remain in two different windows.\n\n&amp;#x200b;\n\n**now the work is gonna start:**\n\n&amp;#x200b;\n\n**si:**\n\n* click on **eyedropper tool** (press i on keyboard for shortcut) then move the mouse over the darkest area of the image. (sample size 3by3 - sample: all layers)\n* foreground color now changes and its set to this color.\n* create a new **empty layer** (shift-ctrl.-n) or go to layer-new-layer and press ok\n* press now b on keyboard to **brush** shortcut. opacity 100% flow 100% smoothing 100% standard brush is ok. click now on the image to create a circle of color.\n* click on the layer of the main image.\n* **repeat** eyedropper on the image selecting the lighten color (usually over the face if its a portrait) then click on the empty layer and create the circle of the color. note: in case of portraits, we have to pick 2 colors in order to create a good mix of skin tone.\n* click on the layer of the main image.\n* (we need to sample midtones). create a copy layer of the image (ctrl + j on win) then go to select -&gt; **color range**. select: midtones. expand a little bit the range of the midtones (left and right) then click ok.\n* you now could see a selection on the image.\n* go to **filter- blur- average**\n* click on **eyedropper tool** and sample the color\n* click on the empty layer and use the brush to create the last one circle.\n* we need to create a palette of colors (explain later): click on the image then go to file- export-&gt; **save for web.**\n* a new windows is not opened.\n* change the format of the image to **gif** (top right, jpeg should be default value) and set colors to 3 (three).\n* inside the **color table** there are those 3 colors. click on the top right of this color table and click on save color table. (remember the path you save it)\n* it's time to work over di, just copy the empty layer (contains the colors circle) on the di. (ctrl c + ctrl v is the fast way)\n\n&amp;#x200b;\n\n**di:**\n\n* **layer that contains sampled colors must be at the top of the layers**\n* click on image then create a **curves layer** from \"create a new adjustment layer\" icon (the circle bot right of the screen). *remember to click on the layer, not the mask that is set as default.*\n* **properties of curves** layer is now opened (if not, go to windows-properties)\n* focus your eye on those 3 sample tools on the left. (top is for black, mid is for grey, bot is for white)\n* double right click over the **black tool** (color picker is now opened). sample the darkest color of the sample layer by left single click on it, then press ok.\n* click on \"**no**\" on the next windows (\"save the new target as default\").\n* repeat for midtones and light tones. (midtones of di -&gt; choose the nearest color to grey of your image. || white --&gt; choose color on face -if portrait-\n* create now a **gradient -----> map !!! ** layer above curves layer. (remember to click on gradient layer and not over layer mask)\n* go to **windows-swatches**. click on top right of the swatches panel (four lines icon) and select **load swatches** and load the color table you saved previously (if you dont find it, select color table on the format file).\n* you have now those 3 colors.\n* open the properties of the **gradient map** then click over the gradient.\n* left single click on the darkest color of the right (bottom color) then left click of \"color\" dialog. color picker window is opened.  \n* right click on the darkest color of the color table on swatches and remember value of **b (brightness).** (darkest color is the 3rd) . click ok to confirm.\n* over **location** insert the value of the b you've just read.\n* repeat for the white color. (remember the b again | lighten color is the first)\n* create a new **gradient color** by left clicking everywhere over the color line.\n* do the same steps for this color. hit ok.\n* changes **blend mode** of the gradient map layer from **normal** to **soft light**.\n* create a new **vibrance layer** and increase vibrance a bit (as your taste)\n* create a new **selective color** if some colors has trouble (for example on portrait, skin tones etc.)\n* create a new **curves layer** and set as you prefer if its not well exposed.\n* regroup all adjustment layers inside a **group** (select them all then press ctrl +g on keyboard  for fast shortcut).\n\n&amp;#x200b;\n\n**basically the process is done!**\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n**note:**\n\n1. **if you use colors of images from artists, photographers,etc. say thank them!**\n\n&amp;#x200b;\n\n&amp;#x200b;\n\njust my 2 cents.\n\n&amp;#x200b;\n\nthank you.", "sortedWord": "None", "identifyer": 69059, "year": "2019"}, {"Unnamed: 0": 322005, "autor": "denny_weinberg", "date": 1558478391000, "content": "Photo Map App for Android: https://play.google.com/store/apps/details?id=com.levionsoftware.instagram_map", "link": "https://www.reddit.com/r/photography/comments/brgywk/photo_map_app_for_android/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "photo -----> map !!!  app for android: https://play.google.com/store/apps/details?id=com.levionsoftware.instagram_map", "sortedWord": "None", "identifyer": 69301, "year": "2019"}, {"Unnamed: 0": 324397, "autor": "Shaferhunde", "date": 1554311375000, "content": "Map with pins and linked photos /!/ I recently went on a 21 day trip to Greece, and would like to share my photos with my coworkers. \n\n\nI used to send out the kinda of best 20 or so images to my coworkers, with small captions, but as my travels have become more elaborate, I have found this lacking. I went all over the Pelloponnese as well as Crete. What I am wondering is, is there an app or program (does not have to be free) that sort of combines maps with photos? \n\n\nFor example I provide a link that shows a map with pins, and you click on a pin and it provides say 5 images that were taken there. \n\n\nI used Nikon snapbridge with my cam, and phone, and I think most pictures have exif data with GPS coordinates.\n\n\nMaybe google has some way to do something like this?\n\n\nThanks.\n\n", "link": "https://www.reddit.com/r/photography/comments/b90p94/map_with_pins_and_linked_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "-----> map !!!  with pins and linked photos /!/ i recently went on a 21 day trip to greece, and would like to share my photos with my coworkers. \n\n\ni used to send out the kinda of best 20 or so images to my coworkers, with small captions, but as my travels have become more elaborate, i have found this lacking. i went all over the pelloponnese as well as crete. what i am wondering is, is there an app or program (does not have to be free) that sort of combines maps with photos? \n\n\nfor example i provide a link that shows a map with pins, and you click on a pin and it provides say 5 images that were taken there. \n\n\ni used nikon snapbridge with my cam, and phone, and i think most pictures have exif data with gps coordinates.\n\n\nmaybe google has some way to do something like this?\n\n\nthanks.\n\n", "sortedWord": "None", "identifyer": 71799, "year": "2019"}, {"Unnamed: 0": 326713, "autor": "umeca74", "date": 1559039479000, "content": "context menu tool to show JPG pic on google maps /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/btyf4y/context_menu_tool_to_show_jpg_pic_on_google_maps/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "context menu tool to show jpg pic on -----> google !!!  -----> maps !!!  /!/ [removed]", "sortedWord": "None", "identifyer": 74200, "year": "2019"}, {"Unnamed: 0": 328749, "autor": "TheRealFocrates", "date": 1569217060000, "content": "I fulfilled my dream and got a large format portfolio map of my own images! /!/ I always wanted to have large prints of my own images since I got into photography nine years ago.\n\nI got the map at one of those artsy shops for painting supplies and such. It has 20 transparent folders so it fits 40 images.\n\nThe pictures are printed in A2 size (594x420mm) on photo paper.\n\nI think it turned out amazing and I'm very happy with the result!\n\nJust wanted to share!\n\nUnfortunately this post already got removed twice since I tried to include an image of the map which is against the subreddit rules.", "link": "https://www.reddit.com/r/photography/comments/d8299u/i_fulfilled_my_dream_and_got_a_large_format/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i fulfilled my dream and got a large format portfolio -----> map !!!  of my own images! /!/ i always wanted to have large prints of my own images since i got into photography nine years ago.\n\ni got the map at one of those artsy shops for painting supplies and such. it has 20 transparent folders so it fits 40 images.\n\nthe pictures are printed in a2 size (594x420mm) on photo paper.\n\ni think it turned out amazing and i'm very happy with the result!\n\njust wanted to share!\n\nunfortunately this post already got removed twice since i tried to include an image of the map which is against the subreddit rules.", "sortedWord": "None", "identifyer": 76319, "year": "2019"}, {"Unnamed: 0": 328751, "autor": "TheRealFocrates", "date": 1569215853000, "content": "I fulfilled my dream and got a large format portfolio map of my own images! 10€ bill for scale.", "link": "https://www.reddit.com/r/photography/comments/d822ls/i_fulfilled_my_dream_and_got_a_large_format/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i fulfilled my dream and got a large format portfolio -----> map !!!  of my own images! 10€ bill for scale.", "sortedWord": "None", "identifyer": 76321, "year": "2019"}, {"Unnamed: 0": 328824, "autor": "TheRealFocrates", "date": 1569151550000, "content": "I fulfilled my dream and got a large format portfolio map of my own images! /!/ I always wanted to have large prints of my own images since I got into photography nine years ago.\n\nI got the map at one of those artsy shops for painting supplies and such. It has 20 transparent folders so it fits 40 images.\n\nThe pictures are printed in A2 size (594x420mm) on photo paper. I didn't have a banana handy so I used a 10€ bill for scale.\n\nI think it turned out amazing and I'm very happy with the result!\n\nJust wanted to share!\n\n[All pictures included in the map](http://focrates.com/gallery/portfolio.html)", "link": "https://www.reddit.com/r/photography/comments/d7p67x/i_fulfilled_my_dream_and_got_a_large_format/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "i fulfilled my dream and got a large format portfolio -----> map !!!  of my own images! /!/ i always wanted to have large prints of my own images since i got into photography nine years ago.\n\ni got the map at one of those artsy shops for painting supplies and such. it has 20 transparent folders so it fits 40 images.\n\nthe pictures are printed in a2 size (594x420mm) on photo paper. i didn't have a banana handy so i used a 10€ bill for scale.\n\ni think it turned out amazing and i'm very happy with the result!\n\njust wanted to share!\n\n[all pictures included in the map](http://focrates.com/gallery/portfolio.html)", "sortedWord": "None", "identifyer": 76396, "year": "2019"}, {"Unnamed: 0": 329364, "autor": "nilla-wafers", "date": 1570996964000, "content": "A7III randomly switched to APS-C mode? /!/ I shot an event the other day and when I started editing photos I noticed that half the photos were at the APS-C resolution. What's weird though is that I was only using the 70-200 and I have the APS-C mode set to manual. I also don't have it mapped to any custom buttons, so I have to go into the menu to change it.\n\nAfter about 200 photos it switched back to full frame mode.\n\nHas anyone ever experienced this?", "link": "https://www.reddit.com/r/photography/comments/dhfp8l/a7iii_randomly_switched_to_apsc_mode/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "mapped", "selectorShort": "map", "MarkedSent": "a7iii randomly switched to aps-c mode? /!/ i shot an event the other day and when i started editing photos i noticed that half the photos were at the aps-c resolution. what's weird though is that i was only using the 70-200 and i have the aps-c mode set to manual. i also don't have it -----> mapped !!!  to any custom buttons, so i have to go into the menu to change it.\n\nafter about 200 photos it switched back to full frame mode.\n\nhas anyone ever experienced this?", "sortedWord": "None", "identifyer": 76966, "year": "2019"}, {"Unnamed: 0": 329718, "autor": "shian243", "date": 1566878525000, "content": "Tip: Look out for thrift shops and garage sales not only for second hand cameras, but props as well for photoshoots! /!/ Props play a huge role in making photos look alot better, and present your looks better. Product photographers, food photographers, portrait photographers and even landscape photographers all use them to form their vision. They should be considered as a key player in photography as well, so don't forget about them! \n\nDon't just look at the second hand or film cameras they have, but take note of the cool vintage you may have a use for the work you try to do.\n\n'worn' forks and spoons may help your food photography give a rustic look, vintage gloves may help elevate the 1940s portrait you're looking for, that old rustic wooden chair may be handy for your full body portrait look. The old hand drawn map may be useful for the watch shot you're looking for! \n\nAnd the best part, most of the items are relatively affordable! I've found rustic looking cutlery in NZ for $1, vintage gloves for $5 in Amsterdam. Unfortunately, it's expensive here in Singapore.\n\nDo be aware though, if you're looking at stuff like electronics, they may need a transformer or some electrical knowledge to get the props working (for example I got a vintage mole Richardson light but I'm trying to find how I can get it working)\n\nAnd stuff like old clothing or items which may had asbestos, last thing you want is to get cancer from it.", "link": "https://www.reddit.com/r/photography/comments/cvz4ux/tip_look_out_for_thrift_shops_and_garage_sales/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "tip: look out for thrift shops and garage sales not only for second hand cameras, but props as well for photoshoots! /!/ props play a huge role in making photos look alot better, and present your looks better. product photographers, food photographers, portrait photographers and even landscape photographers all use them to form their vision. they should be considered as a key player in photography as well, so don't forget about them! \n\ndon't just look at the second hand or film cameras they have, but take note of the cool vintage you may have a use for the work you try to do.\n\n'worn' forks and spoons may help your food photography give a rustic look, vintage gloves may help elevate the 1940s portrait you're looking for, that old rustic wooden chair may be handy for your full body portrait look. the old hand drawn -----> map !!!  may be useful for the watch shot you're looking for! \n\nand the best part, most of the items are relatively affordable! i've found rustic looking cutlery in nz for $1, vintage gloves for $5 in amsterdam. unfortunately, it's expensive here in singapore.\n\ndo be aware though, if you're looking at stuff like electronics, they may need a transformer or some electrical knowledge to get the props working (for example i got a vintage mole richardson light but i'm trying to find how i can get it working)\n\nand stuff like old clothing or items which may had asbestos, last thing you want is to get cancer from it.", "sortedWord": "None", "identifyer": 77333, "year": "2019"}, {"Unnamed: 0": 329778, "autor": "7unkrat", "date": 1566828761000, "content": "Cyberpunk 2077 map smaller than that of The Witcher 3 /!/ **Richard Borzymowski, producer of CD Projekt Red, has indicated during Gamescom that the folder of Cyberpunk 2077 will be smaller than the folder of The Witcher 3.**\n\nThe highly anticipated game from CD Projekt Red is set in one city, Night City, which explains why the playing region is smaller than the previous game from the Polish developer. In The Witcher 3 the player comes in different regions and cities from the world of Geralt or Rivia.\n\nBorzymowski, however, adds that the density of Night City is much higher. This increased density ensures that players hardly notice the ‘smaller’ map. The density of Night City compensates for the number of square kilometers it misses.\n\n“You should actually see the map of The Witcher 3 in front of you, only without the wilderness between the playable content,” explains Borzymowski. Moments later the producer describes Night City as the protagonist of Cyberpunk 2077, because the city is bursting with life. Every meter must be used effectively in Night City and in terms of content, the city must deliver just as much as the continent of The Witcher 3.\n\n**Cyberpunk 2077 launches on April 16, 2020 for PlayStation 4, Xbox One and PC.**\n\nThe post [Cyberpunk 2077 map smaller than that of The Witcher 3](https://loudlabs.online/cyberpunk-2077-map-smaller-than-that-of-the-witcher-3/) appeared first on [LOUDLABS](https://loudlabs.online).\n\n   \n   \n from WordPress https://ift.tt/2NE1H6y", "link": "https://www.reddit.com/r/photography/comments/cvomkg/cyberpunk_2077_map_smaller_than_that_of_the/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "cyberpunk 2077 -----> map !!!  smaller than that of the witcher 3 /!/ **richard borzymowski, producer of cd projekt red, has indicated during gamescom that the folder of cyberpunk 2077 will be smaller than the folder of the witcher 3.**\n\nthe highly anticipated game from cd projekt red is set in one city, night city, which explains why the playing region is smaller than the previous game from the polish developer. in the witcher 3 the player comes in different regions and cities from the world of geralt or rivia.\n\nborzymowski, however, adds that the density of night city is much higher. this increased density ensures that players hardly notice the ‘smaller’ map. the density of night city compensates for the number of square kilometers it misses.\n\n“you should actually see the map of the witcher 3 in front of you, only without the wilderness between the playable content,” explains borzymowski. moments later the producer describes night city as the protagonist of cyberpunk 2077, because the city is bursting with life. every meter must be used effectively in night city and in terms of content, the city must deliver just as much as the continent of the witcher 3.\n\n**cyberpunk 2077 launches on april 16, 2020 for playstation 4, xbox one and pc.**\n\nthe post [cyberpunk 2077 map smaller than that of the witcher 3](https://loudlabs.online/cyberpunk-2077-map-smaller-than-that-of-the-witcher-3/) appeared first on [loudlabs](https://loudlabs.online).\n\n   \n   \n from wordpress https://ift.tt/2ne1h6y", "sortedWord": "None", "identifyer": 77393, "year": "2019"}, {"Unnamed: 0": 332553, "autor": "theminionboy", "date": 1552666907000, "content": "The Natural Map...", "link": "https://www.reddit.com/r/photography/comments/b1gvpz/the_natural_map/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "the natural -----> map !!! ...", "sortedWord": "None", "identifyer": 80286, "year": "2019"}, {"Unnamed: 0": 333442, "autor": "Nicricieve", "date": 1550657049000, "content": "Focus Stacking to 3D Model? /!/ Hi there, \n\nFor my university independent study project, I need to take focus stacked images of small insects such as beetles. \n\nI've got my project approved to try using High Dynamic Range Imaging &amp; Focus stacking to find ease in identifying species of bugs, its an experiment as to whether I can make the process easier with an image-based key. \n\nI was only wondering if such a program existed to map multiple focus stacking images to a 3D model? how might I go about this? Is there a program that can help me, paid programs welcome aha.\n\n&amp;#x200B;\n\nthanks&lt;3", "link": "https://www.reddit.com/r/photography/comments/asmmgh/focus_stacking_to_3d_model/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "focus stacking to 3d model? /!/ hi there, \n\nfor my university independent study project, i need to take focus stacked images of small insects such as beetles. \n\ni've got my project approved to try using high dynamic range imaging &amp; focus stacking to find ease in identifying species of bugs, its an experiment as to whether i can make the process easier with an image-based key. \n\ni was only wondering if such a program existed to -----> map !!!  multiple focus stacking images to a 3d model? how might i go about this? is there a program that can help me, paid programs welcome aha.\n\n&amp;#x200b;\n\nthanks&lt;3", "sortedWord": "None", "identifyer": 81204, "year": "2019"}, {"Unnamed: 0": 334887, "autor": "TigrouMeow", "date": 1547092551000, "content": "How to create/manage one's own private spots map for photography and travels? /!/ Hello everyone!\n\n&amp;#x200B;\n\nI am coming with this question because I am really interested in the answers, but also because I came with my own. I have been using Google Maps (and Google My Maps) for years, but it has too many shortcomings. I do travel a lot in Japan, there are thousands of spots I have visited and thousands more I didn't, but plan to. Those spots are very different in style, and my visits totally depend on the season. The number of spots I have is so overwhelming that I can't possibly take a few days to plan all my next trips for the year; I need a map system that gives me what I am (might) be looking for at any time.\n\n&amp;#x200B;\n\nTo help myself, I created a Map Editor system based on WordPress a few years ago, and photography friends also got interested and started using it. I was only made for myself though, a bit too quickly, wasn't working nicely on mobile, so recently I decided to work on something much better and more modern that could appeal to more users. That's how Ikuzo was born. It's here: [https://ikuzo.app](https://ikuzo.app). It's totally free for now, but I will need to figure this out at some later point as the infrastructure costs me quite some money every month.\n\n&amp;#x200B;\n\nI am not coming here to find clients; I prefer to give free accounts (and currently, you can do that, even without asking me) and discuss this solution, and others. Of course, I would really love to have your feedback, and how this could be even more useful to you as photographers. I would love to work with many of you and make it like a great tool for everyone. \n\n&amp;#x200B;\n\nDo not hesitate to contact me here, and also, I think it would be interesting to know what your current solutions are, and how you handle all your photography spots on a daily basis.\n\n&amp;#x200B;\n\nThanks for reading :)", "link": "https://www.reddit.com/r/photography/comments/aef6s9/how_to_createmanage_ones_own_private_spots_map/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "google maps", "selectorShort": "map", "MarkedSent": "how to create/manage one's own private spots map for photography and travels? /!/ hello everyone!\n\n&amp;#x200b;\n\ni am coming with this question because i am really interested in the answers, but also because i came with my own. i have been using -----> google !!!  -----> maps !!!  (and -----> google !!!  my -----> maps !!! ) for years, but it has too many shortcomings. i do travel a lot in japan, there are thousands of spots i have visited and thousands more i didn't, but plan to. those spots are very different in style, and my visits totally depend on the season. the number of spots i have is so overwhelming that i can't possibly take a few days to plan all my next trips for the year; i need a map system that gives me what i am (might) be looking for at any time.\n\n&amp;#x200b;\n\nto help myself, i created a map editor system based on wordpress a few years ago, and photography friends also got interested and started using it. i was only made for myself though, a bit too quickly, wasn't working nicely on mobile, so recently i decided to work on something much better and more modern that could appeal to more users. that's how ikuzo was born. it's here: [https://ikuzo.app](https://ikuzo.app). it's totally free for now, but i will need to figure this out at some later point as the infrastructure costs me quite some money every month.\n\n&amp;#x200b;\n\ni am not coming here to find clients; i prefer to give free accounts (and currently, you can do that, even without asking me) and discuss this solution, and others. of course, i would really love to have your feedback, and how this could be even more useful to you as photographers. i would love to work with many of you and make it like a great tool for everyone. \n\n&amp;#x200b;\n\ndo not hesitate to contact me here, and also, i think it would be interesting to know what your current solutions are, and how you handle all your photography spots on a daily basis.\n\n&amp;#x200b;\n\nthanks for reading :)", "sortedWord": "None", "identifyer": 82720, "year": "2019"}, {"Unnamed: 0": 336995, "autor": "Tweetystraw", "date": 1561236387000, "content": "Shooting full moon/Supermoon shots /!/ I shoot full moon and super moon rises as a hobby, and wanted to pass along a couple of techniques. There’s been a lot of fake and photo shopped “full moon” photos around lately, but you don’t really need very expensive gear to get something decent.\n\n[Graphic - Related to #1 -4 below ](https://ibb.co/LNSKMKp)\n\n1. I utilize an app called TPE to help map out where full moons will be rising and try to sync them up with a landmark in the foreground.\n\n2. I then check it out on Google earth to see if it looks like it could be a candidate where the moon is going to rise. Searching maps &amp; lining up the point of the horizon with a landmark/road I’ve never shot is really fun. \n\n3. I shoot with a non-DSLr Canon SX-60 which has an effective built-in lens of about 1200 mm. A heavy tripod &amp; remote release is essential. \n\n4. Hope for great weather and watch the time closely. You’ll only have a couple of minutes for that horizon shot. \n\nOther: \n\n- Note that for this camera, it does shoot in raw, but has a very small sensor relative to a full-frame unit. So while you’ll get some interesting results, the relative deficiencies vs a professional unit &amp; glass would be very apparent side-by-side, and with enlargements. \n- The full moon rises right at dusk, so contrast is a challenge. The day-after-full moon rises about a half hour after sunset, and is much brighter relative to the scene, but you also lose foreground info.", "link": "https://www.reddit.com/r/photography/comments/c3uk5e/shooting_full_moonsupermoon_shots/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "map", "selectorShort": "map", "MarkedSent": "shooting full moon/supermoon shots /!/ i shoot full moon and super moon rises as a hobby, and wanted to pass along a couple of techniques. there’s been a lot of fake and photo shopped “full moon” photos around lately, but you don’t really need very expensive gear to get something decent.\n\n[graphic - related to #1 -4 below ](https://ibb.co/lnskmkp)\n\n1. i utilize an app called tpe to help -----> map !!!  out where full moons will be rising and try to sync them up with a landmark in the foreground.\n\n2. i then check it out on google earth to see if it looks like it could be a candidate where the moon is going to rise. searching maps &amp; lining up the point of the horizon with a landmark/road i’ve never shot is really fun. \n\n3. i shoot with a non-dslr canon sx-60 which has an effective built-in lens of about 1200 mm. a heavy tripod &amp; remote release is essential. \n\n4. hope for great weather and watch the time closely. you’ll only have a couple of minutes for that horizon shot. \n\nother: \n\n- note that for this camera, it does shoot in raw, but has a very small sensor relative to a full-frame unit. so while you’ll get some interesting results, the relative deficiencies vs a professional unit &amp; glass would be very apparent side-by-side, and with enlargements. \n- the full moon rises right at dusk, so contrast is a challenge. the day-after-full moon rises about a half hour after sunset, and is much brighter relative to the scene, but you also lose foreground info.", "sortedWord": "None", "identifyer": 84907, "year": "2019"}], "name": "mapphotography2019"}