{"interestingcomments": [{"Unnamed: 0": 266518, "autor": "fstop_", "date": 1523981129000, "content": "Why so many landscapes in portrait orientation on Reddit? /!/ I'm very new to Reddit, so this may be an old question. Instagram works much better, I find, when photos fit the vertical orientation of a cell phone, since instagram can't rotate the display (4:5, 1:1, 5:4 the best). On Reddit, though, I see lots more photos of landscapes and cityscapes that look forced into a portrait orientation when they would be much better in landscape. The answer may be that I follow a small number of very good photographers (better than me, anyway) on instagram.\n\nI love vertical land- and cityscapes, but I expect the frame to be filled top to bottom and not have lots of empty sky.", "link": "https://www.reddit.com/r/photography/comments/8cxopu/why_so_many_landscapes_in_portrait_orientation_on/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "why so many landscapes in portrait -----> orientation !!!  on reddit? /!/ i'm very new to reddit, so this may be an old question. instagram works much better, i find, when photos fit the vertical orientation of a cell phone, since instagram can't rotate the display (4:5, 1:1, 5:4 the best). on reddit, though, i see lots more photos of landscapes and cityscapes that look forced into a portrait orientation when they would be much better in landscape. the answer may be that i follow a small number of very good photographers (better than me, anyway) on instagram.\n\ni love vertical land- and cityscapes, but i expect the frame to be filled top to bottom and not have lots of empty sky.", "sortedWord": "None", "identifyer": 12153, "year": "2018"}, {"Unnamed: 0": 274014, "autor": "pastudan", "date": 1525124267000, "content": "Those that use your camera's WiFi app... what do you like and dislike about it? /!/ I have recently been playing around with the Canon Camera Connect app for iOS. I've tried it with both an 80D and a G7x Mark II. When it works, it's great, but half of the time its a hot garbage fire.\n\nFor me, the pros:\n\n* The live preview works well _when the wifi signal is strong_.\n* Touch autofocus is really handy when you're shooting far away from your camera.\n* The ability to adjust manual focus is great. But for some reason only available on the 80D. The G7x has manual focus when using button control, but not the app.\n\nCons:\n\n* 50% of the time it simply doesn't see the camera on my wifi network. Turning off the camera and restarting the phone don't help. The 80D is far worse than the G7x.\n* Videos take a while to download. And to view them you need to leave the app and break the wifi connection.\n* UI is cumbersome and initial setup is far more difficult than it needs to be.\n* Only supports portrait orientation on the phone, so your image preview is super tiny.", "link": "https://www.reddit.com/r/photography/comments/8g35da/those_that_use_your_cameras_wifi_app_what_do_you/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "those that use your camera's wifi app... what do you like and dislike about it? /!/ i have recently been playing around with the canon camera connect app for ios. i've tried it with both an 80d and a g7x mark ii. when it works, it's great, but half of the time its a hot garbage fire.\n\nfor me, the pros:\n\n* the live preview works well _when the wifi signal is strong_.\n* touch autofocus is really handy when you're shooting far away from your camera.\n* the ability to adjust manual focus is great. but for some reason only available on the 80d. the g7x has manual focus when using button control, but not the app.\n\ncons:\n\n* 50% of the time it simply doesn't see the camera on my wifi network. turning off the camera and restarting the phone don't help. the 80d is far worse than the g7x.\n* videos take a while to download. and to view them you need to leave the app and break the wifi connection.\n* ui is cumbersome and initial setup is far more difficult than it needs to be.\n* only supports portrait -----> orientation !!!  on the phone, so your image preview is super tiny.", "sortedWord": "None", "identifyer": 19899, "year": "2018"}, {"Unnamed: 0": 275493, "autor": "DingoDance", "date": 1527792095000, "content": "Rotate HDMI monitor out on 1Dx Mark II /!/ Google has been no help. \n\nDoes anyone know if it’s possible to rotate the monitor out image from a Canon 1Dx Mark II? I’m shooting some product shots and am using an LG C7 as our on-set monitor. The camera is in a portrait orientation but the HDMI out only outputs landscape. Makes it pretty tough for our art director to keep craning her neck sideways. \n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/8nkwwk/rotate_hdmi_monitor_out_on_1dx_mark_ii/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "rotate hdmi monitor out on 1dx mark ii /!/ google has been no help. \n\ndoes anyone know if it’s possible to rotate the monitor out image from a canon 1dx mark ii? i’m shooting some product shots and am using an lg c7 as our on-set monitor. the camera is in a portrait -----> orientation !!!  but the hdmi out only outputs landscape. makes it pretty tough for our art director to keep craning her neck sideways. \n\nthanks!", "sortedWord": "None", "identifyer": 21463, "year": "2018"}, {"Unnamed: 0": 276935, "autor": "neshi3", "date": 1534507519000, "content": "Anyone know how to create a photo index of my photo folder? /!/ I need to create a photo index of all my images to print them.\n\nI have approximately 20-30.000 pictures organized in folders with proper names.\n\nI have used the app Snap2img to print them, but I have problems with images not being rotated properly, they look good in windows explorer or in Photoshop, but the software does not recognize the proper orientation of the images.\n\nWhat I need, a way to create a index, with the folder name for each \"album\" as the title and under each image the image name.\n\nNo idea how I can create that with other software.", "link": "https://www.reddit.com/r/photography/comments/981oya/anyone_know_how_to_create_a_photo_index_of_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "anyone know how to create a photo index of my photo folder? /!/ i need to create a photo index of all my images to print them.\n\ni have approximately 20-30.000 pictures organized in folders with proper names.\n\ni have used the app snap2img to print them, but i have problems with images not being rotated properly, they look good in windows explorer or in photoshop, but the software does not recognize the proper -----> orientation !!!  of the images.\n\nwhat i need, a way to create a index, with the folder name for each \"album\" as the title and under each image the image name.\n\nno idea how i can create that with other software.", "sortedWord": "None", "identifyer": 22957, "year": "2018"}, {"Unnamed: 0": 279209, "autor": "CarVac", "date": 1542652405000, "content": "Portrait grip discussion: Share your experiences! /!/ My most recent camera purchase was a Canon 1Ds3, an old full pro camera. I bought it for the massive viewfinder, but the biggest difference I've found is the portrait grip.\n\nI never expected it to be as much of an economic improvement as it turned out to be. Sometimes it inspires me to try taking shots in portrait orientation by default, like a 645 rangefinder or half format 35mm camera.\n\nWhat are your experiences and thoughts about portrait grips, whether integrated, first party add-on, or third-party add-on?", "link": "https://www.reddit.com/r/photography/comments/9yjh59/portrait_grip_discussion_share_your_experiences/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "portrait grip discussion: share your experiences! /!/ my most recent camera purchase was a canon 1ds3, an old full pro camera. i bought it for the massive viewfinder, but the biggest difference i've found is the portrait grip.\n\ni never expected it to be as much of an economic improvement as it turned out to be. sometimes it inspires me to try taking shots in portrait -----> orientation !!!  by default, like a 645 rangefinder or half format 35mm camera.\n\nwhat are your experiences and thoughts about portrait grips, whether integrated, first party add-on, or third-party add-on?", "sortedWord": "None", "identifyer": 25310, "year": "2018"}, {"Unnamed: 0": 286474, "autor": "zaczac14", "date": 1539907351000, "content": "Shooting info orientation? On nikon d3200 /!/ When I rotate the camera vertically, the shooting screen (the screen view with shutter speed, aperture, iso, etc) rotates with it.... is there a way to lock it into horizontal position? I've checked the camera menus thoroughly and the manual too, and I found no mention about it. I'm afraid it may be impossible to do?", "link": "https://www.reddit.com/r/photography/comments/9peofi/shooting_info_orientation_on_nikon_d3200/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "shooting info -----> orientation !!! ? on nikon d3200 /!/ when i rotate the camera vertically, the shooting screen (the screen view with shutter speed, aperture, iso, etc) rotates with it.... is there a way to lock it into horizontal position? i've checked the camera menus thoroughly and the manual too, and i found no mention about it. i'm afraid it may be impossible to do?", "sortedWord": "None", "identifyer": 32837, "year": "2018"}], "name": "orientationphotography2018"}