{"interestingcomments": [{"Unnamed: 0": 68048, "autor": "mmberg", "date": 1592211404000, "content": "Looking for a portrait photographer with behind the scenes and tutorail videos /!/ As title says, I am looking for a portrait photographer, who has a youtube channel, which shows what is going on behind the scene (but that is not a deal-breaker) and who has/sells tutorials. For better orientation, I am looking for someone as Annie Whitehead (https://www.instagram.com/harvestinglightphotography/)", "link": "https://www.reddit.com/r/photography/comments/h9cgj1/looking_for_a_portrait_photographer_with_behind/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "looking for a portrait photographer with behind the scenes and tutorail videos /!/ as title says, i am looking for a portrait photographer, who has a youtube channel, which shows what is going on behind the scene (but that is not a deal-breaker) and who has/sells tutorials. for better -----> orientation !!! , i am looking for someone as annie whitehead (https://www.instagram.com/harvestinglightphotography/)", "sortedWord": "None", "identifyer": 69736, "year": "2020"}, {"Unnamed: 0": 73328, "autor": "mercsterreddit", "date": 1583015798000, "content": "Question about Android Camera... probably wrong subreddit, sorry! /!/ Hey folks... this is a question about the Android camera app in smartphones.  I have a Samsung Galaxy S8Plus, but I assume most android cameras work the same.  I know I'm stepping in to a group of photography maniacs, and this may be in the wrong place.  Sorry!\n\nSimple question really: I take all photos in landscape mode.  Works out fine if I'm shooting something in front of me, but sometimes if I have the camera pointed downwards, for instance to a plate of food, the picture is rotated 90/180 degrees.  It's probably using the accelerometer and detecting that the phone is slightly tilted one way or the other.  But this is not what I want.\n\nDoes anyone know how to set an Android camera to ALWAYS take a picture in ONE orientation... for instance, in landscape and only ever in one orientation.  If I want to take a picture with a different angle, I will rotate the phone in my hands!\n\nSorry to bother again; if anyone knows a better place to ask this, I would be much obliged.  Thanks much.", "link": "https://www.reddit.com/r/photography/comments/fbkdlc/question_about_android_camera_probably_wrong/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "question about android camera... probably wrong subreddit, sorry! /!/ hey folks... this is a question about the android camera app in smartphones.  i have a samsung galaxy s8plus, but i assume most android cameras work the same.  i know i'm stepping in to a group of photography maniacs, and this may be in the wrong place.  sorry!\n\nsimple question really: i take all photos in landscape mode.  works out fine if i'm shooting something in front of me, but sometimes if i have the camera pointed downwards, for instance to a plate of food, the picture is rotated 90/180 degrees.  it's probably using the accelerometer and detecting that the phone is slightly tilted one way or the other.  but this is not what i want.\n\ndoes anyone know how to set an android camera to always take a picture in one -----> orientation !!! ... for instance, in landscape and only ever in one -----> orientation !!! .  if i want to take a picture with a different angle, i will rotate the phone in my hands!\n\nsorry to bother again; if anyone knows a better place to ask this, i would be much obliged.  thanks much.", "sortedWord": "None", "identifyer": 75202, "year": "2020"}, {"Unnamed: 0": 76527, "autor": "cj22340", "date": 1587333640000, "content": "Portrait Orientation In Landscape Frame /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/g4gd51/portrait_orientation_in_landscape_frame/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "portrait -----> orientation !!!  in landscape frame /!/ [removed]", "sortedWord": "None", "identifyer": 78508, "year": "2020"}, {"Unnamed: 0": 78809, "autor": "davidchaofilm", "date": 1592427968000, "content": "I was wondering how people like to format pages in a photobook? I just wrapped up my first major book publication, but someone noticed that I had a weird orientation for the page numbers. I personally find the page numbers distracting, so I tucked it into the binding of the book. Any thoughts?", "link": "https://www.reddit.com/r/photography/comments/hb0552/i_was_wondering_how_people_like_to_format_pages/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "i was wondering how people like to format pages in a photobook? i just wrapped up my first major book publication, but someone noticed that i had a weird -----> orientation !!!  for the page numbers. i personally find the page numbers distracting, so i tucked it into the binding of the book. any thoughts?", "sortedWord": "None", "identifyer": 80893, "year": "2020"}, {"Unnamed: 0": 79406, "autor": "Stray_Armadillo", "date": 1596840565000, "content": "I think 99% of portrait photographs would be better presented as landscape /!/ This excludes proper portrait sets of people, of course.  Every time I see a portrait photo, it makes me wonder what's missing?  What would be the \"rule of thirds\" focal point if presented in landscape?  In short, I think the portrait orientation is WAY overused... particularly in artistic shots.\n\nWhat do you think?", "link": "https://www.reddit.com/r/photography/comments/i5nydv/i_think_99_of_portrait_photographs_would_be/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "i think 99% of portrait photographs would be better presented as landscape /!/ this excludes proper portrait sets of people, of course.  every time i see a portrait photo, it makes me wonder what's missing?  what would be the \"rule of thirds\" focal point if presented in landscape?  in short, i think the portrait -----> orientation !!!  is way overused... particularly in artistic shots.\n\nwhat do you think?", "sortedWord": "None", "identifyer": 81515, "year": "2020"}, {"Unnamed: 0": 81942, "autor": "cj22340", "date": 1606235279000, "content": "Portrait Orientation Rant /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/k0877y/portrait_orientation_rant/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "portrait -----> orientation !!!  rant /!/ [removed]", "sortedWord": "None", "identifyer": 84155, "year": "2020"}, {"Unnamed: 0": 87966, "autor": "Lord_of_games", "date": 1607203591000, "content": "Beginner printing photos /!/ I'm getting into photography &amp; need to find out how to print photos. I know there are different methods &amp; different tools so I'm starting with what I know &amp; branching out. Can you print photos from google drive efficiently? There is a print option but I don't have a printer yet so I couldn't try it out. Also there were options for # of copies, colour, orientation etc. But they w were blanked out. I'm wondering if it's because I was on mobile. So far I only have an android phone for taking pictures, but will get other equipment when I have the money.", "link": "https://www.reddit.com/r/photography/comments/k7g3zy/beginner_printing_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "beginner printing photos /!/ i'm getting into photography &amp; need to find out how to print photos. i know there are different methods &amp; different tools so i'm starting with what i know &amp; branching out. can you print photos from google drive efficiently? there is a print option but i don't have a printer yet so i couldn't try it out. also there were options for # of copies, colour, -----> orientation !!!  etc. but they w were blanked out. i'm wondering if it's because i was on mobile. so far i only have an android phone for taking pictures, but will get other equipment when i have the money.", "sortedWord": "None", "identifyer": 90419, "year": "2020"}], "name": "orientationphotography2020"}