{"interestingcomments": [{"Unnamed: 0": 97598, "autor": "Skrapion", "date": 1568409737000, "content": "Photo printing station recommendations /!/ Hey guys!\n\nI work at a makerspace and I'm looking at setting up a photo wall where people can post their projects.\n\nOur first attempt was to use a Canon Ivy, but I haven't been super happy with it; the paper is pretty expensive, tiny, needs to be reloaded every 10 photos, and the app doesn't seem to connect to the printer super reliably.\n\nThe Selphy looks pretty great, with consumables for 4x6 prints that are half the price of the tiny Ivy prints, hold twice as much paper, and it has a tonne of ways to connect, including Linux, which means I could probably plug it into a Raspberry Pi and just let people email photos to the printer. But I'd love to mount it vertically, and it's not clear to me if it would work in that orientation. Anyone have any experience with this one?\n\nDoes anyone have any other recommendations?", "link": "https://www.reddit.com/r/photography/comments/d3vtub/photo_printing_station_recommendations/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "photo printing station recommendations /!/ hey guys!\n\ni work at a makerspace and i'm looking at setting up a photo wall where people can post their projects.\n\nour first attempt was to use a canon ivy, but i haven't been super happy with it; the paper is pretty expensive, tiny, needs to be reloaded every 10 photos, and the app doesn't seem to connect to the printer super reliably.\n\nthe selphy looks pretty great, with consumables for 4x6 prints that are half the price of the tiny ivy prints, hold twice as much paper, and it has a tonne of ways to connect, including linux, which means i could probably plug it into a raspberry pi and just let people email photos to the printer. but i'd love to mount it vertically, and it's not clear to me if it would work in that -----> orientation !!! . anyone have any experience with this one?\n\ndoes anyone have any other recommendations?", "sortedWord": "None", "identifyer": 241, "year": "2019"}, {"Unnamed: 0": 105358, "autor": "baronsindo", "date": 1576452001000, "content": "Power Your Dreams with Xbox Series X, Available Holiday 2020 /!/ **_Xbox Game Studios unveils Senua’s Saga: Hellblade II, a new chapter in the award-winning Hellblade story from Ninja Theory_**\n\nFor eighteen years and three console generations, the Xbox community has shown us the power both games and fun can have on all of us. As we enter a new generation of gaming, we see a future where you’re instantly absorbed in your games – where worlds are even more lifelike, immersive, responsive and surprising – and where you are at the center of your gaming experience. With the new Xbox Series X, we will realize that vision. \n\nXbox Series X will be our fastest, most powerful console ever and set a new bar for performance, speed, and compatibility, allowing you to bring your gaming legacy, thousands of games from three generations and more forward with you. Its industrial design enables us to deliver four times the processing power of Xbox One X in the quietest and efficient way, something that is critically important in delivering truly immersive gameplay. We also designed Xbox Series X to support both vertical and horizontal orientation. It’s bold and unique, very much like our fans around the world and the team of collaborators and innovators who built it.\n\nThe name Xbox is an expression of our deep history in gaming, our team’s unrelenting passion, and our commitment to both our fans and the future of gaming at Microsoft. It also signifies our belief that a gaming console should be for just that – gaming.\n\nAlongside Xbox Series X, we also unveiled the new Xbox Wireless Controller. Its size and shape have been refined to accommodate an even wider range of people, and it also features a new Share button to make capturing screenshots and game clips simple and a hybrid d-pad inspired by the Xbox Elite Wireless Controller Series 2. The new Xbox Wireless Controller will be compatible with Xbox One and Windows 10 PCs, and will be included with every Xbox Series X.\n\nThe possibilities of what Xbox Series X enables developers to achieve was also brought to life this evening with the unveiling of _Senua’s Saga: Hellblade II_. A sequel to the award-winning _Hellblade: Senua’s Sacrifice_ from world-renowned developers Ninja Theory, the game is being built to leverage the full power of Xbox Series X.  The footage shared tonight was captured in-engine and reflects the power of Xbox Series X available to developers to deliver new universes, experiences and games in ways you have never imagined.\n\n### **Bringing Developers’ Dreams to Life with Xbox Series X**\n\nGames today deliver amazing visuals and tell an array of different and deep stories.  That’s why, when we started work on Xbox Series X, it was vital we continue to advance state-of-the-art visual capabilities for developers, while also ensuring they could realize even greater feeling, emotion, and empathy in their games. With Xbox Series X, we will elevate the way games look, play and feel. We will also remove the technical barriers faced in previous generations and enable developers to create more expansive, immersive gaming worlds that invite more players to play. \n\nFrom a technical standpoint, this will manifest as world-class visuals in 4K at 60FPS, with the possibility of up to 120FPS, including support for Variable Refresh Rate (VRR), and 8K capability. Powered by our custom-designed processor leveraging the latest Zen 2 and next-generation RDNA architecture from our partners at AMD, Xbox Series X will deliver hardware-accelerated ray tracing and a new level of performance never before seen in a console.  Additionally, our patented Variable Rate Shading (VRS) technology will allow developers to get even more out of the Xbox Series X GPU and our next-generation SSD will virtually eliminate load times and bring players into their gaming worlds faster than ever before.\n\nWe are minimizing latency by leveraging technology such as Auto Low Latency Mode (ALLM) and giving developers new functionality like Dynamic Latency Input (DLI) to make Xbox Series X the most responsive console ever.  Xbox Series X is also designed for a future in the cloud, with unique capabilities built into the hardware and software to make it as easy as possible to bring great games to both console and elsewhere. Xbox Series X will deliver a level of fidelity and immersion, unlike anything that’s been achieved in previous console generations.   \n\n### **One Console, Four Generations of Gaming**\n\nOne of the things we’re most proud of with Xbox Series X is the promise we’re delivering to our fans who have and continue to invest with Xbox. Thanks to backward compatibility, you can expect your gaming legacy, thousands of your favorite games across four generations of gaming, all your Xbox One gaming accessories, and industry-leading services like Xbox Game Pass to be available when you power on your Xbox Series X in Holiday 2020.\n\nBuilding on our compatibility promise, with Xbox Series X we’re also investing in consumer-friendly pathways to game ownership across generations. Leading the way with our first-party titles including _Halo Infinite_ in 2020, we’re committed to ensuring that games from Xbox Game Studios support cross-generation entitlements and that your Achievements and game saves are shared across devices.  As we branch out and extend gaming to more players around the world, console gaming will remain at the heart of our Xbox offering.  Game creators around the globe are already hard at work building content for Xbox Series X and our 15 Xbox Game Studios are developing the largest and most creatively diverse lineup of Xbox exclusive games in our history. On behalf of Team Xbox, we’re excited to enter the future of console gaming with you and can’t wait to share more in 2020.\n\nThe post [Power Your Dreams with Xbox Series X, Available Holiday 2020](https://www.bulkyface.com/2019/12/15/power-your-dreams-with-xbox-series-x-available-holiday-2020/) appeared first on [Bulky Face](https://www.bulkyface.com).\n\n   \n   \n from WordPress https://ift.tt/2PLIyiN", "link": "https://www.reddit.com/r/photography/comments/eb6gs8/power_your_dreams_with_xbox_series_x_available/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "power your dreams with xbox series x, available holiday 2020 /!/ **_xbox game studios unveils senua’s saga: hellblade ii, a new chapter in the award-winning hellblade story from ninja theory_**\n\nfor eighteen years and three console generations, the xbox community has shown us the power both games and fun can have on all of us. as we enter a new generation of gaming, we see a future where you’re instantly absorbed in your games – where worlds are even more lifelike, immersive, responsive and surprising – and where you are at the center of your gaming experience. with the new xbox series x, we will realize that vision. \n\nxbox series x will be our fastest, most powerful console ever and set a new bar for performance, speed, and compatibility, allowing you to bring your gaming legacy, thousands of games from three generations and more forward with you. its industrial design enables us to deliver four times the processing power of xbox one x in the quietest and efficient way, something that is critically important in delivering truly immersive gameplay. we also designed xbox series x to support both vertical and horizontal -----> orientation !!! . it’s bold and unique, very much like our fans around the world and the team of collaborators and innovators who built it.\n\nthe name xbox is an expression of our deep history in gaming, our team’s unrelenting passion, and our commitment to both our fans and the future of gaming at microsoft. it also signifies our belief that a gaming console should be for just that – gaming.\n\nalongside xbox series x, we also unveiled the new xbox wireless controller. its size and shape have been refined to accommodate an even wider range of people, and it also features a new share button to make capturing screenshots and game clips simple and a hybrid d-pad inspired by the xbox elite wireless controller series 2. the new xbox wireless controller will be compatible with xbox one and windows 10 pcs, and will be included with every xbox series x.\n\nthe possibilities of what xbox series x enables developers to achieve was also brought to life this evening with the unveiling of _senua’s saga: hellblade ii_. a sequel to the award-winning _hellblade: senua’s sacrifice_ from world-renowned developers ninja theory, the game is being built to leverage the full power of xbox series x.  the footage shared tonight was captured in-engine and reflects the power of xbox series x available to developers to deliver new universes, experiences and games in ways you have never imagined.\n\n### **bringing developers’ dreams to life with xbox series x**\n\ngames today deliver amazing visuals and tell an array of different and deep stories.  that’s why, when we started work on xbox series x, it was vital we continue to advance state-of-the-art visual capabilities for developers, while also ensuring they could realize even greater feeling, emotion, and empathy in their games. with xbox series x, we will elevate the way games look, play and feel. we will also remove the technical barriers faced in previous generations and enable developers to create more expansive, immersive gaming worlds that invite more players to play. \n\nfrom a technical standpoint, this will manifest as world-class visuals in 4k at 60fps, with the possibility of up to 120fps, including support for variable refresh rate (vrr), and 8k capability. powered by our custom-designed processor leveraging the latest zen 2 and next-generation rdna architecture from our partners at amd, xbox series x will deliver hardware-accelerated ray tracing and a new level of performance never before seen in a console.  additionally, our patented variable rate shading (vrs) technology will allow developers to get even more out of the xbox series x gpu and our next-generation ssd will virtually eliminate load times and bring players into their gaming worlds faster than ever before.\n\nwe are minimizing latency by leveraging technology such as auto low latency mode (allm) and giving developers new functionality like dynamic latency input (dli) to make xbox series x the most responsive console ever.  xbox series x is also designed for a future in the cloud, with unique capabilities built into the hardware and software to make it as easy as possible to bring great games to both console and elsewhere. xbox series x will deliver a level of fidelity and immersion, unlike anything that’s been achieved in previous console generations.   \n\n### **one console, four generations of gaming**\n\none of the things we’re most proud of with xbox series x is the promise we’re delivering to our fans who have and continue to invest with xbox. thanks to backward compatibility, you can expect your gaming legacy, thousands of your favorite games across four generations of gaming, all your xbox one gaming accessories, and industry-leading services like xbox game pass to be available when you power on your xbox series x in holiday 2020.\n\nbuilding on our compatibility promise, with xbox series x we’re also investing in consumer-friendly pathways to game ownership across generations. leading the way with our first-party titles including _halo infinite_ in 2020, we’re committed to ensuring that games from xbox game studios support cross-generation entitlements and that your achievements and game saves are shared across devices.  as we branch out and extend gaming to more players around the world, console gaming will remain at the heart of our xbox offering.  game creators around the globe are already hard at work building content for xbox series x and our 15 xbox game studios are developing the largest and most creatively diverse lineup of xbox exclusive games in our history. on behalf of team xbox, we’re excited to enter the future of console gaming with you and can’t wait to share more in 2020.\n\nthe post [power your dreams with xbox series x, available holiday 2020](https://www.bulkyface.com/2019/12/15/power-your-dreams-with-xbox-series-x-available-holiday-2020/) appeared first on [bulky face](https://www.bulkyface.com).\n\n   \n   \n from wordpress https://ift.tt/2pliyin", "sortedWord": "None", "identifyer": 8224, "year": "2019"}, {"Unnamed: 0": 321421, "autor": "davidicanrepublic", "date": 1557017590000, "content": "Budding photographer needs some orientation! /!/ Hey guys, newbie photographer here. I have several questions, answer whichever if you can. I’ve been meaning to get into photography but I didn’t know where to start and figured I might as well make use of this resource. I didn’t want to make a separate post for each question but I’m just gonna get right into it. Please help me out! Sorry for the length in advance, i’m clueless haha.\n\nCurrently I don’t own a dedicated camera for photography except for a Pentax K 1000 (I haven’t used it yet just found it in my garage). As a beginner who knows very little about photography and cameras, is it good enough? It’s not modern I know but I was thinking it might be fun starting off with film. My friend is selling his current camera (Nikon D3400) to make money for a new camera (Sony A7). It comes with an extra lense and two batteries and two chargers for $500. Should I take him up on his offer? He also said he’s open to negotiating so I might just pick and choose what I need. So far I’ve been using my iPhone XS and taking pictures of sunsets. I only know how to change the aperture but I’m proud of my work lol (I can upload some pics to imgur and post a link if y’all are interested. Most of my pics are just fodder for editing when I get around to it). I want to dabble with photo editing too to make some art, any photo editing softwares that are free if not affordable? I just downloaded snapseed and started messing around with it. I have a laptop as well so I’m looking for any type of software. Along that topic as well, how can I learn what each tool does outside of trial and error? Are there any good references/youtubers/videos that I can learn from? Lastly, while I save up for a real camera, how can I maximize my learning experience/set up a good foundation with my iPhone XS? Any advice is greatly appreciated!!", "link": "https://www.reddit.com/r/photography/comments/bkryzw/budding_photographer_needs_some_orientation/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "budding photographer needs some -----> orientation !!! ! /!/ hey guys, newbie photographer here. i have several questions, answer whichever if you can. i’ve been meaning to get into photography but i didn’t know where to start and figured i might as well make use of this resource. i didn’t want to make a separate post for each question but i’m just gonna get right into it. please help me out! sorry for the length in advance, i’m clueless haha.\n\ncurrently i don’t own a dedicated camera for photography except for a pentax k 1000 (i haven’t used it yet just found it in my garage). as a beginner who knows very little about photography and cameras, is it good enough? it’s not modern i know but i was thinking it might be fun starting off with film. my friend is selling his current camera (nikon d3400) to make money for a new camera (sony a7). it comes with an extra lense and two batteries and two chargers for $500. should i take him up on his offer? he also said he’s open to negotiating so i might just pick and choose what i need. so far i’ve been using my iphone xs and taking pictures of sunsets. i only know how to change the aperture but i’m proud of my work lol (i can upload some pics to imgur and post a link if y’all are interested. most of my pics are just fodder for editing when i get around to it). i want to dabble with photo editing too to make some art, any photo editing softwares that are free if not affordable? i just downloaded snapseed and started messing around with it. i have a laptop as well so i’m looking for any type of software. along that topic as well, how can i learn what each tool does outside of trial and error? are there any good references/youtubers/videos that i can learn from? lastly, while i save up for a real camera, how can i maximize my learning experience/set up a good foundation with my iphone xs? any advice is greatly appreciated!!", "sortedWord": "None", "identifyer": 68701, "year": "2019"}, {"Unnamed: 0": 322448, "autor": "FrankCyzyl", "date": 1568877872000, "content": "Looking for recommendations for a tripod and two heads /!/ I've researched Adorama and bandhphoto but am still confused about interchangeability of heads. Here are my criteria:\n\n* Manfrotto\n* Two interchangeable heads\n   * one for still photography (landscape and portrait orientations, or ball head?)\n   * one for video - fluid head\n* Budget: about 500 US dollars\n\nI have no problem picking out the tripod I want but the head situation is confusing me. Ball head or not? And also the interchangeability issue.\n\nThanks for any suggestions.", "link": "https://www.reddit.com/r/photography/comments/d6akzt/looking_for_recommendations_for_a_tripod_and_two/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientations", "selectorShort": "orientation", "MarkedSent": "looking for recommendations for a tripod and two heads /!/ i've researched adorama and bandhphoto but am still confused about interchangeability of heads. here are my criteria:\n\n* manfrotto\n* two interchangeable heads\n   * one for still photography (landscape and portrait -----> orientations !!! , or ball head?)\n   * one for video - fluid head\n* budget: about 500 us dollars\n\ni have no problem picking out the tripod i want but the head situation is confusing me. ball head or not? and also the interchangeability issue.\n\nthanks for any suggestions.", "sortedWord": "None", "identifyer": 69758, "year": "2019"}, {"Unnamed: 0": 328963, "autor": "be-lost", "date": 1570034801000, "content": "Self hosted galleries /!/ Hey guys, first of all, thank you for all the posts and valuable info!   \n\n\nA few weeks ago, someone posted a link to a couple of sites that hosted galleries. One of those was Exposure.   \nAs interesting as it is, i try to host everything on my own server. It keeps cost and control on my side :)  \n\n\nDo you guys have any suggestions for self-hosted galleries similar to Exposure? Or something along those lines? I'm looking for an editorial sort of look with photos in both landscape and portrait orientation.", "link": "https://www.reddit.com/r/photography/comments/dcculq/self_hosted_galleries/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "self hosted galleries /!/ hey guys, first of all, thank you for all the posts and valuable info!   \n\n\na few weeks ago, someone posted a link to a couple of sites that hosted galleries. one of those was exposure.   \nas interesting as it is, i try to host everything on my own server. it keeps cost and control on my side :)  \n\n\ndo you guys have any suggestions for self-hosted galleries similar to exposure? or something along those lines? i'm looking for an editorial sort of look with photos in both landscape and portrait -----> orientation !!! .", "sortedWord": "None", "identifyer": 76544, "year": "2019"}, {"Unnamed: 0": 329907, "autor": "ITakeDecentPhotos", "date": 1567628785000, "content": "A Event Rant by a Photography Student /!/ TLDR, if you are not going to pay for your event photography, don’t be demanding and please feed your photographers. Chips and cookies are not food.\n\n\\------\n\nThis is my first Reddit post and English is my second language. Proofreaders are appreciated, but no grammar police, please. Also if this is not fitted for the group, please delete.\n\nI’m a photography student trying to build a portfolio, so I volunteered to shoot some pictures at a film festival event this Saturday. I usually shoot street, portraits and student events and had never taken events with 500+ people, so I was excited about the opportunity. Anyway, I learned to not work at events for free again.\n\nThe event started at 6pm (6pm door, 7pm the screening), but somehow on the day of, at noon, the organizer texted me and told me to show up at 4:45pm. I questioned her why I need to show up 75 minutes before the event since the door won’t be open until 6pm anyway. She told me that I only needed to show up at 4:45pm because she would be there since 3pm to set up. I then asked her what's to shoot if the guests won't be there this early. She decided not to text me back. So I got to the venue at 4:30 (I always arrive 15 min early for a gig).\n\nWhen I got to the venue, obviously the guests are not there yet... People were setting up. I asked the organizer if there would be food. If not, I'd go to the burger place a block away (I don't mind getting my own food, but at least give me a meal break if your event is 6-10) and eat something before 6. She said there's food and I can't go anywhere because the volunteer orientation would happen soon. The volunteer orientation ended up not happening because the other photographer was late. So I was there shooting pictures of the volunteers (that's why she asked me to come and 75 minutes earlier). Also, later, I found out that what she meant by food was a few bags of snack-size Doritos chips and some Chips Ahoy cookies.\n\nSo I acted professionally and shot the red carpet, the preshow, the award ceremony after the screening and the after-party. Some board member of the festival just treated me like an employee and asked me to take pictures of them while I was taking a group picture of 100+ people. Shooting a 100+ people picture was hard enough in low light setting, and having cell phone cameras getting in my way. Getting pulled away while trying to do that was worse.\n\nLater, they asked me to be in a picture with all the volunteers. The organizer asked me to hand my camera to a guest with a nice Sony A-series camera. I refused because I didn't believe a guy with a fancy Sony camera could operate my cheap Nikon in low light settings with an off-camera flash without at least a 2 minutes tutorial, nor did I want to hand my camera to an absolute stranger who was already holding a camera. He would be able to take better picture with his camera than a borrowed one. The organizer was confused/mad about why I didn't give the guest my camera. \n\nI told the organizer a few days before the event that I would need to leave by 11pm because transit sucks in my city. Of course, things never go as planned, the after-party was supposed to start at 9:30pm and ended up starting at 10:45pm. They needed me to shoot \"some pictures\" at the after-party and I stayed around 11:30pm. Right before I left, the organizer told me that they would need a few pictures sent to them that night for their media coverage the next day. Screw the hungry photographer, right? I said I would downsize them to 1500px and send them over and no... They said it was too low and wanted all the photos as \"high resolution\" -- whatever that means to them, I don't know.\n\nSo I got home at 1am, still hadn't eaten, picked out my top 10 and uploaded to my cloud. Then I got an email asking me to upload everything to their cloud instead...\n\nIt's been a few days and I'm still editing the 150 photos (out of the 400 I took). So... Ya. Never again. I deserve more than chips and cookies for 7 hours of work and 4 nights of post. They better pay me for my work next time. Lesson learned.\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nAlso, one question... I'd like to learn how do I organize a picture with 100+ people? I don't want to sound rude, but cell phone cameras were getting in my way.\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nPS, there's also a second photographer. She was told to come at 4:45pm, but she got there at 5:30pm. She came with a borrowed camera so she had no idea how to use it. She bumped into her friend at the event and she YOLO'd and left during the middle of the screening with her friends, leaving only me at the after-party. I guess this is the photographer they deserve.", "link": "https://www.reddit.com/r/photography/comments/czq95u/a_event_rant_by_a_photography_student/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "a event rant by a photography student /!/ tldr, if you are not going to pay for your event photography, don’t be demanding and please feed your photographers. chips and cookies are not food.\n\n\\------\n\nthis is my first reddit post and english is my second language. proofreaders are appreciated, but no grammar police, please. also if this is not fitted for the group, please delete.\n\ni’m a photography student trying to build a portfolio, so i volunteered to shoot some pictures at a film festival event this saturday. i usually shoot street, portraits and student events and had never taken events with 500+ people, so i was excited about the opportunity. anyway, i learned to not work at events for free again.\n\nthe event started at 6pm (6pm door, 7pm the screening), but somehow on the day of, at noon, the organizer texted me and told me to show up at 4:45pm. i questioned her why i need to show up 75 minutes before the event since the door won’t be open until 6pm anyway. she told me that i only needed to show up at 4:45pm because she would be there since 3pm to set up. i then asked her what's to shoot if the guests won't be there this early. she decided not to text me back. so i got to the venue at 4:30 (i always arrive 15 min early for a gig).\n\nwhen i got to the venue, obviously the guests are not there yet... people were setting up. i asked the organizer if there would be food. if not, i'd go to the burger place a block away (i don't mind getting my own food, but at least give me a meal break if your event is 6-10) and eat something before 6. she said there's food and i can't go anywhere because the volunteer -----> orientation !!!  would happen soon. the volunteer orientation ended up not happening because the other photographer was late. so i was there shooting pictures of the volunteers (that's why she asked me to come and 75 minutes earlier). also, later, i found out that what she meant by food was a few bags of snack-size doritos chips and some chips ahoy cookies.\n\nso i acted professionally and shot the red carpet, the preshow, the award ceremony after the screening and the after-party. some board member of the festival just treated me like an employee and asked me to take pictures of them while i was taking a group picture of 100+ people. shooting a 100+ people picture was hard enough in low light setting, and having cell phone cameras getting in my way. getting pulled away while trying to do that was worse.\n\nlater, they asked me to be in a picture with all the volunteers. the organizer asked me to hand my camera to a guest with a nice sony a-series camera. i refused because i didn't believe a guy with a fancy sony camera could operate my cheap nikon in low light settings with an off-camera flash without at least a 2 minutes tutorial, nor did i want to hand my camera to an absolute stranger who was already holding a camera. he would be able to take better picture with his camera than a borrowed one. the organizer was confused/mad about why i didn't give the guest my camera. \n\ni told the organizer a few days before the event that i would need to leave by 11pm because transit sucks in my city. of course, things never go as planned, the after-party was supposed to start at 9:30pm and ended up starting at 10:45pm. they needed me to shoot \"some pictures\" at the after-party and i stayed around 11:30pm. right before i left, the organizer told me that they would need a few pictures sent to them that night for their media coverage the next day. screw the hungry photographer, right? i said i would downsize them to 1500px and send them over and no... they said it was too low and wanted all the photos as \"high resolution\" -- whatever that means to them, i don't know.\n\nso i got home at 1am, still hadn't eaten, picked out my top 10 and uploaded to my cloud. then i got an email asking me to upload everything to their cloud instead...\n\nit's been a few days and i'm still editing the 150 photos (out of the 400 i took). so... ya. never again. i deserve more than chips and cookies for 7 hours of work and 4 nights of post. they better pay me for my work next time. lesson learned.\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nalso, one question... i'd like to learn how do i organize a picture with 100+ people? i don't want to sound rude, but cell phone cameras were getting in my way.\n\n\\~\\~\\~\\~\\~\\~\\~\\~\\~\\~\n\nps, there's also a second photographer. she was told to come at 4:45pm, but she got there at 5:30pm. she came with a borrowed camera so she had no idea how to use it. she bumped into her friend at the event and she yolo'd and left during the middle of the screening with her friends, leaving only me at the after-party. i guess this is the photographer they deserve.", "sortedWord": "None", "identifyer": 77528, "year": "2019"}, {"Unnamed: 0": 333693, "autor": "Alameda-", "date": 1551303395000, "content": "People who switched, I need your help /!/ So about 6 months ago I purchased a Canon T7i/800D + 18-55mm kit lens + 50mm 1.8. I found myself using it most at around 24-35mm, but I ended up buying a Tamron VC Di USD 70-300mm 4-5.6, which is only usable up to 225mm, after that it becomes really soft, while it performs pretty good on the sunny days, I really find myself needing an upgrade in the next year or so.\n\n\nI am a amateur portrait and sports photographer. I've used a Sony point and shoot from ages 13+ and when I got to college I started renting a 750D for free + a few lenses, so since then I've been taking photos more seriously. I am not making money off it yet, but I am pulling some strings here and there to slowly build up a nice portfolio and get going.\n\n\nI find myself photographing in low light conditions and I really struggle covering some events like local basketball matches, where I am pretty much forced to use the 50mm 1.8 at 1600 ISO to get usable images, the 70-300 is way softer than it should be and there is a lot of movement going on. I tend to take 70% of my images in portrait orientation, and here comes the problem. Canon didn't produce a vertical/battery grip for the 800D, and while there are chinese ones available, I use back button focus and the grip lacks any other button than the shutter release one. My wrist hurts after a while of handling the camera with the \"hook\" and I wish I didn't pick that body\n\n\nSo I wondered, since I am not that invested in the Canon system, should I switch to Sony?\n\n* For the full frame\n* Supposedly better low light capabilities - maybe allowing me to bump the ISO to 3200 or even 6400 without getting an awful ton of noise\n* The smaller body - since I carry my Canon DSLR and a lens inside a really small bag everywhere, a Hama Sysbag 100, it would allow me to fit a bit more glass maybe? \n\n\nThe only thing that scares me is the lenses price (2300€ for the Canon 70-200 2.8 vs 2800€ for the Sony's) and the small grip that body has (I've seen people online complaining about their fingers hitting a lens while gripping the camera or it being not long enough) , I might ask a guy I know to show me the A7 III in person sometime soon to see if that would bother me at all, but 100% I would get a vertical grip in case of buying a Sony body, that's out of questions\n\n\nI am not discarding going for a full frame Canon Body, but since most of my lenses (except the 50mm 1.8) and the batteries would be useless in that case, I am considering saving up during summer for a A7 III or maybe an RP if it gets a proper battery grip\n\n\nWhat would you do in my case? My summer job would earn me about 3000€ in 4 months, but I also want to save up some money for travelling so I would be left with around 1700€.\n\n I know that's not a lot and you might be laughing about the GAS and stupidness of switching bodies, but I feel frustrated when I am limited to capturing the slow paced moments during a match because of the light or having to shoot wide open instead of f4-5.6 with high shutter speeds and still get a decent image. \n\nHere are some low light images I've taken:https://imgur.com/a/CzaTQ6t\n\n", "link": "https://www.reddit.com/r/photography/comments/avirst/people_who_switched_i_need_your_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "people who switched, i need your help /!/ so about 6 months ago i purchased a canon t7i/800d + 18-55mm kit lens + 50mm 1.8. i found myself using it most at around 24-35mm, but i ended up buying a tamron vc di usd 70-300mm 4-5.6, which is only usable up to 225mm, after that it becomes really soft, while it performs pretty good on the sunny days, i really find myself needing an upgrade in the next year or so.\n\n\ni am a amateur portrait and sports photographer. i've used a sony point and shoot from ages 13+ and when i got to college i started renting a 750d for free + a few lenses, so since then i've been taking photos more seriously. i am not making money off it yet, but i am pulling some strings here and there to slowly build up a nice portfolio and get going.\n\n\ni find myself photographing in low light conditions and i really struggle covering some events like local basketball matches, where i am pretty much forced to use the 50mm 1.8 at 1600 iso to get usable images, the 70-300 is way softer than it should be and there is a lot of movement going on. i tend to take 70% of my images in portrait -----> orientation !!! , and here comes the problem. canon didn't produce a vertical/battery grip for the 800d, and while there are chinese ones available, i use back button focus and the grip lacks any other button than the shutter release one. my wrist hurts after a while of handling the camera with the \"hook\" and i wish i didn't pick that body\n\n\nso i wondered, since i am not that invested in the canon system, should i switch to sony?\n\n* for the full frame\n* supposedly better low light capabilities - maybe allowing me to bump the iso to 3200 or even 6400 without getting an awful ton of noise\n* the smaller body - since i carry my canon dslr and a lens inside a really small bag everywhere, a hama sysbag 100, it would allow me to fit a bit more glass maybe? \n\n\nthe only thing that scares me is the lenses price (2300€ for the canon 70-200 2.8 vs 2800€ for the sony's) and the small grip that body has (i've seen people online complaining about their fingers hitting a lens while gripping the camera or it being not long enough) , i might ask a guy i know to show me the a7 iii in person sometime soon to see if that would bother me at all, but 100% i would get a vertical grip in case of buying a sony body, that's out of questions\n\n\ni am not discarding going for a full frame canon body, but since most of my lenses (except the 50mm 1.8) and the batteries would be useless in that case, i am considering saving up during summer for a a7 iii or maybe an rp if it gets a proper battery grip\n\n\nwhat would you do in my case? my summer job would earn me about 3000€ in 4 months, but i also want to save up some money for travelling so i would be left with around 1700€.\n\n i know that's not a lot and you might be laughing about the gas and stupidness of switching bodies, but i feel frustrated when i am limited to capturing the slow paced moments during a match because of the light or having to shoot wide open instead of f4-5.6 with high shutter speeds and still get a decent image. \n\nhere are some low light images i've taken:https://imgur.com/a/czatq6t\n\n", "sortedWord": "None", "identifyer": 81464, "year": "2019"}, {"Unnamed: 0": 338138, "autor": "SensitiveQuote", "date": 1562389681000, "content": "Capture Clip + RRS L-Bracket + Monoball p0 ball head /!/ I need to make sure I have my setup correct for a backpacking trip at the end of the month, and my p0 ball head won’t be here until the week prior. I’m currently using a manfrotto RC2 quick release on my tripod and the capture clip Dual Plate. I plan on switching to the Standard Plate for the capture clip. \n\nWill I need anything else to make this setup work? Will I be able to attach my capture clip plate to the bottom of the L-bracket for use with my capture clip, and just mount the side of the L-bracket to the tripod directly for portrait orientation?", "link": "https://www.reddit.com/r/photography/comments/c9psqy/capture_clip_rrs_lbracket_monoball_p0_ball_head/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "capture clip + rrs l-bracket + monoball p0 ball head /!/ i need to make sure i have my setup correct for a backpacking trip at the end of the month, and my p0 ball head won’t be here until the week prior. i’m currently using a manfrotto rc2 quick release on my tripod and the capture clip dual plate. i plan on switching to the standard plate for the capture clip. \n\nwill i need anything else to make this setup work? will i be able to attach my capture clip plate to the bottom of the l-bracket for use with my capture clip, and just mount the side of the l-bracket to the tripod directly for portrait -----> orientation !!! ?", "sortedWord": "None", "identifyer": 86153, "year": "2019"}], "name": "orientationphotography2019"}