{"interestingcomments": [{"Unnamed: 0": 265763, "autor": "SpicyGreasyBalls", "date": 1530309340000, "content": "How do you submit your stuff to Getty images? /!/ I've looked all around the site... and I can't find any place to do the signup and test for it. In my case, I want to upload art for the site, if possible.", "link": "https://www.reddit.com/r/photography/comments/8ux1kc/how_do_you_submit_your_stuff_to_getty_images/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "find any place", "selectorShort": "place", "MarkedSent": "how do you submit your stuff to getty images? /!/ i've looked all around the site... and i can't -----> find !!!  -----> any !!!  -----> place !!!  to do the signup and test for it. in my case, i want to upload art for the site, if possible.", "sortedWord": "None", "identifyer": 11369, "year": "2018"}, {"Unnamed: 0": 270925, "autor": "TurtleNeckTim", "date": 1537387641000, "content": "Missing this place", "link": "https://www.reddit.com/r/photography/comments/9h8kbj/missing_this_place/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "missing this place", "selectorShort": "place", "MarkedSent": "-----> missing !!!  -----> this !!!  -----> place !!! ", "sortedWord": "None", "identifyer": 16714, "year": "2018"}, {"Unnamed: 0": 276992, "autor": "SlumberingBear96", "date": 1534880452000, "content": "Trouble finding 6x4 pictures /!/ Hi all, I’m having trouble finding a place that does custom 6x4 prints of photos. Any ideas? ", "link": "https://www.reddit.com/r/photography/comments/996aw2/trouble_finding_6x4_pictures/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "finding a place", "selectorShort": "place", "MarkedSent": "trouble finding 6x4 pictures /!/ hi all, i’m having trouble -----> finding !!!  -----> a !!!  -----> place !!!  that does custom 6x4 prints of photos. any ideas? ", "sortedWord": "None", "identifyer": 23019, "year": "2018"}, {"Unnamed: 0": 277964, "autor": "Romantastisch", "date": 1538810584000, "content": "Does I need instagram? /!/ Hi.\nIam a Landscape and Lost Place Photographer since 3 Years now and i think about taking the step to show my pictures to the world.\nA friend of mine is always craving for new likes and followers on instagram to get fame.\nI know there are some other websites like Flickr and stuff.\nI could even do my own Blog.\nI wanna show my pictures to people who are not into the photograpy game.\nDoes I need instagram?\nDo I have to make storys, follow other people and like their photos to get reaction to my stuff?\nAre hashtags needed?\nJeez, iam 23 and I feel old.\n", "link": "https://www.reddit.com/r/photography/comments/9lu5jj/does_i_need_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "lost place", "selectorShort": "place", "MarkedSent": "does i need instagram? /!/ hi.\niam a landscape and -----> lost !!!  -----> place !!!  photographer since 3 years now and i think about taking the step to show my pictures to the world.\na friend of mine is always craving for new likes and followers on instagram to get fame.\ni know there are some other websites like flickr and stuff.\ni could even do my own blog.\ni wanna show my pictures to people who are not into the photograpy game.\ndoes i need instagram?\ndo i have to make storys, follow other people and like their photos to get reaction to my stuff?\nare hashtags needed?\njeez, iam 23 and i feel old.\n", "sortedWord": "None", "identifyer": 24025, "year": "2018"}, {"Unnamed: 0": 288432, "autor": "BuddhaChrist_ideas", "date": 1522853251000, "content": "On Sebastio Salgados Biography - From my Land to the Planet (Book). /!/ If any of you are interested in the life and photography of Sebastio Salgado, this is an excellent book to buy and read! \n\n[From my Land to the Planet - Sebastio Salgado. Written by Isabelle Francq](https://www.publishersweekly.com/978-88-6965-537-1)\n\nSebastio Salgado is, in my opinion, one of the greatest long-term social and humanitarian documentary photographers of our time. His projects often spanned several years in order to complete, and took him around the globe. They are often aimed at the human condition; from workers and labour, human migrations due to shifting geopolitical circumstances, to the struggle of people trying to find a place in the world to call home. His large scale photo projects are deeply moving, describing often the fragility of human life when faced with the violence we subject one another to, yet also our unending determination to overcome hardships and struggle - to endure against all odds.\n\n\nThis book is written by another great journalist, Isabelle Francq, who sat down with Salgado and recorded a long conversation detailing his life. It's read from Salagado's perspective, and provides wonderful insight to what drove the man to go to such lengths in order to bring his images and awareness to the world.\n\n\nHis photographs, including the black and white style, are the greatest inspiration for my photography. I am almost entirely unable to perform the type of work and documentary photography that Salgado has performed his entire life, yet I will always admire it. ", "link": "https://www.reddit.com/r/photography/comments/89q3il/on_sebastio_salgados_biography_from_my_land_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "on sebastio salgados biography - from my land to the planet (book). /!/ if any of you are interested in the life and photography of sebastio salgado, this is an excellent book to buy and read! \n\n[from my land to the planet - sebastio salgado. written by isabelle francq](https://www.publishersweekly.com/978-88-6965-537-1)\n\nsebastio salgado is, in my opinion, one of the greatest long-term social and humanitarian documentary photographers of our time. his projects often spanned several years in order to complete, and took him around the globe. they are often aimed at the human condition; from workers and labour, human migrations due to shifting geopolitical circumstances, to the struggle of people trying to -----> find !!!  -----> a !!!  -----> place !!!  in the world to call home. his large scale photo projects are deeply moving, describing often the fragility of human life when faced with the violence we subject one another to, yet also our unending determination to overcome hardships and struggle - to endure against all odds.\n\n\nthis book is written by another great journalist, isabelle francq, who sat down with salgado and recorded a long conversation detailing his life. it's read from salagado's perspective, and provides wonderful insight to what drove the man to go to such lengths in order to bring his images and awareness to the world.\n\n\nhis photographs, including the black and white style, are the greatest inspiration for my photography. i am almost entirely unable to perform the type of work and documentary photography that salgado has performed his entire life, yet i will always admire it. ", "sortedWord": "None", "identifyer": 34872, "year": "2018"}], "name": "placephotography2018"}