{"interestingcomments": [{"Unnamed: 0": 99871, "autor": "Liskarialeman", "date": 1572479911000, "content": "I am SPierce Photography - AmA about owning a small photography business, working Commercial Real Estate, Construction or my Orchid Collection /!/ Hey r/Photography! My name’s Stephanie. How’s everyone doing tonight? \n\nIf you’d like to skip over all the fluff: My website is www.spiercephotography.com and my now mostly-inactive Instagram is @spiercephotography. I’m a small market Commercial Photographer (work a 3 hour radius from my house and almost the whole New England Area, so 6 states) and work in the Commercial Real Estate and Construction sectors maybe 85% of the time, with a mix of stuff among the other 15%, but it’s almost all commercial/B2B.\n\nI’m happy to answer any questions anyone might have about my business or any of the fields I work in … or you can ask me about my Orchids. I love talking about- and am obsessed- with both, so :D \n\n_________________________________\n\n\nPhotography has always been part of my life, ever since I started taking photo trips with my parents in various forms at the age of 6. A few years later my Dad gave me my first SLR and I’ve had a camera with me ever since. I’ve always fit firmly in the “No, never! Only over my dead body!” crowd when asked if I ever considered going full time, but fate had other ideas I suppose…. \n\nMultiple circumstances with my health mid-2012 forced my hand, so I found a place to rent a studio, quit my job and off I went on my own with full emotional support from my family and friends without a plan or a care for the future (don’t do this, be smarter than me- business planning is important!). I consider that time to be the worst of my life, because I lost so much, but also the best, because now I’m a better person and still can’t believe I make a living doing what I do.\n\nI did “OK” my first two years with what I thought (and was told) was expected of all photographers - weddings, seniors, portraits, babies, families, kids, etc. I was burnt out, bored and things weren’t going too well, mostly because my heart wasn’t in it. So, in 2014, I stopped listening to everyone that wanted to “help/mentor” me and tell me how to run my business, and pivoted to working only on what I wanted and with who I wanted. \n\nEver since that decision, I’m balls to the wall during season (March-May, August-October), and I almost exclusively work B2B and on Construction &amp; Commercial Real Estate projects- either for the General Contractor, Construction Manager, Broker or the building Owner. I love the challenge of running around behind the scenes to get the shots I (and my clients) need with full creative freedom and it’s amazing to see my vision for each project come to life. Watching my clients use my photos to get new clients themselves, recognition in their fields and the project awards makes it all worth it, and it’s always a hoot to see my photos show up on TV, in magazines, or on my Facebook feed too!\n\nAlmost 7 years in, I’m happy, stable, kinda healthy (ongoing battle), and get hired to photograph a lot of cool places and things that the public never has access to— and I’m getting paid for it!\n\nI’m pretty sure i’m a little lower traffic than most small business photographers, since my territory/market is smaller-  but to give a general idea of what a month can look like for me, we’re at the tail end of my season, things are slower- the first two weeks of October were useless (so time to rest, run errands, set doctor appointments &amp; recover!) due to cloudy weather and rain. Over the useable days of the last few weeks (October 13th through today), I’ve photographed: \n\n-4 commercial real estate buildings (exteriors, repeat client since 2015) \n\n-2 small weddings (new clients, but they were referrals from wedding clients I worked with in those first 2 years) \n\n-6 reservoirs at peak fall foliage, 1 wastewater treatment plant, 1 water filtration plant, 1 hydroelectric plant, 4 various buildings, 2 hydrant flushing crews and 2 construction crews replacing water mains (new client)\n\n-3 small business shoots (through an agency, repeat client)\n\n-4 Proposals/Bids were created &amp; sent out, 1 for this year and 3 for the 2020 season.\n\n-Earlier today, I was out photographing an environmental rally and taking photos of students in front of an Inflatable hamburger! (Repeat client)\n\nThe Self-Employed life is always an adventure and I love it, I definitely belong out in the field vs in the office. As I said above, I’m happy to answer any questions about anything I can!", "link": "https://www.reddit.com/r/photography/comments/dpfa23/i_am_spierce_photography_ama_about_owning_a_small/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "found a place", "selectorShort": "place", "MarkedSent": "i am spierce photography - ama about owning a small photography business, working commercial real estate, construction or my orchid collection /!/ hey r/photography! my name’s stephanie. how’s everyone doing tonight? \n\nif you’d like to skip over all the fluff: my website is www.spiercephotography.com and my now mostly-inactive instagram is @spiercephotography. i’m a small market commercial photographer (work a 3 hour radius from my house and almost the whole new england area, so 6 states) and work in the commercial real estate and construction sectors maybe 85% of the time, with a mix of stuff among the other 15%, but it’s almost all commercial/b2b.\n\ni’m happy to answer any questions anyone might have about my business or any of the fields i work in … or you can ask me about my orchids. i love talking about- and am obsessed- with both, so :d \n\n_________________________________\n\n\nphotography has always been part of my life, ever since i started taking photo trips with my parents in various forms at the age of 6. a few years later my dad gave me my first slr and i’ve had a camera with me ever since. i’ve always fit firmly in the “no, never! only over my dead body!” crowd when asked if i ever considered going full time, but fate had other ideas i suppose…. \n\nmultiple circumstances with my health mid-2012 forced my hand, so i -----> found !!!  -----> a !!!  -----> place !!!  to rent -----> a !!!  studio, quit my job and off i went on my own with full emotional support from my family and friends without -----> a !!!  plan or -----> a !!!  care for the future (don’t do this, be smarter than me- business planning is important!). i consider that time to be the worst of my life, because i lost so much, but also the best, because now i’m a better person and still can’t believe i make a living doing what i do.\n\ni did “ok” my first two years with what i thought (and was told) was expected of all photographers - weddings, seniors, portraits, babies, families, kids, etc. i was burnt out, bored and things weren’t going too well, mostly because my heart wasn’t in it. so, in 2014, i stopped listening to everyone that wanted to “help/mentor” me and tell me how to run my business, and pivoted to working only on what i wanted and with who i wanted. \n\never since that decision, i’m balls to the wall during season (march-may, august-october), and i almost exclusively work b2b and on construction &amp; commercial real estate projects- either for the general contractor, construction manager, broker or the building owner. i love the challenge of running around behind the scenes to get the shots i (and my clients) need with full creative freedom and it’s amazing to see my vision for each project come to life. watching my clients use my photos to get new clients themselves, recognition in their fields and the project awards makes it all worth it, and it’s always a hoot to see my photos show up on tv, in magazines, or on my facebook feed too!\n\nalmost 7 years in, i’m happy, stable, kinda healthy (ongoing battle), and get hired to photograph a lot of cool places and things that the public never has access to— and i’m getting paid for it!\n\ni’m pretty sure i’m a little lower traffic than most small business photographers, since my territory/market is smaller-  but to give a general idea of what a month can look like for me, we’re at the tail end of my season, things are slower- the first two weeks of october were useless (so time to rest, run errands, set doctor appointments &amp; recover!) due to cloudy weather and rain. over the useable days of the last few weeks (october 13th through today), i’ve photographed: \n\n-4 commercial real estate buildings (exteriors, repeat client since 2015) \n\n-2 small weddings (new clients, but they were referrals from wedding clients i worked with in those first 2 years) \n\n-6 reservoirs at peak fall foliage, 1 wastewater treatment plant, 1 water filtration plant, 1 hydroelectric plant, 4 various buildings, 2 hydrant flushing crews and 2 construction crews replacing water mains (new client)\n\n-3 small business shoots (through an agency, repeat client)\n\n-4 proposals/bids were created &amp; sent out, 1 for this year and 3 for the 2020 season.\n\n-earlier today, i was out photographing an environmental rally and taking photos of students in front of an inflatable hamburger! (repeat client)\n\nthe self-employed life is always an adventure and i love it, i definitely belong out in the field vs in the office. as i said above, i’m happy to answer any questions about anything i can!", "sortedWord": "None", "identifyer": 2580, "year": "2019"}, {"Unnamed: 0": 101149, "autor": "Free-_-Yourself", "date": 1576486132000, "content": "Average camera vs phone camera? /!/ Hi!\n\nI just saw this community while trying to find a place to get answers regarding something that happened to me recently.\n\nI’ve been a great supporter of modern phone’s cameras, as they seem to deliver very good results for a device that is not meat to just take pictures.\n\nHowever, I was looking pictures in Dropbox from 5 years ago or so taken with an average photography camera and the details seem much much better than pictures taken even today with a smartphone. I was really impressed with the details at both background and forefront.\n\nSo, what are your thoughts about it? Please try to be neutral but giving your honest opinion.\n\nAlso, I would like to know what is a good camera (not very expensive) to start with if I was to buy one.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/ebcncb/average_camera_vs_phone_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "average camera vs phone camera? /!/ hi!\n\ni just saw this community while trying to -----> find !!!  -----> a !!!  -----> place !!!  to get answers regarding something that happened to me recently.\n\ni’ve been a great supporter of modern phone’s cameras, as they seem to deliver very good results for a device that is not meat to just take pictures.\n\nhowever, i was looking pictures in dropbox from 5 years ago or so taken with an average photography camera and the details seem much much better than pictures taken even today with a smartphone. i was really impressed with the details at both background and forefront.\n\nso, what are your thoughts about it? please try to be neutral but giving your honest opinion.\n\nalso, i would like to know what is a good camera (not very expensive) to start with if i was to buy one.\n\nthanks!", "sortedWord": "None", "identifyer": 3894, "year": "2019"}, {"Unnamed: 0": 101749, "autor": "ScriptyFox", "date": 1550260355000, "content": "Furniture rental options /!/ Hey guys, if this isn't the right place for this, I apologize. \n\n&amp;#x200B;\n\nI'm in the middle of planning out a photoshoot with a couple of clients in the near future and one of the things they're requesting is a sectional sofa for the shoot. I haven't had any issues finding a studio space, but for some reason, I can't seem to find a place that'll do furniture rentals specifically for productions that won't cost an arm and a leg. Being where I'm at, I figured that there would be plenty of options, but that doesn't seem to be the case. Does anyone in the Atlanta have any further leads that I can follow up on to get this done?\n\n&amp;#x200B;\n\nThanks.", "link": "https://www.reddit.com/r/photography/comments/ar0hwz/furniture_rental_options/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "furniture rental options /!/ hey guys, if this isn't the right place for this, i apologize. \n\n&amp;#x200b;\n\ni'm in the middle of planning out a photoshoot with a couple of clients in the near future and one of the things they're requesting is a sectional sofa for the shoot. i haven't had any issues finding -----> a !!!  studio space, but for some reason, i can't seem to -----> find !!!  -----> a !!!  -----> place !!!  that'll do furniture rentals specifically for productions that won't cost an arm and -----> a !!!  leg. being where i'm at, i figured that there would be plenty of options, but that doesn't seem to be the case. does anyone in the atlanta have any further leads that i can follow up on to get this done?\n\n&amp;#x200b;\n\nthanks.", "sortedWord": "None", "identifyer": 4510, "year": "2019"}, {"Unnamed: 0": 317552, "autor": "Mastemine", "date": 1558721003000, "content": "Where to buy photography set kits? /!/ I am looking to try and find a place to buy some photoshoot set kits?  \n\n\nI see people around holidays have a themed set design - but wondering if there is any place out there that sells entire photoshoot kits. Talking backdrop, props, and even clothing accessories. \n\n&amp;#x200B;\n\nAll I can ever find is either digital backgrounds and the like.  \n\n\nIs there anyplace out there that sells an entire bundled kit ready to deploy?  \n\n\nLike an easter set for example, with some plush bunny stuffed animals, a cute backdrop, a basket with eggs, etc, and maybe some other rustic features?  \n\n\n\\--\n\n&amp;#x200B;\n\nIf not where is a good place to buy accessories for a photoshoot?", "link": "https://www.reddit.com/r/photography/comments/bsk45j/where_to_buy_photography_set_kits/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "where to buy photography set kits? /!/ i am looking to try and -----> find !!!  -----> a !!!  -----> place !!!  to buy some photoshoot set kits?  \n\n\ni see people around holidays have a themed set design - but wondering if there is any place out there that sells entire photoshoot kits. talking backdrop, props, and even clothing accessories. \n\n&amp;#x200b;\n\nall i can ever find is either digital backgrounds and the like.  \n\n\nis there anyplace out there that sells an entire bundled kit ready to deploy?  \n\n\nlike an easter set for example, with some plush bunny stuffed animals, a cute backdrop, a basket with eggs, etc, and maybe some other rustic features?  \n\n\n\\--\n\n&amp;#x200b;\n\nif not where is a good place to buy accessories for a photoshoot?", "sortedWord": "None", "identifyer": 64689, "year": "2019"}, {"Unnamed: 0": 325086, "autor": "unicellular1", "date": 1551257251000, "content": "Found a place to smoke. Aesthetic was the result.", "link": "https://www.reddit.com/r/photography/comments/avbak3/found_a_place_to_smoke_aesthetic_was_the_result/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "found a place", "selectorShort": "place", "MarkedSent": "-----> found !!!  -----> a !!!  -----> place !!!  to smoke. aesthetic was the result.", "sortedWord": "None", "identifyer": 72510, "year": "2019"}, {"Unnamed: 0": 327516, "autor": "Trueblood512", "date": 1557769459000, "content": "Need HELP finding somewhere to develop antique film from a Kodak vigilant junior six-20 folding accordion camera. /!/ I found a roll of film in this Kodak camera I bought at a flea market, and REALLY want to find a place that has the equipment to develop it!!!! \nThe film roll says it is “color negative C-22 and 616” \nI live in the US on the east coast, and I’m willing to ship anywhere to get this developed. PLEASE HELP!!!! Thank you reddit!!!", "link": "https://www.reddit.com/r/photography/comments/bo6no3/need_help_finding_somewhere_to_develop_antique/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "need help finding somewhere to develop antique film from a kodak vigilant junior six-20 folding accordion camera. /!/ i found -----> a !!!  roll of film in this kodak camera i bought at -----> a !!!  flea market, and really want to -----> find !!!  -----> a !!!  -----> place !!!  that has the equipment to develop it!!!! \nthe film roll says it is “color negative c-22 and 616” \ni live in the us on the east coast, and i’m willing to ship anywhere to get this developed. please help!!!! thank you reddit!!!", "sortedWord": "None", "identifyer": 75032, "year": "2019"}, {"Unnamed: 0": 329431, "autor": "__slamallama__", "date": 1570728217000, "content": "Best place to sell used gear /!/ Where do you guys go to sell used photography gear? I'm considering selling my a6000 and 5 or 6 lenses I have for it to upgrade to FF. \n\nI'm hoping to find a place where people understand what they're buying. I still have original packaging for each and they're babied. I don't expect a ton of money for them but anything would be better than the Craigslist idiots who think my 18-105 G is worth $50", "link": "https://www.reddit.com/r/photography/comments/dg1b4t/best_place_to_sell_used_gear/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "best place to sell used gear /!/ where do you guys go to sell used photography gear? i'm considering selling my a6000 and 5 or 6 lenses i have for it to upgrade to ff. \n\ni'm hoping to -----> find !!!  -----> a !!!  -----> place !!!  where people understand what they're buying. i still have original packaging for each and they're babied. i don't expect a ton of money for them but anything would be better than the craigslist idiots who think my 18-105 g is worth $50", "sortedWord": "None", "identifyer": 77034, "year": "2019"}, {"Unnamed: 0": 333673, "autor": "murrzx", "date": 1551320594000, "content": "Gonna miss this place", "link": "https://www.reddit.com/r/photography/comments/avlpbx/gonna_miss_this_place/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "miss this place", "selectorShort": "place", "MarkedSent": "gonna -----> miss !!!  -----> this !!!  -----> place !!! ", "sortedWord": "None", "identifyer": 81444, "year": "2019"}, {"Unnamed: 0": 334546, "autor": "ryangiglio", "date": 1546651303000, "content": "Where can I read expert photo critique and analysis /!/ I'm a relatively new enthusiast photographer, and I'm taking part in /r/photoclass2019. This week's assignment is to look at and analyze the work of famous photographers. The goal is to see how well executed and composed their work is, and study what makes it compelling.\n\nI found it to be a fascinating and really instructive exercise. I ended up writing four paragraphs about a single photo and then thought: I'm sure there are experts doing this who actually know what they're talking about. I would love to read detailed analysis about the technical choices and composition of really well done photography. All of the popular photography blogs I've found are about news, techniques, gear, etc, but I haven't found a place to read this kind of critical analysis and discussion of the actual craft. I would love any tips or recommendations.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/acp55x/where_can_i_read_expert_photo_critique_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "found a place", "selectorShort": "place", "MarkedSent": "where can i read expert photo critique and analysis /!/ i'm a relatively new enthusiast photographer, and i'm taking part in /r/photoclass2019. this week's assignment is to look at and analyze the work of famous photographers. the goal is to see how well executed and composed their work is, and study what makes it compelling.\n\ni found it to be a fascinating and really instructive exercise. i ended up writing four paragraphs about a single photo and then thought: i'm sure there are experts doing this who actually know what they're talking about. i would love to read detailed analysis about the technical choices and composition of really well done photography. all of the popular photography blogs i've -----> found !!!  are about news, techniques, gear, etc, but i haven't -----> found !!!  -----> a !!!  -----> place !!!  to read this kind of critical analysis and discussion of the actual craft. i would love any tips or recommendations.\n\nthanks!", "sortedWord": "None", "identifyer": 82354, "year": "2019"}, {"Unnamed: 0": 336668, "autor": "Felipe-Olvera", "date": 1559619947000, "content": "Samy's Camera Return? /!/ Hey I was wondering if anyone has placed an order with Samy's Camera online and decided to return it? I can't find a place to do this on their website, not sure if i'm just not looking in the right place or what.", "link": "https://www.reddit.com/r/photography/comments/bwk6ib/samys_camera_return/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "samy's camera return? /!/ hey i was wondering if anyone has placed an order with samy's camera online and decided to return it? i can't -----> find !!!  -----> a !!!  -----> place !!!  to do this on their website, not sure if i'm just not looking in the right -----> place !!!  or what.", "sortedWord": "None", "identifyer": 84567, "year": "2019"}, {"Unnamed: 0": 337781, "autor": "trolllante", "date": 1558369941000, "content": "Learning from mistakes: buying used gear. What not to do! /!/ As a beginner I was looking for a flash to my Canon DSLR. Someone recommended buying used gear instead a new one, so after some research I decided to get an 580 EX - old but still a good flash! Also I could use it as a master and attach a slave down on the road. Anyway, my mistake was buying it from Amazon. Later I realized the TTL was not responding correctly and it can’t performs as a master... it took me forever to realize it! At first I tough I was the one messing it up, a friend tried it on his equipment and confirmed the problem was the flash! I’ve try to get a quote to fix it but Canon discontinued it years ago... it would be more costly to fix it then getting a new one.\nLesson learned: buy used gear from stores that grade their used equipment (B&amp;H or Adorama in the US) and test it thoroughly! Now I have to find a place to sell as parts... I didn’t lost that much money on it... but it hurt my ego.. lol!\n\nTL; DR - Got an used flash at Amazon and later I realized it has issues. Can’t return it.", "link": "https://www.reddit.com/r/photography/comments/bqxt8w/learning_from_mistakes_buying_used_gear_what_not/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "learning from mistakes: buying used gear. what not to do! /!/ as a beginner i was looking for a flash to my canon dslr. someone recommended buying used gear instead a new one, so after some research i decided to get an 580 ex - old but still a good flash! also i could use it as a master and attach a slave down on the road. anyway, my mistake was buying it from amazon. later i realized the ttl was not responding correctly and it can’t performs as a master... it took me forever to realize it! at first i tough i was the one messing it up, a friend tried it on his equipment and confirmed the problem was the flash! i’ve try to get a quote to fix it but canon discontinued it years ago... it would be more costly to fix it then getting a new one.\nlesson learned: buy used gear from stores that grade their used equipment (b&amp;h or adorama in the us) and test it thoroughly! now i have to -----> find !!!  -----> a !!!  -----> place !!!  to sell as parts... i didn’t lost that much money on it... but it hurt my ego.. lol!\n\ntl; dr - got an used flash at amazon and later i realized it has issues. can’t return it.", "sortedWord": "None", "identifyer": 85774, "year": "2019"}], "name": "placephotography2019"}