{"interestingcomments": [{"Unnamed: 0": 57851, "autor": "PitoKnife", "date": 1587218948000, "content": "Help with focus / blurred pictures /!/ Well, i am new in this photography stuff and in this forum, so i am not quite experienced yet, although i want to. English is not my native language so i am sorry if i cannot fully express myself the way it's supposed to. I will just go straight to the point for now. Everytime i take closed up pictures i am not able to take them sharp but blurry, even tho i change the position of the focus all the time to see the best focus setup i can't. I tried cleaning the lens and also getting in a farer distance since it is a 70-300mm but it's still blurry. I took it with 1/250 because my pulse is a bit nervy and 8.0 opening (idk how to say it in english)  What am i doing wrong?", "link": "https://www.reddit.com/r/photography/comments/g3o2qe/help_with_focus_blurred_pictures/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "help with focus / blurred pictures /!/ well, i am new in this photography stuff and in this forum, so i am not quite experienced yet, although i want to. english is not my native language so i am sorry if i cannot fully express myself the way it's supposed to. i will just go straight to the point for now. everytime i take closed up pictures i am not able to take them sharp but blurry, even tho i change the -----> position !!!  of the focus all the time to see the best focus setup i can't. i tried cleaning the lens and also getting in a farer distance since it is a 70-300mm but it's still blurry. i took it with 1/250 because my pulse is a bit nervy and 8.0 opening (idk how to say it in english)  what am i doing wrong?", "sortedWord": "None", "identifyer": 59267, "year": "2020"}, {"Unnamed: 0": 58134, "autor": "manno83", "date": 1593517834000, "content": "Has anyone had any experience of ditching their DSLR kit for slimed down camera system? /!/ For a few years Ive been building a collection of nice full frame Nikon glass but have found myself using it for personal projects (mainly skateboard photography) but find my camera increasingly cumbersome to take on days out. When I do take it out, I only take one lens, with most of the gear living at home. Which gets me to thinking...whats the point?\n\nMy camera bag is really heavy, I'm never going to be a pro (I get some photos in magazines now an again and ironically won an award shooting with a 50mm with single flash) and I as I already mentioned the kit is a pain to carry about (especially when chasing after my kids to take action photos).\n\nCurrently I have an unopened new Fuji X-H1 sat in a box (it was a bargain price so I picked it up before getting any lens) but I considering sending back to the shop as I feel that in a few years I'll find myself back in the same position with a bag of expensive lens that I rarely use. Leading me to think about an X100v, I'm intrigued in shedding weight and lens options to be able to focus on making images.\n\nHas anyone else had this same conflict? I know it's a highly personal subject, just wanted to share some options...", "link": "https://www.reddit.com/r/photography/comments/hilvd4/has_anyone_had_any_experience_of_ditching_their/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "has anyone had any experience of ditching their dslr kit for slimed down camera system? /!/ for a few years ive been building a collection of nice full frame nikon glass but have found myself using it for personal projects (mainly skateboard photography) but find my camera increasingly cumbersome to take on days out. when i do take it out, i only take one lens, with most of the gear living at home. which gets me to thinking...whats the point?\n\nmy camera bag is really heavy, i'm never going to be a pro (i get some photos in magazines now an again and ironically won an award shooting with a 50mm with single flash) and i as i already mentioned the kit is a pain to carry about (especially when chasing after my kids to take action photos).\n\ncurrently i have an unopened new fuji x-h1 sat in a box (it was a bargain price so i picked it up before getting any lens) but i considering sending back to the shop as i feel that in a few years i'll find myself back in the same -----> position !!!  with a bag of expensive lens that i rarely use. leading me to think about an x100v, i'm intrigued in shedding weight and lens options to be able to focus on making images.\n\nhas anyone else had this same conflict? i know it's a highly personal subject, just wanted to share some options...", "sortedWord": "None", "identifyer": 59554, "year": "2020"}, {"Unnamed: 0": 58297, "autor": "AfterElysium", "date": 1599844470000, "content": "Styled Shoots as a Hobbyist? /!/ Hobby photographer doing my best to improve. Would one day love to shoot weddings, but don’t feel confident in my abilities yet. \n\nI practice general photography, am comfortable shooting in manual, watch tons of YouTube videos, read blogs. Still feel stagnant. I learn best hands on and feel like I really need to practice in person with venues and models. However, I’m not a pro, and creating my own shoot is way out of my budget. \n\nI have reached out to several local photographers that I admire seeking mentor or second shooter opportunities, with no luck. The community near me is very insular and not friendly towards new people. Classes are rarely offered and I find myself stuck somewhere between the ones geared towards beginners and the ones for the pros. \n\nWhich brings me to styled shoots! \n\nSeveral venues near me have recently posted the ‘after’ of styled shoot opportunities, thanking vendors, posted photos, etc. \n\nI would LOVE the opportunity to get in on this but I don’t know what the etiquette is or what to expect. I’ve also never seen the invitations/tickets go out. \n\nI have no problem reaching out to the venues directly to find out how to sign up or if I can. \n\nThat being said - I have one camera, and one nice lens. I don’t know what the etiquette is for participating in this kind of event, and I admit to being intimidated by the idea of showing up to a group free for all as someone who is learning and hasn’t made any photographer friends or connections. I can get over the confidence part, if I have a better understanding of what happens at a styled shoot and what the expectations are. \n\nIs it kind of like a hands on class where everyone is jostling for position and just shooting all at once? What happens in terms of giving models directions or trying to get a specific shot? \n\nAny tips for attending this sort of thing? Or would it be frowned upon/not useful until I have more experience shooting? Do I just show up and wander around? \n\nMany thanks in advance for any insights.", "link": "https://www.reddit.com/r/photography/comments/iquszp/styled_shoots_as_a_hobbyist/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "styled shoots as a hobbyist? /!/ hobby photographer doing my best to improve. would one day love to shoot weddings, but don’t feel confident in my abilities yet. \n\ni practice general photography, am comfortable shooting in manual, watch tons of youtube videos, read blogs. still feel stagnant. i learn best hands on and feel like i really need to practice in person with venues and models. however, i’m not a pro, and creating my own shoot is way out of my budget. \n\ni have reached out to several local photographers that i admire seeking mentor or second shooter opportunities, with no luck. the community near me is very insular and not friendly towards new people. classes are rarely offered and i find myself stuck somewhere between the ones geared towards beginners and the ones for the pros. \n\nwhich brings me to styled shoots! \n\nseveral venues near me have recently posted the ‘after’ of styled shoot opportunities, thanking vendors, posted photos, etc. \n\ni would love the opportunity to get in on this but i don’t know what the etiquette is or what to expect. i’ve also never seen the invitations/tickets go out. \n\ni have no problem reaching out to the venues directly to find out how to sign up or if i can. \n\nthat being said - i have one camera, and one nice lens. i don’t know what the etiquette is for participating in this kind of event, and i admit to being intimidated by the idea of showing up to a group free for all as someone who is learning and hasn’t made any photographer friends or connections. i can get over the confidence part, if i have a better understanding of what happens at a styled shoot and what the expectations are. \n\nis it kind of like a hands on class where everyone is jostling for -----> position !!!  and just shooting all at once? what happens in terms of giving models directions or trying to get a specific shot? \n\nany tips for attending this sort of thing? or would it be frowned upon/not useful until i have more experience shooting? do i just show up and wander around? \n\nmany thanks in advance for any insights.", "sortedWord": "None", "identifyer": 59720, "year": "2020"}, {"Unnamed: 0": 58547, "autor": "mister-owly", "date": 1609232561000, "content": "How do you hold the sigma 18-35 lens? /!/ \nI rented the lens twice now. The lens is amazing. No doubt. It's heavy af. Super sharp. \nBut users, don't ya'll find the ergonomics weird or is it just me?\n\nLike the dial is placed in such a bad position. How do you really, like properly hold the lens **without** rotating the focal length?", "link": "https://www.reddit.com/r/photography/comments/kmav2d/how_do_you_hold_the_sigma_1835_lens/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how do you hold the sigma 18-35 lens? /!/ \ni rented the lens twice now. the lens is amazing. no doubt. it's heavy af. super sharp. \nbut users, don't ya'll find the ergonomics weird or is it just me?\n\nlike the dial is placed in such a bad -----> position !!! . how do you really, like properly hold the lens **without** rotating the focal length?", "sortedWord": "None", "identifyer": 59971, "year": "2020"}, {"Unnamed: 0": 58838, "autor": "Talix101", "date": 1583961762000, "content": "Questions from a new pro Retoucher /!/ Hi there. I've been a professional Retoucher now for 5 months and am very hungry to keep growing and improving and would like to ask a few questions.\n\nI sort of fell into this role as I was initially training myself up to become a Concept artist and this position I work at now was initially planned to be a stepping stone before getting there. Turns out I liked Retouching more than I thought I would which has made me reevaluate my long term goals. Currently I'm starting to think this career path is more enjoyable and better suited for me and have been reading what I can on things I can do to keep improving and future proof myself. So here are some questions I'd love some feedback on.\n\n- is retouching a good long term career path?\n\n- what are some great online resources to keep improving?\n\n- Should I try to bring my photography skills to a professional level also or maybe video editing or something else I've not thought about?\n\n- What's the best way to begin freelancing on the side outside of the day job. Any specific websites or forums that I could find freelance retouching work?\n\n- Is composition worth learning? Be that with just adding effects on photos in ps or video composition in after effects or nuke. I know the latter is more directed to vfx\n\n- I currently do sports &amp; ecommerce retouching as a 9-5. The big one is obvious fashion but is there much work in wildlife retouching? \n\nAny bonus advice would be greatly appreciated. I love to setup long term goals and keep improving so I'm really trying to pinpoint what I should be investing time into right now.", "link": "https://www.reddit.com/r/photography/comments/fh4ngb/questions_from_a_new_pro_retoucher/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "questions from a new pro retoucher /!/ hi there. i've been a professional retoucher now for 5 months and am very hungry to keep growing and improving and would like to ask a few questions.\n\ni sort of fell into this role as i was initially training myself up to become a concept artist and this -----> position !!!  i work at now was initially planned to be a stepping stone before getting there. turns out i liked retouching more than i thought i would which has made me reevaluate my long term goals. currently i'm starting to think this career path is more enjoyable and better suited for me and have been reading what i can on things i can do to keep improving and future proof myself. so here are some questions i'd love some feedback on.\n\n- is retouching a good long term career path?\n\n- what are some great online resources to keep improving?\n\n- should i try to bring my photography skills to a professional level also or maybe video editing or something else i've not thought about?\n\n- what's the best way to begin freelancing on the side outside of the day job. any specific websites or forums that i could find freelance retouching work?\n\n- is composition worth learning? be that with just adding effects on photos in ps or video composition in after effects or nuke. i know the latter is more directed to vfx\n\n- i currently do sports &amp; ecommerce retouching as a 9-5. the big one is obvious fashion but is there much work in wildlife retouching? \n\nany bonus advice would be greatly appreciated. i love to setup long term goals and keep improving so i'm really trying to pinpoint what i should be investing time into right now.", "sortedWord": "None", "identifyer": 60272, "year": "2020"}, {"Unnamed: 0": 58854, "autor": "otas32", "date": 1583946065000, "content": "A few questions for fellow macro photographers (handheld focus stacking) /!/  \n\nHello fellow macro photographers (hopefully not breaking any forum rules this time).\n\nI have thought about getting back to shooting macro (been too busy with work and family for the past three years). \n\nI have thought about doing some 1x+ focus stacking, but for that, I was thinking about what lighting gear I should go for.  \nI'm a Nikon guy, so the expensive R1C1 has always been on my radar, but I've never gotten around to it, second party brands like Younguo and the Meike MK-MT24 looks very promising (and cheaper). My camera body is due for an upgrade. Since I mostly shoot macro, I don't have full-frame camera body or lenses, although I might get something like the D780 and a 12-24 or 11-16 Tokina for that later on.\n\nAnyway, I was thinking of upgrading my D7100 to the upcoming D7600 (if it ever drops in 2020), and possibly a Venus Laowa 60mm which is one of those rare lenses that fit a Nikon body that can go up to 2x, and you can avoid using a setup like reversed lenses or extension tubes.\n\nSo, the question is. If I want to do continuous shooting, taking advantage of the 8fps that the D7600 will maintain from the previous D7500, which flash should I consider that can keep up?\n\n• The SB-R200's included with the R1C1?  \n• The Meike MK-MT24 I mentioned?  \n• A heavy cumbersome larger flash with something like a slim modifier, gigantic diffuser cone/balloon or sitting uncomfortably on a bracket?\n\nFor finicky critters, you need speed, or you won't get decent focus stacking photos. And this considering that at 8fps, limbs will have moved, even if the subject stays for the duration of the whole shot burst.\n\nAnyway, I HAVE done some rudimentary handheld focus staking in the past, but it's never from a burst, just a very patient subject while holding a branch or leaf. But I wanted to go past 1x, and then you need really quick shooting and all in one sequence/position.\n\nAdditional suggestions are VERY welcome. For instance, how much distortion do you get from using a focus bracketing system like the one that the D780 has? I mean, if it's the lens changing focal length, there has to be distortion vs displacing the camera with the same focal length on the Z-axis (by sliding the camera over your hand or on a rail (if you are doing something with a sleeping subject like those impressive dewdrop photos I also have in my bucket list - need colder weather for that, in Costa Rica you won't get that window of opportunity).", "link": "https://www.reddit.com/r/photography/comments/fh0egw/a_few_questions_for_fellow_macro_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a few questions for fellow macro photographers (handheld focus stacking) /!/  \n\nhello fellow macro photographers (hopefully not breaking any forum rules this time).\n\ni have thought about getting back to shooting macro (been too busy with work and family for the past three years). \n\ni have thought about doing some 1x+ focus stacking, but for that, i was thinking about what lighting gear i should go for.  \ni'm a nikon guy, so the expensive r1c1 has always been on my radar, but i've never gotten around to it, second party brands like younguo and the meike mk-mt24 looks very promising (and cheaper). my camera body is due for an upgrade. since i mostly shoot macro, i don't have full-frame camera body or lenses, although i might get something like the d780 and a 12-24 or 11-16 tokina for that later on.\n\nanyway, i was thinking of upgrading my d7100 to the upcoming d7600 (if it ever drops in 2020), and possibly a venus laowa 60mm which is one of those rare lenses that fit a nikon body that can go up to 2x, and you can avoid using a setup like reversed lenses or extension tubes.\n\nso, the question is. if i want to do continuous shooting, taking advantage of the 8fps that the d7600 will maintain from the previous d7500, which flash should i consider that can keep up?\n\n• the sb-r200's included with the r1c1?  \n• the meike mk-mt24 i mentioned?  \n• a heavy cumbersome larger flash with something like a slim modifier, gigantic diffuser cone/balloon or sitting uncomfortably on a bracket?\n\nfor finicky critters, you need speed, or you won't get decent focus stacking photos. and this considering that at 8fps, limbs will have moved, even if the subject stays for the duration of the whole shot burst.\n\nanyway, i have done some rudimentary handheld focus staking in the past, but it's never from a burst, just a very patient subject while holding a branch or leaf. but i wanted to go past 1x, and then you need really quick shooting and all in one sequence/-----> position !!! .\n\nadditional suggestions are very welcome. for instance, how much distortion do you get from using a focus bracketing system like the one that the d780 has? i mean, if it's the lens changing focal length, there has to be distortion vs displacing the camera with the same focal length on the z-axis (by sliding the camera over your hand or on a rail (if you are doing something with a sleeping subject like those impressive dewdrop photos i also have in my bucket list - need colder weather for that, in costa rica you won't get that window of opportunity).", "sortedWord": "None", "identifyer": 60288, "year": "2020"}, {"Unnamed: 0": 58857, "autor": "otas32", "date": 1583942979000, "content": "A few questions for fellow macro photographers (handheld focus stacking) /!/ Hello fellow macro photographers.  \n\n\nI have thought about getting back to shooting macro (been too busy with work and family for the past three years). You can see stuff I've done in the past here: [micromacrophoto.com](https://micromacrophoto.com) (if you are curious).  \n\n\nI have thought about doing some 1x+ focus stacking, but for that, I was thinking about what lighting gear I should go for.   \nI'm a Nikon guy, so the expensive R1C1 has always been on my radar, but I've never gotten around to it, second party brands like Younguo and the Meike MK-MT24 looks very promising (and cheaper). My camera body is due for an upgrade. Since I mostly shoot macro, I don't have full-frame camera body or lenses, although I might get something like the D780 and a 12-24 or 11-16 Tokina for that later on.   \n\n\nAnyway, I was thinking of upgrading my D7100 to the upcoming D7600 (if it ever drops in 2020), and possibly a Venus Laowa 60mm which is one of those rare lenses that fit a Nikon body that can go up to 2x, and you can avoid using a setup like reversed lenses or extension tubes.  \n\n\nSo, the question is. If I want to do continuous shooting, taking advantage of the 8fps that the D7600 will maintain from the previous D7500, which flash should I consider that can keep up?  \n\n\n• The  SB-R200's included with the R1C1?  \n• The Meike MK-MT24 I mentioned?  \n• A heavy cumbersome larger flash with something like a slim modifier, gigantic diffuser cone/balloon or sitting uncomfortably on a bracket?  \n\n\nFor finicky critters, you need speed, or you won't get decent focus stacking photos. And this considering that at 8fps, limbs will have moved, even if the subject stays for the duration of the whole shot burst.  \n\n\nAnyway, I HAVE done some rudimentary handheld focus staking in the past, but it's never from a burst, just a very patient subject while holding a branch or leaf. But I wanted to go past 1x, and then you need really quick shooting and all in one sequence/position.  \n\n\nAdditional suggestions are VERY welcome. For instance, how much distortion do you get from using a focus bracketing system like the one that the D780 has? I mean, if it's the lens changing focal length, there has to be distortion vs displacing the camera with the same focal length on the Z-axis (by sliding the camera over your hand or on a rail (if you are doing something with a sleeping subject like those impressive dewdrop photos I also have in my bucket list - need colder weather for that, in Costa Rica you won't get that window of opportunity).", "link": "https://www.reddit.com/r/photography/comments/fgzk0v/a_few_questions_for_fellow_macro_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a few questions for fellow macro photographers (handheld focus stacking) /!/ hello fellow macro photographers.  \n\n\ni have thought about getting back to shooting macro (been too busy with work and family for the past three years). you can see stuff i've done in the past here: [micromacrophoto.com](https://micromacrophoto.com) (if you are curious).  \n\n\ni have thought about doing some 1x+ focus stacking, but for that, i was thinking about what lighting gear i should go for.   \ni'm a nikon guy, so the expensive r1c1 has always been on my radar, but i've never gotten around to it, second party brands like younguo and the meike mk-mt24 looks very promising (and cheaper). my camera body is due for an upgrade. since i mostly shoot macro, i don't have full-frame camera body or lenses, although i might get something like the d780 and a 12-24 or 11-16 tokina for that later on.   \n\n\nanyway, i was thinking of upgrading my d7100 to the upcoming d7600 (if it ever drops in 2020), and possibly a venus laowa 60mm which is one of those rare lenses that fit a nikon body that can go up to 2x, and you can avoid using a setup like reversed lenses or extension tubes.  \n\n\nso, the question is. if i want to do continuous shooting, taking advantage of the 8fps that the d7600 will maintain from the previous d7500, which flash should i consider that can keep up?  \n\n\n• the  sb-r200's included with the r1c1?  \n• the meike mk-mt24 i mentioned?  \n• a heavy cumbersome larger flash with something like a slim modifier, gigantic diffuser cone/balloon or sitting uncomfortably on a bracket?  \n\n\nfor finicky critters, you need speed, or you won't get decent focus stacking photos. and this considering that at 8fps, limbs will have moved, even if the subject stays for the duration of the whole shot burst.  \n\n\nanyway, i have done some rudimentary handheld focus staking in the past, but it's never from a burst, just a very patient subject while holding a branch or leaf. but i wanted to go past 1x, and then you need really quick shooting and all in one sequence/-----> position !!! .  \n\n\nadditional suggestions are very welcome. for instance, how much distortion do you get from using a focus bracketing system like the one that the d780 has? i mean, if it's the lens changing focal length, there has to be distortion vs displacing the camera with the same focal length on the z-axis (by sliding the camera over your hand or on a rail (if you are doing something with a sleeping subject like those impressive dewdrop photos i also have in my bucket list - need colder weather for that, in costa rica you won't get that window of opportunity).", "sortedWord": "None", "identifyer": 60291, "year": "2020"}, {"Unnamed: 0": 59547, "autor": "red_beered", "date": 1591860871000, "content": "Protest ettiquette for photographers and racial sensitivity /!/ Here in Portland the protests and marches have been massive, 3-10k people every night marching through the city, so you can imagine there are a lot of photographers out and about, both professional and amateurs. Here in Portland, very few of those photographers are Black. \n\nRecently, I witnessed an interaction that has stuck with me, and I am not sure how to process it. Over a livestream, one of the Black photographers confronted a man who was seemingly getting in all her shots. He wasnt necessarily doing it maliciously, he just so happen to be positioning himself at the right moments. I know of this guy, as he was also getting in my shots and was definitley not being fully aware of other photographers.The photographer, when confronting him, told him he should be making space for the Black photographers, and that he was being intrusive. He definitely didnt quite understand, but was apologetic and told her she can tell him to move, he didnt want to be intrusive, she asked him to leave and stated everyone hates him. She then blasted the confrontation out to her instagram feed, including his unmasked face, and asked her followers to track down who he was. Someone off camera badgered him for his private account and he gave it to them off camera, which the photographer then echoed to her followers, which included his presumably full name.\n\nI understand the moment and her perspective, and making sure Black photographers have the space they need to seize their movement, but blasting his info and doing a light doxx to her thousands of follower made me really concerned. \n\nWhat are everyones thoughts on this? Anyone seeing this at other events? Should she be confronted or reported for this? Should non-POC photographers bail on these events and just be marchers? I feel like she could have confronted him off camera and they could have talked it out, but instead she made him a target and in my opinion, has cyber bullied him.", "link": "https://www.reddit.com/r/photography/comments/h0ujqq/protest_ettiquette_for_photographers_and_racial/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "protest ettiquette for photographers and racial sensitivity /!/ here in portland the protests and marches have been massive, 3-10k people every night marching through the city, so you can imagine there are a lot of photographers out and about, both professional and amateurs. here in portland, very few of those photographers are black. \n\nrecently, i witnessed an interaction that has stuck with me, and i am not sure how to process it. over a livestream, one of the black photographers confronted a man who was seemingly getting in all her shots. he wasnt necessarily doing it maliciously, he just so happen to be -----> positioning !!!  himself at the right moments. i know of this guy, as he was also getting in my shots and was definitley not being fully aware of other photographers.the photographer, when confronting him, told him he should be making space for the black photographers, and that he was being intrusive. he definitely didnt quite understand, but was apologetic and told her she can tell him to move, he didnt want to be intrusive, she asked him to leave and stated everyone hates him. she then blasted the confrontation out to her instagram feed, including his unmasked face, and asked her followers to track down who he was. someone off camera badgered him for his private account and he gave it to them off camera, which the photographer then echoed to her followers, which included his presumably full name.\n\ni understand the moment and her perspective, and making sure black photographers have the space they need to seize their movement, but blasting his info and doing a light doxx to her thousands of follower made me really concerned. \n\nwhat are everyones thoughts on this? anyone seeing this at other events? should she be confronted or reported for this? should non-poc photographers bail on these events and just be marchers? i feel like she could have confronted him off camera and they could have talked it out, but instead she made him a target and in my opinion, has cyber bullied him.", "sortedWord": "None", "identifyer": 60996, "year": "2020"}, {"Unnamed: 0": 60342, "autor": "cmazmanian", "date": 1607601373000, "content": "Should I charge for using my photo as a book cover? /!/ I recently submitted work to a local photo contest in Baltimore and shortly after got an email asking to use one of my photos for the cover of a short manuscript book from a teacher at Johns Hopkins.\nNever been in this position before... Should I charge this person licensing fees or something like that?\nCredit will be given to me regardless.... Just not sure how to answer his email.\nThanks y'all!", "link": "https://www.reddit.com/r/photography/comments/kae1ye/should_i_charge_for_using_my_photo_as_a_book_cover/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "should i charge for using my photo as a book cover? /!/ i recently submitted work to a local photo contest in baltimore and shortly after got an email asking to use one of my photos for the cover of a short manuscript book from a teacher at johns hopkins.\nnever been in this -----> position !!!  before... should i charge this person licensing fees or something like that?\ncredit will be given to me regardless.... just not sure how to answer his email.\nthanks y'all!", "sortedWord": "None", "identifyer": 61808, "year": "2020"}, {"Unnamed: 0": 60357, "autor": "videoviewhomes", "date": 1609191783000, "content": "Global Realestate , Videographer and Model positions Available", "link": "https://www.reddit.com/r/photography/comments/klzqvl/global_realestate_videographer_and_model/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "global realestate , videographer and model -----> positions !!!  available", "sortedWord": "None", "identifyer": 61823, "year": "2020"}, {"Unnamed: 0": 60379, "autor": "mister-owly", "date": 1609181659000, "content": "How do you hold the sigma 18-35 lens? /!/ I rented the lens twice now. The lens is amazing. No doubt. It's heavy af. Super sharp. \nBut users, don't ya'll find the ergonomics weird or is it just me?\n\nLike the dial is placed in such a bad position. How do you really, like properly hold the lens **without**rotating the focal length?", "link": "https://www.reddit.com/r/photography/comments/klwg03/how_do_you_hold_the_sigma_1835_lens/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how do you hold the sigma 18-35 lens? /!/ i rented the lens twice now. the lens is amazing. no doubt. it's heavy af. super sharp. \nbut users, don't ya'll find the ergonomics weird or is it just me?\n\nlike the dial is placed in such a bad -----> position !!! . how do you really, like properly hold the lens **without**rotating the focal length?", "sortedWord": "None", "identifyer": 61845, "year": "2020"}, {"Unnamed: 0": 60728, "autor": "rhyzia", "date": 1581614671000, "content": "Band photography, where do I position myself? /!/ I’m just getting into it and I’ve talked to two bands coming out to my area soon, they both are cool with me shooting for them and I told them I’m doing it for the experience however even that being said one of the bands offered to pay for my way in and for my time. Apparently he’s the leader and manager and is also a photographer who understands the hustle. Since it’s my first official time, where do I position myself? Where should I go? I’ve seen some photographers at concerts like on the side of the stages and back stage etc.. should I try discussing if side stage angles are an option for me? Picturing it in my head I’m assuming I get there early to beat the crowd and get as close to the stage as possible front row to take some good shots of them.", "link": "https://www.reddit.com/r/photography/comments/f3dces/band_photography_where_do_i_position_myself/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "band photography, where do i -----> position !!!  myself? /!/ i’m just getting into it and i’ve talked to two bands coming out to my area soon, they both are cool with me shooting for them and i told them i’m doing it for the experience however even that being said one of the bands offered to pay for my way in and for my time. apparently he’s the leader and manager and is also a photographer who understands the hustle. since it’s my first official time, where do i position myself? where should i go? i’ve seen some photographers at concerts like on the side of the stages and back stage etc.. should i try discussing if side stage angles are an option for me? picturing it in my head i’m assuming i get there early to beat the crowd and get as close to the stage as possible front row to take some good shots of them.", "sortedWord": "None", "identifyer": 62204, "year": "2020"}, {"Unnamed: 0": 60822, "autor": "dperry1973", "date": 1582308655000, "content": "Pros: how did you build a portfolio of work that would get you better jobs when your current clients don’t allow you to “be fancy”? /!/ It’s a catch 22. You need paid work to put in your portfolio that will boost your career advancement. However (in my case) I live in a small town with clients that have very simple taste in photography.\n\nI do have pieces from my passion projects from 4 years ago but those don’t reflect the photog that I am today. I’ve advanced terms of technically and stylistically. I’d like to do more formal portraits but live alone with no access to family or friends to use as talent. No pets to shoot. I could hire models but I’m no way in a financial position to do so. Most of my headshots are self-portraits and I imagine that clients want to see more than fancy selfies. \n\nSo you can see my dilemma. How to improve the quality of my portfolio with extremely limited resources.", "link": "https://www.reddit.com/r/photography/comments/f7f2s3/pros_how_did_you_build_a_portfolio_of_work_that/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "pros: how did you build a portfolio of work that would get you better jobs when your current clients don’t allow you to “be fancy”? /!/ it’s a catch 22. you need paid work to put in your portfolio that will boost your career advancement. however (in my case) i live in a small town with clients that have very simple taste in photography.\n\ni do have pieces from my passion projects from 4 years ago but those don’t reflect the photog that i am today. i’ve advanced terms of technically and stylistically. i’d like to do more formal portraits but live alone with no access to family or friends to use as talent. no pets to shoot. i could hire models but i’m no way in a financial -----> position !!!  to do so. most of my headshots are self-portraits and i imagine that clients want to see more than fancy selfies. \n\nso you can see my dilemma. how to improve the quality of my portfolio with extremely limited resources.", "sortedWord": "None", "identifyer": 62303, "year": "2020"}, {"Unnamed: 0": 61197, "autor": "nugget_lover_", "date": 1585498210000, "content": "As a student on a budget is it better to buy a new lens to an already owned camera or try out a film camera? /!/ So I'm in a strange position...I got a Fuji xpro1 with a manual 7artisans 35mm f1.2 lens and an om 50mm f1.8 (with adapter). Would you buy an Olympus om body or a Fujifilm 23mm f2? Some thoughts would be awesome, cheers :)", "link": "https://www.reddit.com/r/photography/comments/fr893y/as_a_student_on_a_budget_is_it_better_to_buy_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "as a student on a budget is it better to buy a new lens to an already owned camera or try out a film camera? /!/ so i'm in a strange -----> position !!! ...i got a fuji xpro1 with a manual 7artisans 35mm f1.2 lens and an om 50mm f1.8 (with adapter). would you buy an olympus om body or a fujifilm 23mm f2? some thoughts would be awesome, cheers :)", "sortedWord": "None", "identifyer": 62697, "year": "2020"}, {"Unnamed: 0": 61863, "autor": "paradiseinyoureyes", "date": 1587938343000, "content": "Tripod head that takes lengthwise photos? /!/ All the tripod heads I’ve seen and own can only be positioned to take horizontal photos. I am looking to take a lengthwise shot (with the DSLR camera on its side as opposed to sitting on its base). Is there any tripod and or tripod head that can help me achieve this? Thanks.", "link": "https://www.reddit.com/r/photography/comments/g8nfmh/tripod_head_that_takes_lengthwise_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "tripod head that takes lengthwise photos? /!/ all the tripod heads i’ve seen and own can only be -----> positioned !!!  to take horizontal photos. i am looking to take a lengthwise shot (with the dslr camera on its side as opposed to sitting on its base). is there any tripod and or tripod head that can help me achieve this? thanks.", "sortedWord": "None", "identifyer": 63373, "year": "2020"}, {"Unnamed: 0": 63970, "autor": "plavipatlidzan", "date": 1608363476000, "content": "Photographer and subject people /!/ I have more a question for professional photographers, at least I think it is. I am so far amateur. I am interested in documentary photography, especially people, and have been wondering about the relationship of myself as a photographer and the subject people. How do you set yourself towards them? Do you always approach, or do you sometimes take a risk on taking a secret photo? Do you introduce yourself to them and take photos just after a bit of bonding and gaining trust from them? I suppose it all depends, but am interested in any kinds of different relationships since I am oftentimes confused with the position.", "link": "https://www.reddit.com/r/photography/comments/kg3m6s/photographer_and_subject_people/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "photographer and subject people /!/ i have more a question for professional photographers, at least i think it is. i am so far amateur. i am interested in documentary photography, especially people, and have been wondering about the relationship of myself as a photographer and the subject people. how do you set yourself towards them? do you always approach, or do you sometimes take a risk on taking a secret photo? do you introduce yourself to them and take photos just after a bit of bonding and gaining trust from them? i suppose it all depends, but am interested in any kinds of different relationships since i am oftentimes confused with the -----> position !!! .", "sortedWord": "None", "identifyer": 65535, "year": "2020"}, {"Unnamed: 0": 64257, "autor": "CaptainRyannn", "date": 1604373255000, "content": "Copyright Infringement Turned Potential Job Offer - Advice Needed /!/ Kind of in a surreal situation and looking for some advice!   \n\n\nI recently came across a brand new luxury apartment building that stole a photo of mine and blew it up to an 18' x 18' wall in their building's lobby. After acquiring a lawyer and some back and forth emails, I now have a meeting this week with the design agency that stole the photo to discuss the possibility of being hired on as their in-house photographer in lieu of a large settlement.   \n\n\nWhile I've always dreamed of having a photography job that allowed me to shoot the things I like, I became convinced that the only way to make a solid living in the field was through portraits, events, and weddings, all of which I've tried, none of which I have a passion for. I got stuck in the service industry and while I'm currently unemployed due to COVID, I'd give anything to have a job I love and be out of restaurant work forever. Now that all might be possible because of a stolen photograph. \n\n&amp;#x200B;\n\n1. Until the meeting, I'm unsure exactly what they had in mind for a photographer. I don't believe it's a position they've had previously, though they've been around for over 20 years and have various high-profile clients. Can anyone share a bit of experience of what it was like working for a design firm? \n2. My ideal scenario would be a salaried position in which I can feel free to take the photos I already enjoy taking and give them exclusive rights to their favorites to use for their clients how they see fit. And perhaps they would occasionally have specific criteria like a Dentist office that wants \"forest-themed\" pictures. Is this a type of position that exists or am I dreaming? \n3. I didn't have a ton of time to put a portfolio together, but dropped some money for a presentation book and a handful of 8x12 prints with a luster finish. I'll get the prints tomorrow but wondering if it's acceptable to present prints in a folder vs. inside plastic portfolio pages? Part of me feels like handling the prints is a better experience but is it less professional? \n4. And lastly, as I've mentioned, I've always just shot based on colors &amp; composition more than content. Aside from that, I don't really know how to describe my style whatsoever. [I'd be greatly appreciative if anyone could take a look at some of my work](https://drive.google.com/file/d/1iiT4S_RS52udLoYpNA1_xSiT7-u2IAD0/view?usp=sharing) and give me an idea of how I'd describe and sell this style to a potential employer.   \n\n\nI'm nervous and don't really know what I'm doing so any and all help is greatly appreciated! \n\n  \nTL;DR - A high-profile interior design agency stole my photo to use as a wallpaper in a luxury apartment building and after hearing from my lawyer, wants to meet to discuss employment possibilities. I'm only a hobbyist photographer but this might be a dream job. Looking for advice on how to approach the interview and how to talk about my style of work.", "link": "https://www.reddit.com/r/photography/comments/jn2rb6/copyright_infringement_turned_potential_job_offer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "copyright infringement turned potential job offer - advice needed /!/ kind of in a surreal situation and looking for some advice!   \n\n\ni recently came across a brand new luxury apartment building that stole a photo of mine and blew it up to an 18' x 18' wall in their building's lobby. after acquiring a lawyer and some back and forth emails, i now have a meeting this week with the design agency that stole the photo to discuss the possibility of being hired on as their in-house photographer in lieu of a large settlement.   \n\n\nwhile i've always dreamed of having a photography job that allowed me to shoot the things i like, i became convinced that the only way to make a solid living in the field was through portraits, events, and weddings, all of which i've tried, none of which i have a passion for. i got stuck in the service industry and while i'm currently unemployed due to covid, i'd give anything to have a job i love and be out of restaurant work forever. now that all might be possible because of a stolen photograph. \n\n&amp;#x200b;\n\n1. until the meeting, i'm unsure exactly what they had in mind for a photographer. i don't believe it's a -----> position !!!  they've had previously, though they've been around for over 20 years and have various high-profile clients. can anyone share a bit of experience of what it was like working for a design firm? \n2. my ideal scenario would be a salaried position in which i can feel free to take the photos i already enjoy taking and give them exclusive rights to their favorites to use for their clients how they see fit. and perhaps they would occasionally have specific criteria like a dentist office that wants \"forest-themed\" pictures. is this a type of position that exists or am i dreaming? \n3. i didn't have a ton of time to put a portfolio together, but dropped some money for a presentation book and a handful of 8x12 prints with a luster finish. i'll get the prints tomorrow but wondering if it's acceptable to present prints in a folder vs. inside plastic portfolio pages? part of me feels like handling the prints is a better experience but is it less professional? \n4. and lastly, as i've mentioned, i've always just shot based on colors &amp; composition more than content. aside from that, i don't really know how to describe my style whatsoever. [i'd be greatly appreciative if anyone could take a look at some of my work](https://drive.google.com/file/d/1iit4s_rs52udloypna1_xsit7-u2iad0/view?usp=sharing) and give me an idea of how i'd describe and sell this style to a potential employer.   \n\n\ni'm nervous and don't really know what i'm doing so any and all help is greatly appreciated! \n\n  \ntl;dr - a high-profile interior design agency stole my photo to use as a wallpaper in a luxury apartment building and after hearing from my lawyer, wants to meet to discuss employment possibilities. i'm only a hobbyist photographer but this might be a dream job. looking for advice on how to approach the interview and how to talk about my style of work.", "sortedWord": "None", "identifyer": 65827, "year": "2020"}, {"Unnamed: 0": 64358, "autor": "allstarrevenant", "date": 1605222704000, "content": "Smartphone tripod + Smartwatch as viewfinder setup? /!/ Hi, so I've mainly been using a Google Pixel phone for taking photos as I don't find myself needing the power of a DSLR.\n\nOne thing I've always struggled with is taking self-portraits while standing in front of a nice background. I currently put my phone on a tripod and use a bluetooth remote. The problem is, I'm bad at positioning myself and I can't see how the shot's going to turn out, so I'm always running back to the phone to check after each shot. This causes me to take like a whole hour to get 1 good pic\n\nSome smartwatches can connect to your phone's camera and show you a preview of what the phone's camera is seeing, and also allows you to control the shutter. This seems like a potential solution to my problem. However, I don't know how well this works in practice because the Smartwatch is:\n\n1. Round in shape unlike the final picture which is rectangular\n2. Much smaller than the phone's screen and probably doesn't show the entire picture\n\nHas anyone tried a setup like this? (Smartphone + Tripod + Smartwatch as Viewfinder and remote)? \n\nIf this setup doesn't work, then the only other solution I can think of is to buy a DSLR with wifi, connect my phone to it, and use that as the viewfinder.", "link": "https://www.reddit.com/r/photography/comments/jt5kx3/smartphone_tripod_smartwatch_as_viewfinder_setup/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "smartphone tripod + smartwatch as viewfinder setup? /!/ hi, so i've mainly been using a google pixel phone for taking photos as i don't find myself needing the power of a dslr.\n\none thing i've always struggled with is taking self-portraits while standing in front of a nice background. i currently put my phone on a tripod and use a bluetooth remote. the problem is, i'm bad at -----> positioning !!!  myself and i can't see how the shot's going to turn out, so i'm always running back to the phone to check after each shot. this causes me to take like a whole hour to get 1 good pic\n\nsome smartwatches can connect to your phone's camera and show you a preview of what the phone's camera is seeing, and also allows you to control the shutter. this seems like a potential solution to my problem. however, i don't know how well this works in practice because the smartwatch is:\n\n1. round in shape unlike the final picture which is rectangular\n2. much smaller than the phone's screen and probably doesn't show the entire picture\n\nhas anyone tried a setup like this? (smartphone + tripod + smartwatch as viewfinder and remote)? \n\nif this setup doesn't work, then the only other solution i can think of is to buy a dslr with wifi, connect my phone to it, and use that as the viewfinder.", "sortedWord": "None", "identifyer": 65930, "year": "2020"}, {"Unnamed: 0": 64802, "autor": "mynameisyles657", "date": 1581949014000, "content": "How to Break Into Real Estate/Commercial Photography /!/ Hello fellow photographers!\n\nI live in a very fast growing city with construction everywhere and a few local companies developing almost everything. I've always been a big fan of keeping up with the new construction in my city but never considered it until recently, but I would love to try to make the move to commerical photography.\n\nI've been taking progress pictures with my drone and sending the low res files to the instagram accounts of the developers. I've also emailed several CEO's to ask for permission to take pictures of their properties in exchange for full res files. I've pretty much taken this as a \"Working Interview\", trying to get the best pictures as possible in order to show off their properties.\n\nWhat would be the best way to get myself into a position where I could start charging for my services or the companies reaching out to me to come out to take pictures?", "link": "https://www.reddit.com/r/photography/comments/f59bra/how_to_break_into_real_estatecommercial/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how to break into real estate/commercial photography /!/ hello fellow photographers!\n\ni live in a very fast growing city with construction everywhere and a few local companies developing almost everything. i've always been a big fan of keeping up with the new construction in my city but never considered it until recently, but i would love to try to make the move to commerical photography.\n\ni've been taking progress pictures with my drone and sending the low res files to the instagram accounts of the developers. i've also emailed several ceo's to ask for permission to take pictures of their properties in exchange for full res files. i've pretty much taken this as a \"working interview\", trying to get the best pictures as possible in order to show off their properties.\n\nwhat would be the best way to get myself into a -----> position !!!  where i could start charging for my services or the companies reaching out to me to come out to take pictures?", "sortedWord": "None", "identifyer": 66387, "year": "2020"}, {"Unnamed: 0": 64999, "autor": "senpai1g", "date": 1582716184000, "content": "Advice for which lenses to buy (Sony a6300) /!/ Heyo.\n\n&amp;#x200B;\n\nSo, I started taking photos/videos as a hobby in July 2018. I started with a Nikon p520 (semi-professional), and recently bought a Sony a6300 with the default lens (16-50mm f3.5-5.6).\n\nI like how I'm progressing in terms of learning how to adjust camera settings, positioning for good light, and so on. However, I feel like I need to add 1-2 lenses to my gear in order to upgrade my game.\n\nI like to shoot everything, from portraits, to landscape, to cinematic videos. My budget isn't very high, so I've been looking at the Sony  E 55-210 mm F/4.5-6.3 OSS LE, and the Sony E 50mm F1.8 E-mount full-size. \n\n&amp;#x200B;\n\nDo you guys think these are good lens to add to my list, or should I get any other? (close to that price range, 250€-350€)\n\n&amp;#x200B;\n\nThanks in advance!\n\nCheers", "link": "https://www.reddit.com/r/photography/comments/f9rs81/advice_for_which_lenses_to_buy_sony_a6300/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "advice for which lenses to buy (sony a6300) /!/ heyo.\n\n&amp;#x200b;\n\nso, i started taking photos/videos as a hobby in july 2018. i started with a nikon p520 (semi-professional), and recently bought a sony a6300 with the default lens (16-50mm f3.5-5.6).\n\ni like how i'm progressing in terms of learning how to adjust camera settings, -----> positioning !!!  for good light, and so on. however, i feel like i need to add 1-2 lenses to my gear in order to upgrade my game.\n\ni like to shoot everything, from portraits, to landscape, to cinematic videos. my budget isn't very high, so i've been looking at the sony  e 55-210 mm f/4.5-6.3 oss le, and the sony e 50mm f1.8 e-mount full-size. \n\n&amp;#x200b;\n\ndo you guys think these are good lens to add to my list, or should i get any other? (close to that price range, 250€-350€)\n\n&amp;#x200b;\n\nthanks in advance!\n\ncheers", "sortedWord": "None", "identifyer": 66593, "year": "2020"}, {"Unnamed: 0": 65265, "autor": "dabeliking", "date": 1583784925000, "content": "How do I ask students for their time for a few portrait or candid pictures? Any legal issues? /!/ Hello all, \n\nI work in a University where I see numerous faces all day. As a budding photographer, I would like to ask some of them for allowing me to take their candid pictures or setup a separate time slot (maybe 1/2 hour) just for taking pics.\n\nNow the problem is that I am working in a position that doesn't deal with students (administration) and cannot be going around with a camera on the campus. Maybe sometimes is fine but not regularly.\n\nI see people of different ethnicities and features that make me so want to take their pictures but just the fact that I work on campus might be bad for my career if my seniors find out I'm going around photographing students.\n\nAny suggestions around this are helpful. Of course I don't know if there will be legal issues with the University or not.\nI work in the US if it's helpful(and English is not my first language). \nThanks for your comments!", "link": "https://www.reddit.com/r/photography/comments/fg10wv/how_do_i_ask_students_for_their_time_for_a_few/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how do i ask students for their time for a few portrait or candid pictures? any legal issues? /!/ hello all, \n\ni work in a university where i see numerous faces all day. as a budding photographer, i would like to ask some of them for allowing me to take their candid pictures or setup a separate time slot (maybe 1/2 hour) just for taking pics.\n\nnow the problem is that i am working in a -----> position !!!  that doesn't deal with students (administration) and cannot be going around with a camera on the campus. maybe sometimes is fine but not regularly.\n\ni see people of different ethnicities and features that make me so want to take their pictures but just the fact that i work on campus might be bad for my career if my seniors find out i'm going around photographing students.\n\nany suggestions around this are helpful. of course i don't know if there will be legal issues with the university or not.\ni work in the us if it's helpful(and english is not my first language). \nthanks for your comments!", "sortedWord": "None", "identifyer": 66868, "year": "2020"}, {"Unnamed: 0": 65375, "autor": "Dracyskeen", "date": 1584359742000, "content": "Questions about Elinchrom BX500 RI /!/ Hello flash enthusiasts\n\n&amp;#x200B;\n\nThe company i work for has 2 Elinchrom BX500 Ri's for studio shoots and i noticed that they have a continuous bulb in the centre to assist for focus (i'm assuming thats what its for)\n\nMy question is, can i get a white light led bulb to put in the centre of the unit to work as a continuous light source for product video? \n\nIf so, does it need to be a particular bulb and does anyone have experience doing something similar? \n\nBefore anyone asks, we're not in a position to buy new led panels for video since it's pretty much going to be quick closeup clips of a bag spinning on a turntable for things like instagram stories but since we have these flashes, i thought this might be a workaround. \n\nAny ideas?", "link": "https://www.reddit.com/r/photography/comments/fjjrua/questions_about_elinchrom_bx500_ri/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "questions about elinchrom bx500 ri /!/ hello flash enthusiasts\n\n&amp;#x200b;\n\nthe company i work for has 2 elinchrom bx500 ri's for studio shoots and i noticed that they have a continuous bulb in the centre to assist for focus (i'm assuming thats what its for)\n\nmy question is, can i get a white light led bulb to put in the centre of the unit to work as a continuous light source for product video? \n\nif so, does it need to be a particular bulb and does anyone have experience doing something similar? \n\nbefore anyone asks, we're not in a -----> position !!!  to buy new led panels for video since it's pretty much going to be quick closeup clips of a bag spinning on a turntable for things like instagram stories but since we have these flashes, i thought this might be a workaround. \n\nany ideas?", "sortedWord": "None", "identifyer": 66983, "year": "2020"}, {"Unnamed: 0": 65517, "autor": "jaroslavhi", "date": 1585148235000, "content": "Female athletes in 2019 per position comes nhl jerseys cheap /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/fornyb/female_athletes_in_2019_per_position_comes_nhl/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "female athletes in 2019 per -----> position !!!  comes nhl jerseys cheap /!/ [removed]", "sortedWord": "None", "identifyer": 67129, "year": "2020"}, {"Unnamed: 0": 66579, "autor": "shian243", "date": 1579960116000, "content": "Jealousy and competition in the world of photography /!/ I thought I'll like to expand on what this thread had talked about, about being nice to other photographers :\nhttps://www.reddit.com/r/photography/comments/es7cge/be_nice_to_other_photographers_no_matter_how_bad\n\nI won't lie that I hadn't been jealous or seen other photographers as competition, but I don't think it's very suprising when your work is both an 'artform' and a 'skill' \n\nUnlike other jobs, it's pretty distinct about what jobs are skill based vs academic based job. Not only are photographers hired because of their unique work experience, but also their marketing skills, business skills etc. \n\nAn artist can afford to worry less about his or her competition, they might be the only person in a region that does a specific form of art, and wouldn't have to worry about competition cause they're the only person to do it in the area. \n\nAn artist also has a very skillset that is more about the individual artist. They could sell works that are $400k, work half a year on a single art project etc. Whereas photographers have to hustle and do shoots to cover their expenses. \n\nAnd thus bringing to my point, because photographers all use one form of art for their work, it's alot more competitive than other forms of artworks. So it's natural, given the limited categories we all have, and the nature of how it's presented in competitions, clients, that photographers often see each other as a challenge. \n\nIt's easy to see someone as competition if your livelihood depends on it. It's typically not a salaried position so each bid for a job feels like you have to do your best to clinch it, and if your area is small, there's only a number of businesses who would need photographers. Not to forget, not everyone needs photographers all the time and there are low periods. \n\nI used to get very jealous of other photographers works, fearing I might not be able to get the same level as they've managed to, or if I have do the same category, not want to tell more about my clients out of fear that they might steal em. \n\nBut I quickly realised that there isn't any point in seeing other people in such a negative way. Nothing good comes out of jealousy. If you're good at what you do, are willing to adapt to the times and give clients something unique, they'll want to keep you because of who you are as a photographer, or they know you well enough and doesn't want to risk trying out a new photographer. And having good relations with other photographers help you in the long run. If I can help another photographer, I do my best. Just remember, when they need your help, can't cover for a job, have an urgent photography issue, they'll go to you, and in return, they'll give you jobs, recommend you etc. When the time comes.", "link": "https://www.reddit.com/r/photography/comments/etqz1q/jealousy_and_competition_in_the_world_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "jealousy and competition in the world of photography /!/ i thought i'll like to expand on what this thread had talked about, about being nice to other photographers :\nhttps://www.reddit.com/r/photography/comments/es7cge/be_nice_to_other_photographers_no_matter_how_bad\n\ni won't lie that i hadn't been jealous or seen other photographers as competition, but i don't think it's very suprising when your work is both an 'artform' and a 'skill' \n\nunlike other jobs, it's pretty distinct about what jobs are skill based vs academic based job. not only are photographers hired because of their unique work experience, but also their marketing skills, business skills etc. \n\nan artist can afford to worry less about his or her competition, they might be the only person in a region that does a specific form of art, and wouldn't have to worry about competition cause they're the only person to do it in the area. \n\nan artist also has a very skillset that is more about the individual artist. they could sell works that are $400k, work half a year on a single art project etc. whereas photographers have to hustle and do shoots to cover their expenses. \n\nand thus bringing to my point, because photographers all use one form of art for their work, it's alot more competitive than other forms of artworks. so it's natural, given the limited categories we all have, and the nature of how it's presented in competitions, clients, that photographers often see each other as a challenge. \n\nit's easy to see someone as competition if your livelihood depends on it. it's typically not a salaried -----> position !!!  so each bid for a job feels like you have to do your best to clinch it, and if your area is small, there's only a number of businesses who would need photographers. not to forget, not everyone needs photographers all the time and there are low periods. \n\ni used to get very jealous of other photographers works, fearing i might not be able to get the same level as they've managed to, or if i have do the same category, not want to tell more about my clients out of fear that they might steal em. \n\nbut i quickly realised that there isn't any point in seeing other people in such a negative way. nothing good comes out of jealousy. if you're good at what you do, are willing to adapt to the times and give clients something unique, they'll want to keep you because of who you are as a photographer, or they know you well enough and doesn't want to risk trying out a new photographer. and having good relations with other photographers help you in the long run. if i can help another photographer, i do my best. just remember, when they need your help, can't cover for a job, have an urgent photography issue, they'll go to you, and in return, they'll give you jobs, recommend you etc. when the time comes.", "sortedWord": "None", "identifyer": 68224, "year": "2020"}, {"Unnamed: 0": 66687, "autor": "ChamCham474325", "date": 1580358721000, "content": "Outdoor archery tournament /!/ I plan on shooting several outdoor archery tournaments this year and YouTube isn’t pulling anything up for that specifically. Does anyone shoot these types of events and if so what have you found works best? How should I position myself relative to the shooters? I imagine for most shots I’ll try to be shooting 1/1000 for shutter speed. I’m super new and in fact have not taken an outdoor photo with my new camera yet so any advice is greatly appreciated thanks", "link": "https://www.reddit.com/r/photography/comments/evzr6m/outdoor_archery_tournament/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "outdoor archery tournament /!/ i plan on shooting several outdoor archery tournaments this year and youtube isn’t pulling anything up for that specifically. does anyone shoot these types of events and if so what have you found works best? how should i -----> position !!!  myself relative to the shooters? i imagine for most shots i’ll try to be shooting 1/1000 for shutter speed. i’m super new and in fact have not taken an outdoor photo with my new camera yet so any advice is greatly appreciated thanks", "sortedWord": "None", "identifyer": 68335, "year": "2020"}, {"Unnamed: 0": 66851, "autor": "FairCaptain7", "date": 1580625159000, "content": "How can I repeat same zoom and angle settings for product photos? /!/ I need to create product pictures for pills bottles, droppers, etc. and trying to create a repeatable workflow that would allow me to keep consistent with the shots. I can do that if shooting for a few hours, but it is more challenging when I need to repeats same type of shot a few weeks later.\n\nAny tricks/tips that you could share on how I could position the camera, the zoom setting and the product angle, distance so that I can have the same consistency. I am leaning toward using a stop motion software to capture the images and using onion skin, but wondering if anyone use some other rig or tricks for it?", "link": "https://www.reddit.com/r/photography/comments/exkd1o/how_can_i_repeat_same_zoom_and_angle_settings_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how can i repeat same zoom and angle settings for product photos? /!/ i need to create product pictures for pills bottles, droppers, etc. and trying to create a repeatable workflow that would allow me to keep consistent with the shots. i can do that if shooting for a few hours, but it is more challenging when i need to repeats same type of shot a few weeks later.\n\nany tricks/tips that you could share on how i could -----> position !!!  the camera, the zoom setting and the product angle, distance so that i can have the same consistency. i am leaning toward using a stop motion software to capture the images and using onion skin, but wondering if anyone use some other rig or tricks for it?", "sortedWord": "None", "identifyer": 68504, "year": "2020"}, {"Unnamed: 0": 66892, "autor": "Waiorua", "date": 1587875848000, "content": "Should I buy an R5 when I'm not so interested in video? /!/ I've been using a T2i for 8 years or so and am in a position to upgrade. I'd class myself as an enthusiast, not professional, and almost exclusively photograph wildlife. I want to go mirrorless, and would prefer to stick with Canon, but that's not set in stone. I'm not heavily invested in glass. I use a Tamron 100-400mm and Canon 50mm 1.4.\n\nI'm excited by the Canon R5, but it's headline stats are mostly video focussed. Is it expected to be as big a step up on stills, compared to say a Canon R? Bird eye AF would probably be very useful to me, which I don't think anyone else offers.\n\nWhat I'm most interested in is getting top notch low light handling, including autofocus, at full frame with a decent sensor size for large prints. IBIS is useful. 4k @ 120+fps is nice too. I'd like to buy a camera that I'll be happy with for the next 10 years, like I have for the last 8.\n\nAny advice? Should I wait and see what how the R5 stacks up for stills, or is the R likely to be close to as good for stills? Is Sony better value for the things I'm interested in?\n\n[Here's some of my shots.](https://manaaki.pictures)", "link": "https://www.reddit.com/r/photography/comments/g886vp/should_i_buy_an_r5_when_im_not_so_interested_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "should i buy an r5 when i'm not so interested in video? /!/ i've been using a t2i for 8 years or so and am in a -----> position !!!  to upgrade. i'd class myself as an enthusiast, not professional, and almost exclusively photograph wildlife. i want to go mirrorless, and would prefer to stick with canon, but that's not set in stone. i'm not heavily invested in glass. i use a tamron 100-400mm and canon 50mm 1.4.\n\ni'm excited by the canon r5, but it's headline stats are mostly video focussed. is it expected to be as big a step up on stills, compared to say a canon r? bird eye af would probably be very useful to me, which i don't think anyone else offers.\n\nwhat i'm most interested in is getting top notch low light handling, including autofocus, at full frame with a decent sensor size for large prints. ibis is useful. 4k @ 120+fps is nice too. i'd like to buy a camera that i'll be happy with for the next 10 years, like i have for the last 8.\n\nany advice? should i wait and see what how the r5 stacks up for stills, or is the r likely to be close to as good for stills? is sony better value for the things i'm interested in?\n\n[here's some of my shots.](https://manaaki.pictures)", "sortedWord": "None", "identifyer": 68546, "year": "2020"}, {"Unnamed: 0": 67166, "autor": "drop0dead", "date": 1588605821000, "content": "I've gone through the buyer's guide and want a professional's opinion on my purchase. /!/ I wanted to get back into photography for years and I'm finally in a position that I feel comfortable making a purchase(birthday present to myself) .  I'll mostly be using it for landscape and portraits, with a goal to eventually try making it into a career. I've decided I want a mirrorless, and I've narrowed it down to 3 different bodies. I'll be purchasing them with the kit lenses and plan on using that as my primary for a couple months. The three I'm trying to make the decision between are the sony a6400 or a6600 with the 18-135mm len, or a refurbished canon eos rp with the 24-105mm lens. I've compared all the specs and I'm leaning more towards Sony, but if the canon is better all around I'll spring for that, I do love the full size sensor. Anyone have experience with these that can help steer my decision?", "link": "https://www.reddit.com/r/photography/comments/gddjv3/ive_gone_through_the_buyers_guide_and_want_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i've gone through the buyer's guide and want a professional's opinion on my purchase. /!/ i wanted to get back into photography for years and i'm finally in a -----> position !!!  that i feel comfortable making a purchase(birthday present to myself) .  i'll mostly be using it for landscape and portraits, with a goal to eventually try making it into a career. i've decided i want a mirrorless, and i've narrowed it down to 3 different bodies. i'll be purchasing them with the kit lenses and plan on using that as my primary for a couple months. the three i'm trying to make the decision between are the sony a6400 or a6600 with the 18-135mm len, or a refurbished canon eos rp with the 24-105mm lens. i've compared all the specs and i'm leaning more towards sony, but if the canon is better all around i'll spring for that, i do love the full size sensor. anyone have experience with these that can help steer my decision?", "sortedWord": "None", "identifyer": 68831, "year": "2020"}, {"Unnamed: 0": 68299, "autor": "Masterintensity", "date": 1592861753000, "content": "Advice for first TF Photoshoot? /!/ Hello dear fellow creatives, \n\nI have recently finished a photography school that lasted 1 year. At the end of it, I still had no idea how to start my activity as a photographer.\n\n I want to shoot, at least in the beginning, portraits and fashion.\n\nI have managed to build an attractive semi - portfolio, but I don't have any experience at all with light setups, nor makeup, outfits etc. At the school everything was alredy made, I just had to take the photo. \n\nNow for the last two weeks I had the burning desire to start actually taking my first real photos, speaking to models and aspiring models on the socials (facebook groups for now) and planning the first photoshoot. I watched SO MANY VIDEOS, read SO MANY ARTICLES, that in the end my mind was exploding and I figured out I just needed to DO IT and learn from experience. \n\nSo I posted some of my photos (some of them can be found on my  [https://www.instagram.com/\\_\\_mmatthew/](https://www.instagram.com/__mmatthew/) ) and said to contact me if interested in a collaboration for a photoshoot, outdoor, in the city. I had an actually cool moodboard that has drawn attention, but I literally have no idea if I will be able to take something like that. \n\nAlso the photos of my portfolio are made with expensive equipment, but my camera is just a 12 mpx one (Fuji X10, total killer in my opinion, but still will have to make full use of the sensor and not waste a pixel of it)  that I will have to literally use beyond its limits to take something I might like.\n\nAs soon as I posted the thing, I recieved messages from models that seem to be more experienced then me. For example, they asked about the need for mua and stylist. Also some muas and stylists proposed to work with me. Do I need them? \n\nI am the kind of guy that somehow can take good photos against all odds, but this time I would like some word of advice from experienced guys. I would like to at least be able to create a good connection with the people I'll work with and produce good pictures that can be used in my portfolio and that of the model. I have huge respect for anybody that wants to collaborate with me in this first photoshoot and also I absolutely want to make it a win in every way possible.\n\nSo give me some word of advice. How was your first photoshoot, especially in collaboration, like? What  is the most important thing you would say to someone that is now in that position?\n\nI have planned to shoot outside in the urban area and give a grunge mood to the photos, also I would like the girls to look badass. Do you suggest some kinds of weather, light, place conditions?\n\nAny advice is exceptionally well accepted.", "link": "https://www.reddit.com/r/photography/comments/he1dgx/advice_for_first_tf_photoshoot/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "advice for first tf photoshoot? /!/ hello dear fellow creatives, \n\ni have recently finished a photography school that lasted 1 year. at the end of it, i still had no idea how to start my activity as a photographer.\n\n i want to shoot, at least in the beginning, portraits and fashion.\n\ni have managed to build an attractive semi - portfolio, but i don't have any experience at all with light setups, nor makeup, outfits etc. at the school everything was alredy made, i just had to take the photo. \n\nnow for the last two weeks i had the burning desire to start actually taking my first real photos, speaking to models and aspiring models on the socials (facebook groups for now) and planning the first photoshoot. i watched so many videos, read so many articles, that in the end my mind was exploding and i figured out i just needed to do it and learn from experience. \n\nso i posted some of my photos (some of them can be found on my  [https://www.instagram.com/\\_\\_mmatthew/](https://www.instagram.com/__mmatthew/) ) and said to contact me if interested in a collaboration for a photoshoot, outdoor, in the city. i had an actually cool moodboard that has drawn attention, but i literally have no idea if i will be able to take something like that. \n\nalso the photos of my portfolio are made with expensive equipment, but my camera is just a 12 mpx one (fuji x10, total killer in my opinion, but still will have to make full use of the sensor and not waste a pixel of it)  that i will have to literally use beyond its limits to take something i might like.\n\nas soon as i posted the thing, i recieved messages from models that seem to be more experienced then me. for example, they asked about the need for mua and stylist. also some muas and stylists proposed to work with me. do i need them? \n\ni am the kind of guy that somehow can take good photos against all odds, but this time i would like some word of advice from experienced guys. i would like to at least be able to create a good connection with the people i'll work with and produce good pictures that can be used in my portfolio and that of the model. i have huge respect for anybody that wants to collaborate with me in this first photoshoot and also i absolutely want to make it a win in every way possible.\n\nso give me some word of advice. how was your first photoshoot, especially in collaboration, like? what  is the most important thing you would say to someone that is now in that -----> position !!! ?\n\ni have planned to shoot outside in the urban area and give a grunge mood to the photos, also i would like the girls to look badass. do you suggest some kinds of weather, light, place conditions?\n\nany advice is exceptionally well accepted.", "sortedWord": "None", "identifyer": 69993, "year": "2020"}, {"Unnamed: 0": 68400, "autor": "Throwaway4206969", "date": 1593132856000, "content": "$1500 dollars for SIX WEEKS of full time photography work? /!/ I applied for a summer job at a camp in upstate NY, and I was offered the position.\n\nI asked about compensation, and they said for 6 weeks of full time 8-4pm work, they'll give me 1500 dollars.\n\nThat is 6.25 an hour, half of the NYS minimum wage.\n\nThis is insane, right? Do a lot of places pay this poorly for photography work?\n\nI'm an engineering student, so it doesn't really matter to me if I take the job or not, but wow. I first thought it was illegal, but it apparently doesn't break minimum wage laws because I'd be a contractor.\n\nI guess my question is, is this a common thing? To offer \"Contract work\" and pay ridiculously low?\n\nI love photography and only do it as a hobby, so I'm not sure what the normal pay rate should be, but man, it really threw me for a loop when she told me.\n\nI just wanted a cool summer job :'(", "link": "https://www.reddit.com/r/photography/comments/hfxyc3/1500_dollars_for_six_weeks_of_full_time/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "$1500 dollars for six weeks of full time photography work? /!/ i applied for a summer job at a camp in upstate ny, and i was offered the -----> position !!! .\n\ni asked about compensation, and they said for 6 weeks of full time 8-4pm work, they'll give me 1500 dollars.\n\nthat is 6.25 an hour, half of the nys minimum wage.\n\nthis is insane, right? do a lot of places pay this poorly for photography work?\n\ni'm an engineering student, so it doesn't really matter to me if i take the job or not, but wow. i first thought it was illegal, but it apparently doesn't break minimum wage laws because i'd be a contractor.\n\ni guess my question is, is this a common thing? to offer \"contract work\" and pay ridiculously low?\n\ni love photography and only do it as a hobby, so i'm not sure what the normal pay rate should be, but man, it really threw me for a loop when she told me.\n\ni just wanted a cool summer job :'(", "sortedWord": "None", "identifyer": 70098, "year": "2020"}, {"Unnamed: 0": 68662, "autor": "PowerlineTyler", "date": 1594525242000, "content": "Rolling shutter effect, same bird, different wing position", "link": "https://www.reddit.com/r/photography/comments/hpnsnt/rolling_shutter_effect_same_bird_different_wing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "rolling shutter effect, same bird, different wing -----> position !!! ", "sortedWord": "None", "identifyer": 70362, "year": "2020"}, {"Unnamed: 0": 69040, "autor": "YoungSuavo", "date": 1594125930000, "content": "Help me figure out how to get this effect /!/ So I’m hoping photography + filming are the same here when it comes to this specific technique. \n\n(might be NSFW, involves cannabis concentrate)\n\n[This is what I’ve been trying to mimic](https://www.instagram.com/p/CBoPRM3HwDR/?igshid=aygnt3wzthm7)\n\nHow do I get the background to be completely black? where is the lighting positioned? I have led lamps that I currently use for lighting. Want to improve the quality of the melt shots I’m taking.", "link": "https://www.reddit.com/r/photography/comments/hmtvfo/help_me_figure_out_how_to_get_this_effect/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "help me figure out how to get this effect /!/ so i’m hoping photography + filming are the same here when it comes to this specific technique. \n\n(might be nsfw, involves cannabis concentrate)\n\n[this is what i’ve been trying to mimic](https://www.instagram.com/p/cboprm3hwdr/?igshid=aygnt3wzthm7)\n\nhow do i get the background to be completely black? where is the lighting -----> positioned !!! ? i have led lamps that i currently use for lighting. want to improve the quality of the melt shots i’m taking.", "sortedWord": "None", "identifyer": 70758, "year": "2020"}, {"Unnamed: 0": 69473, "autor": "tangomango737", "date": 1599156052000, "content": "D700 mirror stuck. Help! /!/ I acquired a used d700, very little signs of physical wear, and sub 10k shutter count. It was handed over with a known fault from someone who hadn't the time, nor inclination to fix it.\nBasically the mirror is stuck in the \"up\" position. An \"err\" message displays on the lcd screen, which clears after pushing the DOF preview button. This obviously renders the viewfinder completely black, as zero light is passing through the prism, as the mirror is in the opposite position to how it should be.\nOn removing the lens and pressing the shutter button, the mirror flips down and back up again, and exposes the shutter as it should. But it flips back to the \"up\" position every time. \nI've made some enquiries with local repair shops, and am awaiting replies. Has anyone out there experienced anything similar, or have any idea if a diy fix is possible?\nThanks for reading!\n\nTl;dr:\n dslr mirror stuck in the up position. Request help to fix.", "link": "https://www.reddit.com/r/photography/comments/ilylyj/d700_mirror_stuck_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "d700 mirror stuck. help! /!/ i acquired a used d700, very little signs of physical wear, and sub 10k shutter count. it was handed over with a known fault from someone who hadn't the time, nor inclination to fix it.\nbasically the mirror is stuck in the \"up\" -----> position !!! . an \"err\" message displays on the lcd screen, which clears after pushing the dof preview button. this obviously renders the viewfinder completely black, as zero light is passing through the prism, as the mirror is in the opposite position to how it should be.\non removing the lens and pressing the shutter button, the mirror flips down and back up again, and exposes the shutter as it should. but it flips back to the \"up\" position every time. \ni've made some enquiries with local repair shops, and am awaiting replies. has anyone out there experienced anything similar, or have any idea if a diy fix is possible?\nthanks for reading!\n\ntl;dr:\n dslr mirror stuck in the up position. request help to fix.", "sortedWord": "None", "identifyer": 71202, "year": "2020"}, {"Unnamed: 0": 69781, "autor": "Ooker777", "date": 1599533701000, "content": "What are efficient ways to locate images that fit a description? /!/  \n\nI am looking for images to illustrate an idea (or photographers that  may produce image like that). I imagine the image would be a person  giving us an impression that they are **observing us carefully**.  Their look would be direct at us. However it doesn't feel like they are  about to do any harm. Just a neutral observation on us. Some people may  feel it's cold or detached.\n\nI find [this image in Unsplash](https://images.unsplash.com/photo-1516496020833-94df152243ae?ixlib=rb-1.2.1&amp;q=80&amp;fm=jpg&amp;crop=entropy&amp;cs=tinysrgb&amp;dl=sergei-gavrilov-azRT6wDcLqM-unsplash.jpg)  that really fits, but lying may not best describe the feeling of being  observed carefully. I'm looking for other position, perhaps sitting or  standing.", "link": "https://www.reddit.com/r/photography/comments/iolt44/what_are_efficient_ways_to_locate_images_that_fit/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what are efficient ways to locate images that fit a description? /!/  \n\ni am looking for images to illustrate an idea (or photographers that  may produce image like that). i imagine the image would be a person  giving us an impression that they are **observing us carefully**.  their look would be direct at us. however it doesn't feel like they are  about to do any harm. just a neutral observation on us. some people may  feel it's cold or detached.\n\ni find [this image in unsplash](https://images.unsplash.com/photo-1516496020833-94df152243ae?ixlib=rb-1.2.1&amp;q=80&amp;fm=jpg&amp;crop=entropy&amp;cs=tinysrgb&amp;dl=sergei-gavrilov-azrt6wdclqm-unsplash.jpg)  that really fits, but lying may not best describe the feeling of being  observed carefully. i'm looking for other -----> position !!! , perhaps sitting or  standing.", "sortedWord": "None", "identifyer": 71523, "year": "2020"}, {"Unnamed: 0": 70587, "autor": "andrewburgess21", "date": 1602267119000, "content": "Aligning photos for time lapse? /!/ I’ve been taking photos every day of the leaves changing. I have a tripod out the window and have been doing everything I can to align them as shot. However, there’s about 1-3% in position variation that I can’t fix. \n\nCan anyone recommend a software that can perfect align photos? Something like how Siril or StarStax’s software works, but just for alignment.", "link": "https://www.reddit.com/r/photography/comments/j8453f/aligning_photos_for_time_lapse/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "aligning photos for time lapse? /!/ i’ve been taking photos every day of the leaves changing. i have a tripod out the window and have been doing everything i can to align them as shot. however, there’s about 1-3% in -----> position !!!  variation that i can’t fix. \n\ncan anyone recommend a software that can perfect align photos? something like how siril or starstax’s software works, but just for alignment.", "sortedWord": "None", "identifyer": 72355, "year": "2020"}, {"Unnamed: 0": 70759, "autor": "fsas98", "date": 1606442975000, "content": "Advice on a new camera? /!/ So I’ve been taking pictures as a hobby for about 4-5 years now and I used to own a Canon SL2 before a former friend of mine stole and pawned it off and I wasn’t in a position to afford a replacement camera/lens (thanks covid). Well I am now in a position to be able to afford another camera and I was wondering if anyone has either good/bad things to say about the Canon EOS 90D or SL3? Or if either of those 2 bodies are even worth the upgrade vs just getting another SL2. Appreciate any and all info🙏🏻", "link": "https://www.reddit.com/r/photography/comments/k1sbtb/advice_on_a_new_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "advice on a new camera? /!/ so i’ve been taking pictures as a hobby for about 4-5 years now and i used to own a canon sl2 before a former friend of mine stole and pawned it off and i wasn’t in a -----> position !!!  to afford a replacement camera/lens (thanks covid). well i am now in a position to be able to afford another camera and i was wondering if anyone has either good/bad things to say about the canon eos 90d or sl3? or if either of those 2 bodies are even worth the upgrade vs just getting another sl2. appreciate any and all info🙏🏻", "sortedWord": "None", "identifyer": 72530, "year": "2020"}, {"Unnamed: 0": 70975, "autor": "[deleted]", "date": 1607152482000, "content": "LPT: most camera phones work with most binoculars if positioned/focused just right /!/ [deleted]", "link": "https://www.reddit.com/r/photography/comments/k7360a/lpt_most_camera_phones_work_with_most_binoculars/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "lpt: most camera phones work with most binoculars if -----> positioned !!! /focused just right /!/ [deleted]", "sortedWord": "None", "identifyer": 72752, "year": "2020"}, {"Unnamed: 0": 71839, "autor": "dokinvan", "date": 1604254225000, "content": "How do I blend these two photos to have a clear moon with the buildings? I tried on photoshop but it looked very unrealistic. Both photos taken seconds apart, in same position.", "link": "https://www.reddit.com/r/photography/comments/jm6w3v/how_do_i_blend_these_two_photos_to_have_a_clear/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how do i blend these two photos to have a clear moon with the buildings? i tried on photoshop but it looked very unrealistic. both photos taken seconds apart, in same -----> position !!! .", "sortedWord": "None", "identifyer": 73650, "year": "2020"}, {"Unnamed: 0": 72950, "autor": "Jove_Bishop", "date": 1582211042000, "content": "Product Photography Portfolio Questions /!/ Greetings, hope all of you are doing awesome.\nI’m very interested in product photography but I wonder what are the best ways to create a portfolio from scratch if you’re just starting with this subject. \nI’m wondering if I can I use actual products purchased at a store or should I only include products that are not recognizable / generic or specifically allowed to use by manufacturer/distributor.\nI guess this is more of a legal / moral issue but figured I’ll ask here as maybe some of you were/are in this position.\n\nWishing you all sharp images and beautiful compositions. \nCheers.", "link": "https://www.reddit.com/r/photography/comments/f6ub3c/product_photography_portfolio_questions/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "product photography portfolio questions /!/ greetings, hope all of you are doing awesome.\ni’m very interested in product photography but i wonder what are the best ways to create a portfolio from scratch if you’re just starting with this subject. \ni’m wondering if i can i use actual products purchased at a store or should i only include products that are not recognizable / generic or specifically allowed to use by manufacturer/distributor.\ni guess this is more of a legal / moral issue but figured i’ll ask here as maybe some of you were/are in this -----> position !!! .\n\nwishing you all sharp images and beautiful compositions. \ncheers.", "sortedWord": "None", "identifyer": 74813, "year": "2020"}, {"Unnamed: 0": 73003, "autor": "Jonas2295", "date": 1582142736000, "content": "Photographing watches consistently for product pages /!/ I am trying to figure out what kind of technique/workflow and gear would be necessary to shoot watches in consistently the same position and framing so that they can be used on product pages with every watch looking the same in regards to lighting and look.\n\nHere’s a reference as to what I mean:\nhttps://www.adidaswatches.com/hu/en/district_m1/Z04.html?dwvar_Z04_size=00&amp;dwvar_Z04_color=3033\n\nIs it as simple as getting a photo tent and a macro lens?", "link": "https://www.reddit.com/r/photography/comments/f6gheb/photographing_watches_consistently_for_product/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "photographing watches consistently for product pages /!/ i am trying to figure out what kind of technique/workflow and gear would be necessary to shoot watches in consistently the same -----> position !!!  and framing so that they can be used on product pages with every watch looking the same in regards to lighting and look.\n\nhere’s a reference as to what i mean:\nhttps://www.adidaswatches.com/hu/en/district_m1/z04.html?dwvar_z04_size=00&amp;dwvar_z04_color=3033\n\nis it as simple as getting a photo tent and a macro lens?", "sortedWord": "None", "identifyer": 74866, "year": "2020"}, {"Unnamed: 0": 73122, "autor": "Weekly-Pressure", "date": 1582509749000, "content": "How to pose with a long face /!/ Not sure if this is the right sub to post but idk where else I'd ask.\n\nI'm a guy with quite a slender, long face. My chin/jaw is quite large but not super wide so my face always looks really long in photos. Is there a particular position I should put my face in relative to the camera to offset this a little bit? Should the camera be at a certain height relative to me? \n\nAny tips? Thank you", "link": "https://www.reddit.com/r/photography/comments/f8jyde/how_to_pose_with_a_long_face/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how to pose with a long face /!/ not sure if this is the right sub to post but idk where else i'd ask.\n\ni'm a guy with quite a slender, long face. my chin/jaw is quite large but not super wide so my face always looks really long in photos. is there a particular -----> position !!!  i should put my face in relative to the camera to offset this a little bit? should the camera be at a certain height relative to me? \n\nany tips? thank you", "sortedWord": "None", "identifyer": 74991, "year": "2020"}, {"Unnamed: 0": 73387, "autor": "rohanahuja", "date": 1582949068000, "content": "If you position a camera that has rolling shutter so that its vertical axis is parallel to guitar strings and set it to an extremely high shutter speed, you get this weird illusion that the strings are gently warping/undulating.", "link": "https://www.reddit.com/r/photography/comments/fb708t/if_you_position_a_camera_that_has_rolling_shutter/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "if you -----> position !!!  a camera that has rolling shutter so that its vertical axis is parallel to guitar strings and set it to an extremely high shutter speed, you get this weird illusion that the strings are gently warping/undulating.", "sortedWord": "None", "identifyer": 75266, "year": "2020"}, {"Unnamed: 0": 73572, "autor": "i_like_photos", "date": 1583582456000, "content": "Nikon z6 sticky AF joystick issue? Anyone else? /!/ Any fellow z6 shooters experience a sticky or laggy AF joystick after a burst of shots?\n\n\nDuring my last shoot (and maybe a few earlier ones too), there were a few instances where it seemed that the AF joystick on my z6 was briefly unresponsive. Physically/mechanically, the joystick is fine. But it seemed that the focus point was sticking and that I had to tap multiple times on the joystick to get the focus point to “budge”. \n\n\nSo I tried an experiment today. \n\n\nSetup:\nMy camera Focus Mode was AF-S, and the AF Area Mode was Single-Point AF. I was using the native z-mount 50mm f/1.8s lens. (The same AF modes and lens as I was using in the most recent shoot). Also, the camera had a Nikon made EN-EL15b battery in it.\n\n\nI chose two objects separated by a set number of “moves” (the number of taps on the joystick to get from one object to the other). The left-hand object was my laptop on my desk. The right-hand object was a floor lamp, just to the right of my desk. From a fixed camera position ~10 feet away, I framed a shot containing both the laptop and the lamp. If I placed the focus point over the laptop (my left hand object), I needed 8 right taps of the joystick to reach the floor lamp (my right hand object). \n\n\nHere’s what I observed:\n- If I point my camera at the laptop, lock focus (I use the AF-ON button), and click the shutter **one time** and then, immediately after, use the joystick to move my focus point, it works normally, and I can reach the floor lamp in 8 moves. \n- If I point my camera at the laptop, lock focus, and click the shutter **multiple times** (or do a short burst in Continuous \"H\" Release Mode), and then, immediately after, use the joystick to move my focus point, the focus point briefly sticks, and I have to tap right on the joystick one or two times first to get it to “budge”, and then it works normally from there. This means it now takes 9 or 10 taps on the joystick to reach the floor lamp instead of 8. (A note: I typically use Single Frame Release Mode, but in this mode I sometimes click fast enough that I might be manually doing 2 or 3 FPS, which apparently is fast enough to cause this sticky joystick issue.)\n\n\nI can get around this problem by just pausing for a moment after a burst of shots before moving my focus point, but that’s not a solution and it slows me down. This might not seem like a big deal, but in situations where my model is constantly moving and I’m following her movements with the AF point while clicking multiple shots, all those extra taps make the joystick feel unresponsive.\n\n\nI can't help but wonder if this is actually \"normal\" behavior. During a burst of shots, the camera's focus point is locked (in both AF-S and AF-C). Could it be that doing a burst of shots locks me out of the joystick both during and for just a moment **after** the burst is over, so that when I tap the joystick right after the burst, the lockout is still active and that's why my focus point sticks??\n\n\nI’m on firmware 3.0, but I think I was experiencing this issue before I updated. In past shoots, I thought I was just fumbling over the joystick and that’s why I was sometimes slow when moving it around (I was accustomed to using a Nikon d750 with a directional pad). But as I have picked up the pace recently and I’ve been shooting a lot more, I started to notice this issue more often, which led me do this little experiment. \n\n\nAre there any other Nikon z6 users in here experiencing this?\n\n\nI’m sending this description to Nikon but I thought I’d try it out here as well and see if anyone has any insights.", "link": "https://www.reddit.com/r/photography/comments/feu8un/nikon_z6_sticky_af_joystick_issue_anyone_else/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon z6 sticky af joystick issue? anyone else? /!/ any fellow z6 shooters experience a sticky or laggy af joystick after a burst of shots?\n\n\nduring my last shoot (and maybe a few earlier ones too), there were a few instances where it seemed that the af joystick on my z6 was briefly unresponsive. physically/mechanically, the joystick is fine. but it seemed that the focus point was sticking and that i had to tap multiple times on the joystick to get the focus point to “budge”. \n\n\nso i tried an experiment today. \n\n\nsetup:\nmy camera focus mode was af-s, and the af area mode was single-point af. i was using the native z-mount 50mm f/1.8s lens. (the same af modes and lens as i was using in the most recent shoot). also, the camera had a nikon made en-el15b battery in it.\n\n\ni chose two objects separated by a set number of “moves” (the number of taps on the joystick to get from one object to the other). the left-hand object was my laptop on my desk. the right-hand object was a floor lamp, just to the right of my desk. from a fixed camera -----> position !!!  ~10 feet away, i framed a shot containing both the laptop and the lamp. if i placed the focus point over the laptop (my left hand object), i needed 8 right taps of the joystick to reach the floor lamp (my right hand object). \n\n\nhere’s what i observed:\n- if i point my camera at the laptop, lock focus (i use the af-on button), and click the shutter **one time** and then, immediately after, use the joystick to move my focus point, it works normally, and i can reach the floor lamp in 8 moves. \n- if i point my camera at the laptop, lock focus, and click the shutter **multiple times** (or do a short burst in continuous \"h\" release mode), and then, immediately after, use the joystick to move my focus point, the focus point briefly sticks, and i have to tap right on the joystick one or two times first to get it to “budge”, and then it works normally from there. this means it now takes 9 or 10 taps on the joystick to reach the floor lamp instead of 8. (a note: i typically use single frame release mode, but in this mode i sometimes click fast enough that i might be manually doing 2 or 3 fps, which apparently is fast enough to cause this sticky joystick issue.)\n\n\ni can get around this problem by just pausing for a moment after a burst of shots before moving my focus point, but that’s not a solution and it slows me down. this might not seem like a big deal, but in situations where my model is constantly moving and i’m following her movements with the af point while clicking multiple shots, all those extra taps make the joystick feel unresponsive.\n\n\ni can't help but wonder if this is actually \"normal\" behavior. during a burst of shots, the camera's focus point is locked (in both af-s and af-c). could it be that doing a burst of shots locks me out of the joystick both during and for just a moment **after** the burst is over, so that when i tap the joystick right after the burst, the lockout is still active and that's why my focus point sticks??\n\n\ni’m on firmware 3.0, but i think i was experiencing this issue before i updated. in past shoots, i thought i was just fumbling over the joystick and that’s why i was sometimes slow when moving it around (i was accustomed to using a nikon d750 with a directional pad). but as i have picked up the pace recently and i’ve been shooting a lot more, i started to notice this issue more often, which led me do this little experiment. \n\n\nare there any other nikon z6 users in here experiencing this?\n\n\ni’m sending this description to nikon but i thought i’d try it out here as well and see if anyone has any insights.", "sortedWord": "None", "identifyer": 75455, "year": "2020"}, {"Unnamed: 0": 73680, "autor": "infocalypse", "date": 1583692660000, "content": "Image Invoicing for Noobs /!/ A rep from a media company has reached out to me with interest in using a photo of mine. After a pleasant and open conversation via email, they've asked for a proper invoice (and a better quality file, of course) so they can move forward on this project for their client.\n\nWell. Okay then. I'm just some guy. I understand *in principle* the idea of allowing someone restricted usage to an image in exchange for compensation, it's just never occurred to me I might be in a position to be doing it.\n\nExamples I've found on the internet (admittedly limited searching) have been more of a Photographer/Client sort of template, not a Rights-Holder/Media sort of template.\n\nSo! Please! Some advice. Where might I find a good template that would fairly and professionally allow me to invoice these folks in a manner that makes it clear this exchange is for limited use (the scope of this campaign) and people need to come back to the table if the image needs to be used again for something else.\n\nWhich has already been discussed via email, of course, virtual-handshake and all that, but just as they're going to the effort to properly secure usage, I want to meet them half way with a fair and professional invoice.\n\n(No one's getting rich off this, it's the principle of the thing).\n\nAdvice please!", "link": "https://www.reddit.com/r/photography/comments/ffgt25/image_invoicing_for_noobs/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "image invoicing for noobs /!/ a rep from a media company has reached out to me with interest in using a photo of mine. after a pleasant and open conversation via email, they've asked for a proper invoice (and a better quality file, of course) so they can move forward on this project for their client.\n\nwell. okay then. i'm just some guy. i understand *in principle* the idea of allowing someone restricted usage to an image in exchange for compensation, it's just never occurred to me i might be in a -----> position !!!  to be doing it.\n\nexamples i've found on the internet (admittedly limited searching) have been more of a photographer/client sort of template, not a rights-holder/media sort of template.\n\nso! please! some advice. where might i find a good template that would fairly and professionally allow me to invoice these folks in a manner that makes it clear this exchange is for limited use (the scope of this campaign) and people need to come back to the table if the image needs to be used again for something else.\n\nwhich has already been discussed via email, of course, virtual-handshake and all that, but just as they're going to the effort to properly secure usage, i want to meet them half way with a fair and professional invoice.\n\n(no one's getting rich off this, it's the principle of the thing).\n\nadvice please!", "sortedWord": "None", "identifyer": 75568, "year": "2020"}, {"Unnamed: 0": 73814, "autor": "Woollbert_Esq", "date": 1584523656000, "content": "Let's try and help out the freelancers a little - print sales /!/ During these uncertain times freelancers are obviously going to be hit hard.  I am in the lucky position to be a hobbyist photographer whose main income is unlikely to be impacted by the virus.\n\nI thought a good way to help out could be to have a list of photographers (preferably those whose income relies on the trade) who are currently offering print sales to give a bit of a signal boost at this time.\n\nI for one would love to purchase a few prints, gain some great art for my walls and help out some people who maybe facing tough times in the coming months.\n\nI would suggest replying with the following layout, or something similar:\n\nName:\nCountry:\nArea of Photography:\nLink to Prints:\nSocial Media:\n\nMods - hopefully this is okay?!", "link": "https://www.reddit.com/r/photography/comments/fkmtg0/lets_try_and_help_out_the_freelancers_a_little/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "let's try and help out the freelancers a little - print sales /!/ during these uncertain times freelancers are obviously going to be hit hard.  i am in the lucky -----> position !!!  to be a hobbyist photographer whose main income is unlikely to be impacted by the virus.\n\ni thought a good way to help out could be to have a list of photographers (preferably those whose income relies on the trade) who are currently offering print sales to give a bit of a signal boost at this time.\n\ni for one would love to purchase a few prints, gain some great art for my walls and help out some people who maybe facing tough times in the coming months.\n\ni would suggest replying with the following layout, or something similar:\n\nname:\ncountry:\narea of photography:\nlink to prints:\nsocial media:\n\nmods - hopefully this is okay?!", "sortedWord": "None", "identifyer": 75707, "year": "2020"}, {"Unnamed: 0": 74588, "autor": "GoingGeertWilders", "date": 1586182607000, "content": "How can I start to get more gigs after this is all over? /!/ Before coronavirus hit, I was working regularly as a freelance reporter and photojournalist with most of my work being documentary-type shots, news coverage, or editorial-style shots for a series of weekly business profiles I write. Right before covid I was starting to prepare to expand the photo side of my business, hoping to take on more photo-focused documentary projects, more editorial work, and I've even been thinking about trying to get into wedding photography. Then coronavirus hit, and now I stay inside and take pictures of....my cat, my balcony, my drinking habits, and some self-portraiture. (We're in Canada, where there's not much going on at all in the same way that there's lots happening in the US for PJs to cover. Plus my partner has existing health concerns, so I'm staying inside for her sake.) \n\nI talked to another photographer who reasoned that it was an ok time to have some downtime, and that there would be a glut of work for photographers once the economy starts to go back to normal. (Maybe this is wrong, but for the sake of argument let's say it's not.) What should I be doing *now* to try to position myself to start picking up smaller gigs, position myself as less of a journalism-only shooter and someone who could be getting other gigs, especially those where a documentary style is marketable?   \n\n\nSo far, I've been updating my website with recent work, building PDF portfolios to send to prospective clients, working on more formal shooting setups (admittedly, doing this through self-portraits and pet shots, but working with what I can do inside!), and thinking about planning some personal projects. Where I'm stuck is in turning that into more business once this is all over — my question is, **as I do all this planning and preparing, what's the next step I should be taking either now or when everything starts to open back up again?**", "link": "https://www.reddit.com/r/photography/comments/fvzi8z/how_can_i_start_to_get_more_gigs_after_this_is/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how can i start to get more gigs after this is all over? /!/ before coronavirus hit, i was working regularly as a freelance reporter and photojournalist with most of my work being documentary-type shots, news coverage, or editorial-style shots for a series of weekly business profiles i write. right before covid i was starting to prepare to expand the photo side of my business, hoping to take on more photo-focused documentary projects, more editorial work, and i've even been thinking about trying to get into wedding photography. then coronavirus hit, and now i stay inside and take pictures of....my cat, my balcony, my drinking habits, and some self-portraiture. (we're in canada, where there's not much going on at all in the same way that there's lots happening in the us for pjs to cover. plus my partner has existing health concerns, so i'm staying inside for her sake.) \n\ni talked to another photographer who reasoned that it was an ok time to have some downtime, and that there would be a glut of work for photographers once the economy starts to go back to normal. (maybe this is wrong, but for the sake of argument let's say it's not.) what should i be doing *now* to try to -----> position !!!  myself to start picking up smaller gigs, -----> position !!!  myself as less of a journalism-only shooter and someone who could be getting other gigs, especially those where a documentary style is marketable?   \n\n\nso far, i've been updating my website with recent work, building pdf portfolios to send to prospective clients, working on more formal shooting setups (admittedly, doing this through self-portraits and pet shots, but working with what i can do inside!), and thinking about planning some personal projects. where i'm stuck is in turning that into more business once this is all over — my question is, **as i do all this planning and preparing, what's the next step i should be taking either now or when everything starts to open back up again?**", "sortedWord": "None", "identifyer": 76502, "year": "2020"}, {"Unnamed: 0": 75483, "autor": "vvmonika", "date": 1578884211000, "content": "Sketch Generators For Someone With Terrible Drawings /!/ Are there tools on the net that can be used as sketch generators (for photographers)? Easy-to-use modelling, collating, etc? Something like being able to create an avatar/character and change their pose/position within a background or scene? I draw out my ideas the best I can, but quite honestly...they’re rubbish! There are many times when I look back on my sketches and have no clue what I was going for without extensive notes on the side haha. Just curious! \n\n\n*My tidbit of info I can share with you:\nlightingdiagrams.com is handy for a rough showcase of your lighting set-ups to include in your preproduction books!", "link": "https://www.reddit.com/r/photography/comments/eny3hr/sketch_generators_for_someone_with_terrible/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sketch generators for someone with terrible drawings /!/ are there tools on the net that can be used as sketch generators (for photographers)? easy-to-use modelling, collating, etc? something like being able to create an avatar/character and change their pose/-----> position !!!  within a background or scene? i draw out my ideas the best i can, but quite honestly...they’re rubbish! there are many times when i look back on my sketches and have no clue what i was going for without extensive notes on the side haha. just curious! \n\n\n*my tidbit of info i can share with you:\nlightingdiagrams.com is handy for a rough showcase of your lighting set-ups to include in your preproduction books!", "sortedWord": "None", "identifyer": 77427, "year": "2020"}, {"Unnamed: 0": 75703, "autor": "marchface", "date": 1579370353000, "content": "Upgrade just lenses or lenses and camera? All advice is welcome (kinda lengthy). /!/ So, I got into photography several years ago with a Canon Rebel SL1. Shortly thereafter, I upgraded to a Canon 70D using a Canon 50mm 1.8 and a Tamron 28-75 2.8. For the most part, I've been into photography as a hobbyist and I've been shooting all kinds of subjects. One type of photography I've become more and more drawn to is portrait photography, specifically of kids and families. I've conducted quite a few sessions mostly for people I know at no charge. Honestly, I've had good results with my kit, but I know it's not the greatest kit, mostly because of my cheap lenses, and I know I could be achieving higher quality results more consistently. I know I need to make an upgrade, especially because I want to start ramping up my portrait photography work and if I'm charging people money, I want to make sure I'm delivering the best possible results. Regardless of how much I upgrade, I will be purchasing a new lens or two for sure. What I'm struggling with is if I should also upgrade my camera. \n\nThe more reading I do on full-frames, the more I come to realize how well they seem to suit my needs. I'll likely want to upgrade in the future. So, the question is, do I simply focus on upgrading my lenses now or bite the bullet and go for a full-frame as well? I don't have a ton of money to work with. If I buy a full-frame, depending on the price, I'd likely only purchase one lens. My budget overall is about $2,000, give or take. So, obviously I wouldn't be going for a top-of-the-line full-frame and I'd likely be looking at used gear. I know lenses could really upgrade the quality of my images, but part of me wonders what the sense is in waiting. If I do wait, I could be in a better financial position down the line to purchase a better full-frame. But if I only purchase lenses now, do I purchase full-frame lenses since those can be used on a crop-sensor? I can always sell my stuff in the future to purchase new lenses to go with my new full-frame.\n\nAh! Going nuts. Any advice is appreciated, even if you have recommendations on gear best suited for portrait photography. I'm basing what I need around my work with kids because it presents the most challenge for me. It's often candid-style and I often rely on natural light because using a flash in these situations has proved impractical. Thanks in advance!", "link": "https://www.reddit.com/r/photography/comments/eqjr0k/upgrade_just_lenses_or_lenses_and_camera_all/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "upgrade just lenses or lenses and camera? all advice is welcome (kinda lengthy). /!/ so, i got into photography several years ago with a canon rebel sl1. shortly thereafter, i upgraded to a canon 70d using a canon 50mm 1.8 and a tamron 28-75 2.8. for the most part, i've been into photography as a hobbyist and i've been shooting all kinds of subjects. one type of photography i've become more and more drawn to is portrait photography, specifically of kids and families. i've conducted quite a few sessions mostly for people i know at no charge. honestly, i've had good results with my kit, but i know it's not the greatest kit, mostly because of my cheap lenses, and i know i could be achieving higher quality results more consistently. i know i need to make an upgrade, especially because i want to start ramping up my portrait photography work and if i'm charging people money, i want to make sure i'm delivering the best possible results. regardless of how much i upgrade, i will be purchasing a new lens or two for sure. what i'm struggling with is if i should also upgrade my camera. \n\nthe more reading i do on full-frames, the more i come to realize how well they seem to suit my needs. i'll likely want to upgrade in the future. so, the question is, do i simply focus on upgrading my lenses now or bite the bullet and go for a full-frame as well? i don't have a ton of money to work with. if i buy a full-frame, depending on the price, i'd likely only purchase one lens. my budget overall is about $2,000, give or take. so, obviously i wouldn't be going for a top-of-the-line full-frame and i'd likely be looking at used gear. i know lenses could really upgrade the quality of my images, but part of me wonders what the sense is in waiting. if i do wait, i could be in a better financial -----> position !!!  down the line to purchase a better full-frame. but if i only purchase lenses now, do i purchase full-frame lenses since those can be used on a crop-sensor? i can always sell my stuff in the future to purchase new lenses to go with my new full-frame.\n\nah! going nuts. any advice is appreciated, even if you have recommendations on gear best suited for portrait photography. i'm basing what i need around my work with kids because it presents the most challenge for me. it's often candid-style and i often rely on natural light because using a flash in these situations has proved impractical. thanks in advance!", "sortedWord": "None", "identifyer": 77654, "year": "2020"}, {"Unnamed: 0": 75896, "autor": "im_in_the_box", "date": 1580112867000, "content": "Andrew D Bernstein interview with Kobe Bryant. /!/ Like many others today, I was mourning the passing of Kobe Bryant. I decided to look up some of his past interviews and came across one he did with [Andrew D Bernstein](https://en.wikipedia.org/wiki/Andrew_D._Bernstein), a legend in his own right in terms of basketball photography. Andrew and Kobe had a close relationship spanning back to Kobe's first day's in the NBA. During the interview, Kobe discusses analyzing photo's Andrew had taken to improve his technique as an athlete, and also what he believes one has to do in order to become a \"great\" in their field. I transcribed what I thought were the relevant parts to this subreddit in case you can't listen, but I did paraphrase a bit because of how dense Kobe's responses were. I tried my best to find the photo that they were discussing, but the closest thing I could find to what Kobe described was [this photo.](https://clutchpoints.com/wp-content/uploads/2018/02/130213172659-michael-jordan-0013044212-single-image-cut.jpg)\n\n**On still photography in sports**\n\n&gt; ANDREW: You and I met, it was media day 1996, rookie year fresh faced 18 year old, right? I came up and introduced myself and you said “I know who you are!”\n&gt; \n&gt; KOBE: Absolutely I know who you were! Yes.\n&gt; \n&gt; ANDREW: That blew me away because we had never met before.\n&gt; \n&gt; KOBE: Well, you’ve taken every iconic picture….poster… that I had on my wall. I was very very familiar with who you are, because all of the iconic shot that I studied were taken by you.\n&gt; \n&gt; ANDREW: That just blew me away, honestly. When we got to the book, you talked about how you studied my pictures as a kid, right? So, can you remember something specific like a Jordan poster?\n&gt; \n&gt; KOBE: Yea, I think it was a Jordan boxout. I was looking at his foot position and where his elbow was in the midsection of a player. He’s using his legs to back the player out. Everything else was unconventional. I remember looking at that and going “Okay, that is not how they teach me to boxout.” I remember thinking maybe that’s why I was having trouble boxing out bigger and older opponents. I have to actually use my elbows to lock the player in and shield them off. I could tell his arms were flexing. He wasn’t just resting his arms, there was an action and a purpose.\n&gt; \n&gt; ANDREW: How old were you?\n&gt; \n&gt; KOBE: Twelve.\n&gt; \n&gt; ANDREW: Twleve. [Laughs] And a photo spoke to you like that?\n&gt; \n&gt; KOBE: Well, yea. I can watch and analyze and critique. Still photos, you can learn a lot more than you can from moving pictures. Things move so fast. ***With a still image you actually have time to look in the moment***, and look at what was working for the offensive player or not or what was working for the defensive player or not.\n&gt; \n&gt; ANDREW: I have to tell you, that’s the first time I ever heard that from any athlete that I’ve ever worked with, that they actually used my photos to up their game [Laughs].\n&gt; \n&gt; KOBE: ***If you think about it, it makes complete sense. You can sit there and watch footage from a broadcast… photos are also part of that. They should be learned and studied.*** \n&gt; \n&gt; ANDREW: Well I guess it was on me to get the timing right. [Laughs]\n&gt; \n&gt; KOBE: [Laughs] You succeeded!\n\n**On being great.**\n\n&gt; ANDREW: What is that extra chromosome that you guys have?\n&gt; \n&gt; KOBE: We talked about it earlier in terms of loving what you do. That’s always step one, loving it and not everything that comes with it, but loving IT. Then it’s the patience to pay attention to the basics of your discipline. What are the fundamentals, the basics? And working on and mastering those over and over and over, and being creative on top of that. But they all master the basics.\n&gt; \n&gt; ANDREW: What is the Mamba mentality?\n&gt; \n&gt; KOBE: ***Having infinite curiosity in what you do. Constantly asking questions. Why is that that way? Why is that here? Why is that there? That’ll lead you down the rabbit hole of answers that lead to more questions, and that’s how you get better at your craft. At it’s purist form it’s curiosity and learning on top of that.***\n&gt; \n\n[Podcast Link](https://podcasts.apple.com/au/podcast/mamba-mentality-revisited/id1349947918?i=1000439921036)", "link": "https://www.reddit.com/r/photography/comments/eul2y9/andrew_d_bernstein_interview_with_kobe_bryant/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "andrew d bernstein interview with kobe bryant. /!/ like many others today, i was mourning the passing of kobe bryant. i decided to look up some of his past interviews and came across one he did with [andrew d bernstein](https://en.wikipedia.org/wiki/andrew_d._bernstein), a legend in his own right in terms of basketball photography. andrew and kobe had a close relationship spanning back to kobe's first day's in the nba. during the interview, kobe discusses analyzing photo's andrew had taken to improve his technique as an athlete, and also what he believes one has to do in order to become a \"great\" in their field. i transcribed what i thought were the relevant parts to this subreddit in case you can't listen, but i did paraphrase a bit because of how dense kobe's responses were. i tried my best to find the photo that they were discussing, but the closest thing i could find to what kobe described was [this photo.](https://clutchpoints.com/wp-content/uploads/2018/02/130213172659-michael-jordan-0013044212-single-image-cut.jpg)\n\n**on still photography in sports**\n\n&gt; andrew: you and i met, it was media day 1996, rookie year fresh faced 18 year old, right? i came up and introduced myself and you said “i know who you are!”\n&gt; \n&gt; kobe: absolutely i know who you were! yes.\n&gt; \n&gt; andrew: that blew me away because we had never met before.\n&gt; \n&gt; kobe: well, you’ve taken every iconic picture….poster… that i had on my wall. i was very very familiar with who you are, because all of the iconic shot that i studied were taken by you.\n&gt; \n&gt; andrew: that just blew me away, honestly. when we got to the book, you talked about how you studied my pictures as a kid, right? so, can you remember something specific like a jordan poster?\n&gt; \n&gt; kobe: yea, i think it was a jordan boxout. i was looking at his foot -----> position !!!  and where his elbow was in the midsection of a player. he’s using his legs to back the player out. everything else was unconventional. i remember looking at that and going “okay, that is not how they teach me to boxout.” i remember thinking maybe that’s why i was having trouble boxing out bigger and older opponents. i have to actually use my elbows to lock the player in and shield them off. i could tell his arms were flexing. he wasn’t just resting his arms, there was an action and a purpose.\n&gt; \n&gt; andrew: how old were you?\n&gt; \n&gt; kobe: twelve.\n&gt; \n&gt; andrew: twleve. [laughs] and a photo spoke to you like that?\n&gt; \n&gt; kobe: well, yea. i can watch and analyze and critique. still photos, you can learn a lot more than you can from moving pictures. things move so fast. ***with a still image you actually have time to look in the moment***, and look at what was working for the offensive player or not or what was working for the defensive player or not.\n&gt; \n&gt; andrew: i have to tell you, that’s the first time i ever heard that from any athlete that i’ve ever worked with, that they actually used my photos to up their game [laughs].\n&gt; \n&gt; kobe: ***if you think about it, it makes complete sense. you can sit there and watch footage from a broadcast… photos are also part of that. they should be learned and studied.*** \n&gt; \n&gt; andrew: well i guess it was on me to get the timing right. [laughs]\n&gt; \n&gt; kobe: [laughs] you succeeded!\n\n**on being great.**\n\n&gt; andrew: what is that extra chromosome that you guys have?\n&gt; \n&gt; kobe: we talked about it earlier in terms of loving what you do. that’s always step one, loving it and not everything that comes with it, but loving it. then it’s the patience to pay attention to the basics of your discipline. what are the fundamentals, the basics? and working on and mastering those over and over and over, and being creative on top of that. but they all master the basics.\n&gt; \n&gt; andrew: what is the mamba mentality?\n&gt; \n&gt; kobe: ***having infinite curiosity in what you do. constantly asking questions. why is that that way? why is that here? why is that there? that’ll lead you down the rabbit hole of answers that lead to more questions, and that’s how you get better at your craft. at it’s purist form it’s curiosity and learning on top of that.***\n&gt; \n\n[podcast link](https://podcasts.apple.com/au/podcast/mamba-mentality-revisited/id1349947918?i=1000439921036)", "sortedWord": "None", "identifyer": 77854, "year": "2020"}, {"Unnamed: 0": 75975, "autor": "fool_on_a_hill", "date": 1580227405000, "content": "Value Your Work or No One Else Will /!/ Sure, you can blame the industry. No one would argue that artists are treated like shit. But let's stop pretending like this is something new. Finding patronage has always been the struggle for creative people who are trying to spend their time creating their art but also need to make a living. Artists have always been exploited. I'm sitting at my 9-5 right now daydreaming about the weekend. That's my personal choice and it was very deliberate. I'd rather not have the stress of making a living weigh down on my passion. Some choose to make their passion a full time thing, and that's awesome too. You just need to be aware of the societal position that puts you in. Everyone knows that you enjoy what you do and you don't really consider it \"work\" and because of that, they know that they can always find someone to do it for free. That's basic economics. So first of all, if you give your work away for free (yes even as a beginner) you are digging your own grave. If you don't assign value to your art then clients won't either. Of course people want you to work for free. Why wouldn't they? If I could suddenly convince a contractor to renovate my kitchen for exposure and connections, you bet your ass I'd be pushing for that every time. Why can't I do that? Because no contractor has ever been that stupid. Photographers have dug their own grave. So, how do we get out? Do we unionize? Probably not. All you can do is assign value to your work. Convince clients that your rate is worth it compared to those other hacks who are doing it for free. It helps if that is actually true, but you'd be surprised how little it matters. So many professional photographers out there are honestly mediocre to bad. Yet they make solid livings because they know how to value their work. IMO there isn't an artist on planet earth who wouldn't be better served by attending business school than art school. Photography school in particular is a total scam and the people running them know it well. It's all on the damn internet. Very few jobs require credentials outside of experience, reputation, and a good portfolio. So you need to learn to hustle yourself, like every artist before you. You can blame the industry, but that doesn't allow you to continue doing what you love. If you want to keep doing  this you need to ask yourself \"how can I game this bullshit system to work in my favor\"? Otherwise you'll just fall back into the rank and file and spend the rest of your life blaming the system. Ask yourself why there are photographers out there in your industry and others who are making shit ton of money. Hint: It's not because they're lucky or because they caught a big break.", "link": "https://www.reddit.com/r/photography/comments/ev7c5h/value_your_work_or_no_one_else_will/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "value your work or no one else will /!/ sure, you can blame the industry. no one would argue that artists are treated like shit. but let's stop pretending like this is something new. finding patronage has always been the struggle for creative people who are trying to spend their time creating their art but also need to make a living. artists have always been exploited. i'm sitting at my 9-5 right now daydreaming about the weekend. that's my personal choice and it was very deliberate. i'd rather not have the stress of making a living weigh down on my passion. some choose to make their passion a full time thing, and that's awesome too. you just need to be aware of the societal -----> position !!!  that puts you in. everyone knows that you enjoy what you do and you don't really consider it \"work\" and because of that, they know that they can always find someone to do it for free. that's basic economics. so first of all, if you give your work away for free (yes even as a beginner) you are digging your own grave. if you don't assign value to your art then clients won't either. of course people want you to work for free. why wouldn't they? if i could suddenly convince a contractor to renovate my kitchen for exposure and connections, you bet your ass i'd be pushing for that every time. why can't i do that? because no contractor has ever been that stupid. photographers have dug their own grave. so, how do we get out? do we unionize? probably not. all you can do is assign value to your work. convince clients that your rate is worth it compared to those other hacks who are doing it for free. it helps if that is actually true, but you'd be surprised how little it matters. so many professional photographers out there are honestly mediocre to bad. yet they make solid livings because they know how to value their work. imo there isn't an artist on planet earth who wouldn't be better served by attending business school than art school. photography school in particular is a total scam and the people running them know it well. it's all on the damn internet. very few jobs require credentials outside of experience, reputation, and a good portfolio. so you need to learn to hustle yourself, like every artist before you. you can blame the industry, but that doesn't allow you to continue doing what you love. if you want to keep doing  this you need to ask yourself \"how can i game this bullshit system to work in my favor\"? otherwise you'll just fall back into the rank and file and spend the rest of your life blaming the system. ask yourself why there are photographers out there in your industry and others who are making shit ton of money. hint: it's not because they're lucky or because they caught a big break.", "sortedWord": "None", "identifyer": 77935, "year": "2020"}, {"Unnamed: 0": 76223, "autor": "everyXnewXday", "date": 1580581501000, "content": "Every mirrorless EVF could be a 1:1 optical “viewfinder”! /!/ Anyone ever heard of the Voigtlander Kontur external viewfinder? It’s a one of a kind film era hot shoe mounted viewfinder that... you can’t see through! Inside is a set of backlit white framelines on a black field and optics to bring the framelines into focus. The trick is that you keep BOTH eyes open and the framelines are magically overlaid on top of reality. It’s sort of like shooting with a bionic eye, haha. \n\nhttps://live.staticflickr.com/8538/8692089099_c6e869fe33_o_d.jpg\n\nAnyway, this got me thinking... my biggest gripe with mirrorless cameras (I shoot Sony) is that the EVF can sometimes feel disconnecting from reality and distracting compared to an optical viewfinder. Sometimes I just want to be focused on my subject and not my photo, if that makes sense. So, what if mirrorless cameras were to incorporate a Kontur style viewfinder into the EVF? There could be a central white dot (as the Kontur finders also have) indicating the position of center af point and framelines that correspond to the focal length of the lens you’re using and change in size/position depending on the focal distance and focus breathing characteristics of the lens (or could just have dotted lines or corner marks indicating close focus parallax correction for manual lenses). \n\nI have two Kontur finders, one for ~40mm lenses (originally made for a normal lens on a 6x9 camera), and one for 35mm. I sometimes use them with my Sony cameras and in practical use they actually work really well. You would think that parallax would be an issue due to the framelines being stationary, but actually the convergence of your eyes mostly naturally compensates, at least in the horizontal direction. The vertical offset with the finder on top of the camera’s viewfinder hump can be high at close range, but wouldn’t be nearly so problematic if incorporated into the EFV itself. It’s such a revelatory experience to shoot with your framelines just overlaid on your natural view of the world!  \n\nA mirrorless camera could easily overcome the parallax issues. The Fuji X-Pro and X100 series cameras already do this with their hybrid EVF. The camera could put focal distance scale at the bottom of the frame so that you get at least a rough idea of whether the AF hit your subject or not (like a Contax G2 if you’ve ever had the pleasure of shooting with one of those). Of course the frame would not be 100% accurate all the time (and might not work well at all for some people who’s eyes don’t work together well), but the EVF would always be available at the touch of a button.\n\nI mean, just think about how amazing it would be for your mirrorless camera to have a 1:1 life size rangefinder style “viewfinder” for every lens focal length (well, up to the limit of the viewfinder magnification/field of view) that works perfectly in even the darkest conditions. \n\nWhat do you think??", "link": "https://www.reddit.com/r/photography/comments/exablu/every_mirrorless_evf_could_be_a_11_optical/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "every mirrorless evf could be a 1:1 optical “viewfinder”! /!/ anyone ever heard of the voigtlander kontur external viewfinder? it’s a one of a kind film era hot shoe mounted viewfinder that... you can’t see through! inside is a set of backlit white framelines on a black field and optics to bring the framelines into focus. the trick is that you keep both eyes open and the framelines are magically overlaid on top of reality. it’s sort of like shooting with a bionic eye, haha. \n\nhttps://live.staticflickr.com/8538/8692089099_c6e869fe33_o_d.jpg\n\nanyway, this got me thinking... my biggest gripe with mirrorless cameras (i shoot sony) is that the evf can sometimes feel disconnecting from reality and distracting compared to an optical viewfinder. sometimes i just want to be focused on my subject and not my photo, if that makes sense. so, what if mirrorless cameras were to incorporate a kontur style viewfinder into the evf? there could be a central white dot (as the kontur finders also have) indicating the -----> position !!!  of center af point and framelines that correspond to the focal length of the lens you’re using and change in size/-----> position !!!  depending on the focal distance and focus breathing characteristics of the lens (or could just have dotted lines or corner marks indicating close focus parallax correction for manual lenses). \n\ni have two kontur finders, one for ~40mm lenses (originally made for a normal lens on a 6x9 camera), and one for 35mm. i sometimes use them with my sony cameras and in practical use they actually work really well. you would think that parallax would be an issue due to the framelines being stationary, but actually the convergence of your eyes mostly naturally compensates, at least in the horizontal direction. the vertical offset with the finder on top of the camera’s viewfinder hump can be high at close range, but wouldn’t be nearly so problematic if incorporated into the efv itself. it’s such a revelatory experience to shoot with your framelines just overlaid on your natural view of the world!  \n\na mirrorless camera could easily overcome the parallax issues. the fuji x-pro and x100 series cameras already do this with their hybrid evf. the camera could put focal distance scale at the bottom of the frame so that you get at least a rough idea of whether the af hit your subject or not (like a contax g2 if you’ve ever had the pleasure of shooting with one of those). of course the frame would not be 100% accurate all the time (and might not work well at all for some people who’s eyes don’t work together well), but the evf would always be available at the touch of a button.\n\ni mean, just think about how amazing it would be for your mirrorless camera to have a 1:1 life size rangefinder style “viewfinder” for every lens focal length (well, up to the limit of the viewfinder magnification/field of view) that works perfectly in even the darkest conditions. \n\nwhat do you think??", "sortedWord": "None", "identifyer": 78196, "year": "2020"}, {"Unnamed: 0": 78492, "autor": "participationmedals", "date": 1591654033000, "content": "What is this little screw in front of the head screw on my Manfrotto 055? It protrudes about 1mm from flush position. (Photo in comments) /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/gz9fr9/what_is_this_little_screw_in_front_of_the_head/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what is this little screw in front of the head screw on my manfrotto 055? it protrudes about 1mm from flush -----> position !!! . (photo in comments) /!/ [removed]", "sortedWord": "None", "identifyer": 80561, "year": "2020"}, {"Unnamed: 0": 79096, "autor": "Stekun", "date": 1594642770000, "content": "How was this done? /!/ I found an image on r/blackmagicfuckery... Note the different positions of the birds wings in the mirror.\n\n[link here](https://www.reddit.com/r/blackmagicfuckery/comments/hqba3x/same_bird_but_the_wings_are_different_on_the/?utm_medium=android_app&amp;utm_source=share)\nI was wondering how this was done? A lot of people say rolling shutter effect but I talked to my dad who used to do photography and he said that this doesn't seem correct. We currently think it would have had to be photoshopped but I kinda want this to be real... So is Photoshop the only way or might this be a real photo, and how?", "link": "https://www.reddit.com/r/photography/comments/hqe967/how_was_this_done/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "how was this done? /!/ i found an image on r/blackmagicfuckery... note the different -----> positions !!!  of the birds wings in the mirror.\n\n[link here](https://www.reddit.com/r/blackmagicfuckery/comments/hqba3x/same_bird_but_the_wings_are_different_on_the/?utm_medium=android_app&amp;utm_source=share)\ni was wondering how this was done? a lot of people say rolling shutter effect but i talked to my dad who used to do photography and he said that this doesn't seem correct. we currently think it would have had to be photoshopped but i kinda want this to be real... so is photoshop the only way or might this be a real photo, and how?", "sortedWord": "None", "identifyer": 81201, "year": "2020"}, {"Unnamed: 0": 79232, "autor": "attejensen", "date": 1594717256000, "content": "Advise needed on \"impossible\" lighting situation (shooting video against a window) /!/ I'm a musician doing live performances of my music on YouTube. I have huge problems with one of the angles, it simply looks horrible, I'm hoping for some advice on how to improve it.\n\nMy physical setup is like this (viewed from above):\n\n    Window   DSLR1   Music-setup  DSLR2\n\nDSLR1 looks pretty good, light comes from behind the camera.\nDSLR2 looks... not so good. It's against the light, the subject (my setup) is not well lit, colors are off.\n\nWhat I tried\n1) I bought two neewer LED lighs with tripods. I've experimented with various positions, intensities and the clear/red-ish plastic cover/filter, but it seems to complicate matters and frankly make things look worse. I get hard shadows, and the colors gets \"out of control\", especially when mixing with the light from the window.\n2) I have three IKEA lamps (with tape over the LEDs to make them warmer), they are not meant for the video parts, just for working. I tried putting them in the mix, but the white balance is all over the place.\n3) The most success I had was with overexposing DSLR2 1-2 stops. Obviously the background (the window) is totally blown out, but the colors sometimes are passable.\n\nMaybe the angle is just impossible, but I'm sure it can be done better than this.\n\nHere's a link to how the DSLR1 looks\nhttps://youtu.be/cEtY9qIOfBw?t=63\n\nAnd here the DSLR2\nhttps://youtu.be/cEtY9qIOfBw?t=251\n\nBoth cameras are canon 2000d, DSLR1 with the \"nifty fifty\" and the DSLR2 with EF-S 24mm, f2.8\n\nNB: If you're wonder about the birds eye on the video, it's just an iPad, it's not something to write home about, but works ok for this.", "link": "https://www.reddit.com/r/photography/comments/hqy4fu/advise_needed_on_impossible_lighting_situation/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "advise needed on \"impossible\" lighting situation (shooting video against a window) /!/ i'm a musician doing live performances of my music on youtube. i have huge problems with one of the angles, it simply looks horrible, i'm hoping for some advice on how to improve it.\n\nmy physical setup is like this (viewed from above):\n\n    window   dslr1   music-setup  dslr2\n\ndslr1 looks pretty good, light comes from behind the camera.\ndslr2 looks... not so good. it's against the light, the subject (my setup) is not well lit, colors are off.\n\nwhat i tried\n1) i bought two neewer led lighs with tripods. i've experimented with various -----> positions !!! , intensities and the clear/red-ish plastic cover/filter, but it seems to complicate matters and frankly make things look worse. i get hard shadows, and the colors gets \"out of control\", especially when mixing with the light from the window.\n2) i have three ikea lamps (with tape over the leds to make them warmer), they are not meant for the video parts, just for working. i tried putting them in the mix, but the white balance is all over the place.\n3) the most success i had was with overexposing dslr2 1-2 stops. obviously the background (the window) is totally blown out, but the colors sometimes are passable.\n\nmaybe the angle is just impossible, but i'm sure it can be done better than this.\n\nhere's a link to how the dslr1 looks\nhttps://youtu.be/cety9qiofbw?t=63\n\nand here the dslr2\nhttps://youtu.be/cety9qiofbw?t=251\n\nboth cameras are canon 2000d, dslr1 with the \"nifty fifty\" and the dslr2 with ef-s 24mm, f2.8\n\nnb: if you're wonder about the birds eye on the video, it's just an ipad, it's not something to write home about, but works ok for this.", "sortedWord": "None", "identifyer": 81337, "year": "2020"}, {"Unnamed: 0": 79648, "autor": "cymerc", "date": 1597186515000, "content": "[Question] How to stabilize drone photos taken on different days /!/ Hi all,\n\nI have around 60 photos of our house at various stages of construction that I took from my drone. The photos are roughly taken from the same position (they're overhead shots). I'd like to make a video of the progress. The problem I'm running into is the position of the house shifts around slightly as you go from photo to photo. I would like to crop all the photos such that the house is in a stable position.\n\nIs there some software I could use that will help me do this? Ideally on macOS but I could get a Windows machine if I had to.", "link": "https://www.reddit.com/r/photography/comments/i824k3/question_how_to_stabilize_drone_photos_taken_on/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "[question] how to stabilize drone photos taken on different days /!/ hi all,\n\ni have around 60 photos of our house at various stages of construction that i took from my drone. the photos are roughly taken from the same -----> position !!!  (they're overhead shots). i'd like to make a video of the progress. the problem i'm running into is the position of the house shifts around slightly as you go from photo to photo. i would like to crop all the photos such that the house is in a stable position.\n\nis there some software i could use that will help me do this? ideally on macos but i could get a windows machine if i had to.", "sortedWord": "None", "identifyer": 81767, "year": "2020"}, {"Unnamed: 0": 79656, "autor": "TouchMeHarderPLZ", "date": 1597176957000, "content": "Should I get the EOS R or RP...or wait? /!/ *TL;DR: I have $2100 USD. Should I get the RP with a 24-105 f4 L, the R and a crappy lens or wait for the R to maybe drop on price and get it with the 24-105 F4 L lens?*\n\nHello there. About a year ago I sold my old Fuji XT-2 in order to get a high end laptop for my engineering classes. Im sick and tired of taking pics with my phone so Im in the process of getting myself a new camera. \n\nI want to get into the RF system and have a budget of around $2100 USD. I was looking into getting the RP with a 24-105 f4, but I was thinking of waiting until the EOS R used prices drop due to the R5 and R6, or maybe even get the R with a crappy lens. I mainly do travel/street photography and friends and family portraits, but I want something that I could use if I decide to start doing photography semi-professionally. \n\nWhat would you do if you were in my position?\n\n*P.S; I live in Mexico were camera gear is VERY expensive, but I buy my personal electronics in the US, so I would be loosing little to no money when I get around to resell my camera-body for an upgrade...I could maybe even make a profit.*\n\nThanks in advance.", "link": "https://www.reddit.com/r/photography/comments/i7z6wr/should_i_get_the_eos_r_or_rpor_wait/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "should i get the eos r or rp...or wait? /!/ *tl;dr: i have $2100 usd. should i get the rp with a 24-105 f4 l, the r and a crappy lens or wait for the r to maybe drop on price and get it with the 24-105 f4 l lens?*\n\nhello there. about a year ago i sold my old fuji xt-2 in order to get a high end laptop for my engineering classes. im sick and tired of taking pics with my phone so im in the process of getting myself a new camera. \n\ni want to get into the rf system and have a budget of around $2100 usd. i was looking into getting the rp with a 24-105 f4, but i was thinking of waiting until the eos r used prices drop due to the r5 and r6, or maybe even get the r with a crappy lens. i mainly do travel/street photography and friends and family portraits, but i want something that i could use if i decide to start doing photography semi-professionally. \n\nwhat would you do if you were in my -----> position !!! ?\n\n*p.s; i live in mexico were camera gear is very expensive, but i buy my personal electronics in the us, so i would be loosing little to no money when i get around to resell my camera-body for an upgrade...i could maybe even make a profit.*\n\nthanks in advance.", "sortedWord": "None", "identifyer": 81775, "year": "2020"}, {"Unnamed: 0": 79854, "autor": "Black-Cotton", "date": 1593700551000, "content": "Love photography, don't like photographers? /!/ Pretty much most of photography resources and discussion online revolves around gear. I got into photography and instantly noticed so much online photography discussion was less about shooting and studying images and more about gear, buying gear, and endless wars of what's best. Film shooters say film has more soul and is more creative than digital when most of what you see from film shooters is boring cliche: a woman shot in a sexy position usually in vertical format or a shot of a neon sign. Then there's the digital people that freak when they find out you happen to prefer jpg because it reminds you of the limitations of film or drawing with pen rather than pencil. \n\nThe few photographers you can discuss photography and experiences and stuff with seem so rare which makes you prize the relationship even further.", "link": "https://www.reddit.com/r/photography/comments/hjy53x/love_photography_dont_like_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "love photography, don't like photographers? /!/ pretty much most of photography resources and discussion online revolves around gear. i got into photography and instantly noticed so much online photography discussion was less about shooting and studying images and more about gear, buying gear, and endless wars of what's best. film shooters say film has more soul and is more creative than digital when most of what you see from film shooters is boring cliche: a woman shot in a sexy -----> position !!!  usually in vertical format or a shot of a neon sign. then there's the digital people that freak when they find out you happen to prefer jpg because it reminds you of the limitations of film or drawing with pen rather than pencil. \n\nthe few photographers you can discuss photography and experiences and stuff with seem so rare which makes you prize the relationship even further.", "sortedWord": "None", "identifyer": 81984, "year": "2020"}, {"Unnamed: 0": 80051, "autor": "CollectableRat", "date": 1594041927000, "content": "Rapid food photography, is an iPhone 11 Pro or even an iPhone XS good enough for websites and flyers for independent restaurants and cafes? /!/ I’ve been making websites for a while and I want to figure out how to rapidly take photos of a whole menu, so all the food photos can be done in one bam, and later I can go through and choose which ones to use and clean up. Like potato pie, bam bam bam take photos from three angles including a top down. Hotdog, bam bam bam take all the same photos from the same angles. Carefully position some mobile light sources around it, take one picture of my X-Rite Color Passport, then bam bam bam take classy  photos of all the food. Keep the total time photographing short so I can charge a low enough price to give any independent cafe or restaurant a website full of all their food, or flyers with cool photos, and give them a copy of the photos for their own social media. I feel like if I bam bam bam it enough I can get the price low enough to make everyone happy. I’d even make them little cardboard signs so they can label all the food for me so I don’t need to spend time memorising it all in conversation.\n\nI have a Rebel T3 which is kinda noisy and a PITA, I hate the sound of the mirror flapping about. I have an iPhone XS and I’d buy an iPhone 11 Pro if I thought it could save me any time getting things like this done. I feel like a 12MP iPhone photo probably would be good enough for a food photo poster or flyer for a little restaurant that typically couldn’t afford to even hire a photographer, let alone have a slick looking website or print media. Or am I way off the mark here? I’ve bought the Rebel T3 in the past and spent money on a Color Passport, but in the end I used Photoshop more for graphic design than anything else. But c’mon budget food photos, bam bam bam, it can’t be hard right?\n\nOr are there any cameras that I could buy instead that will offer me an auto mode that lets me lock the exposure and focus or whatever, for $400 that would be better than spending money on an iPhone 11 Pro? I know the Lightroom app on iPhone lets you control those settings, but would a dedicated camera be better for less money. Keeping in mind the time saved on the iPhone not having to deal with memory cards or whatever, and the iPhone screen is so good that you don’t need to guess if the photo was good or not you can look at the screen and see for yourself.", "link": "https://www.reddit.com/r/photography/comments/hm7lg8/rapid_food_photography_is_an_iphone_11_pro_or/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "rapid food photography, is an iphone 11 pro or even an iphone xs good enough for websites and flyers for independent restaurants and cafes? /!/ i’ve been making websites for a while and i want to figure out how to rapidly take photos of a whole menu, so all the food photos can be done in one bam, and later i can go through and choose which ones to use and clean up. like potato pie, bam bam bam take photos from three angles including a top down. hotdog, bam bam bam take all the same photos from the same angles. carefully -----> position !!!  some mobile light sources around it, take one picture of my x-rite color passport, then bam bam bam take classy  photos of all the food. keep the total time photographing short so i can charge a low enough price to give any independent cafe or restaurant a website full of all their food, or flyers with cool photos, and give them a copy of the photos for their own social media. i feel like if i bam bam bam it enough i can get the price low enough to make everyone happy. i’d even make them little cardboard signs so they can label all the food for me so i don’t need to spend time memorising it all in conversation.\n\ni have a rebel t3 which is kinda noisy and a pita, i hate the sound of the mirror flapping about. i have an iphone xs and i’d buy an iphone 11 pro if i thought it could save me any time getting things like this done. i feel like a 12mp iphone photo probably would be good enough for a food photo poster or flyer for a little restaurant that typically couldn’t afford to even hire a photographer, let alone have a slick looking website or print media. or am i way off the mark here? i’ve bought the rebel t3 in the past and spent money on a color passport, but in the end i used photoshop more for graphic design than anything else. but c’mon budget food photos, bam bam bam, it can’t be hard right?\n\nor are there any cameras that i could buy instead that will offer me an auto mode that lets me lock the exposure and focus or whatever, for $400 that would be better than spending money on an iphone 11 pro? i know the lightroom app on iphone lets you control those settings, but would a dedicated camera be better for less money. keeping in mind the time saved on the iphone not having to deal with memory cards or whatever, and the iphone screen is so good that you don’t need to guess if the photo was good or not you can look at the screen and see for yourself.", "sortedWord": "None", "identifyer": 82186, "year": "2020"}, {"Unnamed: 0": 80170, "autor": "Smcavitt", "date": 1597851564000, "content": "Astrophotography Questions/Advice /!/ So I'll start by saying I know the searchbar exisits and ive done tons of googling and searching and find different answers everywhere. \n\nI'm planning a trip to some dark sky areas and want to try my hand in Astro (given the weather is good) everytime I try when im somewhere that itll turn out good the weather tends to be terrible (high cloud coverage) and am hoping for a break.  Well turns outs this trip is no different.  The full moon is 9/2 and Ill be there 9/4-9/7, should I even try or will the moon be too bright?  I'm still trying to figure out where the moon will be positioned and if the milkyway will be in a different area of the sky, are there any FREE apps or sites to help? Stellarium and Photopill seem to be the go too's but I dont want to pay $20 yet to just try my hand at it.  I know the 500 rule what else should I be researching and planning before going?\n\n&amp;#x200B;\n\nTL;DR Should I try to shoot astro during the full moon, what other things should I know before trying Astro", "link": "https://www.reddit.com/r/photography/comments/icq0d2/astrophotography_questionsadvice/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "astrophotography questions/advice /!/ so i'll start by saying i know the searchbar exisits and ive done tons of googling and searching and find different answers everywhere. \n\ni'm planning a trip to some dark sky areas and want to try my hand in astro (given the weather is good) everytime i try when im somewhere that itll turn out good the weather tends to be terrible (high cloud coverage) and am hoping for a break.  well turns outs this trip is no different.  the full moon is 9/2 and ill be there 9/4-9/7, should i even try or will the moon be too bright?  i'm still trying to figure out where the moon will be -----> positioned !!!  and if the milkyway will be in a different area of the sky, are there any free apps or sites to help? stellarium and photopill seem to be the go too's but i dont want to pay $20 yet to just try my hand at it.  i know the 500 rule what else should i be researching and planning before going?\n\n&amp;#x200b;\n\ntl;dr should i try to shoot astro during the full moon, what other things should i know before trying astro", "sortedWord": "None", "identifyer": 82307, "year": "2020"}, {"Unnamed: 0": 80411, "autor": "Rundownturtle", "date": 1599041068000, "content": "90 Day Fiance Happily Ever After Recap: Compromising Positions /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/il40qs/90_day_fiance_happily_ever_after_recap/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "90 day fiance happily ever after recap: compromising -----> positions !!!  /!/ [removed]", "sortedWord": "None", "identifyer": 82555, "year": "2020"}, {"Unnamed: 0": 80569, "autor": "lovelylexxi13", "date": 1599068148000, "content": "Question on pricing/rate for editing weddings /!/ I recently applied for a remote editing position for a wedding photography company that does about 130 weddings a year, 600 images per wedding roughly. They asked what would I expect per wedding as a rate.. I’ve only ever sold my own wedding packages that include both the shooting and editing so I’m a little stuck as I don’t wanna undersell or ask for too much compensation. They pay per wedding edited so I’m looking at rate per wedding. Thoughts?", "link": "https://www.reddit.com/r/photography/comments/ilbe9d/question_on_pricingrate_for_editing_weddings/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question on pricing/rate for editing weddings /!/ i recently applied for a remote editing -----> position !!!  for a wedding photography company that does about 130 weddings a year, 600 images per wedding roughly. they asked what would i expect per wedding as a rate.. i’ve only ever sold my own wedding packages that include both the shooting and editing so i’m a little stuck as i don’t wanna undersell or ask for too much compensation. they pay per wedding edited so i’m looking at rate per wedding. thoughts?", "sortedWord": "None", "identifyer": 82724, "year": "2020"}, {"Unnamed: 0": 80767, "autor": "Wengers-jacket-zip", "date": 1600588633000, "content": "How to deal with a client who doesn't like my edits? /!/ Hi everyone,\n\nLong time lurker first time poster. I've been practicing photography for years, and relatively recently started advertising my photography (mostly family and children's) services after spending the past couple of years building a portfolio offering free friends and family shoots, and getting myself to a position I was comfortable and confident enough to take the next step commercially.\n\nThe response I've had generally has been fantastic and far better than I expected in terms of bookings, and I've had a lot of very satisfied customers.\n\nMy current process is to charge a base rate for a shoot, then provide a watermarked gallery to clients with a basic blanket edit, allow them to select the pics they like, which I then price up and do the full edit. I'll then send the first finished  photo to get payment before editing the rest.\n\nI'll preface this with saying my editing style is very consistent, and something like most photographers, has been honed and developed over many years, I have plenty of examples on my website and social media of my photography and what people are getting when they hire me and I absolutely consider it a huge part of my style and what makes people consider me. \n\n However my current client, after receiving their sample image for payment, has asked me to provide 'less edited' photos more in line with the basic photos I provided for selection. I've tried to get some more information as to what about the final image they aren't sure about, but they cant give me anything outside of 'I prefer them less editied'.? \n\nMy question is, am I being unreasonable if I refuse? I want to be as professional as possible and to please every paying customer but I also really don't like the idea of providing sub-par work such as the original images, even if requested, and similarly I don't want to change my editing work flow to suit each individual clients requests, as that sounds like a nightmare. \n\nI'll also add, this client booked as part of an introductory offer when I launched, so they are being charged a low rate for this shoot as I try and get my work out there a bit. \n\nI'm assuming other people on here have dealt with similar issues, but does anyone have any advice they'd be willing to share as to how to deal with this kind of request? \n\nThanks in advance", "link": "https://www.reddit.com/r/photography/comments/iw9ox1/how_to_deal_with_a_client_who_doesnt_like_my_edits/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how to deal with a client who doesn't like my edits? /!/ hi everyone,\n\nlong time lurker first time poster. i've been practicing photography for years, and relatively recently started advertising my photography (mostly family and children's) services after spending the past couple of years building a portfolio offering free friends and family shoots, and getting myself to a -----> position !!!  i was comfortable and confident enough to take the next step commercially.\n\nthe response i've had generally has been fantastic and far better than i expected in terms of bookings, and i've had a lot of very satisfied customers.\n\nmy current process is to charge a base rate for a shoot, then provide a watermarked gallery to clients with a basic blanket edit, allow them to select the pics they like, which i then price up and do the full edit. i'll then send the first finished  photo to get payment before editing the rest.\n\ni'll preface this with saying my editing style is very consistent, and something like most photographers, has been honed and developed over many years, i have plenty of examples on my website and social media of my photography and what people are getting when they hire me and i absolutely consider it a huge part of my style and what makes people consider me. \n\n however my current client, after receiving their sample image for payment, has asked me to provide 'less edited' photos more in line with the basic photos i provided for selection. i've tried to get some more information as to what about the final image they aren't sure about, but they cant give me anything outside of 'i prefer them less editied'.? \n\nmy question is, am i being unreasonable if i refuse? i want to be as professional as possible and to please every paying customer but i also really don't like the idea of providing sub-par work such as the original images, even if requested, and similarly i don't want to change my editing work flow to suit each individual clients requests, as that sounds like a nightmare. \n\ni'll also add, this client booked as part of an introductory offer when i launched, so they are being charged a low rate for this shoot as i try and get my work out there a bit. \n\ni'm assuming other people on here have dealt with similar issues, but does anyone have any advice they'd be willing to share as to how to deal with this kind of request? \n\nthanks in advance", "sortedWord": "None", "identifyer": 82932, "year": "2020"}, {"Unnamed: 0": 80816, "autor": "ModernPlagueDoctor", "date": 1600008167000, "content": "Senior Citizen Photography /!/ Hey guys. I told my grandmother I would take some nice pictures of her since she’s never had it done before. However, all the senior images I’m finding online involve a couple and my grandpa died 5 years ago. \n\nThis is new to me and I’m having trouble thinking of interesting positions. I also feel like older people would just look awkward in some traditional solo poses. So..any ideas? I’ll take whatever I can get at this point. Thanks!", "link": "https://www.reddit.com/r/photography/comments/irzftn/senior_citizen_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "senior citizen photography /!/ hey guys. i told my grandmother i would take some nice pictures of her since she’s never had it done before. however, all the senior images i’m finding online involve a couple and my grandpa died 5 years ago. \n\nthis is new to me and i’m having trouble thinking of interesting -----> positions !!! . i also feel like older people would just look awkward in some traditional solo poses. so..any ideas? i’ll take whatever i can get at this point. thanks!", "sortedWord": "None", "identifyer": 82981, "year": "2020"}, {"Unnamed: 0": 81627, "autor": "TheHazmatUnit", "date": 1595912085000, "content": "In what position should I leave my camera when not using it? /!/ Hello, I hope you all have been doing fine in these dire times, today I have for you a question that the all mighty Google couldn't answer. So, first of all a little story: while I was searching around my dad's old stuff I found his old soviet camera, a Zenit-E with a Helios-44-2 lens, after messing around with the camera I found out that the aperture blades had some oil, specially the bottom blades. The camera has been lying down in a 'normal' position for more than two decades. \nFast forward to today, a Minolta Maxxum 50mm f/1.4 lens that I ordered for my Sony A58 finally arrived, amazing and sharp lens, considering it was made back in 1985 or around that time, anyways, after discovering the oily mess with the Zenit camera I started to grow worried about the position that I should leave my camera like. What Im asking is if leaving the camera resting over the LCD screen (lens looking up) prevents the oil dripping or if its fine to leave it like any other camera (lens looking horizontally).\nI apologize in advance if my explanation is too poor, english is my second language, feel free to ask me for a clearer explanation. Thank you all.", "link": "https://www.reddit.com/r/photography/comments/hz8e2d/in_what_position_should_i_leave_my_camera_when/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "in what -----> position !!!  should i leave my camera when not using it? /!/ hello, i hope you all have been doing fine in these dire times, today i have for you a question that the all mighty google couldn't answer. so, first of all a little story: while i was searching around my dad's old stuff i found his old soviet camera, a zenit-e with a helios-44-2 lens, after messing around with the camera i found out that the aperture blades had some oil, specially the bottom blades. the camera has been lying down in a 'normal' position for more than two decades. \nfast forward to today, a minolta maxxum 50mm f/1.4 lens that i ordered for my sony a58 finally arrived, amazing and sharp lens, considering it was made back in 1985 or around that time, anyways, after discovering the oily mess with the zenit camera i started to grow worried about the position that i should leave my camera like. what im asking is if leaving the camera resting over the lcd screen (lens looking up) prevents the oil dripping or if its fine to leave it like any other camera (lens looking horizontally).\ni apologize in advance if my explanation is too poor, english is my second language, feel free to ask me for a clearer explanation. thank you all.", "sortedWord": "None", "identifyer": 83825, "year": "2020"}, {"Unnamed: 0": 82074, "autor": "OmniaMors", "date": 1606314933000, "content": "Nikon is not dying, they may not be in an amazing position, but they will be fine /!/ Everywhere I look, people are acting like Nikon is some poor beggar desperate to survive. I dont really blame people for this, I blame bloggers who know little to nothing about finance and business pushing \"facts\" without context. I am not a finance expert, but it takes very little effort to pull up their numbers and see for yourself. To be super clear, I am NOT trying to say Nikon is doing well or that we should all buy up their stocks. All I am trying to show is that all this THE END OF NIKON talk is nothing shy of shoddy journalism.\n\n*Note: I do use Nikon, but I have no loyalty. I literally only got locked into it because my ex used it when I started photography, and I dont care enough to rebuy all my lenses and such.*\n\n#Nikon is doing so much worse than in 2019!\n\nYes. COVID is still a thing.\n\nIgnoring COVID, however, this is not really an important data point. Take a look at Nikon's revenue over time, 2020 is incomplete, they end their year March 31st.\n\n[Nikon Annual Net Income](https://i.imgur.com/dvYwDEm.png)\n\nNotice how cyclical Nikon is? even though we are only 2/3rds of the way through this fiscal year, 2020 is still perfectly on track with this trend. How well they are doing can be seen even better by comparing them to Canon.\n\n[Nikon and Canon Annual Net Income](https://i.imgur.com/zwnahMp.png)\n\nNotice how they both have near-identical trend lines? It's a harsh simplification, using a solely linear trend, but since we only have a few years, and only Nikon is so cyclical its the best way.\n\nIf Nikon is on death's doorstop, so is Canon, who have the exact same trend overall.\n\n#Sure, but Nikon is making bad products!\n\nLook I wont get into Gear War arguments with you, but Operating margin is a good measure of their product decisions.\n\nOperating margin is the profit from a product, divided by the revenue of said product. If you can sell a $20 item for $30, thats a margin of 50%. But if you can only sell a $50 item for $60 thats only a margin of 20%. In general, the better the item, the higher the margin. It makes sense logically, a luxury car maker like Rolls Royce is going to have higher margins than a volume car maker like Ford. In fact, over the last 10 years the former has a median operating margin of 9.26% with a max of 10.19%, while the latter has a median of -2.67% and a max of 2.41%.\n\n[Even if you include the shit show of 2020, Nikon's Net Operating Margin has been increasing](https://i.imgur.com/NjXPtVE.png)\n\nWhich makes sense since they KILLED it with the universally loved D850 and D7500 in 2017, which was when their margin really started to change. But their venture into mirrorless started in late 2018 (FY 2019) with the Z7 and Z6, and in FY2019 they were still going very strong. While their solid DSLR lineup is absolutely buffering this, it still shows they aren’t struggling.\n\n[Theyve even began to do better than Canon](https://i.imgur.com/P9oh4pj.png)\n\n#Well Nikon is behind on the Mirrorless game, and will struggle to catch up!\n\nPlaying catch up is harder, yes, and they did start late BUT\n\nIn order to catch up, or to pivot, what they need is cash to use as capital into research and setting up manufacturing. Most of the cash in a business is obligated funds, like cash set aside for paying people's salaries in the next couple of months. Having a lot of cash on hand, however, puts you in a great position to move and pivot. You can buy into a whole new industry, or ride out bad financial times etc.\n\n[Cash on hand for Nikon and Canon](https://i.imgur.com/C8ng95L.png)\n\nNow this by itself does not tell us anything. Nikon could have more money simply because they have a lot of money tied up in working capital. What it does tell us, however, is that Nikon is in a very stable position. They have a massive amount of cash, nearly surpassing Canon, and a positive trend.\n\nThink of it this way, lets say tomorrow there is a new fancy fad, maybe everyone decides they want M43 again. Having more cash makes it easier to retool machines, buy adspace, etc. Lets say tomorrow the market crashes, who can afford to pay their bills more easily, someone with a lot of value in cash, or a lot of value in property?\n\nAgain, I am NOT saying Nikon is doing better than Canon, my point is solely that the articles talking about how Nikon is on the verge of death are dumb and should be ignored.", "link": "https://www.reddit.com/r/photography/comments/k0t8uw/nikon_is_not_dying_they_may_not_be_in_an_amazing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "nikon is not dying, they may not be in an amazing -----> position !!! , but they will be fine /!/ everywhere i look, people are acting like nikon is some poor beggar desperate to survive. i dont really blame people for this, i blame bloggers who know little to nothing about finance and business pushing \"facts\" without context. i am not a finance expert, but it takes very little effort to pull up their numbers and see for yourself. to be super clear, i am not trying to say nikon is doing well or that we should all buy up their stocks. all i am trying to show is that all this the end of nikon talk is nothing shy of shoddy journalism.\n\n*note: i do use nikon, but i have no loyalty. i literally only got locked into it because my ex used it when i started photography, and i dont care enough to rebuy all my lenses and such.*\n\n#nikon is doing so much worse than in 2019!\n\nyes. covid is still a thing.\n\nignoring covid, however, this is not really an important data point. take a look at nikon's revenue over time, 2020 is incomplete, they end their year march 31st.\n\n[nikon annual net income](https://i.imgur.com/dvywdem.png)\n\nnotice how cyclical nikon is? even though we are only 2/3rds of the way through this fiscal year, 2020 is still perfectly on track with this trend. how well they are doing can be seen even better by comparing them to canon.\n\n[nikon and canon annual net income](https://i.imgur.com/zwnahmp.png)\n\nnotice how they both have near-identical trend lines? it's a harsh simplification, using a solely linear trend, but since we only have a few years, and only nikon is so cyclical its the best way.\n\nif nikon is on death's doorstop, so is canon, who have the exact same trend overall.\n\n#sure, but nikon is making bad products!\n\nlook i wont get into gear war arguments with you, but operating margin is a good measure of their product decisions.\n\noperating margin is the profit from a product, divided by the revenue of said product. if you can sell a $20 item for $30, thats a margin of 50%. but if you can only sell a $50 item for $60 thats only a margin of 20%. in general, the better the item, the higher the margin. it makes sense logically, a luxury car maker like rolls royce is going to have higher margins than a volume car maker like ford. in fact, over the last 10 years the former has a median operating margin of 9.26% with a max of 10.19%, while the latter has a median of -2.67% and a max of 2.41%.\n\n[even if you include the shit show of 2020, nikon's net operating margin has been increasing](https://i.imgur.com/njxptve.png)\n\nwhich makes sense since they killed it with the universally loved d850 and d7500 in 2017, which was when their margin really started to change. but their venture into mirrorless started in late 2018 (fy 2019) with the z7 and z6, and in fy2019 they were still going very strong. while their solid dslr lineup is absolutely buffering this, it still shows they aren’t struggling.\n\n[theyve even began to do better than canon](https://i.imgur.com/p9oh4pj.png)\n\n#well nikon is behind on the mirrorless game, and will struggle to catch up!\n\nplaying catch up is harder, yes, and they did start late but\n\nin order to catch up, or to pivot, what they need is cash to use as capital into research and setting up manufacturing. most of the cash in a business is obligated funds, like cash set aside for paying people's salaries in the next couple of months. having a lot of cash on hand, however, puts you in a great position to move and pivot. you can buy into a whole new industry, or ride out bad financial times etc.\n\n[cash on hand for nikon and canon](https://i.imgur.com/c8ng95l.png)\n\nnow this by itself does not tell us anything. nikon could have more money simply because they have a lot of money tied up in working capital. what it does tell us, however, is that nikon is in a very stable position. they have a massive amount of cash, nearly surpassing canon, and a positive trend.\n\nthink of it this way, lets say tomorrow there is a new fancy fad, maybe everyone decides they want m43 again. having more cash makes it easier to retool machines, buy adspace, etc. lets say tomorrow the market crashes, who can afford to pay their bills more easily, someone with a lot of value in cash, or a lot of value in property?\n\nagain, i am not saying nikon is doing better than canon, my point is solely that the articles talking about how nikon is on the verge of death are dumb and should be ignored.", "sortedWord": "None", "identifyer": 84296, "year": "2020"}, {"Unnamed: 0": 82647, "autor": "grneyz", "date": 1607011899000, "content": "Is it rude to ask my photographer this? /!/ My fiancé and I are having a small wedding ceremony in a big city. I found a photographer who’s new to the game but she’s great. I love how she has captured moments for couples in the past.\n\nWe generally like her editing style, however at times she goes very heavy with the light/dead grass green and orange hues. Some of her photos highlight this, others she does a better job editing to keep the colors more natural.\n\nWe are thinking about moving forward with her, but would it be rude to bring up that we prefer natural colors when it comes to edits? I don’t want to offend her and I respect that there are different editing styles out there. \n\nObviously we could go with an entirely different photographer where we love their work entirely... it has just been hard to find one we love within our budget in our city for such a small/short ceremony. You certainly get what you pay for and I wish I was in a position to shell out the big bucks!\n\nThank you!", "link": "https://www.reddit.com/r/photography/comments/k60431/is_it_rude_to_ask_my_photographer_this/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is it rude to ask my photographer this? /!/ my fiancé and i are having a small wedding ceremony in a big city. i found a photographer who’s new to the game but she’s great. i love how she has captured moments for couples in the past.\n\nwe generally like her editing style, however at times she goes very heavy with the light/dead grass green and orange hues. some of her photos highlight this, others she does a better job editing to keep the colors more natural.\n\nwe are thinking about moving forward with her, but would it be rude to bring up that we prefer natural colors when it comes to edits? i don’t want to offend her and i respect that there are different editing styles out there. \n\nobviously we could go with an entirely different photographer where we love their work entirely... it has just been hard to find one we love within our budget in our city for such a small/short ceremony. you certainly get what you pay for and i wish i was in a -----> position !!!  to shell out the big bucks!\n\nthank you!", "sortedWord": "None", "identifyer": 84893, "year": "2020"}, {"Unnamed: 0": 82955, "autor": "YeOldDoc", "date": 1607822655000, "content": "Should I use the rear nodal point of the last lens instead of the entrance pupil as the center of projection if I want to stitch images at different focal lengths? /!/ I often read that the entrance pupil is the correct center of projection when taking panoramic photos.\n\nI am not rotating the camera, but the center of projection is IMHO still relevant in my case:\n\n\\- Place Object A at distance x, focus on it, take a picture. Object A ends up at position A' on the image.\n\n\\- Shoot a ray from the center of the aperture stop (i.e. assumed center of projection) through Object A. Pick a point on that ray behind Object A and place a scaled-up copy Object B there. Focus on it, take a picture. Object B ends up at B' on the image.\n\nIn this scenario A' !== B' because of the differences in focal lengths. What is the ray along which I can place Bs so that A' == B', i.e. they create the same image?\n\nI am specifically interested in a scenario that replicates the human eye, i.e. Object-&gt;Fixed Lens-&gt;Aperture Stop-&gt;Variable Lens-&gt;Image\n\nIn this scenario, changing the focal length of the system only involves the lens after the aperture stop, i.e. changing it does not change the entrance pupil. As a result the ray along which to place Bs doesn't change.\n\nIn this scenario, is there a better point than the aperture stop through which to shoot a ray at Object A, that minimizes the differences between the images A' and B'? If so, how do I calculate that point?\n\nI tried to simulate it with a ray simulator (see images), it is not very accurate so if anybody knows open-source or free software to simulate my scenario I'd be very thankful.\n\nLegend for the pictures:\n\n\\- Object B is behind A when shooting through aperture stop.\n\n\\- Object C is behind A when shooting through lens center.\n\n\\- A',B',C' are images of A,B,C when focussed on Object A.\n\n\\- A\\*,B\\*,C\\* are images of A,B,C when focussed on Object B/C.\n\nIt looks like C\\* (via lens center) is much closer to A' than B\\* (via aperture stop). So is the entrance pupil not the \"center of projection\" if you need to refocus?\n\nCan somebody \"shed a light\" on this? ;-)", "link": "https://www.reddit.com/r/photography/comments/kc1e4w/should_i_use_the_rear_nodal_point_of_the_last/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "should i use the rear nodal point of the last lens instead of the entrance pupil as the center of projection if i want to stitch images at different focal lengths? /!/ i often read that the entrance pupil is the correct center of projection when taking panoramic photos.\n\ni am not rotating the camera, but the center of projection is imho still relevant in my case:\n\n\\- place object a at distance x, focus on it, take a picture. object a ends up at -----> position !!!  a' on the image.\n\n\\- shoot a ray from the center of the aperture stop (i.e. assumed center of projection) through object a. pick a point on that ray behind object a and place a scaled-up copy object b there. focus on it, take a picture. object b ends up at b' on the image.\n\nin this scenario a' !== b' because of the differences in focal lengths. what is the ray along which i can place bs so that a' == b', i.e. they create the same image?\n\ni am specifically interested in a scenario that replicates the human eye, i.e. object-&gt;fixed lens-&gt;aperture stop-&gt;variable lens-&gt;image\n\nin this scenario, changing the focal length of the system only involves the lens after the aperture stop, i.e. changing it does not change the entrance pupil. as a result the ray along which to place bs doesn't change.\n\nin this scenario, is there a better point than the aperture stop through which to shoot a ray at object a, that minimizes the differences between the images a' and b'? if so, how do i calculate that point?\n\ni tried to simulate it with a ray simulator (see images), it is not very accurate so if anybody knows open-source or free software to simulate my scenario i'd be very thankful.\n\nlegend for the pictures:\n\n\\- object b is behind a when shooting through aperture stop.\n\n\\- object c is behind a when shooting through lens center.\n\n\\- a',b',c' are images of a,b,c when focussed on object a.\n\n\\- a\\*,b\\*,c\\* are images of a,b,c when focussed on object b/c.\n\nit looks like c\\* (via lens center) is much closer to a' than b\\* (via aperture stop). so is the entrance pupil not the \"center of projection\" if you need to refocus?\n\ncan somebody \"shed a light\" on this? ;-)", "sortedWord": "None", "identifyer": 85214, "year": "2020"}, {"Unnamed: 0": 83557, "autor": "ASMRROSS2022", "date": 1603053542000, "content": "Re-Fuel Battery ruined my camera screen /!/ ReFuel battery ruined my T5i?\n\nHad my T5i since 2016, no issues. I used a ReFuel offbrand battery for 2 months no issues. 2 nights ago im filming and i noticed my camera screen turned off after I was done. The camera was warm but no scolding, like those hand warmers you buy during winter. I thought the battery died but when I accidentally hit the record button it beeped indicating that it was saving a recording\n\nThen i tried turning it on and off and the Movie switch turned it off while the off position turned it on and picture switch turned on to video mode! The next day i tried it and the switches are proper again but now the LCD screen turns on but off after 5 seconds! \n\nNo i dont have “auto LCD off” enabled and I never have. So what happened to my camera? Why is the LCD turning off after 5 seconds is there any fix?\n\nEDIT: screen wont turn on but touching the screen makes it beep as if Im changing options on the default menu. When I plug it into my external monitor the screen shows on my external monitor but I really want the built in screen to work again", "link": "https://www.reddit.com/r/photography/comments/jdntyk/refuel_battery_ruined_my_camera_screen/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "re-fuel battery ruined my camera screen /!/ refuel battery ruined my t5i?\n\nhad my t5i since 2016, no issues. i used a refuel offbrand battery for 2 months no issues. 2 nights ago im filming and i noticed my camera screen turned off after i was done. the camera was warm but no scolding, like those hand warmers you buy during winter. i thought the battery died but when i accidentally hit the record button it beeped indicating that it was saving a recording\n\nthen i tried turning it on and off and the movie switch turned it off while the off -----> position !!!  turned it on and picture switch turned on to video mode! the next day i tried it and the switches are proper again but now the lcd screen turns on but off after 5 seconds! \n\nno i dont have “auto lcd off” enabled and i never have. so what happened to my camera? why is the lcd turning off after 5 seconds is there any fix?\n\nedit: screen wont turn on but touching the screen makes it beep as if im changing options on the default menu. when i plug it into my external monitor the screen shows on my external monitor but i really want the built in screen to work again", "sortedWord": "None", "identifyer": 85855, "year": "2020"}, {"Unnamed: 0": 83870, "autor": "fos2234", "date": 1604876732000, "content": "How do you make nature shots without a clear subject seem less busy? /!/ Amateur photographer here. I love taking pictures of the nature around me. I love my cabin area, taking pictures of the river and beautiful fall leaves. I’ve discovered however that my shots without a clear subject seem much more busy. If I’m just taking a picture of the river and surrounding land and don’t have my sister positioned on a rock or something to focus in on, the shots are just too much and I personally don’t think they look as good. Is there any way to get around this since usually I’m alone during shoots? I still have a lot to learn and I look forward to learning from my fellow redditors", "link": "https://www.reddit.com/r/photography/comments/jqlql4/how_do_you_make_nature_shots_without_a_clear/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "how do you make nature shots without a clear subject seem less busy? /!/ amateur photographer here. i love taking pictures of the nature around me. i love my cabin area, taking pictures of the river and beautiful fall leaves. i’ve discovered however that my shots without a clear subject seem much more busy. if i’m just taking a picture of the river and surrounding land and don’t have my sister -----> positioned !!!  on a rock or something to focus in on, the shots are just too much and i personally don’t think they look as good. is there any way to get around this since usually i’m alone during shoots? i still have a lot to learn and i look forward to learning from my fellow redditors", "sortedWord": "None", "identifyer": 86178, "year": "2020"}, {"Unnamed: 0": 84106, "autor": "_-J-G-_", "date": 1604961148000, "content": "Today I learned about using thirds of the picture to position things in my shot. (Kind of a beginner when it comes to professional stuff)", "link": "https://www.reddit.com/r/photography/comments/jr82k5/today_i_learned_about_using_thirds_of_the_picture/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "today i learned about using thirds of the picture to -----> position !!!  things in my shot. (kind of a beginner when it comes to professional stuff)", "sortedWord": "None", "identifyer": 86419, "year": "2020"}, {"Unnamed: 0": 84158, "autor": "mrcalebjones", "date": 1605292076000, "content": "Technical Help With An Experiment Involving Astro-Photography /!/ This is a weird post, but please hear me out and help me understand how to do what I am describing below. I need some help on how to construct an experiment that uses photography. I also need any HELP that someone with really good understanding of the optics of cameras and such can do. \n\n**THE LONG AND SHORT OF THIS PHOTOGRAPHY EXPERTISE NEED:**\n\nI'm looking to try to \"re-create\" a historical event in astronomy. Normally, you can do this easily with an astronomical simulator. However, this particular event needs something more complicated than that. ***I want to know how atmospheric refraction and air turbulence and changing contrast between the sky and the stars changes the view for a naked-eye astronomer.*** The BENEFITS of modern astronomy, telescopes, awesome layered images, long exposures, etc. is a WEAKNESS when it comes to trying to recreate what I'm doing. \n\nIn short, I need help on how to take a picture that EXACTLY MATCHES (as close as humanly possible) what an ordinary human eye sees. I will take ANY help I can get. \n\n**The Reason for the Experiment**\n\nI’ll just get to the core of the matter, but please don't stop reading because you think I am a kook. I know how crazy this sounds, but it is what it is. Using an ordinary astronomical simulator, some historical research, and re-translating ancient manuscripts from their original languages, I found the astronomical event that is “the Star of Bethlehem” in the Bible. Yeah, yeah... I know how crazy that sounds. But stay with me here until the end of this post. \n\n**The Background Research Done So Far**\n\nBack in 1968, Roger Sinnott published a famous article in Sky and Telescope magazine in which he identified two conjunctions of Jupiter and Venus on August 12 3BC and June 17 2 BC. He thought they could be related to the Star of Bethlehem. he first had the planets 12 arc minutes apart. The second had the planets 3 arc minutes apart. Sinnott concludes that this second conjunction (due to atmospheric refraction) would have looked like a single point of light in the sky. I had to get a copy of this article from the Library of Congress because there are no internet archives of Sky and Telescope available (even emailed the editors, no luck). But I got it.\n\nWith that copy, I looked up his footnotes and found that Sinnott did this measurement using Bryant Tuckerman’s “[Planetary, Lunar and Solar Positions 601 B.C. to A.D. 1 at 5-Day and 10-Day Intervals,](https://books.google.com/books/about/Planetary_Lunar_and_Solar_Positions_601.html?id=ByEtNvXnv4QC)” from the 1960s to make these measurements. It was calculated using [an IBM 704 computer](https://en.wikipedia.org/wiki/IBM_704). (A dinosaur). As a result, the accuracy of the measurements is atrocious, even though the work of Sinnott is admirable.\n\nHowever, technology has advanced. If you use [VSOP87](https://en.wikipedia.org/wiki/VSOP_(planets)) (which is basically standard and super-accurate for the past few thousand years), we find that the distances of Jupiter and Venus are way closer than Sinnott believed. Rather than 3 arc minutes, on June 17, 2 BC, the distance was on 30 arc SECONDS apart (from the location of Bethlehem). From some places on earth, this event was a mutual planetary occultation. This has been noted before in books like Ernest Martin’s “The Star of Bethlehem: The Star that Astonished the World.”\n\nWhat I have found through my own research is that basically NOBODY pays attention to the earlier conjunction of August 12 3 BC, where the planets were in the eastern sky, about 30 degrees of separation from the Sun, visible between 3:45am and 5:20am (when the sun rose). From a viewing location of Baghdad, their distance was not 12 arc minutes, but instead ranged from 11 arc minutes to 9 arc minutes. **I believe there is something MAJOR here that is overlooked.** \n\nAs Evidence for this, I give you a few of my findings. There is a fun [paper published by an ophthalmologist](https://www.academia.edu/4982885/An_Ancient_Eye_Test_Using_the_Stars_GM_Bohigian_Surv_Ophth_08_53_5_) that tries to compare view of the stars with our modern way of measuring eye-sight. He found that two stars placed 12 arc minutes apart cannot be differentiated if one's vision is 20/30. That's a measure of visual \"acuity.\" Additionally, some people who were older in his experiment couldn't even tell the two stars apart, even though their visual \"acuity\" is 20/20, because other factors such as contrast sensitivity may come into play.  \n\nAs it relates to what naked-eye astronomers see and record, I have found evidence that pre-telescope naked eye astronomers saw conjunctions that were 7 arc minutes apart AT NIGHT (with perfect contrast) as \"shining without visible space between them.\" (See this [paper written by Salvo de Meis](http://adsabs.harvard.edu/full/1993JBAA..103..185D)). Because of this, I think it is possible to demonstrate that the same happened to Jupiter and Venus, which were a distance of 9 arc minutes apart in the rising dawn of the Sun. \n\nThis gives the following understanding of the \"Star of Bethelehm\" that the Magi saw. \"The Star\" is the combined light of Jupiter and Venus. It is true that no astronomical body, either real or hypothetical has been able to be matched to the strange motion that we see described in [Matthew 2](https://www.biblegateway.com/passage/?search=Matthew+2&amp;version=KJV): (\"we have seen his star in the east \" and \"lo, the star, which they saw in the east, went before them, till it came and stood over where the young child was.\") But the CONJUNCTION OF JUPITER AND VENUS INTO A SINGLE POINT OF LIGHT actually DOES fit! It's rather simple, really. \"The Star\" was seen on August 12, 3BC. Then it disappeared, and Jupiter and Venus \"went before them\" on their ordinary paths in the sky. Then, on June 17, 2 BC, \"the star\" that they had seen in the East ARRIVED back in a second conjunction. Then, it fell to the western horizon (because that's what all stars do) over a particular place from the perspective of a naked-eye observer of the stars. That perfectly fits what is described in Matthew 2, just not in the way we modern readers typically think of it. \n\nBut there is work to be done, especially on that first conjunction that was between 11 and 9 arc minutes apart. I need to PROVE that it would have been seen as a SINGLE point of light in the sky. Here's the photographic experiment I want to do, but I need some feedback from people with good photography knowledge to know where it falls short. \n\n**The Opportunity for the Experiment**\n\nWe have an upcoming event: On December 22, 2020, Jupiter and Saturn will have a conjunction in the Western sky. They will be about 30 degrees from the Sun (Just like the August 12, 3 BC conjunction was). \n\nThis means we can almost RECREATE the August 12 3 BC conjunction that Sinnott first identified! What we need to do is record it (by taking a photograph of it) in a way that PRESERVES what a NAKED EYE OBSERVER would have seen. In other words: \"No filter.\" No \"image magnification.\" No \"layered images.\" None of these \"look at this comet neowise looks!\" photo lies. (Impressive and beautiful photography, but not at all accurate).  \n\n**The Plan for the Experiment**\n\nThis is how I propose to do it. I think we need a group of photographers at various locations on earth. (The West Coast is actually a good observations spot from what I have seen on my simulator). They need to use one of those star-tracker mounts to get a steady camera view. They need to use a 50mm camera lens (because as far as I know, that mimics the human eye). The photograph should include some object at a fixed distance from the camera to preserve the right SCALE of the final printed picture (because even if you don't zoom, if you print it out 5 times the size, that still causes the same problem). We would need to take ORDINARY pictures (no image stacking, but I admit, this is where my knowledge is most limited). We should do it throughout the evening on December 22, 2020, until the conjunction is no longer visible. The pictures should have a time-stamp. Using that time stamp, we will have a series of pictures that show what a naked-eye observer would see (with atmospheric turbulance and all) over time. This recrates ONE HALF of the conjunction: The planet Jupiter at 30 degrees of separation from the Sun. \n\nSaturn is not as bright as Venus, but what Saturn CAN do is serve as the \"place holder\" for where Venus WILL GO when Venus also achieves an evening distance from the Sun of 30 degrees. The second part of the experiment is to wait until Venus reaches the same angular separation from the Sun. We repeat the experiment and get the data together. Then, using the location of Saturn as our place-marker, we use whatever photoshop wizardry we need to replace the light-output of Saturn with the accurate light-output of Venus. (This will happen sometime next year). \n\n**The Help I Need**\n\nIf I do a crowd-source experiment of astro-photographers, I need to know WHAT INFORMATION I SHOULD GET FROM THESE OBSERVERS. I need to produce a standard fill-in-the-blank form for them. I know I need to know the Camera (so we know the sensor), the lens (so we know the effect on the image). I know we will need the observing location (city or lat and long). I know we will need some information on the weather (Humidity, barometric pressure, and after that, I have no idea). \n\nIf anyone can help me standardize how to get that \"scale\" measurement in the photo, I would greatly appreciate it. The concept is something I understand, but the execution is not. I would need to be able to explain it to my helpers. \n\nWhen this is done, we will be able to recreate what the August 12, 3 BC conjunction looked like throughout that morning by reverse-engineering these observations of the Jupiter and Saturn conjunction and the Venus photographs. \n\nThat's the basic concept of the experiment, but I need some help from people who are much better at photography than me to take these pictures and who are more skilled in the optics to know how to render an accurate “real-life” view in a picture.\n\nPlease PLEASE give me any feedback you have on this idea. Additionally, PM me if you would like to help.\n\n**Proof That This Is Worth Your Time and That I'm not Crazy**  \nI know that people who usually claim that they've found the Star of Bethlehem are a little bit crazy and their theories are less-than-compelling. You might be wondering why I'm asking this on Reddit and not somewhere \"credentialed.\" The real reason is that astronomy and history are hobbies of mine, and I don't have credentials. I am a lawyer. Academic journals do not listen to me or even read my papers (trust me, I've tried). I need to be so rock-solid on my findings that there are no ways to deny it.\n\nUnfortunately, Reddit is the only place where people are as \"into\" their hobbies as I am. \n\nBut beyond that, I'm going to let you look into what I've found yourself. I'm going to reveal some of my research and link to the underlying sources.  \n\nAs you know, my theory is that \"the star\" of Bethlehem is a pair of close conjunctions of Jupiter and Venus. That's a nice and coherent theory, but how can I PROVE it? Well, I think I can.\n\nThe Roman Historian Tacitus in his Histories [at Book 5 Chapter 13](http://classics.mit.edu/Tacitus/histories.5.v.html) is talking about the Jewish Revolt in 70 AD, which was put down by Vespasian. As context for this revolt, he lists a bunch of “prodigies” or \"omens\" that were observed beforehand. These were the basis of a belief in the East (that is, the Parthian Empire) that “rulers, coming from Judaea, were to acquire universal empire” or (as [recorded by Suetonius](https://penelope.uchicago.edu/Thayer/E/Roman/Texts/Suetonius/12Caesars/Vespasian*.html)) \"men coming from Judaea \\[would\\] rule the world.\" Initially, I wondered where such a prodigy in \"the East\" (not Judaea, but \"the East\") would have come from. I became suspicious that it might be the Star of Bethlehem when I realized that \"the East\" is the same place the Magi were from and where they returned. \n\nHowever, I went back and looked at the document in its original Latin. The FIRST of these omens listed by Tacitus is translated into English as \"There had been seen hosts joining battle in the skies,\" which [in Latin is \"visae per caelum concurrere acies.\"](https://www.thelatinlibrary.com/tacitus/tac.hist5.shtml) This translation seems to be made to agree with Josephus (Described in[Jewish Wars, Book 5, Chapter 5](https://www.gutenberg.org/files/2850/2850-h/2850-h.htm)), who described another strange \"prodigy\" that occurred around this time: \n\n&gt; on the one and twentieth day of the month Artemisius, \\[Jyar,\\] a certain prodigious and incredible phenomenon appeared: I suppose the account of it would seem to be a fable, were it not related by those that saw it, and were not the events that followed it of so considerable a nature as to deserve such signals; for, before sun-setting, chariots and troops of soldiers in their armor were seen running about among the clouds, and surrounding of cities \n\nHowever, I think this is a wrong translation. While the Latin word \"acies\" can be translated as \"an army drawn up for battle,\" it is not so clear that Josephus and Tacitus are reporting the same thing. What I came to find is that \"acies\" [really means is \"sharpness\" or \"sharp tool\" (think of swords drawn), or \"points\" or \"pupil of the eye,\" and even, in a metaphorical sense: BRIGHTNESS (think of swords on a ling of battle gleaming in the sunlight)](https://latin-dictionary.net/search/latin/acies). This is why it is paired with \"armies\" or \"hosts\" in a way that is not natural to English speakers with bombs for war, instead of blades. Check that link to the Latin dictionary entry if you don't believe me. \n\nSo there is a different way to translate it. This means the \"prodigy\" that is related to the belief that \"men coming from Judaea would rule the world\" was described as **\"\\[visae\\] was seen \\[per\\] in \\[caelum\\] the sky \\[concurrere\\] running together \\[acies\\] POINTS.\"** \n\nWhen you actually observe the conjunction of Jupiter and Venus on August 12, 3 BC and June 17 2 BC in an astronomical simulator, you can see that this description matech PERFECTLY to this event, which moves just like the gospel of Matthew describes. This is a description in a non-Biblical 1st century text of the actual Star of Bethlehem, connecting it to a conjunction of two \"points\" in the sky: the planets Jupiter and Venus. \n\n**CONCLUSION** \n\nIf you can help me with this experiment that MUST be run on December 22, 2020, I can actually PROVE my point about the optics using science. \n\nIf you have expertise in these camera optics and photography skills, please comment below to help me out on how I should construct this. \n\nAnyone who would like to participate and make this happen, I'll even put you you on the academic paper I hope to publish if we can agree on the amount of work and stuff. PM me if you'd like to cooperate. \n\nThank you for reading!", "link": "https://www.reddit.com/r/photography/comments/jtl7p7/technical_help_with_an_experiment_involving/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "technical help with an experiment involving astro-photography /!/ this is a weird post, but please hear me out and help me understand how to do what i am describing below. i need some help on how to construct an experiment that uses photography. i also need any help that someone with really good understanding of the optics of cameras and such can do. \n\n**the long and short of this photography expertise need:**\n\ni'm looking to try to \"re-create\" a historical event in astronomy. normally, you can do this easily with an astronomical simulator. however, this particular event needs something more complicated than that. ***i want to know how atmospheric refraction and air turbulence and changing contrast between the sky and the stars changes the view for a naked-eye astronomer.*** the benefits of modern astronomy, telescopes, awesome layered images, long exposures, etc. is a weakness when it comes to trying to recreate what i'm doing. \n\nin short, i need help on how to take a picture that exactly matches (as close as humanly possible) what an ordinary human eye sees. i will take any help i can get. \n\n**the reason for the experiment**\n\ni’ll just get to the core of the matter, but please don't stop reading because you think i am a kook. i know how crazy this sounds, but it is what it is. using an ordinary astronomical simulator, some historical research, and re-translating ancient manuscripts from their original languages, i found the astronomical event that is “the star of bethlehem” in the bible. yeah, yeah... i know how crazy that sounds. but stay with me here until the end of this post. \n\n**the background research done so far**\n\nback in 1968, roger sinnott published a famous article in sky and telescope magazine in which he identified two conjunctions of jupiter and venus on august 12 3bc and june 17 2 bc. he thought they could be related to the star of bethlehem. he first had the planets 12 arc minutes apart. the second had the planets 3 arc minutes apart. sinnott concludes that this second conjunction (due to atmospheric refraction) would have looked like a single point of light in the sky. i had to get a copy of this article from the library of congress because there are no internet archives of sky and telescope available (even emailed the editors, no luck). but i got it.\n\nwith that copy, i looked up his footnotes and found that sinnott did this measurement using bryant tuckerman’s “[planetary, lunar and solar -----> positions !!!  601 b.c. to a.d. 1 at 5-day and 10-day intervals,](https://books.google.com/books/about/planetary_lunar_and_solar_positions_601.html?id=byetnvxnv4qc)” from the 1960s to make these measurements. it was calculated using [an ibm 704 computer](https://en.wikipedia.org/wiki/ibm_704). (a dinosaur). as a result, the accuracy of the measurements is atrocious, even though the work of sinnott is admirable.\n\nhowever, technology has advanced. if you use [vsop87](https://en.wikipedia.org/wiki/vsop_(planets)) (which is basically standard and super-accurate for the past few thousand years), we find that the distances of jupiter and venus are way closer than sinnott believed. rather than 3 arc minutes, on june 17, 2 bc, the distance was on 30 arc seconds apart (from the location of bethlehem). from some places on earth, this event was a mutual planetary occultation. this has been noted before in books like ernest martin’s “the star of bethlehem: the star that astonished the world.”\n\nwhat i have found through my own research is that basically nobody pays attention to the earlier conjunction of august 12 3 bc, where the planets were in the eastern sky, about 30 degrees of separation from the sun, visible between 3:45am and 5:20am (when the sun rose). from a viewing location of baghdad, their distance was not 12 arc minutes, but instead ranged from 11 arc minutes to 9 arc minutes. **i believe there is something major here that is overlooked.** \n\nas evidence for this, i give you a few of my findings. there is a fun [paper published by an ophthalmologist](https://www.academia.edu/4982885/an_ancient_eye_test_using_the_stars_gm_bohigian_surv_ophth_08_53_5_) that tries to compare view of the stars with our modern way of measuring eye-sight. he found that two stars placed 12 arc minutes apart cannot be differentiated if one's vision is 20/30. that's a measure of visual \"acuity.\" additionally, some people who were older in his experiment couldn't even tell the two stars apart, even though their visual \"acuity\" is 20/20, because other factors such as contrast sensitivity may come into play.  \n\nas it relates to what naked-eye astronomers see and record, i have found evidence that pre-telescope naked eye astronomers saw conjunctions that were 7 arc minutes apart at night (with perfect contrast) as \"shining without visible space between them.\" (see this [paper written by salvo de meis](http://adsabs.harvard.edu/full/1993jbaa..103..185d)). because of this, i think it is possible to demonstrate that the same happened to jupiter and venus, which were a distance of 9 arc minutes apart in the rising dawn of the sun. \n\nthis gives the following understanding of the \"star of bethelehm\" that the magi saw. \"the star\" is the combined light of jupiter and venus. it is true that no astronomical body, either real or hypothetical has been able to be matched to the strange motion that we see described in [matthew 2](https://www.biblegateway.com/passage/?search=matthew+2&amp;version=kjv): (\"we have seen his star in the east \" and \"lo, the star, which they saw in the east, went before them, till it came and stood over where the young child was.\") but the conjunction of jupiter and venus into a single point of light actually does fit! it's rather simple, really. \"the star\" was seen on august 12, 3bc. then it disappeared, and jupiter and venus \"went before them\" on their ordinary paths in the sky. then, on june 17, 2 bc, \"the star\" that they had seen in the east arrived back in a second conjunction. then, it fell to the western horizon (because that's what all stars do) over a particular place from the perspective of a naked-eye observer of the stars. that perfectly fits what is described in matthew 2, just not in the way we modern readers typically think of it. \n\nbut there is work to be done, especially on that first conjunction that was between 11 and 9 arc minutes apart. i need to prove that it would have been seen as a single point of light in the sky. here's the photographic experiment i want to do, but i need some feedback from people with good photography knowledge to know where it falls short. \n\n**the opportunity for the experiment**\n\nwe have an upcoming event: on december 22, 2020, jupiter and saturn will have a conjunction in the western sky. they will be about 30 degrees from the sun (just like the august 12, 3 bc conjunction was). \n\nthis means we can almost recreate the august 12 3 bc conjunction that sinnott first identified! what we need to do is record it (by taking a photograph of it) in a way that preserves what a naked eye observer would have seen. in other words: \"no filter.\" no \"image magnification.\" no \"layered images.\" none of these \"look at this comet neowise looks!\" photo lies. (impressive and beautiful photography, but not at all accurate).  \n\n**the plan for the experiment**\n\nthis is how i propose to do it. i think we need a group of photographers at various locations on earth. (the west coast is actually a good observations spot from what i have seen on my simulator). they need to use one of those star-tracker mounts to get a steady camera view. they need to use a 50mm camera lens (because as far as i know, that mimics the human eye). the photograph should include some object at a fixed distance from the camera to preserve the right scale of the final printed picture (because even if you don't zoom, if you print it out 5 times the size, that still causes the same problem). we would need to take ordinary pictures (no image stacking, but i admit, this is where my knowledge is most limited). we should do it throughout the evening on december 22, 2020, until the conjunction is no longer visible. the pictures should have a time-stamp. using that time stamp, we will have a series of pictures that show what a naked-eye observer would see (with atmospheric turbulance and all) over time. this recrates one half of the conjunction: the planet jupiter at 30 degrees of separation from the sun. \n\nsaturn is not as bright as venus, but what saturn can do is serve as the \"place holder\" for where venus will go when venus also achieves an evening distance from the sun of 30 degrees. the second part of the experiment is to wait until venus reaches the same angular separation from the sun. we repeat the experiment and get the data together. then, using the location of saturn as our place-marker, we use whatever photoshop wizardry we need to replace the light-output of saturn with the accurate light-output of venus. (this will happen sometime next year). \n\n**the help i need**\n\nif i do a crowd-source experiment of astro-photographers, i need to know what information i should get from these observers. i need to produce a standard fill-in-the-blank form for them. i know i need to know the camera (so we know the sensor), the lens (so we know the effect on the image). i know we will need the observing location (city or lat and long). i know we will need some information on the weather (humidity, barometric pressure, and after that, i have no idea). \n\nif anyone can help me standardize how to get that \"scale\" measurement in the photo, i would greatly appreciate it. the concept is something i understand, but the execution is not. i would need to be able to explain it to my helpers. \n\nwhen this is done, we will be able to recreate what the august 12, 3 bc conjunction looked like throughout that morning by reverse-engineering these observations of the jupiter and saturn conjunction and the venus photographs. \n\nthat's the basic concept of the experiment, but i need some help from people who are much better at photography than me to take these pictures and who are more skilled in the optics to know how to render an accurate “real-life” view in a picture.\n\nplease please give me any feedback you have on this idea. additionally, pm me if you would like to help.\n\n**proof that this is worth your time and that i'm not crazy**  \ni know that people who usually claim that they've found the star of bethlehem are a little bit crazy and their theories are less-than-compelling. you might be wondering why i'm asking this on reddit and not somewhere \"credentialed.\" the real reason is that astronomy and history are hobbies of mine, and i don't have credentials. i am a lawyer. academic journals do not listen to me or even read my papers (trust me, i've tried). i need to be so rock-solid on my findings that there are no ways to deny it.\n\nunfortunately, reddit is the only place where people are as \"into\" their hobbies as i am. \n\nbut beyond that, i'm going to let you look into what i've found yourself. i'm going to reveal some of my research and link to the underlying sources.  \n\nas you know, my theory is that \"the star\" of bethlehem is a pair of close conjunctions of jupiter and venus. that's a nice and coherent theory, but how can i prove it? well, i think i can.\n\nthe roman historian tacitus in his histories [at book 5 chapter 13](http://classics.mit.edu/tacitus/histories.5.v.html) is talking about the jewish revolt in 70 ad, which was put down by vespasian. as context for this revolt, he lists a bunch of “prodigies” or \"omens\" that were observed beforehand. these were the basis of a belief in the east (that is, the parthian empire) that “rulers, coming from judaea, were to acquire universal empire” or (as [recorded by suetonius](https://penelope.uchicago.edu/thayer/e/roman/texts/suetonius/12caesars/vespasian*.html)) \"men coming from judaea \\[would\\] rule the world.\" initially, i wondered where such a prodigy in \"the east\" (not judaea, but \"the east\") would have come from. i became suspicious that it might be the star of bethlehem when i realized that \"the east\" is the same place the magi were from and where they returned. \n\nhowever, i went back and looked at the document in its original latin. the first of these omens listed by tacitus is translated into english as \"there had been seen hosts joining battle in the skies,\" which [in latin is \"visae per caelum concurrere acies.\"](https://www.thelatinlibrary.com/tacitus/tac.hist5.shtml) this translation seems to be made to agree with josephus (described in[jewish wars, book 5, chapter 5](https://www.gutenberg.org/files/2850/2850-h/2850-h.htm)), who described another strange \"prodigy\" that occurred around this time: \n\n&gt; on the one and twentieth day of the month artemisius, \\[jyar,\\] a certain prodigious and incredible phenomenon appeared: i suppose the account of it would seem to be a fable, were it not related by those that saw it, and were not the events that followed it of so considerable a nature as to deserve such signals; for, before sun-setting, chariots and troops of soldiers in their armor were seen running about among the clouds, and surrounding of cities \n\nhowever, i think this is a wrong translation. while the latin word \"acies\" can be translated as \"an army drawn up for battle,\" it is not so clear that josephus and tacitus are reporting the same thing. what i came to find is that \"acies\" [really means is \"sharpness\" or \"sharp tool\" (think of swords drawn), or \"points\" or \"pupil of the eye,\" and even, in a metaphorical sense: brightness (think of swords on a ling of battle gleaming in the sunlight)](https://latin-dictionary.net/search/latin/acies). this is why it is paired with \"armies\" or \"hosts\" in a way that is not natural to english speakers with bombs for war, instead of blades. check that link to the latin dictionary entry if you don't believe me. \n\nso there is a different way to translate it. this means the \"prodigy\" that is related to the belief that \"men coming from judaea would rule the world\" was described as **\"\\[visae\\] was seen \\[per\\] in \\[caelum\\] the sky \\[concurrere\\] running together \\[acies\\] points.\"** \n\nwhen you actually observe the conjunction of jupiter and venus on august 12, 3 bc and june 17 2 bc in an astronomical simulator, you can see that this description matech perfectly to this event, which moves just like the gospel of matthew describes. this is a description in a non-biblical 1st century text of the actual star of bethlehem, connecting it to a conjunction of two \"points\" in the sky: the planets jupiter and venus. \n\n**conclusion** \n\nif you can help me with this experiment that must be run on december 22, 2020, i can actually prove my point about the optics using science. \n\nif you have expertise in these camera optics and photography skills, please comment below to help me out on how i should construct this. \n\nanyone who would like to participate and make this happen, i'll even put you you on the academic paper i hope to publish if we can agree on the amount of work and stuff. pm me if you'd like to cooperate. \n\nthank you for reading!", "sortedWord": "None", "identifyer": 86471, "year": "2020"}, {"Unnamed: 0": 84645, "autor": "Pocket714", "date": 1582501287000, "content": "Interview with Linda Kroff /!/   \n\n**Introduction –** My name is Farris Ramadan and I was granted the opportunity to meet with Lind Kroff in person through an email request. I was a student in one of her advanced theory classes and had built a good standing with her. I was always curious about her career as a photographer, especially since she was made the head of the photography department at CSU Fullerton. We arranged to meet at her office after she was done teaching an analog photography class, but instead found it to be more comfortable in the classroom itself. We then entered the classroom and sat down at the same, two chairs we would sit in when I took her class previously. This created an atmosphere and reminiscence, rather than a formal environment. Once we settled in and got the formalities aside, the questions started rolling and she was more than happy to oblige.\n\n**FR – Well, let’s jump into the questions that no one wants to answer. When were you born and where?**\n\n**LK –** I was born on December 16th, 1960, in Redwood City, California. It’s just a bit south of San Francisco.\n\n**FR – And what was it like living there? Did you ever face any challenges, because you are female, growing up in that time?**\n\n**LK -** Honestly, no. I was very lucky. My parents were both well-educated people. My father attended UC Berkley and became a lawyer while my mom had studied at Stanford. My parents believed in me and that I could be what I wanted to be. It also didn’t hurt to grow up in a progressive area, so, I must thank the privilege I was given in not being told what a woman ought to be like many others face.\n\n**FR – Interesting, that does sound good, not having any expectations imposed upon you. So, have you lived in California your whole life?**\n\n**LK –** Oh no, when I graduated from high school in 1978, I went to go study literature at the University of Colorado.\n\n**FR – So, you weren’t immediately drawn to photography?**\n\n**LK –** No, I didn’t have much of an idea of what I wanted to do, but I did know what interested me. I ended up studying English, Spanish, humanities, art, and music. This went on until I graduated in 1983.\n\n**FR – So, when exactly do you think photography first made an impression in your life then?**\n\n**LK –** If I had to pick a defining moment, it would have to be in 1981 when I did a study abroad program in Spain. I spent a year there and was immersed in the culture. This forced me to have to quickly pick up Spanish as a second language. But anyways, I had a hard time relating to people and found one of the easiest ways to capture my feelings or see things universally, regardless of one’s origin, was through photography. Everybody can see a picture and tell what it is if the subject matter is purely representational.\n\n**FR – So, did you use that newfound passion and pursue photography after you graduated?**\n\n**LK –** Somewhat I would say. I lived in Boulder, Colorado for two more years after I graduated and pursued my own independent work. But of course, that’s not going to pay the bills. Believe it or not, I got a job at the time that was called a plant technician. It was a do-nothing job. All I had to do was come into the office after hours and water any plants they had. Can you believe such a job existed? But hey, it paid my way while I did my exploration of photography.\n\n**FR – That does sound funny. But we all do what we must do. So, obviously you have your master’s degree, because you’re a full-time faculty member at CSU Fullerton. Where did you get your degree? And was photography your new course of study?**\n\n**LK –** Yes! I did study photography for my master’s degree. Well, the program was called experimental media, because it also focused on installations and lighting. I went to the Art Institute of Chicago in 1986 to get my master’s, because the area was a great hub for artists, much like one would think of Los Angeles or New York.\n\n**FR – Wow, that must have been expensive! Did you save up money from your work as a plant technician? Or, did you have to take out student loans?**\n\n**LK –** Actually, I submitted a portfolio from my independent work and was awarded a full scholarship! It paid for three quarters of the total cost for me to get my degree. I graduated with my master’s in 1989 and did a few art shows during my time in Chicago.\n\n**FR – So, did you decide to come back to California after that to teach?**\n\n**LK –** Nope. Believe it or not, my first teaching position was at the University of North Carolina, Charlotte. Now, that’s the first place I ever experienced sexism, to no one’s surprise. I mean, it is the south and what else would you expect?\n\n**FR – Was that the worst sexism you have ever faced?**\n\n**LK –** No, but I’ll save that for another time.\n\n**FR – Fair enough, so, when did you start teaching at CSU Fullerton?**\n\n**LK –** Well, I left the other university in 1996 and came back to California. I spent about three years doing more photography work and then became a faculty member of CSU Fullerton in 1999. I have been teaching here for 20 years and became the department head of photography in 2008.\n\n**FR – Sounds like you found a place to settle in. Has it been a fulfilling job?**\n\n**LK –** Absolutely, I love teaching. You get to meet a wide variety of people and get to keep learning, even as a teacher. I have had the privilege of meeting so many wonderful staff members and students over the years.\n\n**Conclusion –** All in all, Linda Kroff was a very fun person to talk to. Her energetic personality and laid-back attitude made the interview feel more casual and less formal, which really allowed the conversation to happen organically. She was very informative and honest about her experiences. She was genuinely trying to give me advice about things that she wished she had known before entering the world of teaching, because that is an aspiration of mine after I work in my field of study for a bit. And especially, because of how open she was about the events in her life, she felt more sincere than others usually come off to be. Overall, I enjoyed our chat and will hold the advice she gave me to heart.", "link": "https://www.reddit.com/r/photography/comments/f8i3w5/interview_with_linda_kroff/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "interview with linda kroff /!/   \n\n**introduction –** my name is farris ramadan and i was granted the opportunity to meet with lind kroff in person through an email request. i was a student in one of her advanced theory classes and had built a good standing with her. i was always curious about her career as a photographer, especially since she was made the head of the photography department at csu fullerton. we arranged to meet at her office after she was done teaching an analog photography class, but instead found it to be more comfortable in the classroom itself. we then entered the classroom and sat down at the same, two chairs we would sit in when i took her class previously. this created an atmosphere and reminiscence, rather than a formal environment. once we settled in and got the formalities aside, the questions started rolling and she was more than happy to oblige.\n\n**fr – well, let’s jump into the questions that no one wants to answer. when were you born and where?**\n\n**lk –** i was born on december 16th, 1960, in redwood city, california. it’s just a bit south of san francisco.\n\n**fr – and what was it like living there? did you ever face any challenges, because you are female, growing up in that time?**\n\n**lk -** honestly, no. i was very lucky. my parents were both well-educated people. my father attended uc berkley and became a lawyer while my mom had studied at stanford. my parents believed in me and that i could be what i wanted to be. it also didn’t hurt to grow up in a progressive area, so, i must thank the privilege i was given in not being told what a woman ought to be like many others face.\n\n**fr – interesting, that does sound good, not having any expectations imposed upon you. so, have you lived in california your whole life?**\n\n**lk –** oh no, when i graduated from high school in 1978, i went to go study literature at the university of colorado.\n\n**fr – so, you weren’t immediately drawn to photography?**\n\n**lk –** no, i didn’t have much of an idea of what i wanted to do, but i did know what interested me. i ended up studying english, spanish, humanities, art, and music. this went on until i graduated in 1983.\n\n**fr – so, when exactly do you think photography first made an impression in your life then?**\n\n**lk –** if i had to pick a defining moment, it would have to be in 1981 when i did a study abroad program in spain. i spent a year there and was immersed in the culture. this forced me to have to quickly pick up spanish as a second language. but anyways, i had a hard time relating to people and found one of the easiest ways to capture my feelings or see things universally, regardless of one’s origin, was through photography. everybody can see a picture and tell what it is if the subject matter is purely representational.\n\n**fr – so, did you use that newfound passion and pursue photography after you graduated?**\n\n**lk –** somewhat i would say. i lived in boulder, colorado for two more years after i graduated and pursued my own independent work. but of course, that’s not going to pay the bills. believe it or not, i got a job at the time that was called a plant technician. it was a do-nothing job. all i had to do was come into the office after hours and water any plants they had. can you believe such a job existed? but hey, it paid my way while i did my exploration of photography.\n\n**fr – that does sound funny. but we all do what we must do. so, obviously you have your master’s degree, because you’re a full-time faculty member at csu fullerton. where did you get your degree? and was photography your new course of study?**\n\n**lk –** yes! i did study photography for my master’s degree. well, the program was called experimental media, because it also focused on installations and lighting. i went to the art institute of chicago in 1986 to get my master’s, because the area was a great hub for artists, much like one would think of los angeles or new york.\n\n**fr – wow, that must have been expensive! did you save up money from your work as a plant technician? or, did you have to take out student loans?**\n\n**lk –** actually, i submitted a portfolio from my independent work and was awarded a full scholarship! it paid for three quarters of the total cost for me to get my degree. i graduated with my master’s in 1989 and did a few art shows during my time in chicago.\n\n**fr – so, did you decide to come back to california after that to teach?**\n\n**lk –** nope. believe it or not, my first teaching -----> position !!!  was at the university of north carolina, charlotte. now, that’s the first place i ever experienced sexism, to no one’s surprise. i mean, it is the south and what else would you expect?\n\n**fr – was that the worst sexism you have ever faced?**\n\n**lk –** no, but i’ll save that for another time.\n\n**fr – fair enough, so, when did you start teaching at csu fullerton?**\n\n**lk –** well, i left the other university in 1996 and came back to california. i spent about three years doing more photography work and then became a faculty member of csu fullerton in 1999. i have been teaching here for 20 years and became the department head of photography in 2008.\n\n**fr – sounds like you found a place to settle in. has it been a fulfilling job?**\n\n**lk –** absolutely, i love teaching. you get to meet a wide variety of people and get to keep learning, even as a teacher. i have had the privilege of meeting so many wonderful staff members and students over the years.\n\n**conclusion –** all in all, linda kroff was a very fun person to talk to. her energetic personality and laid-back attitude made the interview feel more casual and less formal, which really allowed the conversation to happen organically. she was very informative and honest about her experiences. she was genuinely trying to give me advice about things that she wished she had known before entering the world of teaching, because that is an aspiration of mine after i work in my field of study for a bit. and especially, because of how open she was about the events in her life, she felt more sincere than others usually come off to be. overall, i enjoyed our chat and will hold the advice she gave me to heart.", "sortedWord": "None", "identifyer": 86976, "year": "2020"}, {"Unnamed: 0": 84893, "autor": "artful_alien", "date": 1584442570000, "content": "Non-contact Camera Club activity ideas /!/ Hi everyone,\n\nI’m on the committee of my local camera club, and we have had to cancel all upcoming meetings and excursions due to the dreaded ‘c’ word!\n\nI’m trying to come up with some ideas for ways to virtually connect in the weeks and months to come, so I thought I’d canvas for ideas - there would be thousands of clubs worldwide in the same position right now!\n\nWe have an active Facebook group and monthly competitions (theme images etc) which will keep going - but I want to do something extra to really build more of an online presence, and a real community presence.\n\nI’ll note that we are not (yet) under lockdown so we are allowed out of the house - but are recommended to stay away from gatherings etc.\n\nSome ideas:\n- editing challenges (one image shared for members to edit as they wish)\n- more frequent theme challenges\n- ‘synchronized sunset’ or similar shoot (everyone shooting from their own location)\n- a Facebook ‘watch party’ to watch a tutorial or documentary together on Facebook and discuss \n- ‘what is this’ or ‘where in the world is this’ (members submit abstract or macros and members have to guess what / where it is)\n- virtual club meetings (I’m trying to find software that is easy and cheap / free - grateful for suggestions)\n- enter some photography competitions (I’d love any suggestions for group competitions particularly)\n\nPlease help me add to this list! I’d love to hear your activities / challenges / online portal ideas!!", "link": "https://www.reddit.com/r/photography/comments/fk3a7b/noncontact_camera_club_activity_ideas/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "non-contact camera club activity ideas /!/ hi everyone,\n\ni’m on the committee of my local camera club, and we have had to cancel all upcoming meetings and excursions due to the dreaded ‘c’ word!\n\ni’m trying to come up with some ideas for ways to virtually connect in the weeks and months to come, so i thought i’d canvas for ideas - there would be thousands of clubs worldwide in the same -----> position !!!  right now!\n\nwe have an active facebook group and monthly competitions (theme images etc) which will keep going - but i want to do something extra to really build more of an online presence, and a real community presence.\n\ni’ll note that we are not (yet) under lockdown so we are allowed out of the house - but are recommended to stay away from gatherings etc.\n\nsome ideas:\n- editing challenges (one image shared for members to edit as they wish)\n- more frequent theme challenges\n- ‘synchronized sunset’ or similar shoot (everyone shooting from their own location)\n- a facebook ‘watch party’ to watch a tutorial or documentary together on facebook and discuss \n- ‘what is this’ or ‘where in the world is this’ (members submit abstract or macros and members have to guess what / where it is)\n- virtual club meetings (i’m trying to find software that is easy and cheap / free - grateful for suggestions)\n- enter some photography competitions (i’d love any suggestions for group competitions particularly)\n\nplease help me add to this list! i’d love to hear your activities / challenges / online portal ideas!!", "sortedWord": "None", "identifyer": 87235, "year": "2020"}, {"Unnamed: 0": 85463, "autor": "n0OOop", "date": 1578587746000, "content": "Is there a free alternative Getty Images? /!/ I am experimenting with a visual media app and I find Getty images is useful for its latest news images. \n\nAs much as I would love to compensate the creatives I'm sadly in no position to pay $500 per image. Can you suggest a free alternative until I can afford it?", "link": "https://www.reddit.com/r/photography/comments/emc3lz/is_there_a_free_alternative_getty_images/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is there a free alternative getty images? /!/ i am experimenting with a visual media app and i find getty images is useful for its latest news images. \n\nas much as i would love to compensate the creatives i'm sadly in no -----> position !!!  to pay $500 per image. can you suggest a free alternative until i can afford it?", "sortedWord": "None", "identifyer": 87829, "year": "2020"}, {"Unnamed: 0": 85549, "autor": "blitzkrieg9", "date": 1579734684000, "content": "Hello! I know just enough about photography to make a funny post about photography elsewhere. Please help me understand/ interpret what my brain came up with! /!/ So, this is what I posted:  \n\n\"Agree 100%.  That looks like a Nikon P-3100b macro enhanced lens.  Don't get me wrong, it's a great lens. But it's best used in low light conditions from a tripod. Unless he preadjusted his O and T levels, that shot is probably going to be severely overexposed resulting in \"grayscale\".  Not to mention the rapid motion and \"kneepod\" shooting position.  \n\nAlso, I just made all that up and dont know shit about photography.\"  \n\n\nI was responding to a NSFW post about a creepy cameraman.  I can post link here if allowed. Anyway, there is a grain of truth in my statements, but I don't know how I know. \n\n1) That lens sounds legit, right?  Don't cameras and lenses have alphanumeric names for some reason?\n\n2) cameras have an adjustable \"level\", yes?  I want to say O level is correct, but I can't imagine what that would stand for. I think it has something to do with light or exposure. L level? E level?  What am I thinking of?\n\n3) overexposed I'm certain is a term. Right?  I was going to say something about contrast, but I switched to \"grayscale\" instead. But, I was thinking \"whiteout\".  Is that a  term?  Or whiteness?  Or white level?  \n\n4) i think i invented/  coined \"kneepod\".  But now I'm thinking that is prob already a term. Is it?  Is that a thing?\n\nThanks in advance.", "link": "https://www.reddit.com/r/photography/comments/esjz3m/hello_i_know_just_enough_about_photography_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hello! i know just enough about photography to make a funny post about photography elsewhere. please help me understand/ interpret what my brain came up with! /!/ so, this is what i posted:  \n\n\"agree 100%.  that looks like a nikon p-3100b macro enhanced lens.  don't get me wrong, it's a great lens. but it's best used in low light conditions from a tripod. unless he preadjusted his o and t levels, that shot is probably going to be severely overexposed resulting in \"grayscale\".  not to mention the rapid motion and \"kneepod\" shooting -----> position !!! .  \n\nalso, i just made all that up and dont know shit about photography.\"  \n\n\ni was responding to a nsfw post about a creepy cameraman.  i can post link here if allowed. anyway, there is a grain of truth in my statements, but i don't know how i know. \n\n1) that lens sounds legit, right?  don't cameras and lenses have alphanumeric names for some reason?\n\n2) cameras have an adjustable \"level\", yes?  i want to say o level is correct, but i can't imagine what that would stand for. i think it has something to do with light or exposure. l level? e level?  what am i thinking of?\n\n3) overexposed i'm certain is a term. right?  i was going to say something about contrast, but i switched to \"grayscale\" instead. but, i was thinking \"whiteout\".  is that a  term?  or whiteness?  or white level?  \n\n4) i think i invented/  coined \"kneepod\".  but now i'm thinking that is prob already a term. is it?  is that a thing?\n\nthanks in advance.", "sortedWord": "None", "identifyer": 87916, "year": "2020"}, {"Unnamed: 0": 86803, "autor": "bespectacledbalatron", "date": 1596705560000, "content": "What's the correct way to retract the front element back to its default position? /!/ Yesterday I used my 55-250 mm kit lens for the first time, while putting it back in my camera bag I noticed the front element was protruding out a bit even after I set the focal length back to 55. I figured it was because of the focus, so I decided to move the ring manually but I made a rookie mistake here. I tried to do that while it was in AF. The ring turned very little and I felt a some resistance in it as if the ring was locked, so I stopped immediately. That's when it struck me that the switch on the lens was set to AF. I pushed the switch to MF and turned the ring back to its original position. All this while my camera was switched off. Is this the correct way? Is my lens going to be fine?", "link": "https://www.reddit.com/r/photography/comments/i4oivj/whats_the_correct_way_to_retract_the_front/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what's the correct way to retract the front element back to its default -----> position !!! ? /!/ yesterday i used my 55-250 mm kit lens for the first time, while putting it back in my camera bag i noticed the front element was protruding out a bit even after i set the focal length back to 55. i figured it was because of the focus, so i decided to move the ring manually but i made a rookie mistake here. i tried to do that while it was in af. the ring turned very little and i felt a some resistance in it as if the ring was locked, so i stopped immediately. that's when it struck me that the switch on the lens was set to af. i pushed the switch to mf and turned the ring back to its original position. all this while my camera was switched off. is this the correct way? is my lens going to be fine?", "sortedWord": "None", "identifyer": 89218, "year": "2020"}, {"Unnamed: 0": 86911, "autor": "Nik47374", "date": 1597437694000, "content": "I need help /!/ I am an amateur and i started trying to shoot portraits but i'm having a lot of problems with the model, i don't know what to say and how to set her pose i'm having a lot of problems with hand position.\nSorry for bad english", "link": "https://www.reddit.com/r/photography/comments/i9tvcu/i_need_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i need help /!/ i am an amateur and i started trying to shoot portraits but i'm having a lot of problems with the model, i don't know what to say and how to set her pose i'm having a lot of problems with hand -----> position !!! .\nsorry for bad english", "sortedWord": "None", "identifyer": 89329, "year": "2020"}, {"Unnamed: 0": 86925, "autor": "MaleficentRain", "date": 1597423591000, "content": "Multi-Stage photos - Looking for ideas /!/ I'm looking for tutorials or how to's for a shoot I'm hoping to do.\n\nI'm hoping to have a dimly lit room on one side, and a brightly lit room on the other. Ideally I'd be able to do a single shot,but can understand if I need to do seperate shots. Models would be mirrored or similarly positioned.\n\nIf anybody has any ideas or suggestions, let me know", "link": "https://www.reddit.com/r/photography/comments/i9phae/multistage_photos_looking_for_ideas/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "multi-stage photos - looking for ideas /!/ i'm looking for tutorials or how to's for a shoot i'm hoping to do.\n\ni'm hoping to have a dimly lit room on one side, and a brightly lit room on the other. ideally i'd be able to do a single shot,but can understand if i need to do seperate shots. models would be mirrored or similarly -----> positioned !!! .\n\nif anybody has any ideas or suggestions, let me know", "sortedWord": "None", "identifyer": 89343, "year": "2020"}, {"Unnamed: 0": 87860, "autor": "kopinewbie", "date": 1606471142000, "content": "Manfrotto tripod adjustment won't rotate - any tips? /!/ Hi all,\n\nI have an old Manfrotto 7303YB tripod that has little adjusters at the top of the legs which rotate to control how much the leg expands out.  However the adjuster knob on one leg somehow rotated the wrong way and I can't get it to rotate back to the proper position.  Anyone have any tips on how to fix this?  I couldn't find any screws on the tripod which seemed relevant...\n\nHere's a picture of the faulty part circled, the other adjuster is in the correct position: [https://imgur.com/a/FTsnhDA](https://imgur.com/a/FTsnhDA)", "link": "https://www.reddit.com/r/photography/comments/k1yfwq/manfrotto_tripod_adjustment_wont_rotate_any_tips/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "manfrotto tripod adjustment won't rotate - any tips? /!/ hi all,\n\ni have an old manfrotto 7303yb tripod that has little adjusters at the top of the legs which rotate to control how much the leg expands out.  however the adjuster knob on one leg somehow rotated the wrong way and i can't get it to rotate back to the proper -----> position !!! .  anyone have any tips on how to fix this?  i couldn't find any screws on the tripod which seemed relevant...\n\nhere's a picture of the faulty part circled, the other adjuster is in the correct position: [https://imgur.com/a/ftsnhda](https://imgur.com/a/ftsnhda)", "sortedWord": "None", "identifyer": 90306, "year": "2020"}, {"Unnamed: 0": 87980, "autor": "pxl_dog", "date": 1607195118000, "content": "Posing your models? /!/ Whenever I shoot with models, I always have a hard time directing them to get the shot I want. I can always see the image so clearly in my head, and verbal direction is only mildly effective. And I'm also incredibly uncomfortable with the idea of physically positioning my models because the last thing I want is to graduate college with the \"creepy photographer\" reputation. \n\nDoes anyone have any advice on how to direct and respectfully pose models so that I can make my shoots more efficient without being disrespectful?", "link": "https://www.reddit.com/r/photography/comments/k7dh8x/posing_your_models/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "posing your models? /!/ whenever i shoot with models, i always have a hard time directing them to get the shot i want. i can always see the image so clearly in my head, and verbal direction is only mildly effective. and i'm also incredibly uncomfortable with the idea of physically -----> positioning !!!  my models because the last thing i want is to graduate college with the \"creepy photographer\" reputation. \n\ndoes anyone have any advice on how to direct and respectfully pose models so that i can make my shoots more efficient without being disrespectful?", "sortedWord": "None", "identifyer": 90434, "year": "2020"}, {"Unnamed: 0": 88344, "autor": "throwaway15975364287", "date": 1603309416000, "content": "The future of tripods? /!/ Watching a video from one of my subscribed channels, a well-designed tripod was one of the features of the video and it got me wondering: Is there already or will there eventually (read: relatively soon) be an auto-leveling tripod? To my knowledge, currently, each leg has to be manually extended and locked in place. That's fine an' all, but I think there'd be a slew of sales for a tripod where you simply hold it at the height you need it at, push a button (or activate it in whatever other way), the legs \\[independently\\] extend to their respective resting points (regardless of level), lock in place, and retract (upon footage completion) back to their \\[locked\\] carrying position at the press of a button (or again, some other method). Mechanically, I have no idea how such a product could be streamlined and made lightweight, but I do believe that nothing is impossible, so I ask you all; is this already or could this soon be a thing? \n\nNote: I'm not a photographer, just a creative mind who gets ideas from his surroundings.", "link": "https://www.reddit.com/r/photography/comments/jfk36u/the_future_of_tripods/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the future of tripods? /!/ watching a video from one of my subscribed channels, a well-designed tripod was one of the features of the video and it got me wondering: is there already or will there eventually (read: relatively soon) be an auto-leveling tripod? to my knowledge, currently, each leg has to be manually extended and locked in place. that's fine an' all, but i think there'd be a slew of sales for a tripod where you simply hold it at the height you need it at, push a button (or activate it in whatever other way), the legs \\[independently\\] extend to their respective resting points (regardless of level), lock in place, and retract (upon footage completion) back to their \\[locked\\] carrying -----> position !!!  at the press of a button (or again, some other method). mechanically, i have no idea how such a product could be streamlined and made lightweight, but i do believe that nothing is impossible, so i ask you all; is this already or could this soon be a thing? \n\nnote: i'm not a photographer, just a creative mind who gets ideas from his surroundings.", "sortedWord": "None", "identifyer": 90817, "year": "2020"}], "name": "positionphotography2020"}