{"interestingcomments": [{"Unnamed: 0": 97432, "autor": "SuperConDrugs", "date": 1564604670000, "content": "Freelance Sports Photographers - how did you get your foot in the door? /!/ To those of you that do freelance sports photography, how did you get your foot in the door? Or in other words, how did you first build a client base and start to get consistent jobs? Are you working for agencies, or are you simply being reached out to and recommended by former clients? And how did you get your name out there in the first place?\n\nI'm currently working a creative directors position at a non-profit. I really enjoy what I'm doing, so I'm not really considering leaving to go full time photography, but I would really love to do some side jobs on weekends for some extra money. I've done a handful of jobs in the past where I've been reached out to directly, and have absolutely love it, but they were one-off gigs and projects and they seem to have dried up in the recent months. I'm new to business side of photography, so forgive me if this is a noob question. I'm just not quite sure how freelance sports photography typically works", "link": "https://www.reddit.com/r/photography/comments/ckdwnn/freelance_sports_photographers_how_did_you_get/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "freelance sports photographers - how did you get your foot in the door? /!/ to those of you that do freelance sports photography, how did you get your foot in the door? or in other words, how did you first build a client base and start to get consistent jobs? are you working for agencies, or are you simply being reached out to and recommended by former clients? and how did you get your name out there in the first place?\n\ni'm currently working a creative directors -----> position !!!  at a non-profit. i really enjoy what i'm doing, so i'm not really considering leaving to go full time photography, but i would really love to do some side jobs on weekends for some extra money. i've done a handful of jobs in the past where i've been reached out to directly, and have absolutely love it, but they were one-off gigs and projects and they seem to have dried up in the recent months. i'm new to business side of photography, so forgive me if this is a noob question. i'm just not quite sure how freelance sports photography typically works", "sortedWord": "None", "identifyer": 70, "year": "2019"}, {"Unnamed: 0": 97804, "autor": "clairvoyant_basic", "date": 1569417212000, "content": "How to show buildings, especially sky, trees, path without showing emptiness? /!/ Gmaps position [https://www.google.de/maps/@49.4915661,8.550692,82a,35y,9.94h,59.07t/data=!3m1!1e3](https://www.google.de/maps/@49.4915661,8.550692,82a,35y,9.94h,59.07t/data=!3m1!1e3)\n\nhttps://i.redd.it/5wjb0mlgpqo31.jpg", "link": "https://www.reddit.com/r/photography/comments/d933tn/how_to_show_buildings_especially_sky_trees_path/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how to show buildings, especially sky, trees, path without showing emptiness? /!/ gmaps -----> position !!!  [https://www.google.de/maps/@49.4915661,8.550692,82a,35y,9.94h,59.07t/data=!3m1!1e3](https://www.google.de/maps/@49.4915661,8.550692,82a,35y,9.94h,59.07t/data=!3m1!1e3)\n\nhttps://i.redd.it/5wjb0mlgpqo31.jpg", "sortedWord": "None", "identifyer": 453, "year": "2019"}, {"Unnamed: 0": 97850, "autor": "shootnedit", "date": 1569370701000, "content": "What questions should I ask/things I should know for an interview for a photography position? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/d8vsqw/what_questions_should_i_askthings_i_should_know/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what questions should i ask/things i should know for an interview for a photography -----> position !!! ? /!/ [removed]", "sortedWord": "None", "identifyer": 501, "year": "2019"}, {"Unnamed: 0": 98820, "autor": "Lurkin_Yo_House", "date": 1570580348000, "content": "Safety While Shooting /!/ I am sure that most of you saw this post today about a photographer shot 9 times by three men. [post](https://www.reddit.com/r/photography/comments/dexbsu/photographer_shot_nine_times_by_three_teens_who/)\n\nI saw that post thinking there would be more discussion and information on safety while shooting and i wasn't really satisfied with the conversations so i thought i would start a post of its own to talk about safety. This post wont be talking about firearms as I feel there are more important things to talk about. i hope that you all personally share some tips that you have or things you have noticed that you feel would be helpful for other photographers.\n\nI'm not very good with words when it comes to writing but i think my points are simple and easy to digest.\n\nThe Risks and How to Manage Them :\n\n**Valuable items**\n\nI think its important for us as photographers to understand that our hobby/job puts us in a position that draws unwanted attention to us. Being in possession of valuable items is something that is going to draw attention to even you regardless of where you are.\n\nEven someone who doesn't know any names of any camera companies could spot your 70-200f2.8 and know that the camera is valuable. Your large backpack that you pulled your camera out of most certainly will indicate to potential thieves that you have even more than you currently have in your hand.\n\nThe best way to reduce the risk associated with possessing cameras is by reducing the appearance of you camera and making yourself look less desirable.\n\n**Lack of Situational Awareness**\n\nWhen you are looking through the viewfinder or staring at the monitor it is very easy to get completely absorbed for long periods of time into what you are doing. It is important to work on maintaining your awareness of your surroundings.\n\nIt is very easy to spot when someone is not paying attention to their surroundings and this is something that many thieves and assailants look for when picking a target. Maintaining a level of awareness makes you a less vulnerable target.\n\nIn addition to making you less likely to fall victim to someone else it also helps keep you safe from yourself. Where I usually find myself taking pictures there are usually tripping hazards or other things that i would be better off avoiding.\n\nAVOID TUNNEL VISION. This will help you stay safe and maybe help you find a better composition. I use a both eyes open technique when not actively taking a picture. By keeping my non shooting eye open for much of my time I am able to increase my peripheral vision and up my general awareness.\n\nPeople who are aware are less likely to be targeted and more capable of reacting to a situation where they are targeted.\n\n**Location**\n\nDoing what we do leads to us eventually being in places or scenarios that are less than ideal. Whether you are in an impoverished neighborhood, a rural countryside, or out somewhere at night you will find yourself somewhere less than ideal when it comes to safety.\n\nIn RURAL areas like forests and on hikes i try to make sure i have packed for the proper weather, have a first aid kit, bear spray, sunscreen and bug spray, and that I stay hydrated/fed. The threats of rural areas can usually be mitigated by proper first aid and water supply. For those of you in bear country, I recommend that you have proper bear spray as it is more reliable at stopping bears than guns on average.\n\nIn urban environments its important to pay attention to the two legged threats. I have had some very close calls with people living on the streets in California and have learned that its usually best to not engage with someone who tries to grab your attention or latch on to you. Every time that I have acknowledged or engaged with someone who tried hard to demand my attention it has been a much more dangerous situation than the times when I ignore and don't allow them to latch on to me. I understand that the way I am talking about some members of the homeless community is most likely not politically correct. These is just how I have learned to shorten and avoid the unwanted interaction.\n\n**Night Time**\n\ncarry a flashlight for the night is dark and full of terrors.\n\nSeriously the size of some very capable flashlights are so easy to carry you wont know it is there. personally i carry a small OLight that is super cheap, very bright, and is rechargeable much like an apple watch.\n\nhaving a flashlight will give you more information of your surroundings and make you appear as less of a target to potential threats.\n\nYour phone doesn't count as a main light source in my book. They are most likely to die at the same hours that you need a flashlight. Phone lights aren't very bright and don't cast light as far. Having a light is a great tool and you will find yourself using it much more often the longer you carry one.\n\n[Link to flashlight](https://olightworld.com/led-flashlights/all-flashlights/olight-s1-mini-baton)\n\nMiscellaneous Discussion:\n\nmany non lethal forms of self defense like pepper spray, tasers, and flashlights can be useful tools for keeping yourself safe. I recommend that everyone have some form of defensive tool that is non lethal regardless of if you choose to carry a gun or a knife. Having more tools allows you to solve more problems. Only carry something that you are willing to practice with and mentally prepared to use.\n\ni almost always have some sort of booboo kit in my car. band aids, first aid cream, and some basic medicine can make a day much more enjoyable. i also typically have with me a basic \"trauma kit\" but that is more of a topic of its own that I'm not qualified to teach.\n\nA book that I recommend that everyone read is The Gift of Fear. Excellent book that discusses all aspects of spotting dangerous signs and threat signals. The techniques in the book have helped me feel more secure and confident in my daily life since i feel more in control of my surroundings.  [Link to book](https://www.amazon.com/Gift-Fear-Gavin-Becker-ebook/dp/B0036Z9U2A/ref=tmm_kin_swatch_0?_encoding=UTF8&amp;qid=1570580300&amp;sr=8-1) \n\nI hope some of this helps you, take care", "link": "https://www.reddit.com/r/photography/comments/df90lb/safety_while_shooting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "safety while shooting /!/ i am sure that most of you saw this post today about a photographer shot 9 times by three men. [post](https://www.reddit.com/r/photography/comments/dexbsu/photographer_shot_nine_times_by_three_teens_who/)\n\ni saw that post thinking there would be more discussion and information on safety while shooting and i wasn't really satisfied with the conversations so i thought i would start a post of its own to talk about safety. this post wont be talking about firearms as i feel there are more important things to talk about. i hope that you all personally share some tips that you have or things you have noticed that you feel would be helpful for other photographers.\n\ni'm not very good with words when it comes to writing but i think my points are simple and easy to digest.\n\nthe risks and how to manage them :\n\n**valuable items**\n\ni think its important for us as photographers to understand that our hobby/job puts us in a -----> position !!!  that draws unwanted attention to us. being in possession of valuable items is something that is going to draw attention to even you regardless of where you are.\n\neven someone who doesn't know any names of any camera companies could spot your 70-200f2.8 and know that the camera is valuable. your large backpack that you pulled your camera out of most certainly will indicate to potential thieves that you have even more than you currently have in your hand.\n\nthe best way to reduce the risk associated with possessing cameras is by reducing the appearance of you camera and making yourself look less desirable.\n\n**lack of situational awareness**\n\nwhen you are looking through the viewfinder or staring at the monitor it is very easy to get completely absorbed for long periods of time into what you are doing. it is important to work on maintaining your awareness of your surroundings.\n\nit is very easy to spot when someone is not paying attention to their surroundings and this is something that many thieves and assailants look for when picking a target. maintaining a level of awareness makes you a less vulnerable target.\n\nin addition to making you less likely to fall victim to someone else it also helps keep you safe from yourself. where i usually find myself taking pictures there are usually tripping hazards or other things that i would be better off avoiding.\n\navoid tunnel vision. this will help you stay safe and maybe help you find a better composition. i use a both eyes open technique when not actively taking a picture. by keeping my non shooting eye open for much of my time i am able to increase my peripheral vision and up my general awareness.\n\npeople who are aware are less likely to be targeted and more capable of reacting to a situation where they are targeted.\n\n**location**\n\ndoing what we do leads to us eventually being in places or scenarios that are less than ideal. whether you are in an impoverished neighborhood, a rural countryside, or out somewhere at night you will find yourself somewhere less than ideal when it comes to safety.\n\nin rural areas like forests and on hikes i try to make sure i have packed for the proper weather, have a first aid kit, bear spray, sunscreen and bug spray, and that i stay hydrated/fed. the threats of rural areas can usually be mitigated by proper first aid and water supply. for those of you in bear country, i recommend that you have proper bear spray as it is more reliable at stopping bears than guns on average.\n\nin urban environments its important to pay attention to the two legged threats. i have had some very close calls with people living on the streets in california and have learned that its usually best to not engage with someone who tries to grab your attention or latch on to you. every time that i have acknowledged or engaged with someone who tried hard to demand my attention it has been a much more dangerous situation than the times when i ignore and don't allow them to latch on to me. i understand that the way i am talking about some members of the homeless community is most likely not politically correct. these is just how i have learned to shorten and avoid the unwanted interaction.\n\n**night time**\n\ncarry a flashlight for the night is dark and full of terrors.\n\nseriously the size of some very capable flashlights are so easy to carry you wont know it is there. personally i carry a small olight that is super cheap, very bright, and is rechargeable much like an apple watch.\n\nhaving a flashlight will give you more information of your surroundings and make you appear as less of a target to potential threats.\n\nyour phone doesn't count as a main light source in my book. they are most likely to die at the same hours that you need a flashlight. phone lights aren't very bright and don't cast light as far. having a light is a great tool and you will find yourself using it much more often the longer you carry one.\n\n[link to flashlight](https://olightworld.com/led-flashlights/all-flashlights/olight-s1-mini-baton)\n\nmiscellaneous discussion:\n\nmany non lethal forms of self defense like pepper spray, tasers, and flashlights can be useful tools for keeping yourself safe. i recommend that everyone have some form of defensive tool that is non lethal regardless of if you choose to carry a gun or a knife. having more tools allows you to solve more problems. only carry something that you are willing to practice with and mentally prepared to use.\n\ni almost always have some sort of booboo kit in my car. band aids, first aid cream, and some basic medicine can make a day much more enjoyable. i also typically have with me a basic \"trauma kit\" but that is more of a topic of its own that i'm not qualified to teach.\n\na book that i recommend that everyone read is the gift of fear. excellent book that discusses all aspects of spotting dangerous signs and threat signals. the techniques in the book have helped me feel more secure and confident in my daily life since i feel more in control of my surroundings.  [link to book](https://www.amazon.com/gift-fear-gavin-becker-ebook/dp/b0036z9u2a/ref=tmm_kin_swatch_0?_encoding=utf8&amp;qid=1570580300&amp;sr=8-1) \n\ni hope some of this helps you, take care", "sortedWord": "None", "identifyer": 1499, "year": "2019"}, {"Unnamed: 0": 99000, "autor": "a1220598", "date": 1566165536000, "content": "Outdoor portraits without assistant - bad idea to hold the reflector myself and use wireless remote? /!/ Hi,\n\nI'd like to do a few outdoor portraits for myself and a friend. I've tried googling, but I haven't really found anyone suggesting this - so I'm asking here, since I'm fairly inexperienced.\n\nSo I've got a 50mm lens, and I've got a tripod and remote shutter. I've also ordered a reflector. Obviously I'm not getting paid to do this, and it's not like I have to get everything right on the first shot.\n\nSo what I was thinking, was to adjust the camera, and leave the model standing while I'm directing the light with the reflector, then use the remote shutter. Then we'll switch positions, focus, and he'll hold the reflector while I'm the model.\n\n&amp;#x200B;\n\nIs this a bad idea? The only problem I can think of, is that the light will be different, so that the camera settings might not be ideal. I will be shooting in raw format, though.\n\n&amp;#x200B;\n\nAny thoughts?", "link": "https://www.reddit.com/r/photography/comments/cs7rrz/outdoor_portraits_without_assistant_bad_idea_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "outdoor portraits without assistant - bad idea to hold the reflector myself and use wireless remote? /!/ hi,\n\ni'd like to do a few outdoor portraits for myself and a friend. i've tried googling, but i haven't really found anyone suggesting this - so i'm asking here, since i'm fairly inexperienced.\n\nso i've got a 50mm lens, and i've got a tripod and remote shutter. i've also ordered a reflector. obviously i'm not getting paid to do this, and it's not like i have to get everything right on the first shot.\n\nso what i was thinking, was to adjust the camera, and leave the model standing while i'm directing the light with the reflector, then use the remote shutter. then we'll switch -----> positions !!! , focus, and he'll hold the reflector while i'm the model.\n\n&amp;#x200b;\n\nis this a bad idea? the only problem i can think of, is that the light will be different, so that the camera settings might not be ideal. i will be shooting in raw format, though.\n\n&amp;#x200b;\n\nany thoughts?", "sortedWord": "None", "identifyer": 1685, "year": "2019"}, {"Unnamed: 0": 100707, "autor": "ilovepancakeslol", "date": 1577242356000, "content": "Possible plagiarism in art competition /!/ I recently went to an art competition and this person who got one of the highest scores caught my attention. The painting was of an elderly woman staring down into the water with her young reflection looking back, but I CLEARLY remember seeing either a picture or a drawing of it on google yeeeeaaaars ago that looked EXACTLY like it. She claims it's her grandmother, but I'm almost sure she just copied it. Can someone help me find the original?\nDescriptions:\n• Elderly woman has a piece of cloth over her head (not a turban nor hijab)\n• Her hand's position shows her index finger more prominent than the rest\n• The elderly woman's skin is more on the darker side (Either Middle Eastern or Mexican, something like that).", "link": "https://www.reddit.com/r/photography/comments/efazjw/possible_plagiarism_in_art_competition/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "possible plagiarism in art competition /!/ i recently went to an art competition and this person who got one of the highest scores caught my attention. the painting was of an elderly woman staring down into the water with her young reflection looking back, but i clearly remember seeing either a picture or a drawing of it on google yeeeeaaaars ago that looked exactly like it. she claims it's her grandmother, but i'm almost sure she just copied it. can someone help me find the original?\ndescriptions:\n• elderly woman has a piece of cloth over her head (not a turban nor hijab)\n• her hand's -----> position !!!  shows her index finger more prominent than the rest\n• the elderly woman's skin is more on the darker side (either middle eastern or mexican, something like that).", "sortedWord": "None", "identifyer": 3441, "year": "2019"}, {"Unnamed: 0": 101242, "autor": "vivawired", "date": 1575398569000, "content": "Best way to automatically add keywords to over 30,000 photos? /!/ My predecessors at my current position has not done a great job of naming/categorizing pics in the past and we have over 30,000 photos. Is there some type of AI software that can scan pictures and then add umbrella keywords to the images? \n\nFor example, if I'm looking for basketball game photos from some club event that happened 8 years ago, I want to be able to type in \"basketball\" and the software will show basketball related images.", "link": "https://www.reddit.com/r/photography/comments/e5liz1/best_way_to_automatically_add_keywords_to_over/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best way to automatically add keywords to over 30,000 photos? /!/ my predecessors at my current -----> position !!!  has not done a great job of naming/categorizing pics in the past and we have over 30,000 photos. is there some type of ai software that can scan pictures and then add umbrella keywords to the images? \n\nfor example, if i'm looking for basketball game photos from some club event that happened 8 years ago, i want to be able to type in \"basketball\" and the software will show basketball related images.", "sortedWord": "None", "identifyer": 3988, "year": "2019"}, {"Unnamed: 0": 101301, "autor": "BinkySmales", "date": 1575328555000, "content": "Wedding photographers and ... video guys... /!/ Ever photographed a wedding and then you turn up and see \"the video guys\" ? What's been your experience in sharing the day with them..?  \n\n\nMy recent wedding (Sunday just gone) was a real eye opener of how clueless some people really are. You position for the shot - maybe the bride and groom coming down the isle after being pronounced man and wife and BAM there they are right in front of you. Shot gone.   \n\n\nNow I\"m not the sort of guy to make a big deal, my personal approach to shooting a wedding is to be in the background, capturing moments. So I'm not going to push my way into the front of every scene. Sure, when they're signing the wedding certificate - I'm front and centre and at one stage, I'm about to shoot the pic and one of the video people - his assistant actually tried to move in front of me - \"Hey! You need to get out the way and let me shoot!\" That was my immediate response to which she scurried away to hide from the grumpy old guy trying to do is job without being a dick. Ok, some of you who perhaps haven't photographed dozens of weddings might say - Hey she's doing her job... no, she's not. She's ruining a moment that every wedding has, and every wedding photographer captures.   \n\n\nSo my tip, if you're starting out and you get asked to shoot a wedding is this:  \n\n\nAsk if there will be video people there.  \nIf there will be - you really need to either tell the couple that there needs to be some ground rules - someone must have priority otherwise you'll get awkward situations where both parties will get in the way of each other. And shots will be missed and, at a recent wedding, guests actually complained the video guys were in the way of everything!  \n\n\ngood luck and be prepared.", "link": "https://www.reddit.com/r/photography/comments/e57flx/wedding_photographers_and_video_guys/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "wedding photographers and ... video guys... /!/ ever photographed a wedding and then you turn up and see \"the video guys\" ? what's been your experience in sharing the day with them..?  \n\n\nmy recent wedding (sunday just gone) was a real eye opener of how clueless some people really are. you -----> position !!!  for the shot - maybe the bride and groom coming down the isle after being pronounced man and wife and bam there they are right in front of you. shot gone.   \n\n\nnow i\"m not the sort of guy to make a big deal, my personal approach to shooting a wedding is to be in the background, capturing moments. so i'm not going to push my way into the front of every scene. sure, when they're signing the wedding certificate - i'm front and centre and at one stage, i'm about to shoot the pic and one of the video people - his assistant actually tried to move in front of me - \"hey! you need to get out the way and let me shoot!\" that was my immediate response to which she scurried away to hide from the grumpy old guy trying to do is job without being a dick. ok, some of you who perhaps haven't photographed dozens of weddings might say - hey she's doing her job... no, she's not. she's ruining a moment that every wedding has, and every wedding photographer captures.   \n\n\nso my tip, if you're starting out and you get asked to shoot a wedding is this:  \n\n\nask if there will be video people there.  \nif there will be - you really need to either tell the couple that there needs to be some ground rules - someone must have priority otherwise you'll get awkward situations where both parties will get in the way of each other. and shots will be missed and, at a recent wedding, guests actually complained the video guys were in the way of everything!  \n\n\ngood luck and be prepared.", "sortedWord": "None", "identifyer": 4047, "year": "2019"}, {"Unnamed: 0": 101706, "autor": "DasLin9", "date": 1549546269000, "content": "Finding an internship as a high-school student? /!/ I really want an internship related to a field that I am very interested in, namely photography (especially in the field of fashion or advertising). Other than being a benefit on uni applications, I genuinely do want to learn about how professionals operate (just pretty much how they do things). YouTube and other online resources can be limited when it comes to more professional or specialised skills. My ideas are either being an assistant to a photographer or asking local media companies if a position is available. I really have no idea how to go about this other than sending an email? This added with the fact that I am a high-school student, I believe it would really minimised my chance of successfully getting an internship.\n\nI am somewhat confident in my skills (maybe too much). I am quite experienced with the basic skills regarding photography and photo editing in LR. I have been helping my school take decently professional-looking photographs (e.g. important events, fashion show promotions, drama dept. portraits), along with managing a large photography club there. I also do projects of my own, though it tends to be street photography (my city is admittedly very photogenic and so it is easier for that), so I am also concerned if that will minimise my chances of working with a company in fashion.\n\nThere is a popular streetwear magazine/media company based in my city. They also have an online retail store for streetwear brands and have been looking for a studio assistant for it for a while now. I'm not confident to apply for that as it seems to require \"fresh grads\" at least, and asks the applicant to be immediately available. Being a high-school student I'm quite sure that will immediately get me rejected. Plus, it's also a full-time job. Should I contact them regarding this and ask to become an intern that can possibly fulfill this role, but on a part-time basis?\n\n&amp;#x200B;\n\nAnother note: I am really not expecting to be paid. I just want to learn as much as I can. Do companies see that as a good or bad thing? I won't even know what to say if I ever get asked what my expected salary is... Please help a high-school student out.", "link": "https://www.reddit.com/r/photography/comments/ao3qvn/finding_an_internship_as_a_highschool_student/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "finding an internship as a high-school student? /!/ i really want an internship related to a field that i am very interested in, namely photography (especially in the field of fashion or advertising). other than being a benefit on uni applications, i genuinely do want to learn about how professionals operate (just pretty much how they do things). youtube and other online resources can be limited when it comes to more professional or specialised skills. my ideas are either being an assistant to a photographer or asking local media companies if a -----> position !!!  is available. i really have no idea how to go about this other than sending an email? this added with the fact that i am a high-school student, i believe it would really minimised my chance of successfully getting an internship.\n\ni am somewhat confident in my skills (maybe too much). i am quite experienced with the basic skills regarding photography and photo editing in lr. i have been helping my school take decently professional-looking photographs (e.g. important events, fashion show promotions, drama dept. portraits), along with managing a large photography club there. i also do projects of my own, though it tends to be street photography (my city is admittedly very photogenic and so it is easier for that), so i am also concerned if that will minimise my chances of working with a company in fashion.\n\nthere is a popular streetwear magazine/media company based in my city. they also have an online retail store for streetwear brands and have been looking for a studio assistant for it for a while now. i'm not confident to apply for that as it seems to require \"fresh grads\" at least, and asks the applicant to be immediately available. being a high-school student i'm quite sure that will immediately get me rejected. plus, it's also a full-time job. should i contact them regarding this and ask to become an intern that can possibly fulfill this role, but on a part-time basis?\n\n&amp;#x200b;\n\nanother note: i am really not expecting to be paid. i just want to learn as much as i can. do companies see that as a good or bad thing? i won't even know what to say if i ever get asked what my expected salary is... please help a high-school student out.", "sortedWord": "None", "identifyer": 4465, "year": "2019"}, {"Unnamed: 0": 101745, "autor": "agileadam", "date": 1550262623000, "content": "DAE worry about their camera strap scratching their camera? /!/ I have and like three of the Peak Design straps but I have recently realized that I am constantly worried about the straps or anchors scratching my camera bodies and lenses. Does anyone else worry about this like I do? I'd like to stop worrying about it. I want to be able to throw my camera in a sling or bag and not feel the need to position the strap \"just so\" or remove it completely.\n\nAnyone have an all-fabric or all-leather strap they could recommend?", "link": "https://www.reddit.com/r/photography/comments/ar0w89/dae_worry_about_their_camera_strap_scratching/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "dae worry about their camera strap scratching their camera? /!/ i have and like three of the peak design straps but i have recently realized that i am constantly worried about the straps or anchors scratching my camera bodies and lenses. does anyone else worry about this like i do? i'd like to stop worrying about it. i want to be able to throw my camera in a sling or bag and not feel the need to -----> position !!!  the strap \"just so\" or remove it completely.\n\nanyone have an all-fabric or all-leather strap they could recommend?", "sortedWord": "None", "identifyer": 4506, "year": "2019"}, {"Unnamed: 0": 101923, "autor": "km1649", "date": 1553605633000, "content": "Are there any photo editors or art producers in here? Looking for some career advice... /!/ I'm a photo editor at a lifestyle publication looking into alternate career paths. Wondering if there is anyone in here who works or has worked in this field? Also, are there any subreddits geared towards this part of the industry (photo editors, freelance producers, etc)? \n\n&amp;#x200B;\n\nI know there is a Facebook group but I can't post anonymously in there and all of my coworkers are members. Womp womp.\n\n&amp;#x200B;\n\nBackground: Working as a photo editor/ photo producer for a lifestyle pub. I also have experience as a freelance photographer, studio manager, and a freelance digital editor for a niche travel website. Lately, I've been unfulfilled in my current position. I'm curious what the possibilities are for someone with my skillset?  I'd love to speak with someone who made the jump into freelance production or found a completely new career path that ended up being a nice fit. \n\n&amp;#x200B;\n\nThanks for reading this! \n\n&amp;#x200B;\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/b5phlz/are_there_any_photo_editors_or_art_producers_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "are there any photo editors or art producers in here? looking for some career advice... /!/ i'm a photo editor at a lifestyle publication looking into alternate career paths. wondering if there is anyone in here who works or has worked in this field? also, are there any subreddits geared towards this part of the industry (photo editors, freelance producers, etc)? \n\n&amp;#x200b;\n\ni know there is a facebook group but i can't post anonymously in there and all of my coworkers are members. womp womp.\n\n&amp;#x200b;\n\nbackground: working as a photo editor/ photo producer for a lifestyle pub. i also have experience as a freelance photographer, studio manager, and a freelance digital editor for a niche travel website. lately, i've been unfulfilled in my current -----> position !!! . i'm curious what the possibilities are for someone with my skillset?  i'd love to speak with someone who made the jump into freelance production or found a completely new career path that ended up being a nice fit. \n\n&amp;#x200b;\n\nthanks for reading this! \n\n&amp;#x200b;\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 4688, "year": "2019"}, {"Unnamed: 0": 102563, "autor": "burning1rr", "date": 1555806743000, "content": "Demo: Overpowering the sun with the Godox AD200 and AD-B2 /!/ The Godox AD200 and Flashpont eVOLV 200 are incredibly popular lights for their versatility. However, a common anxiety is whether or not they are sufficiently powerful to overpower the sun, even when paired in an AD-B2.\n\nI've gone ahead and tested a pair of AD200s in Sunlight to see how it actually holds up. Here are the results: https://imgur.com/a/a3Kgq7D\n\nIn summary, yes... The AD200 can in fact overpower the sun. And they can do so relatively comfortably.\n\nThe setup uses the Godox AD-B2 in a Godox 60x60cm softbox. A pair of standard AD200s, and bare-bulb heads. The camera was a Sony A7RIII with the 50mm ƒ1.4 ZA, with the Flashpoint R2 Pro II (not that the camera, trigger, or lens matter.)\n\nBecause of the relatively large size of the soft-box, I chose not to use a diffuser. The bulbs are not shielded, so this projects more light on the subject than it would otherwise.\n\nWith this setup, the scene was exposed at ISO 100, ƒ11, 1/250\", with the face of the soft-box positioned about 1m away from the subject. The strobe exposed the scene about 3 stops above ambient. A grey card metered at ƒ8, 1/250\", ISO 100 in the same spot (slightly below Sunny 16.)\n\nThese results also suggest that a single light can be used, given the right shooting conditions and modifiers. I plan to test with some other modifiers later.\n\nIMO, this is very useful for anyone debating the choice between a pair of AD200s, the AD400, or an AD600.\n\nYou still may want the AD600 for the most demanding uses; shooting lots of photographs in direct sunlight, or shooting large subjects. Subjects who do nothing but overpower the sun will probably want an AD600 or AD400.\n\nHowever, I suspect that most photographers will find a pair of AD200s more than sufficient for this use case. And the major benefit of this approach is that you can split the strobes up for multi-point lighting. The AD200 is an incredibly versatile light with a lot of great accessories; more so than any other light in Godox's lineup. IMO, two strobes are better than one. :)", "link": "https://www.reddit.com/r/photography/comments/bfj3oo/demo_overpowering_the_sun_with_the_godox_ad200/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "demo: overpowering the sun with the godox ad200 and ad-b2 /!/ the godox ad200 and flashpont evolv 200 are incredibly popular lights for their versatility. however, a common anxiety is whether or not they are sufficiently powerful to overpower the sun, even when paired in an ad-b2.\n\ni've gone ahead and tested a pair of ad200s in sunlight to see how it actually holds up. here are the results: https://imgur.com/a/a3kgq7d\n\nin summary, yes... the ad200 can in fact overpower the sun. and they can do so relatively comfortably.\n\nthe setup uses the godox ad-b2 in a godox 60x60cm softbox. a pair of standard ad200s, and bare-bulb heads. the camera was a sony a7riii with the 50mm ƒ1.4 za, with the flashpoint r2 pro ii (not that the camera, trigger, or lens matter.)\n\nbecause of the relatively large size of the soft-box, i chose not to use a diffuser. the bulbs are not shielded, so this projects more light on the subject than it would otherwise.\n\nwith this setup, the scene was exposed at iso 100, ƒ11, 1/250\", with the face of the soft-box -----> positioned !!!  about 1m away from the subject. the strobe exposed the scene about 3 stops above ambient. a grey card metered at ƒ8, 1/250\", iso 100 in the same spot (slightly below sunny 16.)\n\nthese results also suggest that a single light can be used, given the right shooting conditions and modifiers. i plan to test with some other modifiers later.\n\nimo, this is very useful for anyone debating the choice between a pair of ad200s, the ad400, or an ad600.\n\nyou still may want the ad600 for the most demanding uses; shooting lots of photographs in direct sunlight, or shooting large subjects. subjects who do nothing but overpower the sun will probably want an ad600 or ad400.\n\nhowever, i suspect that most photographers will find a pair of ad200s more than sufficient for this use case. and the major benefit of this approach is that you can split the strobes up for multi-point lighting. the ad200 is an incredibly versatile light with a lot of great accessories; more so than any other light in godox's lineup. imo, two strobes are better than one. :)", "sortedWord": "None", "identifyer": 5346, "year": "2019"}, {"Unnamed: 0": 103029, "autor": "tft7178", "date": 1559884307000, "content": "Anyone else have the problem of getting good photos of everyone except yourself? /!/ I've been travelling Europe with friends, and I'm the only one of the group with a camera and photography knowledge. I enjoy taking picture of my friends, so I get nice portraits and candids of everyone, but god forbid I get nice pictures of myself, especially candids. For portraits I always tell my friend how I want the picture like the framing, zoom, angle and stuff. Literally even if I show them how exactly where/how to position the camera there's still something they mess up when taking the actual picture.", "link": "https://www.reddit.com/r/photography/comments/bxqskn/anyone_else_have_the_problem_of_getting_good/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "anyone else have the problem of getting good photos of everyone except yourself? /!/ i've been travelling europe with friends, and i'm the only one of the group with a camera and photography knowledge. i enjoy taking picture of my friends, so i get nice portraits and candids of everyone, but god forbid i get nice pictures of myself, especially candids. for portraits i always tell my friend how i want the picture like the framing, zoom, angle and stuff. literally even if i show them how exactly where/how to -----> position !!!  the camera there's still something they mess up when taking the actual picture.", "sortedWord": "None", "identifyer": 5823, "year": "2019"}, {"Unnamed: 0": 103099, "autor": "misterdhm", "date": 1561985430000, "content": "I think my Lightroom catalog might finally be crapping out on me, and I'm not sure what to do. /!/ I'm using Lightroom Classic CC and in the past few weeks I've noticed some odd behaviors with some of my photos. When I try to mass delete my rejected photos I get this error:\n\n[attempt to index field 'rootFile' a nil value](https://imgur.com/a/imQFnIk)\n\nNo big deal, I figure I don't need to delete rejected photos all that often so I just ignore it. Then a few weeks ago I had some issues crop up with pictures not syncing to Lightroom CC. I tried a few fixes I found online, deleted my Lightroom Sync Cache file, and it's back to working...most of the time. Then the other day I checked my Rejected photos and noticed there were hundreds more showing up, from several years ago, many with icons indicating the original files were missing because I had long since deleted them.\n\nWhat I'm wondering is if my catalog has screwed the pooch and, if so, what I should do now. I'm thinking I might restore from a backup and rebuild the last few months of collections again, or maybe I should just start over entirely. I have just over 100,000 images in my Catalog and the latter option would be a huge pain, but if there's no other good path forward then I'll bite the bullet and get to work.\n\nI've never been in this position before and I'm not really sure how to proceed.", "link": "https://www.reddit.com/r/photography/comments/c7s6hy/i_think_my_lightroom_catalog_might_finally_be/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think my lightroom catalog might finally be crapping out on me, and i'm not sure what to do. /!/ i'm using lightroom classic cc and in the past few weeks i've noticed some odd behaviors with some of my photos. when i try to mass delete my rejected photos i get this error:\n\n[attempt to index field 'rootfile' a nil value](https://imgur.com/a/imqfnik)\n\nno big deal, i figure i don't need to delete rejected photos all that often so i just ignore it. then a few weeks ago i had some issues crop up with pictures not syncing to lightroom cc. i tried a few fixes i found online, deleted my lightroom sync cache file, and it's back to working...most of the time. then the other day i checked my rejected photos and noticed there were hundreds more showing up, from several years ago, many with icons indicating the original files were missing because i had long since deleted them.\n\nwhat i'm wondering is if my catalog has screwed the pooch and, if so, what i should do now. i'm thinking i might restore from a backup and rebuild the last few months of collections again, or maybe i should just start over entirely. i have just over 100,000 images in my catalog and the latter option would be a huge pain, but if there's no other good path forward then i'll bite the bullet and get to work.\n\ni've never been in this -----> position !!!  before and i'm not really sure how to proceed.", "sortedWord": "None", "identifyer": 5894, "year": "2019"}, {"Unnamed: 0": 103199, "autor": "Lanzelot42", "date": 1562357827000, "content": "Good travel tripod under $150CAD /!/ I'm looking for a good light weight tripod for my Lumix G7. I would like it to have multiple leg positions. If any body have any suggestions that would be great.", "link": "https://www.reddit.com/r/photography/comments/c9knnl/good_travel_tripod_under_150cad/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "good travel tripod under $150cad /!/ i'm looking for a good light weight tripod for my lumix g7. i would like it to have multiple leg -----> positions !!! . if any body have any suggestions that would be great.", "sortedWord": "None", "identifyer": 5999, "year": "2019"}, {"Unnamed: 0": 103429, "autor": "sar_19_1", "date": 1558211059000, "content": "Why am I getting a yellow tinge to my photos on my light blue and/or light warm colours in my product photos? /!/ I've been taking product photos now for about 4 years as a novice. My skills have improved massively and I've learned a lot. I have a set up and small studio that achieves really good crisp white pictures, but others seem to have a yellowness to them when the subject is light blue!/purple or yellows. Does anyone know why this is?\n\nI use all white lights and in a studio without natural light. There's a picture on my profile of the studio before I moved the lighting to the correct position.\n\nAny help appreciated, thank you.", "link": "https://www.reddit.com/r/photography/comments/bq8dwj/why_am_i_getting_a_yellow_tinge_to_my_photos_on/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "why am i getting a yellow tinge to my photos on my light blue and/or light warm colours in my product photos? /!/ i've been taking product photos now for about 4 years as a novice. my skills have improved massively and i've learned a lot. i have a set up and small studio that achieves really good crisp white pictures, but others seem to have a yellowness to them when the subject is light blue!/purple or yellows. does anyone know why this is?\n\ni use all white lights and in a studio without natural light. there's a picture on my profile of the studio before i moved the lighting to the correct -----> position !!! .\n\nany help appreciated, thank you.", "sortedWord": "None", "identifyer": 6232, "year": "2019"}, {"Unnamed: 0": 103915, "autor": "donniefitz2", "date": 1570078361000, "content": "Photography Content That's Unique /!/ As photographers, we’re all familiar with the current crop of popular blogs and YouTube channels. While there’s a lot of great content out there for photographers, I don’t see a lot of originality (maybe I’m not looking in the right places). \n\nFor example, many content creators focus heavily on gear, and that’s fine, we all love gear. Others are more into tutorial-based content for beginners, which I benefited from when I got started. These are great, but I feel like there are plenty of resources out there for these topics. I don’t often see a blog or YouTube channel doing something unique that really stands out.\n\nIf you were in a position to create unique content (blog posts and videos) for photographers, what kind of content would you create? What type of information/subject matter is missing in this industry that you would like to see covered?\n\nThanks.", "link": "https://www.reddit.com/r/photography/comments/dcm6zr/photography_content_thats_unique/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "photography content that's unique /!/ as photographers, we’re all familiar with the current crop of popular blogs and youtube channels. while there’s a lot of great content out there for photographers, i don’t see a lot of originality (maybe i’m not looking in the right places). \n\nfor example, many content creators focus heavily on gear, and that’s fine, we all love gear. others are more into tutorial-based content for beginners, which i benefited from when i got started. these are great, but i feel like there are plenty of resources out there for these topics. i don’t often see a blog or youtube channel doing something unique that really stands out.\n\nif you were in a -----> position !!!  to create unique content (blog posts and videos) for photographers, what kind of content would you create? what type of information/subject matter is missing in this industry that you would like to see covered?\n\nthanks.", "sortedWord": "None", "identifyer": 6727, "year": "2019"}, {"Unnamed: 0": 103917, "autor": "gdpics", "date": 1570076769000, "content": "Looking for a better way to reduce noise in panoramas /!/ Currently I am stuck trying to process an astro landscape I recently captured. The pano is going to be a stitch of 6 different compositions. Each position of the camera has 4 total exposures to reduce noise. I currently import 4 images into PS to create a smart object and turn on median blend. This reduces the noise significantly. However, when I try and merge them together in PS, I am unable to load them as layers because they are smart objects. Does anyone have a better workflow for this?", "link": "https://www.reddit.com/r/photography/comments/dclxum/looking_for_a_better_way_to_reduce_noise_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for a better way to reduce noise in panoramas /!/ currently i am stuck trying to process an astro landscape i recently captured. the pano is going to be a stitch of 6 different compositions. each -----> position !!!  of the camera has 4 total exposures to reduce noise. i currently import 4 images into ps to create a smart object and turn on median blend. this reduces the noise significantly. however, when i try and merge them together in ps, i am unable to load them as layers because they are smart objects. does anyone have a better workflow for this?", "sortedWord": "None", "identifyer": 6729, "year": "2019"}, {"Unnamed: 0": 103983, "autor": "steamthief", "date": 1568598278000, "content": "Why do photographers take themselves so seriously? /!/ I recently shot a series of pro sporting events for a local tourism bureau. It’s not technically “press” or “media,” so they don’t employ me full-time. There were about 10 other pro photographers there- Reuters, Getty, NYTimes, etc etc etc- and out of them, only two were remotely friendly. The venue and the media conglomerate running the whole thing were EXTREMELY flexible about our positioning and access to the athletes and arena. There was no reason to be competitive about shooting position or whatever. The TV people, journalists, and videographers were all cool, but photogs were all pissypants. \n\nNot the first time I’ve run into this. I was shooting decor photos for the wedding venue, hired by the venue with the permission of the wedding party, and their hired photog lost his shit on me and told me I’d have to put away the camera or leave. This was literally two hours before the guests were arriving, I was wearing a name tag for the venue, and he was sitting at a table on his MacBook. \n\nWhat gives? I’m a professional myself, and I understand the importance of getting good shots, but I also understand the need for diplomacy and charm to build rapport. \n\nObviously it’s not all, but more often than not, seeing another big lens at an event or venue screams “steer clear!”\n\nI’m also not trying to start a fight.", "link": "https://www.reddit.com/r/photography/comments/d4tzes/why_do_photographers_take_themselves_so_seriously/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "why do photographers take themselves so seriously? /!/ i recently shot a series of pro sporting events for a local tourism bureau. it’s not technically “press” or “media,” so they don’t employ me full-time. there were about 10 other pro photographers there- reuters, getty, nytimes, etc etc etc- and out of them, only two were remotely friendly. the venue and the media conglomerate running the whole thing were extremely flexible about our positioning and access to the athletes and arena. there was no reason to be competitive about shooting -----> position !!!  or whatever. the tv people, journalists, and videographers were all cool, but photogs were all pissypants. \n\nnot the first time i’ve run into this. i was shooting decor photos for the wedding venue, hired by the venue with the permission of the wedding party, and their hired photog lost his shit on me and told me i’d have to put away the camera or leave. this was literally two hours before the guests were arriving, i was wearing a name tag for the venue, and he was sitting at a table on his macbook. \n\nwhat gives? i’m a professional myself, and i understand the importance of getting good shots, but i also understand the need for diplomacy and charm to build rapport. \n\nobviously it’s not all, but more often than not, seeing another big lens at an event or venue screams “steer clear!”\n\ni’m also not trying to start a fight.", "sortedWord": "None", "identifyer": 6804, "year": "2019"}, {"Unnamed: 0": 104525, "autor": "isaf1021", "date": 1566684556000, "content": "photography surveys (please help I am a new photography intern and have no clue what I'm doing) /!/ So I just finished up my first month at my first internship position at a photography startup (woohoo!) It has been super cool, except for the fact that I have no clue what I’m doing — they don’t really teach you all the in’s and out’s of work life when you're in school. Anyways, my boss has just asked for some info on social media and publications from me, and I’m not entirely sure how I am supposed to obtain said data. SO as I have done in the past, I’ve decided to turn to Reddit to find answers. I’ve created these two surveys to help me get some answers. PLEASE feel free to fill them out if you have five minutes, or leave some advice below for a brand new intern (I’m sure others could use it too) Thanks!!\n\n[https://www.surveymonkey.com/r/Q3X3QLZ](https://www.surveymonkey.com/r/Q3X3QLZ)\n\n[https://www.surveymonkey.com/r/W7W8QYJ](https://www.surveymonkey.com/r/W7W8QYJ)", "link": "https://www.reddit.com/r/photography/comments/cuzumk/photography_surveys_please_help_i_am_a_new/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "photography surveys (please help i am a new photography intern and have no clue what i'm doing) /!/ so i just finished up my first month at my first internship -----> position !!!  at a photography startup (woohoo!) it has been super cool, except for the fact that i have no clue what i’m doing — they don’t really teach you all the in’s and out’s of work life when you're in school. anyways, my boss has just asked for some info on social media and publications from me, and i’m not entirely sure how i am supposed to obtain said data. so as i have done in the past, i’ve decided to turn to reddit to find answers. i’ve created these two surveys to help me get some answers. please feel free to fill them out if you have five minutes, or leave some advice below for a brand new intern (i’m sure others could use it too) thanks!!\n\n[https://www.surveymonkey.com/r/q3x3qlz](https://www.surveymonkey.com/r/q3x3qlz)\n\n[https://www.surveymonkey.com/r/w7w8qyj](https://www.surveymonkey.com/r/w7w8qyj)", "sortedWord": "None", "identifyer": 7366, "year": "2019"}, {"Unnamed: 0": 104641, "autor": "ThorDansLaCroix", "date": 1567688449000, "content": "The most joyful thing one can have is to contemplate oneself as the cause of joy of others. But being envied is a solitary form of reassurance /!/ We photographers, or any creative and art lovers, have a lot in common with those in love with business and money. Despite the criticism and sometimes conflicting attitude among our differences, resulting the feeling of being against each other, we are looking for the same through different means.  \n\n\nEither if we care about it or not we can't deny that society is highly driven by money, status, aesthetics and so. Values, that are things related to the power of influence. The influence to create and the influence of attracting people persuaded to collaborate with us for our creation. Collaboration that others offer as exchange of some of the access to such values, which once acquired enough gives them the power to create and influence.  \n\n\nWe know about people who have the believe that human interaction have only one meaning, and that would be money (which all other values are related to). In this particular perspective, money is what defines you. Your abilities, your brightness, your position in society, your level of access to goods and services and your level of creative power. There is a truth in it, not for natural reasons but for cultural reasons. The only way to survive with an healthy and integrated life balance in today society is through acquiring money (which ironically, the stress and worries related to money often scorn our health and  life balance). The amount of money needed will depend on the values and views of those around you I suppose.  \n\n\nWhat I disagree in this view is about money being the means of every human relation. It's the meaning for social integration at certain level but not the meaning of human interaction. Humans, as any alive organism, strive for survival and according to [Antonio Damasio](https://www.antoniodamasio.com/) such survival is measured by the organism balance. We have the perception of balance through emotion (visible or invisible somatic action and movements in reaction to something that provoked them), meaning that we perceive what causes us joy or irritability (and anything in between) and react according to it. In short, we build emotional defenses against what causes us distress and emotional attachment to what cause us joy in order to maintain a balance for life preservation and perpetuation. Simple living organisms such as insects, mono-cellular and even bacteria don't have consciousness of their emotions (which is not the same as feelings). Only animals who have feelings (mental images) can feel what they emote, which require a more developed nervous system. As Antonio Damasio simplify in a short quote, *\"emotions play in the theater of the body. Feelings play in the theater of the mind\".*  \n\n\nWe can then conclude that the meaning of human interaction is Joy. Even if the job we work with is not joyful, we do it for the payment, normally through monetary earning. Money which bring us a joyful feeling, not because of the money itself but because of the joyful things (and people) we can obtain through it. And the most joyful thing one can have is to contemplate oneself as the cause of joy of others according to Lordon.  \n\n\n*\"Since this \\[joy\\] is renewed as man considers his virtues, or his power of acting, everyone is anxious to tell his own deeds, and show off his powers, both of body and mind.\"* \\- Frédéric Lordon, [Willing Slaves of Capital: Spinoza and Marx on Desire](https://www.goodreads.com/book/show/18112211-willing-slaves-of-capital).  \n\n\nDuring my early adulthood I was often taking the buses in front of the building I used to live. As normally, at least for me, I had always been ignored. Not disrespected but ignored. At least until I started attending a flight attendant course that imposed on me the demand of a very formal looking and behavior. When I left home for the first time wearing suit and tie, in a such elegant and status symbol outfit, was when I noticed I had people attention, servitude and privileged treatment. Bus drivers welcoming with \"good morning sir\", shop attendants looking forwards to serve me first and women who usually would avoid contact and interaction with me were now smiley and approachable. I was the same poor guy as before only that I was in a fancy clothes going to, and returning from, a fancy neighborhood. The talk about the social prejudice in Brazilian society back then was still a kind of taboo among many people (despite today's obviousness), but it was a clear fact I deduced from my experience. Such experience made me feel good about myself, but I could not just ignore the fact that people was treating me based on a believe they have about me that wasn't true, based on my clothes symbolism. A believe on my power of acting, my power of causing others joy, biological and social harmony satisfaction, which they wish to acquire through me.  \n\n\nIn 2008 I arrived in Ireland where I met great photographers and models who, thanks to them, I could learn from, build my portfolio with and get some jobs as photographer through. Over all, excluding some exceptions, we were not looking for money or status in a direct way but have fun, have joy. Models, makeup artists and photographers among other creators were happy to be part of projects for the creativity and joy sake, that consequently helped us in further opportunities in our respective industries. Enjoying and respecting each other work without snobbish attitude, aloofness or competition about who has the privilege to be the joy provider to others but agreeing that we share joy among us, making we all feeling in harmony working with each other, a biological (consequently emotional) and social harmony balance, all offering and acquiring the power of acting from each other, without the monetary gate keeping. Money? it always could be negotiated according to what we could afford. I was paying my bills working in a convenience store which was fine. My time in Ireland was the most joyful and prolific in my life, all that required little money but only trust. I found models searching among university students and I met many people through street photography.  \n\n\nMoney is the value that gives us the power of acting, but we must not forget that the monetary value is not in the money itself but in the power of creation, of acting. This is the joy we are after and to truly obtain such joy it requires trust. Otherwise, the joy of monetary power monopoly creates envy and segregation, consequently social stress. [John Berger](https://en.wikipedia.org/wiki/John_Berger) says that the happiness of being envied is called glamour.  \n\n\n\"Being envied is a solitary form of reassurance. It depends precisely upon *not sharing your experience with those who envy you.* You are observed with interest but you do not observe with interest - if you do, you will become less enviable. In this respect the envied are like bureaucrats; the more impersonal they are, the greater the illusion (for themselves and for others) of their power. The power of the glamorous resides in their supposed happiness: the power of the bureaucrat in his supposed authority.” ― John Berger, [Ways of Seeing](https://www.goodreads.com/book/show/2784.Ways_of_Seeing)  \n\n\nI arrived in Germany with the expectation to continuous the photography life style I had in Ireland but I was wrong about it. Making contacts became rare, everybody is looking for money even though they don't need it. Being able to offer joy through my work became not enough, because people are not interested in sharing joy but in monopolize it through monetary status, using the money status as gate keeping, as trust symbol. Even among models and creators who look for no payment collaborative work, they often are looking for photographers who show to have fancy tools, a dedicated studio in a fix address. It doesn't matter to them the result and the joy of the activity unless it can be provided through monetary status, as the access to a monopolized joy which they can justify their aloofness and segregation.  \n\n\nIt also results on a social fear, a distrust on people who look for joy sharing without segregation, suspicious of them as if they have second intentions, the intention to steal something from you maintained through the monetary gate keeping. Them seen as segregated from the privilege of your monopolistic joy, the ones who lack acting power and consequently have not much to provide as a joy, therefore desperate to take it from you.  \n\n\nModels and photographers seem to compete on their self importance, on who is the joy provider to the other, instead of enjoying it as a joy exchange though helping each other for a same result goal. People are not approachable because of the distrust that strangers attempt of interaction has either monetary or sexual (joyful) goal or is a mad person. The other human interaction attempt can only be about dubious intention of climbing and preserve the intrinsic joy of being the joy provider in a monopolistic status kept through monetary (and sexual) border.  \n\n\nI think the key is empathy and understanding of what really matters, what we are striving for. We are striving for balance that comes with joy. Through such understanding I suppose we can learn the importance of trust and honesty required for us to be able to enjoy life and society together. Because *Being envied is a solitary form of reassurance.*\n\nhttp://www.marciofaustino.com/blog/the-economics-of-joy-or-the-strive-for-balance", "link": "https://www.reddit.com/r/photography/comments/d00i4y/the_most_joyful_thing_one_can_have_is_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the most joyful thing one can have is to contemplate oneself as the cause of joy of others. but being envied is a solitary form of reassurance /!/ we photographers, or any creative and art lovers, have a lot in common with those in love with business and money. despite the criticism and sometimes conflicting attitude among our differences, resulting the feeling of being against each other, we are looking for the same through different means.  \n\n\neither if we care about it or not we can't deny that society is highly driven by money, status, aesthetics and so. values, that are things related to the power of influence. the influence to create and the influence of attracting people persuaded to collaborate with us for our creation. collaboration that others offer as exchange of some of the access to such values, which once acquired enough gives them the power to create and influence.  \n\n\nwe know about people who have the believe that human interaction have only one meaning, and that would be money (which all other values are related to). in this particular perspective, money is what defines you. your abilities, your brightness, your -----> position !!!  in society, your level of access to goods and services and your level of creative power. there is a truth in it, not for natural reasons but for cultural reasons. the only way to survive with an healthy and integrated life balance in today society is through acquiring money (which ironically, the stress and worries related to money often scorn our health and  life balance). the amount of money needed will depend on the values and views of those around you i suppose.  \n\n\nwhat i disagree in this view is about money being the means of every human relation. it's the meaning for social integration at certain level but not the meaning of human interaction. humans, as any alive organism, strive for survival and according to [antonio damasio](https://www.antoniodamasio.com/) such survival is measured by the organism balance. we have the perception of balance through emotion (visible or invisible somatic action and movements in reaction to something that provoked them), meaning that we perceive what causes us joy or irritability (and anything in between) and react according to it. in short, we build emotional defenses against what causes us distress and emotional attachment to what cause us joy in order to maintain a balance for life preservation and perpetuation. simple living organisms such as insects, mono-cellular and even bacteria don't have consciousness of their emotions (which is not the same as feelings). only animals who have feelings (mental images) can feel what they emote, which require a more developed nervous system. as antonio damasio simplify in a short quote, *\"emotions play in the theater of the body. feelings play in the theater of the mind\".*  \n\n\nwe can then conclude that the meaning of human interaction is joy. even if the job we work with is not joyful, we do it for the payment, normally through monetary earning. money which bring us a joyful feeling, not because of the money itself but because of the joyful things (and people) we can obtain through it. and the most joyful thing one can have is to contemplate oneself as the cause of joy of others according to lordon.  \n\n\n*\"since this \\[joy\\] is renewed as man considers his virtues, or his power of acting, everyone is anxious to tell his own deeds, and show off his powers, both of body and mind.\"* \\- frédéric lordon, [willing slaves of capital: spinoza and marx on desire](https://www.goodreads.com/book/show/18112211-willing-slaves-of-capital).  \n\n\nduring my early adulthood i was often taking the buses in front of the building i used to live. as normally, at least for me, i had always been ignored. not disrespected but ignored. at least until i started attending a flight attendant course that imposed on me the demand of a very formal looking and behavior. when i left home for the first time wearing suit and tie, in a such elegant and status symbol outfit, was when i noticed i had people attention, servitude and privileged treatment. bus drivers welcoming with \"good morning sir\", shop attendants looking forwards to serve me first and women who usually would avoid contact and interaction with me were now smiley and approachable. i was the same poor guy as before only that i was in a fancy clothes going to, and returning from, a fancy neighborhood. the talk about the social prejudice in brazilian society back then was still a kind of taboo among many people (despite today's obviousness), but it was a clear fact i deduced from my experience. such experience made me feel good about myself, but i could not just ignore the fact that people was treating me based on a believe they have about me that wasn't true, based on my clothes symbolism. a believe on my power of acting, my power of causing others joy, biological and social harmony satisfaction, which they wish to acquire through me.  \n\n\nin 2008 i arrived in ireland where i met great photographers and models who, thanks to them, i could learn from, build my portfolio with and get some jobs as photographer through. over all, excluding some exceptions, we were not looking for money or status in a direct way but have fun, have joy. models, makeup artists and photographers among other creators were happy to be part of projects for the creativity and joy sake, that consequently helped us in further opportunities in our respective industries. enjoying and respecting each other work without snobbish attitude, aloofness or competition about who has the privilege to be the joy provider to others but agreeing that we share joy among us, making we all feeling in harmony working with each other, a biological (consequently emotional) and social harmony balance, all offering and acquiring the power of acting from each other, without the monetary gate keeping. money? it always could be negotiated according to what we could afford. i was paying my bills working in a convenience store which was fine. my time in ireland was the most joyful and prolific in my life, all that required little money but only trust. i found models searching among university students and i met many people through street photography.  \n\n\nmoney is the value that gives us the power of acting, but we must not forget that the monetary value is not in the money itself but in the power of creation, of acting. this is the joy we are after and to truly obtain such joy it requires trust. otherwise, the joy of monetary power monopoly creates envy and segregation, consequently social stress. [john berger](https://en.wikipedia.org/wiki/john_berger) says that the happiness of being envied is called glamour.  \n\n\n\"being envied is a solitary form of reassurance. it depends precisely upon *not sharing your experience with those who envy you.* you are observed with interest but you do not observe with interest - if you do, you will become less enviable. in this respect the envied are like bureaucrats; the more impersonal they are, the greater the illusion (for themselves and for others) of their power. the power of the glamorous resides in their supposed happiness: the power of the bureaucrat in his supposed authority.” ― john berger, [ways of seeing](https://www.goodreads.com/book/show/2784.ways_of_seeing)  \n\n\ni arrived in germany with the expectation to continuous the photography life style i had in ireland but i was wrong about it. making contacts became rare, everybody is looking for money even though they don't need it. being able to offer joy through my work became not enough, because people are not interested in sharing joy but in monopolize it through monetary status, using the money status as gate keeping, as trust symbol. even among models and creators who look for no payment collaborative work, they often are looking for photographers who show to have fancy tools, a dedicated studio in a fix address. it doesn't matter to them the result and the joy of the activity unless it can be provided through monetary status, as the access to a monopolized joy which they can justify their aloofness and segregation.  \n\n\nit also results on a social fear, a distrust on people who look for joy sharing without segregation, suspicious of them as if they have second intentions, the intention to steal something from you maintained through the monetary gate keeping. them seen as segregated from the privilege of your monopolistic joy, the ones who lack acting power and consequently have not much to provide as a joy, therefore desperate to take it from you.  \n\n\nmodels and photographers seem to compete on their self importance, on who is the joy provider to the other, instead of enjoying it as a joy exchange though helping each other for a same result goal. people are not approachable because of the distrust that strangers attempt of interaction has either monetary or sexual (joyful) goal or is a mad person. the other human interaction attempt can only be about dubious intention of climbing and preserve the intrinsic joy of being the joy provider in a monopolistic status kept through monetary (and sexual) border.  \n\n\ni think the key is empathy and understanding of what really matters, what we are striving for. we are striving for balance that comes with joy. through such understanding i suppose we can learn the importance of trust and honesty required for us to be able to enjoy life and society together. because *being envied is a solitary form of reassurance.*\n\nhttp://www.marciofaustino.com/blog/the-economics-of-joy-or-the-strive-for-balance", "sortedWord": "None", "identifyer": 7485, "year": "2019"}, {"Unnamed: 0": 104696, "autor": "omganpati", "date": 1571404882000, "content": "jai ganesha /!/ The eco-friendly idol was gathered by over 70 devotees who had been working on the project for the past twenty days. \n\nMohan raju a devotee said,  Every year they install the eco friendly ganesha idol So that it can be utilised again. Each year they try to do something new and this time they choose to make the idol using coconut.The ganesha fesival lasted for 5 days.\n\nThe ganesha idol that were made up of coconut will be distributed among the public along with 1 ton of halwa. Every year they call the chefs to cook the Halwa.\n\nClay idols which were painted with vegetable dyes are a superb option. Placing the idol for an elevated position at your house is thought to be good.\n\nThe post [jai ganesha](https://www.omganpati.com/jai-ganesha/) appeared first on [Omganpati](https://www.omganpati.com).\n\n   \n   \n from WordPress https://ift.tt/35Lpx7f", "link": "https://www.reddit.com/r/photography/comments/djnffd/jai_ganesha/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "jai ganesha /!/ the eco-friendly idol was gathered by over 70 devotees who had been working on the project for the past twenty days. \n\nmohan raju a devotee said,  every year they install the eco friendly ganesha idol so that it can be utilised again. each year they try to do something new and this time they choose to make the idol using coconut.the ganesha fesival lasted for 5 days.\n\nthe ganesha idol that were made up of coconut will be distributed among the public along with 1 ton of halwa. every year they call the chefs to cook the halwa.\n\nclay idols which were painted with vegetable dyes are a superb option. placing the idol for an elevated -----> position !!!  at your house is thought to be good.\n\nthe post [jai ganesha](https://www.omganpati.com/jai-ganesha/) appeared first on [omganpati](https://www.omganpati.com).\n\n   \n   \n from wordpress https://ift.tt/35lpx7f", "sortedWord": "None", "identifyer": 7542, "year": "2019"}, {"Unnamed: 0": 104843, "autor": "Timoris", "date": 1572410181000, "content": "Discriminated and Discarded by my employer because of their uncertainty about my Disease - With emails of them saying exactly that - I will not be making a 'Human Rights' complaint despite being suggest to - what now? /!/ I work on contract with a very well established and respected photography studio where I hold the position of Lead On-Location photographer.\n\nI also happen to have a pretty bad case of Crohn's which has sent me to the hospital twice this summer. \n\nBecause of the nature of On-Location shoots, I do not work directly for the studio but as an independent.\n\nHowever, Santa Claus photographer is another deal altogether. Usually the Studio hiers a recruitment agency to hier the photographers for them - which is how I ended up working with the Studio several years ago in the first place. \n\nSeeing their On-Location division was expanding and that there would not be any contracts during the holidays, we discussed and came to the conclusion that it would save them money if they hiered the 'Togs that were already working with them, and we would receive a better pay.\n\nSkipping over little details that I can add later on if need be\n\nImagine my surprise when yesterday morning, while seeing some of my colleagues for the first time since ending up the hospital again (link to previous post) they said\n\n\"Hey Timoris! Why aren't you on the Santa Schedule? You've been talking about this since August.\"\n\nYeah, why indeed?\n\n(several Emails, abridged, but NOT exagerated or twisted to seem like More than they are.)\n\n\"Well, because of your disease, we weren't sure if you would be able to. So if you still want to work on this project you'll have to go through the Recruitment agency because all the internal positions are filled up this year.\"\n\nReply\n\nWait a second, you contacted me to know if I was able to do my contracts I was already penned for, so why did you not contact me for the Santa 'Tog coach position we had previously discussed and emailed about?\n\nNo answer.\n\n\nI have much much MUUUUUCH more than I need to file a complaint with the government (whom in my country take this extremely seriously, swiftly, and with righteous anger - so much so that I had a company offer to hier me back 6 months after being fired for taking Government Manded leave of absence to help my father with a Gleoblastoma / terminal brain cancer in order to eskew the consequences) \n\nI won't.\n\nWhat it boils down to will be \"Well, we can't force the company to give you the position (which again, they did not directly hier me under them because of my Crohn's, hiring descriminiation 101,textbook even), so here is a monetary compensation package they will have to pay out to you. \"\n\n1- This will make me look like an opertunistic asshole, which I am not.\n\n2- I don't even think they realise what they have said and done, let alone the severity of it.\n\n3- Should I take the money, this will sour the relationship with the company by A LOT. This is bad because out of my 15+ years experience on the workforce, through many industries, this is by FAR the best working environment I have ever been in. Any change to that would completely the drive and motivation I have to wake up at 3:30am and drive 3 hours to the shoot location.\n\nI absolutely ADORE the photography industry and I am working with on of the most respected Studios in the Country, I don't want anything to get in between that.\n\nThe position I am in now was hard won enough, to be established as a 'Tog is hard enough - I honestly don't know what I would do if I lose even more than what I have lost. It's just not worth it.\n\nI want them to realise what they have done\n\nI don't want them to punish me for the government punishing them for them descriminating against.", "link": "https://www.reddit.com/r/photography/comments/dp1z9f/discriminated_and_discarded_by_my_employer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "discriminated and discarded by my employer because of their uncertainty about my disease - with emails of them saying exactly that - i will not be making a 'human rights' complaint despite being suggest to - what now? /!/ i work on contract with a very well established and respected photography studio where i hold the -----> position !!!  of lead on-location photographer.\n\ni also happen to have a pretty bad case of crohn's which has sent me to the hospital twice this summer. \n\nbecause of the nature of on-location shoots, i do not work directly for the studio but as an independent.\n\nhowever, santa claus photographer is another deal altogether. usually the studio hiers a recruitment agency to hier the photographers for them - which is how i ended up working with the studio several years ago in the first place. \n\nseeing their on-location division was expanding and that there would not be any contracts during the holidays, we discussed and came to the conclusion that it would save them money if they hiered the 'togs that were already working with them, and we would receive a better pay.\n\nskipping over little details that i can add later on if need be\n\nimagine my surprise when yesterday morning, while seeing some of my colleagues for the first time since ending up the hospital again (link to previous post) they said\n\n\"hey timoris! why aren't you on the santa schedule? you've been talking about this since august.\"\n\nyeah, why indeed?\n\n(several emails, abridged, but not exagerated or twisted to seem like more than they are.)\n\n\"well, because of your disease, we weren't sure if you would be able to. so if you still want to work on this project you'll have to go through the recruitment agency because all the internal positions are filled up this year.\"\n\nreply\n\nwait a second, you contacted me to know if i was able to do my contracts i was already penned for, so why did you not contact me for the santa 'tog coach position we had previously discussed and emailed about?\n\nno answer.\n\n\ni have much much muuuuuch more than i need to file a complaint with the government (whom in my country take this extremely seriously, swiftly, and with righteous anger - so much so that i had a company offer to hier me back 6 months after being fired for taking government manded leave of absence to help my father with a gleoblastoma / terminal brain cancer in order to eskew the consequences) \n\ni won't.\n\nwhat it boils down to will be \"well, we can't force the company to give you the position (which again, they did not directly hier me under them because of my crohn's, hiring descriminiation 101,textbook even), so here is a monetary compensation package they will have to pay out to you. \"\n\n1- this will make me look like an opertunistic asshole, which i am not.\n\n2- i don't even think they realise what they have said and done, let alone the severity of it.\n\n3- should i take the money, this will sour the relationship with the company by a lot. this is bad because out of my 15+ years experience on the workforce, through many industries, this is by far the best working environment i have ever been in. any change to that would completely the drive and motivation i have to wake up at 3:30am and drive 3 hours to the shoot location.\n\ni absolutely adore the photography industry and i am working with on of the most respected studios in the country, i don't want anything to get in between that.\n\nthe position i am in now was hard won enough, to be established as a 'tog is hard enough - i honestly don't know what i would do if i lose even more than what i have lost. it's just not worth it.\n\ni want them to realise what they have done\n\ni don't want them to punish me for the government punishing them for them descriminating against.", "sortedWord": "None", "identifyer": 7692, "year": "2019"}, {"Unnamed: 0": 317192, "autor": "raktim_pal", "date": 1555685116000, "content": "Just perfect position", "link": "https://www.reddit.com/r/photography/comments/bezx4z/just_perfect_position/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "just perfect -----> position !!! ", "sortedWord": "None", "identifyer": 64321, "year": "2019"}, {"Unnamed: 0": 317248, "autor": "theiansider", "date": 1555625810000, "content": "Does anyone use a personal logo to brand their photos? Could you show an example? /!/ Hey all!\n\nI'm currently in the process of branding some of the food lays I take professional photos for. I absolutely LOVE the brand logo that was created for me. However, I'm running into a problem where I'm noticing that the color of the logo sometimes conflicts with the colors of the photo. The logo POPS, and I'm under the impression that a watermark like that should be a bit inconspicuous. \n\nDoes anyone brand their images with a personal logo? If so, could you show an example? \n\nI'd love to see how people are branding their photos and what kind of watermarks they use (i.e., simple text, opacity, position on image).", "link": "https://www.reddit.com/r/photography/comments/berimy/does_anyone_use_a_personal_logo_to_brand_their/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "does anyone use a personal logo to brand their photos? could you show an example? /!/ hey all!\n\ni'm currently in the process of branding some of the food lays i take professional photos for. i absolutely love the brand logo that was created for me. however, i'm running into a problem where i'm noticing that the color of the logo sometimes conflicts with the colors of the photo. the logo pops, and i'm under the impression that a watermark like that should be a bit inconspicuous. \n\ndoes anyone brand their images with a personal logo? if so, could you show an example? \n\ni'd love to see how people are branding their photos and what kind of watermarks they use (i.e., simple text, opacity, -----> position !!!  on image).", "sortedWord": "None", "identifyer": 64379, "year": "2019"}, {"Unnamed: 0": 317924, "autor": "TheresShitInMyBucket", "date": 1568175387000, "content": "Any volunteer/job positions worth applying to involving travel? /!/ Hey guys, I've always done a lot of local traveling and I take jobs and volunteer stuff out in the preserves and parks out around the Mojave desert. Small stuff, but always fun taxing stuff like documenting tortoises in the Nevada summer or just doing photography for a wildlife preserve.\n\nAnyway, I found out that the USAP apparently has an artist grant program, which involves traveling to the Arctic for several months. I applied for that, but I was wondering what other similar things I could look into that don't involve steep travel costs and are available to US Citizens?", "link": "https://www.reddit.com/r/photography/comments/d2kgjs/any_volunteerjob_positions_worth_applying_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "any volunteer/job -----> positions !!!  worth applying to involving travel? /!/ hey guys, i've always done a lot of local traveling and i take jobs and volunteer stuff out in the preserves and parks out around the mojave desert. small stuff, but always fun taxing stuff like documenting tortoises in the nevada summer or just doing photography for a wildlife preserve.\n\nanyway, i found out that the usap apparently has an artist grant program, which involves traveling to the arctic for several months. i applied for that, but i was wondering what other similar things i could look into that don't involve steep travel costs and are available to us citizens?", "sortedWord": "None", "identifyer": 65071, "year": "2019"}, {"Unnamed: 0": 317925, "autor": "TheresShitInMyBucket", "date": 1568174627000, "content": "Any volunteer or job positions worth applying for as a photographer? /!/ Hey guys, I've always done a lot of local traveling and I take jobs and volunteer stuff out in the preserves and parks in the Mojave desert. Small stuff, but always fun taxing stuff involving as much as documenting tortoises in the Nevada summer.\n\nAnyway, I found out that the USAP apparently has an artist grant program, which involves traveling to the Arctic for several months. I applied for that, but I was wondering what other similar things I could look into that don't involve steep travel costs?", "link": "https://www.reddit.com/r/photography/comments/d2kbcp/any_volunteer_or_job_positions_worth_applying_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "any volunteer or job -----> positions !!!  worth applying for as a photographer? /!/ hey guys, i've always done a lot of local traveling and i take jobs and volunteer stuff out in the preserves and parks in the mojave desert. small stuff, but always fun taxing stuff involving as much as documenting tortoises in the nevada summer.\n\nanyway, i found out that the usap apparently has an artist grant program, which involves traveling to the arctic for several months. i applied for that, but i was wondering what other similar things i could look into that don't involve steep travel costs?", "sortedWord": "None", "identifyer": 65072, "year": "2019"}, {"Unnamed: 0": 318445, "autor": "CAEAT_ThrowAw", "date": 1552455020000, "content": "Tried to get into concert photography, now feeling like my work is completely worthless. /!/ (Using a throwaway account, as, if you read down here, will understand that I feel so inadequate for this that I don't really to get linked with my actual account)\n\nI'm gonna start saying that I'm not in the best mental place right now, as all this situation has kind of blown up in my face in the worst moment and probably in the worst way, so maybe something of what I write here is a bit over the top. I'm in a bad situation, but nothing that time wont heal.\n\nSo, I've been slowly getting into concert photography since the last year. I've went to some events, took some shots, learned a lot and tried, with not a lot of success, to reach out to bands/venues while getting close to none recognition. After the fourth concert with not even a \"thanks\" from the bands, I decided to stop for a while shooting and concentrate on other stuff (both in photography and in other hobbies) to clear my mind/reorganize myself.\n\nFast forward to this weekend, where I decided to go with a friend to a two-day festival (which is an annual event we also went the last year) to shoot again. After the second day, some of the organizers approached us to talk about the photos, as the event is a really small/underground stuff. They asked us for a contact to see our work, and felt that there was something going on.\n\nAnd of course it was. Two days after my friend tells me that one of the promoters (who also has a website) asked her to work (kind of, free press pass, you know) as photographer for events in our city, as the old photographer they got left and they were looking for someone to fill the position.\n\nAnd, even though I feel positively and genuine happy for her (she's going through some serious shit, and this is the kind of thing that could help her), I can't avoid feeling like someone has punched me in the stomach and basically spit on all the work I've put in my photography, for this event and for all the others. I reached out to both of the organizers, got a photo featured on their Facebook, a \"thanks\" from one of them and not even an answer from the other (the one who offered the post to my friend). On the positive side, I've gotten a fair share of retweets/likes from bands and the venue, but still.\n\nNow, I get that most of you will talk about \"shooting for fun\" and \"for yourself\", learning and all that stuff, but for me, part of the cool part of concert photography was getting some recognition. It took me 6-7 months to rebuild the confidence and to convince myself that putting the time and effort on this was worth it, and after this, the thought of picking the camera, or even talking about photography, be it around here or with friends, feels like pretending to be something I'm not even at an amateur level. \n\nAnd I don't know where to go from this. I was supposed to be on holidays after some really stressful days at my day job, and today I've been able to sleep only four hours. I've been through my share of bullshit myself and this is exactly what I did not needed. I've got a lot of photos to work in, but I'm contemplating giving up altogether, deleting my concert stuff, close/make private the Flickr and Facebook pages, leave the camera to gather dust for a long, fucking, while and not talk again about photography. I'm not even on the mood to go to more concerts. \n\nSome bullet points, to put some more bricks on this wall of text:\n\n* I can think on several factors why she got the offer. She was faster with the photos (I guess my workflow sucks), she's younger than me (So maybe they though she would be easier to convince for a non-paid position), and reached out earlier to them through Facebook. For what I've seen on her work, there's some really good stuff there, but I guess I'm not in the best moment to provide critique, as I'm on the point of \"everything I've done sucks except this two or three shots.\"\n\n* On the other hand, I haven't really reached out to anyone for critique on my stuff, as I've been too focused on getting the photos out there, so maybe is that my work actually sucks.\n\n* I guess I'm part an introvert, as reaching out someone about my work makes me a little nervous, and usually breaking a conversation \"in cold\" is a big no for me. Needless to say, after this, I'm as far as I can from the \"reaching out to someone about my work\" point.\n\nSo, if you've got here after reading all of this, first of all, thanks. Hope this ranty-esque post does not get deleted here. \n\nAnyway, I could really use some advice on how should I focus this and how cope with all of this. ", "link": "https://www.reddit.com/r/photography/comments/b0i9de/tried_to_get_into_concert_photography_now_feeling/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "tried to get into concert photography, now feeling like my work is completely worthless. /!/ (using a throwaway account, as, if you read down here, will understand that i feel so inadequate for this that i don't really to get linked with my actual account)\n\ni'm gonna start saying that i'm not in the best mental place right now, as all this situation has kind of blown up in my face in the worst moment and probably in the worst way, so maybe something of what i write here is a bit over the top. i'm in a bad situation, but nothing that time wont heal.\n\nso, i've been slowly getting into concert photography since the last year. i've went to some events, took some shots, learned a lot and tried, with not a lot of success, to reach out to bands/venues while getting close to none recognition. after the fourth concert with not even a \"thanks\" from the bands, i decided to stop for a while shooting and concentrate on other stuff (both in photography and in other hobbies) to clear my mind/reorganize myself.\n\nfast forward to this weekend, where i decided to go with a friend to a two-day festival (which is an annual event we also went the last year) to shoot again. after the second day, some of the organizers approached us to talk about the photos, as the event is a really small/underground stuff. they asked us for a contact to see our work, and felt that there was something going on.\n\nand of course it was. two days after my friend tells me that one of the promoters (who also has a website) asked her to work (kind of, free press pass, you know) as photographer for events in our city, as the old photographer they got left and they were looking for someone to fill the -----> position !!! .\n\nand, even though i feel positively and genuine happy for her (she's going through some serious shit, and this is the kind of thing that could help her), i can't avoid feeling like someone has punched me in the stomach and basically spit on all the work i've put in my photography, for this event and for all the others. i reached out to both of the organizers, got a photo featured on their facebook, a \"thanks\" from one of them and not even an answer from the other (the one who offered the post to my friend). on the positive side, i've gotten a fair share of retweets/likes from bands and the venue, but still.\n\nnow, i get that most of you will talk about \"shooting for fun\" and \"for yourself\", learning and all that stuff, but for me, part of the cool part of concert photography was getting some recognition. it took me 6-7 months to rebuild the confidence and to convince myself that putting the time and effort on this was worth it, and after this, the thought of picking the camera, or even talking about photography, be it around here or with friends, feels like pretending to be something i'm not even at an amateur level. \n\nand i don't know where to go from this. i was supposed to be on holidays after some really stressful days at my day job, and today i've been able to sleep only four hours. i've been through my share of bullshit myself and this is exactly what i did not needed. i've got a lot of photos to work in, but i'm contemplating giving up altogether, deleting my concert stuff, close/make private the flickr and facebook pages, leave the camera to gather dust for a long, fucking, while and not talk again about photography. i'm not even on the mood to go to more concerts. \n\nsome bullet points, to put some more bricks on this wall of text:\n\n* i can think on several factors why she got the offer. she was faster with the photos (i guess my workflow sucks), she's younger than me (so maybe they though she would be easier to convince for a non-paid position), and reached out earlier to them through facebook. for what i've seen on her work, there's some really good stuff there, but i guess i'm not in the best moment to provide critique, as i'm on the point of \"everything i've done sucks except this two or three shots.\"\n\n* on the other hand, i haven't really reached out to anyone for critique on my stuff, as i've been too focused on getting the photos out there, so maybe is that my work actually sucks.\n\n* i guess i'm part an introvert, as reaching out someone about my work makes me a little nervous, and usually breaking a conversation \"in cold\" is a big no for me. needless to say, after this, i'm as far as i can from the \"reaching out to someone about my work\" point.\n\nso, if you've got here after reading all of this, first of all, thanks. hope this ranty-esque post does not get deleted here. \n\nanyway, i could really use some advice on how should i focus this and how cope with all of this. ", "sortedWord": "None", "identifyer": 65615, "year": "2019"}, {"Unnamed: 0": 319155, "autor": "battlescream", "date": 1563468466000, "content": "Kai Boet lighting /!/ Hi. How would one go about creating light/flashes like this? What flashes is needed? How many? And where to position them? Thank you.", "link": "https://www.reddit.com/r/photography/comments/ceuz0h/kai_boet_lighting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "kai boet lighting /!/ hi. how would one go about creating light/flashes like this? what flashes is needed? how many? and where to -----> position !!!  them? thank you.", "sortedWord": "None", "identifyer": 66349, "year": "2019"}, {"Unnamed: 0": 320514, "autor": "jukito1", "date": 1550091064000, "content": "Moving Object Science Project /!/ I'm trying to get an image of a golf ball dropping. I've already made a set up. I have 3 gige cameras that are triggered as soon as the golf ball passes by the sensor. I've been able to get some images but they are slightly blurry. I've played around with the exposure time and I have the aperture opened completely (the lighting in the room is ehh). Is this a matter of adjusting the focus to the exact position I plan to drop the ball or would this still be an issue with the exposure time? ", "link": "https://www.reddit.com/r/photography/comments/aqbbuv/moving_object_science_project/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "moving object science project /!/ i'm trying to get an image of a golf ball dropping. i've already made a set up. i have 3 gige cameras that are triggered as soon as the golf ball passes by the sensor. i've been able to get some images but they are slightly blurry. i've played around with the exposure time and i have the aperture opened completely (the lighting in the room is ehh). is this a matter of adjusting the focus to the exact -----> position !!!  i plan to drop the ball or would this still be an issue with the exposure time? ", "sortedWord": "None", "identifyer": 67759, "year": "2019"}, {"Unnamed: 0": 320881, "autor": "QuantumModulus", "date": 1546988578000, "content": "Should I report unlawful unpaid internships to the DoL? /!/ Apologies: wall of text below!\n\n&amp;nbsp;\n\nI've been trying to enter the professional photo/design world for over a year now, and the vast majority of the positions that are open to someone without much industry experience are internships. Initially, I wasn't too wary of unpaid internships, and started one in June of 2018 only to realize that I was one of the only creatives making any serious content for a marketing agency of less than 8 people, which handled social media accounts for no less than 7 corporate clients. It was not educational, and after looking at [the Department of Labor's qualifications for a legitimate unpaid internship](https://www.dol.gov/whd/regs/compliance/whdfs71.htm), it was clear that it was wholly unlawful. I was doing the same work as they would have had me do had I stayed and gotten a full-time job with them, and I was absolutely providing them more value than they were providing me. They even had me use my own camera equipment.\n\n&amp;nbsp;\n\nAfter about two weeks, I left, and found another internship which was paid and much more legitimate. However, they were flaky with me about the status of my continuing work with them after the conclusion of the internship, and I wasn't going to continue working for them for an intern's hourly rate, with no promise of a future relationship. Coupled with the fact that it was dry work and I was growing less and less content with the company by the day, I was alright with walking away after it finished.\n\n&amp;nbsp;\n\nI'm now looking for more opportunities to diversify my experience as a creative editor, and the majority of them are internships for someone with my level of experience, which I'm fine with. What really gets me, though, is the number of unpaid internships that are currently listed which clearly do not serve to educate, and make little attempt (beyond saying \"will provide school credit\") to conceal the fact that they just want free labor. Some of them even say that the candidate must have and use their own camera, create content for clients' social media accounts, etc. [Here are examples](https://www.indeed.com/cmp/Romeo-Hunte-New-York/jobs/Design-Assistant-Intern-9c08794226476635?q=photo+intern&amp;vjs=3) [of what I'm talking about](https://www.indeed.com/cmp/DANIELLE-GUIZIO/jobs/Creative-Intern-c1048eaa49549d11?q=photo+intern&amp;vjs=3).\n\n&amp;nbsp;\n\nMy question for you all is this: should I take it upon myself to report these companies to the DoL for attempting to solicit free, unlawful labor?  Will it even make a difference? I know there are a few wealthy students who don't care about not getting paid because they're being supported by parents, and only want experience, but these internships really hurt the industry, and the young creators who can't afford to work for free. \n\n&amp;nbsp;\n\nI'm not sure what I'm looking to gain from doing something like that, but if it gets even a fraction of these companies to suck it up and make some room in their budget to pay their interns to do legitimate work, I think it would be worthwhile. Thoughts?", "link": "https://www.reddit.com/r/photography/comments/ae04rn/should_i_report_unlawful_unpaid_internships_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "should i report unlawful unpaid internships to the dol? /!/ apologies: wall of text below!\n\n&amp;nbsp;\n\ni've been trying to enter the professional photo/design world for over a year now, and the vast majority of the -----> positions !!!  that are open to someone without much industry experience are internships. initially, i wasn't too wary of unpaid internships, and started one in june of 2018 only to realize that i was one of the only creatives making any serious content for a marketing agency of less than 8 people, which handled social media accounts for no less than 7 corporate clients. it was not educational, and after looking at [the department of labor's qualifications for a legitimate unpaid internship](https://www.dol.gov/whd/regs/compliance/whdfs71.htm), it was clear that it was wholly unlawful. i was doing the same work as they would have had me do had i stayed and gotten a full-time job with them, and i was absolutely providing them more value than they were providing me. they even had me use my own camera equipment.\n\n&amp;nbsp;\n\nafter about two weeks, i left, and found another internship which was paid and much more legitimate. however, they were flaky with me about the status of my continuing work with them after the conclusion of the internship, and i wasn't going to continue working for them for an intern's hourly rate, with no promise of a future relationship. coupled with the fact that it was dry work and i was growing less and less content with the company by the day, i was alright with walking away after it finished.\n\n&amp;nbsp;\n\ni'm now looking for more opportunities to diversify my experience as a creative editor, and the majority of them are internships for someone with my level of experience, which i'm fine with. what really gets me, though, is the number of unpaid internships that are currently listed which clearly do not serve to educate, and make little attempt (beyond saying \"will provide school credit\") to conceal the fact that they just want free labor. some of them even say that the candidate must have and use their own camera, create content for clients' social media accounts, etc. [here are examples](https://www.indeed.com/cmp/romeo-hunte-new-york/jobs/design-assistant-intern-9c08794226476635?q=photo+intern&amp;vjs=3) [of what i'm talking about](https://www.indeed.com/cmp/danielle-guizio/jobs/creative-intern-c1048eaa49549d11?q=photo+intern&amp;vjs=3).\n\n&amp;nbsp;\n\nmy question for you all is this: should i take it upon myself to report these companies to the dol for attempting to solicit free, unlawful labor?  will it even make a difference? i know there are a few wealthy students who don't care about not getting paid because they're being supported by parents, and only want experience, but these internships really hurt the industry, and the young creators who can't afford to work for free. \n\n&amp;nbsp;\n\ni'm not sure what i'm looking to gain from doing something like that, but if it gets even a fraction of these companies to suck it up and make some room in their budget to pay their interns to do legitimate work, i think it would be worthwhile. thoughts?", "sortedWord": "None", "identifyer": 68141, "year": "2019"}, {"Unnamed: 0": 321183, "autor": "ZacMS", "date": 1549213082000, "content": "How to build a ceiling mounted dolly cam setup /!/ Hey guys, I'm a newbie videographer/photographer and need some help building an inverted dolly setup for my workshop. I do woodworking in my workshop and document it and share on social media. My workshop is narrow and long. Aprox 12 feet wide and 40 feet long.\n\nI want to mount a track on the center of the ceiling that runs the length of the shop that I can then attach a boom arm too with my camera, and maybe some accessories like a monitor, to. Here's a quick napkin sketch of what I'm thinking [https://imgur.com/ykYmKiX](https://imgur.com/ykYmKiX)\n\nI really need help building the shopping list of all the various parts I'm going to need. I already have the track and rollers, but what I really need help with is picking the right stands, adapters and etc.\n\nI'd like to be able lock the camera off at all sorts of different angles and positions, including overhead straight down shots. I work alone 99% of the time so there will be no one there to support the camera, so it needs to be sturdy and reliable.\n\nI'm not afraid of cutting metal and welding things for what its worth.\n\nAlso my camera is a Sony A7iii, so it won't need to support a crazy payload, but again since I want to add a monitor and maybe a light, I think it would need to be able to hold at least 10-15lbs at full extension.\n\nThanks in advance for any help you can offer!", "link": "https://www.reddit.com/r/photography/comments/amrd2a/how_to_build_a_ceiling_mounted_dolly_cam_setup/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "how to build a ceiling mounted dolly cam setup /!/ hey guys, i'm a newbie videographer/photographer and need some help building an inverted dolly setup for my workshop. i do woodworking in my workshop and document it and share on social media. my workshop is narrow and long. aprox 12 feet wide and 40 feet long.\n\ni want to mount a track on the center of the ceiling that runs the length of the shop that i can then attach a boom arm too with my camera, and maybe some accessories like a monitor, to. here's a quick napkin sketch of what i'm thinking [https://imgur.com/ykymkix](https://imgur.com/ykymkix)\n\ni really need help building the shopping list of all the various parts i'm going to need. i already have the track and rollers, but what i really need help with is picking the right stands, adapters and etc.\n\ni'd like to be able lock the camera off at all sorts of different angles and -----> positions !!! , including overhead straight down shots. i work alone 99% of the time so there will be no one there to support the camera, so it needs to be sturdy and reliable.\n\ni'm not afraid of cutting metal and welding things for what its worth.\n\nalso my camera is a sony a7iii, so it won't need to support a crazy payload, but again since i want to add a monitor and maybe a light, i think it would need to be able to hold at least 10-15lbs at full extension.\n\nthanks in advance for any help you can offer!", "sortedWord": "None", "identifyer": 68454, "year": "2019"}, {"Unnamed: 0": 321681, "autor": "onimous", "date": 1560999014000, "content": "Recommend a boom &amp; panhead for a laboratory application /!/ Hi r/photography, I have a need to hold laboratory equipment at a very stable and adjustable position. I think camera equipment might work but I need expert advice.\n\nMy idea is to mount a panhead to the end of a counterweighted boom. The boom would then mount to a heavy duty stand or tripod on casters. I would mount the panhead upside down (hanging) from the boom arm.\n\nThe equipment I need to mount weighs around 12lb. I need a boom and panhead that can deal with this weight without slipping. I have found the [Induro 5-way panhead](https://www.amazon.com/Induro-PHQ3-5-Way-Panhead/dp/B003LY3IJM/ref=sr_1_1?keywords=induro+5+way+panhead&amp;qid=1560992377&amp;s=gateway&amp;sr=8-1), which says it can handle up to 30lb and gives me all the angles I could need. I found [this](https://www.amazon.com/Sirui-HA-77-Horizontal-Arm/dp/B01KVLVRWM/ref=sr_1_50_sspa?keywords=camera+boom+arm&amp;qid=1560992781&amp;s=gateway&amp;sr=8-50-spons&amp;psc=1&amp;smid=A143QBZIQZCOJX) boom arm but I'm not confident that it is sturdy enough.\n\nI'd appreciate any comments about:\n\n* the feasibility of this system to precisely position a \\~12lb weight\n* experience with panheads - do they get \"slippy\" over time?\n* any recommendations on a good boom or stand system that can handle the weight?\n\nThanks, appreciate it", "link": "https://www.reddit.com/r/photography/comments/c2qiqh/recommend_a_boom_panhead_for_a_laboratory/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "recommend a boom &amp; panhead for a laboratory application /!/ hi r/photography, i have a need to hold laboratory equipment at a very stable and adjustable -----> position !!! . i think camera equipment might work but i need expert advice.\n\nmy idea is to mount a panhead to the end of a counterweighted boom. the boom would then mount to a heavy duty stand or tripod on casters. i would mount the panhead upside down (hanging) from the boom arm.\n\nthe equipment i need to mount weighs around 12lb. i need a boom and panhead that can deal with this weight without slipping. i have found the [induro 5-way panhead](https://www.amazon.com/induro-phq3-5-way-panhead/dp/b003ly3ijm/ref=sr_1_1?keywords=induro+5+way+panhead&amp;qid=1560992377&amp;s=gateway&amp;sr=8-1), which says it can handle up to 30lb and gives me all the angles i could need. i found [this](https://www.amazon.com/sirui-ha-77-horizontal-arm/dp/b01kvlvrwm/ref=sr_1_50_sspa?keywords=camera+boom+arm&amp;qid=1560992781&amp;s=gateway&amp;sr=8-50-spons&amp;psc=1&amp;smid=a143qbziqzcojx) boom arm but i'm not confident that it is sturdy enough.\n\ni'd appreciate any comments about:\n\n* the feasibility of this system to precisely position a \\~12lb weight\n* experience with panheads - do they get \"slippy\" over time?\n* any recommendations on a good boom or stand system that can handle the weight?\n\nthanks, appreciate it", "sortedWord": "None", "identifyer": 68968, "year": "2019"}, {"Unnamed: 0": 321986, "autor": "googoogoogoo100", "date": 1558497539000, "content": "How do I get this intense depth/angle in my photos? I know it’s partially the models position but what kind of lens?", "link": "https://www.reddit.com/r/photography/comments/brk39i/how_do_i_get_this_intense_depthangle_in_my_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how do i get this intense depth/angle in my photos? i know it’s partially the models -----> position !!!  but what kind of lens?", "sortedWord": "None", "identifyer": 69282, "year": "2019"}, {"Unnamed: 0": 322326, "autor": "HappySoda", "date": 1564922707000, "content": "A joke for us. Got a good laugh out of this one /!/ After Mrs. Jacobs found out her husband was sterile, the couple decided to hire a proxy father to start their family. On the day the proxy father was to arrive, Mr. Jacobs kissed his wife and said 'I'm off to work, Lydia. The guy should be here soon.'\n\nWouldn't you know it, a door-to-door baby photographer came by half an hour later, hoping to make a sale. Mrs. Jacobs answered the door. 'Good morning, ma'am. You don't know me, but I've come to...' 'Oh yes, I know why you're here. Harry told me you'd be coming soon.' 'He did? But I...' 'Come right in! No use wasting time .' 'Very well, then.'\n\nThe photographer took out his briefcase and sat down. 'As you may already know, I've made a specialty of babies.' 'Good, I'm glad,' said Mrs. Jacobs. 'That's just what Harry and I were looking for.'\n\n'I usually like to try two in the bathtub, one on the couch and perhaps a couple on the bed,' said the photographer. 'The living room floor is fun too...you can really spread out.' 'Bathtub? Living room floor? No wonder it never worked for Harry and me.' 'Well, ma'am, none of us can guarantee a perfect one every time, but if we try several different positions and I shoot from six or seven different angles, I think you'll be quite pleased with the results.'\n\n'I certainly hope we can get this over with quickly,' Mrs. Jacobs gasped nervously. 'Ma'am, in my line of work a man must take his time. I'd like to be in and out in five minutes, but you'd be disappointed with that, I'm sure.' 'Don't I know!' said Mrs. Jacobs.\n\nThe photographer pulled out a portfolio of his pictures. 'This one was done on top of a bus in downtown London,' he said, showing Mrs. Jacobs the picture. 'Oh my God!' exclaimed Mrs. Jacobs, tugging on her handkerchief.\n\n'And these twins turned out exceptionally well when you consider the fact that their mother was so difficult to work with.' He showed Mrs. Jacobs another picture. 'She was difficult?' questioned Mrs. Jacobs. 'Extremely,' said the photographer. 'I finally had to take her to Hyde Park to get the job done right. People were crowding around, four and five deep, just to get a good look.' 'Four and five deep!' Mrs. Jacobs was amazed. 'Yes,' said the photographer. 'And for more than three hours, too. The mother was constantly squealing and yelling. I could hardly concentrate. Then, it started getting dark and I had to rush my shots. Finally, when the squirrels started nibbling on my equipment. I just packed it all in.'\n\nMrs. Jacobs leaned forward. 'You mean the squirrels actually chewed on your, um...equipment?' 'Yes, ma'am. Thank God, no real damage was done.\n\nWell, we'll get to work as soon as I set up my tripod.'\n\n'Tripod? ' Mrs. Jacobs looked extremely worried now.\n\n'Of course. I need to use a tripod to rest my Canon on. It's much to big for me to hold while I'm getting ready for action. Ma'am???'", "link": "https://www.reddit.com/r/photography/comments/clvwvw/a_joke_for_us_got_a_good_laugh_out_of_this_one/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "a joke for us. got a good laugh out of this one /!/ after mrs. jacobs found out her husband was sterile, the couple decided to hire a proxy father to start their family. on the day the proxy father was to arrive, mr. jacobs kissed his wife and said 'i'm off to work, lydia. the guy should be here soon.'\n\nwouldn't you know it, a door-to-door baby photographer came by half an hour later, hoping to make a sale. mrs. jacobs answered the door. 'good morning, ma'am. you don't know me, but i've come to...' 'oh yes, i know why you're here. harry told me you'd be coming soon.' 'he did? but i...' 'come right in! no use wasting time .' 'very well, then.'\n\nthe photographer took out his briefcase and sat down. 'as you may already know, i've made a specialty of babies.' 'good, i'm glad,' said mrs. jacobs. 'that's just what harry and i were looking for.'\n\n'i usually like to try two in the bathtub, one on the couch and perhaps a couple on the bed,' said the photographer. 'the living room floor is fun too...you can really spread out.' 'bathtub? living room floor? no wonder it never worked for harry and me.' 'well, ma'am, none of us can guarantee a perfect one every time, but if we try several different -----> positions !!!  and i shoot from six or seven different angles, i think you'll be quite pleased with the results.'\n\n'i certainly hope we can get this over with quickly,' mrs. jacobs gasped nervously. 'ma'am, in my line of work a man must take his time. i'd like to be in and out in five minutes, but you'd be disappointed with that, i'm sure.' 'don't i know!' said mrs. jacobs.\n\nthe photographer pulled out a portfolio of his pictures. 'this one was done on top of a bus in downtown london,' he said, showing mrs. jacobs the picture. 'oh my god!' exclaimed mrs. jacobs, tugging on her handkerchief.\n\n'and these twins turned out exceptionally well when you consider the fact that their mother was so difficult to work with.' he showed mrs. jacobs another picture. 'she was difficult?' questioned mrs. jacobs. 'extremely,' said the photographer. 'i finally had to take her to hyde park to get the job done right. people were crowding around, four and five deep, just to get a good look.' 'four and five deep!' mrs. jacobs was amazed. 'yes,' said the photographer. 'and for more than three hours, too. the mother was constantly squealing and yelling. i could hardly concentrate. then, it started getting dark and i had to rush my shots. finally, when the squirrels started nibbling on my equipment. i just packed it all in.'\n\nmrs. jacobs leaned forward. 'you mean the squirrels actually chewed on your, um...equipment?' 'yes, ma'am. thank god, no real damage was done.\n\nwell, we'll get to work as soon as i set up my tripod.'\n\n'tripod? ' mrs. jacobs looked extremely worried now.\n\n'of course. i need to use a tripod to rest my canon on. it's much to big for me to hold while i'm getting ready for action. ma'am???'", "sortedWord": "None", "identifyer": 69633, "year": "2019"}, {"Unnamed: 0": 322850, "autor": "Cryptikfox", "date": 1571094979000, "content": "Getting Out of an Editing Rut /!/ TL;DR: Have you been in an editing (or other photographic) rut? What did you do to get out of it? I've found inspiration again by reactivating my website and getting my photos up there. \n__________________________________\n\nHave you ever been in an editing rut, where you might have a ton of photos that you just haven't gotten around to processing yet?\n\nI have been for some time and find that between the business of life, it can sometime be hard to find the time (or energy) to go through my ever growing library of photoshoots. It's kind of funny, because during this time, I still have shot a lot—probably some of the most I ever have. We even treated ourselves to a major camera upgrade (my wife's a photographer too) that we've been much overdue for. I can see my skill progressing a lot through the last year and I am quite pleased with how much I'm improving. Yet I still have so many photos, and even entire photoshoots that I haven't even gotten around to touching yet! Some of my best photography has been (and still is) lying untouched in a hard drive on my desk. The photos of them that I have gotten around to processing I feel are just the tip of the iceberg.\n\nI was on the fence for some time, but finally decided to reactive my website so that I could have a one-stop-shop for my favorite photos, and organize it how I want. (Haven't been much a fan of social media... just doesn't quite do it for me). Through this, and some mindful time-management, I can feel myself getting more inspired to work through these photos and get them out there.\n\nHas anyone else been in a position similar to this? What did you do to get out of it and how did you rekindle your inspiration? Looking forward to your responses below.", "link": "https://www.reddit.com/r/photography/comments/dhywza/getting_out_of_an_editing_rut/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "getting out of an editing rut /!/ tl;dr: have you been in an editing (or other photographic) rut? what did you do to get out of it? i've found inspiration again by reactivating my website and getting my photos up there. \n__________________________________\n\nhave you ever been in an editing rut, where you might have a ton of photos that you just haven't gotten around to processing yet?\n\ni have been for some time and find that between the business of life, it can sometime be hard to find the time (or energy) to go through my ever growing library of photoshoots. it's kind of funny, because during this time, i still have shot a lot—probably some of the most i ever have. we even treated ourselves to a major camera upgrade (my wife's a photographer too) that we've been much overdue for. i can see my skill progressing a lot through the last year and i am quite pleased with how much i'm improving. yet i still have so many photos, and even entire photoshoots that i haven't even gotten around to touching yet! some of my best photography has been (and still is) lying untouched in a hard drive on my desk. the photos of them that i have gotten around to processing i feel are just the tip of the iceberg.\n\ni was on the fence for some time, but finally decided to reactive my website so that i could have a one-stop-shop for my favorite photos, and organize it how i want. (haven't been much a fan of social media... just doesn't quite do it for me). through this, and some mindful time-management, i can feel myself getting more inspired to work through these photos and get them out there.\n\nhas anyone else been in a -----> position !!!  similar to this? what did you do to get out of it and how did you rekindle your inspiration? looking forward to your responses below.", "sortedWord": "None", "identifyer": 70173, "year": "2019"}, {"Unnamed: 0": 323210, "autor": "rajat_at95", "date": 1572037452000, "content": "Waited Long to get this position of Dog😅", "link": "https://www.reddit.com/r/photography/comments/dn3sn7/waited_long_to_get_this_position_of_dog/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "waited long to get this -----> position !!!  of dog😅", "sortedWord": "None", "identifyer": 70549, "year": "2019"}, {"Unnamed: 0": 323956, "autor": "bhughey1355", "date": 1553821454000, "content": "Interviewing for a tutoring position through my graduate school... Have to give a 5 minute lesson about something I’m passionate about... Photography was an obvious choice :) Any good ideas? /!/ Thinking about teaching the 3 basic settings that beginner DSLR users should know (ISO, Shutter Speed, Aperture) and how to use these settings to get proper exposure. Thinking about defining each and then going into the Pros and Cons of Each\n\nex: \nISO: More light but more grain, most people resort to increasing this last. Can be helpful in low light situations. \nShutter Speed: Slower lets in more light, but means a higher likelihood of camera shake/blur. \nAperture: Introduces more light and people tend to like utilizing this setting in portraits (with the benefit of the infamous “blurry background” at wide open settings).\n\nThis can also be interactive if yall have any ideas. The example above is not official whatsoever.. just what I typed up in a minute. ", "link": "https://www.reddit.com/r/photography/comments/b6r0p9/interviewing_for_a_tutoring_position_through_my/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "interviewing for a tutoring -----> position !!!  through my graduate school... have to give a 5 minute lesson about something i’m passionate about... photography was an obvious choice :) any good ideas? /!/ thinking about teaching the 3 basic settings that beginner dslr users should know (iso, shutter speed, aperture) and how to use these settings to get proper exposure. thinking about defining each and then going into the pros and cons of each\n\nex: \niso: more light but more grain, most people resort to increasing this last. can be helpful in low light situations. \nshutter speed: slower lets in more light, but means a higher likelihood of camera shake/blur. \naperture: introduces more light and people tend to like utilizing this setting in portraits (with the benefit of the infamous “blurry background” at wide open settings).\n\nthis can also be interactive if yall have any ideas. the example above is not official whatsoever.. just what i typed up in a minute. ", "sortedWord": "None", "identifyer": 71338, "year": "2019"}, {"Unnamed: 0": 323980, "autor": "humayun1991", "date": 1553792643000, "content": "We can't forget the natural, the natural beauty is better then everything. always need keep in our mind that how human come to this position.", "link": "https://www.reddit.com/r/photography/comments/b6ldhm/we_cant_forget_the_natural_the_natural_beauty_is/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "we can't forget the natural, the natural beauty is better then everything. always need keep in our mind that how human come to this -----> position !!! .", "sortedWord": "None", "identifyer": 71363, "year": "2019"}, {"Unnamed: 0": 324001, "autor": "clumsy-sailor", "date": 1553768024000, "content": "Best lighting for portrait with mature model? /!/ I need advice.\n\nI've been shooting for a few months, so obviously I don't have a lot of experience, but  last night I felt confident enough to ask my wife to have a shooting session (she wanted new photos for her social media, mainly head or head/shoulders shots). Some weeks ago I purchased a couple of stands, umbrellas, speedlights and remote controls, I practised a bit on stuffed animals (toys) and I thought I had more or less got it.\n\nI put one flash with umbrella diffuser (shoot-through) 45 deg away and 45 deg up, like I have seen in so many tutorials. The result made my wife literally run away from my improvised studio space: despite the diffuser, the lighting looked hard and mercilessly revealing every wrinkle, pore or tiny imperfections on her face. She's a beautiful woman in her early 40s and clearly her skin is no longer a teenager's. She went taking some selfies with their phone and maybe due to the tiny lens, poor lights or something else, but the pics she got were far more pleasing and flattering that those I had shot moments before.\n\nI was shooting with a Nikon D7200/50mm 1.8 in manual mode, flash I already described, I nailed exposure perfectly. The sharpness and detail was amazing and... that what the problem was :-(\n\nSo I'd like to ask: what's the best way to set up a flash with a mature model (as in all tutorial videos I watched models are invariably young) to make her face just look good, smooth out (or, at least, avoid highlighting) wrinkles and imperfections? Do I need to position the flash closer to the camera-subject axis so that more frontal light would have a flattening effect? I couldn't do any experimentation as she literally run away after she saw the first few previews.\n\nOr in these circumstances with a smartphone you always get better results (\"better\" as in \"pleasing to a mature woman who is terrified by the first signs of aging\")?\n\nSorry for the long post, please advise... ", "link": "https://www.reddit.com/r/photography/comments/b6gzr8/best_lighting_for_portrait_with_mature_model/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best lighting for portrait with mature model? /!/ i need advice.\n\ni've been shooting for a few months, so obviously i don't have a lot of experience, but  last night i felt confident enough to ask my wife to have a shooting session (she wanted new photos for her social media, mainly head or head/shoulders shots). some weeks ago i purchased a couple of stands, umbrellas, speedlights and remote controls, i practised a bit on stuffed animals (toys) and i thought i had more or less got it.\n\ni put one flash with umbrella diffuser (shoot-through) 45 deg away and 45 deg up, like i have seen in so many tutorials. the result made my wife literally run away from my improvised studio space: despite the diffuser, the lighting looked hard and mercilessly revealing every wrinkle, pore or tiny imperfections on her face. she's a beautiful woman in her early 40s and clearly her skin is no longer a teenager's. she went taking some selfies with their phone and maybe due to the tiny lens, poor lights or something else, but the pics she got were far more pleasing and flattering that those i had shot moments before.\n\ni was shooting with a nikon d7200/50mm 1.8 in manual mode, flash i already described, i nailed exposure perfectly. the sharpness and detail was amazing and... that what the problem was :-(\n\nso i'd like to ask: what's the best way to set up a flash with a mature model (as in all tutorial videos i watched models are invariably young) to make her face just look good, smooth out (or, at least, avoid highlighting) wrinkles and imperfections? do i need to -----> position !!!  the flash closer to the camera-subject axis so that more frontal light would have a flattening effect? i couldn't do any experimentation as she literally run away after she saw the first few previews.\n\nor in these circumstances with a smartphone you always get better results (\"better\" as in \"pleasing to a mature woman who is terrified by the first signs of aging\")?\n\nsorry for the long post, please advise... ", "sortedWord": "None", "identifyer": 71384, "year": "2019"}, {"Unnamed: 0": 324648, "autor": "Sleap12", "date": 1553110488000, "content": "CONTENT CREATORS/PHOTOGRAPHERS, would you use this app instead of Instagram/Pinterest? /!/  Hello everyone! My name is Eugene. And I REALLY NEED your guys' opinion on the app for content creators me and friends have been building for 2 years now. I continuously get pissed by how Instagram shows me old photos of people or things that I don't even think are cool enough to be at the top of my Explore feed. So long story short, me and my team made this app called **Carusel**. Here is the download link: [**https://carusel.io/**](https://carusel.io/) We position it as a content-discovery app where the rating of content depends exclusively on its quality, and not on the popularity of the author. The app increases the chances of finding new interests, getting unbiased opinions as well as trending news, and distributing content virally. \n\n*This is how it works:*\n\n*1. A user publishes the post that is sent to a group of random people*\n\n*2. If they like the post, they can support it*\n\n*3. A supported post is sent out to another larger group of people, and so on*\n\nThe more users support the post, the more people it gets shown to. As a result, only the most genuine and interesting content (as judged by the majority of users) receives the deserved recognition and virality. Users rate the content posted both by the professional and amateur creators so even the newbies in content creation can get the viral recognition they deserve! \n\nI would be really grateful if you guys could give me **feedback** if you enjoy using the app with content being distributed by the “human choice” algorithm rather than the artificial one like in Instagram, Pinterest, etc.? Do you think you would use it on a regular basis like Instagram, Pinterest, etc.? Thanks!", "link": "https://www.reddit.com/r/photography/comments/b3gc30/content_creatorsphotographers_would_you_use_this/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "content creators/photographers, would you use this app instead of instagram/pinterest? /!/  hello everyone! my name is eugene. and i really need your guys' opinion on the app for content creators me and friends have been building for 2 years now. i continuously get pissed by how instagram shows me old photos of people or things that i don't even think are cool enough to be at the top of my explore feed. so long story short, me and my team made this app called **carusel**. here is the download link: [**https://carusel.io/**](https://carusel.io/) we -----> position !!!  it as a content-discovery app where the rating of content depends exclusively on its quality, and not on the popularity of the author. the app increases the chances of finding new interests, getting unbiased opinions as well as trending news, and distributing content virally. \n\n*this is how it works:*\n\n*1. a user publishes the post that is sent to a group of random people*\n\n*2. if they like the post, they can support it*\n\n*3. a supported post is sent out to another larger group of people, and so on*\n\nthe more users support the post, the more people it gets shown to. as a result, only the most genuine and interesting content (as judged by the majority of users) receives the deserved recognition and virality. users rate the content posted both by the professional and amateur creators so even the newbies in content creation can get the viral recognition they deserve! \n\ni would be really grateful if you guys could give me **feedback** if you enjoy using the app with content being distributed by the “human choice” algorithm rather than the artificial one like in instagram, pinterest, etc.? do you think you would use it on a regular basis like instagram, pinterest, etc.? thanks!", "sortedWord": "None", "identifyer": 72060, "year": "2019"}, {"Unnamed: 0": 324817, "autor": "x172839x", "date": 1550021269000, "content": "Multi-Angle Platform /!/ Context: I have a camera setup where the camera is mounted on the Z-axis and can travel only on this axis (shooting down). I am positioning various items under the camera and sometimes require specific angles to capture my subject. \n\nI am looking for a platform where I may place my subject and multiple angles can be achieved. 0-90 degrees is preferred. The more granular the angles the better. I would prefer there to be a lip on the bottom of the platform to easily hold my subjects if possible. A transparent platform would be best but if not transparent than white and/or white. \n\nI will provide an example of what I am seeking below. This just doesn’t quite meet my needs. \n\n[Example](Light Box Pad Stand, Multifunctional 7 Angle Points Skidding Prevented Tracing Holder for Huion Laptop LED Light Table A4 LB4 L4S and Most tracing Ligh Box Pad(White) https://www.amazon.com/dp/B07K1LRJ5N/ref=cm_sw_r_cp_api_i_Ki3yCb6NBW3S7)", "link": "https://www.reddit.com/r/photography/comments/aq0zcc/multiangle_platform/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "multi-angle platform /!/ context: i have a camera setup where the camera is mounted on the z-axis and can travel only on this axis (shooting down). i am -----> positioning !!!  various items under the camera and sometimes require specific angles to capture my subject. \n\ni am looking for a platform where i may place my subject and multiple angles can be achieved. 0-90 degrees is preferred. the more granular the angles the better. i would prefer there to be a lip on the bottom of the platform to easily hold my subjects if possible. a transparent platform would be best but if not transparent than white and/or white. \n\ni will provide an example of what i am seeking below. this just doesn’t quite meet my needs. \n\n[example](light box pad stand, multifunctional 7 angle points skidding prevented tracing holder for huion laptop led light table a4 lb4 l4s and most tracing ligh box pad(white) https://www.amazon.com/dp/b07k1lrj5n/ref=cm_sw_r_cp_api_i_ki3ycb6nbw3s7)", "sortedWord": "None", "identifyer": 72233, "year": "2019"}, {"Unnamed: 0": 324899, "autor": "yatookmyname", "date": 1550437358000, "content": "Sales photography position? is it a scam? /!/ Hello,\n\n&amp;#x200B;\n\nFirst thank you to anyone who takes the time to help me. So I came across these 2 photography jobs 1 seemed more of a scam than the other but I wanted to ask if any of you have had experience with these jobs. \n\n&amp;#x200B;\n\nIn the first job it for maternity photos and I believe the base pay was $9hr which is very little and the goal is to sell prints. If you sell prints and packages GREATER than the amount you make per hour you keep the money you made selling prints. This seems a little scammy to me because you make like 20% of the product you sell and it seemed to me like it would be difficult/not much MORE than the original $9hr. \n\n&amp;#x200B;\n\nThe second job I came across was even worse than the first and I cannot believe this scam exists. Maybe I'm over reacting so I wanted to get some opinions. Soo this job was a photography position where the lady wanted ME to pay her $100 so I can have the \"Privilege\" of standing in front of a dave and busters selling prints. She claims that you can make $500 on tips alone in a Saturday night but this seems to me like the biggest load of crap I've seen in a long time. \n\n&amp;#x200B;\n\nThought? have any of you worked these \"sale photography\" positions. I think it would only be worth it if the $9 was your base pay and whatever you sold was your commission. ", "link": "https://www.reddit.com/r/photography/comments/arp100/sales_photography_position_is_it_a_scam/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "sales photography -----> position !!! ? is it a scam? /!/ hello,\n\n&amp;#x200b;\n\nfirst thank you to anyone who takes the time to help me. so i came across these 2 photography jobs 1 seemed more of a scam than the other but i wanted to ask if any of you have had experience with these jobs. \n\n&amp;#x200b;\n\nin the first job it for maternity photos and i believe the base pay was $9hr which is very little and the goal is to sell prints. if you sell prints and packages greater than the amount you make per hour you keep the money you made selling prints. this seems a little scammy to me because you make like 20% of the product you sell and it seemed to me like it would be difficult/not much more than the original $9hr. \n\n&amp;#x200b;\n\nthe second job i came across was even worse than the first and i cannot believe this scam exists. maybe i'm over reacting so i wanted to get some opinions. soo this job was a photography position where the lady wanted me to pay her $100 so i can have the \"privilege\" of standing in front of a dave and busters selling prints. she claims that you can make $500 on tips alone in a saturday night but this seems to me like the biggest load of crap i've seen in a long time. \n\n&amp;#x200b;\n\nthought? have any of you worked these \"sale photography\" positions. i think it would only be worth it if the $9 was your base pay and whatever you sold was your commission. ", "sortedWord": "None", "identifyer": 72317, "year": "2019"}, {"Unnamed: 0": 325720, "autor": "cpacker", "date": 1547262358000, "content": "Two different newspapers, same instant in helicopter flight /!/ These two pics of Trump and two others saluting a helicopter\n\nwere on the front pages of the NY Times and Washington Post:\n\n[http://cpacker.org/a1.jpg](http://cpacker.org/a1.jpg)\n\n[http://cpacker.org/a2.jpg](http://cpacker.org/a2.jpg)\n\nClearly snapped by two different cameras because the viewing angles\n\nare different. But from the positions of the helicopter blades,\n\nthey both caught the same instant. Do I guess correctly that\n\nboth cameras were used in burst mode and that, miraculously, each\n\neditor happened to choose frames from the separate series that \n\ncapture the same moment? If so, what would be the burst rate that\n\nwould have been used?\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/af3av5/two_different_newspapers_same_instant_in/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "two different newspapers, same instant in helicopter flight /!/ these two pics of trump and two others saluting a helicopter\n\nwere on the front pages of the ny times and washington post:\n\n[http://cpacker.org/a1.jpg](http://cpacker.org/a1.jpg)\n\n[http://cpacker.org/a2.jpg](http://cpacker.org/a2.jpg)\n\nclearly snapped by two different cameras because the viewing angles\n\nare different. but from the -----> positions !!!  of the helicopter blades,\n\nthey both caught the same instant. do i guess correctly that\n\nboth cameras were used in burst mode and that, miraculously, each\n\neditor happened to choose frames from the separate series that \n\ncapture the same moment? if so, what would be the burst rate that\n\nwould have been used?\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 73169, "year": "2019"}, {"Unnamed: 0": 325881, "autor": "K311ch1", "date": 1548110825000, "content": "Photography Scam /!/ I was looking for a photography job in WDC area in LinkedIn, I found a job from a nice company called IQ Studios and I applied, the send me this email:\n\n\nHello,\n We have taken our time to crucially exam your resume, whether or not you possess the qualities, abilities and technical know-how to execute this job effectively with perfection/precision, and are glad to bring to your notice that you have been chosen as an ideal candidate that is skilled, motivated, energetic and ideal to work with us.\n\nWe were recently engaged/contracted for a photo shoot by/for our client Michael Kors for a TV commercial of theirs. This is a highly professional, creative, and collaborative project and should be executed flawlessly, this position could lead to long-term opportunity and based on your productivity, performance and skillset you shall be guaranteed and also be staffed permanently with this organization.\n\nCompany Profile:\nWe offer photography services, both still photos and motion pictures. we believe in quality service serviced to you at the time you need it.We cover all areas of life, nature, wild life, family, weddings, and any other function. You live the moments, we capture them all you have left are the memories. That’s why it’s important to have a professional studio with an established reputation you trust to capture those once in a lifetime moments in photos &amp; video.\n\nPay: You will be paid $350/day which will amount to $1050 for the 3 days.\n\nProject Details: The photo shoot will be Held in New York during the weekend of 02-15-2019 to 02-17-2019 at The Mandarin Oriental, 80 Columbus Cir, New York, NY 10023. Both your traveling, hotel bills ,per diem expenses will be covered by our client.  I believe you are not booked for those dates so i will be needing you to reassure me of your availability and commitment for those dates. Please reconfirm this information below:\n\nFull name:\nMailing address:\nCity, State, Zip Code:\nMobile Phone Number:     \n\nNOTE: You will also receive a check via USPS and this check will cover your personal expenses which includes travel/lodging and will be handled via our sponsors designated travel agent. You are to deduct the amount of $350 out of the check, this is allocated as your upfront payment while the remaining balance will be transferred to our Sponsors travel agent who will make all the necessary hotel and travel arrangement on your behalf. You get daily update via email, Feel free to email your concerns and we will get back to you ASAP.\n\nRegards,\nJackson Brown\nDirector/Photographer\nwww.iqstudio.photography\n\n—————————————————————\n\nNow they are calling me to Sign a contract and they will send me the check... Any advice of what I should do???\n\n\nwhat do you think guys?", "link": "https://www.reddit.com/r/photography/comments/aig16p/photography_scam/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "photography scam /!/ i was looking for a photography job in wdc area in linkedin, i found a job from a nice company called iq studios and i applied, the send me this email:\n\n\nhello,\n we have taken our time to crucially exam your resume, whether or not you possess the qualities, abilities and technical know-how to execute this job effectively with perfection/precision, and are glad to bring to your notice that you have been chosen as an ideal candidate that is skilled, motivated, energetic and ideal to work with us.\n\nwe were recently engaged/contracted for a photo shoot by/for our client michael kors for a tv commercial of theirs. this is a highly professional, creative, and collaborative project and should be executed flawlessly, this -----> position !!!  could lead to long-term opportunity and based on your productivity, performance and skillset you shall be guaranteed and also be staffed permanently with this organization.\n\ncompany profile:\nwe offer photography services, both still photos and motion pictures. we believe in quality service serviced to you at the time you need it.we cover all areas of life, nature, wild life, family, weddings, and any other function. you live the moments, we capture them all you have left are the memories. that’s why it’s important to have a professional studio with an established reputation you trust to capture those once in a lifetime moments in photos &amp; video.\n\npay: you will be paid $350/day which will amount to $1050 for the 3 days.\n\nproject details: the photo shoot will be held in new york during the weekend of 02-15-2019 to 02-17-2019 at the mandarin oriental, 80 columbus cir, new york, ny 10023. both your traveling, hotel bills ,per diem expenses will be covered by our client.  i believe you are not booked for those dates so i will be needing you to reassure me of your availability and commitment for those dates. please reconfirm this information below:\n\nfull name:\nmailing address:\ncity, state, zip code:\nmobile phone number:     \n\nnote: you will also receive a check via usps and this check will cover your personal expenses which includes travel/lodging and will be handled via our sponsors designated travel agent. you are to deduct the amount of $350 out of the check, this is allocated as your upfront payment while the remaining balance will be transferred to our sponsors travel agent who will make all the necessary hotel and travel arrangement on your behalf. you get daily update via email, feel free to email your concerns and we will get back to you asap.\n\nregards,\njackson brown\ndirector/photographer\nwww.iqstudio.photography\n\n—————————————————————\n\nnow they are calling me to sign a contract and they will send me the check... any advice of what i should do???\n\n\nwhat do you think guys?", "sortedWord": "None", "identifyer": 73334, "year": "2019"}, {"Unnamed: 0": 327571, "autor": "zer0point2017", "date": 1557717339000, "content": "Buying advice: noob question re: Canon M50 vs Sony ______ ?? /!/ Hi all! (post fgot kinda long; I put an abbreviated form of my main question at the end as a TLDR) \n\n&amp;#x200B;\n\nMy name's Scott. I'm a CNC lathe programmer from Houston TX.  I'm a total noob when it comes to photography. My main passions for as long as I can remember have been guitar and video games (mainly Call of Duty.  ...I know.. shhh)  . As well as PC building/tech. \n\nRecently I've been watching Peter McKinnon and Potato Jet and a couple other photography YouTube channels and it's really inspired me. I've been amazed by some of the video editing, quality of still shots, and just photography's power in general.  I've always wanted to make videos:  whether it's Call of Duty highlight films and gameplays, or guitar reviews/sound samples/songwriting, PC time lapse custom builds...  there's so much stuff I want to try. As a side note, as it relates to my question below:  I'm moving in 1 month, and in our new home i will be building a PC gaming setup/office studio.  Think big wooden countertop desk, widescreen monitor(s), area dedicated for filming/unboxing, area for guitars and music/audio,  ....ETC.  I want to incorporate photography into this setup. \n\n&amp;#x200B;\n\nI've ALMOST pulled the trigger on a CanonM50 several times this past week.  I like the price point, the performance seems solid for both video and stills, articulating LCD..  etc. HOWEVER one of the main things that's holding me back is the lack of 120fps slow mo in 1080p.  Also the dual pixel A.F.  in 4k would be nice. really\\* would prefer 1080/120 ..  it does have 120fps but it's 720p.  even for a beginner I'm just not keen on using slow mo in 720p.  it's 2019.  . \n\n&amp;#x200B;\n\nanyway. sorry if this sounds stupid. esp from someone as inexperienced as myself.  I am really considering saving for the Fuji XT3 as it has everything I'm looking for (and more) .. as well as looking at the EOS R.  (although this camera retains the dual pixel AF in 4k, I'm really put off by a $2k camera that won't do 120fps in HD. seems dumb to me. am I missing something here?  If the EOS R had that one feature, I'd likely be saving for it right now. Maybe I'm wrong, or they could add it via firmware?  IDK. ).  \n\nLast thing I'll mention before wrapping it up:  I'm also curious about time lapse capabilities. Ive done a decent amount of research (ok not very much) and I don't know much about the M50's time lapse ability.  This is DEFINITELY a priority.. arguably more than 120 fps. ( i could almost live with 60fps or 720p/120 upscaled to 1080) but ....  with NO time lapse, that's a deal breaker.  One of the first things I wanna do is a time lapse of me building my first \"HIGH end\" gaming PC. can anyone shed some light on if the M50 would do that well? \n\n&amp;#x200B;\n\nTLDR I'm not planning on vlogging, but doing multiple things with heavier emphasis on video.  I want something versatile.. my main priorities:  able to shoot great stills, capture slow motion 1080/120 fps, do good time lapses, has to have a Mic input for audio, fully flip LCD preferred but not required.  leaning towards Canon M50 but it's lacking the 120/1080.  Also considering some Sony options (RX10 III/IV, RX100 IV/V/VI , ...others? a6400!! that's the one).   My budget is flexible. but would refer under 800-1k.  Going for a A7RIII or EOS R or GH5S would be nice/preferred, but would literally take me a couple months (or selling a guitar) to pull off.   \n\n&amp;#x200B;\n\nwhat camera would you guys recommend in my position?  Do I go with the M50 and just be happy with it as I learn Premiere and collect accessories for my collection ?  Or do I take a NO COMPROMISES battle stance, say fk it, and..  save up for a monster?  :D \n\n&amp;#x200B;\n\nthanks everyone\n\nSC", "link": "https://www.reddit.com/r/photography/comments/bny3gv/buying_advice_noob_question_re_canon_m50_vs_sony/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "buying advice: noob question re: canon m50 vs sony ______ ?? /!/ hi all! (post fgot kinda long; i put an abbreviated form of my main question at the end as a tldr) \n\n&amp;#x200b;\n\nmy name's scott. i'm a cnc lathe programmer from houston tx.  i'm a total noob when it comes to photography. my main passions for as long as i can remember have been guitar and video games (mainly call of duty.  ...i know.. shhh)  . as well as pc building/tech. \n\nrecently i've been watching peter mckinnon and potato jet and a couple other photography youtube channels and it's really inspired me. i've been amazed by some of the video editing, quality of still shots, and just photography's power in general.  i've always wanted to make videos:  whether it's call of duty highlight films and gameplays, or guitar reviews/sound samples/songwriting, pc time lapse custom builds...  there's so much stuff i want to try. as a side note, as it relates to my question below:  i'm moving in 1 month, and in our new home i will be building a pc gaming setup/office studio.  think big wooden countertop desk, widescreen monitor(s), area dedicated for filming/unboxing, area for guitars and music/audio,  ....etc.  i want to incorporate photography into this setup. \n\n&amp;#x200b;\n\ni've almost pulled the trigger on a canonm50 several times this past week.  i like the price point, the performance seems solid for both video and stills, articulating lcd..  etc. however one of the main things that's holding me back is the lack of 120fps slow mo in 1080p.  also the dual pixel a.f.  in 4k would be nice. really\\* would prefer 1080/120 ..  it does have 120fps but it's 720p.  even for a beginner i'm just not keen on using slow mo in 720p.  it's 2019.  . \n\n&amp;#x200b;\n\nanyway. sorry if this sounds stupid. esp from someone as inexperienced as myself.  i am really considering saving for the fuji xt3 as it has everything i'm looking for (and more) .. as well as looking at the eos r.  (although this camera retains the dual pixel af in 4k, i'm really put off by a $2k camera that won't do 120fps in hd. seems dumb to me. am i missing something here?  if the eos r had that one feature, i'd likely be saving for it right now. maybe i'm wrong, or they could add it via firmware?  idk. ).  \n\nlast thing i'll mention before wrapping it up:  i'm also curious about time lapse capabilities. ive done a decent amount of research (ok not very much) and i don't know much about the m50's time lapse ability.  this is definitely a priority.. arguably more than 120 fps. ( i could almost live with 60fps or 720p/120 upscaled to 1080) but ....  with no time lapse, that's a deal breaker.  one of the first things i wanna do is a time lapse of me building my first \"high end\" gaming pc. can anyone shed some light on if the m50 would do that well? \n\n&amp;#x200b;\n\ntldr i'm not planning on vlogging, but doing multiple things with heavier emphasis on video.  i want something versatile.. my main priorities:  able to shoot great stills, capture slow motion 1080/120 fps, do good time lapses, has to have a mic input for audio, fully flip lcd preferred but not required.  leaning towards canon m50 but it's lacking the 120/1080.  also considering some sony options (rx10 iii/iv, rx100 iv/v/vi , ...others? a6400!! that's the one).   my budget is flexible. but would refer under 800-1k.  going for a a7riii or eos r or gh5s would be nice/preferred, but would literally take me a couple months (or selling a guitar) to pull off.   \n\n&amp;#x200b;\n\nwhat camera would you guys recommend in my -----> position !!! ?  do i go with the m50 and just be happy with it as i learn premiere and collect accessories for my collection ?  or do i take a no compromises battle stance, say fk it, and..  save up for a monster?  :d \n\n&amp;#x200b;\n\nthanks everyone\n\nsc", "sortedWord": "None", "identifyer": 75088, "year": "2019"}, {"Unnamed: 0": 327806, "autor": "black-maverick", "date": 1562258657000, "content": "Is there any way I can make a camera take photos in automatic intervals while changing it's relative position to the subject? /!/ Hi, I'm a student and was hoping if anyone knew the answer to my title question. I am aware what I'm asking sounds a lot like of what photographers would call time-lapse photography or the use of a intervalometer, but please note that I'll be changing the position of the camera and I want the camera to take photographs in preset intervals for a given period of time. \n\nI'm doing a project and I still don't have a camera, since DSLRs are a bit expensive, is there anyway that this can be done on a regular camera?", "link": "https://www.reddit.com/r/photography/comments/c94q41/is_there_any_way_i_can_make_a_camera_take_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "is there any way i can make a camera take photos in automatic intervals while changing it's relative -----> position !!!  to the subject? /!/ hi, i'm a student and was hoping if anyone knew the answer to my title question. i am aware what i'm asking sounds a lot like of what photographers would call time-lapse photography or the use of a intervalometer, but please note that i'll be changing the position of the camera and i want the camera to take photographs in preset intervals for a given period of time. \n\ni'm doing a project and i still don't have a camera, since dslrs are a bit expensive, is there anyway that this can be done on a regular camera?", "sortedWord": "None", "identifyer": 75334, "year": "2019"}, {"Unnamed: 0": 327911, "autor": "memoryman89", "date": 1562556999000, "content": "Question for full-time pro fashion photographers... /!/ I've been a full-time pro fashion photographer for ten years now and one of the things that has always annoyed it- but especially as of late- is the fact that other fashion photographers have never been open to forming a friendship. It'd be so nice to have someone working on a similar level to me with whom I could discuss industry stuff, lighting, retouching, gear, etc. I'm not looking for a fashion photographer friend so I can jack his techniques- I'm happy with mine-, but just so I could have an equal to talk to who understands some of the problems I face and who has to make some of the same decisions I have to. Are any of you on here also full time fashion photographers who have the same problem, or have you somehow been able to make other photog friends? I'm turning 30 this year and feel a bit childish making such a post, but it really just would be so nice to have someone in a similar position that I could openly chat with. Also, how do you guys decide on what gear to get? I've been using the same stuff for 7+ years and feel the need to upgrade, but the people at the stores here either don't know a thing about the gear I'm looking at or just don't have the experience to comment on its use in my context. Is there a fashion photographer group on social media somewhere?", "link": "https://www.reddit.com/r/photography/comments/cafzvo/question_for_fulltime_pro_fashion_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question for full-time pro fashion photographers... /!/ i've been a full-time pro fashion photographer for ten years now and one of the things that has always annoyed it- but especially as of late- is the fact that other fashion photographers have never been open to forming a friendship. it'd be so nice to have someone working on a similar level to me with whom i could discuss industry stuff, lighting, retouching, gear, etc. i'm not looking for a fashion photographer friend so i can jack his techniques- i'm happy with mine-, but just so i could have an equal to talk to who understands some of the problems i face and who has to make some of the same decisions i have to. are any of you on here also full time fashion photographers who have the same problem, or have you somehow been able to make other photog friends? i'm turning 30 this year and feel a bit childish making such a post, but it really just would be so nice to have someone in a similar -----> position !!!  that i could openly chat with. also, how do you guys decide on what gear to get? i've been using the same stuff for 7+ years and feel the need to upgrade, but the people at the stores here either don't know a thing about the gear i'm looking at or just don't have the experience to comment on its use in my context. is there a fashion photographer group on social media somewhere?", "sortedWord": "None", "identifyer": 75444, "year": "2019"}, {"Unnamed: 0": 328281, "autor": "pepporoni", "date": 1564068799000, "content": "Can you use 3rd party ICU with F-Stop bag? /!/ Apology if this isn’t the right subreddit.\n\nI’m interesting in F-Stop Guru UL bag but their ICU is quite expensive. I have an existing ICU from Lowepro Photo Hatchback which almost the same size as their medium ICU (shorter in height). Can I use it with f-stop bag? \n\nI’m not sure about the position of the velcro but that could be easily added.", "link": "https://www.reddit.com/r/photography/comments/chpa1u/can_you_use_3rd_party_icu_with_fstop_bag/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "can you use 3rd party icu with f-stop bag? /!/ apology if this isn’t the right subreddit.\n\ni’m interesting in f-stop guru ul bag but their icu is quite expensive. i have an existing icu from lowepro photo hatchback which almost the same size as their medium icu (shorter in height). can i use it with f-stop bag? \n\ni’m not sure about the -----> position !!!  of the velcro but that could be easily added.", "sortedWord": "None", "identifyer": 75836, "year": "2019"}, {"Unnamed: 0": 328790, "autor": "xEdwin23x", "date": 1569178195000, "content": "Best lens to pair with 24 mm pancake for Canon APSC /!/ Hey r/photography ! I posted this on the questions thread but maybe it's too long and specific so got no replies but I would like to hear your opinion.\n\nIt's been some time since I have taken photography seriously, mostly due to not travelling and then unsubscribing from LR and never getting into the other alternatives. Yesterday I downloaded LR CC and really like the integration of LR mobile into the workflow which was another factor for me abandoning it, the lack of convenience for moving from camera to computer to phone and social media. \n\nI have been culling and editing photos from my last trip to South Korea and in that ocassion I only took my 100D along a EFS 24mm Pancake and it was cool because it didn't weight much but looking back at some of the pictures I feel some of them were lacking due to the limited focal range (and aperture at times). I shoot mostly food (the pancake does great at this), street and urban landscapes (also pretty good most of the time, though it can lack a bit in darker scenes), and nature landscapes while hiking (and this is where I feel it can be limiting. It can be hard to move around to adjust my position while on a hiking trail with cliffs or inaccessible terrain on both sides). \n\nI have been considering getting an upgrade now that I plan to travel more often and was curious what would you guys recommend: another prime to supplement the current one, maybe a 40 mm f2.8 pancake or maybe the 50 mm f1.8, an all around lens like the 15-85 or 17-70 f2.8-4, or the one I've always wanted but have never committed due to mixed reviews, high cost and weight, the sigma art 18-35 f1.8. I like the last one due to its big aperture and sharpness but Im unconvinced due to complaints about calibration problems, weight issues while travelling, and limited focal range (wouldn't solve my current issue of far subject while hiking). The 17-70 and 15-85 seems all around okayish but dunno if I will be missing out on sharpness compared to primes or the 18-35. The other pancake has always called my attention since I like the one I currently have but I'm unsure if 24 and 40 compliment well (too close a focal range to take advantage of them?). The 24 and 50 combo sounds promising but I'm also unsure if the 50 focal range paired with 24 is versatile enough for my use cases and I've heard mixed comments about the 1.8 aperture of the 50 (biggest selling point for me). \n\nAny advice or suggestions of any kind is deeply appreciated.", "link": "https://www.reddit.com/r/photography/comments/d7uox8/best_lens_to_pair_with_24_mm_pancake_for_canon/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best lens to pair with 24 mm pancake for canon apsc /!/ hey r/photography ! i posted this on the questions thread but maybe it's too long and specific so got no replies but i would like to hear your opinion.\n\nit's been some time since i have taken photography seriously, mostly due to not travelling and then unsubscribing from lr and never getting into the other alternatives. yesterday i downloaded lr cc and really like the integration of lr mobile into the workflow which was another factor for me abandoning it, the lack of convenience for moving from camera to computer to phone and social media. \n\ni have been culling and editing photos from my last trip to south korea and in that ocassion i only took my 100d along a efs 24mm pancake and it was cool because it didn't weight much but looking back at some of the pictures i feel some of them were lacking due to the limited focal range (and aperture at times). i shoot mostly food (the pancake does great at this), street and urban landscapes (also pretty good most of the time, though it can lack a bit in darker scenes), and nature landscapes while hiking (and this is where i feel it can be limiting. it can be hard to move around to adjust my -----> position !!!  while on a hiking trail with cliffs or inaccessible terrain on both sides). \n\ni have been considering getting an upgrade now that i plan to travel more often and was curious what would you guys recommend: another prime to supplement the current one, maybe a 40 mm f2.8 pancake or maybe the 50 mm f1.8, an all around lens like the 15-85 or 17-70 f2.8-4, or the one i've always wanted but have never committed due to mixed reviews, high cost and weight, the sigma art 18-35 f1.8. i like the last one due to its big aperture and sharpness but im unconvinced due to complaints about calibration problems, weight issues while travelling, and limited focal range (wouldn't solve my current issue of far subject while hiking). the 17-70 and 15-85 seems all around okayish but dunno if i will be missing out on sharpness compared to primes or the 18-35. the other pancake has always called my attention since i like the one i currently have but i'm unsure if 24 and 40 compliment well (too close a focal range to take advantage of them?). the 24 and 50 combo sounds promising but i'm also unsure if the 50 focal range paired with 24 is versatile enough for my use cases and i've heard mixed comments about the 1.8 aperture of the 50 (biggest selling point for me). \n\nany advice or suggestions of any kind is deeply appreciated.", "sortedWord": "None", "identifyer": 76362, "year": "2019"}, {"Unnamed: 0": 328881, "autor": "squidthekiddd", "date": 1569467659000, "content": "how do i progress further? (in need of advice/ help) ​ /!/ hi there, \n\nim 16 years old and am a high school photographer and like im very very well known around my school for going to any sporting events and taking photos. I constantly get people complimenting my photos and my photos have even been put into my local newspaper. but, I still struggle because everyone tells me that im in such a good position right now and that if I keep it up I might actually go somewhere. and ive been doing this since my freshman year and taking photos in general since 6th grade. and like I would like some advice because I honestly feel like ive reached a wall kind of. and im not sure what to do next. so any advice would be extremely helpful. \n\nthank you for your help", "link": "https://www.reddit.com/r/photography/comments/d9dxxa/how_do_i_progress_further_in_need_of_advice_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how do i progress further? (in need of advice/ help) ​ /!/ hi there, \n\nim 16 years old and am a high school photographer and like im very very well known around my school for going to any sporting events and taking photos. i constantly get people complimenting my photos and my photos have even been put into my local newspaper. but, i still struggle because everyone tells me that im in such a good -----> position !!!  right now and that if i keep it up i might actually go somewhere. and ive been doing this since my freshman year and taking photos in general since 6th grade. and like i would like some advice because i honestly feel like ive reached a wall kind of. and im not sure what to do next. so any advice would be extremely helpful. \n\nthank you for your help", "sortedWord": "None", "identifyer": 76458, "year": "2019"}, {"Unnamed: 0": 329482, "autor": "BigManLou16", "date": 1570662018000, "content": "Question for anyone who may be able to help. Out shooting with this Kodak extralite 500 today and the shutter lever jammed halfway. I got the film out but I’m unable to unlock the shutter from the stuck position. Any advice?? I really don’t want to lose this camera cause I just got it", "link": "https://www.reddit.com/r/photography/comments/dfozue/question_for_anyone_who_may_be_able_to_help_out/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question for anyone who may be able to help. out shooting with this kodak extralite 500 today and the shutter lever jammed halfway. i got the film out but i’m unable to unlock the shutter from the stuck -----> position !!! . any advice?? i really don’t want to lose this camera cause i just got it", "sortedWord": "None", "identifyer": 77087, "year": "2019"}, {"Unnamed: 0": 329734, "autor": "n4m3Unknown", "date": 1566866202000, "content": "Help needed with shooting street / cultural event photos with regard to poor social skills &amp; positioning /!/ Yo, I've been photographing for a decade as a hobbyist and my favourite is urban photography &amp; cultural photos Nevertheless, the latter is a hit or miss due to listed reasons that I'd like to find concrete tips for :/ I am adding a handful of examples (unedited from RAW) to illustrate how it tends to come out (tho I admit this one event turned out worse than others, everyone was really chill in there and I felt like an intruder with a camera). The points I bring up are related to recent outdoor tea-festival.\n\nSome tl;dr at the bottom.\n\n* If I wait for the right moment, I am going to get noticed as I am standing in a middle of nowhere for way too long by myself (they won't be relaxed) VS. if I shoot right away when nobody's noticed me being there with a camera, I tend to get bad shots (people walking in, people suddenly starting coughing, getting up, ...) Basically sometimes I would be just waiting forever and there still will be bad situations cuz reasons. (I tried partially resolving this by raising my arms up with the camera but it's not only hard to get the composition right but also it brings lots of attention).\n\n* I actually sometimes tend to get the [improper shots](https://i.imgur.com/jMOMP1p.jpg) even while waiting from unnoticed angle. Welp.\n\n* Often I might not align for a nice detailed non-people shot because I feel like I would be too intrusive with that (idk). I do admit the second option is just asking for permission which is not always an option (a tea booth busy with customers for example + everyone being aware of you actively taking shots).\n\n* If I am going for a tight crop esp. with performers, due to their sudden movement changes I tend to wind up and part of their body tends to be [off the image](https://i.imgur.com/KBVH9WC.jpg). Ideas? (Except shooting everything zoomed out and cropping everything afterwards.)\n\n* I am hesitating a lot with [close range shots](https://i.imgur.com/C8gq6tc.jpg) maybe also because my country is reserved (mid EU) - how do I get a close/frontal shot of someone without coming across as rude? When I really shouldn't do it? (I esp. would want to snap someone who's got a nice style or just capturing the mood.)\n\n* I can read a lot from person's body language about if me having a camera pointing at them makes them feel nervous and then I just feel bad about taking it lol (either feel bad because they're self-conscious and they clearly they don't want to get photographer or even frightened if they're the type who would aggressively flip at me out of nowhere).\n\n* I am not able to recognize if sometimes it's maybe not appropriate to take a (group) shot - so for example I wanted close-ups of those [tea \"booths\"](https://i.imgur.com/vpk2Uxf.jpg) surrounded by visitors but it'd probably be rude to just take it? I am totally not sure. \n\n* I was once shooting a wedding as a secondary photographer and I often had a problem in recognizing when I could be possibly too much in the face of people, i. e. intrusive. Esp. if they frowned (annoyed?) or tried to turn away (shy?) I assumed they don't want their photos taken at all, but then you don't get many people left for photographing.\n\n* I am not aware of in what way will certain people react to getting photograph taken if I get too close (therefore I usually don't unless if they're a performer) + if I take the camera out, they will likely notice before I take the shot (how to work around this?)\n\n* If I am shooting performers, I do so with mindset of not annoying the people who actually came to watch - I tend to avoid walking in places where I would obstruct their view and miss on good angles. :/\n\n* The second problem with performers is, I don't know how close to get as so it wouldn't be idk, inappropriate? / space invading?\n\n* On top of it, I assume certain kinds of people can sense me being nervous/hesitatnt therefore they get nervous. Oh boy.\n\n-----\nSorry if I repeated some points in a rephrased way.\n\nIf I had to sum up some of the key problems, it's,\n\n* a) being able to read individual's body language and if they seem umcomfortable about being photographed, it makes me uncertain (therefore I often might not even take some the shots because even if the individuals would react \"negatively\" just half the time, it seriously \"dreads\" me lol)\n\n* and b) not being able to read a group mood (due to lack of experience maybe?) to know when to take freely photos.\n\nTherefore missing opportunities and if I don't miss an opportunity, it's simply a bad shot because I read the social situation wrong (people frown) or wasn't in a \"position\" that would grand me an unintrusive shot. Etc. Any tips?", "link": "https://www.reddit.com/r/photography/comments/cvwt38/help_needed_with_shooting_street_cultural_event/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "help needed with shooting street / cultural event photos with regard to poor social skills &amp; -----> positioning !!!  /!/ yo, i've been photographing for a decade as a hobbyist and my favourite is urban photography &amp; cultural photos nevertheless, the latter is a hit or miss due to listed reasons that i'd like to find concrete tips for :/ i am adding a handful of examples (unedited from raw) to illustrate how it tends to come out (tho i admit this one event turned out worse than others, everyone was really chill in there and i felt like an intruder with a camera). the points i bring up are related to recent outdoor tea-festival.\n\nsome tl;dr at the bottom.\n\n* if i wait for the right moment, i am going to get noticed as i am standing in a middle of nowhere for way too long by myself (they won't be relaxed) vs. if i shoot right away when nobody's noticed me being there with a camera, i tend to get bad shots (people walking in, people suddenly starting coughing, getting up, ...) basically sometimes i would be just waiting forever and there still will be bad situations cuz reasons. (i tried partially resolving this by raising my arms up with the camera but it's not only hard to get the composition right but also it brings lots of attention).\n\n* i actually sometimes tend to get the [improper shots](https://i.imgur.com/jmomp1p.jpg) even while waiting from unnoticed angle. welp.\n\n* often i might not align for a nice detailed non-people shot because i feel like i would be too intrusive with that (idk). i do admit the second option is just asking for permission which is not always an option (a tea booth busy with customers for example + everyone being aware of you actively taking shots).\n\n* if i am going for a tight crop esp. with performers, due to their sudden movement changes i tend to wind up and part of their body tends to be [off the image](https://i.imgur.com/kbvh9wc.jpg). ideas? (except shooting everything zoomed out and cropping everything afterwards.)\n\n* i am hesitating a lot with [close range shots](https://i.imgur.com/c8gq6tc.jpg) maybe also because my country is reserved (mid eu) - how do i get a close/frontal shot of someone without coming across as rude? when i really shouldn't do it? (i esp. would want to snap someone who's got a nice style or just capturing the mood.)\n\n* i can read a lot from person's body language about if me having a camera pointing at them makes them feel nervous and then i just feel bad about taking it lol (either feel bad because they're self-conscious and they clearly they don't want to get photographer or even frightened if they're the type who would aggressively flip at me out of nowhere).\n\n* i am not able to recognize if sometimes it's maybe not appropriate to take a (group) shot - so for example i wanted close-ups of those [tea \"booths\"](https://i.imgur.com/vpk2uxf.jpg) surrounded by visitors but it'd probably be rude to just take it? i am totally not sure. \n\n* i was once shooting a wedding as a secondary photographer and i often had a problem in recognizing when i could be possibly too much in the face of people, i. e. intrusive. esp. if they frowned (annoyed?) or tried to turn away (shy?) i assumed they don't want their photos taken at all, but then you don't get many people left for photographing.\n\n* i am not aware of in what way will certain people react to getting photograph taken if i get too close (therefore i usually don't unless if they're a performer) + if i take the camera out, they will likely notice before i take the shot (how to work around this?)\n\n* if i am shooting performers, i do so with mindset of not annoying the people who actually came to watch - i tend to avoid walking in places where i would obstruct their view and miss on good angles. :/\n\n* the second problem with performers is, i don't know how close to get as so it wouldn't be idk, inappropriate? / space invading?\n\n* on top of it, i assume certain kinds of people can sense me being nervous/hesitatnt therefore they get nervous. oh boy.\n\n-----\nsorry if i repeated some points in a rephrased way.\n\nif i had to sum up some of the key problems, it's,\n\n* a) being able to read individual's body language and if they seem umcomfortable about being photographed, it makes me uncertain (therefore i often might not even take some the shots because even if the individuals would react \"negatively\" just half the time, it seriously \"dreads\" me lol)\n\n* and b) not being able to read a group mood (due to lack of experience maybe?) to know when to take freely photos.\n\ntherefore missing opportunities and if i don't miss an opportunity, it's simply a bad shot because i read the social situation wrong (people frown) or wasn't in a \"position\" that would grand me an unintrusive shot. etc. any tips?", "sortedWord": "None", "identifyer": 77349, "year": "2019"}, {"Unnamed: 0": 330036, "autor": "ki-rin", "date": 1567912864000, "content": "I fixed my lens! Here's how. /!/ I posted here a few days ago asking for help because my lens was terribly out of focus and looked decentered.\n\nUnfortunately you can't see that post because it was removed on the grounds that it was a \"self serving question\", and not useful to other people... \n\nAnyway, I got some useful advice before it was removed, and I followed up with my own research and was able to fix the lens myself. \n\nFYI, the lens is the Samyang 7.5mm Fisheye lens for m43, which I have had for several years. \n\nHere's a before and after, and then I'll explain how I did it. \n\nBefore:\n\n https://imgur.com/G90Q6Ij \n\n&amp;#x200B;\n\nAfter:\n\n https://imgur.com/TYMh1r5 \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nWhat I did to fix it:\n\nBasically I unscrewed the bayonette mount from the rear of the lens, removed it, and then adjusted the center lens element (you can tighten or loosen it by rotating). After experimenting with a few different positions, I got it as close to accurate as I could and remounted the rear part of the lens, and now the lens performs as it should again! \n\nNote, this will also adjust how the lens interacts with the focus ring, so if your infinity focus mark is off, you could also fix it like this. \n\nI basically thought my lens was junk, but it turned out to be a very easy fix, so if anyone else runs into this problem, hopefully this might help you out. I'm just happy I can still use my lens :)", "link": "https://www.reddit.com/r/photography/comments/d15uln/i_fixed_my_lens_heres_how/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i fixed my lens! here's how. /!/ i posted here a few days ago asking for help because my lens was terribly out of focus and looked decentered.\n\nunfortunately you can't see that post because it was removed on the grounds that it was a \"self serving question\", and not useful to other people... \n\nanyway, i got some useful advice before it was removed, and i followed up with my own research and was able to fix the lens myself. \n\nfyi, the lens is the samyang 7.5mm fisheye lens for m43, which i have had for several years. \n\nhere's a before and after, and then i'll explain how i did it. \n\nbefore:\n\n https://imgur.com/g90q6ij \n\n&amp;#x200b;\n\nafter:\n\n https://imgur.com/tymh1r5 \n\n&amp;#x200b;\n\n&amp;#x200b;\n\nwhat i did to fix it:\n\nbasically i unscrewed the bayonette mount from the rear of the lens, removed it, and then adjusted the center lens element (you can tighten or loosen it by rotating). after experimenting with a few different -----> positions !!! , i got it as close to accurate as i could and remounted the rear part of the lens, and now the lens performs as it should again! \n\nnote, this will also adjust how the lens interacts with the focus ring, so if your infinity focus mark is off, you could also fix it like this. \n\ni basically thought my lens was junk, but it turned out to be a very easy fix, so if anyone else runs into this problem, hopefully this might help you out. i'm just happy i can still use my lens :)", "sortedWord": "None", "identifyer": 77663, "year": "2019"}, {"Unnamed: 0": 330204, "autor": "redrivergorge", "date": 1571931119000, "content": "Techniques for photographing a pheasant hunt. /!/ I've got the opportunity to shoot a pheasant/quail hunt for an outfitter service soon.  This will be my first of this type of shoot and I'm really excited about the opportunity, but wanted some advice on technique from anyone who has similar experience.\n\nTypes of shots I'll be capturing\n\n* Preparation (loading shotguns, loading dogs, pre-hunt candid type stuff)\n* Hunt action (Dogs flushing birds and pointing, hunters shooting, coveys flushing, dogs retrieving)\n* Post hunt candids (hunters with birds in hand, dogs with birds in mouth, hunters gathered and having a good time)\n* Wide scenics with hunters/dogs in foreground\n\nGear I'll be using\n\n* Nikon D850 w/ Nikkor 24-70 2.8\n* Nikon D850 w/ Nikkor 70-200 2.8\n* Additional 14-24 2.8 in pack\n\nThis is a four hour hunting starting at about 8am.  I wanted to get out earlier for a little better light but the guide is an older gentleman that wants his breakfast at 7:15 and is the type you don't argue with.  I'll be shooting in a field of tall brown grass that has lanes cut into it where the hunters and dogs walk.  The field is surrounded by wooded areas.  The birds will be mostly in the tall grass, the pointers will point when they detect a covey, the hunters and myself will get in position and then they'll send a flushing dog, then bang.  My thought for those types of shots is continuous AF with high speed multiple shot mode.  I typically shoot manual.  I'll be shooting available light, but can also bring a speedlight and a portable fill / diffuser if necessary for details. I don't do a ton of action shots, but I'm thinking a shutter speed of 1/500 is a good starting point. Plan to also do some drag shutter shots of dogs running and such.  Any discussion on technique would be much appreciated!", "link": "https://www.reddit.com/r/photography/comments/dmi29k/techniques_for_photographing_a_pheasant_hunt/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "techniques for photographing a pheasant hunt. /!/ i've got the opportunity to shoot a pheasant/quail hunt for an outfitter service soon.  this will be my first of this type of shoot and i'm really excited about the opportunity, but wanted some advice on technique from anyone who has similar experience.\n\ntypes of shots i'll be capturing\n\n* preparation (loading shotguns, loading dogs, pre-hunt candid type stuff)\n* hunt action (dogs flushing birds and pointing, hunters shooting, coveys flushing, dogs retrieving)\n* post hunt candids (hunters with birds in hand, dogs with birds in mouth, hunters gathered and having a good time)\n* wide scenics with hunters/dogs in foreground\n\ngear i'll be using\n\n* nikon d850 w/ nikkor 24-70 2.8\n* nikon d850 w/ nikkor 70-200 2.8\n* additional 14-24 2.8 in pack\n\nthis is a four hour hunting starting at about 8am.  i wanted to get out earlier for a little better light but the guide is an older gentleman that wants his breakfast at 7:15 and is the type you don't argue with.  i'll be shooting in a field of tall brown grass that has lanes cut into it where the hunters and dogs walk.  the field is surrounded by wooded areas.  the birds will be mostly in the tall grass, the pointers will point when they detect a covey, the hunters and myself will get in -----> position !!!  and then they'll send a flushing dog, then bang.  my thought for those types of shots is continuous af with high speed multiple shot mode.  i typically shoot manual.  i'll be shooting available light, but can also bring a speedlight and a portable fill / diffuser if necessary for details. i don't do a ton of action shots, but i'm thinking a shutter speed of 1/500 is a good starting point. plan to also do some drag shutter shots of dogs running and such.  any discussion on technique would be much appreciated!", "sortedWord": "None", "identifyer": 77842, "year": "2019"}, {"Unnamed: 0": 330515, "autor": "CetirusParibus", "date": 1573128635000, "content": "Carrying a DSLR while cycling. /!/ Hello,\nI have been doing forum reading, but I really want a varied and experienced opinion from everyone here, what's the best way to carry a camera while I ride my bicycle around the city? I want it to be in a safe position, but also ready to pull and snap while I'm riding. \n\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/dswupj/carrying_a_dslr_while_cycling/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "carrying a dslr while cycling. /!/ hello,\ni have been doing forum reading, but i really want a varied and experienced opinion from everyone here, what's the best way to carry a camera while i ride my bicycle around the city? i want it to be in a safe -----> position !!! , but also ready to pull and snap while i'm riding. \n\nthanks in advance!", "sortedWord": "None", "identifyer": 78164, "year": "2019"}, {"Unnamed: 0": 330557, "autor": "sinahamid1", "date": 1573477031000, "content": "How do you take a picture of yourself everyday and keep your position the same? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/dus0vr/how_do_you_take_a_picture_of_yourself_everyday/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "how do you take a picture of yourself everyday and keep your -----> position !!!  the same? /!/ [removed]", "sortedWord": "None", "identifyer": 78207, "year": "2019"}, {"Unnamed: 0": 330716, "autor": "american_inseoul", "date": 1573836497000, "content": "Improvement methods - which do you find to work better? /!/ If you want to improve your work, do you think \n\n- going out with no particular goal, taking photos of whatever catches your eye\n\n- going out with a purpose, specific intent of shooting one thing or working on one specific area such as composition or positioning \n\n- Working on a series, going out with the specific purpose of an ARTISTIC goal as compared to a technical goal\n\nhelps you the most? I find myself generally falling into the first category, but these days I think working in the realm of the second and third methods would help to improve my work further. How do you do it? One of the above? All three? something else? Sound off below 👇", "link": "https://www.reddit.com/r/photography/comments/dwtepa/improvement_methods_which_do_you_find_to_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "improvement methods - which do you find to work better? /!/ if you want to improve your work, do you think \n\n- going out with no particular goal, taking photos of whatever catches your eye\n\n- going out with a purpose, specific intent of shooting one thing or working on one specific area such as composition or -----> positioning !!!  \n\n- working on a series, going out with the specific purpose of an artistic goal as compared to a technical goal\n\nhelps you the most? i find myself generally falling into the first category, but these days i think working in the realm of the second and third methods would help to improve my work further. how do you do it? one of the above? all three? something else? sound off below 👇", "sortedWord": "None", "identifyer": 78370, "year": "2019"}, {"Unnamed: 0": 331485, "autor": "SavvyEquestrian", "date": 1575488332000, "content": "Advice on photo rights pricing? /!/ Hello all!\n\nSo, I'm trying to determine a pricing structure for a set of photos a company wants to use for their product.\n\nI shot an event earlier this year... unpaid, just documenting, and offered a lot of images for media coverage to the host, which is the company our equine business is licensed through... there was a vendor on site who had their product being showcased on a few of the horses. As such, I captured a handful of very solid images of their product.\n\nFast forward to now... the vendor has reached out to me about wanting to purchase full rights to some of these photos for marketing purposes. In her position, she has seen a select few from the event, but hasn't seen what I've edited now to specifically showcase her product, so the quality is higher than she's expecting currently.\n\nGiven those dynamics, and being a company within the same industry and community as our own businesses, what would be some ideas as to where to set prices on full image rights?\n\nMy mind heads towards about $100 per image, but I have anxiety about whether that's too high, or too low.\n\nAny help would be appreciated, as this is a fresh circumstance for me.", "link": "https://www.reddit.com/r/photography/comments/e64jae/advice_on_photo_rights_pricing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "advice on photo rights pricing? /!/ hello all!\n\nso, i'm trying to determine a pricing structure for a set of photos a company wants to use for their product.\n\ni shot an event earlier this year... unpaid, just documenting, and offered a lot of images for media coverage to the host, which is the company our equine business is licensed through... there was a vendor on site who had their product being showcased on a few of the horses. as such, i captured a handful of very solid images of their product.\n\nfast forward to now... the vendor has reached out to me about wanting to purchase full rights to some of these photos for marketing purposes. in her -----> position !!! , she has seen a select few from the event, but hasn't seen what i've edited now to specifically showcase her product, so the quality is higher than she's expecting currently.\n\ngiven those dynamics, and being a company within the same industry and community as our own businesses, what would be some ideas as to where to set prices on full image rights?\n\nmy mind heads towards about $100 per image, but i have anxiety about whether that's too high, or too low.\n\nany help would be appreciated, as this is a fresh circumstance for me.", "sortedWord": "None", "identifyer": 79171, "year": "2019"}, {"Unnamed: 0": 331690, "autor": "SaltedBiscuitTV", "date": 1554835199000, "content": "Where to get started? Where's the money at? Freelance or join a Business? /!/ I don't know if that's the right way to phrase the question or not but that's the best I got. I'm going to be a photo/graphic design major in 2021. I'm looking into positions and stuff now and all I see is some local \"Preschool Photographer\" bs. Bachelor for 20k a year? Screw that. I could make more fulltime at wal-mart.\n\nIs the business all really in self owned business? Doing shoots? Uploading stock photos? Building your popularity using sites like EyeEm and Instagram?\n\nReally trying to take this stuff seriously and not really sure where to start. I feel like I could get an internship, but doing preschool photography sounds like a bad idea for \"experience\". I'm looking for something more than 5-10 hours a week but I need experience for a nice resume. So I don't know if I should take 5-10 hours a week or not.", "link": "https://www.reddit.com/r/photography/comments/bbbllp/where_to_get_started_wheres_the_money_at/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "where to get started? where's the money at? freelance or join a business? /!/ i don't know if that's the right way to phrase the question or not but that's the best i got. i'm going to be a photo/graphic design major in 2021. i'm looking into -----> positions !!!  and stuff now and all i see is some local \"preschool photographer\" bs. bachelor for 20k a year? screw that. i could make more fulltime at wal-mart.\n\nis the business all really in self owned business? doing shoots? uploading stock photos? building your popularity using sites like eyeem and instagram?\n\nreally trying to take this stuff seriously and not really sure where to start. i feel like i could get an internship, but doing preschool photography sounds like a bad idea for \"experience\". i'm looking for something more than 5-10 hours a week but i need experience for a nice resume. so i don't know if i should take 5-10 hours a week or not.", "sortedWord": "None", "identifyer": 79380, "year": "2019"}, {"Unnamed: 0": 331786, "autor": "B_Rush", "date": 1553413661000, "content": "10 seconds to get into position", "link": "https://www.reddit.com/r/photography/comments/b4tuo2/10_seconds_to_get_into_position/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "10 seconds to get into -----> position !!! ", "sortedWord": "None", "identifyer": 79477, "year": "2019"}, {"Unnamed: 0": 331884, "autor": "Zappawhappa", "date": 1555161452000, "content": "Looking for selfie photograph advice /!/ I am going on holiday and as always when alone im taking many selfies. I bought a selfie stick this time I used to just put my arm out. Im not sure as I never spent time to work it out properly but when sun is out most angles my face looks hideous, some angles my face looks blobby other angles shows every mark and blemish but there is 1 angle that makes my face look smooth and narrow and more attractive.  BAsed on where the sun is where should I position myself to get the best photograph.\n\nAlso any tips on what I should do with my body shape or face etc, angle of head, open smile etc etc to impove my picture.\n\n&amp;#x200B;\n\nI hate having all these pics of places ive been to on holiday but unable to share all the ones with me in it as I look hideous in most of them.\n\n&amp;#x200B;\n\nOf course its always better if someone else takes the picture and you are at a further distance but I will be alone so will be many selfies again. Thankfully the selfie stick gives more distance also than my arm.\n\n&amp;#x200B;\n\nthanks", "link": "https://www.reddit.com/r/photography/comments/bcqdr9/looking_for_selfie_photograph_advice/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "looking for selfie photograph advice /!/ i am going on holiday and as always when alone im taking many selfies. i bought a selfie stick this time i used to just put my arm out. im not sure as i never spent time to work it out properly but when sun is out most angles my face looks hideous, some angles my face looks blobby other angles shows every mark and blemish but there is 1 angle that makes my face look smooth and narrow and more attractive.  based on where the sun is where should i -----> position !!!  myself to get the best photograph.\n\nalso any tips on what i should do with my body shape or face etc, angle of head, open smile etc etc to impove my picture.\n\n&amp;#x200b;\n\ni hate having all these pics of places ive been to on holiday but unable to share all the ones with me in it as i look hideous in most of them.\n\n&amp;#x200b;\n\nof course its always better if someone else takes the picture and you are at a further distance but i will be alone so will be many selfies again. thankfully the selfie stick gives more distance also than my arm.\n\n&amp;#x200b;\n\nthanks", "sortedWord": "None", "identifyer": 79578, "year": "2019"}, {"Unnamed: 0": 332212, "autor": "chocolatee_croissant", "date": 1554179057000, "content": "How did you start your photography career after graduating? /!/ Hey y'all, I am looking for some helpful tips/advice to becoming a photographer. I just graduated and while I was in college I landed some pretty cool internships. Although I am incredibly grateful for these internships I feel like I went down the wrong path. I catered my experience and time to photo editing rather than photography because I wasn't sure what I wanted at the time. While I still do have a portfolio and website, I am quite new to the whole experience. I would absolutely love to pursue my dream but I'm not sure how to get the attention of other studio's and magazines as I'm interested in fashion and portraiture.  I've tried applying with my resume but to no avail. I've asked former supervisors if they could put me in contact with the higher ups, but the positions I've reached out to are either taken or not looking for anyone. I'm eager and ready to learn as well as help but I can't seem to find a stepping stone. I feel like I'm failing myself. What is the best way to go about something like this, or how did you develop your career once you graduated? Thank you.", "link": "https://www.reddit.com/r/photography/comments/b8eddi/how_did_you_start_your_photography_career_after/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "how did you start your photography career after graduating? /!/ hey y'all, i am looking for some helpful tips/advice to becoming a photographer. i just graduated and while i was in college i landed some pretty cool internships. although i am incredibly grateful for these internships i feel like i went down the wrong path. i catered my experience and time to photo editing rather than photography because i wasn't sure what i wanted at the time. while i still do have a portfolio and website, i am quite new to the whole experience. i would absolutely love to pursue my dream but i'm not sure how to get the attention of other studio's and magazines as i'm interested in fashion and portraiture.  i've tried applying with my resume but to no avail. i've asked former supervisors if they could put me in contact with the higher ups, but the -----> positions !!!  i've reached out to are either taken or not looking for anyone. i'm eager and ready to learn as well as help but i can't seem to find a stepping stone. i feel like i'm failing myself. what is the best way to go about something like this, or how did you develop your career once you graduated? thank you.", "sortedWord": "None", "identifyer": 79922, "year": "2019"}, {"Unnamed: 0": 332330, "autor": "XM62X", "date": 1554252084000, "content": "Beware of Havenly hiring scam /!/ Just wanted to toss this on Reddit in case anyone else runs into the situation I did this morning. Havenly, an online interior design outfit, is currently *legitimately* hiring photographers to shoot rooms they've designed in major cities such as NYC, LA, San Francisco, Boston, and DC. However there's a \"recruiter\" going around interviewing in smaller market cities for positions that don't exist and trying to send money for you to \"purchase all required equipment\"... including a tabletop product photography setup and a 2015 Macbook Pro(?)\n\nJust a heads up as it was a very convincing interview process up until they wanted to send me a huge check, sign-on bonus, and told me they were an employee that left the company almost a year ago according to LinkedIn. Stay sharp!", "link": "https://www.reddit.com/r/photography/comments/b8rbij/beware_of_havenly_hiring_scam/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "beware of havenly hiring scam /!/ just wanted to toss this on reddit in case anyone else runs into the situation i did this morning. havenly, an online interior design outfit, is currently *legitimately* hiring photographers to shoot rooms they've designed in major cities such as nyc, la, san francisco, boston, and dc. however there's a \"recruiter\" going around interviewing in smaller market cities for -----> positions !!!  that don't exist and trying to send money for you to \"purchase all required equipment\"... including a tabletop product photography setup and a 2015 macbook pro(?)\n\njust a heads up as it was a very convincing interview process up until they wanted to send me a huge check, sign-on bonus, and told me they were an employee that left the company almost a year ago according to linkedin. stay sharp!", "sortedWord": "None", "identifyer": 80048, "year": "2019"}, {"Unnamed: 0": 333327, "autor": "ionutdstan", "date": 1550272086000, "content": "First series of pictures taken in NL - feedback needed /!/ Hi guys, I just moved to NL 3 weeks ago after my life took some unexpected turnovers during 2018, I am now overwhelmed by the beauty of NL and I feel like I never want to leave this place even though staying and living here would mean to change myself completely, thing that I already started working on. Long story short, I bought a Nikkei 6s extreme, mostly for capturing video while e-biking in Amsterdam but from time to time I managed to make pictures of surroundings and picked this 80 photos as being most representative or \"professional\" photos.\n\n&amp;#x200B;\n\nI would appreciate some feedbacks upon the artistic side more than technical part. I have no experience in photography, I've only positioned myself in places I considered would look great on camera so at this point I am not sure if the reason I really love this pictures is because of them being well shoot rather than bringing amazing memories\n\n&amp;#x200B;\n\nLink here, hope you can see them: [https://www.facebook.com/ionut.stan.3979/media\\_set?set=a.2595912400635218&amp;type=3](https://www.facebook.com/ionut.stan.3979/media_set?set=a.2595912400635218&amp;type=3)\n\n&amp;#x200B;\n\nAlso, a virtual gallery where I can upload these kind of pictures would be highly appreciated. (something more dedicated on photography than FB.)\n\n&amp;#x200B;\n\nMany thanks!\n\nDaniel", "link": "https://www.reddit.com/r/photography/comments/ar2i13/first_series_of_pictures_taken_in_nl_feedback/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "first series of pictures taken in nl - feedback needed /!/ hi guys, i just moved to nl 3 weeks ago after my life took some unexpected turnovers during 2018, i am now overwhelmed by the beauty of nl and i feel like i never want to leave this place even though staying and living here would mean to change myself completely, thing that i already started working on. long story short, i bought a nikkei 6s extreme, mostly for capturing video while e-biking in amsterdam but from time to time i managed to make pictures of surroundings and picked this 80 photos as being most representative or \"professional\" photos.\n\n&amp;#x200b;\n\ni would appreciate some feedbacks upon the artistic side more than technical part. i have no experience in photography, i've only -----> positioned !!!  myself in places i considered would look great on camera so at this point i am not sure if the reason i really love this pictures is because of them being well shoot rather than bringing amazing memories\n\n&amp;#x200b;\n\nlink here, hope you can see them: [https://www.facebook.com/ionut.stan.3979/media\\_set?set=a.2595912400635218&amp;type=3](https://www.facebook.com/ionut.stan.3979/media_set?set=a.2595912400635218&amp;type=3)\n\n&amp;#x200b;\n\nalso, a virtual gallery where i can upload these kind of pictures would be highly appreciated. (something more dedicated on photography than fb.)\n\n&amp;#x200b;\n\nmany thanks!\n\ndaniel", "sortedWord": "None", "identifyer": 81085, "year": "2019"}, {"Unnamed: 0": 334264, "autor": "rAWR0696", "date": 1552143113000, "content": "Advice/encouragement? /!/ Today i have my first paid photoshoot that’s not for friends/family and I’m super nervous. What advice do you wish you would have gotten when you were back in my position?", "link": "https://www.reddit.com/r/photography/comments/az4847/adviceencouragement/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "advice/encouragement? /!/ today i have my first paid photoshoot that’s not for friends/family and i’m super nervous. what advice do you wish you would have gotten when you were back in my -----> position !!! ?", "sortedWord": "None", "identifyer": 82063, "year": "2019"}, {"Unnamed: 0": 334686, "autor": "Team_Justified", "date": 1547218832000, "content": "Basketball photography /!/ Hi guys , been trying to get into some basketball photography\n\n&amp;#x200B;\n\nWhat focal length do you guys use and at where do you position yourself in order to get the best shots ? ", "link": "https://www.reddit.com/r/photography/comments/aew6be/basketball_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "basketball photography /!/ hi guys , been trying to get into some basketball photography\n\n&amp;#x200b;\n\nwhat focal length do you guys use and at where do you -----> position !!!  yourself in order to get the best shots ? ", "sortedWord": "None", "identifyer": 82506, "year": "2019"}, {"Unnamed: 0": 335410, "autor": "thurgel", "date": 1548967141000, "content": "[REVIEW] Moose - Photo Creator /!/ So, I work with social media, and I'm always looking for stock photos websites (with some good photos that I can use).\n\nYesterday I was looking for another website, with some new and different photos. Google then, show me the [Moose](https://photos.icons8.com), I've never heard about this. So, I came here searching for some one that worked with this tool, but moderations excluded my thread telling that I'm promoting myself (?) So, I made some tests with this tool that promises that's a real stock photo. \n\nIt works like this: \n\nYou select an model photo, then the position of the model. After that the background, some objects and finally the text (if you want to).\n\n&amp;#x200B;\n\nSo I made some quick tests. Take a look of some of then and tell me what you think:\n\n&amp;#x200B;\n\n![img](r0oznjnygtd21 \"The very first one. some family in a beach, and a coconut :)\")\n\n&amp;#x200B;\n\n![img](piu9uwh5itd21 \"Then, some guy cheating his wife by the phone.\")\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n![img](ot2rob36jtd21 \"After the divorce for cheating, the guy loses everything and she's very happy and rich with another man.\")\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n![img](y5emzocujtd21 \"But he met some rich gayguy and fell in love with him.\")\n\n&amp;#x200B;\n\n![img](o8byggm5ktd21 \"He bought some new clothes for him\")\n\n&amp;#x200B;\n\nAfter that, I realize that I could spend all day long creating those kind of things. So, they married and - **THE END**. - (hope you enjoyed the new drama series).\n\n&amp;#x200B;\n\nAnyway, This app is awesome for create some photos quickly and its very easy to do it. When you had the image in your head, you just need to access the website and create! And you can download it in .PSD if you need to change or add something more.\n\n&amp;#x200B;\n\nSo, That's my review for the Moose app. If anyone used the app comment here about what was your experience. [Here](https://photos.icons8.com/) is the link again.", "link": "https://www.reddit.com/r/photography/comments/altxjr/review_moose_photo_creator/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "[review] moose - photo creator /!/ so, i work with social media, and i'm always looking for stock photos websites (with some good photos that i can use).\n\nyesterday i was looking for another website, with some new and different photos. google then, show me the [moose](https://photos.icons8.com), i've never heard about this. so, i came here searching for some one that worked with this tool, but moderations excluded my thread telling that i'm promoting myself (?) so, i made some tests with this tool that promises that's a real stock photo. \n\nit works like this: \n\nyou select an model photo, then the -----> position !!!  of the model. after that the background, some objects and finally the text (if you want to).\n\n&amp;#x200b;\n\nso i made some quick tests. take a look of some of then and tell me what you think:\n\n&amp;#x200b;\n\n![img](r0oznjnygtd21 \"the very first one. some family in a beach, and a coconut :)\")\n\n&amp;#x200b;\n\n![img](piu9uwh5itd21 \"then, some guy cheating his wife by the phone.\")\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n![img](ot2rob36jtd21 \"after the divorce for cheating, the guy loses everything and she's very happy and rich with another man.\")\n\n&amp;#x200b;\n\n&amp;#x200b;\n\n![img](y5emzocujtd21 \"but he met some rich gayguy and fell in love with him.\")\n\n&amp;#x200b;\n\n![img](o8byggm5ktd21 \"he bought some new clothes for him\")\n\n&amp;#x200b;\n\nafter that, i realize that i could spend all day long creating those kind of things. so, they married and - **the end**. - (hope you enjoyed the new drama series).\n\n&amp;#x200b;\n\nanyway, this app is awesome for create some photos quickly and its very easy to do it. when you had the image in your head, you just need to access the website and create! and you can download it in .psd if you need to change or add something more.\n\n&amp;#x200b;\n\nso, that's my review for the moose app. if anyone used the app comment here about what was your experience. [here](https://photos.icons8.com/) is the link again.", "sortedWord": "None", "identifyer": 83265, "year": "2019"}, {"Unnamed: 0": 335550, "autor": "imlostinthewoods", "date": 1548628156000, "content": "What is the most accurate angle to take a photo? /!/ I took a photo recently from kinda low down looking at the person and there face seemed elongated and a bit weird. However the same picture when the camera was level the face looked the right shape and not as long?\n\nWhy is this, and what’s the most accurate angle and position to take a photo of someone?", "link": "https://www.reddit.com/r/photography/comments/akgmqy/what_is_the_most_accurate_angle_to_take_a_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "what is the most accurate angle to take a photo? /!/ i took a photo recently from kinda low down looking at the person and there face seemed elongated and a bit weird. however the same picture when the camera was level the face looked the right shape and not as long?\n\nwhy is this, and what’s the most accurate angle and -----> position !!!  to take a photo of someone?", "sortedWord": "None", "identifyer": 83410, "year": "2019"}, {"Unnamed: 0": 336250, "autor": "mynameisfelyppe", "date": 1555858879000, "content": "Cruise ship photographers, does my medical condition automatically disqualify me for a position? /!/ Hey there!  \n\n\nLately I've been considering working in cruise ships, and as I was gathering more info, I learnt that any potential candidate goes through an extensive medical exam\n\n  \nThe thing is that I am blind from my left eye, I literally have a scar on the back of my eye. It's not noticeable, it's nothing contagious and nothing to be worried about (I go to the doctor every year and my condition will never get worse), and I actually have a bit of peripheral vision\n\n&amp;#x200B;\n\nBut my right eye is totally fine and I'm pretty sure I won't have problems with the rest of the exam as I'm in general very healthy\n\n&amp;#x200B;\n\nThis is worrying me a bit because I found the basic training course near my house and I really want to do it, but I don't want to do it and then get rejected straight away when applying for jobs  \n\n\nDoes anyone know anything that can help me?", "link": "https://www.reddit.com/r/photography/comments/bfpoq6/cruise_ship_photographers_does_my_medical/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "cruise ship photographers, does my medical condition automatically disqualify me for a -----> position !!! ? /!/ hey there!  \n\n\nlately i've been considering working in cruise ships, and as i was gathering more info, i learnt that any potential candidate goes through an extensive medical exam\n\n  \nthe thing is that i am blind from my left eye, i literally have a scar on the back of my eye. it's not noticeable, it's nothing contagious and nothing to be worried about (i go to the doctor every year and my condition will never get worse), and i actually have a bit of peripheral vision\n\n&amp;#x200b;\n\nbut my right eye is totally fine and i'm pretty sure i won't have problems with the rest of the exam as i'm in general very healthy\n\n&amp;#x200b;\n\nthis is worrying me a bit because i found the basic training course near my house and i really want to do it, but i don't want to do it and then get rejected straight away when applying for jobs  \n\n\ndoes anyone know anything that can help me?", "sortedWord": "None", "identifyer": 84133, "year": "2019"}, {"Unnamed: 0": 336370, "autor": "mannibis", "date": 1556812132000, "content": "Best Focusing Technique/Mode for Moving Children /!/ I'm a beginner. I bought an 80D and just picked up the 17-55 F2.8 USM and I also have the 50mm F1.8 STM, mainly for shooting my kid and for landscapes/street when I find the time.\n\nIn your experience, what is the AF-mode and AF-zone that is best for shooting moving children (as you can imagine, they don't sit still for very long). I read that for portraits, it's best to use single auto-focus point and aim for the closest eye. I tried doing this in Continuous focus mode but my 2 year old doesn't exactly sit in the same position for even a second. So that ends up making my photo a bit blurrier than desired. \n\nShould I switch to the AF-zone mode where the AF box is much bigger and have the camera pick the AF points? Should I also keep the AF mode in Servo so that it will follow him around if he moves? In that case, I won't hear the AF beep (it won't lock focus) right? \n\nI'm just trying to see how I should deal with all the AF options on the 80D (in terms of mode and AF selection) and could use some experienced recommendations. Thanks and sorry for the n00b question.", "link": "https://www.reddit.com/r/photography/comments/bjwi1v/best_focusing_techniquemode_for_moving_children/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "best focusing technique/mode for moving children /!/ i'm a beginner. i bought an 80d and just picked up the 17-55 f2.8 usm and i also have the 50mm f1.8 stm, mainly for shooting my kid and for landscapes/street when i find the time.\n\nin your experience, what is the af-mode and af-zone that is best for shooting moving children (as you can imagine, they don't sit still for very long). i read that for portraits, it's best to use single auto-focus point and aim for the closest eye. i tried doing this in continuous focus mode but my 2 year old doesn't exactly sit in the same -----> position !!!  for even a second. so that ends up making my photo a bit blurrier than desired. \n\nshould i switch to the af-zone mode where the af box is much bigger and have the camera pick the af points? should i also keep the af mode in servo so that it will follow him around if he moves? in that case, i won't hear the af beep (it won't lock focus) right? \n\ni'm just trying to see how i should deal with all the af options on the 80d (in terms of mode and af selection) and could use some experienced recommendations. thanks and sorry for the n00b question.", "sortedWord": "None", "identifyer": 84258, "year": "2019"}, {"Unnamed: 0": 336445, "autor": "RichardCRoweiii", "date": 1558988293000, "content": "5 Forex Trading Habits That Lower Your Risk Exposure /!/ In trading, it is very easy to get lost in the game. You get on your trading platform, try to get some pips, and in the process you usually forget the most basic risk management practices.\n\nHere are five common habits that we use at Currency Traders Club\n\n1. Double, triple, even quadruple-check you orders\n\nElectronic trading has made it very easy for traders to execute trades. However, because of the ease and simplicity of electronic online trading, the chances of erroneous commands also rise significantly. Having a well-thought-out trading plan would be useless if you do not correctly input your orders.\n\nIn May 2010, the financial market experienced a huge crash due to a “fat finger” event. A trader in a large trading firm mistakenly sold $16 billion worth of future contracts instead of just $16 million.\n\nOther traders who saw the order thought that something big was about to happen, so they sold too. This resulted to a collective intraday drop of $1 trillion in the U.S. equity market. Needless to say, the trading firm, as well as those holding on to stocks, lost a lot of money.\n\nDouble, triple, even quadruple-checking your order is very important in avoiding costly and unnecessary blunders. [@wetradefx](https://richardrowedotblog.wordpress.com/mentions/wetradefx/) reviewing commands is part of our routine. It will just take a couple of seconds of your time!\n\n2. Always have a trading plan\n\nYou’d think that all traders would have a trading plan by now. I have talked about having a trade plan many times in my previous blog posts. Unfortunately, a lot of traders still trade impulsively.\n\nThere are traders who trade completely on emotion and irrationally get into trades without thinking it through. At the very least, you should have a plan on where to enter or exit your positions. By doing so, you limit disastrous emotional reactions to adverse price movements.\n\n3. Take profit on your winning trades\n\nAnother commonly overlooked risk management that we practice at Currency Traders Club is taking some of your profits off the table while the price action is still in your favor.\n\nI know it’s tempting to ride a trend with a full position all the way to your profit target, but taking off a part of your position limits your exposure to potential volatility. After all, the saying “The trend is your friend… until it ends” didn’t come from nothing, did it?\n\nLet’s take the STA strategy or any other scaling technique for example. Let’s say your trading plan calls for adding to your original position and moving your stop loss after a certain number of pips.\n\nIf you take some off of your position midway, you may at least end up with a small win even if that trend suddenly reverses on you.\n\n4. Take a step back from trading\n\nDo you feel like you’re in a trading rut? Are your fundamental and technical analyses off more often that you’d like to admit? If you said “yes” to these questions, then you probably just need to take a little time off from trading.\n\nWhat’s good about staying away from the markets completely is that you’re not emotionally invested in any position. This usually allows you to reset and see market themes and chart patterns from a renewed point of view. And sometimes, a break will help you realize what you did wrong in your last couple of trades.\n\nSo take a step back, try to resist the lure of pip-making for a while, and you’ll most likely come back with a refreshed mind and a new and improved trading plan.\n\n5. Withdraw your money regularly\n\nWhile turning a couple of thousand bucks to a multi-gazillion trading account is a big confidence booster in trading, it’s still advisable to withdraw some of your money regularly. For one, additional capital usually exposes you to impulsive decisions like trading with larger positions or overtrading.\n\nUnless your trading goal calls for increasing your position sizes or your number of trades, withdrawing some of your money is one of your best bets at limiting risk. Besides, haven’t I told you often enough that being a consistently profitable requires your focus on the process and not on profits?\n\nTake some of your moolah from time to time; take a vacation with your partner or your friends; buy something fancy for yourself, and enjoy the hard-earned fruits of your labor.\n\nAbout Dr. Pipslow\n\nDr. Pipslow\n\nIf you can’t keep your emotions in check when trading, you will lose money. Lots of it. The most significant action that you can do to improve trading profits is to work on yourself. Really knowing yourself and how you think can give you an edge that others in the market don’t have. My goal is to share practical advice to improve your forex psychology without boring you to death. Hopefully, you can develop the mental edge you need to become the best trader you can be.\n\n   \n   \n from WordPress http://bit.ly/2WtuEqO", "link": "https://www.reddit.com/r/photography/comments/btqtcu/5_forex_trading_habits_that_lower_your_risk/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "5 forex trading habits that lower your risk exposure /!/ in trading, it is very easy to get lost in the game. you get on your trading platform, try to get some pips, and in the process you usually forget the most basic risk management practices.\n\nhere are five common habits that we use at currency traders club\n\n1. double, triple, even quadruple-check you orders\n\nelectronic trading has made it very easy for traders to execute trades. however, because of the ease and simplicity of electronic online trading, the chances of erroneous commands also rise significantly. having a well-thought-out trading plan would be useless if you do not correctly input your orders.\n\nin may 2010, the financial market experienced a huge crash due to a “fat finger” event. a trader in a large trading firm mistakenly sold $16 billion worth of future contracts instead of just $16 million.\n\nother traders who saw the order thought that something big was about to happen, so they sold too. this resulted to a collective intraday drop of $1 trillion in the u.s. equity market. needless to say, the trading firm, as well as those holding on to stocks, lost a lot of money.\n\ndouble, triple, even quadruple-checking your order is very important in avoiding costly and unnecessary blunders. [@wetradefx](https://richardrowedotblog.wordpress.com/mentions/wetradefx/) reviewing commands is part of our routine. it will just take a couple of seconds of your time!\n\n2. always have a trading plan\n\nyou’d think that all traders would have a trading plan by now. i have talked about having a trade plan many times in my previous blog posts. unfortunately, a lot of traders still trade impulsively.\n\nthere are traders who trade completely on emotion and irrationally get into trades without thinking it through. at the very least, you should have a plan on where to enter or exit your -----> positions !!! . by doing so, you limit disastrous emotional reactions to adverse price movements.\n\n3. take profit on your winning trades\n\nanother commonly overlooked risk management that we practice at currency traders club is taking some of your profits off the table while the price action is still in your favor.\n\ni know it’s tempting to ride a trend with a full position all the way to your profit target, but taking off a part of your position limits your exposure to potential volatility. after all, the saying “the trend is your friend… until it ends” didn’t come from nothing, did it?\n\nlet’s take the sta strategy or any other scaling technique for example. let’s say your trading plan calls for adding to your original position and moving your stop loss after a certain number of pips.\n\nif you take some off of your position midway, you may at least end up with a small win even if that trend suddenly reverses on you.\n\n4. take a step back from trading\n\ndo you feel like you’re in a trading rut? are your fundamental and technical analyses off more often that you’d like to admit? if you said “yes” to these questions, then you probably just need to take a little time off from trading.\n\nwhat’s good about staying away from the markets completely is that you’re not emotionally invested in any position. this usually allows you to reset and see market themes and chart patterns from a renewed point of view. and sometimes, a break will help you realize what you did wrong in your last couple of trades.\n\nso take a step back, try to resist the lure of pip-making for a while, and you’ll most likely come back with a refreshed mind and a new and improved trading plan.\n\n5. withdraw your money regularly\n\nwhile turning a couple of thousand bucks to a multi-gazillion trading account is a big confidence booster in trading, it’s still advisable to withdraw some of your money regularly. for one, additional capital usually exposes you to impulsive decisions like trading with larger positions or overtrading.\n\nunless your trading goal calls for increasing your position sizes or your number of trades, withdrawing some of your money is one of your best bets at limiting risk. besides, haven’t i told you often enough that being a consistently profitable requires your focus on the process and not on profits?\n\ntake some of your moolah from time to time; take a vacation with your partner or your friends; buy something fancy for yourself, and enjoy the hard-earned fruits of your labor.\n\nabout dr. pipslow\n\ndr. pipslow\n\nif you can’t keep your emotions in check when trading, you will lose money. lots of it. the most significant action that you can do to improve trading profits is to work on yourself. really knowing yourself and how you think can give you an edge that others in the market don’t have. my goal is to share practical advice to improve your forex psychology without boring you to death. hopefully, you can develop the mental edge you need to become the best trader you can be.\n\n   \n   \n from wordpress http://bit.ly/2wtueqo", "sortedWord": "None", "identifyer": 84335, "year": "2019"}, {"Unnamed: 0": 337383, "autor": "UserAccessDenied", "date": 1557231500000, "content": "Wildlife Photography from a Kayak /!/ I live on the the great peninsula of Delmarva... I've been shooting from landlocked positions for years now. I'm always yearning for more glass, the 500mm, the 600mm, the 800mm!?  \n\n\nBut, now I'm thinking money could be better spent on a means of getting closer to my subject.\n\n&amp;#x200B;\n\nin fact, I'm extremely happy with my D500 and 200-500mm. Aside from F5.6, there's not much I would change about this lens. And even then it would be heavier and more expensive, so there's always a trade-off.\n\nNow back on topic...\n\n&amp;#x200B;\n\nI've had trouble finding a ton of resources online for wildlife photography/kayak combos.\n\nAre the pedal drive systems (Hobie Mirage, Native Propel, Jackson Flex Drive, etc) preferred to leave your hands-free for camera use? Or do they get in the way of a tripod/monopod... Do you even use a tripod in the kayak? I feel like the constant bobbing effect would make it difficult to use and handheld would be easier, but I don't know!\n\n&amp;#x200B;\n\nObviously a standard paddle-driven kayak would be MUCH less expensive, but I think the pedal drive systems are pretty cool.\n\n&amp;#x200B;\n\nPlus, if you're gonna drop $10,000 on a new lens, maybe $3,500 for a kayak isn't a big deal?!\n\n&amp;#x200B;\n\nI by no means have that kind of budget. This post is all theoretical.\n\n&amp;#x200B;\n\nIf anyone has experience with wildlife photography from a kayak, please share below!\n\nI'm sure there are some horror stories out there as well...", "link": "https://www.reddit.com/r/photography/comments/blq07q/wildlife_photography_from_a_kayak/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "wildlife photography from a kayak /!/ i live on the the great peninsula of delmarva... i've been shooting from landlocked -----> positions !!!  for years now. i'm always yearning for more glass, the 500mm, the 600mm, the 800mm!?  \n\n\nbut, now i'm thinking money could be better spent on a means of getting closer to my subject.\n\n&amp;#x200b;\n\nin fact, i'm extremely happy with my d500 and 200-500mm. aside from f5.6, there's not much i would change about this lens. and even then it would be heavier and more expensive, so there's always a trade-off.\n\nnow back on topic...\n\n&amp;#x200b;\n\ni've had trouble finding a ton of resources online for wildlife photography/kayak combos.\n\nare the pedal drive systems (hobie mirage, native propel, jackson flex drive, etc) preferred to leave your hands-free for camera use? or do they get in the way of a tripod/monopod... do you even use a tripod in the kayak? i feel like the constant bobbing effect would make it difficult to use and handheld would be easier, but i don't know!\n\n&amp;#x200b;\n\nobviously a standard paddle-driven kayak would be much less expensive, but i think the pedal drive systems are pretty cool.\n\n&amp;#x200b;\n\nplus, if you're gonna drop $10,000 on a new lens, maybe $3,500 for a kayak isn't a big deal?!\n\n&amp;#x200b;\n\ni by no means have that kind of budget. this post is all theoretical.\n\n&amp;#x200b;\n\nif anyone has experience with wildlife photography from a kayak, please share below!\n\ni'm sure there are some horror stories out there as well...", "sortedWord": "None", "identifyer": 85352, "year": "2019"}, {"Unnamed: 0": 337415, "autor": "surprise_banana", "date": 1557371247000, "content": "Just installed my SmallRig /!/ Absolutely love it. Way better for those “hard to position” shots. I got the top handle as well, using it as a secondary grip for ground level shots. It’s perfect. Definitely worth the $50", "link": "https://www.reddit.com/r/photography/comments/bmeq4m/just_installed_my_smallrig/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "just installed my smallrig /!/ absolutely love it. way better for those “hard to -----> position !!! ” shots. i got the top handle as well, using it as a secondary grip for ground level shots. it’s perfect. definitely worth the $50", "sortedWord": "None", "identifyer": 85386, "year": "2019"}, {"Unnamed: 0": 337877, "autor": "evaldasm", "date": 1562072848000, "content": "Business photo advices /!/ Hi people, I'm a young professional (m,24) and look younger than I am though I have enough brain and I'm ready for my next job position (now senior aiming to supervisor). First thing I want to do now is to review my linkedin profile and a photo. Do you have any advices how to look better in a business photo (i'll be wearing suit, white shirt). Though how should I smile, what posture should I take and etc. to look more serious/influential?", "link": "https://www.reddit.com/r/photography/comments/c890d1/business_photo_advices/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "business photo advices /!/ hi people, i'm a young professional (m,24) and look younger than i am though i have enough brain and i'm ready for my next job -----> position !!!  (now senior aiming to supervisor). first thing i want to do now is to review my linkedin profile and a photo. do you have any advices how to look better in a business photo (i'll be wearing suit, white shirt). though how should i smile, what posture should i take and etc. to look more serious/influential?", "sortedWord": "None", "identifyer": 85880, "year": "2019"}, {"Unnamed: 0": 337989, "autor": "memoryman89", "date": 1562169531000, "content": "focal length dependance (and creativity) /!/ just as is the case for countless others, a 50 was my first lens. i learned on it, grew with it, and developed a style centred around it. then a few years later i got into an 85, which i've shot 95% of my work since on. it's quite annoying, because i've become ***so*** used to that focal length that anything else feels completely foreign, prompting me to switch back shortly after. all of a sudden 50 seems too wide. on the wide wide end of the spectrum, i can't stand my 28 and feel like it's wide, but not wide enough and i should either switch to a 21 or 24, or even a 35. 28 really is an odd one in my opinion and has little to no use in my field (fashion/portrait). with the wider 21 or 24 i could utilize the distortion as a more prominent effect, which while i've done with the 28, wasn't 'enough'. i think what i like so much about 85 is how flat the image is- there's just something about how an 85 reads that i like a lot. but i'm starting to feel that it might be hindering me creatively as i've noticed a great deal of my shots have a similar aesthetic. i'm all for uniformity (a distinct aesthetic unique to them) among a photographers body of work, but think that can come from things other than just focal length. have any of you been in a similar position where you found yourself relying exclusively on one focal length, thus making it harder to creatively advance? if so, how did you overcome it?", "link": "https://www.reddit.com/r/photography/comments/c8pt26/focal_length_dependance_and_creativity/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "focal length dependance (and creativity) /!/ just as is the case for countless others, a 50 was my first lens. i learned on it, grew with it, and developed a style centred around it. then a few years later i got into an 85, which i've shot 95% of my work since on. it's quite annoying, because i've become ***so*** used to that focal length that anything else feels completely foreign, prompting me to switch back shortly after. all of a sudden 50 seems too wide. on the wide wide end of the spectrum, i can't stand my 28 and feel like it's wide, but not wide enough and i should either switch to a 21 or 24, or even a 35. 28 really is an odd one in my opinion and has little to no use in my field (fashion/portrait). with the wider 21 or 24 i could utilize the distortion as a more prominent effect, which while i've done with the 28, wasn't 'enough'. i think what i like so much about 85 is how flat the image is- there's just something about how an 85 reads that i like a lot. but i'm starting to feel that it might be hindering me creatively as i've noticed a great deal of my shots have a similar aesthetic. i'm all for uniformity (a distinct aesthetic unique to them) among a photographers body of work, but think that can come from things other than just focal length. have any of you been in a similar -----> position !!!  where you found yourself relying exclusively on one focal length, thus making it harder to creatively advance? if so, how did you overcome it?", "sortedWord": "None", "identifyer": 85997, "year": "2019"}, {"Unnamed: 0": 338257, "autor": "Jennybunny-", "date": 1562863622000, "content": "Looking to expand my portfolio and hopefully land a job in the industry. Wondering how to know how to navigate my job search with no professional background? /!/ There are so many things I could say on this post I will keep it on one track though. I graduated with a minor in photo illustration major fashion merchandising. When I moved to NYC it became so clear that both of these industries are really hard to get into. So I grabbed whatever job I could to pay the bills. I have been laid off twice in the past year and know that I need to get out of the fashion industry. I am wanting to turn back to my real passion photography. I have taken so much time away though I feel my portfolio is decent and I will have work to build it up more but I have never been in a paid role for photography. What do you suggest I do to give myself an edge when applying for studio positions with no professional background?", "link": "https://www.reddit.com/r/photography/comments/cbxxu2/looking_to_expand_my_portfolio_and_hopefully_land/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "looking to expand my portfolio and hopefully land a job in the industry. wondering how to know how to navigate my job search with no professional background? /!/ there are so many things i could say on this post i will keep it on one track though. i graduated with a minor in photo illustration major fashion merchandising. when i moved to nyc it became so clear that both of these industries are really hard to get into. so i grabbed whatever job i could to pay the bills. i have been laid off twice in the past year and know that i need to get out of the fashion industry. i am wanting to turn back to my real passion photography. i have taken so much time away though i feel my portfolio is decent and i will have work to build it up more but i have never been in a paid role for photography. what do you suggest i do to give myself an edge when applying for studio -----> positions !!!  with no professional background?", "sortedWord": "None", "identifyer": 86277, "year": "2019"}, {"Unnamed: 0": 338419, "autor": "clondon", "date": 1563019666000, "content": "Emotionally taxing projects /!/ Has anyone taken on a project which was a bit emotionally draining? What was your experience like and was the end result worth the strain?\n\nFor the past three years, I've been working up the courage to start a project which will have an emotional toll on me. But, I have finally decided that I'll never fully be in the perfect mindset to take it on, so I'm just jumping in feet first. \n\nFor those who have been in this position before, what advice can you give? Is there anything you wish you had done differently or known upfront? \n\nThanks for any insight you can impart!", "link": "https://www.reddit.com/r/photography/comments/ccomoa/emotionally_taxing_projects/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "emotionally taxing projects /!/ has anyone taken on a project which was a bit emotionally draining? what was your experience like and was the end result worth the strain?\n\nfor the past three years, i've been working up the courage to start a project which will have an emotional toll on me. but, i have finally decided that i'll never fully be in the perfect mindset to take it on, so i'm just jumping in feet first. \n\nfor those who have been in this -----> position !!!  before, what advice can you give? is there anything you wish you had done differently or known upfront? \n\nthanks for any insight you can impart!", "sortedWord": "None", "identifyer": 86451, "year": "2019"}], "name": "positionphotography2019"}