{"interestingcomments": [{"Unnamed: 0": 64108, "autor": "muffingg", "date": 1609063412000, "content": "Best online photography backup solution that allows tagging and viewing of photos /!/ I'm looking after all the photographs of my religious organisation and we have around 8TB of photos dating back many decades.. So far it's all over the place including a NAS drive.\n\nI'm looking for a solution which allows us to:\n* backed them all up online\n* view them like a gallery online without having to download them\n* tag each picture (manually is fine) and search for pictures by tags\n* do this at the lowest possible price (i.e. not interested in any other features which may increase the price, the above mentioned are all we need tbh)\n\nWe would be open to hosting the files on our own NAS and having these features if that would save cost and allow the above.", "link": "https://www.reddit.com/r/photography/comments/kl18we/best_online_photography_backup_solution_that/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "best online photography backup solution that allows -----> tagging !!!  and viewing of photos /!/ i'm looking after all the photographs of my religious organisation and we have around 8tb of photos dating back many decades.. so far it's all over the place including a nas drive.\n\ni'm looking for a solution which allows us to:\n* backed them all up online\n* view them like a gallery online without having to download them\n* tag each picture (manually is fine) and search for pictures by tags\n* do this at the lowest possible price (i.e. not interested in any other features which may increase the price, the above mentioned are all we need tbh)\n\nwe would be open to hosting the files on our own nas and having these features if that would save cost and allow the above.", "sortedWord": "None", "identifyer": 65675, "year": "2020"}, {"Unnamed: 0": 64497, "autor": "HyruleJedi", "date": 1605884343000, "content": "Not sure if this is the place, but help /!/ So, I have been using Picasa software for years, and its on its last leg and no longer supported in Catalina.  \n\nSo to be proactive, I am trying to find a replacement (paid or free does not matter) that does the following: \n\n1. Connects to a network Share: I have a Photoroom with a computer where the files are saved locally, and then 4 other Macs point to the the HDD of that computer (so Lightroom is out) \n\n2. Allows for searchable tagging that can be accessed locally or on the other machines. \n\n3. Allows for Collaging \n\nAll the forums say there is simply no replacement.  So far I have tried: \n\n1. Photoscape: No tagging or searching (unless Im missing it) \n\n2. ACDSee: No collaging, and it appears the tags don't transfer across computers. That is if I tag from one computer, it is not showing up on another (I might be doing something wrong)", "link": "https://www.reddit.com/r/photography/comments/jxqi2o/not_sure_if_this_is_the_place_but_help/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "not sure if this is the place, but help /!/ so, i have been using picasa software for years, and its on its last leg and no longer supported in catalina.  \n\nso to be proactive, i am trying to find a replacement (paid or free does not matter) that does the following: \n\n1. connects to a network share: i have a photoroom with a computer where the files are saved locally, and then 4 other macs point to the the hdd of that computer (so lightroom is out) \n\n2. allows for searchable -----> tagging !!!  that can be accessed locally or on the other machines. \n\n3. allows for collaging \n\nall the forums say there is simply no replacement.  so far i have tried: \n\n1. photoscape: no tagging or searching (unless im missing it) \n\n2. acdsee: no collaging, and it appears the tags don't transfer across computers. that is if i tag from one computer, it is not showing up on another (i might be doing something wrong)", "sortedWord": "None", "identifyer": 66071, "year": "2020"}, {"Unnamed: 0": 66827, "autor": "tettusud", "date": 1580655966000, "content": "Photo tagging and searching, desktop application. No need of upload ,Works offline and will not modify your original photos, your privacy is protected. It has other features like watermark, grids etc. Download from www.pixobe.com", "link": "https://www.reddit.com/r/photography/comments/expnqp/photo_tagging_and_searching_desktop_application/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "photo -----> tagging !!!  and searching, desktop application. no need of upload ,works offline and will not modify your original photos, your privacy is protected. it has other features like watermark, grids etc. download from www.pixobe.com", "sortedWord": "None", "identifyer": 68478, "year": "2020"}, {"Unnamed: 0": 67725, "autor": "a5s_s7r", "date": 1590665835000, "content": "Review Workflow for small team /!/ Hi,\n\nwe are a small company (6 people) with a lot of photos and media to handle.\n\nWe use Catpure One, Ligthroom and Photoshop to edit our photos, also have a lot of grahic designs as AI and EPS files.\n\nI am looking for a solution to do following workflow:\n\n* culling, taging and first editing\n* have a possibility to do a review for 1 or 2 team members. should be definable somehow who can do it\n* should be able to have user groups to limit who can see which gallery/image. photos can be mixed private and work related.\n* tagging manual and based on an AI would be great\n* running internally on our server\n* should not break the bank\n\nLightroome would do most of it, but only on one working place, but we need to have a browser based solution as we have team members working from home.\n\nDo you have any suggestions?\n\nThanks in advance", "link": "https://www.reddit.com/r/photography/comments/gs4nrb/review_workflow_for_small_team/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "review workflow for small team /!/ hi,\n\nwe are a small company (6 people) with a lot of photos and media to handle.\n\nwe use catpure one, ligthroom and photoshop to edit our photos, also have a lot of grahic designs as ai and eps files.\n\ni am looking for a solution to do following workflow:\n\n* culling, taging and first editing\n* have a possibility to do a review for 1 or 2 team members. should be definable somehow who can do it\n* should be able to have user groups to limit who can see which gallery/image. photos can be mixed private and work related.\n* -----> tagging !!!  manual and based on an ai would be great\n* running internally on our server\n* should not break the bank\n\nlightroome would do most of it, but only on one working place, but we need to have a browser based solution as we have team members working from home.\n\ndo you have any suggestions?\n\nthanks in advance", "sortedWord": "None", "identifyer": 69405, "year": "2020"}, {"Unnamed: 0": 68664, "autor": "ItsMeTheJinx", "date": 1594524371000, "content": "How do people get discovered on Instagram? /!/ I’m a late Instagram bloomer and every time I think I did a good photo i don’t get many likes and it kills my inspiration to continue to take new pics. I tried tagging but I feel like that doesn’t really help. I tried different kinds of genres with little success. Maybe I’m just not good.... I know it shouldn’t matter how many likes but the way I see its like why be a photographer if no one ever cares about your work, or why post an image to a stock photo website if no one is gonna buy", "link": "https://www.reddit.com/r/photography/comments/hpnlxm/how_do_people_get_discovered_on_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "how do people get discovered on instagram? /!/ i’m a late instagram bloomer and every time i think i did a good photo i don’t get many likes and it kills my inspiration to continue to take new pics. i tried -----> tagging !!!  but i feel like that doesn’t really help. i tried different kinds of genres with little success. maybe i’m just not good.... i know it shouldn’t matter how many likes but the way i see its like why be a photographer if no one ever cares about your work, or why post an image to a stock photo website if no one is gonna buy", "sortedWord": "None", "identifyer": 70364, "year": "2020"}, {"Unnamed: 0": 72579, "autor": "thinkscotty", "date": 1581061700000, "content": "I logged into my stock photo contributor site after forgetting about if for years. My best selling photo, having earned my a cool $37 is a stunning composure of dead brown leaves in a gutter that I took with a Canon t5i before I how to shoot in manual. Now I'll truly be able to say I'm a pro. /!/ [Check out this beauty.](https://stock.adobe.com/stock-photo/id/88363313) Stock photography has made me a wealthy man. I'd encourage anyone looking for fame and fortune to do as I did and spend several hours laboriously uploading and tagging as many of your random photos as possible.", "link": "https://www.reddit.com/r/photography/comments/f07c0y/i_logged_into_my_stock_photo_contributor_site/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "i logged into my stock photo contributor site after forgetting about if for years. my best selling photo, having earned my a cool $37 is a stunning composure of dead brown leaves in a gutter that i took with a canon t5i before i how to shoot in manual. now i'll truly be able to say i'm a pro. /!/ [check out this beauty.](https://stock.adobe.com/stock-photo/id/88363313) stock photography has made me a wealthy man. i'd encourage anyone looking for fame and fortune to do as i did and spend several hours laboriously uploading and -----> tagging !!!  as many of your random photos as possible.", "sortedWord": "None", "identifyer": 74425, "year": "2020"}, {"Unnamed: 0": 72684, "autor": "breadandbutter123456", "date": 1581774807000, "content": "Stock photography tagging software /!/ We have been posting our photos on shutterstock &amp; a little on alamy. \n\nIt takes an age to tag the photos, are they any software that will tag the photos? \n\nAny other software anyone would recommend?", "link": "https://www.reddit.com/r/photography/comments/f49o4e/stock_photography_tagging_software/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "stock photography -----> tagging !!!  software /!/ we have been posting our photos on shutterstock &amp; a little on alamy. \n\nit takes an age to tag the photos, are they any software that will tag the photos? \n\nany other software anyone would recommend?", "sortedWord": "None", "identifyer": 74533, "year": "2020"}, {"Unnamed: 0": 82521, "autor": "awokepsl", "date": 1606954494000, "content": "Cost of erotic photography? /!/ I live in a place with a lot of nude sex workers, i.e. stripping, and photography. Where we're relatively lax on nudity, and have the world's largest naked bike ride. I think there's a really good amount of subjects for nude art photography. Personally I'm interested in that, and fashion photography. But are there cases where people will let you photograph them for free? Is it a matter of building a portfolio first, and in the case of sex workers, having a decent following that can get them more potential customers on Onlyfans or Patreon? I'm relatively new, but I'm wanting to do photography that's mutually beneficial to the subject and myself, but I don't have the money to pay every photoshoot. I wanted to spend a little over a grand on a camera, and setup a website where I can possibly sell prints.\n\nI'm pretty sure I'd be able to grow a social media profile pretty fast, as I've been good in the past at doing so through interacting with other users and tagging photos and locations.", "link": "https://www.reddit.com/r/photography/comments/k5m1um/cost_of_erotic_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "cost of erotic photography? /!/ i live in a place with a lot of nude sex workers, i.e. stripping, and photography. where we're relatively lax on nudity, and have the world's largest naked bike ride. i think there's a really good amount of subjects for nude art photography. personally i'm interested in that, and fashion photography. but are there cases where people will let you photograph them for free? is it a matter of building a portfolio first, and in the case of sex workers, having a decent following that can get them more potential customers on onlyfans or patreon? i'm relatively new, but i'm wanting to do photography that's mutually beneficial to the subject and myself, but i don't have the money to pay every photoshoot. i wanted to spend a little over a grand on a camera, and setup a website where i can possibly sell prints.\n\ni'm pretty sure i'd be able to grow a social media profile pretty fast, as i've been good in the past at doing so through interacting with other users and -----> tagging !!!  photos and locations.", "sortedWord": "None", "identifyer": 84762, "year": "2020"}, {"Unnamed: 0": 87238, "autor": "lestergirard2000", "date": 1593620825000, "content": "Help archiving, tagging, and sharing 12 years of product photography /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/hjdkur/help_archiving_tagging_and_sharing_12_years_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "help archiving, -----> tagging !!! , and sharing 12 years of product photography /!/ [removed]", "sortedWord": "None", "identifyer": 89665, "year": "2020"}], "name": "taggingphotography2020"}