{"interestingcomments": [{"Unnamed: 0": 98194, "autor": "fakeaccountconfesses", "date": 1569959854000, "content": "Looking for ways to buy a camera without getting a retail price tag /!/ I’m looking to buy my first camera. I’m looking to mainly shoot videos, but until I develop this skills to where I feel comfortable, I will stick to doing photography work. Is this feasible , to buy a camera that can do both WELL. Budget is ~$2000z \n\nMy first thought was going to Walmart or Best Buy, and I couldn’t help to think I could get at a cheaper price if I buy elsewhere. Any suggestions ?", "link": "https://www.reddit.com/r/photography/comments/dbyu2x/looking_for_ways_to_buy_a_camera_without_getting/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "looking for ways to buy a camera without getting a retail price -----> tag !!!  /!/ i’m looking to buy my first camera. i’m looking to mainly shoot videos, but until i develop this skills to where i feel comfortable, i will stick to doing photography work. is this feasible , to buy a camera that can do both well. budget is ~$2000z \n\nmy first thought was going to walmart or best buy, and i couldn’t help to think i could get at a cheaper price if i buy elsewhere. any suggestions ?", "sortedWord": "None", "identifyer": 855, "year": "2019"}, {"Unnamed: 0": 98368, "autor": "mandy_01", "date": 1565317642000, "content": "Getting taken for granted /!/ I'll try to make this short, but I figured that this was one community that could understand my frustrations. \n\nYesterday on one of my few days off my fulltime job, I drove a two hour round trip, hiked for one hour (while sick), stayed late because they promised gas money and hadn't gotten it yet, and spent hours editing engagement photos for my best friend. \n\nMy only request? They get me dinner and gas money. \n\nI get tagged on a photo for Instagram to find she had re-edited one of the photos I gave her and thrown a filter on it. \n\nThe thing is, when I edit photos I'm full transparency to ensure they like the pics. I send them one to start with to see if they like the aesthetic, and then I will continue forth. She said she loved the editing style, for her to just re-edit it felt like shes just taking me for granted. I'm not a professional, but I have spent time and money on my equipment and editing software. \nI might as well have just taken the photos on her phone and let her edit them herself.  \n\nThis was after a whole bunch of other hoops I had to jump through for them, so maybe this was just the straw. \n\nTrying to take a deep breath and move on. \n\nDoes this happen often to you guys? Whenever I've had a photographer take my photos, I've never even considered editing them as I understand the time and energy and money they put into it, plus you usually know what to expect if you researched your photographer.", "link": "https://www.reddit.com/r/photography/comments/cnvz82/getting_taken_for_granted/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "getting taken for granted /!/ i'll try to make this short, but i figured that this was one community that could understand my frustrations. \n\nyesterday on one of my few days off my fulltime job, i drove a two hour round trip, hiked for one hour (while sick), stayed late because they promised gas money and hadn't gotten it yet, and spent hours editing engagement photos for my best friend. \n\nmy only request? they get me dinner and gas money. \n\ni get -----> tagged !!!  on a photo for instagram to find she had re-edited one of the photos i gave her and thrown a filter on it. \n\nthe thing is, when i edit photos i'm full transparency to ensure they like the pics. i send them one to start with to see if they like the aesthetic, and then i will continue forth. she said she loved the editing style, for her to just re-edit it felt like shes just taking me for granted. i'm not a professional, but i have spent time and money on my equipment and editing software. \ni might as well have just taken the photos on her phone and let her edit them herself.  \n\nthis was after a whole bunch of other hoops i had to jump through for them, so maybe this was just the straw. \n\ntrying to take a deep breath and move on. \n\ndoes this happen often to you guys? whenever i've had a photographer take my photos, i've never even considered editing them as i understand the time and energy and money they put into it, plus you usually know what to expect if you researched your photographer.", "sortedWord": "None", "identifyer": 1036, "year": "2019"}, {"Unnamed: 0": 98848, "autor": "bendragonfire", "date": 1565993469000, "content": "My grandpas dog tags", "link": "https://www.reddit.com/r/photography/comments/crdbs0/my_grandpas_dog_tags/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "my grandpas dog -----> tags !!! ", "sortedWord": "None", "identifyer": 1527, "year": "2019"}, {"Unnamed: 0": 99321, "autor": "ChicanoUTurn", "date": 1567460075000, "content": "Archiving and tagging pre-smartphone pictures /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/cyvf52/archiving_and_tagging_presmartphone_pictures/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "archiving and -----> tagging !!!  pre-smartphone pictures /!/ [removed]", "sortedWord": "None", "identifyer": 2016, "year": "2019"}, {"Unnamed: 0": 100035, "autor": "redder92", "date": 1573330514000, "content": "What about a reposter taking credit even after attributing credit to you? /!/ Sort of related to my previous post (https://reddit.app.link/ozqVBPi2t1) on attribution. I accept that I could’ve added my IG handle in the title. I felt this was in a similar vein, but a different issue.\n\nThe picture in question has been deleted from their account so I’m just wondering again what the community’s thoughts are on this. The reposter attributed the picture to my reddit account in the post caption. \n\nHowever in the comments the reposter accepts a tag attribution by a different user. If the reposter had already attributed the picture to me, should they have accepted that attribution or pointed to my reddit account? In other words, is it their permission to give?\n\nhttps://i.redd.it/gbbh4f5wtpx31.jpg", "link": "https://www.reddit.com/r/photography/comments/du131y/what_about_a_reposter_taking_credit_even_after/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "what about a reposter taking credit even after attributing credit to you? /!/ sort of related to my previous post (https://reddit.app.link/ozqvbpi2t1) on attribution. i accept that i could’ve added my ig handle in the title. i felt this was in a similar vein, but a different issue.\n\nthe picture in question has been deleted from their account so i’m just wondering again what the community’s thoughts are on this. the reposter attributed the picture to my reddit account in the post caption. \n\nhowever in the comments the reposter accepts a -----> tag !!!  attribution by a different user. if the reposter had already attributed the picture to me, should they have accepted that attribution or pointed to my reddit account? in other words, is it their permission to give?\n\nhttps://i.redd.it/gbbh4f5wtpx31.jpg", "sortedWord": "None", "identifyer": 2748, "year": "2019"}, {"Unnamed: 0": 100551, "autor": "clondon", "date": 1574689041000, "content": "BLACK FRIDAY SALE MEGATHREAD /!/ It's almost that time of year again, soon we'll be buried in Black Friday sale postings. As usual we'll consolidate these sale postings into this thread.\n\n**If you see a sale that would be of interest to our readers, please post a comment here!**\n\nOur Automod spam filter is very efficient, please remove any referral tags or shortlinks from your posts, or Automod will eat your post.\n___\nIf you have questions about what to buy, don't post here but rather in our stickied Question Thread.\n___\nWondering what you should buy?\n\n[What should I keep in mind when buying a camera for someone else](https://www.reddit.com/r/photography/wiki/index#wiki_what_should_i_keep_in_mind_when_buying_a_camera_for_someone_else.3F)\n\n[Last year's holiday buying guide](https://www.reddit.com/r/photography/comments/a1cz8s/2018_gift_suggestion_thread/)", "link": "https://www.reddit.com/r/photography/comments/e1g5pa/black_friday_sale_megathread/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "black friday sale megathread /!/ it's almost that time of year again, soon we'll be buried in black friday sale postings. as usual we'll consolidate these sale postings into this thread.\n\n**if you see a sale that would be of interest to our readers, please post a comment here!**\n\nour automod spam filter is very efficient, please remove any referral -----> tags !!!  or shortlinks from your posts, or automod will eat your post.\n___\nif you have questions about what to buy, don't post here but rather in our stickied question thread.\n___\nwondering what you should buy?\n\n[what should i keep in mind when buying a camera for someone else](https://www.reddit.com/r/photography/wiki/index#wiki_what_should_i_keep_in_mind_when_buying_a_camera_for_someone_else.3f)\n\n[last year's holiday buying guide](https://www.reddit.com/r/photography/comments/a1cz8s/2018_gift_suggestion_thread/)", "sortedWord": "None", "identifyer": 3279, "year": "2019"}, {"Unnamed: 0": 101662, "autor": "clondon", "date": 1552582253000, "content": "[Announcement] New Official Instagram /!/ We’re happy to announce a new initiative to better share the talents in our subs: a new official Instagram account ([@RedditPhotographers](https://www.instagram.com/redditphotographers/)) to regularly share our users' work (fully credited, of course).\n\nTo see your work on the Instagram, submit your photos to r/photographs. Please be sure to *[read all the rules](https://www.reddit.com/r/photographs/about/rules)* before posting. You can put your Instagram in your user flair so that we know who to properly credit. Otherwise we will credit via your username. You may also hashtag your photos on Instagram [#redditphotographers](https://www.instagram.com/explore/tags/redditphotographers/). \n\nIf you do not wish to have your photo shared as part of this Instagram account, please say so as part of the required detail comment left on your post, or reach out directly to mods.\n\nAs always, we are looking forward to seeing all the great work from the community!", "link": "https://www.reddit.com/r/photography/comments/b12o18/announcement_new_official_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "[announcement] new official instagram /!/ we’re happy to announce a new initiative to better share the talents in our subs: a new official instagram account ([@redditphotographers](https://www.instagram.com/redditphotographers/)) to regularly share our users' work (fully credited, of course).\n\nto see your work on the instagram, submit your photos to r/photographs. please be sure to *[read all the rules](https://www.reddit.com/r/photographs/about/rules)* before posting. you can put your instagram in your user flair so that we know who to properly credit. otherwise we will credit via your username. you may also hashtag your photos on instagram [#redditphotographers](https://www.instagram.com/explore/-----> tags !!! /redditphotographers/). \n\nif you do not wish to have your photo shared as part of this instagram account, please say so as part of the required detail comment left on your post, or reach out directly to mods.\n\nas always, we are looking forward to seeing all the great work from the community!", "sortedWord": "None", "identifyer": 4418, "year": "2019"}, {"Unnamed: 0": 101912, "autor": "thisuserhatesyou", "date": 1553611887000, "content": "How do you feel about people reposting your photos without asking but with credit? /!/ Just wondering what everyone's opinion is on this. An Instagram page promoting a carnival in a nearby small town recently reposted a photo I took there about a year ago. I only found out because I got the notification that they tagged me. They didn't edit the photo at all and displayed the credit prominently, but it kind of bothers me that they didn't ask if they could use it. I'm trying to decide whether to say something about it or leave it be.", "link": "https://www.reddit.com/r/photography/comments/b5qmmo/how_do_you_feel_about_people_reposting_your/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "how do you feel about people reposting your photos without asking but with credit? /!/ just wondering what everyone's opinion is on this. an instagram page promoting a carnival in a nearby small town recently reposted a photo i took there about a year ago. i only found out because i got the notification that they -----> tagged !!!  me. they didn't edit the photo at all and displayed the credit prominently, but it kind of bothers me that they didn't ask if they could use it. i'm trying to decide whether to say something about it or leave it be.", "sortedWord": "None", "identifyer": 4677, "year": "2019"}, {"Unnamed: 0": 101958, "autor": "bp5678", "date": 1550581665000, "content": "What's the correct procedure for using a professional photographers work? /!/ I work for a skiing company and we have properties in 4 different resorts.\n\nEach of the resorts has a tourist board who promote skiing (and other snow activities) during the winter months. They all have Instagram pages:\n\n1. In some resorts they tag the actual photographer in the photo\n2. In other resorts they don't tag the photographer's name/Instagram profile\n3. And in some other resorts they sometimes tag the photographer in their photos but sometimes they don't.\n\nI'm collating the best photos from the tourist boards instagram page and we hope to use their best photos in our marketing (in our brochure and our website).\n\nWhat's the correct way to use these photos?:\n\n* Add them directly to our brochure/website\n* Ask the tourist board if we can add to our brochure/website\n* Ask the tourist board if we can add to our brochure/website and include the tourist board name\n* Ask the tourist board if we can add to our brochure/website and include the photographer's name\n* Ask the tourist board if we can add to our brochure/website and include both the tourist board and photographer's name\n* Something else?\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/asa7tx/whats_the_correct_procedure_for_using_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "what's the correct procedure for using a professional photographers work? /!/ i work for a skiing company and we have properties in 4 different resorts.\n\neach of the resorts has a tourist board who promote skiing (and other snow activities) during the winter months. they all have instagram pages:\n\n1. in some resorts they -----> tag !!!  the actual photographer in the photo\n2. in other resorts they don't tag the photographer's name/instagram profile\n3. and in some other resorts they sometimes tag the photographer in their photos but sometimes they don't.\n\ni'm collating the best photos from the tourist boards instagram page and we hope to use their best photos in our marketing (in our brochure and our website).\n\nwhat's the correct way to use these photos?:\n\n* add them directly to our brochure/website\n* ask the tourist board if we can add to our brochure/website\n* ask the tourist board if we can add to our brochure/website and include the tourist board name\n* ask the tourist board if we can add to our brochure/website and include the photographer's name\n* ask the tourist board if we can add to our brochure/website and include both the tourist board and photographer's name\n* something else?\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 4724, "year": "2019"}, {"Unnamed: 0": 102347, "autor": "Helenkellersbutthole", "date": 1547992302000, "content": "Model Mayhem, etc. /!/ I've been active on MM for around two years (on the photographer's side), and it's been a hit-or-miss thing. It is what you make of it, I guess.\n\nI shoot models both male and female. Because I lived in a very humid climate, I would execute a number of photo shoots that were tasteful, non-provocative, and swimwear-oriented. Even when I would post fairly innocuous photos (particularly of female models), I would get a number of messages or tags on my posts asking for the model's information or just lewd comments. \n\nNow that I have relocated to a new country and am joining up with other online portfolio networks, I'd like to know if there's a way to cut this sort of talk off at the head. I'm at a loss as to how to tell someone to shove off with their inappropriate remarks without seeming like the new jerk in town to the rest of the online community. Does anyone have any experience with dealing with changing photography cultures and spheres? ", "link": "https://www.reddit.com/r/photography/comments/ahxs1s/model_mayhem_etc/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "model mayhem, etc. /!/ i've been active on mm for around two years (on the photographer's side), and it's been a hit-or-miss thing. it is what you make of it, i guess.\n\ni shoot models both male and female. because i lived in a very humid climate, i would execute a number of photo shoots that were tasteful, non-provocative, and swimwear-oriented. even when i would post fairly innocuous photos (particularly of female models), i would get a number of messages or -----> tags !!!  on my posts asking for the model's information or just lewd comments. \n\nnow that i have relocated to a new country and am joining up with other online portfolio networks, i'd like to know if there's a way to cut this sort of talk off at the head. i'm at a loss as to how to tell someone to shove off with their inappropriate remarks without seeming like the new jerk in town to the rest of the online community. does anyone have any experience with dealing with changing photography cultures and spheres? ", "sortedWord": "None", "identifyer": 5121, "year": "2019"}, {"Unnamed: 0": 102868, "autor": "Shannelliott54", "date": 1560425528000, "content": "A little self photography by an old abandoned church. In love with all the gorgeous tags surrounding me at this place #HamiltonOntario", "link": "https://www.reddit.com/r/photography/comments/c04o9p/a_little_self_photography_by_an_old_abandoned/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "a little self photography by an old abandoned church. in love with all the gorgeous -----> tags !!!  surrounding me at this place #hamiltonontario", "sortedWord": "None", "identifyer": 5654, "year": "2019"}, {"Unnamed: 0": 103150, "autor": "emailmemail", "date": 1557936296000, "content": "Best app for photo organization by tags/description? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/bozrzr/best_app_for_photo_organization_by_tagsdescription/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "best app for photo organization by -----> tags !!! /description? /!/ [removed]", "sortedWord": "None", "identifyer": 5946, "year": "2019"}, {"Unnamed: 0": 103696, "autor": "aloy99", "date": 1568274820000, "content": "Fujifilm reveals X-A7 with improved AF, 4K/30p video and $700 price tag", "link": "https://www.reddit.com/r/photography/comments/d34mgt/fujifilm_reveals_xa7_with_improved_af_4k30p_video/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "fujifilm reveals x-a7 with improved af, 4k/30p video and $700 price -----> tag !!! ", "sortedWord": "None", "identifyer": 6505, "year": "2019"}, {"Unnamed: 0": 104008, "autor": "thisismysecretacct2", "date": 1568574011000, "content": "Giving you a the details I can about my first paid shoot. /!/ Hi All\n\nSo I just finished my first ever paid shoot. Prior to the shoot I did a LOT of research, and this sub has been a great help. \n\nI'm now here to return the favor. I am going to share my entire experience and also answer any questions you may have if you are curious about what I did. I'm obviously by no means a seasoned professional, but seeing as I just finished my first paid shoot, I wanted to give details while it's still fresh in my mind.\n\nSome background--I am a food/product photographer. I've always shot for fun, but last month I decided to turn it into a side gig. I started an IG account and started to tag all the restaurants I go to and taken their pictures at. I did not have a website or a portfolio, but my IG was a representation of my work.\n\nI approached a local brunch and catering spot about a week after I started my IG and asked if they were interested in meeting me to discuss shooting for their menu. They said yes. I IMMEDIATELY STARTED RESEARCHING.\n\nI had a lot of doubt about how much to charge, what I need to do, etc. I was very honest with her during my meeting and told her that I do not have any clients yet. After getting an idea of what she was looking for and what her budget is (always ask them what their budget is). She said her budget was limited and she was willing to pay in check/gift card. I told her I'd get back to her by the end of the day with a quote.\n\nNow, keep in mind...I have hardly any work to show for and I wanted to build my portfolio and gain experience and clientele. \n\nI quoted her the following: 2.5 hour shoot (2 hours during business time and 30 minutes at an evening catering event, because she wanted a couple of catered shots), 20-25 photos. My fee was $100 check and $100 in gift card. She accepted my offer.\n\nI've since finished the shoot, got paid (I got paid the day of the shoot) and I've delivered the photos. I ended up giving her 26 photos. Same day of the shoot, I gave her a couple of sneak peaks. That being said, here are my takeaways from this first shoot.\n\nPros:\n\n*She was amazing to work with and very easy going\n*She gave me complete creative freedom, I can shoot whatever I wanted.\n*Thank God for multiple SD cards and batteries. I shot about 400 shots in 2 hours.\n*I'm able to use a variety of shots in my portfolio\n\nCons:\n\n*She didn't have a shot list, so it was difficult to gauge what she may want\n*BIGGEST CON: Because the place is a small business, they can't shut down and make the food for me take shots of. I shot what was ordered by the guests and I had to shoot fast. I'm talking like 10-20 seconds to shoot it and then the waiter/waitress will take it to the customer. I think in the future, I will have to discuss this in advance in terms of what the restaurants are expecting in terms of quality. Now that being said, the pro of this is that she gave me the freedom to shoot whatever and however, so she's not looking for anything specific. \n*With that, I also could not touch the food or re-plate the food/style the food. So I shot it as it came out.\n\nOverall--I didn't get a variety of the dishes that I had hoped, because people ordered a lot of the same things. I am VERY happy with the result with the given situation (if I do say so myself). It was very challenging and time flew by because I was so busy.\n\nSo, that's my experience with my first paid gig. Any questions or comments?", "link": "https://www.reddit.com/r/photography/comments/d4oteh/giving_you_a_the_details_i_can_about_my_first/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "giving you a the details i can about my first paid shoot. /!/ hi all\n\nso i just finished my first ever paid shoot. prior to the shoot i did a lot of research, and this sub has been a great help. \n\ni'm now here to return the favor. i am going to share my entire experience and also answer any questions you may have if you are curious about what i did. i'm obviously by no means a seasoned professional, but seeing as i just finished my first paid shoot, i wanted to give details while it's still fresh in my mind.\n\nsome background--i am a food/product photographer. i've always shot for fun, but last month i decided to turn it into a side gig. i started an ig account and started to -----> tag !!!  all the restaurants i go to and taken their pictures at. i did not have a website or a portfolio, but my ig was a representation of my work.\n\ni approached a local brunch and catering spot about a week after i started my ig and asked if they were interested in meeting me to discuss shooting for their menu. they said yes. i immediately started researching.\n\ni had a lot of doubt about how much to charge, what i need to do, etc. i was very honest with her during my meeting and told her that i do not have any clients yet. after getting an idea of what she was looking for and what her budget is (always ask them what their budget is). she said her budget was limited and she was willing to pay in check/gift card. i told her i'd get back to her by the end of the day with a quote.\n\nnow, keep in mind...i have hardly any work to show for and i wanted to build my portfolio and gain experience and clientele. \n\ni quoted her the following: 2.5 hour shoot (2 hours during business time and 30 minutes at an evening catering event, because she wanted a couple of catered shots), 20-25 photos. my fee was $100 check and $100 in gift card. she accepted my offer.\n\ni've since finished the shoot, got paid (i got paid the day of the shoot) and i've delivered the photos. i ended up giving her 26 photos. same day of the shoot, i gave her a couple of sneak peaks. that being said, here are my takeaways from this first shoot.\n\npros:\n\n*she was amazing to work with and very easy going\n*she gave me complete creative freedom, i can shoot whatever i wanted.\n*thank god for multiple sd cards and batteries. i shot about 400 shots in 2 hours.\n*i'm able to use a variety of shots in my portfolio\n\ncons:\n\n*she didn't have a shot list, so it was difficult to gauge what she may want\n*biggest con: because the place is a small business, they can't shut down and make the food for me take shots of. i shot what was ordered by the guests and i had to shoot fast. i'm talking like 10-20 seconds to shoot it and then the waiter/waitress will take it to the customer. i think in the future, i will have to discuss this in advance in terms of what the restaurants are expecting in terms of quality. now that being said, the pro of this is that she gave me the freedom to shoot whatever and however, so she's not looking for anything specific. \n*with that, i also could not touch the food or re-plate the food/style the food. so i shot it as it came out.\n\noverall--i didn't get a variety of the dishes that i had hoped, because people ordered a lot of the same things. i am very happy with the result with the given situation (if i do say so myself). it was very challenging and time flew by because i was so busy.\n\nso, that's my experience with my first paid gig. any questions or comments?", "sortedWord": "None", "identifyer": 6830, "year": "2019"}, {"Unnamed: 0": 104420, "autor": "BazingaUA", "date": 1566931041000, "content": "This \"game\" brought me back to photography /!/ It's been almost a year since I went out to take some pictures. It was something that I was enjoying a lot - I would go out for hours and just take photos, after that I would spend even more time editing. But then something clicked and just didn't see anything through my lens. Everything became SO BORING. I tried a lot of things, but every time I would end up taking some cheesy photos that I didn't like and never even transferred them to my computer.\n\nSome time ago I found a huge collection of old photos of Toronto and came up with an idea (I know that people have done that in the past) of creating a collection of before/afters - and so [#OldNewTO](https://www.instagram.com/explore/tags/oldnewto/) was born.\n\nTaking photos is finally fun for me! I spend a lot of time (sometimes because these places changed quite a bit, I was looking for that [nice roof](https://www.instagram.com/p/B1WSVO1gz3s/) and couldn't figure out where it is :) ) walking around the city to find the places from old photos and try to match them as close as possible - angles, focal distance etc.\n\nAnd the best part about this - I'm not just taking photos of before/afters for this collection, while walking around the city I found a lot of great places and took some interesting photos. It also helped me have a new look on this city and learn lots of streets' names :)\n\nWere you ever in the situation where photography became boring and you just couldn't squeeze any creativity from yourself? What are methods of getting out of these creativity blocks? \n\nHere are some examples of before/afters that I've made: \n* [Bathurst and Queen, September 23, 1928](https://www.instagram.com/p/B1WSVO1gz3s/)\n\n* [St. Mary's Roman Catholic Church, Bathurst and Adelaide. Aug 26, 1956](https://www.instagram.com/p/B1RNrdoA4Qr/)\n\n* [King and Portland, between 1980 and 1998](https://www.instagram.com/p/B1Op6qAgUCl/)\n\n* [Front and Portland 1910](https://www.instagram.com/p/B1MtcpDAvlQ/)\n\n* [Massey-Harris buildings on Strachan looking north from Wellington, 1980s](https://www.instagram.com/p/B1bnP89FpuQ/)\n\n* [Queen Street West and Gore Vale Road, 1983](https://www.instagram.com/p/B1eFVBzA0gB/)\n\n* [Liberty and Dufferin, 1915](https://www.instagram.com/p/B1omtKCA7Ie/)\n\n* [Wellington and Portland, 1980s](https://www.instagram.com/p/B1mHrWxAwyS/)", "link": "https://www.reddit.com/r/photography/comments/cw8k52/this_game_brought_me_back_to_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "this \"game\" brought me back to photography /!/ it's been almost a year since i went out to take some pictures. it was something that i was enjoying a lot - i would go out for hours and just take photos, after that i would spend even more time editing. but then something clicked and just didn't see anything through my lens. everything became so boring. i tried a lot of things, but every time i would end up taking some cheesy photos that i didn't like and never even transferred them to my computer.\n\nsome time ago i found a huge collection of old photos of toronto and came up with an idea (i know that people have done that in the past) of creating a collection of before/afters - and so [#oldnewto](https://www.instagram.com/explore/-----> tags !!! /oldnewto/) was born.\n\ntaking photos is finally fun for me! i spend a lot of time (sometimes because these places changed quite a bit, i was looking for that [nice roof](https://www.instagram.com/p/b1wsvo1gz3s/) and couldn't figure out where it is :) ) walking around the city to find the places from old photos and try to match them as close as possible - angles, focal distance etc.\n\nand the best part about this - i'm not just taking photos of before/afters for this collection, while walking around the city i found a lot of great places and took some interesting photos. it also helped me have a new look on this city and learn lots of streets' names :)\n\nwere you ever in the situation where photography became boring and you just couldn't squeeze any creativity from yourself? what are methods of getting out of these creativity blocks? \n\nhere are some examples of before/afters that i've made: \n* [bathurst and queen, september 23, 1928](https://www.instagram.com/p/b1wsvo1gz3s/)\n\n* [st. mary's roman catholic church, bathurst and adelaide. aug 26, 1956](https://www.instagram.com/p/b1rnrdoa4qr/)\n\n* [king and portland, between 1980 and 1998](https://www.instagram.com/p/b1op6qagucl/)\n\n* [front and portland 1910](https://www.instagram.com/p/b1mtcpdavlq/)\n\n* [massey-harris buildings on strachan looking north from wellington, 1980s](https://www.instagram.com/p/b1bnp89fpuq/)\n\n* [queen street west and gore vale road, 1983](https://www.instagram.com/p/b1efvbza0gb/)\n\n* [liberty and dufferin, 1915](https://www.instagram.com/p/b1omtkca7ie/)\n\n* [wellington and portland, 1980s](https://www.instagram.com/p/b1mhrwxawys/)", "sortedWord": "None", "identifyer": 7257, "year": "2019"}, {"Unnamed: 0": 317526, "autor": "TheVanillaThrilla", "date": 1558757762000, "content": "Giving credit where credit is due /!/ Some background on the situation. I shot a local punk show where the headliner was from out of town. I posted to my Instagram and tagged the band in the pictures I took. A couple weeks later the band posted my picture to promote a show but gave not credit. What are your opinions on this and how would you approach this?", "link": "https://www.reddit.com/r/photography/comments/bsqgxy/giving_credit_where_credit_is_due/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "giving credit where credit is due /!/ some background on the situation. i shot a local punk show where the headliner was from out of town. i posted to my instagram and -----> tagged !!!  the band in the pictures i took. a couple weeks later the band posted my picture to promote a show but gave not credit. what are your opinions on this and how would you approach this?", "sortedWord": "None", "identifyer": 64663, "year": "2019"}, {"Unnamed: 0": 317791, "autor": "yckmiawtm", "date": 1571352314000, "content": "I'm an amateur and I want shadow a professional- hoping for some advice. /!/  \n\nHey everyone. First off I wanna say that I'm new here and I did see that there is an official questions thread, but after seeing some other questions and discussions posted to the main page I feel okay putting this here instead. I'd be happy to send it over to that thread if I need to.\n\nFor some background, I'm 19 years old and I've been interested in photography for about as long as I can remember. I'd like to think I'm more skilled than the average amateur. No, I don't have any social media directly showcasing my work, I don't really have a following or my own \"style,\" and sometimes I'll go for months without picking up my camera. ( Though a lot of that is for reasons outside of my control, which I'll explain in a bit.) I've dabbled in wildlife, landscapes, and a recent interest in urban exploration. I have a lot of head knowledge even if I can't always put it into practice with my limited equipment and opportunities. I'm plenty familiar with manual mode, lightroom, etc. Trouble is I feel like I've run out of things to do.\n\nSo today I made a sort of spur of the moment decision that I want to contact a local photographer (who I've never met or interacted with) and ask if I could tag along with her to gain some new experiences. I was hoping for some advice on what I should say when I initially contact her. I need a little input because I'm not great at meeting new people. I come on either too strong or too flat. I know that a simple rejection is the worst thing that could happen and that I've got nothing to lose, but I also want to increase my chances of getting the opportunity.\n\nShe does mostly wedding and senior portraits which I have absolutely no history with and that's why I want to pursue it. You see, one of the things that is out of my control is my controlling parents (that I still live with.) I was homeschooled and I don't really have any friends that I could practice with and I can't exactly \\*go\\* anywhere to explore new landscapes and interesting places. After seven years doing the same thing over and over again, I feel like my creativity is running dry. I've always wanted to be able to pick up my camera and head out with a group of friends and take photos for the fun of it- whether candid or directed. And I've never once been able to do that.\n\nTruth be told, it's really time that I get myself into gear and start thinking about my future anyway. I have a limited time left that I'll be able to live with my parents (long story.) I actually like my boring, entry level job but it'll be hard to make a living off of it. I haven't pursued college because of disapproving parents/no other support system. Besides, photography is the only route that's ever felt \"right\" for me. I think this sort of thing would be a great chance for me to explore what I can do and reinvigorate the love I know is still there. The excitement I felt upon purchasing my first dslr.\n\nSo like... What do I even say to her? The only relevant equipment I have is a canon rebel sl1 and its kit lens. I know it isn't much but at least it's something. I've really got no knowledge of lighting gear but I really tend to favor outdoor, naturally lit scenes anyway (which is mostly what this photographer does.) Some people are crazy good at shooting portraits outside in harsh light and it blows my mind- I wanna be able to do that. Should I mention my \"gear\" right away? I'll link her to my instagram page (the only social media platform I use) which is mostly photography but also a smattering of personal photos. Probably not very impressive (I'd be happy to share with anyone that's interested- shoot me a dm or leave a comment and I'll sent it your way. I'd rather not post it here.) Of course I'll offer to meet her in person first. I'm probably overthinking this but that's what I'm good at.\n\nThanks for the help!", "link": "https://www.reddit.com/r/photography/comments/dje32q/im_an_amateur_and_i_want_shadow_a_professional/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i'm an amateur and i want shadow a professional- hoping for some advice. /!/  \n\nhey everyone. first off i wanna say that i'm new here and i did see that there is an official questions thread, but after seeing some other questions and discussions posted to the main page i feel okay putting this here instead. i'd be happy to send it over to that thread if i need to.\n\nfor some background, i'm 19 years old and i've been interested in photography for about as long as i can remember. i'd like to think i'm more skilled than the average amateur. no, i don't have any social media directly showcasing my work, i don't really have a following or my own \"style,\" and sometimes i'll go for months without picking up my camera. ( though a lot of that is for reasons outside of my control, which i'll explain in a bit.) i've dabbled in wildlife, landscapes, and a recent interest in urban exploration. i have a lot of head knowledge even if i can't always put it into practice with my limited equipment and opportunities. i'm plenty familiar with manual mode, lightroom, etc. trouble is i feel like i've run out of things to do.\n\nso today i made a sort of spur of the moment decision that i want to contact a local photographer (who i've never met or interacted with) and ask if i could -----> tag !!!  along with her to gain some new experiences. i was hoping for some advice on what i should say when i initially contact her. i need a little input because i'm not great at meeting new people. i come on either too strong or too flat. i know that a simple rejection is the worst thing that could happen and that i've got nothing to lose, but i also want to increase my chances of getting the opportunity.\n\nshe does mostly wedding and senior portraits which i have absolutely no history with and that's why i want to pursue it. you see, one of the things that is out of my control is my controlling parents (that i still live with.) i was homeschooled and i don't really have any friends that i could practice with and i can't exactly \\*go\\* anywhere to explore new landscapes and interesting places. after seven years doing the same thing over and over again, i feel like my creativity is running dry. i've always wanted to be able to pick up my camera and head out with a group of friends and take photos for the fun of it- whether candid or directed. and i've never once been able to do that.\n\ntruth be told, it's really time that i get myself into gear and start thinking about my future anyway. i have a limited time left that i'll be able to live with my parents (long story.) i actually like my boring, entry level job but it'll be hard to make a living off of it. i haven't pursued college because of disapproving parents/no other support system. besides, photography is the only route that's ever felt \"right\" for me. i think this sort of thing would be a great chance for me to explore what i can do and reinvigorate the love i know is still there. the excitement i felt upon purchasing my first dslr.\n\nso like... what do i even say to her? the only relevant equipment i have is a canon rebel sl1 and its kit lens. i know it isn't much but at least it's something. i've really got no knowledge of lighting gear but i really tend to favor outdoor, naturally lit scenes anyway (which is mostly what this photographer does.) some people are crazy good at shooting portraits outside in harsh light and it blows my mind- i wanna be able to do that. should i mention my \"gear\" right away? i'll link her to my instagram page (the only social media platform i use) which is mostly photography but also a smattering of personal photos. probably not very impressive (i'd be happy to share with anyone that's interested- shoot me a dm or leave a comment and i'll sent it your way. i'd rather not post it here.) of course i'll offer to meet her in person first. i'm probably overthinking this but that's what i'm good at.\n\nthanks for the help!", "sortedWord": "None", "identifyer": 64934, "year": "2019"}, {"Unnamed: 0": 317995, "autor": "mythrowawaysilly", "date": 1574469266000, "content": "Friend is a DJ with a lot of house party gigs and I want to tag along. Is that a good idea? /!/ I ran it by him and he's cool with it. \n\nHere's what I have in mind. Go to the parties with him and get permission from the host to walk around and take pictures unofficially. At the end of the night of they like any of the pictures we can discuss pricing. \n\nI want to do this mostly for experience and if it works out create a customer base. \n\nI'd be shooting with a Canon T5i and the lenses I have are the kit lens 18-55mm and a 75-300mm and a brewery flash. \n\nIf you guys don't think this is a bad idea do you have any tips or suggestions? Most parties he does are outside at night with not so great lighting. \n\nThanks in advance.", "link": "https://www.reddit.com/r/photography/comments/e0a8r4/friend_is_a_dj_with_a_lot_of_house_party_gigs_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "friend is a dj with a lot of house party gigs and i want to -----> tag !!!  along. is that a good idea? /!/ i ran it by him and he's cool with it. \n\nhere's what i have in mind. go to the parties with him and get permission from the host to walk around and take pictures unofficially. at the end of the night of they like any of the pictures we can discuss pricing. \n\ni want to do this mostly for experience and if it works out create a customer base. \n\ni'd be shooting with a canon t5i and the lenses i have are the kit lens 18-55mm and a 75-300mm and a brewery flash. \n\nif you guys don't think this is a bad idea do you have any tips or suggestions? most parties he does are outside at night with not so great lighting. \n\nthanks in advance.", "sortedWord": "None", "identifyer": 65147, "year": "2019"}, {"Unnamed: 0": 318455, "autor": "tuf14163", "date": 1552438182000, "content": "Winogram /!/ Can somebody who is organized and has time please make a Garry winogrand instagram id follow the hashtag if a buncha like thirsty nobody’s didn’t tag their own photos with it", "link": "https://www.reddit.com/r/photography/comments/b0fnie/winogram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "winogram /!/ can somebody who is organized and has time please make a garry winogrand instagram id follow the hashtag if a buncha like thirsty nobody’s didn’t -----> tag !!!  their own photos with it", "sortedWord": "None", "identifyer": 65625, "year": "2019"}, {"Unnamed: 0": 319963, "autor": "FrenchOnionDip2", "date": 1575989316000, "content": "I picked up this Olympus 50mm f1.4 lens from a local camera shop. It didn't have a price tag so they sold it to me for $30. How'd I do?", "link": "https://www.reddit.com/r/photography/comments/e8riln/i_picked_up_this_olympus_50mm_f14_lens_from_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i picked up this olympus 50mm f1.4 lens from a local camera shop. it didn't have a price -----> tag !!!  so they sold it to me for $30. how'd i do?", "sortedWord": "None", "identifyer": 67182, "year": "2019"}, {"Unnamed: 0": 320155, "autor": "lowpockets", "date": 1553899886000, "content": "Selling prints through Instagram. /!/ So tonight I sold my first print through Instagram and I'm slightly taken back. \n\nI was collecting a piece from the framers that I am hoping to submit to a show and snapped a quick shot to throw up on my feed just to tag/thank the framer for doing a great job. \n\nIt's not a great shot of the image/piece by any stretch but it picked up a few likes/comments and I ended up getting a message off someone asking for one.\n\nWhat gets me is just the randomness of this. I have posted pictures of landscapes/abstract water etc but never got so much as an enquiry and yet this one was picked up on....\n\nIs there anyone out there who actually sells a bit through Instagram who would like to share their approach/experience?", "link": "https://www.reddit.com/r/photography/comments/b73vlp/selling_prints_through_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "selling prints through instagram. /!/ so tonight i sold my first print through instagram and i'm slightly taken back. \n\ni was collecting a piece from the framers that i am hoping to submit to a show and snapped a quick shot to throw up on my feed just to -----> tag !!! /thank the framer for doing a great job. \n\nit's not a great shot of the image/piece by any stretch but it picked up a few likes/comments and i ended up getting a message off someone asking for one.\n\nwhat gets me is just the randomness of this. i have posted pictures of landscapes/abstract water etc but never got so much as an enquiry and yet this one was picked up on....\n\nis there anyone out there who actually sells a bit through instagram who would like to share their approach/experience?", "sortedWord": "None", "identifyer": 67382, "year": "2019"}, {"Unnamed: 0": 321672, "autor": "CoopersPhotography", "date": 1561010445000, "content": "On my rocket [ Tag @Coopersgamephotography if reposting on Instagram ]", "link": "https://www.reddit.com/r/photography/comments/c2sah3/on_my_rocket_tag_coopersgamephotography_if/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "on my rocket [ -----> tag !!!  @coopersgamephotography if reposting on instagram ]", "sortedWord": "None", "identifyer": 68959, "year": "2019"}, {"Unnamed: 0": 323035, "autor": "DrCardboardBox69", "date": 1567272913000, "content": "Difficulty landing a photo job, am I doing something wrong? /!/ Title says it all, I’m not trying to land a gig as a natgeo photographer or photojournalist since those are mostly contracted out (would be nice though), but I majored in fine arts and photography in college, 8 years of photo experience, about 6 doing landscape/wildlife/adventure photography and deep knowledge of Lightroom and photoshop and yet I can’t even get a second look from employers for even part time photo editing jobs . I feel like my the main thing holding me back is my lack of experience in the photography job market since, aside from my college major and an internship, my job experience is not photography related at all. \n\nAny of y’all fine folks have any advice to get my foot in the door and start a career doing anything photography related? I have a portfolio through wix but due to money I can’t even afford the cheapest plan to have my own domain without the wix tag being attached to it.", "link": "https://www.reddit.com/r/photography/comments/cxy62s/difficulty_landing_a_photo_job_am_i_doing/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "difficulty landing a photo job, am i doing something wrong? /!/ title says it all, i’m not trying to land a gig as a natgeo photographer or photojournalist since those are mostly contracted out (would be nice though), but i majored in fine arts and photography in college, 8 years of photo experience, about 6 doing landscape/wildlife/adventure photography and deep knowledge of lightroom and photoshop and yet i can’t even get a second look from employers for even part time photo editing jobs . i feel like my the main thing holding me back is my lack of experience in the photography job market since, aside from my college major and an internship, my job experience is not photography related at all. \n\nany of y’all fine folks have any advice to get my foot in the door and start a career doing anything photography related? i have a portfolio through wix but due to money i can’t even afford the cheapest plan to have my own domain without the wix -----> tag !!!  being attached to it.", "sortedWord": "None", "identifyer": 70364, "year": "2019"}, {"Unnamed: 0": 323896, "autor": "4acodmt92", "date": 1575904242000, "content": "Looking for automated way of identifying/tagging photos of patients with the angle it was taken from (front/left/right/etc) /!/ I work as a one man band video producer/content creator for a doctor's office and have about 27,000 patient photos that I'm trying to organize for use in making before and after graphics. Are there any tools out there that can use facial feature recognition to determine what angle a photo is taken from? All of the photos have virtually the same lighting and background and taken from the same views (front, left, right, 45 degrees in either direction) so I'm hoping this is something that is possible although I fully understand how specific and niche of a request this is. Any help would be appreciated.", "link": "https://www.reddit.com/r/photography/comments/e8b52d/looking_for_automated_way_of_identifyingtagging/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "looking for automated way of identifying/-----> tagging !!!  photos of patients with the angle it was taken from (front/left/right/etc) /!/ i work as a one man band video producer/content creator for a doctor's office and have about 27,000 patient photos that i'm trying to organize for use in making before and after graphics. are there any tools out there that can use facial feature recognition to determine what angle a photo is taken from? all of the photos have virtually the same lighting and background and taken from the same views (front, left, right, 45 degrees in either direction) so i'm hoping this is something that is possible although i fully understand how specific and niche of a request this is. any help would be appreciated.", "sortedWord": "None", "identifyer": 71274, "year": "2019"}, {"Unnamed: 0": 324922, "autor": "pchareth", "date": 1550422980000, "content": "I want to edit your photos! /!/ Hey everyone! Names Paul.\n\nI was recently inspired by one of Peter McKinnon’s videos where people sent him photos and he edited them. \n\nI think it’s cool to see how another photographer would manipulate your photos so I’m opening it up to you guys to have some fun. \n\nsend me your favorite raw photo from anywhere in the world and I’ll edit it for you and post it to my Instagram story and tag you.  \n\nThis is just for fun, wanted to try it out. I’d even be inclined to send you mine if you wanted to try mine. \n\nA good way for all of us to have some fun. Pm me and I’ll send you my email if your interested or let me know you’re interested and I’ll pm you! You must have IG to participate. ", "link": "https://www.reddit.com/r/photography/comments/armfdb/i_want_to_edit_your_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i want to edit your photos! /!/ hey everyone! names paul.\n\ni was recently inspired by one of peter mckinnon’s videos where people sent him photos and he edited them. \n\ni think it’s cool to see how another photographer would manipulate your photos so i’m opening it up to you guys to have some fun. \n\nsend me your favorite raw photo from anywhere in the world and i’ll edit it for you and post it to my instagram story and -----> tag !!!  you.  \n\nthis is just for fun, wanted to try it out. i’d even be inclined to send you mine if you wanted to try mine. \n\na good way for all of us to have some fun. pm me and i’ll send you my email if your interested or let me know you’re interested and i’ll pm you! you must have ig to participate. ", "sortedWord": "None", "identifyer": 72342, "year": "2019"}, {"Unnamed: 0": 325308, "autor": "Scerikse", "date": 1551952571000, "content": "Does there exist i photograph community like \"BlackBox\" for videographers? /!/ BlackBox is basically a service that uploads and appropriately tags all your chosen videos on to a number of stock photo sites. It is however, only for video. Does anyone know a site that does the equivalent for images?", "link": "https://www.reddit.com/r/photography/comments/ayaygy/does_there_exist_i_photograph_community_like/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "does there exist i photograph community like \"blackbox\" for videographers? /!/ blackbox is basically a service that uploads and appropriately -----> tags !!!  all your chosen videos on to a number of stock photo sites. it is however, only for video. does anyone know a site that does the equivalent for images?", "sortedWord": "None", "identifyer": 72739, "year": "2019"}, {"Unnamed: 0": 326067, "autor": "atpayne91", "date": 1548818725000, "content": "Hi all! I need your help encouraging my dad to pursue his photography hobby before he retires and starts driving us all crazy. /!/ For context, my dad was always the classic shutterbug at every family get together but in recent years he’s taken to diligently tagging along with the local fox hunting club (I live in the middle of horse country in Va — don’t worry no foxes are harmed here in the states..it’s basically getting dressed up and exercising your horses and the hounds) and snapping photos of the dogs/riders/horses. \n\nI thought it was just a way for him to kill some time until one of his photos got published for the cover of a local equestrian magazine and his face lit up like a kid at Christmas. He was so proud. \n\nHe’s hitting retirement age at this point and I would love to help encourage him to pursue photography in a serious way. What resources, specifically books/photographers/portfolios, would you all recommend as gift ideas to help a beginner learn the basics of professional photography and perhaps give him some ideas for subject matter? Thanks!", "link": "https://www.reddit.com/r/photography/comments/al8g93/hi_all_i_need_your_help_encouraging_my_dad_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "hi all! i need your help encouraging my dad to pursue his photography hobby before he retires and starts driving us all crazy. /!/ for context, my dad was always the classic shutterbug at every family get together but in recent years he’s taken to diligently -----> tagging !!!  along with the local fox hunting club (i live in the middle of horse country in va — don’t worry no foxes are harmed here in the states..it’s basically getting dressed up and exercising your horses and the hounds) and snapping photos of the dogs/riders/horses. \n\ni thought it was just a way for him to kill some time until one of his photos got published for the cover of a local equestrian magazine and his face lit up like a kid at christmas. he was so proud. \n\nhe’s hitting retirement age at this point and i would love to help encourage him to pursue photography in a serious way. what resources, specifically books/photographers/portfolios, would you all recommend as gift ideas to help a beginner learn the basics of professional photography and perhaps give him some ideas for subject matter? thanks!", "sortedWord": "None", "identifyer": 73524, "year": "2019"}, {"Unnamed: 0": 326126, "autor": "Pooch76", "date": 1548773734000, "content": "Organizing &amp; Managing Huge Amounts of Media? Advice Welcome. /!/ Been a professional for \\~11 years and have amassed a ton of images &amp; some video.  Since inception it's all just been organized by a folder structure on the NAS: Media type first (Photo vs Video), then category of shoot (Events, Portraits,  etc) then by Date (w regular clients having their own sub-folders under each category).  It works but is \\*impossible\\* to do w consistent elegance.  If a client usually has events, but then i do a random portrait shoot for them, I'm supposed to break them up instead of staying under the client folder (and i usually do thru gritted teeth). Then what if i also shoot just a little B-roll at their one event?  it would be dumb to not include that in the same folder, but then i add a shortcut to the Video folder in case i go looking there first later on. The list goes on. The only other option I know of is to go browser-based DAM system, but thats quite a leap, and I'd probably hire someone to 'tag' all the images to make it worthwhile. What do y'all do?  I have one part-time person who also needs to access stuff on his own PC.", "link": "https://www.reddit.com/r/photography/comments/al0rf8/organizing_managing_huge_amounts_of_media_advice/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "organizing &amp; managing huge amounts of media? advice welcome. /!/ been a professional for \\~11 years and have amassed a ton of images &amp; some video.  since inception it's all just been organized by a folder structure on the nas: media type first (photo vs video), then category of shoot (events, portraits,  etc) then by date (w regular clients having their own sub-folders under each category).  it works but is \\*impossible\\* to do w consistent elegance.  if a client usually has events, but then i do a random portrait shoot for them, i'm supposed to break them up instead of staying under the client folder (and i usually do thru gritted teeth). then what if i also shoot just a little b-roll at their one event?  it would be dumb to not include that in the same folder, but then i add a shortcut to the video folder in case i go looking there first later on. the list goes on. the only other option i know of is to go browser-based dam system, but thats quite a leap, and i'd probably hire someone to '-----> tag !!! ' all the images to make it worthwhile. what do y'all do?  i have one part-time person who also needs to access stuff on his own pc.", "sortedWord": "None", "identifyer": 73585, "year": "2019"}, {"Unnamed: 0": 326417, "autor": "RealAlcibiad3s", "date": 1555912716000, "content": "Is the way eyeem decide which pictures are market worthy, partner worthy or not based upon an algorithm? /!/ It seems a bit arbitrary because I’ve uploaded a photo which was not selected for market one day and then the next day uploaded it again and it was selected for partner within one and a half hours of being uploaded. \nWith others they have made it into their partner collection whereas others with different categories but similar shots are sitting in review still. \nWas wondering whether their marketing decisions are based solely on an algorithm of the categories you tagged your photo with and how heavily edited it is (photos which look like a snapchat post are never going to be accepted because they are way too heavily edited to sell anywhere).", "link": "https://www.reddit.com/r/photography/comments/bfylye/is_the_way_eyeem_decide_which_pictures_are_market/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "is the way eyeem decide which pictures are market worthy, partner worthy or not based upon an algorithm? /!/ it seems a bit arbitrary because i’ve uploaded a photo which was not selected for market one day and then the next day uploaded it again and it was selected for partner within one and a half hours of being uploaded. \nwith others they have made it into their partner collection whereas others with different categories but similar shots are sitting in review still. \nwas wondering whether their marketing decisions are based solely on an algorithm of the categories you -----> tagged !!!  your photo with and how heavily edited it is (photos which look like a snapchat post are never going to be accepted because they are way too heavily edited to sell anywhere).", "sortedWord": "None", "identifyer": 73892, "year": "2019"}, {"Unnamed: 0": 326539, "autor": "MemesByJames", "date": 1556996256000, "content": "Help please /!/ I'm 15 and have developed an interest in photography. My friends really like my pictures but I feel they could be better. I'm just using my smart phone at the moment but i would like to get a good but cheap camera. Could anyone point me in the right direction? My phone camera has 12.2 Megapixels so I'm hoping for something with a bit more but a decent price tag attached", "link": "https://www.reddit.com/r/photography/comments/bkogo2/help_please/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "help please /!/ i'm 15 and have developed an interest in photography. my friends really like my pictures but i feel they could be better. i'm just using my smart phone at the moment but i would like to get a good but cheap camera. could anyone point me in the right direction? my phone camera has 12.2 megapixels so i'm hoping for something with a bit more but a decent price -----> tag !!!  attached", "sortedWord": "None", "identifyer": 74019, "year": "2019"}, {"Unnamed: 0": 326595, "autor": "CigarIsJustACigar", "date": 1556923362000, "content": "Living without Lightroom: How and why hobbyists can live without /!/ When I picked up photography again after a decade hiatus, I came to this subreddit for advice. One of the pieces of advice I kept reading over and over was to just get Lightroom. I now think this is terrible advice for a lot of hobbyists. Worse, in a strange sort of Stockholm syndrome, contrary opinions are shouted down. With the recent price hike, I'm hoping there's now more appetite for discussion.\n\n***\n\n# Good reasons to get Lightroom\n\n* You're a professional and have to ingest, sort, and batch edit hundreds or thousands of photos every week. You need a professional level DAM.\n* You have invested into the system. You have spent considerable time and energy learning the workflow, such that the costs of switching are considerable. Your library and edits are locked into this system.\n* You're a beginner, you have the money, and you'd rather make learning easy. Most tutorials and workshops are in LR. (Note, however, that the skills are mostly pretty transferable across software.)\n* You think the software is so superior that it justifies its enormous price tag.\n\n***\n\n# Bad reasons to get Lightroom\n\n* **\"It's cheap! PS and LR used to cost $1000 and now it's a lot less.\"**\n\n Yes, Adobe products used to cost hundreds of dollars and now it's more affordable. In 2019 dollars, MS Word used to cost $800, the Netscape browser cost $80, the Atari 2600 cost almost $900, etc. As you can see, this is insane reasoning for any other software category. The historical price of Space Invaders isn't that relevant to judging game prices today. A lot of free software released now would be worth thousands in the past. We don't live in the past; we live in a world where you can buy a lot of high-quality Adobe alternatives for about $50 each.\n\n* **\"It's cheap! In a hobby where people spend hundreds on lenses, it's crazy people care about $10/$20 a month!\"**\n\n This is just a non-sequitur. I'd rather have $10/mo than not. And it's also a bit insensitive to the many aspiring photographers who are in poorer countries or who are just broke. The US dollar trades very highly against other currencies. Besides, monthly costs are misleading...\n\n* **\"It's cheap! It's only $10/$20 a month!\"**\n\n Cost-per-month thinking is often misleading and sometimes downright financially illiterate. It's what car dealerships use to trick you into buying cars you wouldn't normally buy. Instead, it makes more sense to compare the cost of LR over the lifetime use of other software, for example over 4 years. (If you think that's unfair, use 3 or 5 years or whatever.)\n\n\n**4-year cost**\n\n| LR/C1 @ $10/mo | LR @ $20/mo | Affinity | Luminar | Pixelmator pro | PhotoMechanic | ACDSee |\n|:--|:--|:--| :-- | :-- | :-- | :-- |\n| 480 | 960 | 50 | 70 | 40 | 140 | 60 |\n\n\n As you can see, LR is not just a little bit more expensive. It's insane. Not to mention the fact that most of the other software goes on sale frequently. I haven't even mentioned the open source stuff for free. Check out digikam, rawtherapee or darktable. These are somewhat worse in the UX department, but are often just as powerful.\n\n* **\"Some people can't afford the upfront cost of other software, but can afford a low monthly fee.\"**\n\n If you're just starting out, you can save up money for 5 or 6 months and use free trials of different software. Put the money away that you would've spent on LR. That way, by the end of 6 months, you have some idea of what to buy and the money to buy it.\n\n\n***\n\n# Living without the library management of LR for $0\n\nIf you're just starting out, or just shoot on weekends, or don't shoot hundreds of photos a week, then you don't need Lightroom. (You also don't need it if you're a pro, obviously, but it's more reasonable.) But if you're like me, library management is the main reason to be reluctant to leave LR. I want to offer a simple alternative way to manage your library. With all the money you save on subscriptions, you can move on to more advanced systems later if you want.\n\n## 1. Folder structure\n\nMake a folder system in your computer or external drive with the following hierarchy: Year, Month, Event\n\n&gt; photo library\n&gt;&gt; 2019 \n&gt;&gt;&gt; 04 April\n&gt;&gt;&gt;&gt; Easter with kids\n\n&gt;&gt;&gt;&gt; Beach picnic\n\n&gt;&gt;&gt; 05 May\n&gt;&gt;&gt;&gt; Photo walk May 23\n\nRandom photos that don't belong in an event can be put in a folder named with the day (e.g. \"May 12\" or \"05 12\" or \"12\") or just left loose in the month folder. If you take street photography everyday, you can also make a \"street photography\" folder to gather all those together for the month. Don't worry, if you ever want to see all your photos in chronological order instead of as events, digikam or any management software will let you do that.\n\n## 2. Rename photos\n\nYou can use [digikam](https://www.digikam.org), a free open-source library manager, to import and batch rename files. Select all the photos in a given folder and then go to the menu: Item&gt;Rename. \n\nDigikam will use the EXIF data (the meta-data stored in the photo) to rename the files. Here's one suggestion: [date:\"yyyy-MM-dd\"]\\_[dir]\\_###[e]\n\nThis will produce a file that looks like this: *2019-04-20_Beach Picnic_001*\n\nIn other words: the date, the name of the directory, and the number of the photo in the order it was taken. Add another \\# if you have more than 999 photos in a folder.\n\n## 3. Sort and edit\n\nYou can use digikam to delete and rate photos. (It's a bit slow at this on mac, but honestly it's a pretty complete system.) If you're not taking hundreds of photos at a time, you can also sort using your file manager. The other free alternative is Adobe Bridge. Honestly, I hate adobe for hijacking my system resources even when the software isn't in use, but I hear Bridge has an excellent UX.\n\n***\n\nThe good thing about this system is that there's no lock-in. You can get any management app in the future, if you want, and your file structure will be totally preserved. You're also free to edit your images using any editor, since your editor is independent from library management.\n\nI'm *not* saying everyone should follow my advice. LR is totally great for lots of people. My claim is that the blanket advice to just get LR is terrible for many hobbyists. Now that I quit, I regret the two years of subscription I paid ($240) and the fact that my edits are held ransom. As software continues to get cheaper, and Adobe paradoxically maintains or increases their crazy price, the math will keep getting worse and worse.\n\nA lot of you will also say that this has been talked about to death. I disagree. Once upon a time, I was a beginner looking at this sub and found very little in-depth discussion on Lightroom alternatives. [The sub wiki](https://www.reddit.com/r/photography/wiki/index), though excellent, is also brief on the topic. I'm writing the post I wish I had read when I started. Even if you disagree, I hope this discussion will get one to better articulate why.", "link": "https://www.reddit.com/r/photography/comments/bkei1c/living_without_lightroom_how_and_why_hobbyists/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "living without lightroom: how and why hobbyists can live without /!/ when i picked up photography again after a decade hiatus, i came to this subreddit for advice. one of the pieces of advice i kept reading over and over was to just get lightroom. i now think this is terrible advice for a lot of hobbyists. worse, in a strange sort of stockholm syndrome, contrary opinions are shouted down. with the recent price hike, i'm hoping there's now more appetite for discussion.\n\n***\n\n# good reasons to get lightroom\n\n* you're a professional and have to ingest, sort, and batch edit hundreds or thousands of photos every week. you need a professional level dam.\n* you have invested into the system. you have spent considerable time and energy learning the workflow, such that the costs of switching are considerable. your library and edits are locked into this system.\n* you're a beginner, you have the money, and you'd rather make learning easy. most tutorials and workshops are in lr. (note, however, that the skills are mostly pretty transferable across software.)\n* you think the software is so superior that it justifies its enormous price -----> tag !!! .\n\n***\n\n# bad reasons to get lightroom\n\n* **\"it's cheap! ps and lr used to cost $1000 and now it's a lot less.\"**\n\n yes, adobe products used to cost hundreds of dollars and now it's more affordable. in 2019 dollars, ms word used to cost $800, the netscape browser cost $80, the atari 2600 cost almost $900, etc. as you can see, this is insane reasoning for any other software category. the historical price of space invaders isn't that relevant to judging game prices today. a lot of free software released now would be worth thousands in the past. we don't live in the past; we live in a world where you can buy a lot of high-quality adobe alternatives for about $50 each.\n\n* **\"it's cheap! in a hobby where people spend hundreds on lenses, it's crazy people care about $10/$20 a month!\"**\n\n this is just a non-sequitur. i'd rather have $10/mo than not. and it's also a bit insensitive to the many aspiring photographers who are in poorer countries or who are just broke. the us dollar trades very highly against other currencies. besides, monthly costs are misleading...\n\n* **\"it's cheap! it's only $10/$20 a month!\"**\n\n cost-per-month thinking is often misleading and sometimes downright financially illiterate. it's what car dealerships use to trick you into buying cars you wouldn't normally buy. instead, it makes more sense to compare the cost of lr over the lifetime use of other software, for example over 4 years. (if you think that's unfair, use 3 or 5 years or whatever.)\n\n\n**4-year cost**\n\n| lr/c1 @ $10/mo | lr @ $20/mo | affinity | luminar | pixelmator pro | photomechanic | acdsee |\n|:--|:--|:--| :-- | :-- | :-- | :-- |\n| 480 | 960 | 50 | 70 | 40 | 140 | 60 |\n\n\n as you can see, lr is not just a little bit more expensive. it's insane. not to mention the fact that most of the other software goes on sale frequently. i haven't even mentioned the open source stuff for free. check out digikam, rawtherapee or darktable. these are somewhat worse in the ux department, but are often just as powerful.\n\n* **\"some people can't afford the upfront cost of other software, but can afford a low monthly fee.\"**\n\n if you're just starting out, you can save up money for 5 or 6 months and use free trials of different software. put the money away that you would've spent on lr. that way, by the end of 6 months, you have some idea of what to buy and the money to buy it.\n\n\n***\n\n# living without the library management of lr for $0\n\nif you're just starting out, or just shoot on weekends, or don't shoot hundreds of photos a week, then you don't need lightroom. (you also don't need it if you're a pro, obviously, but it's more reasonable.) but if you're like me, library management is the main reason to be reluctant to leave lr. i want to offer a simple alternative way to manage your library. with all the money you save on subscriptions, you can move on to more advanced systems later if you want.\n\n## 1. folder structure\n\nmake a folder system in your computer or external drive with the following hierarchy: year, month, event\n\n&gt; photo library\n&gt;&gt; 2019 \n&gt;&gt;&gt; 04 april\n&gt;&gt;&gt;&gt; easter with kids\n\n&gt;&gt;&gt;&gt; beach picnic\n\n&gt;&gt;&gt; 05 may\n&gt;&gt;&gt;&gt; photo walk may 23\n\nrandom photos that don't belong in an event can be put in a folder named with the day (e.g. \"may 12\" or \"05 12\" or \"12\") or just left loose in the month folder. if you take street photography everyday, you can also make a \"street photography\" folder to gather all those together for the month. don't worry, if you ever want to see all your photos in chronological order instead of as events, digikam or any management software will let you do that.\n\n## 2. rename photos\n\nyou can use [digikam](https://www.digikam.org), a free open-source library manager, to import and batch rename files. select all the photos in a given folder and then go to the menu: item&gt;rename. \n\ndigikam will use the exif data (the meta-data stored in the photo) to rename the files. here's one suggestion: [date:\"yyyy-mm-dd\"]\\_[dir]\\_###[e]\n\nthis will produce a file that looks like this: *2019-04-20_beach picnic_001*\n\nin other words: the date, the name of the directory, and the number of the photo in the order it was taken. add another \\# if you have more than 999 photos in a folder.\n\n## 3. sort and edit\n\nyou can use digikam to delete and rate photos. (it's a bit slow at this on mac, but honestly it's a pretty complete system.) if you're not taking hundreds of photos at a time, you can also sort using your file manager. the other free alternative is adobe bridge. honestly, i hate adobe for hijacking my system resources even when the software isn't in use, but i hear bridge has an excellent ux.\n\n***\n\nthe good thing about this system is that there's no lock-in. you can get any management app in the future, if you want, and your file structure will be totally preserved. you're also free to edit your images using any editor, since your editor is independent from library management.\n\ni'm *not* saying everyone should follow my advice. lr is totally great for lots of people. my claim is that the blanket advice to just get lr is terrible for many hobbyists. now that i quit, i regret the two years of subscription i paid ($240) and the fact that my edits are held ransom. as software continues to get cheaper, and adobe paradoxically maintains or increases their crazy price, the math will keep getting worse and worse.\n\na lot of you will also say that this has been talked about to death. i disagree. once upon a time, i was a beginner looking at this sub and found very little in-depth discussion on lightroom alternatives. [the sub wiki](https://www.reddit.com/r/photography/wiki/index), though excellent, is also brief on the topic. i'm writing the post i wish i had read when i started. even if you disagree, i hope this discussion will get one to better articulate why.", "sortedWord": "None", "identifyer": 74078, "year": "2019"}, {"Unnamed: 0": 326803, "autor": "doctorv33", "date": 1559319171000, "content": "A question on crop sensors /!/ I’ve recently started to get more and more into photography over the last few weeks. I’m off to a long road trip to the west coast (Yosemite, Sequoia, Grand Canyon, more) next week, so I’m trying to learn as much as I possibly can to get some moderately good images. \n\nI currently have a Canon 70D with one lens, the kit lens: 18-135mm f3.5. I guess it’s okay, which seems to be a consensus among most people. However, I want to buy another lens for my trip. \n\nI’ve been most interested in the Canon 50mm 1.8 and 1.4 because of the types of portraits they’re capable of capturing and also the moderate price tag. I know, though, that I have a crop sensor, so before I make an investment, I want to make sure that this is a good idea. \n\nI plan on eventually buying a full frame, but right now I’m learning so I’m ok with the crop. \n\nDo any of you have experience with (or an opinion on) a 50mm 1.4 (or 1.8) on a crop sensor? I’m willing to put out the extra money on the 1.4 if it’s worth it.", "link": "https://www.reddit.com/r/photography/comments/bv9hlk/a_question_on_crop_sensors/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "a question on crop sensors /!/ i’ve recently started to get more and more into photography over the last few weeks. i’m off to a long road trip to the west coast (yosemite, sequoia, grand canyon, more) next week, so i’m trying to learn as much as i possibly can to get some moderately good images. \n\ni currently have a canon 70d with one lens, the kit lens: 18-135mm f3.5. i guess it’s okay, which seems to be a consensus among most people. however, i want to buy another lens for my trip. \n\ni’ve been most interested in the canon 50mm 1.8 and 1.4 because of the types of portraits they’re capable of capturing and also the moderate price -----> tag !!! . i know, though, that i have a crop sensor, so before i make an investment, i want to make sure that this is a good idea. \n\ni plan on eventually buying a full frame, but right now i’m learning so i’m ok with the crop. \n\ndo any of you have experience with (or an opinion on) a 50mm 1.4 (or 1.8) on a crop sensor? i’m willing to put out the extra money on the 1.4 if it’s worth it.", "sortedWord": "None", "identifyer": 74291, "year": "2019"}, {"Unnamed: 0": 328496, "autor": "placido-bolivar", "date": 1564785418000, "content": "I am done with Instagram. /!/ The title says it all...thats it...no more Instagram photo page for me, i have tried and i dont think its worth it anymore...so many awful photos out there with profiles with thousands of followers, i feel like my work is just shit suddenly...you have to be active, you have to comment, you have to like things, you have to use specific tags and so much more...quite frankly, i am too old for this shit...so, i just deleted my account...no more of the for me...i think all of this is somewhat fake, i dont know...i d rather, do what i do for me first and everything else comes as second or less important.", "link": "https://www.reddit.com/r/photography/comments/clb0zb/i_am_done_with_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "i am done with instagram. /!/ the title says it all...thats it...no more instagram photo page for me, i have tried and i dont think its worth it anymore...so many awful photos out there with profiles with thousands of followers, i feel like my work is just shit suddenly...you have to be active, you have to comment, you have to like things, you have to use specific -----> tags !!!  and so much more...quite frankly, i am too old for this shit...so, i just deleted my account...no more of the for me...i think all of this is somewhat fake, i dont know...i d rather, do what i do for me first and everything else comes as second or less important.", "sortedWord": "None", "identifyer": 76057, "year": "2019"}, {"Unnamed: 0": 328654, "autor": "steakhouseNL", "date": 1568822977000, "content": "Search image online through metadata (copyright) /!/ Everyone, I've been stupid. Put my $6000 DSLR somewhere, got called, distracted, got back and it was gone. Not insured.\n\nBut. I did fill in the copyright tag, so every picture taken (and even edited) will have this information. Is there a way to search for photography online using the right tag?\n\nSuper stupid of me. Hoped for an honest finder, but that hope is kinda gone.\n\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/d5zzxx/search_image_online_through_metadata_copyright/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "search image online through metadata (copyright) /!/ everyone, i've been stupid. put my $6000 dslr somewhere, got called, distracted, got back and it was gone. not insured.\n\nbut. i did fill in the copyright -----> tag !!! , so every picture taken (and even edited) will have this information. is there a way to search for photography online using the right tag?\n\nsuper stupid of me. hoped for an honest finder, but that hope is kinda gone.\n\nthanks in advance!", "sortedWord": "None", "identifyer": 76220, "year": "2019"}, {"Unnamed: 0": 330062, "autor": "OhMerxy", "date": 1567880407000, "content": "Me and my friends are creating an Instagram account for new and experienced photographers. You can send in your pictures or tag us and as long ass you follow us we will upload it for free.", "link": "https://www.reddit.com/r/photography/comments/d0zjtx/me_and_my_friends_are_creating_an_instagram/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "me and my friends are creating an instagram account for new and experienced photographers. you can send in your pictures or -----> tag !!!  us and as long ass you follow us we will upload it for free.", "sortedWord": "None", "identifyer": 77691, "year": "2019"}, {"Unnamed: 0": 330372, "autor": "__cypher", "date": 1572657616000, "content": "Is this a scam? /!/ I got a message regarding being featured in a magazine on Instagram after tagging the magazine in a photo I posted. I'm by no means a good photographer and the publication seems pretty aesthetically pleasing so I'm confused why they would even want to have me in it. \n\nThe publication said I would have to purchase vol. 1 ($10) to get a better understanding of the layout to be featured on their instagram as an artist and to work with them in getting my photos on vol. 2. The publication is independently run and ad free, so there was not too much info I could go off of other than their decently sized instagram following. My friend said I should just yolo it but I can't tell if I'm being scammed lmaooo", "link": "https://www.reddit.com/r/photography/comments/dqdm4p/is_this_a_scam/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "is this a scam? /!/ i got a message regarding being featured in a magazine on instagram after -----> tagging !!!  the magazine in a photo i posted. i'm by no means a good photographer and the publication seems pretty aesthetically pleasing so i'm confused why they would even want to have me in it. \n\nthe publication said i would have to purchase vol. 1 ($10) to get a better understanding of the layout to be featured on their instagram as an artist and to work with them in getting my photos on vol. 2. the publication is independently run and ad free, so there was not too much info i could go off of other than their decently sized instagram following. my friend said i should just yolo it but i can't tell if i'm being scammed lmaooo", "sortedWord": "None", "identifyer": 78018, "year": "2019"}, {"Unnamed: 0": 331103, "autor": "PicsChaser", "date": 1576989320000, "content": "Internal catalog in Capture One - Am I making a mistake? /!/ I realize that this is more of a question for /r/captureone, but I want to get other viewpoints as well.\n\nSome time ago, frustrated with sync issues with unmanaged images (images residing in the hard drive), I decided to move images into the catalog. This is an internal database (or rather a hidden folder structure) similar to what Aperture and Photos on the Mac do. Once they're there, they are not accessible from any file system browser.\n\nFor those using Capture One, I decided for a big catalog instead of sessions because I like to have access to all my pictures. Sessions don't fit my workflow, at least for 99% of what I do.\n\nHaving the images in a catalog has several advantages: No sync issues, images can be in more than one collection at a time, etc.\n\nI started the process of painstakingly migrating the images one folder at a time, making sure they're correctly tagged, etc., but I'm having second thoughts about it. The main one is: What if one day I decide to abandon Capture One for whatever reason? I'm not sure if other programs will offer the option to migrate my whole catalog, and I can't even think of repeating the process of moving images out of the catalog one folder at a time. On the other hand, leaving the images on my hard drive means that I will need to keep enduring the sync issues I currently experience. As far as I know, the latest version of the software hasn't fixed the issues I experienced. I moved from Lightroom a few years ago because of the whole subscription issue, so it feels wrong to get back to it, esp. since I keep hearing about performance issues and how superior Capture One is regarding color management. I evaluated some free and paid alternatives, but nothing jumped out as the superior choice, so I'm kind of lost.\n\nOpinions?", "link": "https://www.reddit.com/r/photography/comments/ee0ioq/internal_catalog_in_capture_one_am_i_making_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "internal catalog in capture one - am i making a mistake? /!/ i realize that this is more of a question for /r/captureone, but i want to get other viewpoints as well.\n\nsome time ago, frustrated with sync issues with unmanaged images (images residing in the hard drive), i decided to move images into the catalog. this is an internal database (or rather a hidden folder structure) similar to what aperture and photos on the mac do. once they're there, they are not accessible from any file system browser.\n\nfor those using capture one, i decided for a big catalog instead of sessions because i like to have access to all my pictures. sessions don't fit my workflow, at least for 99% of what i do.\n\nhaving the images in a catalog has several advantages: no sync issues, images can be in more than one collection at a time, etc.\n\ni started the process of painstakingly migrating the images one folder at a time, making sure they're correctly -----> tagged !!! , etc., but i'm having second thoughts about it. the main one is: what if one day i decide to abandon capture one for whatever reason? i'm not sure if other programs will offer the option to migrate my whole catalog, and i can't even think of repeating the process of moving images out of the catalog one folder at a time. on the other hand, leaving the images on my hard drive means that i will need to keep enduring the sync issues i currently experience. as far as i know, the latest version of the software hasn't fixed the issues i experienced. i moved from lightroom a few years ago because of the whole subscription issue, so it feels wrong to get back to it, esp. since i keep hearing about performance issues and how superior capture one is regarding color management. i evaluated some free and paid alternatives, but nothing jumped out as the superior choice, so i'm kind of lost.\n\nopinions?", "sortedWord": "None", "identifyer": 78772, "year": "2019"}, {"Unnamed: 0": 331572, "autor": "danger0usd1sc0", "date": 1575819426000, "content": "Community-based photography project - looking for free website hosting and customisation. eg Wordpress. /!/ I'm looking for some kind of free website &amp; hosting solution for a community photography project.\n\nIt would be an entirely gallery driven website that could be filtered by tags on the images.\n\nI've had a look at the free Wordpress website creator and hosting, but it doesn't appear to be particularly gallery-friendly - more for blog-driven sites.\n\nIt has to be a website with its own domain name (though, for example, [www.wordpress.xxxxxx.com](https://www.wordpress.xxxxxx.com) would be OK) rather than something like Flickr - does anyone have any suggestions?", "link": "https://www.reddit.com/r/photography/comments/e7v2k3/communitybased_photography_project_looking_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "community-based photography project - looking for free website hosting and customisation. eg wordpress. /!/ i'm looking for some kind of free website &amp; hosting solution for a community photography project.\n\nit would be an entirely gallery driven website that could be filtered by -----> tags !!!  on the images.\n\ni've had a look at the free wordpress website creator and hosting, but it doesn't appear to be particularly gallery-friendly - more for blog-driven sites.\n\nit has to be a website with its own domain name (though, for example, [www.wordpress.xxxxxx.com](https://www.wordpress.xxxxxx.com) would be ok) rather than something like flickr - does anyone have any suggestions?", "sortedWord": "None", "identifyer": 79261, "year": "2019"}, {"Unnamed: 0": 331686, "autor": "noriumiego", "date": 1554837944000, "content": "Portraits: What determines the price tag that some photographers put on portraits /!/ The usual cost of a portrait around here (Lithuania) by a good photographer is 150 euro. Anything lower than that, I can understand, because oftentimes the quality differs greatly. However, what about photographers that charge 250, 300 euro and upwards? What comes into play here?\n\nUsually their equipment and photo editing skills wouldn't differ greatly from those that charge 150 euro. Is it mostly the name of the photographer, the fact that they might have shot for big celebrities and magazines, that allowed them to place a higher price tag on their photography work?", "link": "https://www.reddit.com/r/photography/comments/bbc5up/portraits_what_determines_the_price_tag_that_some/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "portraits: what determines the price -----> tag !!!  that some photographers put on portraits /!/ the usual cost of a portrait around here (lithuania) by a good photographer is 150 euro. anything lower than that, i can understand, because oftentimes the quality differs greatly. however, what about photographers that charge 250, 300 euro and upwards? what comes into play here?\n\nusually their equipment and photo editing skills wouldn't differ greatly from those that charge 150 euro. is it mostly the name of the photographer, the fact that they might have shot for big celebrities and magazines, that allowed them to place a higher price tag on their photography work?", "sortedWord": "None", "identifyer": 79376, "year": "2019"}, {"Unnamed: 0": 332466, "autor": "spunkgobbler", "date": 1554496401000, "content": "DigiKam is so slow!!! /!/ Quad core, 16GB RAM, 1060 GTX, SSD.   \n\n\nHalf a million photos (230 gigs) sitting on the SSD. Just switching between Tags or deleting a photo causes Digikam to hang. I tried deleted the database and rebuilding...and it has been running for over 9 hours and it is only at 34% finding new items.\n\n&amp;#x200B;\n\nHow to speed Digikam up?!", "link": "https://www.reddit.com/r/photography/comments/b9wajx/digikam_is_so_slow/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "digikam is so slow!!! /!/ quad core, 16gb ram, 1060 gtx, ssd.   \n\n\nhalf a million photos (230 gigs) sitting on the ssd. just switching between -----> tags !!!  or deleting a photo causes digikam to hang. i tried deleted the database and rebuilding...and it has been running for over 9 hours and it is only at 34% finding new items.\n\n&amp;#x200b;\n\nhow to speed digikam up?!", "sortedWord": "None", "identifyer": 80194, "year": "2019"}, {"Unnamed: 0": 332667, "autor": "OriginalHDz", "date": 1553065102000, "content": "Is the sigma 24mm 1.4 lens worth it’s hefty price tag? /!/ Title says it all. ", "link": "https://www.reddit.com/r/photography/comments/b38t3v/is_the_sigma_24mm_14_lens_worth_its_hefty_price/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is the sigma 24mm 1.4 lens worth it’s hefty price -----> tag !!! ? /!/ title says it all. ", "sortedWord": "None", "identifyer": 80403, "year": "2019"}, {"Unnamed: 0": 332710, "autor": "Chris_4ever", "date": 1553022498000, "content": "Favourite black and white photographers? /!/ I've always gotten a lot of love for my black and white shots, so I created a separate instagram for them and am looking for some others who shoot primarily b/w to follow.\n\nPlease, suggest away! \n\nAlso, for my fellow b/w photographers, any good IG accounts to tag in photos to try and get some extra love?", "link": "https://www.reddit.com/r/photography/comments/b31g0x/favourite_black_and_white_photographers/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "favourite black and white photographers? /!/ i've always gotten a lot of love for my black and white shots, so i created a separate instagram for them and am looking for some others who shoot primarily b/w to follow.\n\nplease, suggest away! \n\nalso, for my fellow b/w photographers, any good ig accounts to -----> tag !!!  in photos to try and get some extra love?", "sortedWord": "None", "identifyer": 80449, "year": "2019"}, {"Unnamed: 0": 332849, "autor": "EnjoyFotos", "date": 1549468080000, "content": "Machine-learning Autofocus vs. Database-driven Metering /!/ In talking about their new EM1X, Olympus says each mode of its AI autofocus contains tens of thousands of manually tagged images from which the camera \"learns\" how to identify a specific subject. Very neat. \n\nBut for many years, camera manufacturers have used databases of tens of thousands of images in their metering systems ([for instance](https://www.nikonusa.com/en/learn-and-explore/a/products-and-innovation/3d-color-matrix-metering-ii.html)), comparing what the metering sensor sees to the database in order to determine the optimal exposure. \n\nI'm no computer scientist, but these two things seem very similar to me. Why is Olympus (and soon everyone else I'm sure) so cutting edge?", "link": "https://www.reddit.com/r/photography/comments/anrzr8/machinelearning_autofocus_vs_databasedriven/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "machine-learning autofocus vs. database-driven metering /!/ in talking about their new em1x, olympus says each mode of its ai autofocus contains tens of thousands of manually -----> tagged !!!  images from which the camera \"learns\" how to identify a specific subject. very neat. \n\nbut for many years, camera manufacturers have used databases of tens of thousands of images in their metering systems ([for instance](https://www.nikonusa.com/en/learn-and-explore/a/products-and-innovation/3d-color-matrix-metering-ii.html)), comparing what the metering sensor sees to the database in order to determine the optimal exposure. \n\ni'm no computer scientist, but these two things seem very similar to me. why is olympus (and soon everyone else i'm sure) so cutting edge?", "sortedWord": "None", "identifyer": 80592, "year": "2019"}, {"Unnamed: 0": 333186, "autor": "jaclyn02n", "date": 1550199357000, "content": "Thanks for the tag /!/ Here's to the hundreds of clients posting their couple pictures and not tagging me on social media. Thanks guys.", "link": "https://www.reddit.com/r/photography/comments/aqs1ve/thanks_for_the_tag/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "thanks for the tag /!/ here's to the hundreds of clients posting their couple pictures and not -----> tagging !!!  me on social media. thanks guys.", "sortedWord": "None", "identifyer": 80940, "year": "2019"}, {"Unnamed: 0": 334444, "autor": "sunsetsur4", "date": 1546488508000, "content": "Managing photos /!/ Hi All,\n\nI have about 60,000 photos I have basically dumped onto a 1 TB Seagate external hard drive for a Mac. Any advice on how I might manage these? I'd like to start to work on some of them in Lightroom, but my Mac does not have a lot of space. I have another 1 TB Seagate external hard drive I can use.\n\nAlso, how incredibly frustrating is it that Apple does not transfer the favorite tag and edits when importing into Apple Photos if you're not paying for iCloud Storage? Any work arounds for this? \n\nI have a bunch of other photos stored on a PC configured external that I'll deal with another time.\n\nThanks in advance for any advice!", "link": "https://www.reddit.com/r/photography/comments/ac1rfv/managing_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "managing photos /!/ hi all,\n\ni have about 60,000 photos i have basically dumped onto a 1 tb seagate external hard drive for a mac. any advice on how i might manage these? i'd like to start to work on some of them in lightroom, but my mac does not have a lot of space. i have another 1 tb seagate external hard drive i can use.\n\nalso, how incredibly frustrating is it that apple does not transfer the favorite -----> tag !!!  and edits when importing into apple photos if you're not paying for icloud storage? any work arounds for this? \n\ni have a bunch of other photos stored on a pc configured external that i'll deal with another time.\n\nthanks in advance for any advice!", "sortedWord": "None", "identifyer": 82248, "year": "2019"}, {"Unnamed: 0": 334473, "autor": "Whydoeshedothattho", "date": 1546466651000, "content": "Selling Travel/landscape Photography; Exposure and Marketing /!/  Hello all,\n\nI am reaching out in hopes someone will be able to point me in the right direction. I am an amateur adventure/landscape photographer and have been on IG for a couple of months. Years back, when I had a different account, I used bots, posting times, hashtags, etc. to increase my following. However, this time around, I would like to maintain an authentic account, while also gaining more exposure so I may eventually become noticed. I don't claim to be amazing, and I know my photography needs work, but I also do know I have taken some beautiful photos and would like to start earning. I have tried photo contests, stock photography sites, but using tags seem to never pay off. All suggestions welcome (no negativity please!). I would love to learn more about how to share my travels and love of photography with the rest of the world. My IG handle is @thecolderthebetter to see some of my work.\n\nThank you! \n\n&amp;#x200B;\n\nPS - should I be watermarking my photos? Thoughts?", "link": "https://www.reddit.com/r/photography/comments/abybi5/selling_travellandscape_photography_exposure_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "selling travel/landscape photography; exposure and marketing /!/  hello all,\n\ni am reaching out in hopes someone will be able to point me in the right direction. i am an amateur adventure/landscape photographer and have been on ig for a couple of months. years back, when i had a different account, i used bots, posting times, hashtags, etc. to increase my following. however, this time around, i would like to maintain an authentic account, while also gaining more exposure so i may eventually become noticed. i don't claim to be amazing, and i know my photography needs work, but i also do know i have taken some beautiful photos and would like to start earning. i have tried photo contests, stock photography sites, but using -----> tags !!!  seem to never pay off. all suggestions welcome (no negativity please!). i would love to learn more about how to share my travels and love of photography with the rest of the world. my ig handle is @thecolderthebetter to see some of my work.\n\nthank you! \n\n&amp;#x200b;\n\nps - should i be watermarking my photos? thoughts?", "sortedWord": "None", "identifyer": 82277, "year": "2019"}, {"Unnamed: 0": 334560, "autor": "metreos", "date": 1546640891000, "content": "How do you keep track of pictures for inspiration? /!/ I wonder if others keep track of pictures they find interesting / inspiring.\n\nI'd love something that lets me tag the pics and possibly offer a grid view. Is there anything (except Lightroom of course) that people are currently using?\n", "link": "https://www.reddit.com/r/photography/comments/acni08/how_do_you_keep_track_of_pictures_for_inspiration/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "how do you keep track of pictures for inspiration? /!/ i wonder if others keep track of pictures they find interesting / inspiring.\n\ni'd love something that lets me -----> tag !!!  the pics and possibly offer a grid view. is there anything (except lightroom of course) that people are currently using?\n", "sortedWord": "None", "identifyer": 82368, "year": "2019"}, {"Unnamed: 0": 335308, "autor": "travlin0704", "date": 1548873545000, "content": "(Yet another) Instagram Photography Scam Warning: Legit-looking landscape repost account specifically targeting small accounts /!/ I know there are a lot of instagram scam warnings out there, lots of accounts with fake followers offering to do paid posts for ultimately fake engagement, but this one seemed different to me since it involves a legitimate-looking landscape repost account taking the money and running.  This scam is targeting photographers who are small/new on instagram, desperate for engagement and may not know better, especially when an account looks legitimate.\n\nThere is a large landscape photography account on Instagram called @earthescope (100k followers) and they also have a 177k following on Twitter. They repost high-quality photos and I believe they do actually have a lot of legit followers and engagement (rather than fake shell bots), as well as people who tag #earthescope in the hopes of being featured.\n\nThe Earthescope account looks legit as a landscape repost account, but on the side they use shell accounts such as jeff\\_visuals\\_, matt\\_visuals\\_, antro\\_visuals, bertchris\\_visuals (and I'm sure more) to reach out to and specifically target photographers with low following (lets say under 500 followers, I don't know the exact number). They post something on their feed like \"Wow, great picture! Do follow @earthescope and use #earthescope to get featured\" or \"Great photo, follow #earthescope and DM us for feature!\".\n\nIf you DM them (I will note when they originally contacted me, they used their earthescope main account to solicit, but have since swapped to using shell \"name\\_visuals\" side accounts), they will offer to feature your post as a package on their story/feed/twitter for a price. For me this was $29, but I know others who got scammed paid $20. If you're a very new Instagram account that has perhaps dabbled a little with Instagram's built in promotions, you might have realized that $30 with Instagram's advertisements does not get you very far, so if you're interested in growing your presence on Instagram, this is where spending $30 to have a photo posted on a large account may seem like a fun thing to try, especially since if you check their feed, they DO (rarely) post photos from accounts with few followers (probably to make their scam appear legit).\n\nHere is where the due diligence fail comes in: they do ask you to pay PP Friends &amp; Family (obvious scam warning), BUT, you are new to this (since they specifically target small accounts) AND if you look at their feed, they DO very occasionally feature small accounts in either their story or feed, so you think perhaps this is normal when dealing with a large feature account. Also I did search \"earthescope scam\" before I paid and could not find any red flags at the time, though I imagine that anyone who has been scammed and posted publicly on their feed has their comment deleted/blocked so there is no good place to even warn future victims who may be trying to do their due diligence.\n\nAnyway, earthescope takes your money, then they stop responding and obviously never do a feature post for most people.  I will note they do things like post a story only to pacify you and never post the standalone post they promised, but for the most part they take the money and cease communications.  There is no good way to report this sort of scam to Instagram, and there are no grounds for getting the money back in Paypal. $30 is not a lot to some, so many victims just give up and continue to let earthescope operate their scam and grow their Instagram presence by reposting popular photographers while scamming new accounts for $30 a pop.  I know there are redditors (I have seen some of earthescope's photos posted by the original photographers on reddit, though perhaps in [/r/earthporn](https://www.reddit.com/r/earthporn)) who's photos are getting reposted by earthescope and are inadvertently helping to perpetuate this scam. \n\nI am in contact with at least 3 other Instagram users others who have been scammed that I found in the past day, I'm sure there are more. Obviously their scheme is working, and I just want to make sure that others are aware of this sort of scam that seems to have legitimate content and engagement but is actually scamming small accounts on the side.\n\n&amp;#x200B;\n\n&amp;#x200B;", "link": "https://www.reddit.com/r/photography/comments/alfu3n/yet_another_instagram_photography_scam_warning/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "(yet another) instagram photography scam warning: legit-looking landscape repost account specifically targeting small accounts /!/ i know there are a lot of instagram scam warnings out there, lots of accounts with fake followers offering to do paid posts for ultimately fake engagement, but this one seemed different to me since it involves a legitimate-looking landscape repost account taking the money and running.  this scam is targeting photographers who are small/new on instagram, desperate for engagement and may not know better, especially when an account looks legitimate.\n\nthere is a large landscape photography account on instagram called @earthescope (100k followers) and they also have a 177k following on twitter. they repost high-quality photos and i believe they do actually have a lot of legit followers and engagement (rather than fake shell bots), as well as people who -----> tag !!!  #earthescope in the hopes of being featured.\n\nthe earthescope account looks legit as a landscape repost account, but on the side they use shell accounts such as jeff\\_visuals\\_, matt\\_visuals\\_, antro\\_visuals, bertchris\\_visuals (and i'm sure more) to reach out to and specifically target photographers with low following (lets say under 500 followers, i don't know the exact number). they post something on their feed like \"wow, great picture! do follow @earthescope and use #earthescope to get featured\" or \"great photo, follow #earthescope and dm us for feature!\".\n\nif you dm them (i will note when they originally contacted me, they used their earthescope main account to solicit, but have since swapped to using shell \"name\\_visuals\" side accounts), they will offer to feature your post as a package on their story/feed/twitter for a price. for me this was $29, but i know others who got scammed paid $20. if you're a very new instagram account that has perhaps dabbled a little with instagram's built in promotions, you might have realized that $30 with instagram's advertisements does not get you very far, so if you're interested in growing your presence on instagram, this is where spending $30 to have a photo posted on a large account may seem like a fun thing to try, especially since if you check their feed, they do (rarely) post photos from accounts with few followers (probably to make their scam appear legit).\n\nhere is where the due diligence fail comes in: they do ask you to pay pp friends &amp; family (obvious scam warning), but, you are new to this (since they specifically target small accounts) and if you look at their feed, they do very occasionally feature small accounts in either their story or feed, so you think perhaps this is normal when dealing with a large feature account. also i did search \"earthescope scam\" before i paid and could not find any red flags at the time, though i imagine that anyone who has been scammed and posted publicly on their feed has their comment deleted/blocked so there is no good place to even warn future victims who may be trying to do their due diligence.\n\nanyway, earthescope takes your money, then they stop responding and obviously never do a feature post for most people.  i will note they do things like post a story only to pacify you and never post the standalone post they promised, but for the most part they take the money and cease communications.  there is no good way to report this sort of scam to instagram, and there are no grounds for getting the money back in paypal. $30 is not a lot to some, so many victims just give up and continue to let earthescope operate their scam and grow their instagram presence by reposting popular photographers while scamming new accounts for $30 a pop.  i know there are redditors (i have seen some of earthescope's photos posted by the original photographers on reddit, though perhaps in [/r/earthporn](https://www.reddit.com/r/earthporn)) who's photos are getting reposted by earthescope and are inadvertently helping to perpetuate this scam. \n\ni am in contact with at least 3 other instagram users others who have been scammed that i found in the past day, i'm sure there are more. obviously their scheme is working, and i just want to make sure that others are aware of this sort of scam that seems to have legitimate content and engagement but is actually scamming small accounts on the side.\n\n&amp;#x200b;\n\n&amp;#x200b;", "sortedWord": "None", "identifyer": 83153, "year": "2019"}, {"Unnamed: 0": 335755, "autor": "MrMagooLostHisShoe", "date": 1548294139000, "content": "Looking For Suggestions on Tagging/Organizing/Backing-Up a Huge Library of Family Photos. /!/ I'm getting ready to start scanning thousands of family photos. Looking for suggestions on best practices for tagging, organizing, and backing-up all of these photos. \n\nIdeally, I'd eventually like to make them available (privately) online to share with family.\n\nAny software/service suggestions, as well as strategies for organization would be greatly appreciated.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/aj79t8/looking_for_suggestions_on/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagging", "selectorShort": "tag", "MarkedSent": "looking for suggestions on -----> tagging !!! /organizing/backing-up a huge library of family photos. /!/ i'm getting ready to start scanning thousands of family photos. looking for suggestions on best practices for tagging, organizing, and backing-up all of these photos. \n\nideally, i'd eventually like to make them available (privately) online to share with family.\n\nany software/service suggestions, as well as strategies for organization would be greatly appreciated.\n\nthanks!", "sortedWord": "None", "identifyer": 83620, "year": "2019"}, {"Unnamed: 0": 335793, "autor": "Screeching_Owl", "date": 1548268553000, "content": "Discoverability tips for stock Photography? /!/ I just got started selling photos on Alamy. My second batch has passed QC and I'm now starting to optimize my photos.\n\nHow do I go about gaining traction in the stock photo (or video) world? Are there any good apps or resources for generating tags (aside from searching for similar images)?\n\nHow about tips for efficient stock Photography? I have yet to set up a stock photo shoot. Currently I walk and bicycle as primary transportation, so I carry my camera everywhere and use pictures from daily life.\n\nThanks :)", "link": "https://www.reddit.com/r/photography/comments/aj2u95/discoverability_tips_for_stock_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "discoverability tips for stock photography? /!/ i just got started selling photos on alamy. my second batch has passed qc and i'm now starting to optimize my photos.\n\nhow do i go about gaining traction in the stock photo (or video) world? are there any good apps or resources for generating -----> tags !!!  (aside from searching for similar images)?\n\nhow about tips for efficient stock photography? i have yet to set up a stock photo shoot. currently i walk and bicycle as primary transportation, so i carry my camera everywhere and use pictures from daily life.\n\nthanks :)", "sortedWord": "None", "identifyer": 83658, "year": "2019"}, {"Unnamed: 0": 337128, "autor": "jsoltysik", "date": 1560880753000, "content": "Proof that Instagram Business Analytics (\"Insights\") is Fake Data /!/ \n\nI've had inklings for a while that Instagram's analytics are fake: mismatches between my squarespace analytics and Instagram's reporting, mismatches between discovery rate and hashtag discovery, and so on. I never followed it too closely.\n\nBut recently I saw some bizarre activity so I wanted to take a closer look. \n\n**Of my past 9 posts, I can prove the analytics for 8/9 are fake.** The only post with unfalsifiable analytics is the post for 2019-06-18 captioned \"Jeanna.\" \n\nThe posts and the analytics are presented below. They are all false for one of two reasons:\n\n(1) The analytics show the post resulted in one or more \"Calls\" in the \"Interactions\" part of the \"Insights\" menu. But my profile doesn't list my phone number or a \"Call\" action button. I can independently verify from my phone logs and conversations with clients nobody called me after viewing these posts. \n\n(2) The analytics show the post has a number of \"Impressions\" from \"Hashtags,\" but the post itself is suppressed and does not appear in any hash tags at all. \n\nIn one case, a post is falsified on both counts. \n\nThe posts are presented in order of recency. \n\n**2019-06-18 Caption \"Kat\"**\n\nImgur Link: https://imgur.com/a/oLTXMQi\n\nFalsified Because: Analytics shows 9 \"Impressions\" \"From Hashtags\" but the post does not appear in any hashtags. \n\n**2019-06-17 Caption \"Jeanna\"**\n\nImgur Link: https://imgur.com/a/yam38Sk\n\nThis is the one post with unfalsifiable analytics.\n\n**2019-06-14 Caption \"Lena\"**\n\nImgur Link: https://imgur.com/a/a0e3pdf\n\nFalsified Because: Analytics shows 1 \"Calls\" under \"Interactions\" but I have no \"Call\" action button in my profile.\n\n**2019-06-13 Caption \"Julia\"**\n\nImgur Link: https://imgur.com/a/KnWlvXe\n\nFalsified Because: Analytics shows 1 \"Calls\" under \"Interactions\" but I have no \"Call\" action button in my profile.\n\n**2019-06-12 Caption \"Jaylinn\"**\n\nImgur Link: https://imgur.com/a/10n7f4U\n\nFalsified Because: Analytics shows 2 \"Calls\" under \"Interactions\" but I have no \"Call\" action button in my profile.\n\n**2019-06-11 Caption \"Mikaela\"**\n\nImugr Link: https://imgur.com/a/HYz8B5b\n\nFalsified Because: Analytics shows 27 \"Impressions\" \"From Hashtags\" but the post does not appear in any hashtags. \n\n**2019-06-10 Caption \"Viktoria\"**\n\nImugr Link: https://imgur.com/a/eFquvNt\n\nFalsified Because: Analytics shows 5 \"Impressions\" \"From Hashtags\" but the post does not appear in any hashtags. \n\n**2019-06-07 Caption \"Devin\"**\n\nImugr Link: https://imgur.com/a/soQMFId\n\nFalsified Because: Analytics shows 6 \"Impressions\" \"From Hashtags\" but the post does not appear in any hashtags. \n\n**2019-06-07 Caption \"Bryn\"**\n\nImgur Link: https://imgur.com/a/KgxsKUT\n\nFalsified Because: (1) Analytics shows 6 \"Impressions\" \"From Hashtags\" but the post does not appear in any hashtags. (2) Analytics shows 2 \"Calls\" under \"Interactions\" but I have no \"Call\" action button in my profile.", "link": "https://www.reddit.com/r/photography/comments/c25ide/proof_that_instagram_business_analytics_insights/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "proof that instagram business analytics (\"insights\") is fake data /!/ \n\ni've had inklings for a while that instagram's analytics are fake: mismatches between my squarespace analytics and instagram's reporting, mismatches between discovery rate and hashtag discovery, and so on. i never followed it too closely.\n\nbut recently i saw some bizarre activity so i wanted to take a closer look. \n\n**of my past 9 posts, i can prove the analytics for 8/9 are fake.** the only post with unfalsifiable analytics is the post for 2019-06-18 captioned \"jeanna.\" \n\nthe posts and the analytics are presented below. they are all false for one of two reasons:\n\n(1) the analytics show the post resulted in one or more \"calls\" in the \"interactions\" part of the \"insights\" menu. but my profile doesn't list my phone number or a \"call\" action button. i can independently verify from my phone logs and conversations with clients nobody called me after viewing these posts. \n\n(2) the analytics show the post has a number of \"impressions\" from \"hashtags,\" but the post itself is suppressed and does not appear in any hash -----> tags !!!  at all. \n\nin one case, a post is falsified on both counts. \n\nthe posts are presented in order of recency. \n\n**2019-06-18 caption \"kat\"**\n\nimgur link: https://imgur.com/a/oltxmqi\n\nfalsified because: analytics shows 9 \"impressions\" \"from hashtags\" but the post does not appear in any hashtags. \n\n**2019-06-17 caption \"jeanna\"**\n\nimgur link: https://imgur.com/a/yam38sk\n\nthis is the one post with unfalsifiable analytics.\n\n**2019-06-14 caption \"lena\"**\n\nimgur link: https://imgur.com/a/a0e3pdf\n\nfalsified because: analytics shows 1 \"calls\" under \"interactions\" but i have no \"call\" action button in my profile.\n\n**2019-06-13 caption \"julia\"**\n\nimgur link: https://imgur.com/a/knwlvxe\n\nfalsified because: analytics shows 1 \"calls\" under \"interactions\" but i have no \"call\" action button in my profile.\n\n**2019-06-12 caption \"jaylinn\"**\n\nimgur link: https://imgur.com/a/10n7f4u\n\nfalsified because: analytics shows 2 \"calls\" under \"interactions\" but i have no \"call\" action button in my profile.\n\n**2019-06-11 caption \"mikaela\"**\n\nimugr link: https://imgur.com/a/hyz8b5b\n\nfalsified because: analytics shows 27 \"impressions\" \"from hashtags\" but the post does not appear in any hashtags. \n\n**2019-06-10 caption \"viktoria\"**\n\nimugr link: https://imgur.com/a/efquvnt\n\nfalsified because: analytics shows 5 \"impressions\" \"from hashtags\" but the post does not appear in any hashtags. \n\n**2019-06-07 caption \"devin\"**\n\nimugr link: https://imgur.com/a/soqmfid\n\nfalsified because: analytics shows 6 \"impressions\" \"from hashtags\" but the post does not appear in any hashtags. \n\n**2019-06-07 caption \"bryn\"**\n\nimgur link: https://imgur.com/a/kgxskut\n\nfalsified because: (1) analytics shows 6 \"impressions\" \"from hashtags\" but the post does not appear in any hashtags. (2) analytics shows 2 \"calls\" under \"interactions\" but i have no \"call\" action button in my profile.", "sortedWord": "None", "identifyer": 85079, "year": "2019"}, {"Unnamed: 0": 338516, "autor": "bleedingcolon", "date": 1563166121000, "content": "Clients using bad filters on my work /!/ I have had two clients who, after I have spent a lot of time and effort editing their photos, post them on Facebook/Instagram with dramatic (imo terrible) filters on them and tag my accounts. \n\nPart of me thinks that if they are happy doing that it is fine, but another part of me gets upset because 1, I worked hard on the edits and 2, I don’t want potential clients thinking I did that. \n\nDoes this happen to any of you? What are your thoughts about it?", "link": "https://www.reddit.com/r/photography/comments/cdd2od/clients_using_bad_filters_on_my_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "clients using bad filters on my work /!/ i have had two clients who, after i have spent a lot of time and effort editing their photos, post them on facebook/instagram with dramatic (imo terrible) filters on them and -----> tag !!!  my accounts. \n\npart of me thinks that if they are happy doing that it is fine, but another part of me gets upset because 1, i worked hard on the edits and 2, i don’t want potential clients thinking i did that. \n\ndoes this happen to any of you? what are your thoughts about it?", "sortedWord": "None", "identifyer": 86553, "year": "2019"}, {"Unnamed: 0": 338936, "autor": "mihirashar", "date": 1564400228000, "content": "Hertz UAE reposted my photo w/o permisson &amp; cropped my watermark!! /!/  [https://www.instagram.com/p/B0V9hQqH-MS/](https://www.instagram.com/p/B0V9hQqH-MS/) \n\nI have already messaged them asking why and also filled the copyright infringement form on Instagram, but my expectations with that aren't very high, so I'm not really sure what else I can do.\n\n&amp;#x200B;\n\nThey are a verified page, a huge company, yet such inconsideration for others content. Such a disgrace.  \nThey haven't really tagged or credited anyone on their posts &amp; I'm pretty sure almost every other photo is someone else stolen work as well.", "link": "https://www.reddit.com/r/photography/comments/cja2fs/hertz_uae_reposted_my_photo_wo_permisson_cropped/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "hertz uae reposted my photo w/o permisson &amp; cropped my watermark!! /!/  [https://www.instagram.com/p/b0v9hqqh-ms/](https://www.instagram.com/p/b0v9hqqh-ms/) \n\ni have already messaged them asking why and also filled the copyright infringement form on instagram, but my expectations with that aren't very high, so i'm not really sure what else i can do.\n\n&amp;#x200b;\n\nthey are a verified page, a huge company, yet such inconsideration for others content. such a disgrace.  \nthey haven't really -----> tagged !!!  or credited anyone on their posts &amp; i'm pretty sure almost every other photo is someone else stolen work as well.", "sortedWord": "None", "identifyer": 86995, "year": "2019"}], "name": "tagphotography2019"}