{"interestingcomments": [{"Unnamed: 0": 95202, "autor": "Eimji", "date": 1633040569000, "content": "Android application to securely share your photos and videos with your friends without storing on any intermediate server. /!/ Hello,\n\nI love taking photos with my mobile, then proudly share the most beautiful photos with my friends or family. But I also want to protect my privacy. If you send photos by email, they are permanently stored on mail servers except if you delete your mail and ask your friends to also delete the mail after viewing the photos. This is not possible, and sharing on cloud, I don't trust the provider ! And I don't want my friends to post my photos on social networks.\n\nSo I decided to develop a mobile application for sharing photos. \n\nThat is said, I would like to present you a new exciting application I have developed to let users share their photos and videos without storing them on a any cloud server.\n\nSharing is secure and end-to-end encrypted between mobile terminals, and is done only from device to device (P2P) without any intermediate server. Only your friends have a copy of your photos and videos, but they cannot access them to save elsewhere (screenshot is also disabled). \n\nYou can install the application on Google Play\n\nhttps://play.google.com/store/apps/details?id=com.orange.labs.poltreder\n\nThanks for your comments or any issue report.\n\nAll the functionalities in detail:\n• Poltreder lets you manage and share all the photos and videos available in the library of your mobile device (i.e. taken with the mobile camera).\n• Organize your photos and videos into collections. A collection is a simple tag (see it as a folder) to group your photos and videos. You can then share the collection with your friends. This allows you to control who can view which photos or videos of your camera library.\n• Your photos and videos are not saved in any cloud server, but directly transferred towards the devices of your friends. Sharing with Poltreder is fully secure and encrypted.\n• Whenever you delete a photo or video from a collection, it still exists in your device, but it is automatically removed from the devices of your friends. Similarly, when deleting photos and videos permanently from your device library, they are also removed from any collection which contains them, and mostly, as well as from the devices of your friends with whom you have shared them.\n• If you decide to remove a friend from accessing a collection, the collection (incl. all the photos and videos) will be also deleted from your friend's device.\n• If you delete a friend, all the collections, including photos and videos, you shared with your friend will be removed from his/her device, and in turn, all the photos and videos shared by your friend will be also removed from your device.\n• No need to create an account to use Poltreder. We just ask you to choose a username and an avatar: this only allows your friends to identify you easily! Account creation is done locally on your device using a process of invitations by email to link accounts between them for sharing photos and videos.", "link": "https://www.reddit.com/r/photography/comments/pyudgg/android_application_to_securely_share_your_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "android application to securely share your photos and videos with your friends without storing on any intermediate server. /!/ hello,\n\ni love taking photos with my mobile, then proudly share the most beautiful photos with my friends or family. but i also want to protect my privacy. if you send photos by email, they are permanently stored on mail servers except if you delete your mail and ask your friends to also delete the mail after viewing the photos. this is not possible, and sharing on cloud, i don't trust the provider ! and i don't want my friends to post my photos on social networks.\n\nso i decided to develop a mobile application for sharing photos. \n\nthat is said, i would like to present you a new exciting application i have developed to let users share their photos and videos without storing them on a any cloud server.\n\nsharing is secure and end-to-end encrypted between mobile terminals, and is done only from device to device (p2p) without any intermediate server. only your friends have a copy of your photos and videos, but they cannot access them to save elsewhere (screenshot is also disabled). \n\nyou can install the application on google play\n\nhttps://play.google.com/store/apps/details?id=com.orange.labs.poltreder\n\nthanks for your comments or any issue report.\n\nall the functionalities in detail:\n• poltreder lets you manage and share all the photos and videos available in the library of your mobile device (i.e. taken with the mobile camera).\n• organize your photos and videos into collections. a collection is a simple -----> tag !!!  (see it as a folder) to group your photos and videos. you can then share the collection with your friends. this allows you to control who can view which photos or videos of your camera library.\n• your photos and videos are not saved in any cloud server, but directly transferred towards the devices of your friends. sharing with poltreder is fully secure and encrypted.\n• whenever you delete a photo or video from a collection, it still exists in your device, but it is automatically removed from the devices of your friends. similarly, when deleting photos and videos permanently from your device library, they are also removed from any collection which contains them, and mostly, as well as from the devices of your friends with whom you have shared them.\n• if you decide to remove a friend from accessing a collection, the collection (incl. all the photos and videos) will be also deleted from your friend's device.\n• if you delete a friend, all the collections, including photos and videos, you shared with your friend will be removed from his/her device, and in turn, all the photos and videos shared by your friend will be also removed from your device.\n• no need to create an account to use poltreder. we just ask you to choose a username and an avatar: this only allows your friends to identify you easily! account creation is done locally on your device using a process of invitations by email to link accounts between them for sharing photos and videos.", "sortedWord": "None", "identifyer": 97759, "year": "2021"}, {"Unnamed: 0": 95755, "autor": "John_Ware", "date": 1617204893000, "content": "Any Advice on Gaining Clients for Side Business? /!/ Hey guys, \n\nAfter a recent post I made asking for input on JCPenny portrait photography, I've been more seriously considering going my own route. I don't have experience running a business, however I have a few familys that are interested in hiring me for photoshoots. I'm curious what your guys' advice is on attracting customers and how I should go about with the legal aspects of running a small photography side business. Additionally, I'm a bit lost when it comes to valuing my work. I've looked at other photographers in my area, but they're charging upwards of $800+ for a senior/family photoshoot. I personally don't feel right asking for prices like that, but I also don't want to majorly undersell local photographers and look bad. Should I charge per photo, per hour, or something else? How do I justify my price tag? I'm proud of my work, but don't feel comfortable asking clients for so much money. Any advice pertaining to running a photography side business is greatly appreciated!\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/mh8pzd/any_advice_on_gaining_clients_for_side_business/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "any advice on gaining clients for side business? /!/ hey guys, \n\nafter a recent post i made asking for input on jcpenny portrait photography, i've been more seriously considering going my own route. i don't have experience running a business, however i have a few familys that are interested in hiring me for photoshoots. i'm curious what your guys' advice is on attracting customers and how i should go about with the legal aspects of running a small photography side business. additionally, i'm a bit lost when it comes to valuing my work. i've looked at other photographers in my area, but they're charging upwards of $800+ for a senior/family photoshoot. i personally don't feel right asking for prices like that, but i also don't want to majorly undersell local photographers and look bad. should i charge per photo, per hour, or something else? how do i justify my price -----> tag !!! ? i'm proud of my work, but don't feel comfortable asking clients for so much money. any advice pertaining to running a photography side business is greatly appreciated!\n\nthanks!", "sortedWord": "None", "identifyer": 98327, "year": "2021"}, {"Unnamed: 0": 95997, "autor": "acidbahia", "date": 1618528498000, "content": "What would be the best strategy to attack this problem? /!/ Hello,\n\nI have to sort/delete/categorize about 20.000 images inherited from several, very very messy HD's.\n\nThere are many duplicates, mispelled images, low and hi res all mixed up, etc. A real MESS!\n\nI'm very curious to know &gt; what would be the strategy you would put in place to attack such a problem ? Starting with folders with dates ? Places ? tags ? or using Mac Photos? LightRoom? \n\nThanks guys!", "link": "https://www.reddit.com/r/photography/comments/mrqkmx/what_would_be_the_best_strategy_to_attack_this/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "what would be the best strategy to attack this problem? /!/ hello,\n\ni have to sort/delete/categorize about 20.000 images inherited from several, very very messy hd's.\n\nthere are many duplicates, mispelled images, low and hi res all mixed up, etc. a real mess!\n\ni'm very curious to know &gt; what would be the strategy you would put in place to attack such a problem ? starting with folders with dates ? places ? -----> tags !!!  ? or using mac photos? lightroom? \n\nthanks guys!", "sortedWord": "None", "identifyer": 98579, "year": "2021"}, {"Unnamed: 0": 96161, "autor": "rehabforcandy", "date": 1621182789000, "content": "I took some great photos at the Jan 6th riots but have barely sold any on Alamy. Amateur reportage shooters, where do you like to sell your shots? /!/ I’m a news junkie and work on documentaries for a living, I also shoot a lot of stills on my own wherever I go. I happened to be at a lot of historical happenings in the last year and took tons of photos. On Jan 6th I followed the crowd from the speech and ended up right below the broken window on the West side. I see this wide shot used all the damn time and it really annoys me I have closeups of the guy and a big 15mm lens shot of him and the crowd watching. Long story short I’ve sold ONE photo from January 6th for $37 bucks.  I have an Alamy reportage account and everything is good quality, priced cheap, and has lots of tags. What am I missing??  \n\nAny advice appreciated, thanks!", "link": "https://www.reddit.com/r/photography/comments/nds2q6/i_took_some_great_photos_at_the_jan_6th_riots_but/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "i took some great photos at the jan 6th riots but have barely sold any on alamy. amateur reportage shooters, where do you like to sell your shots? /!/ i’m a news junkie and work on documentaries for a living, i also shoot a lot of stills on my own wherever i go. i happened to be at a lot of historical happenings in the last year and took tons of photos. on jan 6th i followed the crowd from the speech and ended up right below the broken window on the west side. i see this wide shot used all the damn time and it really annoys me i have closeups of the guy and a big 15mm lens shot of him and the crowd watching. long story short i’ve sold one photo from january 6th for $37 bucks.  i have an alamy reportage account and everything is good quality, priced cheap, and has lots of -----> tags !!! . what am i missing??  \n\nany advice appreciated, thanks!", "sortedWord": "None", "identifyer": 98747, "year": "2021"}, {"Unnamed: 0": 97237, "autor": "Sanjay_Sagar2003", "date": 1635525985000, "content": "Tag who looks the same as me! 😂😂 Guy if you like it so you should check out my instagram _sagar_jii_", "link": "https://www.reddit.com/r/photography/comments/qih1b4/tag_who_looks_the_same_as_me_guy_if_you_like_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "-----> tag !!!  who looks the same as me! 😂😂 guy if you like it so you should check out my instagram _sagar_jii_", "sortedWord": "None", "identifyer": 99869, "year": "2021"}, {"Unnamed: 0": 110276, "autor": "nathanasher834", "date": 1612468576000, "content": "Professional/Freelance Photographers; What % of your customers come back for repeat business in the first 1-24 months? And what % are friends &amp; family referrals in the same month-span? /!/ Hi guys,\n\nAs the title asks - what % of your customers come back within 2 years, and how many refer their friends and family?  \n\n\nAlso, are they usually spending the same or more? What would you say is the average \"price-tag\" that repeat business brings you?", "link": "https://www.reddit.com/r/photography/comments/lcoge0/professionalfreelance_photographers_what_of_your/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "professional/freelance photographers; what % of your customers come back for repeat business in the first 1-24 months? and what % are friends &amp; family referrals in the same month-span? /!/ hi guys,\n\nas the title asks - what % of your customers come back within 2 years, and how many refer their friends and family?  \n\n\nalso, are they usually spending the same or more? what would you say is the average \"price------> tag !!! \" that repeat business brings you?", "sortedWord": "None", "identifyer": 216, "year": "2021"}, {"Unnamed: 0": 110787, "autor": "andyday_", "date": 1615968009000, "content": "David Alan Harvey has resigned from Magnum Photos /!/ Harvey made the announcement on twitter:\n\n[https://twitter.com/davidalanharvey/status/1372062943773396994?s=20](https://twitter.com/davidalanharvey/status/1372062943773396994?s=20)\n\nLast August it was revealed that Harvey took photographs of naked female subjects in Bangkok that were tagged with \"teenage girl - 13 to 18 years\" and \"prostitute,\" and published in a collection entitled \"Bangkok Prostitutes\". [https://fstoppers.com/news/magnum-photos-selling-images-alleged-child-sexual-abuse-its-website-504855](https://fstoppers.com/news/magnum-photos-selling-images-alleged-child-sexual-abuse-its-website-504855)\n\nIn December, 11 women detailed extensive allegations of sexual misconduct. [https://www.cjr.org/special\\_report/magnum-photos-david-alan-harvey.php](https://www.cjr.org/special_report/magnum-photos-david-alan-harvey.php)", "link": "https://www.reddit.com/r/photography/comments/m6va6j/david_alan_harvey_has_resigned_from_magnum_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "david alan harvey has resigned from magnum photos /!/ harvey made the announcement on twitter:\n\n[https://twitter.com/davidalanharvey/status/1372062943773396994?s=20](https://twitter.com/davidalanharvey/status/1372062943773396994?s=20)\n\nlast august it was revealed that harvey took photographs of naked female subjects in bangkok that were -----> tagged !!!  with \"teenage girl - 13 to 18 years\" and \"prostitute,\" and published in a collection entitled \"bangkok prostitutes\". [https://fstoppers.com/news/magnum-photos-selling-images-alleged-child-sexual-abuse-its-website-504855](https://fstoppers.com/news/magnum-photos-selling-images-alleged-child-sexual-abuse-its-website-504855)\n\nin december, 11 women detailed extensive allegations of sexual misconduct. [https://www.cjr.org/special\\_report/magnum-photos-david-alan-harvey.php](https://www.cjr.org/special_report/magnum-photos-david-alan-harvey.php)", "sortedWord": "None", "identifyer": 742, "year": "2021"}, {"Unnamed: 0": 111203, "autor": "tomorrow_is_tomorrow", "date": 1618483685000, "content": "I gave my photos to a local racing circuit to promote them and they under-saturated them! Tell me your opinion. /!/ I am an amateur car photographer and I go every weekend(before the pandemic) on my local track to shoot track days and events. It is my hobby a couple of years now and lately I'm trying to do a better work with my photos because I upload them on my Instagram account. Capture photos from a better angles, edit them etc etc. One day, about a month ago, the social media team of my local racing circuit sent me a message and asked me if I can send them some of my photos(with my Instagram name on them) to upload them on their account. I said why not...\n\n2 uploads later I'm very disappointed. First upload, tagged me but cropped my logo out of my shot. I sent them a message and asked them why they did that and they said that the logo was at the bottom of the photo and they wanted to show more of the track. I said ok, let's see what the next upload would look like. 2nd upload, they took my shot and under saturated the crap out of it! I have the same shot on my profile and it is like night and day the difference between them. I immediately sent them a message again and asked them why they did that. The answer was that they want to have some kind of pattern on their profile with normal saturation shots. I told them very kindly that I spend a lot of hours on editing and if they want to do something, just ask me and I'll do it for them... From that moment, they stopped re-sharing my personal uploads on their stories. \n\nDid I do anything wrong? I just don't want a random guy or girl touching my work! I love what I'm doing and I spend a lot of ours to improve it. The only thing I ask for is some respect.", "link": "https://www.reddit.com/r/photography/comments/mrc44a/i_gave_my_photos_to_a_local_racing_circuit_to/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "i gave my photos to a local racing circuit to promote them and they under-saturated them! tell me your opinion. /!/ i am an amateur car photographer and i go every weekend(before the pandemic) on my local track to shoot track days and events. it is my hobby a couple of years now and lately i'm trying to do a better work with my photos because i upload them on my instagram account. capture photos from a better angles, edit them etc etc. one day, about a month ago, the social media team of my local racing circuit sent me a message and asked me if i can send them some of my photos(with my instagram name on them) to upload them on their account. i said why not...\n\n2 uploads later i'm very disappointed. first upload, -----> tagged !!!  me but cropped my logo out of my shot. i sent them a message and asked them why they did that and they said that the logo was at the bottom of the photo and they wanted to show more of the track. i said ok, let's see what the next upload would look like. 2nd upload, they took my shot and under saturated the crap out of it! i have the same shot on my profile and it is like night and day the difference between them. i immediately sent them a message again and asked them why they did that. the answer was that they want to have some kind of pattern on their profile with normal saturation shots. i told them very kindly that i spend a lot of hours on editing and if they want to do something, just ask me and i'll do it for them... from that moment, they stopped re-sharing my personal uploads on their stories. \n\ndid i do anything wrong? i just don't want a random guy or girl touching my work! i love what i'm doing and i spend a lot of ours to improve it. the only thing i ask for is some respect.", "sortedWord": "None", "identifyer": 1175, "year": "2021"}, {"Unnamed: 0": 111525, "autor": "elizabethheather05", "date": 1620475082000, "content": "I’m willing to spoil an honest and loyal sugar baby with $5000 for there weekly allowance Dm me on WhatsApp (585)209-3952 ‪with your cash app tag or PayPal 💕💕💕 /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/n7npnd/im_willing_to_spoil_an_honest_and_loyal_sugar/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i’m willing to spoil an honest and loyal sugar baby with $5000 for there weekly allowance dm me on whatsapp (585)209-3952 ‪with your cash app -----> tag !!!  or paypal 💕💕💕 /!/ [removed]", "sortedWord": "None", "identifyer": 1511, "year": "2021"}, {"Unnamed: 0": 111657, "autor": "Goodman4525", "date": 1620994897000, "content": "This price tag on the Leica 50mm confuses me ...", "link": "https://www.reddit.com/r/photography/comments/nc7bdg/this_price_tag_on_the_leica_50mm_confuses_me/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "this price -----> tag !!!  on the leica 50mm confuses me ...", "sortedWord": "None", "identifyer": 1646, "year": "2021"}, {"Unnamed: 0": 111700, "autor": "trashbear69", "date": 1621738172000, "content": "Do you think it's reasonable to require a business to tag you by contract when they use your photos if you did the photos for free? /!/ I put a post up on a Facebook group seeking a model because Im interviewing as an associate photographer and they need me to be a sample shoot with someone. \n\nA girl responded asking if she could be my model and wear some of the jewelry from where she works for her boss/company to use on Facebook Instagram. \n\nI was thinking I would allow posting to social media like facebook/Instagram with a tag and not allow Website/more overtly commercial use at all. \n\nDo you think this is reasonable?", "link": "https://www.reddit.com/r/photography/comments/niydsy/do_you_think_its_reasonable_to_require_a_business/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "do you think it's reasonable to require a business to -----> tag !!!  you by contract when they use your photos if you did the photos for free? /!/ i put a post up on a facebook group seeking a model because im interviewing as an associate photographer and they need me to be a sample shoot with someone. \n\na girl responded asking if she could be my model and wear some of the jewelry from where she works for her boss/company to use on facebook instagram. \n\ni was thinking i would allow posting to social media like facebook/instagram with a tag and not allow website/more overtly commercial use at all. \n\ndo you think this is reasonable?", "sortedWord": "None", "identifyer": 1689, "year": "2021"}, {"Unnamed: 0": 111731, "autor": "OsmiumOG", "date": 1621695919000, "content": "Do you ever get annoyed by all your friends and family expecting you to take all their pics? Killing the enjoyment in the hobby for me. /!/ Alright so I'm the type that only gets into photography purely as a hobby and self expression through art. I don't take your \"normal\" pictures like family pictures, engagement, wedding, senior pics etc. I only take photos that interest me which is normally themed shoots with a dedicated model. Body paint, UV shibari, apocalyptic themed, etc. These are what interest me and I got in photography for ME and as an artistic release I guess you can say.\n\nWith warmer weather and graduations approaching I'm getting bombarded with tags on social media to take my friend's friends senior pics, etc etc. My family expects me to be their dedicated photographer at every event. Now mind you I barely post my images on FB and only use an IG that VERY few people know is me in an attempt to let people \"forget\" I even take pictures. I've told all my friends and family countless times I don't do paid shoots or anything of that nature because quite simply I don't enjoy it..\n\nI had a close friend tag me for senior pics for one of his friends, I politely told him and the other person (once they pmd me) that I don't take pictures publicly like that. Not even a week later he tags me in engagement photo requests. It's not just that one friend, I'm getting like 3-4 tags a week religiously despite the fact I've NEVER taken nor even offered pictures as a public service. Even when offered several hundred $ I decline simply because it's a hobby to me and I don't want to add the pressure of expectations.\n\nNow catch up to today I have an issue with my mother. I've even told her this aspect alone has caused me to almost sell all of my camera gear in the past out of annoyance and this constant nagging of people wanting me to take pictures is just annoying and stressful for some reason for me. Not just my mom, I've had this talk with a few family members and they STILL ask me or expect me to bring my gear out for stupid events like cookouts and stuff. But my mother knows the level of stress and annoyance this causes for me yet today she did it again. Wants me to take pictures of my relative at a sports benefit that's being put on for him and his terminal illness. Now yes I planned on taking pictures with my phone to document the event and memories while said relative is with us, but I only have a hour to stop at this event. I don't want to run home, then go to the benefit and only have 30 minutes to spend with my relative and then spend that whole 30 minutes looking through my viewfinder of \"all the groups of people who show up\".... \n\nI've told people countless times and family especially always tries to guilt trip me into lugging everything out when I've told them 100x that the type of pictures they want, can be taken on a cell phone. Then I always hear the \"but the quality is sooooo much better\". Like listen Karen you're posting these on FB and not even getting a 5x7 print made...you can't even tell the quality difference. \n\nBleh how do you guys deal with this type of stuff? It seriously has me contemplating giving up photography for good and selling my camera just so I can tell everyone to leave me TF alone when it comes to pictures.", "link": "https://www.reddit.com/r/photography/comments/nikkez/do_you_ever_get_annoyed_by_all_your_friends_and/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "do you ever get annoyed by all your friends and family expecting you to take all their pics? killing the enjoyment in the hobby for me. /!/ alright so i'm the type that only gets into photography purely as a hobby and self expression through art. i don't take your \"normal\" pictures like family pictures, engagement, wedding, senior pics etc. i only take photos that interest me which is normally themed shoots with a dedicated model. body paint, uv shibari, apocalyptic themed, etc. these are what interest me and i got in photography for me and as an artistic release i guess you can say.\n\nwith warmer weather and graduations approaching i'm getting bombarded with -----> tags !!!  on social media to take my friend's friends senior pics, etc etc. my family expects me to be their dedicated photographer at every event. now mind you i barely post my images on fb and only use an ig that very few people know is me in an attempt to let people \"forget\" i even take pictures. i've told all my friends and family countless times i don't do paid shoots or anything of that nature because quite simply i don't enjoy it..\n\ni had a close friend tag me for senior pics for one of his friends, i politely told him and the other person (once they pmd me) that i don't take pictures publicly like that. not even a week later he tags me in engagement photo requests. it's not just that one friend, i'm getting like 3-4 tags a week religiously despite the fact i've never taken nor even offered pictures as a public service. even when offered several hundred $ i decline simply because it's a hobby to me and i don't want to add the pressure of expectations.\n\nnow catch up to today i have an issue with my mother. i've even told her this aspect alone has caused me to almost sell all of my camera gear in the past out of annoyance and this constant nagging of people wanting me to take pictures is just annoying and stressful for some reason for me. not just my mom, i've had this talk with a few family members and they still ask me or expect me to bring my gear out for stupid events like cookouts and stuff. but my mother knows the level of stress and annoyance this causes for me yet today she did it again. wants me to take pictures of my relative at a sports benefit that's being put on for him and his terminal illness. now yes i planned on taking pictures with my phone to document the event and memories while said relative is with us, but i only have a hour to stop at this event. i don't want to run home, then go to the benefit and only have 30 minutes to spend with my relative and then spend that whole 30 minutes looking through my viewfinder of \"all the groups of people who show up\".... \n\ni've told people countless times and family especially always tries to guilt trip me into lugging everything out when i've told them 100x that the type of pictures they want, can be taken on a cell phone. then i always hear the \"but the quality is sooooo much better\". like listen karen you're posting these on fb and not even getting a 5x7 print made...you can't even tell the quality difference. \n\nbleh how do you guys deal with this type of stuff? it seriously has me contemplating giving up photography for good and selling my camera just so i can tell everyone to leave me tf alone when it comes to pictures.", "sortedWord": "None", "identifyer": 1721, "year": "2021"}, {"Unnamed: 0": 112236, "autor": "fraterfamilias123", "date": 1624903345000, "content": "Is Greg Williams' course on SkillFaster worth it? /!/ I've been taking photos more seriously since 2018 when I was gifted a film camera that was way above my skill level.\n\n\nNow that I've been shooting consistently for about 3 years, I feel that I have worked out my camera and I want to upskill. \n\nIs this course worth the $55 price tag?", "link": "https://www.reddit.com/r/photography/comments/o9pr8h/is_greg_williams_course_on_skillfaster_worth_it/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is greg williams' course on skillfaster worth it? /!/ i've been taking photos more seriously since 2018 when i was gifted a film camera that was way above my skill level.\n\n\nnow that i've been shooting consistently for about 3 years, i feel that i have worked out my camera and i want to upskill. \n\nis this course worth the $55 price -----> tag !!! ?", "sortedWord": "None", "identifyer": 2239, "year": "2021"}, {"Unnamed: 0": 112650, "autor": "kglitter86", "date": 1628377484000, "content": "Newbie here - questions on second/mentor, computer software/app and storage /!/ Hello dear ones. \n\nIf this is posted elsewhere, please tag me and delete this. I'm looking for feedback/advice on:\n\n- apps or drive that you use to sote and share photos (ie. Use photoediting app, Google drive, drop box, etc.)\n\n- apps or software that you use to edit (ie. Photoshop on Mac, gimp on Linux, Lightroom on windows, etc.)\n\n- advice on becoming a second/mentored by a photographer in the area? \n\n- skip being a second and just focus on building my own portfolio? \n\n- pay for online class or just learn crap on own? \n\nThanks! I know its a lot. I have a nikon d3500 and just starting out. Long road but passionate to take on this journey as a beautiful hobby.", "link": "https://www.reddit.com/r/photography/comments/p03f7x/newbie_here_questions_on_secondmentor_computer/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "newbie here - questions on second/mentor, computer software/app and storage /!/ hello dear ones. \n\nif this is posted elsewhere, please -----> tag !!!  me and delete this. i'm looking for feedback/advice on:\n\n- apps or drive that you use to sote and share photos (ie. use photoediting app, google drive, drop box, etc.)\n\n- apps or software that you use to edit (ie. photoshop on mac, gimp on linux, lightroom on windows, etc.)\n\n- advice on becoming a second/mentored by a photographer in the area? \n\n- skip being a second and just focus on building my own portfolio? \n\n- pay for online class or just learn crap on own? \n\nthanks! i know its a lot. i have a nikon d3500 and just starting out. long road but passionate to take on this journey as a beautiful hobby.", "sortedWord": "None", "identifyer": 2669, "year": "2021"}, {"Unnamed: 0": 113050, "autor": "howtheturntables2005", "date": 1632255505000, "content": "How to start an Instagram photography blog /!/ I have pics from all over the world. I really want to start a public install and am looking for tips!\n\nI have an account and hash tag I love. I have thousands of pics to pick from. \n\nI know nothing about how to monetize and gain followers. \n\n-  how often should I post?\n-  what should I post?\n-  are there has tags I should add?\n-  should I add a watermark or not? Technically everything is copyrighted as soon as you take a picture but …", "link": "https://www.reddit.com/r/photography/comments/psr2st/how_to_start_an_instagram_photography_blog/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "how to start an instagram photography blog /!/ i have pics from all over the world. i really want to start a public install and am looking for tips!\n\ni have an account and hash -----> tag !!!  i love. i have thousands of pics to pick from. \n\ni know nothing about how to monetize and gain followers. \n\n-  how often should i post?\n-  what should i post?\n-  are there has tags i should add?\n-  should i add a watermark or not? technically everything is copyrighted as soon as you take a picture but …", "sortedWord": "None", "identifyer": 3082, "year": "2021"}, {"Unnamed: 0": 113109, "autor": "adelaidop", "date": 1632211506000, "content": "Chicago /!/ \nI’m visiting Chicago for a couple of days was wondering if there’s like photography group around the area that I can tag along with. I know everybody would be trying to catch the henge but I don’t know where the best spot is", "link": "https://www.reddit.com/r/photography/comments/psebzp/chicago/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "chicago /!/ \ni’m visiting chicago for a couple of days was wondering if there’s like photography group around the area that i can -----> tag !!!  along with. i know everybody would be trying to catch the henge but i don’t know where the best spot is", "sortedWord": "None", "identifyer": 3142, "year": "2021"}, {"Unnamed: 0": 113883, "autor": "ChiefGinger", "date": 1609702738000, "content": "Took product shots for fun, brand reached out for use on Social Media. What would your response be? /!/ Took a few product shots (photo + video) for fun while out hiking of a small/medium sized beverage brand's product. A buddy posted &amp; tagged them, the brand reached out to me and asked about re-sharing on their social media (they have 30k followers) for credit, I believe they already mentioned they \"didn't have a budget\" while chatting with my friend. I'm a freelance videographer, but this is a first for me in terms of having to work backwards on terms after a shoots been completed. Took just a few minutes to snap and edit them so I don't feel particularly attached, but they have value and would take considerable effort for them to recapture the same content I did. Curious how you guys would approach this. What's a reasonable request for payment per photo for SM usage rights, and if I did allow them to use for free, have you guys ever seen that blossom into future paid work. I'm aware that the offer to reshare for credit doesn't directly offer me value whatsoever.", "link": "https://www.reddit.com/r/photography/comments/kpralu/took_product_shots_for_fun_brand_reached_out_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "took product shots for fun, brand reached out for use on social media. what would your response be? /!/ took a few product shots (photo + video) for fun while out hiking of a small/medium sized beverage brand's product. a buddy posted &amp; -----> tagged !!!  them, the brand reached out to me and asked about re-sharing on their social media (they have 30k followers) for credit, i believe they already mentioned they \"didn't have a budget\" while chatting with my friend. i'm a freelance videographer, but this is a first for me in terms of having to work backwards on terms after a shoots been completed. took just a few minutes to snap and edit them so i don't feel particularly attached, but they have value and would take considerable effort for them to recapture the same content i did. curious how you guys would approach this. what's a reasonable request for payment per photo for sm usage rights, and if i did allow them to use for free, have you guys ever seen that blossom into future paid work. i'm aware that the offer to reshare for credit doesn't directly offer me value whatsoever.", "sortedWord": "None", "identifyer": 3950, "year": "2021"}, {"Unnamed: 0": 114679, "autor": "penisrevolver", "date": 1611767957000, "content": "Is there a point in getting leica lenses? /!/ I recently made some money from the stock market and been considering to treat myself.\n\n I have the Nikon z system with a 24-200 and a 85 1.8. I’ve heard some much about the legendary leica lenses and tempted to get the summicron 50, since I’ve heard so many good things about the leica build quality, and astounding image that it captures. \n\nHowever with that price tag I can possibly get a 24-70 2.8 and get rid of my 85 1.8 which would allow me to trade for a 14-30. I’m not a working professional so it’s only a hobby for me. I do mainly portraits and sometimes shoot cars for fun, plus the occasional trips I go onto. \n\n My question is, does the price tag truly reflect the quality of the lens, or am I better off buying the Z series?", "link": "https://www.reddit.com/r/photography/comments/l69ggt/is_there_a_point_in_getting_leica_lenses/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is there a point in getting leica lenses? /!/ i recently made some money from the stock market and been considering to treat myself.\n\n i have the nikon z system with a 24-200 and a 85 1.8. i’ve heard some much about the legendary leica lenses and tempted to get the summicron 50, since i’ve heard so many good things about the leica build quality, and astounding image that it captures. \n\nhowever with that price -----> tag !!!  i can possibly get a 24-70 2.8 and get rid of my 85 1.8 which would allow me to trade for a 14-30. i’m not a working professional so it’s only a hobby for me. i do mainly portraits and sometimes shoot cars for fun, plus the occasional trips i go onto. \n\n my question is, does the price tag truly reflect the quality of the lens, or am i better off buying the z series?", "sortedWord": "None", "identifyer": 4781, "year": "2021"}, {"Unnamed: 0": 114696, "autor": "tharakadananj", "date": 1611676999000, "content": "Sony Xperia Pro launched $2,500 price tag phone, 4K camera monitor /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/l5gyr3/sony_xperia_pro_launched_2500_price_tag_phone_4k/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sony xperia pro launched $2,500 price -----> tag !!!  phone, 4k camera monitor /!/ [removed]", "sortedWord": "None", "identifyer": 4798, "year": "2021"}, {"Unnamed: 0": 114787, "autor": "UWG_Cato2K", "date": 1612749315000, "content": "Mfw the client actually tags you in the photos.", "link": "https://www.reddit.com/r/photography/comments/lf1a2s/mfw_the_client_actually_tags_you_in_the_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "mfw the client actually -----> tags !!!  you in the photos.", "sortedWord": "None", "identifyer": 4889, "year": "2021"}, {"Unnamed: 0": 115507, "autor": "something_clever_94", "date": 1615484202000, "content": "[HELP!!!] Digital Photography and Color Management for Web Browsers (Mac) /!/ I need someone who has experience dealing with these issues to help walk me through the best settings for my computer display, lightroom, final cut, and web browser. Please don’t comment if you are only guessing. I’m looking for someone who has navigated these specific issues before to help me. Thanks in advance!\n\n&amp;#x200B;\n\n\\*Systems:\\*\n\n&amp;#x200B;\n\nI work on a 2017 27-inch iMac currently operating Catalina 10.15.5\n\nI edit photos in Lightroom v4.0\n\nI edit videos in Final Cut Pro X v10.4.4\n\nI am building my website with Squarespace.\n\nMy default browser is Firefox. I also have Safari and Chrome.\n\n(So far as I know, all browsers are using default color settings.)\n\n&amp;#x200B;\n\n\\*Long Story:\\*\n\n&amp;#x200B;\n\nI am building a website for my photography and video production freelancing. I commissioned a friend of mine to design a logo for me. A couple weeks ago she sent me the final .png file in facebook messenger. When I viewed the image preview in facebook using Firefox as my browser, I was happy with the color (a rich golden yellow). But when I downloaded it and viewed the file in Preview, the color looked noticeably faded/lighter/undersaturated.\n\n&amp;#x200B;\n\nAfter some back and forth experimenting with her export settings, I realized the issue was not with the file, but with my iMac’s display. Under \\[System Preferences &gt; Displays &gt; Color\\] the Display profile is set to “iMac”. When I changed the Display profile to “Apple RGB” and opened the logo .png file in Preview, the color matched what I saw in Firefox.\n\n&amp;#x200B;\n\nThe only problem is that now all of my other photos which were edited using the “iMac” Display profile are now completely oversaturated and look terrible.\n\n&amp;#x200B;\n\nI did not know that my computer had its own unique display profile and it’s causing me a massive headache because of the inconsistencies in how different web browsers manage color.\n\n&amp;#x200B;\n\n\\*Current Dilemma:\\*\n\n&amp;#x200B;\n\nMy website looks completely different depending on which browser I use and which Display profile I have set on my computer. Not only are the photos differently colored, but so is the color palate built into Squarespace (which is really confusing because I picked the specific color using hsl data – so shouldn’t it be the same across all browsers?)\n\n&amp;#x200B;\n\nBelow I will describe what I am seeing when I look at the website in each browser under the different Display profiles.\n\n&amp;#x200B;\n\n(Note: all Uploaded Images were edited for color using the “iMac” Display profile on my computer. The Logo.png was made on my friend’s computer, likely using some version of a standard RGB Display profile.)\n\n&amp;#x200B;\n\n\\*Display profile: “iMac”\\*\n\n&amp;#x200B;\n\nFirefox\n\n\\-Squarespace Color: Correct Color\n\n\\-Logo.png: Correct Color\n\n\\-Uploaded Images: Correct Color\n\n&amp;#x200B;\n\nSafari\n\n\\-Squarespace Color: Under-saturated\n\n\\-Logo.png: Under-saturated\n\n\\-Uploaded Images: Correct Color\n\n&amp;#x200B;\n\nChrome\n\n\\-Squarespace Color: Under-saturated\n\n\\-Logo.png: Under-saturated\n\n\\-Uploaded Images: Correct Color\n\n&amp;#x200B;\n\n\\*Display profile “Apple RGB”\\*\n\n&amp;#x200B;\n\nFirefox\n\n\\-Squarespace Color: Correct Color\n\n\\-Logo.png: Correct Color\n\n\\-Uploaded Images: Correct Color\n\n&amp;#x200B;\n\nSafari\n\n\\-Squarespace Color: Correct Color\n\n\\-Logo.png: Correct Color\n\n\\-Uploaded Images: Over-saturated\n\n&amp;#x200B;\n\nChrome\n\n\\-Squarespace Color: Correct Color\n\n\\-Logo.png: Correct Color\n\n\\-Uploaded Images: Over-saturated\n\n&amp;#x200B;\n\nFrom what I can tell, Firefox seems to have the best color management. In either Display profile, it still presents the colors the way I want them even though they don’t share a common original color space. The uploaded images look the way they looked when I edited them in “iMac” even when my display is set to “Apple RGB”. The logo.png looks the way I presume it looked when my friend edited it on her computer. They don’t share a common original color space but both are appearing the correct color regardless of the Display setting on my computer. This is ideal because it tells me my images will always be viewed by others as I intended them to.\n\n&amp;#x200B;\n\nThe problem is, apparently nobody actually uses Firefox.\n\nChrome is far and away the most used browser in the U.S with Safari a close second. So if someone is looking at my website in either of the two most popular browsers, nothing will look as intended. That’s a problem because I’m trying to sell my services based on my personal aesthetic – but my work is not being accurately represented.\n\n&amp;#x200B;\n\n\\*Questions:\\*\n\n&amp;#x200B;\n\nWhy does Firefox show my uploaded images correctly (as viewed in “iMac” when edited) regardless of which Display profile I’m currently using? Was the image tagged with that info when it was exported? Why don’t other browsers recognize that same info?\n\n&amp;#x200B;\n\nDo most people with computers use some version of RGB for their Display profile (as opposed to something designed for Wide Gamut Display like my “iMac” profile)? If so, does that mean I should also use RGB for everything so I know my images will match what most people are seeing? I feel like that defeats the purpose of having my iMac with its optimized Display profile.\n\n&amp;#x200B;\n\nAm I overcomplicating this issue in my head? I’m seriously at a loss of how best to go forward. Do I need to re-edit all of my old photos using “Apple RGB” so they actually look the way I want them to when I upload them to Squarespace?\n\n&amp;#x200B;\n\nWhich Display profile should I leave my computer set to? I prefer using my computer on “iMac” because, as it was custom designed for this machine, it just looks better. But if I use “Apple RGB” presumably anything new I edit going forward will look correct in any web browser when I upload it to my website.\n\n&amp;#x200B;\n\nIf I edit using “AppleRGB” will people using Wide Gamut Displays like mine experience the images looking faded by comparison?\n\n&amp;#x200B;\n\nWill these issues affect the color of my videos in the same way when I export and upload them?\n\n&amp;#x200B;\n\nIs there a factor I’m not considering in this equation? Is there a simple fix I don’t know about?\n\n&amp;#x200B;\n\nShould I just accept that these issues exist and not go crazy trying to manage it? I don’t think I’m being picky to want my images to look as intended across all platforms.", "link": "https://www.reddit.com/r/photography/comments/m2vuqs/help_digital_photography_and_color_management_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "[help!!!] digital photography and color management for web browsers (mac) /!/ i need someone who has experience dealing with these issues to help walk me through the best settings for my computer display, lightroom, final cut, and web browser. please don’t comment if you are only guessing. i’m looking for someone who has navigated these specific issues before to help me. thanks in advance!\n\n&amp;#x200b;\n\n\\*systems:\\*\n\n&amp;#x200b;\n\ni work on a 2017 27-inch imac currently operating catalina 10.15.5\n\ni edit photos in lightroom v4.0\n\ni edit videos in final cut pro x v10.4.4\n\ni am building my website with squarespace.\n\nmy default browser is firefox. i also have safari and chrome.\n\n(so far as i know, all browsers are using default color settings.)\n\n&amp;#x200b;\n\n\\*long story:\\*\n\n&amp;#x200b;\n\ni am building a website for my photography and video production freelancing. i commissioned a friend of mine to design a logo for me. a couple weeks ago she sent me the final .png file in facebook messenger. when i viewed the image preview in facebook using firefox as my browser, i was happy with the color (a rich golden yellow). but when i downloaded it and viewed the file in preview, the color looked noticeably faded/lighter/undersaturated.\n\n&amp;#x200b;\n\nafter some back and forth experimenting with her export settings, i realized the issue was not with the file, but with my imac’s display. under \\[system preferences &gt; displays &gt; color\\] the display profile is set to “imac”. when i changed the display profile to “apple rgb” and opened the logo .png file in preview, the color matched what i saw in firefox.\n\n&amp;#x200b;\n\nthe only problem is that now all of my other photos which were edited using the “imac” display profile are now completely oversaturated and look terrible.\n\n&amp;#x200b;\n\ni did not know that my computer had its own unique display profile and it’s causing me a massive headache because of the inconsistencies in how different web browsers manage color.\n\n&amp;#x200b;\n\n\\*current dilemma:\\*\n\n&amp;#x200b;\n\nmy website looks completely different depending on which browser i use and which display profile i have set on my computer. not only are the photos differently colored, but so is the color palate built into squarespace (which is really confusing because i picked the specific color using hsl data – so shouldn’t it be the same across all browsers?)\n\n&amp;#x200b;\n\nbelow i will describe what i am seeing when i look at the website in each browser under the different display profiles.\n\n&amp;#x200b;\n\n(note: all uploaded images were edited for color using the “imac” display profile on my computer. the logo.png was made on my friend’s computer, likely using some version of a standard rgb display profile.)\n\n&amp;#x200b;\n\n\\*display profile: “imac”\\*\n\n&amp;#x200b;\n\nfirefox\n\n\\-squarespace color: correct color\n\n\\-logo.png: correct color\n\n\\-uploaded images: correct color\n\n&amp;#x200b;\n\nsafari\n\n\\-squarespace color: under-saturated\n\n\\-logo.png: under-saturated\n\n\\-uploaded images: correct color\n\n&amp;#x200b;\n\nchrome\n\n\\-squarespace color: under-saturated\n\n\\-logo.png: under-saturated\n\n\\-uploaded images: correct color\n\n&amp;#x200b;\n\n\\*display profile “apple rgb”\\*\n\n&amp;#x200b;\n\nfirefox\n\n\\-squarespace color: correct color\n\n\\-logo.png: correct color\n\n\\-uploaded images: correct color\n\n&amp;#x200b;\n\nsafari\n\n\\-squarespace color: correct color\n\n\\-logo.png: correct color\n\n\\-uploaded images: over-saturated\n\n&amp;#x200b;\n\nchrome\n\n\\-squarespace color: correct color\n\n\\-logo.png: correct color\n\n\\-uploaded images: over-saturated\n\n&amp;#x200b;\n\nfrom what i can tell, firefox seems to have the best color management. in either display profile, it still presents the colors the way i want them even though they don’t share a common original color space. the uploaded images look the way they looked when i edited them in “imac” even when my display is set to “apple rgb”. the logo.png looks the way i presume it looked when my friend edited it on her computer. they don’t share a common original color space but both are appearing the correct color regardless of the display setting on my computer. this is ideal because it tells me my images will always be viewed by others as i intended them to.\n\n&amp;#x200b;\n\nthe problem is, apparently nobody actually uses firefox.\n\nchrome is far and away the most used browser in the u.s with safari a close second. so if someone is looking at my website in either of the two most popular browsers, nothing will look as intended. that’s a problem because i’m trying to sell my services based on my personal aesthetic – but my work is not being accurately represented.\n\n&amp;#x200b;\n\n\\*questions:\\*\n\n&amp;#x200b;\n\nwhy does firefox show my uploaded images correctly (as viewed in “imac” when edited) regardless of which display profile i’m currently using? was the image -----> tagged !!!  with that info when it was exported? why don’t other browsers recognize that same info?\n\n&amp;#x200b;\n\ndo most people with computers use some version of rgb for their display profile (as opposed to something designed for wide gamut display like my “imac” profile)? if so, does that mean i should also use rgb for everything so i know my images will match what most people are seeing? i feel like that defeats the purpose of having my imac with its optimized display profile.\n\n&amp;#x200b;\n\nam i overcomplicating this issue in my head? i’m seriously at a loss of how best to go forward. do i need to re-edit all of my old photos using “apple rgb” so they actually look the way i want them to when i upload them to squarespace?\n\n&amp;#x200b;\n\nwhich display profile should i leave my computer set to? i prefer using my computer on “imac” because, as it was custom designed for this machine, it just looks better. but if i use “apple rgb” presumably anything new i edit going forward will look correct in any web browser when i upload it to my website.\n\n&amp;#x200b;\n\nif i edit using “applergb” will people using wide gamut displays like mine experience the images looking faded by comparison?\n\n&amp;#x200b;\n\nwill these issues affect the color of my videos in the same way when i export and upload them?\n\n&amp;#x200b;\n\nis there a factor i’m not considering in this equation? is there a simple fix i don’t know about?\n\n&amp;#x200b;\n\nshould i just accept that these issues exist and not go crazy trying to manage it? i don’t think i’m being picky to want my images to look as intended across all platforms.", "sortedWord": "None", "identifyer": 5633, "year": "2021"}, {"Unnamed: 0": 115832, "autor": "bino_navise", "date": 1617741301000, "content": "Using both LR classic and CC? /!/ Hi, I'm still using a standalone version of Lightroom Classic and due to compatibility I haven't upgraded OS of my Mac in the past years. Most of my pictures I import in Classic and I edit them afterwards (presets, tags, folders,...).\n\nAdditionally, I have a LR mobile license to edit and maintain my mobile pictures or those I sync to it from my camera.\n\nI'm now interested in connecting both set-ups, or at least to have my edited pictures (preferable jpg only) in LR CC, but I have a few questions on this.\n\n\\- in my current state of having Lightroom classic (no CC subscription/only mobile) is there an easy way to get my edited pictures in Lightroom CC? I see I can sync my classic catalog to Lightroom Mobile but I don't want to push all my full catalog including raw files into Lightroom Mobile.\n\n\\- is anybody of you using the Lightroom classic + CC package? If so, what is your workflow? And would it be possible to have the RAW files in classic and only push the jpgs to CC?", "link": "https://www.reddit.com/r/photography/comments/mll2yp/using_both_lr_classic_and_cc/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "using both lr classic and cc? /!/ hi, i'm still using a standalone version of lightroom classic and due to compatibility i haven't upgraded os of my mac in the past years. most of my pictures i import in classic and i edit them afterwards (presets, -----> tags !!! , folders,...).\n\nadditionally, i have a lr mobile license to edit and maintain my mobile pictures or those i sync to it from my camera.\n\ni'm now interested in connecting both set-ups, or at least to have my edited pictures (preferable jpg only) in lr cc, but i have a few questions on this.\n\n\\- in my current state of having lightroom classic (no cc subscription/only mobile) is there an easy way to get my edited pictures in lightroom cc? i see i can sync my classic catalog to lightroom mobile but i don't want to push all my full catalog including raw files into lightroom mobile.\n\n\\- is anybody of you using the lightroom classic + cc package? if so, what is your workflow? and would it be possible to have the raw files in classic and only push the jpgs to cc?", "sortedWord": "None", "identifyer": 5968, "year": "2021"}, {"Unnamed: 0": 116447, "autor": "videoalex", "date": 1620417857000, "content": "Best place and practice to host/share/organize a glut of family photographs? /!/ My father passed a couple of months ago, and I took all of the family photo albums from his house. I have hundreds of photos to scan, so I bought a sheet-fed style photo scanner that does a good job. But now I want to share these with my family of older, non-techy people. Some have PCs, android phones, etc, so I need something that is Mac-friendly, but not Mac-only. \n\nIn my dream I am able to tag all of them with some amount of metadata and create albums for people-my sister's high school boyfriend, for instance, can have all these photos of himself that we have had for 40 years-I would LOVE to be able to just say \"grab all the pictures of Peter\" and make them into a zip. \n\nI have looked at Flickr and done some experiments with it-using a desktop (Mac) app (which was very outdated) I was able to tag the pics but it's slow and clunky. Doesn't look like google photos is much better, although if it is able to tag with AI that'd be a real win. It seems unclear to me what it can do.\n\nI'm willing to pay a reasonable amount for this-just don't know where to start and I'm afraid to blow full steam ahead without a good workflow. Can you pros set me in the best direction?\n\n&amp;#x200B;\n\ntl;dr: platform and workflow suggestions for a glut of old family photographs I'm scanning?", "link": "https://www.reddit.com/r/photography/comments/n77kso/best_place_and_practice_to_hostshareorganize_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "best place and practice to host/share/organize a glut of family photographs? /!/ my father passed a couple of months ago, and i took all of the family photo albums from his house. i have hundreds of photos to scan, so i bought a sheet-fed style photo scanner that does a good job. but now i want to share these with my family of older, non-techy people. some have pcs, android phones, etc, so i need something that is mac-friendly, but not mac-only. \n\nin my dream i am able to -----> tag !!!  all of them with some amount of metadata and create albums for people-my sister's high school boyfriend, for instance, can have all these photos of himself that we have had for 40 years-i would love to be able to just say \"grab all the pictures of peter\" and make them into a zip. \n\ni have looked at flickr and done some experiments with it-using a desktop (mac) app (which was very outdated) i was able to tag the pics but it's slow and clunky. doesn't look like google photos is much better, although if it is able to tag with ai that'd be a real win. it seems unclear to me what it can do.\n\ni'm willing to pay a reasonable amount for this-just don't know where to start and i'm afraid to blow full steam ahead without a good workflow. can you pros set me in the best direction?\n\n&amp;#x200b;\n\ntl;dr: platform and workflow suggestions for a glut of old family photographs i'm scanning?", "sortedWord": "None", "identifyer": 6607, "year": "2021"}, {"Unnamed: 0": 116705, "autor": "Hot-Fisherman2003", "date": 1620911780000, "content": "New photographer has a questiob /!/  Hi everyone I have a question. So wanna start taking good quality pictures and wanted to ask if my camera quality is good I use a Huawei Tag L01 and in my camera details it says 13 Mpx, 4160x3120 px but I hav other options as well should I use this or should I check out the other options.", "link": "https://www.reddit.com/r/photography/comments/nbge8e/new_photographer_has_a_questiob/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "new photographer has a questiob /!/  hi everyone i have a question. so wanna start taking good quality pictures and wanted to ask if my camera quality is good i use a huawei -----> tag !!!  l01 and in my camera details it says 13 mpx, 4160x3120 px but i hav other options as well should i use this or should i check out the other options.", "sortedWord": "None", "identifyer": 6884, "year": "2021"}, {"Unnamed: 0": 116761, "autor": "Oromei", "date": 1621379215000, "content": "Thoughts on apps like Unscripted? /!/ Hey everyone, I was just curious to know what people think of Unscripted, but really more in general just apps that provide pose/prompt inspirations. I have primarily been a landscape/wildlife photographer but recently decided to venture in portraits, grad photos, couples, that sorta area. I figured something like unscripted for a few months while I practice and get used to posing people would be helpful but when I saw the price tag on unscripted I was disappointed though and honestly is the main reason I am personally not using it. I get there are other features but it still seems rather overkill. If there was a cheaper option that didn't have the fluff would anyone use it?", "link": "https://www.reddit.com/r/photography/comments/nfp5hn/thoughts_on_apps_like_unscripted/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "thoughts on apps like unscripted? /!/ hey everyone, i was just curious to know what people think of unscripted, but really more in general just apps that provide pose/prompt inspirations. i have primarily been a landscape/wildlife photographer but recently decided to venture in portraits, grad photos, couples, that sorta area. i figured something like unscripted for a few months while i practice and get used to posing people would be helpful but when i saw the price -----> tag !!!  on unscripted i was disappointed though and honestly is the main reason i am personally not using it. i get there are other features but it still seems rather overkill. if there was a cheaper option that didn't have the fluff would anyone use it?", "sortedWord": "None", "identifyer": 6941, "year": "2021"}, {"Unnamed: 0": 116793, "autor": "Snoo58499", "date": 1621356568000, "content": "Does it make sense to spend a lot of money on a photographic print? /!/ I inquired online about purchasing a print by a photographer I like, and I was shocked that the gallery told me a signed print would cost $6,900 USD. Forgive my ignorance but can someone explain why a photograph might command such a price? A fine painting maybe, but how can a photo justify such a high price tag?\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/nffoa7/does_it_make_sense_to_spend_a_lot_of_money_on_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "does it make sense to spend a lot of money on a photographic print? /!/ i inquired online about purchasing a print by a photographer i like, and i was shocked that the gallery told me a signed print would cost $6,900 usd. forgive my ignorance but can someone explain why a photograph might command such a price? a fine painting maybe, but how can a photo justify such a high price -----> tag !!! ?\n\nthanks!", "sortedWord": "None", "identifyer": 6975, "year": "2021"}, {"Unnamed: 0": 117141, "autor": "thisismattmagbee", "date": 1623361215000, "content": "Photographing swim meets—- I’ve been doing this for a while, but would to know how to tag swimmers. Or even events/heat/lane etc ? I could prob do it manually. But does anyone else have any experience with this? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/nwzasj/photographing_swim_meets_ive_been_doing_this_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "photographing swim meets—- i’ve been doing this for a while, but would to know how to -----> tag !!!  swimmers. or even events/heat/lane etc ? i could prob do it manually. but does anyone else have any experience with this? /!/ [removed]", "sortedWord": "None", "identifyer": 7338, "year": "2021"}, {"Unnamed: 0": 117438, "autor": "NightCityRunner", "date": 1623611455000, "content": "Managing Photo library(Win10/tags/Onedrive) /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/nz3i6f/managing_photo_librarywin10tagsonedrive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "managing photo library(win10/-----> tags !!! /onedrive) /!/ [removed]", "sortedWord": "None", "identifyer": 7644, "year": "2021"}, {"Unnamed: 0": 118156, "autor": "spamrundie", "date": 1624225332000, "content": "How to display images on my D3500 that came from my PC? /!/ Yes, this is weird.\n\nBut I want to succeed in being able to view images that weren't shot on my camera, on my camera (Nikon D3500).\n\nSo far I've managed to copy all the metadata from pictures I took onto a random image online (using ExifToolGUI), but I found that some tags are unwritable, so my camera won't display it.\n\nHas anyone here succeded in doing this (video or pic), and is there a way to edit tags that are not editable?", "link": "https://www.reddit.com/r/photography/comments/o4ftl7/how_to_display_images_on_my_d3500_that_came_from/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "how to display images on my d3500 that came from my pc? /!/ yes, this is weird.\n\nbut i want to succeed in being able to view images that weren't shot on my camera, on my camera (nikon d3500).\n\nso far i've managed to copy all the metadata from pictures i took onto a random image online (using exiftoolgui), but i found that some -----> tags !!!  are unwritable, so my camera won't display it.\n\nhas anyone here succeded in doing this (video or pic), and is there a way to edit tags that are not editable?", "sortedWord": "None", "identifyer": 8384, "year": "2021"}, {"Unnamed: 0": 119552, "autor": "cur1ous1", "date": 1632170763000, "content": "I’ll never buy used equipment again… /!/ I ordered a Nikon D850 from one of the major pre-owned equipment vendors.  It was listed/rated as just 1 grade below brand new. \n\nWhen I received the package and opened it, I found that the case it was in was tagged as a D850. However when I opened the case it came in, I discovered a rather well-used Nikon D7200. \n\nI took some pictures of what I received and engaged the reseller for an exchange, and I waited 4 days for the replacement arrived.\n\nToday, I received the replacement.  This time it was a D850. However, a D850 with a broken and inoperable autofocus system and hardly in a “ just less than brand new” condition. \n\nI called again, and initiated a return for a full refund. Just got back from another trip to a FedEx drop off location….\n\nI’ll not disclose which reseller it was, unless my refund doesn’t hit my cc by Friday..  What I will say, it’s one of the big 3 most often mentioned. \n\nMood: Fucking pissed…", "link": "https://www.reddit.com/r/photography/comments/ps3fq7/ill_never_buy_used_equipment_again/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "i’ll never buy used equipment again… /!/ i ordered a nikon d850 from one of the major pre-owned equipment vendors.  it was listed/rated as just 1 grade below brand new. \n\nwhen i received the package and opened it, i found that the case it was in was -----> tagged !!!  as a d850. however when i opened the case it came in, i discovered a rather well-used nikon d7200. \n\ni took some pictures of what i received and engaged the reseller for an exchange, and i waited 4 days for the replacement arrived.\n\ntoday, i received the replacement.  this time it was a d850. however, a d850 with a broken and inoperable autofocus system and hardly in a “ just less than brand new” condition. \n\ni called again, and initiated a return for a full refund. just got back from another trip to a fedex drop off location….\n\ni’ll not disclose which reseller it was, unless my refund doesn’t hit my cc by friday..  what i will say, it’s one of the big 3 most often mentioned. \n\nmood: fucking pissed…", "sortedWord": "None", "identifyer": 9838, "year": "2021"}, {"Unnamed: 0": 120949, "autor": "BennettShoots", "date": 1635140843000, "content": "Organizing and Deleting Bad Photos App! /!/ Hey, I got 25k photos to go through from past trips and I decided it's about time to finally organize and delete bad/duplicates so I can move onto the editing process. I need an app that makes it easier for me to mass rotate photos (I shoot mainly portrait for Instagram) and view them one by one so I can tag them or have a way to mass delete them. I don't want a duplicate deleting app (I want to personally go through and pick them myself). Pls help! Paid and free apps, it doesn't matter! ALSO IMPORTANT: I edit and do everything on my MacBook Pro.", "link": "https://www.reddit.com/r/photography/comments/qfa3le/organizing_and_deleting_bad_photos_app/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "organizing and deleting bad photos app! /!/ hey, i got 25k photos to go through from past trips and i decided it's about time to finally organize and delete bad/duplicates so i can move onto the editing process. i need an app that makes it easier for me to mass rotate photos (i shoot mainly portrait for instagram) and view them one by one so i can -----> tag !!!  them or have a way to mass delete them. i don't want a duplicate deleting app (i want to personally go through and pick them myself). pls help! paid and free apps, it doesn't matter! also important: i edit and do everything on my macbook pro.", "sortedWord": "None", "identifyer": 11301, "year": "2021"}, {"Unnamed: 0": 121457, "autor": "unscribeyourself", "date": 1611070274000, "content": "Looking for a dead simple mass cloud storage solution... /!/ I'm surprised I haven't been able to find one with this exact feature set.\n\nI'd like to upload thousands of RAW photos to cloud storage for backup, and have the ability to give them metadata - e.g., tags (that I can later search by), description, etc.\n\nThen I'd like the server to be able to reply with a photograph of mine in the format I want, on demand - for example, I could request the RAW itself, a 4K PNG, or a 1080p JPG, and it would automatically convert it and send me the photograph in the requested format. I'd like to be able to set up permissions for these different formats - for example, say that anyone can access a 1080p JPG, but only I can access the RAW. \n\nAnd I'd like nothing more. I don't want a social network, or an ecommerce platform, or online editing suite, or anything else. Just mass photo storage and easy, versatile access.\n\nHas anyone used such a service? Does it exist?", "link": "https://www.reddit.com/r/photography/comments/l0m3kx/looking_for_a_dead_simple_mass_cloud_storage/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "looking for a dead simple mass cloud storage solution... /!/ i'm surprised i haven't been able to find one with this exact feature set.\n\ni'd like to upload thousands of raw photos to cloud storage for backup, and have the ability to give them metadata - e.g., -----> tags !!!  (that i can later search by), description, etc.\n\nthen i'd like the server to be able to reply with a photograph of mine in the format i want, on demand - for example, i could request the raw itself, a 4k png, or a 1080p jpg, and it would automatically convert it and send me the photograph in the requested format. i'd like to be able to set up permissions for these different formats - for example, say that anyone can access a 1080p jpg, but only i can access the raw. \n\nand i'd like nothing more. i don't want a social network, or an ecommerce platform, or online editing suite, or anything else. just mass photo storage and easy, versatile access.\n\nhas anyone used such a service? does it exist?", "sortedWord": "None", "identifyer": 11833, "year": "2021"}, {"Unnamed: 0": 121667, "autor": "h1le", "date": 1611322751000, "content": "Canon Korea is going to replace EOS-R5, R6's damaged part for $25~$30 /!/ Few month ago, Some R5, R6 users from South Korea were reporting possible sun damage to specific part surrounding sensor([link](http://www.slrclub.com/bbs/vx2.php?id=canon_d30_forum&amp;keyword=%EC%84%BC%EC%84%9C&amp;setsearch=subject&amp;no=4487545)). Canon Korea's initial response was that If they want to fix it, they have to change whole assembly with huge price tag.\n\nBut few month later, Canon Korea told to R5, R6 owners that from now on they can replace damaged parts to improved part without whole assembly replacement. They said that they used not easily melting material on improved one and replacement cost will be $25 for R6 and $30 for R5([link](http://www.slrclub.com/bbs/vx2.php?id=canon_d30_forum&amp;no=4491875)).", "link": "https://www.reddit.com/r/photography/comments/l2nwsv/canon_korea_is_going_to_replace_eosr5_r6s_damaged/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "canon korea is going to replace eos-r5, r6's damaged part for $25~$30 /!/ few month ago, some r5, r6 users from south korea were reporting possible sun damage to specific part surrounding sensor([link](http://www.slrclub.com/bbs/vx2.php?id=canon_d30_forum&amp;keyword=%ec%84%bc%ec%84%9c&amp;setsearch=subject&amp;no=4487545)). canon korea's initial response was that if they want to fix it, they have to change whole assembly with huge price -----> tag !!! .\n\nbut few month later, canon korea told to r5, r6 owners that from now on they can replace damaged parts to improved part without whole assembly replacement. they said that they used not easily melting material on improved one and replacement cost will be $25 for r6 and $30 for r5([link](http://www.slrclub.com/bbs/vx2.php?id=canon_d30_forum&amp;no=4491875)).", "sortedWord": "None", "identifyer": 12050, "year": "2021"}, {"Unnamed: 0": 122110, "autor": "Joefischer", "date": 1613779756000, "content": "Organization of 500k+ digital photos that is currently... Unorganized /!/ My mom has a hard drive of over 500k photos which is almost 480gb of data.  The current structure is folders which worked well for a few years but now we have folders like Memory Card Dump 2012... New Folder, New Folder (2), etc...  This is all on a single hard drive (am currently looking at a NAS for some safer storage practices)\n\n&amp;#x200B;\n\nWhat I am looking for is how are you folks organizing your large collections of photos, Lightroom? Apple Photos? Just tags in Windows Explorer? I know this is going to be a large undertaking of some form but just don't even know where to start. \n\n&amp;#x200B;\n\nP.S. Sorry if this is the wrong subreddit - if so please let me know a better subreddit.", "link": "https://www.reddit.com/r/photography/comments/lnuaq3/organization_of_500k_digital_photos_that_is/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "organization of 500k+ digital photos that is currently... unorganized /!/ my mom has a hard drive of over 500k photos which is almost 480gb of data.  the current structure is folders which worked well for a few years but now we have folders like memory card dump 2012... new folder, new folder (2), etc...  this is all on a single hard drive (am currently looking at a nas for some safer storage practices)\n\n&amp;#x200b;\n\nwhat i am looking for is how are you folks organizing your large collections of photos, lightroom? apple photos? just -----> tags !!!  in windows explorer? i know this is going to be a large undertaking of some form but just don't even know where to start. \n\n&amp;#x200b;\n\np.s. sorry if this is the wrong subreddit - if so please let me know a better subreddit.", "sortedWord": "None", "identifyer": 12506, "year": "2021"}, {"Unnamed: 0": 122622, "autor": "aquic", "date": 1617606055000, "content": "What programs can I use to download and organize photos on Mac /!/ I have very recently transitioned from Ubuntu to Mac and I am at a loss regarding how to substitute Rapid Photo Downloader. I am looking for a program that allows me to download photos and videos from an SD card and organizes them in folders based on the date/tag and renames them. \n\nAny suggestions on what programs you use at the very beginning of your editing pipeline?", "link": "https://www.reddit.com/r/photography/comments/mkeq5t/what_programs_can_i_use_to_download_and_organize/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "what programs can i use to download and organize photos on mac /!/ i have very recently transitioned from ubuntu to mac and i am at a loss regarding how to substitute rapid photo downloader. i am looking for a program that allows me to download photos and videos from an sd card and organizes them in folders based on the date/-----> tag !!!  and renames them. \n\nany suggestions on what programs you use at the very beginning of your editing pipeline?", "sortedWord": "None", "identifyer": 13048, "year": "2021"}, {"Unnamed: 0": 123849, "autor": "Telikad", "date": 1623192877000, "content": "This iOS Shortcut will automatically set your wallpaper to a different FStopper's photograph each day /!/ *Note: It's finally done! This shortcut is the fourth iteration of* u/mvan231*'s shortcut, the later three versions made by myself. Here's the link:*\n\n[https://www.icloud.com/shortcuts/58cdbd6622c84e33b43620aa74dff23b](https://www.icloud.com/shortcuts/58cdbd6622c84e33b43620aa74dff23b) \n\nIf you're like me, you're easily bored by the same wallpaper each day. You want something new, something unique! This Shortcut does just that, and it used FStopper's enormous community photography library. You can easily pick which category (tag) you want to use, including the Photo of the Day, Editor's picks, and various tags.\n\n**To setup this Shortcut to run automatically,** ***you will need to follow these steps:***  \n1. Open Shortcuts and run any of the preinstalled options (iOS security requirement)  \n2. Go to settings, choose Shortcuts, and enable Shortcuts from untrusted locations  \n3. Download the above shortcut  \n4. Create a new automation, using the charging trigger so you can opt to run without prompt  \n5. Add the 'Run a Shortcut' action to your new automation  \n6. That's it! Enjoy!\n\nPlease note, Shortcuts is a powerful application that should be used with care. Always thoroughly examine downloaded Shortcuts before running them! **This shortcut does the following:**  \n1. Creates a database of previously used wallpapers in Notes to prevent duplicates  \n2. Check if the user is connected to WiFi, if so continues  \n3. Queries a variety of FStopper's Community photograph libraries, depending on the category chosen by the user  \n4. Downloads a never-before-used image and sets it as your wallpaper  \n5. Logs the new wallpaper in the database", "link": "https://www.reddit.com/r/photography/comments/nvgzxp/this_ios_shortcut_will_automatically_set_your/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "this ios shortcut will automatically set your wallpaper to a different fstopper's photograph each day /!/ *note: it's finally done! this shortcut is the fourth iteration of* u/mvan231*'s shortcut, the later three versions made by myself. here's the link:*\n\n[https://www.icloud.com/shortcuts/58cdbd6622c84e33b43620aa74dff23b](https://www.icloud.com/shortcuts/58cdbd6622c84e33b43620aa74dff23b) \n\nif you're like me, you're easily bored by the same wallpaper each day. you want something new, something unique! this shortcut does just that, and it used fstopper's enormous community photography library. you can easily pick which category (-----> tag !!! ) you want to use, including the photo of the day, editor's picks, and various tags.\n\n**to setup this shortcut to run automatically,** ***you will need to follow these steps:***  \n1. open shortcuts and run any of the preinstalled options (ios security requirement)  \n2. go to settings, choose shortcuts, and enable shortcuts from untrusted locations  \n3. download the above shortcut  \n4. create a new automation, using the charging trigger so you can opt to run without prompt  \n5. add the 'run a shortcut' action to your new automation  \n6. that's it! enjoy!\n\nplease note, shortcuts is a powerful application that should be used with care. always thoroughly examine downloaded shortcuts before running them! **this shortcut does the following:**  \n1. creates a database of previously used wallpapers in notes to prevent duplicates  \n2. check if the user is connected to wifi, if so continues  \n3. queries a variety of fstopper's community photograph libraries, depending on the category chosen by the user  \n4. downloads a never-before-used image and sets it as your wallpaper  \n5. logs the new wallpaper in the database", "sortedWord": "None", "identifyer": 14328, "year": "2021"}, {"Unnamed: 0": 124046, "autor": "Many-Priority-2951", "date": 1624463696000, "content": "Theft - need photo enhanced. This is a still image from a video of a person who stole my trailer. Can someone help enhance the tag on the white SUV so the police can arrest him? /!/ [removed]", "link": "https://www.reddit.com/r/photography/comments/o6fnuj/theft_need_photo_enhanced_this_is_a_still_image/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "theft - need photo enhanced. this is a still image from a video of a person who stole my trailer. can someone help enhance the -----> tag !!!  on the white suv so the police can arrest him? /!/ [removed]", "sortedWord": "None", "identifyer": 14533, "year": "2021"}, {"Unnamed: 0": 124360, "autor": "roguespectre67", "date": 1621871312000, "content": "Initiative is everything! /!/ Hi all.\n\nSome of you might remember me from the post a week or so ago in which I was excited for getting my first actual paycheck for doing photography that I enjoyed rather than just what I could convince people was worth paying for. If you don't remember, I subcontract for a business that covers mountain bike races in my region.\n\nWell, the stars aligned this week such that I needed to be out of the house on the weekend and didn't have an MTB race to go to, so I decided to head out to a dirt bike track, as they were having a race and I figured I might as well go shooting instead of twiddle my thumbs until I could go home. I'd been out a few times before and thoroughly enjoyed shooting.\n\nWhile I was there, I realized that my website platform probably would support setting up a purchase gallery, so I didn't have to do what my main photo gig does and set up a second site on SmugMug, meaning I could get fast turnaround. Then I had the bright idea (if I do say so myself) of heading to the leaderboard and taking pictures of the results, which included rider name, number, and other information that would be useful in identifying them online.\n\nI'm now in the process of finding all of the riders I have photos of on Instagram, and reaching out to them with a link to the gallery. I've only made a few sales so far because I was up pretty late working on it and most of them were probably asleep, but that's already enough to cover the cost of entry for the event and the gas it took to get there and back. I even have one rider, that also owns a rental business, looking to purchase commercial licenses for some of them, which obviously I'm charging a premium for.\n\nI guess my point is that every opportunity I've ever gotten in my professional photo career has been because I took the initiative and made them happen. My main photo gig came about when I reached out to the head photographer and asked to tag along, not even knowing beforehand that he was looking for new people to hire. This time around, I decided to stop waiting for people to ask to buy things and actively find the leads myself, and it looks like it's already literally paying off. Don't be afraid to put yourself out there when you're trying to make your money doing this. The worst that can happen is they can say \"no thanks\".", "link": "https://www.reddit.com/r/photography/comments/nk114d/initiative_is_everything/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "initiative is everything! /!/ hi all.\n\nsome of you might remember me from the post a week or so ago in which i was excited for getting my first actual paycheck for doing photography that i enjoyed rather than just what i could convince people was worth paying for. if you don't remember, i subcontract for a business that covers mountain bike races in my region.\n\nwell, the stars aligned this week such that i needed to be out of the house on the weekend and didn't have an mtb race to go to, so i decided to head out to a dirt bike track, as they were having a race and i figured i might as well go shooting instead of twiddle my thumbs until i could go home. i'd been out a few times before and thoroughly enjoyed shooting.\n\nwhile i was there, i realized that my website platform probably would support setting up a purchase gallery, so i didn't have to do what my main photo gig does and set up a second site on smugmug, meaning i could get fast turnaround. then i had the bright idea (if i do say so myself) of heading to the leaderboard and taking pictures of the results, which included rider name, number, and other information that would be useful in identifying them online.\n\ni'm now in the process of finding all of the riders i have photos of on instagram, and reaching out to them with a link to the gallery. i've only made a few sales so far because i was up pretty late working on it and most of them were probably asleep, but that's already enough to cover the cost of entry for the event and the gas it took to get there and back. i even have one rider, that also owns a rental business, looking to purchase commercial licenses for some of them, which obviously i'm charging a premium for.\n\ni guess my point is that every opportunity i've ever gotten in my professional photo career has been because i took the initiative and made them happen. my main photo gig came about when i reached out to the head photographer and asked to -----> tag !!!  along, not even knowing beforehand that he was looking for new people to hire. this time around, i decided to stop waiting for people to ask to buy things and actively find the leads myself, and it looks like it's already literally paying off. don't be afraid to put yourself out there when you're trying to make your money doing this. the worst that can happen is they can say \"no thanks\".", "sortedWord": "None", "identifyer": 14862, "year": "2021"}, {"Unnamed: 0": 124670, "autor": "Black_Nails", "date": 1626045110000, "content": "I want to start taking close up images of mushrooms and have no experience or gear. I have a body and lens chosen (second hand) and was hoping for some input! /!/ Hi, folks! \n\nI'm going to start photography for a hobby to go along with another hobby of mine, which is, mycology! I think close-ups of mushrooms, especially wild, are the coolest thing! \n\nSo anyway, i've been looking for a bit at used equipment and landed on the *Sony a6000*. I'm trying not to spend too much on a body and this seems to fit in with everything else I own, which is  to say, a few generations behind. Also, just general praise for the device and price range.\n\nMy options were limited on this particular site for lenses and I didn't want to look elsewhere as I'm not even entirely sure what would be best. I did find and was about to get it, but thought to ask, *Sony 50mm f/2.8 Macro.* The price is right for me and I couldn't find too many tags for it on insta to asses further. \n\nBasically, would the *Sony 50mm f/2.8 Macro* &lt;$200, be a good match for my interest in close-ups of smaller wild mushroom and plant species? Thank you!", "link": "https://www.reddit.com/r/photography/comments/oiewfk/i_want_to_start_taking_close_up_images_of/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "i want to start taking close up images of mushrooms and have no experience or gear. i have a body and lens chosen (second hand) and was hoping for some input! /!/ hi, folks! \n\ni'm going to start photography for a hobby to go along with another hobby of mine, which is, mycology! i think close-ups of mushrooms, especially wild, are the coolest thing! \n\nso anyway, i've been looking for a bit at used equipment and landed on the *sony a6000*. i'm trying not to spend too much on a body and this seems to fit in with everything else i own, which is  to say, a few generations behind. also, just general praise for the device and price range.\n\nmy options were limited on this particular site for lenses and i didn't want to look elsewhere as i'm not even entirely sure what would be best. i did find and was about to get it, but thought to ask, *sony 50mm f/2.8 macro.* the price is right for me and i couldn't find too many -----> tags !!!  for it on insta to asses further. \n\nbasically, would the *sony 50mm f/2.8 macro* &lt;$200, be a good match for my interest in close-ups of smaller wild mushroom and plant species? thank you!", "sortedWord": "None", "identifyer": 15186, "year": "2021"}, {"Unnamed: 0": 124916, "autor": "Higuysitsmehenry", "date": 1626555880000, "content": "Image Color Different in Photoshop and Windows 10 viewer /!/ basically what the title states....I noticed that my photos are lighter in density (brighter) in the default windows 10 viewer compared with what it shows inside photoshop (whatever latest version).  The photos are tagged sRGB...I'm assuming photoshop is showing the correct color, but why the discrepancy?", "link": "https://www.reddit.com/r/photography/comments/omcql8/image_color_different_in_photoshop_and_windows_10/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "image color different in photoshop and windows 10 viewer /!/ basically what the title states....i noticed that my photos are lighter in density (brighter) in the default windows 10 viewer compared with what it shows inside photoshop (whatever latest version).  the photos are -----> tagged !!!  srgb...i'm assuming photoshop is showing the correct color, but why the discrepancy?", "sortedWord": "None", "identifyer": 15442, "year": "2021"}, {"Unnamed: 0": 125917, "autor": "redrum00", "date": 1631150572000, "content": "Image cropping &amp; rotating tool (large image collection) /!/ Hi Reddit:)\n\nI have a bunch of physical photos I've been scanning and am looking for a program where I can take these scans and...\n\n1) Rotate them so that they are the correct direction.\n\n2) Crop them so I can get rid of the borders/edges.\n\n3) Tag them so that I can sort them and make the collection searchable.\n\nI don't want these changes to be permanent though. I'd like to use/keep the original photo files and have a program/service handle the rotation and crop. If this service also allows color correction and other possible changes that would be a huge bonus.\n\nI have been looking through reddit posts for ideas but am falling short. Any ideas or advice would be great. I tried looking into ImgIX but am finding it is not made for this. If I'm wrong about that and could be pointed to a tutorial on how to use ImgIX properly that would be great.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/pknp60/image_cropping_rotating_tool_large_image/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "image cropping &amp; rotating tool (large image collection) /!/ hi reddit:)\n\ni have a bunch of physical photos i've been scanning and am looking for a program where i can take these scans and...\n\n1) rotate them so that they are the correct direction.\n\n2) crop them so i can get rid of the borders/edges.\n\n3) -----> tag !!!  them so that i can sort them and make the collection searchable.\n\ni don't want these changes to be permanent though. i'd like to use/keep the original photo files and have a program/service handle the rotation and crop. if this service also allows color correction and other possible changes that would be a huge bonus.\n\ni have been looking through reddit posts for ideas but am falling short. any ideas or advice would be great. i tried looking into imgix but am finding it is not made for this. if i'm wrong about that and could be pointed to a tutorial on how to use imgix properly that would be great.\n\nthanks!", "sortedWord": "None", "identifyer": 16500, "year": "2021"}, {"Unnamed: 0": 126079, "autor": "thebrooklynflash", "date": 1631737290000, "content": "Questions about the new R3 and what are we paying for /!/ I was eagerly awaiting the arrival of Canons new R3 but the $6000 price tag kind of blew me away. Right now I have the Canon 5d Mark iv but its been run into the ground. I don't know if the R3 is for me or not, don't know enough about cameras.  I'm hoping one of you have some insight that may help me out. My questions. \n\nWhat am I paying for with the R3? Is the price point this high because of the video qualities? \n\nI already have the 5D Mark iv that actually has more megapixels than the R3 (30 v 24) so am I downgrading?\n\nIs there a camera that is just an absolute photo beast? Higher megapixels and good in low light when I need it that doesn't have video perhaps?\n\nIm a street fashion photographer so burst is great. \n\nAny and all tips would be greatly appreciated! Thanks", "link": "https://www.reddit.com/r/photography/comments/poy4ju/questions_about_the_new_r3_and_what_are_we_paying/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "questions about the new r3 and what are we paying for /!/ i was eagerly awaiting the arrival of canons new r3 but the $6000 price -----> tag !!!  kind of blew me away. right now i have the canon 5d mark iv but its been run into the ground. i don't know if the r3 is for me or not, don't know enough about cameras.  i'm hoping one of you have some insight that may help me out. my questions. \n\nwhat am i paying for with the r3? is the price point this high because of the video qualities? \n\ni already have the 5d mark iv that actually has more megapixels than the r3 (30 v 24) so am i downgrading?\n\nis there a camera that is just an absolute photo beast? higher megapixels and good in low light when i need it that doesn't have video perhaps?\n\nim a street fashion photographer so burst is great. \n\nany and all tips would be greatly appreciated! thanks", "sortedWord": "None", "identifyer": 16668, "year": "2021"}, {"Unnamed: 0": 126864, "autor": "somalisteves", "date": 1629926067000, "content": "How could I take somethjfn like this on an iphone (didn’t know what tag)", "link": "https://www.reddit.com/r/photography/comments/pbklsp/how_could_i_take_somethjfn_like_this_on_an_iphone/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "how could i take somethjfn like this on an iphone (didn’t know what -----> tag !!! )", "sortedWord": "None", "identifyer": 17498, "year": "2021"}, {"Unnamed: 0": 126910, "autor": "thebignap", "date": 1629185246000, "content": "Asset (portfolio) Management Software — or something like it /!/ Hi all, I'm looking for a collaborative app / web service / software that basically allows me to upload images/videos and tag them. Preferably something simple to use — I don't require any editing functionalities in there. \n\nI'm trying to manage my studio's portfolio. We have a lot of images and it's a pain to go through a giant folder of our work whenever a potential client asks for our portfolio with specific requirements (like residential interiors or evening shots or aerial facades). I'd like to be able to just tag all my images as I'm uploading them and be able to filter and download relevant ones to send to clients as needed. I also need my other team members to be able to access, upload and edit files remotely. \n\nAny apps like this out there? I've already seen apps like Adobe Bridge, Photo Mechanic and Extensis Portfolio. They seem to be too bloated (I just need something simple) and not great for remote teams. \n\nGrateful for any and all advice. =) Thanks in advance!", "link": "https://www.reddit.com/r/photography/comments/p5yzxl/asset_portfolio_management_software_or_something/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "asset (portfolio) management software — or something like it /!/ hi all, i'm looking for a collaborative app / web service / software that basically allows me to upload images/videos and -----> tag !!!  them. preferably something simple to use — i don't require any editing functionalities in there. \n\ni'm trying to manage my studio's portfolio. we have a lot of images and it's a pain to go through a giant folder of our work whenever a potential client asks for our portfolio with specific requirements (like residential interiors or evening shots or aerial facades). i'd like to be able to just tag all my images as i'm uploading them and be able to filter and download relevant ones to send to clients as needed. i also need my other team members to be able to access, upload and edit files remotely. \n\nany apps like this out there? i've already seen apps like adobe bridge, photo mechanic and extensis portfolio. they seem to be too bloated (i just need something simple) and not great for remote teams. \n\ngrateful for any and all advice. =) thanks in advance!", "sortedWord": "None", "identifyer": 17545, "year": "2021"}, {"Unnamed: 0": 127752, "autor": "GoodSign", "date": 1611009175000, "content": "We are having a Photo contest! You can get free signs or even just print your own completely for free (save on shipping=) then just tag your snaps #thisisagoodsign and you could will a FREE SHOPPING SPREE!!!! You're supporting an awesome positivity movement a good message when it's needed most now!", "link": "https://www.reddit.com/r/photography/comments/l05lc5/we_are_having_a_photo_contest_you_can_get_free/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "we are having a photo contest! you can get free signs or even just print your own completely for free (save on shipping=) then just -----> tag !!!  your snaps #thisisagoodsign and you could will a free shopping spree!!!! you're supporting an awesome positivity movement a good message when it's needed most now!", "sortedWord": "None", "identifyer": 18415, "year": "2021"}, {"Unnamed: 0": 127829, "autor": "Ac3Tech", "date": 1615308629000, "content": "Beginner/Starter Camera /!/ Hello fellow Redditors!\n\nMy brother is starting a High-School photography class and the teacher recommended the **Canon EOS Rebel T7 24.1MP Digital Camera**. I have little to no experience with photography, my question to you is this a good starting camera or is there a better camera/s with around the same specs and around the same price tag ($500ish)\n\nThank you for your help!", "link": "https://www.reddit.com/r/photography/comments/m1alp1/beginnerstarter_camera/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "beginner/starter camera /!/ hello fellow redditors!\n\nmy brother is starting a high-school photography class and the teacher recommended the **canon eos rebel t7 24.1mp digital camera**. i have little to no experience with photography, my question to you is this a good starting camera or is there a better camera/s with around the same specs and around the same price -----> tag !!!  ($500ish)\n\nthank you for your help!", "sortedWord": "None", "identifyer": 18494, "year": "2021"}], "name": "tagphotography2021"}