{"interestingcomments": [{"Unnamed: 0": 404137, "autor": "luigi bertolotti", "date": 1511767680000, "content": " hmm, I guess I considered the 1959 versions as rare as only 300 were made right before they transitioned to the 2.8. Oh well. Is there a good price range for it? Seems to be all over the map in the usual places. Well, surely isn't easy to find a Summaron 3,5 in the 1690501 - 800 batch... I don't remember to have seen one for sale (no pics in my archive, anyway...) ; maybe indeed a seller can ask something more for a \"last batch\" item... this happens for other lenses too (both for \"last\" and \"first\" batches, if they aren't too big)", "link": "https://www.l-camera-forum.com/topic/279231-considering-a-35cm-summaron-f35-should-i-look-for-the-rarest-version/?tab=comments#comment-3404604", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": " hmm, i guess i considered the 1959 versions as rare as only 300 were made right before they transitioned to the 2.8. oh well. is there a good price range for it? seems to be all over the map in the usual places. well, surely isn't easy to find a summaron 3,5 in the 1690501 - 800 batch... i don't remember to have seen one for sale (no pics in my -----> archive !!! , anyway...) ; maybe indeed a seller can ask something more for a \"last batch\" item... this happens for other lenses too (both for \"last\" and \"first\" batches, if they aren't too big)", "sortedWord": "None", "identifyer": 16897, "year": "2017"}, {"Unnamed: 0": 422141, "autor": "ramarren", "date": 1493844720000, "content": "Since with a dumb adapter you can select a lens profile ... M or R ... the fact of whether it is affecting the raw data or injecting lens correction parameters is separable from the fact of whether it is populating the EXIF data. Since the camera allows you to choose a profile, I would expect that it should do both, and that it doesn't do one or the other is a bug that should be noted and sent to Leica for eventual action. It would be good to verify precisely what is happening. Set up the camera on a tripod or other fixed support, set it to DNG only, a manual white balance, manual exposure, manual focus, and set exposure on a 'standard' scene (anything will do), set the lens profile to OFF, and make an exposure after focusing. Then set the lens profile to any profile and make another exposure with the exact same settings, without moving the camera. Now you have two raw exposures which for all intents and purposes should be identical except for the time/date stamps and the fact that one was configured with the lens profiles off and the other with the lens profiles on. You can use an EXIF editor like EXIFtool to extract all the EXIF data in the file and then do a text comparison to see exactly what changed; that's one test. You can then import both exposures into LR and compare the two images by flipping back and forth between them to see what if anything changed. If you see changes, you an use the point tone curve to highlight and exaggerate them (make the same adjustments to both) to see if the selection of a lens profile modified any raw data. (Or put the two files on a web server without modifying them (put them into a zip archive), send me a link to them, and I'll do it for you. --img--  ) It would be good to find out if there is a problem and tell Leica about it. I can't do the test myself since I have no 'dumb' converters.", "link": "https://www.l-camera-forum.com/topic/271825-leica-r-adapter-just-a-tube/page/2/?tab=comments#comment-3267999", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "since with a dumb adapter you can select a lens profile ... m or r ... the fact of whether it is affecting the raw data or injecting lens correction parameters is separable from the fact of whether it is populating the exif data. since the camera allows you to choose a profile, i would expect that it should do both, and that it doesn't do one or the other is a bug that should be noted and sent to leica for eventual action. it would be good to verify precisely what is happening. set up the camera on a tripod or other fixed support, set it to dng only, a manual white balance, manual exposure, manual focus, and set exposure on a 'standard' scene (anything will do), set the lens profile to off, and make an exposure after focusing. then set the lens profile to any profile and make another exposure with the exact same settings, without moving the camera. now you have two raw exposures which for all intents and purposes should be identical except for the time/date stamps and the fact that one was configured with the lens profiles off and the other with the lens profiles on. you can use an exif editor like exiftool to extract all the exif data in the file and then do a text comparison to see exactly what changed; that's one test. you can then import both exposures into lr and compare the two images by flipping back and forth between them to see what if anything changed. if you see changes, you an use the point tone curve to highlight and exaggerate them (make the same adjustments to both) to see if the selection of a lens profile modified any raw data. (or put the two files on a web server without modifying them (put them into a zip -----> archive !!! ), send me a link to them, and i'll do it for you. --img--  ) it would be good to find out if there is a problem and tell leica about it. i can't do the test myself since i have no 'dumb' converters.", "sortedWord": "None", "identifyer": 35181, "year": "2017"}], "name": "archiveL-Forum2017"}