{"interestingcomments": [{"Unnamed: 0": 439509, "autor": "Leica Guy", "date": 1518216780000, "content": "I photographed sunspots today using the spotting scope and Leica Q. I use an 18-stop solar filter in front of the objective lens on the spotting scope. Settings on the Q were 1/800 sec., f/1.7, ISO 100. I use a Star Adventurer tracker although for the sun it's not really necessary. It just keeps the image centered so I don't have to keep readjusting the ballhead. It's fun. Careful if you attempt this. You MUST use a solar filter in the front of the spotting scope. The spots are Region 2699, 12 sunspots, classification Beta - Gamma. Readily available on spaceweatherlive.com. I'm always trying to do new and different things with the Q. Just for the fun of the challenge. NEVER LOOK DIRECTLY AT THE SUN WITHOUT PROTECTION! --img-- --img--  Edited February 9, 2018 by Infiniumguy", "link": "https://www.l-camera-forum.com/topic/279496-leica-q-digiscoping-thread/?tab=comments#comment-3458653", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "classification", "selectorShort": "classification", "MarkedSent": "i photographed sunspots today using the spotting scope and leica q. i use an 18-stop solar filter in front of the objective lens on the spotting scope. settings on the q were 1/800 sec., f/1.7, iso 100. i use a star adventurer tracker although for the sun it's not really necessary. it just keeps the image centered so i don't have to keep readjusting the ballhead. it's fun. careful if you attempt this. you must use a solar filter in the front of the spotting scope. the spots are region 2699, 12 sunspots, -----> classification !!!  beta - gamma. readily available on spaceweatherlive.com. i'm always trying to do new and different things with the q. just for the fun of the challenge. never look directly at the sun without protection! --img-- --img--  edited february 9, 2018 by infiniumguy", "sortedWord": "None", "identifyer": 52825, "year": "2018"}], "name": "classificationL-Forum2018"}