{"interestingcomments": [{"Unnamed: 0": 416654, "autor": "beewee", "date": 1596600720000, "content": "Coming from the M8.2 and M10, I’ve been watching the SL system mature. The summicron primes are very tempting but the current SL2 geotagging situation is keeping me from getting an SL2. I’ve been using the M10 w/ visoflex for GPS and it works well enough. It can take some time to get a GPS solution but if I’m outside, it’ll work after some time. I get that the iPhone GNSS receiver is great and it would be nice to leverage all that tech from your phone, especially as it allows you to get a decent position indoors using WiFi positioning but this BLE situation is a letdown. I seriously hope Leica sorts out the Geotagging feature as I can’t imagine shooting with an SL2 and not having geotagging - at least not while I have an M10 with Visoflex. In some ways, I feel it was a bit foolish for Leica to be binding several of their current generation products to the whims of a company like Apple in that a feature like geotagging is completely dependent on Apple’s willingness to open up specific APIs for location output. If for some reason Apple decides on a whim to disable a critical API, the SL2, Q2 and any other camera that depend on the FOTOs app for geotagging would lose such a capability. For a company that prides itself on making timeless products that withstand the test of time, this not in character of Leica. Having worked in both the BLE space for consumer electronics and also in GNSS and navigation, neither paths are easy but I wish Leica would choose to own its destiny rather than let Apple decide its fate for such key features. I get part of the reason that Leica didn’t want to have the GNSS receiver on the body was because the antenna bump wasn’t very appealing but there are many other ways to integrate a GNSS antenna. What they need are smarter antenna designers. For example, the Apple Watch has near transparent metallic film under the display glass that act as the GNSS antenna. Garmin watches uses the outer bezel as an RF element to the GNSS antenna. Leica with some R&D money could have done something novel like putting a GNSS antenna in the glass of the top OLED display or around the hot shoe. I really wish the SL3 will bring back integrated geotagging or preferably have something integrated but also leverage the FOTOS app for indoor positioning. Edited August 5, 2020 by beewee", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/2/?tab=comments#comment-4021680", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "coming from the m8.2 and m10, i’ve been watching the sl system mature. the summicron primes are very tempting but the current sl2 -----> geotagging !!!  situation is keeping me from getting an sl2. i’ve been using the m10 w/ visoflex for gps and it works well enough. it can take some time to get a gps solution but if i’m outside, it’ll work after some time. i get that the iphone gnss receiver is great and it would be nice to leverage all that tech from your phone, especially as it allows you to get a decent position indoors using wifi positioning but this ble situation is a letdown. i seriously hope leica sorts out the geotagging feature as i can’t imagine shooting with an sl2 and not having geotagging - at least not while i have an m10 with visoflex. in some ways, i feel it was a bit foolish for leica to be binding several of their current generation products to the whims of a company like apple in that a feature like geotagging is completely dependent on apple’s willingness to open up specific apis for location output. if for some reason apple decides on a whim to disable a critical api, the sl2, q2 and any other camera that depend on the fotos app for geotagging would lose such a capability. for a company that prides itself on making timeless products that withstand the test of time, this not in character of leica. having worked in both the ble space for consumer electronics and also in gnss and navigation, neither paths are easy but i wish leica would choose to own its destiny rather than let apple decide its fate for such key features. i get part of the reason that leica didn’t want to have the gnss receiver on the body was because the antenna bump wasn’t very appealing but there are many other ways to integrate a gnss antenna. what they need are smarter antenna designers. for example, the apple watch has near transparent metallic film under the display glass that act as the gnss antenna. garmin watches uses the outer bezel as an rf element to the gnss antenna. leica with some r&d money could have done something novel like putting a gnss antenna in the glass of the top oled display or around the hot shoe. i really wish the sl3 will bring back integrated geotagging or preferably have something integrated but also leverage the fotos app for indoor positioning. edited august 5, 2020 by beewee", "sortedWord": "None", "identifyer": 29655, "year": "2020"}, {"Unnamed: 0": 419505, "autor": "acapella", "date": 1594911180000, "content": "Dear all, I am using the Leica Foto's app (2.1) with 'Geotagging' set to always and in the iPhone I also have set the switch 'Location data permission' to always. While shooting pictures (with the Q2 but also with the SL2) I can see the bluetooth and satelliet symbols projecten in the EVF. Still I do not see GPS data appear in the metadata (using Lightroom Classic). I must be missing something very simple here, has anybody any idea? Thanks & regards.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/page/2/?tab=comments#comment-4009791", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "dear all, i am using the leica foto's app (2.1) with '-----> geotagging !!! ' set to always and in the iphone i also have set the switch 'location data permission' to always. while shooting pictures (with the q2 but also with the sl2) i can see the bluetooth and satelliet symbols projecten in the evf. still i do not see gps data appear in the metadata (using lightroom classic). i must be missing something very simple here, has anybody any idea? thanks & regards.", "sortedWord": "None", "identifyer": 32517, "year": "2020"}, {"Unnamed: 0": 419506, "autor": "lohthx1r", "date": 1594912800000, "content": "26 minutes ago, acapella said: Dear all, I am using the Leica Foto's app (2.1) with 'Geotagging' set to always and in the iPhone I also have set the switch 'Location data permission' to always. While shooting pictures (with the Q2 but also with the SL2) I can see the bluetooth and satelliet symbols projecten in the EVF. Still I do not see GPS data appear in the metadata (using Lightroom Classic). I must be missing something very simple here, has anybody any idea? Thanks & regards. I have the same experience as well, it is very erratic, some photos has GPS data carried over and some does not. Even the Bluetooth and satellite icons are visible.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/page/2/?tab=comments#comment-4009809", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "26 minutes ago, acapella said: dear all, i am using the leica foto's app (2.1) with '-----> geotagging !!! ' set to always and in the iphone i also have set the switch 'location data permission' to always. while shooting pictures (with the q2 but also with the sl2) i can see the bluetooth and satelliet symbols projecten in the evf. still i do not see gps data appear in the metadata (using lightroom classic). i must be missing something very simple here, has anybody any idea? thanks & regards. i have the same experience as well, it is very erratic, some photos has gps data carried over and some does not. even the bluetooth and satellite icons are visible.", "sortedWord": "None", "identifyer": 32518, "year": "2020"}, {"Unnamed: 0": 436001, "autor": "scott kirkpatrick", "date": 1588799700000, "content": "I use Lumix Synch with an S1R. It's pretty effective as a remote and for the geotagging of pictures using only the BlueTooth, not the wifi. I can start up Synch on the phone, check that it is connected to the camera, put the phone in my pocket and forget it for moderate periods of time, like half an hour, and the GPS information is transferred after each picture is taken.", "link": "https://www.l-camera-forum.com/topic/306925-statusexperience-lumix-sync-app-for-s1s1rs1h/?tab=comments#comment-3968243", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "i use lumix synch with an s1r. it's pretty effective as a remote and for the -----> geotagging !!!  of pictures using only the bluetooth, not the wifi. i can start up synch on the phone, check that it is connected to the camera, put the phone in my pocket and forget it for moderate periods of time, like half an hour, and the gps information is transferred after each picture is taken.", "sortedWord": "None", "identifyer": 49236, "year": "2020"}, {"Unnamed: 0": 444181, "autor": "bullmoon", "date": 1605424200000, "content": "On 11/13/2020 at 5:36 PM, 6399 said: Further post several hours later 👎 Having searched through other fora here after dozens of unsuccessful tries to pair the Q2 with v3.0 to my Android phone, I found a solution elsewhere posted by \"iRandom\" - to whom, grateful thanks:- \"Then I updated to FW 3.0 and tried to do the pairing. The Bluetooth option on the camera was off and not selectable until I removed the Q2 from Fotos and re-added it. I was then able to connect, view photos on the camera and control the camera. I also confirmed that a photo I took from the camera (not via the remote) shows the GPS icon. I have an iPhone 11 Pro Max running the latest production iOS. Edited Wednesday at 04:06 PM by iRandom\" It wasn't quite that simple with my Android and it involved numerous deletions of the repeating appearance of the Q2 on my Bluetooth and wifi lists. Eventually though I got the link established. Rhetorical question - but why can't a company like Leica get this simple operation sorted? They don't provide a cable release for the shutter so remote operation is an essential feature. Yes, it is cool to get the geotagging now - it is an option (BETA) that must be enabled to work, though. When you see your camera listed in Fotos App, select the \"...\" beside it and then a menu will appear at the bottom where you can enable it for Always On.", "link": "https://www.l-camera-forum.com/topic/314775-firmware-30/page/4/?tab=comments#comment-4080514", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "on 11/13/2020 at 5:36 pm, 6399 said: further post several hours later 👎 having searched through other fora here after dozens of unsuccessful tries to pair the q2 with v3.0 to my android phone, i found a solution elsewhere posted by \"irandom\" - to whom, grateful thanks:- \"then i updated to fw 3.0 and tried to do the pairing. the bluetooth option on the camera was off and not selectable until i removed the q2 from fotos and re-added it. i was then able to connect, view photos on the camera and control the camera. i also confirmed that a photo i took from the camera (not via the remote) shows the gps icon. i have an iphone 11 pro max running the latest production ios. edited wednesday at 04:06 pm by irandom\" it wasn't quite that simple with my android and it involved numerous deletions of the repeating appearance of the q2 on my bluetooth and wifi lists. eventually though i got the link established. rhetorical question - but why can't a company like leica get this simple operation sorted? they don't provide a cable release for the shutter so remote operation is an essential feature. yes, it is cool to get the -----> geotagging !!!  now - it is an option (beta) that must be enabled to work, though. when you see your camera listed in fotos app, select the \"...\" beside it and then a menu will appear at the bottom where you can enable it for always on.", "sortedWord": "None", "identifyer": 7567, "year": "2020"}, {"Unnamed: 0": 444196, "autor": "PhotoCruiser", "date": 1606296960000, "content": " Am 15.11.2020 um 08:10 schrieb bullmoon: Yes, it is cool to get the geotagging now - it is an option (BETA) that must be enabled to work, though. Unfortunately Geotagging don't work as it would make sense. Geotagging works only well when using Fotos in remote control mode and that makes no sense as almost nobody would use geotagging on a tripod. While using the camera, sending coordinates work for 1-2 minutes then drop the connection and that translates that before every shot Fotos must be connected with the camera again. I hope Leica is able to make it work that once Leica Fotos and the Q2 are connected it keeps the connection until stopped intentionally. Chris", "link": "https://www.l-camera-forum.com/topic/314775-firmware-30/page/5/?tab=comments#comment-4086748", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": " am 15.11.2020 um 08:10 schrieb bullmoon: yes, it is cool to get the -----> geotagging !!!  now - it is an option (beta) that must be enabled to work, though. unfortunately geotagging don't work as it would make sense. geotagging works only well when using fotos in remote control mode and that makes no sense as almost nobody would use geotagging on a tripod. while using the camera, sending coordinates work for 1-2 minutes then drop the connection and that translates that before every shot fotos must be connected with the camera again. i hope leica is able to make it work that once leica fotos and the q2 are connected it keeps the connection until stopped intentionally. chris", "sortedWord": "None", "identifyer": 7582, "year": "2020"}, {"Unnamed: 0": 444197, "autor": "bullmoon", "date": 1606421340000, "content": "On 11/25/2020 at 4:36 AM, PhotoCruiser said: Unfortunately Geotagging don't work as it would make sense. Geotagging works only well when using Fotos in remote control mode and that makes no sense as almost nobody would use geotagging on a tripod. While using the camera, sending coordinates work for 1-2 minutes then drop the connection and that translates that before every shot Fotos must be connected with the camera again. I hope Leica is able to make it work that once Leica Fotos and the Q2 are connected it keeps the connection until stopped intentionally. Chris It should be persistent now if enabled. I have not done a lot of testing, but it is certainly improved over the previous version with this beta feature - it is beta, so I expect it gets better as they test it.", "link": "https://www.l-camera-forum.com/topic/314775-firmware-30/page/5/?tab=comments#comment-4087735", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "on 11/25/2020 at 4:36 am, photocruiser said: unfortunately geotagging don't work as it would make sense. -----> geotagging !!!  works only well when using fotos in remote control mode and that makes no sense as almost nobody would use -----> geotagging !!!  on a tripod. while using the camera, sending coordinates work for 1-2 minutes then drop the connection and that translates that before every shot fotos must be connected with the camera again. i hope leica is able to make it work that once leica fotos and the q2 are connected it keeps the connection until stopped intentionally. chris it should be persistent now if enabled. i have not done a lot of testing, but it is certainly improved over the previous version with this beta feature - it is beta, so i expect it gets better as they test it.", "sortedWord": "None", "identifyer": 7583, "year": "2020"}], "name": "geotaggingL-Forum2020"}