{"interestingcomments": [{"Unnamed: 0": 346217, "autor": "beewee", "date": 1625699820000, "content": "3 hours ago, lucerne said: However, if you find that Live View and the Visoflex introduce delays, you can obtain passive / flash mount viewfinders for 21 or 24 and have no delays when shooting. You'll still have to move your eye from the optical viewfinder to the external viewfinder (and back). Remember, there will be no exposure data displayed on the passive viewfinder. You need to use the Visoflex to get that feature back. I'm assuming you haven't yet acquired the visoflex so you can't check these features . I’ve never found the Visoflex delay to be excessive or problematic in daylight shooting. I have both the visoflex and a bunch of Zeiss optical viewfinders in 18mm and 25/28mm. I generally stick to visoflex because I can check focus without using the range finder with focus peaking and it also provides geotagging with the onboard GPS receiver. Since getting the Visoflex, the only time I ever use an external optical viewfinder is for night shots and dark scenes.", "link": "https://www.l-camera-forum.com/topic/322491-wide-angle-lens-while-waiting-for-35-apo/?tab=comments#comment-4234010", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "3 hours ago, lucerne said: however, if you find that live view and the visoflex introduce delays, you can obtain passive / flash mount viewfinders for 21 or 24 and have no delays when shooting. you'll still have to move your eye from the optical viewfinder to the external viewfinder (and back). remember, there will be no exposure data displayed on the passive viewfinder. you need to use the visoflex to get that feature back. i'm assuming you haven't yet acquired the visoflex so you can't check these features . i’ve never found the visoflex delay to be excessive or problematic in daylight shooting. i have both the visoflex and a bunch of zeiss optical viewfinders in 18mm and 25/28mm. i generally stick to visoflex because i can check focus without using the range finder with focus peaking and it also provides -----> geotagging !!!  with the onboard gps receiver. since getting the visoflex, the only time i ever use an external optical viewfinder is for night shots and dark scenes.", "sortedWord": "None", "identifyer": 7308, "year": "2021"}, {"Unnamed: 0": 346218, "autor": "lucerne", "date": 1625704200000, "content": "bewee I agree with you that under good conditions, the Visoflex works, but it doesnt deliver geotagging everywhere, and it does deplete the battery faster. Passive viewfinders that match the wide angle lenses are much easier. They also dont require live-view to be switched on. Many members of this forum are turned off by their experience of the Visoflex and dream of the next version in the hope that it will be improved. Each to their own, as we say. If it works well for you, there is no need to be concerned. If you are advising a new member, then giving a balanced opinion with pros and cons is only fair. Edited July 8 by lucerne", "link": "https://www.l-camera-forum.com/topic/322491-wide-angle-lens-while-waiting-for-35-apo/?tab=comments#comment-4234030", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "bewee i agree with you that under good conditions, the visoflex works, but it doesnt deliver -----> geotagging !!!  everywhere, and it does deplete the battery faster. passive viewfinders that match the wide angle lenses are much easier. they also dont require live-view to be switched on. many members of this forum are turned off by their experience of the visoflex and dream of the next version in the hope that it will be improved. each to their own, as we say. if it works well for you, there is no need to be concerned. if you are advising a new member, then giving a balanced opinion with pros and cons is only fair. edited july 8 by lucerne", "sortedWord": "None", "identifyer": 7309, "year": "2021"}, {"Unnamed: 0": 346220, "autor": "beewee", "date": 1625714760000, "content": "3 hours ago, lucerne said: bewee I agree with you that under good conditions, the Visoflex works, but it doesnt deliver geotagging everywhere, and it does deplete the battery faster. Passive viewfinders that match the wide angle lenses are much easier. They also dont require live-view to be switched on. Many members of this forum are turned off by their experience of the Visoflex and dream of the next version in the hope that it will be improved. Each to their own, as we say. If it works well for you, there is no need to be concerned. If you are advising a new member, then giving a balanced opinion with pros and cons is only fair. Yes, I agree that geotagging doesn’t work everywhere. Especially not indoors but that’s the nature of GPS in general. BUT, the Visoflex still works better than the Leica FOTOs app with the SL2-S and it actually is reliable outdoors once you give the GPS receiver time to lock on to the satellite signals and get a position. The same cannot be said about the FOTOs app. As far as providing a balanced opinion. I believe you’ve a ready mentioned one side so it’s worth mentioning the other to ‘balance’ things out. Edited July 8 by beewee", "link": "https://www.l-camera-forum.com/topic/322491-wide-angle-lens-while-waiting-for-35-apo/?tab=comments#comment-4234051", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "3 hours ago, lucerne said: bewee i agree with you that under good conditions, the visoflex works, but it doesnt deliver -----> geotagging !!!  everywhere, and it does deplete the battery faster. passive viewfinders that match the wide angle lenses are much easier. they also dont require live-view to be switched on. many members of this forum are turned off by their experience of the visoflex and dream of the next version in the hope that it will be improved. each to their own, as we say. if it works well for you, there is no need to be concerned. if you are advising a new member, then giving a balanced opinion with pros and cons is only fair. yes, i agree that geotagging doesn’t work everywhere. especially not indoors but that’s the nature of gps in general. but, the visoflex still works better than the leica fotos app with the sl2-s and it actually is reliable outdoors once you give the gps receiver time to lock on to the satellite signals and get a position. the same cannot be said about the fotos app. as far as providing a balanced opinion. i believe you’ve a ready mentioned one side so it’s worth mentioning the other to ‘balance’ things out. edited july 8 by beewee", "sortedWord": "None", "identifyer": 7311, "year": "2021"}, {"Unnamed: 0": 414427, "autor": "beewee", "date": 1631400960000, "content": "As far as hardware changes go, I would love to see the following: 13-14 stop dynamic range at ISO 100 with 16bit raw output 1 stop improvement at ISO 12500+ as compared to SL2-S Resolution of the SL2 150-200g weight reduction compared to the SL2 and SL2-S Viewfinder with slightly higher maximum brightness compared to the SL2 and SL2-S Phase detect auto focus and Canon/Sony level eye detect AF-C for both people, animals and birds Actually useable and reliable geotagging via both onboard GPS and Fotos app", "link": "https://www.l-camera-forum.com/topic/324389-let%E2%80%99s-start-a-new-wish-list-for-a-sl3/?tab=comments#comment-4273793", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "as far as hardware changes go, i would love to see the following: 13-14 stop dynamic range at iso 100 with 16bit raw output 1 stop improvement at iso 12500+ as compared to sl2-s resolution of the sl2 150-200g weight reduction compared to the sl2 and sl2-s viewfinder with slightly higher maximum brightness compared to the sl2 and sl2-s phase detect auto focus and canon/sony level eye detect af-c for both people, animals and birds actually useable and reliable -----> geotagging !!!  via both onboard gps and fotos app", "sortedWord": "None", "identifyer": 27363, "year": "2021"}, {"Unnamed: 0": 416699, "autor": "beewee", "date": 1612471080000, "content": "My guess about the flakey GPS feature through Fotos at least on the iOS side is that it has something to do with iOS’s power savings mechanism that Leica have zero control over since that’s in Apple’s domain. iOS is notorious for suspending Apps and power hungry features like GPS while the phone is locked. That doesn’t excuse Leica for announcing a feature that doesn’t work and for which they cannot fix. It’s one thing to not announce GPS via Fotos on the SL2 at launch and them come out with a ‘Beta’ GPS feature later. I don’t think we’d complain about a half baked geotagging feature that is marketed as a ‘bonus’ but not fully working. It’s totally different to announce the GPS via Fotos on the SL2 at launch and have an unstable and poorly implemented solution 14 months after launch and not communicate to customer about a fix or work around. By now, if they know that GPS via Fotos is not a viable solution, they could have white labelled a portable GPS receiver with a BLE connection that can be sold as an accessory and allow the SL2 to connect to the the GPS receiver.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/5/?tab=comments#comment-4133698", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "my guess about the flakey gps feature through fotos at least on the ios side is that it has something to do with ios’s power savings mechanism that leica have zero control over since that’s in apple’s domain. ios is notorious for suspending apps and power hungry features like gps while the phone is locked. that doesn’t excuse leica for announcing a feature that doesn’t work and for which they cannot fix. it’s one thing to not announce gps via fotos on the sl2 at launch and them come out with a ‘beta’ gps feature later. i don’t think we’d complain about a half baked -----> geotagging !!!  feature that is marketed as a ‘bonus’ but not fully working. it’s totally different to announce the gps via fotos on the sl2 at launch and have an unstable and poorly implemented solution 14 months after launch and not communicate to customer about a fix or work around. by now, if they know that gps via fotos is not a viable solution, they could have white labelled a portable gps receiver with a ble connection that can be sold as an accessory and allow the sl2 to connect to the the gps receiver.", "sortedWord": "None", "identifyer": 29700, "year": "2021"}, {"Unnamed: 0": 416700, "autor": "beewee", "date": 1612471200000, "content": "For those that need geotagging, if you’re using Lightroom, you can use a third party GPS receiver like a Garmin and log a GPX file and then import that into Lightroom to geotag your photos after the fact. It’s not quite as streamlined as having GPS location embedded into the EXIF data but it’s better than nothing,", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/5/?tab=comments#comment-4133701", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "for those that need -----> geotagging !!! , if you’re using lightroom, you can use a third party gps receiver like a garmin and log a gpx file and then import that into lightroom to geotag your photos after the fact. it’s not quite as streamlined as having gps location embedded into the exif data but it’s better than nothing,", "sortedWord": "None", "identifyer": 29701, "year": "2021"}, {"Unnamed: 0": 416701, "autor": "SrMi", "date": 1612472520000, "content": "20 minutes ago, beewee said: For those that need geotagging, if you’re using Lightroom, you can use a third party GPS receiver like a Garmin and log a GPX file and then import that into Lightroom to geotag your photos after the fact. It’s not quite as streamlined as having GPS location embedded into the EXIF data but it’s better than nothing, Either that or use an app on the phone. It is essential to synchronize the clock, which can be done with the Fotos app.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/5/?tab=comments#comment-4133729", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "20 minutes ago, beewee said: for those that need -----> geotagging !!! , if you’re using lightroom, you can use a third party gps receiver like a garmin and log a gpx file and then import that into lightroom to geotag your photos after the fact. it’s not quite as streamlined as having gps location embedded into the exif data but it’s better than nothing, either that or use an app on the phone. it is essential to synchronize the clock, which can be done with the fotos app.", "sortedWord": "None", "identifyer": 29702, "year": "2021"}, {"Unnamed: 0": 416708, "autor": "Simone_DF", "date": 1612561680000, "content": "the iOS app for Sony works really well for geotagging, always connected to the camera, all my photos are geotagged. When I turn off the camera, I get an app notification that the camera connection has been disconnected. Turning on the camera, it reconnects automatically, so this is not a problem on Apple's side.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/5/?tab=comments#comment-4134503", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "the ios app for sony works really well for -----> geotagging !!! , always connected to the camera, all my photos are geotagged. when i turn off the camera, i get an app notification that the camera connection has been disconnected. turning on the camera, it reconnects automatically, so this is not a problem on apple's side.", "sortedWord": "None", "identifyer": 29709, "year": "2021"}, {"Unnamed: 0": 416709, "autor": "beewee", "date": 1612564380000, "content": "44 minutes ago, Simone_DF said: the iOS app for Sony works really well for geotagging, always connected to the camera, all my photos are geotagged. When I turn off the camera, I get an app notification that the camera connection has been disconnected. Turning on the camera, it reconnects automatically, so this is not a problem on Apple's side. That’s really good to know. It gives me hope that the Fotos app can be fixed once Leica gets its act together.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/5/?tab=comments#comment-4134518", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "44 minutes ago, simone_df said: the ios app for sony works really well for -----> geotagging !!! , always connected to the camera, all my photos are geotagged. when i turn off the camera, i get an app notification that the camera connection has been disconnected. turning on the camera, it reconnects automatically, so this is not a problem on apple's side. that’s really good to know. it gives me hope that the fotos app can be fixed once leica gets its act together.", "sortedWord": "None", "identifyer": 29710, "year": "2021"}, {"Unnamed: 0": 416713, "autor": "beewee", "date": 1613199480000, "content": "After some testing, I think I managed to get the geotagging to work somewhat reliably on iOS 14.4, FOTOS v2.2.9 and the SL2-S (FW 1.0.0) What I had to do was the following: Install iOS Settings > Privacy > Location Services > Leica FOTOS and set allow location access to Always and enable Precise Location Enable bluetooth on the camera and iPhone (12 Pro in my case) Connect camera to FOTOS App In Fotos App, go to Settings, then press the Disconnect button to disconnect the WiFi connection between the phone and the camera Note: Do not fully kill the FOTOS App by swiping up from the bottom edge of the screen to the app ‘cards’ view and then swiping the FOTOS app to kill it. This will disable geotagging. It seems steps 1 and 4 were the key but not obvious. Previously, I tried without performing step 4 and I would lose Geotagging capability if I close the FOTOS app. I also tried to set the iOS Location Services permissions to only While Using the App and this caused the camera to not be able to get geotagging information when the phone was locked. By doing the above, I was able to keep the iPhone screen locked/off and the camera was still able to get the GPS icon, indicating that it had geotagging capability. With the phone screen locked, I was able to get geotagging on the camera. Even after allowing the camera to go to ‘sleep’ and shut off by itself, when I pressed the shutter button to wake the camera, it would automatically re-establish the BLE connection to the phone and get geotagging data. In general, I found that after waking up the camera, it took about 4 seconds for the camera to re-establish the bluetooth connection. It took an additional ~10 seconds before the camera was able to get geotagging information from the phone.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/5/?tab=comments#comment-4139681", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "after some testing, i think i managed to get the -----> geotagging !!!  to work somewhat reliably on ios 14.4, fotos v2.2.9 and the sl2-s (fw 1.0.0) what i had to do was the following: install ios settings > privacy > location services > leica fotos and set allow location access to always and enable precise location enable bluetooth on the camera and iphone (12 pro in my case) connect camera to fotos app in fotos app, go to settings, then press the disconnect button to disconnect the wifi connection between the phone and the camera note: do not fully kill the fotos app by swiping up from the bottom edge of the screen to the app ‘cards’ view and then swiping the fotos app to kill it. this will disable geotagging. it seems steps 1 and 4 were the key but not obvious. previously, i tried without performing step 4 and i would lose geotagging capability if i close the fotos app. i also tried to set the ios location services permissions to only while using the app and this caused the camera to not be able to get geotagging information when the phone was locked. by doing the above, i was able to keep the iphone screen locked/off and the camera was still able to get the gps icon, indicating that it had geotagging capability. with the phone screen locked, i was able to get geotagging on the camera. even after allowing the camera to go to ‘sleep’ and shut off by itself, when i pressed the shutter button to wake the camera, it would automatically re-establish the ble connection to the phone and get geotagging data. in general, i found that after waking up the camera, it took about 4 seconds for the camera to re-establish the bluetooth connection. it took an additional ~10 seconds before the camera was able to get geotagging information from the phone.", "sortedWord": "None", "identifyer": 29714, "year": "2021"}, {"Unnamed: 0": 416714, "autor": "SrMi", "date": 1613199840000, "content": "4 minutes ago, beewee said: After some testing, I think I managed to get the geotagging to work somewhat reliably on iOS 14.4, FOTOS v2.2.9 and the SL2-S (FW 1.0.0) What I had to do was the following: Install iOS Settings > Privacy > Location Services > Leica FOTOS and set allow location access to Always and enable Precise Location Enable bluetooth on the camera and iPhone (12 Pro in my case) Connect camera to FOTOS App In Fotos App, go to Settings, then press the Disconnect button to disconnect the WiFi connection between the phone and the camera Note: Do not fully kill the FOTOS App by swiping up from the bottom edge of the screen to the app ‘cards’ view and then swiping the FOTOS app to kill it. This will disable geotagging. It seems steps 1 and 4 were the key but not obvious. Previously, I tried without performing step 4 and I would lose Geotagging capability if I close the FOTOS app. I also tried to set the iOS Location Services permissions to only While Using the App and this caused the camera to not be able to get geotagging information when the phone was locked. By doing the above, I was able to keep the iPhone screen locked/off and the camera was still able to get the GPS icon, indicating that it had geotagging capability. With the phone screen locked, I was able to get geotagging on the camera. Even after allowing the camera to go to ‘sleep’ and shut off by itself, when I pressed the shutter button to wake the camera, it would automatically re-establish the BLE connection to the phone and get geotagging data. In general, I found that after waking up the camera, it took about 4 seconds for the camera to re-establish the bluetooth connection. It took an additional ~10 seconds before the camera was able to get geotagging information from the phone. Can you confirm that your photos have GPS data? The icon itself is not a reliable sign.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/5/?tab=comments#comment-4139683", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "4 minutes ago, beewee said: after some testing, i think i managed to get the -----> geotagging !!!  to work somewhat reliably on ios 14.4, fotos v2.2.9 and the sl2-s (fw 1.0.0) what i had to do was the following: install ios settings > privacy > location services > leica fotos and set allow location access to always and enable precise location enable bluetooth on the camera and iphone (12 pro in my case) connect camera to fotos app in fotos app, go to settings, then press the disconnect button to disconnect the wifi connection between the phone and the camera note: do not fully kill the fotos app by swiping up from the bottom edge of the screen to the app ‘cards’ view and then swiping the fotos app to kill it. this will disable geotagging. it seems steps 1 and 4 were the key but not obvious. previously, i tried without performing step 4 and i would lose geotagging capability if i close the fotos app. i also tried to set the ios location services permissions to only while using the app and this caused the camera to not be able to get geotagging information when the phone was locked. by doing the above, i was able to keep the iphone screen locked/off and the camera was still able to get the gps icon, indicating that it had geotagging capability. with the phone screen locked, i was able to get geotagging on the camera. even after allowing the camera to go to ‘sleep’ and shut off by itself, when i pressed the shutter button to wake the camera, it would automatically re-establish the ble connection to the phone and get geotagging data. in general, i found that after waking up the camera, it took about 4 seconds for the camera to re-establish the bluetooth connection. it took an additional ~10 seconds before the camera was able to get geotagging information from the phone. can you confirm that your photos have gps data? the icon itself is not a reliable sign.", "sortedWord": "None", "identifyer": 29715, "year": "2021"}, {"Unnamed: 0": 416725, "autor": "beewee", "date": 1613246220000, "content": "The SL2/SL2-S geotagging issue has gotten me wondering... has anyone who owns an SL2/SL2-S ever managed to see EXIF location data in geotagged photos when paired with the FOTOS app?", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/6/?tab=comments#comment-4140219", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "the sl2/sl2-s -----> geotagging !!!  issue has gotten me wondering... has anyone who owns an sl2/sl2-s ever managed to see exif location data in geotagged photos when paired with the fotos app?", "sortedWord": "None", "identifyer": 29726, "year": "2021"}, {"Unnamed: 0": 416745, "autor": "beewee", "date": 1616040600000, "content": "I did a bit more testing to see how reliable geotagging is after the camera falls asleep or if the phone is locked for an extended period of time. Here’s my test setup: iPhone 12 Pro with iOS 14.4.1 Leica FOTOS app v2.2.11 Privacy for location data set to ‘Always’ on iOS Geolocation enabled Running in the background SL2-S on FW 1.0.0 Had to reset camera and setup new connection to the phone after reset Shooting DNG-only Power savings: auto power off after 2min, auto display off after 30 sec Initial observations are as follows: Every time I see the GPS icon on the top display and take a test photo, I can see GPS location in the metadata If the Leica FOTOS app is running in the foreground, I always get the GPS icon and location info in the metadata Under normal use, my phone has the screen turned off and is locked for an extended period, once the camera goes to sleep (2min), upon waking up camera the bluetooth icon takes a few seconds show up on the top display but sometimes the GPS icon never shows up or takes excessively long to show up (i.e. few minutes). There are two ways to resolve this: Unlocking the phone will enable GPS on the camera within 10-15 seconds and seems to be the fastest way to get the GPS icon on the top display Without unlocking the phone, having an Apple Watch paired to my iPhone and having a GPS enabled activity started (i.e. outdoor walk) forces the location services on iOS to run in the background. As long as the Apple Watch is connected to the iPhone, it will use the iPhone GPS receiver instead of the watch. Upon waking up the camera, the bluetooth icon takes a few seconds to show up. 10-30 seconds after the bluetooth icon shows up, the GPS icon will also pop up on the top display. Edited March 18 by beewee", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/7/?tab=comments#comment-4163059", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "i did a bit more testing to see how reliable -----> geotagging !!!  is after the camera falls asleep or if the phone is locked for an extended period of time. here’s my test setup: iphone 12 pro with ios 14.4.1 leica fotos app v2.2.11 privacy for location data set to ‘always’ on ios geolocation enabled running in the background sl2-s on fw 1.0.0 had to reset camera and setup new connection to the phone after reset shooting dng-only power savings: auto power off after 2min, auto display off after 30 sec initial observations are as follows: every time i see the gps icon on the top display and take a test photo, i can see gps location in the metadata if the leica fotos app is running in the foreground, i always get the gps icon and location info in the metadata under normal use, my phone has the screen turned off and is locked for an extended period, once the camera goes to sleep (2min), upon waking up camera the bluetooth icon takes a few seconds show up on the top display but sometimes the gps icon never shows up or takes excessively long to show up (i.e. few minutes). there are two ways to resolve this: unlocking the phone will enable gps on the camera within 10-15 seconds and seems to be the fastest way to get the gps icon on the top display without unlocking the phone, having an apple watch paired to my iphone and having a gps enabled activity started (i.e. outdoor walk) forces the location services on ios to run in the background. as long as the apple watch is connected to the iphone, it will use the iphone gps receiver instead of the watch. upon waking up the camera, the bluetooth icon takes a few seconds to show up. 10-30 seconds after the bluetooth icon shows up, the gps icon will also pop up on the top display. edited march 18 by beewee", "sortedWord": "None", "identifyer": 29746, "year": "2021"}, {"Unnamed: 0": 416777, "autor": "LBJ2", "date": 1632671280000, "content": "Since I figured out how to use Geotagging on my SL2 ver 2.0, in my case I had to reset the camera to get Geotagging working properly. All has been well, consistent and I find GPS through my iPhone connected to my SL2 is very consistent even inside my house. The same continues for me after the SL2 vers 3.0 update. *I have noticed, I Must remember to disconnect the SL2 or the M10 from the Fotos app directly when I no longer want Geotagging or I will have connection issues the next time I try to set up and connect the SL2 or the M10-R/Visoflex else I have to power off the iPhone and the camera to get things connected again if I forget to disconnect the service from the Fotos app. Edited September 26 by LBJ2", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/8/?tab=comments#comment-4281920", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "since i figured out how to use -----> geotagging !!!  on my sl2 ver 2.0, in my case i had to reset the camera to get -----> geotagging !!!  working properly. all has been well, consistent and i find gps through my iphone connected to my sl2 is very consistent even inside my house. the same continues for me after the sl2 vers 3.0 update. *i have noticed, i must remember to disconnect the sl2 or the m10 from the fotos app directly when i no longer want geotagging or i will have connection issues the next time i try to set up and connect the sl2 or the m10-r/visoflex else i have to power off the iphone and the camera to get things connected again if i forget to disconnect the service from the fotos app. edited september 26 by lbj2", "sortedWord": "None", "identifyer": 29778, "year": "2021"}, {"Unnamed: 0": 416778, "autor": "hotshew", "date": 1632686880000, "content": " Quote Since I figured out how to use Geotagging on my SL2 ver 2.0, in my case I had to reset the camera to get Geotagging working properly. All has been well, consistent and I find GPS through my iPhone connected to my SL2 is very consistent even inside my house. The same continues for me after the SL2 vers 3.0 update. Thanks for sharing. Sound encouraging. I'll give it another chance. Indeed, using smart phone to proxy location has the benefit of using location services to get position instead of needing to rely exclusively on GPS, so works in buildings, etc. I'd still much rather have camera integrated GPS function through! 🙂 Edited September 26 by hotshew", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4282094", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": " quote since i figured out how to use -----> geotagging !!!  on my sl2 ver 2.0, in my case i had to reset the camera to get -----> geotagging !!!  working properly. all has been well, consistent and i find gps through my iphone connected to my sl2 is very consistent even inside my house. the same continues for me after the sl2 vers 3.0 update. thanks for sharing. sound encouraging. i'll give it another chance. indeed, using smart phone to proxy location has the benefit of using location services to get position instead of needing to rely exclusively on gps, so works in buildings, etc. i'd still much rather have camera integrated gps function through! 🙂 edited september 26 by hotshew", "sortedWord": "None", "identifyer": 29779, "year": "2021"}, {"Unnamed: 0": 416779, "autor": "Slender", "date": 1632735660000, "content": "17 hours ago, LBJ2 said: Since I figured out how to use Geotagging on my SL2 ver 2.0, in my case I had to reset the camera to get Geotagging working properly. All has been well, consistent and I find GPS through my iPhone connected to my SL2 is very consistent even inside my house. The same continues for me after the SL2 vers 3.0 update. *I have noticed, I Must remember to disconnect the SL2 or the M10 from the Fotos app directly when I no longer want Geotagging or I will have connection issues the next time I try to set up and connect the SL2 or the M10-R/Visoflex else I have to power off the iPhone and the camera to get things connected again if I forget to disconnect the service from the Fotos app. Does it drain the battery significantly more, do you think?", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4282341", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "17 hours ago, lbj2 said: since i figured out how to use -----> geotagging !!!  on my sl2 ver 2.0, in my case i had to reset the camera to get -----> geotagging !!!  working properly. all has been well, consistent and i find gps through my iphone connected to my sl2 is very consistent even inside my house. the same continues for me after the sl2 vers 3.0 update. *i have noticed, i must remember to disconnect the sl2 or the m10 from the fotos app directly when i no longer want geotagging or i will have connection issues the next time i try to set up and connect the sl2 or the m10-r/visoflex else i have to power off the iphone and the camera to get things connected again if i forget to disconnect the service from the fotos app. does it drain the battery significantly more, do you think?", "sortedWord": "None", "identifyer": 29780, "year": "2021"}, {"Unnamed: 0": 416781, "autor": "beewee", "date": 1632764820000, "content": "I did a long 12hr hike this past weekend and tested the new SL2-S v2.1 FW and FOTOs app for geotagging. I didn’t notice any more battery drain than what I’ve experienced in the past and I also didn’t experience any overheating. That being said, it was breezy and the temperatures were between 0°C and 10°C for most of the time. As far as the geotagging goes, I noticed that the initial connection to get GPS position (GPS icon on camera) was faster than the previous firmware. However, I still have the same problem as what I’ve had in the past where my use case involves me turning on the camera and taking a few shots, then shutting it off immediately after I’m done to conserve battery life if I know I don’t plan to take another shot for more than a couple minutes. In this usage pattern, I found that when I turn the camera back on a few minutes or tens of minutes later for another shot, the camera is unable to get GPS position in any reasonable time frame (i.e. takes at least 1 minute or more where I lose patience). Even whipping out my phone and going into the FOTOs app doesn’t seem to help all the time and I end up having to kill the FOTOs app on iOS and then start it up again. This gets things going again very quickly but it’s annoying and not the ideal behaviour - especially in cold temperatures where I have gloves on and having to fiddle with the touch screen on my phone. I’m guessing the problem is that once the camera shuts off and the FOTOs app loses connectivity with the camera, it times out in the background and then only very seldom tries to reconnect. I should note that in my last hike, I had BLE remote start up on the camera disabled. In the past, I normally had this feature enabled in an effort to try to maintain a connection between the phone and camera. I’ll test with this setting enabled again to see if it helps on my next outing. Edited September 27 by beewee", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4282583", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "i did a long 12hr hike this past weekend and tested the new sl2-s v2.1 fw and fotos app for geotagging. i didn’t notice any more battery drain than what i’ve experienced in the past and i also didn’t experience any overheating. that being said, it was breezy and the temperatures were between 0°c and 10°c for most of the time. as far as the -----> geotagging !!!  goes, i noticed that the initial connection to get gps position (gps icon on camera) was faster than the previous firmware. however, i still have the same problem as what i’ve had in the past where my use case involves me turning on the camera and taking a few shots, then shutting it off immediately after i’m done to conserve battery life if i know i don’t plan to take another shot for more than a couple minutes. in this usage pattern, i found that when i turn the camera back on a few minutes or tens of minutes later for another shot, the camera is unable to get gps position in any reasonable time frame (i.e. takes at least 1 minute or more where i lose patience). even whipping out my phone and going into the fotos app doesn’t seem to help all the time and i end up having to kill the fotos app on ios and then start it up again. this gets things going again very quickly but it’s annoying and not the ideal behaviour - especially in cold temperatures where i have gloves on and having to fiddle with the touch screen on my phone. i’m guessing the problem is that once the camera shuts off and the fotos app loses connectivity with the camera, it times out in the background and then only very seldom tries to reconnect. i should note that in my last hike, i had ble remote start up on the camera disabled. in the past, i normally had this feature enabled in an effort to try to maintain a connection between the phone and camera. i’ll test with this setting enabled again to see if it helps on my next outing. edited september 27 by beewee", "sortedWord": "None", "identifyer": 29782, "year": "2021"}, {"Unnamed: 0": 416786, "autor": "hotshew", "date": 1632789900000, "content": "25 minutes ago, beewee said: It all depends on how the geotagging and bluetooth connection mechanism is implemented on both ends of the connection. Exactly. We can only speculate about such things : -)", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4282774", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "25 minutes ago, beewee said: it all depends on how the -----> geotagging !!!  and bluetooth connection mechanism is implemented on both ends of the connection. exactly. we can only speculate about such things : -)", "sortedWord": "None", "identifyer": 29787, "year": "2021"}, {"Unnamed: 0": 416787, "autor": "LBJ2", "date": 1632847380000, "content": "The geotagging consistency I reported earlier in this thread, fell out the window. I specifically planned some time to attempt to see if I noticed any increase in battery usage while geotagging, but today geotagging didn't want to work at all with the SL2 v3 + iPhone. Deja vu, I saw the satellite symbol but tried with no success several times during about a 90 min period to geotag. I went through the motions cycling iPhone and Camera on off, took camera battery out/replaced with a full charged battery and multiple restarts on both devices. Nada. As soon as I arrived home, I went to work and tried all the usual as stated above and again. Nada x 2. Just like with v2.0 SL2 firmware, I had to do a complete reset on the SL2 to get Geotagging working again. FWIW as I posted, early geotagging has been working as expected since the SL2 ver 3.0 update. The only thing I did between the last successful geotagging session and this current attempt was to set up three new profiles on the SL2 as well as experiment with some of the new v3.0 menu features. No idea if there is any correlation or if geotagging stopped working for some other reason.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4283172", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "the -----> geotagging !!!  consistency i reported earlier in this thread, fell out the window. i specifically planned some time to attempt to see if i noticed any increase in battery usage while geotagging, but today geotagging didn't want to work at all with the sl2 v3 + iphone. deja vu, i saw the satellite symbol but tried with no success several times during about a 90 min period to geotag. i went through the motions cycling iphone and camera on off, took camera battery out/replaced with a full charged battery and multiple restarts on both devices. nada. as soon as i arrived home, i went to work and tried all the usual as stated above and again. nada x 2. just like with v2.0 sl2 firmware, i had to do a complete reset on the sl2 to get geotagging working again. fwiw as i posted, early geotagging has been working as expected since the sl2 ver 3.0 update. the only thing i did between the last successful geotagging session and this current attempt was to set up three new profiles on the sl2 as well as experiment with some of the new v3.0 menu features. no idea if there is any correlation or if geotagging stopped working for some other reason.", "sortedWord": "None", "identifyer": 29788, "year": "2021"}, {"Unnamed: 0": 416792, "autor": "msh58", "date": 1632926400000, "content": "vor 2 Stunden schrieb LBJ2: I am not so quick to blame geotagging on the Fotos apps alone when these problems occur. It could very well be the iPhone ! For example. I typically pair the iPhone to my Apple watch and my car on a daily/regular basis. Occasionally, that connection just stops working for no known reason. I can see the iPhone is connected to either my car or Apple watch in their respective menus, but in reality the devices are not paired and not functioning. So I have to go through similar motions I described earlier and turn off the car or Apple Watch and turn off the iPhone and then restart everything for a complete pairing again. Sometimes I have to do this a few times and of course always a PITA because I rely daily on these devices syncing with each other. Lot of moving pieces to consider HW and SW and regular firmware updates particularly on the iPhone and each of these devices relies on the other to maintain a consistent connection. While still happily using my original SL with built-in GPS I have periodically followed these disappointing stories of SL2 geotagging. There are probably good reasons why Leica decided against built-in GPS on SL2 (space constraints? tegulatory issues?) but it certainly seems usability, reliability, and simplicity were not high on their list. Or, maybe it was just difficult to evaluate the promises of the software/ firmware developers…, Perhaps a couple of software engineers should be sent to shadow a user on a full day hike to observe what actually happens rather than letting them rely on bug reports", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4283652", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "vor 2 stunden schrieb lbj2: i am not so quick to blame -----> geotagging !!!  on the fotos apps alone when these problems occur. it could very well be the iphone ! for example. i typically pair the iphone to my apple watch and my car on a daily/regular basis. occasionally, that connection just stops working for no known reason. i can see the iphone is connected to either my car or apple watch in their respective menus, but in reality the devices are not paired and not functioning. so i have to go through similar motions i described earlier and turn off the car or apple watch and turn off the iphone and then restart everything for a complete pairing again. sometimes i have to do this a few times and of course always a pita because i rely daily on these devices syncing with each other. lot of moving pieces to consider hw and sw and regular firmware updates particularly on the iphone and each of these devices relies on the other to maintain a consistent connection. while still happily using my original sl with built-in gps i have periodically followed these disappointing stories of sl2 geotagging. there are probably good reasons why leica decided against built-in gps on sl2 (space constraints? tegulatory issues?) but it certainly seems usability, reliability, and simplicity were not high on their list. or, maybe it was just difficult to evaluate the promises of the software/ firmware developers…, perhaps a couple of software engineers should be sent to shadow a user on a full day hike to observe what actually happens rather than letting them rely on bug reports", "sortedWord": "None", "identifyer": 29793, "year": "2021"}, {"Unnamed: 0": 416793, "autor": "beewee", "date": 1632941160000, "content": "4 hours ago, msh58 said: While still happily using my original SL with built-in GPS I have periodically followed these disappointing stories of SL2 geotagging. There are probably good reasons why Leica decided against built-in GPS on SL2 (space constraints? tegulatory issues?) but it certainly seems usability, reliability, and simplicity were not high on their list. Or, maybe it was just difficult to evaluate the promises of the software/ firmware developers…, Perhaps a couple of software engineers should be sent to shadow a user on a full day hike to observe what actually happens rather than letting them rely on bug reports There are pros and cons to having GPS in camera vs offloaded to the phone. On paper, the phone option is better (if it worked as it should on paper) since the phone has many more ways to get its position. Whether it’s through WiFi, GPS, cellular networks, and it can also leverage the data networks to assist in positioning off various radios and sensors and fusing all the information to get the most reliable and accurate position possible using all available information. Even though GPS can operate as a standalone positioning method, even it benefits from a data connection to get assistance data such as time, rough position, and satellite information that helps the receiver to get a position lock much sooner than otherwise achievable as a standalone receiver but this would not be possible since the camera doesn’t have a data connection except through the phone (if connected). So I can see why Leica wanted to go the route of using the phone as a source of positioning data. The problem is not so much the fundamental concept but it is specific to the way it has been implemented. Only Leica knows where the bottle neck lies, whether it’s in the iOS/Android developer frameworks, phone hardware, camera firmware, radio limitations, power consumption limitations, antenna performance, camera power stability, etc.. There are tradeoffs to be made along the way and all the way down the chain. All that being said, as the end customer, I do think we deserve a more reliable system than what is currently being provided. I can see that Leica is putting in effort to address this over the past year or so but it is still not where it needs to be. It’s also worth mentioning that, as Leica prides itself on designing cameras that do not get in the way of the photographer, its implementation of geolocation definitely goes against this ethos. So I surely hope that Leica would make their geolocation feature work as seamlessly as other functionality in their cameras. Location determination is not an easy thing and it’s a multi-billion dollar industry in and of itself but that’s not really an excuse to delivery subpar performance if Leica is going to go through the trouble of implementing such a feature and selling it as a feature for its customers. Edited September 29 by beewee", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4283758", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "4 hours ago, msh58 said: while still happily using my original sl with built-in gps i have periodically followed these disappointing stories of sl2 -----> geotagging !!! . there are probably good reasons why leica decided against built-in gps on sl2 (space constraints? tegulatory issues?) but it certainly seems usability, reliability, and simplicity were not high on their list. or, maybe it was just difficult to evaluate the promises of the software/ firmware developers…, perhaps a couple of software engineers should be sent to shadow a user on a full day hike to observe what actually happens rather than letting them rely on bug reports there are pros and cons to having gps in camera vs offloaded to the phone. on paper, the phone option is better (if it worked as it should on paper) since the phone has many more ways to get its position. whether it’s through wifi, gps, cellular networks, and it can also leverage the data networks to assist in positioning off various radios and sensors and fusing all the information to get the most reliable and accurate position possible using all available information. even though gps can operate as a standalone positioning method, even it benefits from a data connection to get assistance data such as time, rough position, and satellite information that helps the receiver to get a position lock much sooner than otherwise achievable as a standalone receiver but this would not be possible since the camera doesn’t have a data connection except through the phone (if connected). so i can see why leica wanted to go the route of using the phone as a source of positioning data. the problem is not so much the fundamental concept but it is specific to the way it has been implemented. only leica knows where the bottle neck lies, whether it’s in the ios/android developer frameworks, phone hardware, camera firmware, radio limitations, power consumption limitations, antenna performance, camera power stability, etc.. there are tradeoffs to be made along the way and all the way down the chain. all that being said, as the end customer, i do think we deserve a more reliable system than what is currently being provided. i can see that leica is putting in effort to address this over the past year or so but it is still not where it needs to be. it’s also worth mentioning that, as leica prides itself on designing cameras that do not get in the way of the photographer, its implementation of geolocation definitely goes against this ethos. so i surely hope that leica would make their geolocation feature work as seamlessly as other functionality in their cameras. location determination is not an easy thing and it’s a multi-billion dollar industry in and of itself but that’s not really an excuse to delivery subpar performance if leica is going to go through the trouble of implementing such a feature and selling it as a feature for its customers. edited september 29 by beewee", "sortedWord": "None", "identifyer": 29794, "year": "2021"}, {"Unnamed: 0": 416794, "autor": "BernardC", "date": 1632942360000, "content": "7 hours ago, LBJ2 said: I am not so quick to blame geotagging on the Fotos apps alone when these problems occur. It could very well be the iPhone ! For example. I typically pair the iPhone to my Apple watch and my car on a daily/regular basis. Occasionally, that connection just stops working for no known reason. I can see the iPhone is connected to either my car or Apple watch in their respective menus, but in reality the devices are not paired and not functioning. So I have to go through similar motions I described earlier and turn off the car or Apple Watch and turn off the iPhone and then restart everything for a complete pairing again. Sometimes I have to do this a few times and of course always a PITA because I rely daily on these devices syncing with each other. Lot of moving pieces to consider HW and SW and regular firmware updates particularly on the iPhone and each of these devices relies on the other to maintain a consistent connection. It would be interesting to know if Android users have the same issues as iPhone users. Not many people have mentioned which OS they used when the location feature worked or failed, which would help to identify the issue.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/9/?tab=comments#comment-4283768", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "7 hours ago, lbj2 said: i am not so quick to blame -----> geotagging !!!  on the fotos apps alone when these problems occur. it could very well be the iphone ! for example. i typically pair the iphone to my apple watch and my car on a daily/regular basis. occasionally, that connection just stops working for no known reason. i can see the iphone is connected to either my car or apple watch in their respective menus, but in reality the devices are not paired and not functioning. so i have to go through similar motions i described earlier and turn off the car or apple watch and turn off the iphone and then restart everything for a complete pairing again. sometimes i have to do this a few times and of course always a pita because i rely daily on these devices syncing with each other. lot of moving pieces to consider hw and sw and regular firmware updates particularly on the iphone and each of these devices relies on the other to maintain a consistent connection. it would be interesting to know if android users have the same issues as iphone users. not many people have mentioned which os they used when the location feature worked or failed, which would help to identify the issue.", "sortedWord": "None", "identifyer": 29795, "year": "2021"}, {"Unnamed: 0": 416801, "autor": "beewee", "date": 1633980600000, "content": "On 9/27/2021 at 11:47 AM, beewee said: I did a long 12hr hike this past weekend and tested the new SL2-S v2.1 FW and FOTOs app for geotagging. I didn’t notice any more battery drain than what I’ve experienced in the past and I also didn’t experience any overheating. That being said, it was breezy and the temperatures were between 0°C and 10°C for most of the time. As far as the geotagging goes, I noticed that the initial connection to get GPS position (GPS icon on camera) was faster than the previous firmware. However, I still have the same problem as what I’ve had in the past where my use case involves me turning on the camera and taking a few shots, then shutting it off immediately after I’m done to conserve battery life if I know I don’t plan to take another shot for more than a couple minutes. In this usage pattern, I found that when I turn the camera back on a few minutes or tens of minutes later for another shot, the camera is unable to get GPS position in any reasonable time frame (i.e. takes at least 1 minute or more where I lose patience). Even whipping out my phone and going into the FOTOs app doesn’t seem to help all the time and I end up having to kill the FOTOs app on iOS and then start it up again. This gets things going again very quickly but it’s annoying and not the ideal behaviour - especially in cold temperatures where I have gloves on and having to fiddle with the touch screen on my phone. I’m guessing the problem is that once the camera shuts off and the FOTOs app loses connectivity with the camera, it times out in the background and then only very seldom tries to reconnect. I should note that in my last hike, I had BLE remote start up on the camera disabled. In the past, I normally had this feature enabled in an effort to try to maintain a connection between the phone and camera. I’ll test with this setting enabled again to see if it helps on my next outing. Here’s a bit of a follow up where I did a 10hr hike using the same SL2-S v2.1 FW and FOTOs app v2.4.0 on iPhone 12 Pro w/ iOS 15 for geotagging. I didn’t do anything noticeably different than my earlier 12hr hike except I enabled the Bluetooth remote wakeup feature on the camera to see if it can help with the bluetooth connection stability. The short answer is yes, noticeably so, but it’s still not 100% effective. I compared the amount of photos that had geolocation data vs the total number of photos taken over the two separate hikes and it was as follows: 12hr hike with remote wakeup disabled: Total photos taken over 12 hrs = 265 Total photos with geolocation data = 45 Percentage of photos with successful geotagged metadata = 17% 10hr hike with remote wake enabled: Total photos taken over 10hrs = 195 Total photos with geolocation data = 119 Percentage of photos with successful geotagged metadata = 61% Again, as far as how I used the camera goes, I don’t think I did anything remarkably different between the two hikes. I normally will turn on the camera, take photos (anywhere between 1-5 photos unless I’m on the summit and the views are good), then turn off the camera. The time span between periods where I take a small group of photos can be anywhere from a few minutes to 1-2hrs. Edited October 11 by beewee", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/10/?tab=comments#comment-4290627", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "on 9/27/2021 at 11:47 am, beewee said: i did a long 12hr hike this past weekend and tested the new sl2-s v2.1 fw and fotos app for geotagging. i didn’t notice any more battery drain than what i’ve experienced in the past and i also didn’t experience any overheating. that being said, it was breezy and the temperatures were between 0°c and 10°c for most of the time. as far as the -----> geotagging !!!  goes, i noticed that the initial connection to get gps position (gps icon on camera) was faster than the previous firmware. however, i still have the same problem as what i’ve had in the past where my use case involves me turning on the camera and taking a few shots, then shutting it off immediately after i’m done to conserve battery life if i know i don’t plan to take another shot for more than a couple minutes. in this usage pattern, i found that when i turn the camera back on a few minutes or tens of minutes later for another shot, the camera is unable to get gps position in any reasonable time frame (i.e. takes at least 1 minute or more where i lose patience). even whipping out my phone and going into the fotos app doesn’t seem to help all the time and i end up having to kill the fotos app on ios and then start it up again. this gets things going again very quickly but it’s annoying and not the ideal behaviour - especially in cold temperatures where i have gloves on and having to fiddle with the touch screen on my phone. i’m guessing the problem is that once the camera shuts off and the fotos app loses connectivity with the camera, it times out in the background and then only very seldom tries to reconnect. i should note that in my last hike, i had ble remote start up on the camera disabled. in the past, i normally had this feature enabled in an effort to try to maintain a connection between the phone and camera. i’ll test with this setting enabled again to see if it helps on my next outing. here’s a bit of a follow up where i did a 10hr hike using the same sl2-s v2.1 fw and fotos app v2.4.0 on iphone 12 pro w/ ios 15 for geotagging. i didn’t do anything noticeably different than my earlier 12hr hike except i enabled the bluetooth remote wakeup feature on the camera to see if it can help with the bluetooth connection stability. the short answer is yes, noticeably so, but it’s still not 100% effective. i compared the amount of photos that had geolocation data vs the total number of photos taken over the two separate hikes and it was as follows: 12hr hike with remote wakeup disabled: total photos taken over 12 hrs = 265 total photos with geolocation data = 45 percentage of photos with successful geotagged metadata = 17% 10hr hike with remote wake enabled: total photos taken over 10hrs = 195 total photos with geolocation data = 119 percentage of photos with successful geotagged metadata = 61% again, as far as how i used the camera goes, i don’t think i did anything remarkably different between the two hikes. i normally will turn on the camera, take photos (anywhere between 1-5 photos unless i’m on the summit and the views are good), then turn off the camera. the time span between periods where i take a small group of photos can be anywhere from a few minutes to 1-2hrs. edited october 11 by beewee", "sortedWord": "None", "identifyer": 29802, "year": "2021"}, {"Unnamed: 0": 416803, "autor": "Bernd B.", "date": 1634153580000, "content": "I have taken photos in a studio today. Before I went there, I did a complete reset on my SL2, then re-loaded the my settings and then, in the studio, I started the Leica-App on my iPhone. Hurrah, only 2 tries to connect to the SL2, the blue light was blinking properly and I was able to take stunning 5 (FIVE) photos in a row before I got the „Disconnected“-message on the SL2. And at home the next not-so-big-surprise: None of the photos had a geotagging. I‘m not using this sh.. anymore, enough is enough.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/10/?tab=comments#comment-4291929", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "i have taken photos in a studio today. before i went there, i did a complete reset on my sl2, then re-loaded the my settings and then, in the studio, i started the leica-app on my iphone. hurrah, only 2 tries to connect to the sl2, the blue light was blinking properly and i was able to take stunning 5 (five) photos in a row before i got the „disconnected“-message on the sl2. and at home the next not-so-big-surprise: none of the photos had a -----> geotagging !!! . i‘m not using this sh.. anymore, enough is enough.", "sortedWord": "None", "identifyer": 29804, "year": "2021"}, {"Unnamed: 0": 422228, "autor": "beewee", "date": 1624587960000, "content": "13 minutes ago, Mr.Q said: If you aren't shooting with a 28, 35, or 50mm lens using the rangefinder 90% of the time, the M is not for you. It's not a liveview camera. I wouldn’t go that far. The 24mm SEM is almost welded onto my M10. It’s one of the sharpest 24mm lenses ever made - by anyone. I use the M10 with the Visoflex both for framing and for its geotagging capabilities. For the performance to size/weight ratio, it’s really hard to beat.", "link": "https://www.l-camera-forum.com/topic/322106-give-up-m10r-to-get-more-lenses-for-sl2/?tab=comments#comment-4225850", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "13 minutes ago, mr.q said: if you aren't shooting with a 28, 35, or 50mm lens using the rangefinder 90% of the time, the m is not for you. it's not a liveview camera. i wouldn’t go that far. the 24mm sem is almost welded onto my m10. it’s one of the sharpest 24mm lenses ever made - by anyone. i use the m10 with the visoflex both for framing and for its -----> geotagging !!!  capabilities. for the performance to size/weight ratio, it’s really hard to beat.", "sortedWord": "None", "identifyer": 35268, "year": "2021"}, {"Unnamed: 0": 441212, "autor": "PhotoCruiser", "date": 1632914880000, "content": "BTW: The lower icon is the Geotagging Icon not WiFi icon. if its grey no geotagging, if its lit then geotagging is active Chris", "link": "https://www.l-camera-forum.com/topic/323456-is-it-possible-to-remove-the-wifi-bt-icons-from-the-screen%C2%A0/?tab=comments#comment-4283547", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "btw: the lower icon is the geotagging icon not wifi icon. if its grey no -----> geotagging !!! , if its lit then -----> geotagging !!!  is active chris", "sortedWord": "None", "identifyer": 54557, "year": "2021"}, {"Unnamed: 0": 441819, "autor": "nicci78", "date": 1625472600000, "content": "Still the same, geotagging through Foto app is just the most frustrating and unreliable stuff in the whole world. Just forget about it. If you really need geotagging, just buy a used SL typ 601 or use any Visoflex typ 020 compatible camera : T/TL/TL2, M10 series or X type 113. More recent cameras do not have build in GPS. So get over it. No more geotag.", "link": "https://www.l-camera-forum.com/topic/299680-geotagging-for-leica-q2/?tab=comments#comment-4232066", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "still the same, geotagging through foto app is just the most frustrating and unreliable stuff in the whole world. just forget about it. if you really need -----> geotagging !!! , just buy a used sl typ 601 or use any visoflex typ 020 compatible camera : t/tl/tl2, m10 series or x type 113. more recent cameras do not have build in gps. so get over it. no more geotag.", "sortedWord": "None", "identifyer": 5168, "year": "2021"}, {"Unnamed: 0": 441821, "autor": "dnease", "date": 1626531900000, "content": "Agree that it’s annoying that the geotagging times out with Fotos. One solution that I’ve wished for is an Apple Watch Fotos app. This would allow one to easily enable the connection without having to fish in a pocket for the phone. Is anyone aware whether Leica plans to add an Apple Watch app?", "link": "https://www.l-camera-forum.com/topic/299680-geotagging-for-leica-q2/?tab=comments#comment-4239827", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "agree that it’s annoying that the -----> geotagging !!!  times out with fotos. one solution that i’ve wished for is an apple watch fotos app. this would allow one to easily enable the connection without having to fish in a pocket for the phone. is anyone aware whether leica plans to add an apple watch app?", "sortedWord": "None", "identifyer": 5170, "year": "2021"}, {"Unnamed: 0": 441826, "autor": "JohnQ", "date": 1627889820000, "content": "I have used GeoTag Photos Pro 2 for a number of years in many countries. I set the app to work with satellites and not the wireless network. Apart when on aircraft, I leave the app running day and night. It uses little power. You don’t get instant geotagging so I to do this when I access my home computer. It’s easy and very reliable. Even if Leica improves the Fotos app I doubt I’ll use it for geotagging.", "link": "https://www.l-camera-forum.com/topic/299680-geotagging-for-leica-q2/?tab=comments#comment-4249718", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "i have used geotag photos pro 2 for a number of years in many countries. i set the app to work with satellites and not the wireless network. apart when on aircraft, i leave the app running day and night. it uses little power. you don’t get instant -----> geotagging !!!  so i to do this when i access my home computer. it’s easy and very reliable. even if leica improves the fotos app i doubt i’ll use it for geotagging.", "sortedWord": "None", "identifyer": 5175, "year": "2021"}, {"Unnamed: 0": 441827, "autor": "kirkmc", "date": 1630500840000, "content": "I just got a Q2M, and I don't understand how this is supposed to work. The manual says to connect the camera to the phone via Bluetooth, but when I make a connection, it's over wifi, even though Bluetooth is on, and the phone is paired. As for the rest, I haven't even gotten to the point where I can consider any options for geotagging, because to take photos again, I have to turn wifi off, so the camera disconnects from the phone. Can anyone help?", "link": "https://www.l-camera-forum.com/topic/299680-geotagging-for-leica-q2/?tab=comments#comment-4267427", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "geotagging", "selectorShort": "geotagging", "MarkedSent": "i just got a q2m, and i don't understand how this is supposed to work. the manual says to connect the camera to the phone via bluetooth, but when i make a connection, it's over wifi, even though bluetooth is on, and the phone is paired. as for the rest, i haven't even gotten to the point where i can consider any options for -----> geotagging !!! , because to take photos again, i have to turn wifi off, so the camera disconnects from the phone. can anyone help?", "sortedWord": "None", "identifyer": 5176, "year": "2021"}], "name": "geotaggingL-Forum2021"}