{"interestingcomments": [{"autor": "icqcq", "date": "2016-02-29 19:27:00", "content": "So we might push on this (as RED already has: thanks for that link): ask Leica to delete the ISO jerry-rig, give us a menu option that would show Lumens/CMOS range readout, and have revised Chimp options: one that flattens or stretches the image data so that we can proof focus/dof/motion/composition (essentially what it does now), perhaps an overlay with a full-CMOS-range histogram - including stop values/lumens - and another with pointers indicating highest and lowest values in the file and whether or not they fall within the range of the CMOS (blowouts and burieds) with lumen values... thinking of light like this feels like the difference between metric and Imperial units (although, thankfully, both f-stop & shutter-speed are simple mathematical ratios, so not quite, although the numbers used for aperture, although traditional and logical, are still a little on the obtuse side). Who's willing to hack their M240 software in the name of progress & science? And do I dare introduce the question of ETTR/ETTL? eCohen starts the best* threads *for hijacking Edited February 29, 2016 by icqcq", "link": "https://www.l-camera-forum.com/topic/257432-sweet-spot-for-iso-best-sensor-performance/page/2/?tab=comments#comment-2999128", "origin": "L-forum", "suborigin": "257432-sweet-spot-for-iso-best-sensor-performance", "result": true, "Selector": "i dare introduce", "selectorShort": "introduce", "MarkedSent": "so we might push on this (as red already has: thanks for that link): ask leica to delete the iso jerry-rig, give us a menu option that would show lumens/cmos range readout, and have revised chimp options: one that flattens or stretches the image data so that we can proof focus/dof/motion/composition (essentially what it does now), perhaps an overlay with a full-cmos-range histogram - including stop values/lumens - and another with pointers indicating highest and lowest values in the file and whether or not they fall within the range of the cmos (blowouts and burieds) with lumen values... thinking of light like this feels like the difference between metric and imperial units (although, thankfully, both f-stop & shutter-speed are simple mathematical ratios, so not quite, although the numbers used for aperture, although traditional and logical, are still a little on the obtuse side). who's willing to hack their m240 software in the name of progress & science? and do -----> i !!!  -----> dare !!!  -----> introduce !!!  the question of ettr/ettl? ecohen starts the best* threads *for hijacking edited february 29, 2016 by icqcq", "sortedWord": "None", "Identifyer": null, "identifyer": 93614, "year": "2016"}, {"autor": "pgk", "date": "2016-02-29 19:49:00", "content": " And do I dare introduce the question of ETTR/ETTL? ETTR is an interesting concept but ..... The problem is that once you have a contrast range which the sensor cannot accommodate you have to decide how your exposure should best be made - i.e. at what level are you prepared to have your highlights burn out. And the reason ETTR doesn't always work is because its another metering method which you can use IF its appropriate and of course it isn't always appropriate and it has to be used intelligently too. The basic problem we have is that increasing ISO is simply turning up the amplification and of course noise is boosted too. I've assumed that so far camera manufacturers have tuned their in-camera software to adjust for increased ISO so that the resulting files are optimised. But post processing software has become so good that this really isn't required anymore IMO anyway. And things will no doubt evolve further. I've come from a film background but it has always struck me that 'digital sensitivity' described in terms of ISO (and digital ISO has a technical definition) was always an odd way of doing things and rather backward looking. Backward because digital sensors do not have characteristic curves like film - and are interpreted in a different way. So using ISO as sensitivity cannot be the best solution. I would like to see RAW files 'tagged' with an optimum ISO at which they should be interpreted by software rather than embedded with it so that it cannot be undone, which appears to be the case at present. A different way of looking at things and one which won't appeal to everyone, but there you go. And FWIW I DO shoot at base ISO all the time and rely of software to adjust - its not theory, its how I use my Leicas and it can work effectively, but its a slower way of operating relevant only if it suits your RAW workflow. Edited February 29, 2016 by pgk", "link": "https://www.l-camera-forum.com/topic/257432-sweet-spot-for-iso-best-sensor-performance/page/3/?tab=comments#comment-2999152", "origin": "L-forum", "suborigin": "257432-sweet-spot-for-iso-best-sensor-performance", "result": true, "Selector": "i dare introduce", "selectorShort": "introduce", "MarkedSent": " and do -----> i !!!  -----> dare !!!  -----> introduce !!!  the question of ettr/ettl? ettr is an interesting concept but ..... the problem is that once you have a contrast range which the sensor cannot accommodate you have to decide how your exposure should best be made - i.e. at what level are you prepared to have your highlights burn out. and the reason ettr doesn't always work is because its another metering method which you can use if its appropriate and of course it isn't always appropriate and it has to be used intelligently too. the basic problem we have is that increasing iso is simply turning up the amplification and of course noise is boosted too. i've assumed that so far camera manufacturers have tuned their in-camera software to adjust for increased iso so that the resulting files are optimised. but post processing software has become so good that this really isn't required anymore imo anyway. and things will no doubt evolve further. i've come from a film background but it has always struck me that 'digital sensitivity' described in terms of iso (and digital iso has a technical definition) was always an odd way of doing things and rather backward looking. backward because digital sensors do not have characteristic curves like film - and are interpreted in a different way. so using iso as sensitivity cannot be the best solution. i would like to see raw files 'tagged' with an optimum iso at which they should be interpreted by software rather than embedded with it so that it cannot be undone, which appears to be the case at present. a different way of looking at things and one which won't appeal to everyone, but there you go. and fwiw i do shoot at base iso all the time and rely of software to adjust - its not theory, its how i use my leicas and it can work effectively, but its a slower way of operating relevant only if it suits your raw workflow. edited february 29, 2016 by pgk", "sortedWord": "None", "Identifyer": null, "identifyer": 93618, "year": "2016"}, {"autor": "plasticman", "date": "2016-02-26 13:54:00", "content": "This discussion has piqued my interest in Silverfast ... ...though I do find the price exceptionally high for me as a happy amateur. Philip: The improvements over Vuescan as I see them: - Silverfast seems to produce a flatter linear scan that doesn't clip at either end. Even when opened in Colorperfect it's very flat and boring - which is exactly what I want. Vuescan seems to me to introduce a curve even to the supposed flat linear scans; - Silverfast is much faster. I gave up doing multi-exposure with Vuescan long ago, both because it became INTOLERABLY slow on the 9000, but also I was afraid of the wear that might be involved on the machine: the scanner always seemed to be laboring so much more. Multiexposure in Silverfast seems to take about as long as single scan on Vuescan. Haven't strictly timed these impressions yet; - the scans have the TINIEST bit more visible detail. This is things like a tiny amount of fabric detail in a woven dress - barely visible only at 100%. When I look at the entire image on-screen, I feel like the added texture maybe helps the image. This is almost certainly my imagination. When I have time over the weekend I will try to post some comparison crops. You will need your spectacles to see the difference. The downsides: - I haven't been able to do a successful batch scan so far. With persistence I think I might get there sometime over the next few weeks; - all of the reasons I stated in the posts above - plus doubtless more rants to come; If I needed to buy the software separately for two scanners (almost €700!!!!) I would almost definitely NOT do it, no matter how many times Vuescan froze on me. Not so much the amount, but the principle would bug me far too much for a marginal improvement. The scariest thing is that the company has charged users the full price for upgrades - somewhere (typically I don't recall where) I read one user ranting about how they'd been forced to pay multiple full-price upgrades when Lasersoft finally managed to build a 64bit version of the app for modern OSes (several years after the competition). So even if you budget for a one-off expense, it may come back to bite you very hard in the future. PS: Just an aside - there's been occasional talk about financial trouble at the company - though all just rumor as I understand it. Considering the Quark-like nature of their business this wouldn't surprise me though. So maybe the whole edifice may collapse any time. That wouldn't necessarily be a concern if it weren't for the insistent way their software 'phones home'. I'd be concerned that when the servers are no longer there to answer, the software will be 'bricked'. Edited February 26, 2016 by plasticman", "link": "https://www.l-camera-forum.com/topic/257324-the-unthinkable-switching-from-vuescan-to-silverfast/?tab=comments#comment-2997280", "origin": "L-forum", "suborigin": "257324-the-unthinkable-switching-from-vuescan-to-silverfast", "result": true, "Selector": "me to introduce", "selectorShort": "introduce", "MarkedSent": "this discussion has piqued my interest in silverfast ... ...though i do find the price exceptionally high for me as a happy amateur. philip: the improvements over vuescan as i see them: - silverfast seems to produce a flatter linear scan that doesn't clip at either end. even when opened in colorperfect it's very flat and boring - which is exactly what i want. vuescan seems -----> to !!!  -----> me !!!  -----> to !!!  -----> introduce !!!  a curve even -----> to !!!  the supposed flat linear scans; - silverfast is much faster. i gave up doing multi-exposure with vuescan long ago, both because it became intolerably slow on the 9000, but also i was afraid of the wear that might be involved on the machine: the scanner always seemed to be laboring so much more. multiexposure in silverfast seems to take about as long as single scan on vuescan. haven't strictly timed these impressions yet; - the scans have the tiniest bit more visible detail. this is things like a tiny amount of fabric detail in a woven dress - barely visible only at 100%. when i look at the entire image on-screen, i feel like the added texture maybe helps the image. this is almost certainly my imagination. when i have time over the weekend i will try to post some comparison crops. you will need your spectacles to see the difference. the downsides: - i haven't been able to do a successful batch scan so far. with persistence i think i might get there sometime over the next few weeks; - all of the reasons i stated in the posts above - plus doubtless more rants to come; if i needed to buy the software separately for two scanners (almost €700!!!!) i would almost definitely not do it, no matter how many times vuescan froze on me. not so much the amount, but the principle would bug me far too much for a marginal improvement. the scariest thing is that the company has charged users the full price for upgrades - somewhere (typically i don't recall where) i read one user ranting about how they'd been forced to pay multiple full-price upgrades when lasersoft finally managed to build a 64bit version of the app for modern oses (several years after the competition). so even if you budget for a one-off expense, it may come back to bite you very hard in the future. ps: just an aside - there's been occasional talk about financial trouble at the company - though all just rumor as i understand it. considering the quark-like nature of their business this wouldn't surprise me though. so maybe the whole edifice may collapse any time. that wouldn't necessarily be a concern if it weren't for the insistent way their software 'phones home'. i'd be concerned that when the servers are no longer there to answer, the software will be 'bricked'. edited february 26, 2016 by plasticman", "sortedWord": "None", "Identifyer": null, "identifyer": 101796, "year": "2016"}, {"autor": "Kamiel", "date": "2016-08-30 14:35:00", "content": "Greetings Leica users/enthousiasts all over the world, Please allow me to introduce myself. My name is Kamiel and I am from Amsterdam (NL). Photography has been a hobby of mine for several years now. I started with an old Sony DSC-T9 and then a Nikon D90. A friend of mine is a professional photographer and filmmaker. After paying him a visit and playing around with his Leica M Monochrome I was blown away by the character and image quality of the camera and lens. I decided to buy a second hand Leica M9. After thumbing through this forum and seeing all the interesting posts and photography, I decided to join. My main interests in photography are portraiture, street and journalism. Best regards, Kamiel", "link": "https://www.l-camera-forum.com/topic/186962-welcome/page/5/?tab=comments#comment-3104222", "origin": "L-forum", "suborigin": "186962-welcome", "result": true, "Selector": "me to introduce", "selectorShort": "introduce", "MarkedSent": "greetings leica users/enthousiasts all over the world, please allow -----> me !!!  -----> to !!!  -----> introduce !!!  myself. my name is kamiel and i am from amsterdam (nl). photography has been a hobby of mine for several years now. i started with an old sony dsc-t9 and then a nikon d90. a friend of mine is a professional photographer and filmmaker. after paying him a visit and playing around with his leica m monochrome i was blown away by the character and image quality of the camera and lens. i decided to buy a second hand leica m9. after thumbing through this forum and seeing all the interesting posts and photography, i decided to join. my main interests in photography are portraiture, street and journalism. best regards, kamiel", "sortedWord": "None", "Identifyer": null, "identifyer": 113852, "year": "2016"}, {"autor": "George Furst", "date": "2016-12-27 03:30:00", "content": "Hi Peter, I too live in Korea and am in the Leica club here. I have lived in korea for 13 years now and have many friends in the Leica club. We get together in Seoul on weekends often and you would be more than welcome. Even though there are over 17000 in our group, usually there are 5 to 10 in the gatherings. We also arrange trips to photographic locations in Korea like Pusan or Daejeon. By the way I live in Daejeon. Please respond and let's see if we can get together some weekend and I will introduce you to others.", "link": "https://www.l-camera-forum.com/topic/246697-greetings-from-seoul/?tab=comments#comment-3173716", "origin": "L-forum", "suborigin": "246697-greetings-from-seoul", "result": true, "Selector": "i will introduce", "selectorShort": "introduce", "MarkedSent": "hi peter, i too live in korea and am in the leica club here. i have lived in korea for 13 years now and have many friends in the leica club. we get together in seoul on weekends often and you would be more than welcome. even though there are over 17000 in our group, usually there are 5 to 10 in the gatherings. we also arrange trips to photographic locations in korea like pusan or daejeon. by the way i live in daejeon. please respond and let's see if we can get together some weekend and -----> i !!!  -----> will !!!  -----> introduce !!!  you to others.", "sortedWord": "None", "Identifyer": null, "identifyer": 114614, "year": "2016"}, {"autor": "Kupo43", "date": "2016-02-02 18:10:00", "content": " I've been posting on the forums for about two weeks now but I just discovered this!I'm a Camera Operator out of Atlanta working in Film/TV. My love for cinema led me into videography but everything I love about cinematography carries over into Photography as well. I have been slowly taking pictures for a couple of years and it was at this point that I was introduced to the Leica line of cameras. For the past week or so, this community has been very helpful and in a couple of days I should have my very first Leica!I am very excited to shoot and share my first roll with everyone. I'm also excited about learning and interacting with this awesome community. Thanks again to everyone who has helped me in the past week and happy shooting!", "link": "https://www.l-camera-forum.com/topic/256389-hello/?tab=comments#comment-2981516", "origin": "L-forum", "suborigin": "256389-hello", "result": true, "Selector": "i was introduced", "selectorShort": "introduce", "MarkedSent": " i've been posting on the forums for about two weeks now but i just discovered this!i'm a camera operator out of atlanta working in film/tv. my love for cinema led me into videography but everything i love about cinematography carries over into photography as well. -----> i !!!  have been slowly taking pictures for a couple of years and it -----> was !!!  at this point that -----> i !!!  -----> was !!!  -----> introduced !!!  to the leica line of cameras. for the past week or so, this community has been very helpful and in a couple of days i should have my very first leica!i am very excited to shoot and share my first roll with everyone. i'm also excited about learning and interacting with this awesome community. thanks again to everyone who has helped me in the past week and happy shooting!", "sortedWord": "None", "Identifyer": null, "identifyer": 114840, "year": "2016"}, {"autor": "Musotographer", "date": "2016-01-17 17:53:00", "content": " Hello everyone - Apparently I have been a member here for eighteen months, though I think I’ve been a regular visitor for only a short while. I’ve only just found this thread, in which I should have introduced myself some time ago - it's probably rather redundant to do so now, after I've made quite a few posts, but here goes anyway...... I am a musician (mainly in the opera world) and live in south London. I bought my first Leica, an M9P, just over two years ago, and it has transformed the pleasure I get from photography. I had my first camera, an Instamatic (remember Flash Cubes?!), when I was about ten, and my first 'proper' camera, a Contax 139 with a couple of Zeiss lenses, twenty years later after borrowing a friend's Pentax SLR and getting hooked. I used mainly Kodachrome and Fujichrome in it; it went all over the world with me and was a complete joy - some of my photos from then are still some of my favourites. In the 90s I was seduced by the convenience of digital and my picture-taking declined into snapping with a succession of Canon pocket cameras. Then one day about four years ago I picked up the old Contax again and realised what I had been missing; I very quickly acquired a used 5D2 and some nice L glass and had quite a lot of fun with it. Inevitably though, its weight and size meant that more often than not it was left at home, and I never did bond with the hi-tech electronic side of it. Aargh! - no aperture ring!! By chance I started reading about Leica, of which I had barely heard, and I became fascinated, almost obsessed, and read everything I could find. Eventually the inevitable happened, and I found a lovely used silver M9P at Richard Caplan at a price I could just about manage, though I could hardly believe that I was letting myself go through with it. Six months later I offloaded the Canon gear as I had barely touched it since the Leica arrived (though I did miss the splendid, if brutal, Canon 85mm 1.2 lens, which I later managed to replace with a 75 Summilux - even better!) I did try a 240 for a few weeks, when my M9 sensor got the dreaded lurgy, but thankfully went back to another M9P. It has taught me more in two years than I have learnt from other cameras over decades, because it addresses the basics so simply and because my fingers constantly itch to pick it up and use it. I am also learning so much from this forum and from you all who are so generous with your knowledge, artistry and encouragement, and usually very courteously. Thank you! Christopher", "link": "https://www.l-camera-forum.com/topic/255721-belated-introduction/?tab=comments#comment-2970723", "origin": "L-forum", "suborigin": "255721-belated-introduction", "result": true, "Selector": "i should have introduced", "selectorShort": "introduce", "MarkedSent": " hello everyone - apparently i have been a member here for eighteen months, though i think i’ve been a regular visitor for only a short while. -----> i !!! ’ve only just found this thread, in which -----> i !!!  -----> should !!!  -----> have !!!  -----> introduced !!!  myself some time ago - it's probably rather redundant to do so now, after -----> i !!! 've made quite a few posts, but here goes anyway...... i am a musician (mainly in the opera world) and live in south london. i bought my first leica, an m9p, just over two years ago, and it has transformed the pleasure i get from photography. i had my first camera, an instamatic (remember flash cubes?!), when i was about ten, and my first 'proper' camera, a contax 139 with a couple of zeiss lenses, twenty years later after borrowing a friend's pentax slr and getting hooked. i used mainly kodachrome and fujichrome in it; it went all over the world with me and was a complete joy - some of my photos from then are still some of my favourites. in the 90s i was seduced by the convenience of digital and my picture-taking declined into snapping with a succession of canon pocket cameras. then one day about four years ago i picked up the old contax again and realised what i had been missing; i very quickly acquired a used 5d2 and some nice l glass and had quite a lot of fun with it. inevitably though, its weight and size meant that more often than not it was left at home, and i never did bond with the hi-tech electronic side of it. aargh! - no aperture ring!! by chance i started reading about leica, of which i had barely heard, and i became fascinated, almost obsessed, and read everything i could find. eventually the inevitable happened, and i found a lovely used silver m9p at richard caplan at a price i could just about manage, though i could hardly believe that i was letting myself go through with it. six months later i offloaded the canon gear as i had barely touched it since the leica arrived (though i did miss the splendid, if brutal, canon 85mm 1.2 lens, which i later managed to replace with a 75 summilux - even better!) i did try a 240 for a few weeks, when my m9 sensor got the dreaded lurgy, but thankfully went back to another m9p. it has taught me more in two years than i have learnt from other cameras over decades, because it addresses the basics so simply and because my fingers constantly itch to pick it up and use it. i am also learning so much from this forum and from you all who are so generous with your knowledge, artistry and encouragement, and usually very courteously. thank you! christopher", "sortedWord": "None", "Identifyer": null, "identifyer": 114850, "year": "2016"}, {"autor": "algrove", "date": "2016-08-09 17:03:00", "content": " Anyone in the area of Washington DC might want to come into the Leica Store WDC Gallery this Friday from 7-9 pm where I will introduce my show images. If you cannot make it on 12 August the show will continue through 28 September. The name of the show is \"My American South West\" and will be comprised of both color and black and white prints.", "link": "https://www.l-camera-forum.com/topic/263351-leica-store-washington-dc-exhibtion-starting-12-august-2016/?tab=comments#comment-3093554", "origin": "L-forum", "suborigin": "263351-leica-store-washington-dc-exhibtion-starting-12-august-2016", "result": true, "Selector": "i will introduce", "selectorShort": "introduce", "MarkedSent": " anyone in the area of washington dc might want to come into the leica store wdc gallery this friday from 7-9 pm where -----> i !!!  -----> will !!!  -----> introduce !!!  my show images. if you cannot make it on 12 august the show will continue through 28 september. the name of the show is \"my american south west\" and will be comprised of both color and black and white prints.", "sortedWord": "None", "Identifyer": null, "identifyer": 132906, "year": "2016"}], "name": "Leicasortedout2016introduce"}