{"interestingcomments": [{"autor": "fotografr", "date": "2019-09-08 17:01:00", "content": "12 minutes ago, a.noctilux said: Just curious, as I own many Summicron DR lenses over time, question about the \"haze\". Are the glass used in DR are the same as Rigid ? From my many years using those nice Summicron, and searching for informations, I've never had hazed DR (only 5 units) but one lightly hazed Rigid (of 7 units). I'll have to introduce you to the person I bought my latest MM from. He owns 37 M lenses.", "link": "https://www.l-camera-forum.com/topic/301134-mm1-value-increasing/page/3/?tab=comments#comment-3815877", "origin": "L-forum", "suborigin": "301134-mm1-value-increasing", "result": true, "Selector": "i'll have to introduce", "selectorShort": "introduce", "MarkedSent": "12 minutes ago, a.noctilux said: just curious, as i own many summicron dr lenses over time, question about the \"haze\". are the glass used in dr are the same as rigid ? from my many years using those nice summicron, and searching for informations, i've never had hazed dr (only 5 units) but one lightly hazed rigid (of 7 units). -----> i !!! -----> 'll !!!  -----> have !!!  -----> to !!!  -----> introduce !!!  you -----> to !!!  the person -----> i !!!  bought my latest mm from. he owns 37 m lenses.", "sortedWord": "None", "Identifyer": null, "identifyer": 24733, "year": "2019"}, {"autor": "a.noctilux", "date": "2019-09-08 17:08:00", "content": "4 minutes ago, fotografr said: I'll have to introduce you to the person I bought my latest MM from. He owns 37 M lenses. Poor man, only 37 lenses to cherish 😉 ( It's a joke of course 😇 he can own many more as he wants )", "link": "https://www.l-camera-forum.com/topic/301134-mm1-value-increasing/page/3/?tab=comments#comment-3815888", "origin": "L-forum", "suborigin": "301134-mm1-value-increasing", "result": true, "Selector": "i'll have to introduce", "selectorShort": "introduce", "MarkedSent": "4 minutes ago, fotografr said: -----> i !!! -----> 'll !!!  -----> have !!!  -----> to !!!  -----> introduce !!!  you -----> to !!!  the person -----> i !!!  bought my latest mm from. he owns 37 m lenses. poor man, only 37 lenses to cherish 😉 ( it's a joke of course 😇 he can own many more as he wants )", "sortedWord": "None", "Identifyer": null, "identifyer": 24734, "year": "2019"}, {"autor": "ianman", "date": "2019-09-02 18:51:00", "content": " @sicko may I introduce @White Buffalo, @White Buffalo this is @sicko, you two should talk (or at least share threads), you have a lot in common !", "link": "https://www.l-camera-forum.com/topic/300979-apo-summicron-wasted-on-film/page/2/?tab=comments#comment-3812018", "origin": "L-forum", "suborigin": "300979-apo-summicron-wasted-on-film", "result": true, "Selector": "i introduce", "selectorShort": "introduce", "MarkedSent": " @sicko may -----> i !!!  -----> introduce !!!  @white buffalo, @white buffalo this is @sicko, you two should talk (or at least share threads), you have a lot in common !", "sortedWord": "None", "Identifyer": null, "identifyer": 20742, "year": "2019"}, {"autor": "hotshew", "date": "2019-11-25 00:01:00", "content": "I tried it out and here's what I'm seeing. If the user is interactive with Fotos (i.e., it stays open and in the foreground), then the connection to the camera persists and can continue to use the camera remotely. But after setting my phone down, the SL2 displays a connection lost error after about 2 to 3 minutes. I've also found reconnecting to the phone to be error prone (it took three attempts following re-connection errors on last try). YMMV, as this is based on my limited time with the camera. Unless Leica implements some changes, I'm going to resign myself to the SL2 being a GPS-less camera as nicci78 indicated. For GPS to be of value to me it needs to be on all the time and reliable, else I will find another solution for when I want GPS tagging (such as when traveling). Needing to stop, startup Fotos on my phone, and wait 20 seconds every time I want to capture an image isn't practical IMO. As indicated earlier, in general, I've found phone tethering solutions to be unreliable for geotagging (and maintaining connectivity in general). I was really happy to learn the SL had an integrated GPS module when I was first introduced to it, hoped the SL2 would carry it forward. Oh well. I'm super happy with the camera and have no regrets. I will keep my fingers crossed that Leica gives us updates that addresses this relatively minor shortcoming.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/?tab=comments#comment-3861432", "origin": "L-forum", "suborigin": "303771-sl2-and-gps-tagging", "result": true, "Selector": "i was first introduced", "selectorShort": "introduce", "MarkedSent": "i tried it out and here's what i'm seeing. if the user is interactive with fotos (i.e., it stays open and in the foreground), then the connection to the camera persists and can continue to use the camera remotely. but after setting my phone down, the sl2 displays a connection lost error after about 2 to 3 minutes. i've also found reconnecting to the phone to be error prone (it took three attempts following re-connection errors on last try). ymmv, as this is based on my limited time with the camera. unless leica implements some changes, i'm going to resign myself to the sl2 being a gps-less camera as nicci78 indicated. for gps to be of value to me it needs to be on all the time and reliable, else i will find another solution for when i want gps tagging (such as when traveling). needing to stop, startup fotos on my phone, and wait 20 seconds every time i want to capture an image isn't practical imo. as indicated earlier, in general, i've found phone tethering solutions to be unreliable for geotagging (and maintaining connectivity in general). -----> i !!!  -----> was !!!  really happy to learn the sl had an integrated gps module when -----> i !!!  -----> was !!!  -----> first !!!  -----> introduced !!!  to it, hoped the sl2 would carry it forward. oh well. i'm super happy with the camera and have no regrets. i will keep my fingers crossed that leica gives us updates that addresses this relatively minor shortcoming.", "sortedWord": "None", "Identifyer": null, "identifyer": 29628, "year": "2019"}, {"autor": "dave.gt", "date": "2019-06-11 12:34:00", "content": " 4 hours ago, Vieri said: Hello Matt, as I said: - With the EVF you can keep your filters and filter holders on the lens while focusing and recomposing, even with a 10 stopper in daytime, which is always convenient but extremely useful - not to say life-saver - when fiddling with filters and such is difficult or impossible; - With the EVF you can compose precisely in near-darkness; - With the EVF you can see your image's preview without taking your eye from the finder; - With the EVF you can change all your settings without taking your eye from the finder; the last two are extremely useful when you are working in bright daylight; You can (almost) do number 1 with the back LCD; it is difficult to do number 2 with the back LCD; it is impossible to do number 3 - 4 obviously. Now, while this is of course personal I much prefer to use the EVF rather than the LCD for various reasons, here are some of them: - As a glass wearer, I don't have to change glasses to look at the LCD (near) and then at the real world (far), since the EVF has built-in diopter correction; - In bright daylight, it is much easier to look into the EVF than at the LCD, especially when sun hits the screen; - While you don't like \"jamming the camera against your face\", I much prefer the isolation and concentration coming from working while cutting the rest of the world out of my composing and shooting process; That said, whether one likes to use it or prefer the LCD, there is no doubt in my mind that OVF are a thing of the past for Landscape photography and are much, much less useful and flexible than EVF / LCD. So, if I have to suggest anyone a camera for Landscape photography, everything else being equal and even if that someone is not as single-minded about using the EVF versus the LCD, I would definitely recommend one with EVF against one with OVF. About the quality of the files, I have been using the S007 for six months couple of years ago and I assume you don't do long exposures. If you did, the difference in file quality would be clear to you. IMHO, the X1D's files have much more \"real world\" room for manoeuvre in post-processing than the SL / S files, which I know fairly well having used them for three years (SL) and 6 months (s) day-in, day-out. The amount of (amazingly clean) shadow recovery in the X1D files is something the SL & S simply don't have. About long exposures, again it's a matter of purpose - for my work, the S is simply a no go, since I routinely go for minutes-ling exposures. About wide-angle, again it's a matter of purpose - for my work, the S being limited to 19mm is simply not wide enough, since I routinely go wider than that. So, in the end - as I said in my previous post - it's a matter of thinking purpose-oriented when choosing gear. It sound cold, and it probably goes against what most do, but what I do is: - Make a list of the features I really need; - Look at the camera that can give me those in the best, fastest, less cumbersome way, in the lighter and smaller package; - Buy that system Of course, everyone's purposes are different, everyone requirements are different, and therefore everyone's solution is different. Best regards, Vieri Hi, Vieri, Tbh, I think you could do just fine without the X1D. You could do an excellent job of imaging with anything including a hammer, chisel and stone.:) Your talent and skill is most admirable! I love the design and capability of the X1D. Except for the EVF. I hate those! Just my opinion, like yours in the opposite direction. I could trade for an X1D, but not with the EVF. That is a non/starter for me. And I dislike live view in the sunlight/bright conditions. That said, I look forward to more success for the X1D and its successors even though they are unaffordable for me. But that is my fault, not Hasselblad's. I would like to comment that not all photographers can afford the latest and greatest and I am a lowly bottom-feeder relying on the excellent systems that were the darlings of our community in days and years past. I appreciate the older gear not only for it's lower cost due to extreme depreciation, but because they have much to offer. it is wonderful that new products are always available. However, there is a chilling effect for some of us who read about how awful the older systems are. How the new systems are magically the only way to be a good photographer. I respectfully disagree.:) In my mind, there are more photographers who can benefit from the \"obsolete\" systems than there are those who can afford extremely expensive gear. Yes, photography is expensive, no matter what. But in the age of cell phone cameras and selfie-obsession, we as a community need to nurture a bond across all photographers whether they be professionals, hobbyists, or aspiring artists. Part of nurturing is to maintain those who enjoy photography with whatever gear they use. As you stated, everyone is different. I know I am, and that has been a blessing and a curse all my life, LOL.., but the bottom line is I for one prefer OVF and a simple system. Perhaps that makes me a non-starter as a \"good\" or \"professional\" photographer, if so, may I introduce myself as such? It is nice to know you and all of our friends in the photographic community. I hope I don't bore everyone with my obsolete images.... LOL... Looking forward to your future work and posts on the forums!!! You inspire me!!!! Dave", "link": "https://www.l-camera-forum.com/topic/297697-007-vs-hassy-x1-d/page/2/?tab=comments#comment-3757521", "origin": "L-forum", "suborigin": "297697-007-vs-hassy-x1-d", "result": true, "Selector": "i introduce", "selectorShort": "introduce", "MarkedSent": " 4 hours ago, vieri said: hello matt, as i said: - with the evf you can keep your filters and filter holders on the lens while focusing and recomposing, even with a 10 stopper in daytime, which is always convenient but extremely useful - not to say life-saver - when fiddling with filters and such is difficult or impossible; - with the evf you can compose precisely in near-darkness; - with the evf you can see your image's preview without taking your eye from the finder; - with the evf you can change all your settings without taking your eye from the finder; the last two are extremely useful when you are working in bright daylight; you can (almost) do number 1 with the back lcd; it is difficult to do number 2 with the back lcd; it is impossible to do number 3 - 4 obviously. now, while this is of course personal i much prefer to use the evf rather than the lcd for various reasons, here are some of them: - as a glass wearer, i don't have to change glasses to look at the lcd (near) and then at the real world (far), since the evf has built-in diopter correction; - in bright daylight, it is much easier to look into the evf than at the lcd, especially when sun hits the screen; - while you don't like \"jamming the camera against your face\", i much prefer the isolation and concentration coming from working while cutting the rest of the world out of my composing and shooting process; that said, whether one likes to use it or prefer the lcd, there is no doubt in my mind that ovf are a thing of the past for landscape photography and are much, much less useful and flexible than evf / lcd. so, if i have to suggest anyone a camera for landscape photography, everything else being equal and even if that someone is not as single-minded about using the evf versus the lcd, i would definitely recommend one with evf against one with ovf. about the quality of the files, i have been using the s007 for six months couple of years ago and i assume you don't do long exposures. if you did, the difference in file quality would be clear to you. imho, the x1d's files have much more \"real world\" room for manoeuvre in post-processing than the sl / s files, which i know fairly well having used them for three years (sl) and 6 months (s) day-in, day-out. the amount of (amazingly clean) shadow recovery in the x1d files is something the sl & s simply don't have. about long exposures, again it's a matter of purpose - for my work, the s is simply a no go, since i routinely go for minutes-ling exposures. about wide-angle, again it's a matter of purpose - for my work, the s being limited to 19mm is simply not wide enough, since i routinely go wider than that. so, in the end - as i said in my previous post - it's a matter of thinking purpose-oriented when choosing gear. it sound cold, and it probably goes against what most do, but what i do is: - make a list of the features i really need; - look at the camera that can give me those in the best, fastest, less cumbersome way, in the lighter and smaller package; - buy that system of course, everyone's purposes are different, everyone requirements are different, and therefore everyone's solution is different. best regards, vieri hi, vieri, tbh, i think you could do just fine without the x1d. you could do an excellent job of imaging with anything including a hammer, chisel and stone.:) your talent and skill is most admirable! i love the design and capability of the x1d. except for the evf. i hate those! just my opinion, like yours in the opposite direction. i could trade for an x1d, but not with the evf. that is a non/starter for me. and i dislike live view in the sunlight/bright conditions. that said, i look forward to more success for the x1d and its successors even though they are unaffordable for me. but that is my fault, not hasselblad's. i would like to comment that not all photographers can afford the latest and greatest and i am a lowly bottom-feeder relying on the excellent systems that were the darlings of our community in days and years past. i appreciate the older gear not only for it's lower cost due to extreme depreciation, but because they have much to offer. it is wonderful that new products are always available. however, there is a chilling effect for some of us who read about how awful the older systems are. how the new systems are magically the only way to be a good photographer. i respectfully disagree.:) in my mind, there are more photographers who can benefit from the \"obsolete\" systems than there are those who can afford extremely expensive gear. yes, photography is expensive, no matter what. but in the age of cell phone cameras and selfie-obsession, we as a community need to nurture a bond across all photographers whether they be professionals, hobbyists, or aspiring artists. part of nurturing is to maintain those who enjoy photography with whatever gear they use. as you stated, everyone is different. i know i am, and that has been a blessing and a curse all my life, lol.., but the bottom line is i for one prefer ovf and a simple system. perhaps that makes me a non-starter as a \"good\" or \"professional\" photographer, if so, may -----> i !!!  -----> introduce !!!  myself as such? it is nice to know you and all of our friends in the photographic community. i hope i don't bore everyone with my obsolete images.... lol... looking forward to your future work and posts on the forums!!! you inspire me!!!! dave", "sortedWord": "None", "Identifyer": null, "identifyer": 26012, "year": "2019"}, {"autor": "KHB", "date": "2019-04-18 16:48:00", "content": " Hello Following the recent purchase on a black M10-P I would like to introduce myself to the forum and say hello! Not exactly new to Leica, and lucky enough to have a IIIg, M3, M6, R4A and an R8 in my growing collection along with several lenses Regards Karl", "link": "https://www.l-camera-forum.com/topic/296352-greetings-from-estonia/?tab=comments#comment-3724879", "origin": "L-forum", "suborigin": "296352-greetings-from-estonia", "result": true, "Selector": "i would like to introduce", "selectorShort": "introduce", "MarkedSent": " hello following the recent purchase on a black m10-p -----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> introduce !!!  myself -----> to !!!  the forum and say hello! not exactly new to leica, and lucky enough to have a iiig, m3, m6, r4a and an r8 in my growing collection along with several lenses regards karl", "sortedWord": "None", "Identifyer": null, "identifyer": 114211, "year": "2019"}, {"autor": "titan3025", "date": "2019-04-13 20:47:00", "content": " Hi all, Two months ago I started my own YouTube channel around Leica photography and today I released a video introducing myself which I would like to share with you guys as being part of this Leica community so that you all get to know me better as well. The story of a guy with a Leica. Let me introduce myself: https://youtu.be/1rMWfDtFLB0 Cheers, Markus Edited April 13, 2019 by titan3025", "link": "https://www.l-camera-forum.com/topic/296193-let-me-introduce-myself-as-a-leica-m-d-m6-shooter/?tab=comments#comment-3721805", "origin": "L-forum", "suborigin": "296193-let-me-introduce-myself-as-a-leica-m-d-m6-shooter", "result": true, "Selector": "me introduce", "selectorShort": "introduce", "MarkedSent": " hi all, two months ago i started my own youtube channel around leica photography and today i released a video introducing myself which i would like to share with you guys as being part of this leica community so that you all get to know me better as well. the story of a guy with a leica. let -----> me !!!  -----> introduce !!!  myself: https://youtu.be/1rmwfdtflb0 cheers, markus edited april 13, 2019 by titan3025", "sortedWord": "None", "Identifyer": null, "identifyer": 114217, "year": "2019"}], "name": "Leicasortedout2019introduce"}