{"interestingcomments": [{"autor": "Belle123", "date": "2018-10-28 14:45:00", "content": "The lever thing. My opinion is it is a plus. Just consider, the position of the lever and where the shutter button and timing dial was designed on all prior 35mm film cameras. Was all about ergonomics around film use. Now, here comes digital, and they got rid of part of that equation and we end up with a slippery camera design! Really, they could come up with a totally different kind of body for digital that would give us a more natural grip. But, they stick with the film type of body design. Oh well.", "link": "https://www.l-camera-forum.com/topic/290822-m-10-d-monochrome-please/page/2/?tab=comments#comment-3621259", "origin": "L-forum", "suborigin": "290822-m-10-d-monochrome-please", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "the lever thing. my opinion is it is a plus. just consider, the position of the lever and where the shutter button and timing dial was designed on all prior 35mm film cameras. was all about ergonomics around film use. now, here comes digital, and they got rid of part of that equation and we end up with a slippery camera design! really, they could -----> come !!!  -----> up !!!  -----> with !!!  a totally different kind of body for digital that would give us a more natural grip. but, they stick with the film type of body design. oh well.", "sortedWord": "None", "Identifyer": null, "identifyer": 29060, "year": "2018"}, {"autor": "Me Leica!", "date": "2018-12-17 03:43:00", "content": "12 hours ago, TomB_tx said: This thread discusses how to check the sensor version. (ME is the same as M9) Thanks, yes, I saw that too. I actually used the \"Service menu\" trick and it came up with a sensor ID of 15 and firmware of 12.04, which (if I read the thread correctly) means that the sensor's been replaced by Leica. That's good. Plus the focus seems accurate with nearly all the lenses I tried it with. While we're on this topic...I haven't bought it yet (tempting as it is) but I tried it out with some non-Leica lenses (Voigtlanders) as this particular shop doesn't have many M lenses in stock at the moment. Is there any point in trying to \"trick\" the camera by entering the nearest matching code in the menu (i.e. telling the camera that the 35mm f2 you mounted is actually a Leica 35mm f2? Or is it just easier to correct things in post? I'm assuming that we're mainly talking about things like vignetting here, but are there any other things which happen to non-native / non-coded lenses?", "link": "https://www.l-camera-forum.com/topic/292314-checking-for-sensor-information-me/?tab=comments#comment-3648657", "origin": "L-forum", "suborigin": "292314-checking-for-sensor-information-me", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "12 hours ago, tomb_tx said: this thread discusses how to check the sensor version. (me is the same as m9) thanks, yes, i saw that too. i actually used the \"service menu\" trick and it -----> came !!!  -----> up !!!  -----> with !!!  a sensor id of 15 and firmware of 12.04, which (if i read the thread correctly) means that the sensor's been replaced by leica. that's good. plus the focus seems accurate with nearly all the lenses i tried it with. while we're on this topic...i haven't bought it yet (tempting as it is) but i tried it out with some non-leica lenses (voigtlanders) as this particular shop doesn't have many m lenses in stock at the moment. is there any point in trying to \"trick\" the camera by entering the nearest matching code in the menu (i.e. telling the camera that the 35mm f2 you mounted is actually a leica 35mm f2? or is it just easier to correct things in post? i'm assuming that we're mainly talking about things like vignetting here, but are there any other things which happen to non-native / non-coded lenses?", "sortedWord": "None", "Identifyer": null, "identifyer": 36188, "year": "2018"}, {"autor": "gyoung", "date": "2018-07-06 17:09:00", "content": "Depends on the version of your lens. V1 has removable goggles but not v2 or v3. Another solution is to use the optical cell of the lens, which can be unscrewed easily from the focusing mount, together with the 16462 focusing adapter for Visoflex (pic) and another adapter for Visoflex lenses to M cameras. Novoflex makes one if i remember well. Or you could trade your lens for its affordable R version (11211) and use it with an R to M or L adapter. LeicaM_16462.jpg We had a discussion about this lens a few years ago in this same connection. As I remember its not as simple as v1 is removable and later versions not. My v1 has removable goggles but others came up with examples which were different. I have followed the 16462 route once I managed to find one, and used the lens head plus 16462 on Nikon film & dslr, Panasonic m4/3, Sony A7 and now Fuji in turn. Its good but rather heavy! Gerry", "link": "https://www.l-camera-forum.com/topic/285990-de-goggling-a-lens/?tab=comments#comment-3550924", "origin": "L-forum", "suborigin": "285990-de-goggling-a-lens", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "depends on the version of your lens. v1 has removable goggles but not v2 or v3. another solution is to use the optical cell of the lens, which can be unscrewed easily from the focusing mount, together with the 16462 focusing adapter for visoflex (pic) and another adapter for visoflex lenses to m cameras. novoflex makes one if i remember well. or you could trade your lens for its affordable r version (11211) and use it with an r to m or l adapter. leicam_16462.jpg we had a discussion about this lens a few years ago in this same connection. as i remember its not as simple as v1 is removable and later versions not. my v1 has removable goggles but others -----> came !!!  -----> up !!!  -----> with !!!  examples which were different. i have followed the 16462 route once i managed to find one, and used the lens head plus 16462 on nikon film & dslr, panasonic m4/3, sony a7 and now fuji in turn. its good but rather heavy! gerry", "sortedWord": "None", "Identifyer": null, "identifyer": 44005, "year": "2018"}, {"autor": "thighslapper", "date": "2018-09-13 20:04:00", "content": "Panasonic holds the patent for the 90-280mm SL lens and who knows what else. Electronics in SL are better than other Leica I've used. Leica SL sales were lagging, not sure about present situation. The facts support cooperation and it's been successful for Leica with P&S. Panasonic possibly holds the patent for the 'dual syncro drive' AF system if I recall correctly ...... although Leica holds the trademark. As far as I am aware all the rest of the lens components are Leica designed and manufactured. Furthermore I would suspect the dual drive was proposed by Leica with the SL lenses in mind and Panasonic came up with the solution, not the other way round. Edited September 13, 2018 by thighslapper", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/?tab=comments#comment-3592665", "origin": "L-forum", "suborigin": "289421-new-panasonic-full-frame-with-sl-mount", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "panasonic holds the patent for the 90-280mm sl lens and who knows what else. electronics in sl are better than other leica i've used. leica sl sales were lagging, not sure about present situation. the facts support cooperation and it's been successful for leica with p&s. panasonic possibly holds the patent for the 'dual syncro drive' af system if i recall correctly ...... although leica holds the trademark. as far as i am aware all the rest of the lens components are leica designed and manufactured. furthermore i would suspect the dual drive was proposed by leica -----> with !!!  the sl lenses in mind and panasonic -----> came !!!  -----> up !!!  -----> with !!!  the solution, not the other way round. edited september 13, 2018 by thighslapper", "sortedWord": "None", "Identifyer": null, "identifyer": 51127, "year": "2018"}, {"autor": "jonatdonuts", "date": "2018-09-23 07:54:00", "content": "A very interesting angle could be the lenses which Panasonic and / or Sigma could come up with. APSC TL lens selection has been limited for a while now (23mm F1.4 and 24-70mm F2 or F2.8)would be most appreciated... In the meantime Panny and Sigma might be able to fill that gap. Or if we could just get an auto-focusing M adapter for the L mount and I'll just shut up...", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/8/?tab=comments#comment-3597966", "origin": "L-forum", "suborigin": "289421-new-panasonic-full-frame-with-sl-mount", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "a very interesting angle could be the lenses which panasonic and / or sigma could -----> come !!!  -----> up !!!  -----> with !!! . apsc tl lens selection has been limited for a while now (23mm f1.4 and 24-70mm f2 or f2.8)would be most appreciated... in the meantime panny and sigma might be able to fill that gap. or if we could just get an auto-focusing m adapter for the l mount and i'll just shut up...", "sortedWord": "None", "Identifyer": null, "identifyer": 51269, "year": "2018"}, {"autor": "Diego Alvarado", "date": "2018-11-04 03:49:00", "content": "My 50mm Summilux VII is also prone to this issue and I am in the market for a replacement band. Looking online, I have come up with nothing for the exception of this thread. The link above now leads nowhere. Can any of you guys help me out with any leads?", "link": "https://www.l-camera-forum.com/topic/233138-replacement-rubber-focus-ring-for-lux-80/?tab=comments#comment-3625056", "origin": "L-forum", "suborigin": "233138-replacement-rubber-focus-ring-for-lux-80", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "my 50mm summilux vii is also prone to this issue and i am in the market for a replacement band. looking online, i have -----> come !!!  -----> up !!!  -----> with !!!  nothing for the exception of this thread. the link above now leads nowhere. can any of you guys help me out with any leads?", "sortedWord": "None", "Identifyer": null, "identifyer": 23639, "year": "2018"}, {"autor": "ropo54", "date": "2018-11-18 11:35:00", "content": "On 11/3/2018 at 11:49 PM, Diego Alvarado said: My 50mm Summilux VII is also prone to this issue and I am in the market for a replacement band. Looking online, I have come up with nothing for the exception of this thread. The link above now leads nowhere. Can any of you guys help me out with any leads? I contacted DAG (Don Goldberg) and he had a spare replacement band for the R80, which was easy enough to slip onto the lens. Rob", "link": "https://www.l-camera-forum.com/topic/233138-replacement-rubber-focus-ring-for-lux-80/?tab=comments#comment-3633023", "origin": "L-forum", "suborigin": "233138-replacement-rubber-focus-ring-for-lux-80", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 11/3/2018 at 11:49 pm, diego alvarado said: my 50mm summilux vii is also prone to this issue and i am in the market for a replacement band. looking online, i have -----> come !!!  -----> up !!!  -----> with !!!  nothing for the exception of this thread. the link above now leads nowhere. can any of you guys help me out with any leads? i contacted dag (don goldberg) and he had a spare replacement band for the r80, which was easy enough to slip onto the lens. rob", "sortedWord": "None", "Identifyer": null, "identifyer": 23640, "year": "2018"}, {"autor": "erlingmm", "date": "2018-04-13 04:55:00", "content": "You think Leica isn’t aware of his issues....and others? Really? No excuses. Jeff Of course Leica is aware of the issues, they have even come up with a solution, a year ago now. Of course I understand the anger and frustration towards the AF issue. But you now have a choice - get a repair and move on, or stand still and vent. If you can afford an S and 5 lenses, you can afford a repair, it is less than what I pay in insurance on my system for a year. What I say is that there is a chance that you can get it at a lower cost than this estimate (or quote, which I would try to re-negotiate if that is the case). I have not had a single problem after getting the AF upgrade on mine.", "link": "https://www.l-camera-forum.com/topic/271009-af-drive-problems-leica-s-lenses-official-statement-by-leica/page/8/?tab=comments#comment-3499306", "origin": "L-forum", "suborigin": "271009-af-drive-problems-leica-s-lenses-official-statement-by-leica", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "you think leica isn’t aware of his issues....and others? really? no excuses. jeff of course leica is aware of the issues, they have even -----> come !!!  -----> up !!!  -----> with !!!  a solution, a year ago now. of course i understand the anger and frustration towards the af issue. but you now have a choice - get a repair and move on, or stand still and vent. if you can afford an s and 5 lenses, you can afford a repair, it is less than what i pay in insurance on my system for a year. what i say is that there is a chance that you can get it at a lower cost than this estimate (or quote, which i would try to re-negotiate if that is the case). i have not had a single problem after getting the af upgrade on mine.", "sortedWord": "None", "Identifyer": null, "identifyer": 26980, "year": "2018"}, {"autor": "xiaubauu2009", "date": "2018-04-13 08:22:00", "content": "Of course Leica is aware of the issues, they have even come up with a solution, a year ago now. Of course I understand the anger and frustration towards the AF issue. But you now have a choice - get a repair and move on, or stand still and vent. If you can afford an S and 5 lenses, you can afford a repair, it is less than what I pay in insurance on my system for a year. What I say is that there is a chance that you can get it at a lower cost than this estimate (or quote, which I would try to re-negotiate if that is the case). I have not had a single problem after getting the AF upgrade on mine. I think the anger is mainly because with this level of failure, the market price for Leica S has become quite bad, meaning escaping from this system is a huge financial loss, and if you decide to be loyal and stick to it, or unable and unwilling to take the loss, you ran the risk of the system went discontinue due to bad reputation and low interest, which at current climate, it is highly likely. And if Leica S is discontinued in the next 2 years or so, you will end up with a dead system with 30~40k USD invested. Sure, you can still use it, but you know it's not going to be able to compete with other offering on the market. You can't expect the S to be treated like an M, I think we are more tolerant to the M and accept M for what it is. Technology develops and if S is unlucky to get the boot, then the loyal S users will be left with an outdated body that will not be updated, and a bunch of good lens they can't adapt to other camera system (not like the R) as the coding for Leica S is locked (easily fix if Leica decide to make it public). Leica will probably make the SL to have more resolution and make that as the S-lens body and stop doing S all together to appease the old S users with 5~ lens in the dry box.... I hope there's a S008. Edited April 13, 2018 by xiaubauu2009", "link": "https://www.l-camera-forum.com/topic/271009-af-drive-problems-leica-s-lenses-official-statement-by-leica/page/8/?tab=comments#comment-3499373", "origin": "L-forum", "suborigin": "271009-af-drive-problems-leica-s-lenses-official-statement-by-leica", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "of course leica is aware of the issues, they have even -----> come !!!  -----> up !!!  -----> with !!!  a solution, a year ago now. of course i understand the anger and frustration towards the af issue. but you now have a choice - get a repair and move on, or stand still and vent. if you can afford an s and 5 lenses, you can afford a repair, it is less than what i pay in insurance on my system for a year. what i say is that there is a chance that you can get it at a lower cost than this estimate (or quote, which i would try to re-negotiate if that is the case). i have not had a single problem after getting the af upgrade on mine. i think the anger is mainly because with this level of failure, the market price for leica s has become quite bad, meaning escaping from this system is a huge financial loss, and if you decide to be loyal and stick to it, or unable and unwilling to take the loss, you ran the risk of the system went discontinue due to bad reputation and low interest, which at current climate, it is highly likely. and if leica s is discontinued in the next 2 years or so, you will end up with a dead system with 30~40k usd invested. sure, you can still use it, but you know it's not going to be able to compete with other offering on the market. you can't expect the s to be treated like an m, i think we are more tolerant to the m and accept m for what it is. technology develops and if s is unlucky to get the boot, then the loyal s users will be left with an outdated body that will not be updated, and a bunch of good lens they can't adapt to other camera system (not like the r) as the coding for leica s is locked (easily fix if leica decide to make it public). leica will probably make the sl to have more resolution and make that as the s-lens body and stop doing s all together to appease the old s users with 5~ lens in the dry box.... i hope there's a s008. edited april 13, 2018 by xiaubauu2009", "sortedWord": "None", "Identifyer": null, "identifyer": 26981, "year": "2018"}, {"autor": "Jeff S", "date": "2018-04-13 13:07:00", "content": " Of course Leica is aware of the issues, they have even come up with a solution, a year ago now. Of course I understand the anger and frustration towards the AF issue. But you now have a choice - get a repair and move on, or stand still and vent. If you can afford an S and 5 lenses, you can afford a repair, it is less than what I pay in insurance on my system for a year. What I say is that there is a chance that you can get it at a lower cost than this estimate (or quote, which I would try to re-negotiate if that is the case). I have not had a single problem after getting the AF upgrade on mine. You missed my points. I was talking about Leica being specifically aware of Marc’s situation. It should be free, and quick. Period. No negotiation. No excuses. The company dropped the ball for him and others. Jeff", "link": "https://www.l-camera-forum.com/topic/271009-af-drive-problems-leica-s-lenses-official-statement-by-leica/page/8/?tab=comments#comment-3499482", "origin": "L-forum", "suborigin": "271009-af-drive-problems-leica-s-lenses-official-statement-by-leica", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " of course leica is aware of the issues, they have even -----> come !!!  -----> up !!!  -----> with !!!  a solution, a year ago now. of course i understand the anger and frustration towards the af issue. but you now have a choice - get a repair and move on, or stand still and vent. if you can afford an s and 5 lenses, you can afford a repair, it is less than what i pay in insurance on my system for a year. what i say is that there is a chance that you can get it at a lower cost than this estimate (or quote, which i would try to re-negotiate if that is the case). i have not had a single problem after getting the af upgrade on mine. you missed my points. i was talking about leica being specifically aware of marc’s situation. it should be free, and quick. period. no negotiation. no excuses. the company dropped the ball for him and others. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 26983, "year": "2018"}, {"autor": "mikozia", "date": "2018-06-24 00:48:00", "content": "Colorful bird of a different kind --img-- (my apologies to all the talented real bird photographers. Due to a lack of birding photography skill and super telephoto lenses. This is all I can come up with.) X-Vario. --img-- ", "link": "https://www.l-camera-forum.com/topic/278547-open-bird-thread-twitchers-post-here/page/4/?tab=comments#comment-3542643", "origin": "L-forum", "suborigin": "278547-open-bird-thread-twitchers-post-here", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "colorful bird of a different kind --img-- (my apologies to all the talented real bird photographers. due to a lack of birding photography skill and super telephoto lenses. this is all i can -----> come !!!  -----> up !!!  -----> with !!! .) x-vario. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 48922, "year": "2018"}, {"autor": "stray cat", "date": "2018-11-05 04:44:00", "content": "Only with film... These are exciting discoveries. What a sensational feeling to be still shooting Kodachrome 64! Will you process it as black and white (which I believe can be done)? I imagine I will stand process in Rodinal when I come to do the films I showed. That seems to be the most forgiving process that might yield some results. It would be a shame to end up with nada - that must have been quite shattering! Anyway, I'm sure the diptyches thread will benefit from some hidden treasures, and I'm loving seeing what everyone here comes up with in terms of pairings or multiples of images.", "link": "https://www.l-camera-forum.com/topic/290225-diptychs-triptychs-and-polytychs-open-thread/page/4/?tab=comments#comment-3625713", "origin": "L-forum", "suborigin": "290225-diptychs-triptychs-and-polytychs-open-thread", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "only with film... these are exciting discoveries. what a sensational feeling to be still shooting kodachrome 64! will you process it as black and white (which i believe can be done)? i imagine i will stand process in rodinal when i come to do the films i showed. that seems to be the most forgiving process that might yield some results. it would be a shame to end up with nada - that must have been quite shattering! anyway, i'm sure the diptyches thread will benefit from some hidden treasures, and i'm loving seeing what everyone here -----> comes !!!  -----> up !!!  -----> with !!!  in terms of pairings or multiples of images.", "sortedWord": "None", "Identifyer": null, "identifyer": 63826, "year": "2018"}, {"autor": "earleygallery", "date": "2018-07-05 00:50:00", "content": "Leica dropped the idea of developing a DSLR ‘R’ model stating at the time that they couldn’t compete in that market (against Canon and Nikon). Ever since then they’ve been coming up with half baked ‘DSLR’ solutions, none of which have been a roaring success. Who knows what they’re coming up with next. A revamped SL seems the most likely.", "link": "https://www.l-camera-forum.com/topic/286256-will-impending-nikon-mirrorless-affect-leicas-planning/?tab=comments#comment-3549754", "origin": "L-forum", "suborigin": "286256-will-impending-nikon-mirrorless-affect-leicas-planning", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "leica dropped the idea of developing a dslr ‘r’ model stating at the time that they couldn’t compete in that market (against canon and nikon). ever since then they’ve been -----> coming !!!  -----> up !!!  -----> with !!!  half baked ‘dslr’ solutions, none of which have been a roaring success. who knows what they’re coming up with next. a revamped sl seems the most likely.", "sortedWord": "None", "Identifyer": null, "identifyer": 78113, "year": "2018"}, {"autor": "Guest VVJ", "date": "2018-05-30 00:53:00", "content": "Smaller and lighter AF FF L-mount lenses would be appreciated by most people I believe. I like the SL body though. I really wouldn't want to lose any functionality there and I don't feel the body itself is too heavy, so Leica would need to come up with something pretty innovative to get my attention. Also, I really don't need 3 L-mount bodies, so If I were to buy the new body either the CL or the SL would need to go.", "link": "https://www.l-camera-forum.com/topic/285080-leica-cm-ml-new-leica-mirrorless-announcement/page/4/?tab=comments#comment-3528068", "origin": "L-forum", "suborigin": "285080-leica-cm-ml-new-leica-mirrorless-announcement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "smaller and lighter af ff l-mount lenses would be appreciated by most people i believe. i like the sl body though. i really wouldn't want to lose any functionality there and i don't feel the body itself is too heavy, so leica would need to -----> come !!!  -----> up !!!  -----> with !!!  something pretty innovative to get my attention. also, i really don't need 3 l-mount bodies, so if i were to buy the new body either the cl or the sl would need to go.", "sortedWord": "None", "Identifyer": null, "identifyer": 78400, "year": "2018"}, {"autor": "onasj", "date": "2018-05-31 12:16:00", "content": "Jono, point well taken, but consistent with my observations, Leica lenses 50 mm or longer have little difficulty achieving their acuity potential, especially in the center of the field, on the A7riii. Indeed, my copy of the 50 APO continues to outresolve the middle of the 42 MP center on the A7riii, so it is not limited by adaptation to the Sony body. The corners are softer but my comparison with between the 55/1.8 and the 50/APO was center-to-center. With respect to build quality mentioned by others, I agree that Leica M lens build quality is second to none, and substantially better than Sony’s. I’m optimistic that Leica engineers can come up with a lens analogous to the Sony/Zeiss 55/1.8 that is optically superb, no larger than the Sony, yet has Leica M build quality. I’ll happily accept 1.5x the weight. If Leica can release a set of AF primes over the next 24 months with decently large maximum apertures (1.8-2.4) spanning something like 28-35-50-75-90 focal lengths the rumored CM line will be off to a very strong start. I’m a huge M fan, and M lenses consume the plurality of my disposable income. But I welcome this rumor with hopefulness that it marks not only the beginning of an exciting new line of Leica products, but also bodes well for the ability of my favorite photography company to evolve in a highly competitive industry. Now if only the CM would come with a front-back moving sensor that enables partially autofocus on M lenses... --img--  I agree the 55 f1.8 is a good lens - but you can’t test it side by side on an A7 unless you’ve done the Kolari mod - the thicker cover glass means that the 50 APO doesn’t perform nearly as well as it does on the M10 (or the SL come to that).", "link": "https://www.l-camera-forum.com/topic/285080-leica-cm-ml-new-leica-mirrorless-announcement/page/7/?tab=comments#comment-3528948", "origin": "L-forum", "suborigin": "285080-leica-cm-ml-new-leica-mirrorless-announcement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "jono, point well taken, but consistent with my observations, leica lenses 50 mm or longer have little difficulty achieving their acuity potential, especially in the center of the field, on the a7riii. indeed, my copy of the 50 apo continues to outresolve the middle of the 42 mp center on the a7riii, so it is not limited by adaptation to the sony body. the corners are softer but my comparison with between the 55/1.8 and the 50/apo was center-to-center. with respect to build quality mentioned by others, i agree that leica m lens build quality is second to none, and substantially better than sony’s. i’m optimistic that leica engineers can -----> come !!!  -----> up !!!  -----> with !!!  a lens analogous to the sony/zeiss 55/1.8 that is optically superb, no larger than the sony, yet has leica m build quality. i’ll happily accept 1.5x the weight. if leica can release a set of af primes over the next 24 months with decently large maximum apertures (1.8-2.4) spanning something like 28-35-50-75-90 focal lengths the rumored cm line will be off to a very strong start. i’m a huge m fan, and m lenses consume the plurality of my disposable income. but i welcome this rumor with hopefulness that it marks not only the beginning of an exciting new line of leica products, but also bodes well for the ability of my favorite photography company to evolve in a highly competitive industry. now if only the cm would come with a front-back moving sensor that enables partially autofocus on m lenses... --img--  i agree the 55 f1.8 is a good lens - but you can’t test it side by side on an a7 unless you’ve done the kolari mod - the thicker cover glass means that the 50 apo doesn’t perform nearly as well as it does on the m10 (or the sl come to that).", "sortedWord": "None", "Identifyer": null, "identifyer": 78462, "year": "2018"}, {"autor": "Chaemono", "date": "2018-12-10 08:10:00", "content": " vor 10 Stunden schrieb pgk: The thing is; you need to determine what conclusion you are trying to come to. I think you’re right. The topic in this thread has been pretty vague or not formulated well at all. And most cameras today, including APS-C ones, are good enough. I would like to start another topic/thread on how each camera, Z7, α7R III, and M10 meter a scene (center weighted) with the same lens when put in A Mode. I may use base ISO or close for each, meaning ISO 64 on the Z7, ISO 100 on the α7R III, and ISO 200 on the M10. I think that’s an interesting project to see what shutter speed each camera comes up with and how exposure will look. I’ll set EV to -0.7 on each. It’ll take me a while to start this project but I think that’s a good one for the slow days during and in between the holidays. What do you think of that?", "link": "https://www.l-camera-forum.com/topic/291766-z7-with-m-lenses-vs-m10-image-thread/page/2/?tab=comments#comment-3644885", "origin": "L-forum", "suborigin": "291766-z7-with-m-lenses-vs-m10-image-thread", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": " vor 10 stunden schrieb pgk: the thing is; you need to determine what conclusion you are trying to come to. i think you’re right. the topic in this thread has been pretty vague or not formulated well at all. and most cameras today, including aps-c ones, are good enough. i would like to start another topic/thread on how each camera, z7, α7r iii, and m10 meter a scene (center weighted) with the same lens when put in a mode. i may use base iso or close for each, meaning iso 64 on the z7, iso 100 on the α7r iii, and iso 200 on the m10. i think that’s an interesting project to see what shutter speed each camera -----> comes !!!  -----> up !!!  -----> with !!!  and how exposure will look. i’ll set ev to -0.7 on each. it’ll take me a while to start this project but i think that’s a good one for the slow days during and in between the holidays. what do you think of that?", "sortedWord": "None", "Identifyer": null, "identifyer": 84054, "year": "2018"}, {"autor": "willeica", "date": "2018-12-10 15:14:00", "content": "6 hours ago, Chaemono said: I think you’re right. The topic in this thread has been pretty vague or not formulated well at all. And most cameras today, including APS-C ones, are good enough. I would like to start another topic/thread on how each camera, Z7, α7R III, and M10 meter a scene (center weighted) with the same lens when put in A Mode. I may use base ISO or close for each, meaning ISO 64 on the Z7, ISO 100 on the α7R III, and ISO 200 on the M10. I think that’s an interesting project to see what shutter speed each camera comes up with and how exposure will look. I’ll set EV to -0.7 on each. It’ll take me a while to start this project but I think that’s a good one for the slow days during and in between the holidays. What do you think of that?﻿ Words fail me. Have you not got some subjects that you might like to photograph (not make files, please) with the cameras? That is what they are for. I always ignore such nonsensical comparison reviews on other websites. You must have some 'very slow days' as you say or else you are winding us all up. William", "link": "https://www.l-camera-forum.com/topic/291766-z7-with-m-lenses-vs-m10-image-thread/page/2/?tab=comments#comment-3645060", "origin": "L-forum", "suborigin": "291766-z7-with-m-lenses-vs-m10-image-thread", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "6 hours ago, chaemono said: i think you’re right. the topic in this thread has been pretty vague or not formulated well at all. and most cameras today, including aps-c ones, are good enough. i would like to start another topic/thread on how each camera, z7, α7r iii, and m10 meter a scene (center weighted) with the same lens when put in a mode. i may use base iso or close for each, meaning iso 64 on the z7, iso 100 on the α7r iii, and iso 200 on the m10. i think that’s an interesting project to see what shutter speed each camera -----> comes !!!  -----> up !!!  -----> with !!!  and how exposure will look. i’ll set ev to -0.7 on each. it’ll take me a while to start this project but i think that’s a good one for the slow days during and in between the holidays. what do you think of that?﻿ words fail me. have you not got some subjects that you might like to photograph (not make files, please) with the cameras? that is what they are for. i always ignore such nonsensical comparison reviews on other websites. you must have some 'very slow days' as you say or else you are winding us all up. william", "sortedWord": "None", "Identifyer": null, "identifyer": 84057, "year": "2018"}, {"autor": "edstock", "date": "2018-12-16 07:06:00", "content": " After a long hiatus from photography I decided to try me hand with film, again. Pulling out my M7 and R7 and R6.2. I knew the first question was battery availability. NYC was no help. Tried searching the internet and came up with Batteries and Bulbs. A national chain and they had the 1/3n batteries that both system cameras require. The closest store is about 20 minutes away and they had the 1/3n as well as the 1.5 v batteries. So I can recommend this business for all your battery needs.", "link": "https://www.l-camera-forum.com/topic/292334-batteries-for-both-systems-m-r/?tab=comments#comment-3648161", "origin": "L-forum", "suborigin": "292334-batteries-for-both-systems-m-r", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " after a long hiatus from photography i decided to try me hand with film, again. pulling out my m7 and r7 and r6.2. i knew the first question was battery availability. nyc was no help. tried searching the internet and -----> came !!!  -----> up !!!  -----> with !!!  batteries and bulbs. a national chain and they had the 1/3n batteries that both system cameras require. the closest store is about 20 minutes away and they had the 1/3n as well as the 1.5 v batteries. so i can recommend this business for all your battery needs.", "sortedWord": "None", "Identifyer": null, "identifyer": 84167, "year": "2018"}, {"autor": "Herr Barnack", "date": "2018-09-11 22:28:00", "content": "I will add that the greatest part of my youth was becoming lost in odd European places with a new M2. That sounds like photographic Nirvana. A friend did likewise, but in China. He spent a year traveling by foot through China and neighboring Asian nations. Seeing as how I wasted the years of what was supposed to have been my misspent youth with my nose to the grindstone and shoulder to the wheel, I am now on a quest to make up for those poor life choices by traveling and photographing in the autumn years of my time on our Blue Marble. For the life of me, I can't come up with anything better to do; thank Heaven above for that. --img--  Edited September 11, 2018 by Herr Barnack", "link": "https://www.l-camera-forum.com/topic/289360-leica-photo-adventure-lofoten-islands-norway/?tab=comments#comment-3591549", "origin": "L-forum", "suborigin": "289360-leica-photo-adventure-lofoten-islands-norway", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i will add that the greatest part of my youth was becoming lost in odd european places with a new m2. that sounds like photographic nirvana. a friend did likewise, but in china. he spent a year traveling by foot through china and neighboring asian nations. seeing as how i wasted the years of what was supposed to have been my misspent youth with my nose to the grindstone and shoulder to the wheel, i am now on a quest to make up for those poor life choices by traveling and photographing in the autumn years of my time on our blue marble. for the life of me, i can't -----> come !!!  -----> up !!!  -----> with !!!  anything better to do; thank heaven above for that. --img--  edited september 11, 2018 by herr barnack", "sortedWord": "None", "Identifyer": null, "identifyer": 84411, "year": "2018"}, {"autor": "thebarnman", "date": "2018-03-22 01:01:00", "content": " Can anyone come up with a guide number for the Profoto A1? Since there's nothing on the internet I can find about that; it might be better or easier to compare power output between the Leica SF-60 and the Profoto A1 via it's watts per second. The Profoto A1 is rated at 76 W/s. If that's not possible, is there a way to come up with a guide number for the Profoto A1?", "link": "https://www.l-camera-forum.com/topic/257427-sf-60-flash/page/2/?tab=comments#comment-3485246", "origin": "L-forum", "suborigin": "257427-sf-60-flash", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " can anyone -----> come !!!  -----> up !!!  -----> with !!!  a guide number for the profoto a1? since there's nothing on the internet i can find about that; it might be better or easier to compare power output between the leica sf-60 and the profoto a1 via it's watts per second. the profoto a1 is rated at 76 w/s. if that's not possible, is there a way to come up with a guide number for the profoto a1?", "sortedWord": "None", "Identifyer": null, "identifyer": 88597, "year": "2018"}, {"autor": "FlashGordonPhotography", "date": "2018-03-11 21:21:00", "content": "Btw, don’t forget that bo-keh is nowhere so nice as on the 24x36mm format. Bo-keh in MF and LF is much sooner too vague to be called bo-keh at all, especially in the foreground Where do people come up with silly statements like this? Maybe you need to try the S 100mm f2 or the HB 100mm f2.2? Or the Sigma 85mm 1.4 Art, which completely covers the 44x33mm frame. The smoothness of how transfers from in focus to out of focus are one of the attractions of larger formats. And Bokeh (Boke) is the QUALITY of the blur, not the amount of blur. Lenses like the Noctilux have less apparent DoF. That's not bokeh though. Gordon", "link": "https://www.l-camera-forum.com/topic/282002-camera-decisions/page/2/?tab=comments#comment-3478925", "origin": "L-forum", "suborigin": "282002-camera-decisions", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "btw, don’t forget that bo-keh is nowhere so nice as on the 24x36mm format. bo-keh in mf and lf is much sooner too vague to be called bo-keh at all, especially in the foreground where do people -----> come !!!  -----> up !!!  -----> with !!!  silly statements like this? maybe you need to try the s 100mm f2 or the hb 100mm f2.2? or the sigma 85mm 1.4 art, which completely covers the 44x33mm frame. the smoothness of how transfers from in focus to out of focus are one of the attractions of larger formats. and bokeh (boke) is the quality of the blur, not the amount of blur. lenses like the noctilux have less apparent dof. that's not bokeh though. gordon", "sortedWord": "None", "Identifyer": null, "identifyer": 92078, "year": "2018"}, {"autor": "Guest", "date": "2018-03-12 01:11:00", "content": "Where do people come up with silly statements like this? Maybe you need to try the S 100mm f2 or the HB 100mm f2.2? Or the Sigma 85mm 1.4 Art, which completely covers the 44x33mm frame. The smoothness of how transfers from in focus to out of focus are one of the attractions of larger formats. And Bokeh (Boke) is the QUALITY of the blur, not the amount of blur. Lenses like the Noctilux have less apparent DoF. That's not bokeh though. Gordon thanks for that Gordon. I was going to reply earlier but decided not to as I’m in enough trouble as it is --img-- Neil", "link": "https://www.l-camera-forum.com/topic/282002-camera-decisions/page/2/?tab=comments#comment-3479034", "origin": "L-forum", "suborigin": "282002-camera-decisions", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "where do people -----> come !!!  -----> up !!!  -----> with !!!  silly statements like this? maybe you need to try the s 100mm f2 or the hb 100mm f2.2? or the sigma 85mm 1.4 art, which completely covers the 44x33mm frame. the smoothness of how transfers from in focus to out of focus are one of the attractions of larger formats. and bokeh (boke) is the quality of the blur, not the amount of blur. lenses like the noctilux have less apparent dof. that's not bokeh though. gordon thanks for that gordon. i was going to reply earlier but decided not to as i’m in enough trouble as it is --img-- neil", "sortedWord": "None", "Identifyer": null, "identifyer": 92079, "year": "2018"}, {"autor": "otto.f", "date": "2018-03-12 17:14:00", "content": "Where do people come up with silly statements like this? In a situation where bo-keh has no objectively defined meaning but points to a quality where tastes of people can differ, like in ‘a good wine’.", "link": "https://www.l-camera-forum.com/topic/282002-camera-decisions/page/2/?tab=comments#comment-3479476", "origin": "L-forum", "suborigin": "282002-camera-decisions", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "where do people -----> come !!!  -----> up !!!  -----> with !!!  silly statements like this? in a situation where bo-keh has no objectively defined meaning but points to a quality where tastes of people can differ, like in ‘a good wine’.", "sortedWord": "None", "Identifyer": null, "identifyer": 92080, "year": "2018"}, {"autor": "Keith_W", "date": "2018-04-21 09:01:00", "content": "Well after some time with no response from admin, I came up with my own solution for avoiding this problem (yes it still exists): 1. Click \"View New Content\" 2. Click \">>\" to go to the last page of posts 3. Navigate backwards to the first page.", "link": "https://www.l-camera-forum.com/topic/280615-posts-skipping-when-using-next-page-function/?tab=comments#comment-3504092", "origin": "L-forum", "suborigin": "280615-posts-skipping-when-using-next-page-function", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "well after some time -----> with !!!  no response from admin, i -----> came !!!  -----> up !!!  -----> with !!!  my own solution for avoiding this problem (yes it still exists): 1. click \"view new content\" 2. click \">>\" to go to the last page of posts 3. navigate backwards to the first page.", "sortedWord": "None", "Identifyer": null, "identifyer": 118155, "year": "2018"}, {"autor": "Alberti", "date": "2018-10-05 08:18:00", "content": "Any registration required? Would love to join. Thanks, I will come up with a list in due time: and the mechanism will be self-registering. Please also tick the small tab to on the top of the page to follow this topic. --img-- Tourists having a guided tour in a Thai electric taxi. Just blends in with the colors of those funny houses.", "link": "https://www.l-camera-forum.com/topic/287236-rotterdam-meeting-march-23rd-2019/?tab=comments#comment-3606681", "origin": "L-forum", "suborigin": "287236-rotterdam-meeting-march-23rd-2019", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "any registration required? would love to join. thanks, i will -----> come !!!  -----> up !!!  -----> with !!!  a list in due time: and the mechanism will be self-registering. please also tick the small tab to on the top of the page to follow this topic. --img-- tourists having a guided tour in a thai electric taxi. just blends in with the colors of those funny houses.", "sortedWord": "None", "Identifyer": null, "identifyer": 129888, "year": "2018"}, {"autor": "Alberti", "date": "2018-08-04 15:15:00", "content": "Update on the planning of the meeting in Rotterdam: this has been cancelled, in good deliberation with those who had planned to go or shown interest. The new date is: Saturday March 23rd 2019 The programm will roughly be the same, although dinner will probably be a a riverside location now. I'll come up with a new thread quickly so we can all book it in our agenda and have a good attended Leica meeting in this nice city where not only the pictures but also the sounds and smells remind us of a real international city. regards albert", "link": "https://www.l-camera-forum.com/topic/284928-leica-meeting-in-rotterdam-on-august-18th-2018/page/2/?tab=comments#comment-3566648", "origin": "L-forum", "suborigin": "284928-leica-meeting-in-rotterdam-on-august-18th-2018", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "update on the planning of the meeting in rotterdam: this has been cancelled, in good deliberation with those who had planned to go or shown interest. the new date is: saturday march 23rd 2019 the programm will roughly be the same, although dinner will probably be a a riverside location now. i'll -----> come !!!  -----> up !!!  -----> with !!!  a new thread quickly so we can all book it in our agenda and have a good attended leica meeting in this nice city where not only the pictures but also the sounds and smells remind us of a real international city. regards albert", "sortedWord": "None", "Identifyer": null, "identifyer": 131031, "year": "2018"}, {"autor": "stray cat", "date": "2018-11-03 11:13:00", "content": "9 hours ago, Ernest said: Black Cat Chair M-A Thambar-M ADOX Color Implosion 100 Nikon F Micro-Nikkor 55mm Tri-X (undeveloped for 36 years) --img--  OK this is blowing my mind. The tri-x remained undeveloped for 36 years - which places it in 1982 I believe. So this lovely little girl holding the cat - she is grown up now. The cat, sadly, is no longer with us. The cat is looking at something 36 years ago. In another ~tych (How Busy They Are) you have posted on \"I Like Film\" the same cat being held by the same girl in the same picture looks across at a sequence in identical format but sees an older lady lying in bed. Now because the sequence in HBTA runs somewhat like cinema film the mind thinks of a cinematic equivalent and this mind comes up with the post-stargate bedroom sequence in 2001: A Space Odyssey. These two sequences of Rog's seem to suggest the whole passing of life occurring in the space of the sequential frames. And in fact this is reinforced by the use of 36 year-old film. These pictures (I assume the tree in HBTA and the chair in this Black Cat Chair triptych are from the same roll) until now have existed as latent images - the girl, not yet developed as a photograph even as she was not yet developed as a woman. The cat - Schrödinger's - alive on cellulose even as it was dead in the space between when the photograph was taken - the image not yet fixed, and now, when it is finally \"alive\" in the picture. There are so many layers in the two sequences. I agree with Steve: 2 hours ago, Steve Ricoh said: Su﻿rely a ﻿conversation stopper repla﻿ced by silence, open m﻿ouths.﻿.. . My mouth agape has my chin on the floor. It's late. I need my sleep.", "link": "https://www.l-camera-forum.com/topic/290225-diptychs-triptychs-and-polytychs-open-thread/page/3/?tab=comments#comment-3624572", "origin": "L-forum", "suborigin": "290225-diptychs-triptychs-and-polytychs-open-thread", "result": false, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "now because the sequence in hbta runs somewhat like cinema -----> film !!!  the mind thinks of a cinematic equivalent and this mind comes up with the post-stargate bedroom sequence in 2001: a space odyssey.", "sortedWord": "film", "Identifyer": null, "identifyer": 63809, "year": "2018"}, {"autor": "Ernest", "date": "2018-11-03 20:09:00", "content": "8 hours ago, stray cat said: OK this is blowing my mind. The tri-x remained undeveloped for 36 years - which places it in 1982 I believe. So this lovely little girl holding the cat - she is grown up now. The cat, sadly, is no longer with us. The cat is looking at something 36 years ago. In another ~tych (How Busy They Are) you have posted on \"I Like Film\" the same cat being held by the same girl in the same picture looks across at a sequence in identical format but sees an older lady lying in bed. Now because the sequence in HBTA runs somewhat like cinema film the mind thinks of a cinematic equivalent and this mind comes up with the post-stargate bedroom sequence in 2001: A Space Odyssey. These two sequences of Rog's seem to suggest the whole passing of life occurring in the space of the sequential frames﻿. And in fact this is reinforced by the use of 36 year-old film. These pictures (I assume the tree in HBTA and the chair in this Black Cat Chair triptych are from the same roll) until now have existed as latent images - the girl, not yet developed as a photograph even as she was not yet developed as a woman. The cat - Schrödinger's - alive on cellulose even as it was dead in the space between when the photograph was taken - the image not yet fixed, and now, when it is finally \"alive\" in the picture. There are so many layers in the two sequences. I agree with Steve: . My mouth agape has my chin on the floor. It's late. I need my sleep. Yes, yes, and yes. You have it all wrapped up. For How Busy They Are, I was not thinking about Kubrick, but, yes, there is that time lapse sequence that is so enigmatic, especially without words, that speaks to the mystery of life passing and remembered, simultaneously. The palimpsest of it all surfaces, again. The challenge was to restate the often stated cliché: passage of time. The intersection of all of these images brought to life after 36 years of celluloid darkness on the same roll was remarkable for me. Not that it matters, but the little girl is my niece, the older lady is my grandmother, and the tree is on my step-grandfather's land. My niece is now 43, and my grandparents have passed away. Cropping out half of the faces makes the images universal, and even gives the connotation that the little girl and the older lady may be one and the same. The black cat is, well, the black cat, though there is the black-and-white cat next to the ancient tree, the one ageless common denominator between the two images, but that black-and-white cat is absent in the second shot. I like your reading much more, the way that you have excavated the visual layers. And, of course, there is Kubrick; anything that brings him into a conversation deserves applause. The chair in Black Cat Chair I actually shot last week on ADOX: first shot with flare on the roll. I went for the darkness of the open door held open by the black chair, the black rectangle reiterated by the yellow caution rail. The background is a shopping bag, also on ADOX for a little implosion. Thanks, again, for your astute reading and charitable comments. Cheers, Rog", "link": "https://www.l-camera-forum.com/topic/290225-diptychs-triptychs-and-polytychs-open-thread/page/3/?tab=comments#comment-3624900", "origin": "L-forum", "suborigin": "290225-diptychs-triptychs-and-polytychs-open-thread", "result": false, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "now because the sequence in hbta runs somewhat like cinema -----> film !!!  the mind thinks of a cinematic equivalent and this mind comes up with the post-stargate bedroom sequence in 2001: a space odyssey.", "sortedWord": "film", "Identifyer": null, "identifyer": 63810, "year": "2018"}, {"autor": "schattenundlicht", "date": "2018-02-19 13:57:00", "content": " Hi! Although many others will have used similiar setups, I want to share a rather ‚quick and dirty‘ solution that I had to come up with after my negative scanner broke down and had to be sent in for repair, leaving me with quite a few strips of unscanned b&w film (my second scanner is a slide magazine batch scanner that does not work with unmounted film). Not owning a BEOON, I had to come up with an interim solution. It does not use Leica equipment, but I use it exclusively to scan films shot with my Leicas, so that hopefully qualifies this post as partially legitimate --img--  Setup: iPad (poor man‘s lighttable), distancing box (aka thick wooden frame), two glass covers from photo frames, reversible tripod, DSLR, macro lens, tethering freeware (Sofortbild). Tethering with self-timer and mirror pre-release is helpful to reduce vibrations, since the Cullmann tripod is not designed for this application and is not as steady as a BEOON or other dedicated copy stands. Adjust camera with mechanical spirit level. Manual focus on film grain with 100% magnification in tethering software. With more time, the setup definitely could be improved upon, but I hope to get my scanner back soon. --img--  Some examples (not for technical testing): https://www.l-camera-forum.com/topic/257654-black-and-white-image-thread/?p=3463651 https://www.l-camera-forum.com/topic/257654-black-and-white-image-thread/page-88?do=findComment&comment=3463541 Edited February 19, 2018 by schattenundlicht", "link": "https://www.l-camera-forum.com/topic/281978-emergency-%E2%80%9Ediy%E2%80%9C-scanning/?tab=comments#comment-3464650", "origin": "L-forum", "suborigin": "281978-emergency-%E2%80%9Ediy%E2%80%9C-scanning", "result": false, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "although many others will have used similiar setups, i want to share a rather ‚quick and dirty‘ solution that i had to come up with after my negative scanner broke down and had to be sent in for -----> repair !!! , leaving me with quite a few strips of unscanned b&w film (my second scanner is a slide magazine batch scanner that does not work with unmounted film).", "sortedWord": "repair", "Identifyer": null, "identifyer": 102082, "year": "2018"}], "name": "Leicasortedout2018with"}