{"interestingcomments": [{"autor": "Anlotti", "date": "2015-10-30 16:42:00", "content": "I haven't had it myself (touch wood) but see the DIY solution offered by Paulmac, posted 24 August, in the thread 'New M8 Owner with questions'.", "link": "https://www.l-camera-forum.com/topic/251692-how-many-have-you-dealt-with-a-red-linedead-pixel-issue/?tab=comments#comment-2917330", "origin": "L-forum", "suborigin": "251692-how-many-have-you-dealt-with-a-red-linedead-pixel-issue", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i haven't had it myself (touch wood) but see the -----> diy !!!  solution offered by paulmac, posted 24 august, in the thread 'new m8 owner with questions'.", "sortedWord": "None", "Identifyer": null, "identifyer": 47380, "year": "2015"}, {"autor": "tri", "date": "2015-06-27 12:53:00", "content": "My Colorplan has a smaller external diameter than the Kodak tube with an external helicoid it is mounted in. It might even be adaptable with equal results to the ones in a Pradovit with a bit of DIY. I wish I knew more about Colorplan lenses. Would you have a source of literature? Simon", "link": "https://www.l-camera-forum.com/topic/246897-bestrecommended-leica-slide-projectors/?tab=comments#comment-2843229", "origin": "L-forum", "suborigin": "246897-bestrecommended-leica-slide-projectors", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my colorplan has a smaller external diameter than the kodak tube with an external helicoid it is mounted in. it might even be adaptable with equal results to the ones in a pradovit with a bit of -----> diy !!! . i wish i knew more about colorplan lenses. would you have a source of literature? simon", "sortedWord": "None", "Identifyer": null, "identifyer": 38807, "year": "2015"}, {"autor": "mjh", "date": "2015-02-28 14:32:00", "content": "This statement makes lot of perplexity to arise, for me... a 2nd sensor (ok.. surely \"phone-camera size\") and it MUST make an image at least decent (so a phone camera lens in front, ok, fixed focus, simple/cheap... but anyway a processor unit for it)... then some fine mechanics MUST be made anyway (the 2nd sensor image must MOVE on the main RF window) This could be a fairly simple camera unit with a long and fixed focal length. As you suggest the focus may be fixed; a contrast-based AF would also be a possibility although it could be a bit awkward if the AF of the secondary camera unit was hunting for optimum focus while you were trying to align the optical with the digital image. Suitable camera modules are available off the shelf. Shifting the digital rangefinder patch would probably be achieved digitally – no moving parts required. They still need to measure the focus position of the lens, though. This might also require occasional recalibration but it could be a DIY affair I suppose. So in principle this could work, but there are a couple of obstacles to be overcome and so far there is nothing to suggest that the Konost team have a real handle on this. The prototype doesn‘t sport a viewfinder of any kind and what little they say about the proposed digital RF doesn’t inspire any confidence in me. Edited February 28, 2015 by mjh", "link": "https://www.l-camera-forum.com/topic/241491-konost-merged/page/4/?tab=comments#comment-2772182", "origin": "L-forum", "suborigin": "241491-konost-merged", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "this statement makes lot of perplexity to arise, for me... a 2nd sensor (ok.. surely \"phone-camera size\") and it must make an image at least decent (so a phone camera lens in front, ok, fixed focus, simple/cheap... but anyway a processor unit for it)... then some fine mechanics must be made anyway (the 2nd sensor image must move on the main rf window) this could be a fairly simple camera unit with a long and fixed focal length. as you suggest the focus may be fixed; a contrast-based af would also be a possibility although it could be a bit awkward if the af of the secondary camera unit was hunting for optimum focus while you were trying to align the optical with the digital image. suitable camera modules are available off the shelf. shifting the digital rangefinder patch would probably be achieved digitally – no moving parts required. they still need to measure the focus position of the lens, though. this might also require occasional recalibration but it could be a -----> diy !!!  affair i suppose. so in principle this could work, but there are a couple of obstacles to be overcome and so far there is nothing to suggest that the konost team have a real handle on this. the prototype doesn‘t sport a viewfinder of any kind and what little they say about the proposed digital rf doesn’t inspire any confidence in me. edited february 28, 2015 by mjh", "sortedWord": "None", "Identifyer": null, "identifyer": 93437, "year": "2015"}], "name": "Leicasortedout2015diy"}