{"interestingcomments": [{"autor": "Guest Walt", "date": "2007-07-31 16:49:00", "content": "Mitch, Hank and Charles- You're all describing what I should have caught onto quite a while ago. It is not only the image character, but the handling of the camera that makes the GR-D more like \"a Leica\" than the M8 is. The GR-D is most reminiscent of the IIIF or IIIG and with the VC finders in the hotshoe it has an excellent and accurate image, much better than any of the Leicas. What I would like from the GR-D (which I am limiting to ISO 400 for noise) is an F 2.0 lens, which is, of course, what I am used to from the old Leicas (Tri-X/Summicrons), though this is not a big deal. Mostly I would like a buffer that allows shooting RAW once a second or so. Beyond that, a 35mm-equivalent lens version of the camera would also be nice. Carrying one camera per focal length would be a lot easier than carrying an extra M-8 lens. I wouldn't need anything else. For the moment, I'm banking on Ricoh coming up with a camera that meets these kinds of needs. I'm awaiting Sean's review of the GX-100 but I already know that it has no RAW buffer. JPEGS give me the creeps, though the Ricoh BW JPEGS are surprisingly good, better than I can accomplish converting color JPEGS. Ricoh should use even less compression on them. From my experience, I don't see the advantages of the M8 for medium format work over a DSLR, excepting the weight. And even there, a camera like the Canon Rebel seems a better choice to me--about the same size, much lighter, very refined, much more accurate finder, much more reliable I'd guess. I love the image character of the M8, but are the Canons really incapable of that? Perhaps, but the Nikons? I find them very \"filmic,\" very M8 like. But I don't do this kind of work and really just don't understand the values and why someone would want an M8 for this. I also wonder if Leica really knows what this kind of work is about--the color/IR stuff in the M8 would suggest that they didn't. On the reliability issues that Thomas raises, I don't do paragliding, I walk to restaurants. And I can't say that the M8 has been a paragon of reliability. I've had five M8's and one GR-D and the one GR-D works more reliably than the five M8s put together. And look at it this way: For what I've spent on two M8 bodies and a few lenses, I could buy 30 GR-Ds, which would be a very reliable approach. I also understand that Ricoh service is really responsive and good. (Perhaps the biggest weakness of the M8 at this point is the service organization behind it.) Oh well, enough talk about cameras--they are really irritating. I've never had the camera I used make or break a photograph, though cameras like the M8 can certainly get in the way. Everytime I turn an M8 on, I look at the frame counter to see if it's actually still working. I think the recent forum post about not pushing the shutter release too fast because it abuses the camera really knocked me over the edge. Walt", "link": "https://www.l-camera-forum.com/topic/28906-leica-m8-and-ricoh-gr-d/page/4/?tab=comments#comment-317532", "origin": "L-forum", "suborigin": "28906-leica-m8-and-ricoh-gr-d", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "mitch, hank and charles- you're all describing what i should have caught onto quite a while ago. it is not only the image character, but the handling of the camera that makes the gr-d more like \"a leica\" than the m8 is. the gr-d is most reminiscent of the iiif or iiig and with the vc finders in the hotshoe it has an excellent and accurate image, much better than any of the leicas. what i would like from the gr-d (which i am limiting to iso 400 for noise) is an f 2.0 lens, which is, of course, what i am used to from the old leicas (tri-x/summicrons), though this is not a big deal. mostly i would like a buffer that allows shooting raw once a second or so. beyond that, a 35mm-equivalent lens version of the camera would also be nice. carrying one camera per focal length would be a lot easier than carrying an extra m-8 lens. i wouldn't need anything else. for the moment, i'm banking on ricoh -----> coming !!!  -----> up !!!  -----> with !!!  a camera that meets these kinds of needs. i'm awaiting sean's review of the gx-100 but i already know that it has no raw buffer. jpegs give me the creeps, though the ricoh bw jpegs are surprisingly good, better than i can accomplish converting color jpegs. ricoh should use even less compression on them. from my experience, i don't see the advantages of the m8 for medium format work over a dslr, excepting the weight. and even there, a camera like the canon rebel seems a better choice to me--about the same size, much lighter, very refined, much more accurate finder, much more reliable i'd guess. i love the image character of the m8, but are the canons really incapable of that? perhaps, but the nikons? i find them very \"filmic,\" very m8 like. but i don't do this kind of work and really just don't understand the values and why someone would want an m8 for this. i also wonder if leica really knows what this kind of work is about--the color/ir stuff in the m8 would suggest that they didn't. on the reliability issues that thomas raises, i don't do paragliding, i walk to restaurants. and i can't say that the m8 has been a paragon of reliability. i've had five m8's and one gr-d and the one gr-d works more reliably than the five m8s put together. and look at it this way: for what i've spent on two m8 bodies and a few lenses, i could buy 30 gr-ds, which would be a very reliable approach. i also understand that ricoh service is really responsive and good. (perhaps the biggest weakness of the m8 at this point is the service organization behind it.) oh well, enough talk about cameras--they are really irritating. i've never had the camera i used make or break a photograph, though cameras like the m8 can certainly get in the way. everytime i turn an m8 on, i look at the frame counter to see if it's actually still working. i think the recent forum post about not pushing the shutter release too fast because it abuses the camera really knocked me over the edge. walt", "sortedWord": "None", "Identifyer": null, "identifyer": 40998, "year": "2007"}, {"autor": "marknorton", "date": "2007-08-13 10:26:00", "content": " We're grateful to you for your efforts, Carsten, shows clearly just how off the framing is and you wonder who came up with the idea to get it right at closest focus only to have it way off at infinity.", "link": "https://www.l-camera-forum.com/topic/30845-frameline-accuracy-comparison/page/3/?tab=comments#comment-328297", "origin": "L-forum", "suborigin": "30845-frameline-accuracy-comparison", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " we're grateful to you for your efforts, carsten, shows clearly just how off the framing is and you wonder who -----> came !!!  -----> up !!!  -----> with !!!  the idea to get it right at closest focus only to have it way off at infinity.", "sortedWord": "None", "Identifyer": null, "identifyer": 41452, "year": "2007"}, {"autor": "MP3", "date": "2007-04-11 05:22:00", "content": "One of the best thread ever here, Mark. Real Bravo! 9 pages already. Mark, does anybody rise the question, After looking thur all the inside mechanics, do you think it is feasible to come up with a silent shutter by deferring the motor rewind till we release our finger from the shutter press? Cheers Matthew", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/9/?tab=comments#comment-225371", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "one of the best thread ever here, mark. real bravo! 9 pages already. mark, does anybody rise the question, after looking thur all the inside mechanics, do you think it is feasible to -----> come !!!  -----> up !!!  -----> with !!!  a silent shutter by deferring the motor rewind till we release our finger from the shutter press? cheers matthew", "sortedWord": "None", "Identifyer": null, "identifyer": 45434, "year": "2007"}, {"autor": "marknorton", "date": "2007-04-11 05:56:00", "content": "After looking thur all the inside mechanics, do you think it is feasible to come up with a silent shutter by deferring the motor rewind till we release our finger from the shutter press? Matthew, Both the actuation of the shutter and the motor are controlled by the M16C processor which also has direct access to the position of the shutter release so that it would be perfectly possible to defer the cocking of the shutter until the shutter release is released, all selected from a menu option which could be part of a profile. Alternatively, it's possible to think of an add-on Leicavit-type manual wind, see this picture. http://www.leica-camera-user.com/digital-forum/21331-anatomy-leica-m8-4.html#post224784", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/9/?tab=comments#comment-225388", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "after looking thur all the inside mechanics, do you think it is feasible to -----> come !!!  -----> up !!!  -----> with !!!  a silent shutter by deferring the motor rewind till we release our finger from the shutter press? matthew, both the actuation of the shutter and the motor are controlled by the m16c processor which also has direct access to the position of the shutter release so that it would be perfectly possible to defer the cocking of the shutter until the shutter release is released, all selected from a menu option which could be part of a profile. alternatively, it's possible to think of an add-on leicavit-type manual wind, see this picture. http://www.leica-camera-user.com/digital-forum/21331-anatomy-leica-m8-4.html#post224784", "sortedWord": "None", "Identifyer": null, "identifyer": 45438, "year": "2007"}, {"autor": "MP3", "date": "2007-08-26 10:30:00", "content": "Mostly agree with Sean and LCT, it is 'largely' a matter of personal taste. Having said that, I got an excited suggestion. Well before we can agree what is the 'leica look', 'leica fingerprint', we can never come up with some consent on this topic. As it is also very diffcult to JUST put in words to describe what is that look, shall we starting posting pics from 'the most Leica like lens' at this thread and add our personal words why we think so =)", "link": "https://www.l-camera-forum.com/topic/31824-most-leica-like-lens/page/2/?tab=comments#comment-338325", "origin": "L-forum", "suborigin": "31824-most-leica-like-lens", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "mostly agree with sean and lct, it is 'largely' a matter of personal taste. having said that, i got an excited suggestion. well before we can agree what is the 'leica look', 'leica fingerprint', we can never -----> come !!!  -----> up !!!  -----> with !!!  some consent on this topic. as it is also very diffcult to just put in words to describe what is that look, shall we starting posting pics from 'the most leica like lens' at this thread and add our personal words why we think so =)", "sortedWord": "None", "Identifyer": null, "identifyer": 86224, "year": "2007"}], "name": "Leicasortedout2007with"}