{"interestingcomments": [{"autor": "Herr Barnack", "date": "2019-04-11 22:09:00", "content": "On 5/2/2018 at 1:20 AM, howiebrou said: Could you give us a quick summary of the cleaning method and dust avoidance advice you were given? I have yet to clean my sensor and am rather apprehensive about doing so! @howiebrou, This is not official sensor cleaning doctrine from anyone or from any manufacturer; it is just the method I use and is based on sensor cleaning instructions found in the M-P 240 manual and the instructions that come with the swabs and cleaning fluid I use. I have had 100% positive results with 0% problems as a result of using this cleaning technique. I seem to need to clean my sensor about once every 6-9 months. I clean my sensor when multiple dust specks show up in post processing that require an annoying amount of time and work to clone over, not every time a spot or two turns up in post. This description is from a blog post that I wrote for my website; I hope this will shed some light on the sensor cleaning process (we are actually cleaning the protective glass cover, not the sensor itself) for you and others. Quote Digital cameras have sensors; unless your camera has a built in dust reduction system, sooner or later your sensor will need to be cleaned - it's inevitable. Then what?? It's a lot quicker, easier and less costly to do it yourself - if you follow your camera manual instructions exactly and are careful, you can successfully clean your camera's sensor yourself. A lot of photographers fear damaging their sensor and will do about anything to avoid cleaning it themselves. However, there is no reason to be afraid to do this procedure yourself, provided you do it properly. You will need the right sensor cleaning supplies - I use Eclipse Optic Cleaning Fluid and Photosol Sensorswab Ultra sensor cleaning swabs. If your camera has a full frame (24x36mm ) sensor, you will need the Type 3 swabs; they are 24 mm wide, as is your sensor. APS-C and smaller sensors will need smaller swabs. Photosol's website has information that will help you determine which swab is right for your camera. One of the most important factors in successful sensor cleaning is to perform this procedure in a clean, dust free environment. Not many of us have access to a clean room such as computer manufacturers build computers in. If your home has airborne dust issues you will need to clean your sensor in an environment where dust is less of a problem (you can check for airborne dust by looking through the beam of a bright flashlight at night; if you see a lot of dust particles dancing in the air, you should probably go elsewhere to clean your sensor). Where would that be? Try a museum or a library; find a spot away from frequent foot traffic, entries and exits and away from heating and cooling ducts that will cause airflow that will stir up any dust that may be present.. Another important point is this - do not use compressed air (\"canned air\") to blow dust from your sensor before cleaning. Canned air can spray liquid propellant onto your sensor cover glass, something you do not want to happen. That liquid can also get behind the sensor and into the electronic components of your camera. If that happens, you are in for a serious repair bill. Instead of canned air, use a blower bulb like the Giottos Rocket Blaster, which will safely remove loose dust particles from your sensor. Also, do not blow dust from your sensor using your breath, as you can spray tiny droplets of saliva into the camera. The sensor swabs I use are dry, which means I need to apply the proper cleaning fluid to them before use. Too much cleaning fluid can damage the electronics inside your camera, so proceed with caution. I have found that five drops on the 24mm wide swabs my camera requires is sufficient (three drops on one side, two on the opposite side, equally spaced across the width of the swab); I would be comfortable using two drops per side, but no more than five drops for a 24 mm wide swab. Again, follow the directions that come with your swabs and cleaning fluid to the letter. Each camera has a specific procedure for sensor cleaning; if you precisely adhere to the instructions in your camera manual, you should have a successful sensor cleaning result. If there are still spots on your sensor after cleaning, you can re-clean the sensor provided your camera manual does not advise against doing so (I once ended up with an eyelash on my sensor that required two cleanings to remove; the first try simply moved it closer to the center of the sensor; this happens sometimes). If you follow the directions in your camera manual and in your swab and cleaning fluid to the letter, you should have no problems cleaning your sensor at home (or at your local museum or library, if need be). DISCLAIMER 1: The above description of sensor cleaning is simply a description of how I clean my sensor; it is not intended as training or professional advice in sensor cleaning. 2: Always follow the directions in your camera manual and in your sensor cleaning materials to the letter. When in doubt, contact your camera manufacturer for advice on sensor cleaning, or return your camera to the manufacturer's repair department for sensor cleaning. 3: The author accepts no responsibility for damage of any kind resulting from do it yourself sensor cleaning. When in doubt, contact your camera manufacturer to return your camera to the manufacturer's repair department for professional sensor cleaning. Edited April 11, 2019 by Herr Barnack", "link": "https://www.l-camera-forum.com/topic/283961-m240-sensor-corrosion/page/2/?tab=comments#comment-3720592", "origin": "L-forum", "suborigin": "283961-m240-sensor-corrosion", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "on 5/2/2018 at 1:20 am, howiebrou said: could you give us a quick summary of the cleaning method and dust avoidance advice you were given? i have yet to clean my sensor and am rather apprehensive about doing so! @howiebrou, this is not official sensor cleaning doctrine from anyone or from any manufacturer; it is just the method i use and is based on sensor cleaning instructions found in the m-p 240 manual and the instructions that come with the swabs and cleaning fluid i use. i have had 100% positive results with 0% problems as a result of using this cleaning technique. i seem to need to clean my sensor about once every 6-9 months. i clean my sensor when multiple dust specks show up in post processing that require an annoying amount of time and work to clone over, not every time a spot or two turns up in post. this description is from a blog post that i wrote for my website; i hope this will shed some light on the sensor cleaning process (we are actually cleaning the protective glass cover, not the sensor itself) for you and others. quote digital cameras have sensors; unless your camera has a built in dust reduction system, sooner or later your sensor will need to be cleaned - it's inevitable. then what?? -----> it !!! 's a lot quicker, easier and less costly to -----> do !!!  -----> it !!!  -----> yourself !!!  - if you follow your camera manual instructions exactly and are careful, you can successfully clean your camera's sensor -----> yourself !!! . a lot of photographers fear damaging their sensor and will do about anything to avoid cleaning it themselves. however, there is no reason to be afraid to do this procedure yourself, provided you do it properly. you will need the right sensor cleaning supplies - i use eclipse optic cleaning fluid and photosol sensorswab ultra sensor cleaning swabs. if your camera has a full frame (24x36mm ) sensor, you will need the type 3 swabs; they are 24 mm wide, as is your sensor. aps-c and smaller sensors will need smaller swabs. photosol's website has information that will help you determine which swab is right for your camera. one of the most important factors in successful sensor cleaning is to perform this procedure in a clean, dust free environment. not many of us have access to a clean room such as computer manufacturers build computers in. if your home has airborne dust issues you will need to clean your sensor in an environment where dust is less of a problem (you can check for airborne dust by looking through the beam of a bright flashlight at night; if you see a lot of dust particles dancing in the air, you should probably go elsewhere to clean your sensor). where would that be? try a museum or a library; find a spot away from frequent foot traffic, entries and exits and away from heating and cooling ducts that will cause airflow that will stir up any dust that may be present.. another important point is this - do not use compressed air (\"canned air\") to blow dust from your sensor before cleaning. canned air can spray liquid propellant onto your sensor cover glass, something you do not want to happen. that liquid can also get behind the sensor and into the electronic components of your camera. if that happens, you are in for a serious repair bill. instead of canned air, use a blower bulb like the giottos rocket blaster, which will safely remove loose dust particles from your sensor. also, do not blow dust from your sensor using your breath, as you can spray tiny droplets of saliva into the camera. the sensor swabs i use are dry, which means i need to apply the proper cleaning fluid to them before use. too much cleaning fluid can damage the electronics inside your camera, so proceed with caution. i have found that five drops on the 24mm wide swabs my camera requires is sufficient (three drops on one side, two on the opposite side, equally spaced across the width of the swab); i would be comfortable using two drops per side, but no more than five drops for a 24 mm wide swab. again, follow the directions that come with your swabs and cleaning fluid to the letter. each camera has a specific procedure for sensor cleaning; if you precisely adhere to the instructions in your camera manual, you should have a successful sensor cleaning result. if there are still spots on your sensor after cleaning, you can re-clean the sensor provided your camera manual does not advise against doing so (i once ended up with an eyelash on my sensor that required two cleanings to remove; the first try simply moved it closer to the center of the sensor; this happens sometimes). if you follow the directions in your camera manual and in your swab and cleaning fluid to the letter, you should have no problems cleaning your sensor at home (or at your local museum or library, if need be). disclaimer 1: the above description of sensor cleaning is simply a description of how i clean my sensor; it is not intended as training or professional advice in sensor cleaning. 2: always follow the directions in your camera manual and in your sensor cleaning materials to the letter. when in doubt, contact your camera manufacturer for advice on sensor cleaning, or return your camera to the manufacturer's repair department for sensor cleaning. 3: the author accepts no responsibility for damage of any kind resulting from do it yourself sensor cleaning. when in doubt, contact your camera manufacturer to return your camera to the manufacturer's repair department for professional sensor cleaning. edited april 11, 2019 by herr barnack", "sortedWord": "None", "Identifyer": null, "identifyer": 19792, "year": "2019"}, {"autor": "scott kirkpatrick", "date": "2019-05-11 10:47:00", "content": "On 5/9/2019 at 12:32 AM, digger1914 said: . How hard would it be for them to assign the M10 profile to the P and D variants that use the same sensor? Not hard at all, (in C1 you can do it yourself), but it doesn't work right. Either the -P and -D don't use the same sensor, or there is some firmware difference (like a black point setting) that makes the results in the DNG file different. The \"raw\" file is not just the bits coming off the sensor, but has been subject to all sorts of corrections and attached parameters that Leica adds. Edited May 11, 2019 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/297020-colors-too-saturated-w-m10-presets-on-capture-one/?tab=comments#comment-3738696", "origin": "L-forum", "suborigin": "297020-colors-too-saturated-w-m10-presets-on-capture-one", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "on 5/9/2019 at 12:32 am, digger1914 said: . how hard would it be for them to assign the m10 profile to the p and d variants that use the same sensor? not hard at all, (in c1 you can -----> do !!!  -----> it !!!  -----> yourself !!! ), but -----> it !!!  doesn't work right. either the -p and -d don't use the same sensor, or there is some firmware difference (like a black point setting) that makes the results in the dng file different. the \"raw\" file is not just the bits coming off the sensor, but has been subject to all sorts of corrections and attached parameters that leica adds. edited may 11, 2019 by scott kirkpatrick", "sortedWord": "None", "Identifyer": null, "identifyer": 113417, "year": "2019"}], "name": "Leicasortedout2019yourself"}