{"interestingcomments": [{"autor": "Ko.Fe.", "date": "2020-09-24 18:08:00", "content": "5 hours ago, analog-digital said: Nobody speaks of BETTER. They are simply DIFFERENT. For me more film like. And just stop talking about dynamics, scope and numbers like that. No matter how good the dynamic range, if the photographer cannot take photos, such numbers are of no use to you. When the first digital cameras with CCD sensors hit the market, most people didn't care what kind of dynamic range they had. It was just digital and the photos were really good. So what's all the chatter about these mostly theoretical numbers? And I'm talking about the amateur (hobby) area. And what M9 sensor files has to do with film? Well, I know, it is same limited dynamic range as scans of slide film. Like it or not. I'm broadcast engineer, who is involved with computer graphics and image processing since earlier nineties. Talk about dynamic range, scopes and numbers are my profession. And as professional in this area I see the difference between my M-E220 and another cameras on images taken by me. As for odd remark on photographer skills, some of those images were published. Not only from M-E 220, but images taken by 200 USD FujiNoFilm P&S. It was good enough for Canadian National Geographic.", "link": "https://www.l-camera-forum.com/topic/313545-leica-m9-yes-or-no-thats-the-problem/page/2/?tab=comments#comment-4051547", "origin": "L-forum", "suborigin": "313545-leica-m9-yes-or-no-thats-the-problem", "result": true, "Selector": "i'm broadcast engineer", "selectorShort": "engineer", "MarkedSent": "5 hours ago, analog-digital said: nobody speaks of better. they are simply different. for me more film like. and just stop talking about dynamics, scope and numbers like that. no matter how good the dynamic range, if the photographer cannot take photos, such numbers are of no use to you. when the first digital cameras with ccd sensors hit the market, most people didn't care what kind of dynamic range they had. it was just digital and the photos were really good. so what's all the chatter about these mostly theoretical numbers? and i'm talking about the amateur (hobby) area. and what m9 sensor files has to do with film? well, i know, it is same limited dynamic range as scans of slide film. like it or not. -----> i !!! 'm -----> broadcast !!!  -----> engineer !!! , who is involved with computer graphics and image processing since earlier nineties. talk about dynamic range, scopes and numbers are my profession. and as professional in this area i see the difference between my m-e220 and another cameras on images taken by me. as for odd remark on photographer skills, some of those images were published. not only from m-e 220, but images taken by 200 usd fujinofilm p&s. it was good enough for canadian national geographic.", "sortedWord": "None", "Identifyer": null, "identifyer": 32272, "year": "2020"}, {"autor": "mikozia", "date": "2020-03-16 22:12:00", "content": "Engineered😀 --img--  X Vario. Edited March 16, 2020 by mikozia", "link": "https://www.l-camera-forum.com/topic/278547-open-bird-thread-twitchers-post-here/page/14/?tab=comments#comment-3932974", "origin": "L-forum", "suborigin": "278547-open-bird-thread-twitchers-post-here", "result": true, "Selector": "engineered", "selectorShort": "engineer", "MarkedSent": "-----> engineered !!! 😀 --img--  x vario. edited march 16, 2020 by mikozia", "sortedWord": "None", "Identifyer": null, "identifyer": 49119, "year": "2020"}, {"autor": "roydonian", "date": "2020-02-20 15:09:00", "content": "I've probably been 'slightly eccentric' for most of my life! But my way of working with memory cards owes its origins to my earlier career as an engineer. Having worked in the design team for a satellite launch vehicle, I learned the engineer's maxim that \"If it can go wrong, it will go wrong, and in the worst possible way and at the worst possible moment.\" Offloading all one's imagery onto a single portable disk seems to me to be tempting the fickle finger of fate by creating a potential single-point failure. Using one card per day limits the data loss in the unlikely but possible event of a card failure. My engineer's conservatism caused me to opt for using one SD card per day, and to choose a lesser-known brand (Samsung) that was less likely to be faked. Although I had card problems in the days when I used a Nikon DSLR, I've had no image losses when using the M8.2, M9-P, and M-D. Since I use an M-D, \"reformatting in camera\" is in theory not an option. But what this \"bear of very little brain\" has now realised is when travelling I will always have the M9-P with me as a backup camera, so would be able to format cards if necessary. So this removes the need for my planned purchase of several 32Gb cards that could each hold the results of 8 days of shooting if I'd gone off on holiday without remembering to format my 4Gb cards. If I now accept that in practice my Sandisk and Lexar 4Gb cards are usually lying to hand on my desk (albeit in individual single-card boxes), and that my days as a Digilux 2 toting journalist are probably over, then the 24-disk solution suggested by jdlaing will be enough to house my current stock of 4Gb cards.", "link": "https://www.l-camera-forum.com/topic/306371-how-to-store-sd-cards/?tab=comments#comment-3916390", "origin": "L-forum", "suborigin": "306371-how-to-store-sd-cards", "result": true, "Selector": "my engineer", "selectorShort": "engineer", "MarkedSent": "i've probably been 'slightly eccentric' for most of my life! but my way of working with memory cards owes its origins to my earlier career as an engineer. having worked in the design team for a satellite launch vehicle, i learned the engineer's maxim that \"if it can go wrong, it will go wrong, and in the worst possible way and at the worst possible moment.\" offloading all one's imagery onto a single portable disk seems to me to be tempting the fickle finger of fate by creating a potential single-point failure. using one card per day limits the data loss in the unlikely but possible event of a card failure. -----> my !!!  -----> engineer !!! 's conservatism caused me to opt for using one sd card per day, and to choose a lesser-known brand (samsung) that was less likely to be faked. although i had card problems in the days when i used a nikon dslr, i've had no image losses when using the m8.2, m9-p, and m-d. since i use an m-d, \"reformatting in camera\" is in theory not an option. but what this \"bear of very little brain\" has now realised is when travelling i will always have the m9-p with me as a backup camera, so would be able to format cards if necessary. so this removes the need for my planned purchase of several 32gb cards that could each hold the results of 8 days of shooting if i'd gone off on holiday without remembering to format my 4gb cards. if i now accept that in practice my sandisk and lexar 4gb cards are usually lying to hand on my desk (albeit in individual single-card boxes), and that my days as a digilux 2 toting journalist are probably over, then the 24-disk solution suggested by jdlaing will be enough to house my current stock of 4gb cards.", "sortedWord": "None", "Identifyer": null, "identifyer": 90865, "year": "2020"}, {"autor": "jaapv", "date": "2020-02-25 09:08:00", "content": "On 2/20/2020 at 4:09 PM, roydonian said: I've probably been 'slightly eccentric' for most of my life! But my way of working with memory cards owes its origins to my earlier career as an engineer. Having worked in the design team for a satellite launch vehicle, I learned the engineer's maxim that \"If it can go wrong, it will go wrong, and in the worst possible way and at the worst possible moment.\" Offloading all one's imagery onto a single portable disk seems to me to be tempting the fickle finger of fate by creating a potential single-point failure. Using one card per day limits the data loss in the unlikely but possible event of a card failure. My engineer's conservatism caused me to opt for using one SD card per day, and to choose a lesser-known brand (Samsung) that was less likely to be faked. Although I had card problems in the days when I used a Nikon DSLR, I've had no image losses when using the M8.2, M9-P, and M-D. Since I use an M-D, \"reformatting in camera\" is in theory not an option. But what this \"bear of very little brain\" has now realised is when travelling I will always have the M9-P with me as a backup camera, so would be able to format cards if necessary. So this removes the need for my planned purchase of several 32Gb cards that could each hold the results of 8 days of shooting if I'd gone off on holiday without remembering to format my 4Gb cards. If I now accept that in practice my Sandisk and Lexar 4Gb cards are usually lying to hand on my desk (albeit in individual single-card boxes), and that my days as a Digilux 2 toting journalist are probably over, then the 24-disk solution suggested by jdlaing will be enough to house my current stock of 4Gb cards. Reformatting a card in another camera type is a potential source of error. I have had crashed cards/cameras for doing this between M8 and DMR and M9 and X1. I have not had the problem since, because I will never do so again. The most secure way of reformatting cards is using SdFormatter in your computer - this is the official manufacturer's app- or , if possible, in the camera you are going to use them in.", "link": "https://www.l-camera-forum.com/topic/306371-how-to-store-sd-cards/?tab=comments#comment-3919400", "origin": "L-forum", "suborigin": "306371-how-to-store-sd-cards", "result": true, "Selector": "my engineer", "selectorShort": "engineer", "MarkedSent": "on 2/20/2020 at 4:09 pm, roydonian said: i've probably been 'slightly eccentric' for most of my life! but my way of working with memory cards owes its origins to my earlier career as an engineer. having worked in the design team for a satellite launch vehicle, i learned the engineer's maxim that \"if it can go wrong, it will go wrong, and in the worst possible way and at the worst possible moment.\" offloading all one's imagery onto a single portable disk seems to me to be tempting the fickle finger of fate by creating a potential single-point failure. using one card per day limits the data loss in the unlikely but possible event of a card failure. -----> my !!!  -----> engineer !!! 's conservatism caused me to opt for using one sd card per day, and to choose a lesser-known brand (samsung) that was less likely to be faked. although i had card problems in the days when i used a nikon dslr, i've had no image losses when using the m8.2, m9-p, and m-d. since i use an m-d, \"reformatting in camera\" is in theory not an option. but what this \"bear of very little brain\" has now realised is when travelling i will always have the m9-p with me as a backup camera, so would be able to format cards if necessary. so this removes the need for my planned purchase of several 32gb cards that could each hold the results of 8 days of shooting if i'd gone off on holiday without remembering to format my 4gb cards. if i now accept that in practice my sandisk and lexar 4gb cards are usually lying to hand on my desk (albeit in individual single-card boxes), and that my days as a digilux 2 toting journalist are probably over, then the 24-disk solution suggested by jdlaing will be enough to house my current stock of 4gb cards. reformatting a card in another camera type is a potential source of error. i have had crashed cards/cameras for doing this between m8 and dmr and m9 and x1. i have not had the problem since, because i will never do so again. the most secure way of reformatting cards is using sdformatter in your computer - this is the official manufacturer's app- or , if possible, in the camera you are going to use them in.", "sortedWord": "None", "Identifyer": null, "identifyer": 90868, "year": "2020"}], "name": "Leicasortedout2020engineer"}