{"interestingcomments": [{"autor": "Dougg", "date": "2012-11-15 02:55:00", "content": "I am another left-eye-dominant right-hander; my optometrist tells me this is relatively uncommon. So I've always used my left eye on the viewfinder, and for vertical shots I rotate the camera right-side down. Then I developed a cataract in the left eye, and as it got progressively worse I had to switch to using my right eye for photography. Eventually I had cataract surgery on both eyes, two years apart, and it turned out the viewfinder is clearer and sharper using my right eye (not wearing glasses while shooting), so I stayed using that one for framing/focusing. Some people are more strongly left- or right-dominant and have a harder time than I in making the switch... Edited November 15, 2012 by Dougg", "link": "https://www.l-camera-forum.com/topic/191990-left-eye-shooting/?tab=comments#comment-2167159", "origin": "L-forum", "suborigin": "191990-left-eye-shooting", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i am another left-eye-dominant right-hander; my optometrist tells me this is relatively uncommon. so i've always used my left eye on the viewfinder, and for vertical shots i rotate the camera right-side down. then -----> i !!!  -----> developed !!!  a cataract in the left eye, and as it got progressively worse -----> i !!!  had to switch to using my right eye for photography. eventually i had cataract surgery on both eyes, two years apart, and it turned out the viewfinder is clearer and sharper using my right eye (not wearing glasses while shooting), so i stayed using that one for framing/focusing. some people are more strongly left- or right-dominant and have a harder time than i in making the switch... edited november 15, 2012 by dougg", "sortedWord": "None", "Identifyer": null, "identifyer": 39055, "year": "2012"}, {"autor": "Stealth3kpl", "date": "2012-06-06 20:05:00", "content": "Developing Ilford HP5+ with 200ml ID11 Developer (1:1) for 13mins with continuous agitation, did you feel your negatives were overdeveloped? The results posted certainly look good. Pete", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/?tab=comments#comment-2033483", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "-----> developing !!!  ilford hp5+ with 200ml id11 developer (1:1) for 13mins with continuous agitation, did you feel your negatives were overdeveloped? the results posted certainly look good. pete", "sortedWord": "None", "Identifyer": null, "identifyer": 107007, "year": "2012"}, {"autor": "janrzm", "date": "2012-06-11 19:59:00", "content": "OK, I've gone and found one on the 'Bay. Now I realise I will have to figure out new agitation schedules for various developers and films. Takes me back to the Gnome bakelite tank belonging to my father that I learned on. Agitation was via a spindle inserted through the central filling funnel; this twisted the film back and forth, as the tank could not be inverted - it wasn't leak proof. If only half the film is immersed, it is obviously important to keep it rotating. Are you finding you have to cut development times much to counteract the continuous agitation? Chris At present I have kept development times the same, I put my first roll of TMAX 100 through a couple of days ago, I agitated continuously in quarter turns. I developed with ID11 at 1:3.", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/?tab=comments#comment-2037673", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "ok, i've gone and found one on the 'bay. now i realise i will have to figure out new agitation schedules for various developers and films. takes me back to the gnome bakelite tank belonging to my father that i learned on. agitation was via a spindle inserted through the central filling funnel; this twisted the film back and forth, as the tank could not be inverted - it wasn't leak proof. if only half the film is immersed, it is obviously important to keep it rotating. are you finding you have to cut development times much to counteract the continuous agitation? chris at present i have kept development times the same, i put my first roll of tmax 100 through a couple of days ago, i agitated continuously in quarter turns. -----> i !!!  -----> developed !!!  with id11 at 1:3.", "sortedWord": "None", "Identifyer": null, "identifyer": 107010, "year": "2012"}, {"autor": "janrzm", "date": "2012-06-11 20:04:00", "content": "Developing Ilford HP5+ with 200ml ID11 Developer (1:1) for 13mins with continuous agitation, did you feel your negatives were overdeveloped? The results posted certainly look good.Pete Thats a really good question, having been developing for less than a year I still consider myself a novice, however I believe the results were decent without being great (considering camera and lens combo). My recent rolls of HP5+ developed at 1:3 and shot on the M3 with 50 Lux are far superior. Cheers", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/?tab=comments#comment-2037679", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "-----> developing !!!  ilford hp5+ with 200ml id11 developer (1:1) for 13mins with continuous agitation, did you feel your negatives were overdeveloped? the results posted certainly look good.pete thats a really good question, having been developing for less than a year i still consider myself a novice, however i believe the results were decent without being great (considering camera and lens combo). my recent rolls of hp5+ developed at 1:3 and shot on the m3 with 50 lux are far superior. cheers", "sortedWord": "None", "Identifyer": null, "identifyer": 107012, "year": "2012"}, {"autor": "Guest gamincurieux", "date": "2012-09-03 12:55:00", "content": "It's in my kitchen - living alone, there's nobody to annoy with this. That said, I still have to prepare food in here on rare occasions, so it can all be easily & hygienically converted kitchen<=>darkroom as needed. I no longer develop film, this is printing only (used to have a brilliant film drying cabinet though, regret selling it;). The upside-down trays there are on a 16x20inch 3-tray ladder (excellent space-saving thing from Leedal of Chicago, http://www.leedal.com), when set up each tray down sits further out from the one above so you just slip the paper from one down into the next below. I don't actually sit the trays on that side bench there when full of chems, I have a fold-up table set up in the middle of the room there for that - the side bench I prefer to keep clean for paper/negs. The 'enlarger bench' is covered with a sheet of plastic tucked in 'round the edges when not in use - especially important as in fine to hot weather I often have both the front & back door (see it to the right there) open for a thru-breeze, and the air can be quite dusty in these parts, you've got to keep things well covered up. The enlarger has its own cover. There's a thick double-layered black woolen 'theatre' drape there over the entry to the hall going up inside the house, had it made special by a company that does make them for theatres/cinemas, and the back door has foam around the edges that blocks light when closed. The windows have specially made (a company here in Australia that makes them for shift workers in hot bright places, http://www.bedroomblackout.com) fabric-covered foam panels that fit right into the window spaces, same for the windows in the bathroom which adjoins the kitchen off to the left there. I have moved a lot, have had a pretty similar set-up wherever I've been, obviously have to have things like the window panels re-done, which can cost a bit when you add it all up time after time, but who's counting, you do it because you love printing! Now, I might not shoot much film anymore, and really I don't print very often at all, but I say that as long as I possess negatives I want to have a darkroom in which to print them - for me that's non-negotiable. Mm, well, I hope this is of interest, or helps someone who might be thinking of making a darkroom at home. I would just say forget making a darkroom in the bathroom/toilet.... the kitchen is the way to go, it's made for cooking, which is so much like printing --img-- --img--  Edited September 3, 2012 by gamincurieux", "link": "https://www.l-camera-forum.com/topic/186432-show-us-your-darkroom/?tab=comments#comment-2103681", "origin": "L-forum", "suborigin": "186432-show-us-your-darkroom", "result": false, "Selector": "i no longer develop", "selectorShort": "develop", "MarkedSent": "i no longer develop -----> film !!! , this is printing only (used to have a brilliant -----> film !!!  drying cabinet though, regret selling it;).", "sortedWord": "film", "Identifyer": null, "identifyer": 104647, "year": "2012"}, {"autor": "uaqpau", "date": "2012-08-29 23:25:00", "content": "Have you seen this post by forum member \"prosophos\"? I've started developing my own b&w film at home just 2 months ago.. and Im following exactly those steps with great results. Have a look: http://www.l-camera-forum.com/leica-forum/film-forum/241700-how-i-process-my-b-w.html thanks again peter --img-- ", "link": "https://www.l-camera-forum.com/topic/186748-need-some-advice-re-equipment-for-bw-home-development/?tab=comments#comment-2099647", "origin": "L-forum", "suborigin": "186748-need-some-advice-re-equipment-for-bw-home-development", "result": false, "Selector": "i've started developing", "selectorShort": "develop", "MarkedSent": "i've started developing my own b&w -----> film !!!  at home just 2 months ago.. and im following exactly those steps with great results.", "sortedWord": "film", "Identifyer": null, "identifyer": 107501, "year": "2012"}, {"autor": "Prosophos", "date": "2012-08-30 03:13:00", "content": "Have you seen this post by forum member \"prosophos\"? I've started developing my own b&w film at home just 2 months ago.. and Im following exactly those steps with great results. Have a look: http://www.l-camera-forum.com/leica-forum/film-forum/241700-how-i-process-my-b-w.html thanks again peter --img--  You're welcome, Pau. Incidentally, I've placed all the related articles onto one page on my website: How I process B&W film Regards, Peter. P r o s o p h o s", "link": "https://www.l-camera-forum.com/topic/186748-need-some-advice-re-equipment-for-bw-home-development/?tab=comments#comment-2099729", "origin": "L-forum", "suborigin": "186748-need-some-advice-re-equipment-for-bw-home-development", "result": false, "Selector": "i've started developing", "selectorShort": "develop", "MarkedSent": "i've started developing my own b&w -----> film !!!  at home just 2 months ago.. and im following exactly those steps with great results.", "sortedWord": "film", "Identifyer": null, "identifyer": 107502, "year": "2012"}, {"autor": "Keith (M)", "date": "2012-10-31 11:31:00", "content": " Well, I hope so. Developing a roll of 36exp Acros 100 in my Paterson System 4 tank (bought new earlier this year), as I poured the stop-bath out, the tank's funnel/light trap somehow 'unlocked' and came away from the tank. Panic. It took me a couple of seconds to relocate it and then pour the fixer in. Gloom and doom - thoughts of fogged frames / ruined images of my latest foray to France and Spain. --img--  Having finished fixing and washing, I tentatively pulled the film of the reel and hung it in the shower - phew, there are images! --img--  Have only quickly glanced at them but could not see any immediate signs of fogging. Will have to wait for it to dry now.", "link": "https://www.l-camera-forum.com/topic/191267-a-very-narrow-squeak/?tab=comments#comment-2155012", "origin": "L-forum", "suborigin": "191267-a-very-narrow-squeak", "result": false, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "developing a -----> roll !!!  of 36exp acros 100 in my paterson system 4 tank (bought new earlier this year), as i poured the stop-bath out, the tank's funnel/light trap somehow 'unlocked' and came away from the tank.", "sortedWord": "roll", "Identifyer": null, "identifyer": 107633, "year": "2012"}, {"autor": "tobey bilek", "date": "2012-07-02 11:54:00", "content": "Developing film is easy. Developing film well is harder. Well includes clean drying ,filtered water, good chemical storage, proper agitation, matching contrast to paper/subject. It is like the difference between driving the family sedan and being a formula one driver. Then you have to learn not to use the massive development chart and not to listen to all the weird schemes people have invented and to quit trying the millions of combinations of film/developers. Buy a scale, some chemicals, some glass bottles, mix up some D76 and start learning. d76 will do a decent job on any film out there except the current generation of Delta 400 which requires Xtol or that undated white bottle of expensive stuff Ilford sells, forgetting the name for now. There is a marked improvement with either. You can get any look you want by diluting D76 from stock to 1:3. Start with 1:1.", "link": "https://www.l-camera-forum.com/topic/182617-like-the-idea-of-developing-film-but-think-its-too-complicated/?tab=comments#comment-2053560", "origin": "L-forum", "suborigin": "182617-like-the-idea-of-developing-film-but-think-its-too-complicated", "result": false, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "developing -----> film !!!  is easy.", "sortedWord": "film", "Identifyer": null, "identifyer": 107648, "year": "2012"}, {"autor": "Messsucherkamera", "date": "2012-05-19 03:53:00", "content": "@ Axot - First off, welcome to the forum! If you want to start humbly (and economically, by Leica standards) you will find many Leica M camera bodies and lenses that can be purchased for around $1000-1500US for the body and $500-1000US for the lens. You just have to shop around, there are reasonably priced Leicas out there. If that isn't financially doable, you could find a nice FM2n or F3hp to use with your Nikon lenses for a song. I have seen good user F3hp bodies (rated at 8 to 8+) for sale at $275-300US. Regarding film availability, I would expect C41 and E6 film choices to dwindle over the years while B&W film choices will remain more or less stable - Kodak 's current terminal illness notwithstanding. I would expect there to be some sort of B&W film to be available for the foreseeable future. As for 25-50 years down the road, who knows? Film (along with paper and chemical) prices will continue to creep upward over the years, but so will the prices of everything else. Bulk loading is a way to save perhaps 20-25% on your film costs. Developing your own film is a big cost cutter for B&W film - B&W costs around $0.40 to $0.50US per roll to develop at home. Developing is actually an enjoyable activity (IMO). Developing film beats sitting for hours at a keyboard diddling with Photoshop. Again, JMHO. Edited May 19, 2012 by Messsucherkamera", "link": "https://www.l-camera-forum.com/topic/178922-beginner/?tab=comments#comment-2017585", "origin": "L-forum", "suborigin": "178922-beginner", "result": false, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "developing your own -----> film !!!  is a big cost cutter for b&w -----> film !!!  - b&w costs around $0.40 to $0.50us per roll to develop at home.", "sortedWord": "film", "Identifyer": null, "identifyer": 107775, "year": "2012"}], "name": "Leicasortedout2012develop"}