{"interestingcomments": [{"autor": "mmx_2", "date": "2016-02-02 13:25:00", "content": "IMHO - you ruined the mystique - I hope the Mojo was retained.. 2each his own.. IMHO, I've created a unique, one-of-a-kind, future collectors edition. Patent pending --img-- ", "link": "https://www.l-camera-forum.com/topic/256170-accelerated-brassing/page/2/?tab=comments#comment-2981322", "origin": "L-forum", "suborigin": "256170-accelerated-brassing", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "imho - you ruined the mystique - i hope the mojo was retained.. 2each his own.. imho, -----> i !!! 've -----> created !!!  a unique, one-of-a-kind, future collectors edition. patent pending --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 14264, "year": "2016"}, {"autor": "Guest JonathanP", "date": "2016-03-07 18:07:00", "content": "We're just seeing the run-out models used to extend the life of an exiting product. Car manufacturers generally keep adding bits whereas Leica tends to: 1. create a \"plus\" build mid-cycle (adding sapphire screen etc) 2. start rolling out \"minus\" builds, now extended with the M240: remove the bayer array remove live view remove the LCD screen I expect we should see a special collectors edition soon where the sensor has also been removed. Designed for the purists, and the battery life will be great.", "link": "https://www.l-camera-forum.com/topic/259865-the-leica-m-d-thread-merged/?tab=comments#comment-3003633", "origin": "L-forum", "suborigin": "259865-the-leica-m-d-thread-merged", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "we're just seeing the run-out models used to extend the life of an exiting product. car manufacturers generally keep adding bits whereas leica tends to: 1. -----> create !!!  a \"plus\" build mid-cycle (adding sapphire screen etc) 2. start rolling out \"minus\" builds, now extended with the m240: remove the bayer array remove live view remove the lcd screen i expect we should see a special collectors edition soon where the sensor has also been removed. designed for the purists, and the battery life will be great.", "sortedWord": "None", "Identifyer": null, "identifyer": 17619, "year": "2016"}, {"autor": "Tom R", "date": "2016-12-30 20:30:00", "content": "Hey. What do you recommend flash to the M8? There is a nice variety of manual flash on the market, but I would like to buy something certain, proven. What do you recommend? Oh necessarily control the burner in different directions. Nissin, Metz, Sunpak?I I would imagine that your choice of unit might depend upon your application? You will definitely need to consider purchasing a Wein Safe Sync Hot Shoe (which you can easily get from B & H and others) to ensure that you do not stress the electronics on the M8 with the high trigger voltages common with older flash units. I rarely use flash myself. When I do, I use a hand-held Vivitar 283 unit with a trigger voltage of something in the neighborhood of 200+ volts) along with a Wein Safe Sync Hot Shoe. But, again, I do this rarely --usually when I want to create \"flash\" photographs (i.e., photographs where the use of a flash is obvious and integral to the image). I'm sure that plenty of \"pro\" users will reply to this with more interesting recommendations. TR", "link": "https://www.l-camera-forum.com/topic/267838-flash-to-m8/?tab=comments#comment-3175982", "origin": "L-forum", "suborigin": "267838-flash-to-m8", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "hey. what do you recommend flash to the m8? there is a nice variety of manual flash on the market, but i would like to buy something certain, proven. what do you recommend? oh necessarily control the burner in different directions. nissin, metz, sunpak?i i would imagine that your choice of unit might depend upon your application? you will definitely need to consider purchasing a wein safe sync hot shoe (which you can easily get from b & h and others) to ensure that you do not stress the electronics on the m8 with the high trigger voltages common with older flash units. i rarely use flash myself. when i do, i use a hand-held vivitar 283 unit with a trigger voltage of something in the neighborhood of 200+ volts) along with a wein safe sync hot shoe. but, again, -----> i !!!  do this rarely --usually when -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  \"flash\" photographs (i.e., photographs where the use of a flash is obvious and integral -----> to !!!  the image). i'm sure that plenty of \"pro\" users will reply to this with more interesting recommendations. tr", "sortedWord": "None", "Identifyer": null, "identifyer": 45632, "year": "2016"}, {"autor": "roshuu", "date": "2016-12-30 21:13:00", "content": "I would imagine that your choice of unit might depend upon your application? You will definitely need to consider purchasing a Wein Safe Sync Hot Shoe (which you can easily get from B & H and others) to ensure that you do not stress the electronics on the M8 with the high trigger voltages common with older flash units. I rarely use flash myself. When I do, I use a hand-held Vivitar 283 unit with a trigger voltage of something in the neighborhood of 200+ volts) along with a Wein Safe Sync Hot Shoe. But, again, I do this rarely --usually when I want to create \"flash\" photographs (i.e., photographs where the use of a flash is obvious and integral to the image). I'm sure that plenty of \"pro\" users will reply to this with more interesting recommendations. TR There's no Wein Safe Sync Hot Shoe, do you think it's dangerous? See: https://youtu.be/d5Z7paC3fDE?t=367", "link": "https://www.l-camera-forum.com/topic/267838-flash-to-m8/?tab=comments#comment-3176007", "origin": "L-forum", "suborigin": "267838-flash-to-m8", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "i would imagine that your choice of unit might depend upon your application? you will definitely need to consider purchasing a wein safe sync hot shoe (which you can easily get from b & h and others) to ensure that you do not stress the electronics on the m8 with the high trigger voltages common with older flash units. i rarely use flash myself. when i do, i use a hand-held vivitar 283 unit with a trigger voltage of something in the neighborhood of 200+ volts) along with a wein safe sync hot shoe. but, again, -----> i !!!  do this rarely --usually when -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  \"flash\" photographs (i.e., photographs where the use of a flash is obvious and integral -----> to !!!  the image). i'm sure that plenty of \"pro\" users will reply to this with more interesting recommendations. tr there's no wein safe sync hot shoe, do you think it's dangerous? see: https://youtu.be/d5z7pac3fde?t=367", "sortedWord": "None", "Identifyer": null, "identifyer": 45633, "year": "2016"}, {"autor": "AndreasB", "date": "2016-01-20 16:36:00", "content": "have you seen this review done almost a year ago? Rodrigue Zahr: Leica X Vario Review after 3 delightful months of ownership. After selling the Q for their very poor ooc-jpegs (don´t have the time for RAW development and I´m not able to create the same image like ooc-jpeg) I bought a X2 again and I´m happy with it. But after reading this thread and your wonderful review I am thinking about buying a used XVario in addition to the X2 for my next bicycletrip to Iceland! After experience with X1/2/113 I totally agree with your review-update as I couldn´t create a characteristic Leica image from RAW : UPDATE: After receiving too many emails and messages asking me how some leica XVarior photographers \"me included\" mange to get images that good and color-rich from the XVario, some ventured to say that they don't even get close using their M or S system.... The answer is Right Exposure. After long experience in shooting and PP works for the magazine, i can tell you that the secret to a good picture, a picture that would preserve the look of the camera system you're using is the right exposure. But we can fix exposure error in post you may ask, ok yes, and with DND / RAW files you can do wonders but then, believe me, the look and characteristics of your Leica are gonna be gone! That however doe snot mean that the corrected image won't be good, it can come out beautiful, but it will lose the fingerprints of the camera that created it. Expose well, and you'll have breathtaking results. So the XVario seems to be perfect for me... Thanks for the review.", "link": "https://www.l-camera-forum.com/topic/233697-whats-it-with-the-x-vario-colours/?tab=comments#comment-2972866", "origin": "L-forum", "suborigin": "233697-whats-it-with-the-x-vario-colours", "result": true, "Selector": "i couldn´t create", "selectorShort": "create", "MarkedSent": "have you seen this review done almost a year ago? rodrigue zahr: leica x vario review after 3 delightful months of ownership. after selling the q for their very poor ooc-jpegs (don´t have the time for raw development and i´m not able to create the same image like ooc-jpeg) i bought a x2 again and i´m happy with it. but after reading this thread and your wonderful review i am thinking about buying a used xvario in addition to the x2 for my next bicycletrip to iceland! after experience with x1/2/113 -----> i !!!  totally agree with your review-update as -----> i !!!  -----> couldn´t !!!  -----> create !!!  a characteristic leica image from raw : update: after receiving too many emails and messages asking me how some leica xvarior photographers \"me included\" mange to get images that good and color-rich from the xvario, some ventured to say that they don't even get close using their m or s system.... the answer is right exposure. after long experience in shooting and pp works for the magazine, i can tell you that the secret to a good picture, a picture that would preserve the look of the camera system you're using is the right exposure. but we can fix exposure error in post you may ask, ok yes, and with dnd / raw files you can do wonders but then, believe me, the look and characteristics of your leica are gonna be gone! that however doe snot mean that the corrected image won't be good, it can come out beautiful, but it will lose the fingerprints of the camera that created it. expose well, and you'll have breathtaking results. so the xvario seems to be perfect for me... thanks for the review.", "sortedWord": "None", "Identifyer": null, "identifyer": 12485, "year": "2016"}, {"autor": "XVarior", "date": "2016-01-20 18:28:00", "content": "After selling the Q for their very poor ooc-jpegs (don´t have the time for RAW development and I´m not able to create the same image like ooc-jpeg) I bought a X2 again and I´m happy with it. But after reading this thread and your wonderful review I am thinking about buying a used XVario in addition to the X2 for my next bicycletrip to Iceland! After experience with X1/2/113 I totally agree with your review-update as I couldn´t create a characteristic Leica image from RAW : UPDATE: After receiving too many emails and messages asking me how some leica XVarior photographers \"me included\" mange to get images that good and color-rich from the XVario, some ventured to say that they don't even get close using their M or S system.... The answer is Right Exposure. After long experience in shooting and PP works for the magazine, i can tell you that the secret to a good picture, a picture that would preserve the look of the camera system you're using is the right exposure. But we can fix exposure error in post you may ask, ok yes, and with DND / RAW files you can do wonders but then, believe me, the look and characteristics of your Leica are gonna be gone! That however doe snot mean that the corrected image won't be good, it can come out beautiful, but it will lose the fingerprints of the camera that created it. Expose well, and you'll have breathtaking results. So the XVario seems to be perfect for me... Thanks for the review. Glad to know. I almost sold my XV twice in order to finance other things but I ended up selling something else instead. I just can't let this camera go. It's irreplaceable.", "link": "https://www.l-camera-forum.com/topic/233697-whats-it-with-the-x-vario-colours/?tab=comments#comment-2972945", "origin": "L-forum", "suborigin": "233697-whats-it-with-the-x-vario-colours", "result": true, "Selector": "i couldn´t create", "selectorShort": "create", "MarkedSent": "after selling the q for their very poor ooc-jpegs (don´t have the time for raw development and i´m not able to create the same image like ooc-jpeg) i bought a x2 again and i´m happy with it. but after reading this thread and your wonderful review i am thinking about buying a used xvario in addition to the x2 for my next bicycletrip to iceland! after experience with x1/2/113 -----> i !!!  totally agree with your review-update as -----> i !!!  -----> couldn´t !!!  -----> create !!!  a characteristic leica image from raw : update: after receiving too many emails and messages asking me how some leica xvarior photographers \"me included\" mange to get images that good and color-rich from the xvario, some ventured to say that they don't even get close using their m or s system.... the answer is right exposure. after long experience in shooting and pp works for the magazine, i can tell you that the secret to a good picture, a picture that would preserve the look of the camera system you're using is the right exposure. but we can fix exposure error in post you may ask, ok yes, and with dnd / raw files you can do wonders but then, believe me, the look and characteristics of your leica are gonna be gone! that however doe snot mean that the corrected image won't be good, it can come out beautiful, but it will lose the fingerprints of the camera that created it. expose well, and you'll have breathtaking results. so the xvario seems to be perfect for me... thanks for the review. glad to know. i almost sold my xv twice in order to finance other things but i ended up selling something else instead. i just can't let this camera go. it's irreplaceable.", "sortedWord": "None", "Identifyer": null, "identifyer": 12487, "year": "2016"}, {"autor": "ramarren", "date": "2016-03-16 20:54:00", "content": "Hi Lars, thanks that you share the photo. I can see here obviously the advantage of the raw - really difficult light conditions. What I actually wanted to point out is how different the x raw files look in Lightroom compared to the raw files imported from other camera brands. I can't say that I'm very satisfied with the initial look of my canon raw files in lightroom, but they are not so far from what I saw on the display of the camera. DPP makes the lightroom processing looking ugly, but not so much as the result between the jpegs from x and their dng import in lightroom. I have the feeling that lightroom is ignoring everything from the recorded settings - even the wb is completely wrong. I was hoping that if leica provides Lightroom license the integration would be better... Anyway, I have to prepare some calibration profiles - I can use them as base for developer settings. And I'm very satisfied with the camera so far! For whatever reason, LR's camera calibration profile for the X typ 113 is pretty bad. I created a profile for the X with a color checker and the Xrite Passport software. It's much more accurate and easier to work with on that basis. I set LR to use it as the default when I import DNG files from the X.", "link": "https://www.l-camera-forum.com/topic/240599-leica-x-type-113-and-lightroom/?tab=comments#comment-3008866", "origin": "L-forum", "suborigin": "240599-leica-x-type-113-and-lightroom", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "hi lars, thanks that you share the photo. i can see here obviously the advantage of the raw - really difficult light conditions. what i actually wanted to point out is how different the x raw files look in lightroom compared to the raw files imported from other camera brands. i can't say that i'm very satisfied with the initial look of my canon raw files in lightroom, but they are not so far from what i saw on the display of the camera. dpp makes the lightroom processing looking ugly, but not so much as the result between the jpegs from x and their dng import in lightroom. i have the feeling that lightroom is ignoring everything from the recorded settings - even the wb is completely wrong. i was hoping that if leica provides lightroom license the integration would be better... anyway, i have to prepare some calibration profiles - i can use them as base for developer settings. and i'm very satisfied with the camera so far! for whatever reason, lr's camera calibration profile for the x typ 113 is pretty bad. -----> i !!!  -----> created !!!  a profile for the x with a color checker and the xrite passport software. it's much more accurate and easier to work with on that basis. i set lr to use it as the default when i import dng files from the x.", "sortedWord": "None", "Identifyer": null, "identifyer": 12542, "year": "2016"}, {"autor": "okli", "date": "2016-03-18 21:12:00", "content": "For whatever reason, LR's camera calibration profile for the X typ 113 is pretty bad. I created a profile for the X with a color checker and the Xrite Passport software. It's much more accurate and easier to work with on that basis. I set LR to use it as the default when I import DNG files from the X. Thanks for the info - I'm using the xrite tools as well, very helpful to know that they are giving good results", "link": "https://www.l-camera-forum.com/topic/240599-leica-x-type-113-and-lightroom/?tab=comments#comment-3009946", "origin": "L-forum", "suborigin": "240599-leica-x-type-113-and-lightroom", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "for whatever reason, lr's camera calibration profile for the x typ 113 is pretty bad. -----> i !!!  -----> created !!!  a profile for the x with a color checker and the xrite passport software. it's much more accurate and easier to work with on that basis. i set lr to use it as the default when i import dng files from the x. thanks for the info - i'm using the xrite tools as well, very helpful to know that they are giving good results", "sortedWord": "None", "Identifyer": null, "identifyer": 12543, "year": "2016"}, {"autor": "A miller", "date": "2016-04-10 01:00:00", "content": "Harsh Adam, having a bad day are you? Your question was already answered by myself and others - to ignore those responses and keep searching for presumably the answer you want is trolling!! James - Perhaps the question underlying the well constructed thesis of my thread has been \"addressed,\" but it hasn't been \"answered.\" Most people completely dodged the actual underlying question and chose to answer other questions (e.g., quality consistency is really an outdated reason that doesn't apply with today's film stocks; so it was nice to learn the history but doesn't really get to the heart of the question in today's environment). This is fine insofar as a general film-related discussion goes; but only a few of the posters really touched on what was piquing my curiosity. I absolutely didn't \"ignore\" anyone's response to this thread. I read each one in earnest and reflected on them. I respect all genuine earnest views expressed here for what they are. I really was never \"searching\" for an answer. I was merely throwing out the question and providing my thesis of why I think that non-pro film really isn't cost- beneficial in our current environment as a general matter. I still firmly believe this. But I don't think less of anyone who has a different view. I just haven't really heard an answer that makes sense to me as a matter of logic and reason, including any of your responses if I may say so. That's cool, though; at least I got 7 pages of interesting film-related discussion out of it. --img--  As for Mr. Yash, this has some history to it, as I created the thread specifically to avoid further pointless confrontation (and potentially perceived trolling) on his thread, which was really going no where. It was clear that he and I didn't see eye-to-eye on this topic, and he asked me to leave his thread multiple times. With all of this background, here he came to troll on my thread with the same line of pointless discourse that we had on his thread, as if to try to continue it even though he was begging for it to stop when it was on his thread.", "link": "https://www.l-camera-forum.com/topic/257093-why-does-it-make-any-sense-at-all-to-use-non-professional-grade-film-stocks-in-this-day-and-age/page/7/?tab=comments#comment-3023576", "origin": "L-forum", "suborigin": "257093-why-does-it-make-any-sense-at-all-to-use-non-professional-grade-film-stocks-in-this-day-and-age", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "harsh adam, having a bad day are you? your question was already answered by myself and others - to ignore those responses and keep searching for presumably the answer you want is trolling!! james - perhaps the question underlying the well constructed thesis of my thread has been \"addressed,\" but it hasn't been \"answered.\" most people completely dodged the actual underlying question and chose to answer other questions (e.g., quality consistency is really an outdated reason that doesn't apply with today's film stocks; so it was nice to learn the history but doesn't really get to the heart of the question in today's environment). this is fine insofar as a general film-related discussion goes; but only a few of the posters really touched on what was piquing my curiosity. i absolutely didn't \"ignore\" anyone's response to this thread. i read each one in earnest and reflected on them. i respect all genuine earnest views expressed here for what they are. i really was never \"searching\" for an answer. i was merely throwing out the question and providing my thesis of why i think that non-pro film really isn't cost- beneficial in our current environment as a general matter. i still firmly believe this. but i don't think less of anyone who has a different view. i just haven't really heard an answer that makes sense to me as a matter of logic and reason, including any of your responses if i may say so. that's cool, though; at least i got 7 pages of interesting film-related discussion out of it. --img--  as for mr. yash, this has some history to it, as -----> i !!!  -----> created !!!  the thread specifically to avoid further pointless confrontation (and potentially perceived trolling) on his thread, which was really going no where. it was clear that he and i didn't see eye-to-eye on this topic, and he asked me to leave his thread multiple times. with all of this background, here he came to troll on my thread with the same line of pointless discourse that we had on his thread, as if to try to continue it even though he was begging for it to stop when it was on his thread.", "sortedWord": "None", "Identifyer": null, "identifyer": 101386, "year": "2016"}, {"autor": "ShivaYash", "date": "2016-04-10 02:56:00", "content": "James - Perhaps the question underlying the well constructed thesis of my thread has been \"addressed,\" but it hasn't been \"answered.\" Most people completely dodged the actual underlying question and chose to answer other questions (e.g., quality consistency is really an outdated reason that doesn't apply with today's film stocks; so it was nice to learn the history but doesn't really get to the heart of the question in today's environment). This is fine insofar as a general film-related discussion goes; but only a few of the posters really touched on what was piquing my curiosity. I absolutely didn't \"ignore\" anyone's response to this thread. I read each one in earnest and reflected on them. I respect all genuine earnest views expressed here for what they are. I really was never \"searching\" for an answer. I was merely throwing out the question and providing my thesis of why I think that non-pro film really isn't cost- beneficial in our current environment as a general matter. I still firmly believe this. But I don't think less of anyone who has a different view. I just haven't really heard an answer that makes sense to me as a matter of logic and reason, including any of your responses if I may say so. That's cool, though; at least I got 7 pages of interesting film-related discussion out of it. --img--  As for Mr. Yash, this has some history to it, as I created the thread specifically to avoid further pointless confrontation (and potentially perceived trolling) on his thread, which was really going no where. It was clear that he and I didn't see eye-to-eye on this topic, and he asked me to leave his thread multiple times. With all of this background, here he came to troll on my thread with the same line of pointless discourse that we had on his thread, as if to try to continue it even though he was begging for it to stop when it was on his thread. Strange how you are a mind reader... 'he came to troll on my thread...' How on earth did you reach that conclusion? And by the way, it's Dr. Yash. You failed to answer the question on how Portra would have changed the colour cast under artificial lighting. I really enjoyed reading this thread, especially your own humble opinion about your opening post. Very modest.", "link": "https://www.l-camera-forum.com/topic/257093-why-does-it-make-any-sense-at-all-to-use-non-professional-grade-film-stocks-in-this-day-and-age/page/7/?tab=comments#comment-3023606", "origin": "L-forum", "suborigin": "257093-why-does-it-make-any-sense-at-all-to-use-non-professional-grade-film-stocks-in-this-day-and-age", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "james - perhaps the question underlying the well constructed thesis of my thread has been \"addressed,\" but it hasn't been \"answered.\" most people completely dodged the actual underlying question and chose to answer other questions (e.g., quality consistency is really an outdated reason that doesn't apply with today's film stocks; so it was nice to learn the history but doesn't really get to the heart of the question in today's environment). this is fine insofar as a general film-related discussion goes; but only a few of the posters really touched on what was piquing my curiosity. i absolutely didn't \"ignore\" anyone's response to this thread. i read each one in earnest and reflected on them. i respect all genuine earnest views expressed here for what they are. i really was never \"searching\" for an answer. i was merely throwing out the question and providing my thesis of why i think that non-pro film really isn't cost- beneficial in our current environment as a general matter. i still firmly believe this. but i don't think less of anyone who has a different view. i just haven't really heard an answer that makes sense to me as a matter of logic and reason, including any of your responses if i may say so. that's cool, though; at least i got 7 pages of interesting film-related discussion out of it. --img--  as for mr. yash, this has some history to it, as -----> i !!!  -----> created !!!  the thread specifically to avoid further pointless confrontation (and potentially perceived trolling) on his thread, which was really going no where. it was clear that he and i didn't see eye-to-eye on this topic, and he asked me to leave his thread multiple times. with all of this background, here he came to troll on my thread with the same line of pointless discourse that we had on his thread, as if to try to continue it even though he was begging for it to stop when it was on his thread. strange how you are a mind reader... 'he came to troll on my thread...' how on earth did you reach that conclusion? and by the way, it's dr. yash. you failed to answer the question on how portra would have changed the colour cast under artificial lighting. i really enjoyed reading this thread, especially your own humble opinion about your opening post. very modest.", "sortedWord": "None", "Identifyer": null, "identifyer": 101387, "year": "2016"}, {"autor": "RID", "date": "2016-04-26 18:50:00", "content": " Hello everyone, My name is Alexey Kashpersky, I am an artist from Ukraine, now live and work in New York. Mainly I create artworks in medical field and fantasy style. Became interested in photography 3 years ago, as far as find it pretty close to art that I'm doing and just yesterday got my first Leica M camera and already started enjoying this piece of pure awesomeness... Here is my website with artworks http://kashpersky.com/ Photos can be founded here https://www.behance.net/collection/32163931/Photo-Art Any suggestions about the forum? What's the rules? What to read first? How to post photos here? Nice to meet y'all! Happy to be in this Leica club --img-- ", "link": "https://www.l-camera-forum.com/topic/259761-hello-from-ukraine/?tab=comments#comment-3034022", "origin": "L-forum", "suborigin": "259761-hello-from-ukraine", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": " hello everyone, my name is alexey kashpersky, i am an artist from ukraine, now live and work in new york. mainly -----> i !!!  -----> create !!!  artworks in medical field and fantasy style. became interested in photography 3 years ago, as far as find it pretty close to art that i'm doing and just yesterday got my first leica m camera and already started enjoying this piece of pure awesomeness... here is my website with artworks http://kashpersky.com/ photos can be founded here https://www.behance.net/collection/32163931/photo-art any suggestions about the forum? what's the rules? what to read first? how to post photos here? nice to meet y'all! happy to be in this leica club --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 114795, "year": "2016"}], "name": "Leicasortedout2016create"}