{"interestingcomments": [{"autor": "Anbaric", "date": "2021-03-30 23:10:00", "content": " It would be nice, though, if Leica kept a stock of accessories and spares for some reasonable number of years after a major product has been discontinued. It's not as if their gear is cheap or disposable. Back in the 50s, you could get your 25 year old camera upgraded to the latest specs and your grandchildren might still be using it today. But if you acquired the 35/2 ASPH v1 back in 2016, just before it was discontinued, you should probably have picked up a couple of spare hood caps, because you wouldn't be able to find original replacements a couple of years later, let alone get the sensor fixed on the M9 you bought new in 2012 that is now a beautifully engineered paperweight. As with the MDR battery, supporting their products has been left to third parties (and to be fair, that guy who 3D prints those caps on ebay does a better job than Leica - the replacement actually stays on the hood!).", "link": "https://www.l-camera-forum.com/topic/304006-m10-%E2%80%98non-leica%E2%80%99-battery/page/2/?tab=comments#comment-4171102", "origin": "L-forum", "suborigin": "304006-m10-%E2%80%98non-leica%E2%80%99-battery", "result": true, "Selector": "3d prints", "selectorShort": "print", "MarkedSent": " it would be nice, though, if leica kept a stock of accessories and spares for some reasonable number of years after a major product has been discontinued. it's not as if their gear is cheap or disposable. back in the 50s, you could get your 25 year old camera upgraded to the latest specs and your grandchildren might still be using it today. but if you acquired the 35/2 asph v1 back in 2016, just before it was discontinued, you should probably have picked up a couple of spare hood caps, because you wouldn't be able to find original replacements a couple of years later, let alone get the sensor fixed on the m9 you bought new in 2012 that is now a beautifully engineered paperweight. as with the mdr battery, supporting their products has been left to third parties (and to be fair, that guy who -----> 3d !!!  -----> prints !!!  those caps on ebay does a better job than leica - the replacement actually stays on the hood!).", "sortedWord": "None", "Identifyer": null, "identifyer": 9984, "year": "2021"}, {"autor": "Hintsalae", "date": "2021-10-08 05:01:00", "content": "This popped up in my twitter feed. If I understood translations correctly this is 3d-printed leica m3 which will be digitized with sony a7rII. Impressive stuff https://twitter.com/klapkk/status/1446182708481118209 Edited October 8 by Hintsalae", "link": "https://www.l-camera-forum.com/topic/323958-digitizing-an-old-leica/?tab=comments#comment-4288442", "origin": "L-forum", "suborigin": "323958-digitizing-an-old-leica", "result": true, "Selector": "3d-printed", "selectorShort": "print", "MarkedSent": "this popped up in my twitter feed. if i understood translations correctly this is -----> 3d !!! -printed leica m3 which will be digitized with sony a7rii. impressive stuff https://twitter.com/klapkk/status/1446182708481118209 edited october 8 by hintsalae", "sortedWord": "None", "Identifyer": null, "identifyer": 1182, "year": "2021"}, {"autor": "madNbad", "date": "2021-09-24 18:19:00", "content": "There are now several options for a shoe mounted meter. The MR-4 has the advantage of being coupled with the shutter speed dial but also finding a working one or having one repaired still leaves the battery issue. There are adapters and conversions to adjust modern silver oxide batteries to the same voltage as the mercury cells. Several companies have entered the market with their own version. Voigtlander has been around the longest and is a good choice. I have a Reveni Labs 3D printed meter that I like for its size and usability. There are also a number of other new meters, each with their own fans. Good luck and welcome to the forum. --img-- ", "link": "https://www.l-camera-forum.com/topic/324568-leica-m4-with-a-industar-lens/?tab=comments#comment-4280949", "origin": "L-forum", "suborigin": "324568-leica-m4-with-a-industar-lens", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "there are now several options for a shoe mounted meter. the mr-4 has the advantage of being coupled with the shutter speed dial but also finding a working one or having one repaired still leaves the battery issue. there are adapters and conversions to adjust modern silver oxide batteries to the same voltage as the mercury cells. several companies have entered the market with their own version. voigtlander has been around the longest and is a good choice. i have a reveni labs -----> 3d !!!  -----> printed !!!  meter that i like for its size and usability. there are also a number of other new meters, each with their own fans. good luck and welcome to the forum. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 1555, "year": "2021"}, {"autor": "madNbad", "date": "2021-01-02 18:34:00", "content": "I've been using the Reveni Labs 3D printed meter for the last several months. It's quite accurate and works fine for my needs. If I need more capability, I have a Sekonic 308u. --img-- ", "link": "https://www.l-camera-forum.com/topic/308186-small-light-meter/page/2/?tab=comments#comment-4110825", "origin": "L-forum", "suborigin": "308186-small-light-meter", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i've been using the reveni labs -----> 3d !!!  -----> printed !!!  meter for the last several months. it's quite accurate and works fine for my needs. if i need more capability, i have a sekonic 308u. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 5359, "year": "2021"}, {"autor": "Ken Abrahams", "date": "2021-09-08 06:22:00", "content": " Purchased third party cap for 35 Summicron lV hood. I know they are easy to lose and that Leica have discontinued the item. This cap fits perfectly and was probably 3D printed. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/324326-new-lens-hood-cap-for-35-summicron-asph/?tab=comments#comment-4271560", "origin": "L-forum", "suborigin": "324326-new-lens-hood-cap-for-35-summicron-asph", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": " purchased third party cap for 35 summicron lv hood. i know they are easy to lose and that leica have discontinued the item. this cap fits perfectly and was probably -----> 3d !!!  -----> printed !!! . --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 21886, "year": "2021"}, {"autor": "pgk", "date": "2021-08-20 09:50:00", "content": "14 minutes ago, wattsy said: Yes, that's the one. I did read somewhere that the part that split isn't actually plastic but some kind of cheap cast aluminium-silicon alloy (Silumin?). Quality plastic might have actually been a suitable material. I had one and it went to Malclom Taylor who could not repair it. If I remember correctly I think that he said that it was 'makrolon' which, whilst it has many attributes (https://solutions.covestro.com/en/brands/makrolon), can be difficult (or as in my case, impossible) to repair and needs to be replaced (Malcolm could not do so due to lack of spares). If someone could get hold of the part it may now bepossible to have it measured up and 3D printed. Brass helicoids have the advantage of being potentially repairable if damaged (I had a 50mm Summilux which as dropped and had a stiff point on the focus which was repaired fine) whereas I would guess that aluminium helicoids probably have to be replaced because aluminium is less pliable. That said, aluiminium helicoids have been used in lenses like the MF Micro-Nikkors many of which have had a hard life and still operate well, so its hardly an innovative or problematic material to make heliocoids from.", "link": "https://www.l-camera-forum.com/topic/323711-mechanical-construction-of-summarit-lenses/?tab=comments#comment-4259848", "origin": "L-forum", "suborigin": "323711-mechanical-construction-of-summarit-lenses", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "14 minutes ago, wattsy said: yes, that's the one. i did read somewhere that the part that split isn't actually plastic but some kind of cheap cast aluminium-silicon alloy (silumin?). quality plastic might have actually been a suitable material. i had one and it went to malclom taylor who could not repair it. if i remember correctly i think that he said that it was 'makrolon' which, whilst it has many attributes (https://solutions.covestro.com/en/brands/makrolon), can be difficult (or as in my case, impossible) to repair and needs to be replaced (malcolm could not do so due to lack of spares). if someone could get hold of the part it may now bepossible to have it measured up and -----> 3d !!!  -----> printed !!! . brass helicoids have the advantage of being potentially repairable if damaged (i had a 50mm summilux which as dropped and had a stiff point on the focus which was repaired fine) whereas i would guess that aluminium helicoids probably have to be replaced because aluminium is less pliable. that said, aluiminium helicoids have been used in lenses like the mf micro-nikkors many of which have had a hard life and still operate well, so its hardly an innovative or problematic material to make heliocoids from.", "sortedWord": "None", "Identifyer": null, "identifyer": 22603, "year": "2021"}, {"autor": "cboy", "date": "2021-03-19 23:39:00", "content": "There will be most likely a new cage to be rolled out for the new fp-L to accommodate for the evf so an extra cold shoe connection shouldnt be a problem. Sigma gave out their 3d model of the fp for third party manufacturer to develop third party accessories. It was even accessible to consumers to so they can custom 3d print accessories. Itll be likely the same for the fp-l. If the fp-l is the same dimensions as the fp then the existing cages will likely work with the evf since cages already accommodate the existing cold shoe mount accessory. Edited March 19 by cboy", "link": "https://www.l-camera-forum.com/topic/317849-sigma-fp-l-on-the-way/page/3/?tab=comments#comment-4164245", "origin": "L-forum", "suborigin": "317849-sigma-fp-l-on-the-way", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "there will be most likely a new cage to be rolled out for the new fp-l to accommodate for the evf so an extra cold shoe connection shouldnt be a problem. sigma gave out their 3d model of the fp for third party manufacturer to develop third party accessories. it was even accessible to consumers to so they can custom -----> 3d !!!  -----> print !!!  accessories. itll be likely the same for the fp-l. if the fp-l is the same dimensions as the fp then the existing cages will likely work with the evf since cages already accommodate the existing cold shoe mount accessory. edited march 19 by cboy", "sortedWord": "None", "Identifyer": null, "identifyer": 47461, "year": "2021"}, {"autor": "nwphil", "date": "2021-11-29 18:26:00", "content": "Just now, barnabythebear said: Hi, I'm OK with a used look but if it can be made to look better I'd be interested in trying it. Thanks, Nige. get a body case then I think I saw some full body neoprene thing - maybe was a 3d printed plastic wrap on Etsy... or....get it custom painted - will be spendy, but the new dings and scratches will be all yours 😁 touch-up paint will never work properly - you can look at this https://www.birchwoodcasey.com/gun-refinishing/metal/ I have a pen type instant touch-up but not for camera stuff. never matches will, but it covers up....for a while", "link": "https://www.l-camera-forum.com/topic/327042-q-black-paint-touch-up/?tab=comments#comment-4322778", "origin": "L-forum", "suborigin": "327042-q-black-paint-touch-up", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "just now, barnabythebear said: hi, i'm ok with a used look but if it can be made to look better i'd be interested in trying it. thanks, nige. get a body case then i think i saw some full body neoprene thing - maybe was a -----> 3d !!!  -----> printed !!!  plastic wrap on etsy... or....get it custom painted - will be spendy, but the new dings and scratches will be all yours 😁 touch-up paint will never work properly - you can look at this https://www.birchwoodcasey.com/gun-refinishing/metal/ i have a pen type instant touch-up but not for camera stuff. never matches will, but it covers up....for a while", "sortedWord": "None", "Identifyer": null, "identifyer": 52715, "year": "2021"}, {"autor": "johonew", "date": "2021-11-29 02:35:00", "content": "I recently bought a 3D printed case for my Q2M on Etsy that has a place already printed into the case for the Air Tag. I intend to use it when traveling.", "link": "https://www.l-camera-forum.com/topic/326922-airtaging-my-camera/?tab=comments#comment-4322322", "origin": "L-forum", "suborigin": "326922-airtaging-my-camera", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i recently bought a -----> 3d !!!  -----> printed !!!  case for my q2m on etsy that has a place already -----> printed !!!  into the case for the air tag. i intend to use it when traveling.", "sortedWord": "None", "Identifyer": null, "identifyer": 53456, "year": "2021"}, {"autor": "ianforber", "date": "2021-06-08 21:19:00", "content": "I’ve been tempted by that case. It’s a 3D printed case available on Etsy from a guy called Kapsalis3dshop. Does a version with or without the Airtag slot. I decided I was happy with my Lim’s case though.", "link": "https://www.l-camera-forum.com/topic/319214-leica-q-thumb-grip-to-q2/?tab=comments#comment-4216286", "origin": "L-forum", "suborigin": "319214-leica-q-thumb-grip-to-q2", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i’ve been tempted by that case. it’s a -----> 3d !!!  -----> printed !!!  case available on etsy from a guy called kapsalis3dshop. does a version with or without the airtag slot. i decided i was happy with my lim’s case though.", "sortedWord": "None", "Identifyer": null, "identifyer": 6480, "year": "2021"}, {"autor": "syam", "date": "2021-01-07 14:17:00", "content": " 4 hours ago, PhotoCruiser said: Basically a good project and i am sure some people would use it. What i suggest is to drop the milled aluminum or brass housing for price, shock absorbtion and weight reasons and use a reasonable soft plastic with a good haptic feeling to keep or expand the high quality finish and appearance of a Leica camera. Chris Hi Chris, Thanks for the input. I have not toyed around with the idea of 3D printing in a flexible material, but that would be a good idea for texture/feel and also weight. The only issue would be securing the top and bottom halves together and/or designing it to stretch open. If I get time in the future I may try to design for these considerations and also experiment with flexible filaments and/or other 3D printing technologies that do not break the bank. As an aside, I've been taking fewer pictures the past 6 months, but the Q has still been stellar every time I use it. I've been using the same 3D printed case from several months back and it's been great. I do have several improvements in mind but being busy at work, buying a new old house, life has left me with very little time for additional side projects. Edited January 7 by syam", "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/page/2/?tab=comments#comment-4113909", "origin": "L-forum", "suborigin": "299948-my-first-leica-q-designing-a-case", "result": true, "Selector": "3d printing", "selectorShort": "print", "MarkedSent": " 4 hours ago, photocruiser said: basically a good project and i am sure some people would use it. what i suggest is to drop the milled aluminum or brass housing for price, shock absorbtion and weight reasons and use a reasonable soft plastic with a good haptic feeling to keep or expand the high quality finish and appearance of a leica camera. chris hi chris, thanks for the input. i have not toyed around with the idea of -----> 3d !!!  -----> printing !!!  in a flexible material, but that would be a good idea for texture/feel and also weight. the only issue would be securing the top and bottom halves together and/or designing it to stretch open. if i get time in the future i may try to design for these considerations and also experiment with flexible filaments and/or other 3d printing technologies that do not break the bank. as an aside, i've been taking fewer pictures the past 6 months, but the q has still been stellar every time i use it. i've been using the same 3d printed case from several months back and it's been great. i do have several improvements in mind but being busy at work, buying a new old house, life has left me with very little time for additional side projects. edited january 7 by syam", "sortedWord": "None", "Identifyer": null, "identifyer": 6591, "year": "2021"}, {"autor": "John Black", "date": "2021-06-15 05:49:00", "content": "If you can find series 5.5 filters, odds are, they are low grade stuff... I've tried many, probably made in the 80's and 90's, and found them to be resolution robbers... B+W and Heliopan phased out their 5.5 series filters some time ago. You could buy some 39mm filters, liberate their glass, 3D print a frame to hold filter and create your own drop-in filters. I'm in the process of giving that a go for my Leica 280/2.8 APO Modular. I have a 280/4 APO and used it with the M-246 and now the M10-M. It works great with 77mm filters. I use 77mm red, dark red, polarizer & neutral density. If stacking filters, such as a dark red & polarizer, there will be some slightly physical vignetting. I use B+W MRC colored filters and Heliopan's High Transmission Polarizer. Leica's drop-in polarizer is fine, but it's not a particularly strong polarizer and optically I noticed more loss in sharpness with it vs the Heliopans. Some pix here.", "link": "https://www.l-camera-forum.com/topic/320540-280mm-f40-apo-telyt-r-filters-s55-vs-77mm/?tab=comments#comment-4220232", "origin": "L-forum", "suborigin": "320540-280mm-f40-apo-telyt-r-filters-s55-vs-77mm", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "if you can find series 5.5 filters, odds are, they are low grade stuff... i've tried many, probably made in the 80's and 90's, and found them to be resolution robbers... b+w and heliopan phased out their 5.5 series filters some time ago. you could buy some 39mm filters, liberate their glass, -----> 3d !!!  -----> print !!!  a frame to hold filter and create your own drop-in filters. i'm in the process of giving that a go for my leica 280/2.8 apo modular. i have a 280/4 apo and used it with the m-246 and now the m10-m. it works great with 77mm filters. i use 77mm red, dark red, polarizer & neutral density. if stacking filters, such as a dark red & polarizer, there will be some slightly physical vignetting. i use b+w mrc colored filters and heliopan's high transmission polarizer. leica's drop-in polarizer is fine, but it's not a particularly strong polarizer and optically i noticed more loss in sharpness with it vs the heliopans. some pix here.", "sortedWord": "None", "Identifyer": null, "identifyer": 19808, "year": "2021"}, {"autor": "mmx_2", "date": "2021-06-15 07:29:00", "content": "1 hour ago, John Black said: If you can find series 5.5 filters, odds are, they are low grade stuff... I've tried many, probably made in the 80's and 90's, and found them to be resolution robbers... B+W and Heliopan phased out their 5.5 series filters some time ago. You could buy some 39mm filters, liberate their glass, 3D print a frame to hold filter and create your own drop-in filters. I'm in the process of giving that a go for my Leica 280/2.8 APO Modular. I have a 280/4 APO and used it with the M-246 and now the M10-M. It works great with 77mm filters. I use 77mm red, dark red, polarizer & neutral density. If stacking filters, such as a dark red & polarizer, there will be some slightly physical vignetting. I use B+W MRC colored filters and Heliopan's High Transmission Polarizer. Leica's drop-in polarizer is fine, but it's not a particularly strong polarizer and optically I noticed more loss in sharpness with it vs the Heliopans. Some pix here. I've had the same idea actually, with 3D-printing a holder. I'll come back if I get to it.", "link": "https://www.l-camera-forum.com/topic/320540-280mm-f40-apo-telyt-r-filters-s55-vs-77mm/?tab=comments#comment-4220263", "origin": "L-forum", "suborigin": "320540-280mm-f40-apo-telyt-r-filters-s55-vs-77mm", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "1 hour ago, john black said: if you can find series 5.5 filters, odds are, they are low grade stuff... i've tried many, probably made in the 80's and 90's, and found them to be resolution robbers... b+w and heliopan phased out their 5.5 series filters some time ago. you could buy some 39mm filters, liberate their glass, -----> 3d !!!  -----> print !!!  a frame to hold filter and create your own drop-in filters. i'm in the process of giving that a go for my leica 280/2.8 apo modular. i have a 280/4 apo and used it with the m-246 and now the m10-m. it works great with 77mm filters. i use 77mm red, dark red, polarizer & neutral density. if stacking filters, such as a dark red & polarizer, there will be some slightly physical vignetting. i use b+w mrc colored filters and heliopan's high transmission polarizer. leica's drop-in polarizer is fine, but it's not a particularly strong polarizer and optically i noticed more loss in sharpness with it vs the heliopans. some pix here. i've had the same idea actually, with 3d-printing a holder. i'll come back if i get to it.", "sortedWord": "None", "Identifyer": null, "identifyer": 19809, "year": "2021"}, {"autor": "BernardC", "date": "2021-07-23 14:56:00", "content": "Leica seems to have a policy to offer a discount on a new item if they don't have parts to repair an old one. This seems reasonable, other companies won't even look at an item after a few years. In this case, the cost of replacement is out-of-line with the apparent damage to the item, even after discount. I'm sure you can find an independent source that will take-on this repair. My local camera-repair shop once turned a screw on a lathe for a Hasselblad lens hood. It was a non-standard size, and they had three others to compare it to, so it was the work of a few minutes for them to make a new one rather than bodge the repair or refuse the job. I can foresee a world where Leica can CNC or 3D-print parts on-demand, but we are not there yet. In the meanwhile, turning a screw should be a relatively simple job for any local machinist, provided they can work on pieces that small.", "link": "https://www.l-camera-forum.com/topic/322915-a-recent-s-service-experience-with-leica/?tab=comments#comment-4243678", "origin": "L-forum", "suborigin": "322915-a-recent-s-service-experience-with-leica", "result": true, "Selector": "3d-print", "selectorShort": "print", "MarkedSent": "leica seems to have a policy to offer a discount on a new item if they don't have parts to repair an old one. this seems reasonable, other companies won't even look at an item after a few years. in this case, the cost of replacement is out-of-line with the apparent damage to the item, even after discount. i'm sure you can find an independent source that will take-on this repair. my local camera-repair shop once turned a screw on a lathe for a hasselblad lens hood. it was a non-standard size, and they had three others to compare it to, so it was the work of a few minutes for them to make a new one rather than bodge the repair or refuse the job. i can foresee a world where leica can cnc or -----> 3d !!! -print parts on-----> - !!! demand, but we are not there yet. in the meanwhile, turning a screw should be a relatively simple job for any local machinist, provided they can work on pieces that small.", "sortedWord": "None", "Identifyer": null, "identifyer": 24610, "year": "2021"}, {"autor": "ZHNL", "date": "2021-07-23 17:43:00", "content": "2 hours ago, BernardC said: Leica seems to have a policy to offer a discount on a new item if they don't have parts to repair an old one. This seems reasonable, other companies won't even look at an item after a few years. In this case, the cost of replacement is out-of-line with the apparent damage to the item, even after discount. I'm sure you can find an independent source that will take-on this repair. My local camera-repair shop once turned a screw on a lathe for a Hasselblad lens hood. It was a non-standard size, and they had three others to compare it to, so it was the work of a few minutes for them to make a new one rather than bodge the repair or refuse the job. I can foresee a world where Leica can CNC or 3D-print parts on-demand, but we are not there yet. In the meanwhile, turning a screw should be a relatively simple job for any local machinist, provided they can work on pieces that small. Thank you for your reply. Thank you for being polite. I don't agree with you one thing: Other company? Which other company have this issue you are talking about. Keep in mind, Leica C to S adapter is current product in their listing. I am not talking something 30 years old M or R accessories. If this logic applied, do I pay 25% discount buy a new car if my engine miss a screw or cap?", "link": "https://www.l-camera-forum.com/topic/322915-a-recent-s-service-experience-with-leica/?tab=comments#comment-4243776", "origin": "L-forum", "suborigin": "322915-a-recent-s-service-experience-with-leica", "result": true, "Selector": "3d-print", "selectorShort": "print", "MarkedSent": "2 hours ago, bernardc said: leica seems to have a policy to offer a discount on a new item if they don't have parts to repair an old one. this seems reasonable, other companies won't even look at an item after a few years. in this case, the cost of replacement is out-of-line with the apparent damage to the item, even after discount. i'm sure you can find an independent source that will take-on this repair. my local camera-repair shop once turned a screw on a lathe for a hasselblad lens hood. it was a non-standard size, and they had three others to compare it to, so it was the work of a few minutes for them to make a new one rather than bodge the repair or refuse the job. i can foresee a world where leica can cnc or -----> 3d !!! -print parts on-----> - !!! demand, but we are not there yet. in the meanwhile, turning a screw should be a relatively simple job for any local machinist, provided they can work on pieces that small. thank you for your reply. thank you for being polite. i don't agree with you one thing: other company? which other company have this issue you are talking about. keep in mind, leica c to s adapter is current product in their listing. i am not talking something 30 years old m or r accessories. if this logic applied, do i pay 25% discount buy a new car if my engine miss a screw or cap?", "sortedWord": "None", "Identifyer": null, "identifyer": 24615, "year": "2021"}, {"autor": "wlaidlaw", "date": "2021-11-03 18:04:00", "content": "Alan does some amazing repairs. I had a Combat Graflex 70mm film, motor wind, rangefinder camera, where most things either did not work or only worked intermittently. This is a very complicated camera originally designed by John Maurer the New York based aviation camera specialist and then productionised by Hubert Nerwin, one of the designers of the Contax RF. I managed to find a 1950's vintage US Navy service manual and using that, Alan completely rebuilt it to full working condition. We had to have some parts remade by 3D printing them in titanium. Alan has serviced many of my quite extensive collection of Leicas and quite a few of the older lenses. Like many third party Leica repairers, he is struggling to source parts as Leica will no longer sell spare parts. I had to send a begging letter to the CEO to get a new intermediate gear shaft for my M7, when it was with Alan. Wilson", "link": "https://www.l-camera-forum.com/topic/127326-repair-specialists/page/9/?tab=comments#comment-4306228", "origin": "L-forum", "suborigin": "127326-repair-specialists", "result": true, "Selector": "3d printing", "selectorShort": "print", "MarkedSent": "alan does some amazing repairs. i had a combat graflex 70mm film, motor wind, rangefinder camera, where most things either did not work or only worked intermittently. this is a very complicated camera originally designed by john maurer the new york based aviation camera specialist and then productionised by hubert nerwin, one of the designers of the contax rf. i managed to find a 1950's vintage us navy service manual and using that, alan completely rebuilt it to full working condition. we had to have some parts remade by -----> 3d !!!  -----> printing !!!  them in titanium. alan has serviced many of my quite extensive collection of leicas and quite a few of the older lenses. like many third party leica repairers, he is struggling to source parts as leica will no longer sell spare parts. i had to send a begging letter to the ceo to get a new intermediate gear shaft for my m7, when it was with alan. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 34395, "year": "2021"}, {"autor": "wlaidlaw", "date": "2021-04-22 18:03:00", "content": "On 4/9/2021 at 5:33 PM, pgk said: Lizars had a branch at this address from 1912 until after 1942. Our family bought all their cameras from Lizars in Aberdeen from the early part of the century until my M4 was bought there on release day in July 1967. I still have a 1935 Model II, a 1934 Model III and a 1953 Contax IIa as well as the M4, all bought from Lizars in Aberdeen. I think there is still a Lizars in Aberdeen but nowadays only an optician. Now for something different - a giant Combat Graflex KE-4 70mm film rangefinder. I have the whole KS-6 kit with 2½ Wide Angle, 4\" Standard and 8\" Telephoto lenses. I got Alan Starkie to rebuild it all, having found a copy of the US Navy service manual for the camera. We had to have some parts 3D printed in titanium, so hopefully they will be more robust than the age embrittled aluminium and Zamac (zinc-aluminium diecasting alloy) parts. When you hold down the shutter release, it sounds like a large calibre auto cannon firing, with its massively powerful clockwork motor drive. Apparently careless disassembly of this mechanism could lead to lost fingers. Below is a picture of the Combat Graflex (also known as Gulliver's Contax, as Hubert Nerwin, one of the original Contax designers, was involved in productionising John Maurer's original concept. A regular Contax IIa is alongside to give scale. Wilson --img-- ", "link": "https://www.l-camera-forum.com/topic/318752-nicht-immer-nur-kaviar-english-version/page/9/?tab=comments#comment-4186728", "origin": "L-forum", "suborigin": "318752-nicht-immer-nur-kaviar-english-version", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "on 4/9/2021 at 5:33 pm, pgk said: lizars had a branch at this address from 1912 until after 1942. our family bought all their cameras from lizars in aberdeen from the early part of the century until my m4 was bought there on release day in july 1967. i still have a 1935 model ii, a 1934 model iii and a 1953 contax iia as well as the m4, all bought from lizars in aberdeen. i think there is still a lizars in aberdeen but nowadays only an optician. now for something different - a giant combat graflex ke-4 70mm film rangefinder. i have the whole ks-6 kit with 2½ wide angle, 4\" standard and 8\" telephoto lenses. i got alan starkie to rebuild it all, having found a copy of the us navy service manual for the camera. we had to have some parts -----> 3d !!!  -----> printed !!!  in titanium, so hopefully they will be more robust than the age embrittled aluminium and zamac (zinc-aluminium diecasting alloy) parts. when you hold down the shutter release, it sounds like a large calibre auto cannon firing, with its massively powerful clockwork motor drive. apparently careless disassembly of this mechanism could lead to lost fingers. below is a picture of the combat graflex (also known as gulliver's contax, as hubert nerwin, one of the original contax designers, was involved in productionising john maurer's original concept. a regular contax iia is alongside to give scale. wilson --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 34971, "year": "2021"}, {"autor": "willeica", "date": "2021-04-22 21:23:00", "content": "3 hours ago, wlaidlaw said: Our family bought all their cameras from Lizars in Aberdeen from the early part of the century until my M4 was bought there on release day in July 1967. I still have a 1935 Model II, a 1934 Model III and a 1953 Contax IIa as well as the M4, all bought from Lizars in Aberdeen. I think there is still a Lizars in Aberdeen but nowadays only an optician. Now for something different - a giant Combat Graflex KE-4 70mm film rangefinder. I have the whole KS-6 kit with 2½ Wide Angle, 4\" Standard and 8\" Telephoto lenses. I got Alan Starkie to rebuild it all, having found a copy of the US Navy service manual for the camera. We had to have some parts 3D printed in titanium, so hopefully they will be more robust than the age embrittled aluminium and Zamac (zinc-aluminium diecasting alloy) parts. When you hold down the shutter release, it sounds like a large calibre auto cannon firing, with its massively powerful clockwork motor drive. Apparently careless disassembly of this mechanism could lead to lost fingers. Below is a picture of the Combat Graflex (also known as Gulliver's Contax, as Hubert Nerwin, one of the original Contax designers, was involved in productionising John Maurer's original concept. A regular Contax IIa is alongside to give scale. Wilson --img--  Little and large, Wilson. Gulliver’s Contax is right, but it also brings to mind the ‘Texas Leica’ . Speaking of Lizars, I have a Lizars of Belfast Falling Plate camera (1890-1910) on its way to me. The camera type interests me because J. M. Synge the Irish author and playwright famously bought one from an English tourist on the Aran Islands and he used it to record the local culture and lifestyle which was unknown on mainland Ireland. His was a Houghton model, I believe. 51 minutes ago, UliWer said: You remind me of my father's camera. He got it as a gift second hand, but was never happy with it. It still has a film in it, as I wanted to try if it still works, but I forgot about it, and too many Leicas were in its way. I should finish the film soon. It has a 1:2.8/5cm Tessar - which I found a rather weak lens (compared to the 1:3.5 version) on the Contax. Perhaps I will look at it less critically with the Super Baldina: --img--  They are a nice enough camera, but probably unnecessarily complicated to operate for such a small camera. With a lot of earlier lenses f3.5 versions were better than the f2.8 or f2 versions. My father’s camera came with an f2.9 Meyer Gorling lens. My Welta Perfekta also has a lovely Meyer Gorling lens. We should not judge the German lenses of the 1930s by ‘reputation’. A lot of the lesser lenses easily match the Zeiss and Leitz offerings. I have another Super Baldina camera with a Schneider Kreuznach f2 Xenar and it does not produce better images than my father’s camera with its Meyer Gorling. I started a roll today with the Leitz Elmar. It will be interesting to see where that sits with the ‘competition’. William", "link": "https://www.l-camera-forum.com/topic/318752-nicht-immer-nur-kaviar-english-version/page/9/?tab=comments#comment-4186826", "origin": "L-forum", "suborigin": "318752-nicht-immer-nur-kaviar-english-version", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "3 hours ago, wlaidlaw said: our family bought all their cameras from lizars in aberdeen from the early part of the century until my m4 was bought there on release day in july 1967. i still have a 1935 model ii, a 1934 model iii and a 1953 contax iia as well as the m4, all bought from lizars in aberdeen. i think there is still a lizars in aberdeen but nowadays only an optician. now for something different - a giant combat graflex ke-4 70mm film rangefinder. i have the whole ks-6 kit with 2½ wide angle, 4\" standard and 8\" telephoto lenses. i got alan starkie to rebuild it all, having found a copy of the us navy service manual for the camera. we had to have some parts -----> 3d !!!  -----> printed !!!  in titanium, so hopefully they will be more robust than the age embrittled aluminium and zamac (zinc-aluminium diecasting alloy) parts. when you hold down the shutter release, it sounds like a large calibre auto cannon firing, with its massively powerful clockwork motor drive. apparently careless disassembly of this mechanism could lead to lost fingers. below is a picture of the combat graflex (also known as gulliver's contax, as hubert nerwin, one of the original contax designers, was involved in productionising john maurer's original concept. a regular contax iia is alongside to give scale. wilson --img--  little and large, wilson. gulliver’s contax is right, but it also brings to mind the ‘texas leica’ . speaking of lizars, i have a lizars of belfast falling plate camera (1890-1910) on its way to me. the camera type interests me because j. m. synge the irish author and playwright famously bought one from an english tourist on the aran islands and he used it to record the local culture and lifestyle which was unknown on mainland ireland. his was a houghton model, i believe. 51 minutes ago, uliwer said: you remind me of my father's camera. he got it as a gift second hand, but was never happy with it. it still has a film in it, as i wanted to try if it still works, but i forgot about it, and too many leicas were in its way. i should finish the film soon. it has a 1:2.8/5cm tessar - which i found a rather weak lens (compared to the 1:3.5 version) on the contax. perhaps i will look at it less critically with the super baldina: --img--  they are a nice enough camera, but probably unnecessarily complicated to operate for such a small camera. with a lot of earlier lenses f3.5 versions were better than the f2.8 or f2 versions. my father’s camera came with an f2.9 meyer gorling lens. my welta perfekta also has a lovely meyer gorling lens. we should not judge the german lenses of the 1930s by ‘reputation’. a lot of the lesser lenses easily match the zeiss and leitz offerings. i have another super baldina camera with a schneider kreuznach f2 xenar and it does not produce better images than my father’s camera with its meyer gorling. i started a roll today with the leitz elmar. it will be interesting to see where that sits with the ‘competition’. william", "sortedWord": "None", "Identifyer": null, "identifyer": 34973, "year": "2021"}, {"autor": "rionda", "date": "2021-01-09 16:40:00", "content": "Thanks all for the reply. There seems to be some contrasting information though. Some people saying that it should be very easy ( @Jamison), relatively easy but a bit fiddly (the ebay listing), or quite complicated (@jerzy). I got the 3d printed part on ebay. When I will receive it, I'll study the instructions and compare with what is described above, then report back 😃", "link": "https://www.l-camera-forum.com/topic/316833-worth-getting-a-cl-repaired/?tab=comments#comment-4115102", "origin": "L-forum", "suborigin": "316833-worth-getting-a-cl-repaired", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "thanks all for the reply. there seems to be some contrasting information though. some people saying that it should be very easy ( @jamison), relatively easy but a bit fiddly (the ebay listing), or quite complicated (@jerzy). i got the -----> 3d !!!  -----> printed !!!  part on ebay. when i will receive it, i'll study the instructions and compare with what is described above, then report back 😃", "sortedWord": "None", "Identifyer": null, "identifyer": 41662, "year": "2021"}, {"autor": "rionda", "date": "2021-01-09 17:20:00", "content": "4 minutes ago, jerzy said: I just looked to the ebay listing, seller does not explain at all how to do replacement. Will he send more information later? I replaced broken spools already (with original part) and I know what does it take. Maybe @twcxz can fill us in about how to use the 3d printed part, as they are the builder of the part. 😃", "link": "https://www.l-camera-forum.com/topic/316833-worth-getting-a-cl-repaired/?tab=comments#comment-4115129", "origin": "L-forum", "suborigin": "316833-worth-getting-a-cl-repaired", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "4 minutes ago, jerzy said: i just looked to the ebay listing, seller does not explain at all how to do replacement. will he send more information later? i replaced broken spools already (with original part) and i know what does it take. maybe @twcxz can fill us in about how to use the -----> 3d !!!  -----> printed !!!  part, as they are the builder of the part. 😃", "sortedWord": "None", "Identifyer": null, "identifyer": 41664, "year": "2021"}, {"autor": "giannis", "date": "2021-01-25 21:18:00", "content": "Too much hassle for Leica. The main problem would be lenses. Leica doesn't have any experience in medium format (or larger) lenses to cover a true panoramic format, neither I'm guessing any designs ready for production. It would necessitate a brand new lens lineup, at considerable prime premium over M lenses (easily 5k+ per lens). In the current market, I doubt they'd ever recoup the costs of developing the lenses alone, if they sell just a couple dozen per year. Honestly if someone where to make a panoramic camera, it would be Fuji. They have a huge experience in panoramic cameras (Xpan, 617) as well as medium and large format lenses. Also experience building many different camera form factors in medium format. They pretty much built anything under the sun: 6x7 rangefinders, 6x9 rangefinders both fixed lens and interchangeable, 645 rangefinders and AF rangefinders, 6x8 SLRs, bellows cameras, not to mention their panoramic models like the 617 or Xpan (TX). Will they do it? I believe not but I'd like to be pleasantly surprised. For now the easiest route to panoramic seems to be a medium format camera (preferably 6x7 or larger), with an adapter for 35mm film. This is trivial to do with no modifications and $5 in plastic 3D printed parts, if you don't mind unloading the roll in the changing bag once it's finished. Alternatively, a panoramic back. It's a shame that those cost as much as the camera itself due to rarity, but even the exorbitant $300, say for a bronica panoramic back, seems like a steal next to XPan prices. And another route seems to be simple, 3D-printed or CNC'd medium format bodies with large format lenses. A light-tight black box with a transport mechanism and a helicoid, you mount a ubiquitous 90mm super angulon, and you're good to go for 6x12. The main complications in a body is the focusing mechanism and shutter. With a shoe mounted external RF (can be had for $30), and the shutter in the lens, those are solved. Edited January 25 by giannis", "link": "https://www.l-camera-forum.com/topic/316940-would-leica-ever-make-a-panoramic-35mm-film-camera/page/2/?tab=comments#comment-4125626", "origin": "L-forum", "suborigin": "316940-would-leica-ever-make-a-panoramic-35mm-film-camera", "result": false, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "this is trivial to do with no modifications and $5 in plastic 3d printed parts, if you don't mind unloading the -----> roll !!!  in the changing bag once it's finished.", "sortedWord": "roll", "Identifyer": null, "identifyer": 6142, "year": "2021"}, {"autor": "jaques", "date": "2021-04-05 05:58:00", "content": "is that a 3d printed ablon film cutter? is that why the price of ablon's has dropped a little? ;-)", "link": "https://www.l-camera-forum.com/topic/319559-a-small-thing-but-im-a-little-proud-of-it/?tab=comments#comment-4174539", "origin": "L-forum", "suborigin": "319559-a-small-thing-but-im-a-little-proud-of-it", "result": false, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "is that a 3d printed ablon -----> film !!!  cutter? is that why the price of ablon's has dropped a little? ;-)", "sortedWord": "film", "Identifyer": null, "identifyer": 39630, "year": "2021"}, {"autor": "mikemgb", "date": "2021-04-05 23:08:00", "content": "17 hours ago, jaques said: is that a 3d printed ablon film cutter? is that why the price of ablon's has dropped a little? 😉 It is, I printed this a couple of years ago because I didn't want to spend that much on an Albon, of course, now I have decided I really should buy the real thing they're harder to come by.", "link": "https://www.l-camera-forum.com/topic/319559-a-small-thing-but-im-a-little-proud-of-it/?tab=comments#comment-4175073", "origin": "L-forum", "suborigin": "319559-a-small-thing-but-im-a-little-proud-of-it", "result": false, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "17 hours ago, jaques said: is that a 3d printed ablon -----> film !!!  cutter? is that why the price of ablon's has dropped a little?", "sortedWord": "film", "Identifyer": null, "identifyer": 39636, "year": "2021"}], "name": "Leicasortedout2021print"}