{"interestingcomments": [{"autor": "Jon Pop", "date": "2011-10-26 22:50:00", "content": " Hello, I just purchased a Zeiss 35mm Biogon C f2.8 lens, heard lots of great things about it and it was a good price. What I'm wondering is the preferred setting for the lens profile - I know I could 'play around and experiment' myself, but if someone out there who is an avid M9 user (I'm new to the M9, usually using my MP) has come up with the best lens profile to pick from the M9 menu, I'd love to know. I don't want to pixel peep for hours looking around. I have the latest firmware. I notice that the Summarit 35 f2.5 isn't in the lens profile (it has the closest minimum aperture so I'd thought about using that one). I've heard some say 'use the 35mm f2 summicron pre-asph', but wanted to ask the question anyway. I want to get the best performance from this lovely lens on my M9; don't want to blame vignetting or anything like that on the lens when I've simply not picked the best profile. Nor am I interested in performing lots of post-production corrections. I appreciate everyone's advice! Cheers, Jon", "link": "https://www.l-camera-forum.com/topic/164943-advice-please-zeiss-biogon-c-35mm-f28-best-lens-code/?tab=comments#comment-1827428", "origin": "L-forum", "suborigin": "164943-advice-please-zeiss-biogon-c-35mm-f28-best-lens-code", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " hello, i just purchased a zeiss 35mm biogon c f2.8 lens, heard lots of great things about it and it was a good price. what i'm wondering is the preferred setting for the lens profile - i know i could 'play around and experiment' myself, but if someone out there who is an avid m9 user (i'm new to the m9, usually using my mp) has -----> come !!!  -----> up !!!  -----> with !!!  the best lens profile to pick from the m9 menu, i'd love to know. i don't want to pixel peep for hours looking around. i have the latest firmware. i notice that the summarit 35 f2.5 isn't in the lens profile (it has the closest minimum aperture so i'd thought about using that one). i've heard some say 'use the 35mm f2 summicron pre-asph', but wanted to ask the question anyway. i want to get the best performance from this lovely lens on my m9; don't want to blame vignetting or anything like that on the lens when i've simply not picked the best profile. nor am i interested in performing lots of post-production corrections. i appreciate everyone's advice! cheers, jon", "sortedWord": "None", "Identifyer": null, "identifyer": 31582, "year": "2011"}, {"autor": "Washington", "date": "2011-04-17 16:08:00", "content": "Oh, jappv, Another interesting think about Chinese industry is that unlike what we did during the*'’industrial revolution’’ they came up with the idea to build new factories out in the rural areas near the work force rather than have all the people from the farms move to the city. Pretty smart…. think of all the crowding that solves.", "link": "https://www.l-camera-forum.com/topic/148213-non-leica-m9-battery-test/page/4/?tab=comments#comment-1648253", "origin": "L-forum", "suborigin": "148213-non-leica-m9-battery-test", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "oh, jappv, another interesting think about chinese industry is that unlike what we did during the*'’industrial revolution’’ they -----> came !!!  -----> up !!!  -----> with !!!  the idea to build new factories out in the rural areas near the work force rather than have all the people from the farms move to the city. pretty smart…. think of all the crowding that solves.", "sortedWord": "None", "Identifyer": null, "identifyer": 32388, "year": "2011"}, {"autor": "haroldp", "date": "2011-04-20 17:00:00", "content": "Oh, jappv, Another interesting think about Chinese industry is that unlike what we did during the*'’industrial revolution’’ they came up with the idea to build new factories out in the rural areas near the work force rather than have all the people from the farms move to the city. Pretty smart…. think of all the crowding that solves. Then the factory sites concentrate for infrastructure like roads and power grids and become the new 'cities'. Think Detroit, Chicago, Denver etc. Cheers .... H", "link": "https://www.l-camera-forum.com/topic/148213-non-leica-m9-battery-test/page/4/?tab=comments#comment-1651171", "origin": "L-forum", "suborigin": "148213-non-leica-m9-battery-test", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "oh, jappv, another interesting think about chinese industry is that unlike what we did during the*'’industrial revolution’’ they -----> came !!!  -----> up !!!  -----> with !!!  the idea to build new factories out in the rural areas near the work force rather than have all the people from the farms move to the city. pretty smart…. think of all the crowding that solves. then the factory sites concentrate for infrastructure like roads and power grids and become the new 'cities'. think detroit, chicago, denver etc. cheers .... h", "sortedWord": "None", "Identifyer": null, "identifyer": 32392, "year": "2011"}, {"autor": "enchong", "date": "2011-08-12 19:13:00", "content": "Had my M9 for 2 months and came up with some black and white pics from my last US trip...simply amazing camera Flickr: Enchong's Photostream i love my M9!!! should i go M9-P??? hehehehe enchong", "link": "https://www.l-camera-forum.com/topic/97907-collecting-leica-m9-sites/page/8/?tab=comments#comment-1763742", "origin": "L-forum", "suborigin": "97907-collecting-leica-m9-sites", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "had my m9 for 2 months and -----> came !!!  -----> up !!!  -----> with !!!  some black and white pics from my last us trip...simply amazing camera flickr: enchong's photostream i love my m9!!! should i go m9-p??? hehehehe enchong", "sortedWord": "None", "Identifyer": null, "identifyer": 36766, "year": "2011"}, {"autor": "mikelevitt", "date": "2011-02-05 17:30:00", "content": "I don't think so. Even though the mirror goes up, you aren't blinded, and can easily see the pre flash in the room, with your peripheral vision, or with your other eye. I absolutely cannot see a pre-flash with Canon, and it is really obvious with the Leica. Just FYI, I am shooting the Mark 4 and Mark 3S cameras. I have no idea how the consumer Canon bodies handle it because I don't use them. There is something else going on here, I'm guessing drastically slower processing, or less than optimal design of the circuit. Maybe the designers did not make it a priority to make a short gap because they were designers, not photographers. Only a photographer would know how a perceptible pre-flash would ruin a shot. Let's face it, some genius designer came up with the utterly worthless red eye reduction! So here's my conclusion. If you need to shoot people photos with the M9 and flash on the camera and don't want to have them blinking, don't use TTL with the M9. Other techniques (off camera) and methods (auto mode) seem to work better. I'm just trying to put this out there so that when the next person finds this thread while trying to decide whether to buy this flash, and what it is capable of will have the information. I am not a guy who spends a lot of time reading or posting on forums, I just go when I need information. The TTL is not working for me. Whether it works for you depends on your expectations and the way you work. Mike", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/8/?tab=comments#comment-1579170", "origin": "L-forum", "suborigin": "99414-reidreview-review-of-leica-sf58-flash-unit", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i don't think so. even though the mirror goes up, you aren't blinded, and can easily see the pre flash in the room, with your peripheral vision, or with your other eye. i absolutely cannot see a pre-flash with canon, and it is really obvious with the leica. just fyi, i am shooting the mark 4 and mark 3s cameras. i have no idea how the consumer canon bodies handle it because i don't use them. there is something else going on here, i'm guessing drastically slower processing, or less than optimal design of the circuit. maybe the designers did not make it a priority to make a short gap because they were designers, not photographers. only a photographer would know how a perceptible pre-flash would ruin a shot. let's face it, some genius designer -----> came !!!  -----> up !!!  -----> with !!!  the utterly worthless red eye reduction! so here's my conclusion. if you need to shoot people photos with the m9 and flash on the camera and don't want to have them blinking, don't use ttl with the m9. other techniques (off camera) and methods (auto mode) seem to work better. i'm just trying to put this out there so that when the next person finds this thread while trying to decide whether to buy this flash, and what it is capable of will have the information. i am not a guy who spends a lot of time reading or posting on forums, i just go when i need information. the ttl is not working for me. whether it works for you depends on your expectations and the way you work. mike", "sortedWord": "None", "Identifyer": null, "identifyer": 37784, "year": "2011"}, {"autor": "menos I M6", "date": "2011-02-06 05:09:00", "content": "… Maybe the designers did not make it a priority to make a short gap because they were designers, not photographers. Only a photographer would know how a perceptible pre-flash would ruin a shot. Let's face it, some genius designer came up with the utterly worthless red eye reduction! So here's my conclusion. If you need to shoot people photos with the M9 and flash on the camera and don't want to have them blinking, don't use TTL with the M9. Other techniques (off camera) and methods (auto mode) seem to work better. I'm just trying to put this out there so that when the next person finds this thread while trying to decide whether to buy this flash, and what it is capable of will have the information. I am not a guy who spends a lot of time reading or posting on forums, I just go when I need information. The TTL is not working for me. Whether it works for you depends on your expectations and the way you work. Mike Mike, I don't think, somebody let the intern design the Leica variant of TTL flashes or the cameras circuitry, to communicate. We are talking about Metz, a company, which does flash for quite a time and Leica, a renowned lens, camera and fashion maker, not Sony. The way, I see the lack in the Leica flashes, compared to Canon and Nikon products is just this: flash is an afterthought in development for the Leica M. Not the majority of Leica M users uses flash, if TTL flash at all. Flash has no priority. For Canon and Nikon, flash is essential. The pro cameras, which are sold to big extends to professional users as journalists, sports shooters and alike need the best performance out of strobes - there is a strong market need AND A RACE between the two companies, to improve their already market leading performance. Why should Leica pair with Metz and compete with the performance of Canon and Nikon with flash? It is not Leica's main market. That time was in the 50's. And even back then, the M was not the big rig, to shoot with bulbs (it could be done, and some did), but it's reason of being was small size, but excellent quality on the negative paired with simple operation. The people, who might want to use TTL flash opposed to manual or Auto flash want a quick shot, be it out of convenience or out of quick changing lighting conditions. It is like it is and the SF58 is the best solution, if one needs TTL on a Leica (the only others being a set of Metz items or the SF24D). I use Nikon and love the simple fully automated and spot on Nikon metering and TTL flash, when I want it (again: convenience for me) or the excellent ergonomics, when needed in manual modes (product shots). I bought the SF58, to expand the poor low light performance of the M8.2 sensor, to use lower ISO in very dark scenes. It does the job - sort of (still learning/ fighting).", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/8/?tab=comments#comment-1579602", "origin": "L-forum", "suborigin": "99414-reidreview-review-of-leica-sf58-flash-unit", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "… maybe the designers did not make it a priority to make a short gap because they were designers, not photographers. only a photographer would know how a perceptible pre-flash would ruin a shot. let's face it, some genius designer -----> came !!!  -----> up !!!  -----> with !!!  the utterly worthless red eye reduction! so here's my conclusion. if you need to shoot people photos with the m9 and flash on the camera and don't want to have them blinking, don't use ttl with the m9. other techniques (off camera) and methods (auto mode) seem to work better. i'm just trying to put this out there so that when the next person finds this thread while trying to decide whether to buy this flash, and what it is capable of will have the information. i am not a guy who spends a lot of time reading or posting on forums, i just go when i need information. the ttl is not working for me. whether it works for you depends on your expectations and the way you work. mike mike, i don't think, somebody let the intern design the leica variant of ttl flashes or the cameras circuitry, to communicate. we are talking about metz, a company, which does flash for quite a time and leica, a renowned lens, camera and fashion maker, not sony. the way, i see the lack in the leica flashes, compared to canon and nikon products is just this: flash is an afterthought in development for the leica m. not the majority of leica m users uses flash, if ttl flash at all. flash has no priority. for canon and nikon, flash is essential. the pro cameras, which are sold to big extends to professional users as journalists, sports shooters and alike need the best performance out of strobes - there is a strong market need and a race between the two companies, to improve their already market leading performance. why should leica pair with metz and compete with the performance of canon and nikon with flash? it is not leica's main market. that time was in the 50's. and even back then, the m was not the big rig, to shoot with bulbs (it could be done, and some did), but it's reason of being was small size, but excellent quality on the negative paired with simple operation. the people, who might want to use ttl flash opposed to manual or auto flash want a quick shot, be it out of convenience or out of quick changing lighting conditions. it is like it is and the sf58 is the best solution, if one needs ttl on a leica (the only others being a set of metz items or the sf24d). i use nikon and love the simple fully automated and spot on nikon metering and ttl flash, when i want it (again: convenience for me) or the excellent ergonomics, when needed in manual modes (product shots). i bought the sf58, to expand the poor low light performance of the m8.2 sensor, to use lower iso in very dark scenes. it does the job - sort of (still learning/ fighting).", "sortedWord": "None", "Identifyer": null, "identifyer": 37785, "year": "2011"}, {"autor": "Guest Ming Rider", "date": "2011-09-19 22:19:00", "content": "Put your dot in a glass with acetone. Wait a night, clean it and you will have a silver Leica dot. Almost a M8P --img--  --img--  I'm not claiming that I came up with the Silver M8 with Silver dot but since I posted a picture of my M8 with Silver dot earlier in the year, I've seen a few appearing. It certainly adds a certain style to the camera. So yes I quite agree. Maybe we should call it an M8-P and in the same breath make a mockery of Leica charging another 500 quid for an M9-P.", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/3/?tab=comments#comment-1797149", "origin": "L-forum", "suborigin": "160294-still-loving-the-m8", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "put your dot in a glass with acetone. wait a night, clean it and you will have a silver leica dot. almost a m8p --img--  --img--  i'm not claiming that i -----> came !!!  -----> up !!!  -----> with !!!  the silver m8 -----> with !!!  silver dot but since i posted a picture of my m8 -----> with !!!  silver dot earlier in the year, i've seen a few appearing. it certainly adds a certain style to the camera. so yes i quite agree. maybe we should call it an m8-p and in the same breath make a mockery of leica charging another 500 quid for an m9-p.", "sortedWord": "None", "Identifyer": null, "identifyer": 42685, "year": "2011"}, {"autor": "phancj", "date": "2011-04-26 10:32:00", "content": "Andy, It's probably coz I was doing that for a while with few dozen photos. I wear corrective glasses already. The first dozen or so photos were fun, after that it was blah! no fun at all. I wished leica came up with the rumored R-solution at photokina but they didnt, so I went on to invest in more nikon primes. CJ Edited April 26, 2011 by phancj", "link": "https://www.l-camera-forum.com/topic/148703-the-x1-now-an-amazing-street-photography-machine/page/4/?tab=comments#comment-1656001", "origin": "L-forum", "suborigin": "148703-the-x1-now-an-amazing-street-photography-machine", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "andy, it's probably coz i was doing that for a while with few dozen photos. i wear corrective glasses already. the first dozen or so photos were fun, after that it was blah! no fun at all. i wished leica -----> came !!!  -----> up !!!  -----> with !!!  the rumored r-solution at photokina but they didnt, so i went on to invest in more nikon primes. cj edited april 26, 2011 by phancj", "sortedWord": "None", "Identifyer": null, "identifyer": 10485, "year": "2011"}, {"autor": "Olsen", "date": "2011-06-23 22:26:00", "content": "Michael has asked me if I will try to present a 'photo from above'. Hum! Give me some hours and I will come up with something. (Hum! A very exiting task!)", "link": "https://www.l-camera-forum.com/topic/150062-the-world-from-above-game-thread/page/5/?tab=comments#comment-1712820", "origin": "L-forum", "suborigin": "150062-the-world-from-above-game-thread", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "michael has asked me if i will try to present a 'photo from above'. hum! give me some hours and i will -----> come !!!  -----> up !!!  -----> with !!!  something. (hum! a very exiting task!)", "sortedWord": "None", "Identifyer": null, "identifyer": 49771, "year": "2011"}, {"autor": "d2mini", "date": "2011-03-20 04:04:00", "content": " d2mini,I can't find your bag, the 5123D, in TUMI's web page... Maybe it's discontinued. In any case, I like your solution very much. Thanks for sharing! Manolo Yes, while google searching for it just to get the right name/model number, it appeared to me as well that it is probably discontinued. Tumi seems to like to keep coming up with new designs so I guess the older stuff has to go. I bought this bag early 2008 so it is a few years old now. But I'm sure they must have current bags that would work just as well if not better. If it helps any, the exterior dimensions of this bag are around 11\" x 11\" x 3.5\".", "link": "https://www.l-camera-forum.com/topic/146103-repurposed-tumi-5123d-t-tech-bag/?tab=comments#comment-1620140", "origin": "L-forum", "suborigin": "146103-repurposed-tumi-5123d-t-tech-bag", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": " d2mini,i can't find your bag, the 5123d, in tumi's web page... maybe it's discontinued. in any case, i like your solution very much. thanks for sharing! manolo yes, while google searching for it just to get the right name/model number, it appeared to me as well that it is probably discontinued. tumi seems to like to keep -----> coming !!!  -----> up !!!  -----> with !!!  new designs so i guess the older stuff has to go. i bought this bag early 2008 so it is a few years old now. but i'm sure they must have current bags that would work just as well if not better. if it helps any, the exterior dimensions of this bag are around 11\" x 11\" x 3.5\".", "sortedWord": "None", "Identifyer": null, "identifyer": 83496, "year": "2011"}, {"autor": "mafoofan", "date": "2011-11-30 20:32:00", "content": " In anticipation of receiving my new, special order MP in a couple of weeks, I thought it might be fun to discuss how you have engraved or would engrave your own camera. I tortured myself over how to have Leica engrave my name, and ultimately came up with this: --img--  The top is engraved like the regular MP (just \"Leica\" and the serial number). Typically, the back says \"LEICA CAMERA MADE IN GERMANY.\" I deleted \"LEICA CAMERA\" as I thought it was redundant and shifted \"MADE IN GERMANY\" all the way to the right, so that it is aligned with the edge of the back door. I put my first initial and last name, \"M. FAN,\" on the same level, but put it all the way to the left, aligned with the vertical tangent of the viewfinder eyepiece. I aligned both pieces of text on opposite sides for visual balance and to create enough space so that it wouldn't look like \"M. FAN MADE IN GERMANY.\" For reference, here is the standard back engraving: --img--  I thought about eliminating \"MADE IN GERMANY,\" too, but felt that the camera ought to have its place of origin stated somewhere. Had I gone with the traditional three-line engraving on top, I would have done so and put my name on the right side. I went with \"M. FAN\" instead of my full name because I thought it seemed more professional and business-like. For what it's worth, my contact in Solms loved the way I set things up. A frivolous topic of discussion, I know, but is there anything wrong with that? Cheers! Edited November 30, 2011 by mafoofan", "link": "https://www.l-camera-forum.com/topic/167572-how-would-you-engrave-your-leica/?tab=comments#comment-1858660", "origin": "L-forum", "suborigin": "167572-how-would-you-engrave-your-leica", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " in anticipation of receiving my new, special order mp in a couple of weeks, i thought it might be fun to discuss how you have engraved or would engrave your own camera. i tortured myself over how to have leica engrave my name, and ultimately -----> came !!!  -----> up !!!  -----> with !!!  this: --img--  the top is engraved like the regular mp (just \"leica\" and the serial number). typically, the back says \"leica camera made in germany.\" i deleted \"leica camera\" as i thought it was redundant and shifted \"made in germany\" all the way to the right, so that it is aligned with the edge of the back door. i put my first initial and last name, \"m. fan,\" on the same level, but put it all the way to the left, aligned with the vertical tangent of the viewfinder eyepiece. i aligned both pieces of text on opposite sides for visual balance and to create enough space so that it wouldn't look like \"m. fan made in germany.\" for reference, here is the standard back engraving: --img--  i thought about eliminating \"made in germany,\" too, but felt that the camera ought to have its place of origin stated somewhere. had i gone with the traditional three-line engraving on top, i would have done so and put my name on the right side. i went with \"m. fan\" instead of my full name because i thought it seemed more professional and business-like. for what it's worth, my contact in solms loved the way i set things up. a frivolous topic of discussion, i know, but is there anything wrong with that? cheers! edited november 30, 2011 by mafoofan", "sortedWord": "None", "Identifyer": null, "identifyer": 87138, "year": "2011"}, {"autor": "mafoofan", "date": "2011-12-01 17:50:00", "content": "Thanks for that reference, Jaap. Here is the standard factory engraving used on M3s (courtesy of http://www.mir.com.my/rb/photography/companies/Leica/index.htm): --img--  In this case, the camera was personalized for Alfred Eisenstaedt. However, the engraving was done the same way for employee cameras and the format was used by Leica up through the M6. I have not seen a standardized format for the M7 or MP, as the regular A la Carte options put the engraving elsewhere. So, my dilemma was whether to stick with the M3-style engraving on the back, or come up with a new format to fit the newer style camera. I chose the latter, as the contemporary MP is not typically engraved like the M3, which includes \"WETZLAR, GERMANY\" on the top of the top plate. Newer models without the classic M3-style engraving on top have always had \"MADE IN GERMANY\" or \"GERMANY\" engraved on the back. Also, the engraved text on the backs of newer Ms is typically aligned against the bottom of the top plate, as opposed to being vertically centered. So, since my MP only says \"LEICA\" on top, I felt it more \"regular\" to go with my modified setup. One thing is for sure: I really can't stand the inclusion of \"LEICA CAMERA\" on the back. In any event, it is redundant branding. Edited December 1, 2011 by mafoofan", "link": "https://www.l-camera-forum.com/topic/167572-how-would-you-engrave-your-leica/?tab=comments#comment-1859363", "origin": "L-forum", "suborigin": "167572-how-would-you-engrave-your-leica", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "thanks for that reference, jaap. here is the standard factory engraving used on m3s (courtesy of http://www.mir.com.my/rb/photography/companies/leica/index.htm): --img--  in this case, the camera was personalized for alfred eisenstaedt. however, the engraving was done the same way for employee cameras and the format was used by leica up through the m6. i have not seen a standardized format for the m7 or mp, as the regular a la carte options put the engraving elsewhere. so, my dilemma was whether to stick -----> with !!!  the m3-style engraving on the back, or -----> come !!!  -----> up !!!  -----> with !!!  a new format to fit the newer style camera. i chose the latter, as the contemporary mp is not typically engraved like the m3, which includes \"wetzlar, germany\" on the top of the top plate. newer models without the classic m3-style engraving on top have always had \"made in germany\" or \"germany\" engraved on the back. also, the engraved text on the backs of newer ms is typically aligned against the bottom of the top plate, as opposed to being vertically centered. so, since my mp only says \"leica\" on top, i felt it more \"regular\" to go with my modified setup. one thing is for sure: i really can't stand the inclusion of \"leica camera\" on the back. in any event, it is redundant branding. edited december 1, 2011 by mafoofan", "sortedWord": "None", "Identifyer": null, "identifyer": 87157, "year": "2011"}, {"autor": "menos I M6", "date": "2011-05-25 09:49:00", "content": "Thank you all for making me feel very welcome. It's a bit of a refreshing culture shock coming from the slanging matches in the other forums --img--  If you are interested here is my website. Wedding Photography Sydney Ben Newnam - Wedding Photographers Sydney North Shore See if you think the Leica system will suit my style. Always open to constructive critisism. Cheers, Ben Ben, from what I see of your photographs on your site, you will surely love the Leica system! My guess is,that your biggest issues will come up with framing wide angle lenses. It takes a little time, to learn at which approximate distances your framing is where. Manual focus will come natural pretty quickly and the portraiture sure will net great results. (Here your biggest issues might come at first, to get used, to focus manually open apertures without your subject getting tired of your camera ;-) ). If you work flash, make sure, to be firm with manual or auto flash settings and off camera work - this will save you some money, instead of springing for a set of ultra expensive Leica branded strobes - just use your old flash system with radio controllers or compatible cords. Don't retire your Canon yet, if possible - there might be something, you want to keep it for - didn't see anything, the Leica M could not do in the shots on your site. For the presented shots, a Noctilux is not mandatory - would be just a cherry on the pie - a very expensive one albeit.", "link": "https://www.l-camera-forum.com/topic/152375-pros-and-cons-of-the-noctilux-095-and-50mm-summilux-14/page/2/?tab=comments#comment-1681995", "origin": "L-forum", "suborigin": "152375-pros-and-cons-of-the-noctilux-095-and-50mm-summilux-14", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "thank you all for making me feel very welcome. it's a bit of a refreshing culture shock coming from the slanging matches in the other forums --img--  if you are interested here is my website. wedding photography sydney ben newnam - wedding photographers sydney north shore see if you think the leica system will suit my style. always open to constructive critisism. cheers, ben ben, from what i see of your photographs on your site, you will surely love the leica system! my guess is,that your biggest issues will -----> come !!!  -----> up !!!  -----> with !!!  framing wide angle lenses. it takes a little time, to learn at which approximate distances your framing is where. manual focus will come natural pretty quickly and the portraiture sure will net great results. (here your biggest issues might come at first, to get used, to focus manually open apertures without your subject getting tired of your camera ;-) ). if you work flash, make sure, to be firm with manual or auto flash settings and off camera work - this will save you some money, instead of springing for a set of ultra expensive leica branded strobes - just use your old flash system with radio controllers or compatible cords. don't retire your canon yet, if possible - there might be something, you want to keep it for - didn't see anything, the leica m could not do in the shots on your site. for the presented shots, a noctilux is not mandatory - would be just a cherry on the pie - a very expensive one albeit.", "sortedWord": "None", "Identifyer": null, "identifyer": 87514, "year": "2011"}, {"autor": "Red Dot Fever", "date": "2011-05-25 12:57:00", "content": " Ben, from what I see of your photographs on your site, you will surely love the Leica system!My guess is,that your biggest issues will come up with framing wide angle lenses. It takes a little time, to learn at which approximate distances your framing is where. Manual focus will come natural pretty quickly and the portraiture sure will net great results. (Here your biggest issues might come at first, to get used, to focus manually open apertures without your subject getting tired of your camera ;-) ). If you work flash, make sure, to be firm with manual or auto flash settings and off camera work - this will save you some money, instead of springing for a set of ultra expensive Leica branded strobes - just use your old flash system with radio controllers or compatible cords. Don't retire your Canon yet, if possible - there might be something, you want to keep it for - didn't see anything, the Leica M could not do in the shots on your site. For the presented shots, a Noctilux is not mandatory - would be just a cherry on the pie - a very expensive one albeit. Thanks for the tips Menos. Like you said, won't be retiring the Nikon anytime soon especially for wedding work. I wouldn't go 100% Leica until I knew it inside out like I do my Nikon. Besides I do shoot a hell of a lot at 200mm at f2 and from what I have read any length past 90mm on a Leica is extremely hard to nail focus. I do love the thought of the 75mm Cron though with a closer focusing than my Nikon 85mm 1.4. Not that the Nikon 85mm 1.4 is renowned for close focusing. I know the 75mm Cron is very close to the 50mm Lux in terms of focal length but I feel I could use them in totally different ways. Cheers, Ben Edited May 25, 2011 by Red Dot Fever", "link": "https://www.l-camera-forum.com/topic/152375-pros-and-cons-of-the-noctilux-095-and-50mm-summilux-14/page/2/?tab=comments#comment-1682191", "origin": "L-forum", "suborigin": "152375-pros-and-cons-of-the-noctilux-095-and-50mm-summilux-14", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " ben, from what i see of your photographs on your site, you will surely love the leica system!my guess is,that your biggest issues will -----> come !!!  -----> up !!!  -----> with !!!  framing wide angle lenses. it takes a little time, to learn at which approximate distances your framing is where. manual focus will come natural pretty quickly and the portraiture sure will net great results. (here your biggest issues might come at first, to get used, to focus manually open apertures without your subject getting tired of your camera ;-) ). if you work flash, make sure, to be firm with manual or auto flash settings and off camera work - this will save you some money, instead of springing for a set of ultra expensive leica branded strobes - just use your old flash system with radio controllers or compatible cords. don't retire your canon yet, if possible - there might be something, you want to keep it for - didn't see anything, the leica m could not do in the shots on your site. for the presented shots, a noctilux is not mandatory - would be just a cherry on the pie - a very expensive one albeit. thanks for the tips menos. like you said, won't be retiring the nikon anytime soon especially for wedding work. i wouldn't go 100% leica until i knew it inside out like i do my nikon. besides i do shoot a hell of a lot at 200mm at f2 and from what i have read any length past 90mm on a leica is extremely hard to nail focus. i do love the thought of the 75mm cron though with a closer focusing than my nikon 85mm 1.4. not that the nikon 85mm 1.4 is renowned for close focusing. i know the 75mm cron is very close to the 50mm lux in terms of focal length but i feel i could use them in totally different ways. cheers, ben edited may 25, 2011 by red dot fever", "sortedWord": "None", "Identifyer": null, "identifyer": 87519, "year": "2011"}, {"autor": "George James", "date": "2011-11-03 06:29:00", "content": "Tim, It appears that the 26th would have suited most. As I don't live in London, I was hoping either David (viramati) or another member more familiar with the area, would come up with a suitable venue in central London.", "link": "https://www.l-camera-forum.com/topic/164729-london-meet/page/2/?tab=comments#comment-1833331", "origin": "L-forum", "suborigin": "164729-london-meet", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "tim, it appears that the 26th would have suited most. as i don't live in london, i was hoping either david (viramati) or another member more familiar -----> with !!!  the area, would -----> come !!!  -----> up !!!  -----> with !!!  a suitable venue in central london.", "sortedWord": "None", "Identifyer": null, "identifyer": 137934, "year": "2011"}], "name": "Leicasortedout2011with"}