{"interestingcomments": [{"autor": "fotografr", "date": "2013-09-17 16:15:00", "content": "At the same time, I have been able to work around it fairly well once it got figured out. And that's really all that matters. My desire in starting this thread wasn't to give Leica another black eye--just to figure out what the problem was and what to do about it. This would seem to be a pretty easy and inexpensive solution. I'm still absolutely delighted with my M Monochrom. The prints I've made from my last trip are exquisite.", "link": "https://www.l-camera-forum.com/topic/212964-monochrom-long-exposure-issue/page/2/?tab=comments#comment-2423121", "origin": "L-forum", "suborigin": "212964-monochrom-long-exposure-issue", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "at the same time, i have been able to work around it fairly well once it got figured out. and that's really all that matters. my desire in starting this thread wasn't to give leica another black eye--just to figure out what the problem was and what to do about it. this would seem to be a pretty easy and inexpensive solution. i'm still absolutely delighted with my m monochrom. the prints -----> i !!! 've -----> made !!!  from my last trip are exquisite.", "sortedWord": "None", "Identifyer": null, "identifyer": 35415, "year": "2013"}, {"autor": "Dhuff", "date": "2013-03-15 22:10:00", "content": "Hello Colleagues, I have enjoyed looking through several of these portfolios. I am relatively new to Leica and the forum but, while waiting for the M with idle glass, I did have the opportunity to shoot with both the M9-P and MM. You can see the photographs I made with each at www.davidmhuff.com under sub-menus \"Leica M9-P Yosemite 2013\" and \"Leica Monochrom M 2013\". Regards, David", "link": "https://www.l-camera-forum.com/topic/97907-collecting-leica-m9-sites/page/11/?tab=comments#comment-2272721", "origin": "L-forum", "suborigin": "97907-collecting-leica-m9-sites", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "hello colleagues, i have enjoyed looking through several of these portfolios. i am relatively new to leica and the forum but, while waiting for the m with idle glass, i did have the opportunity to shoot with both the m9-p and mm. you can see the photographs -----> i !!!  -----> made !!!  with each at www.davidmhuff.com under sub-menus \"leica m9-p yosemite 2013\" and \"leica monochrom m 2013\". regards, david", "sortedWord": "None", "Identifyer": null, "identifyer": 36813, "year": "2013"}, {"autor": "JimKasson", "date": "2013-09-23 04:13:00", "content": "Under exposing and pushing in post will give similar results as film in that the highlights are pushed more compared to the shadows and you end up with a more contrasty image than if you crank up the ISO in camera. I prefer this look for nighttime shots since it feels more real, but be careful when you shoot portraits etc. - you can quickly end up with harsh looking skin tones and dark eye sockets. Let's make sure we're talking about the same thing. I'm talking about pushing raw files. Pushing JPEGs very far usually ends in tears. Also, I\"m talking about Lr PV2010 and PV2012. Although I've seen similar results with other raw converters, it will greatly clarify the discussion if we can settle on a few. That said, it has been my experience that. wrt contrast, PV2010 Exposure control moves rather faithfully mimic what you'd see by making equivalent adjustments to the in-camera ISO control, and that PV2012 performs much the same in the linear region, and actually reduces contrast in the highlights. Proof? If you're a visual person, take a look here. These are D800E images, and were made to illustrate noise performance, but they can yield contrast information as well. Here is a similar series with the M9. If you want to see M240 images, green shadows and all, look here and here. If you have more of an analytical bent, look here. Jim", "link": "https://www.l-camera-forum.com/topic/213316-m9-iso-performance-new-life/?tab=comments#comment-2426755", "origin": "L-forum", "suborigin": "213316-m9-iso-performance-new-life", "result": true, "Selector": "'s make", "selectorShort": "make", "MarkedSent": "under exposing and pushing in post will give similar results as film in that the highlights are pushed more compared to the shadows and you end up with a more contrasty image than if you crank up the iso in camera. i prefer this look for nighttime shots since it feels more real, but be careful when you shoot portraits etc. - you can quickly end up with harsh looking skin tones and dark eye sockets. let-----> 's !!!  -----> make !!!  sure we're talking about the same thing. i'm talking about pushing raw files. pushing jpegs very far usually ends in tears. also, i\"m talking about lr pv2010 and pv2012. although i've seen similar results with other raw converters, it will greatly clarify the discussion if we can settle on a few. that said, it has been my experience that. wrt contrast, pv2010 exposure control moves rather faithfully mimic what you'd see by making equivalent adjustments to the in-camera iso control, and that pv2012 performs much the same in the linear region, and actually reduces contrast in the highlights. proof? if you're a visual person, take a look here. these are d800e images, and were made to illustrate noise performance, but they can yield contrast information as well. here is a similar series with the m9. if you want to see m240 images, green shadows and all, look here and here. if you have more of an analytical bent, look here. jim", "sortedWord": "None", "Identifyer": null, "identifyer": 38907, "year": "2013"}, {"autor": "Guest malland", "date": "2013-09-26 06:43:00", "content": "...pushing ISO 640 does have some advantage, but marginal...In my experience it's anything but marginal, providing not only somewhat less noise but also greater dynamic range. And setting the exposure in the post-processing is a great advantage for night photography in dark streets with disparate types of bright lights from various directions, when metering can be problematic, particularly with wide-angle lenses, such as in the two pictures below. Indeed, rather than being marginal, I think that the \"Shoot at ISO 640 and push in post\" post technique transforms the M9 into an excellent high-ISO camera, considering also its color rendition. With regard to CaptureOne vs LR5, the latter's new Radial Tool can be used easily for dodging, which I've done on the main subjects in the pictures below (using the Exposure rather than the Shadow slider) — as far as I know Capture One has no tool for dodging and burning. (Sorry for reposting these pictures here, but I feel that the point I'm making his to be made with showing examples of what I'm stating.) M9-P | Elmarit-21 ASPH | ISO 640 pushed 1.7 stops on main subject | f/2.8 | 1/45 sec --img-- Bangkok M9-P | Elmarit-21 ASPH | ISO 640 pushed 4.2 stops on main subject | f/4.0 | 1/60 sec --img-- Bangkok —Mitch/Paris Tristes Tropiques [WIP] Edited September 26, 2013 by malland", "link": "https://www.l-camera-forum.com/topic/213316-m9-iso-performance-new-life/page/3/?tab=comments#comment-2428739", "origin": "L-forum", "suborigin": "213316-m9-iso-performance-new-life", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "...pushing iso 640 does have some advantage, but marginal...in my experience it's anything but marginal, providing not only somewhat less noise but also greater dynamic range. and setting the exposure in the post-processing is a great advantage for night photography in dark streets with disparate types of bright lights from various directions, when metering can be problematic, particularly with wide-angle lenses, such as in the two pictures below. indeed, rather than being marginal, i think that the \"shoot at iso 640 and push in post\" post technique transforms the m9 into an excellent high-iso camera, considering also its color rendition. with regard to captureone vs lr5, the latter's new radial tool can be used easily for dodging, which i've done on the main subjects in the pictures below (using the exposure rather than the shadow slider) — as far as i know capture one has no tool for dodging and burning. (sorry for reposting these pictures here, but -----> i !!!  feel that the point -----> i !!! 'm -----> making !!!  his to be made with showing examples of what -----> i !!! 'm stating.) m9-p | elmarit-21 asph | iso 640 pushed 1.7 stops on main subject | f/2.8 | 1/45 sec --img-- bangkok m9-p | elmarit-21 asph | iso 640 pushed 4.2 stops on main subject | f/4.0 | 1/60 sec --img-- bangkok —mitch/paris tristes tropiques [wip] edited september 26, 2013 by malland", "sortedWord": "None", "Identifyer": null, "identifyer": 38943, "year": "2013"}, {"autor": "Guest malland", "date": "2013-10-01 11:20:00", "content": "Come now, Erl, if you haven't used LR for several years your statement is not helpful to anyone, considering that there have been great improvements even just last year: as Jim Kasson states on the first page of this thread, LR4 and LR5 use process PV2012, which compresses like film rather than clipping highlights — a big improvement over the earlier process PV2010. Also, LR5 has a new Radial Filter tool that is very good for dodging and burning. As for me, I haven't used C1 for some three years, so I would not make any comparative claim. —Mitch/Paris Tristes Tropiques [WIP]", "link": "https://www.l-camera-forum.com/topic/213316-m9-iso-performance-new-life/page/4/?tab=comments#comment-2432079", "origin": "L-forum", "suborigin": "213316-m9-iso-performance-new-life", "result": true, "Selector": "i would not make", "selectorShort": "make", "MarkedSent": "come now, erl, if you haven't used lr for several years your statement is not helpful to anyone, considering that there have been great improvements even just last year: as jim kasson states on the first page of this thread, lr4 and lr5 use process pv2012, which compresses like film rather than clipping highlights — a big improvement over the earlier process pv2010. also, lr5 has a new radial filter tool that is very good for dodging and burning. as for me, -----> i !!!  haven't used c1 for some three years, so -----> i !!!  -----> would !!!  -----> not !!!  -----> make !!!  any comparative claim. —mitch/paris tristes tropiques [wip]", "sortedWord": "None", "Identifyer": null, "identifyer": 38960, "year": "2013"}, {"autor": "erl", "date": "2013-10-01 23:34:00", "content": "Come now, Erl, if you haven't used LR for several years your statement is not helpful to anyone, considering that there have been great improvements even just last year: as Jim Kasson states on the first page of this thread, LR4 and LR5 use process PV2012, which compresses like film rather than clipping highlights — a big improvement over the earlier process PV2010. Also, LR5 has a new Radial Filter tool that is very good for dodging and burning. As for me, I haven't used C1 for some three years, so I would not make any comparative claim. —Mitch/Paris Tristes Tropiques [WIP] Fair go Mitch, I was not trying to be helful to anyone. I was simply stating a preference, which I carefully qualified. My choice was based on comparison at the time. Based on later posts in this thread, it seems the comparison has not really changed much. Both softwares have clearly improved. I am not interested in constantly comparing software. I am perfectly happy with C1. Even if LR is better, the drag of changing over has no appeal. I suggest it's a bit like saying Kodak film is better than Fuji! --img-- It's really only a matter taste. Edited October 1, 2013 by erl", "link": "https://www.l-camera-forum.com/topic/213316-m9-iso-performance-new-life/page/4/?tab=comments#comment-2432566", "origin": "L-forum", "suborigin": "213316-m9-iso-performance-new-life", "result": true, "Selector": "i would not make", "selectorShort": "make", "MarkedSent": "come now, erl, if you haven't used lr for several years your statement is not helpful to anyone, considering that there have been great improvements even just last year: as jim kasson states on the first page of this thread, lr4 and lr5 use process pv2012, which compresses like film rather than clipping highlights — a big improvement over the earlier process pv2010. also, lr5 has a new radial filter tool that is very good for dodging and burning. as for me, -----> i !!!  haven't used c1 for some three years, so -----> i !!!  -----> would !!!  -----> not !!!  -----> make !!!  any comparative claim. —mitch/paris tristes tropiques [wip] fair go mitch, i was not trying to be helful to anyone. i was simply stating a preference, which i carefully qualified. my choice was based on comparison at the time. based on later posts in this thread, it seems the comparison has not really changed much. both softwares have clearly improved. i am not interested in constantly comparing software. i am perfectly happy with c1. even if lr is better, the drag of changing over has no appeal. i suggest it's a bit like saying kodak film is better than fuji! --img-- it's really only a matter taste. edited october 1, 2013 by erl", "sortedWord": "None", "Identifyer": null, "identifyer": 38964, "year": "2013"}, {"autor": "bla", "date": "2013-11-14 22:19:00", "content": " Hello fellow M8 users, I am very happy to announce that I finished the tool mentioned in the thread M8 goes uncompressed DNG! It creates 16bit (acually 14bit in a 16bit container) DNG files from the M8 RAW files with slightly more pixels and much more discrete values compared to the 8bit standard DNG. I even set up a website with download, comment function, contact form and whatnot... even though I am really not familiar with web programming so please be lenient if it is not as polished as this site here for example. --img--  The command-line tool is available for Windows, Mac OS X and Linux, so I am now looking forward to getting some input after you tested it on your own files. You can find more information on m8raw2dng.de. I am trying to make the program as good as possible (because I am using it myself on a daily basis). To achieve this I thought it clever to share it with the community even though I had to create a completely new software from scratch in C++ even though I already have a running version in Matlab with more functionality. But I think that'll change as I focus now on the C++ version. I invite you to share this information with other M8 users on other forums, flickr groups, wherever you like. Have fun and good results, --img--  Arvid", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/?tab=comments#comment-2465824", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "i am trying to make", "selectorShort": "make", "MarkedSent": " hello fellow m8 users, i am very happy to announce that i finished the tool mentioned in the thread m8 goes uncompressed dng! it creates 16bit (acually 14bit in a 16bit container) dng files from the m8 raw files with slightly more pixels and much more discrete values compared to the 8bit standard dng. i even set up a website with download, comment function, contact form and whatnot... even though i am really not familiar with web programming so please be lenient if it is not as polished as this site here for example. --img--  the command-line tool is available for windows, mac os x and linux, so i am now looking forward to getting some input after you tested it on your own files. you can find more information on m8raw2dng.de. -----> i !!!  -----> am !!!  -----> trying !!!  -----> to !!!  -----> make !!!  the program as good as possible (because -----> i !!!  -----> am !!!  using it myself on a daily basis). to achieve this i thought it clever to share it with the community even though i had to create a completely new software from scratch in c++ even though i already have a running version in matlab with more functionality. but i think that'll change as i focus now on the c++ version. i invite you to share this information with other m8 users on other forums, flickr groups, wherever you like. have fun and good results, --img--  arvid", "sortedWord": "None", "Identifyer": null, "identifyer": 41510, "year": "2013"}, {"autor": "AncientCityPhoto", "date": "2013-11-19 12:55:00", "content": "I can't wait to try! I'll make sure my sensor is cleaner too!", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/3/?tab=comments#comment-2468982", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "i'll make", "selectorShort": "make", "MarkedSent": "i can't wait to try! -----> i !!! -----> 'll !!!  -----> make !!!  sure my sensor is cleaner too!", "sortedWord": "None", "Identifyer": null, "identifyer": 41557, "year": "2013"}, {"autor": "AncientCityPhoto", "date": "2013-11-20 20:30:00", "content": "The magenta is gone! I have made some shots as well. So far I am not taking any kind of measurements...but going based on the look and critically examining based on my experience..this is what I see: 1. Low ISOs do not seem too different. ISO160 DNG and RAW seem virtually identical. There is a slight difference in color tone...very slight. RAWs are slightly cooler, more greenish. Negligible difference in real use. Easily adjustable in normal processing. 2. ISO 2500 has much less color noise, and overall tighter, smaller looking grain pattern. It seems a bit less as well. Definitely usable. Then again, ISO 2500 has always been usable, and looked fine on the M8...if conditions and exposure were correct. So far so good, but nothing revolutionary. I don't want anyone thinking they are turning their M8 into a D800 in terms of dynamic range and high ISO gains. 3. Dead pixel line is still present in RAW, but non-existant in the standard DNG.", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/3/?tab=comments#comment-2470023", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "the magenta is gone! -----> i !!!  -----> have !!!  -----> made !!!  some shots as well. so far i am not taking any kind of measurements...but going based on the look and critically examining based on my experience..this is what i see: 1. low isos do not seem too different. iso160 dng and raw seem virtually identical. there is a slight difference in color tone...very slight. raws are slightly cooler, more greenish. negligible difference in real use. easily adjustable in normal processing. 2. iso 2500 has much less color noise, and overall tighter, smaller looking grain pattern. it seems a bit less as well. definitely usable. then again, iso 2500 has always been usable, and looked fine on the m8...if conditions and exposure were correct. so far so good, but nothing revolutionary. i don't want anyone thinking they are turning their m8 into a d800 in terms of dynamic range and high iso gains. 3. dead pixel line is still present in raw, but non-existant in the standard dng.", "sortedWord": "None", "Identifyer": null, "identifyer": 41562, "year": "2013"}, {"autor": "satya", "date": "2013-09-13 16:12:00", "content": " I am loving my M8. The thumbs up is great with the 90mm Summicron and am getting better at using the long lens. (My 40 mm Summicron hopefully comes on Monday! --img-- ) So several times the camera almost slipped from my hand. I hate the M8 covering. After reading I decided on the Aki-Asahi leather skins. I used to make model kits and things- so covering the M would be fun. I know camera leather has great stuff - but for us in europe, it takes ages and duty etc. also it's more costly. maybe they will be for my future M9 or MM. Hmm or I could ship it to my sister in the US.. Not many photos on Asahi's site of the different kinds of leather. I was thinking of black lizard or one of the other ones. But not sure what the others look like. Anything like the vulcanite? Anyone use one of his skins and could show me a pic or two?", "link": "https://www.l-camera-forum.com/topic/212723-replacing-m8-covering-aki-asahi-any-one/?tab=comments#comment-2420132", "origin": "L-forum", "suborigin": "212723-replacing-m8-covering-aki-asahi-any-one", "result": true, "Selector": "i used to make", "selectorShort": "make", "MarkedSent": " i am loving my m8. the thumbs up is great with the 90mm summicron and am getting better at using the long lens. (my 40 mm summicron hopefully comes on monday! --img-- ) so several times the camera almost slipped from my hand. i hate the m8 covering. after reading i decided on the aki-asahi leather skins. -----> i !!!  -----> used !!!  -----> to !!!  -----> make !!!  model kits and things- so covering the m would be fun. i know camera leather has great stuff - but for us in europe, it takes ages and duty etc. also it's more costly. maybe they will be for my future m9 or mm. hmm or i could ship it to my sister in the us.. not many photos on asahi's site of the different kinds of leather. i was thinking of black lizard or one of the other ones. but not sure what the others look like. anything like the vulcanite? anyone use one of his skins and could show me a pic or two?", "sortedWord": "None", "Identifyer": null, "identifyer": 47206, "year": "2013"}, {"autor": "Sparkassenkunde", "date": "2013-04-11 15:05:00", "content": "I´m in. My M4-P just arrived after long weeks at the repair service. I am hopeful, that the dull weather here near Berlin goes by, so I may make use of that lovely cam. My bag is packed... --img-- ", "link": "https://www.l-camera-forum.com/topic/141350-i-love-my-m4/page/7/?tab=comments#comment-2296545", "origin": "L-forum", "suborigin": "141350-i-love-my-m4", "result": true, "Selector": "i may make", "selectorShort": "make", "MarkedSent": "i´m in. my m4-p just arrived after long weeks at the repair service. -----> i !!!  am hopeful, that the dull weather here near berlin goes by, so -----> i !!!  -----> may !!!  -----> make !!!  use of that lovely cam. my bag is packed... --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 35, "year": "2013"}, {"autor": "tri", "date": "2013-11-18 20:08:00", "content": "Oh Lord, would you buy me a MP3!? Fact is, it is like a white face among TLRs. No, it tops it, it's THE real beauty. Could have had one during the summer holiday of 2012. It had neither the matching LHSH lens nor the Leicavit. So probably having been sunstroke I thought: \"There's a best offer button. Why don't I make one?\" After the siesta it was gone. Oh Lord...", "link": "https://www.l-camera-forum.com/topic/77586-i-love-my-mp3/page/3/?tab=comments#comment-2468581", "origin": "L-forum", "suborigin": "77586-i-love-my-mp3", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "oh lord, would you buy me a mp3!? fact is, it is like a white face among tlrs. no, it tops it, it's the real beauty. could have had one during the summer holiday of 2012. it had neither the matching lhsh lens nor the leicavit. so probably having been sunstroke i thought: \"there's a best offer button. why don't -----> i !!!  -----> make !!!  one?\" after the siesta it was gone. oh lord...", "sortedWord": "None", "Identifyer": null, "identifyer": 2415, "year": "2013"}, {"autor": "tri", "date": "2013-11-04 17:59:00", "content": "My MP has arrived, and I must say I'm very pleased. It is smoother than my previous MP and feels tight and solid compared to my M2s. My M2's are smooth but somehow feel a little sloppy compared to the MP. Now to send it to Leica for some new clothes.Pete Now in case Pico comes around this thread --img--  ... I'm just gelous, because I'm an ignoramus, happy with any a black M6 TTL 0.85 that appeared a couple of years ago on ebay in a 50km radius and passed the functional test. Did I make any changes to them both? Yup: a winder underneath --img--  . Sorry if it makes you --img--  But my sincere congratulations to your new camera! Maybe one day... one day I'll graduate to be a connaisseur, too. Cheers, Simon", "link": "https://www.l-camera-forum.com/topic/215496-mp-vs-m4/page/3/?tab=comments#comment-2457704", "origin": "L-forum", "suborigin": "215496-mp-vs-m4", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "my mp has arrived, and i must say i'm very pleased. it is smoother than my previous mp and feels tight and solid compared to my m2s. my m2's are smooth but somehow feel a little sloppy compared to the mp. now to send it to leica for some new clothes.pete now in case pico comes around this thread --img--  ... i'm just gelous, because i'm an ignoramus, happy with any a black m6 ttl 0.85 that appeared a couple of years ago on ebay in a 50km radius and passed the functional test. did -----> i !!!  -----> make !!!  any changes to them both? yup: a winder underneath --img--  . sorry if it makes you --img--  but my sincere congratulations to your new camera! maybe one day... one day i'll graduate to be a connaisseur, too. cheers, simon", "sortedWord": "None", "Identifyer": null, "identifyer": 2477, "year": "2013"}, {"autor": "IWC Doppel", "date": "2013-08-18 21:38:00", "content": "I have been enjoying the 18mm, my first impressions, very tricky to get the perspective right and its very unforgiving of angles. Lovely and sharp, whilst you can pixel peek to see small improvements at f5.6, it's as good IMO at f3.8. I have also struggled using my 21/25 viewfinder and guessing round the edges. The DOF is amazing !!! I tried to see if I could make it flare, not a chance but a small reflection on Olives' leg pointing directly at the sun, incredible for resisting flare. Taking pictures in very close proximity is amazing too, much to Olive's dismay I pictured her whilst walking n holding the lead and whilst Jane put a plaster on outside the chemist. I have purposely not cropped any so you can see the distortion at edges with uneven angles (Jane has size 5 feet not 10 !) A few shots from the weekend in Bath with Jane and Olive having fun --img-- --img-- --img-- --img-- --img-- --img-- --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/200674-18mm-super-elmar/page/2/?tab=comments#comment-2400461", "origin": "L-forum", "suborigin": "200674-18mm-super-elmar", "result": true, "Selector": "i could make", "selectorShort": "make", "MarkedSent": "i have been enjoying the 18mm, my first impressions, very tricky to get the perspective right and its very unforgiving of angles. lovely and sharp, whilst you can pixel peek to see small improvements at f5.6, it's as good imo at f3.8. i have also struggled using my 21/25 viewfinder and guessing round the edges. the dof is amazing !!! -----> i !!!  tried to see if -----> i !!!  -----> could !!!  -----> make !!!  it flare, not a chance but a small reflection on olives' leg pointing directly at the sun, incredible for resisting flare. taking pictures in very close proximity is amazing too, much to olive's dismay i pictured her whilst walking n holding the lead and whilst jane put a plaster on outside the chemist. i have purposely not cropped any so you can see the distortion at edges with uneven angles (jane has size 5 feet not 10 !) a few shots from the weekend in bath with jane and olive having fun --img-- --img-- --img-- --img-- --img-- --img-- --img-- --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 18412, "year": "2013"}, {"autor": "efreed2754", "date": "2013-10-28 04:20:00", "content": "Sorry haven't used Nikon since 1971 when switched to Leica and never tried WATE. Did consider WATE and 18 and of course went with 18 and no regrets. In my research found most who use WATE did so at 16, the widest FL. Also was put off by the finder size and expense. With the M may have gone with WATE. Having the MATE also preferred single FL and not having to choose. Also preferred EXIF to reflect actual FL. Have a Leica 24 2.8 Elmarit which is a great lens, but too close to 18 so leave home for longer trips. Do use it often at concerts and for group shots and it has no distortion! Sorry can't be of any help with other lenses. While people speak glowingly of them, I'm in a Leica rut, and after they took care of my M9P this month they have continued to earn my loyalty over these years. Finally, honestly believe we can make use of any FL or lens over time. Just think unless unlimited funds, best to put some distance between lenses. Ed", "link": "https://www.l-camera-forum.com/topic/200674-18mm-super-elmar/page/4/?tab=comments#comment-2451874", "origin": "L-forum", "suborigin": "200674-18mm-super-elmar", "result": true, "Selector": "we can make", "selectorShort": "make", "MarkedSent": "sorry haven't used nikon since 1971 when switched to leica and never tried wate. did consider wate and 18 and of course went with 18 and no regrets. in my research found most who use wate did so at 16, the widest fl. also was put off by the finder size and expense. with the m may have gone with wate. having the mate also preferred single fl and not having to choose. also preferred exif to reflect actual fl. have a leica 24 2.8 elmarit which is a great lens, but too close to 18 so leave home for longer trips. do use it often at concerts and for group shots and it has no distortion! sorry can't be of any help with other lenses. while people speak glowingly of them, i'm in a leica rut, and after they took care of my m9p this month they have continued to earn my loyalty over these years. finally, honestly believe -----> we !!!  -----> can !!!  -----> make !!!  use of any fl or lens over time. just think unless unlimited funds, best to put some distance between lenses. ed", "sortedWord": "None", "Identifyer": null, "identifyer": 18446, "year": "2013"}, {"autor": "barjohn", "date": "2013-10-17 13:08:00", "content": "Brian, Back when I was younger I ran a small company with tens of thousands of customers, customers that paid no where near what Leica charges for its products and I answered almost every email personally. If I couldn't answer it, I made sure someone in my company answered it. It is part of what small companies can and should do to show their customers they care. I get so tired of the excuse for Leica that they can't do this or that because they are a small company. With 1,000 plus employees, they aren't that small. Sure compared to Sony or Nikon they are small, but they are plenty large enough to accomplish more. In fact, most small companies have the advantage of far less bureaucracy to deal with, quicker decision making ability, more innovative and nimble and thus faster to market with new and innovative products. Unless you have worked in both a small company and a large one, you can't appreciate the difference in having multiple layers of nay sayers all wanting to reduce risk and act as gate keepers. Smart managers in small companies know this and use it to their advantage in the battles against the bigger guys. Leica still operates like the world isn't changing and they really don't need to innovate and offer more and be quicker to respond. If the X Vario had been as bad as the M(240) with all of its problems, many that still haven't been fixed, I would have sent it back in the first 30 days. It is a great little camera with some serious issues that need to be fixed. I suspect that it is such a market failure, thanks to Leica's bungled marketing, that Leica may abandon it and the other X cameras. The clamor on this forum for an X with a fixed 50mm is an example of what leads Leica astray. Build an X with 50mm so they can sell all of 10? Had Leica made the X Vario a FF with an interchangeable lens, using the Olympus EV-4, EVF, and even with a slow zoom kept as close to the size of the current one, they would have had a market winner and the X series would still be in the game. How will the current X2 compete with the Sony A7 for $1,698 versus $2,000. Not very well would be my guess. The pictures I have seen on the web (from JPGs) are stunning. Skin tones look fantastic and they have a lot of pop. When people like Michael R at Luminous Landscape that are old Leica customers start leaving your brand it is time to start looking at what you are doing wrong. Unfortunately, I think the XV will drop in value considerably and I suspect M sales will also decline, so what will Leica sell other than lenses? We can all guess that Leica didn't make the XV they should have because the M department feared it would cannibalize the sales of Ms. I once worked for a company like that called Control Data Corporation. We purposely built inferior mini-computer for fear that if we built ones that were really good it would impact the sales of the super computers we built. Today the company is gone because it didn't want to recognize that the market was changing due to technology and we had the latest and best technology at our disposal.", "link": "https://www.l-camera-forum.com/topic/213252-x-vario-firmware-suggestion-for-leica/?tab=comments#comment-2444104", "origin": "L-forum", "suborigin": "213252-x-vario-firmware-suggestion-for-leica", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "brian, back when i was younger i ran a small company with tens of thousands of customers, customers that paid no where near what leica charges for its products and i answered almost every email personally. if -----> i !!!  couldn't answer it, -----> i !!!  -----> made !!!  sure someone in my company answered it. it is part of what small companies can and should do to show their customers they care. i get so tired of the excuse for leica that they can't do this or that because they are a small company. with 1,000 plus employees, they aren't that small. sure compared to sony or nikon they are small, but they are plenty large enough to accomplish more. in fact, most small companies have the advantage of far less bureaucracy to deal with, quicker decision making ability, more innovative and nimble and thus faster to market with new and innovative products. unless you have worked in both a small company and a large one, you can't appreciate the difference in having multiple layers of nay sayers all wanting to reduce risk and act as gate keepers. smart managers in small companies know this and use it to their advantage in the battles against the bigger guys. leica still operates like the world isn't changing and they really don't need to innovate and offer more and be quicker to respond. if the x vario had been as bad as the m(240) with all of its problems, many that still haven't been fixed, i would have sent it back in the first 30 days. it is a great little camera with some serious issues that need to be fixed. i suspect that it is such a market failure, thanks to leica's bungled marketing, that leica may abandon it and the other x cameras. the clamor on this forum for an x with a fixed 50mm is an example of what leads leica astray. build an x with 50mm so they can sell all of 10? had leica made the x vario a ff with an interchangeable lens, using the olympus ev-4, evf, and even with a slow zoom kept as close to the size of the current one, they would have had a market winner and the x series would still be in the game. how will the current x2 compete with the sony a7 for $1,698 versus $2,000. not very well would be my guess. the pictures i have seen on the web (from jpgs) are stunning. skin tones look fantastic and they have a lot of pop. when people like michael r at luminous landscape that are old leica customers start leaving your brand it is time to start looking at what you are doing wrong. unfortunately, i think the xv will drop in value considerably and i suspect m sales will also decline, so what will leica sell other than lenses? we can all guess that leica didn't make the xv they should have because the m department feared it would cannibalize the sales of ms. i once worked for a company like that called control data corporation. we purposely built inferior mini-computer for fear that if we built ones that were really good it would impact the sales of the super computers we built. today the company is gone because it didn't want to recognize that the market was changing due to technology and we had the latest and best technology at our disposal.", "sortedWord": "None", "Identifyer": null, "identifyer": 13248, "year": "2013"}, {"autor": "dierk", "date": "2013-02-25 20:58:00", "content": "made more tests with the Leica M9 with Leica APO Macro-Elmarit-R 100/2.8 I made a series of close up tests with distances below 70cm (closest distance on the scale) with the lens mounted on my Nex7 and made notes of the correct distances for the different reproduction ratios (as engraved on the lens). Then I used these values for the M9 and the focus was ok. within 2-3 shots. focus: measure the distance and try on a macro rail Light: indirect flash through umbrella @ f/8 WB: colorchecker --img--  --img--  dierk", "link": "https://www.l-camera-forum.com/topic/198777-r-macro/page/2/?tab=comments#comment-2253335", "origin": "L-forum", "suborigin": "198777-r-macro", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> made !!!  more tests with the leica m9 with leica apo macro-elmarit-r 100/2.8 -----> i !!!  -----> made !!!  a series of close up tests with distances below 70cm (closest distance on the scale) with the lens mounted on my nex7 and -----> made !!!  notes of the correct distances for the different reproduction ratios (as engraved on the lens). then i used these values for the m9 and the focus was ok. within 2-3 shots. focus: measure the distance and try on a macro rail light: indirect flash through umbrella @ f/8 wb: colorchecker --img--  --img--  dierk", "sortedWord": "None", "Identifyer": null, "identifyer": 21311, "year": "2013"}, {"autor": "Doc Henry", "date": "2013-06-11 06:39:00", "content": "I made a mistake in posting this is the one I would like to post. The previous one is already posted.Sorry for the confusion subtlety and nuance of the film in color and in structure of the flower Kodak Portra 160 --img--  Henry", "link": "https://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/page/3/?tab=comments#comment-2344973", "origin": "L-forum", "suborigin": "205842-i-like-filmopen-thread", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> made !!!  a mistake in posting this is the one -----> i !!!  would like to post. the previous one is already posted.sorry for the confusion subtlety and nuance of the film in color and in structure of the flower kodak portra 160 --img--  henry", "sortedWord": "None", "Identifyer": null, "identifyer": 60592, "year": "2013"}, {"autor": "pico", "date": "2013-10-06 21:07:00", "content": "It appears that the ball is locked into its socket during the panoramic rotation. Hence, the rotational axis will be sufficiently well defined. Its direction may not what you intended, but constant it will be. True, Sir, but results will be better if the head is level - the point I was trying to make. The Leica head does not provide a level - or does it?", "link": "https://www.l-camera-forum.com/topic/213952-new-leica-tripod-and-ball-head-%E2%80%9Cmade-in-germany%E2%80%9D/?tab=comments#comment-2436096", "origin": "L-forum", "suborigin": "213952-new-leica-tripod-and-ball-head-%E2%80%9Cmade-in-germany%E2%80%9D", "result": true, "Selector": "i was trying to make", "selectorShort": "make", "MarkedSent": "it appears that the ball is locked into its socket during the panoramic rotation. hence, the rotational axis will be sufficiently well defined. its direction may not what you intended, but constant it will be. true, sir, but results will be better if the head is level - the point -----> i !!!  -----> was !!!  -----> trying !!!  -----> to !!!  -----> make !!! . the leica head does not provide a level - or does it?", "sortedWord": "None", "Identifyer": null, "identifyer": 79695, "year": "2013"}, {"autor": "pop", "date": "2013-10-06 21:48:00", "content": "True, Sir, but results will be better if the head is level - the point I was trying to make. The Leica head does not provide a level - or does it? Ah - no, it does not. Actually, wouldn't it take more than one level to provide the proper alignment in all dimensions?", "link": "https://www.l-camera-forum.com/topic/213952-new-leica-tripod-and-ball-head-%E2%80%9Cmade-in-germany%E2%80%9D/?tab=comments#comment-2436124", "origin": "L-forum", "suborigin": "213952-new-leica-tripod-and-ball-head-%E2%80%9Cmade-in-germany%E2%80%9D", "result": true, "Selector": "i was trying to make", "selectorShort": "make", "MarkedSent": "true, sir, but results will be better if the head is level - the point -----> i !!!  -----> was !!!  -----> trying !!!  -----> to !!!  -----> make !!! . the leica head does not provide a level - or does it? ah - no, it does not. actually, wouldn't it take more than one level to provide the proper alignment in all dimensions?", "sortedWord": "None", "Identifyer": null, "identifyer": 79696, "year": "2013"}, {"autor": "plasticman", "date": "2013-10-31 08:45:00", "content": "Thanks guys. I think it's sometimes easy to slip into treating this forum as the local pub, where gossip is shared without really thinking anyone is going to disclose what's said 'out of school'. On the other hand, Malcolm isn't here to defend himself, so it was unfair of me to bring up the topic here without at the very least informing him that I was going to do so. Just for the record, although he was very indignant about the matter and said he was sending the lens back straight away (this slipped to 'over the next couple weeks' as the phone conversation dragged on), I noted that he was not so outraged that he'd decided to send me the lens as soon as he heard about the thread. The last time I spoke to him was January, and then we'd made a totally solid and final agreement that the work was going to be finished before the end of February. I rang again yesterday (October 30) - I doubt whether he'd just been told about the thread that morning - and so some of my sympathy for his side of the story evaporated straight away: the 'honorable' thing would've been to return my lens the moment he'd decided he was no longer willing to work on it. Incidentally, he assured me that all lenses were kept carefully sealed and separated, and there was no possible way that mine could be affected by other lenses in his workshop, whatever their condition.", "link": "https://www.l-camera-forum.com/topic/171893-after-3-years-at-malcolm-taylors-will-my-lens-have-fungus/page/4/?tab=comments#comment-2454343", "origin": "L-forum", "suborigin": "171893-after-3-years-at-malcolm-taylors-will-my-lens-have-fungus", "result": true, "Selector": "we'd made", "selectorShort": "make", "MarkedSent": "thanks guys. i think it's sometimes easy to slip into treating this forum as the local pub, where gossip is shared without really thinking anyone is going to disclose what's said 'out of school'. on the other hand, malcolm isn't here to defend himself, so it was unfair of me to bring up the topic here without at the very least informing him that i was going to do so. just for the record, although he was very indignant about the matter and said he was sending the lens back straight away (this slipped to 'over the next couple weeks' as the phone conversation dragged on), i noted that he was not so outraged that he'd decided to send me the lens as soon as he heard about the thread. the last time i spoke to him was january, and then -----> we !!! -----> 'd !!!  -----> made !!!  a totally solid and final agreement that the work was going to be finished before the end of february. i rang again yesterday (october 30) - i doubt whether he'd just been told about the thread that morning - and so some of my sympathy for his side of the story evaporated straight away: the 'honorable' thing would've been to return my lens the moment he'd decided he was no longer willing to work on it. incidentally, he assured me that all lenses were kept carefully sealed and separated, and there was no possible way that mine could be affected by other lenses in his workshop, whatever their condition.", "sortedWord": "None", "Identifyer": null, "identifyer": 86645, "year": "2013"}, {"autor": "earleygallery", "date": "2013-10-31 09:41:00", "content": "Thanks guys. I think it's sometimes easy to slip into treating this forum as the local pub, where gossip is shared without really thinking anyone is going to disclose what's said 'out of school'. On the other hand, Malcolm isn't here to defend himself, so it was unfair of me to bring up the topic here without at the very least informing him that I was going to do so. Just for the record, although he was very indignant about the matter and said he was sending the lens back straight away (this slipped to 'over the next couple weeks' as the phone conversation dragged on), I noted that he was not so outraged that he'd decided to send me the lens as soon as he heard about the thread. The last time I spoke to him was January, and then we'd made a totally solid and final agreement that the work was going to be finished before the end of February. I rang again yesterday (October 30) - I doubt whether he'd just been told about the thread that morning - and so some of my sympathy for his side of the story evaporated straight away: the 'honorable' thing would've been to return my lens the moment he'd decided he was no longer willing to work on it. Incidentally, he assured me that all lenses were kept carefully sealed and separated, and there was no possible way that mine could be affected by other lenses in his workshop, whatever their condition. Hmmm, the cynic in me would make me want to check your lens thoroughly WHEN you eventually get it back. Maybe the stance he's taking is damage limitation as he's now spotted signs of fungus!! Regardless, I don't think Malcolm is doing himself any favours by his hissy fit response or the extraordinary amount of time he sits on customers items without doing anything.", "link": "https://www.l-camera-forum.com/topic/171893-after-3-years-at-malcolm-taylors-will-my-lens-have-fungus/page/4/?tab=comments#comment-2454372", "origin": "L-forum", "suborigin": "171893-after-3-years-at-malcolm-taylors-will-my-lens-have-fungus", "result": true, "Selector": "we'd made", "selectorShort": "make", "MarkedSent": "thanks guys. i think it's sometimes easy to slip into treating this forum as the local pub, where gossip is shared without really thinking anyone is going to disclose what's said 'out of school'. on the other hand, malcolm isn't here to defend himself, so it was unfair of me to bring up the topic here without at the very least informing him that i was going to do so. just for the record, although he was very indignant about the matter and said he was sending the lens back straight away (this slipped to 'over the next couple weeks' as the phone conversation dragged on), i noted that he was not so outraged that he'd decided to send me the lens as soon as he heard about the thread. the last time i spoke to him was january, and then -----> we !!! -----> 'd !!!  -----> made !!!  a totally solid and final agreement that the work was going to be finished before the end of february. i rang again yesterday (october 30) - i doubt whether he'd just been told about the thread that morning - and so some of my sympathy for his side of the story evaporated straight away: the 'honorable' thing would've been to return my lens the moment he'd decided he was no longer willing to work on it. incidentally, he assured me that all lenses were kept carefully sealed and separated, and there was no possible way that mine could be affected by other lenses in his workshop, whatever their condition. hmmm, the cynic in me would make me want to check your lens thoroughly when you eventually get it back. maybe the stance he's taking is damage limitation as he's now spotted signs of fungus!! regardless, i don't think malcolm is doing himself any favours by his hissy fit response or the extraordinary amount of time he sits on customers items without doing anything.", "sortedWord": "None", "Identifyer": null, "identifyer": 86647, "year": "2013"}, {"autor": "dkCambridgeshire", "date": "2013-11-26 17:16:00", "content": "Thanks guys. I think it's sometimes easy to slip into treating this forum as the local pub, where gossip is shared without really thinking anyone is going to disclose what's said 'out of school'. On the other hand, Malcolm isn't here to defend himself, so it was unfair of me to bring up the topic here without at the very least informing him that I was going to do so. Just for the record, although he was very indignant about the matter and said he was sending the lens back straight away (this slipped to 'over the next couple weeks' as the phone conversation dragged on), I noted that he was not so outraged that he'd decided to send me the lens as soon as he heard about the thread. The last time I spoke to him was January, and then we'd made a totally solid and final agreement that the work was going to be finished before the end of February. I rang again yesterday (October 30) - I doubt whether he'd just been told about the thread that morning - and so some of my sympathy for his side of the story evaporated straight away: the 'honorable' thing would've been to return my lens the moment he'd decided he was no longer willing to work on it. Incidentally, he assured me that all lenses were kept carefully sealed and separated, and there was no possible way that mine could be affected by other lenses in his workshop, whatever their condition. Totally unreasonable that anyone should sit on a lens repair for three years. I used another very well known UK Leica expert repairer and he: 1) Gave me a date when I could take in the camera for service - three months forward on a Saturday. 2) I delivered the camera to him personally on that Saturday morning when we also discussed the camera repair in depth. 3) He serviced and repaired the camera over that weekend .. including working on it on the Sunday. 4) He phoned me on the Monday and advised the work was completed. 5) I collected the camera on the Tuesday .. and he gave me a CD showing photos of all the interior of the camera and defects he had found and remedied. That is SERVICE ... no delays once he had the camera. Camera was a very special Leica I Model A. And when I arrived home I sent his wife a bouquet of flowers because I was so pleased with the work. dunk", "link": "https://www.l-camera-forum.com/topic/171893-after-3-years-at-malcolm-taylors-will-my-lens-have-fungus/page/4/?tab=comments#comment-2474443", "origin": "L-forum", "suborigin": "171893-after-3-years-at-malcolm-taylors-will-my-lens-have-fungus", "result": true, "Selector": "we'd made", "selectorShort": "make", "MarkedSent": "thanks guys. i think it's sometimes easy to slip into treating this forum as the local pub, where gossip is shared without really thinking anyone is going to disclose what's said 'out of school'. on the other hand, malcolm isn't here to defend himself, so it was unfair of me to bring up the topic here without at the very least informing him that i was going to do so. just for the record, although he was very indignant about the matter and said he was sending the lens back straight away (this slipped to 'over the next couple weeks' as the phone conversation dragged on), i noted that he was not so outraged that he'd decided to send me the lens as soon as he heard about the thread. the last time i spoke to him was january, and then -----> we !!! -----> 'd !!!  -----> made !!!  a totally solid and final agreement that the work was going to be finished before the end of february. i rang again yesterday (october 30) - i doubt whether he'd just been told about the thread that morning - and so some of my sympathy for his side of the story evaporated straight away: the 'honorable' thing would've been to return my lens the moment he'd decided he was no longer willing to work on it. incidentally, he assured me that all lenses were kept carefully sealed and separated, and there was no possible way that mine could be affected by other lenses in his workshop, whatever their condition. totally unreasonable that anyone should sit on a lens repair for three years. i used another very well known uk leica expert repairer and he: 1) gave me a date when i could take in the camera for service - three months forward on a saturday. 2) i delivered the camera to him personally on that saturday morning when we also discussed the camera repair in depth. 3) he serviced and repaired the camera over that weekend .. including working on it on the sunday. 4) he phoned me on the monday and advised the work was completed. 5) i collected the camera on the tuesday .. and he gave me a cd showing photos of all the interior of the camera and defects he had found and remedied. that is service ... no delays once he had the camera. camera was a very special leica i model a. and when i arrived home i sent his wife a bouquet of flowers because i was so pleased with the work. dunk", "sortedWord": "None", "Identifyer": null, "identifyer": 86657, "year": "2013"}, {"autor": "markrune", "date": "2013-02-10 17:49:00", "content": " At yesterdays meet in Ipswich Susie had an Ablon (type) template for her Leica IIIf and it was made preparing film to load a whole lot easier. I always have issues loading my Leica III (even if I try cutting a long leader with scissors first). Does anyone know of anyone who make a cheapish copy of tis. I have searched the web but everything seems to be about £70+ , I might try making one out of card, but if anyone knows of an alternative I would be most grateful --img-- ", "link": "https://www.l-camera-forum.com/topic/198003-ablon-or-copy/?tab=comments#comment-2239077", "origin": "L-forum", "suborigin": "198003-ablon-or-copy", "result": true, "Selector": "i might try making", "selectorShort": "make", "MarkedSent": " at yesterdays meet in ipswich susie had an ablon (type) template for her leica iiif and it was made preparing film to load a whole lot easier. i always have issues loading my leica iii (even if i try cutting a long leader with scissors first). does anyone know of anyone who make a cheapish copy of tis. -----> i !!!  have searched the web but everything seems to be about £70+ , -----> i !!!  -----> might !!!  -----> try !!!  -----> making !!!  one out of card, but if anyone knows of an alternative -----> i !!!  would be most grateful --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 87479, "year": "2013"}, {"autor": "Cedric Agie de Selsaeten", "date": "2013-07-08 18:22:00", "content": "First things first. Be carefull when using older flashtypes (portable or studio) that work with higher ignition voltages when connecting them to moderrn digital cameras such as the Leica M-9. Using wireless connections such as a flash slave, IR or Radiowaves is an elegant precaution to avoid miseries. A limit of 5 to 6 six volts has been agreed upon by most manufacturers. Where tensions could go up to as much 90 volt DC. For some digital cameras a tension of 25 VDC is an absolute limit that could otherwise kill your camera. I have a good experience with the (more modern) Elinchrom D-lite sets 200 & 500 etc. They come with an internal flash slave and compatible RF receiver (4 coded channels) etc. Plus a separate (tiny) El -Skyport Eco Transmitter that comes with a small battery reloader. And a separate El- Skyport Elinchrom compatible RF receiver (4 identical coded channels). Both transmitter and receiver also work beautifully with most studio, prof portable and smaller flash units such as those of the Metz family. Other brands should also work the same way. I even made some special connectors to use this system with my Hasselblad 500 ELM and R-8 and R-9 cameras equipped with a winder. Works beautifully.", "link": "https://www.l-camera-forum.com/topic/204510-leica-m9-with-wireless-flash/?tab=comments#comment-2369271", "origin": "L-forum", "suborigin": "204510-leica-m9-with-wireless-flash", "result": true, "Selector": "i even made", "selectorShort": "make", "MarkedSent": "first things first. be carefull when using older flashtypes (portable or studio) that work with higher ignition voltages when connecting them to moderrn digital cameras such as the leica m-9. using wireless connections such as a flash slave, ir or radiowaves is an elegant precaution to avoid miseries. a limit of 5 to 6 six volts has been agreed upon by most manufacturers. where tensions could go up to as much 90 volt dc. for some digital cameras a tension of 25 vdc is an absolute limit that could otherwise kill your camera. i have a good experience with the (more modern) elinchrom d-lite sets 200 & 500 etc. they come with an internal flash slave and compatible rf receiver (4 coded channels) etc. plus a separate (tiny) el -skyport eco transmitter that comes with a small battery reloader. and a separate el- skyport elinchrom compatible rf receiver (4 identical coded channels). both transmitter and receiver also work beautifully with most studio, prof portable and smaller flash units such as those of the metz family. other brands should also work the same way. -----> i !!!  -----> even !!!  -----> made !!!  some special connectors to use this system with my hasselblad 500 elm and r-8 and r-9 cameras equipped with a winder. works beautifully.", "sortedWord": "None", "Identifyer": null, "identifyer": 89466, "year": "2013"}, {"autor": "Guest tanks", "date": "2013-12-30 23:03:00", "content": " Santa had a gift for me waiting under the tree a Leica 1600-B Rangemaster. Leica Camera AG - Sport Optics - Rangemaster Last weekend I was able to test it out in the desert. Put a target a ways off. The Rangemaster estimated the target to be 747 metres. I plugged in the numbers into my ballistic calculator (iSnipe) for the iPhone, and made the MOA adjustments on the scope. Every shot was in the black (shooting prone). Now, the Rangemaster also has ballistic curves built in where it tells me the adjustments I need to make in MOA based on the distance the rifle was zeroed, ballistics of the cartridge etc., etc.. I have to figure out the exact inputs for that as the manual is lacking as usual. Though most probably will keep on using iSnipe as it is a very through and flexible app. Overall, I was impressed with the product. I'd recommend it to anyone needing a range finder. The only negative nitpicky thing I'd say is that it requires a CR2 battery, so will have to buy some spares.", "link": "https://www.l-camera-forum.com/topic/219308-impressed-with-another-leica-product/?tab=comments#comment-2498457", "origin": "L-forum", "suborigin": "219308-impressed-with-another-leica-product", "result": true, "Selector": "i need to make", "selectorShort": "make", "MarkedSent": " santa had a gift for me waiting under the tree a leica 1600-b rangemaster. leica camera ag - sport optics - rangemaster last weekend i was able to test it out in the desert. put a target a ways off. the rangemaster estimated the target to be 747 metres. i plugged in the numbers into my ballistic calculator (isnipe) for the iphone, and made the moa adjustments on the scope. every shot was in the black (shooting prone). now, the rangemaster also has ballistic curves built in where it tells me the adjustments -----> i !!!  -----> need !!!  -----> to !!!  -----> make !!!  in moa based on the distance the rifle was zeroed, ballistics of the cartridge etc., etc.. -----> i !!!  have -----> to !!!  figure out the exact inputs for that as the manual is lacking as usual. though most probably will keep on using isnipe as it is a very through and flexible app. overall, i was impressed with the product. i'd recommend it to anyone needing a range finder. the only negative nitpicky thing i'd say is that it requires a cr2 battery, so will have to buy some spares.", "sortedWord": "None", "Identifyer": null, "identifyer": 89745, "year": "2013"}, {"autor": "alandash", "date": "2013-03-16 10:59:00", "content": " I heard some people have fitted some M3-type accessories, such as the advance lever, preview lever, etc. on the M4, to make the M4 look more like the M3. I have both the chrome M3 and M4, and I like the looks of the M3 better. Was it Tom Abrahamsen who originally did that? How do I proceed to make that happen on my M4? Also, where is a good source of UV filters and the traditional chrome front lens caps for the 35mm, 50mm, and 90mm Summicron lenses, and the 90mm & 135mm Elmars? (Dull chrome with Leica logo). All of my lenses date back to the 1960's or so, but my latest 50mm Summicron (chrome) is the present production version, with sliding hood. This one has the black plastic lens cap, held on by opposing spring clips. It's slower to use than the friction type. Suggestions will be welcome. The old LHSA quarterly printed catalog used to be full of cameras and accessories for sale by fellow members. I miss it. Al Dash", "link": "https://www.l-camera-forum.com/topic/200661-m3-type-film-advance-lever-on-m4-etc/?tab=comments#comment-2273065", "origin": "L-forum", "suborigin": "200661-m3-type-film-advance-lever-on-m4-etc", "result": true, "Selector": "i proceed to make", "selectorShort": "make", "MarkedSent": " i heard some people have fitted some m3-type accessories, such as the advance lever, preview lever, etc. on the m4, to make the m4 look more like the m3. i have both the chrome m3 and m4, and i like the looks of the m3 better. was it tom abrahamsen who originally did that? how do -----> i !!!  -----> proceed !!!  -----> to !!!  -----> make !!!  that happen on my m4? also, where is a good source of uv filters and the traditional chrome front lens caps for the 35mm, 50mm, and 90mm summicron lenses, and the 90mm & 135mm elmars? (dull chrome with leica logo). all of my lenses date back to the 1960's or so, but my latest 50mm summicron (chrome) is the present production version, with sliding hood. this one has the black plastic lens cap, held on by opposing spring clips. it's slower to use than the friction type. suggestions will be welcome. the old lhsa quarterly printed catalog used to be full of cameras and accessories for sale by fellow members. i miss it. al dash", "sortedWord": "None", "Identifyer": null, "identifyer": 89962, "year": "2013"}, {"autor": "marknorton", "date": "2013-07-09 14:51:00", "content": "Sony is in no better position to deal with the inevitable Italian flag issues than Leica is, and they have less incentive to try. Why would Sony care whether you could use third-party lenses? Also it is still a rumour. The point I was making Michael is that with some proper competition, Leica might care about releasing a camera with Italian flag issues, especially if a competitor had them sorted. I agree that Sony is unlikely to offer serious competition for Leica, too much engineering work when the lens business is not theirs and too much of a niche market for a company making thousands of cameras a day, not tens.", "link": "https://www.l-camera-forum.com/topic/214267-the-sony-a7-thread-merged/?tab=comments#comment-2370132", "origin": "L-forum", "suborigin": "214267-the-sony-a7-thread-merged", "result": true, "Selector": "i was making", "selectorShort": "make", "MarkedSent": "sony is in no better position to deal with the inevitable italian flag issues than leica is, and they have less incentive to try. why would sony care whether you could use third-party lenses? also it is still a rumour. the point -----> i !!!  -----> was !!!  -----> making !!!  michael is that with some proper competition, leica might care about releasing a camera with italian flag issues, especially if a competitor had them sorted. i agree that sony is unlikely to offer serious competition for leica, too much engineering work when the lens business is not theirs and too much of a niche market for a company making thousands of cameras a day, not tens.", "sortedWord": "None", "Identifyer": null, "identifyer": 92656, "year": "2013"}, {"autor": "CaptZoom", "date": "2013-08-01 07:12:00", "content": "it will not cost 6200€ and the Sony RX is one of the best camera \"The Sony RX is one of the best camera\" for what type of photography? In any case, if you're not happy with your M240 you should sell it and purchase some thing better suited to your needs. I reserve making any judgement calls until after the Sony FF is released, put through its paces. Then I'll have to wait several more years for the lens catalogue to mature before deciding on committing to the system.", "link": "https://www.l-camera-forum.com/topic/214267-the-sony-a7-thread-merged/page/12/?tab=comments#comment-2387694", "origin": "L-forum", "suborigin": "214267-the-sony-a7-thread-merged", "result": true, "Selector": "i reserve making", "selectorShort": "make", "MarkedSent": "it will not cost 6200€ and the sony rx is one of the best camera \"the sony rx is one of the best camera\" for what type of photography? in any case, if you're not happy with your m240 you should sell it and purchase some thing better suited to your needs. -----> i !!!  -----> reserve !!!  -----> making !!!  any judgement calls until after the sony ff is released, put through its paces. then i'll have to wait several more years for the lens catalogue to mature before deciding on committing to the system.", "sortedWord": "None", "Identifyer": null, "identifyer": 92885, "year": "2013"}, {"autor": "hoppyman", "date": "2013-11-15 04:38:00", "content": " CEO Alfred Schopf visited Australia recently and provided an interview to Paul Burrows, editor of 'Camera' magazine here. It's a very good local publication and I thoroughly recommend this article (and the magazine) in their Nov/Dec 2013 issue to anyone who can obtain it. You can get it as a digital edition apparently at http://www.zinio.com/camera I think that I can quote small portions of particular interest here without transgression. Perhaps the complete interview will become available? All direct transcriptions from parts of answers by CEO: ...\"to be honest, I'm not 100 percent sure where the D-SLR market is going to be in the future. The mirrorless cameras are coming on and on and on and I'm not entirely convinced that in ten years time we will have a D-SLR market\" When asked will there ever be a Leica compact system camera: \"We will have one, definitely. And it will, of course, be quite different to M system. We want to have autofocus with such a system and we may well have an APSC size sensor rather than a bigger one.......\" Getting back to Leica's plans for a CSC, Alfred states: \"It will be a German built camera, however I'm not sure we can make all of the lenses made in Germany because we are talking about a different price range to M system so I could imagine that we do some fixed focal length lenses in Germany and maybe with the zooms we will co-operate with a partner\" He stresses that Leica won't be building on Panasonic's Micro Four Thirds format. On film cameras, Alfred Schopf said: \"We are now the world's biggest manufacturer of film cameras on the planet- because we are the only one, more or less. As long as we get orders we will continue. At the moment we get between 600 and 700 orders per year............\"", "link": "https://www.l-camera-forum.com/topic/216719-ceo-alfred-schopf-and-future-products/?tab=comments#comment-2465935", "origin": "L-forum", "suborigin": "216719-ceo-alfred-schopf-and-future-products", "result": true, "Selector": "we can make", "selectorShort": "make", "MarkedSent": " ceo alfred schopf visited australia recently and provided an interview to paul burrows, editor of 'camera' magazine here. it's a very good local publication and i thoroughly recommend this article (and the magazine) in their nov/dec 2013 issue to anyone who can obtain it. you can get it as a digital edition apparently at http://www.zinio.com/camera i think that i can quote small portions of particular interest here without transgression. perhaps the complete interview will become available? all direct transcriptions from parts of answers by ceo: ...\"to be honest, i'm not 100 percent sure where the d-slr market is going to be in the future. the mirrorless cameras are coming on and on and on and i'm not entirely convinced that in ten years time we will have a d-slr market\" when asked will there ever be a leica compact system camera: \"we will have one, definitely. and it will, of course, be quite different to m system. -----> we !!!  want to have autofocus with such a system and -----> we !!!  may well have an apsc size sensor rather than a bigger one.......\" getting back to leica's plans for a csc, alfred states: \"it will be a german built camera, however i'm not sure -----> we !!!  -----> can !!!  -----> make !!!  all of the lenses made in germany because -----> we !!!  are talking about a different price range to m system so i could imagine that we do some fixed focal length lenses in germany and maybe with the zooms we will co-operate with a partner\" he stresses that leica won't be building on panasonic's micro four thirds format. on film cameras, alfred schopf said: \"we are now the world's biggest manufacturer of film cameras on the planet- because we are the only one, more or less. as long as we get orders we will continue. at the moment we get between 600 and 700 orders per year............\"", "sortedWord": "None", "Identifyer": null, "identifyer": 95812, "year": "2013"}, {"autor": "rosuna", "date": "2013-11-15 11:13:00", "content": "CEO Alfred Schopf visited Australia recently and provided an interview to Paul Burrows, editor of 'Camera' magazine here. It's a very good local publication and I thoroughly recommend this article (and the magazine) in their Nov/Dec 2013 issue to anyone who can obtain it.You can get it as a digital edition apparently at http://www.zinio.com/camera I think that I can quote small portions of particular interest here without transgression. Perhaps the complete interview will become available? All direct transcriptions from parts of answers by CEO: ...\"to be honest, I'm not 100 percent sure where the D-SLR market is going to be in the future. The mirrorless cameras are coming on and on and on and I'm not entirely convinced that in ten years time we will have a D-SLR market\" When asked will there ever be a Leica compact system camera: \"We will have one, definitely. And it will, of course, be quite different to M system. We want to have autofocus with such a system and we may well have an APSC size sensor rather than a bigger one.......\" Getting back to Leica's plans for a CSC, Alfred states: \"It will be a German built camera, however I'm not sure we can make all of the lenses made in Germany because we are talking about a different price range to M system so I could imagine that we do some fixed focal length lenses in Germany and maybe with the zooms we will co-operate with a partner\" He stresses that Leica won't be building on Panasonic's Micro Four Thirds format. On film cameras, Alfred Schopf said: \"We are now the world's biggest manufacturer of film cameras on the planet- because we are the only one, more or less. As long as we get orders we will continue. At the moment we get between 600 and 700 orders per year............\" Any new system based on APS-C or M4/3 is a mistake at this moment. Really serious mistake. In this context a rebranding of Panasonic products is more reasonable because you reduce risks (but it is nasty and probably a disaster). Sony new A7 and A7r have changed the market. You cannot sell an APS-C camera for $1500 anymore. The format size is the strongest sales argument. Olympus is seriously worried because that is in the price frame of the new OM-D. Fujifilm is worried too (they are planning to release a full frame camera next year!). They both will face serious trouble next year. We will see cheaper and smaller reflex cameras with FF sensors from Canon and Nikon in the near future. Where is the reasonable price range for an APS-C system by Leica? $1000? FF cameras will be there... next year (new Sony models, E mount). Zeiss will release manual focus lenses for the new Sony system late in 2014, and the ZM line of lenses seems to be damned.", "link": "https://www.l-camera-forum.com/topic/216719-ceo-alfred-schopf-and-future-products/?tab=comments#comment-2466097", "origin": "L-forum", "suborigin": "216719-ceo-alfred-schopf-and-future-products", "result": true, "Selector": "we can make", "selectorShort": "make", "MarkedSent": "ceo alfred schopf visited australia recently and provided an interview to paul burrows, editor of 'camera' magazine here. it's a very good local publication and i thoroughly recommend this article (and the magazine) in their nov/dec 2013 issue to anyone who can obtain it.you can get it as a digital edition apparently at http://www.zinio.com/camera i think that i can quote small portions of particular interest here without transgression. perhaps the complete interview will become available? all direct transcriptions from parts of answers by ceo: ...\"to be honest, i'm not 100 percent sure where the d-slr market is going to be in the future. the mirrorless cameras are coming on and on and on and i'm not entirely convinced that in ten years time we will have a d-slr market\" when asked will there ever be a leica compact system camera: \"we will have one, definitely. and it will, of course, be quite different to m system. -----> we !!!  want to have autofocus with such a system and -----> we !!!  may well have an apsc size sensor rather than a bigger one.......\" getting back to leica's plans for a csc, alfred states: \"it will be a german built camera, however i'm not sure -----> we !!!  -----> can !!!  -----> make !!!  all of the lenses made in germany because -----> we !!!  are talking about a different price range to m system so i could imagine that we do some fixed focal length lenses in germany and maybe with the zooms we will co-operate with a partner\" he stresses that leica won't be building on panasonic's micro four thirds format. on film cameras, alfred schopf said: \"we are now the world's biggest manufacturer of film cameras on the planet- because we are the only one, more or less. as long as we get orders we will continue. at the moment we get between 600 and 700 orders per year............\" any new system based on aps-c or m4/3 is a mistake at this moment. really serious mistake. in this context a rebranding of panasonic products is more reasonable because you reduce risks (but it is nasty and probably a disaster). sony new a7 and a7r have changed the market. you cannot sell an aps-c camera for $1500 anymore. the format size is the strongest sales argument. olympus is seriously worried because that is in the price frame of the new om-d. fujifilm is worried too (they are planning to release a full frame camera next year!). they both will face serious trouble next year. we will see cheaper and smaller reflex cameras with ff sensors from canon and nikon in the near future. where is the reasonable price range for an aps-c system by leica? $1000? ff cameras will be there... next year (new sony models, e mount). zeiss will release manual focus lenses for the new sony system late in 2014, and the zm line of lenses seems to be damned.", "sortedWord": "None", "Identifyer": null, "identifyer": 95814, "year": "2013"}, {"autor": "tobey bilek", "date": "2013-05-30 21:17:00", "content": "For 6x6 street work, I prefer(ed) a Rollei TLR. Usually they are lighter than Hassys (I don't know about the last ultra-fancy GX models), and far less shake for hand-holding (no swinging mirrors and light-proof doors, no double-acting shutter). Significantly quieter than even a Leica M film camera. And the last couple of times I've tried \"discount\" Hassys, the aging backs have had light leaks at the slot where the dark slide goes in. Frankly, after I made 16\" x 16\" prints of the same scene, shot with a Hassy/80 Planar/Ektar 100, and an M9/35 'cron cropped square (which equals \"80mm\" FoV) -- and >90% of viewers could not tell which was which (or picked the M9 print as the \"medium format\" shot) -- I moved on. But everyone should try a Hassy at least once - if only for the fun of field-stripping it down to the component modules. --img--  My M9 is better than a Hassy any day. D3 or D700 Nikons make 11x prints that I can not tell from 4x5. The D800, well another league. Lust no more.", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/11/?tab=comments#comment-2334823", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "for 6x6 street work, i prefer(ed) a rollei tlr. usually they are lighter than hassys (i don't know about the last ultra-fancy gx models), and far less shake for hand-holding (no swinging mirrors and light-proof doors, no double-acting shutter). significantly quieter than even a leica m film camera. and the last couple of times i've tried \"discount\" hassys, the aging backs have had light leaks at the slot where the dark slide goes in. frankly, after -----> i !!!  -----> made !!!  16\" x 16\" prints of the same scene, shot with a hassy/80 planar/ektar 100, and an m9/35 'cron cropped square (which equals \"80mm\" fov) -- and >90% of viewers could not tell which was which (or picked the m9 print as the \"medium format\" shot) -- -----> i !!!  moved on. but everyone should try a hassy at least once - if only for the fun of field-stripping it down to the component modules. --img--  my m9 is better than a hassy any day. d3 or d700 nikons make 11x prints that i can not tell from 4x5. the d800, well another league. lust no more.", "sortedWord": "None", "Identifyer": null, "identifyer": 103323, "year": "2013"}, {"autor": "JeTexas", "date": "2013-07-22 12:56:00", "content": " I just set up a darkroom at the house for the first time since 1995. I re-read some chapters of The Darkroom Book to sweep out the cobwebs, but there was still a learning curve as I tried to produce a print last night. It probably didn't help that the enlarger bulb of unknown age burned out while I was setting up, so I swapped in a regular bulb from a lamp. Then the strange brand of photo paper I found in my boxes said Copyright 1972 on the package, and I tried printing with a home mixture of Caffenol-C instead of a real developer. It was Sunday night, so I had to make due with what I could find at the house, and I was anxious just to try it all out. There were a few failed attempts. --img--  So after getting my exposure down and figuring out the timing on the chemicals, I finally got a couple prints with good detail, but they're very lacking in contrast. (Both the negatives were TMAX 100 although one was 35mm and one was 6x6.) --img--  I'm headed to the shop at lunch today to get some real chemicals, a new bulb and some fresh paper, but my question is, what determines contrast in prints? Do I need a certain developer for more contrast or is there a type of paper with more contrast? Or is it the way I developed the negatives that is causing lack of contrast? Any tips would be appreciated.", "link": "https://www.l-camera-forum.com/topic/209336-what-determines-contrast-in-your-prints/?tab=comments#comment-2379971", "origin": "L-forum", "suborigin": "209336-what-determines-contrast-in-your-prints", "result": true, "Selector": "i had to make", "selectorShort": "make", "MarkedSent": " i just set up a darkroom at the house for the first time since 1995. i re-read some chapters of the darkroom book to sweep out the cobwebs, but there was still a learning curve as i tried to produce a print last night. it probably didn't help that the enlarger bulb of unknown age burned out while i was setting up, so i swapped in a regular bulb from a lamp. then the strange brand of photo paper i found in my boxes said copyright 1972 on the package, and i tried printing with a home mixture of caffenol-c instead of a real developer. it was sunday night, so -----> i !!!  -----> had !!!  -----> to !!!  -----> make !!!  due with what -----> i !!!  could find at the house, and -----> i !!!  was anxious just -----> to !!!  try it all out. there were a few failed attempts. --img--  so after getting my exposure down and figuring out the timing on the chemicals, i finally got a couple prints with good detail, but they're very lacking in contrast. (both the negatives were tmax 100 although one was 35mm and one was 6x6.) --img--  i'm headed to the shop at lunch today to get some real chemicals, a new bulb and some fresh paper, but my question is, what determines contrast in prints? do i need a certain developer for more contrast or is there a type of paper with more contrast? or is it the way i developed the negatives that is causing lack of contrast? any tips would be appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 107148, "year": "2013"}, {"autor": "tobey bilek", "date": "2013-06-28 04:35:00", "content": "I used it for years with Plus and Tri X. Then the films were reformulated to thin emulsion so Kodak could run them on the same line as color films. The films still retained the look of old, but the emulsion can not hold enough of the developing agent being so thin. I doubled the metol & hydroquinone content to compensate and results were better, but not as good as old. Tab emulsion films, just forget it. Try some on some efke or other european films that are not reformulated. I just use D76 1:1 which I can make cheaply.", "link": "https://www.l-camera-forum.com/topic/194237-stocklers-2-bath-developer/?tab=comments#comment-2360390", "origin": "L-forum", "suborigin": "194237-stocklers-2-bath-developer", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "i used it for years with plus and tri x. then the films were reformulated to thin emulsion so kodak could run them on the same line as color films. the films still retained the look of old, but the emulsion can not hold enough of the developing agent being so thin. i doubled the metol & hydroquinone content to compensate and results were better, but not as good as old. tab emulsion films, just forget it. try some on some efke or other european films that are not reformulated. -----> i !!!  just use d76 1:1 which -----> i !!!  -----> can !!!  -----> make !!!  cheaply.", "sortedWord": "None", "Identifyer": null, "identifyer": 107268, "year": "2013"}, {"autor": "Michael Hiles", "date": "2013-11-13 04:06:00", "content": " I think there is no better option than a focomat 1c. I made a temporary adapter to use a cold light head, which has some advantages in some circumstances. I can easily swithc beween condenser and cold light.", "link": "https://www.l-camera-forum.com/topic/215835-a-suitable-enlarger/?tab=comments#comment-2464436", "origin": "L-forum", "suborigin": "215835-a-suitable-enlarger", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": " i think there is no better option than a focomat 1c. -----> i !!!  -----> made !!!  a temporary adapter to use a cold light head, which has some advantages in some circumstances. i can easily swithc beween condenser and cold light.", "sortedWord": "None", "Identifyer": null, "identifyer": 107320, "year": "2013"}, {"autor": "Jeff S", "date": "2013-11-16 15:34:00", "content": "Sure, there is a lot of discussion on this topic in the Digital PP section of the forum. Here is a comment I made in one of those many threads (the search box will bring up others, or you can just browse the sub-forum). Just as in the darkroom, the printer (or enlarger) is but part of a larger workflow necessary for fine prints. But getting a good one is an important part of the chain. A lot depends on your preferred print size. Epson is the most popular current brand, with the R3000 (13\") and 3880 (17\") among those preferred by many users here. Canon also makes some good products. I was frankly skeptical about switching from silver to digital prints, but the quality of hardware, software and print materials (papers, inks, etc) these days allows for some great results. There are some hybrid approaches as well, e.g., printing digital files on to silver papers (generally requiring an outside service), but I haven't gone that route. Lots to read, but feel free to ask specific questions if you get to that point. Jeff", "link": "https://www.l-camera-forum.com/topic/215835-a-suitable-enlarger/?tab=comments#comment-2466988", "origin": "L-forum", "suborigin": "215835-a-suitable-enlarger", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "sure, there is a lot of discussion on this topic in the digital pp section of the forum. here is a comment -----> i !!!  -----> made !!!  in one of those many threads (the search box will bring up others, or you can just browse the sub-forum). just as in the darkroom, the printer (or enlarger) is but part of a larger workflow necessary for fine prints. but getting a good one is an important part of the chain. a lot depends on your preferred print size. epson is the most popular current brand, with the r3000 (13\") and 3880 (17\") among those preferred by many users here. canon also makes some good products. i was frankly skeptical about switching from silver to digital prints, but the quality of hardware, software and print materials (papers, inks, etc) these days allows for some great results. there are some hybrid approaches as well, e.g., printing digital files on to silver papers (generally requiring an outside service), but i haven't gone that route. lots to read, but feel free to ask specific questions if you get to that point. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 107325, "year": "2013"}, {"autor": "Michael Hiles", "date": "2013-06-23 22:49:00", "content": "Thanks Andy. I think I can make a pretty competent print, but anything larger than 11 x 14 is a pain in the lower back, what with big trays and washing and drying challenges, so I am interested in what other quality options might be available. Much appreciated.", "link": "https://www.l-camera-forum.com/topic/207412-ilford-lab-direct/?tab=comments#comment-2356850", "origin": "L-forum", "suborigin": "207412-ilford-lab-direct", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "thanks andy. -----> i !!!  think -----> i !!!  -----> can !!!  -----> make !!!  a pretty competent print, but anything larger than 11 x 14 is a pain in the lower back, what with big trays and washing and drying challenges, so -----> i !!!  am interested in what other quality options might be available. much appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 107367, "year": "2013"}, {"autor": "Michael Hiles", "date": "2013-08-13 11:56:00", "content": " I just received a print from Ilford Labs Direct that I ordered about 8 days ago. I scanned my XP2 negative and prepared a file using Photoshop Elements and SilverEfexPro to get the nuances I think best expressed the original idea when I made the picture. I sent the file down the line to Ilford (55megs) and ordered a 12 x 18 glossy print. The result is superb. The print matches completely what the file shows on my screen – i.e. the reproduction is perfect, as far as I can see by comparing my screen with the print. This is the second time I have had a print made by Ilford Lab Direct and they are shooting 2 for 2. The advantage for me is that the print is a true silver gelatin print – not an ink jet. I am keen on silver prints – in my view they continue to be the gold (or more likely Silver) standard and it is great to have a service that can take a digital file and produce a winner of a print from a file that I control. The price was £27.31 all in - including shipping to Montreal. If you are working particularly with a Monochrom, I think you will be pleased.", "link": "https://www.l-camera-forum.com/topic/207412-ilford-lab-direct/?tab=comments#comment-2396555", "origin": "L-forum", "suborigin": "207412-ilford-lab-direct", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": " i just received a print from ilford labs direct that i ordered about 8 days ago. -----> i !!!  scanned my xp2 negative and prepared a file using photoshop elements and silverefexpro to get the nuances -----> i !!!  think best expressed the original idea when -----> i !!!  -----> made !!!  the picture. i sent the file down the line to ilford (55megs) and ordered a 12 x 18 glossy print. the result is superb. the print matches completely what the file shows on my screen – i.e. the reproduction is perfect, as far as i can see by comparing my screen with the print. this is the second time i have had a print made by ilford lab direct and they are shooting 2 for 2. the advantage for me is that the print is a true silver gelatin print – not an ink jet. i am keen on silver prints – in my view they continue to be the gold (or more likely silver) standard and it is great to have a service that can take a digital file and produce a winner of a print from a file that i control. the price was £27.31 all in - including shipping to montreal. if you are working particularly with a monochrom, i think you will be pleased.", "sortedWord": "None", "Identifyer": null, "identifyer": 107371, "year": "2013"}, {"autor": "Michael Hiles", "date": "2013-08-13 18:44:00", "content": "Just out of interest were you using an Apple IMac , I live very close to Ilford at Mobberley and have recently used their facilities to have a Black and White film processed and printed, and have considered using them to have an enlargement done. Their website gives advice, re altering the settings to about \"half brightness\" to produce a realistic and accurate print regarding exposure etc. Thanks for the information regarding the print. I'm also waiting to get a file that I really want printing and I'm going to try having it printed on barayta paper, just to see quite what it is capable. The lab \" Whitewall\" seem to be offering that. At least one excellent photographer and contributor to this forum has suggested that they are very good generally, and they have recently begun to offer this service. I use a Windows machine, PS Elements and SilverEfex Pro (v1). I also have heard good things about Whitewall, but never tried them. I will look. I didn't do what Ilford suggested about \"half brightness\". I just made sure that I was getting Zone I blacks and Zone IX whites and good shadow details. SIlverEfexPro is terrific in this regard - very powerful. In fact, Digital SIlver Imaging strongly recommends preparing files using this software, and I think that is the best route (certainly as far as I can see).", "link": "https://www.l-camera-forum.com/topic/207412-ilford-lab-direct/?tab=comments#comment-2396817", "origin": "L-forum", "suborigin": "207412-ilford-lab-direct", "result": true, "Selector": "i just made", "selectorShort": "make", "MarkedSent": "just out of interest were you using an apple imac , i live very close to ilford at mobberley and have recently used their facilities to have a black and white film processed and printed, and have considered using them to have an enlargement done. their website gives advice, re altering the settings to about \"half brightness\" to produce a realistic and accurate print regarding exposure etc. thanks for the information regarding the print. i'm also waiting to get a file that i really want printing and i'm going to try having it printed on barayta paper, just to see quite what it is capable. the lab \" whitewall\" seem to be offering that. at least one excellent photographer and contributor to this forum has suggested that they are very good generally, and they have recently begun to offer this service. i use a windows machine, ps elements and silverefex pro (v1). i also have heard good things about whitewall, but never tried them. i will look. i didn't do what ilford suggested about \"half brightness\". -----> i !!!  -----> just !!!  -----> made !!!  sure that -----> i !!!  was getting zone -----> i !!!  blacks and zone ix whites and good shadow details. silverefexpro is terrific in this regard - very powerful. in fact, digital silver imaging strongly recommends preparing files using this software, and i think that is the best route (certainly as far as i can see).", "sortedWord": "None", "Identifyer": null, "identifyer": 107373, "year": "2013"}, {"autor": "Lee Martin", "date": "2013-08-13 22:03:00", "content": "Thanks for the reply, I don't suppose there is anything I can do to make te Silver Efex pro version 1 work on snow leopard then ? I'll try and email the company and see if I get a response, but thanks for the info", "link": "https://www.l-camera-forum.com/topic/207412-ilford-lab-direct/?tab=comments#comment-2396953", "origin": "L-forum", "suborigin": "207412-ilford-lab-direct", "result": true, "Selector": "i can do to make", "selectorShort": "make", "MarkedSent": "thanks for the reply, -----> i !!!  -----> do !!! n't suppose there is anything -----> i !!!  -----> can !!!  -----> do !!!  -----> to !!!  -----> make !!!  te silver efex pro version 1 work on snow leopard then ? i'll try and email the company and see if i get a response, but thanks for the info", "sortedWord": "None", "Identifyer": null, "identifyer": 107377, "year": "2013"}, {"autor": "Guido", "date": "2013-08-13 22:14:00", "content": "Thanks for the reply, I don't suppose there is anything I can do to make te Silver Efex pro version 1 work on snow leopard then ? I'll try and email the company and see if I get a response, but thanks for the info Actually, Silver Efex Pro 1.007 worked with Snow Leopard 10.6.8 on my Mac too (I used it in conjunction with Photoshop CS 5 and LR 4.4). Did you already try to uninstall SFX after you upgraded to Snow Leopard (by opening the Nik installation package and running the \"Uninstaller\"), then install it again?", "link": "https://www.l-camera-forum.com/topic/207412-ilford-lab-direct/?tab=comments#comment-2396963", "origin": "L-forum", "suborigin": "207412-ilford-lab-direct", "result": true, "Selector": "i can do to make", "selectorShort": "make", "MarkedSent": "thanks for the reply, -----> i !!!  -----> do !!! n't suppose there is anything -----> i !!!  -----> can !!!  -----> do !!!  -----> to !!!  -----> make !!!  te silver efex pro version 1 work on snow leopard then ? i'll try and email the company and see if i get a response, but thanks for the info actually, silver efex pro 1.007 worked with snow leopard 10.6.8 on my mac too (i used it in conjunction with photoshop cs 5 and lr 4.4). did you already try to uninstall sfx after you upgraded to snow leopard (by opening the nik installation package and running the \"uninstaller\"), then install it again?", "sortedWord": "None", "Identifyer": null, "identifyer": 107378, "year": "2013"}, {"autor": "M.Hilo", "date": "2013-01-23 12:11:00", "content": " Hi! First time poster here, from The Netherlands. But long time Focomat user since 1980 . . . Still today, my darkroom looks like a forest of Focomats . . . 1C's, 2C and even the small Valloy . . . apart from using this equipment for my work, I also let people use this darkroom, to do fiberprints . . . I am looking for a (Leitz made?) filterholder for the 1C, that can replace the redfilter. From the enclosed picture you will have an idea what it is. Should anyone have it and is willing to let it go, please let me know. And, should anyone have it, but prefers to hold onto it, can you still let me know? - I may like to take the specific sizes, and have some made. I have the 1C's with filter drawer, this is perfect obviously. But I also have some beautiful 1C's without the filterdrawer and I would like to make them functional. I prefer not to lay the filters inside the head, remember I have others working with these enlargers and to me it is not a good idea they have to take off the top of the head. Thanks ! --img-- ", "link": "https://www.l-camera-forum.com/topic/196729-focomat-1c-looking-for-filterholder/?tab=comments#comment-2222533", "origin": "L-forum", "suborigin": "196729-focomat-1c-looking-for-filterholder", "result": true, "Selector": "i would like to make", "selectorShort": "make", "MarkedSent": " hi! first time poster here, from the netherlands. but long time focomat user since 1980 . . . still today, my darkroom looks like a forest of focomats . . . 1c's, 2c and even the small valloy . . . apart from using this equipment for my work, i also let people use this darkroom, to do fiberprints . . . i am looking for a (leitz made?) filterholder for the 1c, that can replace the redfilter. from the enclosed picture you will have an idea what it is. should anyone have it and is willing to let it go, please let me know. and, should anyone have it, but prefers to hold onto it, can you still let me know? - i may like to take the specific sizes, and have some made. i have the 1c's with filter drawer, this is perfect obviously. but -----> i !!!  also have some beautiful 1c's without the filterdrawer and -----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> make !!!  them functional. i prefer not to lay the filters inside the head, remember i have others working with these enlargers and to me it is not a good idea they have to take off the top of the head. thanks ! --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 107405, "year": "2013"}, {"autor": "M.Hilo", "date": "2013-03-07 08:02:00", "content": " For the Valoy II with the clear condensor I would like to make something to prevent Newton rings. Apparently, in one of the Valoy II or early Focomat 1C manuals, there is a drawing of how to cut it out of either film or paper, including the position of the pins of the negative holder. It doesn't look too difficult to figure it out anyway, but the original drawing would be handy. Perhaps it rings a bell with someone? Second question is if the anti Newton ring for the Focomat 1C is also meant to work on the Valoy II? Including the brass ring that needs to be installed under the condensor inside the head of the enlarger. Thanks a lot ! Machiel", "link": "https://www.l-camera-forum.com/topic/199909-valoy-ii-how-to-create-an-anti-newton-covering/?tab=comments#comment-2263254", "origin": "L-forum", "suborigin": "199909-valoy-ii-how-to-create-an-anti-newton-covering", "result": true, "Selector": "i would like to make", "selectorShort": "make", "MarkedSent": " for the valoy ii with the clear condensor -----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> make !!!  something -----> to !!!  prevent newton rings. apparently, in one of the valoy ii or early focomat 1c manuals, there is a drawing of how to cut it out of either film or paper, including the position of the pins of the negative holder. it doesn't look too difficult to figure it out anyway, but the original drawing would be handy. perhaps it rings a bell with someone? second question is if the anti newton ring for the focomat 1c is also meant to work on the valoy ii? including the brass ring that needs to be installed under the condensor inside the head of the enlarger. thanks a lot ! machiel", "sortedWord": "None", "Identifyer": null, "identifyer": 107486, "year": "2013"}, {"autor": "Cedric Agie de Selsaeten", "date": "2013-03-21 19:24:00", "content": "For the Valoy II with the clear condensor I would like to make something to prevent Newton rings. Apparently, in one of the Valoy II or early Focomat 1C manuals, there is a drawing of how to cut it out of either film or paper, including the position of the pins of the negative holder. It doesn't look too difficult to figure it out anyway, but the original drawing would be handy. Perhaps it rings a bell with someone? Second question is if the anti Newton ring for the Focomat 1C is also meant to work on the Valoy II? Including the brass ring that needs to be installed under the condensor inside the head of the enlarger. Thanks a lot ! Machiel Never heard of such a solution. The anti Newton ring is simply a scratched surface of a piece of transparent glas with a fine diamond tool. Check the diameter of both condensors to be sure.", "link": "https://www.l-camera-forum.com/topic/199909-valoy-ii-how-to-create-an-anti-newton-covering/?tab=comments#comment-2278448", "origin": "L-forum", "suborigin": "199909-valoy-ii-how-to-create-an-anti-newton-covering", "result": true, "Selector": "i would like to make", "selectorShort": "make", "MarkedSent": "for the valoy ii with the clear condensor -----> i !!!  -----> would !!!  -----> like !!!  -----> to !!!  -----> make !!!  something -----> to !!!  prevent newton rings. apparently, in one of the valoy ii or early focomat 1c manuals, there is a drawing of how to cut it out of either film or paper, including the position of the pins of the negative holder. it doesn't look too difficult to figure it out anyway, but the original drawing would be handy. perhaps it rings a bell with someone? second question is if the anti newton ring for the focomat 1c is also meant to work on the valoy ii? including the brass ring that needs to be installed under the condensor inside the head of the enlarger. thanks a lot ! machiel never heard of such a solution. the anti newton ring is simply a scratched surface of a piece of transparent glas with a fine diamond tool. check the diameter of both condensors to be sure.", "sortedWord": "None", "Identifyer": null, "identifyer": 107487, "year": "2013"}, {"autor": "albertospa", "date": "2013-11-24 11:07:00", "content": "Hello, I'm Alberto and I write from Italy. I used Leica for many years and I could not do without it. I use it both for pleasure and for business. I have a M6 and M9P with a variety of optical, but only up to 50mm. For now I can not find the nesessità to use longer lenses on these machines. I am a member since April 2012 and now I make my presentation. I apologize for this but I did not. thanks", "link": "https://www.l-camera-forum.com/topic/186962-welcome/page/3/?tab=comments#comment-2472585", "origin": "L-forum", "suborigin": "186962-welcome", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "hello, i'm alberto and i write from italy. i used leica for many years and i could not do without it. i use it both for pleasure and for business. i have a m6 and m9p with a variety of optical, but only up to 50mm. for now i can not find the nesessità to use longer lenses on these machines. -----> i !!!  am a member since april 2012 and now -----> i !!!  -----> make !!!  my presentation. i apologize for this but i did not. thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 113797, "year": "2013"}, {"autor": "Bill Clark", "date": "2013-12-22 20:35:00", "content": "Welcome to the Leica forum. Like you, I've been a pro photographer, second career, since 2002. Now that I'm 65 I'm trying to retire. I still get hired for a couple of weddings per year but I also make head shot business portraits. They find me through referral(s) and search me out using the internet. I recently bought a Leica III F and really enjoy film photography again! I develop and print black & white film. I look forward to making photographs of my family in 2014. Best to your success using Leica!", "link": "https://www.l-camera-forum.com/topic/218887-hello-new-to-leica/?tab=comments#comment-2493045", "origin": "L-forum", "suborigin": "218887-hello-new-to-leica", "result": true, "Selector": "i also make", "selectorShort": "make", "MarkedSent": "welcome to the leica forum. like you, i've been a pro photographer, second career, since 2002. now that i'm 65 i'm trying to retire. i still get hired for a couple of weddings per year but -----> i !!!  -----> also !!!  -----> make !!!  head shot business portraits. they find me through referral(s) and search me out using the internet. i recently bought a leica iii f and really enjoy film photography again! i develop and print black & white film. i look forward to making photographs of my family in 2014. best to your success using leica!", "sortedWord": "None", "Identifyer": null, "identifyer": 115489, "year": "2013"}, {"autor": "MPWhite", "date": "2013-08-23 17:24:00", "content": " I am at the crossroad so to speak. I have a M-4 (Black Wetzler) as well as a 35mm f2; 50mm f2; 90mm f2.8; 135mm 2.8 and the Black MR4 meter.... As well as a V-lux 2 and a V-lux 4 Do, I keep the M-4 or do I finally give it up and see what I can get to use with my M lenses? Or do I just sell the whole M system? Retired, and on a fixed income, I must make the choice. I understand there will be a photo show in my area on the 1st of September, so I am asking for some suggestions. Thank you for your time reading my ramblings.", "link": "https://www.l-camera-forum.com/topic/211288-at-the-crossroad/?tab=comments#comment-2403826", "origin": "L-forum", "suborigin": "211288-at-the-crossroad", "result": true, "Selector": "i must make", "selectorShort": "make", "MarkedSent": " i am at the crossroad so to speak. i have a m-4 (black wetzler) as well as a 35mm f2; 50mm f2; 90mm f2.8; 135mm 2.8 and the black mr4 meter.... as well as a v-lux 2 and a v-lux 4 do, i keep the m-4 or do i finally give it up and see what i can get to use with my m lenses? or do i just sell the whole m system? retired, and on a fixed income, -----> i !!!  -----> must !!!  -----> make !!!  the choice. i understand there will be a photo show in my area on the 1st of september, so i am asking for some suggestions. thank you for your time reading my ramblings.", "sortedWord": "None", "Identifyer": null, "identifyer": 115678, "year": "2013"}, {"autor": "EddieB", "date": "2013-08-09 20:06:00", "content": " Not strictly my first post on the forum, but the few others have been one line responses to others' comments or queries. I've been following the forum for quite a while, although, like many, I haven't started any threads. I've been in photography - strictly keen amateur only - for over 30 years and I'd built up quite a collection of cameras and formats over that time - including Leica. A few years ago I think I must have been hit with Leica fever; as a result I recently bagged up a whole bundle of camera gear and took a trip to Ffordes (Scotland), where I did a trade for a couple extra Leica lenses and some stuff to let me get photographs on the web. So now I'm down to just 35mm film (M4 and M6TTL) and the M9. With a bit of help and encouragement from Bruce Robbins (check out his blog The Online Darkroom) I've managed to start my own blog, which is intended to track my progress with the \"Leicas only\" approach. If you're interested (or just can't think of anything better to do) the blog is at : A Tale of Three Leicas I'd be interested in any feedback - I've tried not to make it just another gear talk shop. It's more about the photographs and the background story to some of them. Best Regards EddieB", "link": "https://www.l-camera-forum.com/topic/210470-new-blog-started/?tab=comments#comment-2394080", "origin": "L-forum", "suborigin": "210470-new-blog-started", "result": true, "Selector": "i've tried not to make", "selectorShort": "make", "MarkedSent": " not strictly my first post on the forum, but the few others have been one line responses to others' comments or queries. i've been following the forum for quite a while, although, like many, i haven't started any threads. i've been in photography - strictly keen amateur only - for over 30 years and i'd built up quite a collection of cameras and formats over that time - including leica. a few years ago i think i must have been hit with leica fever; as a result i recently bagged up a whole bundle of camera gear and took a trip to ffordes (scotland), where i did a trade for a couple extra leica lenses and some stuff to let me get photographs on the web. so now i'm down to just 35mm film (m4 and m6ttl) and the m9. with a bit of help and encouragement from bruce robbins (check out his blog the online darkroom) i've managed to start my own blog, which is intended to track my progress with the \"leicas only\" approach. if you're interested (or just can't think of anything better -----> to !!!  do) the blog is at : a tale of three leicas -----> i !!! 'd be interested in any feedback - -----> i !!! 've -----> tried !!!  -----> not !!!  -----> to !!!  -----> make !!!  it just another gear talk shop. it's more about the photographs and the background story to some of them. best regards eddieb", "sortedWord": "None", "Identifyer": null, "identifyer": 115706, "year": "2013"}, {"autor": "dgc", "date": "2013-08-05 18:15:00", "content": " Hello. I am new to rangefinders and Leica having recently bought the M7 and 50mm/f2, a medium I first started using 30 years ago. I have fallen for Leica, hook line and sinker, so much so that I put my name on the waiting list for the M. But I cannot get my head round the idea of spending £5000 for a camera where the lenses, to me, are the main reason to buy into the system. I am an enthusiast who takes photographs of landscapes and when travelling; I prefer B&W, which the M7 will fulfill. I have been on the waiting list for 3 months now, but I cannot stop trying to talk myself out of this. I bought the M7 in order to slow my photography down and take more time composing each shot. I found that using a DSLR became an extension of a point and shoot where you could take image after image and manipulate them as you would wish in post production. I am considering the following options: 1. Remove my name from the M list and remain faithful to my Canon 5Dii and newly acquired M7 for B&W. a. Get the 35mm ASPH f1.4 (#11663) with the money saved. I have recently found that the 50mm does not provide a sufficient angle of view for all my needs. However, would the 35mm f2 (#11879) be as good for street and landscape photography? I can always push process my film should I need a higher ISO. Several threads suggest flare and CA as issues on the Summilux. Please do not bring the ASPHERICAL and any earlier versions into the discussion (I am still waiting for member IWC Doppel to complete his comparison test with the 35mm ASPH FLE version from another thread !) 2. Continue with my purchase of the M. 3. Wait for the next reincarnation of the M, but when will this be - 2015 ?? 4. Get a Fuji X100s/ X Pro 1 for colour to compliment my M7. I understand that my M may become available in December, so I have plenty of time to decide and I know that only I can make this decision (and I think I have made a decision from simply putting this down in words) but other members' thoughts and similar woes would be appreciated. Especially on the M and 35mm lenses where there appears to be much subjectivity and personal preference. Thanks for listening ! David", "link": "https://www.l-camera-forum.com/topic/210233-should-i-keep-waiting-for-the-m/?tab=comments#comment-2391024", "origin": "L-forum", "suborigin": "210233-should-i-keep-waiting-for-the-m", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": " hello. i am new to rangefinders and leica having recently bought the m7 and 50mm/f2, a medium i first started using 30 years ago. i have fallen for leica, hook line and sinker, so much so that i put my name on the waiting list for the m. but i cannot get my head round the idea of spending £5000 for a camera where the lenses, to me, are the main reason to buy into the system. i am an enthusiast who takes photographs of landscapes and when travelling; i prefer b&w, which the m7 will fulfill. i have been on the waiting list for 3 months now, but i cannot stop trying to talk myself out of this. i bought the m7 in order to slow my photography down and take more time composing each shot. i found that using a dslr became an extension of a point and shoot where you could take image after image and manipulate them as you would wish in post production. i am considering the following options: 1. remove my name from the m list and remain faithful to my canon 5dii and newly acquired m7 for b&w. a. get the 35mm asph f1.4 (#11663) with the money saved. i have recently found that the 50mm does not provide a sufficient angle of view for all my needs. however, would the 35mm f2 (#11879) be as good for street and landscape photography? i can always push process my film should i need a higher iso. several threads suggest flare and ca as issues on the summilux. please do not bring the aspherical and any earlier versions into the discussion (i am still waiting for member iwc doppel to complete his comparison test with the 35mm asph fle version from another thread !) 2. continue with my purchase of the m. 3. wait for the next reincarnation of the m, but when will this be - 2015 ?? 4. get a fuji x100s/ x pro 1 for colour to compliment my m7. -----> i !!!  understand that my m may become available in december, so -----> i !!!  have plenty of time to decide and -----> i !!!  know that only -----> i !!!  -----> can !!!  -----> make !!!  this decision (and -----> i !!!  think -----> i !!!  have made a decision from simply putting this down in words) but other members' thoughts and similar woes would be appreciated. especially on the m and 35mm lenses where there appears to be much subjectivity and personal preference. thanks for listening ! david", "sortedWord": "None", "Identifyer": null, "identifyer": 115714, "year": "2013"}, {"autor": "LUF Admin", "date": "2013-07-22 11:38:00", "content": " After some trouble in the German Café Leitz I thought that the rules and the underlying purpose of this forum needed a kind of explanation - call it a kind of \"Mission Statement\".No new rules but a clarification of the existing ones.What the Leica Forum is forThis is the Leica Forum. Leica is its primary theme.Subjects include Leica products, Leica photos, the Leica Camera company. It’s for everyone with an interest in Leica.Anyone who is interested in Leica can inform themselves here and interact with others.This is a meeting place for people from all over the world who enjoy and take an interest in Leica. Purely factual information is important but so is passion and contact with other enthusiasts. A balance has to be struck so that everyone can feel at ease.Everyone is welcome, as long as they show respect for other members, their opinions and the forum rules.Mutual respect is the most important requirement, so that people from different backgrounds, religion and ideology can interact.The rules of the forum exist to facilitate interaction by laying down how we should behave towards each other as well as the technical and legal rules. If you don’t respect the rules of the game, you can’t play.Criticism is explicitly welcomed, as long as it remains objective and does not become an end in itself.There is probably nowhere on the planet where so much and such harsh criticism of Leica is expressed. There is nothing wrong with that.There are, however, limits. Unsubstantiated or defamatory criticism has no place here any more than do the same points repeated over and over again like a mantra.The same goes when it comes to criticising photos. It takes a certain courage to put forward one’s pictures for open discussion.If you don’t like a photo, there’s nothing wrong with offering constructive criticism. What we won’t put up with are derogatory, insulting and disparaging comments.When you post your contribution, please bear in mind that the person you are addressing doesn’t know you or your tone of voice, your gestures or the expression on your face, and may not share your sense of humour. Misunderstandings cannot be 100% avoided but we must all try not to offend the other person. Saying “no offence meant” or that it was just a joke doesn’t help if the other person has taken it the wrong way.What the forum is not forThis isn’t the place for those who think that Leica, Leica products and Leica customers are inadequate, deceitful or stupid.Some members, apparently, use the forum exclusively to express the same criticisms again and again, spoiling for others the enjoyment of their hobby.This isn’t a forum for sycophants and fanboys but neither is it a Leica-bashing community. No-one in the Leica forum should ever have to justify their purchase of a Leica product or their enjoyment of it.This isn’t the place for proselytisingNo matter whether it’s political, religious or ideological, or concerns a specific brand (though with Leica we are more tolerant), anyone who seeks to impose their “truth” on others, should please do so elsewhere. They are excluded so that our forum can operate as a mixture of different people with a variety of religious, ideological and political convictions.No more political, ideological or religious discussionCafé Leitz and Barnack's Bar were set up at the end of 2011 as a place for off-topic discussions. Lately it has become, unfortunately, a place for regulars to air subjects which have nothing to do with Leica or photography (OK, off-topic) but do have maximum potential for stirring up trouble. And that is not OK.The conflicts and animosities in Café Leitz / Barnack's Bar are spreading to other parts of the forum. That is why, with immediate effect, we are going to close and remove discussions of that kind in Café Leitz / Barnack's Bar and elsewhere. Our decision will appear subjective but it is based on our experience as a moderator and on what is best for the forum.Unpleasant facts (not really)In conclusion, some information about my role as administrator of the forum.This forum is a commercial undertaking.With 15,000 visitors daily, this forum cannot be managed as a hobby. After a long period of muddling through I have made this forum my main job and I make my living from it.It takes a lot of work and it costs money, so I don’t feel guilty about making money from it.The good news is that I enjoy doing it and, as the Leica forum now generates a large proportion of my income, I have a fundamental interest in keeping the shop going. You can rely, therefore, on its continuing.This forum is not a democracy.That sounds bad but it needs saying once in a while. As administrator I bear, more or less on my own, the technical, legal and financial responsibility for the forum. I am happy to accept that but I can only do so if I am free to make decisions.Now for the good news. I value my customers and will do my best to help you feel good about being here. To that end I will always consult you but, ultimately, I alone will make the decisions, to ensure that due regard is had to every aspect of the matter (e.g. technical, legal and financial).Andreas JürgensenAdmin & OwnerTranslation by euston (Thanks!) Edited January 23, 2017 by LUF Admin Changed format", "link": "https://www.l-camera-forum.com/topic/209327-what-the-leica-forum-is-for/?tab=comments#comment-2379897", "origin": "L-forum", "suborigin": "209327-what-the-leica-forum-is-for", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": " after some trouble in the german café leitz i thought that the rules and the underlying purpose of this forum needed a kind of explanation - call it a kind of \"mission statement\".no new rules but a clarification of the existing ones.what the leica forum is forthis is the leica forum. leica is its primary theme.subjects include leica products, leica photos, the leica camera company. it’s for everyone with an interest in leica.anyone who is interested in leica can inform themselves here and interact with others.this is a meeting place for people from all over the world who enjoy and take an interest in leica. purely factual information is important but so is passion and contact with other enthusiasts. a balance has to be struck so that everyone can feel at ease.everyone is welcome, as long as they show respect for other members, their opinions and the forum rules.mutual respect is the most important requirement, so that people from different backgrounds, religion and ideology can interact.the rules of the forum exist to facilitate interaction by laying down how we should behave towards each other as well as the technical and legal rules. if you don’t respect the rules of the game, you can’t play.criticism is explicitly welcomed, as long as it remains objective and does not become an end in itself.there is probably nowhere on the planet where so much and such harsh criticism of leica is expressed. there is nothing wrong with that.there are, however, limits. unsubstantiated or defamatory criticism has no place here any more than do the same points repeated over and over again like a mantra.the same goes when it comes to criticising photos. it takes a certain courage to put forward one’s pictures for open discussion.if you don’t like a photo, there’s nothing wrong with offering constructive criticism. what we won’t put up with are derogatory, insulting and disparaging comments.when you post your contribution, please bear in mind that the person you are addressing doesn’t know you or your tone of voice, your gestures or the expression on your face, and may not share your sense of humour. misunderstandings cannot be 100% avoided but we must all try not to offend the other person. saying “no offence meant” or that it was just a joke doesn’t help if the other person has taken it the wrong way.what the forum is not forthis isn’t the place for those who think that leica, leica products and leica customers are inadequate, deceitful or stupid.some members, apparently, use the forum exclusively to express the same criticisms again and again, spoiling for others the enjoyment of their hobby.this isn’t a forum for sycophants and fanboys but neither is it a leica-bashing community. no-one in the leica forum should ever have to justify their purchase of a leica product or their enjoyment of it.this isn’t the place for proselytisingno matter whether it’s political, religious or ideological, or concerns a specific brand (though with leica we are more tolerant), anyone who seeks to impose their “truth” on others, should please do so elsewhere. they are excluded so that our forum can operate as a mixture of different people with a variety of religious, ideological and political convictions.no more political, ideological or religious discussioncafé leitz and barnack's bar were set up at the end of 2011 as a place for off-topic discussions. lately it has become, unfortunately, a place for regulars to air subjects which have nothing to do with leica or photography (ok, off-topic) but do have maximum potential for stirring up trouble. and that is not ok.the conflicts and animosities in café leitz / barnack's bar are spreading to other parts of the forum. that is why, with immediate effect, we are going to close and remove discussions of that kind in café leitz / barnack's bar and elsewhere. our decision will appear subjective but it is based on our experience as a moderator and on what is best for the forum.unpleasant facts (not really)in conclusion, some information about my role as administrator of the forum.this forum is a commercial undertaking.with 15,000 visitors daily, this forum cannot be managed as a hobby. after a long period of muddling through -----> i !!!  -----> have !!!  -----> made !!!  this forum my main job and -----> i !!!  make my living from it.it takes a lot of work and it costs money, so -----> i !!!  don’t feel guilty about making money from it.the good news is that -----> i !!!  enjoy doing it and, as the leica forum now generates a large proportion of my income, -----> i !!!  -----> have !!!  a fundamental interest in keeping the shop going. you can rely, therefore, on its continuing.this forum is not a democracy.that sounds bad but it needs saying once in a while. as administrator i bear, more or less on my own, the technical, legal and financial responsibility for the forum. i am happy to accept that but i can only do so if i am free to make decisions.now for the good news. i value my customers and will do my best to help you feel good about being here. to that end i will always consult you but, ultimately, i alone will make the decisions, to ensure that due regard is had to every aspect of the matter (e.g. technical, legal and financial).andreas jürgensenadmin & ownertranslation by euston (thanks!) edited january 23, 2017 by luf admin changed format", "sortedWord": "None", "Identifyer": null, "identifyer": 115916, "year": "2013"}, {"autor": "erl", "date": "2013-12-09 23:42:00", "content": "As for moderators being appointed, apparently, for life, I think that’s a bad thing. There should be a turnover to help bring a different perspective from time to time to the task of moderating the forum. That’s what I mean by a bit of a shake up. I am unaware that mods are appointed 'for life'. I am of the understanding that it is only for the time that Anreas wishes, not specified otherwise. Since you ask, it's you, erl, who heads my list of moderators who have run their course. No surprise there, I’m sure. I’m never convinced that you understand the issues in these discussions about how the forum operates and you don’t appear to read other people’s posts very carefully. None of which prevents you becoming quarrelsome and combative in your responses - just as you're being now, I would say. I expect you're a wonderful human being in all other aspects of your life but, as far as I'm concerned, you are not suited to the role of moderator. Thank you for your frankness in naming me. At least it is clear and there are no surprises there. My understanding of issues in any discussion may not be up to your intellectual level, but I generally restrict myself to intervening only when a post is reported. Rarely on my own initiative. Of course if a poster comments directly about me I am inclined to respond. As for being quarrelsome and combative, well I don't agree, but that is just my POV, as opposed to yours. However, when it comes to forum rules, unlike reading peoples posts, I am obliged to oversee, not necessarily agree. When my authority as a moderator is questioned, I make no pretense at being polite. OTOH, my opinions as an ordinary member may always be criticized, and that is not a problem with me. As to my suitability as a moderator, or as you state, I am not suited, please address your particular dissatisfaction directly to Andeas. As I am not inclined to resign based on your view of my unsuitability, Andreas can simply terminate my position should he agree with you.", "link": "https://www.l-camera-forum.com/topic/218114-if/page/3/?tab=comments#comment-2484001", "origin": "L-forum", "suborigin": "218114-if", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "as for moderators being appointed, apparently, for life, i think that’s a bad thing. there should be a turnover to help bring a different perspective from time to time to the task of moderating the forum. that’s what i mean by a bit of a shake up. i am unaware that mods are appointed 'for life'. i am of the understanding that it is only for the time that anreas wishes, not specified otherwise. since you ask, it's you, erl, who heads my list of moderators who have run their course. no surprise there, i’m sure. i’m never convinced that you understand the issues in these discussions about how the forum operates and you don’t appear to read other people’s posts very carefully. none of which prevents you becoming quarrelsome and combative in your responses - just as you're being now, i would say. i expect you're a wonderful human being in all other aspects of your life but, as far as i'm concerned, you are not suited to the role of moderator. thank you for your frankness in naming me. at least it is clear and there are no surprises there. my understanding of issues in any discussion may not be up to your intellectual level, but i generally restrict myself to intervening only when a post is reported. rarely on my own initiative. of course if a poster comments directly about me i am inclined to respond. as for being quarrelsome and combative, well i don't agree, but that is just my pov, as opposed to yours. however, when it comes to forum rules, unlike reading peoples posts, i am obliged to oversee, not necessarily agree. when my authority as a moderator is questioned, -----> i !!!  -----> make !!!  no pretense at being polite. otoh, my opinions as an ordinary member may always be criticized, and that is not a problem with me. as to my suitability as a moderator, or as you state, i am not suited, please address your particular dissatisfaction directly to andeas. as i am not inclined to resign based on your view of my unsuitability, andreas can simply terminate my position should he agree with you.", "sortedWord": "None", "Identifyer": null, "identifyer": 120041, "year": "2013"}, {"autor": "euston", "date": "2013-12-10 11:16:00", "content": "I can't see that happening, ever ! No , nor can I, azzo, but I’ve made the offer I was challenged to make.", "link": "https://www.l-camera-forum.com/topic/218114-if/page/3/?tab=comments#comment-2484223", "origin": "L-forum", "suborigin": "218114-if", "result": true, "Selector": "i’ve made", "selectorShort": "make", "MarkedSent": "i can't see that happening, ever ! no , nor can -----> i !!! , azzo, but -----> i !!! ’ve -----> made !!!  the offer -----> i !!!  was challenged to make.", "sortedWord": "None", "Identifyer": null, "identifyer": 120050, "year": "2013"}, {"autor": "appleman", "date": "2013-09-11 19:53:00", "content": "I know all that. All I'm saying is that if I make a post to say, the M9 forum, I never see it on the International Forum, why?", "link": "https://www.l-camera-forum.com/topic/212561-posts/?tab=comments#comment-2418648", "origin": "L-forum", "suborigin": "212561-posts", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "i know all that. all -----> i !!! 'm saying is that if -----> i !!!  -----> make !!!  a post to say, the m9 forum, -----> i !!!  never see it on the international forum, why?", "sortedWord": "None", "Identifyer": null, "identifyer": 120145, "year": "2013"}, {"autor": "stunsworth", "date": "2013-09-11 20:06:00", "content": "I know all that. All I'm saying is that if I make a post to say, the M9 forum, I never see it on the International Forum, why? I'm clearly missing something, but it does appear in the International Forum. Here's the structure of the Bar - you can see this near the top of the screen... Leica User Forum > International User Forum > General Leica Discussions > Barnack's Bar And here's the structure of the M9 forum... Leica User Forum > International User Forum > Leica Products > Leica M / M-E / M9 / Monochrom Both forums fall within the \"International User Forum\"", "link": "https://www.l-camera-forum.com/topic/212561-posts/?tab=comments#comment-2418669", "origin": "L-forum", "suborigin": "212561-posts", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "i know all that. all -----> i !!! 'm saying is that if -----> i !!!  -----> make !!!  a post to say, the m9 forum, -----> i !!!  never see it on the international forum, why? i'm clearly missing something, but it does appear in the international forum. here's the structure of the bar - you can see this near the top of the screen... leica user forum > international user forum > general leica discussions > barnack's bar and here's the structure of the m9 forum... leica user forum > international user forum > leica products > leica m / m-e / m9 / monochrom both forums fall within the \"international user forum\"", "sortedWord": "None", "Identifyer": null, "identifyer": 120146, "year": "2013"}, {"autor": "Sandokan", "date": "2013-09-11 20:09:00", "content": "I know all that. All I'm saying is that if I make a post to say' date=' the M9 forum, I never see it on the International Forum, why?[/quote'] What do you see in the International Forum? What application are you using to view the forum?", "link": "https://www.l-camera-forum.com/topic/212561-posts/?tab=comments#comment-2418672", "origin": "L-forum", "suborigin": "212561-posts", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "i know all that. all -----> i !!! 'm saying is that if -----> i !!!  -----> make !!!  a post to say' date=' the m9 forum, -----> i !!!  never see it on the international forum, why?[/quote'] what do you see in the international forum? what application are you using to view the forum?", "sortedWord": "None", "Identifyer": null, "identifyer": 120147, "year": "2013"}, {"autor": "Gibbo", "date": "2013-10-20 21:39:00", "content": "Being new to the challenge and not being fully aware of its history I didn't know of any restrictions. Neither Lynn or I can attend next year but didn't think that excluded us from voting on the night, did it? I voted for Tokyo because of the places suggested it was the one I would like to see pictures of when we come to vote next year. I gave no more than a fleeting thought to the practicalities other than taking into account that we had a member from Australia with us this year so assumed it was a worldwide choice we were making. A point was made after the selection of the three possible venues had been made was that it should be a destination that eastjet serve, is this true? To how many is that relevant if it is? I don't know that many got to Wetzlar via them this year. Sorry if my choice runs counter to the historical precedents but I really wasn't aware of them.", "link": "https://www.l-camera-forum.com/topic/215043-istanbul-challenge-the-winner/?tab=comments#comment-2446766", "origin": "L-forum", "suborigin": "215043-istanbul-challenge-the-winner", "result": true, "Selector": "we were making", "selectorShort": "make", "MarkedSent": "being new to the challenge and not being fully aware of its history i didn't know of any restrictions. neither lynn or i can attend next year but didn't think that excluded us from voting on the night, did it? i voted for tokyo because of the places suggested it was the one i would like to see pictures of when we come to vote next year. i gave no more than a fleeting thought to the practicalities other than taking into account that -----> we !!!  had a member from australia with us this year so assumed it was a worldwide choice -----> we !!!  -----> were !!!  -----> making !!! . a point was made after the selection of the three possible venues had been made was that it should be a destination that eastjet serve, is this true? to how many is that relevant if it is? i don't know that many got to wetzlar via them this year. sorry if my choice runs counter to the historical precedents but i really wasn't aware of them.", "sortedWord": "None", "Identifyer": null, "identifyer": 134578, "year": "2013"}, {"autor": "masjah", "date": "2013-10-21 07:59:00", "content": "For the one challenge 2614 I propose Kepler-22b. Though we'd need to set off early next week if we're to get there on time. Nice idea, though we'd better make it 2714, so Tom and Eileen can set off in good time in the Land Rover. More seriously, Tokyo would be a total non-starter for us, and not just for the expense. Not that expense isn't the major consideration! I suspect that £100 per night might get you a bunk in one of those cubicle hotels. By the time you've paid air fares, reasonable hotels and meals for two, you could buy a modest second-hand car of half-decent quality (or take your pick of the equivalent cost in s/h Leica gear). Priorities. I'd like to echo Andy's words about the work involved in the organisation. I did the second seaside challenge at Whitby, which was an absolute doddle in comparison, but it still needed a recce trip. So renewed thanks and appreciation to all past and present organisers.", "link": "https://www.l-camera-forum.com/topic/215043-istanbul-challenge-the-winner/page/2/?tab=comments#comment-2447028", "origin": "L-forum", "suborigin": "215043-istanbul-challenge-the-winner", "result": true, "Selector": "we'd better make", "selectorShort": "make", "MarkedSent": "for the one challenge 2614 i propose kepler-22b. though we'd need to set off early next week if we're to get there on time. nice idea, though -----> we !!! -----> 'd !!!  -----> better !!!  -----> make !!!  it 2714, so tom and eileen can set off in good time in the land rover. more seriously, tokyo would be a total non-starter for us, and not just for the expense. not that expense isn't the major consideration! i suspect that £100 per night might get you a bunk in one of those cubicle hotels. by the time you've paid air fares, reasonable hotels and meals for two, you could buy a modest second-hand car of half-decent quality (or take your pick of the equivalent cost in s/h leica gear). priorities. i'd like to echo andy's words about the work involved in the organisation. i did the second seaside challenge at whitby, which was an absolute doddle in comparison, but it still needed a recce trip. so renewed thanks and appreciation to all past and present organisers.", "sortedWord": "None", "Identifyer": null, "identifyer": 134587, "year": "2013"}, {"autor": "cbretteville", "date": "2013-11-08 15:04:00", "content": "Istambul will be exiting. The Mrs and I will make an effort to attend. Cheers, Carl", "link": "https://www.l-camera-forum.com/topic/215043-istanbul-challenge-the-winner/page/3/?tab=comments#comment-2460764", "origin": "L-forum", "suborigin": "215043-istanbul-challenge-the-winner", "result": true, "Selector": "i will make", "selectorShort": "make", "MarkedSent": "istambul will be exiting. the mrs and -----> i !!!  -----> will !!!  -----> make !!!  an effort to attend. cheers, carl", "sortedWord": "None", "Identifyer": null, "identifyer": 134611, "year": "2013"}, {"autor": "DigitalHeMan", "date": "2013-11-16 18:51:00", "content": "Hi Carsten, First piece of advice - don't book a hotel yet! A lot of hotels won't have worked out their discounted rates for that far ahead yet, and you will only find the full price room rates listed on online sites until nearer the time. I have stayed at a number of hotels in Istanbul over the years, and have never had a bad experience. But it does depend on how much you wish to spend. At the top of the scale places like intercontinental are really excellent, but pricey. Middle range Marmara, Grand Hyatt, and Swisshotel Bosphorous are all good. There are plenty at the budget end as well - most recently I stayed at Ramada Taksim which iirc was less than 100€ per night, and it was a good hotel, well located. It's probably worth one of us making some formal suggestions for members to book - I can check that with friends in Istanbul once the program is a bit more known. Istanbul is huge and if everyone has free choice we will end up being very far apart from one another. Would definitely suggest staying on the European side, and probably around Taksim makes a lot of sense.", "link": "https://www.l-camera-forum.com/topic/215043-istanbul-challenge-the-winner/page/3/?tab=comments#comment-2467128", "origin": "L-forum", "suborigin": "215043-istanbul-challenge-the-winner", "result": true, "Selector": "us making", "selectorShort": "make", "MarkedSent": "hi carsten, first piece of advice - don't book a hotel yet! a lot of hotels won't have worked out their discounted rates for that far ahead yet, and you will only find the full price room rates listed on online sites until nearer the time. i have stayed at a number of hotels in istanbul over the years, and have never had a bad experience. but it does depend on how much you wish to spend. at the top of the scale places like intercontinental are really excellent, but pricey. middle range marmara, grand hyatt, and swisshotel bosphorous are all good. there are plenty at the budget end as well - most recently i stayed at ramada taksim which iirc was less than 100€ per night, and it was a good hotel, well located. it's probably worth one of -----> us !!!  -----> making !!!  some formal suggestions for members to book - i can check that with friends in istanbul once the program is a bit more known. istanbul is huge and if everyone has free choice we will end up being very far apart from one another. would definitely suggest staying on the european side, and probably around taksim makes a lot of sense.", "sortedWord": "None", "Identifyer": null, "identifyer": 134613, "year": "2013"}, {"autor": "stunsworth", "date": "2013-11-16 19:00:00", "content": "Last time I was there I stayed in the Agia Sofia/Topkapi Palace area. If I make it next year I plan to stay in the same area. I think I paid around £10 a night - but it was 20+ years ago.", "link": "https://www.l-camera-forum.com/topic/215043-istanbul-challenge-the-winner/page/3/?tab=comments#comment-2467137", "origin": "L-forum", "suborigin": "215043-istanbul-challenge-the-winner", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "last time i was there i stayed in the agia sofia/topkapi palace area. if -----> i !!!  -----> make !!!  it next year -----> i !!!  plan to stay in the same area. i think i paid around £10 a night - but it was 20+ years ago.", "sortedWord": "None", "Identifyer": null, "identifyer": 134615, "year": "2013"}, {"autor": "erl", "date": "2013-11-28 02:43:00", "content": "Somehow I have missed this thread, despite originally voting (for Tokyo) in it. However, being a great Turkey fan, especially of Istanbul, I approve the choice, despite it STILL being so bloody far from home. I have no idea if I will ever make it there. It will be a short notice choice like Wetzlar for me which was done on four days decision. I can definitely state that Istanbul is one of those destinations that offers Soooo much photographically that allocating extra time there will be richly rewarded. I'm not going to give away specific locations (just in case I make it and want to shoot competitively --img-- ), but there will be no shortage of excitement for your camera, or self. The Pera Palace in Taxim is fabulous for at least one night's accommodation. I remember joining the belly dancer for the floor show and being given some \"consideration\" afterwards by the management. There are a number of interesting rooms there dedicated to people such as Agatha Christie and Ataturk, amongst others who stayed there. Management said they would dedicate a room to me after my performance, but I doubt it really happened. However, I am confident the local deros will remember me kindly and I them. Edited November 28, 2013 by erl", "link": "https://www.l-camera-forum.com/topic/215043-istanbul-challenge-the-winner/page/4/?tab=comments#comment-2475486", "origin": "L-forum", "suborigin": "215043-istanbul-challenge-the-winner", "result": true, "Selector": "i will ever make", "selectorShort": "make", "MarkedSent": "somehow i have missed this thread, despite originally voting (for tokyo) in it. however, being a great turkey fan, especially of istanbul, i approve the choice, despite it still being so bloody far from home. -----> i !!!  have no idea if -----> i !!!  -----> will !!!  -----> ever !!!  -----> make !!!  it there. it will be a short notice choice like wetzlar for me which was done on four days decision. i can definitely state that istanbul is one of those destinations that offers soooo much photographically that allocating extra time there will be richly rewarded. i'm not going to give away specific locations (just in case i make it and want to shoot competitively --img-- ), but there will be no shortage of excitement for your camera, or self. the pera palace in taxim is fabulous for at least one night's accommodation. i remember joining the belly dancer for the floor show and being given some \"consideration\" afterwards by the management. there are a number of interesting rooms there dedicated to people such as agatha christie and ataturk, amongst others who stayed there. management said they would dedicate a room to me after my performance, but i doubt it really happened. however, i am confident the local deros will remember me kindly and i them. edited november 28, 2013 by erl", "sortedWord": "None", "Identifyer": null, "identifyer": 134633, "year": "2013"}, {"autor": "jaapv", "date": "2013-06-11 17:01:00", "content": "Why don't we make a BusyBee?", "link": "https://www.l-camera-forum.com/topic/206330-leica-meeting-in-antwerpen-belgium/?tab=comments#comment-2345731", "origin": "L-forum", "suborigin": "206330-leica-meeting-in-antwerpen-belgium", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "why don't -----> we !!!  -----> make !!!  a busybee?", "sortedWord": "None", "Identifyer": null, "identifyer": 134939, "year": "2013"}, {"autor": "frankwaller", "date": "2013-06-16 21:29:00", "content": "Hello there, I can make 6th July as well - I'm based in Peterborough/Cambs UK, if any one need a lift locally or on the way over, let me know... must be a light bag traveller, I'm not humping bags!! --img--  Regards Frank ps let me know further meet details?", "link": "https://www.l-camera-forum.com/topic/206330-leica-meeting-in-antwerpen-belgium/page/2/?tab=comments#comment-2350974", "origin": "L-forum", "suborigin": "206330-leica-meeting-in-antwerpen-belgium", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "hello there, -----> i !!!  -----> can !!!  -----> make !!!  6th july as well - -----> i !!! 'm based in peterborough/cambs uk, if any one need a lift locally or on the way over, let me know... must be a light bag traveller, -----> i !!! 'm not humping bags!! --img--  regards frank ps let me know further meet details?", "sortedWord": "None", "Identifyer": null, "identifyer": 134952, "year": "2013"}, {"autor": "jip", "date": "2013-06-18 09:42:00", "content": "Time to figure out times' date=' location, program.[/quote'] I'm making a plan with a friend, I will post the whole program soon. With times and all.", "link": "https://www.l-camera-forum.com/topic/206330-leica-meeting-in-antwerpen-belgium/page/2/?tab=comments#comment-2352253", "origin": "L-forum", "suborigin": "206330-leica-meeting-in-antwerpen-belgium", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "time to figure out times' date=' location, program.[/quote'] -----> i !!! 'm -----> making !!!  a plan with a friend, -----> i !!!  will post the whole program soon. with times and all.", "sortedWord": "None", "Identifyer": null, "identifyer": 134963, "year": "2013"}, {"autor": "jip", "date": "2013-06-26 19:20:00", "content": "Program Meeting point 10am We will meet at 'Le Royal Café'. It is on the second floor of central train station of Antwerp (Antwerpen-Centraal). Lunch 12pm We will lunch together at a yet undisclosed location. This will cost approximately 20 euro depending on your appetite. Early-afternoon 1pm Antwerp has some great places to visit. We will make sure you get to see some of them. The program will depend on the weather. However don't forget your umbrella. Summers tend to be wet lately. Late-afternoon 5pm All good things come to an end. Let us end our day with a drink. You can stay as long as you like. Confirmation Please confirm your participation by sending an e-mail to mail@jipvankuijk.nl. Subject: Leica Meeting Including: Full name User/nickname LUF Phone number Deadline: 3rd of July Getting there By train Check Officiële website van NMBS - Home for train schedules and realtime updates. By car There are two underground parkings near the central train station of Antwerp. Astridplein €19,00 for a full day. Visa, Mastercard, Cash, Maestro, American Express. Address: Koningin Astridplein 27, 2018 Antwerpen. Rooseveltplaats € 14,60 for a full day. Cash, Credit Card, Maestro. Address: F. Rooseveltplaats 12, 2060 Antwerpen. By plane Brussels airport There are trains going from Brussels Airport to Antwerp (about 40 minutes travel time). Brussels South Charleroi airport You have to take the bus to Charleroi South train station where you can get on a train to Antwerp (about 2 hours travel time). Lockers There are luggage lockers available at the train station. Contact information Jip van Kuijk +31 6 3949 2497 mail@jipvankuijk.nl Don't forget your Leica, your Leica is your ticket!! Edited June 26, 2013 by jip", "link": "https://www.l-camera-forum.com/topic/206330-leica-meeting-in-antwerpen-belgium/page/3/?tab=comments#comment-2359349", "origin": "L-forum", "suborigin": "206330-leica-meeting-in-antwerpen-belgium", "result": true, "Selector": "we will make", "selectorShort": "make", "MarkedSent": "program meeting point 10am we will meet at 'le royal café'. it is on the second floor of central train station of antwerp (antwerpen-centraal). lunch 12pm we will lunch together at a yet undisclosed location. this will cost approximately 20 euro depending on your appetite. early-afternoon 1pm antwerp has some great places to visit. -----> we !!!  -----> will !!!  -----> make !!!  sure you get to see some of them. the program will depend on the weather. however don't forget your umbrella. summers tend to be wet lately. late-afternoon 5pm all good things come to an end. let us end our day with a drink. you can stay as long as you like. confirmation please confirm your participation by sending an e-mail to mail@jipvankuijk.nl. subject: leica meeting including: full name user/nickname luf phone number deadline: 3rd of july getting there by train check officiële website van nmbs - home for train schedules and realtime updates. by car there are two underground parkings near the central train station of antwerp. astridplein €19,00 for a full day. visa, mastercard, cash, maestro, american express. address: koningin astridplein 27, 2018 antwerpen. rooseveltplaats € 14,60 for a full day. cash, credit card, maestro. address: f. rooseveltplaats 12, 2060 antwerpen. by plane brussels airport there are trains going from brussels airport to antwerp (about 40 minutes travel time). brussels south charleroi airport you have to take the bus to charleroi south train station where you can get on a train to antwerp (about 2 hours travel time). lockers there are luggage lockers available at the train station. contact information jip van kuijk +31 6 3949 2497 mail@jipvankuijk.nl don't forget your leica, your leica is your ticket!! edited june 26, 2013 by jip", "sortedWord": "None", "Identifyer": null, "identifyer": 134970, "year": "2013"}, {"autor": "DigitalHeMan", "date": "2013-11-26 21:37:00", "content": "Easter Day wouldn't work for me unfortunately. If I am in the UK for that weekend then I would be expected to be with my family on the Sunday. I could make the Saturday more easily....", "link": "https://www.l-camera-forum.com/topic/217319-spring-into-bath-april-19th-easter-saturday/?tab=comments#comment-2474650", "origin": "L-forum", "suborigin": "217319-spring-into-bath-april-19th-easter-saturday", "result": true, "Selector": "i could make", "selectorShort": "make", "MarkedSent": "easter day wouldn't work for me unfortunately. if i am in the uk for that weekend then i would be expected to be with my family on the sunday. -----> i !!!  -----> could !!!  -----> make !!!  the saturday more easily....", "sortedWord": "None", "Identifyer": null, "identifyer": 135083, "year": "2013"}, {"autor": "farnz", "date": "2013-11-28 18:32:00", "content": "Yep.--img--  (April's actually not planned as my bath month but I'll make an exception on this occasion if I can find my rubber ducky.--img-- ) Pete.", "link": "https://www.l-camera-forum.com/topic/217319-spring-into-bath-april-19th-easter-saturday/?tab=comments#comment-2475898", "origin": "L-forum", "suborigin": "217319-spring-into-bath-april-19th-easter-saturday", "result": true, "Selector": "i'll make", "selectorShort": "make", "MarkedSent": "yep.--img--  (april's actually not planned as my bath month but -----> i !!! -----> 'll !!!  -----> make !!!  an exception on this occasion if -----> i !!!  can find my rubber ducky.--img-- ) pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 135088, "year": "2013"}, {"autor": "Dan Bachmann", "date": "2013-12-12 22:07:00", "content": "Sounds like a good plan to me. We have a visitor from overseas then, so I may only make it for a part of it (or perhaps she can join us).", "link": "https://www.l-camera-forum.com/topic/218154-meander-through-marylebone-london-new-years-meet-up/?tab=comments#comment-2485859", "origin": "L-forum", "suborigin": "218154-meander-through-marylebone-london-new-years-meet-up", "result": true, "Selector": "i may only make", "selectorShort": "make", "MarkedSent": "sounds like a good plan to me. we have a visitor from overseas then, so -----> i !!!  -----> may !!!  -----> only !!!  -----> make !!!  it for a part of it (or perhaps she can join us).", "sortedWord": "None", "Identifyer": null, "identifyer": 135696, "year": "2013"}, {"autor": "frankwaller", "date": "2013-10-13 14:10:00", "content": "Hello there - I will keep an eye on the weather and if it looks promising I would enjoy making a day of it, many thanks frankw", "link": "https://www.l-camera-forum.com/topic/213128-london-brick-lane-meeting/page/2/?tab=comments#comment-2440789", "origin": "L-forum", "suborigin": "213128-london-brick-lane-meeting", "result": true, "Selector": "i would enjoy making", "selectorShort": "make", "MarkedSent": "hello there - -----> i !!!  will keep an eye on the weather and if it looks promising -----> i !!!  -----> would !!!  -----> enjoy !!!  -----> making !!!  a day of it, many thanks frankw", "sortedWord": "None", "Identifyer": null, "identifyer": 135777, "year": "2013"}, {"autor": "markrune", "date": "2013-10-27 05:55:00", "content": "Sorry,not feeling too well this morning, so I can not make it, hope you all have a good day --img-- ", "link": "https://www.l-camera-forum.com/topic/213128-london-brick-lane-meeting/page/2/?tab=comments#comment-2451180", "origin": "L-forum", "suborigin": "213128-london-brick-lane-meeting", "result": true, "Selector": "i can not make", "selectorShort": "make", "MarkedSent": "sorry,-----> not !!!  feeling too well this morning, so -----> i !!!  -----> can !!!  -----> not !!!  -----> make !!!  it, hope you all have a good day --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 135787, "year": "2013"}, {"autor": "250swb", "date": "2013-11-06 17:17:00", "content": "I can't make up my mind what camera to take, although we aren't allowed to photograph in the sensitive areas anyway. An Olympus XA? An Olympus RC35? Or an MP? I feel obliged to take a film camera, but would it be rude to load it with Tri-X? Oh the worry --img--  Steve", "link": "https://www.l-camera-forum.com/topic/215942-event-ilford-uk-tour-15th-nov/?tab=comments#comment-2459349", "origin": "L-forum", "suborigin": "215942-event-ilford-uk-tour-15th-nov", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  up my mind what camera to take, although we are-----> n't !!!  allowed to photograph in the sensitive areas anyway. an olympus xa? an olympus rc35? or an mp? i feel obliged to take a film camera, but would it be rude to load it with tri-x? oh the worry --img--  steve", "sortedWord": "None", "Identifyer": null, "identifyer": 135846, "year": "2013"}, {"autor": "DigitalHeMan", "date": "2013-03-17 09:52:00", "content": "This looks like fun. It's only a 3.5 hour drive from Amsterdam (as I don't drive a Land Rover --img-- ) so I might see if I can make it....", "link": "https://www.l-camera-forum.com/topic/191494-time-to-vote-one-challenge-wetzlar/page/4/?tab=comments#comment-2273923", "origin": "L-forum", "suborigin": "191494-time-to-vote-one-challenge-wetzlar", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "this looks like fun. it's only a 3.5 hour drive from amsterdam (as i don't drive a land rover --img-- ) so -----> i !!!  might see if -----> i !!!  -----> can !!!  -----> make !!!  it....", "sortedWord": "None", "Identifyer": null, "identifyer": 135927, "year": "2013"}, {"autor": "lanetomlane", "date": "2013-03-18 08:24:00", "content": "This looks like fun. It's only a 3.5 hour drive from Amsterdam (as I don't drive a Land Rover --img-- ) so I might see if I can make it.... Hi Simon It IS fun, you should try to make it. Good crowd, good food, good beer and we have even been known to take cameras. ______________ Cheers, Tom", "link": "https://www.l-camera-forum.com/topic/191494-time-to-vote-one-challenge-wetzlar/page/4/?tab=comments#comment-2274935", "origin": "L-forum", "suborigin": "191494-time-to-vote-one-challenge-wetzlar", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "this looks like fun. it's only a 3.5 hour drive from amsterdam (as i don't drive a land rover --img-- ) so -----> i !!!  might see if -----> i !!!  -----> can !!!  -----> make !!!  it.... hi simon it is fun, you should try to make it. good crowd, good food, good beer and we have even been known to take cameras. ______________ cheers, tom", "sortedWord": "None", "Identifyer": null, "identifyer": 135931, "year": "2013"}, {"autor": "StS", "date": "2013-04-13 16:54:00", "content": "Thank you very much for organizing the tour. However, at the moment, it looks like I can't make it on Friday morning. Stefan", "link": "https://www.l-camera-forum.com/topic/191494-time-to-vote-one-challenge-wetzlar/page/5/?tab=comments#comment-2298064", "origin": "L-forum", "suborigin": "191494-time-to-vote-one-challenge-wetzlar", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": "thank you very much for organizing the tour. however, at the moment, it looks like -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  it on friday morning. stefan", "sortedWord": "None", "Identifyer": null, "identifyer": 135948, "year": "2013"}, {"autor": "spylaw4", "date": "2013-04-17 21:28:00", "content": "Me too - if I can make it.", "link": "https://www.l-camera-forum.com/topic/191494-time-to-vote-one-challenge-wetzlar/page/6/?tab=comments#comment-2301691", "origin": "L-forum", "suborigin": "191494-time-to-vote-one-challenge-wetzlar", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "me too - if -----> i !!!  -----> can !!!  -----> make !!!  it.", "sortedWord": "None", "Identifyer": null, "identifyer": 135967, "year": "2013"}, {"autor": "andybarton", "date": "2013-05-15 18:31:00", "content": "Of course you can use a digital camera. Normal forum rules apply for the hardware. If you read the full rules I am sure that they are even clearer than that brief post I made at the top of this thread.", "link": "https://www.l-camera-forum.com/topic/191494-time-to-vote-one-challenge-wetzlar/page/7/?tab=comments#comment-2322286", "origin": "L-forum", "suborigin": "191494-time-to-vote-one-challenge-wetzlar", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "of course you can use a digital camera. normal forum rules apply for the hardware. if you read the full rules -----> i !!!  am sure that they are even clearer than that brief post -----> i !!!  -----> made !!!  at the top of this thread.", "sortedWord": "None", "Identifyer": null, "identifyer": 135986, "year": "2013"}, {"autor": "Guest tanks", "date": "2013-05-15 22:31:00", "content": "I might do it. I will be in Europe during that time I think. Though seeing that I can't seem to find the link on my own I'd appreciate it if you'd provide it. If I might make a suggestion, seeing that it is a forum wide event, a sticky would help those that were not around a year ago.", "link": "https://www.l-camera-forum.com/topic/191494-time-to-vote-one-challenge-wetzlar/page/7/?tab=comments#comment-2322433", "origin": "L-forum", "suborigin": "191494-time-to-vote-one-challenge-wetzlar", "result": true, "Selector": "i might make", "selectorShort": "make", "MarkedSent": "i might do it. i will be in europe during that time i think. though seeing that i can't seem to find the link on my own i'd appreciate it if you'd provide it. if -----> i !!!  -----> might !!!  -----> make !!!  a suggestion, seeing that it is a forum wide event, a sticky would help those that were not around a year ago.", "sortedWord": "None", "Identifyer": null, "identifyer": 135991, "year": "2013"}, {"autor": "lanetomlane", "date": "2013-05-22 13:55:00", "content": "Take the proverbial if you want, but we arrived into Amsterdam right on schedule and am happy to report that nothing amiss was found on the Defender during it's service. Unfortunately, I didn't make the flight back for the Shard and Bristol meets but will be raring to go once we get to Wetzler. Safe travels to all. ________________________ Cheers, Tom", "link": "https://www.l-camera-forum.com/topic/191494-time-to-vote-one-challenge-wetzlar/page/8/?tab=comments#comment-2327465", "origin": "L-forum", "suborigin": "191494-time-to-vote-one-challenge-wetzlar", "result": true, "Selector": "i didn't make", "selectorShort": "make", "MarkedSent": "take the proverbial if you want, but we arrived into amsterdam right on schedule and am happy to report that nothing amiss was found on the defender during it's service. unfortunately, -----> i !!!  -----> did !!! -----> n't !!!  -----> make !!!  the flight back for the shard and bristol meets but will be raring to go once we get to wetzler. safe travels to all. ________________________ cheers, tom", "sortedWord": "None", "Identifyer": null, "identifyer": 136009, "year": "2013"}, {"autor": "Anke", "date": "2013-07-13 20:13:00", "content": "Hi all, Also a very nice Restaurant is the \"Paulaner\" in Wetzlar. Enough seats for huge groops and after dinner you can walk to the hotel. Paulaner Wirtshaus am Haarplatz Wetzlar Hauptseite If you want I can make an enquiry for that data. Regards, Anke", "link": "https://www.l-camera-forum.com/topic/191494-time-to-vote-one-challenge-wetzlar/page/10/?tab=comments#comment-2373485", "origin": "L-forum", "suborigin": "191494-time-to-vote-one-challenge-wetzlar", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "hi all, also a very nice restaurant is the \"paulaner\" in wetzlar. enough seats for huge groops and after dinner you can walk to the hotel. paulaner wirtshaus am haarplatz wetzlar hauptseite if you want -----> i !!!  -----> can !!!  -----> make !!!  an enquiry for that data. regards, anke", "sortedWord": "None", "Identifyer": null, "identifyer": 136045, "year": "2013"}, {"autor": "stunsworth", "date": "2013-04-29 17:30:00", "content": " Yes, it's a long way away, but I thought I'd make a suggestion regarding the timing and the location. I was wondering if there would be any support for holding it a month earlier at Perpignan in South West France in the second week of September. The reason being that it would then coincide with the Visa Pour L'Image photo festival. The festival is extensive, and is mainly concerned with reportage type photography. Also, it's all free! Some details of it this year... Visa pour l'Image Perpignan 2013 The main problem that I can see is one of timing. It may be a bit too close to the summer holidays for many people. The nearest airport is probably Carcassone or Verona in Spain. There's an aiport in Perpignan itself, but I don't know if it's used by any budget carriers. No problem if people aren't keen, and I know I've made this suggestion in the past, but I thought I'd float it as an idea again.", "link": "https://www.l-camera-forum.com/topic/203679-the-one-challenge-2014/?tab=comments#comment-2310415", "origin": "L-forum", "suborigin": "203679-the-one-challenge-2014", "result": true, "Selector": "i'd make", "selectorShort": "make", "MarkedSent": " yes, it's a long way away, but -----> i !!!  thought -----> i !!! -----> 'd !!!  -----> make !!!  a suggestion regarding the timing and the location. i was wondering if there would be any support for holding it a month earlier at perpignan in south west france in the second week of september. the reason being that it would then coincide with the visa pour l'image photo festival. the festival is extensive, and is mainly concerned with reportage type photography. also, it's all free! some details of it this year... visa pour l'image perpignan 2013 the main problem that i can see is one of timing. it may be a bit too close to the summer holidays for many people. the nearest airport is probably carcassone or verona in spain. there's an aiport in perpignan itself, but i don't know if it's used by any budget carriers. no problem if people aren't keen, and i know i've made this suggestion in the past, but i thought i'd float it as an idea again.", "sortedWord": "None", "Identifyer": null, "identifyer": 136170, "year": "2013"}, {"autor": "stunsworth", "date": "2013-04-30 11:46:00", "content": " We obviously chose October (when it moved from December after a couple of years), because it sits between summer holiday time and Christmas. Too close to the summer and I suspect that people won't be able to fit in the leave required. There is also the issue of several participants using the Challenge as a convenient \"excuse\" for a weekend away with a partner. I would have a hard sell if I suggested that we go and immerse ourselves in even more photography for the whole weekend... The proximity to the summer holidays was something that I thought may be a problem. As for Mrs B, you could always put her on a train to Avignon/Nimes or Barcelona for the day <grin>. For anyone who's not been, Visa is well worth a visit. I can't make it this year, but I hope to be there next.", "link": "https://www.l-camera-forum.com/topic/203679-the-one-challenge-2014/?tab=comments#comment-2311089", "origin": "L-forum", "suborigin": "203679-the-one-challenge-2014", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": " we obviously chose october (when it moved from december after a couple of years), because it sits between summer holiday time and christmas. too close to the summer and i suspect that people won't be able to fit in the leave required. there is also the issue of several participants using the challenge as a convenient \"excuse\" for a weekend away with a partner. i would have a hard sell if i suggested that we go and immerse ourselves in even more photography for the whole weekend... the proximity to the summer holidays was something that i thought may be a problem. as for mrs b, you could always put her on a train to avignon/nimes or barcelona for the day <grin>. for anyone who's not been, visa is well worth a visit. -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  it this year, but -----> i !!!  hope to be there next.", "sortedWord": "None", "Identifyer": null, "identifyer": 136176, "year": "2013"}, {"autor": "robert_parker", "date": "2013-04-30 14:33:00", "content": "The proximity to the summer holidays was something that I thought may be a problem. As for Mrs B, you could always put her on a train to Avignon/Nimes or Barcelona for the day <grin>. For anyone who's not been, Visa is well worth a visit. I can't make it this year, but I hope to be there next. I'll second that. The seaside town of Canet Plage is only a Eur 1 bus ride away, so it is possible to escape the photgraphy. The town itself is very nice too. It really does come down to timing though, as has already been said. The big advantage of The Challenge as it stands is that it just catches the end of the holiday special deals without being right in the season itself, avoiding problems with annual leave, clashes with school terms, etc.", "link": "https://www.l-camera-forum.com/topic/203679-the-one-challenge-2014/?tab=comments#comment-2311208", "origin": "L-forum", "suborigin": "203679-the-one-challenge-2014", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": "the proximity to the summer holidays was something that i thought may be a problem. as for mrs b, you could always put her on a train to avignon/nimes or barcelona for the day <grin>. for anyone who's not been, visa is well worth a visit. -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  it this year, but -----> i !!!  hope to be there next. i'll second that. the seaside town of canet plage is only a eur 1 bus ride away, so it is possible to escape the photgraphy. the town itself is very nice too. it really does come down to timing though, as has already been said. the big advantage of the challenge as it stands is that it just catches the end of the holiday special deals without being right in the season itself, avoiding problems with annual leave, clashes with school terms, etc.", "sortedWord": "None", "Identifyer": null, "identifyer": 136178, "year": "2013"}, {"autor": "Bateleur", "date": "2013-08-17 14:40:00", "content": "Unfortunately I wont make it this year, have a lunch date :-) Regards Charles", "link": "https://www.l-camera-forum.com/topic/210641-doesburg-open-air-market-netherlands/?tab=comments#comment-2399540", "origin": "L-forum", "suborigin": "210641-doesburg-open-air-market-netherlands", "result": true, "Selector": "i wont make", "selectorShort": "make", "MarkedSent": "unfortunately -----> i !!!  -----> wo !!! -----> nt !!!  -----> make !!!  it this year, have a lunch date :-) regards charles", "sortedWord": "None", "Identifyer": null, "identifyer": 136190, "year": "2013"}, {"autor": "StephenPatterson", "date": "2013-07-12 14:25:00", "content": "Stephen, unfortunately, I won't be in Hong Kong. But just a question: while I think it's great having a pint, having a discussion or looking at each other's cameras, lenses and pictures, I've never understood why people like to meet and shoot. I've always considered photographing to be a solitary activity and would never think going shooting even with one other person, much less with two or more. Am I missing something? —Mitch/Bangkok Well that's a fair question Mitch, let me try and give you an answer. When I travel I realize that locals have a distinct advantage over me in knowing how to find the interesting sections, neighborhoods and people of a particular town. For instance when I visited Bangkok last year, I met up with members Edward Karaa, Teera Ashakul and Rammy Narula, and we all then attended Richard Bram and David Gibson's \"iN PUBLiC\" exhibition. We also had the opportunity to compare notes, walk around some neighborhoods which I probably would have never found on my own, and \"talk shop\". The four of us had varying degrees of experience, from Edward who has worked as a photojournalist to Teera, who had just bought his first Leica. We all, I believe, benefitted from the exchange. Later Teera visited Hong Kong, and I was able to show him around a bit, as well as answer more Leica questions. I am also a solitary photographer, and when I meet up I tend to view the experience more as a recce than as a mission. If something looks interesting I make a note and come back later. For me it is much more enjoyable to see how other photographers work, from pro to rank amateur, and amazingly I find that I almost always learn something new. This past January I met up with a friend in Cambodia and his father, who had just bought his first ever non P&S camera, a Canon 6D. This man was a sponge for information, and had never taken any photos in his life that were not family or travel snaps. I briefed him on the basics and off we went to shoot. After an hour I realized that he was so latched on to me that whatever I was shooting he was shooting. I soon started taking photos of trash cans, phone polls, license plates...anything boring I could find, and sure enough he followed me. I then explained that photography is about finding one's inner vision, and that he couldn't do that just by parroting me. I love Hong Kong, and I'm there every couple of months. There are around a half dozen of us who like to get together, have a coffee at agnis b., talk shop and sometimes shoot in Yau Ma Tei, Wan Chai or other locals. We also like to get together and print, something which I never tire of. I realize this may sound absolutely dreadful to you, but I tend to enjoy meeting new people, visiting new places and experiencing new things. It's just the way I am. When my wife and I travel there is one question which she dreads more than any other....\"Hey, is that a Leica?\" She knows from experience that this question is never answered with a simple \"Yes\". Cheers, and hope our paths cross one day. Stephen", "link": "https://www.l-camera-forum.com/topic/208616-hong-kong-15-22-july/?tab=comments#comment-2372643", "origin": "L-forum", "suborigin": "208616-hong-kong-15-22-july", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "stephen, unfortunately, i won't be in hong kong. but just a question: while i think it's great having a pint, having a discussion or looking at each other's cameras, lenses and pictures, i've never understood why people like to meet and shoot. i've always considered photographing to be a solitary activity and would never think going shooting even with one other person, much less with two or more. am i missing something? —mitch/bangkok well that's a fair question mitch, let me try and give you an answer. when i travel i realize that locals have a distinct advantage over me in knowing how to find the interesting sections, neighborhoods and people of a particular town. for instance when i visited bangkok last year, i met up with members edward karaa, teera ashakul and rammy narula, and we all then attended richard bram and david gibson's \"in public\" exhibition. we also had the opportunity to compare notes, walk around some neighborhoods which i probably would have never found on my own, and \"talk shop\". the four of us had varying degrees of experience, from edward who has worked as a photojournalist to teera, who had just bought his first leica. we all, i believe, benefitted from the exchange. later teera visited hong kong, and i was able to show him around a bit, as well as answer more leica questions. i am also a solitary photographer, and when i meet up i tend to view the experience more as a recce than as a mission. if something looks interesting -----> i !!!  -----> make !!!  a note and come back later. for me it is much more enjoyable to see how other photographers work, from pro to rank amateur, and amazingly i find that i almost always learn something new. this past january i met up with a friend in cambodia and his father, who had just bought his first ever non p&s camera, a canon 6d. this man was a sponge for information, and had never taken any photos in his life that were not family or travel snaps. i briefed him on the basics and off we went to shoot. after an hour i realized that he was so latched on to me that whatever i was shooting he was shooting. i soon started taking photos of trash cans, phone polls, license plates...anything boring i could find, and sure enough he followed me. i then explained that photography is about finding one's inner vision, and that he couldn't do that just by parroting me. i love hong kong, and i'm there every couple of months. there are around a half dozen of us who like to get together, have a coffee at agnis b., talk shop and sometimes shoot in yau ma tei, wan chai or other locals. we also like to get together and print, something which i never tire of. i realize this may sound absolutely dreadful to you, but i tend to enjoy meeting new people, visiting new places and experiencing new things. it's just the way i am. when my wife and i travel there is one question which she dreads more than any other....\"hey, is that a leica?\" she knows from experience that this question is never answered with a simple \"yes\". cheers, and hope our paths cross one day. stephen", "sortedWord": "None", "Identifyer": null, "identifyer": 136198, "year": "2013"}, {"autor": "kdemas", "date": "2013-07-20 06:03:00", "content": " Voting Time is Here! Well the hard part is done… shooting, developing, photoshopping, entering. Now comes the fun part, Voting. Quite a few LUF members participated in this event so please feel free to check out all the images and vote as described below. We had nearly 50 participants from all around the world, a great turnout and some really nice images. I always love to see the variety of perspectives from the entrants, we all have our own vision. Where Do I view the Images? The images are hosted on \"iPernity\" in my \"HCBEntries\" account. The images can be seen on white by clicking on the first image and navigating from there. They also can be viewed on black (my personal preference) by clicking the slideshow button on the upper right side of the layout. The image below shows the two choices. Please look at the images in one/both of these methods. Looking at thumbnails does not do the images justice. --img--  How to Vote. OK, I made it even easier to vote this year. Once you have made your choices for 1st, 2nd and 3rd place images simply go here: VOTE This simple form will allow the data to be both emailed to me and to be recorded in an excel spreadsheet, making the task of adding up the point totals far easier. As always 3 points will be awarded for 1st place, 2 for 2nd and 1 for 3rd place selection. DO NOT VOTE HERE IN THE FORUM. Votes placed in this thread and not in the form will not be counted. Feel free to discuss your votes and I will post voting data to this thread but remember, if you just place your vote here it won't be counted. You have to fill out the super-easy form. Voting Rules: You can only vote once. Remember, no voting for your own image. Votes must be placed in the form to count. Feel free to share how you voted here after if you like. So, to summarize: 1) View the images. 2) Vote using the form at this location. 3) Pop up a message here that says \"I voted\", If you notice anything wrong with either the gallery or the voting site please let me know ASAP. That includes if you don't see your favorite image in the pop-up lists. Thanks and good luck to all the participants! Kent", "link": "https://www.l-camera-forum.com/topic/209193-decisive-challenge-iv-summer-2013-voting-is-now-open/?tab=comments#comment-2378521", "origin": "L-forum", "suborigin": "209193-decisive-challenge-iv-summer-2013-voting-is-now-open", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": " voting time is here! well the hard part is done… shooting, developing, photoshopping, entering. now comes the fun part, voting. quite a few luf members participated in this event so please feel free to check out all the images and vote as described below. we had nearly 50 participants from all around the world, a great turnout and some really nice images. i always love to see the variety of perspectives from the entrants, we all have our own vision. where do i view the images? the images are hosted on \"ipernity\" in my \"hcbentries\" account. the images can be seen on white by clicking on the first image and navigating from there. they also can be viewed on black (my personal preference) by clicking the slideshow button on the upper right side of the layout. the image below shows the two choices. please look at the images in one/both of these methods. looking at thumbnails does not do the images justice. --img--  how to vote. ok, -----> i !!!  -----> made !!!  it even easier to vote this year. once you have made your choices for 1st, 2nd and 3rd place images simply go here: vote this simple form will allow the data to be both emailed to me and to be recorded in an excel spreadsheet, making the task of adding up the point totals far easier. as always 3 points will be awarded for 1st place, 2 for 2nd and 1 for 3rd place selection. do not vote here in the forum. votes placed in this thread and not in the form will not be counted. feel free to discuss your votes and i will post voting data to this thread but remember, if you just place your vote here it won't be counted. you have to fill out the super-easy form. voting rules: you can only vote once. remember, no voting for your own image. votes must be placed in the form to count. feel free to share how you voted here after if you like. so, to summarize: 1) view the images. 2) vote using the form at this location. 3) pop up a message here that says \"i voted\", if you notice anything wrong with either the gallery or the voting site please let me know asap. that includes if you don't see your favorite image in the pop-up lists. thanks and good luck to all the participants! kent", "sortedWord": "None", "Identifyer": null, "identifyer": 136206, "year": "2013"}, {"autor": "Seeingeye", "date": "2013-02-12 17:04:00", "content": "Unfortunately I could not make the Ipswich meeting, but I'll see if I can get to this one. My grandmother used to live near to Colchester so I often went there as a boy, but have not been near the place in years.", "link": "https://www.l-camera-forum.com/topic/197956-colchester-meet-2nd-june-2013/?tab=comments#comment-2241183", "origin": "L-forum", "suborigin": "197956-colchester-meet-2nd-june-2013", "result": true, "Selector": "i could not make", "selectorShort": "make", "MarkedSent": "unfortunately -----> i !!!  -----> could !!!  -----> not !!!  -----> make !!!  the ipswich meeting, but -----> i !!! 'll see if -----> i !!!  can get to this one. my grandmother used to live near to colchester so i often went there as a boy, but have not been near the place in years.", "sortedWord": "None", "Identifyer": null, "identifyer": 136230, "year": "2013"}, {"autor": "lanetomlane", "date": "2013-02-13 04:24:00", "content": " Unfortunately I can't make it as I'm going to be in the States. Regards, Tom", "link": "https://www.l-camera-forum.com/topic/197956-colchester-meet-2nd-june-2013/?tab=comments#comment-2241712", "origin": "L-forum", "suborigin": "197956-colchester-meet-2nd-june-2013", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": " unfortunately -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  it as -----> i !!! 'm going to be in the states. regards, tom", "sortedWord": "None", "Identifyer": null, "identifyer": 136231, "year": "2013"}, {"autor": "farnz", "date": "2013-05-20 15:58:00", "content": "Oops, missed this thread, John. I made it to Photographica in the afternoon, and had a pleasant chat to Doug. Shame not to have seen you there. I spotted James briefly but lost him in the crowds. Brian May turned up as well, which was interesting. I wasn't aware that he had photographic interests. Pete.", "link": "https://www.l-camera-forum.com/topic/204635-photographica-fair-in-london/?tab=comments#comment-2325781", "origin": "L-forum", "suborigin": "204635-photographica-fair-in-london", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "oops, missed this thread, john. -----> i !!!  -----> made !!!  it to photographica in the afternoon, and had a pleasant chat to doug. shame not to have seen you there. i spotted james briefly but lost him in the crowds. brian may turned up as well, which was interesting. i wasn't aware that he had photographic interests. pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 136252, "year": "2013"}, {"autor": "ejd", "date": "2013-03-23 07:48:00", "content": "I'm hoping to make it to Whitby on the 13th. It involves visiting family near Wakefield on the way there and back. I'll try to stay in or near Whitby on Sat night and would be happy to join any who are there in the evening for drinks or dinner. All the best, John", "link": "https://www.l-camera-forum.com/topic/191936-second-seaside-challenge-whitby-uk-saturday-13413/page/4/?tab=comments#comment-2279757", "origin": "L-forum", "suborigin": "191936-second-seaside-challenge-whitby-uk-saturday-13413", "result": true, "Selector": "i'm hoping to make", "selectorShort": "make", "MarkedSent": "-----> i !!! 'm -----> hoping !!!  -----> to !!!  -----> make !!!  it -----> to !!!  whitby on the 13th. it involves visiting family near wakefield on the way there and back. i'll try to stay in or near whitby on sat night and would be happy to join any who are there in the evening for drinks or dinner. all the best, john", "sortedWord": "None", "Identifyer": null, "identifyer": 136343, "year": "2013"}, {"autor": "markrune", "date": "2013-02-21 00:35:00", "content": "I might be if I can make the time --img-- ", "link": "https://www.l-camera-forum.com/topic/198756-london-leica-meet-shard/?tab=comments#comment-2248925", "origin": "L-forum", "suborigin": "198756-london-leica-meet-shard", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "-----> i !!!  might be if -----> i !!!  -----> can !!!  -----> make !!!  the time --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 136370, "year": "2013"}, {"autor": "Nick De Marco", "date": "2013-02-23 00:20:00", "content": "Yes it definatly should be on a day Ivor/Red Dot can do - that was part of the idea. So I think that rules out 20 April. Also I'm a QPR season ticket holder and we have a home game (perhaps one of the last in the Premier League --img--  ) on 20 April so I couldn't make it. How about either Sat 13 or Sat 27 April. Red Dot should be able to do both (?), I know I can, how about the other suspects? Nick", "link": "https://www.l-camera-forum.com/topic/198756-london-leica-meet-shard/page/2/?tab=comments#comment-2250840", "origin": "L-forum", "suborigin": "198756-london-leica-meet-shard", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "yes it definatly should be on a day ivor/red dot can do - that was part of the idea. so i think that rules out 20 april. also -----> i !!! 'm a qpr season ticket holder and we have a home game (perhaps one of the last in the premier league --img--  ) on 20 april so -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it. how about either sat 13 or sat 27 april. red dot should be able to do both (?), i know i can, how about the other suspects? nick", "sortedWord": "None", "Identifyer": null, "identifyer": 136390, "year": "2013"}, {"autor": "Keith (M)", "date": "2013-02-24 10:59:00", "content": "Shame (for me) that the proposed date has moved from mid-March to April as I will be making a rare visit from the 17th to 22nd March. A trip up the Shard is a definite objective and tickets for the Ansel Adams exhibition have already been purchased for Mon 18th. Lots of other exhibitions to visit too and a first ever visit to Red Dot (hopefully my IIIg will be back from their repairer beforehand!) will be in the itinerary.", "link": "https://www.l-camera-forum.com/topic/198756-london-leica-meet-shard/page/2/?tab=comments#comment-2251876", "origin": "L-forum", "suborigin": "198756-london-leica-meet-shard", "result": true, "Selector": "i will be making", "selectorShort": "make", "MarkedSent": "shame (for me) that the proposed date has moved from mid-march to april as -----> i !!!  -----> will !!!  -----> be !!!  -----> making !!!  a rare visit from the 17th to 22nd march. a trip up the shard is a definite objective and tickets for the ansel adams exhibition have already been purchased for mon 18th. lots of other exhibitions to visit too and a first ever visit to red dot (hopefully my iiig will be back from their repairer beforehand!) will be in the itinerary.", "sortedWord": "None", "Identifyer": null, "identifyer": 136393, "year": "2013"}, {"autor": "lanetomlane", "date": "2013-03-08 14:42:00", "content": "27 April it isJust need to agree a time and starting pub I've made a note of it. ________________ Cheers, Tom", "link": "https://www.l-camera-forum.com/topic/198756-london-leica-meet-shard/page/3/?tab=comments#comment-2264850", "origin": "L-forum", "suborigin": "198756-london-leica-meet-shard", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "27 april it isjust need to agree a time and starting pub -----> i !!! 've -----> made !!!  a note of it. ________________ cheers, tom", "sortedWord": "None", "Identifyer": null, "identifyer": 136416, "year": "2013"}, {"autor": "viramati", "date": "2013-04-26 19:32:00", "content": " Thanks I was wondering about a 2nd later meet as I can't make the earlier one. sometime after the shard bit of the day", "link": "https://www.l-camera-forum.com/topic/198756-london-leica-meet-shard/page/5/?tab=comments#comment-2308183", "origin": "L-forum", "suborigin": "198756-london-leica-meet-shard", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": " thanks -----> i !!!  was wondering about a 2nd later meet as -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  the earlier one. sometime after the shard bit of the day", "sortedWord": "None", "Identifyer": null, "identifyer": 136455, "year": "2013"}, {"autor": "viramati", "date": "2013-04-27 08:17:00", "content": "what sort of time do you think you guys will be coming down from the shard!? I don't think I can make it earlier but a late afternoon cup of tea/drink could be possible", "link": "https://www.l-camera-forum.com/topic/198756-london-leica-meet-shard/page/5/?tab=comments#comment-2308507", "origin": "L-forum", "suborigin": "198756-london-leica-meet-shard", "result": true, "Selector": "i can make", "selectorShort": "make", "MarkedSent": "what sort of time do you think you guys will be coming down from the shard!? -----> i !!!  don't think -----> i !!!  -----> can !!!  -----> make !!!  it earlier but a late afternoon cup of tea/drink could be possible", "sortedWord": "None", "Identifyer": null, "identifyer": 136457, "year": "2013"}, {"autor": "farnz", "date": "2013-02-25 16:41:00", "content": "Shall we put the 28th April down in the diary then?? Sounds good to me, David. Can we make it no earlier than 11 to give us smoke-dwellers an outside chance of getting there by train please?--img--  Pete.", "link": "https://www.l-camera-forum.com/topic/198288-yet-another-bristol-meet/?tab=comments#comment-2253100", "origin": "L-forum", "suborigin": "198288-yet-another-bristol-meet", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "shall we put the 28th april down in the diary then?? sounds good to me, david. can -----> we !!!  -----> make !!!  it no earlier than 11 to give us smoke-dwellers an outside chance of getting there by train please?--img--  pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 136497, "year": "2013"}, {"autor": "mikebidwell", "date": "2013-04-28 21:30:00", "content": "Hi Guys Once again I didn't make although up until late Thursday evening I fully intended to be with you. However when you're told \"Oh! Lynne and Marc are taking us out for dinner on Sunday and the table is booked for 13:30\" its not wise to say no. Never turn down a free lunch. So my apologies but from Petes images it looks as though you had an interesting time? Best wishes Mike --img-- ", "link": "https://www.l-camera-forum.com/topic/198288-yet-another-bristol-meet/page/2/?tab=comments#comment-2309736", "origin": "L-forum", "suborigin": "198288-yet-another-bristol-meet", "result": true, "Selector": "i didn't make", "selectorShort": "make", "MarkedSent": "hi guys once again -----> i !!!  -----> did !!! -----> n't !!!  -----> make !!!  although up until late thursday evening -----> i !!!  fully intended to be with you. however when you're told \"oh! lynne and marc are taking us out for dinner on sunday and the table is booked for 13:30\" its not wise to say no. never turn down a free lunch. so my apologies but from petes images it looks as though you had an interesting time? best wishes mike --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 136518, "year": "2013"}, {"autor": "mikebidwell", "date": "2013-04-29 14:17:00", "content": "Yeah!!! and after seeing the images of the Bristol Bus display I'm more than hacked off that I couldn't make. However, the one consolation was that lunch at 'The George Hotel' in Broad Street Chipping Sodbury was really excellent. So for any locals I'd thoroughly reccomend it, not an overly large menu but superb quality. Best wishes Mike --img-- ", "link": "https://www.l-camera-forum.com/topic/198288-yet-another-bristol-meet/page/2/?tab=comments#comment-2310279", "origin": "L-forum", "suborigin": "198288-yet-another-bristol-meet", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "yeah!!! and after seeing the images of the bristol bus display -----> i !!! 'm more than hacked off that -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!! . however, the one consolation was that lunch at 'the george hotel' in broad street chipping sodbury was really excellent. so for any locals i'd thoroughly reccomend it, not an overly large menu but superb quality. best wishes mike --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 136520, "year": "2013"}, {"autor": "PaulGlendell", "date": "2013-03-19 22:19:00", "content": " The audio slideshow about the last oak bark tannery in the UK I made for the BBC News web site got some praise here on the forum web site so I thought I would let you know that an exhibtion of 35 monochrome images will open tomorrow at the Royal Albert Memorial Museum in Exeter Tomorrow. March 20th to June 23rd 2013 Here are the details from the museum web site The Tannery: Photographs by Paul Glendell - RAMM Royal Albert Memorial Museum If you are in the area please come along Edited March 19, 2013 by PaulGlendell", "link": "https://www.l-camera-forum.com/topic/200927-the-tannery-exhibition-exeter-uk/?tab=comments#comment-2276802", "origin": "L-forum", "suborigin": "200927-the-tannery-exhibition-exeter-uk", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": " the audio slideshow about the last oak bark tannery in the uk -----> i !!!  -----> made !!!  for the bbc news web site got some praise here on the forum web site so -----> i !!!  thought -----> i !!!  would let you know that an exhibtion of 35 monochrome images will open tomorrow at the royal albert memorial museum in exeter tomorrow. march 20th to june 23rd 2013 here are the details from the museum web site the tannery: photographs by paul glendell - ramm royal albert memorial museum if you are in the area please come along edited march 19, 2013 by paulglendell", "sortedWord": "None", "Identifyer": null, "identifyer": 136538, "year": "2013"}, {"autor": "earleygallery", "date": "2013-03-01 21:34:00", "content": "Hi Ravi, Really sorry I can't make this, hope you have a good time in town.", "link": "https://www.l-camera-forum.com/topic/199440-visiting-london-3rd-march/?tab=comments#comment-2257674", "origin": "L-forum", "suborigin": "199440-visiting-london-3rd-march", "result": true, "Selector": "i can't make", "selectorShort": "make", "MarkedSent": "hi ravi, really sorry -----> i !!!  -----> ca !!! -----> n't !!!  -----> make !!!  this, hope you have a good time in town.", "sortedWord": "None", "Identifyer": null, "identifyer": 136542, "year": "2013"}, {"autor": "farnz", "date": "2013-02-02 21:27:00", "content": "... We just need a place to meet as i'm sure Susie and Pete will be down early. ... I'm travelling up from Surrey so I would struggle to get there early. An 11 am meet would be fine for me.--img--  I'll PM you all my phone number so if thers a problem we can make contact. Pete.", "link": "https://www.l-camera-forum.com/topic/197192-meeting-in-ipswich-february-2013/?tab=comments#comment-2231723", "origin": "L-forum", "suborigin": "197192-meeting-in-ipswich-february-2013", "result": true, "Selector": "we can make", "selectorShort": "make", "MarkedSent": "... we just need a place to meet as i'm sure susie and pete will be down early. ... i'm travelling up from surrey so i would struggle to get there early. an 11 am meet would be fine for me.--img--  i'll pm you all my phone number so if thers a problem -----> we !!!  -----> can !!!  -----> make !!!  contact. pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 136592, "year": "2013"}, {"autor": "valerio", "date": "2013-02-09 18:07:00", "content": " It was very nice to meet all of you in Ipswich today, I really enjoyed my day. I shot almost three rolls of film, which has never happened before! Very nice shots Alan, thank you for sharing them! Also thanks to Alan, Mark and Susie for letting me try some of their lenses. --img--  Let's make sure to organise another meeting soon! Val", "link": "https://www.l-camera-forum.com/topic/197192-meeting-in-ipswich-february-2013/page/3/?tab=comments#comment-2238201", "origin": "L-forum", "suborigin": "197192-meeting-in-ipswich-february-2013", "result": true, "Selector": "'s make", "selectorShort": "make", "MarkedSent": " it was very nice to meet all of you in ipswich today, i really enjoyed my day. i shot almost three rolls of film, which has never happened before! very nice shots alan, thank you for sharing them! also thanks to alan, mark and susie for letting me try some of their lenses. --img--  let-----> 's !!!  -----> make !!!  sure to organise another meeting soon! val", "sortedWord": "None", "Identifyer": null, "identifyer": 136614, "year": "2013"}, {"autor": "robert_parker", "date": "2013-02-10 21:13:00", "content": "Particularly like the conversion to B+W on the 'Altar' shot - shame I couldn't make it on the day..--img-- ...it looks like a fun time was had", "link": "https://www.l-camera-forum.com/topic/197192-meeting-in-ipswich-february-2013/page/3/?tab=comments#comment-2239290", "origin": "L-forum", "suborigin": "197192-meeting-in-ipswich-february-2013", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "particularly like the conversion to b+w on the 'altar' shot - shame -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it on the day..--img-- ...it looks like a fun time was had", "sortedWord": "None", "Identifyer": null, "identifyer": 136627, "year": "2013"}, {"autor": "markrune", "date": "2013-02-10 21:18:00", "content": "Particularly like the conversion to B+W on the 'Altar' shot - shame I couldn't make it on the day..--img-- ...it looks like a fun time was had I agree great shot and great conversion --img-- ", "link": "https://www.l-camera-forum.com/topic/197192-meeting-in-ipswich-february-2013/page/3/?tab=comments#comment-2239294", "origin": "L-forum", "suborigin": "197192-meeting-in-ipswich-february-2013", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "particularly like the conversion to b+w on the 'altar' shot - shame -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it on the day..--img-- ...it looks like a fun time was had i agree great shot and great conversion --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 136628, "year": "2013"}, {"autor": "valerio", "date": "2013-02-10 22:27:00", "content": "Particularly like the conversion to B+W on the 'Altar' shot - shame I couldn't make it on the day..--img-- ...it looks like a fun time was had Do not despair! There's already another meeting organised on June 2nd in Colchester. Hopefully we'll see you there! --img--  Val", "link": "https://www.l-camera-forum.com/topic/197192-meeting-in-ipswich-february-2013/page/3/?tab=comments#comment-2239360", "origin": "L-forum", "suborigin": "197192-meeting-in-ipswich-february-2013", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "particularly like the conversion to b+w on the 'altar' shot - shame -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it on the day..--img-- ...it looks like a fun time was had do not despair! there's already another meeting organised on june 2nd in colchester. hopefully we'll see you there! --img--  val", "sortedWord": "None", "Identifyer": null, "identifyer": 136630, "year": "2013"}, {"autor": "valerio", "date": "2013-02-12 19:01:00", "content": "I made the same mistake too, as well as other mistakes in the darkroom... Anyway, I'd say that the shots are very nice, though I'm not so sure on the choice of the last subject! --img-- ", "link": "https://www.l-camera-forum.com/topic/197192-meeting-in-ipswich-february-2013/page/4/?tab=comments#comment-2241353", "origin": "L-forum", "suborigin": "197192-meeting-in-ipswich-february-2013", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> made !!!  the same mistake too, as well as other mistakes in the darkroom... anyway, -----> i !!! 'd say that the shots are very nice, though -----> i !!! 'm not so sure on the choice of the last subject! --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 136643, "year": "2013"}, {"autor": "robert_parker", "date": "2013-01-06 03:18:00", "content": " Some say that the city's transport system is a little outmoded --img-- .... --img--  but we quickly found our way around... --img--  There was quite a lot going on.... --img--  ...and we were made welcome.... --img--  ...for the most part....--img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/182077-another-bristol-meet/page/4/?tab=comments#comment-2206902", "origin": "L-forum", "suborigin": "182077-another-bristol-meet", "result": true, "Selector": "we were made", "selectorShort": "make", "MarkedSent": " some say that the city's transport system is a little outmoded --img-- .... --img--  but we quickly found our way around... --img--  there was quite a lot going on.... --img--  ...and -----> we !!!  -----> were !!!  -----> made !!!  welcome.... --img--  ...for the most part....--img--  --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 136759, "year": "2013"}, {"autor": "almoore", "date": "2013-10-30 09:37:00", "content": "Which would you choose? The one that feels nicest in my hands. Every film M that I've picked up has a different feel for wind-on and shutter release, so I wouldn't make a decision without comparing them. Having said that, assuming the M4 isn't utterly shagged out it should nicer than an MP, which is no more than a bog standard M6 in black paint drag with a slower rewind and a less comfortable wind-on lever.", "link": "https://www.l-camera-forum.com/topic/215496-mp-vs-m4/page/2/?tab=comments#comment-2453617", "origin": "L-forum", "suborigin": "215496-mp-vs-m4", "result": false, "Selector": "i wouldn't make", "selectorShort": "make", "MarkedSent": "every -----> film !!!  m that i've picked up has a different feel for wind-on and shutter release, so i wouldn't make a decision without comparing them.", "sortedWord": "film", "Identifyer": null, "identifyer": 2465, "year": "2013"}, {"autor": "Doc Henry", "date": "2013-06-02 12:55:00", "content": "All very very well done. I might post some also, but the quality of these is intimidating. --img-- May I ask about the extent of digital post processing in these? Hi Kd I did not make any post-processing Just raw Tiff coming out the Nikonscan (all set as standard) and Jpeg for post --img-- I rarely post processe because I trust rendering of ​​the film Thanks for looking and comments Best regards Henry", "link": "https://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/?tab=comments#comment-2336934", "origin": "L-forum", "suborigin": "205842-i-like-filmopen-thread", "result": false, "Selector": "i did not make", "selectorShort": "make", "MarkedSent": "i did not make any post-processing just raw tiff coming out the nikonscan (all set as standard) and jpeg for post --img-- i rarely post processe because i trust rendering of ​​the -----> film !!!  thanks for looking and comments best regards henry", "sortedWord": "film", "Identifyer": null, "identifyer": 60560, "year": "2013"}, {"autor": "kdriceman", "date": "2013-06-02 13:06:00", "content": "Hi Kd I did not make any post-processingJust raw Tiff coming out the Nikonscan (all set as standard) and Jpeg for post --img-- I rarely post processe because I trust rendering of ​​the film Thanks for looking and comments Best regards Henry Thank you. I have returned to film for much of my RF shooting as I have sold my M9 and await an M240. I have to say I do enjoy it and have considered passing on the M as a result. But my results have been inconsistent, especially with color film.", "link": "https://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/?tab=comments#comment-2336945", "origin": "L-forum", "suborigin": "205842-i-like-filmopen-thread", "result": false, "Selector": "i did not make", "selectorShort": "make", "MarkedSent": "hi kd i did not make any post-processingjust raw tiff coming out the nikonscan (all set as standard) and jpeg for post --img-- i rarely post processe because i trust rendering of ​​the -----> film !!!  thanks for looking and comments best regards henry thank you.", "sortedWord": "film", "Identifyer": null, "identifyer": 60561, "year": "2013"}, {"autor": "Doc Henry", "date": "2013-07-17 19:16:00", "content": "I just got out my films that I took during my holidays. I'm glad I succeeded this photo with film , unlike with my M9 and M8 could not do --img--  I notice with surprise that I can find exactly the ambiance that I see, as in this photo of Mont Saint Michel , taken with a film Kodak Portra 400 here unlike M9 can not reproduce this ambiance. . This confirms that the film arrives in translating easily \"dark\" landscapes as the beach at Dunkirk I posted you (post 172): http://www.l-camera-forum.com/leica-forum/other/286747-i-like-film-open-thread-9.html This is the Mont Saint Michel at 8:30 pm, with the rising tide (at the speed of a galloping horse as say the local residents) and the last rays of sun are really well reproduced by film Kodak Portra I did not make any correction because otherwise I will not see the sun rays In summary, the film surprised me by the fidelity of the image which is well reproduced here , as I really see ! --img--  Picture uncorrected Any comment ? Best Henry", "link": "https://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/page/12/?tab=comments#comment-2376855", "origin": "L-forum", "suborigin": "205842-i-like-filmopen-thread", "result": false, "Selector": "i did not make", "selectorShort": "make", "MarkedSent": "this confirms that the -----> film !!!  arrives in translating easily \"dark\" landscapes as the beach at dunkirk i posted you (post 172): http://www.l-camera-forum.com/leica-forum/other/286747-i-like-film-open-thread-9.html this is the mont saint michel at 8:30 pm, with the rising tide (at the speed of a galloping horse as say the local residents) and the last rays of sun are really well reproduced by -----> film !!!  kodak portra i did not make any correction because otherwise i will not see the sun rays in summary, the -----> film !!!  surprised me by the fidelity of the image which is well reproduced here , as i really see !", "sortedWord": "film", "Identifyer": null, "identifyer": 60772, "year": "2013"}, {"autor": "lucerne", "date": "2013-07-10 16:50:00", "content": "So many opinions and revelations of incompatibilities and problems. Even though it is all speculative, it makes frightening reading (to me at least). However, the contributors have missed out some key issues. Granted, Sony builds for the mass market and has every intention of regularly replacing perfectly good models with different ones incorporating their own systems to achieve their own objectives. In other words their designs are proprietary, so why would they open the door (with the M mount) to existing manufacturers to muscle in on a proprietary market that they can control. But the issue yet to be mentioned is that the mass consumer market drools over specifications and claims of fast super fast autofocus, object tracking and selectable areas of focus and Image Stabilisation. These features are impossible with the Leica M system. Not important to Leica users but definitely \"THE\" selling point to many photographers including Pro's I do have both the NEX7 and the M9. I purchased the M9 immediately on returning from a disastrous trip with the NEX7 and Zeiss lenses. The NEX is fiddly, too small, too light, has no custom settings, and is too susceptible to shooting with unintended settings. It fell apart and had to be rebuilt by Sony. The LCD screen degraded with moisture from my hand. The files have to be preprocessed up to DNG and often Cornerfixed. That's not going to suit your average amateur. I haven't used it since it was returned from Sony despite having an adaptor for my Leica lenses. Every process degrades the image in some way and I was very conscious of an unwanted pattern lurking in the depths of each image finally brought into Lightroom Considering all the technical wants and dreams expressed in this discussion thread, I suggest participants \"be careful what you wish for because you might get it!\". I most certainly don't want a Nex in Leica clothing. All those menus and configurable buttons? - no thanks!. In fact, I'm happy with my M9-P and I expect to be happy with my next purchase of either an MM or M240. Whatever Leica give me, I'll work with. I no longer want or use my perfectly refurbished NEX7 which I would describe as having no character or presence. If and when I discover that I need a camera body with a mind to replace my own, I'll hire someone to shoot me! One concessionary point I'll make about Sony is that their repair network delivered a seven day turnaround for the refurbishment, but that hasn't changed my opinion of the product.", "link": "https://www.l-camera-forum.com/topic/214267-the-sony-a7-thread-merged/page/4/?tab=comments#comment-2371189", "origin": "L-forum", "suborigin": "214267-the-sony-a7-thread-merged", "result": false, "Selector": "i'll make", "selectorShort": "make", "MarkedSent": "one concessionary point i'll make about sony is that their -----> repair !!!  network delivered a seven day turnaround for the refurbishment, but that hasn't changed my opinion of the product.", "sortedWord": "repair", "Identifyer": null, "identifyer": 92726, "year": "2013"}], "name": "Leicasortedout2013make"}