{"interestingcomments": [{"autor": "duckrider", "date": "2016-06-10 13:32:00", "content": "I love these DIY imtems, well done! Personally I'm deeply satiesfied with the Thumbie made by our forum member 250swb. Thomas", "link": "https://www.l-camera-forum.com/topic/260489-diy-thumbs-upthumbie-for-m8/?tab=comments#comment-3059602", "origin": "L-forum", "suborigin": "260489-diy-thumbs-upthumbie-for-m8", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i love these -----> diy !!!  imtems, well done! personally i'm deeply satiesfied with the thumbie made by our forum member 250swb. thomas", "sortedWord": "None", "Identifyer": null, "identifyer": 45657, "year": "2016"}, {"autor": "earleygallery", "date": "2016-01-13 16:21:00", "content": "I'm surprised Leica said they can't replace the screen - maybe they didn't realise what you meant as the actual LCD can no longer be replaced. I think the screen (that is the cover) is held to the body with adhesive which you can heat with a hairdryer to remove, so if you could find a replacement cover it should be pretty simple to DIY. Or do as suggested above.", "link": "https://www.l-camera-forum.com/topic/255562-cracked-the-screen/?tab=comments#comment-2967976", "origin": "L-forum", "suborigin": "255562-cracked-the-screen", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i'm surprised leica said they can't replace the screen - maybe they didn't realise what you meant as the actual lcd can no longer be replaced. i think the screen (that is the cover) is held to the body with adhesive which you can heat with a hairdryer to remove, so if you could find a replacement cover it should be pretty simple to -----> diy !!! . or do as suggested above.", "sortedWord": "None", "Identifyer": null, "identifyer": 46043, "year": "2016"}, {"autor": "gbealnz", "date": "2016-01-21 09:26:00", "content": "Great descriptive assistance Mark. Why can't one simply replace the glass that is fitted to that rear half? Even a bit of DIY? Gary", "link": "https://www.l-camera-forum.com/topic/255562-cracked-the-screen/?tab=comments#comment-2973285", "origin": "L-forum", "suborigin": "255562-cracked-the-screen", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "great descriptive assistance mark. why can't one simply replace the glass that is fitted to that rear half? even a bit of -----> diy !!! ? gary", "sortedWord": "None", "Identifyer": null, "identifyer": 46052, "year": "2016"}, {"autor": "jaapv", "date": "2016-06-17 00:03:00", "content": "If it is just the vertical alignment I would never consider sending the camera to Leica. I would drop by the local camera repIr shop - provided they know about Leicas and wait ten minutes for them to adjust it. I would not expect it to cost the earth. Alternately I would tackle it myself. It is an easy DIY job.", "link": "https://www.l-camera-forum.com/topic/261235-m8-vertical-rangefinder-alignment-price/?tab=comments#comment-3062906", "origin": "L-forum", "suborigin": "261235-m8-vertical-rangefinder-alignment-price", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "if it is just the vertical alignment i would never consider sending the camera to leica. i would drop by the local camera repir shop - provided they know about leicas and wait ten minutes for them to adjust it. i would not expect it to cost the earth. alternately i would tackle it myself. it is an easy -----> diy !!!  job.", "sortedWord": "None", "Identifyer": null, "identifyer": 46386, "year": "2016"}, {"autor": "Ernstk", "date": "2016-04-21 06:26:00", "content": "Thanks both. Yes, you're probably right. The thing that made me think about DIY was the thread on here 'Anatomy of the Leica M8' http://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page-1 which shows that the entire rear half of the camera is fairly easily removed. I was thinking about simply swapping over the two rear parts. Ernst", "link": "https://www.l-camera-forum.com/topic/259525-replace-m8-shutter-or-lcd-rear-screen/?tab=comments#comment-3030570", "origin": "L-forum", "suborigin": "259525-replace-m8-shutter-or-lcd-rear-screen", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "thanks both. yes, you're probably right. the thing that made me think about -----> diy !!!  was the thread on here 'anatomy of the leica m8' http://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page-1 which shows that the entire rear half of the camera is fairly easily removed. i was thinking about simply swapping over the two rear parts. ernst", "sortedWord": "None", "Identifyer": null, "identifyer": 46756, "year": "2016"}, {"autor": "earleygallery", "date": "2016-05-06 00:22:00", "content": "I don't even think Leica would do that (use your secondhand parts from another camera) as they have to give a warranty for their work, and AFAIK the independent repairers won't touch digital M's, so DIY is probably your only option anyway. Presumably swapping the LCD is a 'plug n play' type of switch assuming you can take the necessary parts off.", "link": "https://www.l-camera-forum.com/topic/259525-replace-m8-shutter-or-lcd-rear-screen/?tab=comments#comment-3040024", "origin": "L-forum", "suborigin": "259525-replace-m8-shutter-or-lcd-rear-screen", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i don't even think leica would do that (use your secondhand parts from another camera) as they have to give a warranty for their work, and afaik the independent repairers won't touch digital m's, so -----> diy !!!  is probably your only option anyway. presumably swapping the lcd is a 'plug n play' type of switch assuming you can take the necessary parts off.", "sortedWord": "None", "Identifyer": null, "identifyer": 46768, "year": "2016"}, {"autor": "Ernstk", "date": "2016-05-06 13:15:00", "content": "I don't even think Leica would do that (use your secondhand parts from another camera) as they have to give a warranty for their work, and AFAIK the independent repairers won't touch digital M's, so DIY is probably your only option anyway. Presumably swapping the LCD is a 'plug n play' type of switch assuming you can take the necessary parts off. The M8 body splits into two halves. My plan is to swap over the rear half containing the LCD. But, as my fellow countryman once wrote \"The best laid plans of mice and men...\" Ernst", "link": "https://www.l-camera-forum.com/topic/259525-replace-m8-shutter-or-lcd-rear-screen/?tab=comments#comment-3040291", "origin": "L-forum", "suborigin": "259525-replace-m8-shutter-or-lcd-rear-screen", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i don't even think leica would do that (use your secondhand parts from another camera) as they have to give a warranty for their work, and afaik the independent repairers won't touch digital m's, so -----> diy !!!  is probably your only option anyway. presumably swapping the lcd is a 'plug n play' type of switch assuming you can take the necessary parts off. the m8 body splits into two halves. my plan is to swap over the rear half containing the lcd. but, as my fellow countryman once wrote \"the best laid plans of mice and men...\" ernst", "sortedWord": "None", "Identifyer": null, "identifyer": 46770, "year": "2016"}, {"autor": "miric", "date": "2016-12-09 14:49:00", "content": "Hi everybody. I'd like to share my small experience in lens coding. Now I have only two lenses: CZ C Sonnar 1.5/50 ZM and VM Color-Skopar 35/2.5 PII. Initial preparations took some time. I saw native Leica coded lenses and many DIY codes. Also I read some folks noticed some hand-made codes aren't readable by new cam bodies. So I decided to discover this topic deeply. I have M9 cam with straight reader. As well known M240/M262 have curved form reader. So I started to make drawings based on vector images from manuals and then moved to camera mount photos. I decided they're more real. I analyzed both type reader areas and found optimal point size and position to be read with both shapes of readers. I printed some amount of drawn mount templates on hard photo paper in a digital print service. The template had exact outer radius to fit with Leica and Zeiss lenses and lock mark. It's enough to position the template precisely on lens mount. Template has been cut out and temporary mounted to lens mount with double side stick tape. Then I started to drill slowly and accurate small holes with 1mm bit by fingers. The hard paper allows to avoid bit slipping in the very beginning. Then I removed the template and had noticeable holes. It's possible to continue with 1.5mm bit. During metering I measured an optimal diameter for point as 1.7mm. But 1.5mm bit OK as well due to relatively low diameter precision and a fluctuation during drilling. After I applied electric screw driver at low rotation rate and small drill time of each hole. I finished with 2mm bit in my fingers to make hole edges smooth. Sonnar was the first and very simple task due to it is recommended to code it as lux 50 asph. So it has only 1 left bit hole. That's it. The hole has been filled with black matte paint made by Revell I usually use to paint my railway models. --img--  Another deal was with Color-Skopar. Voigtlaender designers in some reason decided to put screw right at the end of 6-bit code --img--  After that I made a gutter from the screw hole towards mount edge. There's two black points so it is OK to just have fully painted gutter (hasn't show on the photo). Now Skopar is being read as Summarit 35/2.5. --img--  That's all. I still don't know if they will be read correctly with M240/M262 bodies. But I'll test it when I'll reach my buddy with such kind of cam. Edited December 9, 2016 by miric", "link": "https://www.l-camera-forum.com/topic/185433-m-lens-codes/page/6/?tab=comments#comment-3163431", "origin": "L-forum", "suborigin": "185433-m-lens-codes", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hi everybody. i'd like to share my small experience in lens coding. now i have only two lenses: cz c sonnar 1.5/50 zm and vm color-skopar 35/2.5 pii. initial preparations took some time. i saw native leica coded lenses and many -----> diy !!!  codes. also i read some folks noticed some hand-made codes aren't readable by new cam bodies. so i decided to discover this topic deeply. i have m9 cam with straight reader. as well known m240/m262 have curved form reader. so i started to make drawings based on vector images from manuals and then moved to camera mount photos. i decided they're more real. i analyzed both type reader areas and found optimal point size and position to be read with both shapes of readers. i printed some amount of drawn mount templates on hard photo paper in a digital print service. the template had exact outer radius to fit with leica and zeiss lenses and lock mark. it's enough to position the template precisely on lens mount. template has been cut out and temporary mounted to lens mount with double side stick tape. then i started to drill slowly and accurate small holes with 1mm bit by fingers. the hard paper allows to avoid bit slipping in the very beginning. then i removed the template and had noticeable holes. it's possible to continue with 1.5mm bit. during metering i measured an optimal diameter for point as 1.7mm. but 1.5mm bit ok as well due to relatively low diameter precision and a fluctuation during drilling. after i applied electric screw driver at low rotation rate and small drill time of each hole. i finished with 2mm bit in my fingers to make hole edges smooth. sonnar was the first and very simple task due to it is recommended to code it as lux 50 asph. so it has only 1 left bit hole. that's it. the hole has been filled with black matte paint made by revell i usually use to paint my railway models. --img--  another deal was with color-skopar. voigtlaender designers in some reason decided to put screw right at the end of 6-bit code --img--  after that i made a gutter from the screw hole towards mount edge. there's two black points so it is ok to just have fully painted gutter (hasn't show on the photo). now skopar is being read as summarit 35/2.5. --img--  that's all. i still don't know if they will be read correctly with m240/m262 bodies. but i'll test it when i'll reach my buddy with such kind of cam. edited december 9, 2016 by miric", "sortedWord": "None", "Identifyer": null, "identifyer": 7528, "year": "2016"}, {"autor": "gbealnz", "date": "2016-09-22 08:04:00", "content": "Looks good Toshi. Initially, in my speed-reading of the post I thought you were talking about a simple closeup lens (Is that the correct term Dunk?) But then I saw \"154mm\" and re-read the title, a tele-convertor. I got held up with a very persistent camera shop salesman in HK last year, he was hell-bent on selling me a Rollei branded tele-convertor. I didn't buy it, and after an hour of him trying I simply walked out, much to his disgust. Is the Raynox like the Rollei? My closeup assistance (over and above the already close focusing of the X-Vario) is from a couple of Elpro lenses, with DIY adapter rings. They work exceptionally well. Full credit to Dunk for the headsup on the Elpros.Gary", "link": "https://www.l-camera-forum.com/topic/264819-x-vario-with-raynox-dcr-2025pro-22x-teleconverter/?tab=comments#comment-3116839", "origin": "L-forum", "suborigin": "264819-x-vario-with-raynox-dcr-2025pro-22x-teleconverter", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "looks good toshi. initially, in my speed-reading of the post i thought you were talking about a simple closeup lens (is that the correct term dunk?) but then i saw \"154mm\" and re-read the title, a tele-convertor. i got held up with a very persistent camera shop salesman in hk last year, he was hell-bent on selling me a rollei branded tele-convertor. i didn't buy it, and after an hour of him trying i simply walked out, much to his disgust. is the raynox like the rollei? my closeup assistance (over and above the already close focusing of the x-vario) is from a couple of elpro lenses, with -----> diy !!!  adapter rings. they work exceptionally well. full credit to dunk for the headsup on the elpros.gary", "sortedWord": "None", "Identifyer": null, "identifyer": 11220, "year": "2016"}], "name": "Leicasortedout2016diy"}