{"interestingcomments": [{"autor": "zwieback", "date": "2021-04-03 19:40:00", "content": " Hallo, can you please help me to get for information about the \"prototyp 3\" camera? Any data, pics, sources, references... wellcome --img-- ", "link": "https://www.l-camera-forum.com/topic/319554-infos-about-the-prototyp-3-camera/?tab=comments#comment-4173731", "origin": "L-forum", "suborigin": "319554-infos-about-the-prototyp-3-camera", "result": true, "Selector": "prototyp", "selectorShort": "prototyp", "MarkedSent": " hallo, can you please help me to get for information about the \"-----> prototyp !!!  3\" camera? any data, pics, sources, references... wellcome --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 39742, "year": "2021"}, {"autor": "zwieback", "date": "2021-04-05 18:49:00", "content": "Forgot the last part of my speculations.. The time steps of development I see like this: -ur-leica -2nd ur-leica(?) -prototype 3 in its first version with the dial for the slot width on the left like on the \"handmuster\" of the silver prototype camera -modifying prototyp 3 to incorporate the shaft for the brake, crossdrilling the original slot gap dial, that now was moved to the right side of the camera --cut out for a quite rough installation of an integrated view finder=> current state of the camera -\"handmuster\" camera with an integrated version of brake - which according to Dr Kisselbach and Ottmar Michaelys did not work (anymore) when the camera was reactivated. Adjustment of slot width directly done on the roller. Dial back in original position as brake was now integrated -later prototypes, which follow pretty much exactly the Handmuster", "link": "https://www.l-camera-forum.com/topic/319554-infos-about-the-prototyp-3-camera/?tab=comments#comment-4174946", "origin": "L-forum", "suborigin": "319554-infos-about-the-prototyp-3-camera", "result": true, "Selector": "prototyp", "selectorShort": "prototyp", "MarkedSent": "forgot the last part of my speculations.. the time steps of development i see like this: -ur-leica -2nd ur-leica(?) -prototype 3 in its first version with the dial for the slot width on the left like on the \"handmuster\" of the silver prototype camera -modifying -----> prototyp !!!  3 to incorporate the shaft for the brake, crossdrilling the original slot gap dial, that now was moved to the right side of the camera --cut out for a quite rough installation of an integrated view finder=> current state of the camera -\"handmuster\" camera with an integrated version of brake - which according to dr kisselbach and ottmar michaelys did not work (anymore) when the camera was reactivated. adjustment of slot width directly done on the roller. dial back in original position as brake was now integrated -later prototypes, which follow pretty much exactly the handmuster", "sortedWord": "None", "Identifyer": null, "identifyer": 39746, "year": "2021"}], "name": "Leicasortedout2021prototyp"}