{"interestingcomments": [{"autor": "denoir", "date": "2011-08-14 14:46:00", "content": " No, ETTR refers to exposing to the right, before blowing the highlights. One needs to know his/her camera and histogram reading to do this effectively. The M9 hasn't turned digital logic on its head (as I wrote earlier regarding the M8); most of the pixel info still resides in the higher zones. And again, that doesn't mean ETTR is right for everyone or for every scene, but the logic still holds, even for the M9. It's a matter of good execution. That's why I carry a pocket meter for tricky light; otherwise I know my camera and its limitations (M8.2 for me). Jeff Of course the logic is the same but it's still not a good idea due to 1) ETTR makes in practice relatively little difference 2) The M8/M9 have limited headroom in the highlights so you risk blowing them beyond recovery. In essence chances are that you'll do more damage than good. On a Canon 5DII for instance on the other hand you have a lot of latitude in the highlights and very little in the shadows (including the infamous noise banding at low ISO) so ETTR can be useful. It has however more to do where the mid point of the latitude span is rather than because of the linear nature of camera sensors. If you are well within the dynamic range of the camera AND have sufficient light to use low ISO then by all means ETTR to your heart's content. However very often having light enough for low ISO and the scene having limited dynamic range are mutually exclusive. So it's not a generally good principle when the camera output has limited capability of highlight recovery. May I re-phrase the question from the other side: Does the M8/M9 tolerate ETTR better or worse than other cameras? Worse because you are at higher risk of blowing the highlights beyond recovery. Edited August 14, 2011 by denoir", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/2/?tab=comments#comment-1765294", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "[idea, makes]", "selectorShort": "idea", "MarkedSent": " No, ETTR refers to exposing to the right, before blowing the highlights. One needs to know his/her camera and histogram reading to do this effectively. The M9 hasn't turned digital logic on its head (as I wrote earlier regarding the M8); most of the pixel info still resides in the higher zones. And again, that doesn't mean ETTR is right for everyone or for every scene, but the logic still holds, even for the M9. It's a matter of good execution. That's why I carry a pocket meter for tricky light; otherwise I know my camera and its limitations (M8.2 for me). Jeff Of course the logic is the same but it's still not a good idea due to 1) ETTR makes in practice relatively little difference 2) The M8/M9 have limited headroom in the highlights so you risk blowing them beyond recovery. In essence chances are that you'll do more damage than good. On a Canon 5DII for instance on the other hand you have a lot of latitude in the highlights and very little in the shadows (including the infamous noise banding at low ISO) so ETTR can be useful. It has however more to do where the mid point of the latitude span is rather than because of the linear nature of camera sensors. If you are well within the dynamic range of the camera AND have sufficient light to use low ISO then by all means ETTR to your heart's content. However very often having light enough for low ISO and the scene having limited dynamic range are mutually exclusive. So it's not a generally good principle when the camera output has limited capability of highlight recovery. May I re-phrase the question from the other side: Does the M8/M9 tolerate ETTR better or worse than other cameras? Worse because you are at higher risk of blowing the highlights beyond recovery. Edited August 14, 2011 by denoir", "sortedWord": "None", "Identifyer": null, "identifyer": 32569, "year": "2011"}, {"autor": "Muizen", "date": "2011-08-15 06:45:00", "content": "The many reactions to my question to whether or not ETTR, has left me somewhat confused. Perhaps I am looking for a rule I could adopt, but such a rule is not possible because of the strongly varying light circumstances? Some key opinions (although taken out of context) - ETTR is recommended by Reichman - ETTR should be avoided (Hans) - Underexposing with half a stop yields perfect results (horoso) - M9 does not tolerate ETTR better or worse than other cameras (denoir) - ETTR mostly a waste of time (Sandy/Keithu) - Meter normally for the M9 mostly all the time (= no ETTR) (dwbell) - ETTR but constrained to not blown highlights ((k-hawinkler) - For the M9 (ETTR) is not a good idea (denoir) - Reichmans article makes perfect sense in situations where there is plenty of light..ETTR is mythical. M9 handles underexposure spectacularly well, despite the theory (Blakley) As a result of this interesting discussion I tend to conclude that ETTR (and it goes without saying: without blowing highlights) is not better than exposing normally with perhaps a tendency to some underexposing. But that much depends on the available light.", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/3/?tab=comments#comment-1765825", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "[idea, makes]", "selectorShort": "idea", "MarkedSent": "The many reactions to my question to whether or not ETTR, has left me somewhat confused. Perhaps I am looking for a rule I could adopt, but such a rule is not possible because of the strongly varying light circumstances? Some key opinions (although taken out of context) - ETTR is recommended by Reichman - ETTR should be avoided (Hans) - Underexposing with half a stop yields perfect results (horoso) - M9 does not tolerate ETTR better or worse than other cameras (denoir) - ETTR mostly a waste of time (Sandy/Keithu) - Meter normally for the M9 mostly all the time (= no ETTR) (dwbell) - ETTR but constrained to not blown highlights ((k-hawinkler) - For the M9 (ETTR) is not a good idea (denoir) - Reichmans article makes perfect sense in situations where there is plenty of light..ETTR is mythical. M9 handles underexposure spectacularly well, despite the theory (Blakley) As a result of this interesting discussion I tend to conclude that ETTR (and it goes without saying: without blowing highlights) is not better than exposing normally with perhaps a tendency to some underexposing. But that much depends on the available light.", "sortedWord": "None", "Identifyer": null, "identifyer": 32586, "year": "2011"}, {"autor": "jamesk8752", "date": "2011-04-02 03:06:00", "content": " I just picked up a used but immaculate black M8 from a friend who doesn't keep his older cameras (he switched to an M9 immediately after it was released). As a collector, I wanted to add it to my M body collection. No \"coffee stains\" on the LCD, no lines or green blobs in the images, RF alignment is spot on, seems to operate perfectly, and I like having the 1/8000 shutter speed available. The serial number is 31022xx. I'm curious as to when it was made. From what I can gather through forum searches, this body is a very early one, possibly from the first batch produced. My friend said that it was one of the first ones sold in this area, and that he sent it back to Solms for service not long after he bought it (possibly as part of a recall). I suspect that it has a new sensor. Any ideas as to when it was made, and is it from the first batch? Thanks in advance... Regards, Jim", "link": "https://www.l-camera-forum.com/topic/147918-m8-serial-number/?tab=comments#comment-1633169", "origin": "L-forum", "suborigin": "147918-m8-serial-number", "result": true, "Selector": "[ideas, made]", "selectorShort": "idea", "MarkedSent": " I just picked up a used but immaculate black M8 from a friend who doesn't keep his older cameras (he switched to an M9 immediately after it was released). As a collector, I wanted to add it to my M body collection. No \"coffee stains\" on the LCD, no lines or green blobs in the images, RF alignment is spot on, seems to operate perfectly, and I like having the 1/8000 shutter speed available. The serial number is 31022xx. I'm curious as to when it was made. From what I can gather through forum searches, this body is a very early one, possibly from the first batch produced. My friend said that it was one of the first ones sold in this area, and that he sent it back to Solms for service not long after he bought it (possibly as part of a recall). I suspect that it has a new sensor. Any ideas as to when it was made, and is it from the first batch? Thanks in advance... Regards, Jim", "sortedWord": "None", "Identifyer": null, "identifyer": 41972, "year": "2011"}, {"autor": "menos I M6", "date": "2011-11-09 01:26:00", "content": "seen a few of these black M8`s with all the edges worn back to brass, do you use this cleaner that you have used on the dots, also on the edges, then polish it up? Ps. i want! Haha - no, no cleaner can do that. This is a Leica M8.2 - a later version of the M8, which is finished by Leica in a black lacquer, that wears with regular use. I do have the camera in daily use now for about 1 1/2 years. When I bought it, it had already very slight brassing on the on/off switch, the tip of the RF window and some brassing on the base plate. This behavior of the M8.2 makes it actually a more desirable camera to me, than my M9, which I know, will be sold in an eye blink, should a better sensor come around one day. My M8.2 will stay! The black M9 has a different paint process (powder coating), which doesn't wear the same. I have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. As interesting this might be, one can instantly spot a \"user aged\" from any \"sanded\" body by how the edges are worn. I dislike the idea of filing and sanding an expensive tool, to make it look more used.", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/4/?tab=comments#comment-1838745", "origin": "L-forum", "suborigin": "160294-still-loving-the-m8", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": "seen a few of these black M8`s with all the edges worn back to brass, do you use this cleaner that you have used on the dots, also on the edges, then polish it up? Ps. i want! Haha - no, no cleaner can do that. This is a Leica M8.2 - a later version of the M8, which is finished by Leica in a black lacquer, that wears with regular use. I do have the camera in daily use now for about 1 1/2 years. When I bought it, it had already very slight brassing on the on/off switch, the tip of the RF window and some brassing on the base plate. This behavior of the M8.2 makes it actually a more desirable camera to me, than my M9, which I know, will be sold in an eye blink, should a better sensor come around one day. My M8.2 will stay! The black M9 has a different paint process (powder coating), which doesn't wear the same. I have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. As interesting this might be, one can instantly spot a \"user aged\" from any \"sanded\" body by how the edges are worn. I dislike the idea of filing and sanding an expensive tool, to make it look more used.", "sortedWord": "None", "Identifyer": null, "identifyer": 42713, "year": "2011"}, {"autor": "smdavey", "date": "2011-11-09 11:29:00", "content": "Haha - no, no cleaner can do that.This is a Leica M8.2 - a later version of the M8, which is finished by Leica in a black lacquer, that wears with regular use. I do have the camera in daily use now for about 1 1/2 years. When I bought it, it had already very slight brassing on the on/off switch, the tip of the RF window and some brassing on the base plate. This behavior of the M8.2 makes it actually a more desirable camera to me, than my M9, which I know, will be sold in an eye blink, should a better sensor come around one day. My M8.2 will stay! The black M9 has a different paint process (powder coating), which doesn't wear the same. I have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. As interesting this might be, one can instantly spot a \"user aged\" from any \"sanded\" body by how the edges are worn. I dislike the idea of filing and sanding an expensive tool, to make it look more used. thanks for the info) yeah the M8 is (price wise) moving closer to the hands of myself now. so i am guessing the M8.2 is the one to look out for.", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/4/?tab=comments#comment-1838955", "origin": "L-forum", "suborigin": "160294-still-loving-the-m8", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": "Haha - no, no cleaner can do that.This is a Leica M8.2 - a later version of the M8, which is finished by Leica in a black lacquer, that wears with regular use. I do have the camera in daily use now for about 1 1/2 years. When I bought it, it had already very slight brassing on the on/off switch, the tip of the RF window and some brassing on the base plate. This behavior of the M8.2 makes it actually a more desirable camera to me, than my M9, which I know, will be sold in an eye blink, should a better sensor come around one day. My M8.2 will stay! The black M9 has a different paint process (powder coating), which doesn't wear the same. I have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. As interesting this might be, one can instantly spot a \"user aged\" from any \"sanded\" body by how the edges are worn. I dislike the idea of filing and sanding an expensive tool, to make it look more used. thanks for the info) yeah the M8 is (price wise) moving closer to the hands of myself now. so i am guessing the M8.2 is the one to look out for.", "sortedWord": "None", "Identifyer": null, "identifyer": 42714, "year": "2011"}, {"autor": "d2mini", "date": "2011-03-15 15:28:00", "content": "ok, I guess I'll continue talking to myself... --img--  I put this little number together the day I was leaving for Miami. I just got back yesterday and the bag performed better than any camera specific bag yet. Here's some thoughts: Better than the A&A bag I ganked the insert from because the Tumi has more storage (taller) making it better for travel. Plenty of room for flatter items that couldn't fit in the A&A at all without sticking way out of the rear pocket. But it does have something from the A&A that I personally prefer and that is a zipper as access to the main compartment. For me, this is much easier to work out of compared to a flap-top bag. The Tumi, worn cross-body like I wear all my camera bags, is more comfortable even without a shoulder pad. It hugs the body, and can be rotated from front to back with ease and never gets in the way even when traversing through tight crowds. My wife even carried it for a few minutes when my hands were full and the first thing out of her mouth was \"wow, this is comfortable!\" Better than Billingham for me, due to a few reasons. Styling - doesn't stand out due to a contrast in style both in what's in style these days and my own personal style. I'm a younger guy and I dress even younger. Billingham sticks out like a sore thumb on me. Fuction - I love billingham's padding, but i prefer the pockets, zippers, flaps, and strap on the Tumi. Easy to work out of and feels more secure, especially the smaller pockets. Size - This of course depends on which model Billingham, but I had the Hadley Pro and obviously this bag is much smaller but it worked great for a 3 lens kit and would fit another lens or two if you don't mind stacking. But i feel like i could fit more in this small bag compared to a Billingham in the same size. Better than (current) canvas Domke for a few reasons as well. Compared to f-5xb and f-803 waxwear. Construction... it's some kind of ballistic nylon or something. Super tough yet nice and flexible. Easy access. The front clip/flap of the 803 sucks. Storage. The pockets on the 803 flap are pretty worthless. Could fit an ipad in back and not fond of the front pockets and none of these feel secure. Looks better (subjective). Not that comfy to wear. 5xb is more comfy than the 803 imho, due to size i guess. Crumpler. Crumpler I always want to like. I like their modern look, they have some decent details/ideas for storage and great padding, yet they make their bags sooooo tight! They really need to \"loosen the belt\" a bit. Trying to access small pockets is a real chore, and I have small hands. This also restricts how much you can carry. They also utilize a flap to cover the main compartment which I already mentioned I'm not fond of. And due to the padding and tight design/construction, the bag doesn't hug the body. Think Tank. They make some amazing bags, especially for dslr cameras. They put more thought into the design/function of their bags than anyone, especially for the pro shooters. But they are ugly and bulky and just not made for rangefinders. Even their newer Retrospective line of bags which look better, are too bulky and just too much bag for an M kit, IMHO. I had Retro 10 when they were first released and returned it immediately. Another line of bags that I really want to like but just can't. Ok, that's pretty much it. If any of this helps anyone, cool. Remember, it's all just my personal opinion and what works for me may not work for you and vice-versa. I've seen a lot of people mention the re-purposing of non-camera bags for M kits and hadn't given much thought to it before. But I see now that the right bag with the right insert can make a world of difference. --img--  Edited March 15, 2011 by d2mini", "link": "https://www.l-camera-forum.com/topic/146103-repurposed-tumi-5123d-t-tech-bag/?tab=comments#comment-1616192", "origin": "L-forum", "suborigin": "146103-repurposed-tumi-5123d-t-tech-bag", "result": true, "Selector": "[ideas, make]", "selectorShort": "idea", "MarkedSent": "ok, I guess I'll continue talking to myself... --img--  I put this little number together the day I was leaving for Miami. I just got back yesterday and the bag performed better than any camera specific bag yet. Here's some thoughts: Better than the A&A bag I ganked the insert from because the Tumi has more storage (taller) making it better for travel. Plenty of room for flatter items that couldn't fit in the A&A at all without sticking way out of the rear pocket. But it does have something from the A&A that I personally prefer and that is a zipper as access to the main compartment. For me, this is much easier to work out of compared to a flap-top bag. The Tumi, worn cross-body like I wear all my camera bags, is more comfortable even without a shoulder pad. It hugs the body, and can be rotated from front to back with ease and never gets in the way even when traversing through tight crowds. My wife even carried it for a few minutes when my hands were full and the first thing out of her mouth was \"wow, this is comfortable!\" Better than Billingham for me, due to a few reasons. Styling - doesn't stand out due to a contrast in style both in what's in style these days and my own personal style. I'm a younger guy and I dress even younger. Billingham sticks out like a sore thumb on me. Fuction - I love billingham's padding, but i prefer the pockets, zippers, flaps, and strap on the Tumi. Easy to work out of and feels more secure, especially the smaller pockets. Size - This of course depends on which model Billingham, but I had the Hadley Pro and obviously this bag is much smaller but it worked great for a 3 lens kit and would fit another lens or two if you don't mind stacking. But i feel like i could fit more in this small bag compared to a Billingham in the same size. Better than (current) canvas Domke for a few reasons as well. Compared to f-5xb and f-803 waxwear. Construction... it's some kind of ballistic nylon or something. Super tough yet nice and flexible. Easy access. The front clip/flap of the 803 sucks. Storage. The pockets on the 803 flap are pretty worthless. Could fit an ipad in back and not fond of the front pockets and none of these feel secure. Looks better (subjective). Not that comfy to wear. 5xb is more comfy than the 803 imho, due to size i guess. Crumpler. Crumpler I always want to like. I like their modern look, they have some decent details/ideas for storage and great padding, yet they make their bags sooooo tight! They really need to \"loosen the belt\" a bit. Trying to access small pockets is a real chore, and I have small hands. This also restricts how much you can carry. They also utilize a flap to cover the main compartment which I already mentioned I'm not fond of. And due to the padding and tight design/construction, the bag doesn't hug the body. Think Tank. They make some amazing bags, especially for dslr cameras. They put more thought into the design/function of their bags than anyone, especially for the pro shooters. But they are ugly and bulky and just not made for rangefinders. Even their newer Retrospective line of bags which look better, are too bulky and just too much bag for an M kit, IMHO. I had Retro 10 when they were first released and returned it immediately. Another line of bags that I really want to like but just can't. Ok, that's pretty much it. If any of this helps anyone, cool. Remember, it's all just my personal opinion and what works for me may not work for you and vice-versa. I've seen a lot of people mention the re-purposing of non-camera bags for M kits and hadn't given much thought to it before. But I see now that the right bag with the right insert can make a world of difference. --img--  Edited March 15, 2011 by d2mini", "sortedWord": "None", "Identifyer": null, "identifyer": 83493, "year": "2011"}, {"autor": "jaapv", "date": "2011-12-02 15:34:00", "content": "Basically the value reduction is the general idea - to make it less attractive to steal.", "link": "https://www.l-camera-forum.com/topic/167572-how-would-you-engrave-your-leica/page/2/?tab=comments#comment-1860282", "origin": "L-forum", "suborigin": "167572-how-would-you-engrave-your-leica", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": "Basically the value reduction is the general idea - to make it less attractive to steal.", "sortedWord": "None", "Identifyer": null, "identifyer": 87161, "year": "2011"}, {"autor": "philipus", "date": "2011-12-02 19:05:00", "content": " Basically the value reduction is the general idea - to make it less attractive to steal. Though I don't think you meant it that way, the inverse of what you've written is that there'd be collectors or their help roaming the streets looking for un-engraved cameras to steal. --img--  You don't need an expert to tell you that a personal engraving will reduce a camera's value --img-- . Like I said... who buys a camera new to allow a collector years down the line to be able to get a mint collector's piece. Good luck with your gift. P", "link": "https://www.l-camera-forum.com/topic/167572-how-would-you-engrave-your-leica/page/2/?tab=comments#comment-1860499", "origin": "L-forum", "suborigin": "167572-how-would-you-engrave-your-leica", "result": true, "Selector": "[idea, make]", "selectorShort": "idea", "MarkedSent": " Basically the value reduction is the general idea - to make it less attractive to steal. Though I don't think you meant it that way, the inverse of what you've written is that there'd be collectors or their help roaming the streets looking for un-engraved cameras to steal. --img--  You don't need an expert to tell you that a personal engraving will reduce a camera's value --img-- . Like I said... who buys a camera new to allow a collector years down the line to be able to get a mint collector's piece. Good luck with your gift. P", "sortedWord": "None", "Identifyer": null, "identifyer": 87164, "year": "2011"}, {"autor": "plasticman", "date": "2011-08-17 09:46:00", "content": "I also own a 500CM and find that it's a beautiful and really solid camera to use. I'm finding it harder than I thought to adapt to the square format in composing, and I often find that images that appear dynamic in the standard 35mm format somehow don't 'work' within the square frame. What this means is that I simply haven't used the camera enough yet. But having to explore and adapt means that I'm brimming with ideas for shoots - which is something that I rarely do with my 35mm equipment (I use those to record my life instead, if that makes sense). As for the quality of the negatives - they are so amazing, even my mundane pictures have a breathtaking quality to the sheer look of them. I only wish the subject and composition did them justice - but that's where talent comes in. --img-- ", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/3/?tab=comments#comment-1767896", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "[ideas, makes]", "selectorShort": "idea", "MarkedSent": "I also own a 500CM and find that it's a beautiful and really solid camera to use. I'm finding it harder than I thought to adapt to the square format in composing, and I often find that images that appear dynamic in the standard 35mm format somehow don't 'work' within the square frame. What this means is that I simply haven't used the camera enough yet. But having to explore and adapt means that I'm brimming with ideas for shoots - which is something that I rarely do with my 35mm equipment (I use those to record my life instead, if that makes sense). As for the quality of the negatives - they are so amazing, even my mundane pictures have a breathtaking quality to the sheer look of them. I only wish the subject and composition did them justice - but that's where talent comes in. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 103167, "year": "2011"}], "name": "Leicasortedout2011idea"}