{"interestingcomments": [{"autor": "Merlino69", "date": "2012-09-01 08:07:00", "content": "Hello Leica Forum, Let me introduce myself. I am Italian and joined the forum some time ago. I used a lot the Forum resources to know more about the Leica world. Thank you all for your postings. Forum is really a great resource! About me: Three year ago, coming back from a Paris trip, I sold out my digital C SLR and lenses and I immediately decided to adopt the rangefinder and revert to film. So I bought my first Leica (M6). I was so comfortable in this world that I decided one year ago to buy also a digital M9. Leica Ms and rangefinder are perfect companions for my idea of photography and my personal research in Street Photography. About lenses I mainly use a vintage Cron 35 and I will arrive in the next future to the Lux 35. Hope to contribute in the future to the Forum. Thanks again and have a nice weekend, Stefano", "link": "https://www.l-camera-forum.com/topic/186962-welcome/?tab=comments#comment-2101750", "origin": "L-forum", "suborigin": "186962-welcome", "result": true, "Selector": "me introduce", "selectorShort": "introduce", "MarkedSent": "hello leica forum, let -----> me !!!  -----> introduce !!!  myself. i am italian and joined the forum some time ago. i used a lot the forum resources to know more about the leica world. thank you all for your postings. forum is really a great resource! about me: three year ago, coming back from a paris trip, i sold out my digital c slr and lenses and i immediately decided to adopt the rangefinder and revert to film. so i bought my first leica (m6). i was so comfortable in this world that i decided one year ago to buy also a digital m9. leica ms and rangefinder are perfect companions for my idea of photography and my personal research in street photography. about lenses i mainly use a vintage cron 35 and i will arrive in the next future to the lux 35. hope to contribute in the future to the forum. thanks again and have a nice weekend, stefano", "sortedWord": "None", "Identifyer": null, "identifyer": 113755, "year": "2012"}], "name": "Leicasortedout2012introduce"}