{"interestingcomments": [{"autor": "wpo", "date": "2019-03-15 14:55:00", "content": "vor 51 Minuten schrieb fotoauge: Hallo zusammen, mir ist heute eine Leica s2 angeboten worden, diese soll aus Baujahr 1975, voll funktionsfähig sein und einen \"Motor\" haben ! Kann mir jemand sagen was man dafür bieten kann ? Möchte erst ein paar Informationen haben bevor ich einen Termin ausmache. Freue mich auf ein paar Einschätzungen Guten Tag, mal davon abgesehen dass Du Dich hier im internationalen Teil des Forums befindest, wo eigentlich englisch geschrieben wird, antworte ich Dir mal etwas scherzhaft: Was Dir dort angeboten wurde muss ein sehr früher Prototyp sein weil die S2 erst 2009 in den Verkauf kam. Wenn Du bitte mal im Leica Wiki nachschaust: https://www.l-camera-forum.com/leica-wiki.de/index.php/LEICA_S2 Für die S2 kann man je nach Zustand und Zubehör (mit Objektiv oder nicht) mehrere tausend Euro ausgeben. Ich vermute eher dass Dir statt dessen eine Leicaflex SL2mot angeboten wurde. Du findest sie auf der Abbildung des Leica-Stammbaums auf der 6. bzw. 7. Zeile rechts ganz außen. --img--  Das würde zumindest vom Baujahr her passen. Diese Kamera ist im Grunde eine exzellente Kamera, welche aus heutiger Sicht jedoch eine Eigenart besitzt: sie funktioniert ausschließlich mit Film. Zum Preis ist schlecht etwas zu sagen, weil sehr abhängig vom Zustand, aber ich denke man sollte (ohne Optik) auch bei einem exzellenten Exemplar nicht mehr als 1500,-€ dafür bezahlen. Achte auf ein Sucherprisma ohne Ablösungen der Versilberung und probiere den Motor bitte nicht (!) ohne Film in der Kamera aus. Der starke Motor könnte das übel nehmen und sich selbst zerstören wenn die Belastung durch den Filmtransport fehlt. Alles weitere erfährst Du sicherlich im deutschen Teil des Forums und vielleicht bittest Du einen Moderator dass er Deine Frage auch dorthin verschiebt. Freundliche Grüße Wolfgang", "link": "https://www.l-camera-forum.com/topic/295244-leica-s2/?tab=comments#comment-3703004", "origin": "L-forum", "suborigin": "295244-leica-s2", "result": true, "Selector": "prototyp", "selectorShort": "prototyp", "MarkedSent": "vor 51 minuten schrieb fotoauge: hallo zusammen, mir ist heute eine leica s2 angeboten worden, diese soll aus baujahr 1975, voll funktionsfähig sein und einen \"motor\" haben ! kann mir jemand sagen was man dafür bieten kann ? möchte erst ein paar informationen haben bevor ich einen termin ausmache. freue mich auf ein paar einschätzungen guten tag, mal davon abgesehen dass du dich hier im internationalen teil des forums befindest, wo eigentlich englisch geschrieben wird, antworte ich dir mal etwas scherzhaft: was dir dort angeboten wurde muss ein sehr früher -----> prototyp !!!  sein weil die s2 erst 2009 in den verkauf kam. wenn du bitte mal im leica wiki nachschaust: https://www.l-camera-forum.com/leica-wiki.de/index.php/leica_s2 für die s2 kann man je nach zustand und zubehör (mit objektiv oder nicht) mehrere tausend euro ausgeben. ich vermute eher dass dir statt dessen eine leicaflex sl2mot angeboten wurde. du findest sie auf der abbildung des leica-stammbaums auf der 6. bzw. 7. zeile rechts ganz außen. --img--  das würde zumindest vom baujahr her passen. diese kamera ist im grunde eine exzellente kamera, welche aus heutiger sicht jedoch eine eigenart besitzt: sie funktioniert ausschließlich mit film. zum preis ist schlecht etwas zu sagen, weil sehr abhängig vom zustand, aber ich denke man sollte (ohne optik) auch bei einem exzellenten exemplar nicht mehr als 1500,-€ dafür bezahlen. achte auf ein sucherprisma ohne ablösungen der versilberung und probiere den motor bitte nicht (!) ohne film in der kamera aus. der starke motor könnte das übel nehmen und sich selbst zerstören wenn die belastung durch den filmtransport fehlt. alles weitere erfährst du sicherlich im deutschen teil des forums und vielleicht bittest du einen moderator dass er deine frage auch dorthin verschiebt. freundliche grüße wolfgang", "sortedWord": "None", "Identifyer": null, "identifyer": 31088, "year": "2019"}], "name": "Leicasortedout2019prototyp"}