{"interestingcomments": [{"autor": "helged", "date": "2014-03-23 09:02:00", "content": "I find both my M8.2 and M240 as slippery as soap bars per se and i would not have bought them if Thumbs Up or Thumbies were not available most probably. YMMV. I fully agree. The thumbie has been my choice on M9 and MM because of small size, great ergonomics (for my hand, any way) and keeping the hot shoe free for use for external viewfinder or blitz. It would be great of Steve has been able to come up with a similar, durable solution for the M240 (keeping the hot shoe and the thumb wheel free), which the post by 250swb might indicate.", "link": "https://www.l-camera-forum.com/topic/222240-thumbs-up-grip-for-m240/?tab=comments#comment-2555011", "origin": "L-forum", "suborigin": "222240-thumbs-up-grip-for-m240", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i find both my m8.2 and m240 as slippery as soap bars per se and i would not have bought them if thumbs up or thumbies were not available most probably. ymmv. i fully agree. the thumbie has been my choice on m9 and mm because of small size, great ergonomics (for my hand, any way) and keeping the hot shoe free for use for external viewfinder or blitz. it would be great of steve has been able to -----> come !!!  -----> up !!!  -----> with !!!  a similar, durable solution for the m240 (keeping the hot shoe and the thumb wheel free), which the post by 250swb might indicate.", "sortedWord": "None", "Identifyer": null, "identifyer": 12719, "year": "2014"}, {"autor": "bla", "date": "2014-02-26 06:35:00", "content": "Hey Arvid, the new revision is absolutely amazing!We can now perfectly fine fix any dead pixel issues ourselves ! I tested some solutions, how to integrate your tool in my workflow on a Mac, mainly centred around Adobe Lightroom and would currently have one major wish and a few suggestions regarding smoothing the workflow: 1) Is it possible to modify the droplet file via Apple script, so the resulting DNG files, created by m8raw2dng will be written into the same folder, the original RAW+JPG pairs are residing in? I want to keep the RAW+JPG pairs together in the same folder as the DNGs, I work with in Lightroom. This would allow for future work on them. Of course! Just don't pass the -o parameter. That way the output is not specified and the input folder will be taken as output. Be aware that the M8 DNGs will be modified, too... So make a secure copy while this is in Beta! --img--  2) Is there any possibility for a future m8raw2dng revision, which does not need the accompanying JPG file? I would love to discard the JPG, as I always do when cameras write raw + JPG files. I have absolutely no use for them, except m8raw2dng needs them currently, as I understand. Well that is at the moment not possible. The reason is that the RAW files do not contain exif information. You would be left without Exposure Time, Aperture Value, ISO... But technically it is not a problem. Could you describe your need to discard the JPG further? So when do you delete them, what do you want to keep and why? I think I could come up with a satisfying solution... Why do you want to keep the RAW files but not the JPG after conversion? For future releases? I could modify the RAW files and add exif information for backup purposes maybe. Or strip the jpg of image data and just keep the few bytes of information. Would that be what you want? 3) I suggest, that after a successful batch conversion of several files a small \"result\" is displayed in terminal in the jest of \"83 of 83 files were successfully converted\". This would provide a quick, assuring information after a longer batch conversion for people, who come back to their computer after having a coffee, … Currently each file conversion is documented within Terminal, so one could seek this assurance by scrolling trough each dialog. Now a big bonus would be if it would be possible, if m8raw2dng would support to post this final result into the OS X notification center and remain there with a time stamp and the result message until manually deleted instead of keeping the Terminal window alive after completed conversion. The first part I have thought of myself already. If I'm converting hundreds of pictures at a time the error messages just disappear... --img--  I thought of writing a log file of the latest conversion with the error messages and to do exactly such a warning line at the end of conversion. Will be done in the first revision of the beta. About the OS X notification center I'll have to see... Am not familiar with it. Not sure if I can and will do that. I know, this is getting ahead of things and a big wish, but maybe it is possible ;-) ? Your new revision is a great thing - it made me break out my trusty old M8.2 again and use it mainly to find, what it can give me as a second body. I always loved the crisp, detailed files from the M8 sensor over the M9 sensor so I am keeping my M8.2 as of your software! That's nice to hear! Enjoy it and as always, there is more to come! Cheers, Arvid", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/4/?tab=comments#comment-2539595", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "hey arvid, the new revision is absolutely amazing!we can now perfectly fine fix any dead pixel issues ourselves ! i tested some solutions, how to integrate your tool in my workflow on a mac, mainly centred around adobe lightroom and would currently have one major wish and a few suggestions regarding smoothing the workflow: 1) is it possible to modify the droplet file via apple script, so the resulting dng files, created by m8raw2dng will be written into the same folder, the original raw+jpg pairs are residing in? i want to keep the raw+jpg pairs together in the same folder as the dngs, i work with in lightroom. this would allow for future work on them. of course! just don't pass the -o parameter. that way the output is not specified and the input folder will be taken as output. be aware that the m8 dngs will be modified, too... so make a secure copy while this is in beta! --img--  2) is there any possibility for a future m8raw2dng revision, which does not need the accompanying jpg file? i would love to discard the jpg, as i always do when cameras write raw + jpg files. i have absolutely no use for them, except m8raw2dng needs them currently, as i understand. well that is at the moment not possible. the reason is that the raw files do not contain exif information. you would be left without exposure time, aperture value, iso... but technically it is not a problem. could you describe your need to discard the jpg further? so when do you delete them, what do you want to keep and why? i think i could -----> come !!!  -----> up !!!  -----> with !!!  a satisfying solution... why do you want to keep the raw files but not the jpg after conversion? for future releases? i could modify the raw files and add exif information for backup purposes maybe. or strip the jpg of image data and just keep the few bytes of information. would that be what you want? 3) i suggest, that after a successful batch conversion of several files a small \"result\" is displayed in terminal in the jest of \"83 of 83 files were successfully converted\". this would provide a quick, assuring information after a longer batch conversion for people, who come back to their computer after having a coffee, … currently each file conversion is documented within terminal, so one could seek this assurance by scrolling trough each dialog. now a big bonus would be if it would be possible, if m8raw2dng would support to post this final result into the os x notification center and remain there with a time stamp and the result message until manually deleted instead of keeping the terminal window alive after completed conversion. the first part i have thought of myself already. if i'm converting hundreds of pictures at a time the error messages just disappear... --img--  i thought of writing a log file of the latest conversion with the error messages and to do exactly such a warning line at the end of conversion. will be done in the first revision of the beta. about the os x notification center i'll have to see... am not familiar with it. not sure if i can and will do that. i know, this is getting ahead of things and a big wish, but maybe it is possible ;-) ? your new revision is a great thing - it made me break out my trusty old m8.2 again and use it mainly to find, what it can give me as a second body. i always loved the crisp, detailed files from the m8 sensor over the m9 sensor so i am keeping my m8.2 as of your software! that's nice to hear! enjoy it and as always, there is more to come! cheers, arvid", "sortedWord": "None", "Identifyer": null, "identifyer": 41584, "year": "2014"}, {"autor": "Guest DrPix", "date": "2014-10-04 05:32:00", "content": "I´m NOT trying to discourage people from buying X. I LOVE Leica; I´ve been shooting with almost all Leica digicams for the last few years! My \"reflections\" are purely subjective, can only compare IQ of \"my pics\" on \"my screen\". Maybe the silver X I´ve tried was a lemon - highly unlikely - it´s rather my too high expectations! Many users will surely be thrilled and I´ll be crucified:). On my X \"sharpness\" became acceptable from f/4, quite good-very good on f/5.6 and f/8, not improving on f/11 (dof vs diffraction). AWB is not very best/accurate (as mentioned) still, the camera renders very nice images but the \"spark\" from XVario images was missing! If only Leica could come up with a Visoflex for XVario! As someone said - XVario is a M-class camera with some very high quality M-class lenses in ONE body! Perhaps not for \"bookeh/speed\" enthusiasts.. but for \"the rest\":p. Edited October 4, 2014 by DrPix", "link": "https://www.l-camera-forum.com/topic/234960-rolling-review-on-leica-x-typ-113/?tab=comments#comment-2683092", "origin": "L-forum", "suborigin": "234960-rolling-review-on-leica-x-typ-113", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i´m not trying to discourage people from buying x. i love leica; i´ve been shooting with almost all leica digicams for the last few years! my \"reflections\" are purely subjective, can only compare iq of \"my pics\" on \"my screen\". maybe the silver x i´ve tried was a lemon - highly unlikely - it´s rather my too high expectations! many users will surely be thrilled and i´ll be crucified:). on my x \"sharpness\" became acceptable from f/4, quite good-very good on f/5.6 and f/8, not improving on f/11 (dof vs diffraction). awb is not very best/accurate (as mentioned) still, the camera renders very nice images but the \"spark\" from xvario images was missing! if only leica could -----> come !!!  -----> up !!!  -----> with !!!  a visoflex for xvario! as someone said - xvario is a m-class camera with some very high quality m-class lenses in one body! perhaps not for \"bookeh/speed\" enthusiasts.. but for \"the rest\":p. edited october 4, 2014 by drpix", "sortedWord": "None", "Identifyer": null, "identifyer": 13984, "year": "2014"}, {"autor": "jdlaing", "date": "2014-08-10 23:02:00", "content": "Whew. I'll have to look thru the archives and come up with a tougher one.", "link": "https://www.l-camera-forum.com/topic/161026-do-you-know-this-building-game-thread/page/10/?tab=comments#comment-2647062", "origin": "L-forum", "suborigin": "161026-do-you-know-this-building-game-thread", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "whew. i'll have to look thru the archives and -----> come !!!  -----> up !!!  -----> with !!!  a tougher one.", "sortedWord": "None", "Identifyer": null, "identifyer": 53266, "year": "2014"}, {"autor": "xalo", "date": "2014-12-11 22:03:00", "content": "Stig, wish that this set up at least meets your expectations! I know that the SWD zooms some years back were quite a revelation to me (coming from Canon mid-range SLR gear). As to the Olympus button layout, I find it cumbersome already on the E-3: the two-button combinations in particular; positioning of AE lock as well; and certainly in comparison with the Eos 5D. Perhaps I was just unwilling to learn, as well, because I really miss the optical viewfinder on the OM-D series (also briefly tried the E-M5). Had hoped that Olympus would come up with a downsized SLR with better IQ (dynamic range and high iso) and a big prism — a 'true' digital OM. Will see if I get into the current line one day. FWIW, the venerable D Summilux 25mm has arrived and is quite what I expected. Chunky, bright, smooth and sharp. Will post when I got something worthwhile. Alexander Edited December 11, 2014 by xalo", "link": "https://www.l-camera-forum.com/topic/238203-olympus-omd-em-1-as-a-complement/?tab=comments#comment-2726397", "origin": "L-forum", "suborigin": "238203-olympus-omd-em-1-as-a-complement", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "stig, wish that this set up at least meets your expectations! i know that the swd zooms some years back were quite a revelation to me (coming from canon mid-range slr gear). as to the olympus button layout, i find it cumbersome already on the e-3: the two-button combinations in particular; positioning of ae lock as well; and certainly in comparison with the eos 5d. perhaps i was just unwilling to learn, as well, because i really miss the optical viewfinder on the om-d series (also briefly tried the e-m5). had hoped that olympus would -----> come !!!  -----> up !!!  -----> with !!!  a downsized slr -----> with !!!  better iq (dynamic range and high iso) and a big prism — a 'true' digital om. will see if i get into the current line one day. fwiw, the venerable d summilux 25mm has arrived and is quite what i expected. chunky, bright, smooth and sharp. will post when i got something worthwhile. alexander edited december 11, 2014 by xalo", "sortedWord": "None", "Identifyer": null, "identifyer": 94804, "year": "2014"}, {"autor": "michaelwj", "date": "2014-11-13 03:31:00", "content": "Its interesting for sure. I took 'moving' to be used very liberally. I'd imagine that they could possibly manipulate the band gap very rapidly they could resolve energy. I'd have thought they would try to come up with something like a SDD in use in X-ray spectroscopy, but for visible light - each photon that arrives gets its energy measured on the fly, no multiple exposures. Interesting times! Michael", "link": "https://www.l-camera-forum.com/topic/236928-sonys-active-pixel-color-sampling-sensor-apcs-will-change-all/?tab=comments#comment-2705520", "origin": "L-forum", "suborigin": "236928-sonys-active-pixel-color-sampling-sensor-apcs-will-change-all", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "its interesting for sure. i took 'moving' to be used very liberally. i'd imagine that they could possibly manipulate the band gap very rapidly they could resolve energy. i'd have thought they would try to -----> come !!!  -----> up !!!  -----> with !!!  something like a sdd in use in x-ray spectroscopy, but for visible light - each photon that arrives gets its energy measured on the fly, no multiple exposures. interesting times! michael", "sortedWord": "None", "Identifyer": null, "identifyer": 94877, "year": "2014"}, {"autor": "sanyasi", "date": "2014-08-21 14:03:00", "content": "You seem to be using the tecniques that was recommended by the dealer of a leaf digital back. They gave me a similar plastic device that the cleaning paper is \"wrapped\" around.. He did say, blow clean first and 90% of the time it will solve the problem? He also advised against cleaning the sensor within an inch of its life. I wouldn't use the plastic device with a leica because the sensor is recessed. It might be attached differently. One thing is for sure: whoever comes up with the truly self-cleaning sensor will make a fortune.", "link": "https://www.l-camera-forum.com/topic/232609-sensor-cleaning/?tab=comments#comment-2653862", "origin": "L-forum", "suborigin": "232609-sensor-cleaning", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "you seem to be using the tecniques that was recommended by the dealer of a leaf digital back. they gave me a similar plastic device that the cleaning paper is \"wrapped\" around.. he did say, blow clean first and 90% of the time it will solve the problem? he also advised against cleaning the sensor within an inch of its life. i wouldn't use the plastic device with a leica because the sensor is recessed. it might be attached differently. one thing is for sure: whoever -----> comes !!!  -----> up !!!  -----> with !!!  the truly self-cleaning sensor will make a fortune.", "sortedWord": "None", "Identifyer": null, "identifyer": 95292, "year": "2014"}, {"autor": "Berth", "date": "2014-08-21 14:39:00", "content": " You seem to be using the tecniques that was recommended by the dealer of a leaf digital back. They gave me a similar plastic device that the cleaning paper is \"wrapped\" around.. He did say, blow clean first and 90% of the time it will solve the problem? He also advised against cleaning the sensor within an inch of its life. I wouldn't use the plastic device with a leica because the sensor is recessed. It might be attached differently. One thing is for sure: whoever comes up with the truly self-cleaning sensor will make a fortune. The sensor on my Canon 5DII never needed a separate cleaning in the 5 years I owned it. The automatic self-cleaning when you turned it off apparently worked. My M-E? Needed a cleaning after 2 months, the first time I did it myself successfully, just a bit of dust. The 2nd time, 2 months later, there was oil and I ended up smearing it so I took it to a professional. $65 lighter, clean again. Yes, I'd pay a bit more for a Leica that had an effective self-cleaning system.", "link": "https://www.l-camera-forum.com/topic/232609-sensor-cleaning/?tab=comments#comment-2653886", "origin": "L-forum", "suborigin": "232609-sensor-cleaning", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": " you seem to be using the tecniques that was recommended by the dealer of a leaf digital back. they gave me a similar plastic device that the cleaning paper is \"wrapped\" around.. he did say, blow clean first and 90% of the time it will solve the problem? he also advised against cleaning the sensor within an inch of its life. i wouldn't use the plastic device with a leica because the sensor is recessed. it might be attached differently. one thing is for sure: whoever -----> comes !!!  -----> up !!!  -----> with !!!  the truly self-cleaning sensor will make a fortune. the sensor on my canon 5dii never needed a separate cleaning in the 5 years i owned it. the automatic self-cleaning when you turned it off apparently worked. my m-e? needed a cleaning after 2 months, the first time i did it myself successfully, just a bit of dust. the 2nd time, 2 months later, there was oil and i ended up smearing it so i took it to a professional. $65 lighter, clean again. yes, i'd pay a bit more for a leica that had an effective self-cleaning system.", "sortedWord": "None", "Identifyer": null, "identifyer": 95295, "year": "2014"}, {"autor": "pico", "date": "2014-07-04 21:17:00", "content": "There is some prior art floating around which might be relevant. Here is a link to the abstract of an article in a published proceedings from 2012, by Carpi, Gabriele and De Rossi:Bioinspired Tunable Lens Driven by Electroactive Polymer Artificial Muscles - Springer Nick Nick, you should work for the Patent Office. Maybe you will come up with The Theory of Everything on the side.", "link": "https://www.l-camera-forum.com/topic/229441-apple-patent-for-af-system/?tab=comments#comment-2624065", "origin": "L-forum", "suborigin": "229441-apple-patent-for-af-system", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "there is some prior art floating around which might be relevant. here is a link to the abstract of an article in a published proceedings from 2012, by carpi, gabriele and de rossi:bioinspired tunable lens driven by electroactive polymer artificial muscles - springer nick nick, you should work for the patent office. maybe you will -----> come !!!  -----> up !!!  -----> with !!!  the theory of everything on the side.", "sortedWord": "None", "Identifyer": null, "identifyer": 95524, "year": "2014"}, {"autor": "marcg", "date": "2014-01-11 17:06:00", "content": ".... purchasing a brand new M 240 and 6 brand new lenses of which 2 have been faulty from the off. Quality control is not what it should be for these prices. ... not to mention all of the glitches and poor support he is going to experience with his M240. With Sony's clout, it really won't be hard for them to capture the entire Leica market - except for those who still prefer real rangefinder manual focus. That would still leave a reasonable market of people who are prepared to pay a premium for a tradition, a niche, a label and a sense of prestige - and of course for a way to keep on using their very excellent lenses. However, I expect that the market will dwindle over the next decade - unless Leica come up with some other way to compete. Still, this is all going off-topic. Might Sony really produce a Monochrom - and would it be of any interest to people here?", "link": "https://www.l-camera-forum.com/topic/219932-sony-monochrom/?tab=comments#comment-2507023", "origin": "L-forum", "suborigin": "219932-sony-monochrom", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": ".... purchasing a brand new m 240 and 6 brand new lenses of which 2 have been faulty from the off. quality control is not what it should be for these prices. ... not to mention all of the glitches and poor support he is going to experience with his m240. with sony's clout, it really won't be hard for them to capture the entire leica market - except for those who still prefer real rangefinder manual focus. that would still leave a reasonable market of people who are prepared to pay a premium for a tradition, a niche, a label and a sense of prestige - and of course for a way to keep on using their very excellent lenses. however, i expect that the market will dwindle over the next decade - unless leica -----> come !!!  -----> up !!!  -----> with !!!  some other way to compete. still, this is all going off-topic. might sony really produce a monochrom - and would it be of any interest to people here?", "sortedWord": "None", "Identifyer": null, "identifyer": 96078, "year": "2014"}, {"autor": "AlanG", "date": "2014-04-15 22:59:00", "content": "REI had to limit its famous 100% Satisfaction Unlimited Time return policy because so many customers were abusing it. I saw this first hand at their attic sales where they sell the returned goods at very low prices. There was a pair of Shimano bike pedals that were heavily used. The note on the package was simply, \"Customer didn't like them anymore.\" Well worn clothes and hiking boots are returned for no \"longer being waterproof,\" or whatever reasons they come up with. REI now limiting returns to one year | Business & Technology | The Seattle Times", "link": "https://www.l-camera-forum.com/topic/225125-is-the-camera-industry-in-recession/page/2/?tab=comments#comment-2569169", "origin": "L-forum", "suborigin": "225125-is-the-camera-industry-in-recession", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "rei had to limit its famous 100% satisfaction unlimited time return policy because so many customers were abusing it. i saw this first hand at their attic sales where they sell the returned goods at very low prices. there was a pair of shimano bike pedals that were heavily used. the note on the package was simply, \"customer didn't like them anymore.\" well worn clothes and hiking boots are returned for no \"longer being waterproof,\" or whatever reasons they -----> come !!!  -----> up !!!  -----> with !!! . rei now limiting returns to one year | business & technology | the seattle times", "sortedWord": "None", "Identifyer": null, "identifyer": 96154, "year": "2014"}, {"autor": "mjh", "date": "2014-01-30 23:19:00", "content": "I doubt Leica proceeded with the Mononchrom because forum members convinced them of its profitability; rather, the company did that on its own, despite many naysayers here. I suppose you are right. Monitoring forum activity cannot and should not replace serious market research. While it can give you some ideas it is pretty much useless when deliberating whether to actually pursue those ideas. Moreover, the concept of a monochrome M originated in Solms, rather than here in this forum. Here the idea of a monochrome M was tossed about time and again over all those years but the naysayers always appeared to be the majority. On the other hand I am sure that the ‘digital M6’ concept is something Leica will not come up with on their own. Edited January 30, 2014 by mjh", "link": "https://www.l-camera-forum.com/topic/221045-a-digital-m6/page/8/?tab=comments#comment-2522286", "origin": "L-forum", "suborigin": "221045-a-digital-m6", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i doubt leica proceeded with the mononchrom because forum members convinced them of its profitability; rather, the company did that on its own, despite many naysayers here. i suppose you are right. monitoring forum activity cannot and should not replace serious market research. while it can give you some ideas it is pretty much useless when deliberating whether to actually pursue those ideas. moreover, the concept of a monochrome m originated in solms, rather than here in this forum. here the idea of a monochrome m was tossed about time and again over all those years but the naysayers always appeared to be the majority. on the other hand i am sure that the ‘digital m6’ concept is something leica will not -----> come !!!  -----> up !!!  -----> with !!!  on their own. edited january 30, 2014 by mjh", "sortedWord": "None", "Identifyer": null, "identifyer": 96526, "year": "2014"}, {"autor": "swamiji", "date": "2014-01-31 05:42:00", "content": "I am sure that the ‘digital M6’ concept is something Leica will not come up with on their own. As a Monochrom owner, I would not be so bold with such statements. Various rumors have been coming out of Leica about a smaller interchangeable lens camera, and Leica has said it will not come out with another lens series... So nothing is impossible.", "link": "https://www.l-camera-forum.com/topic/221045-a-digital-m6/page/8/?tab=comments#comment-2522404", "origin": "L-forum", "suborigin": "221045-a-digital-m6", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i am sure that the ‘digital m6’ concept is something leica will not -----> come !!!  -----> up !!!  -----> with !!!  on their own. as a monochrom owner, i would not be so bold with such statements. various rumors have been coming out of leica about a smaller interchangeable lens camera, and leica has said it will not come out with another lens series... so nothing is impossible.", "sortedWord": "None", "Identifyer": null, "identifyer": 96527, "year": "2014"}, {"autor": "stevelap", "date": "2014-01-31 08:48:00", "content": ".......I am sure that the ‘digital M6’ concept is something Leica will not come up with on their own. As a Monochrom owner, I would not be so bold with such statements. Various rumors have been coming out of Leica about a smaller interchangeable lens camera, and Leica has said it will not come out with another lens series... So nothing is impossible. I think you'll find that Michael is (much) more informed than you or I about that 'smaller interchangeable lens camera'.........--img-- ", "link": "https://www.l-camera-forum.com/topic/221045-a-digital-m6/page/9/?tab=comments#comment-2522472", "origin": "L-forum", "suborigin": "221045-a-digital-m6", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": ".......i am sure that the ‘digital m6’ concept is something leica will not -----> come !!!  -----> up !!!  -----> with !!!  on their own. as a monochrom owner, i would not be so bold with such statements. various rumors have been coming out of leica about a smaller interchangeable lens camera, and leica has said it will not come out with another lens series... so nothing is impossible. i think you'll find that michael is (much) more informed than you or i about that 'smaller interchangeable lens camera'.........--img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 96530, "year": "2014"}, {"autor": "wlaidlaw", "date": "2014-01-06 13:22:00", "content": " Now when I go on a trip, I don’t take a laptop any longer but just an iPad. For long trips, where I am taking a lot of photos, my 64GB iPad is a bit limited on storage, as with the other stuff on it, there is usually only about 20GB free for images. Lacie have come up with a very neat solution in a 1TB wireless storage device, that can be accessed by up to 5 iOS devices LaCie is the premier manufacturer of high quality digital storage.. I was thinking of getting a new Mac Book Air for travel use, when these come out with a Retina screen. However with this storage device, I might wait instead and get a 12” iPad, when they are released (probably Sept 2014). For those occasions you want a proper keyboard, you can use a cover with a built in Blue Tooth one, as made by Logitech and others but at other times, you don’t need to carry the keyboard around with you. My wife uses an iPad with keyboard for 90% of her business now other than letters and invoices. Wilson", "link": "https://www.l-camera-forum.com/topic/219673-lacie-compact-wireless-storage-for-ipad/?tab=comments#comment-2502761", "origin": "L-forum", "suborigin": "219673-lacie-compact-wireless-storage-for-ipad", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " now when i go on a trip, i don’t take a laptop any longer but just an ipad. for long trips, where i am taking a lot of photos, my 64gb ipad is a bit limited on storage, as with the other stuff on it, there is usually only about 20gb free for images. lacie have -----> come !!!  -----> up !!!  -----> with !!!  a very neat solution in a 1tb wireless storage device, that can be accessed by -----> up !!!  to 5 ios devices lacie is the premier manufacturer of high quality digital storage.. i was thinking of getting a new mac book air for travel use, when these come out with a retina screen. however with this storage device, i might wait instead and get a 12” ipad, when they are released (probably sept 2014). for those occasions you want a proper keyboard, you can use a cover with a built in blue tooth one, as made by logitech and others but at other times, you don’t need to carry the keyboard around with you. my wife uses an ipad with keyboard for 90% of her business now other than letters and invoices. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 96858, "year": "2014"}, {"autor": "tobey bilek", "date": "2014-12-06 18:34:00", "content": "Being crabby by nature, I turn off any website that irritates me. Television commercials are 99% muted. The advertisers come up with one irritating feature after another over the decades, extra loud ( now illegal, but they just modulate bumping the high limit now), flashing flashing images, stuff spinning around, and the latest is loud \"background music\". The same background music is creeping into regular programing to the point where the actors can not be understood. Nothing wrong with my hearing or sight either. So I take note of those shows and never return. It is like vote with remote. If you flash me or play a movie clip I did not opt for, or get into music over voice, it is just good by inside of 2 sec.. I warned you I was crabby.", "link": "https://www.l-camera-forum.com/topic/223642-flashing-and-rolling-gif-avatars/?tab=comments#comment-2722356", "origin": "L-forum", "suborigin": "223642-flashing-and-rolling-gif-avatars", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "being crabby by nature, i turn off any website that irritates me. television commercials are 99% muted. the advertisers -----> come !!!  -----> up !!!  -----> with !!!  one irritating feature after another over the decades, extra loud ( now illegal, but they just modulate bumping the high limit now), flashing flashing images, stuff spinning around, and the latest is loud \"background music\". the same background music is creeping into regular programing to the point where the actors can not be understood. nothing wrong with my hearing or sight either. so i take note of those shows and never return. it is like vote with remote. if you flash me or play a movie clip i did not opt for, or get into music over voice, it is just good by inside of 2 sec.. i warned you i was crabby.", "sortedWord": "None", "Identifyer": null, "identifyer": 119783, "year": "2014"}, {"autor": "DigitalHeMan", "date": "2014-12-28 20:02:00", "content": "Dan and myself have been discussing potential schedules for the Asia LeicaOne trip and have come up with the following preliminary plan. With the exception of the stuff that needs a bit of organising (like a train trip between Tokyo and Kyoto) we are flexible on the other plans, and also open to suggestions: Our intention is to run the ‘Challenge’ on May 23rd 2015 in Kyoto (location to be decided, but possibly starting near the train station). As such a trip would be more than just a weekend trip for most people, our thought was to organise some informal events in the preceding week as well. We thought that it would be practical to fly into Tokyo and out of Kyoto (or other airport - as most airlines will allow you to purchase \"open jaw\" tickets at a comparible price with a different arrival and departure airport). This plan allows us to acclimatise to Japan in Tokyo, take in some sights/experiences there and then move onto Kyoto later in the week. Kyoto has been suggested by a number of interested members as a prefered challenge location. Here's roughly what we are considering: Sunday 17th May: Yoyogi Park & Harajuku Monday 18th May: Tokyo Temples Tuesday 19th May: Shinjuku/Ginza camera shopping --img--  Visit to Leica Gallery Wednesday 20th May: Fish market (morning) Thursday 21st May: Train to Kyoto (a 2.5 hour journey, depending on the train chosen) Friday 22nd May: Kyoto Temples (oh, and maybe this too Leica Store Kyoto on Vimeo) Saturday 23rd May: First Leica Asia Challenge (afternoon) I will most likely arrive in Japan earlier than the 17th to visit relatives and Dan is planning to either arrive earlier or depart later. Just to make clear that all we are doing is making suggestions. We are not a travel agency, and are not arranging hotels or taking any money --img--  Dan, Ritsuko (Dan’s wife), Kyoko (my partner), Tabatha (my daughter) and myself will definitely be there, and will be happy for people to join us when we make these trips and to help you out whilst you are there with our local knowledge of Tokyo and the Japanese culture. How does this sound to everyone who is thinking about coming? We are open to suggestions and happy to hear your comments. We will be buying our tickets soon around these dates.", "link": "https://www.l-camera-forum.com/topic/222897-asia-one-challenge-2015/page/2/?tab=comments#comment-2736792", "origin": "L-forum", "suborigin": "222897-asia-one-challenge-2015", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "dan and myself have been discussing potential schedules for the asia leicaone trip and have -----> come !!!  -----> up !!!  -----> with !!!  the following preliminary plan. with the exception of the stuff that needs a bit of organising (like a train trip between tokyo and kyoto) we are flexible on the other plans, and also open to suggestions: our intention is to run the ‘challenge’ on may 23rd 2015 in kyoto (location to be decided, but possibly starting near the train station). as such a trip would be more than just a weekend trip for most people, our thought was to organise some informal events in the preceding week as well. we thought that it would be practical to fly into tokyo and out of kyoto (or other airport - as most airlines will allow you to purchase \"open jaw\" tickets at a comparible price with a different arrival and departure airport). this plan allows us to acclimatise to japan in tokyo, take in some sights/experiences there and then move onto kyoto later in the week. kyoto has been suggested by a number of interested members as a prefered challenge location. here's roughly what we are considering: sunday 17th may: yoyogi park & harajuku monday 18th may: tokyo temples tuesday 19th may: shinjuku/ginza camera shopping --img--  visit to leica gallery wednesday 20th may: fish market (morning) thursday 21st may: train to kyoto (a 2.5 hour journey, depending on the train chosen) friday 22nd may: kyoto temples (oh, and maybe this too leica store kyoto on vimeo) saturday 23rd may: first leica asia challenge (afternoon) i will most likely arrive in japan earlier than the 17th to visit relatives and dan is planning to either arrive earlier or depart later. just to make clear that all we are doing is making suggestions. we are not a travel agency, and are not arranging hotels or taking any money --img--  dan, ritsuko (dan’s wife), kyoko (my partner), tabatha (my daughter) and myself will definitely be there, and will be happy for people to join us when we make these trips and to help you out whilst you are there with our local knowledge of tokyo and the japanese culture. how does this sound to everyone who is thinking about coming? we are open to suggestions and happy to hear your comments. we will be buying our tickets soon around these dates.", "sortedWord": "None", "Identifyer": null, "identifyer": 133987, "year": "2014"}, {"autor": "Dan Bachmann", "date": "2014-11-02 20:38:00", "content": "On the Road... (Hyde Park) Leica M9, CV 75mm LTM & 50mm Summilux Pre-ASPH --img-- --img-- --------- the breakdowns (Brixton) Leica M9, 50mm Summilux Pre-ASPH --img-- --img-- ---------- I'm very keen to see what the others have come up with during the start when I was with you and beyond.", "link": "https://www.l-camera-forum.com/topic/235664-rac-london-to-brighton-car-rally-sunday-2nd-november/?tab=comments#comment-2699563", "origin": "L-forum", "suborigin": "235664-rac-london-to-brighton-car-rally-sunday-2nd-november", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on the road... (hyde park) leica m9, cv 75mm ltm & 50mm summilux pre-asph --img-- --img-- --------- the breakdowns (brixton) leica m9, 50mm summilux pre-asph --img-- --img-- ---------- i'm very keen to see what the others have -----> come !!!  -----> up !!!  -----> with !!!  during the start when i was -----> with !!!  you and beyond.", "sortedWord": "None", "Identifyer": null, "identifyer": 134811, "year": "2014"}, {"autor": "jcraf", "date": "2014-11-03 07:45:00", "content": "I'm very keen to see what the others have come up with during the start when I was with you and beyond. Lovely stuff there Dan. It was good to catch up again. A big thanks to Elaine and Ivor for toting us around. Sadly the weather deteriorated significantly en route to Brighton but a good few shots were taken. Watch this space..... Regards", "link": "https://www.l-camera-forum.com/topic/235664-rac-london-to-brighton-car-rally-sunday-2nd-november/?tab=comments#comment-2699774", "origin": "L-forum", "suborigin": "235664-rac-london-to-brighton-car-rally-sunday-2nd-november", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i'm very keen to see what the others have -----> come !!!  -----> up !!!  -----> with !!!  during the start when i was -----> with !!!  you and beyond. lovely stuff there dan. it was good to catch up again. a big thanks to elaine and ivor for toting us around. sadly the weather deteriorated significantly en route to brighton but a good few shots were taken. watch this space..... regards", "sortedWord": "None", "Identifyer": null, "identifyer": 134813, "year": "2014"}, {"autor": "Gibbo", "date": "2014-02-10 16:01:00", "content": " Lynn and I dodged the showers on Saturday morning in Bath and have come up with a plan. The Tasting Room is ideal as a meeting point / lunch venue and situated directly opposite Ace Cameras. I suggest we meet at The Tasting Room at 11:30 am on Saturday 19th April 2014. The address is 6 Green Street, Bath, BA1 2JY and their website is TASTING ROOM - wine / café / bar / brasserie serving modern Mediterranean style dishes. They will be more than happy to accomodate us and reserve a table for us. As we shall be there on a Saturday, they would like to have a good idea of numbers. Please could you let me know as soon as possible if you intend to join us. I shall book the table one month before the meet so let me know by the 18th March please! Ace Cameras would also like to welcome us to their establishment and, also dependant on numbers, said they would contact Leica and see if they too would be interested in laying something on for us. I reckon we should make the most of their hospitality --img--  I asked if they could lay on an S for each of us. Did they laugh or what --img--  The location of these is ideally situated for moving on to the central sites in Bath. Pultney Bridge, The Abbey, The Roman Baths, Queen Square, Bath Rugby Ground, The Circle and the main shops are all within easy walking distance. Bath Spa railway Station is, according to Google Maps, 0.6 miles from Ace Cameras and a very straightforward route. I think we might park in Waitrose's car park, which is just round the corner from Ace Cameras. There is also a much larger car park in Charlotte Street, approx 1/2 mile walk to the dealer. All being well, this chap typifies the sort of welcome we can expect on the day. His only worry was that I might be from the Social, checking up on him --img--  --img--  Ok then, that is the plan and Lynn and I look forward to meeting up with all of you on the day for what promises to be a fun day out!! Please remember to get in touch and let me know if you intend to be there as soon as possible. Many thanks, David --img-- ", "link": "https://www.l-camera-forum.com/topic/217319-spring-into-bath-april-19th-easter-saturday/page/3/?tab=comments#comment-2529609", "origin": "L-forum", "suborigin": "217319-spring-into-bath-april-19th-easter-saturday", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " lynn and i dodged the showers on saturday morning in bath and have -----> come !!!  -----> up !!!  -----> with !!!  a plan. the tasting room is ideal as a meeting point / lunch venue and situated directly opposite ace cameras. i suggest we meet at the tasting room at 11:30 am on saturday 19th april 2014. the address is 6 green street, bath, ba1 2jy and their website is tasting room - wine / café / bar / brasserie serving modern mediterranean style dishes. they will be more than happy to accomodate us and reserve a table for us. as we shall be there on a saturday, they would like to have a good idea of numbers. please could you let me know as soon as possible if you intend to join us. i shall book the table one month before the meet so let me know by the 18th march please! ace cameras would also like to welcome us to their establishment and, also dependant on numbers, said they would contact leica and see if they too would be interested in laying something on for us. i reckon we should make the most of their hospitality --img--  i asked if they could lay on an s for each of us. did they laugh or what --img--  the location of these is ideally situated for moving on to the central sites in bath. pultney bridge, the abbey, the roman baths, queen square, bath rugby ground, the circle and the main shops are all within easy walking distance. bath spa railway station is, according to google maps, 0.6 miles from ace cameras and a very straightforward route. i think we might park in waitrose's car park, which is just round the corner from ace cameras. there is also a much larger car park in charlotte street, approx 1/2 mile walk to the dealer. all being well, this chap typifies the sort of welcome we can expect on the day. his only worry was that i might be from the social, checking up on him --img--  --img--  ok then, that is the plan and lynn and i look forward to meeting up with all of you on the day for what promises to be a fun day out!! please remember to get in touch and let me know if you intend to be there as soon as possible. many thanks, david --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 135119, "year": "2014"}], "name": "Leicasortedout2014with"}