{"interestingcomments": [{"autor": "LeicaS2", "date": "2020-06-06 21:46:00", "content": " In a separate thread I showed how I jammed an M10 and two spare lenses in an old GaraGear pouch. I thought someone would come up with a better minimalist solution and Bellingham was of course mentioned. But they thought the pouches were too small. That would be true if my lens kit had bigger diameters. Turns out for times when I don't just want the camera in my hand or over a shoulder and the two spare lenses in my pocket, Bellingham pouches work well. The Billingham Avea pouches 3 and 5 give me very good flexibility. As others have noted, the belt straps are made more for hanging on your larger Billingham bag, They are adequate on my belt. Some have said they are too small so I have superimposed the images of camera and lenses onto the bags.I should add that I prefer using the lens coupler not just for compactness, but to avoid the lower lens getting lost down the Avea 3 pouch. A spare battery fits in the Avea 5 very easily, but is not shown. I rarely bring lens hoods, which would be an issue. --img-- ", "link": "https://www.l-camera-forum.com/topic/307354-camera-bag-again-and-again/page/4/?tab=comments#comment-3988731", "origin": "L-forum", "suborigin": "307354-camera-bag-again-and-again", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " in a separate thread i showed how i jammed an m10 and two spare lenses in an old garagear pouch. i thought someone would -----> come !!!  -----> up !!!  -----> with !!!  a better minimalist solution and bellingham was of course mentioned. but they thought the pouches were too small. that would be true if my lens kit had bigger diameters. turns out for times when i don't just want the camera in my hand or over a shoulder and the two spare lenses in my pocket, bellingham pouches work well. the billingham avea pouches 3 and 5 give me very good flexibility. as others have noted, the belt straps are made more for hanging on your larger billingham bag, they are adequate on my belt. some have said they are too small so i have superimposed the images of camera and lenses onto the bags.i should add that i prefer using the lens coupler not just for compactness, but to avoid the lower lens getting lost down the avea 3 pouch. a spare battery fits in the avea 5 very easily, but is not shown. i rarely bring lens hoods, which would be an issue. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 3021, "year": "2020"}, {"autor": "250swb", "date": "2020-10-13 09:14:00", "content": "13 hours ago, Kwesi said: I agree with your last paragraph regarding. a trend towards photos that generally have no true white or true black in them as a way of proving technical competence. This often leads to very tonally bland photographs. I blame Fuji (😀) for starting this trend with their DR100-DR400 settings with the result that a lot of Fuji images are flat. It's been something creeping in gradually. With the M9 and M9M people had to make choices about exposure and post processing and they came away delighted with themselves and their images. They only seem delighted now if they don't have to do anything. Well actually they don't have to do anything, generally speaking there is nothing like blown highlights like before, there is nothing worrying like the lack of light like before. But judgement has taken a back seat and there's the absurd situation of a camera that can deliver far more only being used to half it's capacity. In particular the M10M if going on the photos uploaded it's (again generally speaking) the equivalent of driving a Range Rover around Chelsea. I guess seeing what Adobe comes up with by pressing 'Auto contrast' is as radical an idea as raising the suspension and going to find a muddy field.", "link": "https://www.l-camera-forum.com/topic/312525-this-is-why-i-bought-an-m10r/page/11/?tab=comments#comment-4062009", "origin": "L-forum", "suborigin": "312525-this-is-why-i-bought-an-m10r", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "13 hours ago, kwesi said: i agree with your last paragraph regarding. a trend towards photos that generally have no true white or true black in them as a way of proving technical competence. this often leads to very tonally bland photographs. i blame fuji (😀) for starting this trend with their dr100-dr400 settings with the result that a lot of fuji images are flat. it's been something creeping in gradually. with the m9 and m9m people had to make choices about exposure and post processing and they came away delighted with themselves and their images. they only seem delighted now if they don't have to do anything. well actually they don't have to do anything, generally speaking there is nothing like blown highlights like before, there is nothing worrying like the lack of light like before. but judgement has taken a back seat and there's the absurd situation of a camera that can deliver far more only being used to half it's capacity. in particular the m10m if going on the photos uploaded it's (again generally speaking) the equivalent of driving a range rover around chelsea. i guess seeing what adobe -----> comes !!!  -----> up !!!  -----> with !!!  by pressing 'auto contrast' is as radical an idea as raising the suspension and going to find a muddy field.", "sortedWord": "None", "Identifyer": null, "identifyer": 5343, "year": "2020"}, {"autor": "Tom1234", "date": "2020-11-01 02:40:00", "content": "3 hours ago, Al_OOF said: [SUBJECT: DYNAMIC RANGE ADJUSTMENT - AND OTHER ADJUSTMENTS (this heading is added not part of original quote)] When I worked with slides, going from 35mm to 6x6 or even more to 10x12 or 13x18, what was most noticeable was a greater softness caused by a more gradual tonal transition. This seems to me to notice this even now in the digital photos taken with sensors with more mega. The problem, which also existed with the slides when they had to be printed, is that we have a long bar which must then end up in a small box, so the bar has to be compressed or cut. This comes from from a dynamic range greater than its destination. The real scene has a very wide range, the sensor that collects it much smaller, the monitor a little more and finally the print the smaller. This also seems to me the reason why the 10R files look flatter as soon as they come out and need to be “compressed” more to get a good contrast. What I ask myself is whether, thinking mainly of the \"box\" inside which the image must end, a certain amount of megapixels is more harmonious and suitable for entering more easily. What do you think ? (This reasoning only on aesthetics and not on the other advantages with more mega) BASIC FILE QUALITY OR DIGITAL ADJUSTMENTS AS CAMEA PURCHASE GUIDES Methinks… that it is a valid approach, and the one I have taken with my first three digital cameras, M8.2, M9, M9M… that I buy the body for the character of the sensor-&-color-science-&-rendition and thus for the quality of the file it puts out. With a film camera you pick the body. With digital camera you pick the sensor-&-color-science-&-overall-rendition. After that... I think that built into the digital concept is the idea that a digital file can always be modified infinitely and thus taken from ANY one state to ANY other state. But in practice it has turned out quite differently. The bundle of dots are so damn complex that once set in place moving them through more-or-less fixed routines can create something new but not necessary anything you want to look at. Simple adjustments can of course be made but finally one must admit that starting at A and going to B to C is possible but going to D, E, F, etc. may not be possible or result in anything wants to display. In my experience adding a lot of major changes to the file makes it look like a cartoon. Way back in college (school) I took an electronic music course that told us that by combining multiple sine waves ANY sound could be produced, they called this sound producing equipment a \"synthesizer\". Well if you went through that era of music of the 1960's and 70' you know that, mostly electronic sounds were just a few weird sounds, they only had a few special places in music… this \"do anything\" technology just resulted in mostly output meant for the trash heap. As good as post production software is, the original file is still the basis for the excellence eventually achieved. As effects are added on, the picture begins to be more synthetic looking, and this adjusted-synthetic-realism aesthetic is the new approach in camera created art. I will be picking bodies for their original file making abilities and not expecting to fix-it-in-post. I will pick the body like I would pick film, for the basic beauty of its file presentation. I will not trick myself into thinking that all can be fixed, changed, solved, or made more perfect in post production software. Due to user comments and internet pictures, it is evident that the Leica M10 is a landmark camera worth buying and saving as part of the history of digital cameras for the rendition of its sensor-color-science module that maintains a sort of perfect balance between realistic-detail and an atmospheric-lack-of-detail also known as \"art\". The Leica M10-R is a proof that going up in resolution creates a new ultra-detail look that is an aesthetic all its own, in some cases called by painters \"still life\" (see my other post). I hope to own both bodies someday… the M10 for atmospheric artsy look and the M10-R for the super realistic still life's that I also love. These are opposite aesthetics. I wish they could be both pulled from one camera through a menu option and probably they will be someday. Could the M10-R get a firmware update to add the old M10 aesthetic to it? If so it would help justify its tremendous cost. Someone may have achieved these through post production efforts, but if so, I do not have their weblink! Erwin Putts commented the same about a certain 90mm aspherical lens making the picture so sharp that the skin in portraits was too intimate and lacked the beauty created by lessor resolving lenses. This is the downside of high resolution which I hope can be fixed in post. You either like this super detail or you don't. It is a bit polarizing. If you paid $8k USD for the body then you say you like it, if you haven't bought the camera yet then you can have any opinion you want. Me I want both. The next iteration of high resolution camera will probably be even better for the still life super detail aesthetic so I will wait and see what Leica comes up with. Steve has shown that raising pixel count on a file gives clearer focus but of course no new detail so a truly higher resolution sensor is needed to raise the bar. Good day!", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/14/?tab=comments#comment-4071769", "origin": "L-forum", "suborigin": "314500-24meg-verses-40meg-aesthetic", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "3 hours ago, al_oof said: [subject: dynamic range adjustment - and other adjustments (this heading is added not part of original quote)] when i worked with slides, going from 35mm to 6x6 or even more to 10x12 or 13x18, what was most noticeable was a greater softness caused by a more gradual tonal transition. this seems to me to notice this even now in the digital photos taken with sensors with more mega. the problem, which also existed with the slides when they had to be printed, is that we have a long bar which must then end up in a small box, so the bar has to be compressed or cut. this comes from from a dynamic range greater than its destination. the real scene has a very wide range, the sensor that collects it much smaller, the monitor a little more and finally the print the smaller. this also seems to me the reason why the 10r files look flatter as soon as they come out and need to be “compressed” more to get a good contrast. what i ask myself is whether, thinking mainly of the \"box\" inside which the image must end, a certain amount of megapixels is more harmonious and suitable for entering more easily. what do you think ? (this reasoning only on aesthetics and not on the other advantages with more mega) basic file quality or digital adjustments as camea purchase guides methinks… that it is a valid approach, and the one i have taken with my first three digital cameras, m8.2, m9, m9m… that i buy the body for the character of the sensor-&-color-science-&-rendition and thus for the quality of the file it puts out. with a film camera you pick the body. with digital camera you pick the sensor-&-color-science-&-overall-rendition. after that... i think that built into the digital concept is the idea that a digital file can always be modified infinitely and thus taken from any one state to any other state. but in practice it has turned out quite differently. the bundle of dots are so damn complex that once set in place moving them through more-or-less fixed routines can create something new but not necessary anything you want to look at. simple adjustments can of course be made but finally one must admit that starting at a and going to b to c is possible but going to d, e, f, etc. may not be possible or result in anything wants to display. in my experience adding a lot of major changes to the file makes it look like a cartoon. way back in college (school) i took an electronic music course that told us that by combining multiple sine waves any sound could be produced, they called this sound producing equipment a \"synthesizer\". well if you went through that era of music of the 1960's and 70' you know that, mostly electronic sounds were just a few weird sounds, they only had a few special places in music… this \"do anything\" technology just resulted in mostly output meant for the trash heap. as good as post production software is, the original file is still the basis for the excellence eventually achieved. as effects are added on, the picture begins to be more synthetic looking, and this adjusted-synthetic-realism aesthetic is the new approach in camera created art. i will be picking bodies for their original file making abilities and not expecting to fix-it-in-post. i will pick the body like i would pick film, for the basic beauty of its file presentation. i will not trick myself into thinking that all can be fixed, changed, solved, or made more perfect in post production software. due to user comments and internet pictures, it is evident that the leica m10 is a landmark camera worth buying and saving as part of the history of digital cameras for the rendition of its sensor-color-science module that maintains a sort of perfect balance between realistic-detail and an atmospheric-lack-of-detail also known as \"art\". the leica m10-r is a proof that going up in resolution creates a new ultra-detail look that is an aesthetic all its own, in some cases called by painters \"still life\" (see my other post). i hope to own both bodies someday… the m10 for atmospheric artsy look and the m10-r for the super realistic still life's that i also love. these are opposite aesthetics. i wish they could be both pulled from one camera through a menu option and probably they will be someday. could the m10-r get a firmware update to add the old m10 aesthetic to it? if so it would help justify its tremendous cost. someone may have achieved these through post production efforts, but if so, i do not have their weblink! erwin putts commented the same about a certain 90mm aspherical lens making the picture so sharp that the skin in portraits was too intimate and lacked the beauty created by lessor resolving lenses. this is the downside of high resolution which i hope can be fixed in post. you either like this super detail or you don't. it is a bit polarizing. if you paid $8k usd for the body then you say you like it, if you haven't bought the camera yet then you can have any opinion you want. me i want both. the next iteration of high resolution camera will probably be even better for the still life super detail aesthetic so i will wait and see what leica -----> comes !!!  -----> up !!!  -----> with !!! . steve has shown that raising pixel count on a file gives clearer focus but of course no new detail so a truly higher resolution sensor is needed to raise the bar. good day!", "sortedWord": "None", "Identifyer": null, "identifyer": 9156, "year": "2020"}, {"autor": "Luke_Miller", "date": "2020-10-29 13:15:00", "content": "19 hours ago, analog-digital said: I don't know what you're talking about. EVERY camera, since the beginning of the digital, can delete individual photos in the camera. EVERY. Except Leica? If that were the case, it would simply be SCRAP As I mentioned, best practice has nothing to do with camera or card brand. So I apply it to every camera I use. My Lightroom catalog contains 120,000 images taken since 2002. Many of those images were taken with my M8.2, M9, MM, M240, and M246. During that interval I have not experienced a card failure or camera freeze. Maybe I have just been lucky, but I think I will keep doing what I do. No camera should freeze, but if there are things the user can do to potentially minimize the issue while the manufacturer comes up with a solution it would seem prudent to do them.", "link": "https://www.l-camera-forum.com/topic/311710-when-is-leica-stopping-the-m10-monochrom-freezing/page/3/?tab=comments#comment-4070324", "origin": "L-forum", "suborigin": "311710-when-is-leica-stopping-the-m10-monochrom-freezing", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "19 hours ago, analog-digital said: i don't know what you're talking about. every camera, since the beginning of the digital, can delete individual photos in the camera. every. except leica? if that were the case, it would simply be scrap as i mentioned, best practice has nothing to do with camera or card brand. so i apply it to every camera i use. my lightroom catalog contains 120,000 images taken since 2002. many of those images were taken with my m8.2, m9, mm, m240, and m246. during that interval i have not experienced a card failure or camera freeze. maybe i have just been lucky, but i think i will keep doing what i do. no camera should freeze, but if there are things the user can do to potentially minimize the issue while the manufacturer -----> comes !!!  -----> up !!!  -----> with !!!  a solution it would seem prudent to do them.", "sortedWord": "None", "Identifyer": null, "identifyer": 22686, "year": "2020"}, {"autor": "Cayenne", "date": "2020-10-16 20:21:00", "content": "2 hours ago, LeicaS2 said: The $20 card is a good suggestion. Faster cards I guess are for video? Video is not an issue with the M10M. David Farkas never re-uses cards. He keeps them as we used to keep negatives, as the ultimate back up. Maybe at $20 I should do that. The freeze issue is not an issue for me. In the first week, I had it freeze once. Popped out the battery and continued. It has not reoccurred and I would not have given it another thought if I hadn’t seen it on the forum. Downloading and reading the manual ahead of time is a good use of your waiting time, except by now isn’t the camera is in your hand? Using a rangefinder takes about a week of practice to get muscle memory. I had not used one since 2011. I also dropped the baseplate regularly. I now always change the card with the camera over a table. I found turning off the instant review helpful if I was shooting rapidly. If I need to see the photo, I just press play.. incidentally, I just keep a yellow filter on all the time and never use a lens cap or lens hood. But that’s because a lens cap just slows me down, and lens coating today make lens hoods superfluous in my mind. Regarding processing, it’s whatever interface you are comfortable with. I use LR and Photoshop plus SilverEfxPro. The subscription doesn’t bother me in absolute cost versus the cost of the camera. Download a trial of SilverEfxPro and have fun seeing how it can render boring clouds into fantastic clouds. See attached: Finally, choose one of your images to get printed huge. By huge, I mean 20”x30” or 30”x45” . Such prints are no longer that expensive and since you have chosen a throwback camera device and a throwback choice of B&W, why not a throwback display: a print? Jack --img--  Wow..thank you for the reply and all that info!! I do intend to start printing MORE. I think I heard someone say there are millions of images shot every day that are doomed to never see the light of day again....what a waste. I\"m just hoping to get better and come up with wall worthy images to print large and FRAME. I may run out of wall space, but hoping I can find homes for some of them when that happens. My camera arrived just a bit ago, I've attached the camera strap, lens (I started with a Voightlander 35mm f/2 Ultron to start with. I am about to attach the yellow filter to it. Right now, I'm awaiting the battery to fully charge!!! And...am about to start reading the manual. A quick extra question please: Is there any way to figure the \"born on date\" of when the camera body was made via the serial number? It appears the SN# is the one engraved on the top on the hot shoe, right? I've been googling and can't find how to get the manufacture date. One link pointed me to a French site, I can't read French...but tried entering this number with the various permutations of the choices and got nothing useful out of it. Thank you all again for such wonderful input!! C", "link": "https://www.l-camera-forum.com/topic/314229-my-first-leica-m10m-some-questions/?tab=comments#comment-4063868", "origin": "L-forum", "suborigin": "314229-my-first-leica-m10m-some-questions", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "2 hours ago, leicas2 said: the $20 card is a good suggestion. faster cards i guess are for video? video is not an issue with the m10m. david farkas never re-uses cards. he keeps them as we used to keep negatives, as the ultimate back up. maybe at $20 i should do that. the freeze issue is not an issue for me. in the first week, i had it freeze once. popped out the battery and continued. it has not reoccurred and i would not have given it another thought if i hadn’t seen it on the forum. downloading and reading the manual ahead of time is a good use of your waiting time, except by now isn’t the camera is in your hand? using a rangefinder takes about a week of practice to get muscle memory. i had not used one since 2011. i also dropped the baseplate regularly. i now always change the card with the camera over a table. i found turning off the instant review helpful if i was shooting rapidly. if i need to see the photo, i just press play.. incidentally, i just keep a yellow filter on all the time and never use a lens cap or lens hood. but that’s because a lens cap just slows me down, and lens coating today make lens hoods superfluous in my mind. regarding processing, it’s whatever interface you are comfortable with. i use lr and photoshop plus silverefxpro. the subscription doesn’t bother me in absolute cost versus the cost of the camera. download a trial of silverefxpro and have fun seeing how it can render boring clouds into fantastic clouds. see attached: finally, choose one of your images to get printed huge. by huge, i mean 20”x30” or 30”x45” . such prints are no longer that expensive and since you have chosen a throwback camera device and a throwback choice of b&w, why not a throwback display: a print? jack --img--  wow..thank you for the reply and all that info!! i do intend to start printing more. i think i heard someone say there are millions of images shot every day that are doomed to never see the light of day again....what a waste. i\"m just hoping to get better and -----> come !!!  -----> up !!!  -----> with !!!  wall worthy images to print large and frame. i may run out of wall space, but hoping i can find homes for some of them when that happens. my camera arrived just a bit ago, i've attached the camera strap, lens (i started with a voightlander 35mm f/2 ultron to start with. i am about to attach the yellow filter to it. right now, i'm awaiting the battery to fully charge!!! and...am about to start reading the manual. a quick extra question please: is there any way to figure the \"born on date\" of when the camera body was made via the serial number? it appears the sn# is the one engraved on the top on the hot shoe, right? i've been googling and can't find how to get the manufacture date. one link pointed me to a french site, i can't read french...but tried entering this number with the various permutations of the choices and got nothing useful out of it. thank you all again for such wonderful input!! c", "sortedWord": "None", "Identifyer": null, "identifyer": 25164, "year": "2020"}, {"autor": "grantcline", "date": "2020-10-20 14:42:00", "content": "On 10/16/2020 at 3:21 PM, Cayenne said: Wow..thank you for the reply and all that info!! I do intend to start printing MORE. I think I heard someone say there are millions of images shot every day that are doomed to never see the light of day again....what a waste. I\"m just hoping to get better and come up with wall worthy images to print large and FRAME. I may run out of wall space, but hoping I can find homes for some of them when that happens. My camera arrived just a bit ago, I've attached the camera strap, lens (I started with a Voightlander 35mm f/2 Ultron to start with. I am about to attach the yellow filter to it. Right now, I'm awaiting the battery to fully charge!!! And...am about to start reading the manual. A quick extra question please: Is there any way to figure the \"born on date\" of when the camera body was made via the serial number? It appears the SN# is the one engraved on the top on the hot shoe, right? I've been googling and can't find how to get the manufacture date. One link pointed me to a French site, I can't read French...but tried entering this number with the various permutations of the choices and got nothing useful out of it. Thank you all again for such wonderful input!! C I also started with a Voightlander 35mm f/2 Ultron then added a Voigtlander 50mm f1.2 and both are great on the M10M. You will love your new Monochrom. Edited October 20, 2020 by grantcline", "link": "https://www.l-camera-forum.com/topic/314229-my-first-leica-m10m-some-questions/?tab=comments#comment-4065731", "origin": "L-forum", "suborigin": "314229-my-first-leica-m10m-some-questions", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 10/16/2020 at 3:21 pm, cayenne said: wow..thank you for the reply and all that info!! i do intend to start printing more. i think i heard someone say there are millions of images shot every day that are doomed to never see the light of day again....what a waste. i\"m just hoping to get better and -----> come !!!  -----> up !!!  -----> with !!!  wall worthy images to print large and frame. i may run out of wall space, but hoping i can find homes for some of them when that happens. my camera arrived just a bit ago, i've attached the camera strap, lens (i started with a voightlander 35mm f/2 ultron to start with. i am about to attach the yellow filter to it. right now, i'm awaiting the battery to fully charge!!! and...am about to start reading the manual. a quick extra question please: is there any way to figure the \"born on date\" of when the camera body was made via the serial number? it appears the sn# is the one engraved on the top on the hot shoe, right? i've been googling and can't find how to get the manufacture date. one link pointed me to a french site, i can't read french...but tried entering this number with the various permutations of the choices and got nothing useful out of it. thank you all again for such wonderful input!! c i also started with a voightlander 35mm f/2 ultron then added a voigtlander 50mm f1.2 and both are great on the m10m. you will love your new monochrom. edited october 20, 2020 by grantcline", "sortedWord": "None", "Identifyer": null, "identifyer": 25172, "year": "2020"}, {"autor": "johnbuckley", "date": "2020-01-23 16:35:00", "content": "I received mine yesterday in the US. It's a delight to have a Monochrom with the same form factor as the M10. I'll post pictures when I've had it out on the streets for more than just last night's freezing rush job running around my work neighborhood before the commute home. One doesn't want to post photos from an $8300 camera and have the immediate reaction be, you spent all that money and that's what you came up with? Why my iPhone... Edited January 23, 2020 by johnbuckley", "link": "https://www.l-camera-forum.com/topic/305396-m10-monochrom-availability-merged/page/3/?tab=comments#comment-3897772", "origin": "L-forum", "suborigin": "305396-m10-monochrom-availability-merged", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i received mine yesterday in the us. it's a delight to have a monochrom with the same form factor as the m10. i'll post pictures when i've had it out on the streets for more than just last night's freezing rush job running around my work neighborhood before the commute home. one doesn't want to post photos from an $8300 camera and have the immediate reaction be, you spent all that money and that's what you -----> came !!!  -----> up !!!  -----> with !!! ? why my iphone... edited january 23, 2020 by johnbuckley", "sortedWord": "None", "Identifyer": null, "identifyer": 26694, "year": "2020"}, {"autor": "carbon_dragon", "date": "2020-08-08 12:53:00", "content": "Am I the only one who thinks Leica should come up with some kind of accommodation for M9 owners (even though it's not legally obliged to)? Why should they? Because people buy and keep Leicas for longer and that is part of how they justify the cost. Like a reasonably priced upgrade path, or a new sensor that fits in the camera, or something. Otherwise someone shopping for a M10R right now will think to themselves, Hmmm... I guess Leica is just like all the other brands with only maintaining repair capability for maybe a decade. Maybe it's not a good idea to spend that premium a price when I can get something cheaper. Sure the Leica is made better, but the case is meaningless without the sensor so the great workmanship isn't as important.", "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/?tab=comments#comment-4023509", "origin": "L-forum", "suborigin": "312105-leica-discontinues-ccd-m9-and-variants-sensor-production", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "am i the only one who thinks leica should -----> come !!!  -----> up !!!  -----> with !!!  some kind of accommodation for m9 owners (even though it's not legally obliged to)? why should they? because people buy and keep leicas for longer and that is part of how they justify the cost. like a reasonably priced upgrade path, or a new sensor that fits in the camera, or something. otherwise someone shopping for a m10r right now will think to themselves, hmmm... i guess leica is just like all the other brands with only maintaining repair capability for maybe a decade. maybe it's not a good idea to spend that premium a price when i can get something cheaper. sure the leica is made better, but the case is meaningless without the sensor so the great workmanship isn't as important.", "sortedWord": "None", "Identifyer": null, "identifyer": 32823, "year": "2020"}, {"autor": "rivi1969", "date": "2020-08-08 21:27:00", "content": "8 hours ago, carbon_dragon said: Am I the only one who thinks Leica should come up with some kind of accommodation for M9 owners (even though it's not legally obliged to)? Why should they? Because people buy and keep Leicas for longer and that is part of how they justify the cost... \" 11 years of service are plenty for an electronic device. However if they don't want to service a 2015 M-E camera that's another story. I think Leica's trade-in program is terrible when the owner's of their cameras are forced to buy something else. For example, if I decided to trade my M9-P (Thank God it has a recently installed new sensor) I need to pay an additional 3500 Euros, when a new camera in the US costs the equivalent of 4200 Euros or a mint one even less of what they are asking. Edited August 8, 2020 by rivi1969", "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/?tab=comments#comment-4023783", "origin": "L-forum", "suborigin": "312105-leica-discontinues-ccd-m9-and-variants-sensor-production", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "8 hours ago, carbon_dragon said: am i the only one who thinks leica should -----> come !!!  -----> up !!!  -----> with !!!  some kind of accommodation for m9 owners (even though it's not legally obliged to)? why should they? because people buy and keep leicas for longer and that is part of how they justify the cost... \" 11 years of service are plenty for an electronic device. however if they don't want to service a 2015 m-e camera that's another story. i think leica's trade-in program is terrible when the owner's of their cameras are forced to buy something else. for example, if i decided to trade my m9-p (thank god it has a recently installed new sensor) i need to pay an additional 3500 euros, when a new camera in the us costs the equivalent of 4200 euros or a mint one even less of what they are asking. edited august 8, 2020 by rivi1969", "sortedWord": "None", "Identifyer": null, "identifyer": 32828, "year": "2020"}, {"autor": "martinot", "date": "2020-09-03 18:43:00", "content": "On 8/8/2020 at 2:53 PM, carbon_dragon said: Am I the only one who thinks Leica should come up with some kind of accommodation for M9 owners (even though it's not legally obliged to)? Why should they? Because people buy and keep Leicas for longer and that is part of how they justify the cost. Like a reasonably priced upgrade path, or a new sensor that fits in the camera, or something. Otherwise someone shopping for a M10R right now will think to themselves, Hmmm... I guess Leica is just like all the other brands with only maintaining repair capability for maybe a decade. Maybe it's not a good idea to spend that premium a price when I can get something cheaper. Sure the Leica is made better, but the case is meaningless without the sensor so the great workmanship isn't as important. I agree that ideally they should do. That said I think they have a quite generous trade in offer for M9 owners with problematic sensors wanting a new M10R camera.", "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/page/6/?tab=comments#comment-4039236", "origin": "L-forum", "suborigin": "312105-leica-discontinues-ccd-m9-and-variants-sensor-production", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 8/8/2020 at 2:53 pm, carbon_dragon said: am i the only one who thinks leica should -----> come !!!  -----> up !!!  -----> with !!!  some kind of accommodation for m9 owners (even though it's not legally obliged to)? why should they? because people buy and keep leicas for longer and that is part of how they justify the cost. like a reasonably priced upgrade path, or a new sensor that fits in the camera, or something. otherwise someone shopping for a m10r right now will think to themselves, hmmm... i guess leica is just like all the other brands with only maintaining repair capability for maybe a decade. maybe it's not a good idea to spend that premium a price when i can get something cheaper. sure the leica is made better, but the case is meaningless without the sensor so the great workmanship isn't as important. i agree that ideally they should do. that said i think they have a quite generous trade in offer for m9 owners with problematic sensors wanting a new m10r camera.", "sortedWord": "None", "Identifyer": null, "identifyer": 32927, "year": "2020"}, {"autor": "martinot", "date": "2020-09-03 19:36:00", "content": "On 8/12/2020 at 3:15 PM, carbon_dragon said: Yes that was kind of my point. My 5d is still fully functional too. \"Regular\" camera manufacturers make pretty long lived cameras and tough ones too, and they do it without $8000 price tags. Granted Leicas are works of art in many ways with hand crafting and fine mechanical precision, and so on. There are certainly Canon Ps and Nikon rangefinders still working too, but MOST Leicas from that period are still functional (or at least a heck of a lot of them). I think Leica takes pride in cameras living longer than their owners and not just one or two but most of them. It's a mindset you can embrace when the camera is all mechanical (much as we embrace it with mechanical watches). But once you add electronics, well you can't make new electronic components once the production line stops. What do you do if you're Leica and you take pride in your cameras outliving their owners? Do you give up on that notion and still make cameras that SHOULD last that long but won't because what is inside will fail long before the outer shell? Or do you do crazy things to keep up the spirit of that long life (like upgrading camera internals)? I expect they will quietly transition to letting those Ms slowly become shelf queens when there are no more electronic parts from the original cameras. I understand your point. Leicas well build cameras made for long mechanical life did make good sense in the film age, but not so much in rapidly advancing digital age. This is something that Leica needs to address sooner or later (possibly the first). Maybe they can come up with a body and an exchangeable sensor module (just like old Hasselblad with digital backs, or how Ricoh did it in their GXR)?", "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/page/6/?tab=comments#comment-4039272", "origin": "L-forum", "suborigin": "312105-leica-discontinues-ccd-m9-and-variants-sensor-production", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 8/12/2020 at 3:15 pm, carbon_dragon said: yes that was kind of my point. my 5d is still fully functional too. \"regular\" camera manufacturers make pretty long lived cameras and tough ones too, and they do it without $8000 price tags. granted leicas are works of art in many ways with hand crafting and fine mechanical precision, and so on. there are certainly canon ps and nikon rangefinders still working too, but most leicas from that period are still functional (or at least a heck of a lot of them). i think leica takes pride in cameras living longer than their owners and not just one or two but most of them. it's a mindset you can embrace when the camera is all mechanical (much as we embrace it with mechanical watches). but once you add electronics, well you can't make new electronic components once the production line stops. what do you do if you're leica and you take pride in your cameras outliving their owners? do you give up on that notion and still make cameras that should last that long but won't because what is inside will fail long before the outer shell? or do you do crazy things to keep up the spirit of that long life (like upgrading camera internals)? i expect they will quietly transition to letting those ms slowly become shelf queens when there are no more electronic parts from the original cameras. i understand your point. leicas well build cameras made for long mechanical life did make good sense in the film age, but not so much in rapidly advancing digital age. this is something that leica needs to address sooner or later (possibly the first). maybe they can -----> come !!!  -----> up !!!  -----> with !!!  a body and an exchangeable sensor module (just like old hasselblad -----> with !!!  digital backs, or how ricoh did it in their gxr)?", "sortedWord": "None", "Identifyer": null, "identifyer": 32930, "year": "2020"}, {"autor": "gu_al", "date": "2020-02-07 17:34:00", "content": "21 hours ago, adan said: A few questions: For Jim Norman: Does your M9-P have the new corrosion-resistant sensor? Does it use the corresponding new firmware for M9s with the replacement sensor? For others: When Leica revised the 28 Elmarit ASPH to take the new external-thread lens hood, was the optical formula tweaked (as with the 28 Summicron v.2) to improve corner resolution on digital? This seems to imply that is true: https://photorumors.com/2016/01/14/new-leica-summicron-m-35mm-f2-asph-summicron-m-28mm-f2-asph-and-elmarit-m-28mm-f2-8-asph-lenses/ And has anyone compared the 'New\" and \"Original\" 28 Elmarit ASPHs on an M9 with the original, corrodable sensor - or on the revised sensor? And does Leica distinguish between the new and old lenses, either as to catalog number, or as to 6-bit code (which controls green-corner removal)? I'm just wondering if, in having two optical versions of a lens, two versions of a sensor (M9 CCD i and ii), and two versions of the camera firmware (which includes the in-camera color-vignetting profiles) - ALL OR ANY OF WHICH could change the amount of green vignetting produced - something got lost in translation. It may just be a question of - using a 2-generation-old M9, use the older-generation lens. For the record, I've been trying out a v.1 28 Elmarit ASPH on an M10 (yet another, different sensor and firmware, obviously). No significant green corners. Hi, I have the original Elmarit 28mm Asph. My original M-E (corroded) sensor use to work fine with this lens, no green color cast in the corners. Sensor changed back in 2017, from there I've started seeing exact same issue as described. Actually some pics from my camera can be seen in the older post on the subject. I never got feedback from Leica and I've assumed Leica will not come up with a new corrected lens profile, i lost hope in a solution for M9/M-E. Btw, the 21mm profile is different but not much better, i tried all. B&W works fine though. Forgot to add, with the new sensor came the new Fw, so I'm not sure if the issue is the new sensor or the new firmware... Guilherme Edited February 7, 2020 by gu_al", "link": "https://www.l-camera-forum.com/topic/305970-m9-p-elmarit-28mm-asph-green-cast/?tab=comments#comment-3908149", "origin": "L-forum", "suborigin": "305970-m9-p-elmarit-28mm-asph-green-cast", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "21 hours ago, adan said: a few questions: for jim norman: does your m9-p have the new corrosion-resistant sensor? does it use the corresponding new firmware for m9s with the replacement sensor? for others: when leica revised the 28 elmarit asph to take the new external-thread lens hood, was the optical formula tweaked (as with the 28 summicron v.2) to improve corner resolution on digital? this seems to imply that is true: https://photorumors.com/2016/01/14/new-leica-summicron-m-35mm-f2-asph-summicron-m-28mm-f2-asph-and-elmarit-m-28mm-f2-8-asph-lenses/ and has anyone compared the 'new\" and \"original\" 28 elmarit asphs on an m9 with the original, corrodable sensor - or on the revised sensor? and does leica distinguish between the new and old lenses, either as to catalog number, or as to 6-bit code (which controls green-corner removal)? i'm just wondering if, in having two optical versions of a lens, two versions of a sensor (m9 ccd i and ii), and two versions of the camera firmware (which includes the in-camera color-vignetting profiles) - all or any of which could change the amount of green vignetting produced - something got lost in translation. it may just be a question of - using a 2-generation-old m9, use the older-generation lens. for the record, i've been trying out a v.1 28 elmarit asph on an m10 (yet another, different sensor and firmware, obviously). no significant green corners. hi, i have the original elmarit 28mm asph. my original m-e (corroded) sensor use to work fine with this lens, no green color cast in the corners. sensor changed back in 2017, from there i've started seeing exact same issue as described. actually some pics from my camera can be seen in the older post on the subject. i never got feedback from leica and i've assumed leica will not -----> come !!!  -----> up !!!  -----> with !!!  a new corrected lens profile, i lost hope in a solution for m9/m-e. btw, the 21mm profile is different but not much better, i tried all. b&w works fine though. forgot to add, with the new sensor came the new fw, so i'm not sure if the issue is the new sensor or the new firmware... guilherme edited february 7, 2020 by gu_al", "sortedWord": "None", "Identifyer": null, "identifyer": 34503, "year": "2020"}, {"autor": "pgk", "date": "2020-06-07 20:30:00", "content": "1 hour ago, adan said: The main reason Leitz/Leica lenses \"of a certain age\" image better, for me, is primarily lower global contrast (more shadow and/or highlight information) for a given exposure. Sorry but this is a myth. Lower contrast lenses do not record better shadow and/or highlight information. They cannot do so. They decrease the shadow information available. Think about it, how can two lenses differ in the contrast they produce. Low contrast = more flare/aberrations. High contrast = less flare/less aberrations. Higher contrast lenses produce more information on film/sensor NOT less. If they magically enable a higher dynamic range to be recorded then manufacturers would be producing much lower contrast lenses and relying on software to produce the desired image with greater tonality. But they don't because its doesn't work this way. For anyone who thinks it does here's the challenge - come up with a good technical explanation. I will add that I have some very old lenses (150+ years) which are very low contrast - does anyone think that these will record more shadow and/or highlight detail? In case anyone does I can assure them that they absolutely do not. Edited June 7, 2020 by pgk", "link": "https://www.l-camera-forum.com/topic/310164-show-me-your-favorite-lenses/page/4/?tab=comments#comment-3989354", "origin": "L-forum", "suborigin": "310164-show-me-your-favorite-lenses", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "1 hour ago, adan said: the main reason leitz/leica lenses \"of a certain age\" image better, for me, is primarily lower global contrast (more shadow and/or highlight information) for a given exposure. sorry but this is a myth. lower contrast lenses do not record better shadow and/or highlight information. they cannot do so. they decrease the shadow information available. think about it, how can two lenses differ in the contrast they produce. low contrast = more flare/aberrations. high contrast = less flare/less aberrations. higher contrast lenses produce more information on film/sensor not less. if they magically enable a higher dynamic range to be recorded then manufacturers would be producing much lower contrast lenses and relying on software to produce the desired image with greater tonality. but they don't because its doesn't work this way. for anyone who thinks it does here's the challenge - -----> come !!!  -----> up !!!  -----> with !!!  a good technical explanation. i will add that i have some very old lenses (150+ years) which are very low contrast - does anyone think that these will record more shadow and/or highlight detail? in case anyone does i can assure them that they absolutely do not. edited june 7, 2020 by pgk", "sortedWord": "None", "Identifyer": null, "identifyer": 14836, "year": "2020"}, {"autor": "adan", "date": "2020-06-07 22:59:00", "content": "1 hour ago, pgk said: For anyone who thinks it does here's the challenge - come up with a good technical explanation. Sure. If you assume an ideal media (film or sensor) with infinite dynamic range, then that theory is probably right. Or if one is talking about the limited case of edge contrast, but I was very, very, very careful to specify global (overall, black to white) contrast. Since there is no such ideal medium, theory does not apply. The medium, whether film or digital, has a limited DR. Let us set theory aside, and do an empirical experiment. (Basic equation: 1 mg of empiricial evidence > 1000 tonnes of theory.) Same exact scene, same exposure, shot within a minute of each other on a cloudless day. Identical postprocessing. Shot with an M10 and 1) 28 Elmarit-M ASPH, and 2) 21mm Elmarit-M (1980). --img--  With regard to highlight and shadow detail, texture, separation, and definition, tell me what you see, in these detail crops. Then I will give you the technical explanation. --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/310164-show-me-your-favorite-lenses/page/5/?tab=comments#comment-3989430", "origin": "L-forum", "suborigin": "310164-show-me-your-favorite-lenses", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "1 hour ago, pgk said: for anyone who thinks it does here's the challenge - -----> come !!!  -----> up !!!  -----> with !!!  a good technical explanation. sure. if you assume an ideal media (film or sensor) with infinite dynamic range, then that theory is probably right. or if one is talking about the limited case of edge contrast, but i was very, very, very careful to specify global (overall, black to white) contrast. since there is no such ideal medium, theory does not apply. the medium, whether film or digital, has a limited dr. let us set theory aside, and do an empirical experiment. (basic equation: 1 mg of empiricial evidence > 1000 tonnes of theory.) same exact scene, same exposure, shot within a minute of each other on a cloudless day. identical postprocessing. shot with an m10 and 1) 28 elmarit-m asph, and 2) 21mm elmarit-m (1980). --img--  with regard to highlight and shadow detail, texture, separation, and definition, tell me what you see, in these detail crops. then i will give you the technical explanation. --img--  --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 14842, "year": "2020"}, {"autor": "Ernest", "date": "2020-04-08 23:26:00", "content": "Evidently, the hood fitting issue still requires a specific request to get the retro-fitted screw-in black chrome hood, which works great, once you get one from Leica. Here's a work-around I used before Leica came up with the screw-in version. I used a step-up and a step-down adapter. There's only about 13mm difference between these adapters and the screw-in version, which didn't produce any vignetting I could see. The ribbed adapter is Heliopan 43mm - 40.5mm and the other is a generic 40.5mm - 43mm I filed to reduce its height in order to fit in the snap-on hood without modification. Notice the groove between the two adapters; it allows the hood prongs to seat. --img--  --img--  The mounted adapter on the left, and the screw-in hood with a filter attached to screw into the mounting ring on the lens. As I pointed out, the work-around extends the shade about 13mm. It cost less than $30. One other point is that the hood can be mounted in the reverse position on the lens if you like. The best solution is to let Leica redo your hood, which involves unscrewing the snap-on portion and screwing a new 43mm flange. You won't have to buy Overgaard's screw-in hood, unless you want the use 46mm filters. Rog", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/16/?tab=comments#comment-3949905", "origin": "L-forum", "suborigin": "245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "evidently, the hood fitting issue still requires a specific request to get the retro-fitted screw-in black chrome hood, which works great, once you get one from leica. here's a work-around i used before leica -----> came !!!  -----> up !!!  -----> with !!!  the screw-in version. i used a step-up and a step-down adapter. there's only about 13mm difference between these adapters and the screw-in version, which didn't produce any vignetting i could see. the ribbed adapter is heliopan 43mm - 40.5mm and the other is a generic 40.5mm - 43mm i filed to reduce its height in order to fit in the snap-on hood without modification. notice the groove between the two adapters; it allows the hood prongs to seat. --img--  --img--  the mounted adapter on the left, and the screw-in hood with a filter attached to screw into the mounting ring on the lens. as i pointed out, the work-around extends the shade about 13mm. it cost less than $30. one other point is that the hood can be mounted in the reverse position on the lens if you like. the best solution is to let leica redo your hood, which involves unscrewing the snap-on portion and screwing a new 43mm flange. you won't have to buy overgaard's screw-in hood, unless you want the use 46mm filters. rog", "sortedWord": "None", "Identifyer": null, "identifyer": 19593, "year": "2020"}, {"autor": "ruskkyle", "date": "2020-02-15 11:22:00", "content": "On 6/16/2019 at 10:25 PM, caigy said: Well that's an interesting possibility. I'll look into that one. First thing to do is I have to measure the diameter of the CL's eyepiece to see if that one will fit. Hi @caigy, same problem here. Did you come up with a solution?", "link": "https://www.l-camera-forum.com/topic/298249-eyecup-for-cl/?tab=comments#comment-3913227", "origin": "L-forum", "suborigin": "298249-eyecup-for-cl", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 6/16/2019 at 10:25 pm, caigy said: well that's an interesting possibility. i'll look into that one. first thing to do is i have to measure the diameter of the cl's eyepiece to see if that one will fit. hi @caigy, same problem here. did you -----> come !!!  -----> up !!!  -----> with !!!  a solution?", "sortedWord": "None", "Identifyer": null, "identifyer": 39992, "year": "2020"}, {"autor": "caigy", "date": "2020-02-16 15:51:00", "content": "On 2/15/2020 at 6:22 AM, ruskkyle said: Hi @caigy, same problem here. Did you come up with a solution? No, unfortunately I didn't. I bought the eyecups (they are actually for binoculars), but couldn't figure out a way to make them fit tightly, so I ended up returning them. I'm still looking for a solution. Maybe if Leica comes out with a CL2 someday (with IBIS, I hope!), they will add the option of a fitted eyecup.", "link": "https://www.l-camera-forum.com/topic/298249-eyecup-for-cl/?tab=comments#comment-3913986", "origin": "L-forum", "suborigin": "298249-eyecup-for-cl", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 2/15/2020 at 6:22 am, ruskkyle said: hi @caigy, same problem here. did you -----> come !!!  -----> up !!!  -----> with !!!  a solution? no, unfortunately i didn't. i bought the eyecups (they are actually for binoculars), but couldn't figure out a way to make them fit tightly, so i ended up returning them. i'm still looking for a solution. maybe if leica comes out with a cl2 someday (with ibis, i hope!), they will add the option of a fitted eyecup.", "sortedWord": "None", "Identifyer": null, "identifyer": 39993, "year": "2020"}, {"autor": "Lavaboy", "date": "2020-06-12 06:47:00", "content": "Minolta X-700/370 eyecup. I'm sttill trying to find a way to keeping it on. Nothing will stick to the tapered silicone eyepiece. It goes on snug but because of the taper it can slip off easily if nudged. I hope someone can come up with a solution. We're almost there! --img--  Edited June 12, 2020 by Lavaboy Add text.", "link": "https://www.l-camera-forum.com/topic/298249-eyecup-for-cl/?tab=comments#comment-3991919", "origin": "L-forum", "suborigin": "298249-eyecup-for-cl", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "minolta x-700/370 eyecup. i'm sttill trying to find a way to keeping it on. nothing will stick to the tapered silicone eyepiece. it goes on snug but because of the taper it can slip off easily if nudged. i hope someone can -----> come !!!  -----> up !!!  -----> with !!!  a solution. we're almost there! --img--  edited june 12, 2020 by lavaboy add text.", "sortedWord": "None", "Identifyer": null, "identifyer": 40000, "year": "2020"}, {"autor": "Ktsa5239", "date": "2020-10-11 21:04:00", "content": "Hopefully some other company might come up with a better alternative because I really like the idea of it! I mean it just needs to be sharp in the centre....", "link": "https://www.l-camera-forum.com/topic/313406-small-lens-alternative-for-the-cl/page/2/?tab=comments#comment-4061269", "origin": "L-forum", "suborigin": "313406-small-lens-alternative-for-the-cl", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "hopefully some other company might -----> come !!!  -----> up !!!  -----> with !!!  a better alternative because i really like the idea of it! i mean it just needs to be sharp in the centre....", "sortedWord": "None", "Identifyer": null, "identifyer": 44108, "year": "2020"}, {"autor": "Boojay", "date": "2020-02-27 18:46:00", "content": "Nice shot Jaapv, something different and not everyday you would be presented with that to shoot. It's a hard task to come up with a favourite. I've had the CL almost since launch and still have around 20,000 images on HD's. Nearly went with family/emotion, nature/wildlife but in the end chose the very first shot I took on my first visit to Venice, with the 18-56, I had literally just dropped off my case at the hotel and headed out, in true tourist mode, and since it's a destination I could never have enough of, definitely left my heart there, it seems like the right choice for this. Be so interesting to see what others feel their best shot is so great idea for a thread. --img-- ", "link": "https://www.l-camera-forum.com/topic/306896-post-your-favourite-cl-shot/?tab=comments#comment-3920872", "origin": "L-forum", "suborigin": "306896-post-your-favourite-cl-shot", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "nice shot jaapv, something different and not everyday you would be presented with that to shoot. it's a hard task to -----> come !!!  -----> up !!!  -----> with !!!  a favourite. i've had the cl almost since launch and still have around 20,000 images on hd's. nearly went with family/emotion, nature/wildlife but in the end chose the very first shot i took on my first visit to venice, with the 18-56, i had literally just dropped off my case at the hotel and headed out, in true tourist mode, and since it's a destination i could never have enough of, definitely left my heart there, it seems like the right choice for this. be so interesting to see what others feel their best shot is so great idea for a thread. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 44624, "year": "2020"}, {"autor": "OR120", "date": "2020-03-04 12:20:00", "content": " On 2/27/2020 at 1:46 PM, Boojay said: Nice shot Jaapv, something different and not everyday you would be presented with that to shoot. It's a hard task to come up with a favourite. I've had the CL almost since launch and still have around 20,000 images on HD's. Nearly went with family/emotion, nature/wildlife but in the end chose the very first shot I took on my first visit to Venice, with the 18-56, I had literally just dropped off my case at the hotel and headed out, in true tourist mode, and since it's a destination I could never have enough of, definitely left my heart there, it seems like the right choice for this. Be so interesting to see what others feel their best shot is so great idea for a thread. --img--  Beautiful shot! Isn't it wonderful when a destination really lives up to the hype.", "link": "https://www.l-camera-forum.com/topic/306896-post-your-favourite-cl-shot/page/2/?tab=comments#comment-3924567", "origin": "L-forum", "suborigin": "306896-post-your-favourite-cl-shot", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " on 2/27/2020 at 1:46 pm, boojay said: nice shot jaapv, something different and not everyday you would be presented with that to shoot. it's a hard task to -----> come !!!  -----> up !!!  -----> with !!!  a favourite. i've had the cl almost since launch and still have around 20,000 images on hd's. nearly went with family/emotion, nature/wildlife but in the end chose the very first shot i took on my first visit to venice, with the 18-56, i had literally just dropped off my case at the hotel and headed out, in true tourist mode, and since it's a destination i could never have enough of, definitely left my heart there, it seems like the right choice for this. be so interesting to see what others feel their best shot is so great idea for a thread. --img--  beautiful shot! isn't it wonderful when a destination really lives up to the hype.", "sortedWord": "None", "Identifyer": null, "identifyer": 44643, "year": "2020"}, {"autor": "Boojay", "date": "2020-08-15 08:02:00", "content": "A search using the box above right usually comes up with some results here, try this one", "link": "https://www.l-camera-forum.com/topic/312337-any-experience-with-new-sigma-primes-on-cl/?tab=comments#comment-4027385", "origin": "L-forum", "suborigin": "312337-any-experience-with-new-sigma-primes-on-cl", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "a search using the box above right usually -----> comes !!!  -----> up !!!  -----> with !!!  some results here, try this one", "sortedWord": "None", "Identifyer": null, "identifyer": 45003, "year": "2020"}, {"autor": "Boojay", "date": "2020-09-01 12:43:00", "content": "5 minutes ago, tritentrue said: One can only speculate what they can establish by comparing #3 with your other images, Jayne. Maybe they suspect a technique issue? And it wouldn't surprise me if, in the case of the CL, they blame the camera. One thing is relatively certain (unless they're bluffing about not having received similar reports): there's no fix in the works, nor will there be until or unless they believe enough users are having problems with the lens. Many thanks, Jayne, for sharing this. Looks like my copy is headed for the outbound bin. Well I will give it a try.. see what response I get, I had suggested in my e-mail that they looked through this forum and some of the images and discussion, who knows whether or not they do. I do hope it is possible to get some more from the lens, otherwise for me it may mean a total re-think going forward. Even though I do very little telephoto/wildlife type stuff these days, when I do it's nice to get good results. 5 minutes ago, bags27 said: Thanks so much for doing this, Jayne. I'm certainly not giving up on the lens yet (the extender is another matter), because it's fun to carry around. But the IQ is indeed disappointing. If I had a Sony mount, I'd sell it to my brother-in-law (but that's another story 😃). Would like to know if Sony users have noted any similar issues, would make me a little upset if the lens is performing better over there. If there was a chance Leica were going to come up with an alternative longer TL lens, or even a blooming extender for the 90-280 monster I may feel differently, but I'm on the edge of making some changes, or additions maybe🙃!", "link": "https://www.l-camera-forum.com/topic/312024-sigma-100-400-f5-63-dg-dn/page/4/?tab=comments#comment-4037516", "origin": "L-forum", "suborigin": "312024-sigma-100-400-f5-63-dg-dn", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "5 minutes ago, tritentrue said: one can only speculate what they can establish by comparing #3 with your other images, jayne. maybe they suspect a technique issue? and it wouldn't surprise me if, in the case of the cl, they blame the camera. one thing is relatively certain (unless they're bluffing about not having received similar reports): there's no fix in the works, nor will there be until or unless they believe enough users are having problems with the lens. many thanks, jayne, for sharing this. looks like my copy is headed for the outbound bin. well i will give it a try.. see what response i get, i had suggested in my e-mail that they looked through this forum and some of the images and discussion, who knows whether or not they do. i do hope it is possible to get some more from the lens, otherwise for me it may mean a total re-think going forward. even though i do very little telephoto/wildlife type stuff these days, when i do it's nice to get good results. 5 minutes ago, bags27 said: thanks so much for doing this, jayne. i'm certainly not giving up on the lens yet (the extender is another matter), because it's fun to carry around. but the iq is indeed disappointing. if i had a sony mount, i'd sell it to my brother-in-law (but that's another story 😃). would like to know if sony users have noted any similar issues, would make me a little upset if the lens is performing better over there. if there was a chance leica were going to -----> come !!!  -----> up !!!  -----> with !!!  an alternative longer tl lens, or even a blooming extender for the 90-280 monster i may feel differently, but i'm on the edge of making some changes, or additions maybe🙃!", "sortedWord": "None", "Identifyer": null, "identifyer": 47027, "year": "2020"}, {"autor": "tritentrue", "date": "2020-10-19 12:49:00", "content": "Even though I ditched the Sigma 100-400mm + 1.39X😎 teleconverter along with the Lumix 70-200mm f/4 a few weeks ago, I still follow the rumors sites in the hope that the alliance partners will come up with some new options. I kept my Panasonic teleconverters in the hope that maybe there's a long prime somewhere in the pipeline with which they will work better than they did with the zoom. For shooters who deal only with near subject matter, the Sigma is an incredible value. In fact, before I parted with it I was tempted to go to the local bird park and stockpile a hundred or so close shots of captive critters so I could dazzle folks here with my \"craft.\" But my friends in the wild would not have forgiven me! 😉 From my last outing with the Sigma: my little myna friend below may not be colorful, but he chose to honor me with his trust . . . --img-- ", "link": "https://www.l-camera-forum.com/topic/312024-sigma-100-400-f5-63-dg-dn/page/6/?tab=comments#comment-4065167", "origin": "L-forum", "suborigin": "312024-sigma-100-400-f5-63-dg-dn", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "even though i ditched the sigma 100-400mm + 1.39x😎 teleconverter along -----> with !!!  the lumix 70-200mm f/4 a few weeks ago, i still follow the rumors sites in the hope that the alliance partners will -----> come !!!  -----> up !!!  -----> with !!!  some new options. i kept my panasonic teleconverters in the hope that maybe there's a long prime somewhere in the pipeline with which they will work better than they did with the zoom. for shooters who deal only with near subject matter, the sigma is an incredible value. in fact, before i parted with it i was tempted to go to the local bird park and stockpile a hundred or so close shots of captive critters so i could dazzle folks here with my \"craft.\" but my friends in the wild would not have forgiven me! 😉 from my last outing with the sigma: my little myna friend below may not be colorful, but he chose to honor me with his trust . . . --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 47053, "year": "2020"}, {"autor": "steveBK", "date": "2020-10-19 21:00:00", "content": "8 hours ago, tritentrue said: Even though I ditched the Sigma 100-400mm + 1.39X😎 teleconverter along with the Lumix 70-200mm f/4 a few weeks ago, I still follow the rumors sites in the hope that the alliance partners will come up with some new options. I kept my Panasonic teleconverters in the hope that maybe there's a long prime somewhere in the pipeline with which they will work better than they did with the zoom. For shooters who deal only with near subject matter, the Sigma is an incredible value. In fact, before I parted with it I was tempted to go to the local bird park and stockpile a hundred or so close shots of captive critters so I could dazzle folks here with my \"craft.\" But my friends in the wild would not have forgiven me! 😉 From my last outing with the Sigma: my little myna friend below may not be colorful, but he chose to honor me with his trust . . . --img--  This is a lovely shot. How would you characterize \"deal only with near subject matter\"? I have a lot of critters running around the yard in the house I now reside, about 1 acre of property. Would you say the 100-400 sigma or 70-200 Panny would be appropriate here (with or without their matching teleconverters..) thx", "link": "https://www.l-camera-forum.com/topic/312024-sigma-100-400-f5-63-dg-dn/page/6/?tab=comments#comment-4065450", "origin": "L-forum", "suborigin": "312024-sigma-100-400-f5-63-dg-dn", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "8 hours ago, tritentrue said: even though i ditched the sigma 100-400mm + 1.39x😎 teleconverter along -----> with !!!  the lumix 70-200mm f/4 a few weeks ago, i still follow the rumors sites in the hope that the alliance partners will -----> come !!!  -----> up !!!  -----> with !!!  some new options. i kept my panasonic teleconverters in the hope that maybe there's a long prime somewhere in the pipeline with which they will work better than they did with the zoom. for shooters who deal only with near subject matter, the sigma is an incredible value. in fact, before i parted with it i was tempted to go to the local bird park and stockpile a hundred or so close shots of captive critters so i could dazzle folks here with my \"craft.\" but my friends in the wild would not have forgiven me! 😉 from my last outing with the sigma: my little myna friend below may not be colorful, but he chose to honor me with his trust . . . --img--  this is a lovely shot. how would you characterize \"deal only with near subject matter\"? i have a lot of critters running around the yard in the house i now reside, about 1 acre of property. would you say the 100-400 sigma or 70-200 panny would be appropriate here (with or without their matching teleconverters..) thx", "sortedWord": "None", "Identifyer": null, "identifyer": 47056, "year": "2020"}, {"autor": "michali", "date": "2020-11-24 08:15:00", "content": "Let's see if Leica also comes up with an AF FW update for the SL2 at some point? Edited November 24, 2020 by michali", "link": "https://www.l-camera-forum.com/topic/315461-lumix-s1s1rs1h-fw-with-improved-af/?tab=comments#comment-4086141", "origin": "L-forum", "suborigin": "315461-lumix-s1s1rs1h-fw-with-improved-af", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "let's see if leica also -----> comes !!!  -----> up !!!  -----> with !!!  an af fw update for the sl2 at some point? edited november 24, 2020 by michali", "sortedWord": "None", "Identifyer": null, "identifyer": 48287, "year": "2020"}, {"autor": "helged", "date": "2020-11-24 08:21:00", "content": "33 minutes ago, michali said: Let's see if Leica also comes up with an AF FW update for the SL2 at some point? +1. Would be strange if Leica doesn't follow these updates. And hopefully not too far into 2021... The rumoured SL2-S - expected to come rather soon - may give us a hint. Edited November 24, 2020 by helged", "link": "https://www.l-camera-forum.com/topic/315461-lumix-s1s1rs1h-fw-with-improved-af/?tab=comments#comment-4086142", "origin": "L-forum", "suborigin": "315461-lumix-s1s1rs1h-fw-with-improved-af", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "33 minutes ago, michali said: let's see if leica also -----> comes !!!  -----> up !!!  -----> with !!!  an af fw update for the sl2 at some point? +1. would be strange if leica doesn't follow these updates. and hopefully not too far into 2021... the rumoured sl2-s - expected to come rather soon - may give us a hint. edited november 24, 2020 by helged", "sortedWord": "None", "Identifyer": null, "identifyer": 48288, "year": "2020"}, {"autor": "vedivv", "date": "2020-11-05 13:14:00", "content": "The subject of processor speed keeps coming as the explanation of Q2 lacking the ability to do eye AF. Is it true? Sony came up with very effective eye AF more six years ago. And is face detection/eye AF that demanding on the processor?", "link": "https://www.l-camera-forum.com/topic/314775-firmware-30/page/2/?tab=comments#comment-4074410", "origin": "L-forum", "suborigin": "314775-firmware-30", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "the subject of processor speed keeps coming as the explanation of q2 lacking the ability to do eye af. is it true? sony -----> came !!!  -----> up !!!  -----> with !!!  very effective eye af more six years ago. and is face detection/eye af that demanding on the processor?", "sortedWord": "None", "Identifyer": null, "identifyer": 7523, "year": "2020"}, {"autor": "PeterD", "date": "2020-11-10 15:47:00", "content": "Sounds like a great idea, not so about the price. 47MP might be a bit too much though, just thinking storage. Must say I really like the idea of simulating various focal lengths, but am disapppointed at the amount of reduction in resolution at the higher end. I would have thought that Leica could have come up with some interpolation scheme to effectively improve the reolution. Should be a nice camera for travelling, but will it be cost competitive with other high-end manufacturer's system offerings with a zoom and thus higher resolution . Obviously lighter though.", "link": "https://www.l-camera-forum.com/topic/314986-leica-q2-monochrom/?tab=comments#comment-4077665", "origin": "L-forum", "suborigin": "314986-leica-q2-monochrom", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "sounds like a great idea, not so about the price. 47mp might be a bit too much though, just thinking storage. must say i really like the idea of simulating various focal lengths, but am disapppointed at the amount of reduction in resolution at the higher end. i would have thought that leica could have -----> come !!!  -----> up !!!  -----> with !!!  some interpolation scheme to effectively improve the reolution. should be a nice camera for travelling, but will it be cost competitive with other high-end manufacturer's system offerings with a zoom and thus higher resolution . obviously lighter though.", "sortedWord": "None", "Identifyer": null, "identifyer": 7631, "year": "2020"}, {"autor": "SrMi", "date": "2020-11-10 16:02:00", "content": "13 minutes ago, PeterD said: Sounds like a great idea, not so about the price. 47MP might be a bit too much though, just thinking storage. Must say I really like the idea of simulating various focal lengths, but am disapppointed at the amount of reduction in resolution at the higher end. I would have thought that Leica could have come up with some interpolation scheme to effectively improve the reolution. Should be a nice camera for travelling, but will it be cost competitive with other high-end manufacturer's system offerings with a zoom and thus higher resolution . Obviously lighter though. I believe that upsizing is best done in the post. It takes time to upsize and it is hard to compete with something like Topaz Gigapixel AI.", "link": "https://www.l-camera-forum.com/topic/314986-leica-q2-monochrom/?tab=comments#comment-4077682", "origin": "L-forum", "suborigin": "314986-leica-q2-monochrom", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "13 minutes ago, peterd said: sounds like a great idea, not so about the price. 47mp might be a bit too much though, just thinking storage. must say i really like the idea of simulating various focal lengths, but am disapppointed at the amount of reduction in resolution at the higher end. i would have thought that leica could have -----> come !!!  -----> up !!!  -----> with !!!  some interpolation scheme to effectively improve the reolution. should be a nice camera for travelling, but will it be cost competitive with other high-end manufacturer's system offerings with a zoom and thus higher resolution . obviously lighter though. i believe that upsizing is best done in the post. it takes time to upsize and it is hard to compete with something like topaz gigapixel ai.", "sortedWord": "None", "Identifyer": null, "identifyer": 7632, "year": "2020"}, {"autor": "Sonja", "date": "2020-04-07 15:58:00", "content": " I have a Leica D-LUX5. When I turn on the camera, the viewfinder comes up with this pinkish-purple hue. (See attached). When I take a photo, it comes out black. When I take a video, I can hear the audio but the video is pink at well. A sensor issue? What to do about it? --img-- ", "link": "https://www.l-camera-forum.com/topic/308316-leica-d-lux5-pink-viewfinder-issue/?tab=comments#comment-3948979", "origin": "L-forum", "suborigin": "308316-leica-d-lux5-pink-viewfinder-issue", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": " i have a leica d-lux5. when i turn on the camera, the viewfinder -----> comes !!!  -----> up !!!  -----> with !!!  this pinkish-purple hue. (see attached). when i take a photo, it comes out black. when i take a video, i can hear the audio but the video is pink at well. a sensor issue? what to do about it? --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 16967, "year": "2020"}, {"autor": "Lentakis", "date": "2020-09-21 05:03:00", "content": " Hi guys! Thank you all for your input. I'm going to search through the forum at Torsten's suggestion to see if I can come up with more technical information. A schematic would have been great but the Leica Camera Repair Handbook by Tomosy costs $375 on Amazon. I'll search for more information and keep you posted how it goes if/when I perform the surgery. Elias", "link": "https://www.l-camera-forum.com/topic/312217-r4-shutter-button-question-disassembly-help/?tab=comments#comment-4049614", "origin": "L-forum", "suborigin": "312217-r4-shutter-button-question-disassembly-help", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " hi guys! thank you all for your input. i'm going to search through the forum at torsten's suggestion to see if i can -----> come !!!  -----> up !!!  -----> with !!!  more technical information. a schematic would have been great but the leica camera repair handbook by tomosy costs $375 on amazon. i'll search for more information and keep you posted how it goes if/when i perform the surgery. elias", "sortedWord": "None", "Identifyer": null, "identifyer": 19749, "year": "2020"}, {"autor": "peterv", "date": "2020-03-06 14:06:00", "content": "I am hoping that we will start to see reviews soon. Maybe today embargoes will be lifted and perhaps some of the usual suspects will come up with \"first impressions\" or 'hands on\" or \"real-world\" reviews or whatever they are called. I thought it might be a good idea to have all the links to such internet wisdom about the new S3 all in one place, so I opened a separate thread for that. Exciting times!", "link": "https://www.l-camera-forum.com/topic/305846-is-the-release-of-the-s3-imminent/page/4/?tab=comments#comment-3925860", "origin": "L-forum", "suborigin": "305846-is-the-release-of-the-s3-imminent", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i am hoping that we will start to see reviews soon. maybe today embargoes will be lifted and perhaps some of the usual suspects will -----> come !!!  -----> up !!!  -----> with !!!  \"first impressions\" or 'hands on\" or \"real-world\" reviews or whatever they are called. i thought it might be a good idea to have all the links to such internet wisdom about the new s3 all in one place, so i opened a separate thread for that. exciting times!", "sortedWord": "None", "Identifyer": null, "identifyer": 28649, "year": "2020"}, {"autor": "scott kirkpatrick", "date": "2020-05-25 05:41:00", "content": " 2 hours ago, iRandom said: Total failure of geotagging for me today. I keep the Fotos app running on my iPhone at all times and it is often the only thing running. I took a few photos on three occasions this afternoon and not a single one has location info. The phone was with me the whole time. I even used the Fotos app to download each set along the way. You'd think that connecting the camera for downloading would have refreshed the geolocation - but then that would make sense and that is clearly beyond these engineers. It wasn't until I killed the app and restarted it that I got a photo that supposedly has geolocation. So much for that message that says geotagging is disabled when you kill the app. It had already graciously disabled it long before that. Earlier versions of the Fotos app would only add location info after you had made a remote connection. I wonder if the two paths mess each other up now. But, I can now keep the GPS icon appearing on the camera (SL2) 30 sec after the BT icon appears in both Android and iOS. And the files have a location saved. But the location is not at all accurate in iOS and is garbage (usually the top of my desk at home) in Android. So can some others check the accuracy of the locations you get when you get them, and come up with some ideas on when a location is passed from the phone to Fotos to the camera? Ifirst check to be sure that there is a location (Fotos remote shows this.) Then look the location up on a map and bring up the scale to check distance from street corners and buildings. (Capture One lets me do this. I go to the \"info\" panel, and click on a control close to the lat and lon, and it takes me to Google maps.)", "link": "https://www.l-camera-forum.com/topic/309540-fotos-app-21-released-geotagging/page/4/?tab=comments#comment-3980022", "origin": "L-forum", "suborigin": "309540-fotos-app-21-released-geotagging", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " 2 hours ago, irandom said: total failure of geotagging for me today. i keep the fotos app running on my iphone at all times and it is often the only thing running. i took a few photos on three occasions this afternoon and not a single one has location info. the phone was with me the whole time. i even used the fotos app to download each set along the way. you'd think that connecting the camera for downloading would have refreshed the geolocation - but then that would make sense and that is clearly beyond these engineers. it wasn't until i killed the app and restarted it that i got a photo that supposedly has geolocation. so much for that message that says geotagging is disabled when you kill the app. it had already graciously disabled it long before that. earlier versions of the fotos app would only add location info after you had made a remote connection. i wonder if the two paths mess each other up now. but, i can now keep the gps icon appearing on the camera (sl2) 30 sec after the bt icon appears in both android and ios. and the files have a location saved. but the location is not at all accurate in ios and is garbage (usually the top of my desk at home) in android. so can some others check the accuracy of the locations you get when you get them, and -----> come !!!  -----> up !!!  -----> with !!!  some ideas on when a location is passed from the phone to fotos to the camera? ifirst check to be sure that there is a location (fotos remote shows this.) then look the location up on a map and bring up the scale to check distance from street corners and buildings. (capture one lets me do this. i go to the \"info\" panel, and click on a control close to the lat and lon, and it takes me to google maps.)", "sortedWord": "None", "Identifyer": null, "identifyer": 33529, "year": "2020"}, {"autor": "willeica", "date": "2020-10-20 12:29:00", "content": "A lot of people ask why such features cannot be built into cameras. Now we know why as the complaints would be endless. However, all electronic stuff tends to have bugs, even software from the likes of Apple, Microsoft and Google. I still have not found a reason why I would 'need' FOTOS. I tried it once and it would not 'talk' to my M10, so I have left it alone ever since. Can anyone come up with any real 'needs' that it actually meets? William", "link": "https://www.l-camera-forum.com/topic/314336-leica-fotos-220-released-all-pro-features-are-now-free/?tab=comments#comment-4065686", "origin": "L-forum", "suborigin": "314336-leica-fotos-220-released-all-pro-features-are-now-free", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "a lot of people ask why such features cannot be built into cameras. now we know why as the complaints would be endless. however, all electronic stuff tends to have bugs, even software from the likes of apple, microsoft and google. i still have not found a reason why i would 'need' fotos. i tried it once and it would not 'talk' to my m10, so i have left it alone ever since. can anyone -----> come !!!  -----> up !!!  -----> with !!!  any real 'needs' that it actually meets? william", "sortedWord": "None", "Identifyer": null, "identifyer": 33741, "year": "2020"}, {"autor": "scott kirkpatrick", "date": "2020-11-03 09:55:00", "content": " Still no fees. Thanks, Leica! Some bugfixes claimed, but I could still find bugs, and some may be new. I am running Fotos Pro 2.2.2 in an iPad Pro with IOS 14.1 Camera is SL2 with about 900 pictures on card #1. (second card still not recognized, warning message.) Connection first time using pairing was clean. I had wiped off old copy of Fotos 2.2.1 (plain, not Pro). Connecting for the second time after shutting down was hard., took several tries. Fotos came up with its own set of Aperture, Shutter, ISO, Fstop settings, not those on the camera. I set them to my needs, took some shots, switched to video. Video came up with its own settings, which I adjusted. Shot a short video. Switched back to photo. Aperture and Iso were as I had left them, but the shutter speed was still set as video had left it. That's BAD. Camera firmware has them nicely kept independent . Video start and stop were reasonably quick. Setting drive to continuous low speed still doesn't work (you get a single shot) Some apertures are still reported wrong (2.1, 4.1, 3.6 etc.) (edit) current Android Fotos is still 2.2.0, so not relevant to this thread. Edited November 4, 2020 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/314766-fotos-222-and-222-pro-released/?tab=comments#comment-4073135", "origin": "L-forum", "suborigin": "314766-fotos-222-and-222-pro-released", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " still no fees. thanks, leica! some bugfixes claimed, but i could still find bugs, and some may be new. i am running fotos pro 2.2.2 in an ipad pro with ios 14.1 camera is sl2 with about 900 pictures on card #1. (second card still not recognized, warning message.) connection first time using pairing was clean. i had wiped off old copy of fotos 2.2.1 (plain, not pro). connecting for the second time after shutting down was hard., took several tries. fotos -----> came !!!  -----> up !!!  -----> with !!!  its own set of aperture, shutter, iso, fstop settings, not those on the camera. i set them to my needs, took some shots, switched to video. video came up with its own settings, which i adjusted. shot a short video. switched back to photo. aperture and iso were as i had left them, but the shutter speed was still set as video had left it. that's bad. camera firmware has them nicely kept independent . video start and stop were reasonably quick. setting drive to continuous low speed still doesn't work (you get a single shot) some apertures are still reported wrong (2.1, 4.1, 3.6 etc.) (edit) current android fotos is still 2.2.0, so not relevant to this thread. edited november 4, 2020 by scott kirkpatrick", "sortedWord": "None", "Identifyer": null, "identifyer": 33752, "year": "2020"}, {"autor": "George Furst", "date": "2020-06-24 15:30:00", "content": "4 hours ago, Ambro51 said: The baseplate engraving is fantastic. We must realize these cameras will endure, and be quite special. Is Mr. Kim still “on board” with these projects? I know as a builder.....sometimes very interesting complex projects are absorbing, challenging and enjoyable. After the fourth or fifth time, they are an exercise in earning a paycheck, little more. Thank you for your comments. Regarding your question, I did visit Mr Kim last week to pick up the baseplate. I and my Korean Friend Peter even had lunch with him. He is presently doing a conversion for Mark and I asked about it and even saw that he was working on it during the prior visit. Yes i he is still taking orders is willing to convert more if they arrive. He rather enjoys to challenge because each one is different. I believe this is true because as a final project back in the 70s at the Leitz Works, each student made their reproduction of the original with minor variations. He has also moved his place of work to a location nearer his home. It took eighty boxes and two days to move all. I must say moving is an art here in South Korea. Also there are special moving days. Special fortune tellers must be visited and after you give them all the information requested they sit there Thinking and come up with your moving day. Anyway I am sure this moving event will slow down the finishing of Mark’s UR that is in the process of conversion presently. I will try to post a photo of him working on it. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/138638-working-ur-leica/page/12/?tab=comments#comment-3998605", "origin": "L-forum", "suborigin": "138638-working-ur-leica", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "4 hours ago, ambro51 said: the baseplate engraving is fantastic. we must realize these cameras will endure, and be quite special. is mr. kim still “on board” with these projects? i know as a builder.....sometimes very interesting complex projects are absorbing, challenging and enjoyable. after the fourth or fifth time, they are an exercise in earning a paycheck, little more. thank you for your comments. regarding your question, i did visit mr kim last week to pick up the baseplate. i and my korean friend peter even had lunch with him. he is presently doing a conversion for mark and i asked about it and even saw that he was working on it during the prior visit. yes i he is still taking orders is willing to convert more if they arrive. he rather enjoys to challenge because each one is different. i believe this is true because as a final project back in the 70s at the leitz works, each student made their reproduction of the original with minor variations. he has also moved his place of work to a location nearer his home. it took eighty boxes and two days to move all. i must say moving is an art here in south korea. also there are special moving days. special fortune tellers must be visited and after you give them all the information requested they sit there thinking and -----> come !!!  -----> up !!!  -----> with !!!  your moving day. anyway i am sure this moving event will slow down the finishing of mark’s ur that is in the process of conversion presently. i will try to post a photo of him working on it. --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 35872, "year": "2020"}, {"autor": "nf3996", "date": "2020-12-19 14:39:00", "content": "1 hour ago, jerzy said: accoring to Hahne list it was black painted, within a batch of 250 BP cameras (116001-116250). Where did you find it was chromed? Could you pls post additionally a photo of locking pin for bottom cover? It is for my researches. I was looking at the list in G Rogliatti's Leica. The First Fifty Years (2nd edition), plus two searches on the internet - all came up with chrome for the serial number. Is the Hahne list available on the internet? I'm unsure which bit is the locking pin, so I've uploaded two photos of different parts that I think it might be. I hope one of them is correct ... Alan --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/316227-leica-iii-serial-number-curiosity/?tab=comments#comment-4101869", "origin": "L-forum", "suborigin": "316227-leica-iii-serial-number-curiosity", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "1 hour ago, jerzy said: accoring to hahne list it was black painted, within a batch of 250 bp cameras (116001-116250). where did you find it was chromed? could you pls post additionally a photo of locking pin for bottom cover? it is for my researches. i was looking at the list in g rogliatti's leica. the first fifty years (2nd edition), plus two searches on the internet - all -----> came !!!  -----> up !!!  -----> with !!!  chrome for the serial number. is the hahne list available on the internet? i'm unsure which bit is the locking pin, so i've uploaded two photos of different parts that i think it might be. i hope one of them is correct ... alan --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 41987, "year": "2020"}, {"autor": "StS", "date": "2020-09-21 19:35:00", "content": " Jenischhaus, Franz Gustav Forsmann and Karl Friedrich Schinkel 1831–1834. Built for the Senator* Martin Johan Jenisch; Forsmann's first draft was given to Schinkel, who came up with a much larger building, which was too large for Schinkel's needs (after all, Hamburg is a merchant's city, showing off can be overdone and a Pfennig (penny) not spent, you know...), so Forsmann reworked his first, smaller draft using elements of Schinkel's proposal Classicism was certainly the style of the day, however, apart from the pretty ornate balcony railings, the result is almost austere. Thank you for your interest Stefan Edit - following a discussion in the Bar, the house was sold by the Jenisch family to the city and is a museum these days (owned by the Stiftung Historische Museen Hamburg). * A Senator in Hamburg is the equivalent of a Minister in the other Bundesländern (states) --img--  Edited September 21, 2020 by StS", "link": "https://www.l-camera-forum.com/topic/313532-jenischhaus-and-jenischpark-2-pictures/?tab=comments#comment-4050027", "origin": "L-forum", "suborigin": "313532-jenischhaus-and-jenischpark-2-pictures", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " jenischhaus, franz gustav forsmann and karl friedrich schinkel 1831–1834. built for the senator* martin johan jenisch; forsmann's first draft was given to schinkel, who -----> came !!!  -----> up !!!  -----> with !!!  a much larger building, which was too large for schinkel's needs (after all, hamburg is a merchant's city, showing off can be overdone and a pfennig (penny) not spent, you know...), so forsmann reworked his first, smaller draft using elements of schinkel's proposal classicism was certainly the style of the day, however, apart from the pretty ornate balcony railings, the result is almost austere. thank you for your interest stefan edit - following a discussion in the bar, the house was sold by the jenisch family to the city and is a museum these days (owned by the stiftung historische museen hamburg). * a senator in hamburg is the equivalent of a minister in the other bundesländern (states) --img--  edited september 21, 2020 by sts", "sortedWord": "None", "Identifyer": null, "identifyer": 55632, "year": "2020"}, {"autor": "war", "date": "2020-09-22 02:07:00", "content": "5 hours ago, StS said: Jenischhaus, Franz Gustav Forsmann and Karl Friedrich Schinkel 1831–1834. Built for the Senator* Martin Johan Jenisch; Forsmann's first draft was given to Schinkel, who came up with a much larger building, which was too large for Schinkel's needs (after all, Hamburg is a merchant's city, showing off can be overdone and a Pfennig (penny) not spent, you know...), so Forsmann reworked his first, smaller draft using elements of Schinkel's proposal Classicism was certainly the style of the day, however, apart from the pretty ornate balcony railings, the result is almost austere. Thank you for your interest Stefan Edit - following a discussion in the Bar, the house was sold by the Jenisch family to the city and is a museum these days (owned by the Stiftung Historische Museen Hamburg). * A Senator in Hamburg is the equivalent of a Minister in the other Bundesländern (states) --img--  A Beautiful image of the house. I've never seen this. Schinkel's classicism is very restrained, very much like his Neuer Pavillon in Berlin. Thanks for posting.", "link": "https://www.l-camera-forum.com/topic/313532-jenischhaus-and-jenischpark-2-pictures/?tab=comments#comment-4050161", "origin": "L-forum", "suborigin": "313532-jenischhaus-and-jenischpark-2-pictures", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "5 hours ago, sts said: jenischhaus, franz gustav forsmann and karl friedrich schinkel 1831–1834. built for the senator* martin johan jenisch; forsmann's first draft was given to schinkel, who -----> came !!!  -----> up !!!  -----> with !!!  a much larger building, which was too large for schinkel's needs (after all, hamburg is a merchant's city, showing off can be overdone and a pfennig (penny) not spent, you know...), so forsmann reworked his first, smaller draft using elements of schinkel's proposal classicism was certainly the style of the day, however, apart from the pretty ornate balcony railings, the result is almost austere. thank you for your interest stefan edit - following a discussion in the bar, the house was sold by the jenisch family to the city and is a museum these days (owned by the stiftung historische museen hamburg). * a senator in hamburg is the equivalent of a minister in the other bundesländern (states) --img--  a beautiful image of the house. i've never seen this. schinkel's classicism is very restrained, very much like his neuer pavillon in berlin. thanks for posting.", "sortedWord": "None", "Identifyer": null, "identifyer": 55635, "year": "2020"}, {"autor": "peterb", "date": "2020-01-31 03:31:00", "content": " At the University of Virginia (like other places I suppose) secret societies abound. No one knows WHO they are (that is, their members) but they go out of their way to make sure you know WHO they are (if you get my drift). This one, the uber secretive \"7\" society comes up with little monetary surprises for students in need or a new professorship with the sudden appearance of a check written out in...you guessed it 7's (like $7,777.77 to buy books for two years). Anyway, they make sure you know they're around and part of the place with the \"7\" graffiti they paint all over Jeffersonian brick walkways and buildings. Taken with the DLux. --img--  Edited January 31, 2020 by peterb", "link": "https://www.l-camera-forum.com/topic/305927-ive-got-a-secret/?tab=comments#comment-3902998", "origin": "L-forum", "suborigin": "305927-ive-got-a-secret", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": " at the university of virginia (like other places i suppose) secret societies abound. no one knows who they are (that is, their members) but they go out of their way to make sure you know who they are (if you get my drift). this one, the uber secretive \"7\" society -----> comes !!!  -----> up !!!  -----> with !!!  little monetary surprises for students in need or a new professorship -----> with !!!  the sudden appearance of a check written out in...you guessed it 7's (like $7,777.77 to buy books for two years). anyway, they make sure you know they're around and part of the place with the \"7\" graffiti they paint all over jeffersonian brick walkways and buildings. taken with the dlux. --img--  edited january 31, 2020 by peterb", "sortedWord": "None", "Identifyer": null, "identifyer": 55916, "year": "2020"}, {"autor": "stray cat", "date": "2020-05-10 03:06:00", "content": "On 5/9/2020 at 2:45 AM, Ernest said: Five Square III M-A APO 50 ADOX Color Implosion Bauhaus collage. --img--  Wow! Now this is different! You must have had to get out the protractor, the slide rule and abacus to come up with the geometric alignments. But the colors! The colors work so well here in sympathy with one another, repeating to form a kaleidoscope of mathematical ingenuity. Red slicing bold diagonals, yellow describing a bold and stable center, the muted greens and pastels shoring up the strength and sense of solidity. and speaking of solidity, it's only then that we realize and recognize and tip our hat that this is all hard surfaces (sorry! PICTURES of hard surfaces!), repurposed and appropriated in the service of art.", "link": "https://www.l-camera-forum.com/topic/290225-diptychs-triptychs-and-polytychs-open-thread/page/15/?tab=comments#comment-3970246", "origin": "L-forum", "suborigin": "290225-diptychs-triptychs-and-polytychs-open-thread", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 5/9/2020 at 2:45 am, ernest said: five square iii m-a apo 50 adox color implosion bauhaus collage. --img--  wow! now this is different! you must have had to get out the protractor, the slide rule and abacus to -----> come !!!  -----> up !!!  -----> with !!!  the geometric alignments. but the colors! the colors work so well here in sympathy with one another, repeating to form a kaleidoscope of mathematical ingenuity. red slicing bold diagonals, yellow describing a bold and stable center, the muted greens and pastels shoring up the strength and sense of solidity. and speaking of solidity, it's only then that we realize and recognize and tip our hat that this is all hard surfaces (sorry! pictures of hard surfaces!), repurposed and appropriated in the service of art.", "sortedWord": "None", "Identifyer": null, "identifyer": 64064, "year": "2020"}, {"autor": "Ernest", "date": "2020-05-10 18:08:00", "content": "14 hours ago, stray cat said: Wow! Now this is different! You must have had to get out the protractor, the slide rule and abacus to come up with the geometric alignments. But the colors! The colors work so well here in sympathy with one another, repeating to form a kaleidoscope of mathematical ingenuity. Red slicing bold diagonals, yellow describing a bold and stable center, the muted greens and pastels shoring up the strength and sense of solidity. and speaking of solidity, it's only then that we realize and recognize and tip our hat that this is all hard surfaces (sorry! PICTURES of hard surfaces!), repurposed and appropriated in the service of art. Thanks, Phil, for your perspective on this \"repurposed\" piece, taking a pedestrian shot and jigsawing it into a Bauhaus-like lattice work. After I finished it, I put it on the shelf for weeks to see if it would jerk to life a tad when I came back to it. I appreciate that you found something in it. Here's another one I nudged around a bit for fun. It might work for Pringle argyles? Sidestep II M-A APO 50 ADOX Color Implosion --img-- ", "link": "https://www.l-camera-forum.com/topic/290225-diptychs-triptychs-and-polytychs-open-thread/page/16/?tab=comments#comment-3970739", "origin": "L-forum", "suborigin": "290225-diptychs-triptychs-and-polytychs-open-thread", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "14 hours ago, stray cat said: wow! now this is different! you must have had to get out the protractor, the slide rule and abacus to -----> come !!!  -----> up !!!  -----> with !!!  the geometric alignments. but the colors! the colors work so well here in sympathy with one another, repeating to form a kaleidoscope of mathematical ingenuity. red slicing bold diagonals, yellow describing a bold and stable center, the muted greens and pastels shoring up the strength and sense of solidity. and speaking of solidity, it's only then that we realize and recognize and tip our hat that this is all hard surfaces (sorry! pictures of hard surfaces!), repurposed and appropriated in the service of art. thanks, phil, for your perspective on this \"repurposed\" piece, taking a pedestrian shot and jigsawing it into a bauhaus-like lattice work. after i finished it, i put it on the shelf for weeks to see if it would jerk to life a tad when i came back to it. i appreciate that you found something in it. here's another one i nudged around a bit for fun. it might work for pringle argyles? sidestep ii m-a apo 50 adox color implosion --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 64067, "year": "2020"}, {"autor": "setuporg", "date": "2020-12-26 20:10:00", "content": " ... is that you get used to it. I shoot M, Q2, SL2, and S007 systems, and now recognize the \"Leica look\" as desirable -- a good photo has it. The flip side is that I see photographs taken with other systems and immediately recognize them as lacking -- the skies are flat, the foliage is either to kitschy or not rich enough, the blur is either not there at all or kinda sad. What's interesting is that such clearly flat, uninteresting photos are accompanying for instance travel writing in the New York Times online. Perhaps they are not optimizing their images for the web? National Geographic is beyond reproach here, they really do stellar work. The most organic and immediate Leica look I see OOC is with the S system, where every shot separates the subject as only the 50 APO does on the M, or the Summicrons do on the SL. But you learn to appreciate, recognize and expect the Leica look across all Leicas. This notably comes up with the X1D system. Although it is wonderful, I immediately notice the lack of the Leica look OOC. OTOH, folks like @Vieri say it is superior for landscape. Vieri shot with the S system and reviewed SL 16-35 before going all in with the X1D and XCD lenses. He can achieve fantastic results in post. I wonder whether the Leica look is our shared set of values, or a niche / camp hobby? Is it something that helps us differentiate or narrows our view? Moderators: I could have placed this in any of the systems in hand, notably S, but it has the least readership, so putting it where the most \"Leica look\" is made. Feel free to relocate if needed, but I assume the M photographers are the main keepers of the æsthetics, and the oldest, from the M3 on. In my view, the Leica look was created there and the Q/L/S systems simply expand on it and emphasize it, taking it to the new levels. Edited December 26, 2020 by setuporg", "link": "https://www.l-camera-forum.com/topic/316440-the-main-problem-of-the-leica-look/?tab=comments#comment-4106265", "origin": "L-forum", "suborigin": "316440-the-main-problem-of-the-leica-look", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": " ... is that you get used to it. i shoot m, q2, sl2, and s007 systems, and now recognize the \"leica look\" as desirable -- a good photo has it. the flip side is that i see photographs taken with other systems and immediately recognize them as lacking -- the skies are flat, the foliage is either to kitschy or not rich enough, the blur is either not there at all or kinda sad. what's interesting is that such clearly flat, uninteresting photos are accompanying for instance travel writing in the new york times online. perhaps they are not optimizing their images for the web? national geographic is beyond reproach here, they really do stellar work. the most organic and immediate leica look i see ooc is with the s system, where every shot separates the subject as only the 50 apo does on the m, or the summicrons do on the sl. but you learn to appreciate, recognize and expect the leica look across all leicas. this notably -----> comes !!!  -----> up !!!  -----> with !!!  the x1d system. although it is wonderful, i immediately notice the lack of the leica look ooc. otoh, folks like @vieri say it is superior for landscape. vieri shot with the s system and reviewed sl 16-35 before going all in with the x1d and xcd lenses. he can achieve fantastic results in post. i wonder whether the leica look is our shared set of values, or a niche / camp hobby? is it something that helps us differentiate or narrows our view? moderators: i could have placed this in any of the systems in hand, notably s, but it has the least readership, so putting it where the most \"leica look\" is made. feel free to relocate if needed, but i assume the m photographers are the main keepers of the æsthetics, and the oldest, from the m3 on. in my view, the leica look was created there and the q/l/s systems simply expand on it and emphasize it, taking it to the new levels. edited december 26, 2020 by setuporg", "sortedWord": "None", "Identifyer": null, "identifyer": 81669, "year": "2020"}, {"autor": "Chaemono", "date": "2020-12-26 20:55:00", "content": "vor 44 Minuten schrieb setuporg: ... ...The most organic and immediate Leica look I see OOC is with the S system, where every shot separates the subject as only the 50 APO does on the M, or the Summicrons do on the SL. But you learn to appreciate, recognize and expect the Leica look across all Leicas. ... How about Zeiss lenses? They have the Zeiss 3D-Pop. That comes close to the Leica look. vor 44 Minuten schrieb setuporg: ...This notably comes up with the X1D system. Although it is wonderful, I immediately notice the lack of the Leica look OOC.... I agree. X1D files require extensive post-processing skills to get the Leica look. It comes with the territory as they say. Build MF for the palm of one’s hand and be ready to do a lot more work in post. vor 44 Minuten schrieb setuporg: ... I wonder whether the Leica look is our shared set of values, or a niche / camp hobby? Is it something that helps us differentiate or narrows our view? ... The Leica look also connotes solidarity in times of crisis. There’s a whole thread on COVID-19 for this reason in Barnack’s bar. vor 44 Minuten schrieb setuporg: ... Moderators: I could have placed this in any of the systems in hand, notably S, but it has the least readership, so putting it where the most \"Leica look\" is made. Feel free to relocate if needed, but I assume the M photographers are the main keepers of the æsthetics, and the oldest, from the M3 on. In my view, the Leica look was created there and the Q/L/S systems simply expand on it and emphasize it, taking it to the new levels. Personally, I think it’s perfect right here. The Q/L/S systems are capable of the Leica look 2.0., IMO.", "link": "https://www.l-camera-forum.com/topic/316440-the-main-problem-of-the-leica-look/?tab=comments#comment-4106284", "origin": "L-forum", "suborigin": "316440-the-main-problem-of-the-leica-look", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "vor 44 minuten schrieb setuporg: ... ...the most organic and immediate leica look i see ooc is with the s system, where every shot separates the subject as only the 50 apo does on the m, or the summicrons do on the sl. but you learn to appreciate, recognize and expect the leica look across all leicas. ... how about zeiss lenses? they have the zeiss 3d-pop. that comes close to the leica look. vor 44 minuten schrieb setuporg: ...this notably -----> comes !!!  -----> up !!!  -----> with !!!  the x1d system. although it is wonderful, i immediately notice the lack of the leica look ooc.... i agree. x1d files require extensive post-processing skills to get the leica look. it comes with the territory as they say. build mf for the palm of one’s hand and be ready to do a lot more work in post. vor 44 minuten schrieb setuporg: ... i wonder whether the leica look is our shared set of values, or a niche / camp hobby? is it something that helps us differentiate or narrows our view? ... the leica look also connotes solidarity in times of crisis. there’s a whole thread on covid-19 for this reason in barnack’s bar. vor 44 minuten schrieb setuporg: ... moderators: i could have placed this in any of the systems in hand, notably s, but it has the least readership, so putting it where the most \"leica look\" is made. feel free to relocate if needed, but i assume the m photographers are the main keepers of the æsthetics, and the oldest, from the m3 on. in my view, the leica look was created there and the q/l/s systems simply expand on it and emphasize it, taking it to the new levels. personally, i think it’s perfect right here. the q/l/s systems are capable of the leica look 2.0., imo.", "sortedWord": "None", "Identifyer": null, "identifyer": 81671, "year": "2020"}, {"autor": "250swb", "date": "2020-12-28 08:27:00", "content": "8 hours ago, LBJ2 said: This is one of the best examples of the \"Leica Look\" on the internet. *\"This image was taken with modern glass, the Leica Summilux 50 mm f/1.4 Asph, on the Leica M9\" by Ashwin Rao --img--  https://www.stevehuffphoto.com/2010/10/11/the-leica-look-comments-thoughts-by-ashwin-rao/ It is the sort of photo taken with a Leica M that's for sure. And it is true that photographing what appears to be the back of somebody's head does happen when using a rangefinder. And 'people doing stuff', like walking around or making a pancake is typical of the genre, as is accepting a scene per se and not moving in to crop out the irritating highlights all around the woman. So perhaps it is typical of the 'Leica look', but the best example you could come up with, I hope not?", "link": "https://www.l-camera-forum.com/topic/316440-the-main-problem-of-the-leica-look/page/2/?tab=comments#comment-4107086", "origin": "L-forum", "suborigin": "316440-the-main-problem-of-the-leica-look", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "8 hours ago, lbj2 said: this is one of the best examples of the \"leica look\" on the internet. *\"this image was taken with modern glass, the leica summilux 50 mm f/1.4 asph, on the leica m9\" by ashwin rao --img--  https://www.stevehuffphoto.com/2010/10/11/the-leica-look-comments-thoughts-by-ashwin-rao/ it is the sort of photo taken with a leica m that's for sure. and it is true that photographing what appears to be the back of somebody's head does happen when using a rangefinder. and 'people doing stuff', like walking around or making a pancake is typical of the genre, as is accepting a scene per se and not moving in to crop out the irritating highlights all around the woman. so perhaps it is typical of the 'leica look', but the best example you could -----> come !!!  -----> up !!!  -----> with !!! , i hope not?", "sortedWord": "None", "Identifyer": null, "identifyer": 81698, "year": "2020"}, {"autor": "Chaemono", "date": "2020-12-28 10:17:00", "content": "vor einer Stunde schrieb P1505: If you stick Leica glass on a Nikon film body do you still get this Leica look or is it muddled? Yep, Z7 with 75 Noctilux, for example. vor 1 Stunde schrieb 250swb: ...So perhaps it is typical of the 'Leica look', but the best example you could come up with, I hope not? Don’t forget the organic noise.", "link": "https://www.l-camera-forum.com/topic/316440-the-main-problem-of-the-leica-look/page/2/?tab=comments#comment-4107131", "origin": "L-forum", "suborigin": "316440-the-main-problem-of-the-leica-look", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "vor einer stunde schrieb p1505: if you stick leica glass on a nikon film body do you still get this leica look or is it muddled? yep, z7 with 75 noctilux, for example. vor 1 stunde schrieb 250swb: ...so perhaps it is typical of the 'leica look', but the best example you could -----> come !!!  -----> up !!!  -----> with !!! , i hope not? don’t forget the organic noise.", "sortedWord": "None", "Identifyer": null, "identifyer": 81702, "year": "2020"}, {"autor": "LBJ2", "date": "2020-12-28 12:27:00", "content": "3 hours ago, 250swb said: It is the sort of photo taken with a Leica M that's for sure. And it is true that photographing what appears to be the back of somebody's head does happen when using a rangefinder. And 'people doing stuff', like walking around or making a pancake is typical of the genre, as is accepting a scene per se and not moving in to crop out the irritating highlights all around the woman. So perhaps it is typical of the 'Leica look', but the best example you could come up with, I hope not? You are of course encouraged to post examples of the \"Leica look\"", "link": "https://www.l-camera-forum.com/topic/316440-the-main-problem-of-the-leica-look/page/2/?tab=comments#comment-4107187", "origin": "L-forum", "suborigin": "316440-the-main-problem-of-the-leica-look", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "3 hours ago, 250swb said: it is the sort of photo taken with a leica m that's for sure. and it is true that photographing what appears to be the back of somebody's head does happen when using a rangefinder. and 'people doing stuff', like walking around or making a pancake is typical of the genre, as is accepting a scene per se and not moving in to crop out the irritating highlights all around the woman. so perhaps it is typical of the 'leica look', but the best example you could -----> come !!!  -----> up !!!  -----> with !!! , i hope not? you are of course encouraged to post examples of the \"leica look\"", "sortedWord": "None", "Identifyer": null, "identifyer": 81705, "year": "2020"}, {"autor": "ChrisL", "date": "2020-08-11 02:24:00", "content": "I think this is my problem as well - indecision. Film (R8) or digital (SL2)? Prime or zoom? AF or MF? Multiple lenses or one lens? I'm trying to come up with a one camera one lens light weight semi-compact solution for EDC knowing I have everything else in reserve when I need it. It never ends! 🤣 Edited August 11, 2020 by ChrisL", "link": "https://www.l-camera-forum.com/topic/312184-what-is-your-every-day-carry-edc/?tab=comments#comment-4025062", "origin": "L-forum", "suborigin": "312184-what-is-your-every-day-carry-edc", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i think this is my problem as well - indecision. film (r8) or digital (sl2)? prime or zoom? af or mf? multiple lenses or one lens? i'm trying to -----> come !!!  -----> up !!!  -----> with !!!  a one camera one lens light weight semi-compact solution for edc knowing i have everything else in reserve when i need it. it never ends! 🤣 edited august 11, 2020 by chrisl", "sortedWord": "None", "Identifyer": null, "identifyer": 81849, "year": "2020"}, {"autor": "vedivv", "date": "2020-07-07 18:55:00", "content": "7 hours ago, jaapv said: Tesla is a completely different product from conventional cars - no other car maker had long-term experience either. That is not a valid comparison. The Leica CL is notorious for inaccuracy with anything but its own lenses and Leica said so from the start. And full-frame on film. Unfortunately, if we use this Tesla analogy, PIXII is destined to fail, because PIXII picked wrong product features. Combustion engines are way more complicated to make than electric motors. That is why China (or Tesla) are coming up with scores of EV companies, while all their domestic car companies make terrible cars. Tesla was really smart to leap frog conventional car companies in a new product category. That being said, the battery systems in early Tesla were truly industry leading, with optical network controlling hundreds of laptop batteries. And on top of that, Tesla outsourced car design to Lotus, a conventional automaker with a lot of experiences. In a way, Tesla moved from analog to digital to leapfrog conventional auto companies. PIXII would be doing the same if it is purely electronic: no OVF, no mechanical shutter, connected. But that is not the case. PIXII uses OVF, which is not easy to make and calibrate. I had problem with Leica FF OVFs that required factory calibration multiple times with various lenses. I suspect OVF is a big part of cost, both R&D and manufacturing, for PIXII. Perhaps a more adapt analog using Tesla would be a combustion engine Tesla model competing with a luxury car company. In this case, PIXII seems more like a DeLorean than Tesla. That being said, I hope PIXII to be successful. I suspect the high cost is associated with the initial design and small production. Hopefully there are enough buyers to allow the company to scale the operation and reduce the price in the future.", "link": "https://www.l-camera-forum.com/topic/311132-pixii-a-new-m-mount-rangefinder/page/7/?tab=comments#comment-4005443", "origin": "L-forum", "suborigin": "311132-pixii-a-new-m-mount-rangefinder", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "7 hours ago, jaapv said: tesla is a completely different product from conventional cars - no other car maker had long-term experience either. that is not a valid comparison. the leica cl is notorious for inaccuracy with anything but its own lenses and leica said so from the start. and full-frame on film. unfortunately, if we use this tesla analogy, pixii is destined to fail, because pixii picked wrong product features. combustion engines are way more complicated to make than electric motors. that is why china (or tesla) are -----> coming !!!  -----> up !!!  -----> with !!!  scores of ev companies, while all their domestic car companies make terrible cars. tesla was really smart to leap frog conventional car companies in a new product category. that being said, the battery systems in early tesla were truly industry leading, with optical network controlling hundreds of laptop batteries. and on top of that, tesla outsourced car design to lotus, a conventional automaker with a lot of experiences. in a way, tesla moved from analog to digital to leapfrog conventional auto companies. pixii would be doing the same if it is purely electronic: no ovf, no mechanical shutter, connected. but that is not the case. pixii uses ovf, which is not easy to make and calibrate. i had problem with leica ff ovfs that required factory calibration multiple times with various lenses. i suspect ovf is a big part of cost, both r&d and manufacturing, for pixii. perhaps a more adapt analog using tesla would be a combustion engine tesla model competing with a luxury car company. in this case, pixii seems more like a delorean than tesla. that being said, i hope pixii to be successful. i suspect the high cost is associated with the initial design and small production. hopefully there are enough buyers to allow the company to scale the operation and reduce the price in the future.", "sortedWord": "None", "Identifyer": null, "identifyer": 82680, "year": "2020"}, {"autor": "250swb", "date": "2020-04-01 11:25:00", "content": "I already have the black paint Leica stick, but I'm hoping Leica come up with a version for stirring white paint as well.", "link": "https://www.l-camera-forum.com/topic/308060-leica-selfie-stick-type-0104/?tab=comments#comment-3944156", "origin": "L-forum", "suborigin": "308060-leica-selfie-stick-type-0104", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i already have the black paint leica stick, but i'm hoping leica -----> come !!!  -----> up !!!  -----> with !!!  a version for stirring white paint as well.", "sortedWord": "None", "Identifyer": null, "identifyer": 88217, "year": "2020"}, {"autor": "willeica", "date": "2020-08-28 22:43:00", "content": "I have been using digital cameras since 2004 and I have never consulted a histogram, even though I know it is there and what it shows. I am perfectly satisfied with the exposure of my photographs and so are others who have seen them. My main technique is to meter from the area where the light represents the middle of the range that I want and then compensate according to the conditions and what I want to achieve. Most times I do this quickly without thinking and I rarely have to bracket with digital. I am more inclined to bracket with film which I have returned to increasingly in recent years. I accept that others may find using a histogram useful, of course. My resistance may have something to do with my wanting to control the camera rather than the camera controlling me and my photographic decisions. Most required adjustments can be made in post processing and I can see the histogram changing, but that means nothing to me as I use the image that I can see on the screen and I also use selected area tools for adjustments. For pretty much the same reason I don't use presets and I adjust my usual flow slightly for each image. If I were a professional I would probably use presets in order to handle much increased volumes, of course. I am also very much used to using a camera with no meter for which I often use a hand held meter. I have a friend (Paul pgk also knows him) who has been a professional photographer for 61 years. Recently I was using a camera without a meter and I asked him what exposure did he think I was going to use (having consulted a handheld meter myself) for a roll of 100 ISO black and white film I had in the camera. The number he came up with without consulting a meter was within half a stop of what I had set on the camera. He is widely admired around the world for his advertising photography and he is an absolute genius with studio lighting. In fact the well known photographer Terence Donovan declared him to be a genius many years ago. He switched some years ago to digital cameras for his renowned advertising work, but he never ever uses RAW. He shoots everything in JPEG and what he produces is as close to perfection as you will ever see. William", "link": "https://www.l-camera-forum.com/topic/312751-ettr-when-and-why/page/2/?tab=comments#comment-4035367", "origin": "L-forum", "suborigin": "312751-ettr-when-and-why", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i have been using digital cameras since 2004 and i have never consulted a histogram, even though i know it is there and what it shows. i am perfectly satisfied with the exposure of my photographs and so are others who have seen them. my main technique is to meter from the area where the light represents the middle of the range that i want and then compensate according to the conditions and what i want to achieve. most times i do this quickly without thinking and i rarely have to bracket with digital. i am more inclined to bracket with film which i have returned to increasingly in recent years. i accept that others may find using a histogram useful, of course. my resistance may have something to do with my wanting to control the camera rather than the camera controlling me and my photographic decisions. most required adjustments can be made in post processing and i can see the histogram changing, but that means nothing to me as i use the image that i can see on the screen and i also use selected area tools for adjustments. for pretty much the same reason i don't use presets and i adjust my usual flow slightly for each image. if i were a professional i would probably use presets in order to handle much increased volumes, of course. i am also very much used to using a camera with no meter for which i often use a hand held meter. i have a friend (paul pgk also knows him) who has been a professional photographer for 61 years. recently i was using a camera without a meter and i asked him what exposure did he think i was going to use (having consulted a handheld meter myself) for a roll of 100 iso black and white film i had in the camera. the number he -----> came !!!  -----> up !!!  -----> with !!!  without consulting a meter was within half a stop of what i had set on the camera. he is widely admired around the world for his advertising photography and he is an absolute genius with studio lighting. in fact the well known photographer terence donovan declared him to be a genius many years ago. he switched some years ago to digital cameras for his renowned advertising work, but he never ever uses raw. he shoots everything in jpeg and what he produces is as close to perfection as you will ever see. william", "sortedWord": "None", "Identifyer": null, "identifyer": 90529, "year": "2020"}, {"autor": "jaapv", "date": "2020-09-01 08:29:00", "content": "On 8/29/2020 at 12:43 AM, willeica said: I have been using digital cameras since 2004 and I have never consulted a histogram, even though I know it is there and what it shows. I am perfectly satisfied with the exposure of my photographs and so are others who have seen them. My main technique is to meter from the area where the light represents the middle of the range that I want and then compensate according to the conditions and what I want to achieve. Most times I do this quickly without thinking and I rarely have to bracket with digital. I am more inclined to bracket with film which I have returned to increasingly in recent years. I accept that others may find using a histogram useful, of course. My resistance may have something to do with my wanting to control the camera rather than the camera controlling me and my photographic decisions. Most required adjustments can be made in post processing and I can see the histogram changing, but that means nothing to me as I use the image that I can see on the screen and I also use selected area tools for adjustments. For pretty much the same reason I don't use presets and I adjust my usual flow slightly for each image. If I were a professional I would probably use presets in order to handle much increased volumes, of course. I am also very much used to using a camera with no meter for which I often use a hand held meter. I have a friend (Paul pgk also knows him) who has been a professional photographer for 61 years. Recently I was using a camera without a meter and I asked him what exposure did he think I was going to use (having consulted a handheld meter myself) for a roll of 100 ISO black and white film I had in the camera. The number he came up with without consulting a meter was within half a stop of what I had set on the camera. He is widely admired around the world for his advertising photography and he is an absolute genius with studio lighting. In fact the well known photographer Terence Donovan declared him to be a genius many years ago. He switched some years ago to digital cameras for his renowned advertising work, but he never ever uses RAW. He shoots everything in JPEG and what he produces is as close to perfection as you will ever see. William I find this a bit hard to follow, William. How can a camera - or postprocessing program- control me through a histogram? It is just an informative readout of the exposure, nothing different from any kind of exposure meter, but providing more data for the photographer to use than just a needle and scale. It is in no way related to presets.", "link": "https://www.l-camera-forum.com/topic/312751-ettr-when-and-why/page/2/?tab=comments#comment-4037396", "origin": "L-forum", "suborigin": "312751-ettr-when-and-why", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "on 8/29/2020 at 12:43 am, willeica said: i have been using digital cameras since 2004 and i have never consulted a histogram, even though i know it is there and what it shows. i am perfectly satisfied with the exposure of my photographs and so are others who have seen them. my main technique is to meter from the area where the light represents the middle of the range that i want and then compensate according to the conditions and what i want to achieve. most times i do this quickly without thinking and i rarely have to bracket with digital. i am more inclined to bracket with film which i have returned to increasingly in recent years. i accept that others may find using a histogram useful, of course. my resistance may have something to do with my wanting to control the camera rather than the camera controlling me and my photographic decisions. most required adjustments can be made in post processing and i can see the histogram changing, but that means nothing to me as i use the image that i can see on the screen and i also use selected area tools for adjustments. for pretty much the same reason i don't use presets and i adjust my usual flow slightly for each image. if i were a professional i would probably use presets in order to handle much increased volumes, of course. i am also very much used to using a camera with no meter for which i often use a hand held meter. i have a friend (paul pgk also knows him) who has been a professional photographer for 61 years. recently i was using a camera without a meter and i asked him what exposure did he think i was going to use (having consulted a handheld meter myself) for a roll of 100 iso black and white film i had in the camera. the number he -----> came !!!  -----> up !!!  -----> with !!!  without consulting a meter was within half a stop of what i had set on the camera. he is widely admired around the world for his advertising photography and he is an absolute genius with studio lighting. in fact the well known photographer terence donovan declared him to be a genius many years ago. he switched some years ago to digital cameras for his renowned advertising work, but he never ever uses raw. he shoots everything in jpeg and what he produces is as close to perfection as you will ever see. william i find this a bit hard to follow, william. how can a camera - or postprocessing program- control me through a histogram? it is just an informative readout of the exposure, nothing different from any kind of exposure meter, but providing more data for the photographer to use than just a needle and scale. it is in no way related to presets.", "sortedWord": "None", "Identifyer": null, "identifyer": 90531, "year": "2020"}, {"autor": "emilkarl", "date": "2020-11-20 15:56:00", "content": " I have this weird issue that I've only seen on HP5+ pushed to 800 and trying to figure out what the problem is. Some say it could be development and some people have said light leaks on the camera. Im a bit confused. Light leak would probably show on all films right? Film: Ilford HP5+ pushed to 800. Used HC-110 at dilution B (1:31) for 10 minutes. 300ml in a Patersson 2 reel tank with 1 reel in the bottom. Agitated for the first 30 seconds then 12-15 seconds every minute starting at 1:00, 3 invertions Stop for 30 seconds Fix for 3:30. Negs come out with lines that I figure can be bromide drag but I'm unsure. The process is the same as I usually do without this effect but I have come up with this effect a couple of times now and not sure what the reason can be. I usually don't get it with Tri-x 400. Photos have been shot outside in quite moist weather if that has any effect on it? Shooting with Leica M6 and Voigtländer lens. Here is some pictures of the negatives + scans. --img-- --img-- --img-- --img-- --img-- --img-- --img--  Here is some pictures on the actual camera, if that is of any help. --img-- --img-- [/url--img--  Edited November 20, 2020 by emilkarl More info", "link": "https://www.l-camera-forum.com/topic/315359-m6-light-leak-or-bromide-drag/?tab=comments#comment-4083945", "origin": "L-forum", "suborigin": "315359-m6-light-leak-or-bromide-drag", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " i have this weird issue that i've only seen on hp5+ pushed to 800 and trying to figure out what the problem is. some say it could be development and some people have said light leaks on the camera. im a bit confused. light leak would probably show on all films right? film: ilford hp5+ pushed to 800. used hc-110 at dilution b (1:31) for 10 minutes. 300ml in a patersson 2 reel tank with 1 reel in the bottom. agitated for the first 30 seconds then 12-15 seconds every minute starting at 1:00, 3 invertions stop for 30 seconds fix for 3:30. negs come out with lines that i figure can be bromide drag but i'm unsure. the process is the same as i usually do without this effect but i have -----> come !!!  -----> up !!!  -----> with !!!  this effect a couple of times now and not sure what the reason can be. i usually don't get it with tri-x 400. photos have been shot outside in quite moist weather if that has any effect on it? shooting with leica m6 and voigtländer lens. here is some pictures of the negatives + scans. --img-- --img-- --img-- --img-- --img-- --img-- --img--  here is some pictures on the actual camera, if that is of any help. --img-- --img-- [/url--img--  edited november 20, 2020 by emilkarl more info", "sortedWord": "None", "Identifyer": null, "identifyer": 100151, "year": "2020"}, {"autor": "philipus", "date": "2020-12-27 20:25:00", "content": "Hoi Jaqueline I'm sorry I missed your message. I have recently bought Canon's own inks because I was very dissatisfied with the results with the inks from 123inkt.nl. They are generally fine for non-critical results, but there is a bit of solarisation on the prints plus the colours are not as accurate as the Canon inks. I did consider inks from Precision Color (https://precisioncolors.com/Pro1000.html) but they are quite frank in saying that they have not been able to reproduce the blue, yellow and red inks and the chroma optimiser. As tempting as it may feel to get a lot more ink for a lot less, for me (I hasten to add), it is not worth it in the long run. So over the last several weeks I've been doing my best to empty the printer by printing and printing and printing and printing. I say that because even though the printer says that the inks are empty, and has said so for a long while, they are not. It has to do, I believe, with the fact that the printer uses internal tanks into which the ink is pushed from the cartridges and this reserve will also need to be emptied. Once the printer is as empty as it can be I will install the Canon inks. Unless Precision or another non-OEM ink maker comes up with proper replacements for all cartridges I will stick with with Canon's. Best Philip On 12/25/2020 at 3:34 PM, Jacqueline de Groot said: Hi Philip, also based in the Netherlands and owner of a Pro-1000 I would like to know your experience on using 123Ink in this machine. Thanks in advance for your reply! jacqueline", "link": "https://www.l-camera-forum.com/topic/303123-cursing-in-church-3rd-party-ink-cartridges-for-the-canon-pro-1000/?tab=comments#comment-4106839", "origin": "L-forum", "suborigin": "303123-cursing-in-church-3rd-party-ink-cartridges-for-the-canon-pro-1000", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "hoi jaqueline i'm sorry i missed your message. i have recently bought canon's own inks because i was very dissatisfied with the results with the inks from 123inkt.nl. they are generally fine for non-critical results, but there is a bit of solarisation on the prints plus the colours are not as accurate as the canon inks. i did consider inks from precision color (https://precisioncolors.com/pro1000.html) but they are quite frank in saying that they have not been able to reproduce the blue, yellow and red inks and the chroma optimiser. as tempting as it may feel to get a lot more ink for a lot less, for me (i hasten to add), it is not worth it in the long run. so over the last several weeks i've been doing my best to empty the printer by printing and printing and printing and printing. i say that because even though the printer says that the inks are empty, and has said so for a long while, they are not. it has to do, i believe, with the fact that the printer uses internal tanks into which the ink is pushed from the cartridges and this reserve will also need to be emptied. once the printer is as empty as it can be i will install the canon inks. unless precision or another non-oem ink maker -----> comes !!!  -----> up !!!  -----> with !!!  proper replacements for all cartridges i will stick -----> with !!!  -----> with !!!  canon's. best philip on 12/25/2020 at 3:34 pm, jacqueline de groot said: hi philip, also based in the netherlands and owner of a pro-1000 i would like to know your experience on using 123ink in this machine. thanks in advance for your reply! jacqueline", "sortedWord": "None", "Identifyer": null, "identifyer": 109821, "year": "2020"}, {"autor": "pippy", "date": "2020-11-23 20:43:00", "content": "Funnily enough I was hoping to find dozens of helpful replies and recommendations as I've just had a one-off photo book published and it was very much a case of the Curate's Egg; \"Really! - er - Some parts of it are very good!\"... Mine was a Blurb project and, on the whole, it is an impressive-looking volume; circa 120 pages, 13\" x 11\" hard-back with dust-jacket and printed with all the top options available selected. There are, however, two very distinct and very noticeable, fatal flaws. The first is that despite 95% of the photographs (one per page) being rendered as pure monochrome files (the others were duotone / tri-tone / quad-tone) the 4-colour process used for the book has resulted in a gently and randomly variegated tri-tone effect where ALL black and white images are seen, in different areas, in different - quite subtle - tints and tones of magenta, cyan and black. The effect isn't wholly unpleasant - in some cases it adds a....well; shall we say different?...character to the image as originally imagined. NOT what was asked nor expected, though, and I'd rather my b'n'w images were printed B'n'W thank you very much. The second is altogether more weird and far harder to describe but I'll give it a go; on certain areas of a number of images there is a shadow - a 'ghost' - of another image sort-of superimposed on the first. Think about it like this; You are in a darkroom making a traditional wet-print. You expose your sheet of paper in a printing-frame at the base of an enlarger normally with the image captured in negative #1. Then, before you develop the paper, you put the exposed in another printing-frame at another enlarger and give it perhaps 2% exposure-time with image/negative #2. You then dev/stop/fix/wash/dry print and find the very slight double-exposure from the second neg all-but-invisible but, at the same time, THERE all the same. I've been trying to work out how this situation could possibly arise. All I can come up with off the top of my head is that somehow there is a situation arising where a printed page stacked on top of another printed page under a strong light-source is acting as a 'negative' and the paper directly underneath is behaving in some weird sort-of 'printing-out-paper' manner. Just to be absolutely clear; the 'ghost' image is never reversed so there isn't any issue with possible face-to-face (paper) ink print-off situation happening. The 'ghost' image is always seen as a negative in that light is dark and dark is light. The two images concerned are almost always either next to each other in the page-numbering sequence or, at most, one more page apart. HAVING SAID ALL THAT; the book itself is quite impressive and the feeling is of a high-quality product. I will be having further copies printed once my collating / layout / text ideas have been finalised but before entrusting the project to Blurb I will be sending them such feedback as mentioned here and, depending on what they say, either go with them or else take it somewhere else. In the meantime I will wait to see whether anyone else has a suggestion as to who might be a better option in the first place. Philip. Edited November 23, 2020 by pippy", "link": "https://www.l-camera-forum.com/topic/315199-photo-book-service/?tab=comments#comment-4086000", "origin": "L-forum", "suborigin": "315199-photo-book-service", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "funnily enough i was hoping to find dozens of helpful replies and recommendations as i've just had a one-off photo book published and it was very much a case of the curate's egg; \"really! - er - some parts of it are very good!\"... mine was a blurb project and, on the whole, it is an impressive-looking volume; circa 120 pages, 13\" x 11\" hard-back with dust-jacket and printed with all the top options available selected. there are, however, two very distinct and very noticeable, fatal flaws. the first is that despite 95% of the photographs (one per page) being rendered as pure monochrome files (the others were duotone / tri-tone / quad-tone) the 4-colour process used for the book has resulted in a gently and randomly variegated tri-tone effect where all black and white images are seen, in different areas, in different - quite subtle - tints and tones of magenta, cyan and black. the effect isn't wholly unpleasant - in some cases it adds a....well; shall we say different?...character to the image as originally imagined. not what was asked nor expected, though, and i'd rather my b'n'w images were printed b'n'w thank you very much. the second is altogether more weird and far harder to describe but i'll give it a go; on certain areas of a number of images there is a shadow - a 'ghost' - of another image sort-of superimposed on the first. think about it like this; you are in a darkroom making a traditional wet-print. you expose your sheet of paper in a printing-frame at the base of an enlarger normally with the image captured in negative #1. then, before you develop the paper, you put the exposed in another printing-frame at another enlarger and give it perhaps 2% exposure-time with image/negative #2. you then dev/stop/fix/wash/dry print and find the very slight double-exposure from the second neg all-but-invisible but, at the same time, there all the same. i've been trying to work out how this situation could possibly arise. all i can -----> come !!!  -----> up !!!  -----> with !!!  off the top of my head is that somehow there is a situation arising where a printed page stacked on top of another printed page under a strong light-source is acting as a 'negative' and the paper directly underneath is behaving in some weird sort-of 'printing-out-paper' manner. just to be absolutely clear; the 'ghost' image is never reversed so there isn't any issue with possible face-to-face (paper) ink print-off situation happening. the 'ghost' image is always seen as a negative in that light is dark and dark is light. the two images concerned are almost always either next to each other in the page-numbering sequence or, at most, one more page apart. having said all that; the book itself is quite impressive and the feeling is of a high-quality product. i will be having further copies printed once my collating / layout / text ideas have been finalised but before entrusting the project to blurb i will be sending them such feedback as mentioned here and, depending on what they say, either go with them or else take it somewhere else. in the meantime i will wait to see whether anyone else has a suggestion as to who might be a better option in the first place. philip. edited november 23, 2020 by pippy", "sortedWord": "None", "Identifyer": null, "identifyer": 109949, "year": "2020"}, {"autor": "John Robinson", "date": "2020-09-30 08:59:00", "content": "The monitor is the trickiest one to get right in my experience. I have a monitor that has a hardware setting for sRGB and I find this very accurate. I don't change the setting when the room lighting changes. But the monitor is unusual as it is a flat CRT, originally supplied with a high-end unix workstation. The iMac screen has a calibration tool in \"settings\" and to view images I set brightness for 100% but if I did not have the CRT monitor I would likely look into profiling the screen with a hardware dongle. I would not adjust the monitor according the image I am viewing as the monitor is the reference. I can't really comment on settings in the current version of Lightroom as I only have the \"perpetual license\" version which is quite good for cataloguing and searching for images but for raw processing I much prefer Capture One. As mentioned elsewhere, it can be useful to do \"Auto Adjust\" (\"auto-tone\" in LR) to see what the software comes up with and this might give a starting point, otherwise reset to original and work from there. A quick web search reveals a number of sites where the C1 workflow is described (often in contrast with LR) so there is more than one way to approach it. \"Less is more\" is a very useful rule of thumb. Viewing the result of adjustments on a well-calibrated monitor while paying close attention to the histogram is essential. Unless you are looking for a special effect, the aim is for the histogram to extend across the full range from black to white with a solid middle (where much of the detail is found). C1 does not distinguish between \"library\" and develop, using tabs to choose each option. LR obviously needs to be in \"develop\" mode to do processing other than the \"quick develop\" in library mode. As I said in the original post, the most important thing is to come up with a workflow that is consistent, reliable and repeatable. Many tools interact with each other so getting them into the right order is also important. My workflow in C1 goes like this (work through the same sequence each time): - Styles and Presets (the develop menu in LR has something similar) if there is something you prepared earlier - Lens module - Color module - Exposure module (this is the module where the most dramatic adjustments are made and care needs to be take not to \"over do\" it) -- start with \"exposure\" to get a good histogram -- I find \"highlight\", \"shadow\", \"white\" and \"black\" much more useful than \"brightness\" and \"contrast\" C1 has a \"details\" module where sharpening, noise reduction film grain, spot removal are found, not sure about the LR equivalents -- sharpening and noise reduction best left at zero unless there is something about the original raw file (eg exposed at high ISO) that needs work -- modern cameras with little or no anti-aliasing filters on the sensor don't need sharpening in my experience and film scans can become very grainy if sharpening (as opposed to clarity) is over-used -- spot removal can be very useful if there was dust on the sensor or spots on a film scan -- \"clarity\" in my experience works much better than \"sharpening\" - Output (in C1) - LR uses \"export\" This is the place to decide whether to produce a TIFF file (e.g. for use in another program such as Photoshop or DxO Nik Collection) or a JPEG (for web, e-mail etc). - Print -- the most important thing here is to have good color management as \"managed by printer\" is rarely sufficient hence a bespoke profile for your combination of printer, paper, ink", "link": "https://www.l-camera-forum.com/topic/313699-how-professionals-avoid-over-do-on-editing/page/2/?tab=comments#comment-4054699", "origin": "L-forum", "suborigin": "313699-how-professionals-avoid-over-do-on-editing", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "the monitor is the trickiest one to get right in my experience. i have a monitor that has a hardware setting for srgb and i find this very accurate. i don't change the setting when the room lighting changes. but the monitor is unusual as it is a flat crt, originally supplied with a high-end unix workstation. the imac screen has a calibration tool in \"settings\" and to view images i set brightness for 100% but if i did not have the crt monitor i would likely look into profiling the screen with a hardware dongle. i would not adjust the monitor according the image i am viewing as the monitor is the reference. i can't really comment on settings in the current version of lightroom as i only have the \"perpetual license\" version which is quite good for cataloguing and searching for images but for raw processing i much prefer capture one. as mentioned elsewhere, it can be useful to do \"auto adjust\" (\"auto-tone\" in lr) to see what the software -----> comes !!!  -----> up !!!  -----> with !!!  and this might give a starting point, otherwise reset to original and work from there. a quick web search reveals a number of sites where the c1 workflow is described (often in contrast with lr) so there is more than one way to approach it. \"less is more\" is a very useful rule of thumb. viewing the result of adjustments on a well-calibrated monitor while paying close attention to the histogram is essential. unless you are looking for a special effect, the aim is for the histogram to extend across the full range from black to white with a solid middle (where much of the detail is found). c1 does not distinguish between \"library\" and develop, using tabs to choose each option. lr obviously needs to be in \"develop\" mode to do processing other than the \"quick develop\" in library mode. as i said in the original post, the most important thing is to come up with a workflow that is consistent, reliable and repeatable. many tools interact with each other so getting them into the right order is also important. my workflow in c1 goes like this (work through the same sequence each time): - styles and presets (the develop menu in lr has something similar) if there is something you prepared earlier - lens module - color module - exposure module (this is the module where the most dramatic adjustments are made and care needs to be take not to \"over do\" it) -- start with \"exposure\" to get a good histogram -- i find \"highlight\", \"shadow\", \"white\" and \"black\" much more useful than \"brightness\" and \"contrast\" c1 has a \"details\" module where sharpening, noise reduction film grain, spot removal are found, not sure about the lr equivalents -- sharpening and noise reduction best left at zero unless there is something about the original raw file (eg exposed at high iso) that needs work -- modern cameras with little or no anti-aliasing filters on the sensor don't need sharpening in my experience and film scans can become very grainy if sharpening (as opposed to clarity) is over-used -- spot removal can be very useful if there was dust on the sensor or spots on a film scan -- \"clarity\" in my experience works much better than \"sharpening\" - output (in c1) - lr uses \"export\" this is the place to decide whether to produce a tiff file (e.g. for use in another program such as photoshop or dxo nik collection) or a jpeg (for web, e-mail etc). - print -- the most important thing here is to have good color management as \"managed by printer\" is rarely sufficient hence a bespoke profile for your combination of printer, paper, ink", "sortedWord": "None", "Identifyer": null, "identifyer": 111073, "year": "2020"}, {"autor": "Jager", "date": "2020-06-05 15:25:00", "content": "2 hours ago, zeitz said: Could someone clarify what Capture One means by a perpetual license? On its website Capture One says \"Every time a new version of the software is released, subscribers upgrade at no extra cost - while license-owners can purchase new releases at a special upgrade price.\" While Dennis says \"the software is mine\" and \"upgrades are included\", that is not what I read on Capture One's site. Capture One's perpetual license is exactly like the licensing one got with Adobe Lightroom or Photoshop, back before those programs went to a subscription model. You have to purchase each major release (with, typically, a discount for current users who are upgrading). Minor maintenance releases are free. Capture One also gives you the option of a subscription model, if that's what you prefer. Those licensed for that (and thus paying every month) receive every release, major or minor, as part of the subscription. The benefit of the perpetual license is that a user can evaluate the new features added in a major release and assess whether or not those warrant the upgrade cost. Mature software products such as Capture One, Lightroom, Photoshop, Word, etc., have most of their \"core\" functionality established early on, in the first half-dozen or so releases. It becomes increasingly difficult to come up with new, innovative features to add later on... which is why many of us are so opposed to the subscription model.", "link": "https://www.l-camera-forum.com/topic/310225-lightroom-alternative-luminar-capture-1-or/page/2/?tab=comments#comment-3987674", "origin": "L-forum", "suborigin": "310225-lightroom-alternative-luminar-capture-1-or", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "2 hours ago, zeitz said: could someone clarify what capture one means by a perpetual license? on its website capture one says \"every time a new version of the software is released, subscribers upgrade at no extra cost - while license-owners can purchase new releases at a special upgrade price.\" while dennis says \"the software is mine\" and \"upgrades are included\", that is not what i read on capture one's site. capture one's perpetual license is exactly like the licensing one got with adobe lightroom or photoshop, back before those programs went to a subscription model. you have to purchase each major release (with, typically, a discount for current users who are upgrading). minor maintenance releases are free. capture one also gives you the option of a subscription model, if that's what you prefer. those licensed for that (and thus paying every month) receive every release, major or minor, as part of the subscription. the benefit of the perpetual license is that a user can evaluate the new features added in a major release and assess whether or not those warrant the upgrade cost. mature software products such as capture one, lightroom, photoshop, word, etc., have most of their \"core\" functionality established early on, in the first half-dozen or so releases. it becomes increasingly difficult to -----> come !!!  -----> up !!!  -----> with !!!  new, innovative features to add later on... which is why many of us are so opposed to the subscription model.", "sortedWord": "None", "Identifyer": null, "identifyer": 111331, "year": "2020"}, {"autor": "kinross", "date": "2020-06-08 18:31:00", "content": "Thanks for link wellfleet. That has worked. Only thing now is I am unable to select film, only reflective. Have check cover is plugged in. Do not understand why I could not find that download. All I ever came up with ' no drivers for your is os system ' I did spot the Vuescan page. Maybe worth a try if all else fails. Thanks.Mike", "link": "https://www.l-camera-forum.com/topic/310404-scanner/?tab=comments#comment-3989964", "origin": "L-forum", "suborigin": "310404-scanner", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "thanks for link wellfleet. that has worked. only thing now is i am unable to select film, only reflective. have check cover is plugged in. do not understand why i could not find that download. all i ever -----> came !!!  -----> up !!!  -----> with !!!  ' no drivers for your is os system ' i did spot the vuescan page. maybe worth a try if all else fails. thanks.mike", "sortedWord": "None", "Identifyer": null, "identifyer": 111710, "year": "2020"}, {"autor": "bonjac", "date": "2020-03-19 21:33:00", "content": "Thank you, Mr. Barton. This may work; however, the specific preset I had found was from an author on the internet. If no-one comes up with a suggested person or source, then I may but the presets. To be fair, I had upgraded to os Catalina and lost my ability use LR 6.10 and most of the data related to LR including \"user presets\". I no longer use LR, but I wanted to find the preset to see what he did and see if I could translate to another editor. Again, thanks for your help. Jack", "link": "https://www.l-camera-forum.com/topic/307613-leica-lightroom-preset/?tab=comments#comment-3934840", "origin": "L-forum", "suborigin": "307613-leica-lightroom-preset", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "thank you, mr. barton. this may work; however, the specific preset i had found was from an author on the internet. if no-one -----> comes !!!  -----> up !!!  -----> with !!!  a suggested person or source, then i may but the presets. to be fair, i had upgraded to os catalina and lost my ability use lr 6.10 and most of the data related to lr including \"user presets\". i no longer use lr, but i wanted to find the preset to see what he did and see if i could translate to another editor. again, thanks for your help. jack", "sortedWord": "None", "Identifyer": null, "identifyer": 112016, "year": "2020"}, {"autor": "EdricBF", "date": "2020-10-07 20:22:00", "content": "Thank you for the response. Well, if the processor is not able to scrub that pixel for JPEGs, I guess asking Leica if they have come up with a \"map out\" firmware remedy is in order. Thank you. Edited October 7, 2020 by EdricBF", "link": "https://www.l-camera-forum.com/topic/314019-why-hot-pixel-just-in-jpeg/?tab=comments#comment-4059033", "origin": "L-forum", "suborigin": "314019-why-hot-pixel-just-in-jpeg", "result": false, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "well, if the processor is not able to scrub that pixel for jpegs, i guess asking leica if they have come up with a \"map out\" firmware -----> remedy !!!  is in order.", "sortedWord": "remedy", "Identifyer": null, "identifyer": 32224, "year": "2020"}], "name": "Leicasortedout2020with"}