{"interestingcomments": [{"autor": "sfokevin", "date": "2008-10-31 04:14:00", "content": "I wouldn't advise dismantling the top plate just to clean around the shutter speed dial; it's secured from the inside and there are some tiny springs and ball bearings which are free to get lost when you release it. Similarly, you can remove the finger rest with a flex-clamp but again, there's a tiny, almost invisible plastic pad waiting to get lost. These threads are to satisfy your curiosity, not to encourage you to do the same! I would just clean around with a Q-Tip moistened with alcohol and draw a Pec-Pad underneath the shutter dial. Yeah... After I posted I searched and found your previous anatomy threads... Definitely not a DIY job... I'm on the NJ frameline/shutter swap wait list... hopefully they will do a cleanup for me too! --img-- ", "link": "https://www.l-camera-forum.com/topic/66999-anatomy-of-the-leica-m8-framelines/page/2/?tab=comments#comment-700820", "origin": "L-forum", "suborigin": "66999-anatomy-of-the-leica-m8-framelines", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i wouldn't advise dismantling the top plate just to clean around the shutter speed dial; it's secured from the inside and there are some tiny springs and ball bearings which are free to get lost when you release it. similarly, you can remove the finger rest with a flex-clamp but again, there's a tiny, almost invisible plastic pad waiting to get lost. these threads are to satisfy your curiosity, not to encourage you to do the same! i would just clean around with a q-tip moistened with alcohol and draw a pec-pad underneath the shutter dial. yeah... after i posted i searched and found your previous anatomy threads... definitely not a -----> diy !!!  job... i'm on the nj frameline/shutter swap wait list... hopefully they will do a cleanup for me too! --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 44715, "year": "2008"}], "name": "Leicasortedout2008diy"}