{"interestingcomments": [{"autor": "jkcampbell2", "date": "2021-11-26 21:32:00", "content": "Pelican's TreckPac dividers make a great way to layout your case plus it's easy to change the design as equipment changes. The system is a bit expensive but a DIY version is pretty easy to make. https://www.arielestulin.com/diy-trekpak-for-under-20/ Cheers! jc", "link": "https://www.l-camera-forum.com/topic/326960-pelican-1150-and-leica-m10-p/?tab=comments#comment-4320952", "origin": "L-forum", "suborigin": "326960-pelican-1150-and-leica-m10-p", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "pelican's treckpac dividers make a great way to layout your case plus it's easy to change the design as equipment changes. the system is a bit expensive but a -----> diy !!!  version is pretty easy to make. https://www.arielestulin.com/diy-trekpak-for-under-20/ cheers! jc", "sortedWord": "None", "Identifyer": null, "identifyer": 82, "year": "2021"}, {"autor": "wrussell", "date": "2021-11-30 07:32:00", "content": "Did you ever get this resolved? Can you DIY this or does it really need to be taken in?", "link": "https://www.l-camera-forum.com/topic/299883-m10-rough-shutter-release/?tab=comments#comment-4323014", "origin": "L-forum", "suborigin": "299883-m10-rough-shutter-release", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "did you ever get this resolved? can you -----> diy !!!  this or does it really need to be taken in?", "sortedWord": "None", "Identifyer": null, "identifyer": 303, "year": "2021"}, {"autor": "kepstein", "date": "2021-11-30 13:26:00", "content": "5 hours ago, wrussell said: Did you ever get this resolved? Can you DIY this or does it really need to be taken in? No, and it continues to limit my use and enjoyment. I would love a DIY solution that works.", "link": "https://www.l-camera-forum.com/topic/299883-m10-rough-shutter-release/?tab=comments#comment-4323140", "origin": "L-forum", "suborigin": "299883-m10-rough-shutter-release", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "5 hours ago, wrussell said: did you ever get this resolved? can you -----> diy !!!  this or does it really need to be taken in? no, and it continues to limit my use and enjoyment. i would love a diy solution that works.", "sortedWord": "None", "Identifyer": null, "identifyer": 304, "year": "2021"}, {"autor": "wrussell", "date": "2021-11-30 15:36:00", "content": "2 hours ago, kepstein said: No, and it continues to limit my use and enjoyment. I would love a DIY solution that works. Well, my m10-R is about 12 hours old and already has this issue. Working to figure out solution with the boutique. In basically any other product I’d just return/exchange for a new one but body language on the forum here makes it seem like this is something we’re supposed to eat and have them tear apart a brand new camera as part of a warranty claim…", "link": "https://www.l-camera-forum.com/topic/299883-m10-rough-shutter-release/?tab=comments#comment-4323205", "origin": "L-forum", "suborigin": "299883-m10-rough-shutter-release", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "2 hours ago, kepstein said: no, and it continues to limit my use and enjoyment. i would love a -----> diy !!!  solution that works. well, my m10-r is about 12 hours old and already has this issue. working to figure out solution with the boutique. in basically any other product i’d just return/exchange for a new one but body language on the forum here makes it seem like this is something we’re supposed to eat and have them tear apart a brand new camera as part of a warranty claim…", "sortedWord": "None", "Identifyer": null, "identifyer": 305, "year": "2021"}, {"autor": "wrussell", "date": "2021-12-01 08:03:00", "content": "18 hours ago, kepstein said: No, and it continues to limit my use and enjoyment. I would love a DIY solution that works. As an update here, they replaced my camera entirely. New one seems to work like a charm. A few other forum users had the same issue apparently but the solution is opaque - sounds like they went in for varying levels of off-site service, but ultimately resolved the issues. Best of luck.", "link": "https://www.l-camera-forum.com/topic/299883-m10-rough-shutter-release/?tab=comments#comment-4323691", "origin": "L-forum", "suborigin": "299883-m10-rough-shutter-release", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "18 hours ago, kepstein said: no, and it continues to limit my use and enjoyment. i would love a -----> diy !!!  solution that works. as an update here, they replaced my camera entirely. new one seems to work like a charm. a few other forum users had the same issue apparently but the solution is opaque - sounds like they went in for varying levels of off-site service, but ultimately resolved the issues. best of luck.", "sortedWord": "None", "Identifyer": null, "identifyer": 306, "year": "2021"}, {"autor": "Jeff S", "date": "2021-11-25 05:35:00", "content": "1 hour ago, fenykepesz said: thank you, MaxHu, for your post : i have the exactly same issue with my M10-D (see here), at the very same place there is a friction with the associated scratch mark... i will see now what lubricant is best applied here. do you have any advice what make and type of lubricant to use ? He hasn’t posted anywhere on the forum since the above post 6 months ago. You might try a PM. Or ask, or send to, a reputable Leica repair technician. I personally wouldn’t risk voiding the warranty or doing harm, but others prefer DIY. Jeff", "link": "https://www.l-camera-forum.com/topic/293403-m10-sticky-rangefinder-coupling/page/2/?tab=comments#comment-4319890", "origin": "L-forum", "suborigin": "293403-m10-sticky-rangefinder-coupling", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "1 hour ago, fenykepesz said: thank you, maxhu, for your post : i have the exactly same issue with my m10-d (see here), at the very same place there is a friction with the associated scratch mark... i will see now what lubricant is best applied here. do you have any advice what make and type of lubricant to use ? he hasn’t posted anywhere on the forum since the above post 6 months ago. you might try a pm. or ask, or send to, a reputable leica repair technician. i personally wouldn’t risk voiding the warranty or doing harm, but others prefer -----> diy !!! . jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 435, "year": "2021"}, {"autor": "Gelatino", "date": "2021-07-11 07:48:00", "content": " Here is my \"new\" one, surely not the last, that looks like the Filson but far less expensive. French army bag (1950) for 20Euro, insert on the Bay for 25Euro and some DIY customization (soft plastic on the bottom for waterproofing and mesh for spare space) Internal dimensions (L/W/H) 28 x 14 x 22 cm --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/307354-camera-bag-again-and-again/page/9/?tab=comments#comment-4235910", "origin": "L-forum", "suborigin": "307354-camera-bag-again-and-again", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " here is my \"new\" one, surely not the last, that looks like the filson but far less expensive. french army bag (1950) for 20euro, insert on the bay for 25euro and some -----> diy !!!  customization (soft plastic on the bottom for waterproofing and mesh for spare space) internal dimensions (l/w/h) 28 x 14 x 22 cm --img-- --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 3115, "year": "2021"}, {"autor": "sinjun", "date": "2021-10-13 07:38:00", "content": "14 hours ago, Tessar. said: Try dismounting the lens gently and re-mounting it with the lens focused out to it's min. focus distance. Thanks for the suggestion but it didn't work. 9 hours ago, blackpaint-R said: Is it Every lens? Yes, it's lens independent. The problem is quite clear even without a lens mounted in that the cam sticks rather than moving freely back and forth. I just wondered if anyone else had encountered this and there might be a simple DIY fix. If I had to guess the reason it would be that something was caught in the cam mechanism and impeding it, but I can't see anything.", "link": "https://www.l-camera-forum.com/topic/325329-rangefinder-cam-sticking-on-m10-d/?tab=comments#comment-4291562", "origin": "L-forum", "suborigin": "325329-rangefinder-cam-sticking-on-m10-d", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "14 hours ago, tessar. said: try dismounting the lens gently and re-mounting it with the lens focused out to it's min. focus distance. thanks for the suggestion but it didn't work. 9 hours ago, blackpaint-r said: is it every lens? yes, it's lens independent. the problem is quite clear even without a lens mounted in that the cam sticks rather than moving freely back and forth. i just wondered if anyone else had encountered this and there might be a simple -----> diy !!!  fix. if i had to guess the reason it would be that something was caught in the cam mechanism and impeding it, but i can't see anything.", "sortedWord": "None", "Identifyer": null, "identifyer": 4171, "year": "2021"}, {"autor": "yukosteel", "date": "2021-05-05 01:57:00", "content": "Speaking of a wrist straps with minimal metal parts to avoid unwanted body/glass scratches, I'm using simple to make DIY leather strap with vintage metal rivet adopted from old Nikon binoculars strap, and custom made copper ring. It has that minimalistic look and practical function to fit Leica controls minimalism. --img-- ", "link": "https://www.l-camera-forum.com/topic/317808-new-to-leicam10-question/page/2/?tab=comments#comment-4194575", "origin": "L-forum", "suborigin": "317808-new-to-leicam10-question", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "speaking of a wrist straps with minimal metal parts to avoid unwanted body/glass scratches, i'm using simple to make -----> diy !!!  leather strap with vintage metal rivet adopted from old nikon binoculars strap, and custom made copper ring. it has that minimalistic look and practical function to fit leica controls minimalism. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 8312, "year": "2021"}, {"autor": "dancook", "date": "2021-05-04 12:10:00", "content": " Got a small piece of orange fluff in the rangefinder, Leica won't give a price until it's been sent away to another country to be looked at.. it can't be seen in focusing, but I am selling the camera and it might put buyers off. I was curious if it can easily be DIY? --img-- ", "link": "https://www.l-camera-forum.com/topic/320582-can-the-rangefinder-window-be-cleaned/?tab=comments#comment-4194068", "origin": "L-forum", "suborigin": "320582-can-the-rangefinder-window-be-cleaned", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " got a small piece of orange fluff in the rangefinder, leica won't give a price until it's been sent away to another country to be looked at.. it can't be seen in focusing, but i am selling the camera and it might put buyers off. i was curious if it can easily be -----> diy !!! ? --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 9414, "year": "2021"}, {"autor": "nuc001", "date": "2021-02-12 02:53:00", "content": " Hi everyone. Following up on my M10-P Rangefinder drifting thread, where I asked whether the body was front focusing or not, I went to Leica in Thailand and even though the camera is still within it's warranty, they told me that they cannot solve focusing issues and the camera has to be sent to Singapore. As my camera was bought from HK, I will have to pay P&P of 250USD as well, and it will take around 2-3 months. I also would have to go find the receipt, as they cannot just look at the serial number for some reason. If I am unable to supply the receipt, then a maintenance fee will be charged as well. Yesterday I had some free time and was itching to get the problem sorted, so I researched this forum about DIY rangefinder adjustments and a few YouTube videos, went out and bought a 2mm Hex key for $1 and adjusted the roller for horizontal alignment myself, using the night stars as a guide for infinity. However, my vertical alignment is also off so there are always 2 stars in the focusing patch no matter what I do, making adjustment very difficult. At the end of all that, the rangefinder does not coincide at infinity, but focus from 0.7m - 5m seems to be accurate (still slightly front focusing but acceptable) for Summilux-M 50mm at F1.4. I have a few questions regarding the adjustments. Horizontal adjustment (please kindly see attached photo from the internet, of an M7?) When the hex key is inserted into the hole, and clockwise turns (red arrow) are very easy and the rangefinder arm does not move at all. However, when I try to turn anti-clockwise (green arrow) the rangefinder arm pivots down into the body with the turn, so I had to do a lifting motion whilst also turning the hex key. This lifted the rangefinder arm further out of the body once, but it then moved back so I am not sure whether this will cause any problems in the long term. I made sure not to press the rangefinder arm in the direction of the top plate and it looks the same as far as I can tell. Hopefully I didn't bend it? Vertical adjustment Apparently this can also be done with the 2mm hex key. However, I have no idea how to unscrew the cover screw on the camera without scratching it. Some have suggested wrapping a screwdriver in electrical tape first, but I am hesitating to attempt it. Has anyone else managed to removed the screw, and how did you do it? Any help would be much appreciated. --img-- ", "link": "https://www.l-camera-forum.com/topic/317918-need-some-help-with-m10-p-rangefinder-adjustment/?tab=comments#comment-4138966", "origin": "L-forum", "suborigin": "317918-need-some-help-with-m10-p-rangefinder-adjustment", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " hi everyone. following up on my m10-p rangefinder drifting thread, where i asked whether the body was front focusing or not, i went to leica in thailand and even though the camera is still within it's warranty, they told me that they cannot solve focusing issues and the camera has to be sent to singapore. as my camera was bought from hk, i will have to pay p&p of 250usd as well, and it will take around 2-3 months. i also would have to go find the receipt, as they cannot just look at the serial number for some reason. if i am unable to supply the receipt, then a maintenance fee will be charged as well. yesterday i had some free time and was itching to get the problem sorted, so i researched this forum about -----> diy !!!  rangefinder adjustments and a few youtube videos, went out and bought a 2mm hex key for $1 and adjusted the roller for horizontal alignment myself, using the night stars as a guide for infinity. however, my vertical alignment is also off so there are always 2 stars in the focusing patch no matter what i do, making adjustment very difficult. at the end of all that, the rangefinder does not coincide at infinity, but focus from 0.7m - 5m seems to be accurate (still slightly front focusing but acceptable) for summilux-m 50mm at f1.4. i have a few questions regarding the adjustments. horizontal adjustment (please kindly see attached photo from the internet, of an m7?) when the hex key is inserted into the hole, and clockwise turns (red arrow) are very easy and the rangefinder arm does not move at all. however, when i try to turn anti-clockwise (green arrow) the rangefinder arm pivots down into the body with the turn, so i had to do a lifting motion whilst also turning the hex key. this lifted the rangefinder arm further out of the body once, but it then moved back so i am not sure whether this will cause any problems in the long term. i made sure not to press the rangefinder arm in the direction of the top plate and it looks the same as far as i can tell. hopefully i didn't bend it? vertical adjustment apparently this can also be done with the 2mm hex key. however, i have no idea how to unscrew the cover screw on the camera without scratching it. some have suggested wrapping a screwdriver in electrical tape first, but i am hesitating to attempt it. has anyone else managed to removed the screw, and how did you do it? any help would be much appreciated. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 9898, "year": "2021"}, {"autor": "budjames", "date": "2021-02-14 13:54:00", "content": "On 2/11/2021 at 9:53 PM, nuc001 said: Hi everyone. Following up on my M10-P Rangefinder drifting thread, where I asked whether the body was front focusing or not, I went to Leica in Thailand and even though the camera is still within it's warranty, they told me that they cannot solve focusing issues and the camera has to be sent to Singapore. As my camera was bought from HK, I will have to pay P&P of 250USD as well, and it will take around 2-3 months. I also would have to go find the receipt, as they cannot just look at the serial number for some reason. If I am unable to supply the receipt, then a maintenance fee will be charged as well. Yesterday I had some free time and was itching to get the problem sorted, so I researched this forum about DIY rangefinder adjustments and a few YouTube videos, went out and bought a 2mm Hex key for $1 and adjusted the roller for horizontal alignment myself, using the night stars as a guide for infinity. However, my vertical alignment is also off so there are always 2 stars in the focusing patch no matter what I do, making adjustment very difficult. At the end of all that, the rangefinder does not coincide at infinity, but focus from 0.7m - 5m seems to be accurate (still slightly front focusing but acceptable) for Summilux-M 50mm at F1.4. I have a few questions regarding the adjustments. Horizontal adjustment (please kindly see attached photo from the internet, of an M7?) When the hex key is inserted into the hole, and clockwise turns (red arrow) are very easy and the rangefinder arm does not move at all. However, when I try to turn anti-clockwise (green arrow) the rangefinder arm pivots down into the body with the turn, so I had to do a lifting motion whilst also turning the hex key. This lifted the rangefinder arm further out of the body once, but it then moved back so I am not sure whether this will cause any problems in the long term. I made sure not to press the rangefinder arm in the direction of the top plate and it looks the same as far as I can tell. Hopefully I didn't bend it? Vertical adjustment Apparently this can also be done with the 2mm hex key. However, I have no idea how to unscrew the cover screw on the camera without scratching it. Some have suggested wrapping a screwdriver in electrical tape first, but I am hesitating to attempt it. Has anyone else managed to removed the screw, and how did you do it? Any help would be much appreciated. --img--  I think that is is a job for an experience Leica technician. I would never attempt this on my own. Regards, Bud James Please check out my fine art and travel photography at www.budjames.photography or on Instagram at www.instagram.com/budjamesphoto", "link": "https://www.l-camera-forum.com/topic/317918-need-some-help-with-m10-p-rangefinder-adjustment/?tab=comments#comment-4140705", "origin": "L-forum", "suborigin": "317918-need-some-help-with-m10-p-rangefinder-adjustment", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "on 2/11/2021 at 9:53 pm, nuc001 said: hi everyone. following up on my m10-p rangefinder drifting thread, where i asked whether the body was front focusing or not, i went to leica in thailand and even though the camera is still within it's warranty, they told me that they cannot solve focusing issues and the camera has to be sent to singapore. as my camera was bought from hk, i will have to pay p&p of 250usd as well, and it will take around 2-3 months. i also would have to go find the receipt, as they cannot just look at the serial number for some reason. if i am unable to supply the receipt, then a maintenance fee will be charged as well. yesterday i had some free time and was itching to get the problem sorted, so i researched this forum about -----> diy !!!  rangefinder adjustments and a few youtube videos, went out and bought a 2mm hex key for $1 and adjusted the roller for horizontal alignment myself, using the night stars as a guide for infinity. however, my vertical alignment is also off so there are always 2 stars in the focusing patch no matter what i do, making adjustment very difficult. at the end of all that, the rangefinder does not coincide at infinity, but focus from 0.7m - 5m seems to be accurate (still slightly front focusing but acceptable) for summilux-m 50mm at f1.4. i have a few questions regarding the adjustments. horizontal adjustment (please kindly see attached photo from the internet, of an m7?) when the hex key is inserted into the hole, and clockwise turns (red arrow) are very easy and the rangefinder arm does not move at all. however, when i try to turn anti-clockwise (green arrow) the rangefinder arm pivots down into the body with the turn, so i had to do a lifting motion whilst also turning the hex key. this lifted the rangefinder arm further out of the body once, but it then moved back so i am not sure whether this will cause any problems in the long term. i made sure not to press the rangefinder arm in the direction of the top plate and it looks the same as far as i can tell. hopefully i didn't bend it? vertical adjustment apparently this can also be done with the 2mm hex key. however, i have no idea how to unscrew the cover screw on the camera without scratching it. some have suggested wrapping a screwdriver in electrical tape first, but i am hesitating to attempt it. has anyone else managed to removed the screw, and how did you do it? any help would be much appreciated. --img--  i think that is is a job for an experience leica technician. i would never attempt this on my own. regards, bud james please check out my fine art and travel photography at www.budjames.photography or on instagram at www.instagram.com/budjamesphoto", "sortedWord": "None", "Identifyer": null, "identifyer": 9902, "year": "2021"}, {"autor": "jaapv", "date": "2021-03-23 02:06:00", "content": "3 hours ago, Pixeleater said: Using an M10R, when I have focus dialed to infinity the object in the viewfinder patch is double vision. When I move the patch off the object it is no longer double vision. Any ideas as to why is this happening and what can I do to correct it? This happens when using the 35 Summicron, 50 APO and 50 Summilux. Thanks. It sometimes happens. Some lenses, especially third-party ones will focus slightly beyond infinity. Take a few test shots to see whether the shots you take with the camera focused to infinity are sharper than the ones with the lens turned all the way. If the \"lens\" shots are sharper your camera or lens -or both- need calibration. Ideally you need an optical bench to calibrate properly, although it can be done using Live View - many Leica specialists can do the job for you. A simple tweaking of the camera infinity setting is an easy DIY job. Infinity is quite a bit further than 1500 feet for the rangefinder, irrespective of focal length. I find I can focus-differentiate up to at least 1 km. Whether the lens can render the small difference is another matter.", "link": "https://www.l-camera-forum.com/topic/319182-viewfinder-patch-question/?tab=comments#comment-4166221", "origin": "L-forum", "suborigin": "319182-viewfinder-patch-question", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "3 hours ago, pixeleater said: using an m10r, when i have focus dialed to infinity the object in the viewfinder patch is double vision. when i move the patch off the object it is no longer double vision. any ideas as to why is this happening and what can i do to correct it? this happens when using the 35 summicron, 50 apo and 50 summilux. thanks. it sometimes happens. some lenses, especially third-party ones will focus slightly beyond infinity. take a few test shots to see whether the shots you take with the camera focused to infinity are sharper than the ones with the lens turned all the way. if the \"lens\" shots are sharper your camera or lens -or both- need calibration. ideally you need an optical bench to calibrate properly, although it can be done using live view - many leica specialists can do the job for you. a simple tweaking of the camera infinity setting is an easy -----> diy !!!  job. infinity is quite a bit further than 1500 feet for the rangefinder, irrespective of focal length. i find i can focus-differentiate up to at least 1 km. whether the lens can render the small difference is another matter.", "sortedWord": "None", "Identifyer": null, "identifyer": 10214, "year": "2021"}, {"autor": "w44neg", "date": "2021-02-15 23:57:00", "content": " Firstly, don't worry, I know cameras pick up scratches and it's hardly going to fall apart because of them 😄 However I was watching a YouTube video recently and the guy said he occasionally polished the scratches out of his black M10P. I picked up this silver M10P and it has a few rub marks from straps etc. --img--  I have some experience with polishing metal etc and I never thought a finish as delicate as the M10P (looks bead-blasted) could be rescued in a DIY fashion, but perhaps I'm wrong. Has anyone managed it? The scratches shown are in the highest point of the surface; they look deeper in the image but they're just where the strap has rubbed. Not an issue as I say, but if there's a way to keep the camera in nicer shape, I'm interested that;ss all.", "link": "https://www.l-camera-forum.com/topic/318061-removing-surface-scratches/?tab=comments#comment-4142089", "origin": "L-forum", "suborigin": "318061-removing-surface-scratches", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " firstly, don't worry, i know cameras pick up scratches and it's hardly going to fall apart because of them 😄 however i was watching a youtube video recently and the guy said he occasionally polished the scratches out of his black m10p. i picked up this silver m10p and it has a few rub marks from straps etc. --img--  i have some experience with polishing metal etc and i never thought a finish as delicate as the m10p (looks bead-blasted) could be rescued in a -----> diy !!!  fashion, but perhaps i'm wrong. has anyone managed it? the scratches shown are in the highest point of the surface; they look deeper in the image but they're just where the strap has rubbed. not an issue as i say, but if there's a way to keep the camera in nicer shape, i'm interested that;ss all.", "sortedWord": "None", "Identifyer": null, "identifyer": 11351, "year": "2021"}, {"autor": "jaapv", "date": "2021-02-08 09:51:00", "content": "I think it is possible that you lens needs to be adjusted. The Summilux 50 asph is known for calibration issues, due to the exceedingly tight tolerances in the floating element mechanism. If the problem is with the lens you can find out by mounting a lens with known correct calibration. OTOH, the adjustment of the rangefinder is basically done at two places, the roller wheel and the internal screw of the arm. The roller wheel is for infinity and can be done in DIY. The screw is for close-up and is slightly more difficult. It may be that Leica only adjusted infinity. There is also the possibility that you bent the arm slightly by hitting the roller when mounting a lens. In that case the mid-range will be off. It is always wise to send both lens(es) and camera in in, to enable the technician to determine the cause of the adjustment problem.", "link": "https://www.l-camera-forum.com/topic/317781-m10-p-rangefinder-drifting/?tab=comments#comment-4136182", "origin": "L-forum", "suborigin": "317781-m10-p-rangefinder-drifting", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i think it is possible that you lens needs to be adjusted. the summilux 50 asph is known for calibration issues, due to the exceedingly tight tolerances in the floating element mechanism. if the problem is with the lens you can find out by mounting a lens with known correct calibration. otoh, the adjustment of the rangefinder is basically done at two places, the roller wheel and the internal screw of the arm. the roller wheel is for infinity and can be done in -----> diy !!! . the screw is for close-up and is slightly more difficult. it may be that leica only adjusted infinity. there is also the possibility that you bent the arm slightly by hitting the roller when mounting a lens. in that case the mid-range will be off. it is always wise to send both lens(es) and camera in in, to enable the technician to determine the cause of the adjustment problem.", "sortedWord": "None", "Identifyer": null, "identifyer": 11374, "year": "2021"}, {"autor": "nuc001", "date": "2021-02-09 03:07:00", "content": "Thank you very much Jaapv. I did search for a long time regarding lens calibration issues for the Summilux 50 ASPH...but that would not explain why it worked straight out of the box the first time. Although as I don't have any other longer lenses, if I calibrate the M10-P body to the lens, the 35 FLE should still work as the DOF should be able to cover any calibration errors, if I understand correctly. 16 hours ago, jaapv said: OTOH, the adjustment of the rangefinder is basically done at two places, the roller wheel and the internal screw of the arm. The roller wheel is for infinity and can be done in DIY. The screw is for close-up and is slightly more difficult. It may be that Leica only adjusted infinity. I thoroughly enjoyed reading the thread about adjusting the rangefinder for the M9, but I don't think I have the skill to go it alone. Yes I think Leica only adjusted the infinity, as when I looked back at the photos taken straight after I got the camera back, it was already front-focusing. However, it was an interior shot of a room and so was not that obvious. Portraits at minimum focus distance was spot-on that day so I thought there were no issues. 16 hours ago, jaapv said: There is also the possibility that you bent the arm slightly by hitting the roller when mounting a lens. In that case the mid-range will be off. Probably this! There were no issues when I had the Summilux 50 basically glued to the body...the issue only surfaced when I was testing potential new lenses and settled on one. I am really bad with mounting lenses, never manage to get it on the first try. I have nudged it slightly on occasion but I did not realise that the mechanism would be so fragile though. I focused on the crosshairs in the attached pic at 1.4 from 2 meters away on a tripod at 1/125, and it really is front focusing by quite a lot. I think I'll need to send both the lens and body in for calibration and see how that goes. --img-- ", "link": "https://www.l-camera-forum.com/topic/317781-m10-p-rangefinder-drifting/?tab=comments#comment-4136746", "origin": "L-forum", "suborigin": "317781-m10-p-rangefinder-drifting", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "thank you very much jaapv. i did search for a long time regarding lens calibration issues for the summilux 50 asph...but that would not explain why it worked straight out of the box the first time. although as i don't have any other longer lenses, if i calibrate the m10-p body to the lens, the 35 fle should still work as the dof should be able to cover any calibration errors, if i understand correctly. 16 hours ago, jaapv said: otoh, the adjustment of the rangefinder is basically done at two places, the roller wheel and the internal screw of the arm. the roller wheel is for infinity and can be done in -----> diy !!! . the screw is for close-up and is slightly more difficult. it may be that leica only adjusted infinity. i thoroughly enjoyed reading the thread about adjusting the rangefinder for the m9, but i don't think i have the skill to go it alone. yes i think leica only adjusted the infinity, as when i looked back at the photos taken straight after i got the camera back, it was already front-focusing. however, it was an interior shot of a room and so was not that obvious. portraits at minimum focus distance was spot-on that day so i thought there were no issues. 16 hours ago, jaapv said: there is also the possibility that you bent the arm slightly by hitting the roller when mounting a lens. in that case the mid-range will be off. probably this! there were no issues when i had the summilux 50 basically glued to the body...the issue only surfaced when i was testing potential new lenses and settled on one. i am really bad with mounting lenses, never manage to get it on the first try. i have nudged it slightly on occasion but i did not realise that the mechanism would be so fragile though. i focused on the crosshairs in the attached pic at 1.4 from 2 meters away on a tripod at 1/125, and it really is front focusing by quite a lot. i think i'll need to send both the lens and body in for calibration and see how that goes. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 11375, "year": "2021"}, {"autor": "a.noctilux", "date": "2021-08-20 08:40:00", "content": "Hello welcome here, If it's a bit off, how is it 'a bit' ? I think for this it would be overkill to send to Wetzlar. Many technicians not far from where you are can adjust it with right tools. Call around or ask your Leica Dealer. Even some had done DIY ( when I travelled, I had done on M8/M9, never on newer M though).", "link": "https://www.l-camera-forum.com/topic/323717-problem-with-my-m240-vertical-alignment-a-bit-off/?tab=comments#comment-4259799", "origin": "L-forum", "suborigin": "323717-problem-with-my-m240-vertical-alignment-a-bit-off", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hello welcome here, if it's a bit off, how is it 'a bit' ? i think for this it would be overkill to send to wetzlar. many technicians not far from where you are can adjust it with right tools. call around or ask your leica dealer. even some had done -----> diy !!!  ( when i travelled, i had done on m8/m9, never on newer m though).", "sortedWord": "None", "Identifyer": null, "identifyer": 13417, "year": "2021"}, {"autor": "ianman", "date": "2021-08-20 14:46:00", "content": "6 hours ago, a.noctilux said: Even some had done DIY ( when I travelled, I had done on M8/M9, never on newer M though). I did it on my M4-P with a screwdriver IIRC, but I understand that later models need a special tool*. What did you use for the M9? * see here http://leica.nemeng.com/034b.shtml", "link": "https://www.l-camera-forum.com/topic/323717-problem-with-my-m240-vertical-alignment-a-bit-off/?tab=comments#comment-4260026", "origin": "L-forum", "suborigin": "323717-problem-with-my-m240-vertical-alignment-a-bit-off", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "6 hours ago, a.noctilux said: even some had done -----> diy !!!  ( when i travelled, i had done on m8/m9, never on newer m though). i did it on my m4-p with a screwdriver iirc, but i understand that later models need a special tool*. what did you use for the m9? * see here http://leica.nemeng.com/034b.shtml", "sortedWord": "None", "Identifyer": null, "identifyer": 13419, "year": "2021"}, {"autor": "jaapv", "date": "2021-07-03 21:30:00", "content": "Buy a 2 mm Allen key (1 $) and adjust coincidence at infinity by minimal and incremental movements of the roller wheel adjustment nut in the mouth of the camera. 90% chance that it will solve your problem. 380$ is crazy for a five minute job that is an easy DIY. If that does not work, send camera and lenses to a third party repair shop for a fast and reasonable fix. Don't send it to Leica They are too slow and charge too much for this kind of simple adjustments.", "link": "https://www.l-camera-forum.com/topic/322397-leica-m240-back-focus-and-rf-calibration/?tab=comments#comment-4231192", "origin": "L-forum", "suborigin": "322397-leica-m240-back-focus-and-rf-calibration", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "buy a 2 mm allen key (1 $) and adjust coincidence at infinity by minimal and incremental movements of the roller wheel adjustment nut in the mouth of the camera. 90% chance that it will solve your problem. 380$ is crazy for a five minute job that is an easy -----> diy !!! . if that does not work, send camera and lenses to a third party repair shop for a fast and reasonable fix. don't send it to leica they are too slow and charge too much for this kind of simple adjustments.", "sortedWord": "None", "Identifyer": null, "identifyer": 14489, "year": "2021"}, {"autor": "Victor Luo", "date": "2021-07-03 22:21:00", "content": "46 minutes ago, jaapv said: Buy a 2 mm Allen key (1 $) and adjust coincidence at infinity by minimal and incremental movements of the roller wheel adjustment nut in the mouth of the camera. 90% chance that it will solve your problem. 380$ is crazy for a five minute job that is an easy DIY. If that does not work, send camera and lenses to a third party repair shop for a fast and reasonable fix. Don't send it to Leica They are too slow and charge too much for this kind of simple adjustments. Thank you for the info! yeah that's what I thought, it definitely shouldn't cost that much. I don't really feel comfortable adjust this myself tho haha. If anyone here in the US had similar issues, it would be great to know what a reasonable price for a fix like this is.", "link": "https://www.l-camera-forum.com/topic/322397-leica-m240-back-focus-and-rf-calibration/?tab=comments#comment-4231229", "origin": "L-forum", "suborigin": "322397-leica-m240-back-focus-and-rf-calibration", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "46 minutes ago, jaapv said: buy a 2 mm allen key (1 $) and adjust coincidence at infinity by minimal and incremental movements of the roller wheel adjustment nut in the mouth of the camera. 90% chance that it will solve your problem. 380$ is crazy for a five minute job that is an easy -----> diy !!! . if that does not work, send camera and lenses to a third party repair shop for a fast and reasonable fix. don't send it to leica they are too slow and charge too much for this kind of simple adjustments. thank you for the info! yeah that's what i thought, it definitely shouldn't cost that much. i don't really feel comfortable adjust this myself tho haha. if anyone here in the us had similar issues, it would be great to know what a reasonable price for a fix like this is.", "sortedWord": "None", "Identifyer": null, "identifyer": 14490, "year": "2021"}, {"autor": "Jean-Michel", "date": "2021-07-04 18:48:00", "content": "Hi, See post number 15 here: https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/ Please note that it is important to only use small increments and, very important, not to apply downward pressure on the roller. Remember that infinity is quite a distance. I happen to be able to clearly see tall hydro towers some kilometres away to check infinity. I only had to do this once as my camera's rangefinder was slightly off at infinity. To check the rangefinder or lenses for close distances you can either purchase a calibrating device, or, download this DIY calibrator from http://squit.co.uk/photo/downloads.html You need to be careful in assembling the device — I printed on smooth paper and mounted the parts onto self adhesive foam core boards — it is well worth the effort. Checking using the screen or EVF is not sufficient; check the file on a computer screen. Jean-Michel", "link": "https://www.l-camera-forum.com/topic/322397-leica-m240-back-focus-and-rf-calibration/?tab=comments#comment-4231785", "origin": "L-forum", "suborigin": "322397-leica-m240-back-focus-and-rf-calibration", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hi, see post number 15 here: https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/ please note that it is important to only use small increments and, very important, not to apply downward pressure on the roller. remember that infinity is quite a distance. i happen to be able to clearly see tall hydro towers some kilometres away to check infinity. i only had to do this once as my camera's rangefinder was slightly off at infinity. to check the rangefinder or lenses for close distances you can either purchase a calibrating device, or, download this -----> diy !!!  calibrator from http://squit.co.uk/photo/downloads.html you need to be careful in assembling the device — i printed on smooth paper and mounted the parts onto self adhesive foam core boards — it is well worth the effort. checking using the screen or evf is not sufficient; check the file on a computer screen. jean-michel", "sortedWord": "None", "Identifyer": null, "identifyer": 14495, "year": "2021"}, {"autor": "Victor Luo", "date": "2021-07-04 19:11:00", "content": "6 hours ago, Adam Bonn said: With the camera positioned as per the photo. Turn the allen key anti clockwise to cure back focus (or clockwise to cure front focus) move it a TINY amount at a time You’ll need to test it with something that’s ‘infinity’ away, a star or the moon can work, although they can look a bit ‘glowly’ which makes it hard to judge (crescent moon works quite well) or if you’re lucky enough to have such a view, a radio mast, pylon etc that’s some kilometres/miles away Once you have infinity fixed (ie your infinity test point exactly aligns in the rangefinder patch when the lens is on infinity) then take some shots of things close up to confirm close focus FWIW (and I’ve been told it’s worth sweet FA) I always mount lenses with the lens in the closest focus setting (eg 0,7m or whatever that lens is) so that it doesn’t touch a lot the roller when I’m mounting the lens HTH? --img--  21 minutes ago, Jean-Michel said: Hi, See post number 15 here: https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/ Please note that it is important to only use small increments and, very important, not to apply downward pressure on the roller. Remember that infinity is quite a distance. I happen to be able to clearly see tall hydro towers some kilometres away to check infinity. I only had to do this once as my camera's rangefinder was slightly off at infinity. To check the rangefinder or lenses for close distances you can either purchase a calibrating device, or, download this DIY calibrator from http://squit.co.uk/photo/downloads.html You need to be careful in assembling the device — I printed on smooth paper and mounted the parts onto self adhesive foam core boards — it is well worth the effort. Checking using the screen or EVF is not sufficient; check the file on a computer screen. Jean-Michel Thank you guys so much! It's really helpful and I feel much more confident to try it myself now. Will give it a shot today!", "link": "https://www.l-camera-forum.com/topic/322397-leica-m240-back-focus-and-rf-calibration/?tab=comments#comment-4231812", "origin": "L-forum", "suborigin": "322397-leica-m240-back-focus-and-rf-calibration", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "6 hours ago, adam bonn said: with the camera positioned as per the photo. turn the allen key anti clockwise to cure back focus (or clockwise to cure front focus) move it a tiny amount at a time you’ll need to test it with something that’s ‘infinity’ away, a star or the moon can work, although they can look a bit ‘glowly’ which makes it hard to judge (crescent moon works quite well) or if you’re lucky enough to have such a view, a radio mast, pylon etc that’s some kilometres/miles away once you have infinity fixed (ie your infinity test point exactly aligns in the rangefinder patch when the lens is on infinity) then take some shots of things close up to confirm close focus fwiw (and i’ve been told it’s worth sweet fa) i always mount lenses with the lens in the closest focus setting (eg 0,7m or whatever that lens is) so that it doesn’t touch a lot the roller when i’m mounting the lens hth? --img--  21 minutes ago, jean-michel said: hi, see post number 15 here: https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/ please note that it is important to only use small increments and, very important, not to apply downward pressure on the roller. remember that infinity is quite a distance. i happen to be able to clearly see tall hydro towers some kilometres away to check infinity. i only had to do this once as my camera's rangefinder was slightly off at infinity. to check the rangefinder or lenses for close distances you can either purchase a calibrating device, or, download this -----> diy !!!  calibrator from http://squit.co.uk/photo/downloads.html you need to be careful in assembling the device — i printed on smooth paper and mounted the parts onto self adhesive foam core boards — it is well worth the effort. checking using the screen or evf is not sufficient; check the file on a computer screen. jean-michel thank you guys so much! it's really helpful and i feel much more confident to try it myself now. will give it a shot today!", "sortedWord": "None", "Identifyer": null, "identifyer": 14496, "year": "2021"}, {"autor": "Shu_downunder", "date": "2021-04-17 12:03:00", "content": " On 1/9/2020 at 4:26 PM, thgbrian said: Thank you all for the replies. Guess this isn't any sort of DIY fix. Has anyone else experienced this issue? I read one or two threads and they said they just knocked the dial and it worked lol. Have you fixed it? I got the same problem on mine as well now.", "link": "https://www.l-camera-forum.com/topic/305090-m240-shutter-speed-dial-misaligned/?tab=comments#comment-4183173", "origin": "L-forum", "suborigin": "305090-m240-shutter-speed-dial-misaligned", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " on 1/9/2020 at 4:26 pm, thgbrian said: thank you all for the replies. guess this isn't any sort of -----> diy !!!  fix. has anyone else experienced this issue? i read one or two threads and they said they just knocked the dial and it worked lol. have you fixed it? i got the same problem on mine as well now.", "sortedWord": "None", "Identifyer": null, "identifyer": 15368, "year": "2021"}, {"autor": "Casey Jefferson", "date": "2021-06-17 06:15:00", "content": "49 minutes ago, criolf said: I've order this: https://www.ebay.co.uk/itm/274365625004?hash=item3fe17732ac:g:iywAAOSw3nNevRL0 I'll follow the Bilibili video and attempt to dyi my M9P when it arrives (few weeks). I'll revert with details/results. Interesting, I think the size do fit the Leica S too with some trimming. A check of a DIY project and do update! PS: The author of the video do note a couple of important points - you shouldn't even wipe or touch anything below the filter glass, a single wipe or touch will simply leave residue that's impossible to remove. Also the glass lifting part was the most difficult and risky step, which I can imagine if the glass shatter there'll be debris forever stuck on the surface below. Edited June 17 by Casey Jefferson", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/16/?tab=comments#comment-4221402", "origin": "L-forum", "suborigin": "313260-sensor-corrosion-analysis-and-fix-merged", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "49 minutes ago, criolf said: i've order this: https://www.ebay.co.uk/itm/274365625004?hash=item3fe17732ac:g:iywaaosw3nnevrl0 i'll follow the bilibili video and attempt to dyi my m9p when it arrives (few weeks). i'll revert with details/results. interesting, i think the size do fit the leica s too with some trimming. a check of a -----> diy !!!  project and do update! ps: the author of the video do note a couple of important points - you shouldn't even wipe or touch anything below the filter glass, a single wipe or touch will simply leave residue that's impossible to remove. also the glass lifting part was the most difficult and risky step, which i can imagine if the glass shatter there'll be debris forever stuck on the surface below. edited june 17 by casey jefferson", "sortedWord": "None", "Identifyer": null, "identifyer": 30451, "year": "2021"}, {"autor": "adan", "date": "2021-10-03 17:57:00", "content": "On 9/25/2021 at 10:39 AM, haikos said: In the m9 series cameras, I normally try to use lens profile that closely matches design-wise (on paper) the lens I happen to be using and this, when I actually remember to change the profile after a lens change. That works. I use 35mm Summilux pre-ASPH coding/profile for the very-similar 35 f/1.4 Nokton I/II, and it looks great. One can also \"zero in\" on the best profile by trying ALL the menu options for a given focal length, and seeing if any one is noticably better. It should be noted that the only profiled correction done in-camera is for corner color stains and/or some vignetting, mostly with <50mm lenses. Distortion and such are not corrected by the camera - but having the lens type listed in the EXIF data allows post-processing software (PS/LR, C1, DxO) to make additional corrections (e.g. distortion, color aberrations). Note also that C/V lenses (and some Zeiss ZMs) can be coded semi-permanently with black pen/paint - unlike Leica's lenses, they have a recessed channel machined into the rear face of the lens mount that will prevent DIY coding from being rubbed off with use.", "link": "https://www.l-camera-forum.com/topic/324865-in-camera-lens-profiles/?tab=comments#comment-4285987", "origin": "L-forum", "suborigin": "324865-in-camera-lens-profiles", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "on 9/25/2021 at 10:39 am, haikos said: in the m9 series cameras, i normally try to use lens profile that closely matches design-wise (on paper) the lens i happen to be using and this, when i actually remember to change the profile after a lens change. that works. i use 35mm summilux pre-asph coding/profile for the very-similar 35 f/1.4 nokton i/ii, and it looks great. one can also \"zero in\" on the best profile by trying all the menu options for a given focal length, and seeing if any one is noticably better. it should be noted that the only profiled correction done in-camera is for corner color stains and/or some vignetting, mostly with <50mm lenses. distortion and such are not corrected by the camera - but having the lens type listed in the exif data allows post-processing software (ps/lr, c1, dxo) to make additional corrections (e.g. distortion, color aberrations). note also that c/v lenses (and some zeiss zms) can be coded semi-permanently with black pen/paint - unlike leica's lenses, they have a recessed channel machined into the rear face of the lens mount that will prevent -----> diy !!!  coding from being rubbed off with use.", "sortedWord": "None", "Identifyer": null, "identifyer": 31009, "year": "2021"}, {"autor": "dhc905", "date": "2021-01-25 19:01:00", "content": " I got the SD card locked error randomly after putting in the same SD card I've always used with my M9. I looked here for DIY fixes, tried everything from new battery, on/offs, air spraying the SD card socket, ordering new SD cards. Nothing worked. I then took it to the Leica store, and the great service associate there plugged in her personal card and voila, it seemed to magically fix everything. I immediately bought the same SD card, plugged it in, and it again didn't work. A few battery/SD card swaps later it had reverted back to SD Card Locked no matter what we did. Camera was off to New York. Received notice today that \"The Main Circuit Board\" needs to be replaced and is NLA. Would love to retain my camera (last time it was in service I got the latest and greatest M as a loaner and appreciated the functionality, but I still loved my camera) if there's anyway...", "link": "https://www.l-camera-forum.com/topic/317343-dreaded-sd-card-locked-error-now-my-camera-is-junk/?tab=comments#comment-4125506", "origin": "L-forum", "suborigin": "317343-dreaded-sd-card-locked-error-now-my-camera-is-junk", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " i got the sd card locked error randomly after putting in the same sd card i've always used with my m9. i looked here for -----> diy !!!  fixes, tried everything from new battery, on/offs, air spraying the sd card socket, ordering new sd cards. nothing worked. i then took it to the leica store, and the great service associate there plugged in her personal card and voila, it seemed to magically fix everything. i immediately bought the same sd card, plugged it in, and it again didn't work. a few battery/sd card swaps later it had reverted back to sd card locked no matter what we did. camera was off to new york. received notice today that \"the main circuit board\" needs to be replaced and is nla. would love to retain my camera (last time it was in service i got the latest and greatest m as a loaner and appreciated the functionality, but i still loved my camera) if there's anyway...", "sortedWord": "None", "Identifyer": null, "identifyer": 31809, "year": "2021"}, {"autor": "Ko.Fe.", "date": "2021-01-19 16:51:00", "content": "12 hours ago, boojum said: No. Should I? If they have more problems that is awful. Stable, reliable camera electronics are a fact. I have old Japanese cameras which work fine, like a Pentax K1000 and Pentax ME Super plus some old Sony digitals. I hope the M10's are not faulty but I now must check. Spaceba. I checked, few weeks ago. First four pages, back then, were with faults reports. Not any different from M9 sub-forum, if not worse. I never seen anything like this on Canon DSLRs forum. But those are not Leica. And Leica is not even Olympus, where you could map out dead pixels by DIY. I'm holding to my 220 M-E and if it will need update, I'll get something from M240 series. M10 price, quality issues are not for my pocket.", "link": "https://www.l-camera-forum.com/topic/317048-vertical-lines/?tab=comments#comment-4121447", "origin": "L-forum", "suborigin": "317048-vertical-lines", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "12 hours ago, boojum said: no. should i? if they have more problems that is awful. stable, reliable camera electronics are a fact. i have old japanese cameras which work fine, like a pentax k1000 and pentax me super plus some old sony digitals. i hope the m10's are not faulty but i now must check. spaceba. i checked, few weeks ago. first four pages, back then, were with faults reports. not any different from m9 sub-forum, if not worse. i never seen anything like this on canon dslrs forum. but those are not leica. and leica is not even olympus, where you could map out dead pixels by -----> diy !!! . i'm holding to my 220 m-e and if it will need update, i'll get something from m240 series. m10 price, quality issues are not for my pocket.", "sortedWord": "None", "Identifyer": null, "identifyer": 31867, "year": "2021"}, {"autor": "250swb", "date": "2021-11-06 07:59:00", "content": "I think if you are going to have something so hideous you may as well do some DIY (damage it yourself) like this M4 owner did https://cameraquest.com/lm4ap.htm Edited November 6 by 250swb", "link": "https://www.l-camera-forum.com/topic/326180-japan-camera-hunter-unveils-cherry-blossom-themed-m4/?tab=comments#comment-4308071", "origin": "L-forum", "suborigin": "326180-japan-camera-hunter-unveils-cherry-blossom-themed-m4", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i think if you are going to have something so hideous you may as well do some -----> diy !!!  (damage it yourself) like this m4 owner did https://cameraquest.com/lm4ap.htm edited november 6 by 250swb", "sortedWord": "None", "Identifyer": null, "identifyer": 300, "year": "2021"}, {"autor": "Herr Barnack", "date": "2021-11-06 13:20:00", "content": "5 hours ago, 250swb said: I think if you are going to have something so hideous you may as well do some DIY (damage it yourself) like this M4 owner did https://cameraquest.com/lm4ap.htm Now that is truly a thing of beauty!! As soon as my Fogg Last Waltz arrives, I'm going to send it off to the M4 painter and have him give the same treatment! 😅 Edited November 6 by Herr Barnack", "link": "https://www.l-camera-forum.com/topic/326180-japan-camera-hunter-unveils-cherry-blossom-themed-m4/?tab=comments#comment-4308216", "origin": "L-forum", "suborigin": "326180-japan-camera-hunter-unveils-cherry-blossom-themed-m4", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "5 hours ago, 250swb said: i think if you are going to have something so hideous you may as well do some -----> diy !!!  (damage it yourself) like this m4 owner did https://cameraquest.com/lm4ap.htm now that is truly a thing of beauty!! as soon as my fogg last waltz arrives, i'm going to send it off to the m4 painter and have him give the same treatment! 😅 edited november 6 by herr barnack", "sortedWord": "None", "Identifyer": null, "identifyer": 305, "year": "2021"}, {"autor": "Stuart Richardson", "date": "2021-08-07 09:21:00", "content": "Film has already undergone its contraction and subsequent expansion. It seems fairly stable at the moment.. It seems likely that things will carry on pretty similarly for the moment, though of course, no one knows what the future will hold. B&W is the most resilient and unlikely to go away, as it is the easiest and cheapest to make and easiest and cheapest to do. Glass plate or paper negatives are diy processes, so will always be there for anyone, regardless of commercial prospects. Color negative is the next largest group, and unlikely to go anywhere for the foreseeable future. E6 was in a very precarious position, but has had a recovery of late, with Kodak introducing a new E6 film and it being received well.. I don't think there is much danger of film being gone in ten years...if it is, I think it probably means very bad news for the world, and film will be the last thing we are thinking about...", "link": "https://www.l-camera-forum.com/topic/323361-is-it-worth-buying-analogue-in-2021/?tab=comments#comment-4252673", "origin": "L-forum", "suborigin": "323361-is-it-worth-buying-analogue-in-2021", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "film has already undergone its contraction and subsequent expansion. it seems fairly stable at the moment.. it seems likely that things will carry on pretty similarly for the moment, though of course, no one knows what the future will hold. b&w is the most resilient and unlikely to go away, as it is the easiest and cheapest to make and easiest and cheapest to do. glass plate or paper negatives are -----> diy !!!  processes, so will always be there for anyone, regardless of commercial prospects. color negative is the next largest group, and unlikely to go anywhere for the foreseeable future. e6 was in a very precarious position, but has had a recovery of late, with kodak introducing a new e6 film and it being received well.. i don't think there is much danger of film being gone in ten years...if it is, i think it probably means very bad news for the world, and film will be the last thing we are thinking about...", "sortedWord": "None", "Identifyer": null, "identifyer": 763, "year": "2021"}, {"autor": "Ko.Fe.", "date": "2021-08-08 13:21:00", "content": "On 8/7/2021 at 4:56 AM, Reactivestills said: Hi All, I will be looking to purchase two of the same body in the coming months. Either M-A/P In your honest opinion is it worth buying a film Leica in 2021/22 - Will Leica cease to care about analogue cameras Or am I better holding on for digital and paying double the cost. I enjoy both formats but if film processing and sales dwindle in the next 10 years will it be a complete waste of money. Please advise. Thanks Most likely film M bodies will be retrofittable with digital kits on regular basis at some point. They are even now, but it is DIY. For now and another decade film is OK. It just getting more and more overpriced due to shrinking market. If you are looking at getting one decent print once a month or few decent scans few times per year, then film is your thing. It is not productive, nor convenient. You have to pay a lot for darkroom paper and more and more for film. Buy digital and ten years from now it might become obsolete without parts for service. But you will get lot more keepers during these ten years.", "link": "https://www.l-camera-forum.com/topic/323361-is-it-worth-buying-analogue-in-2021/page/4/?tab=comments#comment-4253379", "origin": "L-forum", "suborigin": "323361-is-it-worth-buying-analogue-in-2021", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "on 8/7/2021 at 4:56 am, reactivestills said: hi all, i will be looking to purchase two of the same body in the coming months. either m-a/p in your honest opinion is it worth buying a film leica in 2021/22 - will leica cease to care about analogue cameras or am i better holding on for digital and paying double the cost. i enjoy both formats but if film processing and sales dwindle in the next 10 years will it be a complete waste of money. please advise. thanks most likely film m bodies will be retrofittable with digital kits on regular basis at some point. they are even now, but it is -----> diy !!! . for now and another decade film is ok. it just getting more and more overpriced due to shrinking market. if you are looking at getting one decent print once a month or few decent scans few times per year, then film is your thing. it is not productive, nor convenient. you have to pay a lot for darkroom paper and more and more for film. buy digital and ten years from now it might become obsolete without parts for service. but you will get lot more keepers during these ten years.", "sortedWord": "None", "Identifyer": null, "identifyer": 839, "year": "2021"}, {"autor": "a.noctilux", "date": "2021-07-04 19:36:00", "content": " 47 minutes ago, roelandinho said: Next question: what is the small black plastic dot right next to the shutter speed dial on the modern film cameras? Very simple, it hides the hole access to adjust the shutter without opening the camera. Two users possible, when in production and when in \"CLAed\" or if the user wants to diy finetuning shutter ...", "link": "https://www.l-camera-forum.com/topic/322401-leica-m-a-shutter-speed-dial-notch/?tab=comments#comment-4231827", "origin": "L-forum", "suborigin": "322401-leica-m-a-shutter-speed-dial-notch", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " 47 minutes ago, roelandinho said: next question: what is the small black plastic dot right next to the shutter speed dial on the modern film cameras? very simple, it hides the hole access to adjust the shutter without opening the camera. two users possible, when in production and when in \"claed\" or if the user wants to -----> diy !!!  finetuning shutter ...", "sortedWord": "None", "Identifyer": null, "identifyer": 2347, "year": "2021"}, {"autor": "AndreasG", "date": "2021-08-03 18:01:00", "content": "Have a look here, for the DIY guys:", "link": "https://www.l-camera-forum.com/topic/323203-leicameter-mr-4/?tab=comments#comment-4250549", "origin": "L-forum", "suborigin": "323203-leicameter-mr-4", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "have a look here, for the -----> diy !!!  guys:", "sortedWord": "None", "Identifyer": null, "identifyer": 2561, "year": "2021"}, {"autor": "jaapv", "date": "2021-07-28 11:19:00", "content": " Sheesh. This is the simplest adjustment possible for a halfway-competent technician or even DIY. Is there no Leica Store in your vicinity? And buy a camera for one film in three years? https://us.leica-camera.com/Stores-Dealers/Leica-Stores-Worldwide/Leica-Store-Bangkok https://us.leica-camera.com/Stores-Dealers/Leica-Stores-Worldwide/Leica-Store-Manila", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/4/?tab=comments#comment-4246706", "origin": "L-forum", "suborigin": "294513-leica-m-a-problem", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " sheesh. this is the simplest adjustment possible for a halfway-competent technician or even -----> diy !!! . is there no leica store in your vicinity? and buy a camera for one film in three years? https://us.leica-camera.com/stores-dealers/leica-stores-worldwide/leica-store-bangkok https://us.leica-camera.com/stores-dealers/leica-stores-worldwide/leica-store-manila", "sortedWord": "None", "Identifyer": null, "identifyer": 2789, "year": "2021"}, {"autor": "ianman", "date": "2021-07-31 09:40:00", "content": "On 7/28/2021 at 1:19 PM, jaapv said: Sheesh. This is the simplest adjustment possible for a halfway-competent technician or even DIY. Is there no Leica Store in your vicinity? And buy a camera for one film in three years? This may be helpful. Disclaimer: I've never needed to do this so I cannot say if the instructions given here are good or not. Maybe someone else can comment on that.", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/4/?tab=comments#comment-4248528", "origin": "L-forum", "suborigin": "294513-leica-m-a-problem", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "on 7/28/2021 at 1:19 pm, jaapv said: sheesh. this is the simplest adjustment possible for a halfway-competent technician or even -----> diy !!! . is there no leica store in your vicinity? and buy a camera for one film in three years? this may be helpful. disclaimer: i've never needed to do this so i cannot say if the instructions given here are good or not. maybe someone else can comment on that.", "sortedWord": "None", "Identifyer": null, "identifyer": 2800, "year": "2021"}, {"autor": "Ecar", "date": "2021-08-05 20:29:00", "content": "4 hours ago, Cayenne said: Do you have recommendations for fast Canon/Nikkor lenses to look into for use on the MA? Thank you very much for the reply!! cayenne Canon 50/1.4 or 50/1.8 (get the earlier, silver brass, heavier version of the latter, which is not prone to fogging). The Canon 50/1.2 is also an interesting lens, but finding one that doesn't haze on the penultimate rear element may take several iterations (rather easy to DIY clean though). Nikkor 50/1.4 or 50/2. Both are Sonnar designs. Note that some lenses on the used market may seem to be significantly more expensive than others for no apparent reason. This is due to rarity of some of the versions, batches, etc. I'd just start by buying on the basis of condition at a price that makes sense. Fast 35mm LTM lenses from Nikon or Canon tend to be rather expensive. The Canon 35/2 may be your best bet. For fast longer lenses, the Nikkor 85/2 is not too hard to find in good condition at very decent prices. Canon 85mm lenses are a mixed bag in terms of size/weight, IQ and price: I'd pick the 85/1.8, although it's not cheap. For RF use, make sure you get the appropriate LTM to M adapter (ie, the one that matches the focal length of the lens) so that it brings up the correct framelines. Adapters usually come in 50-75, 28-90 and 35-135 versions. Edited August 5 by Ecar", "link": "https://www.l-camera-forum.com/topic/323312-leica-ma-adapting-lenses-question-ltml39-russian-l39etc-what-fits-and-works-with-leica-m-film-bodies/?tab=comments#comment-4251901", "origin": "L-forum", "suborigin": "323312-leica-ma-adapting-lenses-question-ltml39-russian-l39etc-what-fits-and-works-with-leica-m-film-bodies", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "4 hours ago, cayenne said: do you have recommendations for fast canon/nikkor lenses to look into for use on the ma? thank you very much for the reply!! cayenne canon 50/1.4 or 50/1.8 (get the earlier, silver brass, heavier version of the latter, which is not prone to fogging). the canon 50/1.2 is also an interesting lens, but finding one that doesn't haze on the penultimate rear element may take several iterations (rather easy to -----> diy !!!  clean though). nikkor 50/1.4 or 50/2. both are sonnar designs. note that some lenses on the used market may seem to be significantly more expensive than others for no apparent reason. this is due to rarity of some of the versions, batches, etc. i'd just start by buying on the basis of condition at a price that makes sense. fast 35mm ltm lenses from nikon or canon tend to be rather expensive. the canon 35/2 may be your best bet. for fast longer lenses, the nikkor 85/2 is not too hard to find in good condition at very decent prices. canon 85mm lenses are a mixed bag in terms of size/weight, iq and price: i'd pick the 85/1.8, although it's not cheap. for rf use, make sure you get the appropriate ltm to m adapter (ie, the one that matches the focal length of the lens) so that it brings up the correct framelines. adapters usually come in 50-75, 28-90 and 35-135 versions. edited august 5 by ecar", "sortedWord": "None", "Identifyer": null, "identifyer": 3023, "year": "2021"}, {"autor": "Jon Warwick", "date": "2021-08-01 18:17:00", "content": " Vertical alignment looks perfect at infinity. BUT ...vertical alignment is incorrect at the close focus range for head portraits, ie, the eyeball in the rangefinder patch is very slightly higher than where it should be. This makes precise focus on the eyeball harder because (even with a slight misalignment) the image through the viewfinder never sharply \"snaps\" into view! How is it possible that Vertical calibration is perfect at infinity ....but not close up? I only have 1 lens so haven't tested with another lens, but presumably it's rangefinder calibration that can only cause this problem, and not a specific lens? Also is there a DIY fix to this on the M7, or really something only for an expert ....I'm already wondering how adjusting the Vertical for close-up won't throw off the perfect alignment at infinity? Edited August 1 by Jon Warwick", "link": "https://www.l-camera-forum.com/topic/323225-m7-perfect-vertical-calibration-at-infinity-but-not-at-close-focus/?tab=comments#comment-4249474", "origin": "L-forum", "suborigin": "323225-m7-perfect-vertical-calibration-at-infinity-but-not-at-close-focus", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " vertical alignment looks perfect at infinity. but ...vertical alignment is incorrect at the close focus range for head portraits, ie, the eyeball in the rangefinder patch is very slightly higher than where it should be. this makes precise focus on the eyeball harder because (even with a slight misalignment) the image through the viewfinder never sharply \"snaps\" into view! how is it possible that vertical calibration is perfect at infinity ....but not close up? i only have 1 lens so haven't tested with another lens, but presumably it's rangefinder calibration that can only cause this problem, and not a specific lens? also is there a -----> diy !!!  fix to this on the m7, or really something only for an expert ....i'm already wondering how adjusting the vertical for close-up won't throw off the perfect alignment at infinity? edited august 1 by jon warwick", "sortedWord": "None", "Identifyer": null, "identifyer": 3098, "year": "2021"}, {"autor": "a.noctilux", "date": "2021-04-11 14:06:00", "content": "Too bad, you may use your lens from f:2.8 onward then, while waiting services. For me the tolerance is on the borderline, your lens (even newly serviced) or M-A or both may need adjustments. Not DIY which can be worse. Edited April 11 by a.noctilux", "link": "https://www.l-camera-forum.com/topic/319804-leica-m-a-rangefinder-alignment-questions/?tab=comments#comment-4179113", "origin": "L-forum", "suborigin": "319804-leica-m-a-rangefinder-alignment-questions", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "too bad, you may use your lens from f:2.8 onward then, while waiting services. for me the tolerance is on the borderline, your lens (even newly serviced) or m-a or both may need adjustments. not -----> diy !!!  which can be worse. edited april 11 by a.noctilux", "sortedWord": "None", "Identifyer": null, "identifyer": 4477, "year": "2021"}, {"autor": "dsj", "date": "2021-04-12 17:03:00", "content": "It certainly looks like a bit of a DIY job. I sincerely doubt that it left the factory this way. A previous owner might have been worried that the wheel might get knocked out of shape. I think it should certainly affect the value, negatively. Thank you for sharing this, it is definitely interesting to see.", "link": "https://www.l-camera-forum.com/topic/319819-anybody-knows-what-this-may-be-leica-m5/?tab=comments#comment-4179914", "origin": "L-forum", "suborigin": "319819-anybody-knows-what-this-may-be-leica-m5", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "it certainly looks like a bit of a -----> diy !!!  job. i sincerely doubt that it left the factory this way. a previous owner might have been worried that the wheel might get knocked out of shape. i think it should certainly affect the value, negatively. thank you for sharing this, it is definitely interesting to see.", "sortedWord": "None", "Identifyer": null, "identifyer": 4806, "year": "2021"}, {"autor": "lct", "date": "2021-12-03 17:35:00", "content": " 23 hours ago, cbgrey said: I'm trying to code a Voigtlander 35mm f/2 as a 35 'Cron. Your coding seems correct if you mean Summicron 35/2 asph. I suspect the problem comes from the black paint or sharpie you've been using. My DIY coding of the CV 35/2 is far from clean but it works perfectly on both my M240 and digital CL with black nail polish. --img-- ", "link": "https://www.l-camera-forum.com/topic/327127-diy-6-bit-coding-on-voigtlanderwhat-am-i-doing-wrong/?tab=comments#comment-4325441", "origin": "L-forum", "suborigin": "327127-diy-6-bit-coding-on-voigtlanderwhat-am-i-doing-wrong", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " 23 hours ago, cbgrey said: i'm trying to code a voigtlander 35mm f/2 as a 35 'cron. your coding seems correct if you mean summicron 35/2 asph. i suspect the problem comes from the black paint or sharpie you've been using. my -----> diy !!!  coding of the cv 35/2 is far from clean but it works perfectly on both my m240 and digital cl with black nail polish. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 8329, "year": "2021"}, {"autor": "grahamc", "date": "2021-07-01 01:50:00", "content": "Very quick test run wide-open with newly-delivered 35mm 1.4 Pre-ASPH v2 @ MD-262. I think I'm really going to enjoy this lens . Didn't really experience any particularly unruly flaring on the test run. Overall definitely fits the look I was hoping to get when acquiring this lens Planning to do some pretty rudimentary side by sides with my Summicron v4 later to compare performance if anyone's interested I can share . Will be a very DIY approach I'm definitely not a lens tester. Mainly I'm interested to see sharpness and contrast of my own copies stopped down past F2 etc --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/288041-35mm-14-summilux-pre-asph/page/14/?tab=comments#comment-4229283", "origin": "L-forum", "suborigin": "288041-35mm-14-summilux-pre-asph", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "very quick test run wide-open with newly-delivered 35mm 1.4 pre-asph v2 @ md-262. i think i'm really going to enjoy this lens . didn't really experience any particularly unruly flaring on the test run. overall definitely fits the look i was hoping to get when acquiring this lens planning to do some pretty rudimentary side by sides with my summicron v4 later to compare performance if anyone's interested i can share . will be a very -----> diy !!!  approach i'm definitely not a lens tester. mainly i'm interested to see sharpness and contrast of my own copies stopped down past f2 etc --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 11387, "year": "2021"}, {"autor": "evikne", "date": "2021-07-01 05:43:00", "content": "3 hours ago, grahamc said: Planning to do some pretty rudimentary side by sides with my Summicron v4 later to compare performance if anyone's interested I can share . Will be a very DIY approach I'm definitely not a lens tester. Mainly I'm interested to see sharpness and contrast of my own copies stopped down past F2 etc Congrats with your new lens! A comparison of these two lenses is something that people often ask for and will surely be appreciated. I've had both myself (twice), but never at the same time, so I couldn't do any direct comparison.", "link": "https://www.l-camera-forum.com/topic/288041-35mm-14-summilux-pre-asph/page/14/?tab=comments#comment-4229326", "origin": "L-forum", "suborigin": "288041-35mm-14-summilux-pre-asph", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "3 hours ago, grahamc said: planning to do some pretty rudimentary side by sides with my summicron v4 later to compare performance if anyone's interested i can share . will be a very -----> diy !!!  approach i'm definitely not a lens tester. mainly i'm interested to see sharpness and contrast of my own copies stopped down past f2 etc congrats with your new lens! a comparison of these two lenses is something that people often ask for and will surely be appreciated. i've had both myself (twice), but never at the same time, so i couldn't do any direct comparison.", "sortedWord": "None", "Identifyer": null, "identifyer": 11388, "year": "2021"}, {"autor": "ianman", "date": "2021-07-05 15:35:00", "content": "On 7/1/2021 at 3:50 AM, grahamc said: Very quick test run wide-open with newly-delivered 35mm 1.4 Pre-ASPH v2 @ MD-262. I think I'm really going to enjoy this lens . Didn't really experience any particularly unruly flaring on the test run. Overall definitely fits the look I was hoping to get when acquiring this lens Planning to do some pretty rudimentary side by sides with my Summicron v4 later to compare performance if anyone's interested I can share . Will be a very DIY approach I'm definitely not a lens tester. Mainly I'm interested to see sharpness and contrast of my own copies stopped down past F2 etc --img--  --img--  Lovely colours!!! Right up my street!", "link": "https://www.l-camera-forum.com/topic/288041-35mm-14-summilux-pre-asph/page/15/?tab=comments#comment-4232300", "origin": "L-forum", "suborigin": "288041-35mm-14-summilux-pre-asph", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "on 7/1/2021 at 3:50 am, grahamc said: very quick test run wide-open with newly-delivered 35mm 1.4 pre-asph v2 @ md-262. i think i'm really going to enjoy this lens . didn't really experience any particularly unruly flaring on the test run. overall definitely fits the look i was hoping to get when acquiring this lens planning to do some pretty rudimentary side by sides with my summicron v4 later to compare performance if anyone's interested i can share . will be a very -----> diy !!!  approach i'm definitely not a lens tester. mainly i'm interested to see sharpness and contrast of my own copies stopped down past f2 etc --img--  --img--  lovely colours!!! right up my street!", "sortedWord": "None", "Identifyer": null, "identifyer": 11401, "year": "2021"}, {"autor": "plaidshirts", "date": "2021-11-22 17:19:00", "content": "On 11/10/2021 at 12:57 PM, egrossman said: Further update: despite Don Goldberg's recommendation, I didn't have any success getting the camera to read the Gaia paint-coded Leica flange. Removed the paint with a toothpick and went back to the Uni Posca paint pens which worked. Erik I've ordered flanges on eBay for the 28 ASPH, 35 ASPH, 90 Elmarit, and Voigtlander 50 Apo and have had good luck with all on my M9. It's nice to know that there is a Leica option for sure. Joel Hello Erik and Joel, Was the install of the new flange straight forward? Do you have any recommendations for the DIY job? Thank you, Dan Edited November 22 by plaidshirts", "link": "https://www.l-camera-forum.com/topic/325769-6-bit-coded-leica-flanges/?tab=comments#comment-4318239", "origin": "L-forum", "suborigin": "325769-6-bit-coded-leica-flanges", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "on 11/10/2021 at 12:57 pm, egrossman said: further update: despite don goldberg's recommendation, i didn't have any success getting the camera to read the gaia paint-coded leica flange. removed the paint with a toothpick and went back to the uni posca paint pens which worked. erik i've ordered flanges on ebay for the 28 asph, 35 asph, 90 elmarit, and voigtlander 50 apo and have had good luck with all on my m9. it's nice to know that there is a leica option for sure. joel hello erik and joel, was the install of the new flange straight forward? do you have any recommendations for the -----> diy !!!  job? thank you, dan edited november 22 by plaidshirts", "sortedWord": "None", "Identifyer": null, "identifyer": 13507, "year": "2021"}, {"autor": "egrossman", "date": "2021-11-22 18:50:00", "content": "1 hour ago, plaidshirts said: Hello Erik and Joel, Was the install of the new flange straight forward? Do you have any recommendations for the DIY job? Thank you, Dan The installation was very straight forward. The painting of the flange is a little harder as the target area is tiny. In the end I went back to using the paint pens as it was easier to do. Erik", "link": "https://www.l-camera-forum.com/topic/325769-6-bit-coded-leica-flanges/?tab=comments#comment-4318315", "origin": "L-forum", "suborigin": "325769-6-bit-coded-leica-flanges", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "1 hour ago, plaidshirts said: hello erik and joel, was the install of the new flange straight forward? do you have any recommendations for the -----> diy !!!  job? thank you, dan the installation was very straight forward. the painting of the flange is a little harder as the target area is tiny. in the end i went back to using the paint pens as it was easier to do. erik", "sortedWord": "None", "Identifyer": null, "identifyer": 13509, "year": "2021"}, {"autor": "grahamc", "date": "2021-11-17 10:32:00", "content": "43 minutes ago, pop said: Lens codes are not arcane mysteries. If a lens is coded, you see that right away. Once you know what those codes look like, you also see right away when a lens is not coded. There are many sites in the internet with examples and explanations, such as this one: https://www.devonbuy.com/how-to-6-bit-code-leica-m-lens/ (I am not associated in any way with that site; I just picked one at random) Any digital Leica M camera with reasonably recent software will be able to recognize every M lens which is correctly coded and mounted. The software in the camera contains a table which lists every known code. The camera might mistake uncoded lenses for coded ones when there are scews or other things (dirt, for instance) where the camera expects the dark and light spots of the code. In this case, the camera will claim that one of the coded lenses was mounted when there is, in fact, quite a differernt lens, usually elderly, certainly without any code. The camera also might misread an existing correct code when the 'code reader' (the eyes that should see the code) are not clean enough or broken. When you mount an uncoded lens, the camera will show you a list of all (uncoded) M-Lenses known to Leica, so that you can tell the camera what lens you mounted. From then on, the camera will name that lens in the EXIF data until you mount a coded lens. I think the camera remembers that uncoded lens and will use that information when later you mount an uncoded lens again, but I'm not sure about that. I don't own any digital M cameras any more. The adapter for mounting R lenses to the M camera is mentioned above. This adapter is coded, just like the lenses are, and its code tells the camera (unsurprisingly) that it is an adapter and that it accepts R type lenses. I rather think that in this case you then tell the camera which of the supported R type lenses is mounted, but I don't know that. When your camera mentions the Leica R adapter it can do so for two reasons: One, there is a Leica R adapter mounted. Two, it misread the code and there's is something else mounted. You tell us. Thanks Philipp for the detailed info. None of my Leica lenses are coded, and as you've pointed out I'm sure that because of this I would have immediately have noticed that this lens was coded, had it arrived to me either 'properly' coded, or DIY coded from a previous owner . This is good to know. None of my other lenses are coded (and let's presume this one isn't either), and they all show 'Leica R Adaptor'. So I just interpret this to be 'unknown lens', since I don't have an R adaptor. The same EXIF data reading appeared when I used one of my lenses on my friends M10R, so I don't think this is particular to my camera, it is perhaps common for uncoded lenses. For the lens in question, the camera was certainly recognising it previously as a 35 Summicron. If that was through dirt on the flange then it would seem unlikely (although not impossible) that it 'guessed' it correctly (I know that's not what you were suggesting and that you were talking in general terms about how the coding and reading works). So let's presume that the naming information is not coming from the lens, it must be manually set on the camera. The curious thing is that the M10-D doesn't have this functionality (unlike other digital M's). Or at least if it does it's not common knowledge ... many others on this forum don't think it does / don't know how to do it . Despite this, if it was done at the camera end then it certainly wasn't manually input by myself because I don't know how to do it. So it would've had to be done by a previous owner with the same lens and for it to have been the last one they manually entered, in the way you explained. Seems unlikely especially given the M10-D not having this functionality, but maybe not impossible. Understand that it's not voodoo but with these parameters it's quite hard to determine how/where this lens was getting named into EXIF . I'm curious as to what the technician says regarding whether they cleaned off anything from the flange but I just can't imagine having this lens and not noticing that kind of DIY. And the previous owner also said it's not 6-BIT coded. All things considered, maybe the real mystery is how someone manually coded a lens-type into an M10-D. Or some dirt on the flange was indeed being 'read' as the correct lens by some stroke of luck, and is now clean. Edited November 17 by grahamc", "link": "https://www.l-camera-forum.com/topic/326671-lens-naming-6-bit-code-has-vanished-after-service-352-v4-m10-d/?tab=comments#comment-4315096", "origin": "L-forum", "suborigin": "326671-lens-naming-6-bit-code-has-vanished-after-service-352-v4-m10-d", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "43 minutes ago, pop said: lens codes are not arcane mysteries. if a lens is coded, you see that right away. once you know what those codes look like, you also see right away when a lens is not coded. there are many sites in the internet with examples and explanations, such as this one: https://www.devonbuy.com/how-to-6-bit-code-leica-m-lens/ (i am not associated in any way with that site; i just picked one at random) any digital leica m camera with reasonably recent software will be able to recognize every m lens which is correctly coded and mounted. the software in the camera contains a table which lists every known code. the camera might mistake uncoded lenses for coded ones when there are scews or other things (dirt, for instance) where the camera expects the dark and light spots of the code. in this case, the camera will claim that one of the coded lenses was mounted when there is, in fact, quite a differernt lens, usually elderly, certainly without any code. the camera also might misread an existing correct code when the 'code reader' (the eyes that should see the code) are not clean enough or broken. when you mount an uncoded lens, the camera will show you a list of all (uncoded) m-lenses known to leica, so that you can tell the camera what lens you mounted. from then on, the camera will name that lens in the exif data until you mount a coded lens. i think the camera remembers that uncoded lens and will use that information when later you mount an uncoded lens again, but i'm not sure about that. i don't own any digital m cameras any more. the adapter for mounting r lenses to the m camera is mentioned above. this adapter is coded, just like the lenses are, and its code tells the camera (unsurprisingly) that it is an adapter and that it accepts r type lenses. i rather think that in this case you then tell the camera which of the supported r type lenses is mounted, but i don't know that. when your camera mentions the leica r adapter it can do so for two reasons: one, there is a leica r adapter mounted. two, it misread the code and there's is something else mounted. you tell us. thanks philipp for the detailed info. none of my leica lenses are coded, and as you've pointed out i'm sure that because of this i would have immediately have noticed that this lens was coded, had it arrived to me either 'properly' coded, or -----> diy !!!  coded from a previous owner . this is good to know. none of my other lenses are coded (and let's presume this one isn't either), and they all show 'leica r adaptor'. so i just interpret this to be 'unknown lens', since i don't have an r adaptor. the same exif data reading appeared when i used one of my lenses on my friends m10r, so i don't think this is particular to my camera, it is perhaps common for uncoded lenses. for the lens in question, the camera was certainly recognising it previously as a 35 summicron. if that was through dirt on the flange then it would seem unlikely (although not impossible) that it 'guessed' it correctly (i know that's not what you were suggesting and that you were talking in general terms about how the coding and reading works). so let's presume that the naming information is not coming from the lens, it must be manually set on the camera. the curious thing is that the m10-d doesn't have this functionality (unlike other digital m's). or at least if it does it's not common knowledge ... many others on this forum don't think it does / don't know how to do it . despite this, if it was done at the camera end then it certainly wasn't manually input by myself because i don't know how to do it. so it would've had to be done by a previous owner with the same lens and for it to have been the last one they manually entered, in the way you explained. seems unlikely especially given the m10-d not having this functionality, but maybe not impossible. understand that it's not voodoo but with these parameters it's quite hard to determine how/where this lens was getting named into exif . i'm curious as to what the technician says regarding whether they cleaned off anything from the flange but i just can't imagine having this lens and not noticing that kind of diy. and the previous owner also said it's not 6-bit coded. all things considered, maybe the real mystery is how someone manually coded a lens-type into an m10-d. or some dirt on the flange was indeed being 'read' as the correct lens by some stroke of luck, and is now clean. edited november 17 by grahamc", "sortedWord": "None", "Identifyer": null, "identifyer": 14334, "year": "2021"}, {"autor": "grahamc", "date": "2021-11-17 11:08:00", "content": " Maybe the lens wasn't mounting properly on occasion and was manually entered into the 10-D, so only sent lens info when mounted properly . That doesn't explain why it's now showing R Adaptor again though as I checked the mounting when I noticed it was no longer showing the lens name. I'll update when the tech gets back to me, eg if he saw any DIY on the lens (unlikely)", "link": "https://www.l-camera-forum.com/topic/326671-lens-naming-6-bit-code-has-vanished-after-service-352-v4-m10-d/page/2/?tab=comments#comment-4315133", "origin": "L-forum", "suborigin": "326671-lens-naming-6-bit-code-has-vanished-after-service-352-v4-m10-d", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " maybe the lens wasn't mounting properly on occasion and was manually entered into the 10-d, so only sent lens info when mounted properly . that doesn't explain why it's now showing r adaptor again though as i checked the mounting when i noticed it was no longer showing the lens name. i'll update when the tech gets back to me, eg if he saw any -----> diy !!!  on the lens (unlikely)", "sortedWord": "None", "Identifyer": null, "identifyer": 14338, "year": "2021"}, {"autor": "grahamc", "date": "2021-11-17 11:18:00", "content": "11 minutes ago, a.noctilux said: Ah 6bit coding mysteries ... We had some discussions a while back, in this thread I remember ! The funny thing is I never originally thought this lens was coded, it just started 'sending' the (correct) lens name soon after I got the M10-D, so I just carried on and it was a nice surprise. Considering that my early photos on the 10-D don't show the correct lens name, this points to the fact that the ex owner of this camera didn't manually place it in the settings (it's also impossible to do so as far as we know). We can also safely say this lens wasn't 6 BIT coded 'properly' (the previous owner said it wasn't) or DIY (I would've noticed in a heartbeat and posted here) . So this only leaves one option - Dirt on the flange being read as the correct lens. if @pop has experienced that then it's not inconceivable that it was just a happy accident on this occasion that resulted in sending the right lens type from the many available. I still think it's extremely odd , but working through all the scenarios it seems to be the most likely . Edited November 17 by grahamc", "link": "https://www.l-camera-forum.com/topic/326671-lens-naming-6-bit-code-has-vanished-after-service-352-v4-m10-d/page/2/?tab=comments#comment-4315139", "origin": "L-forum", "suborigin": "326671-lens-naming-6-bit-code-has-vanished-after-service-352-v4-m10-d", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "11 minutes ago, a.noctilux said: ah 6bit coding mysteries ... we had some discussions a while back, in this thread i remember ! the funny thing is i never originally thought this lens was coded, it just started 'sending' the (correct) lens name soon after i got the m10-d, so i just carried on and it was a nice surprise. considering that my early photos on the 10-d don't show the correct lens name, this points to the fact that the ex owner of this camera didn't manually place it in the settings (it's also impossible to do so as far as we know). we can also safely say this lens wasn't 6 bit coded 'properly' (the previous owner said it wasn't) or -----> diy !!!  (i would've noticed in a heartbeat and posted here) . so this only leaves one option - dirt on the flange being read as the correct lens. if @pop has experienced that then it's not inconceivable that it was just a happy accident on this occasion that resulted in sending the right lens type from the many available. i still think it's extremely odd , but working through all the scenarios it seems to be the most likely . edited november 17 by grahamc", "sortedWord": "None", "Identifyer": null, "identifyer": 14341, "year": "2021"}, {"autor": "Ecar", "date": "2021-09-09 20:13:00", "content": "1 hour ago, Al Brown said: Are Voigtlander VM lenses 6-bit coded? (I do not own any, sorry). No, you need to DIY.", "link": "https://www.l-camera-forum.com/topic/323521-rumor-new-heliar-classic-50mm-f15-vm/page/4/?tab=comments#comment-4272601", "origin": "L-forum", "suborigin": "323521-rumor-new-heliar-classic-50mm-f15-vm", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "1 hour ago, al brown said: are voigtlander vm lenses 6-bit coded? (i do not own any, sorry). no, you need to -----> diy !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 14589, "year": "2021"}, {"autor": "FrozenInTime", "date": "2021-09-16 19:48:00", "content": "1 hour ago, Al Brown said: Looks 100% legit. Are you happy with the lens? Yes, having fun. I think it's a keeper ; character of a MS Optics lens without the ergonomic quirks. The DIY centre spot filter seems to perfectly balance out the f/1.5 falloff --img-- ", "link": "https://www.l-camera-forum.com/topic/323521-rumor-new-heliar-classic-50mm-f15-vm/page/6/?tab=comments#comment-4276329", "origin": "L-forum", "suborigin": "323521-rumor-new-heliar-classic-50mm-f15-vm", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "1 hour ago, al brown said: looks 100% legit. are you happy with the lens? yes, having fun. i think it's a keeper ; character of a ms optics lens without the ergonomic quirks. the -----> diy !!!  centre spot filter seems to perfectly balance out the f/1.5 falloff --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 14640, "year": "2021"}, {"autor": "cboy", "date": "2021-09-17 10:37:00", "content": " 14 hours ago, FrozenInTime said: Yes, having fun. I think it's a keeper ; character of a MS Optics lens without the ergonomic quirks. The DIY centre spot filter seems to perfectly balance out the f/1.5 falloff --img--  Whoa, glowy! 😀. If no one had said this came from the new heliar id assume it had been taken with a diffusion filter applied to it. Hope to see future portrait shots which is were this lens would perform the most id imagine. I guess theres no need to buy a diffusion filter...or do you 🤔 ie max glow. Congrats to all those who all ready gotten a copy. All the best Edited September 17 by cboy", "link": "https://www.l-camera-forum.com/topic/323521-rumor-new-heliar-classic-50mm-f15-vm/page/7/?tab=comments#comment-4276561", "origin": "L-forum", "suborigin": "323521-rumor-new-heliar-classic-50mm-f15-vm", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " 14 hours ago, frozenintime said: yes, having fun. i think it's a keeper ; character of a ms optics lens without the ergonomic quirks. the -----> diy !!!  centre spot filter seems to perfectly balance out the f/1.5 falloff --img--  whoa, glowy! 😀. if no one had said this came from the new heliar id assume it had been taken with a diffusion filter applied to it. hope to see future portrait shots which is were this lens would perform the most id imagine. i guess theres no need to buy a diffusion filter...or do you 🤔 ie max glow. congrats to all those who all ready gotten a copy. all the best edited september 17 by cboy", "sortedWord": "None", "Identifyer": null, "identifyer": 14642, "year": "2021"}, {"autor": "ianman", "date": "2021-09-17 11:55:00", "content": "1 hour ago, cboy said: If no one had said this came from the new heliar id assume it had been taken with a diffusion filter applied to it. What if someone wrote \"The DIY centre spot filter seems to perfectly balance out the f/1.5 falloff\"?", "link": "https://www.l-camera-forum.com/topic/323521-rumor-new-heliar-classic-50mm-f15-vm/page/7/?tab=comments#comment-4276604", "origin": "L-forum", "suborigin": "323521-rumor-new-heliar-classic-50mm-f15-vm", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "1 hour ago, cboy said: if no one had said this came from the new heliar id assume it had been taken with a diffusion filter applied to it. what if someone wrote \"the -----> diy !!!  centre spot filter seems to perfectly balance out the f/1.5 falloff\"?", "sortedWord": "None", "Identifyer": null, "identifyer": 14644, "year": "2021"}, {"autor": "FrozenInTime", "date": "2021-09-17 12:44:00", "content": "1 hour ago, cboy said: Whoa, glowy! 😀. If no one had said this came from the new heliar id assume it had been taken with a diffusion filter applied to it. 46 minutes ago, ianman said: What if someone wrote \"The DIY centre spot filter seems to perfectly balance out the f/1.5 falloff\"? \\--img--  First tried a 18 mm diameter sized dot , then increased it to 24 mm as used for the photos shown. The dot seems invisible through the viewfinder at f/1.5 and f/2 then increasingly appears as stopped down further.", "link": "https://www.l-camera-forum.com/topic/323521-rumor-new-heliar-classic-50mm-f15-vm/page/7/?tab=comments#comment-4276624", "origin": "L-forum", "suborigin": "323521-rumor-new-heliar-classic-50mm-f15-vm", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "1 hour ago, cboy said: whoa, glowy! 😀. if no one had said this came from the new heliar id assume it had been taken with a diffusion filter applied to it. 46 minutes ago, ianman said: what if someone wrote \"the -----> diy !!!  centre spot filter seems to perfectly balance out the f/1.5 falloff\"? \\--img--  first tried a 18 mm diameter sized dot , then increased it to 24 mm as used for the photos shown. the dot seems invisible through the viewfinder at f/1.5 and f/2 then increasingly appears as stopped down further.", "sortedWord": "None", "Identifyer": null, "identifyer": 14646, "year": "2021"}, {"autor": "windy2004", "date": "2021-10-06 15:21:00", "content": "Have you had Noctilux's back focus issue fixed? I can DIY and very easy to re-calibrate the lens.", "link": "https://www.l-camera-forum.com/topic/293423-focus-shift-in-noctilux-m-50mm-f095/?tab=comments#comment-4287553", "origin": "L-forum", "suborigin": "293423-focus-shift-in-noctilux-m-50mm-f095", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "have you had noctilux's back focus issue fixed? i can -----> diy !!!  and very easy to re-calibrate the lens.", "sortedWord": "None", "Identifyer": null, "identifyer": 19248, "year": "2021"}, {"autor": "Gobert", "date": "2021-10-06 18:54:00", "content": "3 hours ago, windy2004 said: Have you had Noctilux's back focus issue fixed? I can DIY and very easy to re-calibrate the lens. After two years …..", "link": "https://www.l-camera-forum.com/topic/293423-focus-shift-in-noctilux-m-50mm-f095/?tab=comments#comment-4287663", "origin": "L-forum", "suborigin": "293423-focus-shift-in-noctilux-m-50mm-f095", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "3 hours ago, windy2004 said: have you had noctilux's back focus issue fixed? i can -----> diy !!!  and very easy to re-calibrate the lens. after two years …..", "sortedWord": "None", "Identifyer": null, "identifyer": 19249, "year": "2021"}, {"autor": "jaeger", "date": "2021-08-22 13:27:00", "content": "8 minutes ago, Starnzy said: these ASPH lenses are generally stiffer 👆 It is unheard of. Focusing mechanic is spiral gears, your case is mostly grease issue, no big deal. Usually it can be lube without taking down too many parts, if you don't have experience DIY then send out for service.", "link": "https://www.l-camera-forum.com/topic/323806-focus-ring-on-summilux-35mm-asph-fle-11663/?tab=comments#comment-4261310", "origin": "L-forum", "suborigin": "323806-focus-ring-on-summilux-35mm-asph-fle-11663", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "8 minutes ago, starnzy said: these asph lenses are generally stiffer 👆 it is unheard of. focusing mechanic is spiral gears, your case is mostly grease issue, no big deal. usually it can be lube without taking down too many parts, if you don't have experience -----> diy !!!  then send out for service.", "sortedWord": "None", "Identifyer": null, "identifyer": 22667, "year": "2021"}, {"autor": "lct", "date": "2021-08-22 19:08:00", "content": "Floating elements may play a role. Too complicated for DIY i fear. If you know a good repairer you may wish to ask him/her.", "link": "https://www.l-camera-forum.com/topic/323806-focus-ring-on-summilux-35mm-asph-fle-11663/?tab=comments#comment-4261514", "origin": "L-forum", "suborigin": "323806-focus-ring-on-summilux-35mm-asph-fle-11663", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "floating elements may play a role. too complicated for -----> diy !!!  i fear. if you know a good repairer you may wish to ask him/her.", "sortedWord": "None", "Identifyer": null, "identifyer": 22669, "year": "2021"}, {"autor": "grahamc", "date": "2021-06-29 06:45:00", "content": " Hi Everyone I've just asked the main Leica accredited service centre here in Australia if they can 6-Bit Code the lenses I have that I 'think' can be coded, being : 35mm Summicron V4 50mm Summicron V3 50mm Summilux pre-ASPH (yet to purchase but asked them anyway as will purchase soon). They replied that none are on \"the list\" they currently have from Leica, hence can't help. Was quite surprised so just wanted to ask from people that know more about such 'lists' than I do - Is there a chance at all that this info I was given is incorrect (wishful thinking probably!) or .... is there another route to get these done 'officially'? Presuming the offical route might not be possible, I'd also be open to sending to someone reputable who can code them, so recommendations would be appreciated. I'm based in Australia but very happy to send Overseas to the right person. I'm less open to the DIY option but am aware of the process. Finally for completeness of info I'm an MD-262 user so I can't manually code them in-camera. Cheers everyone in advance G", "link": "https://www.l-camera-forum.com/topic/322255-lenses-that-leica-will-6-bit-code/?tab=comments#comment-4228233", "origin": "L-forum", "suborigin": "322255-lenses-that-leica-will-6-bit-code", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " hi everyone i've just asked the main leica accredited service centre here in australia if they can 6-bit code the lenses i have that i 'think' can be coded, being : 35mm summicron v4 50mm summicron v3 50mm summilux pre-asph (yet to purchase but asked them anyway as will purchase soon). they replied that none are on \"the list\" they currently have from leica, hence can't help. was quite surprised so just wanted to ask from people that know more about such 'lists' than i do - is there a chance at all that this info i was given is incorrect (wishful thinking probably!) or .... is there another route to get these done 'officially'? presuming the offical route might not be possible, i'd also be open to sending to someone reputable who can code them, so recommendations would be appreciated. i'm based in australia but very happy to send overseas to the right person. i'm less open to the -----> diy !!!  option but am aware of the process. finally for completeness of info i'm an md-262 user so i can't manually code them in-camera. cheers everyone in advance g", "sortedWord": "None", "Identifyer": null, "identifyer": 25769, "year": "2021"}, {"autor": "jaapv", "date": "2021-09-18 08:31:00", "content": "I consider a DIY construction with a mark on the screw of the hood and a the 135 mm viewer mounted high and tiltable.", "link": "https://www.l-camera-forum.com/topic/324632-dot-sight-device/?tab=comments#comment-4277057", "origin": "L-forum", "suborigin": "324632-dot-sight-device", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i consider a -----> diy !!!  construction with a mark on the screw of the hood and a the 135 mm viewer mounted high and tiltable.", "sortedWord": "None", "Identifyer": null, "identifyer": 30783, "year": "2021"}, {"autor": "sillbeers15", "date": "2021-09-18 08:36:00", "content": "1 minute ago, jaapv said: I consider a DIY construction with a mark on the screw of the hood and a simple frame on the hot shoe. Your intended purpose is to drop the dot scope mounting height? On my SL90-280mm application, I screwed the dot sight device directly onto the base of the lens tripod mount as it could be detected easily and re-position above the lens for dot sight device mounting. Perhaps I should the same for Sigma 150-600mm?", "link": "https://www.l-camera-forum.com/topic/324632-dot-sight-device/?tab=comments#comment-4277062", "origin": "L-forum", "suborigin": "324632-dot-sight-device", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "1 minute ago, jaapv said: i consider a -----> diy !!!  construction with a mark on the screw of the hood and a simple frame on the hot shoe. your intended purpose is to drop the dot scope mounting height? on my sl90-280mm application, i screwed the dot sight device directly onto the base of the lens tripod mount as it could be detected easily and re-position above the lens for dot sight device mounting. perhaps i should the same for sigma 150-600mm?", "sortedWord": "None", "Identifyer": null, "identifyer": 30784, "year": "2021"}, {"autor": "helged", "date": "2021-07-09 12:53:00", "content": "For SL, you are limited to battery grip or to use a diy dummy battery with external power. The latter should be doable, but at your own risk (have been pondering on this myself, but haven't started...).", "link": "https://www.l-camera-forum.com/topic/284996-external-power-for-sl/page/2/?tab=comments#comment-4235004", "origin": "L-forum", "suborigin": "284996-external-power-for-sl", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "for sl, you are limited to battery grip or to use a -----> diy !!!  dummy battery with external power. the latter should be doable, but at your own risk (have been pondering on this myself, but haven't started...).", "sortedWord": "None", "Identifyer": null, "identifyer": 34489, "year": "2021"}, {"autor": "Dopaco", "date": "2021-03-23 21:38:00", "content": "2 hours ago, jaapv said: My problem with all these straps is that I don't like scratchy metal rings against my camera. I totally agree with you, although with a little DIY you have an easy solution. AliExpress straps do not have that problem and only cost 10 or 11 euros, although their low price is a bit scary.", "link": "https://www.l-camera-forum.com/topic/319167-rope-straps-for-leica-tl2-cl-and-other-cameras/?tab=comments#comment-4166709", "origin": "L-forum", "suborigin": "319167-rope-straps-for-leica-tl2-cl-and-other-cameras", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "2 hours ago, jaapv said: my problem with all these straps is that i don't like scratchy metal rings against my camera. i totally agree with you, although with a little -----> diy !!!  you have an easy solution. aliexpress straps do not have that problem and only cost 10 or 11 euros, although their low price is a bit scary.", "sortedWord": "None", "Identifyer": null, "identifyer": 38869, "year": "2021"}, {"autor": "RustyBug", "date": "2021-03-02 03:14:00", "content": "I could go for a \"slightly\" larger CL2. Probably in the realm of Q, not M size. Shape, I expect they'll retain the form that resembles M more than SL. Could they bump out a grip, say like the TL, maybe ... but again, I think they'll stick to the M/Q shape. I wouldn't mind if they could put some \"relief\" on the edges though. The CL kinda cuts into my hand, with its small size and edges. Larger size might change the purchase / grip to relieve it a bit, though. Some form of wrap / texture would be okay too. It always seemed a bit \"slick\" to try and hold. If the CL2 is slick texture ... DIY texture might be in the cards. Either way, I just hope the new sensor has the same IQ (or better) as the CL. I love the files in the CL, and I love the shutter release. Layout is pretty sweet too with the button inside the dials. My only real \"wish\" for the CL is IBIS (for my 55-135), and an improved grip experience (texture, size or shape). Everything else is gravy. 😉", "link": "https://www.l-camera-forum.com/topic/318233-leica-cl-2/page/5/?tab=comments#comment-4151717", "origin": "L-forum", "suborigin": "318233-leica-cl-2", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i could go for a \"slightly\" larger cl2. probably in the realm of q, not m size. shape, i expect they'll retain the form that resembles m more than sl. could they bump out a grip, say like the tl, maybe ... but again, i think they'll stick to the m/q shape. i wouldn't mind if they could put some \"relief\" on the edges though. the cl kinda cuts into my hand, with its small size and edges. larger size might change the purchase / grip to relieve it a bit, though. some form of wrap / texture would be okay too. it always seemed a bit \"slick\" to try and hold. if the cl2 is slick texture ... -----> diy !!!  texture might be in the cards. either way, i just hope the new sensor has the same iq (or better) as the cl. i love the files in the cl, and i love the shutter release. layout is pretty sweet too with the button inside the dials. my only real \"wish\" for the cl is ibis (for my 55-135), and an improved grip experience (texture, size or shape). everything else is gravy. 😉", "sortedWord": "None", "Identifyer": null, "identifyer": 39273, "year": "2021"}, {"autor": "thedruid", "date": "2021-03-02 04:52:00", "content": "1 hour ago, RustyBug said: I could go for a \"slightly\" larger CL2. Probably in the realm of Q, not M size. Shape, I expect they'll retain the form that resembles M more than SL. Could they bump out a grip, say like the TL, maybe ... but again, I think they'll stick to the M/Q shape. I wouldn't mind if they could put some \"relief\" on the edges though. The CL kinda cuts into my hand, with its small size and edges. Larger size might change the purchase / grip to relieve it a bit, though. Some form of wrap / texture would be okay too. It always seemed a bit \"slick\" to try and hold. If the CL2 is slick texture ... DIY texture might be in the cards. Either way, I just hope the new sensor has the same IQ (or better) as the CL. I love the files in the CL, and I love the shutter release. Layout is pretty sweet too with the button inside the dials. My only real \"wish\" for the CL is IBIS (for my 55-135), and an improved grip experience (texture, size or shape). Everything else is gravy. 😉 Have you tried the Lim's case, has a built in grip, battery access and a bonus acra-swiss dove tail for tripod mounting if needed??", "link": "https://www.l-camera-forum.com/topic/318233-leica-cl-2/page/5/?tab=comments#comment-4151745", "origin": "L-forum", "suborigin": "318233-leica-cl-2", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "1 hour ago, rustybug said: i could go for a \"slightly\" larger cl2. probably in the realm of q, not m size. shape, i expect they'll retain the form that resembles m more than sl. could they bump out a grip, say like the tl, maybe ... but again, i think they'll stick to the m/q shape. i wouldn't mind if they could put some \"relief\" on the edges though. the cl kinda cuts into my hand, with its small size and edges. larger size might change the purchase / grip to relieve it a bit, though. some form of wrap / texture would be okay too. it always seemed a bit \"slick\" to try and hold. if the cl2 is slick texture ... -----> diy !!!  texture might be in the cards. either way, i just hope the new sensor has the same iq (or better) as the cl. i love the files in the cl, and i love the shutter release. layout is pretty sweet too with the button inside the dials. my only real \"wish\" for the cl is ibis (for my 55-135), and an improved grip experience (texture, size or shape). everything else is gravy. 😉 have you tried the lim's case, has a built in grip, battery access and a bonus acra-swiss dove tail for tripod mounting if needed??", "sortedWord": "None", "Identifyer": null, "identifyer": 39274, "year": "2021"}, {"autor": "lct", "date": "2021-08-14 02:16:00", "content": "Sounds like a conflict due to a faulty DIY coding. Did you paint something on the flange of the CV lens?", "link": "https://www.l-camera-forum.com/topic/323535-my-cl-glitch/?tab=comments#comment-4256424", "origin": "L-forum", "suborigin": "323535-my-cl-glitch", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "sounds like a conflict due to a faulty -----> diy !!!  coding. did you paint something on the flange of the cv lens?", "sortedWord": "None", "Identifyer": null, "identifyer": 40544, "year": "2021"}, {"autor": "Pieter575", "date": "2021-08-14 05:23:00", "content": " That's what I was thinking today. The lens is close to new and I didn't try to DIY code it, but since the 6-bit Summicron seems to work flawlessly I feel it must be some imperfection on the CV.", "link": "https://www.l-camera-forum.com/topic/323535-my-cl-glitch/?tab=comments#comment-4256447", "origin": "L-forum", "suborigin": "323535-my-cl-glitch", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " that's what i was thinking today. the lens is close to new and i didn't try to -----> diy !!!  code it, but since the 6-bit summicron seems to work flawlessly i feel it must be some imperfection on the cv.", "sortedWord": "None", "Identifyer": null, "identifyer": 40545, "year": "2021"}, {"autor": "jaapv", "date": "2021-08-14 08:47:00", "content": "6 hours ago, lct said: Sounds like a conflict due to a faulty DIY coding. Did you paint something on the flange of the CV lens? That is good thinking, but if the camera would be identifying the lens for this reason, it would show up on the first screen.", "link": "https://www.l-camera-forum.com/topic/323535-my-cl-glitch/?tab=comments#comment-4256521", "origin": "L-forum", "suborigin": "323535-my-cl-glitch", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "6 hours ago, lct said: sounds like a conflict due to a faulty -----> diy !!!  coding. did you paint something on the flange of the cv lens? that is good thinking, but if the camera would be identifying the lens for this reason, it would show up on the first screen.", "sortedWord": "None", "Identifyer": null, "identifyer": 40546, "year": "2021"}, {"autor": "Q_lux", "date": "2021-07-01 07:46:00", "content": "For me, the Sigma L-mount is the experimental body, when I want to play with old (or newer) glass, 70 years old up to new ones, with a drawer full of adapters and some DIY adapters made of old Leica or other adapters. Then I get out and photograph whatever and evaluate sharpness, bokeh, blurr, flare ... a.s.o. This is only when I have enough time to do so. If I want to take pictures, I take the Q with almost always the same settings and run through the streets, not thinking about gear anymore. Sorry, no input about the S5, I don't own one. Best. Jos", "link": "https://www.l-camera-forum.com/topic/321568-thoughts-on-the-sigma-fpl-and-lumix-s5/?tab=comments#comment-4229377", "origin": "L-forum", "suborigin": "321568-thoughts-on-the-sigma-fpl-and-lumix-s5", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "for me, the sigma l-mount is the experimental body, when i want to play with old (or newer) glass, 70 years old up to new ones, with a drawer full of adapters and some -----> diy !!!  adapters made of old leica or other adapters. then i get out and photograph whatever and evaluate sharpness, bokeh, blurr, flare ... a.s.o. this is only when i have enough time to do so. if i want to take pictures, i take the q with almost always the same settings and run through the streets, not thinking about gear anymore. sorry, no input about the s5, i don't own one. best. jos", "sortedWord": "None", "Identifyer": null, "identifyer": 47325, "year": "2021"}, {"autor": "A1131M", "date": "2021-04-25 18:22:00", "content": "My best option Q2 + Kanken + DIY 😅 --img-- --img-- --img-- --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/319817-how-to-put-a-q2-in-your-backpack/page/2/?tab=comments#comment-4188473", "origin": "L-forum", "suborigin": "319817-how-to-put-a-q2-in-your-backpack", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my best option q2 + kanken + -----> diy !!!  😅 --img-- --img-- --img-- --img-- --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 7198, "year": "2021"}, {"autor": "nwphil", "date": "2021-01-07 21:54:00", "content": "29 minutes ago, fieldafield said: Received today from Leica UK: \"The white pixels are defect pixels, it is something that indeed appears more often on a high res sensor like this. The camera automatically does a pixel refresh every 2 weeks. Normally it is ok then. I assume you have taken the images right in between 2 refreshment cycles. However, what we plan to do on the next firmware is to implement the opportunity for the customer to do the refresh by himself. This update is planned for spring 2021. It might not help in a very rare case of numerous dead pixels close to each other but this topic should be solved for most cases then. Therefore there's nothing to worry about and the camera is not faulty.\" Fingers crossed! Thanks a lot - still annoyed a bit that Leica is not making this announcement, but goes a bit in-line with I was told by the LeicacameraUSA's repair department - not as specific as you were told. Not to mention that it should have been disclaimed from day 1 - I would be ok with it, and obviously would prefer the firmware diy implemented version; just like Olympus has at least in more recent cameras, a pixel mapping function. Anyway - Now I am left sucking my thumb waiting for Leica in NJ to send it back...but happier ( not related with thumb sucking mind you) Edited January 7 by nwphil", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/6/?tab=comments#comment-4114130", "origin": "L-forum", "suborigin": "316242-q2-monochrom-stuck-bright-white-pixels", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "29 minutes ago, fieldafield said: received today from leica uk: \"the white pixels are defect pixels, it is something that indeed appears more often on a high res sensor like this. the camera automatically does a pixel refresh every 2 weeks. normally it is ok then. i assume you have taken the images right in between 2 refreshment cycles. however, what we plan to do on the next firmware is to implement the opportunity for the customer to do the refresh by himself. this update is planned for spring 2021. it might not help in a very rare case of numerous dead pixels close to each other but this topic should be solved for most cases then. therefore there's nothing to worry about and the camera is not faulty.\" fingers crossed! thanks a lot - still annoyed a bit that leica is not making this announcement, but goes a bit in-line with i was told by the leicacamerausa's repair department - not as specific as you were told. not to mention that it should have been disclaimed from day 1 - i would be ok with it, and obviously would prefer the firmware -----> diy !!!  implemented version; just like olympus has at least in more recent cameras, a pixel mapping function. anyway - now i am left sucking my thumb waiting for leica in nj to send it back...but happier ( not related with thumb sucking mind you) edited january 7 by nwphil", "sortedWord": "None", "Identifyer": null, "identifyer": 7395, "year": "2021"}, {"autor": "LeicaR", "date": "2021-01-20 05:41:00", "content": " My R3 MOT Electronic’s mirror is slow to move up after pressing the shutter. Once it reaches the top it will fire. If I point the camera upwards the mirror travels effortlessly. Any thoughts on a possible diy fix? Thanks", "link": "https://www.l-camera-forum.com/topic/317170-leica-r3-mot-electronic-mirror-slow-to-go-up/?tab=comments#comment-4121733", "origin": "L-forum", "suborigin": "317170-leica-r3-mot-electronic-mirror-slow-to-go-up", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " my r3 mot electronic’s mirror is slow to move up after pressing the shutter. once it reaches the top it will fire. if i point the camera upwards the mirror travels effortlessly. any thoughts on a possible -----> diy !!!  fix? thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 20491, "year": "2021"}, {"autor": "fabianoliver", "date": "2021-01-21 12:02:00", "content": "Hi, how are you. I've had the same problem with my Pentax LX, last April I've decided to try to DIY, as we was all in hour homes, Covid. I've found a dismantling in the web, and the problem was a clogged mechanism, dry grases. I've used zippo fluid and isopropil alcohol to dissolve the old grease, and a special watch oil ( Swiss, a little expensive, I don't remember the brand and I'm not at home) to lubricate it after cleaning. The mechanism starts to works again like new. I've had a problem, cause cleaning it with isopropilic, a bit has reached the screen, and has damage it, so take care. I was in need to replace it. If the R3 ( I don't remember) allows you to change screens, take it off before to start. The procedure was done in one day, seemed crazy to have the body opened, but it was easily doable. I don't know the R3 inside so I cannot help you with were is and how to reach the mirror system mechanism, but if you fond a way to reach it, go for it. Patience, organization, a clean surface, and no cats in the room. Good luck! --img--  Edited January 21 by fabianoliver", "link": "https://www.l-camera-forum.com/topic/317170-leica-r3-mot-electronic-mirror-slow-to-go-up/?tab=comments#comment-4122391", "origin": "L-forum", "suborigin": "317170-leica-r3-mot-electronic-mirror-slow-to-go-up", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hi, how are you. i've had the same problem with my pentax lx, last april i've decided to try to -----> diy !!! , as we was all in hour homes, covid. i've found a dismantling in the web, and the problem was a clogged mechanism, dry grases. i've used zippo fluid and isopropil alcohol to dissolve the old grease, and a special watch oil ( swiss, a little expensive, i don't remember the brand and i'm not at home) to lubricate it after cleaning. the mechanism starts to works again like new. i've had a problem, cause cleaning it with isopropilic, a bit has reached the screen, and has damage it, so take care. i was in need to replace it. if the r3 ( i don't remember) allows you to change screens, take it off before to start. the procedure was done in one day, seemed crazy to have the body opened, but it was easily doable. i don't know the r3 inside so i cannot help you with were is and how to reach the mirror system mechanism, but if you fond a way to reach it, go for it. patience, organization, a clean surface, and no cats in the room. good luck! --img--  edited january 21 by fabianoliver", "sortedWord": "None", "Identifyer": null, "identifyer": 20492, "year": "2021"}, {"autor": "Charles Morgan", "date": "2021-01-15 18:40:00", "content": "Well done! I converted my Summicron 50mm R cam to 3 cams to use on my Leicaflex SL2 as well as my R4S, and used the Elmarit Macro mount as you did. I ended up filing the cam a hint at a time (you can take it off easily enough but you can't put it back), and all the holes were there already. I am not very good at any form of precision DIY, so I was very pleasantly surprised at how easy it was. Edited January 15 by Charles Morgan", "link": "https://www.l-camera-forum.com/topic/317006-summicron-r-50mm-upgrade-to-3-cams/?tab=comments#comment-4118833", "origin": "L-forum", "suborigin": "317006-summicron-r-50mm-upgrade-to-3-cams", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "well done! i converted my summicron 50mm r cam to 3 cams to use on my leicaflex sl2 as well as my r4s, and used the elmarit macro mount as you did. i ended up filing the cam a hint at a time (you can take it off easily enough but you can't put it back), and all the holes were there already. i am not very good at any form of precision -----> diy !!! , so i was very pleasantly surprised at how easy it was. edited january 15 by charles morgan", "sortedWord": "None", "Identifyer": null, "identifyer": 20496, "year": "2021"}, {"autor": "tranquilo67", "date": "2021-01-15 19:32:00", "content": "52 minutes ago, Charles Morgan said: Well done! I converted my Summicron 50mm R cam to 3 cams to use on my Leicaflex SL2 as well as my R4S, and used the Elmarit Macro mount as you did. I ended up filing the cam a hint at a time (you can take it off easily enough but you can't put it back), and all the holes were there already. I am not very good at any form of precision DIY, so I was very pleasantly surprised at how easy it was. That's great to know!! So the addition of the first and second cam is also possible and easy using the Elmarit Macro tube!! Thank you. Edited January 15 by tranquilo67", "link": "https://www.l-camera-forum.com/topic/317006-summicron-r-50mm-upgrade-to-3-cams/?tab=comments#comment-4118851", "origin": "L-forum", "suborigin": "317006-summicron-r-50mm-upgrade-to-3-cams", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "52 minutes ago, charles morgan said: well done! i converted my summicron 50mm r cam to 3 cams to use on my leicaflex sl2 as well as my r4s, and used the elmarit macro mount as you did. i ended up filing the cam a hint at a time (you can take it off easily enough but you can't put it back), and all the holes were there already. i am not very good at any form of precision -----> diy !!! , so i was very pleasantly surprised at how easy it was. that's great to know!! so the addition of the first and second cam is also possible and easy using the elmarit macro tube!! thank you. edited january 15 by tranquilo67", "sortedWord": "None", "Identifyer": null, "identifyer": 20497, "year": "2021"}, {"autor": "ZHNL", "date": "2021-07-22 18:02:00", "content": " I bought a contax 645 80mm lens with Leica S to C adapter recently. I have the adapter myself but because it is a combo deal, I bought the adapter anyway. The lock pin is slightly lose (this was disclosed by seller) on this new one but fully functional. After one trip out, I found the small lock nut disappeared. Everything else is still there but the out side nut. I regret I didnt spend time investigate when I got the adapter. After this accident happen, I took a close look for the one I have. It should be a easy job to tight it up. (maybe half hour, because I need remove the mount ring to do so) Without thinking, I send to Leica NJ. and the adapter was send to Germany. A few day later, I got the invoice. $1400 plus shipping. I can't believe my eyes, then I saw the detail: they claimed they dont have spare part but as complementary service, they offer me one with 25% discount plus tax. I don't know if this is some type of joke or not. What they expect I respond. I am quite sad to see Leica customer service deal customer case like this. If I am service manage, I will for sure to solve customer problem to meet reasonable expectation. I refuse the \"service\" obviously. I specified that ship the adapter back and make sure every single screw and spring I send with the adapter come back to me so I can DIY fix myself. It is on its way. I have some adapter lying around, and Novoflex one (R to GFX, or NIkon F to GFX) has almost the same lock nut as Leica one, or I will see if I can break down other cheaper one to fulfill the function. Anyone have good suggestion, please let me know. Much appreciate. I share this because I feel it is relevant and interesting story. and for anyone with Leica S adapter, check the screw and make sure they are tight up to avoid spend thousand dollor for losing nut or screw.", "link": "https://www.l-camera-forum.com/topic/322915-a-recent-s-service-experience-with-leica/?tab=comments#comment-4243087", "origin": "L-forum", "suborigin": "322915-a-recent-s-service-experience-with-leica", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " i bought a contax 645 80mm lens with leica s to c adapter recently. i have the adapter myself but because it is a combo deal, i bought the adapter anyway. the lock pin is slightly lose (this was disclosed by seller) on this new one but fully functional. after one trip out, i found the small lock nut disappeared. everything else is still there but the out side nut. i regret i didnt spend time investigate when i got the adapter. after this accident happen, i took a close look for the one i have. it should be a easy job to tight it up. (maybe half hour, because i need remove the mount ring to do so) without thinking, i send to leica nj. and the adapter was send to germany. a few day later, i got the invoice. $1400 plus shipping. i can't believe my eyes, then i saw the detail: they claimed they dont have spare part but as complementary service, they offer me one with 25% discount plus tax. i don't know if this is some type of joke or not. what they expect i respond. i am quite sad to see leica customer service deal customer case like this. if i am service manage, i will for sure to solve customer problem to meet reasonable expectation. i refuse the \"service\" obviously. i specified that ship the adapter back and make sure every single screw and spring i send with the adapter come back to me so i can -----> diy !!!  fix myself. it is on its way. i have some adapter lying around, and novoflex one (r to gfx, or nikon f to gfx) has almost the same lock nut as leica one, or i will see if i can break down other cheaper one to fulfill the function. anyone have good suggestion, please let me know. much appreciate. i share this because i feel it is relevant and interesting story. and for anyone with leica s adapter, check the screw and make sure they are tight up to avoid spend thousand dollor for losing nut or screw.", "sortedWord": "None", "Identifyer": null, "identifyer": 24601, "year": "2021"}, {"autor": "Stuart Richardson", "date": "2021-02-11 13:02:00", "content": "Yeah, that is what it seems like. I was looking into it, and it seems like a camera like the GFX or other larger sensor camera is the best balance of wide angle lens availability to room for rise. This led me down the rabbit hole to looking at tech cameras and the prices really are very high when a whole system is spec-ed out. I was looking at the RLd3, as it would be nice to use 4x5 and my existing lenses, but even just mounting a lens is 1200 euros, and then you cannot use it on another body. For me, the interest would be using it modularly, so something like a Linhof plate or at least something that could be easily swapped out with a lens wrench would be ideal. The modern digital tech cam lenses are also extremely expensive and a bit hard to get an overview of and determine what is the best choice. It seems like the Actus is still the most practical, but lens choice is an issue. I do have a 45mm APO Componon and 90mm APO componon that I use for the darkroom, and I did some of my MFA work on them using a DIY lens mount on an monorail, though that was on 4x5. They were quite good on 4x5 (at high magnification ratios...of course, DOF was small). It really would be nice if Leica just made something like a 19mm, 21mm or 24mm TS lens for the SL. Edited February 11 by Stuart Richardson", "link": "https://www.l-camera-forum.com/topic/317641-interiorsacrhitecture-with-s-system/?tab=comments#comment-4138472", "origin": "L-forum", "suborigin": "317641-interiorsacrhitecture-with-s-system", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "yeah, that is what it seems like. i was looking into it, and it seems like a camera like the gfx or other larger sensor camera is the best balance of wide angle lens availability to room for rise. this led me down the rabbit hole to looking at tech cameras and the prices really are very high when a whole system is spec-ed out. i was looking at the rld3, as it would be nice to use 4x5 and my existing lenses, but even just mounting a lens is 1200 euros, and then you cannot use it on another body. for me, the interest would be using it modularly, so something like a linhof plate or at least something that could be easily swapped out with a lens wrench would be ideal. the modern digital tech cam lenses are also extremely expensive and a bit hard to get an overview of and determine what is the best choice. it seems like the actus is still the most practical, but lens choice is an issue. i do have a 45mm apo componon and 90mm apo componon that i use for the darkroom, and i did some of my mfa work on them using a -----> diy !!!  lens mount on an monorail, though that was on 4x5. they were quite good on 4x5 (at high magnification ratios...of course, dof was small). it really would be nice if leica just made something like a 19mm, 21mm or 24mm ts lens for the sl. edited february 11 by stuart richardson", "sortedWord": "None", "Identifyer": null, "identifyer": 25956, "year": "2021"}, {"autor": "Jeff S", "date": "2021-02-11 15:15:00", "content": " 2 hours ago, Stuart Richardson said: Yeah, that is what it seems like. I was looking into it, and it seems like a camera like the GFX or other larger sensor camera is the best balance of wide angle lens availability to room for rise. This led me down the rabbit hole to looking at tech cameras and the prices really are very high when a whole system is spec-ed out. I was looking at the RLd3, as it would be nice to use 4x5 and my existing lenses, but even just mounting a lens is 1200 euros, and then you cannot use it on another body. For me, the interest would be using it modularly, so something like a Linhof plate or at least something that could be easily swapped out with a lens wrench would be ideal. The modern digital tech cam lenses are also extremely expensive and a bit hard to get an overview of and determine what is the best choice. It seems like the Actus is still the most practical, but lens choice is an issue. I do have a 45mm APO Componon and 90mm APO componon that I use for the darkroom, and I did some of my MFA work on them using a DIY lens mount on an monorail, though that was on 4x5. They were quite good on 4x5 (at high magnification ratios...of course, DOF was small). It really would be nice if Leica just made something like a 19mm, 21mm or 24mm TS lens for the SL. There are of course adapted wide angle T/S solutions for the SL, notably the Canon line, which includes updated versions like the 24 T/S version 2. An issue with using T/S lenses in your location, though, might be the lack of robust weather sealing, assuming naturally that their use would not be exclusively indoors. Jeff Edited February 11 by Jeff S", "link": "https://www.l-camera-forum.com/topic/317641-interiorsacrhitecture-with-s-system/page/2/?tab=comments#comment-4138561", "origin": "L-forum", "suborigin": "317641-interiorsacrhitecture-with-s-system", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " 2 hours ago, stuart richardson said: yeah, that is what it seems like. i was looking into it, and it seems like a camera like the gfx or other larger sensor camera is the best balance of wide angle lens availability to room for rise. this led me down the rabbit hole to looking at tech cameras and the prices really are very high when a whole system is spec-ed out. i was looking at the rld3, as it would be nice to use 4x5 and my existing lenses, but even just mounting a lens is 1200 euros, and then you cannot use it on another body. for me, the interest would be using it modularly, so something like a linhof plate or at least something that could be easily swapped out with a lens wrench would be ideal. the modern digital tech cam lenses are also extremely expensive and a bit hard to get an overview of and determine what is the best choice. it seems like the actus is still the most practical, but lens choice is an issue. i do have a 45mm apo componon and 90mm apo componon that i use for the darkroom, and i did some of my mfa work on them using a -----> diy !!!  lens mount on an monorail, though that was on 4x5. they were quite good on 4x5 (at high magnification ratios...of course, dof was small). it really would be nice if leica just made something like a 19mm, 21mm or 24mm ts lens for the sl. there are of course adapted wide angle t/s solutions for the sl, notably the canon line, which includes updated versions like the 24 t/s version 2. an issue with using t/s lenses in your location, though, might be the lack of robust weather sealing, assuming naturally that their use would not be exclusively indoors. jeff edited february 11 by jeff s", "sortedWord": "None", "Identifyer": null, "identifyer": 25958, "year": "2021"}, {"autor": "helged", "date": "2021-01-11 11:51:00", "content": " 13 hours ago, BernardC said: No problem. I researched all this for a timelapse project that is currently in production. COVID-19 has turned it into a virtual project. I provide technical support and file processing. The director is in a different part of the country, we haven't seen each other in a long time. The architect and construction site are in a different part of the world. The footage looks quite good so far, it's a mix of drone footage and locked-off shots. Make sure you get a barrel plug adapter with a built-in voltage regulator. I use one with my Sigma fp, it's a cable that also works with various Panasonic MFT cameras. The D-Tap battery is for an Atomos recorder, not for the fp (which only needs a battery swap every hour or so in video mode), but it's good to have an all-day power supply for both. Some D-Tap batteries have built-in 7.4V barrel connectors, as do some battery plates. 7.4 Volts is a common voltage for camera batteries. You should ask Leica if they can sell you just the dummy S battery and cable. They may be available as spare parts. Actually, I have a 100Wh D-Tap battery (https://www.hawkwoods.co.uk/Cine/P/GR-100) that don't see too much use. This battery delivers 14.4 V output. So a D-Tap cable with a 14.4 to 7.4 V regulator - like https://woodencamera.com/products/d-tap-to-sony-a7s-a7r-a7sii-a7rii - should do the job. The remaining DIY is then to cut the dummy battery cable on the Leica AC-Adapter-S and remove the dummy battery from eg the Wodden Camera cable adapter, add good-quality connectors so the AC-Adapter-S can be used as intended (powered off the grid), or powered by the 100Wh battery. This is, for now, my plan... Feel free to chime in if things can/should be done differently 😉 Edited January 11 by helged", "link": "https://www.l-camera-forum.com/topic/316777-usb-or-similar-poweringcharging-of-s3/?tab=comments#comment-4116152", "origin": "L-forum", "suborigin": "316777-usb-or-similar-poweringcharging-of-s3", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " 13 hours ago, bernardc said: no problem. i researched all this for a timelapse project that is currently in production. covid-19 has turned it into a virtual project. i provide technical support and file processing. the director is in a different part of the country, we haven't seen each other in a long time. the architect and construction site are in a different part of the world. the footage looks quite good so far, it's a mix of drone footage and locked-off shots. make sure you get a barrel plug adapter with a built-in voltage regulator. i use one with my sigma fp, it's a cable that also works with various panasonic mft cameras. the d-tap battery is for an atomos recorder, not for the fp (which only needs a battery swap every hour or so in video mode), but it's good to have an all-day power supply for both. some d-tap batteries have built-in 7.4v barrel connectors, as do some battery plates. 7.4 volts is a common voltage for camera batteries. you should ask leica if they can sell you just the dummy s battery and cable. they may be available as spare parts. actually, i have a 100wh d-tap battery (https://www.hawkwoods.co.uk/cine/p/gr-100) that don't see too much use. this battery delivers 14.4 v output. so a d-tap cable with a 14.4 to 7.4 v regulator - like https://woodencamera.com/products/d-tap-to-sony-a7s-a7r-a7sii-a7rii - should do the job. the remaining -----> diy !!!  is then to cut the dummy battery cable on the leica ac-adapter-s and remove the dummy battery from eg the wodden camera cable adapter, add good-quality connectors so the ac-adapter-s can be used as intended (powered off the grid), or powered by the 100wh battery. this is, for now, my plan... feel free to chime in if things can/should be done differently 😉 edited january 11 by helged", "sortedWord": "None", "Identifyer": null, "identifyer": 26474, "year": "2021"}, {"autor": "Ambro51", "date": "2021-09-05 12:50:00", "content": "Yes it looks possible to unscrew the rear element and access the shutter. I too resist the cheaper camera buying urge, but I’m sort of an “Ansco Kick” presently. It does seem like the front lens and filter ring Should simply unscrew, but I’m reluctant to try until someone pitches in with their DIY on this early camera. Later Minolta hi matics use a cds cell within the filter ring, which has spanner detects. This camera has none. Perhaps a gum lens rubber?", "link": "https://www.l-camera-forum.com/topic/318752-nicht-immer-nur-kaviar-english-version/page/16/?tab=comments#comment-4269793", "origin": "L-forum", "suborigin": "318752-nicht-immer-nur-kaviar-english-version", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "yes it looks possible to unscrew the rear element and access the shutter. i too resist the cheaper camera buying urge, but i’m sort of an “ansco kick” presently. it does seem like the front lens and filter ring should simply unscrew, but i’m reluctant to try until someone pitches in with their -----> diy !!!  on this early camera. later minolta hi matics use a cds cell within the filter ring, which has spanner detects. this camera has none. perhaps a gum lens rubber?", "sortedWord": "None", "Identifyer": null, "identifyer": 35111, "year": "2021"}, {"autor": "jaapv", "date": "2021-11-10 15:38:00", "content": "2 hours ago, pippy said: I have to say my experience with my M-mount '54 lens has been similar to that mentioned by Alan in post #7. I've had it since 1980 and several years ago, when I noticed the results were not as clear as they once had been, sent it for a CLA after which it performed like a new lens; sharp, as contrasty as a '54 lens should be and pretty much perfect. The CLA was £100 / €120 and I couldn't have been happier. The asking-price for these lenses has certainly been rising markedly over the last couple of years so it might well be worth having it sorted but, if you do elect to go down this route, it might be a good idea to verify that there is no fungus present as that is a different matter from just haze. Philip. And oil leaking out at the infinity stop? Sounds like a lens that has been \"CLA-ed\" , especially L-ed (WD40?) by DIY, who knows what else is wrong. I wouldn't touch it with a bargepole - and the recent CLA of the Tele-Elmar I am selling (not much success yet ) was 175 Euro with Will van Manen...", "link": "https://www.l-camera-forum.com/topic/326375-cla-1953-summaron-35-f35-worth-it/?tab=comments#comment-4310772", "origin": "L-forum", "suborigin": "326375-cla-1953-summaron-35-f35-worth-it", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "2 hours ago, pippy said: i have to say my experience with my m-mount '54 lens has been similar to that mentioned by alan in post #7. i've had it since 1980 and several years ago, when i noticed the results were not as clear as they once had been, sent it for a cla after which it performed like a new lens; sharp, as contrasty as a '54 lens should be and pretty much perfect. the cla was £100 / €120 and i couldn't have been happier. the asking-price for these lenses has certainly been rising markedly over the last couple of years so it might well be worth having it sorted but, if you do elect to go down this route, it might be a good idea to verify that there is no fungus present as that is a different matter from just haze. philip. and oil leaking out at the infinity stop? sounds like a lens that has been \"cla-ed\" , especially l-ed (wd40?) by -----> diy !!! , who knows what else is wrong. i wouldn't touch it with a bargepole - and the recent cla of the tele-elmar i am selling (not much success yet ) was 175 euro with will van manen...", "sortedWord": "None", "Identifyer": null, "identifyer": 36175, "year": "2021"}, {"autor": "tommonego@gmail.com", "date": "2021-09-23 17:32:00", "content": "DIY Prelude CL 35 f1.4 TTArtisan --img-- ", "link": "https://www.l-camera-forum.com/topic/324613-still-life-open-to-all-leica-gear/page/2/?tab=comments#comment-4280335", "origin": "L-forum", "suborigin": "324613-still-life-open-to-all-leica-gear", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  prelude cl 35 f1.4 ttartisan --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 61793, "year": "2021"}, {"autor": "TeleElmar135mm", "date": "2021-08-20 17:03:00", "content": "vor 33 Minuten schrieb roydonian: I'm going to wait for a Mk2 version of this magic card .... ... no problem here is the DIY - sorry only in German (it' for a german camera)", "link": "https://www.l-camera-forum.com/topic/323687-thorsten-overgaard-selling-5g-protection-card/page/2/?tab=comments#comment-4260128", "origin": "L-forum", "suborigin": "323687-thorsten-overgaard-selling-5g-protection-card", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "vor 33 minuten schrieb roydonian: i'm going to wait for a mk2 version of this magic card .... ... no problem here is the -----> diy !!!  - sorry only in german (it' for a german camera)", "sortedWord": "None", "Identifyer": null, "identifyer": 80604, "year": "2021"}, {"autor": "Crem", "date": "2021-10-11 19:43:00", "content": "25 minutes ago, 250swb said: You went the simplest and most sensible route. I would say I ended up at the simplest route after taking a few detours to bad neighborhoods. My first disappointment was the Negative Supply Basic Film Carrier. The company and their support are fantastic, but I much prefer the Essential Film Holder. It's possible Negative Supply's more expensive products are better. Also I greatly underestimated the importance of a dedicated scanning camera with a physical wire for tethering. Tethering *really* speeds up the process. With the M10-R I either had to sync files wirelessly to my phone (and then ship them to my computer) or take the camera off the stand to get to the SD card. A lot of time goes into mounting the camera and aligning the lens. All lessons I learned fairly quickly, but easy to overlook in the DIY scanning world. Edited October 11 by Crem", "link": "https://www.l-camera-forum.com/topic/323537-leica-gear-for-film-scanning/?tab=comments#comment-4290639", "origin": "L-forum", "suborigin": "323537-leica-gear-for-film-scanning", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "25 minutes ago, 250swb said: you went the simplest and most sensible route. i would say i ended up at the simplest route after taking a few detours to bad neighborhoods. my first disappointment was the negative supply basic film carrier. the company and their support are fantastic, but i much prefer the essential film holder. it's possible negative supply's more expensive products are better. also i greatly underestimated the importance of a dedicated scanning camera with a physical wire for tethering. tethering *really* speeds up the process. with the m10-r i either had to sync files wirelessly to my phone (and then ship them to my computer) or take the camera off the stand to get to the sd card. a lot of time goes into mounting the camera and aligning the lens. all lessons i learned fairly quickly, but easy to overlook in the -----> diy !!!  scanning world. edited october 11 by crem", "sortedWord": "None", "Identifyer": null, "identifyer": 97970, "year": "2021"}, {"autor": "Einst_Stein", "date": "2021-02-23 00:27:00", "content": "Here's one in Berkeley. 2235 5th st, Berkeley. https://www.photolaboratory.com/film-processing.html?gclid=CjwKCAiAyc2BBhAaEiwA44-wW5_HtOH-brhAhzv1E41RVIc64eFVR6XkpkkvKNWaANiAPzyC2BmnnBoCeXsQAvD_BwE Or in LA https://www.etsy.com/shop/ValleyPhotoService?ref=simple-shop-header-name&listing_id=795850985 If you don't mind shipping, here's one for half the price: https://www.etsy.com/listing/753891797/35mm-c-41-film-processing?ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=35+mm+film+develop&ref=sr_gallery-1-3&organic_search_click=1 I don't have expereinces with them, as I felt for the price I'd rather do it myself. I was considering to send out for C41. For B&W, I think DIY is easy, since temperature control is not critical. I use one-shot chemicals, mostly HC110, Rodinal, or PMK. For C41, I have temperature controlled heater. I have the large one for swimming pool, but recently I found a small one from this: https://cinestillfilm.com/products/tcs-temperature-control-system-tcs-1000-immersion-circulator-thermostat-for-mixing-chemistry-and-precision-film-processing-at-home?variant=31128830443594&currency=USD&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&utm_campaign=gs-2019-11-30&utm_source=google&utm_medium=smart_campaign&gclid=CjwKCAiAyc2BBhAaEiwA44-wW_hngu-c6nH5g80xbE3NNO1E0CtcOjMsg6Bw2efMHmKdb402Shjf2RoCNQ0QAvD_BwE", "link": "https://www.l-camera-forum.com/topic/317603-film-processing-services/page/2/?tab=comments#comment-4147064", "origin": "L-forum", "suborigin": "317603-film-processing-services", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "here's one in berkeley. 2235 5th st, berkeley. https://www.photolaboratory.com/film-processing.html?gclid=cjwkcaiayc2bbhaaeiwa44-ww5_htoh-brhahzv1e41rvic64efvr6xkpkkvknwaaniapzyc2bmnnbocexsqavd_bwe or in la https://www.etsy.com/shop/valleyphotoservice?ref=simple-shop-header-name&listing_id=795850985 if you don't mind shipping, here's one for half the price: https://www.etsy.com/listing/753891797/35mm-c-41-film-processing?ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=35+mm+film+develop&ref=sr_gallery-1-3&organic_search_click=1 i don't have expereinces with them, as i felt for the price i'd rather do it myself. i was considering to send out for c41. for b&w, i think -----> diy !!!  is easy, since temperature control is not critical. i use one-shot chemicals, mostly hc110, rodinal, or pmk. for c41, i have temperature controlled heater. i have the large one for swimming pool, but recently i found a small one from this: https://cinestillfilm.com/products/tcs-temperature-control-system-tcs-1000-immersion-circulator-thermostat-for-mixing-chemistry-and-precision-film-processing-at-home?variant=31128830443594&currency=usd&utm_medium=product_sync&utm_source=google&utm_content=sag_organic&utm_campaign=sag_organic&utm_campaign=gs-2019-11-30&utm_source=google&utm_medium=smart_campaign&gclid=cjwkcaiayc2bbhaaeiwa44-ww_hngu-c6nh5g80xbe3nno1e0ctcojmsg6bw2efmhmkdb402shjf2rocnq0qavd_bwe", "sortedWord": "None", "Identifyer": null, "identifyer": 99338, "year": "2021"}, {"autor": "logan2z", "date": "2021-09-12 19:42:00", "content": "29 minutes ago, Michael Hiles said: Do you have any advice/tricks/instructions on how to do this? Heiland sells an LED light source for the v35, but it's very expensive. I don't know of a DIY solution for this. @Pyrogallol do tell.", "link": "https://www.l-camera-forum.com/topic/324193-do-you-currently-operate-a-darkroom/?tab=comments#comment-4274292", "origin": "L-forum", "suborigin": "324193-do-you-currently-operate-a-darkroom", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "29 minutes ago, michael hiles said: do you have any advice/tricks/instructions on how to do this? heiland sells an led light source for the v35, but it's very expensive. i don't know of a -----> diy !!!  solution for this. @pyrogallol do tell.", "sortedWord": "None", "Identifyer": null, "identifyer": 104255, "year": "2021"}, {"autor": "StS", "date": "2021-03-09 16:42:00", "content": " Last time in Venice was in an appartment in San Polo. It is a completely different experience to actually live in the city and shop at the local bakers and supermarkets. I started to wonder how DIY stuff is brought in, if you actually need to fix something at your place - do you hire a boat to have tools and wood delivered? Stefan", "link": "https://www.l-camera-forum.com/topic/315169-2021-athens-one-challenge-save-the-date/page/4/?tab=comments#comment-4157059", "origin": "L-forum", "suborigin": "315169-2021-athens-one-challenge-save-the-date", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " last time in venice was in an appartment in san polo. it is a completely different experience to actually live in the city and shop at the local bakers and supermarkets. i started to wonder how -----> diy !!!  stuff is brought in, if you actually need to fix something at your place - do you hire a boat to have tools and wood delivered? stefan", "sortedWord": "None", "Identifyer": null, "identifyer": 128727, "year": "2021"}, {"autor": "a.noctilux", "date": "2021-10-13 09:32:00", "content": "@sinjun, take it to a repair shop (Leica if possible) I think it can be a DIY* ... but it can be something I experienced on my M4 long ago (one of it's kind in my decades M use), without notice the spring failed to do it's job. * I took the lens out, then do some roller gentle in/out a couple of times", "link": "https://www.l-camera-forum.com/topic/325329-rangefinder-cam-sticking-on-m10-d/?tab=comments#comment-4291616", "origin": "L-forum", "suborigin": "325329-rangefinder-cam-sticking-on-m10-d", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "@sinjun, take it to a -----> repair !!!  shop (leica if possible) i think it can be a diy* ... but it can be something i experienced on my m4 long ago (one of it's kind in my decades m use), without notice the spring failed to do it's job.", "sortedWord": "repair", "Identifyer": null, "identifyer": 4173, "year": "2021"}, {"autor": "Ko.Fe.", "date": "2021-03-06 21:12:00", "content": " 8 hours ago, allucinox said: Hi My M9P also has corrosion and the Leica told me they will not replace any sensors anymore. So I have two options: - buy a new Leica and receive a coupon for my M9P - leave the camera as it is. Now, the M9P is my first Leica and it was a dream which came true when I had all the money to buy one. I told myself this camera will be used also from my son...bit crappy corrosion now.. I'm im Switzerland and woukd lije to repair the Sensor. Which company do you suggest? Repairing is cheaper for me then buy a new Leica. Many thx Cheapest fix for M9 with corroded sensor glass seems to be here: https://kolarivision.com/leica-m9-sensor-corrosion-repair/ If you want to pass usable and working camera among generations, LF format camera will do. Bellows are nothing too special to made. Lens, shutter will lasts for decades and easy to service. And LF is not just film, but DIY emulsion on the glass.", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/14/?tab=comments#comment-4155180", "origin": "L-forum", "suborigin": "313260-sensor-corrosion-analysis-and-fix-merged", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "and lf is not just -----> film !!! , but diy emulsion on the glass.", "sortedWord": "film", "Identifyer": null, "identifyer": 30407, "year": "2021"}, {"autor": "jkcampbell2", "date": "2021-03-06 21:37:00", "content": "19 minutes ago, Ko.Fe. said: Cheapest fix for M9 with corroded sensor glass seems to be here: https://kolarivision.com/leica-m9-sensor-corrosion-repair/ If you want to pass usable and working camera among generations, LF format camera will do. Bellows are nothing too special to made. Lens, shutter will lasts for decades and easy to service. And LF is not just film, but DIY emulsion on the glass. If someone is currently shooting a Leica and wants something to pass on to the next generation, I would think a film Leica would be the more logical move. Nothing lasts forever but suggesting someone move to large format and DIYing their own glass plates as a replacement for a digital Leica seems a bit silly. Cheers, jc", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/14/?tab=comments#comment-4155196", "origin": "L-forum", "suborigin": "313260-sensor-corrosion-analysis-and-fix-merged", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "and lf is not just -----> film !!! , but diy emulsion on the glass.", "sortedWord": "film", "Identifyer": null, "identifyer": 30408, "year": "2021"}, {"autor": "Raymondl", "date": "2021-03-07 06:42:00", "content": "9 hours ago, Ko.Fe. said: Cheapest fix for M9 with corroded sensor glass seems to be here: https://kolarivision.com/leica-m9-sensor-corrosion-repair/ If you want to pass usable and working camera among generations, LF format camera will do. Bellows are nothing too special to made. Lens, shutter will lasts for decades and easy to service. And LF is not just film, but DIY emulsion on the glass. @allucinox sorry to hear that, I personally had great experiences with Kolari Vision, however they only accept M9 ☹️ but maybe it's best to contact them directly to re-confirm. Quote Note: At the moment, we only support the Leica M9. We do not have support for the Leica M Monochrome, Leica M9-P, ME, or any other Leica camera other than the Leica M9.' Source: https://kolarivision.com/product/leica_m9_repair/", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/14/?tab=comments#comment-4155376", "origin": "L-forum", "suborigin": "313260-sensor-corrosion-analysis-and-fix-merged", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "and lf is not just -----> film !!! , but diy emulsion on the glass.", "sortedWord": "film", "Identifyer": null, "identifyer": 30410, "year": "2021"}, {"autor": "BradS", "date": "2021-03-21 15:22:00", "content": "some thoughts... Leica still sell two excellent film cameras...the MP and M-A. The price of any comparable used (non-exotic, special edition) Leica M film camera will always be bounded above by the price of these two brand new cameras. For example, it would be irrational for the price of a used M6 to exceed the price of a new MP. Prices are still determined by supply and demand. The demand for film and film cameras has been and continues to steadily increase but the supply of film cameras in particular is decreasing as old cameras die (or are \"fixed\" by arrogant morons who DiY) and are removed from useful circulation. Therefore, prices of film cameras have and may very well continue to increase. Other than Leica and a few plastic toy cameras no new small format cameras are being made by anybody, anywhere and Leica do not seem too interested in producing sufficient quantities to come anywhere near meeting demand...nor, unfortunately, do they seem to be able to reliably produce the small quantities that they do. Edited March 21 by BradS", "link": "https://www.l-camera-forum.com/topic/319125-old-leica-pricing/?tab=comments#comment-4165307", "origin": "L-forum", "suborigin": "319125-old-leica-pricing", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "the demand for -----> film !!!  and -----> film !!!  cameras has been and continues to steadily increase but the supply of -----> film !!!  cameras in particular is decreasing as old cameras die (or are \"fixed\" by arrogant morons who diy) and are removed from useful circulation.", "sortedWord": "film", "Identifyer": null, "identifyer": 4085, "year": "2021"}, {"autor": "Mr.Prime", "date": "2021-01-30 22:06:00", "content": "I’m willing to try it, I’m a DIY kinda person and not afraid to roll up my sleeves a little. I have been thinking about trying my hand at doing a rudimentary CLA because there are no local services, but the thing appears to work fine so I’m leaving that idea on the side burner. My M3 is a chrome, of course, so patina is not the same and this bit of damage offends my eyes. If I get a chance at a new M-P, which are usually BP, at a good price one day then it will be my pleasure to use til it’s showing some character. Edited January 30 by Mr.Prime", "link": "https://www.l-camera-forum.com/topic/317383-wanted-small-scraps-of-vulcanite/?tab=comments#comment-4129373", "origin": "L-forum", "suborigin": "317383-wanted-small-scraps-of-vulcanite", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i’m willing to try it, i’m a diy kinda person and not afraid to -----> roll !!!  up my sleeves a little.", "sortedWord": "roll", "Identifyer": null, "identifyer": 6038, "year": "2021"}, {"autor": "Slender", "date": "2021-10-14 18:42:00", "content": "21 hours ago, hansvons said: @Slender I see the 95% max value my Flame's waveform too, when working colour managed. Let's assume that all of that is somewhat ok-ish. Hi Hans, thanks again as always for your precious insight. I have done some shades of grey charts tests and I concluded that, if you want to use Zebras to warn you about clipping (about 95% IRE on the waveform as we both observed) while monitoring your L-Log, you have to use the (utterly weird choice) Luma value of 220. That's because, for some reason I can't fathom, Leica seems to have switched to the 8 bits scale (8-225) for the monitoring tools?????? Whilst shooting using L-Log. Whereas when you shoot w/o Log or HLG, the 10 bits scale (0-255) becomes relevant again... irrespective of shooting 10 bits .Mov or 8 Bits .MP4. This also means the lowest value you can choose for Zebras (200) only alows for an IRE equivalent of 80%.... Meaning you can't really have two different zebras setting you can use to expose... WHY????. For those who may not know the trick, you can use zebras at two distincts settings (one to avoid highlight clipping, and another one to properly expose 18% grey or whatever IRE you prefer for skintones). Lumix cameras allows you to show two at the time, and use the more useful IRE (0-105%) scale. The Luma 8bits (8-225) or 10bits (0-255) are only useful for stills in Raw to push your exposure to the right as high as you can before clipping. Not really useful for monitoring Log, especially if Leica doesn't tell us how high L-Log can be exposed before clipping, we are left in the dark and concluded by reverse engeneering that that Value is around 95IRE. Sorry to summon you @Leon_B., but is it possible to clarify this with Leica? SL2(s) is a wonderful platform for stills and video, but I have a feeling we are a bit left in the dark and we need to do an awful amount of DIY to extract the best out of it (L-Log). I am okay-ish with the waveform not displaying data above 95%IRE, but the Luma scale chosen for clipping in Stills is mostly irrelevant and hard to use in Video.@Photoworks@bpLeica@BernardC@frame-it@Aaron Daniel if you care about my 2 cents conclusions: When shooting L-Log, set your camera (and external monitor/recorder if you have) to warn you around 90-95%IRE for clipping highlights. Onboard the camera, the useful value (in Luma 8bits) is now around 220. If you shoot without L-Log, in either 8bits or 10bits (both behave better for a ready-out-of-camera-image now that we can fine tune contrasts/shadow/highlights/IDR) the Waveform scale will look different and display values above 100%, the clipping point is theortically 100IRE.... and The zebra Luma scale is again 10bits (0-255 equiv 0-100%IRE). A smart feature Leica kept is that the waveform monitor and the zebras remain unaffected regardless you use a lut preview in the camera rear-screen or EVF. So you can expose with confidence whilst enjoying framing with a Lut. For HLG, I don't have much experience with it but you can go ahead and enjoy @Stevenincredible videos I believe are mostly shot wih his SL2s using HLG 😍. It seems the clipping point is 100IRE on the waveform. Edited October 14 by Slender", "link": "https://www.l-camera-forum.com/topic/325265-cine-with-sl2s-l-log-fw3021-zebras-gone-waveform-flattened-above-90ire/?tab=comments#comment-4292572", "origin": "L-forum", "suborigin": "325265-cine-with-sl2s-l-log-fw3021-zebras-gone-waveform-flattened-above-90ire", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "sl2(s) is a wonderful platform for stills and -----> video !!! , but i have a feeling we are a bit left in the dark and we need to do an awful amount of diy to extract the best out of it (l-log).", "sortedWord": "video", "Identifyer": null, "identifyer": 27134, "year": "2021"}, {"autor": "schmidtbaer", "date": "2021-10-03 21:50:00", "content": "Just came across this post - reading about the Leitz Focomat V35 bulb problem. As mentioned by Pyrogallol, LEDs can be used to get around the supply shortage. I also own a (actually two) V35(s) and modified the light box by including 2x 3W red, 2x 3W blue, 2x 3W green and 2x 3W white LEDs. Driven by some MeanWell 700mA current source, the result is actually not too bad. Here a picture of the prototype LED board (still missing the 2 white LEDs) and the result.--img--  Coming back to the original post: Three years ago I started again to print B&W (I must have stopped in the late 90s) - and now have completely switch back to film - processing 3-4 films each month. Printing only the shoots I really like...may be 4 per roll. I process the films (HP5) in XT3 using a small DIY processor for Jobo tanks. Printing is done on the aforementioned modified V35(s). --img-- ", "link": "https://www.l-camera-forum.com/topic/324193-do-you-currently-operate-a-darkroom/?tab=comments#comment-4286068", "origin": "L-forum", "suborigin": "324193-do-you-currently-operate-a-darkroom", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i process the -----> films !!!  (hp5) in xt3 using a small diy processor for jobo tanks.", "sortedWord": "film", "Identifyer": null, "identifyer": 104258, "year": "2021"}], "name": "Leicasortedout2021diy"}