{"interestingcomments": [{"autor": "IkarusJohn", "date": "2017-02-17 09:08:00", "content": "Designed obsolescence.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/10/?tab=comments#comment-3215018", "origin": "L-forum", "suborigin": "268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!!  obsolescence.", "sortedWord": "None", "Identifyer": null, "identifyer": 3462, "year": "2017"}, {"autor": "CJJon", "date": "2017-10-20 12:43:00", "content": "I just got my M10 and am looking for a case. Probably the Leica one. A question to those who own it... How does the LCD Monitor flap stay up without flopping down (magnets)? There seems to be a white strip to protect the screen. Please enlighten me.... Thanks! Magnets. They are on the bottom corners of the flap. There is a strip of felt along the top inside of the flap. I really like the case. I'm a left-eye shooter and it keeps the screen clean and protected. I hate stick-on screen protectors. Most people think it is a film camera since the screen isn't visible. It's the case I would have designed.", "link": "https://www.l-camera-forum.com/topic/269254-problems-with-the-leica-m10-half-case/?tab=comments#comment-3378956", "origin": "L-forum", "suborigin": "269254-problems-with-the-leica-m10-half-case", "result": true, "Selector": "i would have designed", "selectorShort": "design", "MarkedSent": "i just got my m10 and am looking for a case. probably the leica one. a question to those who own it... how does the lcd monitor flap stay up without flopping down (magnets)? there seems to be a white strip to protect the screen. please enlighten me.... thanks! magnets. they are on the bottom corners of the flap. there is a strip of felt along the top inside of the flap. i really like the case. i'm a left-eye shooter and it keeps the screen clean and protected. i hate stick-on screen protectors. most people think it is a film camera since the screen isn't visible. it's the case -----> i !!!  -----> would !!!  -----> have !!!  -----> designed !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 8876, "year": "2017"}, {"autor": "chema", "date": "2017-12-30 17:54:00", "content": " I want to share my design to carry extra battery and memory cards for M8 and M9. It is a mere strip of leather 52 x 150 mm approximately, to which a foam with the hollow corresponding to the protrusion of the battery and a plastic box of an SD card are glued (the double-sided tape is OK). The closure is mede with velcro. I think the photos explain it better Best regards and Happy 2018. chema --img--  --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/280378-holder-for-m8m9-battery-and-card/?tab=comments#comment-3428842", "origin": "L-forum", "suborigin": "280378-holder-for-m8m9-battery-and-card", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": " i want to share -----> my !!!  -----> design !!!  to carry extra battery and memory cards for m8 and m9. it is a mere strip of leather 52 x 150 mm approximately, to which a foam with the hollow corresponding to the protrusion of the battery and a plastic box of an sd card are glued (the double-sided tape is ok). the closure is mede with velcro. i think the photos explain it better best regards and happy 2018. chema --img--  --img--  --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 38896, "year": "2017"}, {"autor": "George Furst", "date": "2017-01-17 04:53:00", "content": "Can someone please teach me how to convert a Leica UR Replica to a shooting camera thanks mak at teleport dot com I guess I do not understand your question. You imply that it is a simple process to convert the dummy UR Leica to a working model. This is not true. The Mr. Kim here who did the conversion worked off and on this project for three months. He had worked on watches and cameras for over 40 years and told me that it was a challenge for him. There were new gears to be made, measurements, careful manufacturing of new shutter springs. I have a working model with the original lens as described above but I could never tell you how to do it. I did provide a few pictures of the internals of the final conversion. I have looked very carefully inside my working model but much is hidden in the two barrels that are attached to the shutter curtain. I will say that many of the aspects of the later O series camera are part of the original. The difference is that the O series camera had two shutter curtains and the UR Leica had only one. In some ways this makes the UR Leica more complex as this one curtain gearing must do more functions. I realize that some owners of the dummy UR Leica think that it is all is contained in there and it would be a simple process to do the conversion. They look inside the dummy and see a curtain. They also see there is part of a film advancement gear present and the fake lens. They think all one must do is put a real lens in place of the fake one and all is done. This is far from the truth. If it was this simple Leica company would have made the UR camera a working model as they did with the O series camera of 2000. Leica knew that there was a great deal more to do. Much machining, making new gears, designing a lens that would fit into the small barrel of the dummy. Designing a shutter curtain with barrels that could fit inside the small interior of the UR. They did not do this cause it would have greatly increased the price of the final UR and most people would not be willing to spend that kind of money. I too thought it would be a simple process at first but over the months of observing the conversion of the dummy to the UR Replica, I really gained an appreciation of the complexity of the process. Now I have $1200 less in the bank but I also have a camera that I would not trade for $4000. It takes excellent pictures, is as small as many point and shoot cameras, and using it I understand how revolutionary this camera was at the time. I also appreciate better the feeling Barnack must have experienced as he took pictures of the Sunday family going up the stairs. A photo that could never have been taken with most cameras of the time. Then the excitement as he looked at the first pictures taken and was surprised at the sharpness of those photos. I hope this answers your question.", "link": "https://www.l-camera-forum.com/topic/138638-working-ur-leica/page/2/?tab=comments#comment-3187854", "origin": "L-forum", "suborigin": "138638-working-ur-leica", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "can someone please teach me how to convert a leica ur replica to a shooting camera thanks mak at teleport dot com i guess i do not understand your question. you imply that it is a simple process to convert the dummy ur leica to a working model. this is not true. the mr. kim here who did the conversion worked off and on this project for three months. he had worked on watches and cameras for over 40 years and told me that it was a challenge for him. there were new gears to be made, measurements, careful manufacturing of new shutter springs. i have a working model with the original lens as described above but i could never tell you how to do it. i did provide a few pictures of the internals of the final conversion. i have looked very carefully inside my working model but much is hidden in the two barrels that are attached to the shutter curtain. i will say that many of the aspects of the later o series camera are part of the original. the difference is that the o series camera had two shutter curtains and the ur leica had only one. in some ways this makes the ur leica more complex as this one curtain gearing must do more functions. i realize that some owners of the dummy ur leica think that it is all is contained in there and it would be a simple process to do the conversion. they look inside the dummy and see a curtain. they also see there is part of a film advancement gear present and the fake lens. they think all one must do is put a real lens in place of the fake one and all is done. this is far from the truth. if it was this simple leica company would have made the ur camera a working model as they did with the o series camera of 2000. leica knew that there was a great deal more to do. much machining, making new gears, designing a lens that would fit into the small barrel of the dummy. -----> designing !!!  a shutter curtain with barrels that could fit inside the small interior of the ur. they did not do this cause it would have greatly increased the price of the final ur and most people would not be willing to spend that kind of money. i too thought it would be a simple process at first but over the months of observing the conversion of the dummy to the ur replica, i really gained an appreciation of the complexity of the process. now i have $1200 less in the bank but i also have a camera that i would not trade for $4000. it takes excellent pictures, is as small as many point and shoot cameras, and using it i understand how revolutionary this camera was at the time. i also appreciate better the feeling barnack must have experienced as he took pictures of the sunday family going up the stairs. a photo that could never have been taken with most cameras of the time. then the excitement as he looked at the first pictures taken and was surprised at the sharpness of those photos. i hope this answers your question.", "sortedWord": "None", "Identifyer": null, "identifyer": 35674, "year": "2017"}, {"autor": "Steve Caddy", "date": "2017-10-16 11:59:00", "content": "A couple of friends of mine with professional backgrounds had built up the Leica legend in my mind while I was working as a designer and book layer-outerer at Lonely Planet. As my interest in photography grew and I became more acquainted with the masters of humanitarian documentary, the name came up again and again, which compounded the mystique. When I finally started thinking seriously about replacing my aging crop-frame Canon 350D, in 2009 there was a screaming hype online about the idea of a full frame digital Leica. I didn't want to go back to shooting film and didn't want to buy a crop frame camera, but there seemed to be a debate raging about whether a full frame M was even physically possible (this was before the advent of micro-lenses). When the M9 was released was star-struck and determined to get one, but it was way out of reach, financially. Months later, I became friends with a new guy at work who seemed to share every interest of mine, including photography. When the conversation finally came around to Leica and I talked about how I was desperate to try one he said, \"Oh, I have an M6. I'll lend it to you for a few months.\" Three months with the M6TTL and 50 Lux sealed the love affair, although with inconsistent results. I talked about it constantly at home, to my wife's chagrin — \"We can't afford a camera that costs thousands of dollars!\" \"I don't need to afford it!\" I said, \"I just need to find a way of getting one!\" I'd managed to barter my way into a custom bicycle in the past by exchanging design work for labor and figured there must be a similar avenue with the Leica. The guy at work had put down a deposit on an M9 and told me that he would be willing to sell me the M6 cheaply on condition that I lend it back to him if he missed shooting film. One day while chewing the ear off another friend about Leica, he told me he thought the brand had become pretentious — \"It's just a very simple camera with luxury marketing. And the simpler it gets the more pretentious the claims are. They should make a pinhole camera, charge a fortune and market it as the most essential camera there is.\" That's it! I designed a little cardboard pinhole camera with a rectangular enclosure, and stole product photography from Leica's own website to map onto the box. With a small amount of money borrowed from a friend, I funded a print run of Leica-look-alke pinhole templates on heavy cardboard, scored along the fold lines, with instructions and a Sunny 16 exposure guide included. I designed and built a small website in the style of the leica-camera.com of the day, with a satirical \"Like-a\" red dot logo, and the most pretentious product copy I could come up with, connected to an ecommerce order form. At $20 each for a sheet of cardboard they were hand-crafted and approaching Veblen margins. With some creative Tweeting and some help from a few friends I managed to get picked up by the WIRED blog and a few others, and the orders started coming in. Much like the real Leica, some hated the idea of paying so much for so little, but many loved the idea and bought two or three for old friends who were Leicaphiles, or to add to a collection of other Leica paraphernalia. Eventually, I received a stern letter from Leica AG, scalding me for appropriating their logo and ordering a cease and desist. I complied of course, and told their Legal department that it was only a desire to buy one of their products that lead to all this. I tallied up the takings and was close enough to make an offer on the M6 and 35 Cron. I shot that camera and lens at the exclusion of all else for two or three years and found it punishing. The first three months produced the worst pictures I've ever taken. Out of focus, under exposed, just generally crap. But as each month went by I learned the camera intuitively and the pictures got better. When the Typ 240 was released, the same friend upgraded again, and I traded him back the M6 and some cash in exchange for the M9. I loved the M9, but it eventually succumbed to the sensor corrosion issue and when Leica offered an M or M-P upgrade I jumped to the M-P. The M10 is tempting, but I'll hold off for at least another generation (unless maybe there's an M10-P or Safari that's just too good to pass up). Here's one of the very first pictures: https://www.flickr.com/photos/stevecaddy/4998550764/in/album-72157624849932129/lightbox/", "link": "https://www.l-camera-forum.com/topic/242491-your-first-leica-tell-your-story/page/6/?tab=comments#comment-3376599", "origin": "L-forum", "suborigin": "242491-your-first-leica-tell-your-story", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "a couple of friends of mine with professional backgrounds had built up the leica legend in my mind while i was working as a designer and book layer-outerer at lonely planet. as my interest in photography grew and i became more acquainted with the masters of humanitarian documentary, the name came up again and again, which compounded the mystique. when i finally started thinking seriously about replacing my aging crop-frame canon 350d, in 2009 there was a screaming hype online about the idea of a full frame digital leica. i didn't want to go back to shooting film and didn't want to buy a crop frame camera, but there seemed to be a debate raging about whether a full frame m was even physically possible (this was before the advent of micro-lenses). when the m9 was released was star-struck and determined to get one, but it was way out of reach, financially. months later, i became friends with a new guy at work who seemed to share every interest of mine, including photography. when the conversation finally came around to leica and i talked about how i was desperate to try one he said, \"oh, i have an m6. i'll lend it to you for a few months.\" three months with the m6ttl and 50 lux sealed the love affair, although with inconsistent results. i talked about it constantly at home, to my wife's chagrin — \"we can't afford a camera that costs thousands of dollars!\" \"i don't need to afford it!\" i said, \"i just need to find a way of getting one!\" i'd managed to barter my way into a custom bicycle in the past by exchanging design work for labor and figured there must be a similar avenue with the leica. the guy at work had put down a deposit on an m9 and told me that he would be willing to sell me the m6 cheaply on condition that i lend it back to him if he missed shooting film. one day while chewing the ear off another friend about leica, he told me he thought the brand had become pretentious — \"it's just a very simple camera with luxury marketing. and the simpler it gets the more pretentious the claims are. they should make a pinhole camera, charge a fortune and market it as the most essential camera there is.\" that's it! -----> i !!!  -----> designed !!!  a little cardboard pinhole camera with a rectangular enclosure, and stole product photography from leica's own website to map onto the box. with a small amount of money borrowed from a friend, i funded a print run of leica-look-alke pinhole templates on heavy cardboard, scored along the fold lines, with instructions and a sunny 16 exposure guide included. i designed and built a small website in the style of the leica-camera.com of the day, with a satirical \"like-a\" red dot logo, and the most pretentious product copy i could come up with, connected to an ecommerce order form. at $20 each for a sheet of cardboard they were hand-crafted and approaching veblen margins. with some creative tweeting and some help from a few friends i managed to get picked up by the wired blog and a few others, and the orders started coming in. much like the real leica, some hated the idea of paying so much for so little, but many loved the idea and bought two or three for old friends who were leicaphiles, or to add to a collection of other leica paraphernalia. eventually, i received a stern letter from leica ag, scalding me for appropriating their logo and ordering a cease and desist. i complied of course, and told their legal department that it was only a desire to buy one of their products that lead to all this. i tallied up the takings and was close enough to make an offer on the m6 and 35 cron. i shot that camera and lens at the exclusion of all else for two or three years and found it punishing. the first three months produced the worst pictures i've ever taken. out of focus, under exposed, just generally crap. but as each month went by i learned the camera intuitively and the pictures got better. when the typ 240 was released, the same friend upgraded again, and i traded him back the m6 and some cash in exchange for the m9. i loved the m9, but it eventually succumbed to the sensor corrosion issue and when leica offered an m or m-p upgrade i jumped to the m-p. the m10 is tempting, but i'll hold off for at least another generation (unless maybe there's an m10-p or safari that's just too good to pass up). here's one of the very first pictures: https://www.flickr.com/photos/stevecaddy/4998550764/in/album-72157624849932129/lightbox/", "sortedWord": "None", "Identifyer": null, "identifyer": 82171, "year": "2017"}, {"autor": "Guest", "date": "2017-03-09 19:30:00", "content": "To further amend this thread. M.Hilo and I designed a unter-the-lens filter holder for the Ic and the Valoy II. We're currently making and testing prototypes. Someone with access to a plasma cutter and/or handy with working on aluminum should easily be able to manufacture one for their own use. Find the CAD drawings and specs here (the info is still a bit jumbled, we're working on it): https://github.com/aha/filterholder Cheers, Andi Edited March 9, 2017 by Guest", "link": "https://www.l-camera-forum.com/topic/245798-leitz-focomat-ic-restauration-project-several-questions/?tab=comments#comment-3230308", "origin": "L-forum", "suborigin": "245798-leitz-focomat-ic-restauration-project-several-questions", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "to further amend this thread. m.hilo and -----> i !!!  -----> designed !!!  a unter-the-lens filter holder for the ic and the valoy ii. we're currently making and testing prototypes. someone with access to a plasma cutter and/or handy with working on aluminum should easily be able to manufacture one for their own use. find the cad drawings and specs here (the info is still a bit jumbled, we're working on it): https://github.com/aha/filterholder cheers, andi edited march 9, 2017 by guest", "sortedWord": "None", "Identifyer": null, "identifyer": 104863, "year": "2017"}, {"autor": "TomB_tx", "date": "2017-02-07 14:09:00", "content": "I set up my darkroom again after I retired and started collecting and servicing old film cameras. I do a lot of B&W test rolls, but mainly scan the negatives in batch, unless I'm really shooting for results. I picked up a Focomat V35 (both color and variable contrast heads), and was given a Focomat 1b and restored it to working condition. The autofocus on both is nice, but I used an Omega B22XL for decades, and can still get better contrast results with it, as I am used to it. With the kids gone, when we had to re-do their bath (due to a pipe failing under the concrete slab), I designed cabinets to fit an enlarger, good countertop for processing, etc and still convert quickly to a comfortable guest bath again. Darkroom work is a comfortable old friend, and makes film convenient with most processing places distant.", "link": "https://www.l-camera-forum.com/topic/269097-why-darkroom/?tab=comments#comment-3206759", "origin": "L-forum", "suborigin": "269097-why-darkroom", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "i set up my darkroom again after i retired and started collecting and servicing old film cameras. i do a lot of b&w test rolls, but mainly scan the negatives in batch, unless i'm really shooting for results. i picked up a focomat v35 (both color and variable contrast heads), and was given a focomat 1b and restored it to working condition. the autofocus on both is nice, but i used an omega b22xl for decades, and can still get better contrast results with it, as i am used to it. with the kids gone, when we had to re-do their bath (due to a pipe failing under the concrete slab), -----> i !!!  -----> designed !!!  cabinets to fit an enlarger, good countertop for processing, etc and still convert quickly to a comfortable guest bath again. darkroom work is a comfortable old friend, and makes film convenient with most processing places distant.", "sortedWord": "None", "Identifyer": null, "identifyer": 105970, "year": "2017"}], "name": "Leicasortedout2017design"}