{"interestingcomments": [{"autor": "Herr Barnack", "date": "2018-08-08 02:47:00", "content": "Here's an article I wrote about digital sensor cleaning for my blog. I hope this will shed some light on the cleaning process. Having your sensor cleaned by the manufacturer or by a repair technician is a costly and needless expense and inconvenience; it is something that every photographer would benefit from learning to do themselves. If you are on a month long photo expedition in _______________ (fill in the blank) and your sensor picks up debris on your first lens change, do you really want to come home with 20,000 images that must ALL be spotted in Photoshop or Lightroom? Digital Camera Sensor Cleaning Digital cameras have sensors; unless your camera has a built in dust reduction system, sooner or later your sensor will need to be cleaned - it's inevitable. Then what?? It's a lot quicker, easier and less costly to do it yourself - if you follow your camera manual instructions exactly and are careful, you can successfully clean your camera's sensor yourself. A lot of photographers fear damaging their sensor and will do about anything to avoid cleaning it themselves. However, there is no reason to be afraid to do this procedure yourself, provided you do it properly. You will need the right sensor cleaning supplies - I use Eclipse Optic Cleaning Fluid and Photosol Sensorswab Ultra sensor cleaning swabs. If your camera has a full frame (24x36mm ) sensor, you will need the Type 3 swabs; they are 24 mm wide, as is your sensor. APS-C and smaller sensors will need smaller swabs. Photosol's website has information that will help you determine which swab is right for your camera. One of the most important factors in successful sensor cleaning is to perform this procedure in a clean, dust free environment. Not many of us have access to a clean room such as computer manufacturers build computers in. If your home has airborne dust issues you will need to clean your sensor in an environment where dust is less of a problem (you can check for airborne dust by looking through the beam of a bright flashlight at night; if you see a lot of dust particles dancing in the air, you should probably go elsewhere to clean your sensor). Where would that be? Try a museum or a library; find a spot away from frequent foot traffic, entries and exits and away from heating and cooling ducts that will cause airflow that will stir up any dust that may be present. Another important point is this - do not use compressed air (\"canned air\") to blow dust from your sensor before cleaning. Canned air can spray liquid propellant onto your sensor cover glass, something you do not want to happen. That liquid can also get behind the sensor and into the electronic components of your camera. If that happens, you are in for a serious repair bill. Instead of canned air, use a blower bulb like the Giottos Rocket Blaster, which will safely remove loose dust particles from your sensor. The sensor swabs I use are dry, which means I need to apply the proper cleaning fluid to them before use. Too much cleaning fluid can damage the electronics inside your camera, so proceed with caution. I have found that four drops on the 24mm wide swabs my camera requires is sufficient (two drops on one side, two on the opposite side) applied right at the edge of the swab that will contact your sensor; give them 10 seconds to be wicked across the swab's edge so that the liquid is dispersed in a uniform manner. Again, follow the directions that come with your swabs and cleaning fluid to the letter. Each camera has a specific procedure for sensor cleaning; if you precisely adhere to the instructions in your camera manual, you should have a successful sensor cleaning result. If there are still spots on your sensor after cleaning, you can re-clean the sensor provided your camera manual does not advise against doing so (I once ended up with an eyelash on my sensor that required two cleanings to remove; the first try simply moved it closer to the center of the sensor; this happens sometimes). If you follow the directions in your camera manual and in your swab and cleaning fluid to the letter, you should have no problems cleaning your sensor at home (or at your local museum or library, if need be). DISCLAIMER The above description of sensor cleaning is simply a description of how I clean my sensor; it is not intended as training or professional advice in sensor cleaning. Always follow the directions in your camera manual and in your sensor cleaning materials to the letter. When in doubt, contact your camera manufacturer for advice on sensor cleaning, or return your camera to the manufacturer's repair department for sensor cleaning. The author accepts no responsibility for any damage resulting from do it yourself sensor cleaning. When in doubt, contact your camera manufacturer to return your camera to the manufacturer's repair department for professional sensor cleaning. Edited August 8, 2018 by Herr Barnack", "link": "https://www.l-camera-forum.com/topic/287250-cost-of-sensor-cleaning-of-007/?tab=comments#comment-3568619", "origin": "L-forum", "suborigin": "287250-cost-of-sensor-cleaning-of-007", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "here's an article i wrote about digital sensor cleaning for my blog. i hope this will shed some light on the cleaning process. having your sensor cleaned by the manufacturer or by a repair technician is a costly and needless expense and inconvenience; it is something that every photographer would benefit from learning to do themselves. if you are on a month long photo expedition in _______________ (fill in the blank) and your sensor picks up debris on your first lens change, do you really want to come home with 20,000 images that must all be spotted in photoshop or lightroom? digital camera sensor cleaning digital cameras have sensors; unless your camera has a built in dust reduction system, sooner or later your sensor will need to be cleaned - it's inevitable. then what?? -----> it !!! 's a lot quicker, easier and less costly to -----> do !!!  -----> it !!!  -----> yourself !!!  - if you follow your camera manual instructions exactly and are careful, you can successfully clean your camera's sensor -----> yourself !!! . a lot of photographers fear damaging their sensor and will do about anything to avoid cleaning it themselves. however, there is no reason to be afraid to do this procedure yourself, provided you do it properly. you will need the right sensor cleaning supplies - i use eclipse optic cleaning fluid and photosol sensorswab ultra sensor cleaning swabs. if your camera has a full frame (24x36mm ) sensor, you will need the type 3 swabs; they are 24 mm wide, as is your sensor. aps-c and smaller sensors will need smaller swabs. photosol's website has information that will help you determine which swab is right for your camera. one of the most important factors in successful sensor cleaning is to perform this procedure in a clean, dust free environment. not many of us have access to a clean room such as computer manufacturers build computers in. if your home has airborne dust issues you will need to clean your sensor in an environment where dust is less of a problem (you can check for airborne dust by looking through the beam of a bright flashlight at night; if you see a lot of dust particles dancing in the air, you should probably go elsewhere to clean your sensor). where would that be? try a museum or a library; find a spot away from frequent foot traffic, entries and exits and away from heating and cooling ducts that will cause airflow that will stir up any dust that may be present. another important point is this - do not use compressed air (\"canned air\") to blow dust from your sensor before cleaning. canned air can spray liquid propellant onto your sensor cover glass, something you do not want to happen. that liquid can also get behind the sensor and into the electronic components of your camera. if that happens, you are in for a serious repair bill. instead of canned air, use a blower bulb like the giottos rocket blaster, which will safely remove loose dust particles from your sensor. the sensor swabs i use are dry, which means i need to apply the proper cleaning fluid to them before use. too much cleaning fluid can damage the electronics inside your camera, so proceed with caution. i have found that four drops on the 24mm wide swabs my camera requires is sufficient (two drops on one side, two on the opposite side) applied right at the edge of the swab that will contact your sensor; give them 10 seconds to be wicked across the swab's edge so that the liquid is dispersed in a uniform manner. again, follow the directions that come with your swabs and cleaning fluid to the letter. each camera has a specific procedure for sensor cleaning; if you precisely adhere to the instructions in your camera manual, you should have a successful sensor cleaning result. if there are still spots on your sensor after cleaning, you can re-clean the sensor provided your camera manual does not advise against doing so (i once ended up with an eyelash on my sensor that required two cleanings to remove; the first try simply moved it closer to the center of the sensor; this happens sometimes). if you follow the directions in your camera manual and in your swab and cleaning fluid to the letter, you should have no problems cleaning your sensor at home (or at your local museum or library, if need be). disclaimer the above description of sensor cleaning is simply a description of how i clean my sensor; it is not intended as training or professional advice in sensor cleaning. always follow the directions in your camera manual and in your sensor cleaning materials to the letter. when in doubt, contact your camera manufacturer for advice on sensor cleaning, or return your camera to the manufacturer's repair department for sensor cleaning. the author accepts no responsibility for any damage resulting from do it yourself sensor cleaning. when in doubt, contact your camera manufacturer to return your camera to the manufacturer's repair department for professional sensor cleaning. edited august 8, 2018 by herr barnack", "sortedWord": "None", "Identifyer": null, "identifyer": 32688, "year": "2018"}, {"autor": "mich", "date": "2018-09-01 23:56:00", "content": "\"selber machen\" --img--  Actually \"Do it yourself\" is the accepted expression in Germany. --img-- The common language in Germany has become swamped with anglicisms, with the advertising industry being the main culprit! Edited September 1, 2018 by mich", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/?tab=comments#comment-3584336", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "\"selber machen\" --img--  actually \"-----> do !!!  -----> it !!!  -----> yourself !!! \" is the accepted expression in germany. --img-- the common language in germany has become swamped with anglicisms, with the advertising industry being the main culprit! edited september 1, 2018 by mich", "sortedWord": "None", "Identifyer": null, "identifyer": 84366, "year": "2018"}, {"autor": "onca", "date": "2018-09-02 06:47:00", "content": "Actually \"Do it yourself\" is the accepted expression in Germany. --img--  Well, it´s the expression. But it´s not the translation, that pico asked for. I allways prefer my mother-speech --img-- ", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/?tab=comments#comment-3584420", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "actually \"-----> do !!!  -----> it !!!  -----> yourself !!! \" is the accepted expression in germany. --img--  well, it´s the expression. but it´s not the translation, that pico asked for. i allways prefer my mother-speech --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 84367, "year": "2018"}, {"autor": "carbon_dragon", "date": "2018-09-27 21:58:00", "content": "It looks good! I was also pretty amazed of what their 3200 black and white can do. I remember when 3200 meant 2475 recording film. Can I ask where you guys send your film for processing? Do you do it yourself, bring it somewhere locally? Send it away by mail? I’m in Atlanta, if it matters.", "link": "https://www.l-camera-forum.com/topic/289837-bold-color-vivid-detail-chrome-is-back/?tab=comments#comment-3601651", "origin": "L-forum", "suborigin": "289837-bold-color-vivid-detail-chrome-is-back", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "it looks good! i was also pretty amazed of what their 3200 black and white can do. i remember when 3200 meant 2475 recording film. can i ask where you guys send your film for processing? -----> do !!!  you -----> do !!!  -----> it !!!  -----> yourself !!! , bring -----> it !!!  somewhere locally? send it away by mail? i’m in atlanta, if it matters.", "sortedWord": "None", "Identifyer": null, "identifyer": 103767, "year": "2018"}, {"autor": "sblitz", "date": "2018-09-28 03:34:00", "content": "It looks good! I was also pretty amazed of what their 3200 black and white can do. I remember when 3200 meant 2475 recording film. Can I ask where you guys send your film for processing? Do you do it yourself, bring it somewhere locally? Send it away by mail? I’m in Atlanta, if it matters. I shoot the 3200 indoors at a jazz club in NYC and love, trying it outside now just to see ..... I send my work to the color house on lafayette st in NYC, they accept mail, etc. good people, good turn around ....", "link": "https://www.l-camera-forum.com/topic/289837-bold-color-vivid-detail-chrome-is-back/?tab=comments#comment-3601729", "origin": "L-forum", "suborigin": "289837-bold-color-vivid-detail-chrome-is-back", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "it looks good! i was also pretty amazed of what their 3200 black and white can do. i remember when 3200 meant 2475 recording film. can i ask where you guys send your film for processing? -----> do !!!  you -----> do !!!  -----> it !!!  -----> yourself !!! , bring -----> it !!!  somewhere locally? send it away by mail? i’m in atlanta, if it matters. i shoot the 3200 indoors at a jazz club in nyc and love, trying it outside now just to see ..... i send my work to the color house on lafayette st in nyc, they accept mail, etc. good people, good turn around ....", "sortedWord": "None", "Identifyer": null, "identifyer": 103769, "year": "2018"}], "name": "Leicasortedout2018yourself"}