{"interestingcomments": [{"autor": "CaptZoom", "date": "2013-07-15 19:15:00", "content": "Consider that a theoretical curved (really concave spherical or parabolic) sensor, if even possible would be totally unsuitable for M lenses which project an image onto a flat field. Which is why I was wondering about Ricoh style modules (and not for the M, but for a new system camera). I think you have to think through what kind of manufacturing facility would be required to make such a sensor, compare that to other solutions, and also consider that it would require a complete line of lenses designed just for it. The additional depth of a camera would be the least of the problems. I'm not espousing that Leica should do this for the M. I think whatever issues can be resolved with a firmware update, should be resolved with it. I like the way the M system works, and hope Leica doesn't deviate from it. If they want to introduce a new and separate system that's fine with me (though I think we agree that Leica won't be doing so any time soon). I'm jus curious about what is realistically possible if a company, say Sony, were to develop and introduce a new system.* *I don't think Sony will be I introducing and maintaining three separate lines of interchangeable lens camera and lens systems.", "link": "https://www.l-camera-forum.com/topic/214267-the-sony-a7-thread-merged/page/9/?tab=comments#comment-2374993", "origin": "L-forum", "suborigin": "214267-the-sony-a7-thread-merged", "result": true, "Selector": "i introducing", "selectorShort": "introduce", "MarkedSent": "consider that a theoretical curved (really concave spherical or parabolic) sensor, if even possible would be totally unsuitable for m lenses which project an image onto a flat field. which is why i was wondering about ricoh style modules (and not for the m, but for a new system camera). i think you have to think through what kind of manufacturing facility would be required to make such a sensor, compare that to other solutions, and also consider that it would require a complete line of lenses designed just for it. the additional depth of a camera would be the least of the problems. i'm not espousing that leica should do this for the m. i think whatever issues can be resolved with a firmware update, should be resolved with it. i like the way the m system works, and hope leica doesn't deviate from it. if they want to introduce a new and separate system that's fine with me (though i think we agree that leica won't be doing so any time soon). i'm jus curious about what is realistically possible if a company, say sony, were to develop and introduce a new system.* *-----> i !!!  don't think sony will be -----> i !!!  -----> introducing !!!  and maintaining three separate lines of interchangeable lens camera and lens systems.", "sortedWord": "None", "Identifyer": null, "identifyer": 92812, "year": "2013"}, {"autor": "JuanLeon", "date": "2013-05-19 15:05:00", "content": "Hi all, After some time following the forum I've decided to introduce myself. From south of Spain, and the proud owner of a M240 and 35 cron Asph since April, lugs repair included, I'm starting my life behind a rangefinder window. Been mainly a Nikon user, right now my cameras are D3s, Panasonic GF1 and Fuji XPro1, but I'm going to sell the Fuji and some Nikon lenses soon, and my daughter takes care of the GF1. Best, Juan", "link": "https://www.l-camera-forum.com/topic/186962-welcome/page/2/?tab=comments#comment-2324882", "origin": "L-forum", "suborigin": "186962-welcome", "result": true, "Selector": "i've decided to introduce", "selectorShort": "introduce", "MarkedSent": "hi all, after some time following the forum -----> i !!! 've -----> decided !!!  -----> to !!!  -----> introduce !!!  myself. from south of spain, and the proud owner of a m240 and 35 cron asph since april, lugs repair included, i'm starting my life behind a rangefinder window. been mainly a nikon user, right now my cameras are d3s, panasonic gf1 and fuji xpro1, but i'm going to sell the fuji and some nikon lenses soon, and my daughter takes care of the gf1. best, juan", "sortedWord": "None", "Identifyer": null, "identifyer": 113789, "year": "2013"}, {"autor": "bender73", "date": "2013-12-22 17:14:00", "content": " Hello. I figured I would introduce myself. I am a part-time professional photographer (weddings and portraits). I have always wanted a Leica. Some days I am tempted to sell my bag of pro Nikon gear, give up weddings, and get an M-system. However, I do enjoy shooting weddings and need the DSLR to do it properly IMHO. Anyway, my wife just purchased an X1 for me as a gift (black) and I am anxiously awaiting the arrival of this new camera. I wanted a nice compact camera to carry around because a Nikon D3 (even the D600) can be too heavy...especially with good glass. I was thinking about the X100, but the body is only 1/4 the value of a camera. Glass is where the quality is and Leica is known for their lenses. Anyway, I hope I like the X1 and I am sure it will be a gateway drug leading me to want an M9, etc. soon. Don't let me do anything too crazy here! Feel free to take a look at my site. Chris", "link": "https://www.l-camera-forum.com/topic/218887-hello-new-to-leica/?tab=comments#comment-2492921", "origin": "L-forum", "suborigin": "218887-hello-new-to-leica", "result": true, "Selector": "i would introduce", "selectorShort": "introduce", "MarkedSent": " hello. -----> i !!!  figured -----> i !!!  -----> would !!!  -----> introduce !!!  myself. i am a part-time professional photographer (weddings and portraits). i have always wanted a leica. some days i am tempted to sell my bag of pro nikon gear, give up weddings, and get an m-system. however, i do enjoy shooting weddings and need the dslr to do it properly imho. anyway, my wife just purchased an x1 for me as a gift (black) and i am anxiously awaiting the arrival of this new camera. i wanted a nice compact camera to carry around because a nikon d3 (even the d600) can be too heavy...especially with good glass. i was thinking about the x100, but the body is only 1/4 the value of a camera. glass is where the quality is and leica is known for their lenses. anyway, i hope i like the x1 and i am sure it will be a gateway drug leading me to want an m9, etc. soon. don't let me do anything too crazy here! feel free to take a look at my site. chris", "sortedWord": "None", "Identifyer": null, "identifyer": 115488, "year": "2013"}, {"autor": "tookaphotoof", "date": "2013-10-28 16:15:00", "content": " After months of reading I might as well introduce myself. Hobby photographer to clear up my mind and forget about work for a moment. Used to be a \"Canon\" guy with a 5D2 and L lenses. Somehow I was never completely satisfied so apart from a telezoom L I got rid of the other L lenses. Replaced them with a 1,4/50 and a 2,8/21 ZE which are much more to my taste. Rediscovered the fun of analog photography with Minolta A5 rangefinder and bought myself a Hasselblad 501cm. Hold on, I haven't finished this post, yet. Went to Singapore with it for a couple of days and it proofed a bit of a handfull walking all day with a Hassy and a tripod. In a very short time I have added an M6 with 35mm Summicron IV and later on came the 50 Summicron. Just recently added an MP to the 'fleet'. --img--  Not sure if I'm going to keep my dslr gear or if I'm going to trade it in for a digital M in time. Guess I'm getting very hooked to this brand.", "link": "https://www.l-camera-forum.com/topic/215517-might-as-well-say-hi/?tab=comments#comment-2452274", "origin": "L-forum", "suborigin": "215517-might-as-well-say-hi", "result": true, "Selector": "i might as well introduce", "selectorShort": "introduce", "MarkedSent": " after months of reading -----> i !!!  -----> might !!!  -----> as !!!  -----> well !!!  -----> introduce !!!  myself. hobby photographer to clear up my mind and forget about work for a moment. used to be a \"canon\" guy with a 5d2 and l lenses. somehow i was never completely satisfied so apart from a telezoom l i got rid of the other l lenses. replaced them with a 1,4/50 and a 2,8/21 ze which are much more to my taste. rediscovered the fun of analog photography with minolta a5 rangefinder and bought myself a hasselblad 501cm. hold on, i haven't finished this post, yet. went to singapore with it for a couple of days and it proofed a bit of a handfull walking all day with a hassy and a tripod. in a very short time i have added an m6 with 35mm summicron iv and later on came the 50 summicron. just recently added an mp to the 'fleet'. --img--  not sure if i'm going to keep my dslr gear or if i'm going to trade it in for a digital m in time. guess i'm getting very hooked to this brand.", "sortedWord": "None", "Identifyer": null, "identifyer": 115614, "year": "2013"}], "name": "Leicasortedout2013introduce"}