{"interestingcomments": [{"autor": "PhotoCruiser", "date": "2020-04-12 09:03:00", "content": "Hi Magic, due the lack of time and not finding suitable critters i have no photos with life animals shot with the Q2. The restriction of posting only Leica Camera photos i cannot post the macro photos with my Panasonic Lumix LX100 underwater or with my D800 on land. On the Lumix LX100 i use a SubSee 10x diopter with very short foyus distance as well while the D800 uses the Nikon 105mm Micro VR However, regarding your question how i shoot live animals so near: one of the best solutions i found and when i took two if my best photos of a mediterrean black widow and tiny snake with the D800 was: depositing the animals in a rectangular ceramic dish like this one, but also white outside as this has two advantages: - the extremy slick surface avoid that the animal can crawl - but fly - out - the glossy and pure white color it create some kind of a soft box effect - i use one Nikon SB800 strobe in wireless mode to illuminate from the side to add a bit of 3D depth Underwater i use two INON Z-240 strobe on double aluminum arms so i can position them wherever i want to have them, here is a similar setup as the one i use--img--  While writing this i realized that i could try to attach the Q2 to the whole strobe stup and use them instead of my Metz. Nowadays in underwater photography we use slave strobes (what was available some years ago as well for land photography) Slave strobes basically means that the strobe get triggered by the camera strobe and has a cell measuring the light bouncing back and adjusting acordingly the time of the strobe's flash. This sounds as a dumb, unreliable solution, but i can guarantee that this works surprisingle very well as the cameras TTL will correct exposure. But this is another story.... However, the common solution for close up macro photography is a ringe strobe as LeicaGuy already suggested. As Leica has no and TTL would not work with any other brand than LEICA there are only two solutions for a ring strobe a) buy the smallest outer diameter ring strobe available and drive it manually, they cam cost from 50$ up to 450 for the Metz ring strobe b) use one of this ring strobe adaptors who use the existing strobe and this would permit to use TTL if you use a LEICA strobe the one linked above is too wide but there are some other products with a smaller diameter. This would be also a nice and not too complicated project to engineer it for a Leica Strobe using a 3D printer Chris P.S. On page one of this tread you can see: a) the snake in the ceramic baking dish and some others on their natural ambient b) my ring light what is too wide diameter and will touch the floor and it's also not strong enough to be the only source of light Excluding very strong video lights, there is no replacement for a strobe as it's light output is much higher than a allways on light If you wonder why i use this McGyver solutions; 98% of my actual life i live either on the Island of Sardinia or in Costa Rica where photo shops are very rare and the existing ones sell only mainstream stuff. So i must buy my things either ordering them online and wait for days/weeks or buy it while i'm back in my hometown in Zurich. I dream of living in NYC where i just can walk over to Adorama or B&H ona buy whatever i need, but honestly, that would be my financial ruin... So often i need to invent McGyver solutions to be able to take a photo for what i cannot wait for days till i receive the needed goods. Edited April 12, 2020 by PhotoCruiser", "link": "https://www.l-camera-forum.com/topic/303743-macroclose-up-filters-for-the-q2/page/3/?tab=comments#comment-3951980", "origin": "L-forum", "suborigin": "303743-macroclose-up-filters-for-the-q2", "result": true, "Selector": "i need to invent", "selectorShort": "invent", "MarkedSent": "hi magic, due the lack of time and not finding suitable critters i have no photos with life animals shot with the q2. the restriction of posting only leica camera photos i cannot post the macro photos with my panasonic lumix lx100 underwater or with my d800 on land. on the lumix lx100 i use a subsee 10x diopter with very short foyus distance as well while the d800 uses the nikon 105mm micro vr however, regarding your question how i shoot live animals so near: one of the best solutions i found and when i took two if my best photos of a mediterrean black widow and tiny snake with the d800 was: depositing the animals in a rectangular ceramic dish like this one, but also white outside as this has two advantages: - the extremy slick surface avoid that the animal can crawl - but fly - out - the glossy and pure white color it create some kind of a soft box effect - i use one nikon sb800 strobe in wireless mode to illuminate from the side to add a bit of 3d depth underwater i use two inon z-240 strobe on double aluminum arms so i can position them wherever i want to have them, here is a similar setup as the one i use--img--  while writing this i realized that i could try to attach the q2 to the whole strobe stup and use them instead of my metz. nowadays in underwater photography we use slave strobes (what was available some years ago as well for land photography) slave strobes basically means that the strobe get triggered by the camera strobe and has a cell measuring the light bouncing back and adjusting acordingly the time of the strobe's flash. this sounds as a dumb, unreliable solution, but i can guarantee that this works surprisingle very well as the cameras ttl will correct exposure. but this is another story.... however, the common solution for close up macro photography is a ringe strobe as leicaguy already suggested. as leica has no and ttl would not work with any other brand than leica there are only two solutions for a ring strobe a) buy the smallest outer diameter ring strobe available and drive it manually, they cam cost from 50$ up to 450 for the metz ring strobe b) use one of this ring strobe adaptors who use the existing strobe and this would permit to use ttl if you use a leica strobe the one linked above is too wide but there are some other products with a smaller diameter. this would be also a nice and not too complicated project to engineer it for a leica strobe using a 3d printer chris p.s. on page one of this tread you can see: a) the snake in the ceramic baking dish and some others on their natural ambient b) my ring light what is too wide diameter and will touch the floor and it's also not strong enough to be the only source of light excluding very strong video lights, there is no replacement for a strobe as it's light output is much higher than a allways on light if you wonder why i use this mcgyver solutions; 98% of my actual life i live either on the island of sardinia or in costa rica where photo shops are very rare and the existing ones sell only mainstream stuff. so i must buy my things either ordering them online and wait for days/weeks or buy it while i'm back in my hometown in zurich. -----> i !!!  dream of living in nyc where -----> i !!!  just can walk over -----> to !!!  adorama or b&h ona buy whatever -----> i !!!  -----> need !!! , but honestly, that would be my financial ruin... so often -----> i !!!  -----> need !!!  -----> to !!!  -----> invent !!!  mcgyver solutions -----> to !!!  be able -----> to !!!  take a photo for what -----> i !!!  cannot wait for days till -----> i !!!  receive the needed goods. edited april 12, 2020 by photocruiser", "sortedWord": "None", "Identifyer": null, "identifyer": 52786, "year": "2020"}, {"autor": "robertomorz", "date": "2020-06-19 10:57:00", "content": "A very strange thing happened ... Yesterday I blew some air into the wheel housing with a blower, but it didn't work. This morning I went to the store to show the malfunction of the wheel. You won't believe it, but it worked. Who knows what happened? Yet I did not invent the malfunction. And last night it didn't work and I didn't change any settings.", "link": "https://www.l-camera-forum.com/topic/310683-d-lux-6-g-star-and-shutter-speed/?tab=comments#comment-3995547", "origin": "L-forum", "suborigin": "310683-d-lux-6-g-star-and-shutter-speed", "result": true, "Selector": "i did not invent", "selectorShort": "invent", "MarkedSent": "a very strange thing happened ... yesterday i blew some air into the wheel housing with a blower, but it didn't work. this morning i went to the store to show the malfunction of the wheel. you won't believe it, but it worked. who knows what happened? yet -----> i !!!  -----> did !!!  -----> not !!!  -----> invent !!!  the malfunction. and last night it didn't work and i didn't change any settings.", "sortedWord": "None", "Identifyer": null, "identifyer": 16876, "year": "2020"}], "name": "Leicasortedout2020invent"}