{"interestingcomments": [{"autor": "SteveSFO", "date": "2016-05-17 04:29:00", "content": "Unfortunately I am also having this problem on a new 246 that I got over the weekend. I am going to hope the problem isn't going to happen too often until Leica comes up with a firmware fix. I've sent cameras back to Wetzlar in the past and it took them weeks before getting it back. Thus, I rather wait and hope they will be able to fix them with a firmware fix.", "link": "https://www.l-camera-forum.com/topic/259371-m246-captures-blank-images/page/3/?tab=comments#comment-3046176", "origin": "L-forum", "suborigin": "259371-m246-captures-blank-images", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "unfortunately i am also having this problem on a new 246 that i got over the weekend. i am going to hope the problem isn't going to happen too often until leica -----> comes !!!  -----> up !!!  -----> with !!!  a firmware fix. i've sent cameras back to wetzlar in the past and it took them weeks before getting it back. thus, i rather wait and hope they will be able to fix them with a firmware fix.", "sortedWord": "None", "Identifyer": null, "identifyer": 22831, "year": "2016"}, {"autor": "tsleica", "date": "2016-10-29 15:50:00", "content": "Sometimes a lens can be just too small...and just a pita to use..fiddly stuff... and I don't have large hands.. I actually like small lenses though...sometimes.. But if Leica came up with a small lightweight body to mount this on..well then...that's another story entirely..maybe worth the price.. I think as an art lens..this would be cool.. But there are so many used options for less cash..", "link": "https://www.l-camera-forum.com/topic/265598-leica-summaron-28-image-thread/page/14/?tab=comments#comment-3137900", "origin": "L-forum", "suborigin": "265598-leica-summaron-28-image-thread", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "sometimes a lens can be just too small...and just a pita to use..fiddly stuff... and i don't have large hands.. i actually like small lenses though...sometimes.. but if leica -----> came !!!  -----> up !!!  -----> with !!!  a small lightweight body to mount this on..well then...that's another story entirely..maybe worth the price.. i think as an art lens..this would be cool.. but there are so many used options for less cash..", "sortedWord": "None", "Identifyer": null, "identifyer": 10244, "year": "2016"}, {"autor": "animalhairs", "date": "2016-10-29 15:57:00", "content": " Sometimes a lens can be just too small...and just a pita to use..fiddly stuff... and I don't have large hands.. I actually like small lenses though...sometimes.. But if Leica came up with a small lightweight body to mount this on..well then...that's another story entirely..maybe worth the price.. I think as an art lens..this would be cool.. But there are so many used options for less cash.. Good points. That said, a lot of people who are interested in using this lens probably won't be doing much fiddling with the aperture and focus.", "link": "https://www.l-camera-forum.com/topic/265598-leica-summaron-28-image-thread/page/15/?tab=comments#comment-3137905", "origin": "L-forum", "suborigin": "265598-leica-summaron-28-image-thread", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " sometimes a lens can be just too small...and just a pita to use..fiddly stuff... and i don't have large hands.. i actually like small lenses though...sometimes.. but if leica -----> came !!!  -----> up !!!  -----> with !!!  a small lightweight body to mount this on..well then...that's another story entirely..maybe worth the price.. i think as an art lens..this would be cool.. but there are so many used options for less cash.. good points. that said, a lot of people who are interested in using this lens probably won't be doing much fiddling with the aperture and focus.", "sortedWord": "None", "Identifyer": null, "identifyer": 10245, "year": "2016"}, {"autor": "Paulus", "date": "2016-10-29 16:27:00", "content": "Sometimes a lens can be just too small...and just a pita to use..fiddly stuff... and I don't have large hands.. I actually like small lenses though...sometimes.. But if Leica came up with a small lightweight body to mount this on..well then...that's another story entirely..maybe worth the price.. I think as an art lens..this would be cool.. But there are so many used options for less cash.. I have large hands, but this isn't a problem in use with this lens IMHO. It focusses rather easy with large hands due to the lever.", "link": "https://www.l-camera-forum.com/topic/265598-leica-summaron-28-image-thread/page/15/?tab=comments#comment-3137920", "origin": "L-forum", "suborigin": "265598-leica-summaron-28-image-thread", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "sometimes a lens can be just too small...and just a pita to use..fiddly stuff... and i don't have large hands.. i actually like small lenses though...sometimes.. but if leica -----> came !!!  -----> up !!!  -----> with !!!  a small lightweight body to mount this on..well then...that's another story entirely..maybe worth the price.. i think as an art lens..this would be cool.. but there are so many used options for less cash.. i have large hands, but this isn't a problem in use with this lens imho. it focusses rather easy with large hands due to the lever.", "sortedWord": "None", "Identifyer": null, "identifyer": 10246, "year": "2016"}, {"autor": "DwF", "date": "2016-09-04 18:12:00", "content": "I've always been fairly happy with my DNG conversions to B&W from my M9 - but since getting my X Vario and seeing what the camera produces on its own I've realised how much better they could be. Has anyone managed to reproduce the 'recipe' for the look the X Vario produces, in either/or/both Lightroom/Silver Efex Pro? My XV jpeg settings are: Film mode - B&W High Contrast; Sharpness - Medium High; Contrast - Standard. EV usually -0.3 or -0.7. I can't speak for the X Vario but the X 113 which is really close in this regard. I was just messing around with my settings for B&W Jpeg mode and doing a comparison to the XE-2 with Kit lens at 23mm and f3.2 I ended up with similar settings to what you have here. However, when all was said and done, I used the DNG to come up with what worked better for me in getting shadow detail and still enough kick for my subject. It's a work in progress but I will likely go back to the Standard B&W and possibly boost contrast. Although Jpeg engine is really good on the X 113, I will usually opt for DNG. David", "link": "https://www.l-camera-forum.com/topic/263684-bw-jpegs-from-x-vario/?tab=comments#comment-3106834", "origin": "L-forum", "suborigin": "263684-bw-jpegs-from-x-vario", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i've always been fairly happy with my dng conversions to b&w from my m9 - but since getting my x vario and seeing what the camera produces on its own i've realised how much better they could be. has anyone managed to reproduce the 'recipe' for the look the x vario produces, in either/or/both lightroom/silver efex pro? my xv jpeg settings are: film mode - b&w high contrast; sharpness - medium high; contrast - standard. ev usually -0.3 or -0.7. i can't speak for the x vario but the x 113 which is really close in this regard. i was just messing around with my settings for b&w jpeg mode and doing a comparison to the xe-2 with kit lens at 23mm and f3.2 i ended up with similar settings to what you have here. however, when all was said and done, i used the dng to -----> come !!!  -----> up !!!  -----> with !!!  what worked better for me in getting shadow detail and still enough kick for my subject. it's a work in progress but i will likely go back to the standard b&w and possibly boost contrast. although jpeg engine is really good on the x 113, i will usually opt for dng. david", "sortedWord": "None", "Identifyer": null, "identifyer": 12076, "year": "2016"}, {"autor": "mikeodial", "date": "2016-09-05 14:41:00", "content": "I can't speak for the X Vario but the X 113 which is really close in this regard. I was just messing around with my settings for B&W Jpeg mode and doing a comparison to the XE-2 with Kit lens at 23mm and f3.2 I ended up with similar settings to what you have here. However, when all was said and done, I used the DNG to come up with what worked better for me in getting shadow detail and still enough kick for my subject. It's a work in progress but I will likely go back to the Standard B&W and possibly boost contrast. Although Jpeg engine is really good on the X 113, I will usually opt for DNG. David I have tried with the RAW files, but for many applications the out of Camera Jpegs are very good indeed. I use the jeg sharpening setting in the camera and that seems to create files that I really like the look of. Once such example here. --img-- ", "link": "https://www.l-camera-forum.com/topic/263684-bw-jpegs-from-x-vario/?tab=comments#comment-3107201", "origin": "L-forum", "suborigin": "263684-bw-jpegs-from-x-vario", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i can't speak for the x vario but the x 113 which is really close in this regard. i was just messing around with my settings for b&w jpeg mode and doing a comparison to the xe-2 with kit lens at 23mm and f3.2 i ended up with similar settings to what you have here. however, when all was said and done, i used the dng to -----> come !!!  -----> up !!!  -----> with !!!  what worked better for me in getting shadow detail and still enough kick for my subject. it's a work in progress but i will likely go back to the standard b&w and possibly boost contrast. although jpeg engine is really good on the x 113, i will usually opt for dng. david i have tried with the raw files, but for many applications the out of camera jpegs are very good indeed. i use the jeg sharpening setting in the camera and that seems to create files that i really like the look of. once such example here. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 12077, "year": "2016"}, {"autor": "Wayne", "date": "2016-04-26 00:59:00", "content": "I purchased an X1 from a large used equipment dealer about 6 months ago. As you point out, the price was very reasonable. Aside from the fact that the images are great, the control set-up is the best of any small digital camera I have owned. The manual focus feature is not great....but that is about the only negative I can come up with.", "link": "https://www.l-camera-forum.com/topic/259727-is-an-original-x1-still-worth-buying/?tab=comments#comment-3033457", "origin": "L-forum", "suborigin": "259727-is-an-original-x1-still-worth-buying", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i purchased an x1 from a large used equipment dealer about 6 months ago. as you point out, the price was very reasonable. aside from the fact that the images are great, the control set-up is the best of any small digital camera i have owned. the manual focus feature is not great....but that is about the only negative i can -----> come !!!  -----> up !!!  -----> with !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 12160, "year": "2016"}, {"autor": "gberger", "date": "2016-09-25 23:00:00", "content": "pico, I was in the Pentagon when DeGaule kicked NATO out of France, and we had to find new homes for the US Army and Air Force units stationed in France. It was a b***h, as those forces were still committed to NATO, and had to be returned if things got squishy with the Soviets. My job was to find a solution for bringing the Air Force units home, but I had to work with the Army guys to come up with an \"approved solution\" that would satisfy both NATO and our Government, as NATO still \"owned\" them Yeah, A Little Bit of Ulcer Time!! Oh Well, we did it, and it all counted toward retirement. George (Colonel, USAF (Ret) Edited September 25, 2016 by gberger", "link": "https://www.l-camera-forum.com/topic/264857-is-there-a-thread-for-members-passing/?tab=comments#comment-3118697", "origin": "L-forum", "suborigin": "264857-is-there-a-thread-for-members-passing", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "pico, i was in the pentagon when degaule kicked nato out of france, and we had to find new homes for the us army and air force units stationed in france. it was a b***h, as those forces were still committed to nato, and had to be returned if things got squishy with the soviets. my job was to find a solution for bringing the air force units home, but i had to work -----> with !!!  the army guys to -----> come !!!  -----> up !!!  -----> with !!!  an \"approved solution\" that would satisfy both nato and our government, as nato still \"owned\" them yeah, a little bit of ulcer time!! oh well, we did it, and it all counted toward retirement. george (colonel, usaf (ret) edited september 25, 2016 by gberger", "sortedWord": "None", "Identifyer": null, "identifyer": 78867, "year": "2016"}, {"autor": "pico", "date": "2016-09-25 23:52:00", "content": "pico, I was in the Pentagon when DeGaule kicked NATO out of France, and we had to find new homes for the US Army and Air Force units stationed in France. It was a b***h, as those forces were still committed to NATO, and had to be returned if things got squishy with the Soviets. My job was to find a solution for bringing the Air Force units home, but I had to work with the Army guys to come up with an \"approved solution\" that would satisfy both NATO and our Government, as NATO still \"owned\" them Yeah, A Little Bit of Ulcer Time!! Oh Well, we did it, and it all counted toward retirement. George (Colonel, USAF (Ret) As we recall, all assignments were made for the needs of the military. When my call came to leave France previous pragmatic urgencies fell back a bit and I (and only I from my squadron) was assigned to RAF Upper Heyford with privileged access to Oxford University to, by chance I thought, continue my education while still serving. I suppose I should mention a a first-uncle was SAC base commander at the time. Picture above! He was a hero to me, Ted Crouchley who flew the global B-52s and any other aircraft he wanted. . Edited September 26, 2016 by pico", "link": "https://www.l-camera-forum.com/topic/264857-is-there-a-thread-for-members-passing/?tab=comments#comment-3118705", "origin": "L-forum", "suborigin": "264857-is-there-a-thread-for-members-passing", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "pico, i was in the pentagon when degaule kicked nato out of france, and we had to find new homes for the us army and air force units stationed in france. it was a b***h, as those forces were still committed to nato, and had to be returned if things got squishy with the soviets. my job was to find a solution for bringing the air force units home, but i had to work -----> with !!!  the army guys to -----> come !!!  -----> up !!!  -----> with !!!  an \"approved solution\" that would satisfy both nato and our government, as nato still \"owned\" them yeah, a little bit of ulcer time!! oh well, we did it, and it all counted toward retirement. george (colonel, usaf (ret) as we recall, all assignments were made for the needs of the military. when my call came to leave france previous pragmatic urgencies fell back a bit and i (and only i from my squadron) was assigned to raf upper heyford with privileged access to oxford university to, by chance i thought, continue my education while still serving. i suppose i should mention a a first-uncle was sac base commander at the time. picture above! he was a hero to me, ted crouchley who flew the global b-52s and any other aircraft he wanted. . edited september 26, 2016 by pico", "sortedWord": "None", "Identifyer": null, "identifyer": 78868, "year": "2016"}, {"autor": "earleygallery", "date": "2016-09-25 12:15:00", "content": " Either that or Leica is now in fact rebadging somebody else's lens and that would be the end of Leica for me. You obviously don't know about various R lenses which were actually Minolta designs, or the Sigma R lens? The lens on the Digilux 1 could also be found on an Olympus and Canon as well as the Panasonic. I very much doubt each manufacturer was coincidentally coming up with the same lens. We're talking about a 'novelty' camera here. If the lens on the Fuji is good enough what does it matter?", "link": "https://www.l-camera-forum.com/topic/264552-the-real-news-about-the-leica-sofort-merged-thread/page/6/?tab=comments#comment-3118398", "origin": "L-forum", "suborigin": "264552-the-real-news-about-the-leica-sofort-merged-thread", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": " either that or leica is now in fact rebadging somebody else's lens and that would be the end of leica for me. you obviously don't know about various r lenses which were actually minolta designs, or the sigma r lens? the lens on the digilux 1 could also be found on an olympus and canon as well as the panasonic. i very much doubt each manufacturer was coincidentally -----> coming !!!  -----> up !!!  -----> with !!!  the same lens. we're talking about a 'novelty' camera here. if the lens on the fuji is good enough what does it matter?", "sortedWord": "None", "Identifyer": null, "identifyer": 79000, "year": "2016"}, {"autor": "ECohen", "date": "2016-02-28 14:52:00", "content": " I just wrote in a post that I use ISO 200 and my \"sweet spot\" for best sensor performance...that got me thinking. When I got my M I ran a few tests, nothing scientific and went with the conclusion that 200 ISO gives me the best overall performance. Don't get me wrong I use the entire camera often smoothing grain at 3200. And inside shooting at 1600, 3200 and rarely 64000. .....I never use 100 ...it dosn't look right to me? The more I think of it .....Am I looking at this as film? (I am an old film guy) Or more accurately am I still looking at the M like my old digital cameras? Nikon's /Early Imacon's that had seriously ISO flaws and the sweet spot was important. Leica and other manufactures have caught up with the tech curve and perhaps my sweet spot thinking is out dated? You guys are far more scientific and well as art people. What conclusions have you come up with? How do you think about your ISO in relation best quality file on the M240? Thanks as always for your incite.", "link": "https://www.l-camera-forum.com/topic/257432-sweet-spot-for-iso-best-sensor-performance/?tab=comments#comment-2998384", "origin": "L-forum", "suborigin": "257432-sweet-spot-for-iso-best-sensor-performance", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " i just wrote in a post that i use iso 200 and my \"sweet spot\" for best sensor performance...that got me thinking. when i got my m i ran a few tests, nothing scientific and went with the conclusion that 200 iso gives me the best overall performance. don't get me wrong i use the entire camera often smoothing grain at 3200. and inside shooting at 1600, 3200 and rarely 64000. .....i never use 100 ...it dosn't look right to me? the more i think of it .....am i looking at this as film? (i am an old film guy) or more accurately am i still looking at the m like my old digital cameras? nikon's /early imacon's that had seriously iso flaws and the sweet spot was important. leica and other manufactures have caught up with the tech curve and perhaps my sweet spot thinking is out dated? you guys are far more scientific and well as art people. what conclusions have you -----> come !!!  -----> up !!!  -----> with !!! ? how do you think about your iso in relation best quality file on the m240? thanks as always for your incite.", "sortedWord": "None", "Identifyer": null, "identifyer": 93578, "year": "2016"}, {"autor": "lct", "date": "2016-02-29 15:59:00", "content": "[...] You guys are far more scientific and well as art people. What conclusions have you come up with? How do you think about your ISO in relation best quality file on the M240? [...] Being neither a scientist nor an artist i suspect my point of view will interest nobody else than a couple auto iso shooters here but besides Foveon based ones, all digital cameras look more or less similar to me so i'm just interested in their lower and higher acceptable isos regardless of push/pull tweakings. In this respect, i would rate the M240 (100-3200) as an average camera, much better than my old R-D1 (200-800) and M8.2 (160-640), close to my Panasonic LX100 (100-1600) and Fuji X-E2 (100-3200) but outperformed by my Sony A7s (100-12800) which has less pixels though. I would welcome a 100-6400 range in the next M body. No bragging 50-50000 a la SL601 please, a clean 100-6400 (or 50-6400) would be enough.", "link": "https://www.l-camera-forum.com/topic/257432-sweet-spot-for-iso-best-sensor-performance/page/2/?tab=comments#comment-2998994", "origin": "L-forum", "suborigin": "257432-sweet-spot-for-iso-best-sensor-performance", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "[...] you guys are far more scientific and well as art people. what conclusions have you -----> come !!!  -----> up !!!  -----> with !!! ? how do you think about your iso in relation best quality file on the m240? [...] being neither a scientist nor an artist i suspect my point of view will interest nobody else than a couple auto iso shooters here but besides foveon based ones, all digital cameras look more or less similar to me so i'm just interested in their lower and higher acceptable isos regardless of push/pull tweakings. in this respect, i would rate the m240 (100-3200) as an average camera, much better than my old r-d1 (200-800) and m8.2 (160-640), close to my panasonic lx100 (100-1600) and fuji x-e2 (100-3200) but outperformed by my sony a7s (100-12800) which has less pixels though. i would welcome a 100-6400 range in the next m body. no bragging 50-50000 a la sl601 please, a clean 100-6400 (or 50-6400) would be enough.", "sortedWord": "None", "Identifyer": null, "identifyer": 93603, "year": "2016"}, {"autor": "icqcq", "date": "2016-03-07 16:42:00", "content": "I’ve been working to wrap my head around what’s happening technically within the camera. And here’s what I’ve come up with, as clearly as I can. What I’m writing here is specific to the M240, but certainly applicable to other cameras. Much here was gleaned from the great RED article as linked to on the first page, and the “ISOless M240” blog entry. Information and ObservationsThe M240 CMOS sensor has a base ISO - and fixed sensitivity - of 200.The M240 CMOS sensor has a latitude of (something like) thirteen stops [a number I’ve floated which has not yet been corrected; someone out there knows the real number].Manually changing the ISO number does not affect the sensitivity of the sensor.Manually changing the ISO number changes the way the software handles the light meter.Manually changing the ISO number changes the way the software manages the data the sensor receives, sometimes in negative ways.The light meter indicates (something like) a five stop range.The histogram indicates that the camera has (something like) a seven stop range.Conclusions The M240 (and not, obviously, exclusively), through the transition to digital, limits us to an apparent seven stops of latitude, while the sensor is capable of registering thirteen stops. Running the camera at ISO 200, and relying on the meter and histogram as programmed, effectively forces the photographer to rely only on the upper seven stop's sensitivity of the sensor; as the ISO is nudged up, the seven stops are effectively forced further down the sensitivity of the sensor. ISO is vestigial thinking from the days of film, a static imposition of false limits; Sensor Latitude, although fixed, allows the photographer full access to the potential of the sensor.Current camera and metering software compromises image quality because of adherence to tradition: the perpetuation of the idea that a sensor’s sensitivity can be changed, as film could (roll by roll).A new way of thinking about light and sensitivity, and a meter that reflects the technical changes in exposure-reading and picture-taking, are required.Utilizing the base ISO, and using the meter only to ensure that all desired data falls within the thirteen-stop range of the sensor, with proper exposure managed in post-production, is, technically, a superior method of exposure.ProposalI propose a light meter (fixed at base ISO) that examines a scene in its entirety (per lens in use), displays a graphic indication of the range of light - the number of stops - present in the image, and what combinations of aperture & shutter speed will allow the appropriate quantity of light to reach the sensor, so that data is registered across the range of the sensor. This light meter would indicate clearly where a scene’s range of light exceeds the capacity of the sensor (fifteen stops range in a scene, against a sensor that only manages thirteen stops). Cameras would chimp a full-sensor-range image, along with full-sensor-range histogram. All curves/tonality would be managed in post-processing.I would also suggest that Lux be adopted as the new standard by which we, as photographers, think about light: to learn to think and see in Lux, which can then be converted into exposure. That committed digital photographers unlearn ISO.I suggest that camera manufacturers eliminate ISO as a tool for exposure, and integrate Sensor Latitude into the software and processing of images. Edited March 7, 2016 by icqcq", "link": "https://www.l-camera-forum.com/topic/257432-sweet-spot-for-iso-best-sensor-performance/page/3/?tab=comments#comment-3003583", "origin": "L-forum", "suborigin": "257432-sweet-spot-for-iso-best-sensor-performance", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i’ve been working to wrap my head around what’s happening technically within the camera. and here’s what i’ve -----> come !!!  -----> up !!!  -----> with !!! , as clearly as i can. what i’m writing here is specific to the m240, but certainly applicable to other cameras. much here was gleaned from the great red article as linked to on the first page, and the “isoless m240” blog entry. information and observationsthe m240 cmos sensor has a base iso - and fixed sensitivity - of 200.the m240 cmos sensor has a latitude of (something like) thirteen stops [a number i’ve floated which has not yet been corrected; someone out there knows the real number].manually changing the iso number does not affect the sensitivity of the sensor.manually changing the iso number changes the way the software handles the light meter.manually changing the iso number changes the way the software manages the data the sensor receives, sometimes in negative ways.the light meter indicates (something like) a five stop range.the histogram indicates that the camera has (something like) a seven stop range.conclusions the m240 (and not, obviously, exclusively), through the transition to digital, limits us to an apparent seven stops of latitude, while the sensor is capable of registering thirteen stops. running the camera at iso 200, and relying on the meter and histogram as programmed, effectively forces the photographer to rely only on the upper seven stop's sensitivity of the sensor; as the iso is nudged up, the seven stops are effectively forced further down the sensitivity of the sensor. iso is vestigial thinking from the days of film, a static imposition of false limits; sensor latitude, although fixed, allows the photographer full access to the potential of the sensor.current camera and metering software compromises image quality because of adherence to tradition: the perpetuation of the idea that a sensor’s sensitivity can be changed, as film could (roll by roll).a new way of thinking about light and sensitivity, and a meter that reflects the technical changes in exposure-reading and picture-taking, are required.utilizing the base iso, and using the meter only to ensure that all desired data falls within the thirteen-stop range of the sensor, with proper exposure managed in post-production, is, technically, a superior method of exposure.proposali propose a light meter (fixed at base iso) that examines a scene in its entirety (per lens in use), displays a graphic indication of the range of light - the number of stops - present in the image, and what combinations of aperture & shutter speed will allow the appropriate quantity of light to reach the sensor, so that data is registered across the range of the sensor. this light meter would indicate clearly where a scene’s range of light exceeds the capacity of the sensor (fifteen stops range in a scene, against a sensor that only manages thirteen stops). cameras would chimp a full-sensor-range image, along with full-sensor-range histogram. all curves/tonality would be managed in post-processing.i would also suggest that lux be adopted as the new standard by which we, as photographers, think about light: to learn to think and see in lux, which can then be converted into exposure. that committed digital photographers unlearn iso.i suggest that camera manufacturers eliminate iso as a tool for exposure, and integrate sensor latitude into the software and processing of images. edited march 7, 2016 by icqcq", "sortedWord": "None", "Identifyer": null, "identifyer": 93637, "year": "2016"}, {"autor": "adan", "date": "2016-04-14 16:06:00", "content": "Well, Adan, yes you were most certainly bullying me around a bit but I will accept your retraction. I also accept your general logic. But it is incomplete and thus ineffectual. B is only not true if A is not true. But just b/c I haven't taken the time and effort to establish that A is true doesn't logically follow that A is NOT true. And so if it hasn't been established that A s not true, it cannot be definitively established that B is not true. So the only real way to definitively prove that B is not true is to definitively establish as a fact that A is not true, which neither you nor anyone else has done. Given the fact that professional film stocks are up to double the price of consumer stocks, to say that they are not \"better\" in any way is going against capitalist market efficiency principles (it is also, btw, going against what the film companies say in their data sheets). This is not to say that it is an absolute fact that price=quality; but I do think that it gives rise to a presumption that needs to be rebutted..... Taking your points in reverse order: If price is automatically a sign of quality, then we can obviously just cancel next month's Kentucky Derby. We need only find out which horse commanded the highest price at auction (capitalist market principles) and award it the necklace of roses. It must be the best, correct? It's not a smart way to judge the world - if you want to know which film is best, or which horse is fastest, you don't compare prices, you run a race. Then you know, and don't have to \"venture to guess.\" On the question of proof - I take it you would be comfortable flying on a plane, if the aviation engineer who designed it told you, \"Well, we haven't tested it, but no one has proved it is unsafe, therefore we can assume it is NOT unsafe.\" A basic principle of knowledge is, if you make a claim, it's up to you to prove your claim is correct. Unlike humans in a court of law, \"theories\" are suspect until proven innocent. By the theory-holder. In fact, when a competent scientist comes up with a theory, the first thing they do is try to prove it wrong, by poking holes in it from every angle. If they can't find any flaws, after vigorous examination and checking of assumptions and fallacies - then they publish it and let everyone else have a chance to disprove it. I guess it's just the journalist in me. \"If your mother tells you she loves you - check it out with a second source.\" I didn't \"retract\" anything. I simply denied your claim that I was picking on (or bullying) you. Edited April 14, 2016 by adan", "link": "https://www.l-camera-forum.com/topic/257093-why-does-it-make-any-sense-at-all-to-use-non-professional-grade-film-stocks-in-this-day-and-age/page/12/?tab=comments#comment-3026515", "origin": "L-forum", "suborigin": "257093-why-does-it-make-any-sense-at-all-to-use-non-professional-grade-film-stocks-in-this-day-and-age", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "well, adan, yes you were most certainly bullying me around a bit but i will accept your retraction. i also accept your general logic. but it is incomplete and thus ineffectual. b is only not true if a is not true. but just b/c i haven't taken the time and effort to establish that a is true doesn't logically follow that a is not true. and so if it hasn't been established that a s not true, it cannot be definitively established that b is not true. so the only real way to definitively prove that b is not true is to definitively establish as a fact that a is not true, which neither you nor anyone else has done. given the fact that professional film stocks are up to double the price of consumer stocks, to say that they are not \"better\" in any way is going against capitalist market efficiency principles (it is also, btw, going against what the film companies say in their data sheets). this is not to say that it is an absolute fact that price=quality; but i do think that it gives rise to a presumption that needs to be rebutted..... taking your points in reverse order: if price is automatically a sign of quality, then we can obviously just cancel next month's kentucky derby. we need only find out which horse commanded the highest price at auction (capitalist market principles) and award it the necklace of roses. it must be the best, correct? it's not a smart way to judge the world - if you want to know which film is best, or which horse is fastest, you don't compare prices, you run a race. then you know, and don't have to \"venture to guess.\" on the question of proof - i take it you would be comfortable flying on a plane, if the aviation engineer who designed it told you, \"well, we haven't tested it, but no one has proved it is unsafe, therefore we can assume it is not unsafe.\" a basic principle of knowledge is, if you make a claim, it's up to you to prove your claim is correct. unlike humans in a court of law, \"theories\" are suspect until proven innocent. by the theory-holder. in fact, when a competent scientist -----> comes !!!  -----> up !!!  -----> with !!!  a theory, the first thing they do is try to prove it wrong, by poking holes in it from every angle. if they can't find any flaws, after vigorous examination and checking of assumptions and fallacies - then they publish it and let everyone else have a chance to disprove it. i guess it's just the journalist in me. \"if your mother tells you she loves you - check it out with a second source.\" i didn't \"retract\" anything. i simply denied your claim that i was picking on (or bullying) you. edited april 14, 2016 by adan", "sortedWord": "None", "Identifyer": null, "identifyer": 101498, "year": "2016"}, {"autor": "earleygallery", "date": "2016-03-30 20:33:00", "content": "Thank both for you replies and suggestions. i've just tried my phone again for the first time since my message above and it's all working properly now, without even having to log in, it's remembered my username and password and logged me in automatically. Thank you, and sorry for wasting your time. I expect whatever Andreas was up to has worked, so thanks to you Andreas also. P You're not wasting anyones time, I had the same issue today - I tried to read the forum from my phone at lunchtime and it kept coming up with some sort of error message if I tried to log in. All working fine now so it was obviously some software glitch.", "link": "https://www.l-camera-forum.com/topic/258777-mobile-log-in-problem/?tab=comments#comment-3017703", "origin": "L-forum", "suborigin": "258777-mobile-log-in-problem", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "thank both for you replies and suggestions. i've just tried my phone again for the first time since my message above and it's all working properly now, without even having to log in, it's remembered my username and password and logged me in automatically. thank you, and sorry for wasting your time. i expect whatever andreas was up to has worked, so thanks to you andreas also. p you're not wasting anyones time, i had the same issue today - i tried to read the forum from my phone at lunchtime and it kept -----> coming !!!  -----> up !!!  -----> with !!!  some sort of error message if i tried to log in. all working fine now so it was obviously some software glitch.", "sortedWord": "None", "Identifyer": null, "identifyer": 118857, "year": "2016"}, {"autor": "erl", "date": "2016-11-23 12:15:00", "content": "John and his cousin, Mick, might be able to take us on a walkabout. --img--  Sent from my iPhone using Tapatalk Not sure where Mick is at present, but I might be able to come up with some sort of adventure. Give me a bit more time to work on logistics. Got a few issues to deal with at present.", "link": "https://www.l-camera-forum.com/topic/264778-australasian-one-challenge-advance-notice/page/4/?tab=comments#comment-3154418", "origin": "L-forum", "suborigin": "264778-australasian-one-challenge-advance-notice", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "john and his cousin, mick, might be able to take us on a walkabout. --img--  sent from my iphone using tapatalk not sure where mick is at present, but i might be able to -----> come !!!  -----> up !!!  -----> with !!!  some sort of adventure. give me a bit more time to work on logistics. got a few issues to deal with at present.", "sortedWord": "None", "Identifyer": null, "identifyer": 132114, "year": "2016"}, {"autor": "jonoslack", "date": "2016-10-27 23:19:00", "content": "Oh Tom I'm really sorry - I just hope the insurance come up with the goods . . . but there's nothing like one's own kit Reall Really sorry", "link": "https://www.l-camera-forum.com/topic/265582-great-challenge-but-sad-end/page/2/?tab=comments#comment-3136840", "origin": "L-forum", "suborigin": "265582-great-challenge-but-sad-end", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "oh tom i'm really sorry - i just hope the insurance -----> come !!!  -----> up !!!  -----> with !!!  the goods . . . but there's nothing like one's own kit reall really sorry", "sortedWord": "None", "Identifyer": null, "identifyer": 132593, "year": "2016"}, {"autor": "Peter H", "date": "2016-02-03 13:54:00", "content": "Yes, but the point of it was that it hadn't been done before, and it was slightly self- mocking and self-referential. The way to improve on it is to come up with a better idea, not take another photo of a potato.", "link": "https://www.l-camera-forum.com/topic/256385-new-potato-portrait-challenge/?tab=comments#comment-2982059", "origin": "L-forum", "suborigin": "256385-new-potato-portrait-challenge", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "yes, but the point of it was that it hadn't been done before, and it was slightly self- mocking and self-referential. the way to improve on it is to -----> come !!!  -----> up !!!  -----> with !!!  a better idea, not take another photo of a potato.", "sortedWord": "None", "Identifyer": null, "identifyer": 133250, "year": "2016"}], "name": "Leicasortedout2016with"}