{"interestingcomments": [{"autor": "-ph-", "date": "2021-04-17 14:32:00", "content": "It would be lovely, if the new M11 had IBIS. In low light, a difficult to beat feature. Not sure I am going to buy another camera without IBIS. But for space limitations and the fact that you don't want to move the sensor relative to your optical viewfinder, I am a bit sceptical about the probability of IBIS. A silent electronic shutter option would also be highly appreciated, I don't understand why it was not offered with the M10 already. The body should be the same size as the M10, wouldn't mind if it were slightly lighter. Charging via USB-C is a very convenient feature. For the viewfinder, digital frame lines would be a great improvement. Only one set of frame lines for the actual focal length, and always a proper frame (configurable to taste). They also could support any focal length. A great bonus for 40mm lenses and any other lens not represented by the current frame lines. Replacing the metal mask with an OLED screen would give a lot of options. Of course, once having a display overlay replacing the frame lines, one could get completely crazy. Like showing focus peaking inside the viewfinder and other data, if required (a grid, frame lines for other focal lengths, a digital level). The frame line selector lever could be replaced by That all would be optional and configurable, the benefits of a programmable device Beyond that I would appreciate any improvement of the viewfinder optics, as I wear glasses, I have problems seeing the 28mm frame lines. Improving the Visoflex would be another obvious and welcome enhancement. Considering it is optional, it could be a bit larger, preferrably a bit more robust (mine constantly swings up by itself) and should be as close to the SL viewfinder as possible. Quite a list, but that would be the improvements which could make me buy the M11 - otherwise I am still be very happy with my quite excellent M10, so I am not in a big hurry to buy another expensive camera :).", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/page/7/?tab=comments#comment-4183276", "origin": "L-forum", "suborigin": "319914-leica-m11-your-next-camera", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "it would be lovely, if the new m11 had ibis. in low light, a difficult to beat feature. not sure i am going to buy another camera without ibis. but for space limitations and the fact that you don't want to move the sensor relative to your optical viewfinder, i am a bit sceptical about the probability of ibis. a silent electronic shutter option would also be highly appreciated, i don't understand why it was not offered with the m10 already. the body should be the same size as the m10, wouldn't mind if it were slightly lighter. charging via usb-c is a very convenient feature. for the viewfinder, digital frame lines would be a great improvement. only one set of frame lines for the actual focal length, and always a proper frame (configurable to taste). they also could support any focal length. a great bonus for 40mm lenses and any other lens not represented by the current frame lines. replacing the metal mask with an oled screen would give a lot of options. of course, once having a display overlay replacing the frame lines, one could get completely crazy. like showing focus peaking inside the viewfinder and other data, if required (a grid, frame lines for other focal lengths, a digital level). the frame line selector lever could be replaced by that all would be optional and configurable, the benefits of a programmable device beyond that i would appreciate any improvement of the viewfinder optics, as i wear glasses, i have problems seeing the 28mm frame lines. -----> improving !!!  the visoflex would be another obvious and welcome enhancement. considering it is optional, it could be a bit larger, preferrably a bit more robust (mine constantly swings up by itself) and should be as close to the sl viewfinder as possible. quite a list, but that would be the improvements which could make me buy the m11 - otherwise i am still be very happy with my quite excellent m10, so i am not in a big hurry to buy another expensive camera :).", "sortedWord": "None", "Identifyer": null, "identifyer": 99885, "year": "2021"}, {"autor": "jslabovitz", "date": "2021-04-20 00:30:00", "content": "When I bought my M10-D two years ago, I also bought the EVF 020... then kicked myself because it felt like a stupid add-on that I rarely used. But in the last 6 months or so, I've quite fallen in love with the little bugger. I find I'm better at composing if I think in monochrome, rather than deciding to convert to B&W later. So I use the M10-D as a quasi-M10M by setting the camera to B&W JPEG+RAW mode, which makes the Visoflex display the image in monochrome! It turns it into a decent little B&W previewer. (I filter out the JPEGs before importing into Lightroom.) I've learned to work around the relative slow turn-on of the EVF by half-pressing the shutter when I start to frame the image; by the time I've framed and focused through the rangefinder, the EVF has 'booted up' and I can quickly and accurately shift my eye up to the EVF to verify the framing and whether it's going to work in B&W at all. BTW, I rarely use the Visoflex for focusing. Focus peaking just doesn't work for me; it ain't how my brain works. I prefer the rangefinder, which seems much more accurate. Having proclaimed my love for the Visoflex, there are certainly a few things I'd like to be improved: Make the diopter knob smaller and inset into the body, so I'm not constantly shifting the setting. I'm about to the point where I'm gonna tape down the knob... Toggle between B&W/color mode easily via one of the function buttons, without having to go into Fotos/menus to set the JPEG+RAW mode. Allow the GPS to be turned off completely (fine with me if done in the Fotos app, like the other settings on the M10-D). Maybe this would save enough battery that the EVF can turn on faster through some kind of standby mode. Optionally show the frame number instead of the shots remaining, in case I want to write down notes about a particular shot, and want to cross-reference after I import the files into Lightroom. Improve the physical coupling between the Visoflex and the camera (or at least add some adhesive tape) so the little guy doesn't keep sliding off the mount. Allow tilting to work only after sliding some sort of latch or key. I love the tilt, but it clicks out of position too easily, and I'm afraid the little plastic nub that locks it down is wearing out. Round off the way-too-pokey rear corners, so they don't keep jabbing me as I hold the camera. Don't hide the shutter dial as much. I've had a couple times when I didn't realize the shutter had shifted from A mode because it can't be seen without removing the Visoflex! Edited April 20 by jslabovitz clarification; additions", "link": "https://www.l-camera-forum.com/topic/319914-leica-m11-your-next-camera/page/11/?tab=comments#comment-4184875", "origin": "L-forum", "suborigin": "319914-leica-m11-your-next-camera", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "when i bought my m10-d two years ago, i also bought the evf 020... then kicked myself because it felt like a stupid add-on that i rarely used. but in the last 6 months or so, i've quite fallen in love with the little bugger. i find i'm better at composing if i think in monochrome, rather than deciding to convert to b&w later. so i use the m10-d as a quasi-m10m by setting the camera to b&w jpeg+raw mode, which makes the visoflex display the image in monochrome! it turns it into a decent little b&w previewer. (i filter out the jpegs before importing into lightroom.) i've learned to work around the relative slow turn-on of the evf by half-pressing the shutter when i start to frame the image; by the time i've framed and focused through the rangefinder, the evf has 'booted up' and i can quickly and accurately shift my eye up to the evf to verify the framing and whether it's going to work in b&w at all. btw, i rarely use the visoflex for focusing. focus peaking just doesn't work for me; it ain't how my brain works. i prefer the rangefinder, which seems much more accurate. having proclaimed my love for the visoflex, there are certainly a few things i'd like to be improved: make the diopter knob smaller and inset into the body, so i'm not constantly shifting the setting. i'm about to the point where i'm gonna tape down the knob... toggle between b&w/color mode easily via one of the function buttons, without having to go into fotos/menus to set the jpeg+raw mode. allow the gps to be turned off completely (fine with me if done in the fotos app, like the other settings on the m10-d). maybe this would save enough battery that the evf can turn on faster through some kind of standby mode. optionally show the frame number instead of the shots remaining, in case i want to write down notes about a particular shot, and want to cross-reference after i import the files into lightroom. -----> improve !!!  the physical coupling between the visoflex and the camera (or at least add some adhesive tape) so the little guy doesn't keep sliding off the mount. allow tilting to work only after sliding some sort of latch or key. i love the tilt, but it clicks out of position too easily, and i'm afraid the little plastic nub that locks it down is wearing out. round off the way-too-pokey rear corners, so they don't keep jabbing me as i hold the camera. don't hide the shutter dial as much. i've had a couple times when i didn't realize the shutter had shifted from a mode because it can't be seen without removing the visoflex! edited april 20 by jslabovitz clarification; additions", "sortedWord": "None", "Identifyer": null, "identifyer": 99951, "year": "2021"}, {"autor": "IkarusJohn", "date": "2021-10-29 04:53:00", "content": "47 minutes ago, grahamc said: Ok second that. Genuine question what are the “issues” with higher megapixels ? I would assume that it’s more unforgiving of technical (focussing) errors ? Also - How about lenses ... does a higher Mp count reveal imperfections in vintage glass that previous resolutions didn’t? I ask this because a recent seller of a 50:1.4 pre-ASPH mentioned that the reason for sale was he was using m10R and as a result had switched to the latest and greatest lenses (namely APO in his case ). I don’t necessarily think that’s valid logic but would appreciate opinions. my only experience of high megapixels is Sony A7Riv 63MP. I really like it and haven’t experienced any issues but let’s be honest those cameras drive themselves - very hard / impossible to go wrong. HI Graham, I think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! It’s fiction! You don’t know what you’re talking about! Internet myth! Etc etc The 18MP M9 and 24MP M(240)/M10 were considered to be the “sweet spot” for handheld 135 format digital. At that time, Sony released its 37.5MP sensor (when Leica had “only” 37.5MP in its S2). The cameras that first sensor was in (the Sony A7r and the Nikon D800e were two I had) were a nightmare to get sharp. Many will deny this, but I can say from my own experience, that something was going on, and it wasn’t good. At the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly Ming Thein’s conclusion). I suspect it was a combination of shutter slap and the sensor site designs. Both of which appear to have been solved. I have great faith in Jono’s reviews, and he has said more than once that the M10-R doesn’t suffer from pixel level blur. That said, if I want greater resolution (which I don’t), I would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... As to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an improved sensor makes an image worse. I doubt this is actually possible. Improve either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. If you have an M10-R, there is little doubt that a 50 APO Summicron will give you better images than the previous pre-Asph 50 Summicron or Summilux lenses, though some may prefer the older lens rendering. Each to their own, I guess.", "link": "https://www.l-camera-forum.com/topic/325817-m10-r-too-many-pixels/?tab=comments#comment-4302059", "origin": "L-forum", "suborigin": "325817-m10-r-too-many-pixels", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "47 minutes ago, grahamc said: ok second that. genuine question what are the “issues” with higher megapixels ? i would assume that it’s more unforgiving of technical (focussing) errors ? also - how about lenses ... does a higher mp count reveal imperfections in vintage glass that previous resolutions didn’t? i ask this because a recent seller of a 50:1.4 pre-asph mentioned that the reason for sale was he was using m10r and as a result had switched to the latest and greatest lenses (namely apo in his case ). i don’t necessarily think that’s valid logic but would appreciate opinions. my only experience of high megapixels is sony a7riv 63mp. i really like it and haven’t experienced any issues but let’s be honest those cameras drive themselves - very hard / impossible to go wrong. hi graham, i think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! it’s fiction! you don’t know what you’re talking about! internet myth! etc etc the 18mp m9 and 24mp m(240)/m10 were considered to be the “sweet spot” for handheld 135 format digital. at that time, sony released its 37.5mp sensor (when leica had “only” 37.5mp in its s2). the cameras that first sensor was in (the sony a7r and the nikon d800e were two i had) were a nightmare to get sharp. many will deny this, but i can say from my own experience, that something was going on, and it wasn’t good. at the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly ming thein’s conclusion). i suspect it was a combination of shutter slap and the sensor site designs. both of which appear to have been solved. i have great faith in jono’s reviews, and he has said more than once that the m10-r doesn’t suffer from pixel level blur. that said, if i want greater resolution (which i don’t), i would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... as to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an improved sensor makes an image worse. i doubt this is actually possible. -----> improve !!!  either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. if you have an m10-r, there is little doubt that a 50 apo summicron will give you better images than the previous pre-asph 50 summicron or summilux lenses, though some may prefer the older lens rendering. each to their own, i guess.", "sortedWord": "None", "Identifyer": null, "identifyer": 2235, "year": "2021"}, {"autor": "grahamc", "date": "2021-10-29 05:05:00", "content": "12 minutes ago, IkarusJohn said: HI Graham, I think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! It’s fiction! You don’t know what you’re talking about! Internet myth! Etc etc The 18MP M9 and 24MP M(240)/M10 were considered to be the “sweet spot” for handheld 135 format digital. At that time, Sony released its 37.5MP sensor (when Leica had “only” 37.5MP in its S2). The cameras that first sensor was in (the Sony A7r and the Nikon D800e were two I had) were a nightmare to get sharp. Many will deny this, but I can say from my own experience, that something was going on, and it wasn’t good. At the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly Ming Thein’s conclusion). I suspect it was a combination of shutter slap and the sensor site designs. Both of which appear to have been solved. I have great faith in Jono’s reviews, and he has said more than once that the M10-R doesn’t suffer from pixel level blur. That said, if I want greater resolution (which I don’t), I would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... As to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an improved sensor makes an image worse. I doubt this is actually possible. Improve either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. If you have an M10-R, there is little doubt that a 50 APO Summicron will give you better images than the previous pre-Asph 50 Summicron or Summilux lenses, though some may prefer the older lens rendering. Each to their own, I guess. Thanks John, Very interesting and all makes sense - I hadn't known about those earlier issues with the larger MP digital cameras. I'm really happy with my A7Riv although naturally it's had very little / no use since I wandered into a Leica store and picked up an M But it is really impressive. In practical terms I doubt that I need higher than 24MP in an M at this point ... even the noticeably quicker download to my computer and pain free editing makes the experience match the M system really well IMO (simplicity/compactness/lightness). This may change in the future but right now very happy. Edited October 29 by grahamc", "link": "https://www.l-camera-forum.com/topic/325817-m10-r-too-many-pixels/?tab=comments#comment-4302061", "origin": "L-forum", "suborigin": "325817-m10-r-too-many-pixels", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "12 minutes ago, ikarusjohn said: hi graham, i think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! it’s fiction! you don’t know what you’re talking about! internet myth! etc etc the 18mp m9 and 24mp m(240)/m10 were considered to be the “sweet spot” for handheld 135 format digital. at that time, sony released its 37.5mp sensor (when leica had “only” 37.5mp in its s2). the cameras that first sensor was in (the sony a7r and the nikon d800e were two i had) were a nightmare to get sharp. many will deny this, but i can say from my own experience, that something was going on, and it wasn’t good. at the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly ming thein’s conclusion). i suspect it was a combination of shutter slap and the sensor site designs. both of which appear to have been solved. i have great faith in jono’s reviews, and he has said more than once that the m10-r doesn’t suffer from pixel level blur. that said, if i want greater resolution (which i don’t), i would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... as to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an improved sensor makes an image worse. i doubt this is actually possible. -----> improve !!!  either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. if you have an m10-r, there is little doubt that a 50 apo summicron will give you better images than the previous pre-asph 50 summicron or summilux lenses, though some may prefer the older lens rendering. each to their own, i guess. thanks john, very interesting and all makes sense - i hadn't known about those earlier issues with the larger mp digital cameras. i'm really happy with my a7riv although naturally it's had very little / no use since i wandered into a leica store and picked up an m but it is really impressive. in practical terms i doubt that i need higher than 24mp in an m at this point ... even the noticeably quicker download to my computer and pain free editing makes the experience match the m system really well imo (simplicity/compactness/lightness). this may change in the future but right now very happy. edited october 29 by grahamc", "sortedWord": "None", "Identifyer": null, "identifyer": 2236, "year": "2021"}, {"autor": "aristotle", "date": "2021-10-29 11:55:00", "content": "6 hours ago, IkarusJohn said: HI Graham, I think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! It’s fiction! You don’t know what you’re talking about! Internet myth! Etc etc The 18MP M9 and 24MP M(240)/M10 were considered to be the “sweet spot” for handheld 135 format digital. At that time, Sony released its 37.5MP sensor (when Leica had “only” 37.5MP in its S2). The cameras that first sensor was in (the Sony A7r and the Nikon D800e were two I had) were a nightmare to get sharp. Many will deny this, but I can say from my own experience, that something was going on, and it wasn’t good. At the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly Ming Thein’s conclusion). I suspect it was a combination of shutter slap and the sensor site designs. Both of which appear to have been solved. I have great faith in Jono’s reviews, and he has said more than once that the M10-R doesn’t suffer from pixel level blur. That said, if I want greater resolution (which I don’t), I would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... As to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an improved sensor makes an image worse. I doubt this is actually possible. Improve either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. If you have an M10-R, there is little doubt that a 50 APO Summicron will give you better images than the previous pre-Asph 50 Summicron or Summilux lenses, though some may prefer the older lens rendering. Each to their own, I guess. I guess I'm one of those who deny this I still have my D800e and 100% crops from that are as sharp as from most anything that I've used. Even though the AA filter was removed from the 800e, there is still a low pass filter (albeit weaker than the AA filter in the original D800) so that does blur things a bit in comparison with the D850 for example, but that's not the result of having \"more pixels\"....the 850 actually has \"more\". I tend to do physical prints, so in theory higher resolution would benefit me by allowing more crop flexibility while maintaining a good print resolution. Practically, 24MP is plenty for that though. But also practically, even with my older computer systems, 40-50mp doesn't bog anything down for me, and there seems no downside to having higher resolution sensors. The irony is that for applications where the additional resolution would theoretically benefit (BIF or wildlife from afar), I'm typically handheld with a long telephoto doing my best to keep up with the subject. In those cases, regardless of IS or technique, the extra resolution doesn't often buy you what you'd like. On the other hand, for landscapes or other scenes that are composed, one can often define the framing and perspective as desired and even though the capability exists to cut way into the image, it's not needed and you end up throwing resolution away by the time you adjust for print. There are definitely some nature applications though where it is beneficial to crop into the scene because you can't physically get to where you want to. All in all, I'd take more resolution whenever it's available.", "link": "https://www.l-camera-forum.com/topic/325817-m10-r-too-many-pixels/?tab=comments#comment-4302233", "origin": "L-forum", "suborigin": "325817-m10-r-too-many-pixels", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "6 hours ago, ikarusjohn said: hi graham, i think this is more complex than it first appears, and certainly more complex than a lot of the trading blows posts you’ll read here - it’s true! it’s fiction! you don’t know what you’re talking about! internet myth! etc etc the 18mp m9 and 24mp m(240)/m10 were considered to be the “sweet spot” for handheld 135 format digital. at that time, sony released its 37.5mp sensor (when leica had “only” 37.5mp in its s2). the cameras that first sensor was in (the sony a7r and the nikon d800e were two i had) were a nightmare to get sharp. many will deny this, but i can say from my own experience, that something was going on, and it wasn’t good. at the time, the assumption was that it was motion blur, making it very hard to get a sharp image (that was certainly ming thein’s conclusion). i suspect it was a combination of shutter slap and the sensor site designs. both of which appear to have been solved. i have great faith in jono’s reviews, and he has said more than once that the m10-r doesn’t suffer from pixel level blur. that said, if i want greater resolution (which i don’t), i would go for a larger sensor over more pixels in a smaller sensor - there are so many advantages to medium format - sadly, size isn’t one of them, and bigger pixels seem to work better than smaller ones ... as to lens performance, it is very unlikely that any lens is outperformed by the sensor, in that an improved sensor makes an image worse. i doubt this is actually possible. -----> improve !!!  either the sensor or the lens, and it is likely the image will be better, even if it’s just to show the lens limitations more clearly. if you have an m10-r, there is little doubt that a 50 apo summicron will give you better images than the previous pre-asph 50 summicron or summilux lenses, though some may prefer the older lens rendering. each to their own, i guess. i guess i'm one of those who deny this i still have my d800e and 100% crops from that are as sharp as from most anything that i've used. even though the aa filter was removed from the 800e, there is still a low pass filter (albeit weaker than the aa filter in the original d800) so that does blur things a bit in comparison with the d850 for example, but that's not the result of having \"more pixels\"....the 850 actually has \"more\". i tend to do physical prints, so in theory higher resolution would benefit me by allowing more crop flexibility while maintaining a good print resolution. practically, 24mp is plenty for that though. but also practically, even with my older computer systems, 40-50mp doesn't bog anything down for me, and there seems no downside to having higher resolution sensors. the irony is that for applications where the additional resolution would theoretically benefit (bif or wildlife from afar), i'm typically handheld with a long telephoto doing my best to keep up with the subject. in those cases, regardless of is or technique, the extra resolution doesn't often buy you what you'd like. on the other hand, for landscapes or other scenes that are composed, one can often define the framing and perspective as desired and even though the capability exists to cut way into the image, it's not needed and you end up throwing resolution away by the time you adjust for print. there are definitely some nature applications though where it is beneficial to crop into the scene because you can't physically get to where you want to. all in all, i'd take more resolution whenever it's available.", "sortedWord": "None", "Identifyer": null, "identifyer": 2239, "year": "2021"}, {"autor": "Rick in CO", "date": "2021-01-03 15:44:00", "content": "So...to reiterate (perhaps in likelihood of happening): 1. Improved back-lit sensor, 26 to 30-some Mp, with Maestro III. This would be obviously included in a new version. 2. Increased EVF resolution: 3.7 Mp of the Q series or the 4.4 Mp of the SL. Again, an additive improvement. (Higher Res EVF help with the tele zoom lenses?) 3. IBIS: How can they make an up-to-date (and expensive) camera without IBIS versus only if the size is kept as is? 4. Weather sealing, as most use it as a travel and go anywhere camera. 5. Common battery with Q and SL series. If IBIS increases body size, only then might this be possible? No priority for M shooters. Okay, I was totally wrong on the SL2-S, but I would buy a CL2 with #'s 1 & 2. With #'s 1-4 I would pre-order.", "link": "https://www.l-camera-forum.com/topic/311632-hoping-that-cl2-mini-sl2/page/15/?tab=comments#comment-4111416", "origin": "L-forum", "suborigin": "311632-hoping-that-cl2-mini-sl2", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "so...to reiterate (perhaps in likelihood of happening): 1. -----> improved !!!  back-lit sensor, 26 to 30-some mp, with maestro iii. this would be obviously included in a new version. 2. increased evf resolution: 3.7 mp of the q series or the 4.4 mp of the sl. again, an additive improvement. (higher res evf help with the tele zoom lenses?) 3. ibis: how can they make an up-to-date (and expensive) camera without ibis versus only if the size is kept as is? 4. weather sealing, as most use it as a travel and go anywhere camera. 5. common battery with q and sl series. if ibis increases body size, only then might this be possible? no priority for m shooters. okay, i was totally wrong on the sl2-s, but i would buy a cl2 with #'s 1 & 2. with #'s 1-4 i would pre-order.", "sortedWord": "None", "Identifyer": null, "identifyer": 42952, "year": "2021"}, {"autor": "double00", "date": "2021-01-03 22:54:00", "content": "7 hours ago, Rick in CO said: So...to reiterate (perhaps in likelihood of happening): 1. Improved back-lit sensor, 26 to 30-some Mp, with Maestro III. This would be obviously included in a new version. 2. Increased EVF resolution: 3.7 Mp of the Q series or the 4.4 Mp of the SL. Again, an additive improvement. (Higher Res EVF help with the tele zoom lenses?) 3. IBIS: How can they make an up-to-date (and expensive) camera without IBIS versus only if the size is kept as is? 4. Weather sealing, as most use it as a travel and go anywhere camera. 5. Common battery with Q and SL series. If IBIS increases body size, only then might this be possible? No priority for M shooters. Okay, I was totally wrong on the SL2-S, but I would buy a CL2 with #'s 1 & 2. With #'s 1-4 I would pre-order. If the CL2 has IBIS, I'm all over it. If not, I am just fine with the CL. Would not switch for 1, 2, 4 or 5.", "link": "https://www.l-camera-forum.com/topic/311632-hoping-that-cl2-mini-sl2/page/15/?tab=comments#comment-4111752", "origin": "L-forum", "suborigin": "311632-hoping-that-cl2-mini-sl2", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "7 hours ago, rick in co said: so...to reiterate (perhaps in likelihood of happening): 1. -----> improved !!!  back-lit sensor, 26 to 30-some mp, with maestro iii. this would be obviously included in a new version. 2. increased evf resolution: 3.7 mp of the q series or the 4.4 mp of the sl. again, an additive improvement. (higher res evf help with the tele zoom lenses?) 3. ibis: how can they make an up-to-date (and expensive) camera without ibis versus only if the size is kept as is? 4. weather sealing, as most use it as a travel and go anywhere camera. 5. common battery with q and sl series. if ibis increases body size, only then might this be possible? no priority for m shooters. okay, i was totally wrong on the sl2-s, but i would buy a cl2 with #'s 1 & 2. with #'s 1-4 i would pre-order. if the cl2 has ibis, i'm all over it. if not, i am just fine with the cl. would not switch for 1, 2, 4 or 5.", "sortedWord": "None", "Identifyer": null, "identifyer": 42955, "year": "2021"}, {"autor": "garygraphy", "date": "2021-01-04 13:31:00", "content": "21 hours ago, Rick in CO said: So...to reiterate (perhaps in likelihood of happening): 1. Improved back-lit sensor, 26 to 30-some Mp, with Maestro III. This would be obviously included in a new version. 2. Increased EVF resolution: 3.7 Mp of the Q series or the 4.4 Mp of the SL. Again, an additive improvement. (Higher Res EVF help with the tele zoom lenses?) 3. IBIS: How can they make an up-to-date (and expensive) camera without IBIS versus only if the size is kept as is? 4. Weather sealing, as most use it as a travel and go anywhere camera. 5. Common battery with Q and SL series. If IBIS increases body size, only then might this be possible? No priority for M shooters. Okay, I was totally wrong on the SL2-S, but I would buy a CL2 with #'s 1 & 2. With #'s 1-4 I would pre-order. If they can fit IBIS into the GR3 (its ridiculously small) and if the A7C can have IBIS, its ridiculous if CL2 doesn't come with.", "link": "https://www.l-camera-forum.com/topic/311632-hoping-that-cl2-mini-sl2/page/15/?tab=comments#comment-4112084", "origin": "L-forum", "suborigin": "311632-hoping-that-cl2-mini-sl2", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "21 hours ago, rick in co said: so...to reiterate (perhaps in likelihood of happening): 1. -----> improved !!!  back-lit sensor, 26 to 30-some mp, with maestro iii. this would be obviously included in a new version. 2. increased evf resolution: 3.7 mp of the q series or the 4.4 mp of the sl. again, an additive improvement. (higher res evf help with the tele zoom lenses?) 3. ibis: how can they make an up-to-date (and expensive) camera without ibis versus only if the size is kept as is? 4. weather sealing, as most use it as a travel and go anywhere camera. 5. common battery with q and sl series. if ibis increases body size, only then might this be possible? no priority for m shooters. okay, i was totally wrong on the sl2-s, but i would buy a cl2 with #'s 1 & 2. with #'s 1-4 i would pre-order. if they can fit ibis into the gr3 (its ridiculously small) and if the a7c can have ibis, its ridiculous if cl2 doesn't come with.", "sortedWord": "None", "Identifyer": null, "identifyer": 42956, "year": "2021"}, {"autor": "jaapv", "date": "2021-06-26 14:42:00", "content": "The colours are not set by the camera but by your raw converter from DNG. Improving your postprocessing skills is more productive than switching cameras. The best solution is to set up a fully colour managed workflow.", "link": "https://www.l-camera-forum.com/topic/316894-cl-in-camera-color-rendering-question/page/2/?tab=comments#comment-4226684", "origin": "L-forum", "suborigin": "316894-cl-in-camera-color-rendering-question", "result": false, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "improving your postprocessing -----> skills !!!  is more productive than switching cameras.", "sortedWord": "skill", "Identifyer": null, "identifyer": 41257, "year": "2021"}], "name": "Leicasortedout2021improve"}