{"interestingcomments": [{"autor": "erl", "date": "2014-11-14 03:10:00", "content": "Can someone tell me the approximate cost of a sensor cleaning and how to arrange for service? Depends on where you live etc. I would also recommend investigate self cleaning. Where I live, profesional cleaning costs about $200. The apparatus for doing it yourself costs around $90 and last for untold number of cleans. if you can clean windows, you can clean a sensor! Note: you will find opinions arising that disagree with my POV, but that is life. In the end, you make your own decisions and act o them. Good luck with your choice. It's not difficult. --img-- ", "link": "https://www.l-camera-forum.com/topic/235074-leica-customer-service-read-what-happened-to-my-m9/page/3/?tab=comments#comment-2706159", "origin": "L-forum", "suborigin": "235074-leica-customer-service-read-what-happened-to-my-m9", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "can someone tell me the approximate cost of a sensor cleaning and how to arrange for service? depends on where you live etc. i would also recommend investigate self cleaning. where i live, profesional cleaning costs about $200. the apparatus for -----> doing !!!  -----> it !!!  -----> yourself !!!  costs around $90 and last for untold number of cleans. if you can clean windows, you can clean a sensor! note: you will find opinions arising that disagree with my pov, but that is life. in the end, you make your own decisions and act o them. good luck with your choice. it's not difficult. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 31438, "year": "2014"}, {"autor": "luigi bertolotti", "date": "2014-06-08 09:30:00", "content": " I wouldn't even try unless you are willing to strip the whole thing down and send it to a specialist finisher. The aerosol wrinkle finish paint is both inconsistent and only a decorative finish, so it won't stand up to handling. Steve I agree... if you want to do it yourself.. ok, can be a good exercise... if you had to pay for a lab... a well done job imho isn't worth the cost.", "link": "https://www.l-camera-forum.com/topic/228497-how-to-repair-and-retouch-the-visoflex/?tab=comments#comment-2606378", "origin": "L-forum", "suborigin": "228497-how-to-repair-and-retouch-the-visoflex", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": " i wouldn't even try unless you are willing to strip the whole thing down and send it to a specialist finisher. the aerosol wrinkle finish paint is both inconsistent and only a decorative finish, so it won't stand up to handling. steve i agree... if you want to -----> do !!!  -----> it !!!  -----> yourself !!! .. ok, can be a good exercise... if you had to pay for a lab... a well done job imho isn't worth the cost.", "sortedWord": "None", "Identifyer": null, "identifyer": 38630, "year": "2014"}, {"autor": "pop", "date": "2014-02-13 14:47:00", "content": "I have bought in a do it yourself shop an A4 sized sheet of semi transparent foil. I use a square of abot 8 by 8 cm in front of the lens of my M for that purpose. If you PM me your address, I will send you a similarly sized piece of it.", "link": "https://www.l-camera-forum.com/topic/221817-who-still-uses-a-handheld-meter/?tab=comments#comment-2531520", "origin": "L-forum", "suborigin": "221817-who-still-uses-a-handheld-meter", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "i have bought in a -----> do !!!  -----> it !!!  -----> yourself !!!  shop an a4 sized sheet of semi transparent foil. i use a square of abot 8 by 8 cm in front of the lens of my m for that purpose. if you pm me your address, i will send you a similarly sized piece of it.", "sortedWord": "None", "Identifyer": null, "identifyer": 85224, "year": "2014"}, {"autor": "mnutzer", "date": "2014-02-13 18:38:00", "content": "I have bought in a do it yourself shop an A4 sized sheet of semi transparent foil. I use a square of abot 8 by 8 cm in front of the lens of my M for that purpose. If you PM me your address, I will send you a similarly sized piece of it. That's very kind of you. You have received a personal message from me.", "link": "https://www.l-camera-forum.com/topic/221817-who-still-uses-a-handheld-meter/?tab=comments#comment-2531732", "origin": "L-forum", "suborigin": "221817-who-still-uses-a-handheld-meter", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "i have bought in a -----> do !!!  -----> it !!!  -----> yourself !!!  shop an a4 sized sheet of semi transparent foil. i use a square of abot 8 by 8 cm in front of the lens of my m for that purpose. if you pm me your address, i will send you a similarly sized piece of it. that's very kind of you. you have received a personal message from me.", "sortedWord": "None", "Identifyer": null, "identifyer": 85225, "year": "2014"}, {"autor": "timde", "date": "2014-10-27 18:58:00", "content": "Many thanks you all, so far am unable to rescue the picture --img--  What tools have you tried so far? There are lots. Also check your local paper, might find a local data recovery service that might be useful if you can't figure out how to do it yourself. They might also help you setup with some kind of backup service. But, you copied a file from the SD Card to your computer, overwriting a file on the computer. Unless you have more than one camera, then is it possible that you overwrote that file with the same file from the SD Card?", "link": "https://www.l-camera-forum.com/topic/235997-help-how-to-rescue-deleted-photos-from-dmr/?tab=comments#comment-2696090", "origin": "L-forum", "suborigin": "235997-help-how-to-rescue-deleted-photos-from-dmr", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "many thanks you all, so far am unable to rescue the picture --img--  what tools have you tried so far? there are lots. also check your local paper, might find a local data recovery service that might be useful if you can't figure out how to -----> do !!!  -----> it !!!  -----> yourself !!! . they might also help you setup with some kind of backup service. but, you copied a file from the sd card to your computer, overwriting a file on the computer. unless you have more than one camera, then is it possible that you overwrote that file with the same file from the sd card?", "sortedWord": "None", "Identifyer": null, "identifyer": 94925, "year": "2014"}, {"autor": "andybarton", "date": "2014-10-25 18:59:00", "content": "You will need to send a PM to \"admin\" I'm afraid that you cannot do it yourself and a Mod cannot do it either.", "link": "https://www.l-camera-forum.com/topic/236054-deleting-the-account/?tab=comments#comment-2694991", "origin": "L-forum", "suborigin": "236054-deleting-the-account", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "you will need to send a pm to \"admin\" i'm afraid that you cannot -----> do !!!  -----> it !!!  -----> yourself !!!  and a mod cannot -----> do !!!  -----> it !!!  either.", "sortedWord": "None", "Identifyer": null, "identifyer": 119799, "year": "2014"}, {"autor": "Guest odeon", "date": "2014-10-27 06:16:00", "content": "You will need to send a PM to \"admin\" I'm afraid that you cannot do it yourself and a Mod cannot do it either. I did, but I could not reach any result. Also I cannot find an information about deleting or deactivating the account on forum.", "link": "https://www.l-camera-forum.com/topic/236054-deleting-the-account/?tab=comments#comment-2695752", "origin": "L-forum", "suborigin": "236054-deleting-the-account", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "you will need to send a pm to \"admin\" i'm afraid that you cannot -----> do !!!  -----> it !!!  -----> yourself !!!  and a mod cannot -----> do !!!  -----> it !!!  either. i did, but i could not reach any result. also i cannot find an information about deleting or deactivating the account on forum.", "sortedWord": "None", "Identifyer": null, "identifyer": 119800, "year": "2014"}], "name": "Leicasortedout2014yourself"}