{"interestingcomments": [{"autor": "Julian Thompson", "date": "2010-04-13 14:21:00", "content": "Brett - --img--  I know this is not for everyone and that's not what I'm saying - my aim in posting is to share the work I have done and the successes I have had with my own adjustments. It is very nice to know how to tweak one's own camera very quickly if necessary. It is nice to remove the 'aura' from the rangefinder mechanism in one's own mind and kind of feel at one with it. That's all. So Jamie - this is the explanation I posted a little while back along with a couple of pics for you to look at. As adil says you need to take a sample of shots from every lens (and body if possible) you have to make sure you're calibrating it right. You will need a 2.5mm allen key and a small screwdriver which you should grind a very slight angle on so that as you fit the screwdriver into the head on the focus throw pivot (A) on the diagram it allows a nice flat drive. A) is the focus throw adjustment. If you look at the pic you can see that the screw retains an eccentric cam. If you loosen the screw you can rotate the cam (as denoted by the pink and blue arrows) freely. As you do so, the length of the arm itself changes. By moving the cam counter-clockwise (as in pink arrow) you INCREASE the total available focus throw. By moving the cam clockwise (as in blue arrow) you DECREASE the total available focus throw. --img--  is the infinity adjustment as we know. If you rotate the 2.5mm hex key counter clockwise (as in green arrow) you move the point at which the rangefinder 'sees' infinity further away - and this 'references everything forward of that. If you rotate the 2.5mm hex key clockwise (as in yellow arrow) you move the point at which the rangefinder 'sees' infinity closer to you - and this 'references everything forward of that. Right - so they are the two adjustments you have available to you. From my playing about the best way to set it up is this. 1) Infinity is very important. Step 1 is to look at something with lots of contrast a long way off (a star does seem to work very well but today I've been using a clock tower in the far distance and that's fine too) and then adjust the roller (--img--  so that this perfectly coincides. Don't accept the nonesense I was spouting before about it not mattering. It really matters that you can 100% converge the object at infinity. 2) Now, take a photo at a big aperture of something close to you - like 0.8 meters or similar. I found text to be excellent. Note whether you now have front focus or back focus. If you have front focus (like I did - big time!) then your focus throw is too short; ie your arm is too long, so when the lens rotates you're not pushing the rangefinder enough. So you need to shorten the arm by loosening (A) and twisting the cam slightly anti-clockwise. (If you have backfocus then it's obviously the inverse and you need to go clockwise to lengthen the arm and reduce your focus throw). 3) Now, recheck infinity. It will now be wrong, because you have now moved the arm and so the roller wheel has also moved. But this is not a problem - just recorrect infinity as in 1) above to compensate for the altered focus throw. 4) Repeat step 2. You will see that the focus point has altered. Whether it has moved too little or too much will calibrate your hand/eye as to how much you need to make the adjustments but in general I made positive, but not excessive tweaks each time. 5) When you are happy with the infinity and close settings you want to shoot some images off that are at various distances just to make sure that everything is right. On my setup which consists of all current model lenses (not sure if this is relevent) I did not have to compensate with any kind of compromise here. When my infinity setting is right and the focus throw is perfect the transgression from near to far is linear and my lenses are sharp right the way through the range. I suppose that if this were not the case or if your lenses varied then you'd need to get them recalibrated, or maybe accept a compromise setting. Hope that's helpful. Have fun --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/?tab=comments#comment-1292675", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "brett - --img--  i know this is not for everyone and that's not what i'm saying - my aim in posting is to share the work i have done and the successes i have had with my own adjustments. it is very nice to know how to tweak one's own camera very quickly if necessary. it is nice to remove the 'aura' from the rangefinder mechanism in one's own mind and kind of feel at one with it. that's all. so jamie - this is the explanation i posted a little while back along with a couple of pics for you to look at. as adil says you need to take a sample of shots from every lens (and body if possible) you have to make sure you're calibrating it right. you will need a 2.5mm allen key and a small screwdriver which you should grind a very slight angle on so that as you fit the screwdriver into the head on the focus throw pivot (a) on the diagram it allows a nice flat drive. a) is the focus throw adjustment. if you look at the pic you can see that the screw retains an eccentric cam. if you loosen the screw you can rotate the cam (as denoted by the pink and blue arrows) freely. as you do so, the length of the arm itself changes. by moving the cam counter-clockwise (as in pink arrow) you increase the total available focus throw. by moving the cam clockwise (as in blue arrow) you decrease the total available focus throw. --img--  is the infinity adjustment as we know. if you rotate the 2.5mm hex key counter clockwise (as in green arrow) you move the point at which the rangefinder 'sees' infinity further away - and this 'references everything forward of that. if you rotate the 2.5mm hex key clockwise (as in yellow arrow) you move the point at which the rangefinder 'sees' infinity closer to you - and this 'references everything forward of that. right - so they are the two adjustments you have available to you. from my playing about the best way to set it up is this. 1) infinity is very important. step 1 is to look at something with lots of contrast a long way off (a star does seem to work very well but today i've been using a clock tower in the far distance and that's fine too) and then adjust the roller (--img--  so that this perfectly coincides. don't accept the nonesense i was spouting before about it not mattering. it really matters that you can 100% converge the object at infinity. 2) now, take a photo at a big aperture of something close to you - like 0.8 meters or similar. i found text to be excellent. note whether you now have front focus or back focus. if you have front focus (like i did - big time!) then your focus throw is too short; ie your arm is too long, so when the lens rotates you're not pushing the rangefinder enough. so you need to shorten the arm by loosening (a) and twisting the cam slightly anti-clockwise. (if you have backfocus then it's obviously the inverse and you need to go clockwise to lengthen the arm and reduce your focus throw). 3) now, recheck infinity. it will now be wrong, because you have now moved the arm and so the roller wheel has also moved. but this is not a problem - just recorrect infinity as in 1) above to compensate for the altered focus throw. 4) repeat step 2. you will see that the focus point has altered. whether it has moved too little or too much will calibrate your hand/eye as to how much you need to make the adjustments but in general -----> i !!!  -----> made !!!  positive, but not excessive tweaks each time. 5) when you are happy with the infinity and close settings you want to shoot some images off that are at various distances just to make sure that everything is right. on my setup which consists of all current model lenses (not sure if this is relevent) i did not have to compensate with any kind of compromise here. when my infinity setting is right and the focus throw is perfect the transgression from near to far is linear and my lenses are sharp right the way through the range. i suppose that if this were not the case or if your lenses varied then you'd need to get them recalibrated, or maybe accept a compromise setting. hope that's helpful. have fun --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 30659, "year": "2010"}, {"autor": "pack_tor", "date": "2010-04-14 01:42:00", "content": "Jamie - if you find a right tool, let me know. I'm in the GTA too and stuck in exactly your situation. The lenses are front focusing by a couple of inches but infinity is right. And, I have made enough marks on the screw that any Leica technician would know I've messed around with it. I don't want to use a non-functioning screwdriver and make the situation worse.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/3/?tab=comments#comment-1293350", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": "jamie - if you find a right tool, let me know. i'm in the gta too and stuck in exactly your situation. the lenses are front focusing by a couple of inches but infinity is right. and, -----> i !!!  -----> have !!!  -----> made !!!  enough marks on the screw that any leica technician would know -----> i !!! 've messed around with it. i don't want to use a non-functioning screwdriver and make the situation worse.", "sortedWord": "None", "Identifyer": null, "identifyer": 30690, "year": "2010"}, {"autor": "Jamie Roberts", "date": "2010-04-14 02:52:00", "content": " Jamie - if you find a right tool, let me know. I'm in the GTA too and stuck in exactly your situation. The lenses are front focusing by a couple of inches but infinity is right. And, I have made enough marks on the screw that any Leica technician would know I've messed around with it. I don't want to use a non-functioning screwdriver and make the situation worse. I hear you! Let's see what Julian says about what kind of screwdriver to us (I know that sounds absurd), and with any luck, we can get together at some point and celebrate our perfectly calibrated M9s... or drown our sorrows --img-- ", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/3/?tab=comments#comment-1293367", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "i have made", "selectorShort": "make", "MarkedSent": " jamie - if you find a right tool, let me know. i'm in the gta too and stuck in exactly your situation. the lenses are front focusing by a couple of inches but infinity is right. and, -----> i !!!  -----> have !!!  -----> made !!!  enough marks on the screw that any leica technician would know -----> i !!! 've messed around with it. i don't want to use a non-functioning screwdriver and make the situation worse. i hear you! let's see what julian says about what kind of screwdriver to us (i know that sounds absurd), and with any luck, we can get together at some point and celebrate our perfectly calibrated m9s... or drown our sorrows --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 30691, "year": "2010"}, {"autor": "Julian Thompson", "date": "2010-04-25 06:58:00", "content": "This is beyond funny Jaap, and just shows how you will push a position rather than saying 'ah I see, sorry guys I was wrong' So it turns out that the service tool is used to lock into the hole in the arm and effect an adjustment of the arm length as described by me. What an excellent tool. You don't NEED it of course, but it would be lovely to have it. So, in my case I spend many tens of hours deducing how it all works, gradually, even publishing my errors along the way and getting help wherever I can and then, safe in the knowledge that I understand it I made some posts backing everything up with evidence. You, on the other hand see a PHOTOGRAPH YOU CAN JUST MAKE OUT and then attempt to advise with the following: There are three points of adjustment in that arm WRONG That hole takes a bending tool, to bend the arm WRONG - It's the adjustment tool to allow you to hold the arm easier. and bend for intermediate. WRONG - You tell me I'm misadvising - this is the funniest thing I've read for a while! You'll find the special \"bending tool\" there as well. WRONG - No bending here mate. And my own, very special favourite Jaap is this: In a small way you are right, the bending is the setting that is rarely off in cameras that leave the factory and is the least likely to go out of adjustment So, there is no bending tool and yet you KNOW that this adjustment is rarely off, and is not likely to go out of adjustment. Just how on the Lord's earth can you know that, since this is an adjustment that you have made up in your own mind. Quite simply you have fabricated the whole bending thing because you've seen the adjustment tool that has now been correctly identified and you've decided to try and have the last word on it by making up the idea that bending your camera arm would affect your close focus. The only thing that trying to bend that arm would affect would be your warranty, mate, when it snaps straight off ! It's unbelievable Jaap. So if you really are: concerned about unsuspecting readers following your example, completely throwing their rangefinder out of whack and voiding their guaranty in the process. Then you'll obviously want to set the record straight and admit straight out that you've been talking unsubstantiated nonsense and that nobody, ever, should want to try and bend their camera. That in fact you've misunderstood and you understand now that there are only 2 adjustments - length of arm and eccentric roller cam position, and that you confess to making up the third adjustment solely to make yourself look dead clever. Adjusting the rangefinder is no more dangerous or difficult than adjusting a derailleur gear set on a bike - you either understand what the screws do or you don't - there is no middle ground. And the adjustment is self checking - it either works and is in focus on your photographs or it's not - Like the gears - they either change smoothly and have the right end points, and don't jump between gears or they don't. Saying that an unsuspecting owner could put 'everything' out of whack is only like messing up the screws on the gear set. You just tweak them back in once you understand it - no biggie. Or maybe you know of a secret bending tool that you use to do the gears on your bike as well eh? Honestly I don't mean to sound harsh but the scale of the nonsense here Jaap is absolutely incredible and you need to deal with it. Edited April 25, 2010 by Julian Thompson", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/5/?tab=comments#comment-1304813", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "this is beyond funny jaap, and just shows how you will push a position rather than saying 'ah i see, sorry guys i was wrong' so it turns out that the service tool is used to lock into the hole in the arm and effect an adjustment of the arm length as described by me. what an excellent tool. you don't need it of course, but it would be lovely to have it. so, in my case -----> i !!!  spend many tens of hours deducing how it all works, gradually, even publishing my errors along the way and getting help wherever -----> i !!!  can and then, safe in the knowledge that -----> i !!!  understand it -----> i !!!  -----> made !!!  some posts backing everything up with evidence. you, on the other hand see a photograph you can just make out and then attempt to advise with the following: there are three points of adjustment in that arm wrong that hole takes a bending tool, to bend the arm wrong - it's the adjustment tool to allow you to hold the arm easier. and bend for intermediate. wrong - you tell me i'm misadvising - this is the funniest thing i've read for a while! you'll find the special \"bending tool\" there as well. wrong - no bending here mate. and my own, very special favourite jaap is this: in a small way you are right, the bending is the setting that is rarely off in cameras that leave the factory and is the least likely to go out of adjustment so, there is no bending tool and yet you know that this adjustment is rarely off, and is not likely to go out of adjustment. just how on the lord's earth can you know that, since this is an adjustment that you have made up in your own mind. quite simply you have fabricated the whole bending thing because you've seen the adjustment tool that has now been correctly identified and you've decided to try and have the last word on it by making up the idea that bending your camera arm would affect your close focus. the only thing that trying to bend that arm would affect would be your warranty, mate, when it snaps straight off ! it's unbelievable jaap. so if you really are: concerned about unsuspecting readers following your example, completely throwing their rangefinder out of whack and voiding their guaranty in the process. then you'll obviously want to set the record straight and admit straight out that you've been talking unsubstantiated nonsense and that nobody, ever, should want to try and bend their camera. that in fact you've misunderstood and you understand now that there are only 2 adjustments - length of arm and eccentric roller cam position, and that you confess to making up the third adjustment solely to make yourself look dead clever. adjusting the rangefinder is no more dangerous or difficult than adjusting a derailleur gear set on a bike - you either understand what the screws do or you don't - there is no middle ground. and the adjustment is self checking - it either works and is in focus on your photographs or it's not - like the gears - they either change smoothly and have the right end points, and don't jump between gears or they don't. saying that an unsuspecting owner could put 'everything' out of whack is only like messing up the screws on the gear set. you just tweak them back in once you understand it - no biggie. or maybe you know of a secret bending tool that you use to do the gears on your bike as well eh? honestly i don't mean to sound harsh but the scale of the nonsense here jaap is absolutely incredible and you need to deal with it. edited april 25, 2010 by julian thompson", "sortedWord": "None", "Identifyer": null, "identifyer": 30730, "year": "2010"}, {"autor": "Jamie Roberts", "date": "2010-04-16 20:16:00", "content": "Thanks Jamie. I cannot afford both. Will try to negotiate the Lux down in price to see what kind of deal I can get, but right now it seems that the Cron would be a better choice. I also think that a new 75/1.4 will come out eventually, based on the new optical designs that have already benefitted the 35/1.4 that is coming out now, and that may offer interesting advantages. If you can't afford both, then the Lux is a better deal, though for that price I'd want to make sure it's in top-notch shape. You won't miss any sharpness on the Lux once it's stopped down, but you can't open up the cron to 1.4 --img--  OTH, it isn't small. @ RIck--that's a great shot, by the way! Edited April 16, 2010 by Jamie Roberts", "link": "https://www.l-camera-forum.com/topic/118408-advice-needed-on-75-mm-lens/?tab=comments#comment-1296317", "origin": "L-forum", "suborigin": "118408-advice-needed-on-75-mm-lens", "result": true, "Selector": "i'd want to make", "selectorShort": "make", "MarkedSent": "thanks jamie. i cannot afford both. will try to negotiate the lux down in price to see what kind of deal i can get, but right now it seems that the cron would be a better choice. i also think that a new 75/1.4 will come out eventually, based on the new optical designs that have already benefitted the 35/1.4 that is coming out now, and that may offer interesting advantages. if you can't afford both, then the lux is a better deal, though for that price -----> i !!! -----> 'd !!!  -----> want !!!  -----> to !!!  -----> make !!!  sure it's in top-notch shape. you won't miss any sharpness on the lux once it's stopped down, but you can't open up the cron to 1.4 --img--  oth, it isn't small. @ rick--that's a great shot, by the way! edited april 16, 2010 by jamie roberts", "sortedWord": "None", "Identifyer": null, "identifyer": 31157, "year": "2010"}, {"autor": "Jose_Salcedo", "date": "2010-04-16 20:24:00", "content": "If you can't afford both, then the Lux is a better deal, though for that price I'd want to make sure it's in top-notch shape. Thanks, Jamie! I will check the lens again tomorrow. It seems brand new and in top shape, but I need to recheck. By the way, have you experienced any focus shift issues?", "link": "https://www.l-camera-forum.com/topic/118408-advice-needed-on-75-mm-lens/?tab=comments#comment-1296320", "origin": "L-forum", "suborigin": "118408-advice-needed-on-75-mm-lens", "result": true, "Selector": "i'd want to make", "selectorShort": "make", "MarkedSent": "if you can't afford both, then the lux is a better deal, though for that price -----> i !!! -----> 'd !!!  -----> want !!!  -----> to !!!  -----> make !!!  sure it's in top-notch shape. thanks, jamie! i will check the lens again tomorrow. it seems brand new and in top shape, but i need to recheck. by the way, have you experienced any focus shift issues?", "sortedWord": "None", "Identifyer": null, "identifyer": 31158, "year": "2010"}, {"autor": "Bill W", "date": "2010-04-17 02:00:00", "content": "Jose, Bottom line is that they are both great lens. I have owned both. I currently have the cron. The lux is heavy and the focus is a very long throw. While I really liked the lux I do not miss it. I have to admit I made money on the lux when I sold it.", "link": "https://www.l-camera-forum.com/topic/118408-advice-needed-on-75-mm-lens/page/2/?tab=comments#comment-1296476", "origin": "L-forum", "suborigin": "118408-advice-needed-on-75-mm-lens", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "jose, bottom line is that they are both great lens. i have owned both. i currently have the cron. the lux is heavy and the focus is a very long throw. while i really liked the lux i do not miss it. -----> i !!!  have to admit -----> i !!!  -----> made !!!  money on the lux when -----> i !!!  sold it.", "sortedWord": "None", "Identifyer": null, "identifyer": 31163, "year": "2010"}, {"autor": "Jose_Salcedo", "date": "2010-04-17 14:00:00", "content": "Jose, Bottom line is that they are both great lens. I have owned both. I currently have the cron. The lux is heavy and the focus is a very long throw. While I really liked the lux I do not miss it. I have to admit I made money on the lux when I sold it. Thank you very much for the advice, Bill. That is precisely my current inclination - go with the newest Cron - but I have been able to lower the price on the Lux significantly, dangerously close to the point where a \"no\" can be difficult to say... and the lens is really brand new. What the heck... I just sold some of my remaining Nikon stuff and life is so short that I may end up with both!... --img-- ", "link": "https://www.l-camera-forum.com/topic/118408-advice-needed-on-75-mm-lens/page/2/?tab=comments#comment-1296821", "origin": "L-forum", "suborigin": "118408-advice-needed-on-75-mm-lens", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "jose, bottom line is that they are both great lens. i have owned both. i currently have the cron. the lux is heavy and the focus is a very long throw. while i really liked the lux i do not miss it. -----> i !!!  have to admit -----> i !!!  -----> made !!!  money on the lux when -----> i !!!  sold it. thank you very much for the advice, bill. that is precisely my current inclination - go with the newest cron - but i have been able to lower the price on the lux significantly, dangerously close to the point where a \"no\" can be difficult to say... and the lens is really brand new. what the heck... i just sold some of my remaining nikon stuff and life is so short that i may end up with both!... --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 31172, "year": "2010"}, {"autor": "Jose_Salcedo", "date": "2010-04-17 18:55:00", "content": "i ment of course, \"see how YOU like the 75 lux\", ahaha.seriously, if you don't take the lux you could let me know, i'm not allowed to use my brothers lenses very often. he is older than me. i'm thirty five and a half, though, and responsible enough to own a 75 lux. what a weird post :-( Thanks for the suggestion, Neli! I will check the 75 Lux again tomorrow as I need to make a final decision by then. Will post what happens.", "link": "https://www.l-camera-forum.com/topic/118408-advice-needed-on-75-mm-lens/page/2/?tab=comments#comment-1297079", "origin": "L-forum", "suborigin": "118408-advice-needed-on-75-mm-lens", "result": true, "Selector": "i need to make", "selectorShort": "make", "MarkedSent": "i ment of course, \"see how you like the 75 lux\", ahaha.seriously, if you don't take the lux you could let me know, i'm not allowed to use my brothers lenses very often. he is older than me. i'm thirty five and a half, though, and responsible enough to own a 75 lux. what a weird post :-( thanks for the suggestion, neli! -----> i !!!  will check the 75 lux again tomorrow as -----> i !!!  -----> need !!!  -----> to !!!  -----> make !!!  a final decision by then. will post what happens.", "sortedWord": "None", "Identifyer": null, "identifyer": 31178, "year": "2010"}, {"autor": "Jose_Salcedo", "date": "2010-04-18 16:26:00", "content": "Congratulations Jose- You'll love this lens I predict. Make sure it's adjusted well for critical focus at 1.4, if not have it adjusted, and you'll soon see for yourself! (I did not have to adjust mine). best....Peter PS- Doug, no problem at all. Thanks Peter, I will make sure that the adjustment is correct for f/1.4 as you suggest. With the Leica plant nearby, that should be easy... --img-- ", "link": "https://www.l-camera-forum.com/topic/118408-advice-needed-on-75-mm-lens/page/3/?tab=comments#comment-1297805", "origin": "L-forum", "suborigin": "118408-advice-needed-on-75-mm-lens", "result": true, "Selector": "i will make", "selectorShort": "make", "MarkedSent": "congratulations jose- you'll love this lens i predict. make sure it's adjusted well for critical focus at 1.4, if not have it adjusted, and you'll soon see for yourself! (i did not have to adjust mine). best....peter ps- doug, no problem at all. thanks peter, -----> i !!!  -----> will !!!  -----> make !!!  sure that the adjustment is correct for f/1.4 as you suggest. with the leica plant nearby, that should be easy... --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 31189, "year": "2010"}, {"autor": "vintola", "date": "2010-04-03 18:59:00", "content": "OK. Thank You Noah and all others, who responded this question. It is rather expensive lens, so maybe I must make the decision after sleeping on it. - vintola -", "link": "https://www.l-camera-forum.com/topic/117204-ken-rockwell-on-summilux-2414/page/2/?tab=comments#comment-1282803", "origin": "L-forum", "suborigin": "117204-ken-rockwell-on-summilux-2414", "result": true, "Selector": "i must make", "selectorShort": "make", "MarkedSent": "ok. thank you noah and all others, who responded this question. it is rather expensive lens, so maybe -----> i !!!  -----> must !!!  -----> make !!!  the decision after sleeping on it. - vintola -", "sortedWord": "None", "Identifyer": null, "identifyer": 37498, "year": "2010"}, {"autor": "AlanJW", "date": "2010-10-02 22:17:00", "content": "Rockwell can write what he wants but there is nothing that says you must pay attention. I don't make decisions on what to buy from reviews like that which are essentially amateur. I do read with interest Sean Reid (very practical) and Puts (the ultimate in detail from interesting to incomprehensible), and Huff (entertaining and very unpompous). But I primarily look at what people are saying here - some very experienced and verybgood photographers. And look at images made with the lens - not test charts. Then I decide and then I see if there is enough money. I waited quite a while on the 24 Summilux, and have used it frequently anf my own opinioon is that it is superb.", "link": "https://www.l-camera-forum.com/topic/117204-ken-rockwell-on-summilux-2414/page/5/?tab=comments#comment-1459906", "origin": "L-forum", "suborigin": "117204-ken-rockwell-on-summilux-2414", "result": true, "Selector": "i don't make", "selectorShort": "make", "MarkedSent": "rockwell can write what he wants but there is nothing that says you must pay attention. -----> i !!!  -----> do !!! -----> n't !!!  -----> make !!!  decisions on what to buy from reviews like that which are essentially amateur. i do read with interest sean reid (very practical) and puts (the ultimate in detail from interesting to incomprehensible), and huff (entertaining and very unpompous). but i primarily look at what people are saying here - some very experienced and verybgood photographers. and look at images made with the lens - not test charts. then i decide and then i see if there is enough money. i waited quite a while on the 24 summilux, and have used it frequently anf my own opinioon is that it is superb.", "sortedWord": "None", "Identifyer": null, "identifyer": 37565, "year": "2010"}, {"autor": "wilfredo", "date": "2010-01-26 17:17:00", "content": "Wilfredo, so you get praise by default unless you ask for \"honest feedback\"? Is that it? If it were, wouldn't that rather imply that all that unanimous praise in the photo forums is fairly dishonest? And what kind of encouragement would that be? Manfred, I would also encourage you to start offering your own feedback on the photos you see. It's a way for the community to get to know you. I've made some very good friends on this forum. Cheers!", "link": "https://www.l-camera-forum.com/topic/305820-m8-photographs-post-them-here/page/9/?tab=comments#comment-1201876", "origin": "L-forum", "suborigin": "305820-m8-photographs-post-them-here", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "wilfredo, so you get praise by default unless you ask for \"honest feedback\"? is that it? if it were, wouldn't that rather imply that all that unanimous praise in the photo forums is fairly dishonest? and what kind of encouragement would that be? manfred, i would also encourage you to start offering your own feedback on the photos you see. it's a way for the community to get to know you. -----> i !!! 've -----> made !!!  some very good friends on this forum. cheers!", "sortedWord": "None", "Identifyer": null, "identifyer": 39940, "year": "2010"}, {"autor": "pklein", "date": "2010-10-15 18:10:00", "content": "The problem with all this is separating real danger from FUD (*). Real information from the manufacturer is impossible to obtain. They want us to buy their \"genuine\" Leica batteries, which cost a few dollars to make, at US $170 a pop. So they, like many manufacturers, will put in some vague warning about \"stuff we don't make can damage your equipment,\" or \"You need the special Gizmotroid we put in our batteries, lest it give your Summicroid a hemorrhoid.\" I have never heard of a Leica M8 or M9 being damaged by a third party battery, and I monitor several prominent Leica-oriented forums. The only trouble I've heard of with third-party batteries is the battery not working out-of-box (usually the 1400 mAh \"cheapies\" from Hong Kong), and the charge indicator showing the battery empty when it still works. The latter can be dealt with by simply using the battery until it's fully drained. Batteries heating up or exploding are usually caused by a direct short, and that would affect any battery, even one with a red dot. If a battery had leaked or exploded, damaging an M8, don't you think we would have heard of it by now, accompanied by a multi-screen flame war of epic proportions? --img--  --Peter (*) Fear, Uncertainty and Doubt--one of the primary psychological tools of advertising (and, heaven help us, political campaigns). Edited October 15, 2010 by pklein", "link": "https://www.l-camera-forum.com/topic/133135-i-think-i-found-a-good-m8-battery-alternative/?tab=comments#comment-1473035", "origin": "L-forum", "suborigin": "133135-i-think-i-found-a-good-m8-battery-alternative", "result": true, "Selector": "we don't make", "selectorShort": "make", "MarkedSent": "the problem with all this is separating real danger from fud (*). real information from the manufacturer is impossible to obtain. they want us to buy their \"genuine\" leica batteries, which cost a few dollars to make, at us $170 a pop. so they, like many manufacturers, will put in some vague warning about \"stuff -----> we !!!  -----> do !!! -----> n't !!!  -----> make !!!  can damage your equipment,\" or \"you need the special gizmotroid -----> we !!!  put in our batteries, lest it give your summicroid a hemorrhoid.\" i have never heard of a leica m8 or m9 being damaged by a third party battery, and i monitor several prominent leica-oriented forums. the only trouble i've heard of with third-party batteries is the battery not working out-of-box (usually the 1400 mah \"cheapies\" from hong kong), and the charge indicator showing the battery empty when it still works. the latter can be dealt with by simply using the battery until it's fully drained. batteries heating up or exploding are usually caused by a direct short, and that would affect any battery, even one with a red dot. if a battery had leaked or exploded, damaging an m8, don't you think we would have heard of it by now, accompanied by a multi-screen flame war of epic proportions? --img--  --peter (*) fear, uncertainty and doubt--one of the primary psychological tools of advertising (and, heaven help us, political campaigns). edited october 15, 2010 by pklein", "sortedWord": "None", "Identifyer": null, "identifyer": 44351, "year": "2010"}, {"autor": "Shootist", "date": "2010-10-18 12:32:00", "content": "The problem with all this is separating real danger from FUD (*). Real information from the manufacturer is impossible to obtain. They want us to buy their \"genuine\" Leica batteries, which cost a few dollars to make, at US $170 a pop. So they, like many manufacturers, will put in some vague warning about \"stuff we don't make can damage your equipment,\" or \"You need the special Gizmotroid we put in our batteries, lest it give your Summicroid a hemorrhoid.\" I have never heard of a Leica M8 or M9 being damaged by a third party battery, and I monitor several prominent Leica-oriented forums. The only trouble I've heard of with third-party batteries is the battery not working out-of-box (usually the 1400 mAh \"cheapies\" from Hong Kong), and the charge indicator showing the battery empty when it still works. The latter can be dealt with by simply using the battery until it's fully drained. Batteries heating up or exploding are usually caused by a direct short, and that would affect any battery, even one with a red dot. If a battery had leaked or exploded, damaging an M8, don't you think we would have heard of it by now, accompanied by a multi-screen flame war of epic proportions? --img--  --Peter (*) Fear, Uncertainty and Doubt--one of the primary psychological tools of advertising (and, heaven help us, political campaigns). To add to this I have 2 after market batteries that I use every now and then, just to use them, and have never had any problem with them except that I must drain them before recharging so the camera sees they are full. Other then that they give me the same number of shots and function just fine.", "link": "https://www.l-camera-forum.com/topic/133135-i-think-i-found-a-good-m8-battery-alternative/?tab=comments#comment-1475433", "origin": "L-forum", "suborigin": "133135-i-think-i-found-a-good-m8-battery-alternative", "result": true, "Selector": "we don't make", "selectorShort": "make", "MarkedSent": "the problem with all this is separating real danger from fud (*). real information from the manufacturer is impossible to obtain. they want us to buy their \"genuine\" leica batteries, which cost a few dollars to make, at us $170 a pop. so they, like many manufacturers, will put in some vague warning about \"stuff -----> we !!!  -----> do !!! -----> n't !!!  -----> make !!!  can damage your equipment,\" or \"you need the special gizmotroid -----> we !!!  put in our batteries, lest it give your summicroid a hemorrhoid.\" i have never heard of a leica m8 or m9 being damaged by a third party battery, and i monitor several prominent leica-oriented forums. the only trouble i've heard of with third-party batteries is the battery not working out-of-box (usually the 1400 mah \"cheapies\" from hong kong), and the charge indicator showing the battery empty when it still works. the latter can be dealt with by simply using the battery until it's fully drained. batteries heating up or exploding are usually caused by a direct short, and that would affect any battery, even one with a red dot. if a battery had leaked or exploded, damaging an m8, don't you think we would have heard of it by now, accompanied by a multi-screen flame war of epic proportions? --img--  --peter (*) fear, uncertainty and doubt--one of the primary psychological tools of advertising (and, heaven help us, political campaigns). to add to this i have 2 after market batteries that i use every now and then, just to use them, and have never had any problem with them except that i must drain them before recharging so the camera sees they are full. other then that they give me the same number of shots and function just fine.", "sortedWord": "None", "Identifyer": null, "identifyer": 44352, "year": "2010"}, {"autor": "wlaidlaw", "date": "2010-10-26 11:01:00", "content": "The problem with all this is separating real danger from FUD (*). Real information from the manufacturer is impossible to obtain. They want us to buy their \"genuine\" Leica batteries, which cost a few dollars to make, at US $170 a pop. So they, like many manufacturers, will put in some vague warning about \"stuff we don't make can damage your equipment,\" or \"You need the special Gizmotroid we put in our batteries, lest it give your Summicroid a hemorrhoid.\" I have never heard of a Leica M8 or M9 being damaged by a third party battery, and I monitor several prominent Leica-oriented forums. The only trouble I've heard of with third-party batteries is the battery not working out-of-box (usually the 1400 mAh \"cheapies\" from Hong Kong), and the charge indicator showing the battery empty when it still works. The latter can be dealt with by simply using the battery until it's fully drained. Batteries heating up or exploding are usually caused by a direct short, and that would affect any battery, even one with a red dot. If a battery had leaked or exploded, damaging an M8, don't you think we would have heard of it by now, accompanied by a multi-screen flame war of epic proportions? --img--  --Peter (*) Fear, Uncertainty and Doubt--one of the primary psychological tools of advertising (and, heaven help us, political campaigns). Peter, I have posted this before some years ago but I think it is appropriate to post it again here. I bought a rechargeable 2CR5 lithium battery kit, with external charger for an old Canon P&S that had been passed on to my son, where I was fed up with buying my son the quite expensive non-rechargeable 2CR5 batteries. It worked for about 6 cycles and then the battery self destructed inside the camera with lots of smoke. Amazingly, after we had scraped the melted remnants out of the battery compartment and inserted a regular non-rechargeable lithium battery in the camera, it still worked. However, that is not something that is likely to happen with the plastic surround on an M8 or M9 (the Canon's battery compartment was metal lined). I will never take the risk again of buying non-original-manufacturer batteries for any of our cameras. For what you save, the risk just does not add up, although I accept that in the years since this incident, lithium batteries may have become safer. Fake batteries are also an issue. I bought last year on Amazon marketplace, a Sony branded battery for my wife's TG3 video camera. It lasted about half as long as the original battery, even after a number of \"forming\" charges. It was somewhat cheap in comparison to other sellers. It turned out that Amazon had subsequently received a number of complaints on this seller and arranged a refund for me. Wilson", "link": "https://www.l-camera-forum.com/topic/133135-i-think-i-found-a-good-m8-battery-alternative/?tab=comments#comment-1483243", "origin": "L-forum", "suborigin": "133135-i-think-i-found-a-good-m8-battery-alternative", "result": true, "Selector": "we don't make", "selectorShort": "make", "MarkedSent": "the problem with all this is separating real danger from fud (*). real information from the manufacturer is impossible to obtain. they want us to buy their \"genuine\" leica batteries, which cost a few dollars to make, at us $170 a pop. so they, like many manufacturers, will put in some vague warning about \"stuff -----> we !!!  -----> do !!! -----> n't !!!  -----> make !!!  can damage your equipment,\" or \"you need the special gizmotroid -----> we !!!  put in our batteries, lest it give your summicroid a hemorrhoid.\" i have never heard of a leica m8 or m9 being damaged by a third party battery, and i monitor several prominent leica-oriented forums. the only trouble i've heard of with third-party batteries is the battery not working out-of-box (usually the 1400 mah \"cheapies\" from hong kong), and the charge indicator showing the battery empty when it still works. the latter can be dealt with by simply using the battery until it's fully drained. batteries heating up or exploding are usually caused by a direct short, and that would affect any battery, even one with a red dot. if a battery had leaked or exploded, damaging an m8, don't you think we would have heard of it by now, accompanied by a multi-screen flame war of epic proportions? --img--  --peter (*) fear, uncertainty and doubt--one of the primary psychological tools of advertising (and, heaven help us, political campaigns). peter, i have posted this before some years ago but i think it is appropriate to post it again here. i bought a rechargeable 2cr5 lithium battery kit, with external charger for an old canon p&s that had been passed on to my son, where i was fed up with buying my son the quite expensive non-rechargeable 2cr5 batteries. it worked for about 6 cycles and then the battery self destructed inside the camera with lots of smoke. amazingly, after we had scraped the melted remnants out of the battery compartment and inserted a regular non-rechargeable lithium battery in the camera, it still worked. however, that is not something that is likely to happen with the plastic surround on an m8 or m9 (the canon's battery compartment was metal lined). i will never take the risk again of buying non-original-manufacturer batteries for any of our cameras. for what you save, the risk just does not add up, although i accept that in the years since this incident, lithium batteries may have become safer. fake batteries are also an issue. i bought last year on amazon marketplace, a sony branded battery for my wife's tg3 video camera. it lasted about half as long as the original battery, even after a number of \"forming\" charges. it was somewhat cheap in comparison to other sellers. it turned out that amazon had subsequently received a number of complaints on this seller and arranged a refund for me. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 44353, "year": "2010"}, {"autor": "Knomad", "date": "2010-05-05 20:51:00", "content": "I've just made my first large prints from an M8... 17x22 inches, so not as large as what some other people have done... and I'm extremely favorably impressed. If anyone is going to be passing through Chicago over the summer, here's an opportunity to see firsthand: I'll have four prints on the wall, all of them about the same size, two from an M8, one from an M6, and one from a 6x6 cm negative. So a direct digital-35mm film-medium format film comparison, side by side. And in my opinion, at that size, the M8 does better than 35mm film, and as good as medium format film. The exhibit will be up from May 29 until mid-August, details are at Gallery Provocateur May 2010 Exhibition (note that the promo at the link and the actual exhibit contain tasteful nudity). Here are the details on the M8 prints, and for what it's worth I very carefully read the thread someone cited above before making the prints, and it was extremely helpful. The images began as DNG files, were converted to B&W in Photoshop CS3 while retaining all the color channel information, on a calibrated monitor, and were saved as 360ppi TIFs. Once the final print sizes were determined, the files were upsized in Alien Skin Blowup2, with actual image size approx 15x20 inches at 240 ppi (thus leaving a border for the mat). Minimal sharpening was applied in Blowup. Then the prints were made on archival fine art paper on an Epson 9800 at my friend's studio. As I said, I'm quite happy with them. They printed beautifully first try, with no further adjustment of the image required. I'm so happy with them that I'm going to be using the M8 a lot more and film a lot less for future exhibits. But I would not do that from a jpg, especially for B&W work. Edited May 5, 2010 by Knomad", "link": "https://www.l-camera-forum.com/topic/119957-largest-print-size-with-the-m8/?tab=comments#comment-1315672", "origin": "L-forum", "suborigin": "119957-largest-print-size-with-the-m8", "result": true, "Selector": "i've just made", "selectorShort": "make", "MarkedSent": "-----> i !!! 've -----> just !!!  -----> made !!!  my first large prints from an m8... 17x22 inches, so not as large as what some other people have done... and -----> i !!! 'm extremely favorably impressed. if anyone is going to be passing through chicago over the summer, here's an opportunity to see firsthand: i'll have four prints on the wall, all of them about the same size, two from an m8, one from an m6, and one from a 6x6 cm negative. so a direct digital-35mm film-medium format film comparison, side by side. and in my opinion, at that size, the m8 does better than 35mm film, and as good as medium format film. the exhibit will be up from may 29 until mid-august, details are at gallery provocateur may 2010 exhibition (note that the promo at the link and the actual exhibit contain tasteful nudity). here are the details on the m8 prints, and for what it's worth i very carefully read the thread someone cited above before making the prints, and it was extremely helpful. the images began as dng files, were converted to b&w in photoshop cs3 while retaining all the color channel information, on a calibrated monitor, and were saved as 360ppi tifs. once the final print sizes were determined, the files were upsized in alien skin blowup2, with actual image size approx 15x20 inches at 240 ppi (thus leaving a border for the mat). minimal sharpening was applied in blowup. then the prints were made on archival fine art paper on an epson 9800 at my friend's studio. as i said, i'm quite happy with them. they printed beautifully first try, with no further adjustment of the image required. i'm so happy with them that i'm going to be using the m8 a lot more and film a lot less for future exhibits. but i would not do that from a jpg, especially for b&w work. edited may 5, 2010 by knomad", "sortedWord": "None", "Identifyer": null, "identifyer": 44771, "year": "2010"}, {"autor": "MikeMyers", "date": "2010-03-16 04:33:00", "content": "I did get the \"black\" filter, but a couple of days later I left on a long trip to Asia. I had originally planned on taking the Leica, but finally decided that I had too many \"work\" type shots to do, and needed a DSLR for them. Anyway, I'm back as of a couple of days ago, and ready to get involved in IR again. I'm making another trip to India in a couple of months - I think I'll ignore the \"work\" stuff somewhat, and try to see what I can do with the M8 shooting IR.", "link": "https://www.l-camera-forum.com/topic/84753-getting-ektachrome-infrared-colors-out-of-the-m8/page/2/?tab=comments#comment-1261191", "origin": "L-forum", "suborigin": "84753-getting-ektachrome-infrared-colors-out-of-the-m8", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "i did get the \"black\" filter, but a couple of days later i left on a long trip to asia. i had originally planned on taking the leica, but finally decided that i had too many \"work\" type shots to do, and needed a dslr for them. anyway, i'm back as of a couple of days ago, and ready to get involved in ir again. -----> i !!! 'm -----> making !!!  another trip to india in a couple of months - -----> i !!!  think -----> i !!! 'll ignore the \"work\" stuff somewhat, and try to see what -----> i !!!  can do with the m8 shooting ir.", "sortedWord": "None", "Identifyer": null, "identifyer": 44902, "year": "2010"}, {"autor": "DwF", "date": "2010-12-05 17:08:00", "content": "Thanks Phancj I prefer to leave the tripod home myself. If hiking I might carry it or when I have been hired (I mainly do photography for fun). Years back, in Paris I made an exposure at dusk from atop the Arc using the railing to stabilize the camera (Konica Hexar). I was shooting XP2 and not only was this an easy negative to print (some of mine were nightmares) but you can see the irregularities of the pavement in streets below and it was sharp out to the burbs! .....okay, La Defence --img--  And the dynamic range of that negative was remarkable. So for me there is a nice feeling about getting a shot with a small camera and working with what you have. I will try underexposing as well...... I am usually thinking shadows, shadows, shadows. So I will bracket and see what I can do with an underexposed neg. In fact, I should have some of those in my files --img--  David", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/10/?tab=comments#comment-1522242", "origin": "L-forum", "suborigin": "127054-leica-x1-photos", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "thanks phancj i prefer to leave the tripod home myself. if hiking i might carry it or when i have been hired (i mainly do photography for fun). years back, in paris -----> i !!!  -----> made !!!  an exposure at dusk from atop the arc using the railing to stabilize the camera (konica hexar). i was shooting xp2 and not only was this an easy negative to print (some of mine were nightmares) but you can see the irregularities of the pavement in streets below and it was sharp out to the burbs! .....okay, la defence --img--  and the dynamic range of that negative was remarkable. so for me there is a nice feeling about getting a shot with a small camera and working with what you have. i will try underexposing as well...... i am usually thinking shadows, shadows, shadows. so i will bracket and see what i can do with an underexposed neg. in fact, i should have some of those in my files --img--  david", "sortedWord": "None", "Identifyer": null, "identifyer": 9774, "year": "2010"}, {"autor": "DwF", "date": "2010-12-06 00:22:00", "content": "Here is an image that I made this afternoon in the park. It was precarious as usual having my dog along off leash so he could get some excersie for my trouble. The exposure is hand-held f8 at 1/8th second ISO 100 and only some lightening and color temp adjustment...but not much. I may post one of these in the landscape section later. David --img-- ", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/10/?tab=comments#comment-1522632", "origin": "L-forum", "suborigin": "127054-leica-x1-photos", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "here is an image that -----> i !!!  -----> made !!!  this afternoon in the park. it was precarious as usual having my dog along off leash so he could get some excersie for my trouble. the exposure is hand-held f8 at 1/8th second iso 100 and only some lightening and color temp adjustment...but not much. i may post one of these in the landscape section later. david --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 9775, "year": "2010"}, {"autor": "phancj", "date": "2010-12-09 11:32:00", "content": "Thanks Phancj I prefer to leave the tripod home myself. If hiking I might carry it or when I have been hired (I mainly do photography for fun). Years back, in Paris I made an exposure at dusk from atop the Arc using the railing to stabilize the camera (Konica Hexar). I was shooting XP2 and not only was this an easy negative to print (some of mine were nightmares) but you can see the irregularities of the pavement in streets below and it was sharp out to the burbs! .....okay, La Defence --img--  And the dynamic range of that negative was remarkable. So for me there is a nice feeling about getting a shot with a small camera and working with what you have. I will try underexposing as well...... I am usually thinking shadows, shadows, shadows. So I will bracket and see what I can do with an underexposed neg. In fact, I should have some of those in my files --img--  David hey David, Just concluded a 3 day working trip, and in two places to boot, so very little shooting time. Apart from some (IMO) excellent portraits that came out of the X1, I did repeat my f/2.8 and iso 800 landscape night shots here's two to share. Again just some quick pushing of sliders in LR (under 5 minutes haha). Both were handheld, one at 1/30 the other 1/60. You must have rock steady hands coz for me to nail shots without shake 100% on the X1 I need 1/30 minimum but prefer 1/60. Anyway probably spoiled by VR. Again the shots are probably deemed banal, I shot whatever was there, one was in thailand at the chao phraya river, the other (very mixed and tricky lighting) Mahabodhi Temple in Bodhgaya. Comments welcome! CJ PS: HAving seen the posted photos I think there is fair bit of noise in sky of the temple shot...probably can rid of it in LR later when I have time but will leave it for now(still working haha) I think my standard f/2.8 iso 800 seems to work for me well most of the time in the dark. Just do not worry when you have crappy looking dark shots when reviewing in the LCD. --img-- --img--  Edited December 9, 2010 by phancj", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/11/?tab=comments#comment-1525963", "origin": "L-forum", "suborigin": "127054-leica-x1-photos", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "thanks phancj i prefer to leave the tripod home myself. if hiking i might carry it or when i have been hired (i mainly do photography for fun). years back, in paris -----> i !!!  -----> made !!!  an exposure at dusk from atop the arc using the railing to stabilize the camera (konica hexar). i was shooting xp2 and not only was this an easy negative to print (some of mine were nightmares) but you can see the irregularities of the pavement in streets below and it was sharp out to the burbs! .....okay, la defence --img--  and the dynamic range of that negative was remarkable. so for me there is a nice feeling about getting a shot with a small camera and working with what you have. i will try underexposing as well...... i am usually thinking shadows, shadows, shadows. so i will bracket and see what i can do with an underexposed neg. in fact, i should have some of those in my files --img--  david hey david, just concluded a 3 day working trip, and in two places to boot, so very little shooting time. apart from some (imo) excellent portraits that came out of the x1, i did repeat my f/2.8 and iso 800 landscape night shots here's two to share. again just some quick pushing of sliders in lr (under 5 minutes haha). both were handheld, one at 1/30 the other 1/60. you must have rock steady hands coz for me to nail shots without shake 100% on the x1 i need 1/30 minimum but prefer 1/60. anyway probably spoiled by vr. again the shots are probably deemed banal, i shot whatever was there, one was in thailand at the chao phraya river, the other (very mixed and tricky lighting) mahabodhi temple in bodhgaya. comments welcome! cj ps: having seen the posted photos i think there is fair bit of noise in sky of the temple shot...probably can rid of it in lr later when i have time but will leave it for now(still working haha) i think my standard f/2.8 iso 800 seems to work for me well most of the time in the dark. just do not worry when you have crappy looking dark shots when reviewing in the lcd. --img-- --img--  edited december 9, 2010 by phancj", "sortedWord": "None", "Identifyer": null, "identifyer": 9781, "year": "2010"}, {"autor": "stephen.w", "date": "2010-02-15 07:14:00", "content": "Over the weekend I looked at the 36mm VF made especially for the X1 and it is very clear and bright (and looks beautiful on the camera). In one sense it is a bargain, when one considers that external VFs made for the M series retail for over €500. Still, by all accounts, the Voigtländer is a very fine VF, also looks good, and is half the price. I haven't fully made up my mind yet, but I think that that is the one I'm going to buy.", "link": "https://www.l-camera-forum.com/topic/112325-voigtlander-or-leica-viewfinder/?tab=comments#comment-1226282", "origin": "L-forum", "suborigin": "112325-voigtlander-or-leica-viewfinder", "result": true, "Selector": "i haven't fully made", "selectorShort": "make", "MarkedSent": "over the weekend i looked at the 36mm vf made especially for the x1 and it is very clear and bright (and looks beautiful on the camera). in one sense it is a bargain, when one considers that external vfs made for the m series retail for over €500. still, by all accounts, the voigtländer is a very fine vf, also looks good, and is half the price. -----> i !!!  -----> have !!! -----> n't !!!  -----> fully !!!  -----> made !!!  up my mind yet, but -----> i !!!  think that that is the one -----> i !!! 'm going to buy.", "sortedWord": "None", "Identifyer": null, "identifyer": 11523, "year": "2010"}, {"autor": "grober", "date": "2010-03-22 14:00:00", "content": "I too shoot 95% of my shots without any flash. In fact, I made very sure an X1 user could absolutely disable its tiny, whimpy flash for most shooting before I placed an order for this impish but fascinating camera. (One absolutely denies the flash's firing by simply not deploying it from its recessed, stored position.) When I did use flash, I routinely used it in a studio setting where I was able to deploy a radio trigger on my M6, M7 or M8 cameras with one or more remote flashes obediently answering the radio signal from the camera. I chose not to use an optical slave because when others are also flashing away (i. e. weddings) I could not guarantee the timing of my remote flashes. A radio trigger was THE answer for me. When I can carve out some time I plan to insert my trusty radio trigger on the X1, select \"studio\" on the camera's flash menu and take some test shots. If this doesn't work satisfactorily, I determine the correct exposure with my flash meter and manually set the ISO, shutter speed and f-stop on the camera. The variety or brand of available electronic flash is of little concern to me (in the studio): if I can force it to a full manual firing position and can have a custom cable made to connect my radio receiver to it, I'm good to go. BTW: I have sold all my other M-gear; the X1 is my only remaining Leica. Thanks for alerting me to the \"Metz possibility.\" I had not know about this particular Metz unit before I read your post. -g Edited March 22, 2010 by grober", "link": "https://www.l-camera-forum.com/topic/115672-which-external-flash-for-the-x1/?tab=comments#comment-1268964", "origin": "L-forum", "suborigin": "115672-which-external-flash-for-the-x1", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i too shoot 95% of my shots without any flash. in fact, -----> i !!!  -----> made !!!  very sure an x1 user could absolutely disable its tiny, whimpy flash for most shooting before -----> i !!!  placed an order for this impish but fascinating camera. (one absolutely denies the flash's firing by simply not deploying it from its recessed, stored position.) when i did use flash, i routinely used it in a studio setting where i was able to deploy a radio trigger on my m6, m7 or m8 cameras with one or more remote flashes obediently answering the radio signal from the camera. i chose not to use an optical slave because when others are also flashing away (i. e. weddings) i could not guarantee the timing of my remote flashes. a radio trigger was the answer for me. when i can carve out some time i plan to insert my trusty radio trigger on the x1, select \"studio\" on the camera's flash menu and take some test shots. if this doesn't work satisfactorily, i determine the correct exposure with my flash meter and manually set the iso, shutter speed and f-stop on the camera. the variety or brand of available electronic flash is of little concern to me (in the studio): if i can force it to a full manual firing position and can have a custom cable made to connect my radio receiver to it, i'm good to go. btw: i have sold all my other m-gear; the x1 is my only remaining leica. thanks for alerting me to the \"metz possibility.\" i had not know about this particular metz unit before i read your post. -g edited march 22, 2010 by grober", "sortedWord": "None", "Identifyer": null, "identifyer": 14192, "year": "2010"}, {"autor": "JBA", "date": "2010-11-02 01:49:00", "content": "The R8 motor also rewinds the film so the leader remains out of the film casette. I always make sure to hand wind it all the way in before opening the camera or firing it again.", "link": "https://www.l-camera-forum.com/topic/45395-lets-see-your-r/page/13/?tab=comments#comment-1489484", "origin": "L-forum", "suborigin": "45395-lets-see-your-r", "result": true, "Selector": "i always make", "selectorShort": "make", "MarkedSent": "the r8 motor also rewinds the film so the leader remains out of the film casette. -----> i !!!  -----> always !!!  -----> make !!!  sure to hand wind it all the way in before opening the camera or firing it again.", "sortedWord": "None", "Identifyer": null, "identifyer": 23057, "year": "2010"}, {"autor": "tobey bilek", "date": "2010-11-06 13:20:00", "content": "CV adapters work well as do Leica. I have many of each. I have heard poorly made third party ones can damage the bayonet of the camera, therefore I never tried one. Glad you were sucessful.", "link": "https://www.l-camera-forum.com/topic/135979-advice-needed-to-remove-jammed-ltm-to-m-adapter/?tab=comments#comment-1494218", "origin": "L-forum", "suborigin": "135979-advice-needed-to-remove-jammed-ltm-to-m-adapter", "result": true, "Selector": "i have heard poorly made", "selectorShort": "make", "MarkedSent": "cv adapters work well as do leica. i have many of each. -----> i !!!  -----> have !!!  -----> heard !!!  -----> poorly !!!  -----> made !!!  third party ones can damage the bayonet of the camera, therefore -----> i !!!  never tried one. glad you were sucessful.", "sortedWord": "None", "Identifyer": null, "identifyer": 83555, "year": "2010"}, {"autor": "Manolo Laguillo", "date": "2010-02-23 19:56:00", "content": "This is a Billingham Hadley Pro. In it a M8 + 28 Elmarit Asph, WATE + Finder, 75 Summarit, 35 Summicron Asph. I made 2 pictures because the walls for the central department are sloped. I like this bag, but I would prefer it with less height. But then it would be perhaps a little out of proportion. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/113478-show-me-your-camera-bags/?tab=comments#comment-1236546", "origin": "L-forum", "suborigin": "113478-show-me-your-camera-bags", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "this is a billingham hadley pro. in it a m8 + 28 elmarit asph, wate + finder, 75 summarit, 35 summicron asph. -----> i !!!  -----> made !!!  2 pictures because the walls for the central department are sloped. i like this bag, but i would prefer it with less height. but then it would be perhaps a little out of proportion. --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 83829, "year": "2010"}, {"autor": "bocaburger", "date": "2010-08-07 14:27:00", "content": "My wife and I just did a round the world trip but we were only away for 3 months. In the end I decided to take my D3 with my Leica M8.2 since I wanted to take many night shots and also could take a longer zoom (plus I did not know if I could take a similar trip in the future). With my M8.2, I took the 24 lux, 50 lux and the WATE. With the D3, I took the 12-24, 24-70, 80-200. Hat's off to you friend. Carrying that much gear I wouldn't make it out the front door of my house. My perfect travel kit would be a Canon 5D, 20D (backup),20-35/3.5-4.5, 28-135-IS, 70-300-IS, 430EX flash,in a Lowepro Minitrekker w/ GItzo 1228 tripod + Arca B1 head strapped to the outside. All of it carried by an attractive 20 yr old co-ed whose rich father is paying for the entire trip so she can learn how I create photographic masterpieces. --img--  But then there's reality. I have 2 different setups depending on where I'm going. In European urban areas the emphasis is on shorter lenses, so it's an M8 with 12mm,15mm C/V, 28 Elmarit, and a 50 Summicron plus an SF24D flash. All in a Domke J5XB with a Leica table tripod with Leitz ballhead in my pocket. If I'm going to be shooting in less confined areas, it'll be the 15mm and 21mm C/V, 35 Summicron, and 90 Tele-Elmarit plus the SF24D and the smallest-series Gitzo carbon-fiber tripod with a small Kaiser ballhead in a separate sling bag. For short trips I've gone with just the M8, 15mm C/V, 28 Elmarit and the flash. The M8's file quality is good enough that at ISO 160 where I normally shoot, I can crop as much as a third of the image and blow it up full, so I don't feel restricted by not having a longer lens. Things like the charger, spare SD cards, Wolverine backup drive, DLux3 backup camera (when I get my $3500 used M9 in a few years, the M8 will be the backup), spare UV-IR filters, batteries etc are carried in a small Eagle Creek bag about the same size as the Domke, which stays in the hotel. In transit I carry both bags inside a Pacsafe Daysafe rucksack which is slashproof and has a cable lock I can fasten to something immovable in the hotel room if the room doesn't have a safe.", "link": "https://www.l-camera-forum.com/topic/104812-the-perfect-travel-kit/page/2/?tab=comments#comment-1399366", "origin": "L-forum", "suborigin": "104812-the-perfect-travel-kit", "result": true, "Selector": "i wouldn't make", "selectorShort": "make", "MarkedSent": "my wife and i just did a round the world trip but we were only away for 3 months. in the end i decided to take my d3 with my leica m8.2 since i wanted to take many night shots and also could take a longer zoom (plus i did not know if i could take a similar trip in the future). with my m8.2, i took the 24 lux, 50 lux and the wate. with the d3, i took the 12-24, 24-70, 80-200. hat's off to you friend. carrying that much gear -----> i !!!  -----> would !!! -----> n't !!!  -----> make !!!  it out the front door of my house. my perfect travel kit would be a canon 5d, 20d (backup),20-35/3.5-4.5, 28-135-is, 70-300-is, 430ex flash,in a lowepro minitrekker w/ gitzo 1228 tripod + arca b1 head strapped to the outside. all of it carried by an attractive 20 yr old co-ed whose rich father is paying for the entire trip so she can learn how i create photographic masterpieces. --img--  but then there's reality. i have 2 different setups depending on where i'm going. in european urban areas the emphasis is on shorter lenses, so it's an m8 with 12mm,15mm c/v, 28 elmarit, and a 50 summicron plus an sf24d flash. all in a domke j5xb with a leica table tripod with leitz ballhead in my pocket. if i'm going to be shooting in less confined areas, it'll be the 15mm and 21mm c/v, 35 summicron, and 90 tele-elmarit plus the sf24d and the smallest-series gitzo carbon-fiber tripod with a small kaiser ballhead in a separate sling bag. for short trips i've gone with just the m8, 15mm c/v, 28 elmarit and the flash. the m8's file quality is good enough that at iso 160 where i normally shoot, i can crop as much as a third of the image and blow it up full, so i don't feel restricted by not having a longer lens. things like the charger, spare sd cards, wolverine backup drive, dlux3 backup camera (when i get my $3500 used m9 in a few years, the m8 will be the backup), spare uv-ir filters, batteries etc are carried in a small eagle creek bag about the same size as the domke, which stays in the hotel. in transit i carry both bags inside a pacsafe daysafe rucksack which is slashproof and has a cable lock i can fasten to something immovable in the hotel room if the room doesn't have a safe.", "sortedWord": "None", "Identifyer": null, "identifyer": 86913, "year": "2010"}, {"autor": "Arif", "date": "2010-08-08 10:44:00", "content": "Hat's off to you friend. Carrying that much gear I wouldn't make it out the front door of my house. My perfect travel kit would be a Canon 5D, 20D (backup),20-35/3.5-4.5, 28-135-IS, 70-300-IS, 430EX flash,in a Lowepro Minitrekker w/ GItzo 1228 tripod + Arca B1 head strapped to the outside. All of it carried by an attractive 20 yr old co-ed whose rich father is paying for the entire trip so she can learn how I create photographic masterpieces. --img--  But then there's reality. I have 2 different setups depending on where I'm going. In European urban areas the emphasis is on shorter lenses, so it's an M8 with 12mm,15mm C/V, 28 Elmarit, and a 50 Summicron plus an SF24D flash. All in a Domke J5XB with a Leica table tripod with Leitz ballhead in my pocket. If I'm going to be shooting in less confined areas, it'll be the 15mm and 21mm C/V, 35 Summicron, and 90 Tele-Elmarit plus the SF24D and the smallest-series Gitzo carbon-fiber tripod with a small Kaiser ballhead in a separate sling bag. For short trips I've gone with just the M8, 15mm C/V, 28 Elmarit and the flash. The M8's file quality is good enough that at ISO 160 where I normally shoot, I can crop as much as a third of the image and blow it up full, so I don't feel restricted by not having a longer lens. Things like the charger, spare SD cards, Wolverine backup drive, DLux3 backup camera (when I get my $3500 used M9 in a few years, the M8 will be the backup), spare UV-IR filters, batteries etc are carried in a small Eagle Creek bag about the same size as the Domke, which stays in the hotel. In transit I carry both bags inside a Pacsafe Daysafe rucksack which is slashproof and has a cable lock I can fasten to something immovable in the hotel room if the room doesn't have a safe. At least we have the mini-trekker and the Pacsafe in common. Actually it was really not bad at all since I could leave whatever I did not want to take with me at the time in the hotel. Riding donkeys in Petra, and photographing Las Brisas del Titicacas night shows in Lima do require different equipment.", "link": "https://www.l-camera-forum.com/topic/104812-the-perfect-travel-kit/page/2/?tab=comments#comment-1400032", "origin": "L-forum", "suborigin": "104812-the-perfect-travel-kit", "result": true, "Selector": "i wouldn't make", "selectorShort": "make", "MarkedSent": "hat's off to you friend. carrying that much gear -----> i !!!  -----> would !!! -----> n't !!!  -----> make !!!  it out the front door of my house. my perfect travel kit would be a canon 5d, 20d (backup),20-35/3.5-4.5, 28-135-is, 70-300-is, 430ex flash,in a lowepro minitrekker w/ gitzo 1228 tripod + arca b1 head strapped to the outside. all of it carried by an attractive 20 yr old co-ed whose rich father is paying for the entire trip so she can learn how i create photographic masterpieces. --img--  but then there's reality. i have 2 different setups depending on where i'm going. in european urban areas the emphasis is on shorter lenses, so it's an m8 with 12mm,15mm c/v, 28 elmarit, and a 50 summicron plus an sf24d flash. all in a domke j5xb with a leica table tripod with leitz ballhead in my pocket. if i'm going to be shooting in less confined areas, it'll be the 15mm and 21mm c/v, 35 summicron, and 90 tele-elmarit plus the sf24d and the smallest-series gitzo carbon-fiber tripod with a small kaiser ballhead in a separate sling bag. for short trips i've gone with just the m8, 15mm c/v, 28 elmarit and the flash. the m8's file quality is good enough that at iso 160 where i normally shoot, i can crop as much as a third of the image and blow it up full, so i don't feel restricted by not having a longer lens. things like the charger, spare sd cards, wolverine backup drive, dlux3 backup camera (when i get my $3500 used m9 in a few years, the m8 will be the backup), spare uv-ir filters, batteries etc are carried in a small eagle creek bag about the same size as the domke, which stays in the hotel. in transit i carry both bags inside a pacsafe daysafe rucksack which is slashproof and has a cable lock i can fasten to something immovable in the hotel room if the room doesn't have a safe. at least we have the mini-trekker and the pacsafe in common. actually it was really not bad at all since i could leave whatever i did not want to take with me at the time in the hotel. riding donkeys in petra, and photographing las brisas del titicacas night shows in lima do require different equipment.", "sortedWord": "None", "Identifyer": null, "identifyer": 86920, "year": "2010"}, {"autor": "chris_tribble", "date": "2010-10-20 18:49:00", "content": "That is a good recommendation, but if you don't have the coin for this, Domke is putting out an absolutely fantastic bag for a rangefinder setup. It is the F-803. Couldn't agree more. I made up an adapted inner pocket to take lenses - bodies slip down on either side - plenty enough protection. If you're happy to stack lenses (which I am) you can get 2 M bodies with lenses attached + 4 other lenses in the bag + WATE finder / hoods + caps + WhiBal card in front pockets + cards and batteries in the flap pocket. TOTALLY practical during a shoot. The Leica 21 and the Zeiss 18 have to fight for their place. The Zeiss is winning at the moment... I use this bag all the time for local shoots. When I'm travelling I cut down on the kit but keep the same bag. Win, win. Evidence below.--img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/104812-the-perfect-travel-kit/page/9/?tab=comments#comment-1478007", "origin": "L-forum", "suborigin": "104812-the-perfect-travel-kit", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "that is a good recommendation, but if you don't have the coin for this, domke is putting out an absolutely fantastic bag for a rangefinder setup. it is the f-803. couldn't agree more. -----> i !!!  -----> made !!!  up an adapted inner pocket to take lenses - bodies slip down on either side - plenty enough protection. if you're happy to stack lenses (which i am) you can get 2 m bodies with lenses attached + 4 other lenses in the bag + wate finder / hoods + caps + whibal card in front pockets + cards and batteries in the flap pocket. totally practical during a shoot. the leica 21 and the zeiss 18 have to fight for their place. the zeiss is winning at the moment... i use this bag all the time for local shoots. when i'm travelling i cut down on the kit but keep the same bag. win, win. evidence below.--img-- --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 87047, "year": "2010"}, {"autor": "kcg", "date": "2010-02-21 15:36:00", "content": "Saving your original on a SD card is similiar to what I do. Only I use a recordable DVD. My originals are stored on the DVD and copies are stored on external HD. Since I only shoot raw, I also make jpg copies that are stored on another hard drive within a photo data base program ( I happen to like ACDsee photomanager). Backups of the photomanager program are also stored on an external HD. Works for me. Keywords within the photo manager allow me to quickly find out where a particular photo is stored. Photos that are lost can never be recovered if you do not have backup. This is true whether you are a professional, or just a father taking pictures of your family or vacations. You can never have too much backup. Edited February 21, 2010 by kcg", "link": "https://www.l-camera-forum.com/topic/113258-sd-cards-as-backup/?tab=comments#comment-1233619", "origin": "L-forum", "suborigin": "113258-sd-cards-as-backup", "result": true, "Selector": "i also make", "selectorShort": "make", "MarkedSent": "saving your original on a sd card is similiar to what i do. only i use a recordable dvd. my originals are stored on the dvd and copies are stored on external hd. since -----> i !!!  only shoot raw, -----> i !!!  -----> also !!!  -----> make !!!  jpg copies that are stored on another hard drive within a photo data base program ( -----> i !!!  happen to like acdsee photomanager). backups of the photomanager program are also stored on an external hd. works for me. keywords within the photo manager allow me to quickly find out where a particular photo is stored. photos that are lost can never be recovered if you do not have backup. this is true whether you are a professional, or just a father taking pictures of your family or vacations. you can never have too much backup. edited february 21, 2010 by kcg", "sortedWord": "None", "Identifyer": null, "identifyer": 94159, "year": "2010"}, {"autor": "MPerson", "date": "2010-01-01 07:09:00", "content": "I hadn't seen Paolo's work for years forgot about him altogether........ he's a story teller like .:: Jindřich Štreit ::. Letizia Battaglia is the real thing Portraying the mafia - we make money not art Thanks for those Imants. Jindřich Štreit hits the spot! I am currently immersed in the films of Béla Tarr - was given the boxed set recently - beautiful B&W imagery.", "link": "https://www.l-camera-forum.com/topic/96948-inspirational-photographers-bw/page/6/?tab=comments#comment-1170356", "origin": "L-forum", "suborigin": "96948-inspirational-photographers-bw", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "i hadn't seen paolo's work for years forgot about him altogether........ he's a story teller like .:: jindřich štreit ::. letizia battaglia is the real thing portraying the mafia - -----> we !!!  -----> make !!!  money not art thanks for those imants. jindřich štreit hits the spot! i am currently immersed in the films of béla tarr - was given the boxed set recently - beautiful b&w imagery.", "sortedWord": "None", "Identifyer": null, "identifyer": 97003, "year": "2010"}, {"autor": "JBA", "date": "2010-11-02 02:19:00", "content": "The one complaint I have about the R8 with motor is that it's a pain to load. I make sure the sprocket teeth are engaged in the perforations, but it seems to be very finicky about how the film is positioned, and it always takes me several tries and a bit of cussing before the camera back will close and the motor winds the film on.", "link": "https://www.l-camera-forum.com/topic/45395-lets-see-your-r/page/13/?tab=comments#comment-1489496", "origin": "L-forum", "suborigin": "45395-lets-see-your-r", "result": false, "Selector": "i make", "selectorShort": "make", "MarkedSent": "i make sure the sprocket teeth are engaged in the perforations, but it seems to be very finicky about how the -----> film !!!  is positioned, and it always takes me several tries and a bit of cussing before the camera back will close and the motor winds the -----> film !!!  on.", "sortedWord": "film", "Identifyer": null, "identifyer": 23059, "year": "2010"}], "name": "Leicasortedout2010make"}