{"interestingcomments": [{"autor": "Erik Gunst Lund", "date": "2013-03-06 08:12:00", "content": "Range finder calibration is not a DIY job for amateurs. You need some highly special tools, jigs etc. to do the job correct according to the design tolerances. Yes some people tinker with their range finder in their cameras, but they have very little control over the end result. You will quickly see this when you learn how complex the range finder in an Leica M is and learn about how fine these tolerances are. Remember that also the lenses must/can be calibrated... Use search here on this site or Google to learn more, but don't expect to be able to do this on your own...", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/9/?tab=comments#comment-2262343", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "range finder calibration is not a -----> diy !!!  job for amateurs. you need some highly special tools, jigs etc. to do the job correct according to the design tolerances. yes some people tinker with their range finder in their cameras, but they have very little control over the end result. you will quickly see this when you learn how complex the range finder in an leica m is and learn about how fine these tolerances are. remember that also the lenses must/can be calibrated... use search here on this site or google to learn more, but don't expect to be able to do this on your own...", "sortedWord": "None", "Identifyer": null, "identifyer": 30822, "year": "2013"}, {"autor": "steven91", "date": "2013-01-21 04:08:00", "content": "The 12526 hood does not fit on the Summicron 40/2 normally. How do you manage to attach it if i may ask? you can grind/sand down the outside diameter of a step ring (series 5.5 to 39mm)The outside diameter must be 42mm to make 'all' 35mm and 50mm hods fit like also 12585. ^Yup, exactly how it was done. Followed the how to/DIY guide posted here: A Hood Solution for the 40mm Summicron", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/11/?tab=comments#comment-2220417", "origin": "L-forum", "suborigin": "160294-still-loving-the-m8", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "the 12526 hood does not fit on the summicron 40/2 normally. how do you manage to attach it if i may ask? you can grind/sand down the outside diameter of a step ring (series 5.5 to 39mm)the outside diameter must be 42mm to make 'all' 35mm and 50mm hods fit like also 12585. ^yup, exactly how it was done. followed the how to/-----> diy !!!  guide posted here: a hood solution for the 40mm summicron", "sortedWord": "None", "Identifyer": null, "identifyer": 42854, "year": "2013"}, {"autor": "luigi bertolotti", "date": "2013-12-17 21:37:00", "content": "I have never seen such a thing and doubt one has ever been made (at least, as a standard commercial product) : in theory, there is \"space\" to do it... Viso II/II on M has a flange distance of 68,8mm... Hasselblad is 74,9 (and Pentax 67 even more) ; you could insert in the middle a well engineered adapter with shift facility and accomodate a Planar 80... even a Distagon 50 or 40... lenses that, if I remember correctly, do not have glass protruding over their back flange (which isn't true, I think, for some lenses for bellows-based MF systems like Mamiya 67) ; a challenging exercise to do for a good DIY mechanic... --img--  with some gymnick, one could add even a (limited) tilting capability, maybe (probably, in a range of +- 5° or so... no much more) Lenses for 6x6 6x7 have a coverage sufficient to allow a decent shift, keeping the coverage of 24x36... computation is simple...and even more lenses for LF... --img--  ) could be adapted. Edited December 17, 2013 by luigi bertolotti", "link": "https://www.l-camera-forum.com/topic/218595-visoflex-and-medium-format-lenses/?tab=comments#comment-2489444", "origin": "L-forum", "suborigin": "218595-visoflex-and-medium-format-lenses", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i have never seen such a thing and doubt one has ever been made (at least, as a standard commercial product) : in theory, there is \"space\" to do it... viso ii/ii on m has a flange distance of 68,8mm... hasselblad is 74,9 (and pentax 67 even more) ; you could insert in the middle a well engineered adapter with shift facility and accomodate a planar 80... even a distagon 50 or 40... lenses that, if i remember correctly, do not have glass protruding over their back flange (which isn't true, i think, for some lenses for bellows-based mf systems like mamiya 67) ; a challenging exercise to do for a good -----> diy !!!  mechanic... --img--  with some gymnick, one could add even a (limited) tilting capability, maybe (probably, in a range of +- 5° or so... no much more) lenses for 6x6 6x7 have a coverage sufficient to allow a decent shift, keeping the coverage of 24x36... computation is simple...and even more lenses for lf... --img--  ) could be adapted. edited december 17, 2013 by luigi bertolotti", "sortedWord": "None", "Identifyer": null, "identifyer": 89764, "year": "2013"}], "name": "Leicasortedout2013diy"}