{"interestingcomments": [{"autor": "dpattinson", "date": "2009-12-16 16:33:00", "content": " Yes, that could be the same as my problem #1. So, is this the one Leica has promised a firmware fix for? I can't really see anything in your first image that looks as bad as what I see in my unprocessed jpeg or dng. In my case the entire bottom 10% of the image ended up significantly lighter than the rest of it. I don't pay any attention to what people say Leica has promised fixes for, since they never release fix notes of any value - and they never publish any list of known issues... I haven't even bothered to report this new issue - because I'm quite sure the response will be that it's all very surprising and I should send my camera in for 3 months and get it back with a note that says 'sensor replacement' or the like... sorry if that comes off as a bit pissy... but I develop software for a living and I think I know what industry best practice looks like in terms of handling defect reports and fixes. Edited December 16, 2009 by dpattinson", "link": "https://www.l-camera-forum.com/topic/106851-m8m9-high-iso-banding-questions/?tab=comments#comment-1153339", "origin": "L-forum", "suborigin": "106851-m8m9-high-iso-banding-questions", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": " yes, that could be the same as my problem #1. so, is this the one leica has promised a firmware fix for? i can't really see anything in your first image that looks as bad as what i see in my unprocessed jpeg or dng. in my case the entire bottom 10% of the image ended up significantly lighter than the rest of it. i don't pay any attention to what people say leica has promised fixes for, since they never release fix notes of any value - and they never publish any list of known issues... -----> i !!!  haven't even bothered to report this new issue - because -----> i !!! 'm quite sure the response will be that it's all very surprising and -----> i !!!  should send my camera in for 3 months and get it back with a note that says 'sensor replacement' or the like... sorry if that comes off as a bit pissy... but -----> i !!!  -----> develop !!!  software for a living and i think i know what industry best practice looks like in terms of handling defect reports and fixes. edited december 16, 2009 by dpattinson", "sortedWord": "None", "Identifyer": null, "identifyer": 47307, "year": "2009"}], "name": "Leicasortedout2009develop"}