{"interestingcomments": [{"autor": "NB23", "date": "2015-01-30 17:52:00", "content": "I have been retouching for 21 years, 20 years of that commercially. I started photoshop when there were no layers and no undo's. Phase One themselves admit that their CMOS sensor is not quite up to the standard of the CCD sensor, but they have done an exceptionally good job of making the most of it's colour, which outperforms other CMOS offerings and what the standard has been. They have a product which is a very good compromise and gives the added benefit of high ISO and proper Live View for those customers that were demanding it. It's not just the colour of images with CCD but the tonal separation, the colour differentiation, and the dynamics and inter-relationship of these properties through a wide range of adjustment and in all tonal zones. For a company like Leica, and the seeming majority of their customers who do not recognise or perhaps perceive the difference, they are most likely happier with the better battery life and faster operation, the live view and motion that CMOS sensors provide over CCD. Motion, and it's increased revenue is the biggest factor, it's here to stay. I'm not saying that CMOS will forever be inferior, I'm not saying that the results from CMOS are bad either, I'm saying that for the time being, CCD has properties which I prefer and find more desirable for what I do. Let's not mix chips with foie gras, please. What is Leica about and what is Phase One about? One is all about snapshots, portability, simplicity, ease of use. The orher is all about the end PRINT. One is about hand holdability. The other is about the Best possible tripod. One is about the smallest bag. The other is about the Biggest possible studio. One is about a 24x36 sensor. The other one is about a 3 times bigger sensor. Would you see me handholding a Phase One camera set at iso 400 and shooting pics of my kid eating his pudding at the window in low light? That would be insane. Would you see me shooting a car for poster ads and all kinds of other publications with a Leica M9 wide open at iso 200? That would be insane. Design the M9 or M10 (M240?) so it cannot be handholdable, make it big, make it a studio beast, make it a resolution King, make it a tripod Homer, make it slow, make it cumbersome, make it 40,000$ and without video, then naturally it should have a ccd. The leica M9 is just not into that game. Thank God.", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/7/?tab=comments#comment-2756040", "origin": "L-forum", "suborigin": "240288-400-leica-photographers-agree-we-love-ccd", "result": true, "Selector": "design", "selectorShort": "design", "MarkedSent": "i have been retouching for 21 years, 20 years of that commercially. i started photoshop when there were no layers and no undo's. phase one themselves admit that their cmos sensor is not quite up to the standard of the ccd sensor, but they have done an exceptionally good job of making the most of it's colour, which outperforms other cmos offerings and what the standard has been. they have a product which is a very good compromise and gives the added benefit of high iso and proper live view for those customers that were demanding it. it's not just the colour of images with ccd but the tonal separation, the colour differentiation, and the dynamics and inter-relationship of these properties through a wide range of adjustment and in all tonal zones. for a company like leica, and the seeming majority of their customers who do not recognise or perhaps perceive the difference, they are most likely happier with the better battery life and faster operation, the live view and motion that cmos sensors provide over ccd. motion, and it's increased revenue is the biggest factor, it's here to stay. i'm not saying that cmos will forever be inferior, i'm not saying that the results from cmos are bad either, i'm saying that for the time being, ccd has properties which i prefer and find more desirable for what i do. let's not mix chips with foie gras, please. what is leica about and what is phase one about? one is all about snapshots, portability, simplicity, ease of use. the orher is all about the end print. one is about hand holdability. the other is about the best possible tripod. one is about the smallest bag. the other is about the biggest possible studio. one is about a 24x36 sensor. the other one is about a 3 times bigger sensor. would you see me handholding a phase one camera set at iso 400 and shooting pics of my kid eating his pudding at the window in low light? that would be insane. would you see me shooting a car for poster ads and all kinds of other publications with a leica m9 wide open at iso 200? that would be insane. -----> design !!!  the m9 or m10 (m240?) so it cannot be handholdable, make it big, make it a studio beast, make it a resolution king, make it a tripod homer, make it slow, make it cumbersome, make it 40,000$ and without video, then naturally it should have a ccd. the leica m9 is just not into that game. thank god.", "sortedWord": "None", "Identifyer": null, "identifyer": 39403, "year": "2015"}, {"autor": "adan", "date": "2015-05-28 03:19:00", "content": "Five: - (v.1) symmetrical 28 Elmarit 1965-1972 (low distortion). Rear element comes very close to the shutter/film/sensor plane. Will damage the metering arms of M5/CL cameras unless it has a modified mount to keep the metering arm in its well (no metering). Will not damage post-1978 cameras, but will block metering light path in M6/7/digital cameras**, so requires hand-held or estimated light metering on those. 48mm filters. Will produce some color stains around the edges on full-color digital Ms (a la the also-deep 21mm Super-Angulons). Now mostly a minor collectors' item. ** except M240's \"advanced\" off-the-sensor metering. - (v.2) first retrofocus 28 Elmarit 1972-1979. Designed to have a long back focus distance and allow safe ttl metering with the M5 and any subsequent cameras - 48mm filters. First Leitz attempt at a retrofocus design for the M cameras - and it shows. Not the sharpest Leica 28, especially in the corners. - (v.3) 1979 redesign to improve optical performance over v.2. Rather large and long (designed when 28s required external viewfinders, and internal viewfinder blockage was irrelevant) - 49mm filters. Canadian design, and most built in Canada. Contemporary with the 21mm Elmarit. - (v.4) 1993 Solms redesign to reduce size once more (46mm filters, and much shorter) and avoid finder blockage with M4-P et seq. cameras containing built-in 28 framelines. Increased contrast and improved corner performance. - (v.5) 2006 ASPH version, much smaller yet (39mm filters). Introduced partly to be a compact \"37mm\" medium-wideangle on the cropped M8 digital, substituting for the compact 35mm Summicron lenses on film. Solms design.", "link": "https://www.l-camera-forum.com/topic/245582-elmarit-2828-versions/?tab=comments#comment-2823171", "origin": "L-forum", "suborigin": "245582-elmarit-2828-versions", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "five: - (v.1) symmetrical 28 elmarit 1965-1972 (low distortion). rear element comes very close to the shutter/film/sensor plane. will damage the metering arms of m5/cl cameras unless it has a modified mount to keep the metering arm in its well (no metering). will not damage post-1978 cameras, but will block metering light path in m6/7/digital cameras**, so requires hand-held or estimated light metering on those. 48mm filters. will produce some color stains around the edges on full-color digital ms (a la the also-deep 21mm super-angulons). now mostly a minor collectors' item. ** except m240's \"advanced\" off-the-sensor metering. - (v.2) first retrofocus 28 elmarit 1972-1979. -----> designed !!!  to have a long back focus distance and allow safe ttl metering with the m5 and any subsequent cameras - 48mm filters. first leitz attempt at a retrofocus design for the m cameras - and it shows. not the sharpest leica 28, especially in the corners. - (v.3) 1979 redesign to improve optical performance over v.2. rather large and long (designed when 28s required external viewfinders, and internal viewfinder blockage was irrelevant) - 49mm filters. canadian design, and most built in canada. contemporary with the 21mm elmarit. - (v.4) 1993 solms redesign to reduce size once more (46mm filters, and much shorter) and avoid finder blockage with m4-p et seq. cameras containing built-in 28 framelines. increased contrast and improved corner performance. - (v.5) 2006 asph version, much smaller yet (39mm filters). introduced partly to be a compact \"37mm\" medium-wideangle on the cropped m8 digital, substituting for the compact 35mm summicron lenses on film. solms design.", "sortedWord": "None", "Identifyer": null, "identifyer": 21572, "year": "2015"}], "name": "Leicasortedout2015design"}