{"interestingcomments": [{"autor": "adan", "date": "2020-01-04 18:02:00", "content": "10 hours ago, Travis Hill said: is it supposed to stay in or out? It should stay OUT (the roller almost sticking out of the camera front), under pressure from an internal camera spring. The spring is what forces the roller to maintain contact with the lens' moving focus cam. In theory, that spring itself can fail - but gummed-up lubricants in the mechanism are far, far more likely to cause a jam or sticking than a broken spring. ****Uh-oh!**** In examining my own M10 to confirm exactly how the lever works - I just noticed that the tip of the RF arm is catching or rubbing intermittently on the lens mount ring as the spring forces it forward. The screw and brass washer on the top of the roller-cam axle (above the arm itself) just barely clear the mount even when normal, but mine has/had even less clearance. --img--  Mostly it is just a brief contact that the spring overrides, but a couple of times it stuck hard for a moment (this would also cause the RF image to stop moving part-way through the normal range). I cleared this problem by applying a little downward pressure on the arm with a tiny screw-driver tip - but I don't recommend that as a procedure. There comes a point where uninformed or sloppy DIY work on the Leica RF just becomes a can of tangled worms that only Leica can untangle. I just happen to be a lucky risk-taker. Like the gospel song says, \"The fingerbone's connected to the - handbone; the handbone's connected to the - wristbone; the wristbone's connected to the - arm bone.....\" This is a word of warning for those of us who have tried to adjust our own RF for infinity focus - be really careful not to apply ANY upward pressure on the roller and arm when inserting or turning the 2mm hex (Allen) wrench!! You can bend or introduce enough play in the arm's vertical location to cause such sticking. No doubt I made this mistake at some point. Edited January 4, 2020 by adan", "link": "https://www.l-camera-forum.com/topic/293403-m10-sticky-rangefinder-coupling/?tab=comments#comment-3885009", "origin": "L-forum", "suborigin": "293403-m10-sticky-rangefinder-coupling", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "10 hours ago, travis hill said: is it supposed to stay in or out? it should stay out (the roller almost sticking out of the camera front), under pressure from an internal camera spring. the spring is what forces the roller to maintain contact with the lens' moving focus cam. in theory, that spring itself can fail - but gummed-up lubricants in the mechanism are far, far more likely to cause a jam or sticking than a broken spring. ****uh-oh!**** in examining my own m10 to confirm exactly how the lever works - i just noticed that the tip of the rf arm is catching or rubbing intermittently on the lens mount ring as the spring forces it forward. the screw and brass washer on the top of the roller-cam axle (above the arm itself) just barely clear the mount even when normal, but mine has/had even less clearance. --img--  mostly it is just a brief contact that the spring overrides, but a couple of times it stuck hard for a moment (this would also cause the rf image to stop moving part-way through the normal range). i cleared this problem by applying a little downward pressure on the arm with a tiny screw-driver tip - but i don't recommend that as a procedure. there comes a point where uninformed or sloppy -----> diy !!!  work on the leica rf just becomes a can of tangled worms that only leica can untangle. i just happen to be a lucky risk-taker. like the gospel song says, \"the fingerbone's connected to the - handbone; the handbone's connected to the - wristbone; the wristbone's connected to the - arm bone.....\" this is a word of warning for those of us who have tried to adjust our own rf for infinity focus - be really careful not to apply any upward pressure on the roller and arm when inserting or turning the 2mm hex (allen) wrench!! you can bend or introduce enough play in the arm's vertical location to cause such sticking. no doubt i made this mistake at some point. edited january 4, 2020 by adan", "sortedWord": "None", "Identifyer": null, "identifyer": 416, "year": "2020"}, {"autor": "antonioxrosa", "date": "2020-05-11 13:37:00", "content": "14 hours ago, LBJ2 said: Hello. What brand is the mini tripod? Is the brown case attached to the camera bag for the tripod? FotoPro and yes the case is the one attached to the bag. The way it is attached is a DIY.", "link": "https://www.l-camera-forum.com/topic/309018-whats-in-your-leica-m10-camera-bag/page/3/?tab=comments#comment-3971272", "origin": "L-forum", "suborigin": "309018-whats-in-your-leica-m10-camera-bag", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "14 hours ago, lbj2 said: hello. what brand is the mini tripod? is the brown case attached to the camera bag for the tripod? fotopro and yes the case is the one attached to the bag. the way it is attached is a -----> diy !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 2326, "year": "2020"}, {"autor": "AndreasG", "date": "2020-03-12 11:12:00", "content": "As a Leica M user for more than 30 years I know this challenge very well, whichever bag you buy or use, it never is perfect..... So I decided to adapt a bag for my purpose - the bag should be small, of reasonable quality and inconspicuous - no expensive looking leather bag or any famous logo. I decided for the tamrac Apache 2.2, which is a rather small bag, inside dimensions 22x16x8.5cm or 8.5x6x3.5in, but it keeps two M bodies (M10-D, M6) and two additional lenses plus all the accessories like batteries, film, memory cards etc. And, this bag is not very expensive, it is made of solid waxed canvas and is fast and easy to open/close with the buckle. For optimal use of the limited space I built an insert, made of 2mm stiff cardboard, medium soft foam material, stripes of fabric and felt and plenty of glue. Time it took is approx. 3hrs., average DIY knowledge is sufficient. Though it doesn't look perfect, please ignore the lint and glue residues, it fulfills my expectations very well, just see the photos. --img--  --img--  --img--  --img--  --img--  Edited March 12, 2020 by AndreasG", "link": "https://www.l-camera-forum.com/topic/307354-camera-bag-again-and-again/?tab=comments#comment-3929835", "origin": "L-forum", "suborigin": "307354-camera-bag-again-and-again", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "as a leica m user for more than 30 years i know this challenge very well, whichever bag you buy or use, it never is perfect..... so i decided to adapt a bag for my purpose - the bag should be small, of reasonable quality and inconspicuous - no expensive looking leather bag or any famous logo. i decided for the tamrac apache 2.2, which is a rather small bag, inside dimensions 22x16x8.5cm or 8.5x6x3.5in, but it keeps two m bodies (m10-d, m6) and two additional lenses plus all the accessories like batteries, film, memory cards etc. and, this bag is not very expensive, it is made of solid waxed canvas and is fast and easy to open/close with the buckle. for optimal use of the limited space i built an insert, made of 2mm stiff cardboard, medium soft foam material, stripes of fabric and felt and plenty of glue. time it took is approx. 3hrs., average -----> diy !!!  knowledge is sufficient. though it doesn't look perfect, please ignore the lint and glue residues, it fulfills my expectations very well, just see the photos. --img--  --img--  --img--  --img--  --img--  edited march 12, 2020 by andreasg", "sortedWord": "None", "Identifyer": null, "identifyer": 2960, "year": "2020"}, {"autor": "jaapv", "date": "2020-11-25 17:54:00", "content": "50$? For a 5-minute procedure that anybody can do DIY? Quick and easy money, I say. if needed I clean my sensor in the field...", "link": "https://www.l-camera-forum.com/topic/315480-how-to-remove-sensor-dust-from-a-m10-sensor/page/2/?tab=comments#comment-4087080", "origin": "L-forum", "suborigin": "315480-how-to-remove-sensor-dust-from-a-m10-sensor", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "50$? for a 5-minute procedure that anybody can do -----> diy !!! ? quick and easy money, i say. if needed i clean my sensor in the field...", "sortedWord": "None", "Identifyer": null, "identifyer": 11578, "year": "2020"}, {"autor": "astrostl", "date": "2020-11-25 18:31:00", "content": "36 minutes ago, jaapv said: 50$? For a 5-minute procedure that anybody can do DIY? Quick and easy money, I say. if needed I clean my sensor in the field... I received a similar quote from a local shop when I first encountered dust and was nervous about approaching it myself. It was enough incentive to invest in a few tools and to watch a few videos on how to do it, and I'm so very glad that I did.", "link": "https://www.l-camera-forum.com/topic/315480-how-to-remove-sensor-dust-from-a-m10-sensor/page/2/?tab=comments#comment-4087093", "origin": "L-forum", "suborigin": "315480-how-to-remove-sensor-dust-from-a-m10-sensor", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "36 minutes ago, jaapv said: 50$? for a 5-minute procedure that anybody can do -----> diy !!! ? quick and easy money, i say. if needed i clean my sensor in the field... i received a similar quote from a local shop when i first encountered dust and was nervous about approaching it myself. it was enough incentive to invest in a few tools and to watch a few videos on how to do it, and i'm so very glad that i did.", "sortedWord": "None", "Identifyer": null, "identifyer": 11580, "year": "2020"}, {"autor": "thgbrian", "date": "2020-01-09 05:26:00", "content": "Thank you all for the replies. Guess this isn't any sort of DIY fix. Has anyone else experienced this issue? I read one or two threads and they said they just knocked the dial and it worked lol.", "link": "https://www.l-camera-forum.com/topic/305090-m240-shutter-speed-dial-misaligned/?tab=comments#comment-3887909", "origin": "L-forum", "suborigin": "305090-m240-shutter-speed-dial-misaligned", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "thank you all for the replies. guess this isn't any sort of -----> diy !!!  fix. has anyone else experienced this issue? i read one or two threads and they said they just knocked the dial and it worked lol.", "sortedWord": "None", "Identifyer": null, "identifyer": 15367, "year": "2020"}, {"autor": "easy_action", "date": "2020-12-29 23:25:00", "content": " Was just typing the same as above. My first thought was not diy, but if you can bear to be separated send it back to Leica. There are many ways in which it can go wrong if you try it yourself. And the vibrations, swarf and oil etc. are unlikely to do your camera much good.", "link": "https://www.l-camera-forum.com/topic/316437-broken-screw-at-the-tripod-thread/page/2/?tab=comments#comment-4108396", "origin": "L-forum", "suborigin": "316437-broken-screw-at-the-tripod-thread", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " was just typing the same as above. my first thought was not -----> diy !!! , but if you can bear to be separated send it back to leica. there are many ways in which it can go wrong if you try it yourself. and the vibrations, swarf and oil etc. are unlikely to do your camera much good.", "sortedWord": "None", "Identifyer": null, "identifyer": 15941, "year": "2020"}, {"autor": "jaapv", "date": "2020-07-27 00:35:00", "content": "23 hours ago, WurzelbertAngenervt said: Hi guys! I am wondering about the shock resistance of this camera. Why?... I like to do a lot of sports, especially mountainbiking. I´d like to have a camera with me, that would not have me thinking about whether I should ride the stumpy trail or not, because of the fear that it could damage the camera or may have the rangefinder to be re-adjusted. Does someone have experience with that, or would you recommend another camera for that use? Maybe a little compact one with a big sensor? The M240 (and M10) are more shock-resistant than previous models, due to an improved rangefinder mechanism. I would be surprised to see an M240 knocked out of kilter by anything less than an impact that would leave some other brands a collection of nuts,bolts and shards of plastic. Even older M cameras were pretty bomb-proof, although a really hard slam on the bottom plate could shift the vertical RF adjustment, as could really strong vibration - this was the improvement on the 240, making the shift near-impossible. Even though re-adjustment is no more than a ten-minute DIY job.", "link": "https://www.l-camera-forum.com/topic/311708-m240-shock-resistance/?tab=comments#comment-4016332", "origin": "L-forum", "suborigin": "311708-m240-shock-resistance", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "23 hours ago, wurzelbertangenervt said: hi guys! i am wondering about the shock resistance of this camera. why?... i like to do a lot of sports, especially mountainbiking. i´d like to have a camera with me, that would not have me thinking about whether i should ride the stumpy trail or not, because of the fear that it could damage the camera or may have the rangefinder to be re-adjusted. does someone have experience with that, or would you recommend another camera for that use? maybe a little compact one with a big sensor? the m240 (and m10) are more shock-resistant than previous models, due to an improved rangefinder mechanism. i would be surprised to see an m240 knocked out of kilter by anything less than an impact that would leave some other brands a collection of nuts,bolts and shards of plastic. even older m cameras were pretty bomb-proof, although a really hard slam on the bottom plate could shift the vertical rf adjustment, as could really strong vibration - this was the improvement on the 240, making the shift near-impossible. even though re-adjustment is no more than a ten-minute -----> diy !!!  job.", "sortedWord": "None", "Identifyer": null, "identifyer": 16813, "year": "2020"}, {"autor": "Einst_Stein", "date": "2020-05-22 19:12:00", "content": " 10 hours ago, chasdfg said: For every camera I purchase I have one spare battery, maybe two spares if the battery life is notoriously poor (think early sony MILCs). What I've learnt is that two healthy batteries stored properly and used evenly in rotation is better than a stockpile of 4 or 5 (or more) batteries which are unused. I've purchased cameras used with up to 6 batteries \"free\", but the extra batteries count for nothing if they are all dead. I shot my M240 rather heavily for almost 5 years and two batteries served me fine (over 30-40k frames?) with no discernible drop in battery life. Anyway, the camera will likely die before the original two batteries (one with the camera and spare) truly go kaput, if the batteries maintained through the lifetime (rotated for use, stored properly, not dropped). Now Leica product cycles are 4 to 5 years, so at the tail end of those cycles you may wish to pick up another couple of batteries lest the new model uses a newer battery type. I do recall camera companies generally extending serviceability of a camera 5 to 10 years after the camera is discontinued (depending on manufacturer), in which case even if a new model is released with new batteries, the older model's batteries should continue to be sold until the camera is no longer serviceable. If the new model uses the same batteries, then you're in luck. Now I myself have overthought this. Basically 2 batteries for me. Another 1 or 2 every 5 years if I stick with that camera. The moderator JAAP posted in this thread saying all batteries are made of battery cells (and control circuits), and it's possible to buy the cell and replace them DIY. Better yet, it may be possible to buy the most up to date technology (remember the battery memory in the old technology?). I have not found the source of replace/refill cell yet, but that would be a good choice. Perhaps solve the problem once and forever.", "link": "https://www.l-camera-forum.com/topic/307515-how-many-spared-batteries/page/2/?tab=comments#comment-3978506", "origin": "L-forum", "suborigin": "307515-how-many-spared-batteries", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " 10 hours ago, chasdfg said: for every camera i purchase i have one spare battery, maybe two spares if the battery life is notoriously poor (think early sony milcs). what i've learnt is that two healthy batteries stored properly and used evenly in rotation is better than a stockpile of 4 or 5 (or more) batteries which are unused. i've purchased cameras used with up to 6 batteries \"free\", but the extra batteries count for nothing if they are all dead. i shot my m240 rather heavily for almost 5 years and two batteries served me fine (over 30-40k frames?) with no discernible drop in battery life. anyway, the camera will likely die before the original two batteries (one with the camera and spare) truly go kaput, if the batteries maintained through the lifetime (rotated for use, stored properly, not dropped). now leica product cycles are 4 to 5 years, so at the tail end of those cycles you may wish to pick up another couple of batteries lest the new model uses a newer battery type. i do recall camera companies generally extending serviceability of a camera 5 to 10 years after the camera is discontinued (depending on manufacturer), in which case even if a new model is released with new batteries, the older model's batteries should continue to be sold until the camera is no longer serviceable. if the new model uses the same batteries, then you're in luck. now i myself have overthought this. basically 2 batteries for me. another 1 or 2 every 5 years if i stick with that camera. the moderator jaap posted in this thread saying all batteries are made of battery cells (and control circuits), and it's possible to buy the cell and replace them -----> diy !!! . better yet, it may be possible to buy the most up to date technology (remember the battery memory in the old technology?). i have not found the source of replace/refill cell yet, but that would be a good choice. perhaps solve the problem once and forever.", "sortedWord": "None", "Identifyer": null, "identifyer": 17310, "year": "2020"}, {"autor": "chasdfg", "date": "2020-05-23 02:56:00", "content": "7 hours ago, Einst_Stein said: The moderator JAAP posted in this thread saying all batteries are made of battery cells (and control circuits), and it's possible to buy the cell and replace them DIY. Better yet, it may be possible to buy the most up to date technology (remember the battery memory in the old technology?). I have not found the source of replace/refill cell yet, but that would be a good choice. Perhaps solve the problem once and forever. Sounds like a lot of trouble for a $100 battery. I explored swapping batteries out of my electric toothbrush, but swapping cells out of a camera battery...I'd say its safer to buy a used one (of which you do not know the provenance i.e. may have been dropped or charged improperly) than to muck about like that and brick a camera. It isn't impossible and it may be a simple job if you know what you're doing but most of us don't in this respect. In any case if you do find out where Varta Indonesia gets the cells and circuits of this battery and decide to embark on this project I'd follow with interest..", "link": "https://www.l-camera-forum.com/topic/307515-how-many-spared-batteries/page/2/?tab=comments#comment-3978649", "origin": "L-forum", "suborigin": "307515-how-many-spared-batteries", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "7 hours ago, einst_stein said: the moderator jaap posted in this thread saying all batteries are made of battery cells (and control circuits), and it's possible to buy the cell and replace them -----> diy !!! . better yet, it may be possible to buy the most up to date technology (remember the battery memory in the old technology?). i have not found the source of replace/refill cell yet, but that would be a good choice. perhaps solve the problem once and forever. sounds like a lot of trouble for a $100 battery. i explored swapping batteries out of my electric toothbrush, but swapping cells out of a camera battery...i'd say its safer to buy a used one (of which you do not know the provenance i.e. may have been dropped or charged improperly) than to muck about like that and brick a camera. it isn't impossible and it may be a simple job if you know what you're doing but most of us don't in this respect. in any case if you do find out where varta indonesia gets the cells and circuits of this battery and decide to embark on this project i'd follow with interest..", "sortedWord": "None", "Identifyer": null, "identifyer": 17314, "year": "2020"}, {"autor": "davidrc", "date": "2020-03-01 08:17:00", "content": "9 hours ago, Stealth3kpl said: What power are you looking for? Ffordes seem to have a few used eyepieces +1,+2,+3 @£45, a -2 and +1.5 @ £49, and a +1 @ £39 at present. I guess the expense comes from Leica being a bit niche and the desire for dioptres being a bit more nicherer (😅). Heck, they're not even available through aftermarket suppliers as far as I know which would suggest the Leica pricing is pretty reasonable. Pete Ffords @ £39 are for R cameras..... As for prices....they are not exactly hard to manufacture and a “reasonable” price would be a good reward to buyers who are paying a lot out in the first place where a high cost is probably warranted, as the quality of bodies and lenses is superior and the results bear that out. I wonder what buyers in Germany or HK or the USA are paying for new diopters? I bet they are not equivalent UK prices!! Remember, the M system relies on the viewer being able to see the rangefinder accurately, and I can well see that a high proportion of users do need some form of correction. Which will need changing in time, perhaps several times. I don’t think it’s THAT much of a niche required accessory.....more a case of Leica milking it. I can focus well, slowly though as it is sometimes. Putting a spare hasselblad diopter disc over greatly improves the speed. I recommend anyone who is finding M focussing slow to try one via your local opticians. You maybe surprised. A DIY made use of that spare disc is well on the cards as something could be done. Also, a question.....doesn’t the screwed in diopter restrict seeing the edges of the field of view? Leica do need to take care over “biting the hand that feeds them”. Service at any price is not endearing PR quality. Not all Leica users have wallets like bottomless pits.", "link": "https://www.l-camera-forum.com/topic/306958-m-diaopters/?tab=comments#comment-3922375", "origin": "L-forum", "suborigin": "306958-m-diaopters", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "9 hours ago, stealth3kpl said: what power are you looking for? ffordes seem to have a few used eyepieces +1,+2,+3 @£45, a -2 and +1.5 @ £49, and a +1 @ £39 at present. i guess the expense comes from leica being a bit niche and the desire for dioptres being a bit more nicherer (😅). heck, they're not even available through aftermarket suppliers as far as i know which would suggest the leica pricing is pretty reasonable. pete ffords @ £39 are for r cameras..... as for prices....they are not exactly hard to manufacture and a “reasonable” price would be a good reward to buyers who are paying a lot out in the first place where a high cost is probably warranted, as the quality of bodies and lenses is superior and the results bear that out. i wonder what buyers in germany or hk or the usa are paying for new diopters? i bet they are not equivalent uk prices!! remember, the m system relies on the viewer being able to see the rangefinder accurately, and i can well see that a high proportion of users do need some form of correction. which will need changing in time, perhaps several times. i don’t think it’s that much of a niche required accessory.....more a case of leica milking it. i can focus well, slowly though as it is sometimes. putting a spare hasselblad diopter disc over greatly improves the speed. i recommend anyone who is finding m focussing slow to try one via your local opticians. you maybe surprised. a -----> diy !!!  made use of that spare disc is well on the cards as something could be done. also, a question.....doesn’t the screwed in diopter restrict seeing the edges of the field of view? leica do need to take care over “biting the hand that feeds them”. service at any price is not endearing pr quality. not all leica users have wallets like bottomless pits.", "sortedWord": "None", "Identifyer": null, "identifyer": 17529, "year": "2020"}, {"autor": "arichter", "date": "2020-02-14 17:41:00", "content": "Just before this thread started I sent my Leica M262 to Leica NJ for tune up and sensor cleaning. They confirmed the camera received 2/3, the next day they sent me an estimate which included \"adjust range finder\". Today, 2/14 they are shipping the camera back to me. Just my experience. To _Michael: While we are having this discussion you could have your camera already professionally serviced. Of course there is nothing wrong with trying to learn how to DIY something if you like.", "link": "https://www.l-camera-forum.com/topic/306146-southern-california-options-for-rffocus-adjustment/page/2/?tab=comments#comment-3912913", "origin": "L-forum", "suborigin": "306146-southern-california-options-for-rffocus-adjustment", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "just before this thread started i sent my leica m262 to leica nj for tune up and sensor cleaning. they confirmed the camera received 2/3, the next day they sent me an estimate which included \"adjust range finder\". today, 2/14 they are shipping the camera back to me. just my experience. to _michael: while we are having this discussion you could have your camera already professionally serviced. of course there is nothing wrong with trying to learn how to -----> diy !!!  something if you like.", "sortedWord": "None", "Identifyer": null, "identifyer": 18130, "year": "2020"}, {"autor": "Good To Be Retired", "date": "2020-02-15 15:08:00", "content": "21 hours ago, arichter said: Just before this thread started I sent my Leica M262 to Leica NJ for tune up and sensor cleaning. They confirmed the camera received 2/3, the next day they sent me an estimate which included \"adjust range finder\". Today, 2/14 they are shipping the camera back to me. Just my experience. To _Michael: While we are having this discussion you could have your camera already professionally serviced. Of course there is nothing wrong with trying to learn how to DIY something if you like. Thanx for posting this. I didn't send mine because they were not nearly as accommodating in their time frame when I inquired directly, citing a 6 week turnaround. If you don't mind saying, what was the cost of the service ? --img--  Edited February 15, 2020 by Good To Be Retired", "link": "https://www.l-camera-forum.com/topic/306146-southern-california-options-for-rffocus-adjustment/page/2/?tab=comments#comment-3913321", "origin": "L-forum", "suborigin": "306146-southern-california-options-for-rffocus-adjustment", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "21 hours ago, arichter said: just before this thread started i sent my leica m262 to leica nj for tune up and sensor cleaning. they confirmed the camera received 2/3, the next day they sent me an estimate which included \"adjust range finder\". today, 2/14 they are shipping the camera back to me. just my experience. to _michael: while we are having this discussion you could have your camera already professionally serviced. of course there is nothing wrong with trying to learn how to -----> diy !!!  something if you like. thanx for posting this. i didn't send mine because they were not nearly as accommodating in their time frame when i inquired directly, citing a 6 week turnaround. if you don't mind saying, what was the cost of the service ? --img--  edited february 15, 2020 by good to be retired", "sortedWord": "None", "Identifyer": null, "identifyer": 18131, "year": "2020"}, {"autor": "jwillyf", "date": "2020-12-24 16:18:00", "content": " I have a Type 246 and have noticed that the aperture metadata is not matching that on the lens. Generally the metadata is recording aperture as 1 stop higher than the lens setting. For example f4 on the lens is recorded as f4.8 on the metadata, and f11 as f13. In the menu, lens recognition is set to automatic. This is on a coded Summicron 50 mm f2 serial no 2331077. I was thinking of DIY coding a Voigtlander Ultron 35 mm f1.7 and an Elmarit 90 mm f2.8. Any ideas on the discrepancies on the Summicron. Thanks", "link": "https://www.l-camera-forum.com/topic/316385-aperture-metadata-not-matching-lens-setting/?tab=comments#comment-4105195", "origin": "L-forum", "suborigin": "316385-aperture-metadata-not-matching-lens-setting", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " i have a type 246 and have noticed that the aperture metadata is not matching that on the lens. generally the metadata is recording aperture as 1 stop higher than the lens setting. for example f4 on the lens is recorded as f4.8 on the metadata, and f11 as f13. in the menu, lens recognition is set to automatic. this is on a coded summicron 50 mm f2 serial no 2331077. i was thinking of -----> diy !!!  coding a voigtlander ultron 35 mm f1.7 and an elmarit 90 mm f2.8. any ideas on the discrepancies on the summicron. thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 24417, "year": "2020"}, {"autor": "jaapv", "date": "2020-09-14 08:10:00", "content": " Leather reattachment should not be any problem. Even if the camera returns with a flaw in that department -the original leather is normally not re-used-, recovering the camera is a simple DIY project, using the leather from a number of reputed suppliers. One of them is http://www.cameraleather.com/ Personally I would request the camera be returned uncovered and apply the leather of my own choice.", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/5/?tab=comments#comment-4045578", "origin": "L-forum", "suborigin": "313260-sensor-corrosion-analysis-and-fix-merged", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " leather reattachment should not be any problem. even if the camera returns with a flaw in that department -the original leather is normally not re-used-, recovering the camera is a simple -----> diy !!!  project, using the leather from a number of reputed suppliers. one of them is http://www.cameraleather.com/ personally i would request the camera be returned uncovered and apply the leather of my own choice.", "sortedWord": "None", "Identifyer": null, "identifyer": 30221, "year": "2020"}, {"autor": "vwillrocku", "date": "2020-05-15 15:17:00", "content": "Thanks a lot for the tips. I will try to DIY and wish I could fix the focusing issue.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/14/?tab=comments#comment-3973939", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "thanks a lot for the tips. i will try to -----> diy !!!  and wish i could fix the focusing issue.", "sortedWord": "None", "Identifyer": null, "identifyer": 30920, "year": "2020"}, {"autor": "EdricBF", "date": "2020-06-12 19:16:00", "content": "My pretty new M9 fell about 2ft to the floor and its RF settings suffered (not as much as myself, for that matter...), both vertical and horizontal. I pondered the few (and expensive) pro options I have here in South America and decided to follow this wonderful thread (and links) suggestions for DIY alignment. I was afraid about pivots, arms etc. but I came across this: \"fixing lateral rangefinder misalignment is, most of the time, simply adjusting the roller for infinite and everything falls in place...\", or something like that. Using the 2mm wrench, it only took a few very small torsions applied to the roller's hex screw in both directions to have my 50 and 90 Summicrons aligning the images at infinite again. Taking pictures of objects at different distances at f/2 showed that the infinite adjustment was all my camera needed for other distances. No back or front focus so far, at least with those lenses. I was afraid I could screw up something, but it was very direct and simple, actually. I decided no to go to the vertical alignment at this time, since it is very small. Cheers", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/14/?tab=comments#comment-3992238", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my pretty new m9 fell about 2ft to the floor and its rf settings suffered (not as much as myself, for that matter...), both vertical and horizontal. i pondered the few (and expensive) pro options i have here in south america and decided to follow this wonderful thread (and links) suggestions for -----> diy !!!  alignment. i was afraid about pivots, arms etc. but i came across this: \"fixing lateral rangefinder misalignment is, most of the time, simply adjusting the roller for infinite and everything falls in place...\", or something like that. using the 2mm wrench, it only took a few very small torsions applied to the roller's hex screw in both directions to have my 50 and 90 summicrons aligning the images at infinite again. taking pictures of objects at different distances at f/2 showed that the infinite adjustment was all my camera needed for other distances. no back or front focus so far, at least with those lenses. i was afraid i could screw up something, but it was very direct and simple, actually. i decided no to go to the vertical alignment at this time, since it is very small. cheers", "sortedWord": "None", "Identifyer": null, "identifyer": 30921, "year": "2020"}, {"autor": "jaapv", "date": "2020-10-21 19:27:00", "content": " Not quite - that is when infinity is the only thing off. Which, admittedly is the most common problem, and a 5 minute DIY. However, there are cases that a whole system needs calibration, including the lenses.", "link": "https://www.l-camera-forum.com/topic/314394-rangefinder-calibration-cost-in-uk/?tab=comments#comment-4066383", "origin": "L-forum", "suborigin": "314394-rangefinder-calibration-cost-in-uk", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " not quite - that is when infinity is the only thing off. which, admittedly is the most common problem, and a 5 minute -----> diy !!! . however, there are cases that a whole system needs calibration, including the lenses.", "sortedWord": "None", "Identifyer": null, "identifyer": 32221, "year": "2020"}, {"autor": "Ko.Fe.", "date": "2020-08-12 20:58:00", "content": "1 hour ago, rivi1969 said: Ko.Fe. If there is a guy who can transform a film M3 into a full-frame digital at his basement, I bet camera manufacturers could do that too. However won't be cost-effective for them. Imagine if you buy one body and every 5 years you buy the new module? Won't be good business, they need to sell you the sensor and everything else too. M3 with A7 sensor it is well documented DIY conversion. Only parts are needed to be purchased. Just like modification of bicycles. Old 10-speed could be converted to fixie under low budget or new bike could be build on five thousands dollars frame set. Profit calculation is not as simple as \"lets sell no IBIS, no dust reduction 8K USD cameras because we can\". It works for boutique market. Broader market could be taken with customers willing to pay for upgrades and flexibility. More customers is better than few, IMO. Leica has it in its history. Upgrading I, II series to III. It was profitable back then.", "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/page/3/?tab=comments#comment-4026133", "origin": "L-forum", "suborigin": "312105-leica-discontinues-ccd-m9-and-variants-sensor-production", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "1 hour ago, rivi1969 said: ko.fe. if there is a guy who can transform a film m3 into a full-frame digital at his basement, i bet camera manufacturers could do that too. however won't be cost-effective for them. imagine if you buy one body and every 5 years you buy the new module? won't be good business, they need to sell you the sensor and everything else too. m3 with a7 sensor it is well documented -----> diy !!!  conversion. only parts are needed to be purchased. just like modification of bicycles. old 10-speed could be converted to fixie under low budget or new bike could be build on five thousands dollars frame set. profit calculation is not as simple as \"lets sell no ibis, no dust reduction 8k usd cameras because we can\". it works for boutique market. broader market could be taken with customers willing to pay for upgrades and flexibility. more customers is better than few, imo. leica has it in its history. upgrading i, ii series to iii. it was profitable back then.", "sortedWord": "None", "Identifyer": null, "identifyer": 32862, "year": "2020"}, {"autor": "analog-digital", "date": "2020-08-30 15:40:00", "content": "Am 12.8.2020 um 22:58 schrieb Ko.Fe.: M3 with A7 sensor it is well documented DIY conversion. And what's the point of it? 🙄", "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/page/5/?tab=comments#comment-4036354", "origin": "L-forum", "suborigin": "312105-leica-discontinues-ccd-m9-and-variants-sensor-production", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "am 12.8.2020 um 22:58 schrieb ko.fe.: m3 with a7 sensor it is well documented -----> diy !!!  conversion. and what's the point of it? 🙄", "sortedWord": "None", "Identifyer": null, "identifyer": 32907, "year": "2020"}, {"autor": "pgk", "date": "2020-04-15 15:48:00", "content": "17 minutes ago, Shameetman said: Or is it possible to order those separate and diy? I doubt it if for no other reason than because it involves some desoldering and resoldering of the hotshot connections which I suspect Leica would consider beyond DIY.", "link": "https://www.l-camera-forum.com/topic/308568-m9-still-going-strong/?tab=comments#comment-3954374", "origin": "L-forum", "suborigin": "308568-m9-still-going-strong", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "17 minutes ago, shameetman said: or is it possible to order those separate and -----> diy !!! ? i doubt it if for no other reason than because it involves some desoldering and resoldering of the hotshot connections which i suspect leica would consider beyond diy.", "sortedWord": "None", "Identifyer": null, "identifyer": 33785, "year": "2020"}, {"autor": "Ko.Fe.", "date": "2020-02-20 17:31:00", "content": "43 minutes ago, rivi1969 said: An M9 makes sense when you want more organic and film-like images. If you want images with a modern digital look who might pass as Nikon Z7s or any other modern camera, then the M10 makes more sense. I think, M9 sensor gives no noise on low ISO. But all CMOS sensors do. This is the next to only difference I see. Colors and film is subjective. M9 reminds me my E6 DIY develop and scans. Limited DR under bright light. Not something I like... Here is another film picture with M4-2 on Kodak Ultramax 400: --img--  And here is M-E ISO 2500 picture: --img-- ", "link": "https://www.l-camera-forum.com/topic/303794-does-m9-make-sense-for-an-m10-owner/page/2/?tab=comments#comment-3916455", "origin": "L-forum", "suborigin": "303794-does-m9-make-sense-for-an-m10-owner", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "43 minutes ago, rivi1969 said: an m9 makes sense when you want more organic and film-like images. if you want images with a modern digital look who might pass as nikon z7s or any other modern camera, then the m10 makes more sense. i think, m9 sensor gives no noise on low iso. but all cmos sensors do. this is the next to only difference i see. colors and film is subjective. m9 reminds me my e6 -----> diy !!!  develop and scans. limited dr under bright light. not something i like... here is another film picture with m4-2 on kodak ultramax 400: --img--  and here is m-e iso 2500 picture: --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 34068, "year": "2020"}, {"autor": "rivi1969", "date": "2020-02-21 20:23:00", "content": "On 2/20/2020 at 11:31 AM, Ko.Fe. said: I think, M9 sensor gives no noise on low ISO. But all CMOS sensors do. This is the next to only difference I see. Colors and film is subjective. M9 reminds me my E6 DIY develop and scans. Limited DR under bright light. Not something I like... Here is another film picture with M4-2 on Kodak Ultramax 400: --img--  And here is M-E ISO 2500 picture: --img--  Love the output.", "link": "https://www.l-camera-forum.com/topic/303794-does-m9-make-sense-for-an-m10-owner/page/2/?tab=comments#comment-3917201", "origin": "L-forum", "suborigin": "303794-does-m9-make-sense-for-an-m10-owner", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "on 2/20/2020 at 11:31 am, ko.fe. said: i think, m9 sensor gives no noise on low iso. but all cmos sensors do. this is the next to only difference i see. colors and film is subjective. m9 reminds me my e6 -----> diy !!!  develop and scans. limited dr under bright light. not something i like... here is another film picture with m4-2 on kodak ultramax 400: --img--  and here is m-e iso 2500 picture: --img--  love the output.", "sortedWord": "None", "Identifyer": null, "identifyer": 34074, "year": "2020"}, {"autor": "Gavbo", "date": "2020-04-15 07:20:00", "content": " Recently acquired an m8.2, the last owner did a DIY job of 'brassing' on the top casing with sandpaper (he told me). Any polishing experts out there with advice on where I can improve its appearance. I am thinking of a rotary multi-tool but I have no idea which will be the best attachment to use. Ideally I would like to bring back the shine rather adding more brassing. Any help would be appreciated. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/308565-polishing-scratches-out-on-body/?tab=comments#comment-3954099", "origin": "L-forum", "suborigin": "308565-polishing-scratches-out-on-body", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " recently acquired an m8.2, the last owner did a -----> diy !!!  job of 'brassing' on the top casing with sandpaper (he told me). any polishing experts out there with advice on where i can improve its appearance. i am thinking of a rotary multi-tool but i have no idea which will be the best attachment to use. ideally i would like to bring back the shine rather adding more brassing. any help would be appreciated. --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 42110, "year": "2020"}, {"autor": "Francran", "date": "2020-08-17 08:44:00", "content": "On 9/2/2019 at 2:45 PM, 84bravo said: Aftermarket batteries for the M8/.M9 have been problematic for many users. They are plentiful now, but eventually Leica batteries and aftermarket will be very hard to find. Have you tried to purchase a Digilux 2 battery lately? I don't expect any camera manufacturer to support sensors after fifteen years, even if the camera was $7000 new. Analog cameras are a different story because any skilled repair person could keep it running long past it's introduction. Digital cameras require proprietary tools and equipment to maintain repairs. Most of those repairs are not repairs at all, but replacement of assemblies, no different than a computer. Now if Leica is still repairing or maintaining cameras at twice the cost of purchasing a used working camera, good for them. However, as a professional user I don't see that as a good ROI if I'm paying $2000+ in repairs for a camera that has a resale value of well less than $1500. YMMV. Just a point about batteries - I have a Nikon D1X and as far as I know new Nikon original batteries are no longer available. There is however one big difference in that the Nikon can be run with an external power source. I have my Nikon set to use a Quantum Turbo battery with a Quantum D1,D1X,D1H lead and it works perfectly. The Leica M8 has no such facility and therefore if new batteries becomes unavailable then it is a paperweight unless of course some DIY work is done to adapt a Quantum Battery to run the camera. BTW I find the Chinese Ebay batteries for the M8/M9 work OK only they don't report the battery condition as per OE batteries.", "link": "https://www.l-camera-forum.com/topic/300541-m8-ccd-sensor-not-working/page/3/?tab=comments#comment-4028464", "origin": "L-forum", "suborigin": "300541-m8-ccd-sensor-not-working", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "on 9/2/2019 at 2:45 pm, 84bravo said: aftermarket batteries for the m8/.m9 have been problematic for many users. they are plentiful now, but eventually leica batteries and aftermarket will be very hard to find. have you tried to purchase a digilux 2 battery lately? i don't expect any camera manufacturer to support sensors after fifteen years, even if the camera was $7000 new. analog cameras are a different story because any skilled repair person could keep it running long past it's introduction. digital cameras require proprietary tools and equipment to maintain repairs. most of those repairs are not repairs at all, but replacement of assemblies, no different than a computer. now if leica is still repairing or maintaining cameras at twice the cost of purchasing a used working camera, good for them. however, as a professional user i don't see that as a good roi if i'm paying $2000+ in repairs for a camera that has a resale value of well less than $1500. ymmv. just a point about batteries - i have a nikon d1x and as far as i know new nikon original batteries are no longer available. there is however one big difference in that the nikon can be run with an external power source. i have my nikon set to use a quantum turbo battery with a quantum d1,d1x,d1h lead and it works perfectly. the leica m8 has no such facility and therefore if new batteries becomes unavailable then it is a paperweight unless of course some -----> diy !!!  work is done to adapt a quantum battery to run the camera. btw i find the chinese ebay batteries for the m8/m9 work ok only they don't report the battery condition as per oe batteries.", "sortedWord": "None", "Identifyer": null, "identifyer": 42255, "year": "2020"}, {"autor": "RoySmith", "date": "2020-08-05 20:05:00", "content": "I’ve had the 75mm/1.4 and a 90mm/2.8 coded by Leica New Jersey and was very happy with the result. More expensive than DIY methods but more reliable.", "link": "https://www.l-camera-forum.com/topic/185433-m-lens-codes/page/8/?tab=comments#comment-4022108", "origin": "L-forum", "suborigin": "185433-m-lens-codes", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i’ve had the 75mm/1.4 and a 90mm/2.8 coded by leica new jersey and was very happy with the result. more expensive than -----> diy !!!  methods but more reliable.", "sortedWord": "None", "Identifyer": null, "identifyer": 7568, "year": "2020"}, {"autor": "chasdfg", "date": "2020-05-05 11:42:00", "content": "1 hour ago, 250swb said: All current Zeiss and Voigtlander M lenses have a shallow rebate machined in the mount specifically so the owner can add coding with black paint. This I note and it is definitely worth pointing out. For myself, I didn't like the idea of DIY coding the lenses as I had tried to do so before but the IR reader would either not pick up the coding or the coding would rub off (I used a sharpie though, so maybe different story if paint is used). Also, the recommended profiles for the ZM lenses didn't necessarily correspond with the focal length of the lenses. But there are many other solutions. Further to DIY colouring one could replace the rear mount using a pre-coded one from ebay or send the lens to DAG/3rd party to do so. For my last ZM lens I just used it un-coded, granted it was a 35 1.4, so entirely personal preference and not really a lens fault. There's always manual lens selection. In the end I decided that an already coded lens is the most fuss free, even if the fuss is minimal.", "link": "https://www.l-camera-forum.com/topic/309211-what-is-best-28mm-lens-for-m-mount/?tab=comments#comment-3967379", "origin": "L-forum", "suborigin": "309211-what-is-best-28mm-lens-for-m-mount", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "1 hour ago, 250swb said: all current zeiss and voigtlander m lenses have a shallow rebate machined in the mount specifically so the owner can add coding with black paint. this i note and it is definitely worth pointing out. for myself, i didn't like the idea of -----> diy !!!  coding the lenses as i had tried to do so before but the ir reader would either not pick up the coding or the coding would rub off (i used a sharpie though, so maybe different story if paint is used). also, the recommended profiles for the zm lenses didn't necessarily correspond with the focal length of the lenses. but there are many other solutions. further to diy colouring one could replace the rear mount using a pre-coded one from ebay or send the lens to dag/3rd party to do so. for my last zm lens i just used it un-coded, granted it was a 35 1.4, so entirely personal preference and not really a lens fault. there's always manual lens selection. in the end i decided that an already coded lens is the most fuss free, even if the fuss is minimal.", "sortedWord": "None", "Identifyer": null, "identifyer": 15843, "year": "2020"}, {"autor": "250swb", "date": "2020-05-05 11:56:00", "content": " 8 minutes ago, chasdfg said: This I note and it is definitely worth pointing out. For myself, I didn't like the idea of DIY coding the lenses as I had tried to do so before but the IR reader would either not pick up the coding or the coding would rub off (I used a sharpie though, so maybe different story if paint is used). Also, the recommended profiles for the ZM lenses didn't necessarily correspond with the focal length of the lenses. But there are many other solutions. Further to DIY colouring one could replace the rear mount using a pre-coded one from ebay or send the lens to DAG/3rd party to do so. For my last ZM lens I just used it un-coded, granted it was a 35 1.4, so entirely personal preference and not really a lens fault. There's always manual lens selection. In the end I decided that an already coded lens is the most fuss free, even if the fuss is minimal. There is no reason the paint would rub off, that is the point of the machined rebate in the mount, it is lower than the mating surface so the paint is protected. As regards the recommended codes for the Zeiss lenses not matching exactly a Leica code this is exactly the same 'problem' with any uncoded lens, and the answer is to code it according your own personal preference, the camera will not start to smoke if you choose a code you like the results of better than the 'official' code.", "link": "https://www.l-camera-forum.com/topic/309211-what-is-best-28mm-lens-for-m-mount/?tab=comments#comment-3967389", "origin": "L-forum", "suborigin": "309211-what-is-best-28mm-lens-for-m-mount", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " 8 minutes ago, chasdfg said: this i note and it is definitely worth pointing out. for myself, i didn't like the idea of -----> diy !!!  coding the lenses as i had tried to do so before but the ir reader would either not pick up the coding or the coding would rub off (i used a sharpie though, so maybe different story if paint is used). also, the recommended profiles for the zm lenses didn't necessarily correspond with the focal length of the lenses. but there are many other solutions. further to diy colouring one could replace the rear mount using a pre-coded one from ebay or send the lens to dag/3rd party to do so. for my last zm lens i just used it un-coded, granted it was a 35 1.4, so entirely personal preference and not really a lens fault. there's always manual lens selection. in the end i decided that an already coded lens is the most fuss free, even if the fuss is minimal. there is no reason the paint would rub off, that is the point of the machined rebate in the mount, it is lower than the mating surface so the paint is protected. as regards the recommended codes for the zeiss lenses not matching exactly a leica code this is exactly the same 'problem' with any uncoded lens, and the answer is to code it according your own personal preference, the camera will not start to smoke if you choose a code you like the results of better than the 'official' code.", "sortedWord": "None", "Identifyer": null, "identifyer": 15844, "year": "2020"}, {"autor": "BernardC", "date": "2020-05-19 14:49:00", "content": "5 hours ago, spassig123 said: I don’t have a smartphone yet. Would it be possible in future to use an external small device on flash connectior if a manufacturer design it? Pentax, Canon, and Hasselblad have offered similar devices, and you will find a few DIY instructions on the Web. However, you can probably use Leica's solution with any Android or iOS device that has GPS, without a network connection. That list should include most iPads, many Android tablets, old smartphones, etc. You just need to make sure that you have a compatible OS version (Android 6 and up, not sure about iOS), and that the device uses a GPS chip to find its location.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/page/2/?tab=comments#comment-3976500", "origin": "L-forum", "suborigin": "309594-geo-tagging-enabled", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "5 hours ago, spassig123 said: i don’t have a smartphone yet. would it be possible in future to use an external small device on flash connectior if a manufacturer design it? pentax, canon, and hasselblad have offered similar devices, and you will find a few -----> diy !!!  instructions on the web. however, you can probably use leica's solution with any android or ios device that has gps, without a network connection. that list should include most ipads, many android tablets, old smartphones, etc. you just need to make sure that you have a compatible os version (android 6 and up, not sure about ios), and that the device uses a gps chip to find its location.", "sortedWord": "None", "Identifyer": null, "identifyer": 32514, "year": "2020"}, {"autor": "helged", "date": "2020-08-10 06:50:00", "content": "On 8/8/2017 at 6:17 PM, Yaroslavk said: Awesome idea, didn't even think of going the diy route. I'm sorry if this has been answered (I've re-read the thread several times but didn't get it) - but what is the right way to connect it. I.e - which color cable from the remote to which connection on the plug (t,r,s). On 8/2/2017 at 9:06 PM, fotoshootoplocatie said: Green & blue is autofocus Blue & red is the shutter To those into the operation of a 3-pole plug (to the extent standards exist...) & based on the above: I assume the blue cable should be at the ground pin of the TRS-plug (but correct me if I am wrong!). If so, where to put the red cable, at pin 1 (the tip pin) or pin 2 (the mid pin)? (I can of course play and check, but I prefer not doing mistakes implying shipment to Wetzlar...). Thanks! Edited August 10, 2020 by helged", "link": "https://www.l-camera-forum.com/topic/275269-rc-scl4-remote-trigger-wiring-modification/?tab=comments#comment-4024466", "origin": "L-forum", "suborigin": "275269-rc-scl4-remote-trigger-wiring-modification", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "on 8/8/2017 at 6:17 pm, yaroslavk said: awesome idea, didn't even think of going the -----> diy !!!  route. i'm sorry if this has been answered (i've re-read the thread several times but didn't get it) - but what is the right way to connect it. i.e - which color cable from the remote to which connection on the plug (t,r,s). on 8/2/2017 at 9:06 pm, fotoshootoplocatie said: green & blue is autofocus blue & red is the shutter to those into the operation of a 3-pole plug (to the extent standards exist...) & based on the above: i assume the blue cable should be at the ground pin of the trs-plug (but correct me if i am wrong!). if so, where to put the red cable, at pin 1 (the tip pin) or pin 2 (the mid pin)? (i can of course play and check, but i prefer not doing mistakes implying shipment to wetzlar...). thanks! edited august 10, 2020 by helged", "sortedWord": "None", "Identifyer": null, "identifyer": 34271, "year": "2020"}, {"autor": "jaapv", "date": "2020-08-26 19:08:00", "content": "There is a Minolta version with slightly better coating. Most are in good condition, but many need tightening of the ring that holds the optical cell to the barrel - a 10-second DIY job. Try and find one with the original rubber hood - it has a weird filter thread (the Leica version). The lens hood takes a series 5.5 filter. The Minolta lens has a regular 36 mm filter AFAIK.", "link": "https://www.l-camera-forum.com/topic/312494-firmware-version-4-available-for-cl/page/9/?tab=comments#comment-4033864", "origin": "L-forum", "suborigin": "312494-firmware-version-4-available-for-cl", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "there is a minolta version with slightly better coating. most are in good condition, but many need tightening of the ring that holds the optical cell to the barrel - a 10-second -----> diy !!!  job. try and find one with the original rubber hood - it has a weird filter thread (the leica version). the lens hood takes a series 5.5 filter. the minolta lens has a regular 36 mm filter afaik.", "sortedWord": "None", "Identifyer": null, "identifyer": 42075, "year": "2020"}, {"autor": "gteague", "date": "2020-08-26 19:31:00", "content": "22 minutes ago, jaapv said: There is a Minolta version with slightly better coating. Most are in good condition, but many need tightening of the ring that holds the optical cell to the barrel - a 10-second DIY job. Try and find one with the original rubber hood - it has a weird filter thread (the Leica version). The lens hood takes a series 5.5 filter. The Minolta lens has a regular 36 mm filter AFAIK. tks. slim pickings on ebay unless you want to order from japan. but i have other places to check yet. /guy", "link": "https://www.l-camera-forum.com/topic/312494-firmware-version-4-available-for-cl/page/9/?tab=comments#comment-4033874", "origin": "L-forum", "suborigin": "312494-firmware-version-4-available-for-cl", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "22 minutes ago, jaapv said: there is a minolta version with slightly better coating. most are in good condition, but many need tightening of the ring that holds the optical cell to the barrel - a 10-second -----> diy !!!  job. try and find one with the original rubber hood - it has a weird filter thread (the leica version). the lens hood takes a series 5.5 filter. the minolta lens has a regular 36 mm filter afaik. tks. slim pickings on ebay unless you want to order from japan. but i have other places to check yet. /guy", "sortedWord": "None", "Identifyer": null, "identifyer": 42076, "year": "2020"}, {"autor": "ramarren", "date": "2020-08-26 23:30:00", "content": "4 hours ago, jaapv said: There is a Minolta version with slightly better coating. Most are in good condition, but many need tightening of the ring that holds the optical cell to the barrel - a 10-second DIY job. Try and find one with the original rubber hood - it has a weird filter thread (the Leica version). The lens hood takes a series 5.5 filter. The Minolta lens has a regular 36 mm filter AFAIK. The Minolta versions use a standard JIS 40.5mm filter thread, both the Rokkor-M 40mm and Rokkor-M 90mm lenses. I have had both of them, still have the 90mm f/4. There's a vendor on Ebay who makes nice metal replacement hoods for the 90mm in either JIS 40.5mm or DIN 5.5 thread. I have them too. G", "link": "https://www.l-camera-forum.com/topic/312494-firmware-version-4-available-for-cl/page/10/?tab=comments#comment-4034004", "origin": "L-forum", "suborigin": "312494-firmware-version-4-available-for-cl", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "4 hours ago, jaapv said: there is a minolta version with slightly better coating. most are in good condition, but many need tightening of the ring that holds the optical cell to the barrel - a 10-second -----> diy !!!  job. try and find one with the original rubber hood - it has a weird filter thread (the leica version). the lens hood takes a series 5.5 filter. the minolta lens has a regular 36 mm filter afaik. the minolta versions use a standard jis 40.5mm filter thread, both the rokkor-m 40mm and rokkor-m 90mm lenses. i have had both of them, still have the 90mm f/4. there's a vendor on ebay who makes nice metal replacement hoods for the 90mm in either jis 40.5mm or din 5.5 thread. i have them too. g", "sortedWord": "None", "Identifyer": null, "identifyer": 42092, "year": "2020"}, {"autor": "lct", "date": "2020-06-18 08:11:00", "content": "3 hours ago, cp995 said: I use a profile, but the cam always takes ISO 100! If you use a lens profile (not user profile), it might be that it is not recognized by the camera for some reason. A conflict with DIY coding perhaps? I would restart the camera, try another lens with another profile and see if it works. If it does you may wish to try the previous lens and profile again. Just an idea.", "link": "https://www.l-camera-forum.com/topic/293966-auto-iso-question-on-cl/?tab=comments#comment-3994973", "origin": "L-forum", "suborigin": "293966-auto-iso-question-on-cl", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "3 hours ago, cp995 said: i use a profile, but the cam always takes iso 100! if you use a lens profile (not user profile), it might be that it is not recognized by the camera for some reason. a conflict with -----> diy !!!  coding perhaps? i would restart the camera, try another lens with another profile and see if it works. if it does you may wish to try the previous lens and profile again. just an idea.", "sortedWord": "None", "Identifyer": null, "identifyer": 45675, "year": "2020"}, {"autor": "analog-digital", "date": "2020-08-19 14:36:00", "content": " Hello everybody Does anyone have a defective DMR where the functioning batteries are no longer needed? Possibly with charger? Does anyone know how to change the battery yourself and, above all, how to open the case? Does anyone have a good source ONLY for battery packs (no Refresh), i.e. for DIY? -->> As far as I know, these batteries were also used in the video area. Does anyone know which brand? Edited August 19, 2020 by analog-digital", "link": "https://www.l-camera-forum.com/topic/312465-leica-14447/?tab=comments#comment-4029713", "origin": "L-forum", "suborigin": "312465-leica-14447", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " hello everybody does anyone have a defective dmr where the functioning batteries are no longer needed? possibly with charger? does anyone know how to change the battery yourself and, above all, how to open the case? does anyone have a good source only for battery packs (no refresh), i.e. for -----> diy !!! ? -->> as far as i know, these batteries were also used in the video area. does anyone know which brand? edited august 19, 2020 by analog-digital", "sortedWord": "None", "Identifyer": null, "identifyer": 20883, "year": "2020"}, {"autor": "Leica Duncan", "date": "2020-01-28 20:48:00", "content": " Hi Folks I have been considering what to do with my R8 motor drive cell for quite a while now as although it will charge (two or three charge/discharge cycles), it doesn't hold the charge for a useful amount of time. I am guessing that the cell needs to be replaced. Researching on this forum and elsewhere it seems that this could be a DIY job. Just recently a Chinese replacement cell for the MD-R8 has been advertised on eBay but it is rated at 2000mAh. My understanding is that the original is 1500mAh. https://www.ebay.co.uk/itm/Ni-MH-9-6V-2000mAh-DIY-LEICA-MD-R8-motor-drive-cell-Rechargeable-Battery-8SHW/323999362831?hash=item4b6fddef0f:g:uX4AAOSwxzdaSwCK Has anyone tried fitting one of these cells? Are they any good? Is the higher rating a potential problem? Thanks Leica Duncan", "link": "https://www.l-camera-forum.com/topic/305847-md-r8-battery-cell-replacement-2000mah/?tab=comments#comment-3901654", "origin": "L-forum", "suborigin": "305847-md-r8-battery-cell-replacement-2000mah", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " hi folks i have been considering what to do with my r8 motor drive cell for quite a while now as although it will charge (two or three charge/discharge cycles), it doesn't hold the charge for a useful amount of time. i am guessing that the cell needs to be replaced. researching on this forum and elsewhere it seems that this could be a -----> diy !!!  job. just recently a chinese replacement cell for the md-r8 has been advertised on ebay but it is rated at 2000mah. my understanding is that the original is 1500mah. https://www.ebay.co.uk/itm/ni-mh-9-6v-2000mah-diy-leica-md-r8-motor-drive-cell-rechargeable-battery-8shw/323999362831?hash=item4b6fddef0f:g:ux4aaoswxzdaswck has anyone tried fitting one of these cells? are they any good? is the higher rating a potential problem? thanks leica duncan", "sortedWord": "None", "Identifyer": null, "identifyer": 21914, "year": "2020"}, {"autor": "TomLiles", "date": "2020-05-22 10:47:00", "content": " Hi all, Hope everyone is getting on OK through the lockdown. I use the S-system for work (I'm just a basic freelance photographer), and thus far I've always passed off my bodies to Leica Service here in Ginza, Tokyo to clean the sensors. With the Leica reputation in connection to sensor cover glass, I have not taken any chances. Leica Ginza usually do the job for nothing (quick clean)---anything more involved that'd require a service charge can be written down on my expenses, so I do that and save myself the hassle. All good. {It's also better for me to put the liability more squarely on them, just in-case any sensor cover glass problems did arise: I do not want to eat the Leica after-service tax infamous in these parts---I'm only half joking.} However! Leica Ginza has been effectively shut down since 8th April and doesn't look like going back to normal service anytime soon. My sensors really need a clean, so I'll have to take matters into my own hands. Not scared about it, but I want to get this right in the least number of iterations. Please lend me your expertise m(. .)m I have just tried the Pentax O-ICK1 on my backup S2-P body today. The O-ICK1 (great name) is a kind of dry-clean implement, for anyone unfamiliar. Didn't go well. I had more dust on the sensor after cleaning than before! (I held myself back from doubling down and trying again) So it looks as though that was ¥3,000 down the tubes. No great shakes, but I'm looking for a different and better way now... I'm in Japan so many of the products available to guys in the West, that turn up on Google searches of this topic, don't seem to be available for me here. I checked older threads and saw a Visible Dust swab made for 30mm sensors (dunno if specifically for the 30x45 Leica Pro Format, but anyway...) which I can't get my hands on in Japan. So I'm looking for workarounds. I've never wet cleaned a sensor myself before, so please forgive my ignorance and beginner questions: 1) Can I just use a full-frame swab? Does the edge of a swab leave a line? Assuming yes, otherwise there would be no market for different sensor size swabs.. or is it all FUD (Fear, Uncertainty, Doubt) from the sensor cleaning-industrial complex? 2) Can I just wrap a lens cleaning paper on a bit of stiff card or plastic, some isopropyl alcohol on the thin edge, and DIY myself a swab? The one remaining dry-clean solution (that I know of) I haven't tried is a sensor brush, like one of those Arctic Butterfly brushes---how do we feel about those? That specific product is not readily available here, although there seem to be copycat brush products (which surely perform just as well). What is the main thing I am looking for in a sensor brush? (materials, size, etc) I can't say whether the majority of the spots on my sensors are dust or oil, etc., but blowing is not doing the trick so I definitely need to do something more proactive to deal with whatever it is. My two camera bodies are the S typ006 and S2-P, both have had new sensors in them to replace defective gen1 versions, so the cover glass on there is whatever spec the replacement CCDs come with. Any advice and experience welcome. Cheers. Tom Edited May 22, 2020 by TomLiles", "link": "https://www.l-camera-forum.com/topic/309827-sensor-cleaning-workarounds/?tab=comments#comment-3978223", "origin": "L-forum", "suborigin": "309827-sensor-cleaning-workarounds", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " hi all, hope everyone is getting on ok through the lockdown. i use the s-system for work (i'm just a basic freelance photographer), and thus far i've always passed off my bodies to leica service here in ginza, tokyo to clean the sensors. with the leica reputation in connection to sensor cover glass, i have not taken any chances. leica ginza usually do the job for nothing (quick clean)---anything more involved that'd require a service charge can be written down on my expenses, so i do that and save myself the hassle. all good. {it's also better for me to put the liability more squarely on them, just in-case any sensor cover glass problems did arise: i do not want to eat the leica after-service tax infamous in these parts---i'm only half joking.} however! leica ginza has been effectively shut down since 8th april and doesn't look like going back to normal service anytime soon. my sensors really need a clean, so i'll have to take matters into my own hands. not scared about it, but i want to get this right in the least number of iterations. please lend me your expertise m(. .)m i have just tried the pentax o-ick1 on my backup s2-p body today. the o-ick1 (great name) is a kind of dry-clean implement, for anyone unfamiliar. didn't go well. i had more dust on the sensor after cleaning than before! (i held myself back from doubling down and trying again) so it looks as though that was ¥3,000 down the tubes. no great shakes, but i'm looking for a different and better way now... i'm in japan so many of the products available to guys in the west, that turn up on google searches of this topic, don't seem to be available for me here. i checked older threads and saw a visible dust swab made for 30mm sensors (dunno if specifically for the 30x45 leica pro format, but anyway...) which i can't get my hands on in japan. so i'm looking for workarounds. i've never wet cleaned a sensor myself before, so please forgive my ignorance and beginner questions: 1) can i just use a full-frame swab? does the edge of a swab leave a line? assuming yes, otherwise there would be no market for different sensor size swabs.. or is it all fud (fear, uncertainty, doubt) from the sensor cleaning-industrial complex? 2) can i just wrap a lens cleaning paper on a bit of stiff card or plastic, some isopropyl alcohol on the thin edge, and -----> diy !!!  myself a swab? the one remaining dry-clean solution (that i know of) i haven't tried is a sensor brush, like one of those arctic butterfly brushes---how do we feel about those? that specific product is not readily available here, although there seem to be copycat brush products (which surely perform just as well). what is the main thing i am looking for in a sensor brush? (materials, size, etc) i can't say whether the majority of the spots on my sensors are dust or oil, etc., but blowing is not doing the trick so i definitely need to do something more proactive to deal with whatever it is. my two camera bodies are the s typ006 and s2-p, both have had new sensors in them to replace defective gen1 versions, so the cover glass on there is whatever spec the replacement ccds come with. any advice and experience welcome. cheers. tom edited may 22, 2020 by tomliles", "sortedWord": "None", "Identifyer": null, "identifyer": 27832, "year": "2020"}, {"autor": "01maciel", "date": "2020-12-22 17:16:00", "content": " The shops and DIY stores are closed during the Covid-19 pandemic lockdown. So what do we do during the holidays? A good idea is to go out, have a walk and take some photos. That's what I have done recently. On my way there and back again I noticed a few sheds. --img--  Noctilux-M 1:1/50", "link": "https://www.l-camera-forum.com/topic/316316-sheds-along-the-trail/?tab=comments#comment-4103889", "origin": "L-forum", "suborigin": "316316-sheds-along-the-trail", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " the shops and -----> diy !!!  stores are closed during the covid-19 pandemic lockdown. so what do we do during the holidays? a good idea is to go out, have a walk and take some photos. that's what i have done recently. on my way there and back again i noticed a few sheds. --img--  noctilux-m 1:1/50", "sortedWord": "None", "Identifyer": null, "identifyer": 55432, "year": "2020"}, {"autor": "pattyfrank", "date": "2020-04-11 10:21:00", "content": "DIY Lotus construction, Barber Vintage Motorsports Museum, Leeds, AL --img--  M10-P, Summilux-M 1:1.4/35 FLE", "link": "https://www.l-camera-forum.com/topic/308072-motor-mania/page/8/?tab=comments#comment-3951350", "origin": "L-forum", "suborigin": "308072-motor-mania", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  lotus construction, barber vintage motorsports museum, leeds, al --img--  m10-p, summilux-m 1:1.4/35 fle", "sortedWord": "None", "Identifyer": null, "identifyer": 56912, "year": "2020"}, {"autor": "bokelley", "date": "2020-04-11 13:30:00", "content": "2 hours ago, pattyfrank said: DIY Lotus construction, Barber Vintage Motorsports Museum, Leeds, AL --img--  M10-P, Summilux-M 1:1.4/35 FLE Wow, look at all of the Eleven variants on the wall. Patty, do you know if all of those were produced by Lotus or just the aluminum bodies? While they look to be quite large vehicles, in reality they are tiny. Good stuff!", "link": "https://www.l-camera-forum.com/topic/308072-motor-mania/page/8/?tab=comments#comment-3951464", "origin": "L-forum", "suborigin": "308072-motor-mania", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "2 hours ago, pattyfrank said: -----> diy !!!  lotus construction, barber vintage motorsports museum, leeds, al --img--  m10-p, summilux-m 1:1.4/35 fle wow, look at all of the eleven variants on the wall. patty, do you know if all of those were produced by lotus or just the aluminum bodies? while they look to be quite large vehicles, in reality they are tiny. good stuff!", "sortedWord": "None", "Identifyer": null, "identifyer": 56919, "year": "2020"}, {"autor": "jankap", "date": "2020-07-08 09:42:00", "content": "vor 11 Minuten schrieb jaapv: The Leica M was designed as a development of the Barnack photographic philosophy, so that is very pertinent - up to and including the M10 - even CL, one might argue. It has always been a cornerstone of Leica - and this camera appears to attempt to encroach on this niche. No, not Mr. Barnack alone. The decision to commercialize was made by Mr. Leitz on the basis of his DIY product. To make a consumer product from a prototype takes some more time. Mr. Barnack had to play the role of the first showpiece.", "link": "https://www.l-camera-forum.com/topic/311132-pixii-a-new-m-mount-rangefinder/page/8/?tab=comments#comment-4005709", "origin": "L-forum", "suborigin": "311132-pixii-a-new-m-mount-rangefinder", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "vor 11 minuten schrieb jaapv: the leica m was designed as a development of the barnack photographic philosophy, so that is very pertinent - up to and including the m10 - even cl, one might argue. it has always been a cornerstone of leica - and this camera appears to attempt to encroach on this niche. no, not mr. barnack alone. the decision to commercialize was made by mr. leitz on the basis of his -----> diy !!!  product. to make a consumer product from a prototype takes some more time. mr. barnack had to play the role of the first showpiece.", "sortedWord": "None", "Identifyer": null, "identifyer": 82699, "year": "2020"}, {"autor": "pierovitch", "date": "2020-07-08 12:11:00", "content": "3 hours ago, andybarton said: --img--  The free sample and a DIY project upgrade for the dreamers.", "link": "https://www.l-camera-forum.com/topic/311132-pixii-a-new-m-mount-rangefinder/page/8/?tab=comments#comment-4005795", "origin": "L-forum", "suborigin": "311132-pixii-a-new-m-mount-rangefinder", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "3 hours ago, andybarton said: --img--  the free sample and a -----> diy !!!  project upgrade for the dreamers.", "sortedWord": "None", "Identifyer": null, "identifyer": 82701, "year": "2020"}, {"autor": "avalon", "date": "2020-07-14 17:29:00", "content": " Hello. I’m interested in buying and modifying Huawei p20 Pro phone to full spectrum for UV/VIS/IR photography. Huawei and Honor phones are using Leica manufactured lens known for providing best image quality/sharpness. Although they are not made from glass like traditional photography lens but some kind polymer, plastic. I wanted to know what material is used to make phone camera lens or at least how well they can transmit ultraviolet? This phone has monochrome sensor which is well suited for detecting deeper UV. Some UV might be also blocked by optical cement and AR coatings. Most phones today use plastic lens however LG V30 phone is exception that uses f/1.6 Crystal Clear glass lens claimed to have greater light-collecting ability and wide spectrum transparency, how it compares to Leica plastic lens? I did saw scientific paper describing DIY monochrome sensor ultraviolet camera which used quartz lens which is best UV transmission material but they are rare and expensive, anyway UV-C and some UV-B spectrum rays absorbed in atmosphere so BK7 glass like transmission is enough for my applications. I’m thinking also about adding Honor 20 PRO wide aperture f/1.4 lens to this phone which are currently fastest lens in phones to increase camera overall sensitivity (there are rumors Sony might use even faster f/1.2 lens in phones so maybe it’s worth waiting for them). There would be significant light gathering increase after replacing original f/1.8 lens. It’s really impressive to see incredible engineering that went into squeezing in such thin phone design relatively large sensors, tiny wide aperture and great zoom lens to make versatile camera‘s. Sure there might be little vignetting or aberrations in corners when using these lens on Huawei p20 Pro main camera but it’s worth improving camera sensitivity. More important thing to know if these lens could fit inside Huawei camera modules. Maybe Leica can sell these lens so not to buy whole camera modules or plans to make even faster lens, or use entirely new technology such as metalens which have a many amazing properties?", "link": "https://www.l-camera-forum.com/topic/311334-leica-wide-aperture-and-ultraviolet-lens-for-phones/?tab=comments#comment-4008793", "origin": "L-forum", "suborigin": "311334-leica-wide-aperture-and-ultraviolet-lens-for-phones", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " hello. i’m interested in buying and modifying huawei p20 pro phone to full spectrum for uv/vis/ir photography. huawei and honor phones are using leica manufactured lens known for providing best image quality/sharpness. although they are not made from glass like traditional photography lens but some kind polymer, plastic. i wanted to know what material is used to make phone camera lens or at least how well they can transmit ultraviolet? this phone has monochrome sensor which is well suited for detecting deeper uv. some uv might be also blocked by optical cement and ar coatings. most phones today use plastic lens however lg v30 phone is exception that uses f/1.6 crystal clear glass lens claimed to have greater light-collecting ability and wide spectrum transparency, how it compares to leica plastic lens? i did saw scientific paper describing -----> diy !!!  monochrome sensor ultraviolet camera which used quartz lens which is best uv transmission material but they are rare and expensive, anyway uv-c and some uv-b spectrum rays absorbed in atmosphere so bk7 glass like transmission is enough for my applications. i’m thinking also about adding honor 20 pro wide aperture f/1.4 lens to this phone which are currently fastest lens in phones to increase camera overall sensitivity (there are rumors sony might use even faster f/1.2 lens in phones so maybe it’s worth waiting for them). there would be significant light gathering increase after replacing original f/1.8 lens. it’s really impressive to see incredible engineering that went into squeezing in such thin phone design relatively large sensors, tiny wide aperture and great zoom lens to make versatile camera‘s. sure there might be little vignetting or aberrations in corners when using these lens on huawei p20 pro main camera but it’s worth improving camera sensitivity. more important thing to know if these lens could fit inside huawei camera modules. maybe leica can sell these lens so not to buy whole camera modules or plans to make even faster lens, or use entirely new technology such as metalens which have a many amazing properties?", "sortedWord": "None", "Identifyer": null, "identifyer": 88178, "year": "2020"}, {"autor": "wlaidlaw", "date": "2020-05-30 16:25:00", "content": "I tried B&W reversal some years ago. It was either expensive to get processed or a pain for DIY. I came to the conclusion that unless you want to project B&W from an incandescent light mechanical projector, it is just as easy to take the easily and/or cheaply processed B&W negative and invert it in Photoshop after scanning. You can then project it from a digital projector (I have a 1080P Mitsubishi one). It is not like scanning colour negative, where after years and trying all sorts of software and PS actions, I still cannot get the colour 100% to my taste. I therefore take mostly reversal for colour. I used to use Agfa Precisa CT100 (Provia emulsion on a warming substrate) until it was withdrawn about 18 months ago. I am down to my last 10 rolls of that now. However I really like the new Ektachrome 100D film. I have never particularly liked the Fuji reversal films, Velvia and more particularly Provia. Their colour balance is more tailored to Asian eyesight than Caucasian. Once Precisa had gone, I was hoping that Fuji might bring out a similar film and call it Provia W100, W being for a warming substrate. Wilson", "link": "https://www.l-camera-forum.com/topic/310100-anyone-used-adox-scala-film/?tab=comments#comment-3983369", "origin": "L-forum", "suborigin": "310100-anyone-used-adox-scala-film", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i tried b&w reversal some years ago. it was either expensive to get processed or a pain for -----> diy !!! . i came to the conclusion that unless you want to project b&w from an incandescent light mechanical projector, it is just as easy to take the easily and/or cheaply processed b&w negative and invert it in photoshop after scanning. you can then project it from a digital projector (i have a 1080p mitsubishi one). it is not like scanning colour negative, where after years and trying all sorts of software and ps actions, i still cannot get the colour 100% to my taste. i therefore take mostly reversal for colour. i used to use agfa precisa ct100 (provia emulsion on a warming substrate) until it was withdrawn about 18 months ago. i am down to my last 10 rolls of that now. however i really like the new ektachrome 100d film. i have never particularly liked the fuji reversal films, velvia and more particularly provia. their colour balance is more tailored to asian eyesight than caucasian. once precisa had gone, i was hoping that fuji might bring out a similar film and call it provia w100, w being for a warming substrate. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 100413, "year": "2020"}, {"autor": "mdachs", "date": "2020-04-26 21:08:00", "content": "To proceed the discussion from August, my problem ist not the drying but very often dust, especially bw film. German DIY warehouses offer fans ( the wonderful german composite is \"Rohreinschublüfter\") being able to convey 180m³ per hour. Vacuuming is this fan capable to surpass a at least to small HEPA-filter. A solution for my drying question. Regards Joachim --img-- ", "link": "https://www.l-camera-forum.com/topic/298113-diy-film-dryer/page/2/?tab=comments#comment-3961659", "origin": "L-forum", "suborigin": "298113-diy-film-dryer", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "to proceed the discussion from august, my problem ist not the drying but very often dust, especially bw film. german -----> diy !!!  warehouses offer fans ( the wonderful german composite is \"rohreinschublüfter\") being able to convey 180m³ per hour. vacuuming is this fan capable to surpass a at least to small hepa-filter. a solution for my drying question. regards joachim --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 101216, "year": "2020"}, {"autor": "Jeff S", "date": "2020-12-11 00:14:00", "content": "Even though some forum folks are proficient at DIY, Sherry Krauter, who is a well respected US Leica repair specialist, does not work on digital Ms due to the prohibitively expensive equipment needed to ensure close tolerances. Just saying. Jeff", "link": "https://www.l-camera-forum.com/topic/315978-leica-rf-alignment-in-norway-or-diy/?tab=comments#comment-4096228", "origin": "L-forum", "suborigin": "315978-leica-rf-alignment-in-norway-or-diy", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "even though some forum folks are proficient at diy, sherry krauter, who is a well respected us leica -----> repair !!!  specialist, does not work on digital ms due to the prohibitively expensive equipment needed to ensure close tolerances.", "sortedWord": "repair", "Identifyer": null, "identifyer": 24508, "year": "2020"}, {"autor": "Ko.Fe.", "date": "2020-08-09 16:52:00", "content": "13 minutes ago, rivi1969 said: My Canon 5D is 100% functional and it was made in 2005, 15 years and working as new. Apparently there are no more replacement shutters, but if my camera has maybe 5000 clicks I doubt I will ever take it beyond its 300k limit. If it dies at least it didn't cost me $6000. If Canon makes Cameras who can last that long I guess Leica can do too. And the cost of service and repairs is not even close. I sold 5D as soon as I read about end of support announcement. To discover later DIY videos on YouTube and shutters, sensors available on eBay. 2 minutes ago, rivi1969 said: I understand you said you have to send your camera via Leica Miami, I assume it needed repair. My M9-P was refurbished less than a year ago, the sensor is new, it won't corrode. Now, if I had a 2015 ME and Leica says sorry, your camera is \"unrepairable, take the trade-in\" I would simply sell it on my own and move to another brand. I wouldn't give another dime to a company that let me with a 5-year old $5000 brick. Just this month by my own mistake I broke my Smeg toaster, it was out of warranty, but I called customer service and I send it to the repair facility (Fedex shipping was paid by them) fixed my toaster, and not only I that, they send me a new one for free. Yes I know, we are talking 150 USD toasters, but the point is, maybe Leica could do better especially with those owners whose cameras are relative new, 5-year old or less. Maybe a demo M240 as a straight trade with NO money involved. My M-E 220 was purchased new in Moscow (autumn 2016) and went for new sensor in 2018 via Downtown Camera in Toronto. With Canon RP purchased just recently, my M-E 220 is last digital Leica I have purchased for practical reason. I might get another digital Leica, but strictly for feel good reason. Like buying Mazda Miata (except parts are still available) in addition to daily driven car. I'm keeping M4-2 which needs at least 500 USD for parts and service to work flawlessly again. As I mentioned above, here is DIY solution for A7's sensor in M3 is already available. If Leica would have think about customers as much as they care for profit, film M to digital M conversion would be in Leica Camera AG price list already.", "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/page/2/?tab=comments#comment-4024197", "origin": "L-forum", "suborigin": "312105-leica-discontinues-ccd-m9-and-variants-sensor-production", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "to discover later diy -----> videos !!!  on youtube and shutters, sensors available on ebay.", "sortedWord": "video", "Identifyer": null, "identifyer": 32840, "year": "2020"}, {"autor": "rivi1969", "date": "2020-08-09 17:22:00", "content": " 33 minutes ago, Ko.Fe. said: I sold 5D as soon as I read about end of support announcement. To discover later DIY videos on YouTube and shutters, sensors available on eBay. My M-E 220 was purchased new in Moscow (autumn 2016) and went for new sensor in 2018 via Downtown Camera in Toronto. With Canon RP purchased just recently, my M-E 220 is last digital Leica I have purchased for practical reason. I might get another digital Leica, but strictly for feel good reason. Like buying Mazda Miata (except parts are still available) in addition to daily driven car. I'm keeping M4-2 which needs at least 500 USD for parts and service to work flawlessly again. As I mentioned above, here is DIY solution for A7's sensor in M3 is already available. If Leica would have think about customers as much as they care for profit, film M to digital M conversion would be in Leica Camera AG price list already. For \"feel good reasons\", I would buy an orange UAZ Hunter :))", "link": "https://www.l-camera-forum.com/topic/312105-leica-discontinues-ccd-m9-and-variants-sensor-production/page/2/?tab=comments#comment-4024217", "origin": "L-forum", "suborigin": "312105-leica-discontinues-ccd-m9-and-variants-sensor-production", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "to discover later diy -----> videos !!!  on youtube and shutters, sensors available on ebay.", "sortedWord": "video", "Identifyer": null, "identifyer": 32841, "year": "2020"}, {"autor": "Ko.Fe.", "date": "2020-06-19 22:59:00", "content": "12 hours ago, alwinvrm said: I use film M's and lenses and it is sad that I find myself very reluctant to get a digital M. Not only are the issues with the M8 and 9 annoying for their owners but these issues deter people from buying an M. I would not hesitate to buy an 18MP M9 if I could see it as a camera that one could expect to use for another troublefree 5 years or more. Instead one can expect to buy a lot of problems. So I use my M lenses on Fuji Xpro's, sad. Call me frugal but for the price of even a secondhand M I like to expect years of trouble free use. Even if users decide to bin their Leica because of digital rot after a couple of years, the factory should make them to last. That is why it is a Leica. Unfortunately Leica themselves appear to underline the 'disposability' of their cameras by ending the free replacement of te affected M9 sensors. If you stand behind your product and you messed up, you should replace the sub standard parts, even after 10 years. Funny that the beautiful 60 year old rangefinder design in an M9 will still work after 30 years while the camera is useless. Maybe Leica should make modular M cameras, where the user can replace the sensor and engine module. And maybe this is the best they can do to survive in a market where cameras became expensive disposables. I am happy I decided to keep my film Rolleiflexes, Hasselblads, etc. If you google enough you will find DIY instructions for how to place FF Sony A7 sensor into film M. Current state of electronics and 3D printing allows to do it. But I'm waiting for Leica made retrofit kit to install global shutter into film M. This will allow to use film M bodies without spending hundreds on CLA and even more hundreds on set of new curtains. Also, to me, \"keep\" and \"use\" are two different things. I simply can't use film M as digital M. I like to take a show up stroll with fancy film camera, but I just don't have time to process, scan and else with film. To me the result is the major point of using and having photo camera. With film I like pictures because it is simply nice on film. But if I need the content, I have better chances with digital. Yet, it is much more challenging with digital M comparing to film M. Results vs nice feel.", "link": "https://www.l-camera-forum.com/topic/277516-sensor-replacement-and-market-impact/page/2/?tab=comments#comment-3996005", "origin": "L-forum", "suborigin": "277516-sensor-replacement-and-market-impact", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "if you google enough you will find diy instructions for how to place ff sony a7 sensor into -----> film !!!  m. current state of electronics and 3d printing allows to do it.", "sortedWord": "film", "Identifyer": null, "identifyer": 33253, "year": "2020"}, {"autor": "alwinvrm", "date": "2020-06-20 13:08:00", "content": "14 hours ago, Ko.Fe. said: If you google enough you will find DIY instructions for how to place FF Sony A7 sensor into film M. Current state of electronics and 3D printing allows to do it. But I'm waiting for Leica made retrofit kit to install global shutter into film M. This will allow to use film M bodies without spending hundreds on CLA and even more hundreds on set of new curtains. Also, to me, \"keep\" and \"use\" are two different things. I simply can't use film M as digital M. I like to take a show up stroll with fancy film camera, but I just don't have time to process, scan and else with film. To me the result is the major point of using and having photo camera. With film I like pictures because it is simply nice on film. But if I need the content, I have better chances with digital. Yet, it is much more challenging with digital M comparing to film M. Results vs nice feel. Thanx for these, to me, new approaches. An A7 sensor and better, an original retrofit kit sounds interesting. I am an amateur photographer, so I have the luxury of not having to deliver. Having said that, I don't like to spend hours on PP, but developing a film ( or having it done somewhere) and then scan the few ones you think you like is not very time consuming. I think the best part of film/slide for me is the fact that you have to deliver while you take the picture, so I am more conscious of perfect exposure, etc. This intensifies the experience for me. I often still remember, settings, camera, lens, developer, film, etc. of good pictures I took 20 years ago , Edited June 20, 2020 by alwinvrm", "link": "https://www.l-camera-forum.com/topic/277516-sensor-replacement-and-market-impact/page/2/?tab=comments#comment-3996275", "origin": "L-forum", "suborigin": "277516-sensor-replacement-and-market-impact", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "said: if you google enough you will find diy instructions for how to place ff sony a7 sensor into -----> film !!!  m. current state of electronics and 3d printing allows to do it.", "sortedWord": "film", "Identifyer": null, "identifyer": 33256, "year": "2020"}, {"autor": "jaapv", "date": "2020-12-10 08:57:00", "content": "The best thing you can do is to send your camera and lenses to a trusted repair shop and have the whole system calibrated - it is clear that there are too many parameters involved to do this in DIY. BTW, the adjustment you made is for infinity, not close distance. the close distance is the screw on the pivot of the arm.", "link": "https://www.l-camera-forum.com/topic/315943-rangefinder-focus-adjustment-m8/?tab=comments#comment-4095642", "origin": "L-forum", "suborigin": "315943-rangefinder-focus-adjustment-m8", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "the best thing you can do is to send your camera and lenses to a trusted -----> repair !!!  shop and have the whole system calibrated - it is clear that there are too many parameters involved to do this in diy. btw, the adjustment you made is for infinity, not close distance.", "sortedWord": "repair", "Identifyer": null, "identifyer": 41312, "year": "2020"}], "name": "Leicasortedout2020diy"}