{"interestingcomments": [{"autor": "Jeff S", "date": "2011-08-13 23:44:00", "content": "Half the pixel info is in the highest zone; three fourths is in the highest two zones. Not like in the film days. Generally better to capture it IMO and have it there for PP if necessary. ETTR doesn't mean that the pic should printed as it comes out of the camera. It also depends dynamic range of the scene, noise considerations, etc. But, generally speaking, I prefer to give myself more options to be creative after the shot, as long as I don't create undesirable effects in the process. At the end of the day, whatever works for you to get the print you want. Jeff", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/?tab=comments#comment-1764829", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "i don't create", "selectorShort": "create", "MarkedSent": "half the pixel info is in the highest zone; three fourths is in the highest two zones. not like in the film days. generally better to capture it imo and have it there for pp if necessary. ettr doesn't mean that the pic should printed as it comes out of the camera. it also depends dynamic range of the scene, noise considerations, etc. but, generally speaking, -----> i !!!  prefer to give myself more options to be creative after the shot, as long as -----> i !!!  -----> do !!! -----> n't !!!  -----> create !!!  undesirable effects in the process. at the end of the day, whatever works for you to get the print you want. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 32545, "year": "2011"}, {"autor": "ajayc", "date": "2011-08-16 01:57:00", "content": "First time posting on this forum, looks like there is quite a lot going on with ETTR and exposure. Hans, your data is showing that the M9 is shot noise limited (i.e. the noise is pretty much caused by the arrival rate of the photons itself, and the sensor circuitry adds very little noise if any, at least for a good part of the ISO / gain range). All good cameras behave in a narrow band when it comes to this.. From a sensor output stanpoint, ETTR (if this not explained somewhere else already): Take for instance, your favorite M9, 1. The ADC (analog-digital converter - the block which is responsible for digitizing pixel output) output is 14 bit for the M9, which means this block is capable of breaking down a pixel output into 16384 levels (or tones), and assume that the ADC assigns these codes in a monotonic fashion with 0 for the purest black and 16383 for the purest white. So, purest black: 00 0000 0000 0000 ( 'd0: short hand for decimal 0), Purest white: 11 1111 1111 1111 ('d16383). In practice, the purest black and purest white are not exactly at the ends of this range, but somewhat lower than the ends of this range. Now take a scene where all the tones in the histogram are uniformly distributed (i.e. all these 16384 levels occur at least once). If you underexpose this scene, what happens is that some of the levels between 8191 and 16383 (I used half of the full range as an example) get incorrectly shifted towards the lower half of the full range. With the severity of underexposure, more of the upper half of the tonal range gets shifted. However, the problem arises when this \"RAW\" data from the sensor needs to be gamma mapped (i.e the sensor response needs to be mapped to what a human eye sees). Now if one were to map an underexposed scene (generally involves stretching both the ends of the captured histogram), RAW converters / camera processors have limited information (especially at the high end), and this information needs to be mapped to the higher end of the histogram. ie we are asking to create information out of thin air. The histogram can be shifted, but it is like adding more light to a certain part of the histogram. If one is not careful, subtle shifts in tonality are lost. RAW converters / onboard processing has come a long way in this regards. And the reverse is not the case with an over exposed histogram, because it involves redistributing already existing data to lower values, and setting the corresponding black level. Also, one doesn't want to lift the shadows too much because of noise concerns (usually at low gain settings, sensor circuitry tends to be noisier, and hence lower S/N ratio). Also, some sensors try to allocate extra information at the ends of the tonal range. From a sensor perspective, does ETTR help? Yes and no. It largely depends on the scene histogram distribution, photographic goals and noise / tonality concerns. If a scene has large shadow areas, one might be better off exploiting this technique (without blowing out the highlights). If the scene is uniformly distributed, then there is very little to achieve by ETTR. Through this simple shifting of bits around, color tonality gets affected. Human eyes are exceptional at perceiving shifts in color tonality than what the current state of art cameras can achieve. Also, RAW developers are starting to develop floating point arithmetic for RAW analysis. This should help with some of these issues. There is no free lunch. --img--  With a mathematical model of the M9, much can be taken out of the guesswork. The accurate model that I have, contains all existing kinds of noise, Photon Noise, Sensor noise, A/D Noise, Photo response non uniform etc. giving a reliable picture of the Signal to Noise of the complete camera. I have calculated the noise of the two combinations ISO 160/320 and ISO 800/1600, in both cases the lower ISO value with “normal” exposure and the higher ISO value with +1 stop ETTR. First the graphical representation of both combinations, where yellow is the higher and magenta is the lower ISO value of the two. On the horizontal axis, 13 is the highest or lightest level, just before overexposure. Going to the left is decreasing the luminance. On the vertical axis is the Signal to Noise in stops. Zero means that the signal is just as strong as the noise, and 6 means that the signal is 2exp6 = 64 times stronger as the noise. [ATTACH]273092[/ATTACH] The graphs are roughly showing that the S/N is the same for all luminance values when the higher ISO value is exposed with +1 stop ETTR. For instance the yellow dot at Luminance 7 has the same S/N as the Magenta dot at Luminance 6, and so on. But the graphs are not accurate enough to show the exact difference. So here are the S/N values at the Luminance levels 12 –7 for ISO 160, compared to S/N at the Luminance levels 13-8 ( +1 stop ETTR ) for ISO 320. [ATTACH]273094[/ATTACH] At lower Luminance levels (darker area’s) there is an absolute insignificant S/N advantage of 0,05 stops in favor of ISO 320 with +1 stop ETTR. At the higher Luminance levels (lighter area’s) there is no difference at all. Now for ISO 800 and ISO 1600. [ATTACH]273095[/ATTACH] Although the S/N in absolute value is worse than at ISO 160/320, the relative value between S/N at ISO 800 is exactly the same as the S/N value at ISO 1600 with 1 stop ETTR. There is simply no difference. When just looking at noise, the conclusion is: Instead of shifting the exposure +1 stop ETTR, one can just as well go one Stop down in ISO without overexposure. This is true for low as well as high ISO values, and it is true over the whole range from light to dark. According to Sandy, there is a negative effect of ETTR on color reproduction. ETTR should therefore be avoided. Hans", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/3/?tab=comments#comment-1766815", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "we are asking to create", "selectorShort": "create", "MarkedSent": "first time posting on this forum, looks like there is quite a lot going on with ettr and exposure. hans, your data is showing that the m9 is shot noise limited (i.e. the noise is pretty much caused by the arrival rate of the photons itself, and the sensor circuitry adds very little noise if any, at least for a good part of the iso / gain range). all good cameras behave in a narrow band when it comes to this.. from a sensor output stanpoint, ettr (if this not explained somewhere else already): take for instance, your favorite m9, 1. the adc (analog-digital converter - the block which is responsible for digitizing pixel output) output is 14 bit for the m9, which means this block is capable of breaking down a pixel output into 16384 levels (or tones), and assume that the adc assigns these codes in a monotonic fashion with 0 for the purest black and 16383 for the purest white. so, purest black: 00 0000 0000 0000 ( 'd0: short hand for decimal 0), purest white: 11 1111 1111 1111 ('d16383). in practice, the purest black and purest white are not exactly at the ends of this range, but somewhat lower than the ends of this range. now take a scene where all the tones in the histogram are uniformly distributed (i.e. all these 16384 levels occur at least once). if you underexpose this scene, what happens is that some of the levels between 8191 and 16383 (i used half of the full range as an example) get incorrectly shifted towards the lower half of the full range. with the severity of underexposure, more of the upper half of the tonal range gets shifted. however, the problem arises when this \"raw\" data from the sensor needs to be gamma mapped (i.e the sensor response needs to be mapped to what a human eye sees). now if one were to map an underexposed scene (generally involves stretching both the ends of the captured histogram), raw converters / camera processors have limited information (especially at the high end), and this information needs to be mapped to the higher end of the histogram. ie -----> we !!!  -----> are !!!  -----> asking !!!  -----> to !!!  -----> create !!!  information out of thin air. the histogram can be shifted, but it is like adding more light to a certain part of the histogram. if one is not careful, subtle shifts in tonality are lost. raw converters / onboard processing has come a long way in this regards. and the reverse is not the case with an over exposed histogram, because it involves redistributing already existing data to lower values, and setting the corresponding black level. also, one doesn't want to lift the shadows too much because of noise concerns (usually at low gain settings, sensor circuitry tends to be noisier, and hence lower s/n ratio). also, some sensors try to allocate extra information at the ends of the tonal range. from a sensor perspective, does ettr help? yes and no. it largely depends on the scene histogram distribution, photographic goals and noise / tonality concerns. if a scene has large shadow areas, one might be better off exploiting this technique (without blowing out the highlights). if the scene is uniformly distributed, then there is very little to achieve by ettr. through this simple shifting of bits around, color tonality gets affected. human eyes are exceptional at perceiving shifts in color tonality than what the current state of art cameras can achieve. also, raw developers are starting to develop floating point arithmetic for raw analysis. this should help with some of these issues. there is no free lunch. --img--  with a mathematical model of the m9, much can be taken out of the guesswork. the accurate model that i have, contains all existing kinds of noise, photon noise, sensor noise, a/d noise, photo response non uniform etc. giving a reliable picture of the signal to noise of the complete camera. i have calculated the noise of the two combinations iso 160/320 and iso 800/1600, in both cases the lower iso value with “normal” exposure and the higher iso value with +1 stop ettr. first the graphical representation of both combinations, where yellow is the higher and magenta is the lower iso value of the two. on the horizontal axis, 13 is the highest or lightest level, just before overexposure. going to the left is decreasing the luminance. on the vertical axis is the signal to noise in stops. zero means that the signal is just as strong as the noise, and 6 means that the signal is 2exp6 = 64 times stronger as the noise. [attach]273092[/attach] the graphs are roughly showing that the s/n is the same for all luminance values when the higher iso value is exposed with +1 stop ettr. for instance the yellow dot at luminance 7 has the same s/n as the magenta dot at luminance 6, and so on. but the graphs are not accurate enough to show the exact difference. so here are the s/n values at the luminance levels 12 –7 for iso 160, compared to s/n at the luminance levels 13-8 ( +1 stop ettr ) for iso 320. [attach]273094[/attach] at lower luminance levels (darker area’s) there is an absolute insignificant s/n advantage of 0,05 stops in favor of iso 320 with +1 stop ettr. at the higher luminance levels (lighter area’s) there is no difference at all. now for iso 800 and iso 1600. [attach]273095[/attach] although the s/n in absolute value is worse than at iso 160/320, the relative value between s/n at iso 800 is exactly the same as the s/n value at iso 1600 with 1 stop ettr. there is simply no difference. when just looking at noise, the conclusion is: instead of shifting the exposure +1 stop ettr, one can just as well go one stop down in iso without overexposure. this is true for low as well as high iso values, and it is true over the whole range from light to dark. according to sandy, there is a negative effect of ettr on color reproduction. ettr should therefore be avoided. hans", "sortedWord": "None", "Identifyer": null, "identifyer": 32601, "year": "2011"}, {"autor": "t024484", "date": "2011-08-16 17:04:00", "content": "First time posting on this forum Welcome to the forum There are a number of misconceptions in your posting that I will try to anwer. your data is showing that the M9 is shot noise limited (i.e. the noise is pretty much caused by the arrival rate of the photons itself, and the sensor circuitry adds very little noise if any, at least for a good part of the ISO / gain range). All good cameras behave in a narrow band when it comes to this.. Shot noise only plays a role in the 6 most brightest luminance stops, but even there other types of noise are contributing as well. At the highest luminance level noise is completely dominated by Photo response non uniformity. But on ETTR all this has no relevance. Take for instance, your favorite M9. The ADC (analog-digital converter - the block which is responsible for digitizing pixel output) output is 14 bit for the M9, which means this block is capable of breaking down a pixel output into 16384 levels (or tones), and assume that the ADC assigns these codes in a monotonic fashion with 0 for the purest black and 16383 for the purest white. The m9 has an 14 bit a/d, but the dynamic range of the sensor is only 12 bit, and only at ISO 160. For each doubling of the ISO value this dynamic range is halved or 1 bit less. But no screen or printed output is capable of displaying 12 stops and that is why we can correct for exposure because, depending on ISO, (large) parts of the available information are 'unused'. Now take a scene where all the tones in the histogram are uniformly distributed (i.e. all these 16384 levels occur at least once). If you underexpose this scene, what happens is that some of the levels between 8191 and 16383 (I used half of the full range as an example) get incorrectly shifted towards the lower half of the full range. Not just some of the levels, but all of them. Now if one were to map an underexposed scene (generally involves stretching both the ends of the captured histogram), If an underexposed scene is corrected for exposure, the whole histogram goes to the right. Stretching occurs when increasing contrast. RAW converters / camera processors have limited information (especially at the high end), and this information needs to be mapped to the higher end of the histogram. ie we are asking to create information out of thin air. All the information is there, it is just shifted to the right, multipied with an exposure correction factor. No interpolation no guesswork. The histogram can be shifted, but it is like adding more light to a certain part of the histogram. If one is not careful, subtle shifts in tonality are lost. not certain parts are shifted, but everything will be shifted keeping all ratios intact. RAW converters / onboard processing has come a long way in this regards. And the reverse is not the case with an over exposed histogram, because it involves redistributing already existing data to lower values, and setting the corresponding black levelSome sensors try to allocate extra information at the ends of the tonal range. Through this simple shifting of bits around, color tonality gets affected. This all happens not to be the case. Hans", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/4/?tab=comments#comment-1767376", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "we are asking to create", "selectorShort": "create", "MarkedSent": "first time posting on this forum welcome to the forum there are a number of misconceptions in your posting that i will try to anwer. your data is showing that the m9 is shot noise limited (i.e. the noise is pretty much caused by the arrival rate of the photons itself, and the sensor circuitry adds very little noise if any, at least for a good part of the iso / gain range). all good cameras behave in a narrow band when it comes to this.. shot noise only plays a role in the 6 most brightest luminance stops, but even there other types of noise are contributing as well. at the highest luminance level noise is completely dominated by photo response non uniformity. but on ettr all this has no relevance. take for instance, your favorite m9. the adc (analog-digital converter - the block which is responsible for digitizing pixel output) output is 14 bit for the m9, which means this block is capable of breaking down a pixel output into 16384 levels (or tones), and assume that the adc assigns these codes in a monotonic fashion with 0 for the purest black and 16383 for the purest white. the m9 has an 14 bit a/d, but the dynamic range of the sensor is only 12 bit, and only at iso 160. for each doubling of the iso value this dynamic range is halved or 1 bit less. but no screen or printed output is capable of displaying 12 stops and that is why we can correct for exposure because, depending on iso, (large) parts of the available information are 'unused'. now take a scene where all the tones in the histogram are uniformly distributed (i.e. all these 16384 levels occur at least once). if you underexpose this scene, what happens is that some of the levels between 8191 and 16383 (i used half of the full range as an example) get incorrectly shifted towards the lower half of the full range. not just some of the levels, but all of them. now if one were to map an underexposed scene (generally involves stretching both the ends of the captured histogram), if an underexposed scene is corrected for exposure, the whole histogram goes to the right. stretching occurs when increasing contrast. raw converters / camera processors have limited information (especially at the high end), and this information needs to be mapped to the higher end of the histogram. ie -----> we !!!  -----> are !!!  -----> asking !!!  -----> to !!!  -----> create !!!  information out of thin air. all the information is there, it is just shifted to the right, multipied with an exposure correction factor. no interpolation no guesswork. the histogram can be shifted, but it is like adding more light to a certain part of the histogram. if one is not careful, subtle shifts in tonality are lost. not certain parts are shifted, but everything will be shifted keeping all ratios intact. raw converters / onboard processing has come a long way in this regards. and the reverse is not the case with an over exposed histogram, because it involves redistributing already existing data to lower values, and setting the corresponding black levelsome sensors try to allocate extra information at the ends of the tonal range. through this simple shifting of bits around, color tonality gets affected. this all happens not to be the case. hans", "sortedWord": "None", "Identifyer": null, "identifyer": 32610, "year": "2011"}, {"autor": "Per P.", "date": "2011-02-16 14:03:00", "content": "So, in preparation for a long-ish trip later this year I revisited this question. This time I created a spreadsheet to understand my options. I have considered the difference in Field of View as well as the relative difference in percent --img--  My lenses range from 21 to 90mm. The conclusions are almost a little dull, but it seems the following combinations give the most balanced spread: - 2 Lenses: 25/50 or 35/75 - 3 Lenses: 28/50/90 - 4 Lenses: 21/35/50/75 or 25/35/50/90 But balance is not everything, so I ask myself two simple questions before deciding what to bring. That can easily result in a completely different set ending in the bag --img--  - Pick the widest and longest lens I imagine using for that particular location - Decide how many lenses I can be bothered to carry Cheers, Per.", "link": "https://www.l-camera-forum.com/topic/104812-the-perfect-travel-kit/page/9/?tab=comments#comment-1589867", "origin": "L-forum", "suborigin": "104812-the-perfect-travel-kit", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "so, in preparation for a long-ish trip later this year i revisited this question. this time -----> i !!!  -----> created !!!  a spreadsheet to understand my options. i have considered the difference in field of view as well as the relative difference in percent --img--  my lenses range from 21 to 90mm. the conclusions are almost a little dull, but it seems the following combinations give the most balanced spread: - 2 lenses: 25/50 or 35/75 - 3 lenses: 28/50/90 - 4 lenses: 21/35/50/75 or 25/35/50/90 but balance is not everything, so i ask myself two simple questions before deciding what to bring. that can easily result in a completely different set ending in the bag --img--  - pick the widest and longest lens i imagine using for that particular location - decide how many lenses i can be bothered to carry cheers, per.", "sortedWord": "None", "Identifyer": null, "identifyer": 87057, "year": "2011"}], "name": "Leicasortedout2011create"}