{"interestingcomments": [{"autor": "Guest", "date": "2017-05-18 08:50:00", "content": "More high-res pictures here: https://github.com/aha/filterholder/tree/master/prototypes Those are plastic 3D printed prototypes of course. Validating the designs in real use now, then off to the metal shop to make heavy duty ones. --img--  Edited May 18, 2017 by Guest", "link": "https://www.l-camera-forum.com/topic/245798-leitz-focomat-ic-restauration-project-several-questions/?tab=comments#comment-3277358", "origin": "L-forum", "suborigin": "245798-leitz-focomat-ic-restauration-project-several-questions", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "more high-res pictures here: https://github.com/aha/filterholder/tree/master/prototypes those are plastic -----> 3d !!!  -----> printed !!!  prototypes of course. validating the designs in real use now, then off to the metal shop to make heavy duty ones. --img--  edited may 18, 2017 by guest", "sortedWord": "None", "Identifyer": null, "identifyer": 104867, "year": "2017"}, {"autor": "EoinC", "date": "2017-05-23 21:34:00", "content": " More high-res pictures here: https://github.com/aha/filterholder/tree/master/prototypes Those are plastic 3D printed prototypes of course. Validating the designs in real use now, then off to the metal shop to make heavy duty ones. What an amazing World we live in.", "link": "https://www.l-camera-forum.com/topic/245798-leitz-focomat-ic-restauration-project-several-questions/page/2/?tab=comments#comment-3281300", "origin": "L-forum", "suborigin": "245798-leitz-focomat-ic-restauration-project-several-questions", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": " more high-res pictures here: https://github.com/aha/filterholder/tree/master/prototypes those are plastic -----> 3d !!!  -----> printed !!!  prototypes of course. validating the designs in real use now, then off to the metal shop to make heavy duty ones. what an amazing world we live in.", "sortedWord": "None", "Identifyer": null, "identifyer": 104868, "year": "2017"}, {"autor": "pridbor", "date": "2017-02-18 20:56:00", "content": "The darkroom requires learning a craft if the results are to be good. And when the results are good, there is nothing so lovely. To repeat, nothing. In my mind a loose analogy is sculptor who, because it is modern and convenient, buys a 3-D printer and sells his chisels Michael I agree with your first sentence, fully! Now it so happens that I'm a (stone and Metal) Sculptor and to the last sentence, I would add that there are things that you can accomplish with 3D Printing which is near or impossible to create without. I did my first 3D print professionally when I designed a Display system for the Apache Helicopter some 20+ years ago, very expensive then, not exactly art but, and would like to create some large 8ft sculptures in metal, when such becomes cost efficient to do. Currently I have to make what I can with sheet water-cut metal and curves are very hard to accomplish. Just my 2 cents worth :-)", "link": "https://www.l-camera-forum.com/topic/269097-why-darkroom/page/2/?tab=comments#comment-3216151", "origin": "L-forum", "suborigin": "269097-why-darkroom", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "the darkroom requires learning a craft if the results are to be good. and when the results are good, there is nothing so lovely. to repeat, nothing. in my mind a loose analogy is sculptor who, because it is modern and convenient, buys a 3-d printer and sells his chisels michael i agree with your first sentence, fully! now it so happens that i'm a (stone and metal) sculptor and to the last sentence, i would add that there are things that you can accomplish with 3d printing which is near or impossible to create without. i did my first -----> 3d !!!  -----> print !!!  professionally when i designed a display system for the apache helicopter some 20+ years ago, very expensive then, not exactly art but, and would like to create some large 8ft sculptures in metal, when such becomes cost efficient to do. currently i have to make what i can with sheet water-cut metal and curves are very hard to accomplish. just my 2 cents worth :-)", "sortedWord": "None", "Identifyer": null, "identifyer": 105988, "year": "2017"}], "name": "Leicasortedout2017print"}