{"interestingcomments": [{"autor": "jaapv", "date": "2018-10-01 18:14:00", "content": "I am quite puzzled by the expression \"take my lenses\". Why shouldn't the M8 not do so? In fact, they will perform better than on full frame as you will be using the sweet spot. The size of the sensor does not change anything on the lens, it just crops the image you record. It is not a small sensor, it is the closest to full frame you can get. You use your lenses like before, and for convenience you calculate the angle of view as follows . 28=35, 35=50 Not quite exact, but close enough. Why should you use a non-Leica lens if you have got perfectly good ones Leica ones that you are happy with? For the record: Both Zeiss and Voigtländer make good lenses too. Designed for full-frame as well as Leica, BTW. And... Buy an M9. You will have the same sensor as the M8, only larger and with fewer IR problems. The B&W will look virtually the same. The only caveat - the original M9 sensor had corrosion problems. Leica has replaced those recently by corrosion-free ones. get a camera with a new corrosion-free sensor. that means buying from a trusted dealer.", "link": "https://www.l-camera-forum.com/topic/286634-some-question-for-m8/page/2/?tab=comments#comment-3604294", "origin": "L-forum", "suborigin": "286634-some-question-for-m8", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "i am quite puzzled by the expression \"take my lenses\". why shouldn't the m8 not do so? in fact, they will perform better than on full frame as you will be using the sweet spot. the size of the sensor does not change anything on the lens, it just crops the image you record. it is not a small sensor, it is the closest to full frame you can get. you use your lenses like before, and for convenience you calculate the angle of view as follows . 28=35, 35=50 not quite exact, but close enough. why should you use a non-leica lens if you have got perfectly good ones leica ones that you are happy with? for the record: both zeiss and voigtländer make good lenses too. -----> designed !!!  for full-frame as well as leica, btw. and... buy an m9. you will have the same sensor as the m8, only larger and with fewer ir problems. the b&w will look virtually the same. the only caveat - the original m9 sensor had corrosion problems. leica has replaced those recently by corrosion-free ones. get a camera with a new corrosion-free sensor. that means buying from a trusted dealer.", "sortedWord": "None", "Identifyer": null, "identifyer": 43718, "year": "2018"}, {"autor": "Vieri", "date": "2018-09-27 14:38:00", "content": "+1 Sigma can launch new lenses quickly by modifying existing optical designs to different lens barrel, as they did with current CanNikon models adopted to to Sony E mount. As a result lens became bigger or received built in lens adaptor to adjust for difference in registry - some 20mm or more. On the other hand if Sigma proceed to design form the ground up for a camera with short registry, like Voightlander extra wide 10-12-15mm for the M mount/ Sony E Mount we could expect some interesting lenses, only this will take time. Exactly. It is great to get excited by Sigma's promised L lineup, and some of their new Art lenses are pretty good (though I agree with Irakly on this one - Leica's are better), but before bashing Leica for being slow, let's keep in mind that all Sigma needs to do to have dozens of L lenses ready is to add a built-in adapter to physically make their lens work with L mount bodies, and add a chip in to manage communication / AF / diaphragm. Designing a full line-up of lenses for a new mount would be (and is, as Leica shows) a completely different endeavour - and one that takes much more time. Best regards, Vieri", "link": "https://www.l-camera-forum.com/topic/289836-and-sigmas-roadmap/?tab=comments#comment-3601368", "origin": "L-forum", "suborigin": "289836-and-sigmas-roadmap", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "+1 sigma can launch new lenses quickly by modifying existing optical designs to different lens barrel, as they did with current cannikon models adopted to to sony e mount. as a result lens became bigger or received built in lens adaptor to adjust for difference in registry - some 20mm or more. on the other hand if sigma proceed to design form the ground up for a camera with short registry, like voightlander extra wide 10-12-15mm for the m mount/ sony e mount we could expect some interesting lenses, only this will take time. exactly. it is great to get excited by sigma's promised l lineup, and some of their new art lenses are pretty good (though i agree with irakly on this one - leica's are better), but before bashing leica for being slow, let's keep in mind that all sigma needs to do to have dozens of l lenses ready is to add a built-in adapter to physically make their lens work with l mount bodies, and add a chip in to manage communication / af / diaphragm. -----> designing !!!  a full line-up of lenses for a new mount would be (and is, as leica shows) a completely different endeavour - and one that takes much more time. best regards, vieri", "sortedWord": "None", "Identifyer": null, "identifyer": 50231, "year": "2018"}, {"autor": "lct", "date": "2018-09-26 05:43:00", "content": "Designing an FF sensor with L, R and M mounts in mind is an effort that neither Panasonic nor Sigma are expected to do IMHO. R users should be glad to use their legacy lenses on modern Panasonic or Foveon based Sigma FF bodies i guess but M users will still have to choose a Leica or a Kolari modded Sony i suspect.", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/16/?tab=comments#comment-3600083", "origin": "L-forum", "suborigin": "289421-new-panasonic-full-frame-with-sl-mount", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "-----> designing !!!  an ff sensor with l, r and m mounts in mind is an effort that neither panasonic nor sigma are expected to do imho. r users should be glad to use their legacy lenses on modern panasonic or foveon based sigma ff bodies i guess but m users will still have to choose a leica or a kolari modded sony i suspect.", "sortedWord": "None", "Identifyer": null, "identifyer": 51414, "year": "2018"}, {"autor": "frame-it", "date": "2018-10-07 23:54:00", "content": "from the Sigma interview >> \" ――Lマウントの仕様について、3社で決めるようなことはあるのでしょうか。 基本的に、ハードウエアの部分は既存のままで変わりません。その中でやりとりする信号とかデータとかをアップグレードする、といった拡張の余地はあると思っています。懐の深いレンズ交換式カメラのシステムにすべく、3社で話し合っていきます。\" == Q- Is there something that three companies will decide on the specification of L mount?Basically, the hardware part remains unchanged. I think that there is room for expansion such as upgrading signals and data exchanged among them. We will talk with three companies to become a system with a deep lens interchangeable camera. Q――Foveonでフルサイズ、難しくはないのですか？ 実際にセンサーの量産を始めてみないと何ともいえない面もありますが、すでに設計はできています。Foveonセンサーに限らず、フルサイズのセンサーを作ること自体に難しさがあります。他社がやっていますし、当社もチャレンジしようと思っています。 - Full size with Foveon, is not difficult?There are some aspects that can not be said without actually starting mass production of sensors, but we have already designed it. Not limited to Foveon sensors, there are difficulties in making full-size sensors themselves. Other companies are doing it, and we are planning to challenge.", "link": "https://www.l-camera-forum.com/topic/289971-any-news-about-the-full-frame-sigma-foveon-l-mount-camera/page/2/?tab=comments#comment-3608507", "origin": "L-forum", "suborigin": "289971-any-news-about-the-full-frame-sigma-foveon-l-mount-camera", "result": true, "Selector": "we have already designed", "selectorShort": "design", "MarkedSent": "from the sigma interview >> \" ――lマウントの仕様について、3社で決めるようなことはあるのでしょうか。 基本的に、ハードウエアの部分は既存のままで変わりません。その中でやりとりする信号とかデータとかをアップグレードする、といった拡張の余地はあると思っています。懐の深いレンズ交換式カメラのシステムにすべく、3社で話し合っていきます。\" == q- is there something that three companies will decide on the specification of l mount?basically, the hardware part remains unchanged. i think that there is room for expansion such as upgrading signals and data exchanged among them. we will talk with three companies to become a system with a deep lens interchangeable camera. q――foveonでフルサイズ、難しくはないのですか？ 実際にセンサーの量産を始めてみないと何ともいえない面もありますが、すでに設計はできています。foveonセンサーに限らず、フルサイズのセンサーを作ること自体に難しさがあります。他社がやっていますし、当社もチャレンジしようと思っています。 - full size with foveon, is not difficult?there are some aspects that can not be said without actually starting mass production of sensors, but -----> we !!!  -----> have !!!  -----> already !!!  -----> designed !!!  it. not limited to foveon sensors, there are difficulties in making full-size sensors themselves. other companies are doing it, and we are planning to challenge.", "sortedWord": "None", "Identifyer": null, "identifyer": 51672, "year": "2018"}, {"autor": "masjah", "date": "2018-08-03 07:31:00", "content": "Erwin Puts is entitled to his opinion, and who am I to question such an expert? But I am pretty sure that Leica uses their best skill and knowledge in designing their prime lenses, just as they do their zoom lenses. Common sense tells us that it is virtually impossible to design a single zoom that can perform as well at all focal lengths as corresponding primes. As an example, the SL 24-90 is regarded by many as the finest zoom lens in its range that has ever been produced, and it is indeed a very fine lens. Yet I can tell you from personal experience that my prime lenses in its range are better, at least in ways that matter most to me. What one can say about zooms is that they are definitely more versatile than primes, although they may be slower. (I cannot believe that I have gotten myself into a prime vs zoom debate. My final word: People should use whatever suits them.) The only comment I would add is that this presupposes that we are considering designs of a similar age. As has already been stated, some of the wide Leica primes are relatively old designs, and I'm quite prepared to believe that a much more recently designed zoom could technically outperform an older prime design. Whether one prefers the look of the images produced is a quite different matter, especially since rendering that appears pleasing to any one individual observer might even be caused by technical imperfections.", "link": "https://www.l-camera-forum.com/topic/287074-21-35-28-90-or-35-70-vario/page/2/?tab=comments#comment-3565976", "origin": "L-forum", "suborigin": "287074-21-35-28-90-or-35-70-vario", "result": true, "Selector": "we are considering designs", "selectorShort": "design", "MarkedSent": "erwin puts is entitled to his opinion, and who am i to question such an expert? but i am pretty sure that leica uses their best skill and knowledge in designing their prime lenses, just as they do their zoom lenses. common sense tells us that it is virtually impossible to design a single zoom that can perform as well at all focal lengths as corresponding primes. as an example, the sl 24-90 is regarded by many as the finest zoom lens in its range that has ever been produced, and it is indeed a very fine lens. yet i can tell you from personal experience that my prime lenses in its range are better, at least in ways that matter most to me. what one can say about zooms is that they are definitely more versatile than primes, although they may be slower. (i cannot believe that i have gotten myself into a prime vs zoom debate. my final word: people should use whatever suits them.) the only comment i would add is that this presupposes that -----> we !!!  -----> are !!!  -----> considering !!!  -----> designs !!!  of a similar age. as has already been stated, some of the wide leica primes are relatively old designs, and i'm quite prepared to believe that a much more recently designed zoom could technically outperform an older prime design. whether one prefers the look of the images produced is a quite different matter, especially since rendering that appears pleasing to any one individual observer might even be caused by technical imperfections.", "sortedWord": "None", "Identifyer": null, "identifyer": 23460, "year": "2018"}, {"autor": "ZHNL", "date": "2018-08-20 23:38:00", "content": " Me too. Alas the Thalia lenses cost over $25000 each. I think even if I had that kind of money, it'd be the opposite of fun using them. The Thalias do cover an image circle of 60mm in diameter, which is larger than the S but a bit smaller than the 66mm required by the 100MP Sony sensor at 4:3, at least on paper. Based on Leica S vignette and bokeh performance on S, I feel designed S lens must have bigger image circle than S. S glass never has corner issue of heavy vignette or funky bokeh I saw normally associate with 35mm system. (R and M glass included) This is one of the reason I like output from S lens combine with the sensor.", "link": "https://www.l-camera-forum.com/topic/276582-s-008/page/8/?tab=comments#comment-3575977", "origin": "L-forum", "suborigin": "276582-s-008", "result": true, "Selector": "i feel designed", "selectorShort": "design", "MarkedSent": " me too. alas the thalia lenses cost over $25000 each. i think even if i had that kind of money, it'd be the opposite of fun using them. the thalias do cover an image circle of 60mm in diameter, which is larger than the s but a bit smaller than the 66mm required by the 100mp sony sensor at 4:3, at least on paper. based on leica s vignette and bokeh performance on s, -----> i !!!  -----> feel !!!  -----> designed !!!  s lens must have bigger image circle than s. s glass never has corner issue of heavy vignette or funky bokeh i saw normally associate with 35mm system. (r and m glass included) this is one of the reason i like output from s lens combine with the sensor.", "sortedWord": "None", "Identifyer": null, "identifyer": 32627, "year": "2018"}, {"autor": "xiaubauu2009", "date": "2018-08-21 03:14:00", "content": "Based on Leica S vignette and bokeh performance on S, I feel designed S lens must have bigger image circle than S. S glass never has corner issue of heavy vignette or funky bokeh I saw normally associate with 35mm system. (R and M glass included) This is one of the reason I like output from S lens combine with the sensor. I think they should be bigger. But they physically cut off as I have tried that on Hasselblad HCD lens which is also only meant to resolve 44x33 sensor. They have a hard cut off in their image circle when adapting it to Alpa FPS + IQ3100mp. Leica is never going to do a larger than 45x30 sensor, so no point making the image circle bigger. I think they go down the same route as Hasselblad. Design the image capability to be bigger and then cut off the edge and only use the sweet spot. That might just explain why it has almost no vignette most of the time. 135 lens use the same tactic too nowadays, Otus... even Sigma.... have you seen the latest 105mm f/1.4... with the 105mm filter thread?", "link": "https://www.l-camera-forum.com/topic/276582-s-008/page/8/?tab=comments#comment-3576031", "origin": "L-forum", "suborigin": "276582-s-008", "result": true, "Selector": "i feel designed", "selectorShort": "design", "MarkedSent": "based on leica s vignette and bokeh performance on s, -----> i !!!  -----> feel !!!  -----> designed !!!  s lens must have bigger image circle than s. s glass never has corner issue of heavy vignette or funky bokeh i saw normally associate with 35mm system. (r and m glass included) this is one of the reason i like output from s lens combine with the sensor. i think they should be bigger. but they physically cut off as i have tried that on hasselblad hcd lens which is also only meant to resolve 44x33 sensor. they have a hard cut off in their image circle when adapting it to alpa fps + iq3100mp. leica is never going to do a larger than 45x30 sensor, so no point making the image circle bigger. i think they go down the same route as hasselblad. design the image capability to be bigger and then cut off the edge and only use the sweet spot. that might just explain why it has almost no vignette most of the time. 135 lens use the same tactic too nowadays, otus... even sigma.... have you seen the latest 105mm f/1.4... with the 105mm filter thread?", "sortedWord": "None", "Identifyer": null, "identifyer": 32628, "year": "2018"}, {"autor": "dkCambridgeshire", "date": "2018-06-04 08:24:00", "content": "Far too much wishful and unrealistic thinking in this thread thus likely to be some disappointments when the official announcement is made. Maybe forum members should consider Jono's comments more carefully. He is one of those who would have been testing whatever is to be announced so his hints as to \"what it's not gong to be\" are likely correct. And few forum members seem to fully appreciate that whatever is in the pipeline has been in development for many many months. Designing and developing a new camera and producing prototypes takes at least two years … plus another 3 or 4 months to test it … and the same with lenses. And it's a major logistical exercise to put them into production; it cannot be done overnight. Best to be patient and wait for the official announcement and avoid all the usual second-guessing hysteria and false hopes. \"Calm down dears … calm down --img--  \" dunk Edited June 4, 2018 by dkCambridgeshire", "link": "https://www.l-camera-forum.com/topic/285080-leica-cm-ml-new-leica-mirrorless-announcement/page/10/?tab=comments#comment-3531256", "origin": "L-forum", "suborigin": "285080-leica-cm-ml-new-leica-mirrorless-announcement", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "far too much wishful and unrealistic thinking in this thread thus likely to be some disappointments when the official announcement is made. maybe forum members should consider jono's comments more carefully. he is one of those who would have been testing whatever is to be announced so his hints as to \"what it's not gong to be\" are likely correct. and few forum members seem to fully appreciate that whatever is in the pipeline has been in development for many many months. -----> designing !!!  and developing a new camera and producing prototypes takes at least two years … plus another 3 or 4 months to test it … and the same with lenses. and it's a major logistical exercise to put them into production; it cannot be done overnight. best to be patient and wait for the official announcement and avoid all the usual second-guessing hysteria and false hopes. \"calm down dears … calm down --img--  \" dunk edited june 4, 2018 by dkcambridgeshire", "sortedWord": "None", "Identifyer": null, "identifyer": 78505, "year": "2018"}, {"autor": "Alistairm", "date": "2018-06-04 10:24:00", "content": "Far too much wishful and unrealistic thinking in this thread thus likely to be some disappointments when the official announcement is made. Maybe forum members should consider Jono's comments more carefully. He is one of those who would have been testing whatever is to be announced so his hints as to \"what it's not gong to be\" are likely correct. And few forum members seem to fully appreciate that whatever is in the pipeline has been in development for many many months. Designing and developing a new camera and producing prototypes takes at least two years … plus another 3 or 4 months to test it … and the same with lenses. And it's a major logistical exercise to put them into production; it cannot be done overnight. Best to be patient and wait for the official announcement and avoid all the usual second-guessing hysteria and false hopes. \"Calm down dears … calm down --img--  \" dunk There is nothing wrong with dreaming. It's an internet forum, not some endeavour requiring accuracy and a measured approach.", "link": "https://www.l-camera-forum.com/topic/285080-leica-cm-ml-new-leica-mirrorless-announcement/page/10/?tab=comments#comment-3531312", "origin": "L-forum", "suborigin": "285080-leica-cm-ml-new-leica-mirrorless-announcement", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "far too much wishful and unrealistic thinking in this thread thus likely to be some disappointments when the official announcement is made. maybe forum members should consider jono's comments more carefully. he is one of those who would have been testing whatever is to be announced so his hints as to \"what it's not gong to be\" are likely correct. and few forum members seem to fully appreciate that whatever is in the pipeline has been in development for many many months. -----> designing !!!  and developing a new camera and producing prototypes takes at least two years … plus another 3 or 4 months to test it … and the same with lenses. and it's a major logistical exercise to put them into production; it cannot be done overnight. best to be patient and wait for the official announcement and avoid all the usual second-guessing hysteria and false hopes. \"calm down dears … calm down --img--  \" dunk there is nothing wrong with dreaming. it's an internet forum, not some endeavour requiring accuracy and a measured approach.", "sortedWord": "None", "Identifyer": null, "identifyer": 78506, "year": "2018"}, {"autor": "plaidshirts", "date": "2018-04-30 16:17:00", "content": "A couple of friends of mine with professional backgrounds had built up the Leica legend in my mind while I was working as a designer and book layer-outerer at Lonely Planet. As my interest in photography grew and I became more acquainted with the masters of humanitarian documentary, the name came up again and again, which compounded the mystique. When I finally started thinking seriously about replacing my aging crop-frame Canon 350D, in 2009 there was a screaming hype online about the idea of a full frame digital Leica. I didn't want to go back to shooting film and didn't want to buy a crop frame camera, but there seemed to be a debate raging about whether a full frame M was even physically possible (this was before the advent of micro-lenses). When the M9 was released was star-struck and determined to get one, but it was way out of reach, financially. Months later, I became friends with a new guy at work who seemed to share every interest of mine, including photography. When the conversation finally came around to Leica and I talked about how I was desperate to try one he said, \"Oh, I have an M6. I'll lend it to you for a few months.\" Three months with the M6TTL and 50 Lux sealed the love affair, although with inconsistent results. I talked about it constantly at home, to my wife's chagrin — \"We can't afford a camera that costs thousands of dollars!\" \"I don't need to afford it!\" I said, \"I just need to find a way of getting one!\" I'd managed to barter my way into a custom bicycle in the past by exchanging design work for labor and figured there must be a similar avenue with the Leica. The guy at work had put down a deposit on an M9 and told me that he would be willing to sell me the M6 cheaply on condition that I lend it back to him if he missed shooting film. One day while chewing the ear off another friend about Leica, he told me he thought the brand had become pretentious — \"It's just a very simple camera with luxury marketing. And the simpler it gets the more pretentious the claims are. They should make a pinhole camera, charge a fortune and market it as the most essential camera there is.\" That's it! I designed a little cardboard pinhole camera with a rectangular enclosure, and stole product photography from Leica's own website to map onto the box. With a small amount of money borrowed from a friend, I funded a print run of Leica-look-alke pinhole templates on heavy cardboard, scored along the fold lines, with instructions and a Sunny 16 exposure guide included. I designed and built a small website in the style of the leica-camera.com of the day, with a satirical \"Like-a\" red dot logo, and the most pretentious product copy I could come up with, connected to an ecommerce order form. At $20 each for a sheet of cardboard they were hand-crafted and approaching Veblen margins. With some creative Tweeting and some help from a few friends I managed to get picked up by the WIRED blog and a few others, and the orders started coming in. Much like the real Leica, some hated the idea of paying so much for so little, but many loved the idea and bought two or three for old friends who were Leicaphiles, or to add to a collection of other Leica paraphernalia. Eventually, I received a stern letter from Leica AG, scalding me for appropriating their logo and ordering a cease and desist. I complied of course, and told their Legal department that it was only a desire to buy one of their products that lead to all this. I tallied up the takings and was close enough to make an offer on the M6 and 35 Cron. I shot that camera and lens at the exclusion of all else for two or three years and found it punishing. The first three months produced the worst pictures I've ever taken. Out of focus, under exposed, just generally crap. But as each month went by I learned the camera intuitively and the pictures got better. When the Typ 240 was released, the same friend upgraded again, and I traded him back the M6 and some cash in exchange for the M9. I loved the M9, but it eventually succumbed to the sensor corrosion issue and when Leica offered an M or M-P upgrade I jumped to the M-P. The M10 is tempting, but I'll hold off for at least another generation (unless maybe there's an M10-P or Safari that's just too good to pass up). Here's one of the very first pictures: https://www.flickr.com/photos/stevecaddy/4998550764/in/album-72157624849932129/lightbox/ What a great story! That's real love and dedication right there.", "link": "https://www.l-camera-forum.com/topic/242491-your-first-leica-tell-your-story/page/6/?tab=comments#comment-3509828", "origin": "L-forum", "suborigin": "242491-your-first-leica-tell-your-story", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "a couple of friends of mine with professional backgrounds had built up the leica legend in my mind while i was working as a designer and book layer-outerer at lonely planet. as my interest in photography grew and i became more acquainted with the masters of humanitarian documentary, the name came up again and again, which compounded the mystique. when i finally started thinking seriously about replacing my aging crop-frame canon 350d, in 2009 there was a screaming hype online about the idea of a full frame digital leica. i didn't want to go back to shooting film and didn't want to buy a crop frame camera, but there seemed to be a debate raging about whether a full frame m was even physically possible (this was before the advent of micro-lenses). when the m9 was released was star-struck and determined to get one, but it was way out of reach, financially. months later, i became friends with a new guy at work who seemed to share every interest of mine, including photography. when the conversation finally came around to leica and i talked about how i was desperate to try one he said, \"oh, i have an m6. i'll lend it to you for a few months.\" three months with the m6ttl and 50 lux sealed the love affair, although with inconsistent results. i talked about it constantly at home, to my wife's chagrin — \"we can't afford a camera that costs thousands of dollars!\" \"i don't need to afford it!\" i said, \"i just need to find a way of getting one!\" i'd managed to barter my way into a custom bicycle in the past by exchanging design work for labor and figured there must be a similar avenue with the leica. the guy at work had put down a deposit on an m9 and told me that he would be willing to sell me the m6 cheaply on condition that i lend it back to him if he missed shooting film. one day while chewing the ear off another friend about leica, he told me he thought the brand had become pretentious — \"it's just a very simple camera with luxury marketing. and the simpler it gets the more pretentious the claims are. they should make a pinhole camera, charge a fortune and market it as the most essential camera there is.\" that's it! -----> i !!!  -----> designed !!!  a little cardboard pinhole camera with a rectangular enclosure, and stole product photography from leica's own website to map onto the box. with a small amount of money borrowed from a friend, i funded a print run of leica-look-alke pinhole templates on heavy cardboard, scored along the fold lines, with instructions and a sunny 16 exposure guide included. i designed and built a small website in the style of the leica-camera.com of the day, with a satirical \"like-a\" red dot logo, and the most pretentious product copy i could come up with, connected to an ecommerce order form. at $20 each for a sheet of cardboard they were hand-crafted and approaching veblen margins. with some creative tweeting and some help from a few friends i managed to get picked up by the wired blog and a few others, and the orders started coming in. much like the real leica, some hated the idea of paying so much for so little, but many loved the idea and bought two or three for old friends who were leicaphiles, or to add to a collection of other leica paraphernalia. eventually, i received a stern letter from leica ag, scalding me for appropriating their logo and ordering a cease and desist. i complied of course, and told their legal department that it was only a desire to buy one of their products that lead to all this. i tallied up the takings and was close enough to make an offer on the m6 and 35 cron. i shot that camera and lens at the exclusion of all else for two or three years and found it punishing. the first three months produced the worst pictures i've ever taken. out of focus, under exposed, just generally crap. but as each month went by i learned the camera intuitively and the pictures got better. when the typ 240 was released, the same friend upgraded again, and i traded him back the m6 and some cash in exchange for the m9. i loved the m9, but it eventually succumbed to the sensor corrosion issue and when leica offered an m or m-p upgrade i jumped to the m-p. the m10 is tempting, but i'll hold off for at least another generation (unless maybe there's an m10-p or safari that's just too good to pass up). here's one of the very first pictures: https://www.flickr.com/photos/stevecaddy/4998550764/in/album-72157624849932129/lightbox/ what a great story! that's real love and dedication right there.", "sortedWord": "None", "Identifyer": null, "identifyer": 82180, "year": "2018"}, {"autor": "adan", "date": "2018-08-24 15:38:00", "content": "Actually, I was more thinking of the vast improvements in computer hard- and software... True - and the Leica SL and APO-M 50 Summicrons are designed that way (and priced that way). As an aside, showing a picture at the size of a large iPad just reveals nothing important about fine sharpness and clarity. Jon's \"whole picture\" example looks fine, also - he had to show us the cropped details to reveal what was troubling him. Jon, to me, what you are getting is about what I've always seen from the v.4/5 Summicron. Prior to the Summarit lenses, it has always been Leica's \"entry-level\" M lens - the cheapest in the line. The one they used to throw into a kit with an M body, total price discounted $500/£400. Designed to a price point, and to work very well on middle-ISO gelatin film. - 60%+ contrast at 40 lppm, over most of the picture, at f/5.6. It is also what I was getting at in the \"End of the M\" thread - don't get too excited about 48 Mp until you have actually tried some of the M lenses, especially the ones designed in the film era and not revised for digital. There's a reason the APO-Summicron costs 3 times as much as the base Summicron. The only authoritative \"second opinion\" you can get is to send this lens to Leica themselves and ask if it is performing within specs. My experience says that they will say \"Yes, that is within specs at f/4.8.\" The good news is that this is \"gaussian\" blurring that responds rather well to digital sharpening algorithms, up to a point. Edited August 24, 2018 by adan", "link": "https://www.l-camera-forum.com/topic/287700-summicron-50mm-f2-type-5-sharpness/?tab=comments#comment-3578554", "origin": "L-forum", "suborigin": "287700-summicron-50mm-f2-type-5-sharpness", "result": false, "Selector": "designed", "selectorShort": "design", "MarkedSent": "designed to a price point, and to work very well on middle-iso gelatin -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 24071, "year": "2018"}, {"autor": "wlaidlaw", "date": "2018-12-09 17:42:00", "content": "26 minutes ago, willeica said: Thanks George. I am waiting on the report from Jerzy about the Oberlaender Ur replica. If there is any person who can tell us how Mr Oberlaender constructed his camera, it is Jerzy. It would be fascinating to see if he managed to get the frame counter to work. I have looked at this on photos of the original and there must be some little gear wheel arrangement to get the counter to turn in a different plane from the wind knob. The drawing on page 46 of Richter's book shows a spindle behind the frame counter but not how this is turned. William William, If I were to design the film counter, I would put a peg type cog at the top of the shaft running up from the frame counter with probably 6 or 8 pegs. These pegs on the cog would be struck by a peg in the wind on shaft and rotate say 1/8th of a turn at each turn of the wind on spindle. There would then be a 5:1 bevel gear at the bottom to rotate the frame counter. Then 40 frames would cause one rotation of the frame counter (8 x 5). This is the sort of technology that clock makers have used for years and would have been very familiar to the Wetzlar technicians. Wilson", "link": "https://www.l-camera-forum.com/topic/138638-working-ur-leica/page/9/?tab=comments#comment-3644549", "origin": "L-forum", "suborigin": "138638-working-ur-leica", "result": false, "Selector": "i were to design", "selectorShort": "design", "MarkedSent": "william william, if i were to design the -----> film !!!  counter, i would put a peg type cog at the top of the shaft running up from the frame counter with probably 6 or 8 pegs.", "sortedWord": "film", "Identifyer": null, "identifyer": 35829, "year": "2018"}, {"autor": "willeica", "date": "2018-12-09 19:03:00", "content": "1 hour ago, wlaidlaw said: William, If I were to design the film counter, I would put a peg type cog at the top of the shaft running up from the frame counter with probably 6 or 8 pegs. These pegs on the cog would be struck by a peg in the wind on shaft and rotate say 1/8th of a turn at each turn of the wind on spindle. There would then be a 5:1 bevel gear at the bottom to rotate the frame counter. Then 40 frames would cause one rotation of the frame counter (8 x 5). This is the sort of technology that clock makers have used for years and would have been very familiar to the Wetzlar technicians. ﻿ Wilson Thanks Wilson. Let's see what Jerzy finds. I am aware of such mechanisms in clocks etc, but there would have been other items inside the UR Leica body. Leitz moved the frame counter to the top before series production commenced, where it remained for the next 90 + years. William", "link": "https://www.l-camera-forum.com/topic/138638-working-ur-leica/page/9/?tab=comments#comment-3644602", "origin": "L-forum", "suborigin": "138638-working-ur-leica", "result": false, "Selector": "i were to design", "selectorShort": "design", "MarkedSent": "1 hour ago, wlaidlaw said: william, if i were to design the -----> film !!!  counter, i would put a peg type cog at the top of the shaft running up from the frame counter with probably 6 or 8 pegs.", "sortedWord": "film", "Identifyer": null, "identifyer": 35830, "year": "2018"}], "name": "Leicasortedout2018design"}