{"interestingcomments": [{"autor": "euston", "date": "2013-06-25 19:34:00", "content": " Some low light photos taken in Winchester Cathedral with ISO set to AUTO (max 3200). Lighting is dim, variable and mixed. WB was set to AUTO. I didn't use flash. Developed normally in ACR - nothing drastic. --img-- 49mm (equivalent) 1/50 at f/5.1 ISO 400 --img-- 70mm (equivalent) 1/30 at f/6.4 ISO 3200 --img-- 31mm (equivalent) 1/30 at f/4.1 ISO 250 --img-- 53mm (equivalent) 1/50 at f/5.3 ISO 800 --img-- 31mm (equivalent) 1/30 at f/5.6 ISO 1250", "link": "https://www.l-camera-forum.com/topic/206939-leica-x-vario-photos/page/2/?tab=comments#comment-2358509", "origin": "L-forum", "suborigin": "206939-leica-x-vario-photos", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": " some low light photos taken in winchester cathedral with iso set to auto (max 3200). lighting is dim, variable and mixed. wb was set to auto. i didn't use flash. -----> developed !!!  normally in acr - nothing drastic. --img-- 49mm (equivalent) 1/50 at f/5.1 iso 400 --img-- 70mm (equivalent) 1/30 at f/6.4 iso 3200 --img-- 31mm (equivalent) 1/30 at f/4.1 iso 250 --img-- 53mm (equivalent) 1/50 at f/5.3 iso 800 --img-- 31mm (equivalent) 1/30 at f/5.6 iso 1250", "sortedWord": "None", "Identifyer": null, "identifyer": 8644, "year": "2013"}, {"autor": "dkCambridgeshire", "date": "2013-06-25 20:12:00", "content": "Some low light photos taken in Winchester Cathedral with ISO set to AUTO (max 3200). Lighting is dim, variable and mixed. WB was set to AUTO. I didn't use flash. Developed normally in ACR - nothing drastic. Thanks for posting; your pics have inspired me to plan a P'bor Cathedral interior walkabout with my X Vario --img--  dunk", "link": "https://www.l-camera-forum.com/topic/206939-leica-x-vario-photos/page/2/?tab=comments#comment-2358553", "origin": "L-forum", "suborigin": "206939-leica-x-vario-photos", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "some low light photos taken in winchester cathedral with iso set to auto (max 3200). lighting is dim, variable and mixed. wb was set to auto. i didn't use flash. -----> developed !!!  normally in acr - nothing drastic. thanks for posting; your pics have inspired me to plan a p'bor cathedral interior walkabout with my x vario --img--  dunk", "sortedWord": "None", "Identifyer": null, "identifyer": 8645, "year": "2013"}, {"autor": "gsgary", "date": "2013-07-22 11:56:00", "content": "I forgot to mention i shot it at iso400 by mistake so i developed it in Rodinal 1+100 for 1 hour 5 inversions then left it", "link": "https://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/page/13/?tab=comments#comment-2379912", "origin": "L-forum", "suborigin": "205842-i-like-filmopen-thread", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "-----> i !!!  forgot to mention -----> i !!!  shot it at iso400 by mistake so -----> i !!!  -----> developed !!!  it in rodinal 1+100 for 1 hour 5 inversions then left it", "sortedWord": "None", "Identifyer": null, "identifyer": 60794, "year": "2013"}, {"autor": "Cedric Agie de Selsaeten", "date": "2013-03-21 19:18:00", "content": "Anyone can tell his/her own developing tipe for Kodak Tri-X in D76? Just to cross-check with mine. Kodak Tri - X 400 in 400 asa Developing time: 11:30 kodak Tri - X 400 pushed 800 asa Developing time : 13:00 I'm also trying to find a correct time for Kodak T- Max 400 pushed at 400 , 800, 1600,3200. Developed in D76 as well. If you know, I'm pleased to get the correct time. Bye Annibale See Steve Anchell's books. Pushing T-Max films is differend. These films have special sensitive couplers that determine the speed of the film. In my opinion you better buy T-Max films with the speed you wish. You will have better results, that's what these films are made for. And concerning \"so called pushing\" B&W classic neg films, don't expect too much when you go over 800 or 1200 ASA.", "link": "https://www.l-camera-forum.com/topic/50424-developing-tri-x-in-d76/?tab=comments#comment-2278444", "origin": "L-forum", "suborigin": "50424-developing-tri-x-in-d76", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "anyone can tell his/her own developing tipe for kodak tri-x in d76? just to cross-check with mine. kodak tri - x 400 in 400 asa developing time: 11:30 kodak tri - x 400 pushed 800 asa developing time : 13:00 i'm also trying to find a correct time for kodak t- max 400 pushed at 400 , 800, 1600,3200. -----> developed !!!  in d76 as well. if you know, i'm pleased to get the correct time. bye annibale see steve anchell's books. pushing t-max films is differend. these films have special sensitive couplers that determine the speed of the film. in my opinion you better buy t-max films with the speed you wish. you will have better results, that's what these films are made for. and concerning \"so called pushing\" b&w classic neg films, don't expect too much when you go over 800 or 1200 asa.", "sortedWord": "None", "Identifyer": null, "identifyer": 107482, "year": "2013"}, {"autor": "kdriceman", "date": "2013-03-16 12:14:00", "content": "A couple things I learned the hard way when I restarted developing after a decade long hiatus. 1) I wear a Luminox watch with very bright hand illumination and didn't remove it. I don't know the impact of this on B&W film because: 2) I did not make my cellphone light tight and it was sitting right there beside my film and reel when someone called me, splashing light all over the place. There was some fogging on some frames. I now remove the watch and just use a changing bag instead of blacking out the room.", "link": "https://www.l-camera-forum.com/topic/186748-need-some-advice-re-equipment-for-bw-home-development/page/2/?tab=comments#comment-2273117", "origin": "L-forum", "suborigin": "186748-need-some-advice-re-equipment-for-bw-home-development", "result": true, "Selector": "i restarted developing", "selectorShort": "develop", "MarkedSent": "a couple things -----> i !!!  learned the hard way when -----> i !!!  -----> restarted !!!  -----> developing !!!  after a decade long hiatus. 1) i wear a luminox watch with very bright hand illumination and didn't remove it. i don't know the impact of this on b&w film because: 2) i did not make my cellphone light tight and it was sitting right there beside my film and reel when someone called me, splashing light all over the place. there was some fogging on some frames. i now remove the watch and just use a changing bag instead of blacking out the room.", "sortedWord": "None", "Identifyer": null, "identifyer": 107523, "year": "2013"}, {"autor": "philipus", "date": "2013-03-19 12:38:00", "content": "Hi Rolf Well I don't know how many I'll do at any given point but I guess I could develop several at once if that's necessary in order to use tanks of this size. I'm just now awaiting delivery of bulk rolls, incl 400 foot of Eastman 5222, as well as heaps of Tri-X, so I'll have enough to play with. But perhaps it is wasteful, thinking of the environment here, to use larger tanks than necessary? Cheers Philip", "link": "https://www.l-camera-forum.com/topic/186748-need-some-advice-re-equipment-for-bw-home-development/page/2/?tab=comments#comment-2276266", "origin": "L-forum", "suborigin": "186748-need-some-advice-re-equipment-for-bw-home-development", "result": true, "Selector": "i could develop", "selectorShort": "develop", "MarkedSent": "hi rolf well i don't know how many i'll do at any given point but -----> i !!!  guess -----> i !!!  -----> could !!!  -----> develop !!!  several at once if that's necessary in order to use tanks of this size. i'm just now awaiting delivery of bulk rolls, incl 400 foot of eastman 5222, as well as heaps of tri-x, so i'll have enough to play with. but perhaps it is wasteful, thinking of the environment here, to use larger tanks than necessary? cheers philip", "sortedWord": "None", "Identifyer": null, "identifyer": 107525, "year": "2013"}, {"autor": "philipus", "date": "2013-03-27 14:12:00", "content": "serious, I am often dissapointed with the service I get for E6 development. (not black and white I know) i get the slides back with plenty of scratches. Hi Rolf I have had more bad luck with b/w commercial deveopment actually, even from \"good\" labs it's a bit hit and miss (ie not a difference in kind - as in good labs always being better - but a difference - as in good labs less often being bad). The main problem is not scratches, though I've had that too, but stains which I find more difficult to clone away in post. My tank and steel reels arrived the other day. The tank came with an extra lid and seems very well built indeed. I think I'll be fine with such a big tank since I'll just develop when I've got enough to develop --img-- ", "link": "https://www.l-camera-forum.com/topic/186748-need-some-advice-re-equipment-for-bw-home-development/page/2/?tab=comments#comment-2283284", "origin": "L-forum", "suborigin": "186748-need-some-advice-re-equipment-for-bw-home-development", "result": true, "Selector": "i'll just develop", "selectorShort": "develop", "MarkedSent": "serious, i am often dissapointed with the service i get for e6 development. (not black and white i know) i get the slides back with plenty of scratches. hi rolf i have had more bad luck with b/w commercial deveopment actually, even from \"good\" labs it's a bit hit and miss (ie not a difference in kind - as in good labs always being better - but a difference - as in good labs less often being bad). the main problem is not scratches, though i've had that too, but stains which i find more difficult to clone away in post. my tank and steel reels arrived the other day. the tank came with an extra lid and seems very well built indeed. -----> i !!!  think -----> i !!! -----> 'll !!!  be fine with such a big tank since -----> i !!! -----> 'll !!!  -----> just !!!  -----> develop !!!  when -----> i !!! 've got enough to -----> develop !!!  --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 107527, "year": "2013"}, {"autor": "Renato Tonelli", "date": "2013-03-13 13:22:00", "content": " Found out about this Forum from a fellow APUG Forum member where I had posted a query on the M2 and M3 (I am considering purchasing the M2). Found a thread that answered my concerns about those two models quite succinctly. I live in New York City and spend six weeks or so every Summer in Italy where I was born and raised (Pontremoli in Tuscany). It is there that I tend to photograph more extensively. I currently own an M6 and an MP. I use them quite often to photograph Blues and Jazz musicians during live performances in NYC clubs, my children, etc. I own and use several cameras in various formats up to 8x10... but there is something about the feel of a Leica, isn't there?--img--  My photographs have appeared in a few music publications and some music CD covers/booklets and the like. I develop and print in a darkroom. Thank you for the informed and passionate discussions in the Forum.", "link": "https://www.l-camera-forum.com/topic/186962-welcome/page/2/?tab=comments#comment-2270056", "origin": "L-forum", "suborigin": "186962-welcome", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": " found out about this forum from a fellow apug forum member where i had posted a query on the m2 and m3 (i am considering purchasing the m2). found a thread that answered my concerns about those two models quite succinctly. i live in new york city and spend six weeks or so every summer in italy where i was born and raised (pontremoli in tuscany). it is there that i tend to photograph more extensively. i currently own an m6 and an mp. i use them quite often to photograph blues and jazz musicians during live performances in nyc clubs, my children, etc. i own and use several cameras in various formats up to 8x10... but there is something about the feel of a leica, isn't there?--img--  my photographs have appeared in a few music publications and some music cd covers/booklets and the like. -----> i !!!  -----> develop !!!  and print in a darkroom. thank you for the informed and passionate discussions in the forum.", "sortedWord": "None", "Identifyer": null, "identifyer": 113774, "year": "2013"}, {"autor": "markrune", "date": "2013-02-09 19:08:00", "content": "Great day out and nice to meet you all - I learned a lot especially thatt my CV Colour Skopar M was a Colour Skopr L with adapter. I can use it on my Leica III and the trick that if you set the saturation for JPG as Black and white, you can see the B&W image on the back whilst still retaining a colour RAW Image. Any way a few shots from the M8 , will post any from the M6 TTL when I get developed Cardinal --img--  Giles --img--  Reflections --img--  Radwald --img--  Stairs --img--  Broken Glass --img--  Edited February 9, 2013 by markrune", "link": "https://www.l-camera-forum.com/topic/197192-meeting-in-ipswich-february-2013/page/3/?tab=comments#comment-2238259", "origin": "L-forum", "suborigin": "197192-meeting-in-ipswich-february-2013", "result": true, "Selector": "i get developed", "selectorShort": "develop", "MarkedSent": "great day out and nice to meet you all - i learned a lot especially thatt my cv colour skopar m was a colour skopr l with adapter. i can use it on my leica iii and the trick that if you set the saturation for jpg as black and white, you can see the b&w image on the back whilst still retaining a colour raw image. any way a few shots from the m8 , will post any from the m6 ttl when -----> i !!!  -----> get !!!  -----> developed !!!  cardinal --img--  giles --img--  reflections --img--  radwald --img--  stairs --img--  broken glass --img--  edited february 9, 2013 by markrune", "sortedWord": "None", "Identifyer": null, "identifyer": 136616, "year": "2013"}, {"autor": "Doc Henry", "date": "2013-07-25 20:34:00", "content": "Very nice color , natural with beautiful red Thanks Peter Yes Peter, sometimes due to the development of the film by my laboratory, we have a dominant light yellow or blue that must be corrected I have a calibrated screen Enzo I will soon develop my own color film (C41) I wait for the water bath at 37 degrees Celsius in order now I will also have less scratches on my films I develop already black and white Best Henry", "link": "https://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/page/14/?tab=comments#comment-2382276", "origin": "L-forum", "suborigin": "205842-i-like-filmopen-thread", "result": false, "Selector": "i will soon develop", "selectorShort": "develop", "MarkedSent": "yes peter, sometimes due to the development of the -----> film !!!  by my laboratory, we have a dominant light yellow or blue that must be corrected i have a calibrated screen enzo i will soon develop my own color -----> film !!!  (c41)", "sortedWord": "film", "Identifyer": null, "identifyer": 60826, "year": "2013"}, {"autor": "lanetomlane", "date": "2013-01-17 13:13:00", "content": "I have a 503CX and three lenses. It hasn't been used in a while because my developing tank rolled off the draining board and cracked; and I was too lazy to find a replacement. However I've just bought a new Paterson on ebay and about to buy some B&W film. I then scan the negs using a Minolta Pro (which takes 120) and print. I also have an xpan but digital stitching is so good these days I can't see the point of using it. Anyone in the market for one? _______________ Cheers, Tom Photography by Tom Lane", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/10/?tab=comments#comment-2217171", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": false, "Selector": "my developing", "selectorShort": "develop", "MarkedSent": "it hasn't been used in a while because my developing tank -----> rolled !!!  off the draining board and cracked; and i was too lazy to find a replacement.", "sortedWord": "roll", "Identifyer": null, "identifyer": 103297, "year": "2013"}, {"autor": "Colin1974", "date": "2013-11-16 10:51:00", "content": "Yes, I'm open to that - after all, I happily use a digital camera and analogue facilities aren't as openly available as they used to be. Also, I can develop my own B&W films without much trouble (apart from my dexterity!). Can you recommend an inkjet printer that specialises in B&W/ greyscale printing? I used to have an inkjet printer, but could never get the colour balance right. I would certainly use a suitable B&W printer. Thanks again for your help. All the best, Colin.", "link": "https://www.l-camera-forum.com/topic/215835-a-suitable-enlarger/?tab=comments#comment-2466814", "origin": "L-forum", "suborigin": "215835-a-suitable-enlarger", "result": false, "Selector": "i can develop", "selectorShort": "develop", "MarkedSent": "also, i can develop my own b&w -----> films !!!  without much trouble (apart from my dexterity!).", "sortedWord": "film", "Identifyer": null, "identifyer": 107324, "year": "2013"}, {"autor": "}{B", "date": "2013-07-18 10:17:00", "content": " I'm using Ilford Delta100 and processing in Ilfosol3 at a ratio of 9 to 1 using a 450ml Jobo daylight loading tank. This allows me to process 11 films with a 500 ml bottle of Ilfosol but once opened it reacts with the air and starts to oxidize. I've found that after two months the remaining liquid has changed colour dramatically and I've so far limited myself to using it all within that time frame. If I develop film as soon as it is exposed this puts me under pressure to use 10 or 11 films within two months. As this is a hobby and sometimes the weather isn't fit or I don't want to go out under pressure to photograph just anything just to keep up with the clock I was wondering about storing exposed film in the fridge and only buying the liquid developer, fixer etc once I have built a stock of say five or six films. This of course could be several weeks or several months and I'm just wondering about possible effects on the final quality of the negatives of such storage. I've so far stored three films for just short of a month and the only effect I saw was that the negatives seemed to have more 'curl ' once cut. They were kept in the top of door of the fridge which isn't the coldest part but is a lot cooler than room temperature. I prefer to convenience of one shot liquid developer rather than mix my own from powder and even with powder the clock would be running once it was I started to use it.", "link": "https://www.l-camera-forum.com/topic/209085-storing-unprocessed-exposed-film/?tab=comments#comment-2377183", "origin": "L-forum", "suborigin": "209085-storing-unprocessed-exposed-film", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "if i develop -----> film !!!  as soon as it is exposed this puts me under pressure to use 10 or 11 films within two months.", "sortedWord": "film", "Identifyer": null, "identifyer": 107388, "year": "2013"}, {"autor": "joeswe", "date": "2013-07-18 12:04:00", "content": "I'm using Ilford Delta100 and processing in Ilfosol3 at a ratio of 9 to 1 using a 450ml Jobo daylight loading tank. This allows me to process 11 films with a 500 ml bottle of Ilfosol but once opened it reacts with the air and starts to oxidize. I've found that after two months the remaining liquid has changed colour dramatically and I've so far limited myself to using it all within that time frame. If I develop film as soon as it is exposed this puts me under pressure to use 10 or 11 films within two months. As this is a hobby and sometimes the weather isn't fit or I don't want to go out under pressure to photograph just anything just to keep up with the clock I was wondering about storing exposed film in the fridge and only buying the liquid developer, fixer etc once I have built a stock of say five or six films. This of course could be several weeks or several months and I'm just wondering about possible effects on the final quality of the negatives of such storage. I've so far stored three films for just short of a month and the only effect I saw was that the negatives seemed to have more 'curl ' once cut. They were kept in the top of door of the fridge which isn't the coldest part but is a lot cooler than room temperature. I prefer to convenience of one shot liquid developer rather than mix my own from powder and even with powder the clock would be running once it was I started to use it. Regarding film: Several weeks shouldn't be a problem for Delta 100, several months ... well I'm not so sure, I personally wouldn't risk it. Developer: Are you sure the developer is bad after two months? A change in color does not necessarily mean that the developer has turned bad. The Ilford datasheet says that Ilfosol 3 should be good for 4 months in half filled bottles at cool to normal (4-20°C) ambient temperatures. I guess you could further improve the storage properties by using a protective gas and/or dividing the concentrate into smaller portions that you store in appropriate glass bottles.", "link": "https://www.l-camera-forum.com/topic/209085-storing-unprocessed-exposed-film/?tab=comments#comment-2377234", "origin": "L-forum", "suborigin": "209085-storing-unprocessed-exposed-film", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "if i develop -----> film !!!  as soon as it is exposed this puts me under pressure to use 10 or 11 films within two months.", "sortedWord": "film", "Identifyer": null, "identifyer": 107389, "year": "2013"}, {"autor": "Hugh 38", "date": "2013-05-10 17:06:00", "content": " About two weeks ago I road tested a new purchase , an R4s mod 2 with a vario Elmar 35 to 70 ( ??) and used a roll of Ilford Pan F . I developed the film in ID11 , stop , fix and wash and it looked fine so I hung it up to dry . Later when I went to cut the film into strips I noticed there were no frame numbers and 'Ilford' was not along the top of the film , as most films have. Any ideas what may have gone wrong ? I have not tried to print from the film yet . The fixer appears to have ' cleared' the film . The negatives are not very contrasty as it was a cloudy day . I have had a look through my dark room books and found nothing . I think the film will print , as it looks fine. I had used the chemistry a few days earleir for a roll of Delta and that worked fine. The only thing I can think of is the film was dated August 1999 , but had been kept in the firdge or freezer all the time. Any sugestions ? Thanks", "link": "https://www.l-camera-forum.com/topic/204446-lost-frame-numbers/?tab=comments#comment-2318484", "origin": "L-forum", "suborigin": "204446-lost-frame-numbers", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i developed the -----> film !!!  in id11 , stop , fix and wash and it looked fine", "sortedWord": "film", "Identifyer": null, "identifyer": 107427, "year": "2013"}, {"autor": "StS", "date": "2013-04-27 17:58:00", "content": "Thinking about it, I developed my first film, when I was about twelve years old, so it should be pretty childproof. (--img-- ) Stefan", "link": "https://www.l-camera-forum.com/topic/203516-how-childproof-is-developing-at-home/?tab=comments#comment-2308825", "origin": "L-forum", "suborigin": "203516-how-childproof-is-developing-at-home", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "thinking about it, i developed my first -----> film !!! , when i was about twelve years old, so it should be pretty childproof.", "sortedWord": "film", "Identifyer": null, "identifyer": 107440, "year": "2013"}], "name": "Leicasortedout2013develop"}