{"interestingcomments": [{"autor": "Jaybob", "date": "2012-10-19 01:25:00", "content": "You have to separate this conversation into two different categories: IQ vs. usability. It isn't really a cheat or a short cut. It's just like pushing a slow film, which may not always be ideal in use, and can actually make proper exposure more difficult, rather than less. This isn't about short cuts, just discussing the nuance to sensor design and how different types of gains react. I disagree. I'd put any D3 file, one that's been properly ETTR'ed at 640 or 800 or 1000 or 1250 up against any photon noise balanced Pentax ISO-less but shot at 160 and then post processed \"exposure balanced\" file you can come up with. I understand WHAT you're saying, I just see no benefit to doing it that way. What I'm having a hard time getting past the nuances of are statements like \"It seems like you misunderstand how digital photography fundamentally works\" and \"You managed this far because camera makers decided to call camera gain \"ISO,\"\" and \"If the photographer doesn't understand the concept, I doubt a client would.\" and \"I'm not going to take the time to do tests which you can do on your own...\" Typing makes you seem like a douchebag...is that nuanced enough for you? Edited October 19, 2012 by Jaybob", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/7/?tab=comments#comment-2144824", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "you have to separate this conversation into two different categories: iq vs. usability. it isn't really a cheat or a short cut. it's just like pushing a slow film, which may not always be ideal in use, and can actually make proper exposure more difficult, rather than less. this isn't about short cuts, just discussing the nuance to sensor design and how different types of gains react. i disagree. i'd put any d3 file, one that's been properly ettr'ed at 640 or 800 or 1000 or 1250 -----> up !!!  against any photon noise balanced pentax iso-less but shot at 160 and then post processed \"exposure balanced\" file you can -----> come !!!  -----> up !!!  -----> with !!! . i understand what you're saying, i just see no benefit to doing it that way. what i'm having a hard time getting past the nuances of are statements like \"it seems like you misunderstand how digital photography fundamentally works\" and \"you managed this far because camera makers decided to call camera gain \"iso,\"\" and \"if the photographer doesn't understand the concept, i doubt a client would.\" and \"i'm not going to take the time to do tests which you can do on your own...\" typing makes you seem like a douchebag...is that nuanced enough for you? edited october 19, 2012 by jaybob", "sortedWord": "None", "Identifyer": null, "identifyer": 32664, "year": "2012"}, {"autor": "douglasf13", "date": "2012-10-19 03:16:00", "content": "I disagree. I'd put any D3 file, one that's been properly ETTR'ed at 640 or 800 or 1000 or 1250 up against any photon noise balanced Pentax ISO-less but shot at 160 and then post processed \"exposure balanced\" file you can come up with. I understand WHAT you're saying, I just see no benefit to doing it that way. What I'm having a hard time getting past the nuances of are statements like \"It seems like you misunderstand how digital photography fundamentally works\" and \"You managed this far because camera makers decided to call camera gain \"ISO,\"\" and \"If the photographer doesn't understand the concept, I doubt a client would.\" and \"I'm not going to take the time to do tests which you can do on your own...\" Typing makes you seem like a douchebag...is that nuanced enough for you? The above clearly shows that you still don't understand the concept, yet. The point isn't about comparing the D3 to a K-5. It's about comparing a given camera's in-camera analog or digital gain to the boost from a raw converter. If saying that you don't understand the concept is offensive, I apologize. I'm trying my best to explain it from every direction. In regards to my initial post, you said \"This statement, from beginning to end, is inaccurate, except for \"don't blow highlights.\" All I'm doing is trying to explain why it is accurate. No need to name call. Edited October 19, 2012 by douglasf13", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/7/?tab=comments#comment-2144846", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i disagree. i'd put any d3 file, one that's been properly ettr'ed at 640 or 800 or 1000 or 1250 -----> up !!!  against any photon noise balanced pentax iso-less but shot at 160 and then post processed \"exposure balanced\" file you can -----> come !!!  -----> up !!!  -----> with !!! . i understand what you're saying, i just see no benefit to doing it that way. what i'm having a hard time getting past the nuances of are statements like \"it seems like you misunderstand how digital photography fundamentally works\" and \"you managed this far because camera makers decided to call camera gain \"iso,\"\" and \"if the photographer doesn't understand the concept, i doubt a client would.\" and \"i'm not going to take the time to do tests which you can do on your own...\" typing makes you seem like a douchebag...is that nuanced enough for you? the above clearly shows that you still don't understand the concept, yet. the point isn't about comparing the d3 to a k-5. it's about comparing a given camera's in-camera analog or digital gain to the boost from a raw converter. if saying that you don't understand the concept is offensive, i apologize. i'm trying my best to explain it from every direction. in regards to my initial post, you said \"this statement, from beginning to end, is inaccurate, except for \"don't blow highlights.\" all i'm doing is trying to explain why it is accurate. no need to name call. edited october 19, 2012 by douglasf13", "sortedWord": "None", "Identifyer": null, "identifyer": 32665, "year": "2012"}, {"autor": "Lindolfi", "date": "2012-10-27 18:34:00", "content": "OK Jaybob, we have all been there: no time to change ISO. But in these conditions with this ISO it is not the best example to use as an argument in a thread on optimal exposure. But before you come up with another example: I fully understand your arguments and as I said, I think they are valid, but do not cover all the options in all conditions. Edited October 27, 2012 by Lindolfi", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/13/?tab=comments#comment-2152352", "origin": "L-forum", "suborigin": "159297-expose-to-the-right-ettr-or-underexpose", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "ok jaybob, we have all been there: no time to change iso. but in these conditions with this iso it is not the best example to use as an argument in a thread on optimal exposure. but before you -----> come !!!  -----> up !!!  -----> with !!!  another example: i fully understand your arguments and as i said, i think they are valid, but do not cover all the options in all conditions. edited october 27, 2012 by lindolfi", "sortedWord": "None", "Identifyer": null, "identifyer": 32796, "year": "2012"}, {"autor": "thrid", "date": "2012-06-16 17:31:00", "content": "I owned the 1.9 and sold it because it intruded too much in to the viewfinder and my copy flared quite strongly. I purchased the Ultron 2/28 almost 2 years ago and have no complaints. It doesn't have quite the bite of the Summicron ASPH, but it's probably as good as anything Dr Mandler would have come up with in the pre-ASPH days. Even at f2 it is perfectly useable. I've never experienced the focus shift issue, but then again, I don't shoot test charts. In the real world it simply hasn't showed up. IMO it's a nonissue that has been blown out of proportion, if for any reason because the 28mm focal length offers so much DOF when minimally stopped down. Build quality is very solid. There is little intrusion on the frame lines. The lens is compact and comes with a metal hood. You are not going to find a better fast 28 at this price. Edited June 16, 2012 by thrid", "link": "https://www.l-camera-forum.com/topic/181624-voigtlander-28mm-f2-or-f19-on-m9/?tab=comments#comment-2041530", "origin": "L-forum", "suborigin": "181624-voigtlander-28mm-f2-or-f19-on-m9", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i owned the 1.9 and sold it because it intruded too much in to the viewfinder and my copy flared quite strongly. i purchased the ultron 2/28 almost 2 years ago and have no complaints. it doesn't have quite the bite of the summicron asph, but it's probably as good as anything dr mandler would have -----> come !!!  -----> up !!!  -----> with !!!  in the pre-asph days. even at f2 it is perfectly useable. i've never experienced the focus shift issue, but then again, i don't shoot test charts. in the real world it simply hasn't showed up. imo it's a nonissue that has been blown out of proportion, if for any reason because the 28mm focal length offers so much dof when minimally stopped down. build quality is very solid. there is little intrusion on the frame lines. the lens is compact and comes with a metal hood. you are not going to find a better fast 28 at this price. edited june 16, 2012 by thrid", "sortedWord": "None", "Identifyer": null, "identifyer": 37268, "year": "2012"}, {"autor": "AlanG", "date": "2012-08-29 12:43:00", "content": "Well it looks to me that Leica is at least trying to come up with an acceptable solution and reassure customers about the M9 as best they can. But when the M9 first came out, I was under the impression it had the same LCD and electronics as the M8. If they used a new LCD and revised electronics why didn't they make it significantly better than what they ended up using? Was there nothing better in that form factor?", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/2/?tab=comments#comment-2098974", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "well it looks to me that leica is at least trying to -----> come !!!  -----> up !!!  -----> with !!!  an acceptable solution and reassure customers about the m9 as best they can. but when the m9 first came out, i was under the impression it had the same lcd and electronics as the m8. if they used a new lcd and revised electronics why didn't they make it significantly better than what they ended up using? was there nothing better in that form factor?", "sortedWord": "None", "Identifyer": null, "identifyer": 46461, "year": "2012"}, {"autor": "pklein", "date": "2012-08-29 19:47:00", "content": "I'm an M8 user. I've stayed out of the discussion until we could hear from Leica officially. I pretty much accepted that my M8 wouldn't be repairable after 10 years. But not after only the five years I've owned mine. Still, if reliable replacement LCDs don't exist, what can we do? While I don't like the situation, it seems that Leica has come up with a reasonable policy to deal with it. But we must all understand that the cost of a broken M8 LDC just went up considerably. If you were probably going to upgrade at some point anyway, it's OK. If the M8 stretched you financially and the LCD dies, and you're not able or willing to lay out close to the cost of another brand-new M8 to upgrade, you have a problem. Part of the anger expressed in this thread is really about the disconnect between what the Leica brand/mark stands for, and the realities of digital technology for a small company in a marketplace where the rules have been made by the giants of Japan, Inc. Leica marketing still capitalizes on the concept of the \"Lifetime Leica,\" but that just isn't real any more. Leica's heritage still lives in its optics and rangefinder, but as for the electronics, including the LCD, no. We will all be better off if we accept this reality. When you buy a Leica today, you are buying a camera that is partly the old Leica, and partly a piece of disposable consumer electronics. The company doesn't have the deep pockets and resources that Brand C and N do. So while you can be \"made whole\" again if your M8 LCD dies, it's going to be in the form of a pro-rated discount on the next model, and it's gonna cost you. So photographers, take Leica marketing, mythology and mysticism with several grains of salt. One-percenters and bling-chasers, keep believing, it will be good for Leica. --img--  By the way, hello to all my fellow HP RPN calculator users! I'm afflicted with that disease, too. --img--  --Peter", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/4/?tab=comments#comment-2099439", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i'm an m8 user. i've stayed out of the discussion until we could hear from leica officially. i pretty much accepted that my m8 wouldn't be repairable after 10 years. but not after only the five years i've owned mine. still, if reliable replacement lcds don't exist, what can we do? while i don't like the situation, it seems that leica has -----> come !!!  -----> up !!!  -----> with !!!  a reasonable policy to deal -----> with !!!  it. but we must all understand that the cost of a broken m8 ldc just went up considerably. if you were probably going to upgrade at some point anyway, it's ok. if the m8 stretched you financially and the lcd dies, and you're not able or willing to lay out close to the cost of another brand-new m8 to upgrade, you have a problem. part of the anger expressed in this thread is really about the disconnect between what the leica brand/mark stands for, and the realities of digital technology for a small company in a marketplace where the rules have been made by the giants of japan, inc. leica marketing still capitalizes on the concept of the \"lifetime leica,\" but that just isn't real any more. leica's heritage still lives in its optics and rangefinder, but as for the electronics, including the lcd, no. we will all be better off if we accept this reality. when you buy a leica today, you are buying a camera that is partly the old leica, and partly a piece of disposable consumer electronics. the company doesn't have the deep pockets and resources that brand c and n do. so while you can be \"made whole\" again if your m8 lcd dies, it's going to be in the form of a pro-rated discount on the next model, and it's gonna cost you. so photographers, take leica marketing, mythology and mysticism with several grains of salt. one-percenters and bling-chasers, keep believing, it will be good for leica. --img--  by the way, hello to all my fellow hp rpn calculator users! i'm afflicted with that disease, too. --img--  --peter", "sortedWord": "None", "Identifyer": null, "identifyer": 46512, "year": "2012"}, {"autor": "iedei", "date": "2012-09-04 15:08:00", "content": "So Leica should buy the film division of Kodak so we can have Tri-X for the next 10 years? I had a LandRover Freelander, which had an engine made by Rover (car division). When Rover went out of business (nobody purchased it, and thus closed) so the supply of replacement engines ceased. In a short time after the supply new engines were used up, the rebuilt market went ballistic, $10,000 per rebuilt engine. And after that you could not even buy a rebuild, except on the black/grey market. Thus dooming my car to oblivion. But my Freelander lived on for several years... until all the major maintenance components got to be too expensive to deal with, and thus the vehicle was retired... So basically stuff happens, we deal with it and move on... you could have just put a different engine in it. it's done all the time in the automotive scene. and hence the difference between the automotive world and the camera world. the aftermarket service, options, and creativity present is massive----in the camera industry, it seems everyone is scared to touch a Leica. I think Leica should allow 3rd party makers to come up with creative solutions to problems they are currently not at priority to solve. andybarton is right----the exaggeration and overly stated problems being talked about in these threads have no basis. the M8 is otherwise a serviceable camera, with only one situation---and that is the LCD. no more, no less---as stated. Edited September 4, 2012 by iedei", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/9/?tab=comments#comment-2104796", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "so leica should buy the film division of kodak so we can have tri-x for the next 10 years? i had a landrover freelander, which had an engine made by rover (car division). when rover went out of business (nobody purchased it, and thus closed) so the supply of replacement engines ceased. in a short time after the supply new engines were used up, the rebuilt market went ballistic, $10,000 per rebuilt engine. and after that you could not even buy a rebuild, except on the black/grey market. thus dooming my car to oblivion. but my freelander lived on for several years... until all the major maintenance components got to be too expensive to deal with, and thus the vehicle was retired... so basically stuff happens, we deal with it and move on... you could have just put a different engine in it. it's done all the time in the automotive scene. and hence the difference between the automotive world and the camera world. the aftermarket service, options, and creativity present is massive----in the camera industry, it seems everyone is scared to touch a leica. i think leica should allow 3rd party makers to -----> come !!!  -----> up !!!  -----> with !!!  creative solutions to problems they are currently not at priority to solve. andybarton is right----the exaggeration and overly stated problems being talked about in these threads have no basis. the m8 is otherwise a serviceable camera, with only one situation---and that is the lcd. no more, no less---as stated. edited september 4, 2012 by iedei", "sortedWord": "None", "Identifyer": null, "identifyer": 46612, "year": "2012"}, {"autor": "DES", "date": "2012-09-04 16:02:00", "content": " you could have just put a different engine in it. it's done all the time in the automotive scene. and hence the difference between the automotive world and the camera world. the aftermarket service, options, and creativity present is massive----in the camera industry, it seems everyone is scared to touch a Leica. I think Leica should allow 3rd party makers to come up with creative solutions to problems they are currently not at priority to solve. andybarton is right----the exaggeration and overly stated problems being talked about in these threads have no basis. the M8 is otherwise a serviceable camera, with only one situation---and that is the LCD. no more, no less---as stated. This is way too simplistic. We have a £3000 camera body that leica has said cannot me repaired if the screen gets damaged. But don't worry M9 users you are still ok ! Sorry this is totally unacceptable. As I have said Leica has to nip this \"cannot be repaired\" comment in the bud, by telling us although this has been an issue, we have option a, b or c for our customers, at a cost of x y and z. Not if it happens go to your local store and see what they can offer you!!! Sorry guys it is just not good enough! Until they get a grip on this, who is going to buy a second hand M8? Not to mention !", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/10/?tab=comments#comment-2104849", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " you could have just put a different engine in it. it's done all the time in the automotive scene. and hence the difference between the automotive world and the camera world. the aftermarket service, options, and creativity present is massive----in the camera industry, it seems everyone is scared to touch a leica. i think leica should allow 3rd party makers to -----> come !!!  -----> up !!!  -----> with !!!  creative solutions to problems they are currently not at priority to solve. andybarton is right----the exaggeration and overly stated problems being talked about in these threads have no basis. the m8 is otherwise a serviceable camera, with only one situation---and that is the lcd. no more, no less---as stated. this is way too simplistic. we have a £3000 camera body that leica has said cannot me repaired if the screen gets damaged. but don't worry m9 users you are still ok ! sorry this is totally unacceptable. as i have said leica has to nip this \"cannot be repaired\" comment in the bud, by telling us although this has been an issue, we have option a, b or c for our customers, at a cost of x y and z. not if it happens go to your local store and see what they can offer you!!! sorry guys it is just not good enough! until they get a grip on this, who is going to buy a second hand m8? not to mention !", "sortedWord": "None", "Identifyer": null, "identifyer": 46613, "year": "2012"}, {"autor": "marknorton", "date": "2012-09-13 22:57:00", "content": "I'm not sure whether Leica think the issue is dealt with but I remain highly critical of the position they have taken. My simple 3 point plan for them is as follows: 1. Leica need to accept that statements made about products made to last a lifetime are incorrect and misleading to customers and should not be used to describe their products. 2. Leica need to make a clear statement about how long they guarantee spare parts availability for current and future digital products and then back that up with inventories of quality checked parts. I think most here would regard 10 years from end of production as a workable limit for the M9 on. 3. In the special case of the M8, Leica should retain the M9 upgrade offer but supplement it with a lower cost alternative where Leica will obtain used parts from used M8s to keep broken M8s working. Users would have to accept that replacement parts might be used, pay a lower price and receive a shorter repair warranty. I think these changes would be the best solution in the circumstances and of course, someone would have to decide how long this would run for the M8. I would say 6 years from end of production would be a good compromise. I daresay Leica and the bean counters would come up with a thousand reasons why not but it's only in this way they can salvage their reputation.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/16/?tab=comments#comment-2112433", "origin": "L-forum", "suborigin": "186718-serviceability-m8-m82-displays", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i'm not sure whether leica think the issue is dealt with but i remain highly critical of the position they have taken. my simple 3 point plan for them is as follows: 1. leica need to accept that statements made about products made to last a lifetime are incorrect and misleading to customers and should not be used to describe their products. 2. leica need to make a clear statement about how long they guarantee spare parts availability for current and future digital products and then back that up with inventories of quality checked parts. i think most here would regard 10 years from end of production as a workable limit for the m9 on. 3. in the special case of the m8, leica should retain the m9 upgrade offer but supplement it with a lower cost alternative where leica will obtain used parts from used m8s to keep broken m8s working. users would have to accept that replacement parts might be used, pay a lower price and receive a shorter repair warranty. i think these changes would be the best solution in the circumstances and of course, someone would have to decide how long this would run for the m8. i would say 6 years from end of production would be a good compromise. i daresay leica and the bean counters would -----> come !!!  -----> up !!!  -----> with !!!  a thousand reasons why not but it's only in this way they can salvage their reputation.", "sortedWord": "None", "Identifyer": null, "identifyer": 46752, "year": "2012"}, {"autor": "brianv", "date": "2012-10-13 23:13:00", "content": " A real Hack- from 4 different lenses. The Canon optics module missing the rear elements, focus mount with no optics module, retaining ring, and the rear group from a Nikkor. I could not come up with a rear fixture that would screw into place, so I wrapped the Nikkor fixture with copper tape and screwed it in. I tried a stand-off shim, but it interfered with the aperture closing down. The shim pressed against the mechanism. SO: I ended up getting the rear optic into place, tested close-up and infinity, tested flatness of field, and used JB-Weld to hold in place. Stuffed a foam strip in between the retaining ring and optics to act as a light baffle. These are all left-over parts, and I was curious to what it would all do when put together. AND- when someone on the forum uses the phrase \"Canikon\", i can reply- \"I have one of those.\" --img-- ", "link": "https://www.l-camera-forum.com/topic/268173-the-view-through-older-glass/page/14/?tab=comments#comment-2140817", "origin": "L-forum", "suborigin": "268173-the-view-through-older-glass", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " a real hack- from 4 different lenses. the canon optics module missing the rear elements, focus mount with no optics module, retaining ring, and the rear group from a nikkor. i could not -----> come !!!  -----> up !!!  -----> with !!!  a rear fixture that would screw into place, so i wrapped the nikkor fixture -----> with !!!  copper tape and screwed it in. i tried a stand-off shim, but it interfered with the aperture closing down. the shim pressed against the mechanism. so: i ended up getting the rear optic into place, tested close-up and infinity, tested flatness of field, and used jb-weld to hold in place. stuffed a foam strip in between the retaining ring and optics to act as a light baffle. these are all left-over parts, and i was curious to what it would all do when put together. and- when someone on the forum uses the phrase \"canikon\", i can reply- \"i have one of those.\" --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 7367, "year": "2012"}, {"autor": "adan", "date": "2012-04-03 00:14:00", "content": "After post #12, my head hurts. --img--  However: Question: Can someone please briefly indicate the derivation of the 1.5 number or point to a reference that does explain it? It is an approximation. We know the resolution of a sensor is not 1:1 with the spacing of the pixels, for a variety of reasons - Bayer pattern color distinctions; AA filters, or the aliasing artifacts one gets without AA filters, etc. We also know that it is often better, depending on subject detail, than the 1:2 relationship known as the Nyquist limit (at least 2 samples for every captured value - i.e. line of lens resolution). Therefore it is some number between 1 and 2, and 1.5 is the shorthand for \"somewhere between 1 and 2\". One might also note that since image details don't necessarily line up with the grid of pixels, in some cases the effective \"resolution\" will be between the centers of pixels with touching corners, which will be root 2 (1.41) times the sides of the pixels. \"So we get: • Leica M9: 145 pixel/mm corresponds to 96 lp/mm. • Nikon D800E: 205 pixel/mm corresponds to 137 lp/mm. • Sony NEX-7: 255 pixel/mm corresponds to 171 lp/mm. ... so long as one does not take into account any AA filtering, or other blurring. Some say there is noticeable loss of per-pixel resolution between the M8 and the M9, simply because the M9 has a thicker cover glass/IR filter (0.7mm vs. the M8's 0.5mm - I don't see it myself). The Nikon D800E uses a \"reversing\" AA filter - one blurring layer that supposedly cancels out the effect of the other blurring layer - which I doubt works perfectly, but no doubt restores some sharpness. The Sony Nex-7 has - who knows what level of AA filtering (fairly little, from the samples I've seen, but probably not zero). It seems to me you are trying to come up with hard, quantitative results based on data that is going to, by necessity (and literally, when it comes to AA filters) always be \"fuzzy.\" Lots of things that Sony or Nikon or Leica know, but are not public domain. You can probably find Modern or Pop. Photography reviews** of some of your earlier lenses that gives the resolution the magazine measured on an optical bench (they used to do that, pre-1980s). But if the review reports \"87 lppm at f/8\" - well, the next lens off the assembly line might have tested at 83 lines, or 90 lines. **My college library had MP or PP back-issues, in hard copy, from 1945-1980 at one point.", "link": "https://www.l-camera-forum.com/topic/176168-mtf-curves-~-sensor-resolution/?tab=comments#comment-1971651", "origin": "L-forum", "suborigin": "176168-mtf-curves-~-sensor-resolution", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "after post #12, my head hurts. --img--  however: question: can someone please briefly indicate the derivation of the 1.5 number or point to a reference that does explain it? it is an approximation. we know the resolution of a sensor is not 1:1 with the spacing of the pixels, for a variety of reasons - bayer pattern color distinctions; aa filters, or the aliasing artifacts one gets without aa filters, etc. we also know that it is often better, depending on subject detail, than the 1:2 relationship known as the nyquist limit (at least 2 samples for every captured value - i.e. line of lens resolution). therefore it is some number between 1 and 2, and 1.5 is the shorthand for \"somewhere between 1 and 2\". one might also note that since image details don't necessarily line up with the grid of pixels, in some cases the effective \"resolution\" will be between the centers of pixels with touching corners, which will be root 2 (1.41) times the sides of the pixels. \"so we get: • leica m9: 145 pixel/mm corresponds to 96 lp/mm. • nikon d800e: 205 pixel/mm corresponds to 137 lp/mm. • sony nex-7: 255 pixel/mm corresponds to 171 lp/mm. ... so long as one does not take into account any aa filtering, or other blurring. some say there is noticeable loss of per-pixel resolution between the m8 and the m9, simply because the m9 has a thicker cover glass/ir filter (0.7mm vs. the m8's 0.5mm - i don't see it myself). the nikon d800e uses a \"reversing\" aa filter - one blurring layer that supposedly cancels out the effect of the other blurring layer - which i doubt works perfectly, but no doubt restores some sharpness. the sony nex-7 has - who knows what level of aa filtering (fairly little, from the samples i've seen, but probably not zero). it seems to me you are trying to -----> come !!!  -----> up !!!  -----> with !!!  hard, quantitative results based on data that is going to, by necessity (and literally, when it comes to aa filters) always be \"fuzzy.\" lots of things that sony or nikon or leica know, but are not public domain. you can probably find modern or pop. photography reviews** of some of your earlier lenses that gives the resolution the magazine measured on an optical bench (they used to do that, pre-1980s). but if the review reports \"87 lppm at f/8\" - well, the next lens off the assembly line might have tested at 83 lines, or 90 lines. **my college library had mp or pp back-issues, in hard copy, from 1945-1980 at one point.", "sortedWord": "None", "Identifyer": null, "identifyer": 91838, "year": "2012"}, {"autor": "k-hawinkler", "date": "2012-04-03 17:17:00", "content": "After post #12, my head hurts. --img--  However: Question: Can someone please briefly indicate the derivation of the 1.5 number or point to a reference that does explain it? It is an approximation. We know the resolution of a sensor is not 1:1 with the spacing of the pixels, for a variety of reasons - Bayer pattern color distinctions; AA filters, or the aliasing artifacts one gets without AA filters, etc. We also know that it is often better, depending on subject detail, than the 1:2 relationship known as the Nyquist limit (at least 2 samples for every captured value - i.e. line of lens resolution). Therefore it is some number between 1 and 2, and 1.5 is the shorthand for \"somewhere between 1 and 2\". One might also note that since image details don't necessarily line up with the grid of pixels, in some cases the effective \"resolution\" will be between the centers of pixels with touching corners, which will be root 2 (1.41) times the sides of the pixels. [u]\"So we get: • Leica M9: 145 pixel/mm corresponds to 96 lp/mm. • Nikon D800E: 205 pixel/mm corresponds to 137 lp/mm. • Sony NEX-7: 255 pixel/mm corresponds to 171 lp/mm.[/u] ... so long as one does not take into account any AA filtering, or other blurring. Some say there is noticeable loss of per-pixel resolution between the M8 and the M9, simply because the M9 has a thicker cover glass/IR filter (0.7mm vs. the M8's 0.5mm - I don't see it myself). The Nikon D800E uses a \"reversing\" AA filter - one blurring layer that supposedly cancels out the effect of the other blurring layer - which I doubt works perfectly, but no doubt restores some sharpness. The Sony Nex-7 has - who knows what level of AA filtering (fairly little, from the samples I've seen, but probably not zero). It seems to me you are trying to come up with hard, quantitative results based on data that is going to, by necessity (and literally, when it comes to AA filters) always be \"fuzzy.\" Lots of things that Sony or Nikon or Leica know, but are not public domain. You can probably find Modern or Pop. Photography reviews** of some of your earlier lenses that gives the resolution the magazine measured on an optical bench (they used to do that, pre-1980s). But if the review reports \"87 lppm at f/8\" - well, the next lens off the assembly line might have tested at 83 lines, or 90 lines. **My college library had MP or PP back-issues, in hard copy, from 1945-1980 at one point. Andy, Thanks for your post. As always very informative. Sorry if I gave you a headache with this thread. We got quite a bit of wet snow over night. It brought down a power line in the neighborhood and we were without power until a few minutes ago, so my computers were cut off the Internet. Maybe I should explain briefly what I hope to get out of this thread. Basically, at a minimum, a rough estimate of Leica lens resolution limits as they developed over time, and hopefully accurate numbers for some lenses. Despite power loss, I was able to read on my iPad some older material of Erwin Puts that I had downloaded before and found some more useful information about Leica lens resolution limits. I plan to summarize that later. If I understand you correctly, then the corresponding line pairs per mm numbers I computed for the three different sensors should be viewed as upper limits due to the effects you describe. And 01af seems to imply to cut back the numbers even further by another factor of 2. Interesting. With regards to the D800E, a Nikon manager stated in an interview, that for cost reasons in order to have the same register distance for the D800 and D800E, they left the first part of the filter in the D800E. This splits the signal in two. So, instead of splitting it again subsequently (in the other direction) as in the D800, they just recombine the split signals, effectively canceling the first split. I doubt Nikon will release the D800E to market unless they convinced themselves of a satisfactorily implementation. Thanks also for the pointers to Modern or Pop. Photography reviews. I will see what my local library has. Many thanks again. I appreciate your help.", "link": "https://www.l-camera-forum.com/topic/176168-mtf-curves-~-sensor-resolution/?tab=comments#comment-1972324", "origin": "L-forum", "suborigin": "176168-mtf-curves-~-sensor-resolution", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "after post #12, my head hurts. --img--  however: question: can someone please briefly indicate the derivation of the 1.5 number or point to a reference that does explain it? it is an approximation. we know the resolution of a sensor is not 1:1 with the spacing of the pixels, for a variety of reasons - bayer pattern color distinctions; aa filters, or the aliasing artifacts one gets without aa filters, etc. we also know that it is often better, depending on subject detail, than the 1:2 relationship known as the nyquist limit (at least 2 samples for every captured value - i.e. line of lens resolution). therefore it is some number between 1 and 2, and 1.5 is the shorthand for \"somewhere between 1 and 2\". one might also note that since image details don't necessarily line up with the grid of pixels, in some cases the effective \"resolution\" will be between the centers of pixels with touching corners, which will be root 2 (1.41) times the sides of the pixels. [u]\"so we get: • leica m9: 145 pixel/mm corresponds to 96 lp/mm. • nikon d800e: 205 pixel/mm corresponds to 137 lp/mm. • sony nex-7: 255 pixel/mm corresponds to 171 lp/mm.[/u] ... so long as one does not take into account any aa filtering, or other blurring. some say there is noticeable loss of per-pixel resolution between the m8 and the m9, simply because the m9 has a thicker cover glass/ir filter (0.7mm vs. the m8's 0.5mm - i don't see it myself). the nikon d800e uses a \"reversing\" aa filter - one blurring layer that supposedly cancels out the effect of the other blurring layer - which i doubt works perfectly, but no doubt restores some sharpness. the sony nex-7 has - who knows what level of aa filtering (fairly little, from the samples i've seen, but probably not zero). it seems to me you are trying to -----> come !!!  -----> up !!!  -----> with !!!  hard, quantitative results based on data that is going to, by necessity (and literally, when it comes to aa filters) always be \"fuzzy.\" lots of things that sony or nikon or leica know, but are not public domain. you can probably find modern or pop. photography reviews** of some of your earlier lenses that gives the resolution the magazine measured on an optical bench (they used to do that, pre-1980s). but if the review reports \"87 lppm at f/8\" - well, the next lens off the assembly line might have tested at 83 lines, or 90 lines. **my college library had mp or pp back-issues, in hard copy, from 1945-1980 at one point. andy, thanks for your post. as always very informative. sorry if i gave you a headache with this thread. we got quite a bit of wet snow over night. it brought down a power line in the neighborhood and we were without power until a few minutes ago, so my computers were cut off the internet. maybe i should explain briefly what i hope to get out of this thread. basically, at a minimum, a rough estimate of leica lens resolution limits as they developed over time, and hopefully accurate numbers for some lenses. despite power loss, i was able to read on my ipad some older material of erwin puts that i had downloaded before and found some more useful information about leica lens resolution limits. i plan to summarize that later. if i understand you correctly, then the corresponding line pairs per mm numbers i computed for the three different sensors should be viewed as upper limits due to the effects you describe. and 01af seems to imply to cut back the numbers even further by another factor of 2. interesting. with regards to the d800e, a nikon manager stated in an interview, that for cost reasons in order to have the same register distance for the d800 and d800e, they left the first part of the filter in the d800e. this splits the signal in two. so, instead of splitting it again subsequently (in the other direction) as in the d800, they just recombine the split signals, effectively canceling the first split. i doubt nikon will release the d800e to market unless they convinced themselves of a satisfactorily implementation. thanks also for the pointers to modern or pop. photography reviews. i will see what my local library has. many thanks again. i appreciate your help.", "sortedWord": "None", "Identifyer": null, "identifyer": 91842, "year": "2012"}, {"autor": "MPJMP", "date": "2012-08-28 15:39:00", "content": " This is pure fantasy, but I thought I'd throw it out there to see who might have similar ideas and preferences. Awhile back, I came up with an idea of what my perfect Leica digital M camera would be. The concept would be to have a digital M camera with a reduced feature set that more closely replicated the experience of classic film Leica photography. The resulting camera might, in theory, be less expensive to produce than a full fledged M9, thereby constituting a \"budget\" model. The important specs would be: 1) NO rear LCD. Think how revolutionary that would be. One of the \"benefits\" of film photography that is often touted by its proponents is that you are free from the potential distraction that a rear LCD brings. No \"chimping\" your shots. No fiddling with menu settings. You remain in the moment, engaged with your subject. Of course, with enough discipline you can do that with an LCD, but by removing it entirely you remove the temptation to go back and look at your results and instead focus on getting the next perfect shot. Another thing you remove is a major production cost, which results in a lower price point for the consumer. Instead of an LCD, there would be a traditional wheel to set ISO. There would be no other buttons on the rear panel. When you think about it, other than focus, aperture, shutter speed, and ISO the only other essential setting that needs to be made is selecting the capture format: RAW, JPEG, etc. Which leads to... 2) Capture in RAW (DNG) format only. To make the camera as simple and pure as possible, and to ensure only the best quality original files, the camera would only capture in a RAW format such as Adobe's DNG \"digital negative\" format. There is then no need to set things such as white balance, compression, megapixel quality, etc.-- the types of things that you might have spent time fiddling with on the LCD screen. All image tweaking would be done in post-processing. 3) Shutter cocking lever. Got this idea from the Epson RD-1 from years ago. By deleting both the rear LCD and motor for cocking the shutter you would conserve a significant amount of battery power. A single battery charge might last weeks, instead of hours or days. It also replicates an important part of the classic Leica M experience lacking in the M8/9. 4) Hybrid optical viewfinder with electronic framelines. I've been led to believe that one of the biggest costs in producing an M camera is the installation and calibration of the frame lines. Replacing these with elctronic framelines, such as used in the Fuji X series, saves money and provides for potentially more accurate and reliable framing. 5) As for focusing, I don't have any great ideas other than keeping the tried and true optical rangefinder. While it is expensive, there is no better way I am aware of to accurately focus a manual M lens. 6) Return of the M8's top panel LCD for battery status and frame count. With no large rear panel LCD, that would become a necessity. 7) The weather-sealed bottom plate would be removed to reveal the battery compartment, SD card slot, and an industry standard USB connection. What are your thoughts? I have no realistic expectation that such a camera would ever be produced either by Leica or any 3rd party, but I've never heard some of these ideas tossed around before. Edited August 28, 2012 by MPJMP", "link": "https://www.l-camera-forum.com/topic/186660-my-thoughts-for-a-bare-bones-budget-digital-m/?tab=comments#comment-2098118", "origin": "L-forum", "suborigin": "186660-my-thoughts-for-a-bare-bones-budget-digital-m", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " this is pure fantasy, but i thought i'd throw it out there to see who might have similar ideas and preferences. awhile back, i -----> came !!!  -----> up !!!  -----> with !!!  an idea of what my perfect leica digital m camera would be. the concept would be to have a digital m camera with a reduced feature set that more closely replicated the experience of classic film leica photography. the resulting camera might, in theory, be less expensive to produce than a full fledged m9, thereby constituting a \"budget\" model. the important specs would be: 1) no rear lcd. think how revolutionary that would be. one of the \"benefits\" of film photography that is often touted by its proponents is that you are free from the potential distraction that a rear lcd brings. no \"chimping\" your shots. no fiddling with menu settings. you remain in the moment, engaged with your subject. of course, with enough discipline you can do that with an lcd, but by removing it entirely you remove the temptation to go back and look at your results and instead focus on getting the next perfect shot. another thing you remove is a major production cost, which results in a lower price point for the consumer. instead of an lcd, there would be a traditional wheel to set iso. there would be no other buttons on the rear panel. when you think about it, other than focus, aperture, shutter speed, and iso the only other essential setting that needs to be made is selecting the capture format: raw, jpeg, etc. which leads to... 2) capture in raw (dng) format only. to make the camera as simple and pure as possible, and to ensure only the best quality original files, the camera would only capture in a raw format such as adobe's dng \"digital negative\" format. there is then no need to set things such as white balance, compression, megapixel quality, etc.-- the types of things that you might have spent time fiddling with on the lcd screen. all image tweaking would be done in post-processing. 3) shutter cocking lever. got this idea from the epson rd-1 from years ago. by deleting both the rear lcd and motor for cocking the shutter you would conserve a significant amount of battery power. a single battery charge might last weeks, instead of hours or days. it also replicates an important part of the classic leica m experience lacking in the m8/9. 4) hybrid optical viewfinder with electronic framelines. i've been led to believe that one of the biggest costs in producing an m camera is the installation and calibration of the frame lines. replacing these with elctronic framelines, such as used in the fuji x series, saves money and provides for potentially more accurate and reliable framing. 5) as for focusing, i don't have any great ideas other than keeping the tried and true optical rangefinder. while it is expensive, there is no better way i am aware of to accurately focus a manual m lens. 6) return of the m8's top panel lcd for battery status and frame count. with no large rear panel lcd, that would become a necessity. 7) the weather-sealed bottom plate would be removed to reveal the battery compartment, sd card slot, and an industry standard usb connection. what are your thoughts? i have no realistic expectation that such a camera would ever be produced either by leica or any 3rd party, but i've never heard some of these ideas tossed around before. edited august 28, 2012 by mpjmp", "sortedWord": "None", "Identifyer": null, "identifyer": 92970, "year": "2012"}, {"autor": "bill", "date": "2012-01-12 13:23:00", "content": "I started with Booking,com, then had all the multiple pop-ups that accompany the Tripadvisor \"experience\" - Expedia, Hotels.com, etc. Same hotel, same room, standard double with free wireless internet and breakfast varied last night from £310 (Expedia) to £268 (Venere). 3 of them came up with £294. Cancel up to 6pm on day of arrival, pay locally on departure. Bargain. It's the Richmond Hotel, if you are interested. p.s. Just run the self same search again and all the prices are different today, unsurprisingly... --img--  Regards, Bill", "link": "https://www.l-camera-forum.com/topic/166878-copenhagen-final-call/page/5/?tab=comments#comment-1895936", "origin": "L-forum", "suborigin": "166878-copenhagen-final-call", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i started with booking,com, then had all the multiple pop-ups that accompany the tripadvisor \"experience\" - expedia, hotels.com, etc. same hotel, same room, standard double with free wireless internet and breakfast varied last night from £310 (expedia) to £268 (venere). 3 of them -----> came !!!  -----> up !!!  -----> with !!!  £294. cancel -----> up !!!  to 6pm on day of arrival, pay locally on departure. bargain. it's the richmond hotel, if you are interested. p.s. just run the self same search again and all the prices are different today, unsurprisingly... --img--  regards, bill", "sortedWord": "None", "Identifyer": null, "identifyer": 137058, "year": "2012"}, {"autor": "lanetomlane", "date": "2012-10-04 17:49:00", "content": "Robert and I will be travelling together and in Copenhagen from Thursday to Tuesday so a meet up on Thursday and Friday nights would be great. Pete. Great Pete, we only land at 18:00 on Thursday evening so I guess that night will be out for us. Be great to meet up Friday night though. Erik (see a couple of posts above) said he would look for somewhere and so I suggest we wait to see what he comes up with and then decide on a time. _____________ Cheers, Tom", "link": "https://www.l-camera-forum.com/topic/166878-copenhagen-final-call/page/12/?tab=comments#comment-2132921", "origin": "L-forum", "suborigin": "166878-copenhagen-final-call", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "robert and i will be travelling together and in copenhagen from thursday to tuesday so a meet up on thursday and friday nights would be great. pete. great pete, we only land at 18:00 on thursday evening so i guess that night will be out for us. be great to meet up friday night though. erik (see a couple of posts above) said he would look for somewhere and so i suggest we wait to see what he -----> comes !!!  -----> up !!!  -----> with !!!  and then decide on a time. _____________ cheers, tom", "sortedWord": "None", "Identifyer": null, "identifyer": 137208, "year": "2012"}, {"autor": "spylaw4", "date": "2012-10-04 18:07:00", "content": "<snip> Be great to meet up Friday night though. Erik (see a couple of posts above) said he would look for somewhere and so I suggest we wait to see what he comes up with and then decide on a time._____________ Cheers, Tom +1", "link": "https://www.l-camera-forum.com/topic/166878-copenhagen-final-call/page/12/?tab=comments#comment-2132940", "origin": "L-forum", "suborigin": "166878-copenhagen-final-call", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "<snip> be great to meet up friday night though. erik (see a couple of posts above) said he would look for somewhere and so i suggest we wait to see what he -----> comes !!!  -----> up !!!  -----> with !!!  and then decide on a time._____________ cheers, tom +1", "sortedWord": "None", "Identifyer": null, "identifyer": 137209, "year": "2012"}, {"autor": "Gibbo", "date": "2012-01-31 16:06:00", "content": " I was wondering if anyone in the Bristol area would like to join up for a meet in April this year? I had in mind either Saturday the 21st or the 28th. Hopefully the weather will be with us and I was going to suggest that we meet up in Queen Square and wonder around stopping to take photos, call in to a coffee shop and possibly have a pub lunch. We can use this thread to come up with ideas between now and then. Please respond here if you are interested --img-- ", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/?tab=comments#comment-1914178", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " i was wondering if anyone in the bristol area would like to join up for a meet in april this year? i had in mind either saturday the 21st or the 28th. hopefully the weather will be with us and i was going to suggest that we meet up in queen square and wonder around stopping to take photos, call in to a coffee shop and possibly have a pub lunch. we can use this thread to -----> come !!!  -----> up !!!  -----> with !!!  ideas between now and then. please respond here if you are interested --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 137394, "year": "2012"}, {"autor": "mikebidwell", "date": "2012-02-01 17:48:00", "content": "I was wondering if anyone in the Bristol area would like to join up for a meet in Aprilthis year? I had in mind either Saturday the 21st or the 28th. Hopefully the weather will be with us and I was going to suggest that we meet up in Queen Square and wonder around stopping to take photos, call in to a coffee shop and possibly have a pub lunch. We can use this thread to come up with ideas between now and then. Please respond here if you are interested --img--  Silly question but does it have to be a Saturday ???? Why not a Sunday, If my memory serves me right then I thought the Trenchard Street Car Park (behind the Colston Hall) did a charge of £1.60 all day on Sundays. And its very handy for the Centre, Queens Square, M Shed(well worth a visit) and the Harbourside. Just a thought Best wishes Mike Bidwell PS Just checked out the Bristol Whats On for W/E 28th April and so far nothing has shown up so it should be too manic in town. PPS Seems as though Trenchard Street does all day on Saturday for £2.60 but I'm sure it will be busy Edited February 1, 2012 by mikebidwell Add more info", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/?tab=comments#comment-1915188", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i was wondering if anyone in the bristol area would like to join up for a meet in aprilthis year? i had in mind either saturday the 21st or the 28th. hopefully the weather will be with us and i was going to suggest that we meet up in queen square and wonder around stopping to take photos, call in to a coffee shop and possibly have a pub lunch. we can use this thread to -----> come !!!  -----> up !!!  -----> with !!!  ideas between now and then. please respond here if you are interested --img--  silly question but does it have to be a saturday ???? why not a sunday, if my memory serves me right then i thought the trenchard street car park (behind the colston hall) did a charge of £1.60 all day on sundays. and its very handy for the centre, queens square, m shed(well worth a visit) and the harbourside. just a thought best wishes mike bidwell ps just checked out the bristol whats on for w/e 28th april and so far nothing has shown up so it should be too manic in town. pps seems as though trenchard street does all day on saturday for £2.60 but i'm sure it will be busy edited february 1, 2012 by mikebidwell add more info", "sortedWord": "None", "Identifyer": null, "identifyer": 137410, "year": "2012"}, {"autor": "Gibbo", "date": "2012-02-03 17:44:00", "content": " Oki doki, this is lookin' good --img--  I shall do some research over the next few weeks and come up with relative parking costs etc etc. Also, if you need me, I shall be trying out pubs --img--  Not that I need to, just feel like it --img-- ", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/2/?tab=comments#comment-1916970", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " oki doki, this is lookin' good --img--  i shall do some research over the next few weeks and -----> come !!!  -----> up !!!  -----> with !!!  relative parking costs etc etc. also, if you need me, i shall be trying out pubs --img--  not that i need to, just feel like it --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 137414, "year": "2012"}, {"autor": "Gibbo", "date": "2012-02-21 20:25:00", "content": "Well, here's a thought. There is a car park at the Mud Dock on The Grove which is marked 'A' on this map: http://maps.google.co.uk/maps?hl=en&cp=17&gs_id=1u&xhr=t&q=the+grove+bristol&gs_upl=&bav=on.2,or.r_gc.r_pw.r_qf.,cf.osb&biw=1139&bih=628&wrapid=tljp1329856345656032&um=1&ie=UTF-8&ei=nv9DT5iTLcOn0AWStomPDw&sa=X&oi=mode_link&ct=mode&cd=3&sqi=2&ved=0CA0Q_AUoAg It's within spitting distance of the Arnolfini --img--  I'll see if I can come up with some suggestions for lunch venues around there too! I certainly know of at least three good coffee shops near there. Edited February 21, 2012 by Gibbo", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/2/?tab=comments#comment-1933635", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "well, here's a thought. there is a car park at the mud dock on the grove which is marked 'a' on this map: http://maps.google.co.uk/maps?hl=en&cp=17&gs_id=1u&xhr=t&q=the+grove+bristol&gs_upl=&bav=on.2,or.r_gc.r_pw.r_qf.,cf.osb&biw=1139&bih=628&wrapid=tljp1329856345656032&um=1&ie=utf-8&ei=nv9dt5itlcon0awstompdw&sa=x&oi=mode_link&ct=mode&cd=3&sqi=2&ved=0ca0q_auoag it's within spitting distance of the arnolfini --img--  i'll see if i can -----> come !!!  -----> up !!!  -----> with !!!  some suggestions for lunch venues around there too! i certainly know of at least three good coffee shops near there. edited february 21, 2012 by gibbo", "sortedWord": "None", "Identifyer": null, "identifyer": 137430, "year": "2012"}, {"autor": "mikebidwell", "date": "2012-02-21 21:15:00", "content": "Well, here's a thought. There is a car park at the Mud Dock on The Grove whichis marked 'A' on this map: the grove bristol - Google Maps It's within spitting distance of the Arnolfini --img--  I'll see if I can come up with some suggestions for lunch venues around there too! I certainly know of at least three good coffee shops near there. Excellent area to meet near the Arnolfini David, a good suggestion. its central to see some of 'Old Bristol' or there are plenty of places to sit and chat around Millenium Square or M Shed. It has all the makings of a good meet. I'm looking forward to be able to put faces to names. Well done Best wishes Mike --img--  PS not sure about the Grove Car Park, just checked it out and it say payment is by mobile phone :-( Haven't come across that before !! Edited February 21, 2012 by mikebidwell", "link": "https://www.l-camera-forum.com/topic/171750-bristol-meet-28th-april/page/2/?tab=comments#comment-1933694", "origin": "L-forum", "suborigin": "171750-bristol-meet-28th-april", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "well, here's a thought. there is a car park at the mud dock on the grove whichis marked 'a' on this map: the grove bristol - google maps it's within spitting distance of the arnolfini --img--  i'll see if i can -----> come !!!  -----> up !!!  -----> with !!!  some suggestions for lunch venues around there too! i certainly know of at least three good coffee shops near there. excellent area to meet near the arnolfini david, a good suggestion. its central to see some of 'old bristol' or there are plenty of places to sit and chat around millenium square or m shed. it has all the makings of a good meet. i'm looking forward to be able to put faces to names. well done best wishes mike --img--  ps not sure about the grove car park, just checked it out and it say payment is by mobile phone :-( haven't come across that before !! edited february 21, 2012 by mikebidwell", "sortedWord": "None", "Identifyer": null, "identifyer": 137432, "year": "2012"}], "name": "Leicasortedout2012with"}