{"interestingcomments": [{"autor": "carstenw", "date": "2008-04-18 20:33:00", "content": "\"Crude\", in this case. It simply means that it looks like old technology, which isn't surprising, since it is. Surely Leica can come up with some way of improving it, while taking advantage of technology developed in the last, oh, 53 years or so. Like many of us, I am a sucker for old tech, but only when it works well, and the rangefinder is really hitting its limits (and beyond) with the M8. With the M9, it will certainly need an update.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/16/?tab=comments#comment-540517", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "\"crude\", in this case. it simply means that it looks like old technology, which isn't surprising, since it is. surely leica can -----> come !!!  -----> up !!!  -----> with !!!  some way of improving it, while taking advantage of technology developed in the last, oh, 53 years or so. like many of us, i am a sucker for old tech, but only when it works well, and the rangefinder is really hitting its limits (and beyond) with the m8. with the m9, it will certainly need an update.", "sortedWord": "None", "Identifyer": null, "identifyer": 45574, "year": "2008"}, {"autor": "storybrown", "date": "2008-04-09 03:00:00", "content": "I have a (broken) II / D and a nice/pretty IIIf BD -- which I am of course very proud of but have never loaded, much less actually shot a roll through. I have put these things down on my list of must-do-this-season-or-anyway-pretty-soon items, but am so far so taken with my relatively new R8 that the other learning curve for a Leica thread mount has up to now swamped my fotographic boat (raft). There's no shortcut to experience, &c&c, as we all well know, but LTMs are or once were simple in a classic sort of way and it would be helpful if the forum would come up with a step-by-step FAQ page by the Tribe Elders/Old Hands Who Know for getting up to (relative) speed on LTMs so that interested novices might spend (relatively) less time pondering general mysteries & lost arts & fiddling and more time effectively fondling & shooting. But maybe this already exists someplace. Anyway, everyone's LTM fotos are a pleasure to peruse. Leicas of just about any kind are beautiful things.", "link": "https://www.l-camera-forum.com/topic/13639-ltm-users-its-time-to-stand-up-and-be-counted/page/14/?tab=comments#comment-532902", "origin": "L-forum", "suborigin": "13639-ltm-users-its-time-to-stand-up-and-be-counted", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i have a (broken) ii / d and a nice/pretty iiif bd -- which i am of course very proud of but have never loaded, much less actually shot a roll through. i have put these things down on my list of must-do-this-season-or-anyway-pretty-soon items, but am so far so taken with my relatively new r8 that the other learning curve for a leica thread mount has up to now swamped my fotographic boat (raft). there's no shortcut to experience, &c&c, as we all well know, but ltms are or once were simple in a classic sort of way and it would be helpful if the forum would -----> come !!!  -----> up !!!  -----> with !!!  a step-by-step faq page by the tribe elders/old hands who know for getting -----> up !!!  to (relative) speed on ltms so that interested novices might spend (relatively) less time pondering general mysteries & lost arts & fiddling and more time effectively fondling & shooting. but maybe this already exists someplace. anyway, everyone's ltm fotos are a pleasure to peruse. leicas of just about any kind are beautiful things.", "sortedWord": "None", "Identifyer": null, "identifyer": 35453, "year": "2008"}], "name": "Leicasortedout2008with"}