{"interestingcomments": [{"autor": "dc21", "date": "2006-06-30 17:54:00", "content": "Absolutely, photographers can learn a lot from watching movies. What's amazing to me is that the some filmmakers -- Kubrick, Fincher, Ridley Scott are some of my faves -- manage to capture such gorgeous images while also fulfilling all the other demands of shooting movies (story, acting, sound, etc.). But, of course, they're spending millions to get those images, too, which no still photographer can afford. Interestingly, all three filmmakers mentioned above have a background in static visual arts -- Kubrick and Fincher with photography and Ridley Scott with painting. The thing that watching movies has done most to inform my photography lately is to make me appreciate how important the subject/environment is. Maybe this is a no-brainer for most photographers that I'm just now coming around to, but I've always been overly-focused on all the stuff that I do with my camera: angles, lighting, focal length, etc. With several recent projects, however, I've grown frustrated as shooting because the images aren't as good as I want. The changes I finally made that satisfied me have come much more from changing WHAT I'm shooting, though, than to HOW I'm shooting it. In movie terms, this would fall largely within the realm of art direction -- the choosing/building/decorating of sets. A great set can make a cinematographer's job quite easy. A bad set can sometimes be salvaged -- by either a cinematographer or by a photographer shooting stills -- but it's much tougher. A good example of this can be seen by comparing the latest two Harry Potter movies. For movie 3, they got Alfonso Cuaron, a real director (sorry, Chris Columbus--stick to producing), who if gifted visually. Not only is the cinematography superb throughout the movie, but Cuaron also oversaw a major art direction re-design of most of the sets and that's \"the other half\" of why that movie looks so good. Flash forward to movie 4 and they got Mike Newell to direct. Newell is a bit of a hack, in my opinion, especially in terms of visuals. When shooting re-designed sets left over from Cuaron's film, Newell occasionally stumbles into making them look as good as Cuaron did. At other times, however, and with most (not all, but most) of the new sets, he shows his limitations. Part of it, yes, is that neither he nor his Director of Photography are as terrific as Cuaron, but part of it, too, is that he doesn't have the eye for creating sets that are easy to make look great. ~DC21", "link": "https://www.l-camera-forum.com/topic/620-can-we-learn-photography-from-watching-movies/?tab=comments#comment-4126", "origin": "L-forum", "suborigin": "620-can-we-learn-photography-from-watching-movies", "result": true, "Selector": "i finally made", "selectorShort": "make", "MarkedSent": "absolutely, photographers can learn a lot from watching movies. what's amazing to me is that the some filmmakers -- kubrick, fincher, ridley scott are some of my faves -- manage to capture such gorgeous images while also fulfilling all the other demands of shooting movies (story, acting, sound, etc.). but, of course, they're spending millions to get those images, too, which no still photographer can afford. interestingly, all three filmmakers mentioned above have a background in static visual arts -- kubrick and fincher with photography and ridley scott with painting. the thing that watching movies has done most to inform my photography lately is to make me appreciate how important the subject/environment is. maybe this is a no-brainer for most photographers that i'm just now coming around to, but i've always been overly-focused on all the stuff that i do with my camera: angles, lighting, focal length, etc. with several recent projects, however, i've grown frustrated as shooting because the images aren't as good as i want. the changes -----> i !!!  -----> finally !!!  -----> made !!!  that satisfied me have come much more from changing what -----> i !!! 'm shooting, though, than to how -----> i !!! 'm shooting it. in movie terms, this would fall largely within the realm of art direction -- the choosing/building/decorating of sets. a great set can make a cinematographer's job quite easy. a bad set can sometimes be salvaged -- by either a cinematographer or by a photographer shooting stills -- but it's much tougher. a good example of this can be seen by comparing the latest two harry potter movies. for movie 3, they got alfonso cuaron, a real director (sorry, chris columbus--stick to producing), who if gifted visually. not only is the cinematography superb throughout the movie, but cuaron also oversaw a major art direction re-design of most of the sets and that's \"the other half\" of why that movie looks so good. flash forward to movie 4 and they got mike newell to direct. newell is a bit of a hack, in my opinion, especially in terms of visuals. when shooting re-designed sets left over from cuaron's film, newell occasionally stumbles into making them look as good as cuaron did. at other times, however, and with most (not all, but most) of the new sets, he shows his limitations. part of it, yes, is that neither he nor his director of photography are as terrific as cuaron, but part of it, too, is that he doesn't have the eye for creating sets that are easy to make look great. ~dc21", "sortedWord": "None", "Identifyer": null, "identifyer": 80313, "year": "2006"}, {"autor": "petermcwerner", "date": "2006-07-13 05:34:00", "content": " I appear to have lost the lens hood for my R-fit Angeniuex 70-210mm F3.5 zoom. I'd also be interested to know if anyone has experience of using this lens with the DMR. The next time the weather is suitable I want to try it in Macro mode for wild flower close-ups with my R8-DMR - must dig out a suitable tripod... This is the original lens shade: --img--  It is very difficult to find. The best bet is to find a defective lens which comes with it - with luck and patience on ebay. I have been using this Angenieux, as well as the 35-70, the 45-90 and the 2.3/180 APO with the DMR. I am still on the lookout for a 2.8/200mm Angenieux. 2.5/35-70 : the Leica 2.8/35-70 and the 4/35-70 are better 3.5/70-210 : I like this lens very much, excellent results and low weight due to the carbon fiber construction 2.8/45-90 : Newer lenses are better 2.3/180 APO : Wonderful color rendition, extremely sharp already wide open, excellent macro capabilities (with extension rings) Here an example with the 3.5/35-70: --img--  Gabler-Bräu in Salzburg R9+DMR Angenieux 3.5/70-210 - f/5.6 1/250 ISO=100 - RAW + PS CS2 --img--  100% crop Here you can find more photos I made with this lens: Sunrise on the Abtsee Lake, Bavaria, Southern Germany Salzburg Roofs on a Rainy Afternoon Hellbrunn Castle You can find discussions of the lens here: photo-net thread Old Leica forum thread (in German) Another German thread Peter", "link": "https://www.l-camera-forum.com/topic/1402-angeniuex-70-210/?tab=comments#comment-12054", "origin": "L-forum", "suborigin": "1402-angeniuex-70-210", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": " i appear to have lost the lens hood for my r-fit angeniuex 70-210mm f3.5 zoom. i'd also be interested to know if anyone has experience of using this lens with the dmr. the next time the weather is suitable i want to try it in macro mode for wild flower close-ups with my r8-dmr - must dig out a suitable tripod... this is the original lens shade: --img--  it is very difficult to find. the best bet is to find a defective lens which comes with it - with luck and patience on ebay. i have been using this angenieux, as well as the 35-70, the 45-90 and the 2.3/180 apo with the dmr. i am still on the lookout for a 2.8/200mm angenieux. 2.5/35-70 : the leica 2.8/35-70 and the 4/35-70 are better 3.5/70-210 : i like this lens very much, excellent results and low weight due to the carbon fiber construction 2.8/45-90 : newer lenses are better 2.3/180 apo : wonderful color rendition, extremely sharp already wide open, excellent macro capabilities (with extension rings) here an example with the 3.5/35-70: --img--  gabler-bräu in salzburg r9+dmr angenieux 3.5/70-210 - f/5.6 1/250 iso=100 - raw + ps cs2 --img--  100% crop here you can find more photos -----> i !!!  -----> made !!!  with this lens: sunrise on the abtsee lake, bavaria, southern germany salzburg roofs on a rainy afternoon hellbrunn castle you can find discussions of the lens here: photo-net thread old leica forum thread (in german) another german thread peter", "sortedWord": "None", "Identifyer": null, "identifyer": 83153, "year": "2006"}, {"autor": "jlancasterd", "date": "2006-07-13 16:45:00", "content": ".....I have been using this Angenieux, as well as the 35-70, the 45-90 and the 2.3/180 APO with the DMR. I am still on the lookout for a 2.8/200mm Angenieux. 2.5/35-70 : the Leica 2.8/35-70 and the 4/35-70 are better 3.5/70-210 : I like this lens very much, excellent results and low weight due to the carbon fiber construction 2.8/45-90 : Newer lenses are better 2.3/180 APO : Wonderful color rendition, extremely sharp already wide open, excellent macro capabilities (with extension rings) Peter Thanks for the illustrations and your comments on the quality of Angenieux lenses. Your shots make me want to make better use of my 70-210. One query - have you tried using the 70-210 with either of the Leica Apo-extenders - either the 1.4x or the 2x? If so, what are the results like?--img-- ", "link": "https://www.l-camera-forum.com/topic/1402-angeniuex-70-210/?tab=comments#comment-12451", "origin": "L-forum", "suborigin": "1402-angeniuex-70-210", "result": true, "Selector": "me want to make", "selectorShort": "make", "MarkedSent": ".....i have been using this angenieux, as well as the 35-70, the 45-90 and the 2.3/180 apo with the dmr. i am still on the lookout for a 2.8/200mm angenieux. 2.5/35-70 : the leica 2.8/35-70 and the 4/35-70 are better 3.5/70-210 : i like this lens very much, excellent results and low weight due to the carbon fiber construction 2.8/45-90 : newer lenses are better 2.3/180 apo : wonderful color rendition, extremely sharp already wide open, excellent macro capabilities (with extension rings) peter thanks for the illustrations and your comments on the quality of angenieux lenses. your shots -----> make !!!  -----> me !!!  -----> want !!!  -----> to !!!  -----> make !!!  better use of my 70-210. one query - have you tried using the 70-210 with either of the leica apo-extenders - either the 1.4x or the 2x? if so, what are the results like?--img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 83157, "year": "2006"}], "name": "Leicasortedout2006make"}