{"interestingcomments": [{"autor": "mjh", "date": "2014-12-10 17:25:00", "content": "I assumed that one can determine the resolution of a sensor and a lens, compare them and see which one is larger. The misconception that 01af wanted to dispel is that the metaphor about the weakest link applies here – even when the resolution of one component was higher than that of the other (assuming both could usefully be measured in comparable ways), the total resolution of the system would not be determined by the lower resolution component (the weakest link) alone. This is quite generally true; it applies to lenses and sensors with regard to resolution, just as it applies to memory cards and card readers with regard to throughput et cetera. Improving the strongest link, i.e. the resolution of the component that already ‘outresolves’ the other (in that its resolution is measurably higher) will still improve resolution on the whole. It is just that improving the weakest link would give you a much higher return on investment. So if you interpret ‘outresolve’ to refer to one figure being larger than the other, then of course lenses and sensors could outresolve each other. But if you took it to imply (as one usually does) that the component outresolved by the other would determine overall resolution then you were mistaken.", "link": "https://www.l-camera-forum.com/topic/176168-mtf-curves-~-sensor-resolution/page/3/?tab=comments#comment-2725273", "origin": "L-forum", "suborigin": "176168-mtf-curves-~-sensor-resolution", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "i assumed that one can determine the resolution of a sensor and a lens, compare them and see which one is larger. the misconception that 01af wanted to dispel is that the metaphor about the weakest link applies here – even when the resolution of one component was higher than that of the other (assuming both could usefully be measured in comparable ways), the total resolution of the system would not be determined by the lower resolution component (the weakest link) alone. this is quite generally true; it applies to lenses and sensors with regard to resolution, just as it applies to memory cards and card readers with regard to throughput et cetera. -----> improving !!!  the strongest link, i.e. the resolution of the component that already ‘outresolves’ the other (in that its resolution is measurably higher) will still improve resolution on the whole. it is just that improving the weakest link would give you a much higher return on investment. so if you interpret ‘outresolve’ to refer to one figure being larger than the other, then of course lenses and sensors could outresolve each other. but if you took it to imply (as one usually does) that the component outresolved by the other would determine overall resolution then you were mistaken.", "sortedWord": "None", "Identifyer": null, "identifyer": 91875, "year": "2014"}, {"autor": "stevesurf", "date": "2014-04-14 01:08:00", "content": "Could somebody please explain how this technique (is it unique to the USA?) works! Surely buying something, using it for 30 days, then sending it back because you don't like it, seems to have an end disadvantage for someone. Is it the poor retailer, or the next buyer that has to wear the 'damage' of the now used goods? I would have thought a considered investigation of the desired equipment, maybe including hiring before buying would be more prudent, and honest. I acknowledge there is a level of criticism in my post, but there is a genuine interest in how it really works and who really pays for the mistake. --img--  Is this practice contributing to the alleged camera recession? As an employee of a manufacturer in an industrial industry, we really strive to get a match with customer needs and product features. However, reverse logistics can either create a negative impact whether a company has a lenient or tightened return policy. Personally, I believe we all wind up paying for the customer that \"shops\" the stores and has no hesitancy to return an expensive item within their own decision process. There are a few studies that show a more trusting return policy helps sales and vice versa: Return Policies Directly Impact Sales Here's an interesting quote/source: A return can be a future sale. Consumers are known to change their minds, and today’s consumers believe that they’re entitled to do so. When they do return a product, whatever the reason, the ease of the return process and how they are treated have a huge impact on repeat sales. Many retailers have recognized this reality and have adjusted their returns policies to be hassle free. Some retailers even encourage returns and have made return shipments as simple as possible. Customer and brand loyalty contribute directly to the top line, and data from customer returns can help inform this strategy. “A reverse logistics strategy is much more than simply figuring out how to be more efficient in shipping and processing returns and cutting costs,” concludes Dollase. “Today it’s about driving top line sales and long-term brand loyalty through a more holistic view.” Improving reverse logistics with a returns management strategy", "link": "https://www.l-camera-forum.com/topic/225125-is-the-camera-industry-in-recession/?tab=comments#comment-2567870", "origin": "L-forum", "suborigin": "225125-is-the-camera-industry-in-recession", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": "could somebody please explain how this technique (is it unique to the usa?) works! surely buying something, using it for 30 days, then sending it back because you don't like it, seems to have an end disadvantage for someone. is it the poor retailer, or the next buyer that has to wear the 'damage' of the now used goods? i would have thought a considered investigation of the desired equipment, maybe including hiring before buying would be more prudent, and honest. i acknowledge there is a level of criticism in my post, but there is a genuine interest in how it really works and who really pays for the mistake. --img--  is this practice contributing to the alleged camera recession? as an employee of a manufacturer in an industrial industry, we really strive to get a match with customer needs and product features. however, reverse logistics can either create a negative impact whether a company has a lenient or tightened return policy. personally, i believe we all wind up paying for the customer that \"shops\" the stores and has no hesitancy to return an expensive item within their own decision process. there are a few studies that show a more trusting return policy helps sales and vice versa: return policies directly impact sales here's an interesting quote/source: a return can be a future sale. consumers are known to change their minds, and today’s consumers believe that they’re entitled to do so. when they do return a product, whatever the reason, the ease of the return process and how they are treated have a huge impact on repeat sales. many retailers have recognized this reality and have adjusted their returns policies to be hassle free. some retailers even encourage returns and have made return shipments as simple as possible. customer and brand loyalty contribute directly to the top line, and data from customer returns can help inform this strategy. “a reverse logistics strategy is much more than simply figuring out how to be more efficient in shipping and processing returns and cutting costs,” concludes dollase. “today it’s about driving top line sales and long-term brand loyalty through a more holistic view.” -----> improving !!!  reverse logistics with a returns management strategy", "sortedWord": "None", "Identifyer": null, "identifyer": 96135, "year": "2014"}], "name": "Leicasortedout2014improve"}