{"interestingcomments": [{"autor": "adan", "date": "2010-04-24 03:41:00", "content": "aesop - correct. The film rails (vertical black bars between the film and the shutter in the diagram) hold the film slightly away from the shutter opening. Creating an overhang like an awning over a sidewalk. At high noon (long lens) the awning provides shade. In the late afternoon or early morning, the low angle sun (old-style superwide lens) can shine in under the awning and hit the sidewalk. Doesn't happen with SLR lenses since even a very wide SLR lens is still 40+mm away from the shutter and film (to make room for the swinging mirror). Doesn't happen as visibly with Leica's post 1980 wideangles (designed to sit further from the film, like SLR lenses, to allow metering). Doesn't show up with digital since the sensor has its own masked image area and doesn't depend on the shutter opening to define the image edges. If there were no film rails and the film sat tight against the shutter opening (like lowering that awning until it actually sat on the sidewalk) - then all lenses would produce exactly identical images regardless of optical design and distance. No gap for \"spill\". lewis44 - jbl does mention \"I looked at the film itself and noticed that the space between successive frames seems to vary occasionally. \" So it isn't just the automatic frame sensing of the scanning software in his case - although I agree with you that that can be not very good and cause similar problems of partial images. Edited April 24, 2010 by adan", "link": "https://www.l-camera-forum.com/topic/118961-distance-between-frames/?tab=comments#comment-1303816", "origin": "L-forum", "suborigin": "118961-distance-between-frames", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "aesop - correct. the film rails (vertical black bars between the film and the shutter in the diagram) hold the film slightly away from the shutter opening. -----> creating !!!  an overhang like an awning over a sidewalk. at high noon (long lens) the awning provides shade. in the late afternoon or early morning, the low angle sun (old-style superwide lens) can shine in under the awning and hit the sidewalk. doesn't happen with slr lenses since even a very wide slr lens is still 40+mm away from the shutter and film (to make room for the swinging mirror). doesn't happen as visibly with leica's post 1980 wideangles (designed to sit further from the film, like slr lenses, to allow metering). doesn't show up with digital since the sensor has its own masked image area and doesn't depend on the shutter opening to define the image edges. if there were no film rails and the film sat tight against the shutter opening (like lowering that awning until it actually sat on the sidewalk) - then all lenses would produce exactly identical images regardless of optical design and distance. no gap for \"spill\". lewis44 - jbl does mention \"i looked at the film itself and noticed that the space between successive frames seems to vary occasionally. \" so it isn't just the automatic frame sensing of the scanning software in his case - although i agree with you that that can be not very good and cause similar problems of partial images. edited april 24, 2010 by adan", "sortedWord": "None", "Identifyer": null, "identifyer": 101075, "year": "2010"}, {"autor": "aesop", "date": "2010-04-24 04:16:00", "content": "aesop - correct. The film rails (vertical black bars between the film and the shutter in the diagram) hold the film slightly away from the shutter opening. Creating an overhang like an awning over a sidewalk. At high noon (long lens) the awning provides shade. In the late afternoon or early morning, the low angle sun (old-style superwide lens) can shine in under the awning and hit the sidewalk. Doesn't happen with SLR lenses since even a very wide SLR lens is still 40+mm away from the shutter and film (to make room for the swinging mirror). Doesn't happen as visibly with Leica's post 1980 wideangles (designed to sit further from the film, like SLR lenses, to allow metering). Doesn't show up with digital since the sensor has its own masked image area and doesn't depend on the shutter opening to define the image edges. If there were no film rails and the film sat tight against the shutter opening (like lowering that awning until it actually sat on the sidewalk) - then all lenses would produce exactly identical images regardless of optical design and distance. No gap for \"spill\". lewis44 - jbl does mention \"I looked at the film itself and noticed that the space between successive frames seems to vary occasionally. \" So it isn't just the automatic frame sensing of the scanning software in his case - although I agree with you that that can be not very good and cause similar problems of partial images. ...gotcha, Andy - makes sense. I was labouring under the error that the film sat flush against the shutter opening. Thanks.", "link": "https://www.l-camera-forum.com/topic/118961-distance-between-frames/?tab=comments#comment-1303843", "origin": "L-forum", "suborigin": "118961-distance-between-frames", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "aesop - correct. the film rails (vertical black bars between the film and the shutter in the diagram) hold the film slightly away from the shutter opening. -----> creating !!!  an overhang like an awning over a sidewalk. at high noon (long lens) the awning provides shade. in the late afternoon or early morning, the low angle sun (old-style superwide lens) can shine in under the awning and hit the sidewalk. doesn't happen with slr lenses since even a very wide slr lens is still 40+mm away from the shutter and film (to make room for the swinging mirror). doesn't happen as visibly with leica's post 1980 wideangles (designed to sit further from the film, like slr lenses, to allow metering). doesn't show up with digital since the sensor has its own masked image area and doesn't depend on the shutter opening to define the image edges. if there were no film rails and the film sat tight against the shutter opening (like lowering that awning until it actually sat on the sidewalk) - then all lenses would produce exactly identical images regardless of optical design and distance. no gap for \"spill\". lewis44 - jbl does mention \"i looked at the film itself and noticed that the space between successive frames seems to vary occasionally. \" so it isn't just the automatic frame sensing of the scanning software in his case - although i agree with you that that can be not very good and cause similar problems of partial images. ...gotcha, andy - makes sense. i was labouring under the error that the film sat flush against the shutter opening. thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 101076, "year": "2010"}], "name": "Leicasortedout2010create"}