{"interestingcomments": [{"autor": "armanius", "date": "2010-05-14 21:11:00", "content": "Thanks for the info Andy! I guess I'll be developing some \"tougher\" skin on my right index! Wish they would have made the dial bigger. Re shutter knob. yes, the M6 shutter knob is actually turning gears and levers, whereas the M9 shutter knob is just sliding electrical contacts over one another, so the M6 knob will be a bit stiffer. It is also \"changing gears\" a couple of times between 1/60th sec. and 1/8 second - shifting between the different clockworks for high, medium and low speeds, so it is often stiffer or has a different feel in that region. As mentioned - it is normal that 1/30 and 1/15th produce the \"bouncing ball bearing\" sound - Zzzzpclick-click Below 1/15th gives the full clockwork sound - Zzzzzzzp-ZZzzzzzzzzz", "link": "https://www.l-camera-forum.com/topic/81546-m6-shutter-noise-at-low-speeds/?tab=comments#comment-1324202", "origin": "L-forum", "suborigin": "81546-m6-shutter-noise-at-low-speeds", "result": true, "Selector": "i'll be developing", "selectorShort": "develop", "MarkedSent": "thanks for the info andy! -----> i !!!  guess -----> i !!! -----> 'll !!!  -----> be !!!  -----> developing !!!  some \"tougher\" skin on my right index! wish they would have made the dial bigger. re shutter knob. yes, the m6 shutter knob is actually turning gears and levers, whereas the m9 shutter knob is just sliding electrical contacts over one another, so the m6 knob will be a bit stiffer. it is also \"changing gears\" a couple of times between 1/60th sec. and 1/8 second - shifting between the different clockworks for high, medium and low speeds, so it is often stiffer or has a different feel in that region. as mentioned - it is normal that 1/30 and 1/15th produce the \"bouncing ball bearing\" sound - zzzzpclick-click below 1/15th gives the full clockwork sound - zzzzzzzp-zzzzzzzzzzz", "sortedWord": "None", "Identifyer": null, "identifyer": 3196, "year": "2010"}, {"autor": "indivisualist", "date": "2010-02-02 19:24:00", "content": "Hey folks, a few years ago I started into photography, my first \"real\" own camera was a Nikon D70 - very nice and in use since 2004. But I always wanted something different, but didn't know what... until I discovered the beautiful Leica cameras. At that time I had not that much money, so I went for a beautiful Canonet instead - my first rangefinder. Fast forward to last December: I wanted to shoot much more, I wanted to use black and white film, I wanted to develop it on my own and I remembered that I wanted a Leica. --img--  So I said hello to a local dealer and took a look at my chosen one: A black M6 TTL 0.72, used, but in very good condition. I preferred the TTL version because of the bigger \"forwarded\" shutter dial and it was newer. As soon as I picked it up, my head screamed \"this is it!\" and my heart fell in love. --img--  The camera felt just right, a masterpiece of engineering and design and the shutter was unlike everything I had seen (and heard) before. The dealer was very nice and showed me how to load the film, it was much easier than i suspected. It took me three days to make up my mind (or maybe I hoped for a more rational decision --img-- ), and as you probably guessed, I bought it. For the lens I chose the current Summicron 35mm ASPH, also used, but like new (except for some dust). Here are two pictures of my light-tight box: My new toy! on Flickr - Photo Sharing! Leica M6 TTL with camera strap on Flickr - Photo Sharing! So, what can I say? The camera is great! Nothing like a digital point-and-shoot, or even a semi-professional SLR. Everything works smooth and beautiful, there is an instant emotional connection to the camera. The only bad thing now is the weather, I am still on the second roll of film... --img-- ", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/15/?tab=comments#comment-1210613", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": false, "Selector": "i wanted to develop", "selectorShort": "develop", "MarkedSent": "i wanted to shoot much more, i wanted to use black and white -----> film !!! , i wanted to develop it on my own and i remembered that i wanted a leica.", "sortedWord": "film", "Identifyer": null, "identifyer": 48971, "year": "2010"}, {"autor": "sshakari", "date": "2010-02-18 00:23:00", "content": "--img--  Here is a pic of my TTL. Waited until I developed my first roll of film to post.", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/15/?tab=comments#comment-1229668", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "waited until i developed my first -----> roll !!!  of film to post.", "sortedWord": "roll", "Identifyer": null, "identifyer": 48975, "year": "2010"}], "name": "Leicasortedout2010develop"}