{"interestingcomments": [{"autor": "morffin", "date": "2007-03-12 09:02:00", "content": "SC card to desktop folder Folder to I View Media Pro for editing and naming + meta data PS Bridge to correct color/exp ... PS image proc. create web gallery using I View Burn disc for client....burn b/u disc Write fat invoice take daughter to park PS...Ive had my M8 for about a month and it froze a couple of times until I did the battery fix.... camera has worked like a charm since. Took it on an assignment for the first time last week... worked flawlesly.....except I forgot to synch the time on the Leica and the Canon 5D...ended up wasting a lot of time getting the shots in order. Any tips on how to match the color from the Canon and Leica files? I am new to this forum and have learned a lot from you folks...thanks.", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/?tab=comments#comment-197862", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "sc card to desktop folder folder to i view media pro for editing and naming + meta data ps bridge to correct color/exp ... ps image proc. -----> create !!!  web gallery using i view burn disc for client....burn b/u disc write fat invoice take daughter to park ps...ive had my m8 for about a month and it froze a couple of times until i did the battery fix.... camera has worked like a charm since. took it on an assignment for the first time last week... worked flawlesly.....except i forgot to synch the time on the leica and the canon 5d...ended up wasting a lot of time getting the shots in order. any tips on how to match the color from the canon and leica files? i am new to this forum and have learned a lot from you folks...thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 111405, "year": "2007"}, {"autor": "ajthornbury", "date": "2007-03-30 21:14:00", "content": "--img--  Work flow:- I use Windows XP. 1. Remove card from camera. 2. Create folder using Windows Explorer. 3. Using Card reader transfer images ( jpeg) from camera to newly created folder. 4. Using PaintShop Pro 9, browse folder and delete unwanted images. 5. Make back up copy on external hard drive. 6. Replace card in camera and delete images ready for next shoot. 7. Work on images if required at leisure and print as required using Epson printer and materials. 8. Mount any specials ready for exhib.", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/page/2/?tab=comments#comment-216418", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "--img--  work flow:- i use windows xp. 1. remove card from camera. 2. -----> create !!!  folder using windows explorer. 3. using card reader transfer images ( jpeg) from camera to newly created folder. 4. using paintshop pro 9, browse folder and delete unwanted images. 5. make back up copy on external hard drive. 6. replace card in camera and delete images ready for next shoot. 7. work on images if required at leisure and print as required using epson printer and materials. 8. mount any specials ready for exhib.", "sortedWord": "None", "Identifyer": null, "identifyer": 111408, "year": "2007"}, {"autor": "Woody Campbell", "date": "2007-04-08 17:30:00", "content": "Firstly and most importantly in my view is to get a dvd of the DNG files burnt before you even consider messing ,processing, converting or anything thereafter, it is so important to get the origionals burnt i cant believe nobody so far does that, i never throw away any images I have shot until i have this first copy, having recently gone through all my work from the past 10 years in order to formulate a website those images you might have binned now do creep out and bite you sometimes, for the price of a dvd you can and i recommend keep everything you shoot. I buy hard drives in pairs - one for primary use and one for backup. I dedicate a hard drive and backup to each year 1. Create a new session in C1 for the job/subject/month. 2. Mount the card from the camera and drag the files (always all raws) to the \"captures\" folder for the session. 3. Copy the folder for the session onto the backup drive. 4. Remove the card and format it in the camera. 5. In C1 identify clear non-keepers and move to trash. 6. Page through images in C1. Default profile=JFI Ilford Delta 400 (all of my work is B&W); default sharpening=soft look; default noise=all the way left. Process as 16 bit tiffs. If I have a high volume project do cropping in C1 and additionally process as jpegs. 7. Edit and process. 8. Open the session's processed folder in Bridge. 9. Drag any images that need to be stitched to PTGui. Save stiched16-bit tiffs to a folder in the session folder called \"stitches\". I do a lot of these. 10. Open tiffs (stiched as well as conversions that didn't need stitching) in PS from Bridge. Edit and save as psds in a folder titled \"grays\". In the process print selected images as a sanity check. 11. Delete intermediate files in the stitching process - they take up enormous space and can be reproduced at will. Move contents of session tash to mac trash. Pour drink as I review prints.", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/page/2/?tab=comments#comment-223236", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "firstly and most importantly in my view is to get a dvd of the dng files burnt before you even consider messing ,processing, converting or anything thereafter, it is so important to get the origionals burnt i cant believe nobody so far does that, i never throw away any images i have shot until i have this first copy, having recently gone through all my work from the past 10 years in order to formulate a website those images you might have binned now do creep out and bite you sometimes, for the price of a dvd you can and i recommend keep everything you shoot. i buy hard drives in pairs - one for primary use and one for backup. i dedicate a hard drive and backup to each year 1. -----> create !!!  a new session in c1 for the job/subject/month. 2. mount the card from the camera and drag the files (always all raws) to the \"captures\" folder for the session. 3. copy the folder for the session onto the backup drive. 4. remove the card and format it in the camera. 5. in c1 identify clear non-keepers and move to trash. 6. page through images in c1. default profile=jfi ilford delta 400 (all of my work is b&w); default sharpening=soft look; default noise=all the way left. process as 16 bit tiffs. if i have a high volume project do cropping in c1 and additionally process as jpegs. 7. edit and process. 8. open the session's processed folder in bridge. 9. drag any images that need to be stitched to ptgui. save stiched16-bit tiffs to a folder in the session folder called \"stitches\". i do a lot of these. 10. open tiffs (stiched as well as conversions that didn't need stitching) in ps from bridge. edit and save as psds in a folder titled \"grays\". in the process print selected images as a sanity check. 11. delete intermediate files in the stitching process - they take up enormous space and can be reproduced at will. move contents of session tash to mac trash. pour drink as i review prints.", "sortedWord": "None", "Identifyer": null, "identifyer": 111409, "year": "2007"}], "name": "Leicasortedout2007create"}