{"interestingcomments": [{"autor": "Mr.Prime", "date": "2021-02-10 02:33:00", "content": "Hi Doug, Well, for 35mm film I have a Plustek scanner and it does a decent job although I have no control over focus accuracy, but for 120 roll film I have no solution at present. I’m going to be borrowing a Canon EF-S 60mm macro which I can use with my old Rebel XT DSLR but no copy stand or light source yet. I am ‘poised’ to buy some developing tanks, spirals etc. but got side tracked reading about choices of developer. A fascinating topic all by itself. I have yet to decide, but it seems that there’s not much reason to look beyond ID-11/D-76 1:1 rather than mess about chasing different recipes. Again, I have read that for a hybrid workflow the usual considerations of grain are no longer what they were in the hey day of the darkroom print, that scanners emphasize grain too. On-line advice says it may be that the most important thing is to pick something ‘sensible’ and stick with it. The variables being my picture taking rather than my developing. Still reading up on it. People say developer is nasty stuff and for environmental reasons I should use coffee... Edited February 10 by Mr.Prime", "link": "https://www.l-camera-forum.com/topic/295465-home-film-development/page/3/?tab=comments#comment-4137494", "origin": "L-forum", "suborigin": "295465-home-film-development", "result": true, "Selector": "my developing", "selectorShort": "developing", "MarkedSent": "hi doug, well, for 35mm film i have a plustek scanner and it does a decent job although i have no control over focus accuracy, but for 120 roll film i have no solution at present. i’m going to be borrowing a canon ef-s 60mm macro which i can use with my old rebel xt dslr but no copy stand or light source yet. i am ‘poised’ to buy some developing tanks, spirals etc. but got side tracked reading about choices of developer. a fascinating topic all by itself. i have yet to decide, but it seems that there’s not much reason to look beyond id-11/d-76 1:1 rather than mess about chasing different recipes. again, i have read that for a hybrid workflow the usual considerations of grain are no longer what they were in the hey day of the darkroom print, that scanners emphasize grain too. on-line advice says it may be that the most important thing is to pick something ‘sensible’ and stick with it. the variables being -----> my !!!  picture taking rather than -----> my !!!  -----> developing !!! . still reading up on it. people say developer is nasty stuff and for environmental reasons i should use coffee... edited february 10 by mr.prime", "sortedWord": "None", "Identifyer": null, "identifyer": 99067, "year": "2021"}], "name": "Leicasortedout2021developing"}