{"interestingcomments": [{"autor": "Manoleica", "date": "2016-05-23 21:33:00", "content": "Here is a convenient table of hyperfocal distances for the X Vario. (Just a reminder: If you focus at hyperfocal, everything from half the hyperfocal distance to ∞ is in \"acceptable\" focus. This gives slightly more in-focus foreground than setting focus at ∞.) Using suitable software, you can make your own DOF table using the actual focal lengths (not FFE) and a COC of 0.02mm. In this instance I would argue that the best way to learn is to do it yourself.. Edited May 23, 2016 by Manoleica", "link": "https://www.l-camera-forum.com/topic/257559-manual-focusing-techniques-for-the-x-vario-with-an-leica-evf2/?tab=comments#comment-3050046", "origin": "L-forum", "suborigin": "257559-manual-focusing-techniques-for-the-x-vario-with-an-leica-evf2", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "here is a convenient table of hyperfocal distances for the x vario. (just a reminder: if you focus at hyperfocal, everything from half the hyperfocal distance to ∞ is in \"acceptable\" focus. this gives slightly more in-focus foreground than setting focus at ∞.) using suitable software, you can make your own dof table using the actual focal lengths (not ffe) and a coc of 0.02mm. in this instance i would argue that the best way to learn is to -----> do !!!  -----> it !!!  -----> yourself !!! .. edited may 23, 2016 by manoleica", "sortedWord": "None", "Identifyer": null, "identifyer": 12342, "year": "2016"}, {"autor": "Trivette", "date": "2016-05-23 22:07:00", "content": "In this instance I would argue that the best way to learn is to do it yourself.. No doubt, but some landscape photographers find hyperfocal to be useful. On the other X cameras you have the DOF indicator in MF mode: For hyperfocal, just set right end of the DOF bar at ∞. On most Leica lenses, the DOF is indicated on the lens barrel. Here is my simplified hyperfocal table for the XV. The left hand column is f-numbers; the top row is focal lengths. Hyperfocal distances are in meters. --img-- ", "link": "https://www.l-camera-forum.com/topic/257559-manual-focusing-techniques-for-the-x-vario-with-an-leica-evf2/?tab=comments#comment-3050063", "origin": "L-forum", "suborigin": "257559-manual-focusing-techniques-for-the-x-vario-with-an-leica-evf2", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "in this instance i would argue that the best way to learn is to -----> do !!!  -----> it !!!  -----> yourself !!! .. no doubt, but some landscape photographers find hyperfocal to be useful. on the other x cameras you have the dof indicator in mf mode: for hyperfocal, just set right end of the dof bar at ∞. on most leica lenses, the dof is indicated on the lens barrel. here is my simplified hyperfocal table for the xv. the left hand column is f-numbers; the top row is focal lengths. hyperfocal distances are in meters. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 12343, "year": "2016"}, {"autor": "pico", "date": "2016-07-28 20:25:00", "content": " A curious question - would there be a place for a Do It Yourself (DIY) thread group? One trivial subject is how to properly clear-coat a fully brassed Leica part. That is not a universally interesting subject, however 'How to adjust rangefinder' might be a big hit with existing posts merged. There are also many alternative devices regarding an assist in the RF adjustment and other issues; there must be more interests including how one might replace a body cover... and more. Pico Edited July 28, 2016 by pico", "link": "https://www.l-camera-forum.com/topic/262973-diy-group/?tab=comments#comment-3086926", "origin": "L-forum", "suborigin": "262973-diy-group", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": " a curious question - would there be a place for a -----> do !!!  -----> it !!!  -----> yourself !!!  (diy) thread group? one trivial subject is how to properly clear-coat a fully brassed leica part. that is not a universally interesting subject, however 'how to adjust rangefinder' might be a big hit with existing posts merged. there are also many alternative devices regarding an assist in the rf adjustment and other issues; there must be more interests including how one might replace a body cover... and more. pico edited july 28, 2016 by pico", "sortedWord": "None", "Identifyer": null, "identifyer": 114621, "year": "2016"}], "name": "Leicasortedout2016yourself"}