{"interestingcomments": [{"autor": "bla", "date": "2014-01-31 12:58:00", "content": " Isn't it possible to use the linux version that I offer with cygwin? Another feature that is finished: DIY sensor remapping... --img--  (see attached images) If you look at the spoon on the very left, you might notice a faint orange vertical line. (see the image with the crops) While the blue line is not appearing in the camera's JPG, the orange line is and it is possible to fix that now... Greetings, Arvid --img-- --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/4/?tab=comments#comment-2522596", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " isn't it possible to use the linux version that i offer with cygwin? another feature that is finished: -----> diy !!!  sensor remapping... --img--  (see attached images) if you look at the spoon on the very left, you might notice a faint orange vertical line. (see the image with the crops) while the blue line is not appearing in the camera's jpg, the orange line is and it is possible to fix that now... greetings, arvid --img-- --img-- --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 41570, "year": "2014"}, {"autor": "metalbernd", "date": "2014-08-22 18:52:00", "content": "A small update, after 9weeks I received it back. They \"shorten\" the leather straplug and used a white stitch to attach it back. On a very DIY way, so if they want to be premium? they have to do it different, once but never a ona again.", "link": "https://www.l-camera-forum.com/topic/227763-be-careful-trusting-the-strap-on-your-ona-berlin-bag/page/4/?tab=comments#comment-2654831", "origin": "L-forum", "suborigin": "227763-be-careful-trusting-the-strap-on-your-ona-berlin-bag", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "a small update, after 9weeks i received it back. they \"shorten\" the leather straplug and used a white stitch to attach it back. on a very -----> diy !!!  way, so if they want to be premium? they have to do it different, once but never a ona again.", "sortedWord": "None", "Identifyer": null, "identifyer": 84867, "year": "2014"}, {"autor": "semi-ambivalent", "date": "2014-03-01 16:45:00", "content": "For the last several years, I've been using an M3 with a Sekonic L-758DR meter. Since acquiring an M 240 in December, I've continued using the meter. The meter gives me incident readings, which the M 240 can't. It allows me to get more precise spot readings. And it enables me to quickly and easily translate a reading into exposure at different ISOs, f stops and shutter speeds. Back in the Spiratone Era one could buy a type of filter that went temporarily on the lens, allowing you to use the camera as an incident meter. You could probably DIY something like this, but a handheld meter is more convenient. Probably has a coolness factor with the ladies too, huh?", "link": "https://www.l-camera-forum.com/topic/221817-who-still-uses-a-handheld-meter/page/2/?tab=comments#comment-2541638", "origin": "L-forum", "suborigin": "221817-who-still-uses-a-handheld-meter", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "for the last several years, i've been using an m3 with a sekonic l-758dr meter. since acquiring an m 240 in december, i've continued using the meter. the meter gives me incident readings, which the m 240 can't. it allows me to get more precise spot readings. and it enables me to quickly and easily translate a reading into exposure at different isos, f stops and shutter speeds. back in the spiratone era one could buy a type of filter that went temporarily on the lens, allowing you to use the camera as an incident meter. you could probably -----> diy !!!  something like this, but a handheld meter is more convenient. probably has a coolness factor with the ladies too, huh?", "sortedWord": "None", "Identifyer": null, "identifyer": 85240, "year": "2014"}, {"autor": "250swb", "date": "2014-07-04 15:48:00", "content": "I think if anybody needs to read the advice they also need to take it to a dealer for deeper cleaning. I would doubt very much that Leica can ascribe faults to wet cleaning since a) they can perfectly well destroy a customers sensor in their store anyway, and --img--  not everybody is likely to read such dumbed down advice. If it came with actual facts about why the Leica sensor is going to be so prone to damage by the DIY method fair enough, it would be akin to the warning in your car manual that a lack of oil will cause bits of the engine to fall out. But continuing all our favourite motoring analogies this current advice is more like 'put the oil in here, if you don't know how to open the bonnet take it to the dealer'. Steve", "link": "https://www.l-camera-forum.com/topic/229972-leica-recommend-non-contact-cleaning-only-by-users/?tab=comments#comment-2623903", "origin": "L-forum", "suborigin": "229972-leica-recommend-non-contact-cleaning-only-by-users", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i think if anybody needs to read the advice they also need to take it to a dealer for deeper cleaning. i would doubt very much that leica can ascribe faults to wet cleaning since a) they can perfectly well destroy a customers sensor in their store anyway, and --img--  not everybody is likely to read such dumbed down advice. if it came with actual facts about why the leica sensor is going to be so prone to damage by the -----> diy !!!  method fair enough, it would be akin to the warning in your car manual that a lack of oil will cause bits of the engine to fall out. but continuing all our favourite motoring analogies this current advice is more like 'put the oil in here, if you don't know how to open the bonnet take it to the dealer'. steve", "sortedWord": "None", "Identifyer": null, "identifyer": 94712, "year": "2014"}, {"autor": "mmradman", "date": "2014-06-19 16:05:00", "content": " Most impressive optics that comes with weight and size penalty. Reminds me of Nikon 24-70mm zoom lens which is mega huge compared to any M lens 50mm f1.4. As Luigi stated it was designed with DSLR in mind only flagship Canon and Nikon models are built for AF lenses and no dedicated OEM focusing screens are available except one third party supplier with a website, screens seem to be modified canon screens for 5D mk2 and fittings is DIY, just bin your camera's warranty. Zeiss sales people are very quiet when asked about DSLR focus screens that would be suitable for ZF and EOS lenses, I should know, I asked the question. Perhaps A7 is good platform for Otus 55mm.", "link": "https://www.l-camera-forum.com/topic/229019-zeiss-otus-55mm-f14-apo-distagon/?tab=comments#comment-2614111", "origin": "L-forum", "suborigin": "229019-zeiss-otus-55mm-f14-apo-distagon", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " most impressive optics that comes with weight and size penalty. reminds me of nikon 24-70mm zoom lens which is mega huge compared to any m lens 50mm f1.4. as luigi stated it was designed with dslr in mind only flagship canon and nikon models are built for af lenses and no dedicated oem focusing screens are available except one third party supplier with a website, screens seem to be modified canon screens for 5d mk2 and fittings is -----> diy !!! , just bin your camera's warranty. zeiss sales people are very quiet when asked about dslr focus screens that would be suitable for zf and eos lenses, i should know, i asked the question. perhaps a7 is good platform for otus 55mm.", "sortedWord": "None", "Identifyer": null, "identifyer": 95434, "year": "2014"}, {"autor": "B-9", "date": "2014-02-04 23:27:00", "content": " Hello! Glad to be a new member of the Leica forum! After having grown increasingly frustrated with RFF and its shifty, and most times shady attitude. Mainly due to the head bartender, no names will be said. Im now searching out a new forum to spread my knowledge and trinkets with! So you guys are in luck, B-9 is coming to a forum nearest you! Keep posted for a ton of great DIY and One off Rangefinder inspired projects! Thanks for having me and I hope this will be a positive experience! -Devin", "link": "https://www.l-camera-forum.com/topic/221502-b-9-has-come-intro/?tab=comments#comment-2525793", "origin": "L-forum", "suborigin": "221502-b-9-has-come-intro", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " hello! glad to be a new member of the leica forum! after having grown increasingly frustrated with rff and its shifty, and most times shady attitude. mainly due to the head bartender, no names will be said. im now searching out a new forum to spread my knowledge and trinkets with! so you guys are in luck, b-9 is coming to a forum nearest you! keep posted for a ton of great -----> diy !!!  and one off rangefinder inspired projects! thanks for having me and i hope this will be a positive experience! -devin", "sortedWord": "None", "Identifyer": null, "identifyer": 115465, "year": "2014"}], "name": "Leicasortedout2014diy"}