{"interestingcomments": [{"autor": "willeica", "date": "2017-12-07 15:56:00", "content": "I don't think Leica nor owners of the new lens have suggested or believe that is anything other than a re-creation. How could it be? It is a Thambar-M for one thing. Other than Leica completists who buy everything Leica produce, the type of people likely to be interested in this lens are those who want to use it rather than collect it. Your post smacks a bit like trying to rain on the parade of those expressing enthusiasm for this lens in this thread but, being argued from a collector perspective, really ends up missing the point. I'm not trying to rain on anyone's parade. I'm just introducing a new perspective into the discussion. William", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/3/?tab=comments#comment-3413040", "origin": "L-forum", "suborigin": "279589-thambar-crazy", "result": true, "Selector": "i'm just introducing", "selectorShort": "introduce", "MarkedSent": "i don't think leica nor owners of the new lens have suggested or believe that is anything other than a re-creation. how could it be? it is a thambar-m for one thing. other than leica completists who buy everything leica produce, the type of people likely to be interested in this lens are those who want to use it rather than collect it. your post smacks a bit like trying to rain on the parade of those expressing enthusiasm for this lens in this thread but, being argued from a collector perspective, really ends up missing the point. i'm not trying to rain on anyone's parade. -----> i !!! 'm -----> just !!!  -----> introducing !!!  a new perspective into the discussion. william", "sortedWord": "None", "Identifyer": null, "identifyer": 12048, "year": "2017"}, {"autor": "Jager", "date": "2017-02-23 13:52:00", "content": "Well, to close the circle on this... Deciding to go the eBay route, I bought \"eBay for Dummies,\" by Marsha Collier. Decent book that did a great job of walking one through the process, but was rather light on strategy (when to use an auction vs a fixed price sale, when and how to use reserves, that sort of thing). The first prologue was that most of the photos on eBay suck. Even, ironically, stuff listed by photographers and camera shops. I knew that wasn't a huge deal, as I myself had bought stuff in the past in spite of mediocre pictures - but I reasoned that high quality images might help. So I invested a hundred bucks in a small, portable \"studio\" kit - lights, diffusion tent, and backdrops for table top/product photography. You could, of course, mock up something yourself that would be much less expensive, but would not be as convenient. The second prologue was that when I looked at all the M240's on eBay, most of them were fixed price and... weren't moving. That dismal prospect received some emphasis when I dipped my toe in the water by first listing my Multifunction Back at a fixed price... and, likewise, nothing but crickets. So, deciding to go for broke, I listed my M240 as a pure auction sale, no reserve, starting at 99 cents (!). Talk about scary! On my Multifunction Back listing I offered free shipping and a 14-day return policy. Given the risk(s) I was assuming with the M240 sale, I figured the future buyer - and at 99 cents I knew there would be a buyer - could take on a little of that themselves. They would have to pay shipping and there would be no return option. You can list an eBay sale for 3, 5, 7, or 10 days. I didn't have much to go on, but figured that potential buyers of expensive cameras are probably episodic... i.e. they aren't typically watching eBay or KEH or Craigslist as a matter of course, but only when they're actually interested in buying something. Usually they're not looking. So a longer duration would cast a broader net. I listed my camera for 10 days. The first few days were the worst... when the high bid was still relatively low. At a price point that you'd essentially be giving the camera away. That anxiety slowly waned as the days ticked by and the bid incremented higher. It ended up well. I would have loved to have received a few hundred dollars more. Just like I'm sure the buyer would have loved to have gotten it for a few hundred dollars less. I suppose that right there is as good a definition as any of what constitutes a fair deal. The winning bidder was local, so I was able to meet him to consummate the exchange. A young man acquiring his first Leica M. I think I was as excited for him as he was himself! Hopefully we can stay in touch and I can help introduce him to some of the Leica folks in the area. It went well...", "link": "https://www.l-camera-forum.com/topic/268795-advice-on-selling-leica-m240/page/2/?tab=comments#comment-3219937", "origin": "L-forum", "suborigin": "268795-advice-on-selling-leica-m240", "result": true, "Selector": "i can help introduce", "selectorShort": "introduce", "MarkedSent": "well, to close the circle on this... deciding to go the ebay route, i bought \"ebay for dummies,\" by marsha collier. decent book that did a great job of walking one through the process, but was rather light on strategy (when to use an auction vs a fixed price sale, when and how to use reserves, that sort of thing). the first prologue was that most of the photos on ebay suck. even, ironically, stuff listed by photographers and camera shops. i knew that wasn't a huge deal, as i myself had bought stuff in the past in spite of mediocre pictures - but i reasoned that high quality images might help. so i invested a hundred bucks in a small, portable \"studio\" kit - lights, diffusion tent, and backdrops for table top/product photography. you could, of course, mock up something yourself that would be much less expensive, but would not be as convenient. the second prologue was that when i looked at all the m240's on ebay, most of them were fixed price and... weren't moving. that dismal prospect received some emphasis when i dipped my toe in the water by first listing my multifunction back at a fixed price... and, likewise, nothing but crickets. so, deciding to go for broke, i listed my m240 as a pure auction sale, no reserve, starting at 99 cents (!). talk about scary! on my multifunction back listing i offered free shipping and a 14-day return policy. given the risk(s) i was assuming with the m240 sale, i figured the future buyer - and at 99 cents i knew there would be a buyer - could take on a little of that themselves. they would have to pay shipping and there would be no return option. you can list an ebay sale for 3, 5, 7, or 10 days. i didn't have much to go on, but figured that potential buyers of expensive cameras are probably episodic... i.e. they aren't typically watching ebay or keh or craigslist as a matter of course, but only when they're actually interested in buying something. usually they're not looking. so a longer duration would cast a broader net. i listed my camera for 10 days. the first few days were the worst... when the high bid was still relatively low. at a price point that you'd essentially be giving the camera away. that anxiety slowly waned as the days ticked by and the bid incremented higher. it ended up well. i would have loved to have received a few hundred dollars more. just like i'm sure the buyer would have loved to have gotten it for a few hundred dollars less. i suppose that right there is as good a definition as any of what constitutes a fair deal. the winning bidder was local, so i was able to meet him to consummate the exchange. a young man acquiring his first leica m. i think i was as excited for him as he was himself! hopefully we -----> can !!!  stay in touch and -----> i !!!  -----> can !!!  -----> help !!!  -----> introduce !!!  him to some of the leica folks in the area. it went well...", "sortedWord": "None", "Identifyer": null, "identifyer": 87682, "year": "2017"}, {"autor": "SARobinson", "date": "2017-06-29 14:26:00", "content": " Hello - please allow me to introduce myself... I've been lurking on the forum for a month or so - and a few weeks ago I decided to take the plunge and finally get into the Leica world. A bit of background first: I've been photographing for over 40 years, in many different formats - 35mm (Fujica, Canon, Pentax, Ricoh and Zeiss), 6x4.5 (Pentax), 6x6 (Mamiya, Rollei, Minolta and Bronica), 6x8 (Fujifilm), 6x12 (Fotoman), 4x5 (Speed Graphic and Ebony) and lastly digital (Fujifilm). I went digital when Fuji brought out the original X100 and since then I have owned most of their digital cameras (I still have the X-T2 and a couple of lenses). Anyway, the cameras I most enjoyed using were the Mamiya 6 and the Rollei TLRs. I bought the Fuji X100F earlier this year but I wasn't very impressed with it; that's when I decided to buy my first Leica. So I am now the very happy owner of an M10 and four lenses - 28mm Elmarit, 35mm Summicron, and 50mm & 75mm Summarits. I feel more connected with my photography now, maybe it's the manual focus that makes me feel that way (the vast majority of my film cameras were manual focus). I find the Leica camera and lenses a pleasure to use and I enjoy shooting with them much more than the Fujis. I live near Liverpool in the UK and shoot mainly street photographs. I also publish photozines, which (if you feel so inclined) can be seen at www.fistfulofbooks.com Cheers Simon", "link": "https://www.l-camera-forum.com/topic/273913-ive-just-jumped-head-first-into-the-world-of-leica/?tab=comments#comment-3304742", "origin": "L-forum", "suborigin": "273913-ive-just-jumped-head-first-into-the-world-of-leica", "result": true, "Selector": "me to introduce", "selectorShort": "introduce", "MarkedSent": " hello - please allow -----> me !!!  -----> to !!!  -----> introduce !!!  myself... i've been lurking on the forum for a month or so - and a few weeks ago i decided to take the plunge and finally get into the leica world. a bit of background first: i've been photographing for over 40 years, in many different formats - 35mm (fujica, canon, pentax, ricoh and zeiss), 6x4.5 (pentax), 6x6 (mamiya, rollei, minolta and bronica), 6x8 (fujifilm), 6x12 (fotoman), 4x5 (speed graphic and ebony) and lastly digital (fujifilm). i went digital when fuji brought out the original x100 and since then i have owned most of their digital cameras (i still have the x-t2 and a couple of lenses). anyway, the cameras i most enjoyed using were the mamiya 6 and the rollei tlrs. i bought the fuji x100f earlier this year but i wasn't very impressed with it; that's when i decided to buy my first leica. so i am now the very happy owner of an m10 and four lenses - 28mm elmarit, 35mm summicron, and 50mm & 75mm summarits. i feel more connected with my photography now, maybe it's the manual focus that makes me feel that way (the vast majority of my film cameras were manual focus). i find the leica camera and lenses a pleasure to use and i enjoy shooting with them much more than the fujis. i live near liverpool in the uk and shoot mainly street photographs. i also publish photozines, which (if you feel so inclined) can be seen at www.fistfulofbooks.com cheers simon", "sortedWord": "None", "Identifyer": null, "identifyer": 114451, "year": "2017"}, {"autor": "StS", "date": "2017-02-08 20:43:00", "content": "Thank you, this is as I assumed. I guess there are only a few cities like Los Angeles, where a car is mandatory to get around. Slightly tongue-in-cheek, maybe we can introduce a scale from 0-10, where 10 is Los Angeles and 0 Venice, where a car can only serve as a door-stop... Stefan", "link": "https://www.l-camera-forum.com/topic/264778-australasian-one-challenge-advance-notice/page/9/?tab=comments#comment-3208094", "origin": "L-forum", "suborigin": "264778-australasian-one-challenge-advance-notice", "result": true, "Selector": "we can introduce", "selectorShort": "introduce", "MarkedSent": "thank you, this is as i assumed. i guess there are only a few cities like los angeles, where a car is mandatory to get around. slightly tongue-in-cheek, maybe -----> we !!!  -----> can !!!  -----> introduce !!!  a scale from 0-10, where 10 is los angeles and 0 venice, where a car -----> can !!!  only serve as a door-stop... stefan", "sortedWord": "None", "Identifyer": null, "identifyer": 132202, "year": "2017"}, {"autor": "StS", "date": "2017-05-04 20:35:00", "content": "Quite a choice - sometimes I wonder, whether we should introduce more than three votes, but here it goes - Image # 17 (Music Moves The Monster *), 3 points Image # 9, (Riding On The Rocks), 2 points Image # 18, (Alley Cats), 1 point Stefam * But it won't fit though --img-- ", "link": "https://www.l-camera-forum.com/topic/272131-vote-here-for-australasian-one-challenge-day-competition/?tab=comments#comment-3268621", "origin": "L-forum", "suborigin": "272131-vote-here-for-australasian-one-challenge-day-competition", "result": true, "Selector": "we should introduce", "selectorShort": "introduce", "MarkedSent": "quite a choice - sometimes i wonder, whether -----> we !!!  -----> should !!!  -----> introduce !!!  more than three votes, but here it goes - image # 17 (music moves the monster *), 3 points image # 9, (riding on the rocks), 2 points image # 18, (alley cats), 1 point stefam * but it won't fit though --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 132408, "year": "2017"}, {"autor": "tomlianza", "date": "2017-02-26 13:54:00", "content": "After reading this thread, I brought my old R6 with the 50mm Summilux out of the cabinet that I use to store a my older cameras. I was amazed that the battery still worked after years in storage. I had forgotten how heavy it is. The view finder is wonderful. So now, I am going to throw a roll of B&W into it and actually take some time to take pictures today. I will process the film with my son. He has been shooting C-41 B&W film, but I will introduce him to Fuji Acros and teach him to develop the film. I turned him on to photography with some of my digital Nikon equipment and now he has become a much better photographer than me. He got an analog camera off of Ebay that still had a roll of film in it. He finished the roll and sent it out to be developed and scanned.....it was love a first sight. He was shocked by the latitude of the negative films. Now he always carries my Nikon D100 with negative color film. I showed him some of my older work where I exclusively shot color negative and scanned it....Ektar and Portra were actually designed to be scanned and they worked very well.... I will give him the R6 when I am ready to move on....", "link": "https://www.l-camera-forum.com/topic/268859-leica-r62-the-best-slr/page/2/?tab=comments#comment-3222161", "origin": "L-forum", "suborigin": "268859-leica-r62-the-best-slr", "result": false, "Selector": "i will introduce", "selectorShort": "introduce", "MarkedSent": "he has been shooting c-41 b&w -----> film !!! , but i will introduce him to fuji acros and teach him to develop the -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 23210, "year": "2017"}], "name": "Leicasortedout2017introduce"}