{"interestingcomments": [{"autor": "antigallican", "date": "2017-11-01 12:47:00", "content": " Hi, my M9 has drifted a bit out of adjustment. It is definitely the camera - I have several lenses and it focuses short of where the rangefinder is indicating on all of them. I was a bit disappointed when I took it to a well known London dealer and they just took a photo of a distant hoarding and said 'no that's fine.' Is there a good camera mechanic is the south of England who can get it dead right? I don't want to send it on holiday to Wetzlar for a month and in any case I'm not convinced a careless delivery man somewhere between here and Germany couldn't knock it out again as soon as they'd fixed it. I know some people DIY but I would rather use a mechanic. Thanks for any info. John", "link": "https://www.l-camera-forum.com/topic/278343-m9-adjustment/?tab=comments#comment-3386390", "origin": "L-forum", "suborigin": "278343-m9-adjustment", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " hi, my m9 has drifted a bit out of adjustment. it is definitely the camera - i have several lenses and it focuses short of where the rangefinder is indicating on all of them. i was a bit disappointed when i took it to a well known london dealer and they just took a photo of a distant hoarding and said 'no that's fine.' is there a good camera mechanic is the south of england who can get it dead right? i don't want to send it on holiday to wetzlar for a month and in any case i'm not convinced a careless delivery man somewhere between here and germany couldn't knock it out again as soon as they'd fixed it. i know some people -----> diy !!!  but i would rather use a mechanic. thanks for any info. john", "sortedWord": "None", "Identifyer": null, "identifyer": 37627, "year": "2017"}, {"autor": "jaapv", "date": "2017-11-05 17:43:00", "content": "Hi, my M9 has drifted a bit out of adjustment. It is definitely the camera - I have several lenses and it focuses short of where the rangefinder is indicating on all of them. I was a bit disappointed when I took it to a well known London dealer and they just took a photo of a distant hoarding and said 'no that's fine.' Is there a good camera mechanic is the south of England who can get it dead right? I don't want to send it on holiday to Wetzlar for a month and in any case I'm not convinced a careless delivery man somewhere between here and Germany couldn't knock it out again as soon as they'd fixed it. I know some people DIY but I would rather use a mechanic. Thanks for any info. John This is just a matter of giving the roller a minimal twist with a 2 mm Allen Key. A few minutes DIY.", "link": "https://www.l-camera-forum.com/topic/278343-m9-adjustment/?tab=comments#comment-3389492", "origin": "L-forum", "suborigin": "278343-m9-adjustment", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hi, my m9 has drifted a bit out of adjustment. it is definitely the camera - i have several lenses and it focuses short of where the rangefinder is indicating on all of them. i was a bit disappointed when i took it to a well known london dealer and they just took a photo of a distant hoarding and said 'no that's fine.' is there a good camera mechanic is the south of england who can get it dead right? i don't want to send it on holiday to wetzlar for a month and in any case i'm not convinced a careless delivery man somewhere between here and germany couldn't knock it out again as soon as they'd fixed it. i know some people -----> diy !!!  but i would rather use a mechanic. thanks for any info. john this is just a matter of giving the roller a minimal twist with a 2 mm allen key. a few minutes diy.", "sortedWord": "None", "Identifyer": null, "identifyer": 37630, "year": "2017"}, {"autor": "pico", "date": "2017-05-17 19:57:00", "content": "I am lucky to have 110 volt AC in the vehicle as well as three fused 12 volt D.C. It's a DIY thing for the handy.", "link": "https://www.l-camera-forum.com/topic/151529-m9-battery-charger-dead/page/2/?tab=comments#comment-3276991", "origin": "L-forum", "suborigin": "151529-m9-battery-charger-dead", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i am lucky to have 110 volt ac in the vehicle as well as three fused 12 volt d.c. it's a -----> diy !!!  thing for the handy.", "sortedWord": "None", "Identifyer": null, "identifyer": 38889, "year": "2017"}, {"autor": "jaapv", "date": "2017-10-05 07:02:00", "content": "You really should learn to clean your sensor yourself. It is a five-minute DIY job. Look in the FAQ at the top of this forum. It is all fine when you don't mind missing your camera for days, but what are you going to do when it develops dust halfway your holiday? You can take it into one of the many camerashops that offer this service whilst you wait as well.", "link": "https://www.l-camera-forum.com/topic/277482-light-grey-dots-on-the-newly-replaced-ccd-sensor-on-the-m9/?tab=comments#comment-3370644", "origin": "L-forum", "suborigin": "277482-light-grey-dots-on-the-newly-replaced-ccd-sensor-on-the-m9", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "you really should learn to clean your sensor yourself. it is a five-minute -----> diy !!!  job. look in the faq at the top of this forum. it is all fine when you don't mind missing your camera for days, but what are you going to do when it develops dust halfway your holiday? you can take it into one of the many camerashops that offer this service whilst you wait as well.", "sortedWord": "None", "Identifyer": null, "identifyer": 39223, "year": "2017"}, {"autor": "howareyoukk", "date": "2017-10-05 11:34:00", "content": "You really should learn to clean your sensor yourself. It is a five-minute DIY job. Look in the FAQ at the top of this forum. It is all fine when you don't mind missing your camera for days, but what are you going to do when it develops dust halfway your holiday? You can take it into one of the many camerashops that offer this service whilst you wait as well. Hi thanks for the input. I notice you are the moderator with a great depth of knowledge with Leica cameras. Admittedly, I do reckon being able to perform sensor cleaning is a vital skill but putting this aside, would you comment on the nature of the dots that they are dusts and not spots caused by sensor corrosion once again? thanks.", "link": "https://www.l-camera-forum.com/topic/277482-light-grey-dots-on-the-newly-replaced-ccd-sensor-on-the-m9/?tab=comments#comment-3370760", "origin": "L-forum", "suborigin": "277482-light-grey-dots-on-the-newly-replaced-ccd-sensor-on-the-m9", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "you really should learn to clean your sensor yourself. it is a five-minute -----> diy !!!  job. look in the faq at the top of this forum. it is all fine when you don't mind missing your camera for days, but what are you going to do when it develops dust halfway your holiday? you can take it into one of the many camerashops that offer this service whilst you wait as well. hi thanks for the input. i notice you are the moderator with a great depth of knowledge with leica cameras. admittedly, i do reckon being able to perform sensor cleaning is a vital skill but putting this aside, would you comment on the nature of the dots that they are dusts and not spots caused by sensor corrosion once again? thanks.", "sortedWord": "None", "Identifyer": null, "identifyer": 39226, "year": "2017"}, {"autor": "Ko.Fe.", "date": "2017-11-28 02:32:00", "content": "Put IR/Cut filter in the budget... You could find new Nokton 35, 40 1.4, Color Skopar 35 2.5 and used Ultron 35 1.7 ASPH LTM for less. Even cheap Jupiter-12 will do with interesting colors and some crazy flare --img--  But 28mm frames seems to be less cluttered, yet, it is harder to find budget lens in this leight. Cheap Orion 15 will do, then Canon 28 3.5/2.8 and then Color Skopar 28 3.5. Elmarit-M 28 2.8 V3 should be closed to your price range. I went extreme and have $7 Industar-61 lens. Due to M8 crop factor it worked fine, but it requires just little bit of DIY to get it focusing right on Leica (scale focus only). --img--  50mm is too tele on M9 already, IMO --img-- With M8 you could have 24mm frames and here is Color Skopar 25 f4, used or new it is not expensive. Very good lens. But check first if you could see these 24mm framelines. Edited November 28, 2017 by Ko.Fe.", "link": "https://www.l-camera-forum.com/topic/279272-just-bought-my-first-ever-leica-m82-now-what-lens-should-i-buy/?tab=comments#comment-3405302", "origin": "L-forum", "suborigin": "279272-just-bought-my-first-ever-leica-m82-now-what-lens-should-i-buy", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "put ir/cut filter in the budget... you could find new nokton 35, 40 1.4, color skopar 35 2.5 and used ultron 35 1.7 asph ltm for less. even cheap jupiter-12 will do with interesting colors and some crazy flare --img--  but 28mm frames seems to be less cluttered, yet, it is harder to find budget lens in this leight. cheap orion 15 will do, then canon 28 3.5/2.8 and then color skopar 28 3.5. elmarit-m 28 2.8 v3 should be closed to your price range. i went extreme and have $7 industar-61 lens. due to m8 crop factor it worked fine, but it requires just little bit of -----> diy !!!  to get it focusing right on leica (scale focus only). --img--  50mm is too tele on m9 already, imo --img-- with m8 you could have 24mm frames and here is color skopar 25 f4, used or new it is not expensive. very good lens. but check first if you could see these 24mm framelines. edited november 28, 2017 by ko.fe.", "sortedWord": "None", "Identifyer": null, "identifyer": 44402, "year": "2017"}, {"autor": "shutterpete", "date": "2017-11-28 10:26:00", "content": "Put IR/Cut filter in the budget... You could find new Nokton 35, 40 1.4, Color Skopar 35 2.5 and used Ultron 35 1.7 ASPH LTM for less. Even cheap Jupiter-12 will do with interesting colors and some crazy flare --img--  But 28mm frames seems to be less cluttered, yet, it is harder to find budget lens in this leight. Cheap Orion 15 will do, then Canon 28 3.5/2.8 and then Color Skopar 28 3.5. Elmarit-M 28 2.8 V3 should be closed to your price range. I went extreme and have $7 Industar-61 lens. Due to M8 crop factor it worked fine, but it requires just little bit of DIY to get it focusing right on Leica (scale focus only). --img--  50mm is too tele on M9 already, IMO --img-- With M8 you could have 24mm frames and here is Color Skopar 25 f4, used or new it is not expensive. Very good lens. But check first if you could see these 24mm framelines. Thank you so much for this valuable info.", "link": "https://www.l-camera-forum.com/topic/279272-just-bought-my-first-ever-leica-m82-now-what-lens-should-i-buy/?tab=comments#comment-3405480", "origin": "L-forum", "suborigin": "279272-just-bought-my-first-ever-leica-m82-now-what-lens-should-i-buy", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "put ir/cut filter in the budget... you could find new nokton 35, 40 1.4, color skopar 35 2.5 and used ultron 35 1.7 asph ltm for less. even cheap jupiter-12 will do with interesting colors and some crazy flare --img--  but 28mm frames seems to be less cluttered, yet, it is harder to find budget lens in this leight. cheap orion 15 will do, then canon 28 3.5/2.8 and then color skopar 28 3.5. elmarit-m 28 2.8 v3 should be closed to your price range. i went extreme and have $7 industar-61 lens. due to m8 crop factor it worked fine, but it requires just little bit of -----> diy !!!  to get it focusing right on leica (scale focus only). --img--  50mm is too tele on m9 already, imo --img-- with m8 you could have 24mm frames and here is color skopar 25 f4, used or new it is not expensive. very good lens. but check first if you could see these 24mm framelines. thank you so much for this valuable info.", "sortedWord": "None", "Identifyer": null, "identifyer": 44404, "year": "2017"}, {"autor": "dpitt", "date": "2017-01-20 03:43:00", "content": "IMO, it would be hard to sell, and i doubt it is an easy DIY job. Most parts and tools to do the job are not available on open market. Best option would probably be to have it repaired. Then you will have a M8 in very good shape and with warranty on most of it. That is worth something more than a normal M8 on the second hand market. Of course, if there are some visible marks of the drop left after the repair, it might not sell at all. There are plenty nice looking M8's around....", "link": "https://www.l-camera-forum.com/topic/268451-sell-m8-for-parts/?tab=comments#comment-3191585", "origin": "L-forum", "suborigin": "268451-sell-m8-for-parts", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "imo, it would be hard to sell, and i doubt it is an easy -----> diy !!!  job. most parts and tools to do the job are not available on open market. best option would probably be to have it repaired. then you will have a m8 in very good shape and with warranty on most of it. that is worth something more than a normal m8 on the second hand market. of course, if there are some visible marks of the drop left after the repair, it might not sell at all. there are plenty nice looking m8's around....", "sortedWord": "None", "Identifyer": null, "identifyer": 45721, "year": "2017"}, {"autor": "250swb", "date": "2017-12-09 08:07:00", "content": " The only thing that would have changed would be shutter or aperture: The other thing that could have changed is how long it was between shots. So if one photo doesn't have the leak it could be because the film didn't linger in the gate long enough. I agree with Philipp and Ian as to the most likely cause, the leak is hitting the back of the film, and always in the same spot. So check the door, is it located correctly, and if you remove the rear door there should be a length of undamaged foam running along the hinge line side to side along the top edge of the rebate in the body (this is the only foam seal). If this is damaged it is a very simple DIY job to replace it with a light seal kit from eBay. If the leak is moving across the frame in other photos that you haven't shown also check the strap lug. Edited December 9, 2017 by 250swb", "link": "https://www.l-camera-forum.com/topic/279646-m6-light-leak-maybe-help/?tab=comments#comment-3414188", "origin": "L-forum", "suborigin": "279646-m6-light-leak-maybe-help", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " the only thing that would have changed would be shutter or aperture: the other thing that could have changed is how long it was between shots. so if one photo doesn't have the leak it could be because the film didn't linger in the gate long enough. i agree with philipp and ian as to the most likely cause, the leak is hitting the back of the film, and always in the same spot. so check the door, is it located correctly, and if you remove the rear door there should be a length of undamaged foam running along the hinge line side to side along the top edge of the rebate in the body (this is the only foam seal). if this is damaged it is a very simple -----> diy !!!  job to replace it with a light seal kit from ebay. if the leak is moving across the frame in other photos that you haven't shown also check the strap lug. edited december 9, 2017 by 250swb", "sortedWord": "None", "Identifyer": null, "identifyer": 6256, "year": "2017"}, {"autor": "heycadet", "date": "2017-12-09 15:28:00", "content": "The M6 has a back door, if I'm not mistaken. You could try and stick a piece of opaqe tape over the edge of the back door, on the top right hand side, i.e. under the film advancing lever. Very good idea. Will give it a go. The other thing that could have changed is how long it was between shots. So if one photo doesn't have the leak it could be because the film didn't linger in the gate long enough. I agree with Philipp and Ian as to the most likely cause, the leak is hitting the back of the film, and always in the same spot. So check the door, is it located correctly, and if you remove the rear door there should be a length of undamaged foam running along the hinge line side to side along the top edge of the rebate in the body (this is the only foam seal). If this is damaged it is a very simple DIY job to replace it with a light seal kit from eBay. If the leak is moving across the frame in other photos that you haven't shown also check the strap lug. You're right. It's also possible that I could have blocked the leak sometimes with my hand if I was taking the photos back to back. I have a few rolls from the start of this development run that have no leak at all; but now that I'm thinking about it. I had the M6 in a leather case then, that blocked the back door completely. So this must be the issue. I took it out of the case because it was too bulky; but that could have easily exposed this issue. Will look into this all tonight. Thanks very much everyone!", "link": "https://www.l-camera-forum.com/topic/279646-m6-light-leak-maybe-help/?tab=comments#comment-3414379", "origin": "L-forum", "suborigin": "279646-m6-light-leak-maybe-help", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "the m6 has a back door, if i'm not mistaken. you could try and stick a piece of opaqe tape over the edge of the back door, on the top right hand side, i.e. under the film advancing lever. very good idea. will give it a go. the other thing that could have changed is how long it was between shots. so if one photo doesn't have the leak it could be because the film didn't linger in the gate long enough. i agree with philipp and ian as to the most likely cause, the leak is hitting the back of the film, and always in the same spot. so check the door, is it located correctly, and if you remove the rear door there should be a length of undamaged foam running along the hinge line side to side along the top edge of the rebate in the body (this is the only foam seal). if this is damaged it is a very simple -----> diy !!!  job to replace it with a light seal kit from ebay. if the leak is moving across the frame in other photos that you haven't shown also check the strap lug. you're right. it's also possible that i could have blocked the leak sometimes with my hand if i was taking the photos back to back. i have a few rolls from the start of this development run that have no leak at all; but now that i'm thinking about it. i had the m6 in a leather case then, that blocked the back door completely. so this must be the issue. i took it out of the case because it was too bulky; but that could have easily exposed this issue. will look into this all tonight. thanks very much everyone!", "sortedWord": "None", "Identifyer": null, "identifyer": 6257, "year": "2017"}, {"autor": "Yaroslavk", "date": "2017-08-08 16:17:00", "content": "Awesome idea, didn't even think of going the diy route. I'm sorry if this has been answered (I've re-read the thread several times but didn't get it) - but what is the right way to connect it. I.e - which color cable from the remote to which connection on the plug (t,r,s). Thanks so much!", "link": "https://www.l-camera-forum.com/topic/275269-rc-scl4-remote-trigger-wiring-modification/?tab=comments#comment-3332843", "origin": "L-forum", "suborigin": "275269-rc-scl4-remote-trigger-wiring-modification", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "awesome idea, didn't even think of going the -----> diy !!!  route. i'm sorry if this has been answered (i've re-read the thread several times but didn't get it) - but what is the right way to connect it. i.e - which color cable from the remote to which connection on the plug (t,r,s). thanks so much!", "sortedWord": "None", "Identifyer": null, "identifyer": 34270, "year": "2017"}, {"autor": "jankap", "date": "2017-06-05 06:57:00", "content": "The Hoodman loupe is very useful. You could try to fix it on your camera via the tripod screw. DIY, I fear. I use it for my Ricoh and my D-Lux4. There also are loupes, that have a magnetic mount. I bought a very cheap one. But it is not adjustable, so I need my specs to use it. Not comfortable. Jan PS Here the Hoodman loupe in action. The picture was made by Duncan (dunk) during meeting of the Leica Society. --img--  Edited June 5, 2017 by jankap", "link": "https://www.l-camera-forum.com/topic/273185-visoflex-020/?tab=comments#comment-3289410", "origin": "L-forum", "suborigin": "273185-visoflex-020", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "the hoodman loupe is very useful. you could try to fix it on your camera via the tripod screw. -----> diy !!! , i fear. i use it for my ricoh and my d-lux4. there also are loupes, that have a magnetic mount. i bought a very cheap one. but it is not adjustable, so i need my specs to use it. not comfortable. jan ps here the hoodman loupe in action. the picture was made by duncan (dunk) during meeting of the leica society. --img--  edited june 5, 2017 by jankap", "sortedWord": "None", "Identifyer": null, "identifyer": 11470, "year": "2017"}, {"autor": "Ko.Fe.", "date": "2017-07-17 20:23:00", "content": "Single lens photography is a very reasonable approach on aesthetic/philosophical grounds. But your actual advice that I responded to was \"I would not recommend to switch lenses while on backpacking trip (dust, dirt, moisture and risk of dropping the lens)\". Yes, Sir, my advice was based on my travel with nothing but one backpack experience, one of my colleagues backpack walks for months across the Europe experience and the link on the Leica Blog with half-year travel across rugged Mongolia experience of one M, one lens user. One year of travel... How much dust and else will be accumulated by switching lenses on Leica sensor after few months? You could find Canon service for cleaning and pay for fast service or independent service or DIY. But Leica does not recommend DIY cleaning rather what blowing dust. But switching lenses on backpack trip over year will involve too many chances to have something else on the sensor. I've got bird poop right on my new Leica lens on new M-E within few weeks after buying camera --img--  Likely it was hooded and with protecting filter on the lens. Edited July 17, 2017 by Ko.Fe.", "link": "https://www.l-camera-forum.com/topic/274495-which-leica-for-round-the-world-backpacking/page/4/?tab=comments#comment-3317902", "origin": "L-forum", "suborigin": "274495-which-leica-for-round-the-world-backpacking", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "single lens photography is a very reasonable approach on aesthetic/philosophical grounds. but your actual advice that i responded to was \"i would not recommend to switch lenses while on backpacking trip (dust, dirt, moisture and risk of dropping the lens)\". yes, sir, my advice was based on my travel with nothing but one backpack experience, one of my colleagues backpack walks for months across the europe experience and the link on the leica blog with half-year travel across rugged mongolia experience of one m, one lens user. one year of travel... how much dust and else will be accumulated by switching lenses on leica sensor after few months? you could find canon service for cleaning and pay for fast service or independent service or -----> diy !!! . but leica does not recommend diy cleaning rather what blowing dust. but switching lenses on backpack trip over year will involve too many chances to have something else on the sensor. i've got bird poop right on my new leica lens on new m-e within few weeks after buying camera --img--  likely it was hooded and with protecting filter on the lens. edited july 17, 2017 by ko.fe.", "sortedWord": "None", "Identifyer": null, "identifyer": 84672, "year": "2017"}, {"autor": "LocalHero1953", "date": "2017-07-17 21:03:00", "content": "Yes, Sir, my advice was based on my travel with nothing but one backpack experience, one of my colleagues backpack walks for months across the Europe experience and the link on the Leica Blog with half-year travel across rugged Mongolia experience of one M, one lens user. One year of travel... How much dust and else will be accumulated by switching lenses on Leica sensor after few months? You could find Canon service for cleaning and pay for fast service or independent service or DIY. But Leica does not recommend DIY cleaning rather what blowing dust. But switching lenses on backpack trip over year will involve too many chances to have something else on the sensor. I've got bird poop right on my new Leica lens on new M-E within few weeks after buying camera --img--  Likely it was hooded and with protecting filter on the lens. Well, all I can say is that my experience is different, and I change lenses wherever I go (last trip, Oman). A blower every few months seems to deal with most dust I encounter.", "link": "https://www.l-camera-forum.com/topic/274495-which-leica-for-round-the-world-backpacking/page/4/?tab=comments#comment-3317929", "origin": "L-forum", "suborigin": "274495-which-leica-for-round-the-world-backpacking", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "yes, sir, my advice was based on my travel with nothing but one backpack experience, one of my colleagues backpack walks for months across the europe experience and the link on the leica blog with half-year travel across rugged mongolia experience of one m, one lens user. one year of travel... how much dust and else will be accumulated by switching lenses on leica sensor after few months? you could find canon service for cleaning and pay for fast service or independent service or -----> diy !!! . but leica does not recommend diy cleaning rather what blowing dust. but switching lenses on backpack trip over year will involve too many chances to have something else on the sensor. i've got bird poop right on my new leica lens on new m-e within few weeks after buying camera --img--  likely it was hooded and with protecting filter on the lens. well, all i can say is that my experience is different, and i change lenses wherever i go (last trip, oman). a blower every few months seems to deal with most dust i encounter.", "sortedWord": "None", "Identifyer": null, "identifyer": 84677, "year": "2017"}, {"autor": "Ko.Fe.", "date": "2017-05-26 23:08:00", "content": "I would get NAS (box from the store with software or DIY with 1 RU old file server and free OS). https://www.newegg.ca/Product/Product.aspx?Item=9SIA9M353R6296&cm_re=three_bay_NAS-_-22-122-207-_-Product With some of the RAID configurations you could get to your files faster. Or you could get it more redundant. http://www.raid-calculator.com/raid-types-reference.aspx", "link": "https://www.l-camera-forum.com/topic/272877-image-storage-bigger-and-bigger-storage-drives/?tab=comments#comment-3283451", "origin": "L-forum", "suborigin": "272877-image-storage-bigger-and-bigger-storage-drives", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i would get nas (box from the store with software or -----> diy !!!  with 1 ru old file server and free os). https://www.newegg.ca/product/product.aspx?item=9sia9m353r6296&cm_re=three_bay_nas-_-22-122-207-_-product with some of the raid configurations you could get to your files faster. or you could get it more redundant. http://www.raid-calculator.com/raid-types-reference.aspx", "sortedWord": "None", "Identifyer": null, "identifyer": 92187, "year": "2017"}, {"autor": "pico", "date": "2017-05-26 23:33:00", "content": " I would get NAS (box from the store with software or DIY with 1 RU old file server and free OS). https://www.newegg.ca/Product/Product.aspx?Item=9SIA9M353R6296&cm_re=three_bay_NAS-_-22-122-207-_-Product With some of the RAID configurations you could get to your files faster. Or you could get it more redundant. http://www.raid-calculator.com/raid-types-reference.aspx So what happens when the NAS box's controller smokes? .", "link": "https://www.l-camera-forum.com/topic/272877-image-storage-bigger-and-bigger-storage-drives/?tab=comments#comment-3283459", "origin": "L-forum", "suborigin": "272877-image-storage-bigger-and-bigger-storage-drives", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " i would get nas (box from the store with software or -----> diy !!!  with 1 ru old file server and free os). https://www.newegg.ca/product/product.aspx?item=9sia9m353r6296&cm_re=three_bay_nas-_-22-122-207-_-product with some of the raid configurations you could get to your files faster. or you could get it more redundant. http://www.raid-calculator.com/raid-types-reference.aspx so what happens when the nas box's controller smokes? .", "sortedWord": "None", "Identifyer": null, "identifyer": 92188, "year": "2017"}, {"autor": "Ko.Fe.", "date": "2017-02-15 17:53:00", "content": "I just added M8 to my M series small, analog and digital collection, preferred it over X line, but just because I'm Leica and RF fan. Here is no screens left for M8, not sure about sensors and shutters might be still serviceable. If you tend to use color film the price gap will increase quickly with M6. If you tend to use BW film and DIY then for price of M6 you could get one of the M4 series together with ten or so bulks of bw film which will be enough until next CLA.", "link": "https://www.l-camera-forum.com/topic/269436-m8-parts-and-maintenance-risky-to-buy/?tab=comments#comment-3213792", "origin": "L-forum", "suborigin": "269436-m8-parts-and-maintenance-risky-to-buy", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "if you tend to use bw -----> film !!!  and diy then for price of m6 you could get one of the m4 series together with ten or so bulks of bw -----> film !!!  which will be enough until next cla.", "sortedWord": "film", "Identifyer": null, "identifyer": 45674, "year": "2017"}], "name": "Leicasortedout2017diy"}