{"interestingcomments": [{"autor": "carstenw", "date": "2009-09-28 22:05:00", "content": "Well, I love the old Noctilux and will buy one when I can, and I would like to test the new one, but will not buy it: too expensive. Still, the photos I have seen made with the new one look awesome, and I don't see the loss of soul at all that some are talking about. Perhaps some examples could be posted, rather than just talk?", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/2/?tab=comments#comment-1053816", "origin": "L-forum", "suborigin": "98348-new-and-old-noctilux", "result": true, "Selector": "i have seen made", "selectorShort": "make", "MarkedSent": "well, i love the old noctilux and will buy one when i can, and i would like to test the new one, but will not buy it: too expensive. still, the photos -----> i !!!  -----> have !!!  -----> seen !!!  -----> made !!!  with the new one look awesome, and -----> i !!!  don't see the loss of soul at all that some are talking about. perhaps some examples could be posted, rather than just talk?", "sortedWord": "None", "Identifyer": null, "identifyer": 35487, "year": "2009"}, {"autor": "haribo", "date": "2009-09-29 15:04:00", "content": "It is possible that just my copy or maybe just some suffer from focus shift. If I cant get consistent focus with a lens than it leads to worse images. Thats how I see it. Some things might be discussed on a very theoretical base, but precise focus is something which has a lot of influence on the result/the image. To talk with your words: if I get consistently better results with one golf club compared to another one than I just use the one I get the better results with. If I get good results with 4 golf clubs but only here and then with the fifth I assume it´s the club and not my game. Again, if you and others get good reliable results with the Noctilux on a digital M without any focus shift- great, I tried for about 1 year (including sending the lens to Solms) and finally gave up. Regards, Tom Maybe I should have made a bigger line space between the first and second part of my post. Only the first sentence was directed at you. I feel sorry for your misfortune with your Nocti but it is not a general problem with this lens. That's all I meant saying. The second part was not directed at you. It was merely a general observation.", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/3/?tab=comments#comment-1054621", "origin": "L-forum", "suborigin": "98348-new-and-old-noctilux", "result": true, "Selector": "i should have made", "selectorShort": "make", "MarkedSent": "it is possible that just my copy or maybe just some suffer from focus shift. if i cant get consistent focus with a lens than it leads to worse images. thats how i see it. some things might be discussed on a very theoretical base, but precise focus is something which has a lot of influence on the result/the image. to talk with your words: if i get consistently better results with one golf club compared to another one than i just use the one i get the better results with. if i get good results with 4 golf clubs but only here and then with the fifth i assume it´s the club and not my game. again, if you and others get good reliable results with the noctilux on a digital m without any focus shift- great, i tried for about 1 year (including sending the lens to solms) and finally gave up. regards, tom maybe -----> i !!!  -----> should !!!  -----> have !!!  -----> made !!!  a bigger line space between the first and second part of my post. only the first sentence was directed at you. i feel sorry for your misfortune with your nocti but it is not a general problem with this lens. that's all i meant saying. the second part was not directed at you. it was merely a general observation.", "sortedWord": "None", "Identifyer": null, "identifyer": 35508, "year": "2009"}, {"autor": "Nikkor AIS", "date": "2009-12-01 00:39:00", "content": "You know sometimes when you wish for something for a long time and you finally get it, you're disappointed. Not so with my Noctilux 50 1.0. It's been glued to my M3 since I got it about a month ago from KEH (thanks Arthur). I love it so much. The only complaint is not having 1/8000 on my M3/M6. And I haven't been able to locate at ND 6X as of yet. So I'm making do with a 60 polarizer:rolleyes:. I have not scanned the slow negs I've taken with the Noct, but many examples are up on my SmugMug site with XP-2. Almost all were taken at 1.0. I even tested it on the M9:D. At any rate, I'm pleasantly surprised at the performance at 8 1/2-11 and have no hesitation in using the Noctilux as a normal lens. Compared to the Canon 50 1.0 AF the Noctilux 50 1.0 is petite. My only problem focusing has been in some occasions where I couldn't back up any more and the my son wouldn't move further away. If find the Lecia M rangefinders accuracy to be perfect on my M3/M6. Gregory SmugMug Photo & Video Sharing. You look better here. Edited December 1, 2009 by Nikkor AIS", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/5/?tab=comments#comment-1135932", "origin": "L-forum", "suborigin": "98348-new-and-old-noctilux", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "you know sometimes when you wish for something for a long time and you finally get it, you're disappointed. not so with my noctilux 50 1.0. it's been glued to my m3 since i got it about a month ago from keh (thanks arthur). i love it so much. the only complaint is not having 1/8000 on my m3/m6. and i haven't been able to locate at nd 6x as of yet. so -----> i !!! 'm -----> making !!!  do with a 60 polarizer:rolleyes:. i have not scanned the slow negs i've taken with the noct, but many examples are up on my smugmug site with xp-2. almost all were taken at 1.0. i even tested it on the m9:d. at any rate, i'm pleasantly surprised at the performance at 8 1/2-11 and have no hesitation in using the noctilux as a normal lens. compared to the canon 50 1.0 af the noctilux 50 1.0 is petite. my only problem focusing has been in some occasions where i couldn't back up any more and the my son wouldn't move further away. if find the lecia m rangefinders accuracy to be perfect on my m3/m6. gregory smugmug photo & video sharing. you look better here. edited december 1, 2009 by nikkor ais", "sortedWord": "None", "Identifyer": null, "identifyer": 35557, "year": "2009"}, {"autor": "gravastar", "date": "2009-12-01 01:33:00", "content": "............... And I haven't been able to locate at ND 6X as of yet. So I'm making do with a 60 polarizer:rolleyes:. ..................................Gregory SmugMug Photo & Video Sharing. You look better here. You can get 58mm and 60mm ND filters from Foto Huppert in germany. I've some on order for my f1.0 Noctilux and have recently received some Series 7 MRC coated ones, they're very well made. Here are the catalog numbers which you can enter into the site's search engine to find them. They also have slim and silver versions. Density __ Stops __ 58mm _____ 60mm 0.3 _______ 1 ____ 958,101 ____ 960,101 0.6 _______ 2 ____ 958,102 ____ A60102 0.9 _______ 3 ____ 958,103 ____ 960,103 1.8 _______ 6 ____ 958,106 ____ 960,106 3.0 ______ 10 ____ 958,110 ____ 960,110 All are coated but not all may be MRC. There's additional information in post #17 of this thread. Bob.", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/5/?tab=comments#comment-1135971", "origin": "L-forum", "suborigin": "98348-new-and-old-noctilux", "result": true, "Selector": "i'm making", "selectorShort": "make", "MarkedSent": "............... and i haven't been able to locate at nd 6x as of yet. so -----> i !!! 'm -----> making !!!  do with a 60 polarizer:rolleyes:. ..................................gregory smugmug photo & video sharing. you look better here. you can get 58mm and 60mm nd filters from foto huppert in germany. i've some on order for my f1.0 noctilux and have recently received some series 7 mrc coated ones, they're very well made. here are the catalog numbers which you can enter into the site's search engine to find them. they also have slim and silver versions. density __ stops __ 58mm _____ 60mm 0.3 _______ 1 ____ 958,101 ____ 960,101 0.6 _______ 2 ____ 958,102 ____ a60102 0.9 _______ 3 ____ 958,103 ____ 960,103 1.8 _______ 6 ____ 958,106 ____ 960,106 3.0 ______ 10 ____ 958,110 ____ 960,110 all are coated but not all may be mrc. there's additional information in post #17 of this thread. bob.", "sortedWord": "None", "Identifyer": null, "identifyer": 35558, "year": "2009"}, {"autor": "ericperlberg", "date": "2009-10-22 13:16:00", "content": "Thank you for your advice dear Piero. I'm just not sure what resolution I should upload my images to my website. I don't want to slow down my website because of too large fils. Any advice would be appreciated. Birgit, I had the same reaction, your images all showed major artifacts (those rectangular like shapes in the background or solid grey areas of your images. This could be the result of too low a resolution when making them jpgs and setting them up for the web or it could be because you're heavily cropping the images initially and then enlarging the crops. Assuming you're not cropping much and the images are pretty much as they come from the camera, I would think you could resize to the size you're using now (roughly 587x473) and convert to jpg using 80% qualiity which should result in file sizes of about 35kb each which is way small enough. I routinely make my web files 10x that size. In this day and age most people who would care have speedy broadband connections. It seems a shame to undervalue your work for the sake of the few who still have dialup connections. If these images are just small areas of crop out of a much larger image then that would cause a similar problem and unfortunately that will leave you with these artifacts. You've spent far too much money on your camera to go this route with your images. If you find yourself consistently cropping to only a fraction of the original image, use a narrower angle lens or get closer to your subject. All the best for your new camera!", "link": "https://www.l-camera-forum.com/topic/97907-collecting-leica-m9-sites/page/3/?tab=comments#comment-1085156", "origin": "L-forum", "suborigin": "97907-collecting-leica-m9-sites", "result": true, "Selector": "i routinely make", "selectorShort": "make", "MarkedSent": "thank you for your advice dear piero. i'm just not sure what resolution i should upload my images to my website. i don't want to slow down my website because of too large fils. any advice would be appreciated. birgit, i had the same reaction, your images all showed major artifacts (those rectangular like shapes in the background or solid grey areas of your images. this could be the result of too low a resolution when making them jpgs and setting them up for the web or it could be because you're heavily cropping the images initially and then enlarging the crops. assuming you're not cropping much and the images are pretty much as they come from the camera, i would think you could resize to the size you're using now (roughly 587x473) and convert to jpg using 80% qualiity which should result in file sizes of about 35kb each which is way small enough. -----> i !!!  -----> routinely !!!  -----> make !!!  my web files 10x that size. in this day and age most people who would care have speedy broadband connections. it seems a shame to undervalue your work for the sake of the few who still have dialup connections. if these images are just small areas of crop out of a much larger image then that would cause a similar problem and unfortunately that will leave you with these artifacts. you've spent far too much money on your camera to go this route with your images. if you find yourself consistently cropping to only a fraction of the original image, use a narrower angle lens or get closer to your subject. all the best for your new camera!", "sortedWord": "None", "Identifyer": null, "identifyer": 36662, "year": "2009"}, {"autor": "Bixi", "date": "2009-10-22 19:38:00", "content": "Dear Piero and Eric, Thank you both for your insight. Most of my photographs don't have hardly any cropping. I work with Lightroom. Then I import my images into iPhoto. And from iPhoto I bring them into iWeb. Maybe this isn't the best way to do things, but it works for me. I wasn't able to build my website with Lightroom. Somehow I couldn't make it work. Now I have to import my images in better resolution from LIghtroom into iPhoto. This will be my next project. Thanks again,Bixi", "link": "https://www.l-camera-forum.com/topic/97907-collecting-leica-m9-sites/page/3/?tab=comments#comment-1085692", "origin": "L-forum", "suborigin": "97907-collecting-leica-m9-sites", "result": true, "Selector": "i couldn't make", "selectorShort": "make", "MarkedSent": "dear piero and eric, thank you both for your insight. most of my photographs don't have hardly any cropping. i work with lightroom. then i import my images into iphoto. and from iphoto i bring them into iweb. maybe this isn't the best way to do things, but it works for me. i wasn't able to build my website with lightroom. somehow -----> i !!!  -----> could !!! -----> n't !!!  -----> make !!!  it work. now i have to import my images in better resolution from lightroom into iphoto. this will be my next project. thanks again,bixi", "sortedWord": "None", "Identifyer": null, "identifyer": 36663, "year": "2009"}, {"autor": "Bill W", "date": "2009-10-08 00:35:00", "content": "I have never been a big flash user. I had an SF20 that I recently sold. I bought the SF58 when it first came out and for me......it is idiot proof flash when I need it. Straight on or bounce it does the job. Of course I am not making a living from shooting so my results may not be up to others standards. Again, I am an idiot at flash but smarter with the SF58...!!!", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/2/?tab=comments#comment-1066413", "origin": "L-forum", "suborigin": "99414-reidreview-review-of-leica-sf58-flash-unit", "result": true, "Selector": "i am not making", "selectorShort": "make", "MarkedSent": "i have never been a big flash user. i had an sf20 that i recently sold. i bought the sf58 when it first came out and for me......it is idiot proof flash when i need it. straight on or bounce it does the job. of course -----> i !!!  -----> am !!!  -----> not !!!  -----> making !!!  a living from shooting so my results may -----> not !!!  be up to others standards. again, i am an idiot at flash but smarter with the sf58...!!!", "sortedWord": "None", "Identifyer": null, "identifyer": 37670, "year": "2009"}, {"autor": "amedick", "date": "2009-10-08 07:47:00", "content": "Maybe because of the pre-flash. Can you make several Metz working together in GNC mode with an M8? Lucien Lucien, the Metz remote \"cordless\" mode does not work with the pre-flash. I could not make the Metz flashes work together in GNC mode. Sorry, my message was not so clear, put together on an iPhone. The way I got the Metz flashes to work together was by having a \"master\" Metz flash mounted on the M8, in master / A mode, and the remote flashes in \"slave\" / TTL mode using the 3083 on the 54MZ4 or 40 Mz2 or the 70Mz standalone (it has built in functionality). In a nutshell the M8 and master interacted with each other in a classic \"A\" mode, while the remote flashes interacting with the master in the m8 in a cordless TTL mode (infrared pulses), cutting their output when signaled by the master on M8. Worked quite well, even when I hid the remote falsh behind object. The conclusion, and relevence to this thread, \"the SF-58 does not work with the classic Metz Remote system\", they look very similar (on the flash LCD's), act similar but are not compatible. I was thinking about buying a SF58 along these lines. It seems for this firmware at least, you need to use all SF-58 or all Metz if you want to try using the cordless infrared seutps, no mixing at this point of time. Some other conclusions I came to - to expensive for me to go the route of two SF58's. - the Metz remote material says that it was designed to sync the remote flashes at 1/60. I could consistently fire with M8 at 1/125 and 1/180. It also worked at 1/250, though did not try this enough to say it consistently works. - boy is the terminology in the industry, and with Metz & Leica confusing when it comes to flash, especially the way TTL, cordless, wireless, and automatic is used. It is sometime referred to in a context of a concept, other times like a protocol. -Would be nice if \"Metz\" created itself a niche and made their new flashes \"pocket wizzard\" enabled. -Wish the 76MZ series had a simple bracket / socket to mount on a tripo or lighting stand.", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/2/?tab=comments#comment-1066647", "origin": "L-forum", "suborigin": "99414-reidreview-review-of-leica-sf58-flash-unit", "result": true, "Selector": "i could not make", "selectorShort": "make", "MarkedSent": "maybe because of the pre-flash. can you make several metz working together in gnc mode with an m8? lucien lucien, the metz remote \"cordless\" mode does not work with the pre-flash. -----> i !!!  -----> could !!!  -----> not !!!  -----> make !!!  the metz flashes work together in gnc mode. sorry, my message was not so clear, put together on an iphone. the way i got the metz flashes to work together was by having a \"master\" metz flash mounted on the m8, in master / a mode, and the remote flashes in \"slave\" / ttl mode using the 3083 on the 54mz4 or 40 mz2 or the 70mz standalone (it has built in functionality). in a nutshell the m8 and master interacted with each other in a classic \"a\" mode, while the remote flashes interacting with the master in the m8 in a cordless ttl mode (infrared pulses), cutting their output when signaled by the master on m8. worked quite well, even when i hid the remote falsh behind object. the conclusion, and relevence to this thread, \"the sf-58 does not work with the classic metz remote system\", they look very similar (on the flash lcd's), act similar but are not compatible. i was thinking about buying a sf58 along these lines. it seems for this firmware at least, you need to use all sf-58 or all metz if you want to try using the cordless infrared seutps, no mixing at this point of time. some other conclusions i came to - to expensive for me to go the route of two sf58's. - the metz remote material says that it was designed to sync the remote flashes at 1/60. i could consistently fire with m8 at 1/125 and 1/180. it also worked at 1/250, though did not try this enough to say it consistently works. - boy is the terminology in the industry, and with metz & leica confusing when it comes to flash, especially the way ttl, cordless, wireless, and automatic is used. it is sometime referred to in a context of a concept, other times like a protocol. -would be nice if \"metz\" created itself a niche and made their new flashes \"pocket wizzard\" enabled. -wish the 76mz series had a simple bracket / socket to mount on a tripo or lighting stand.", "sortedWord": "None", "Identifyer": null, "identifyer": 37675, "year": "2009"}, {"autor": "Jeff S", "date": "2009-08-12 18:54:00", "content": "I must be one of the few here that rarely prints - I've printed maybe ten photos out of the hundreds that I've taken. I regularly look at the photos on screen.... maybe I should print and frame a few. This prompts me to add a bit to my earlier post. While I consider the print the ultimate result for me, I'm very selective about what I print. My LR catalog is full of \"close but no cigar\" images. This is no different than in my darkroom days, but the digital process is so much easier for me to get to the final \"proof\" stage. Further, once I print, that doesn't translate necessarily into framing. I like to \"live\" with a print for awhile to see if it still resonates over time. And, to determine if I need to edit in any way. For this purpose, I choose a few prints at a time to tack on a wall board, or place on a shelf, over some period...generally weeks or more. Only after some deliberation do I determine if a print is \"frame worthy,\" usually not for my wall, but for a gift to a friend or family member for whom the print also resonates. Many if not most don't pass my test. I made prints for family members and friends over 20 years ago, still hanging somewhere in their (sometimes different) house. And, they remember the gift far longer than anything I might have bought. Jeff PS My new ambition is to create something in book form, but that's a whole different thing, requiring lots of thought around a coherent project.", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/page/2/?tab=comments#comment-992080", "origin": "L-forum", "suborigin": "93255-do-you-print-your-photographs", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i must be one of the few here that rarely prints - i've printed maybe ten photos out of the hundreds that i've taken. i regularly look at the photos on screen.... maybe i should print and frame a few. this prompts me to add a bit to my earlier post. while i consider the print the ultimate result for me, i'm very selective about what i print. my lr catalog is full of \"close but no cigar\" images. this is no different than in my darkroom days, but the digital process is so much easier for me to get to the final \"proof\" stage. further, once i print, that doesn't translate necessarily into framing. i like to \"live\" with a print for awhile to see if it still resonates over time. and, to determine if i need to edit in any way. for this purpose, i choose a few prints at a time to tack on a wall board, or place on a shelf, over some period...generally weeks or more. only after some deliberation do i determine if a print is \"frame worthy,\" usually not for my wall, but for a gift to a friend or family member for whom the print also resonates. many if not most don't pass my test. -----> i !!!  -----> made !!!  prints for family members and friends over 20 years ago, still hanging somewhere in their (sometimes different) house. and, they remember the gift far longer than anything i might have bought. jeff ps my new ambition is to create something in book form, but that's a whole different thing, requiring lots of thought around a coherent project.", "sortedWord": "None", "Identifyer": null, "identifyer": 40726, "year": "2009"}, {"autor": "Mark Pope", "date": "2009-08-12 19:56:00", "content": "Our printer gets quite a lot of use with two of us printing work. I do love to print, but one thing that I admit to being VERY bad at is doing anything with the work once it is printed. When I go to the local camera club, I'll make A3 prints and since we've had the 3800, we've made 1 A2 print, which I have to say looks bloomin' wonderful now that it has been professionally framed and mounted. I tend not to be too adventurous with papers - when I find something I like, I tend to stick with it. Current favourites are Permajet oyster 271 and their fibre-based glossy paper, which is very nice indeed. I must be more adventurous with papers! Cheers Mark", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/page/2/?tab=comments#comment-992147", "origin": "L-forum", "suborigin": "93255-do-you-print-your-photographs", "result": true, "Selector": "i'll make", "selectorShort": "make", "MarkedSent": "our printer gets quite a lot of use with two of us printing work. i do love to print, but one thing that i admit to being very bad at is doing anything with the work once it is printed. when -----> i !!!  go to the local camera club, -----> i !!! -----> 'll !!!  -----> make !!!  a3 prints and since we've had the 3800, we've made 1 a2 print, which -----> i !!!  have to say looks bloomin' wonderful now that it has been professionally framed and mounted. i tend not to be too adventurous with papers - when i find something i like, i tend to stick with it. current favourites are permajet oyster 271 and their fibre-based glossy paper, which is very nice indeed. i must be more adventurous with papers! cheers mark", "sortedWord": "None", "Identifyer": null, "identifyer": 40730, "year": "2009"}, {"autor": "trs", "date": "2009-12-08 21:40:00", "content": "I don't print a lot, but purpose of every frame I shoot is someday I want to print it. Thus, I am just happy having the shots I like it OK or better and storing them aside even before processing. I usually comeback in year or so and process few and print because I seem to like the pictures more after time has passed. I have not printed beyond 12x18. But, I really want to try some bigger prints. For vacation shots, I usually make a book (blurb book) whenever I get an excuse.", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/page/3/?tab=comments#comment-1144418", "origin": "L-forum", "suborigin": "93255-do-you-print-your-photographs", "result": true, "Selector": "i usually make", "selectorShort": "make", "MarkedSent": "i don't print a lot, but purpose of every frame i shoot is someday i want to print it. thus, i am just happy having the shots i like it ok or better and storing them aside even before processing. i usually comeback in year or so and process few and print because i seem to like the pictures more after time has passed. i have not printed beyond 12x18. but, i really want to try some bigger prints. for vacation shots, -----> i !!!  -----> usually !!!  -----> make !!!  a book (blurb book) whenever -----> i !!!  get an excuse.", "sortedWord": "None", "Identifyer": null, "identifyer": 40750, "year": "2009"}, {"autor": "wstotler", "date": "2009-12-09 15:44:00", "content": "I don't print a lot, but purpose of every frame I shoot is someday I want to print it. <snip> I usually comeback in year or so and process few and print because I seem to like the pictures more after time has passed. +1. Interesting thread. Three years ago I started with on-screen work only--slideshows and shooting for the Web (Flickr and work) primarily. Cropped much of the time. Heavy post-production exposure/contrast fixing. Printed the occasional 4x6 locally. No desire for printing anything larger. I could shoot sloppily and get away with it. --img--  Thanks to advice from the forum (and a lot of shooting to improve) I reduced my post work for exposure-related mistakes significantly. And printed more 4x6s and 5x7s. Late last year I made it a point to stop relying on post-production cropping and paying a lot more attention to framing \"in camera.\" I worked to get good at that. Because to have the capability to print credible enlargements you need every pixel. Then, I had an art critique earlier in the year and had to bump out a whole set of 8x12s. I found that many of the things I'd been getting away with I just couldn't get away with. <sigh> But when I \"nailed\" it, they looked incredible. I've made several additional sets of 8x12s, since. And I've worked to nail it more often and pay even closer attention to the shooting process. Eliminating the crop slop, reducing reliance on post work (to tweaks and adjustments, not \"saves\"), learning from the 8x12s, and then working to get better shots technically has opened up the possibility for good 16x20s on a regular basis, and enough confidence to have 20x30s made. (I now have a workflow at a local shop ironed out so the large sized stuff comes back clean.) Big prints for many here are a validation of their work--or just a continuation of a photographic work process they already know. Big prints for me have been a learning tool, forcing more care and diligence during shooting. I'm still learning, but I will say that when I shoot I want to get *at least* a very credible 16x20 out every shot I take now. I want that capability in case somebody sees something they like and wants it \"printed big.\" I'm running sets of larger prints roughly bimonthly at the moment. Thanks, Will Edited December 9, 2009 by wstotler", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/page/3/?tab=comments#comment-1145127", "origin": "L-forum", "suborigin": "93255-do-you-print-your-photographs", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i don't print a lot, but purpose of every frame i shoot is someday i want to print it. <snip> i usually comeback in year or so and process few and print because i seem to like the pictures more after time has passed. +1. interesting thread. three years ago i started with on-screen work only--slideshows and shooting for the web (flickr and work) primarily. cropped much of the time. heavy post-production exposure/contrast fixing. printed the occasional 4x6 locally. no desire for printing anything larger. i could shoot sloppily and get away with it. --img--  thanks to advice from the forum (and a lot of shooting to improve) i reduced my post work for exposure-related mistakes significantly. and printed more 4x6s and 5x7s. late last year -----> i !!!  -----> made !!!  it a point to stop relying on post-production cropping and paying a lot more attention to framing \"in camera.\" i worked to get good at that. because to have the capability to print credible enlargements you need every pixel. then, i had an art critique earlier in the year and had to bump out a whole set of 8x12s. i found that many of the things i'd been getting away with i just couldn't get away with. <sigh> but when i \"nailed\" it, they looked incredible. i've made several additional sets of 8x12s, since. and i've worked to nail it more often and pay even closer attention to the shooting process. eliminating the crop slop, reducing reliance on post work (to tweaks and adjustments, not \"saves\"), learning from the 8x12s, and then working to get better shots technically has opened up the possibility for good 16x20s on a regular basis, and enough confidence to have 20x30s made. (i now have a workflow at a local shop ironed out so the large sized stuff comes back clean.) big prints for many here are a validation of their work--or just a continuation of a photographic work process they already know. big prints for me have been a learning tool, forcing more care and diligence during shooting. i'm still learning, but i will say that when i shoot i want to get *at least* a very credible 16x20 out every shot i take now. i want that capability in case somebody sees something they like and wants it \"printed big.\" i'm running sets of larger prints roughly bimonthly at the moment. thanks, will edited december 9, 2009 by wstotler", "sortedWord": "None", "Identifyer": null, "identifyer": 40753, "year": "2009"}, {"autor": "pezti", "date": "2009-08-07 11:08:00", "content": "Nice. I just bought my M8 used a couple of weeks ago. The previous owner bought it from the local Icelandic dealer in July 2008 so it is just over a year old. I looked for the unique Id and found it has only had 3461 actuation's. That includes the probably around 500 I've made since getting it --img--  I guess the previous owner didn't use it all that much.", "link": "https://www.l-camera-forum.com/topic/34953-determining-shutter-actuations-on-an-m8/page/2/?tab=comments#comment-986115", "origin": "L-forum", "suborigin": "34953-determining-shutter-actuations-on-an-m8", "result": true, "Selector": "i've made", "selectorShort": "make", "MarkedSent": "nice. i just bought my m8 used a couple of weeks ago. the previous owner bought it from the local icelandic dealer in july 2008 so it is just over a year old. i looked for the unique id and found it has only had 3461 actuation's. that includes the probably around 500 -----> i !!! 've -----> made !!!  since getting it --img--  i guess the previous owner didn't use it all that much.", "sortedWord": "None", "Identifyer": null, "identifyer": 41843, "year": "2009"}, {"autor": "coup de foudre", "date": "2009-10-26 18:01:00", "content": "ArtZ -- jeromeaparis is right. the key that came with SansDisk is no longer valid. all licenses, though, are for two machines -- i double-checked before i purchased as i wanted to make sure i could travel with it. you will want to contact them, regardless, as i believe an upgrade is due within a month. you should check with them and ask that you get it free since you've done this so close to the new release, rather than using up your one free upgrade.", "link": "https://www.l-camera-forum.com/topic/94274-m8-free-captureone-le-3x-license/?tab=comments#comment-1090665", "origin": "L-forum", "suborigin": "94274-m8-free-captureone-le-3x-license", "result": true, "Selector": "i wanted to make", "selectorShort": "make", "MarkedSent": "artz -- jeromeaparis is right. the key that came with sansdisk is no longer valid. all licenses, though, are for two machines -- -----> i !!!  double-checked before -----> i !!!  purchased as -----> i !!!  -----> wanted !!!  -----> to !!!  -----> make !!!  sure -----> i !!!  could travel with it. you will want to contact them, regardless, as i believe an upgrade is due within a month. you should check with them and ask that you get it free since you've done this so close to the new release, rather than using up your one free upgrade.", "sortedWord": "None", "Identifyer": null, "identifyer": 42012, "year": "2009"}, {"autor": "ArtZ", "date": "2009-10-26 21:51:00", "content": "ArtZ -- jeromeaparis is right. the key that came with SansDisk is no longer valid. all licenses, though, are for two machines -- i double-checked before i purchased as i wanted to make sure i could travel with it. you will want to contact them, regardless, as i believe an upgrade is due within a month. you should check with them and ask that you get it free since you've done this so close to the new release, rather than using up your one free upgrade. Ouais! --img--  Yes, I know. I found that out too. I'm just using the license of my first M8. I keep the second license (from my second M8) just in case. Thank you for your feed back. Merci.", "link": "https://www.l-camera-forum.com/topic/94274-m8-free-captureone-le-3x-license/?tab=comments#comment-1091043", "origin": "L-forum", "suborigin": "94274-m8-free-captureone-le-3x-license", "result": true, "Selector": "i wanted to make", "selectorShort": "make", "MarkedSent": "artz -- jeromeaparis is right. the key that came with sansdisk is no longer valid. all licenses, though, are for two machines -- -----> i !!!  double-checked before -----> i !!!  purchased as -----> i !!!  -----> wanted !!!  -----> to !!!  -----> make !!!  sure -----> i !!!  could travel with it. you will want to contact them, regardless, as i believe an upgrade is due within a month. you should check with them and ask that you get it free since you've done this so close to the new release, rather than using up your one free upgrade. ouais! --img--  yes, i know. i found that out too. i'm just using the license of my first m8. i keep the second license (from my second m8) just in case. thank you for your feed back. merci.", "sortedWord": "None", "Identifyer": null, "identifyer": 42013, "year": "2009"}, {"autor": "imported_peter_m", "date": "2009-03-12 04:14:00", "content": "Nice indeed! What is that bag? Thank you, I made the bag --img--  Peter", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/9/?tab=comments#comment-837704", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "nice indeed! what is that bag? thank you, -----> i !!!  -----> made !!!  the bag --img--  peter", "sortedWord": "None", "Identifyer": null, "identifyer": 48862, "year": "2009"}, {"autor": "azzo", "date": "2009-03-12 06:07:00", "content": "Thank you, I made the bag --img--  Peter Looks tough and very well made. Lovely result IMHO. - - - --img-- ", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/9/?tab=comments#comment-837757", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "thank you, -----> i !!!  -----> made !!!  the bag --img--  peter looks tough and very well made. lovely result imho. - - - --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 48863, "year": "2009"}, {"autor": "summarod", "date": "2009-02-23 22:27:00", "content": "Hi everyone! I never made it to own an MP3! I only have an MP \"classic\" (MP without the lighmeter) I can very clearly recall the 40th anniversary \"M3\", a kind of direct predecessor, since I entered an antique shop for modernist 20th century furniture in Zurich at its time and there it sat, right on the owner`s desk, a bit puzzled I asked about it, because it already looked having been actually \"USED\" in its very short lifespan. The answer was quite \"frank\"! (pun not intended , but here it is --img--  Hey we are talking \"Swiss\") \"I just use it,- I don`t care about collecting!\" or words to that respect. Quite remarkable at a time when it was listed at about 9000 Swissfrancs (????, please correct me , if I`m wrong!) I felt rather foolish about asking, I must say! But this guy was cool! Leica M6J Best regards Wolfhard", "link": "https://www.l-camera-forum.com/topic/77586-i-love-my-mp3/?tab=comments#comment-818604", "origin": "L-forum", "suborigin": "77586-i-love-my-mp3", "result": true, "Selector": "i never made", "selectorShort": "make", "MarkedSent": "hi everyone! -----> i !!!  -----> never !!!  -----> made !!!  it to own an mp3! i only have an mp \"classic\" (mp without the lighmeter) i can very clearly recall the 40th anniversary \"m3\", a kind of direct predecessor, since i entered an antique shop for modernist 20th century furniture in zurich at its time and there it sat, right on the owner`s desk, a bit puzzled i asked about it, because it already looked having been actually \"used\" in its very short lifespan. the answer was quite \"frank\"! (pun not intended , but here it is --img--  hey we are talking \"swiss\") \"i just use it,- i don`t care about collecting!\" or words to that respect. quite remarkable at a time when it was listed at about 9000 swissfrancs (????, please correct me , if i`m wrong!) i felt rather foolish about asking, i must say! but this guy was cool! leica m6j best regards wolfhard", "sortedWord": "None", "Identifyer": null, "identifyer": 2372, "year": "2009"}, {"autor": "peter_n", "date": "2009-03-18 01:02:00", "content": "...Out of interest does anyone know if Leica made a chrome pre-ASPH 'lux 50 with the scalloped barrel like the black paint one that went with the M6 Millennium?...I don't think thay did. I bought one of the BP ones last week and it seems to be a very nice lens. I currently use a v.2 which I love but I fancy the closest focus of 0.7M and the shorter throw. I'll have to make a choice between them, it makes no sense to have three Summilux's. Personally I like the look of the v.1 but you presumably think it's a bit soft. Mike Dixon on photo.net has created some fantastic work with an old v.1. Nice pic of your new MP3 BTW! --img-- ", "link": "https://www.l-camera-forum.com/topic/77586-i-love-my-mp3/page/2/?tab=comments#comment-844466", "origin": "L-forum", "suborigin": "77586-i-love-my-mp3", "result": true, "Selector": "i'll have to make", "selectorShort": "make", "MarkedSent": "...out of interest does anyone know if leica made a chrome pre-asph 'lux 50 with the scalloped barrel like the black paint one that went with the m6 millennium?...i don't think thay did. i bought one of the bp ones last week and it seems to be a very nice lens. i currently use a v.2 which i love but i fancy the closest focus of 0.7m and the shorter throw. -----> i !!! -----> 'll !!!  -----> have !!!  -----> to !!!  -----> make !!!  a choice between them, it makes no sense -----> to !!!  -----> have !!!  three summilux's. personally i like the look of the v.1 but you presumably think it's a bit soft. mike dixon on photo.net has created some fantastic work with an old v.1. nice pic of your new mp3 btw! --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 2394, "year": "2009"}, {"autor": "Leitzmac", "date": "2009-03-18 02:26:00", "content": "I don't think thay did. I bought one of the BP ones last week and it seems to be a very nice lens. I currently use a v.2 which I love but I fancy the closest focus of 0.7M and the shorter throw. I'll have to make a choice between them, it makes no sense to have three Summilux's. Personally I like the look of the v.1 but you presumably think it's a bit soft. Mike Dixon on photo.net has created some fantastic work with an old v.1. Nice pic of your new MP3 BTW! --img--  Hi Peter, Thanks for your reply, I have a standard black Summilux from the latter part of the 90s (I think - would have to check the serial No. to confirm) and I liked it a lot. Having said that, I then got a Noctilux that ended up 'fixed' to my .85 M6 (mostly shooting it wide open on Delta 3200) and I never use the Summilux now. I do like the gain in manual focussing speed that you get on the 'lux over the noct though and think a chrome one would be ideal for the MP-3. Of course what this goes to show is that I don't mind a little softness (the noct wide open is hardly what you'd call sharp --img--  , so maybe a chrome v.1 lux might be the call. Thanks for referring me to Mike Dixon's gallery, there's some lovely work in there, although some of the (negative) discussion surrounding the picture of the grizzled man at the bar seems unwarranted. To my mind \"if it ain't broke, don't fix it!\" All the best, Al P.S. Thanks for the compliment on the MP-3 pic - they are such striking bodies that they immediately tick off the first box with regards to necessary elements in a photograph: interesting or aesthetic subject matter!", "link": "https://www.l-camera-forum.com/topic/77586-i-love-my-mp3/page/2/?tab=comments#comment-844485", "origin": "L-forum", "suborigin": "77586-i-love-my-mp3", "result": true, "Selector": "i'll have to make", "selectorShort": "make", "MarkedSent": "i don't think thay did. i bought one of the bp ones last week and it seems to be a very nice lens. i currently use a v.2 which i love but i fancy the closest focus of 0.7m and the shorter throw. -----> i !!! -----> 'll !!!  -----> have !!!  -----> to !!!  -----> make !!!  a choice between them, it makes no sense -----> to !!!  -----> have !!!  three summilux's. personally i like the look of the v.1 but you presumably think it's a bit soft. mike dixon on photo.net has created some fantastic work with an old v.1. nice pic of your new mp3 btw! --img--  hi peter, thanks for your reply, i have a standard black summilux from the latter part of the 90s (i think - would have to check the serial no. to confirm) and i liked it a lot. having said that, i then got a noctilux that ended up 'fixed' to my .85 m6 (mostly shooting it wide open on delta 3200) and i never use the summilux now. i do like the gain in manual focussing speed that you get on the 'lux over the noct though and think a chrome one would be ideal for the mp-3. of course what this goes to show is that i don't mind a little softness (the noct wide open is hardly what you'd call sharp --img--  , so maybe a chrome v.1 lux might be the call. thanks for referring me to mike dixon's gallery, there's some lovely work in there, although some of the (negative) discussion surrounding the picture of the grizzled man at the bar seems unwarranted. to my mind \"if it ain't broke, don't fix it!\" all the best, al p.s. thanks for the compliment on the mp-3 pic - they are such striking bodies that they immediately tick off the first box with regards to necessary elements in a photograph: interesting or aesthetic subject matter!", "sortedWord": "None", "Identifyer": null, "identifyer": 2395, "year": "2009"}, {"autor": "andrewsolomon", "date": "2009-04-29 03:06:00", "content": "I also have a 5D which I like a great deal and use for serious fine art shooting. I also have a D7 which is a fun camera to have for carrying in my pocket. The D2; however, remains my favorite! For its focal length, it is fine for much shooting-like the M Series. I learned on the M3 and went forward from that. The outstanding benefits of the D2 are: 1. The Digital Viewfinder! What a gift! When I was shooting in Death Valley, I could not see the taken image on my 5d because of the ambient light. I now use a Hoodman to take care of the problem; but the the D2; it was no problem. It was wonderful! I made a 12-foot pamorama of the sand dunes which is a killer: tack sharp, wonderful tones. It is also ideal fopr those of us who are visuall challenged and have to wear glasses. Adjust the diopter and you are ready to go and shoot with ease! 2. The grid option in the viewfinder makes keeping verticals accurate and panoramas [for post-work in Photoshop] easy to do properely. 3. Bounce Flash. What an easy way to capture a moment of compromised light and have the results come out looking natural and with ease! 4. The fine-focus option to use when using manual focus. I use this a lot of the time when I want to be certain the focus is spot on...and it works every time. I have made tack-sharp 20x24 prints with no compromise. The only drawback is the shutter lag. When I was shooting professional tennis and tried the D2, only by knowing the game well and anticipating the next move was I able to get a shot with the \"motor\" drive. I tried for some time to send my successful sports images from the Houston Astros baseball and the Mens National Clay Court Tennis Championships to Roger Horn of Leica USA to show him that despite the comment made to me by a Leica representative that \"Leica is not for sports\" that with care the D2 could do very credible work-work wich I subsequently had published, I might add but there was little positive response. This was a shame because the D2 can do a great deal of things very well. So yes, I think the D2 is a wonderful camera to have even with its few limitations and I would recommend it to anyone who wants a good, general camera. BTW It can use the Canon Speedlight in its hot shoe for a greater range of flash coverage as well! Andy Solomon Houston, Tx --img-- --img--  Edited April 29, 2009 by andrewsolomon Add an image", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/16/?tab=comments#comment-884480", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i also have a 5d which i like a great deal and use for serious fine art shooting. i also have a d7 which is a fun camera to have for carrying in my pocket. the d2; however, remains my favorite! for its focal length, it is fine for much shooting-like the m series. i learned on the m3 and went forward from that. the outstanding benefits of the d2 are: 1. the digital viewfinder! what a gift! when i was shooting in death valley, i could not see the taken image on my 5d because of the ambient light. i now use a hoodman to take care of the problem; but the the d2; it was no problem. it was wonderful! -----> i !!!  -----> made !!!  a 12-foot pamorama of the sand dunes which is a killer: tack sharp, wonderful tones. it is also ideal fopr those of us who are visuall challenged and have to wear glasses. adjust the diopter and you are ready to go and shoot with ease! 2. the grid option in the viewfinder makes keeping verticals accurate and panoramas [for post-work in photoshop] easy to do properely. 3. bounce flash. what an easy way to capture a moment of compromised light and have the results come out looking natural and with ease! 4. the fine-focus option to use when using manual focus. i use this a lot of the time when i want to be certain the focus is spot on...and it works every time. i have made tack-sharp 20x24 prints with no compromise. the only drawback is the shutter lag. when i was shooting professional tennis and tried the d2, only by knowing the game well and anticipating the next move was i able to get a shot with the \"motor\" drive. i tried for some time to send my successful sports images from the houston astros baseball and the mens national clay court tennis championships to roger horn of leica usa to show him that despite the comment made to me by a leica representative that \"leica is not for sports\" that with care the d2 could do very credible work-work wich i subsequently had published, i might add but there was little positive response. this was a shame because the d2 can do a great deal of things very well. so yes, i think the d2 is a wonderful camera to have even with its few limitations and i would recommend it to anyone who wants a good, general camera. btw it can use the canon speedlight in its hot shoe for a greater range of flash coverage as well! andy solomon houston, tx --img-- --img--  edited april 29, 2009 by andrewsolomon add an image", "sortedWord": "None", "Identifyer": null, "identifyer": 15537, "year": "2009"}, {"autor": "John Thawley", "date": "2009-04-29 13:56:00", "content": "I wonder if Leica ignores all the accolades for this camera because it has a tendency to challenge their flagship models at such a modest price. Could the Digilux 2 be a genuine \"Cinderella story\" in the Leica family? And oh, I'm still making this modification/upgrade available for a limited time only. --img-- ", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/16/?tab=comments#comment-884863", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i'm still making", "selectorShort": "make", "MarkedSent": "i wonder if leica ignores all the accolades for this camera because it has a tendency to challenge their flagship models at such a modest price. could the digilux 2 be a genuine \"cinderella story\" in the leica family? and oh, -----> i !!! 'm -----> still !!!  -----> making !!!  this modification/upgrade available for a limited time only. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 15541, "year": "2009"}, {"autor": "koray", "date": "2009-04-30 08:44:00", "content": "I wonder if Leica ignores all the accolades for this camera because it has a tendency to challenge their flagship models at such a modest price. Could the Digilux 2 be a genuine \"Cinderella story\" in the Leica family? And oh, I'm still making this modification/upgrade available for a limited time only. ESPRESSO! Now that's what I call an all-in-one. :-) K. PS: Here is my 'LC1 distinctive look', B/W via Lightroom+NIK Silverefex: --img--  Edited April 30, 2009 by koray Added a photo.", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/16/?tab=comments#comment-885548", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i'm still making", "selectorShort": "make", "MarkedSent": "i wonder if leica ignores all the accolades for this camera because it has a tendency to challenge their flagship models at such a modest price. could the digilux 2 be a genuine \"cinderella story\" in the leica family? and oh, -----> i !!! 'm -----> still !!!  -----> making !!!  this modification/upgrade available for a limited time only. espresso! now that's what i call an all-in-one. :-) k. ps: here is my 'lc1 distinctive look', b/w via lightroom+nik silverefex: --img--  edited april 30, 2009 by koray added a photo.", "sortedWord": "None", "Identifyer": null, "identifyer": 15543, "year": "2009"}, {"autor": "SteveYork", "date": "2009-05-29 18:34:00", "content": "I made a huge mistake getting a Leicaflex SL Mot that had a new prism installed a few years ago. Now the R6.2 I got for my upcoming 'birds and bees' trip this fall just seems so blah. If the Leicaflex was a chick, I would be madly in love. I know that's a sexist statement, so I'll take myself behind the wood shed and spank myself. But the viewfinder on those Leicaflex SL and SL2, if you can find one in good shape, are as good as advertised.", "link": "https://www.l-camera-forum.com/topic/45395-lets-see-your-r/page/9/?tab=comments#comment-915225", "origin": "L-forum", "suborigin": "45395-lets-see-your-r", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> made !!!  a huge mistake getting a leicaflex sl mot that had a new prism installed a few years ago. now the r6.2 i got for my upcoming 'birds and bees' trip this fall just seems so blah. if the leicaflex was a chick, i would be madly in love. i know that's a sexist statement, so i'll take myself behind the wood shed and spank myself. but the viewfinder on those leicaflex sl and sl2, if you can find one in good shape, are as good as advertised.", "sortedWord": "None", "Identifyer": null, "identifyer": 22966, "year": "2009"}, {"autor": "spydrxx", "date": "2009-04-29 03:54:00", "content": "I won't tell you one is better than the other. I've owned both, and eventually sold the SL, keeping the SL2. Both were great cameras but I found the SL2 more ergonomically comfortable and, as others indicated, the meter is more sensitive. Here's a link you might find interesting, particularly the chart on which lenses (by cam configuration) can work on which Leica reflex cameras (http://www.photoethnography.com); however there are some lenses which present other issues. I got my SL2 CLA'd right after I got it, the SL I purchased had been CLA'd right before I bought it. Given their ages, I think the CLAs were a good idea. I also own an R8, and find that I typically use the SL2 much more often than the R8, even though the R8 is a much more sophisticated camera. My only disappointment, using either the SL or SL2, was that there wasn't a grip as many more modern designs have, and given the weight of many of the R lenses, I wanted a grip, so finally I made one out of an L bracket which attaches in conjunction with an Arca-Swiss type tripod bracket and a piece of leather surrounding my hand. WOW, what a difference. I'd show a picture of it, but, alas, mine is in the shop with DAG for some adjustments right now. IMHO you can't go wrong with either the SL or SL2 if you like manual cameras.", "link": "https://www.l-camera-forum.com/topic/83227-leicaflex-sl-vs-sl2/?tab=comments#comment-884495", "origin": "L-forum", "suborigin": "83227-leicaflex-sl-vs-sl2", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i won't tell you one is better than the other. i've owned both, and eventually sold the sl, keeping the sl2. both were great cameras but i found the sl2 more ergonomically comfortable and, as others indicated, the meter is more sensitive. here's a link you might find interesting, particularly the chart on which lenses (by cam configuration) can work on which leica reflex cameras (http://www.photoethnography.com); however there are some lenses which present other issues. i got my sl2 cla'd right after i got it, the sl i purchased had been cla'd right before i bought it. given their ages, i think the clas were a good idea. i also own an r8, and find that i typically use the sl2 much more often than the r8, even though the r8 is a much more sophisticated camera. my only disappointment, using either the sl or sl2, was that there wasn't a grip as many more modern designs have, and given the weight of many of the r lenses, -----> i !!!  wanted a grip, so finally -----> i !!!  -----> made !!!  one out of an l bracket which attaches in conjunction with an arca-swiss type tripod bracket and a piece of leather surrounding my hand. wow, what a difference. i'd show a picture of it, but, alas, mine is in the shop with dag for some adjustments right now. imho you can't go wrong with either the sl or sl2 if you like manual cameras.", "sortedWord": "None", "Identifyer": null, "identifyer": 36339, "year": "2009"}, {"autor": "iShutterbug", "date": "2009-09-20 11:23:00", "content": "I agree with Batmobile. I got caught up in the \"bokeh king\" thing and bought one and was disappointed with it. I had gotten used to buying things on the basis of reviews--like computers and software and other things--but a lens--or photography as art--something as subjective as that--I think someone has to experience it for themselves. Not to cross-post but here's a similar comment I made elsewhere. http://www.l-camera-forum.com/leica-forum/film-forum/97982-m6-lens-2.html#post1043964 Edited September 20, 2009 by iShutterbug", "link": "https://www.l-camera-forum.com/topic/97066-legendary-leica-lenses-old-vs-new/?tab=comments#comment-1042976", "origin": "L-forum", "suborigin": "97066-legendary-leica-lenses-old-vs-new", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i agree with batmobile. i got caught up in the \"bokeh king\" thing and bought one and was disappointed with it. i had gotten used to buying things on the basis of reviews--like computers and software and other things--but a lens--or photography as art--something as subjective as that--i think someone has to experience it for themselves. not to cross-post but here's a similar comment -----> i !!!  -----> made !!!  elsewhere. http://www.l-camera-forum.com/leica-forum/film-forum/97982-m6-lens-2.html#post1043964 edited september 20, 2009 by ishutterbug", "sortedWord": "None", "Identifyer": null, "identifyer": 37547, "year": "2009"}, {"autor": "luigi bertolotti", "date": "2009-08-30 20:24:00", "content": "I think, it wouldn't be fair to exspect this 50 years old lens on the same level as the current 35mm Summarit, let alone the Summicron-asph. For it's time it was a very good lens, sharp and contrasty though giving a warm image at the same time. It is small and very smooth to handle, perhaps the alloy appearance doesn't have the classical brassy look as the Summicrons from the same time. It is the ideal companion for the M2: [ATTACH]159501[/ATTACH] Yes, the alloy mount is an important factor... it made it much lighter than the previous 3,5 - 135g vs. 195g (ungoggled versions) - and this makes it appear a someway \"cheap\" construction, which makes me prefer (as a collectible) the old 3,5... the \"solid\" appearance of old brass items has a distinctive fascination (21 f4 is the masterpiece in this sense). But in optical terms it's a very good lens, definitely better than the 3,5 ; I agree with Andy : as value for money, can be the best 35 made by old Leitz : I made some simply tests at 4-5,6-8 vs. the first Summicron (the 8-elements) and Summaron shows a better contrast. Edited August 30, 2009 by luigi bertolotti", "link": "https://www.l-camera-forum.com/topic/94959-summaron-35mm-f28-m-lens/?tab=comments#comment-1010892", "origin": "L-forum", "suborigin": "94959-summaron-35mm-f28-m-lens", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i think, it wouldn't be fair to exspect this 50 years old lens on the same level as the current 35mm summarit, let alone the summicron-asph. for it's time it was a very good lens, sharp and contrasty though giving a warm image at the same time. it is small and very smooth to handle, perhaps the alloy appearance doesn't have the classical brassy look as the summicrons from the same time. it is the ideal companion for the m2: [attach]159501[/attach] yes, the alloy mount is an important factor... it made it much lighter than the previous 3,5 - 135g vs. 195g (ungoggled versions) - and this makes it appear a someway \"cheap\" construction, which makes me prefer (as a collectible) the old 3,5... the \"solid\" appearance of old brass items has a distinctive fascination (21 f4 is the masterpiece in this sense). but in optical terms it's a very good lens, definitely better than the 3,5 ; -----> i !!!  agree with andy : as value for money, can be the best 35 -----> made !!!  by old leitz : -----> i !!!  -----> made !!!  some simply tests at 4-5,6-8 vs. the first summicron (the 8-elements) and summaron shows a better contrast. edited august 30, 2009 by luigi bertolotti", "sortedWord": "None", "Identifyer": null, "identifyer": 40459, "year": "2009"}, {"autor": "carlosecpf", "date": "2009-09-20 21:37:00", "content": "I've heard that Leica filters are made by Heliopan. Lumix filters would be made by Panasonic which, if it can make the D2's lens with the quality it has, can certainly make filetrs that are as good. I understand that Leica designed the D2 lens, but design of a filter would not be as involved. Thanks for the info! I made some tests with the Lumix 72mm Circular polarizer and my D2 and everything is fine! I was doing some research and apparently the circular polarizer is recommended for DSLRs and Linear polarizers for cameras without a mirror, like the D2. Does anyone know if this is true?", "link": "https://www.l-camera-forum.com/topic/60135-digilux-2-69mm-filter-do-you-have-a-filter-on-your-d2/page/2/?tab=comments#comment-1043746", "origin": "L-forum", "suborigin": "60135-digilux-2-69mm-filter-do-you-have-a-filter-on-your-d2", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i've heard that leica filters are made by heliopan. lumix filters would be made by panasonic which, if it can make the d2's lens with the quality it has, can certainly make filetrs that are as good. i understand that leica designed the d2 lens, but design of a filter would not be as involved. thanks for the info! -----> i !!!  -----> made !!!  some tests with the lumix 72mm circular polarizer and my d2 and everything is fine! i was doing some research and apparently the circular polarizer is recommended for dslrs and linear polarizers for cameras without a mirror, like the d2. does anyone know if this is true?", "sortedWord": "None", "Identifyer": null, "identifyer": 93805, "year": "2009"}, {"autor": "Marquinius", "date": "2009-09-27 11:15:00", "content": "I'll give this thread some more time and convert the added names to the \"master list\" I made earlier. Still got it in excel, so no hassle.", "link": "https://www.l-camera-forum.com/topic/96948-inspirational-photographers-bw/page/3/?tab=comments#comment-1051699", "origin": "L-forum", "suborigin": "96948-inspirational-photographers-bw", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "-----> i !!! 'll give this thread some more time and convert the added names to the \"master list\" -----> i !!!  -----> made !!!  earlier. still got it in excel, so no hassle.", "sortedWord": "None", "Identifyer": null, "identifyer": 96931, "year": "2009"}, {"autor": "Guest stnami", "date": "2009-12-26 11:55:00", "content": "I hadn't seen Paolo's work for years forgot about him altogether........ he's a story teller like .:: Jindřich Štreit ::. Letizia Battaglia is the real thing Portraying the mafia - we make money not art", "link": "https://www.l-camera-forum.com/topic/96948-inspirational-photographers-bw/page/6/?tab=comments#comment-1164019", "origin": "L-forum", "suborigin": "96948-inspirational-photographers-bw", "result": true, "Selector": "we make", "selectorShort": "make", "MarkedSent": "i hadn't seen paolo's work for years forgot about him altogether........ he's a story teller like .:: jindřich štreit ::. letizia battaglia is the real thing portraying the mafia - -----> we !!!  -----> make !!!  money not art", "sortedWord": "None", "Identifyer": null, "identifyer": 96999, "year": "2009"}, {"autor": "PeterMartin", "date": "2009-05-06 22:06:00", "content": " Hello to all fellow Leica Users: I joined this site a few days ago and thought I’d post a short note of introduction, as one would if you were an unknown guest at a dinner party. I’ve been shooting professionally for about 35 years, on staff at three different newspapers in Canada. After 16 years at the Montreal Gazette I decided to make a change and left the comfort of a full-time position to free-lance and pursue personal projects. Then I moved to the US from Canada for one reason…the love of a Woman. My first introduction to Leica was with my Uncle’s M3, which he bought in 1957 and brought to Canada when he emigrated from Germany in 1960. It held tremendous fascination for me as a young boy: full of mysterious buttons, knobs and strange numbers, that meant nothing to me. I was 10 when he let me take my first family photo with it, heavy and unbalanced, attached to a large Honeywell strobe. Through out my career I’ve used various versions of Nikons and Canons as most news shooters did and still do today. I picked up my first M6 about 11 years ago and started using it on my travels, strictly for personal use. I quickly became hooked and now use them exclusively for all my personal projects. Nowadays, I still use Canons, when I have to. In today’s world there’s no avoiding digital use if you want to make a living. However I still keep at least 100 rolls of Tri-X in the fridge at all times; have once again learned the tricks of transporting film through airport security systems; turn the kitchen into a makeshift lab whenever my wife leaves town on business; and am trying to figure a way to fit a darkroom into a 8 x 7 foot closet… before it’s too late. I found this site through a good friend in Montreal, and thought it would be interesting to get involved with a group who seem quite passionate about one of the few iconic cameras left in production today. Thanks for reading and I look forward to helping out and contributing as time allows. Mein Deutsch ist nicht perfekt, aber ich freue mich auf das Gespräch mit alle deutschen Fotografen auf dieser Website. Peter Martin P.S. About 15 years ago, my Uncle gave me the M3 and once I get around to replacing the rangefinder, look forward to putting it to use once again! http://www.petermartinphotographer.com", "link": "https://www.l-camera-forum.com/topic/84183-a-warm-greeting-to-everyone/?tab=comments#comment-891870", "origin": "L-forum", "suborigin": "84183-a-warm-greeting-to-everyone", "result": true, "Selector": "i decided to make", "selectorShort": "make", "MarkedSent": " hello to all fellow leica users: i joined this site a few days ago and thought i’d post a short note of introduction, as one would if you were an unknown guest at a dinner party. i’ve been shooting professionally for about 35 years, on staff at three different newspapers in canada. after 16 years at the montreal gazette -----> i !!!  -----> decided !!!  -----> to !!!  -----> make !!!  a change and left the comfort of a full-time position -----> to !!!  free-lance and pursue personal projects. then i moved to the us from canada for one reason…the love of a woman. my first introduction to leica was with my uncle’s m3, which he bought in 1957 and brought to canada when he emigrated from germany in 1960. it held tremendous fascination for me as a young boy: full of mysterious buttons, knobs and strange numbers, that meant nothing to me. i was 10 when he let me take my first family photo with it, heavy and unbalanced, attached to a large honeywell strobe. through out my career i’ve used various versions of nikons and canons as most news shooters did and still do today. i picked up my first m6 about 11 years ago and started using it on my travels, strictly for personal use. i quickly became hooked and now use them exclusively for all my personal projects. nowadays, i still use canons, when i have to. in today’s world there’s no avoiding digital use if you want to make a living. however i still keep at least 100 rolls of tri-x in the fridge at all times; have once again learned the tricks of transporting film through airport security systems; turn the kitchen into a makeshift lab whenever my wife leaves town on business; and am trying to figure a way to fit a darkroom into a 8 x 7 foot closet… before it’s too late. i found this site through a good friend in montreal, and thought it would be interesting to get involved with a group who seem quite passionate about one of the few iconic cameras left in production today. thanks for reading and i look forward to helping out and contributing as time allows. mein deutsch ist nicht perfekt, aber ich freue mich auf das gespräch mit alle deutschen fotografen auf dieser website. peter martin p.s. about 15 years ago, my uncle gave me the m3 and once i get around to replacing the rangefinder, look forward to putting it to use once again! http://www.petermartinphotographer.com", "sortedWord": "None", "Identifyer": null, "identifyer": 115261, "year": "2009"}], "name": "Leicasortedout2009make"}