{"interestingcomments": [{"autor": "ECohen", "date": "2015-06-19 03:24:00", "content": "I posted this link when I first introduced myself to the form....perhaps this is a better place. All shot with an X2 http://www.evancohen.net/france2013/ ...except for 2, I used my wife's DLux6 I'd love creative criticism.", "link": "https://www.l-camera-forum.com/topic/181346-leica-x2-images/page/7/?tab=comments#comment-2837959", "origin": "L-forum", "suborigin": "181346-leica-x2-images", "result": true, "Selector": "i first introduced", "selectorShort": "introduce", "MarkedSent": "-----> i !!!  posted this link when -----> i !!!  -----> first !!!  -----> introduced !!!  myself to the form....perhaps this is a better place. all shot with an x2 http://www.evancohen.net/france2013/ ...except for 2, i used my wife's dlux6 i'd love creative criticism.", "sortedWord": "None", "Identifyer": null, "identifyer": 9059, "year": "2015"}, {"autor": "Cuthbert", "date": "2015-04-05 22:45:00", "content": "Hello, my name is Alex, I registered on this board few months ago for providing info on my M4-P but I forgot to introduce myself at that time, now with winter also finished I can get better light to shoot outdoors. I ONLY shoot film because I was raised with the idea that artistic photography is just analogic, I am an avid collector of old cameras and regarding Leica I have a small collection: a M3, the M4-P I wrote about, an M5 and a 1940 Leica IIIb. I also have a DR Summicron, a 35 mm f2.8 Summaron, a 90 mm Elmarit and a Summitar, plus many Soviet lenses. This is my humble M3 system, I am still looking for the right 135mm: --img--  I would like to understand why on this board my links to tinypic don't work!--img--  Also...is this a forum of Strict Leica observance or is it also possible to post other stuff, for instance SLR shoots? Will I banned for that?--img-- ", "link": "https://www.l-camera-forum.com/topic/186962-welcome/page/4/?tab=comments#comment-2793343", "origin": "L-forum", "suborigin": "186962-welcome", "result": true, "Selector": "i forgot to introduce", "selectorShort": "introduce", "MarkedSent": "hello, my name is alex, -----> i !!!  registered on this board few months ago for providing info on my m4-p but -----> i !!!  -----> forgot !!!  -----> to !!!  -----> introduce !!!  myself at that time, now with winter also finished -----> i !!!  can get better light -----> to !!!  shoot outdoors. i only shoot film because i was raised with the idea that artistic photography is just analogic, i am an avid collector of old cameras and regarding leica i have a small collection: a m3, the m4-p i wrote about, an m5 and a 1940 leica iiib. i also have a dr summicron, a 35 mm f2.8 summaron, a 90 mm elmarit and a summitar, plus many soviet lenses. this is my humble m3 system, i am still looking for the right 135mm: --img--  i would like to understand why on this board my links to tinypic don't work!--img--  also...is this a forum of strict leica observance or is it also possible to post other stuff, for instance slr shoots? will i banned for that?--img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 113823, "year": "2015"}, {"autor": "Remco63", "date": "2015-10-04 20:44:00", "content": "Hey everybody, Let's introduce myself. My name is Remco, living in the Netherlands and a Leica-user since 1992. My first Leica was a M4-2 and after that i bought a M-6 and recently a M-9. My main interest in photography is documentary, people and travel. I'am also interested in Leica-history, i own a couple of antique Leica's. ( IIIF, III, M3) Hope to see a lot of photo's on the forum and to join the discussions. greetings, Remco", "link": "https://www.l-camera-forum.com/topic/186962-welcome/page/4/?tab=comments#comment-2899091", "origin": "L-forum", "suborigin": "186962-welcome", "result": true, "Selector": "'s introduce", "selectorShort": "introduce", "MarkedSent": "hey everybody, let-----> 's !!!  -----> introduce !!!  myself. my name is remco, living in the netherlands and a leica-user since 1992. my first leica was a m4-2 and after that i bought a m-6 and recently a m-9. my main interest in photography is documentary, people and travel. i'am also interested in leica-history, i own a couple of antique leica's. ( iiif, iii, m3) hope to see a lot of photo's on the forum and to join the discussions. greetings, remco", "sortedWord": "None", "Identifyer": null, "identifyer": 113833, "year": "2015"}], "name": "Leicasortedout2015introduce"}