{"interestingcomments": [{"autor": "Rick", "date": "2014-12-13 22:03:00", "content": "My choices for travel is based on what works for me. I don't have a lens-set based mainly on trying to carry a good spaced out group of focal lengths. Or, which are optically the fastest or most corrected lenses in each focal length. My choices are based on how I want to create a scene through a particular lens, mostly based on the focal lengths I like to work with and \"see\" in. To a lesser degree other particular lens characteristics play a role in why I like a lens. But, mostly I want lenses that allow me to approach a scene with the thought of completely controlling and manipulating the way the viewer is going to see and experience the image. I am more the active \"deliberate moment\" photographer working everything in my control, as apposed to the passive photographer waiting for the decisive moment to happen along through my viewfinder. Everyone has to actively decide how they are going to use every lens they bring along in their own travel kit themselves. These are my travel choices. WATE - I just love to see in the wide 16mm. Not because I want more in the scene as much as I like the near-far perspective the wides create. 21mm seems more normal in comparison to me, but is mostly useful to me when 16 needs cropping. The WATE allows me to see and create the placement of the camera (perspective) and use the zoom from 16-21 to crop the picture, I see in 16mm. Just how I approach the complex ultra-wide view. 28 Summicron - All around way I like to compose and create layered scenes with interest. Also, can be used to exaggerate perspective. f4.0 is normal for me and I tend to go to f16 more than I would f2.0 50 Summilux - Just all around best 50mm lens ever made. Tend to shoot at f4.0 and the transition to OOF is sooo smooth. Will stop down, but I'm not a bokeh fan for near shots as they always tend to just look like everything is out of focus, to me. Mid range shots are nice wide open, though. Great travel night lens with 1.4 available and creating background OOF lights. 90 Macro Elmar - Recognized as having the best optics of the 90mm Leica lenses at near for portraiture, for example. Top quality for distance landscape. Insanely compact and gives macro if you need. I'd never consider carrying the 90 APO or even the other large 90mm lenses for travel. Shot mostly in daylight I don't find a need for f2.0. Best long travel 90mm lens in my opinion. Not used enough by me, though. (I have the 35mm 1.4 FLE and it is a superior image quality choice, but it can be very normal and without drama and interest, for me. Harder to work into interesting perspectives, for me. Bigger and heavier than the excellent 28 Summicron the 35 FLE is too close to the 50mm and 28mm with nothing unique enough to garner a spot in the travel kit. And, I dislike the background bokeh of specular highlights.) Rick Edited December 13, 2014 by RickLeica", "link": "https://www.l-camera-forum.com/topic/237368-travel-lens-suggestions/page/3/?tab=comments#comment-2727834", "origin": "L-forum", "suborigin": "237368-travel-lens-suggestions", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": "my choices for travel is based on what works for me. i don't have a lens-set based mainly on trying to carry a good spaced out group of focal lengths. or, which are optically the fastest or most corrected lenses in each focal length. my choices are based on how -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a scene through a particular lens, mostly based on the focal lengths -----> i !!!  like -----> to !!!  work with and \"see\" in. to a lesser degree other particular lens characteristics play a role in why i like a lens. but, mostly i want lenses that allow me to approach a scene with the thought of completely controlling and manipulating the way the viewer is going to see and experience the image. i am more the active \"deliberate moment\" photographer working everything in my control, as apposed to the passive photographer waiting for the decisive moment to happen along through my viewfinder. everyone has to actively decide how they are going to use every lens they bring along in their own travel kit themselves. these are my travel choices. wate - i just love to see in the wide 16mm. not because i want more in the scene as much as i like the near-far perspective the wides create. 21mm seems more normal in comparison to me, but is mostly useful to me when 16 needs cropping. the wate allows me to see and create the placement of the camera (perspective) and use the zoom from 16-21 to crop the picture, i see in 16mm. just how i approach the complex ultra-wide view. 28 summicron - all around way i like to compose and create layered scenes with interest. also, can be used to exaggerate perspective. f4.0 is normal for me and i tend to go to f16 more than i would f2.0 50 summilux - just all around best 50mm lens ever made. tend to shoot at f4.0 and the transition to oof is sooo smooth. will stop down, but i'm not a bokeh fan for near shots as they always tend to just look like everything is out of focus, to me. mid range shots are nice wide open, though. great travel night lens with 1.4 available and creating background oof lights. 90 macro elmar - recognized as having the best optics of the 90mm leica lenses at near for portraiture, for example. top quality for distance landscape. insanely compact and gives macro if you need. i'd never consider carrying the 90 apo or even the other large 90mm lenses for travel. shot mostly in daylight i don't find a need for f2.0. best long travel 90mm lens in my opinion. not used enough by me, though. (i have the 35mm 1.4 fle and it is a superior image quality choice, but it can be very normal and without drama and interest, for me. harder to work into interesting perspectives, for me. bigger and heavier than the excellent 28 summicron the 35 fle is too close to the 50mm and 28mm with nothing unique enough to garner a spot in the travel kit. and, i dislike the background bokeh of specular highlights.) rick edited december 13, 2014 by rickleica", "sortedWord": "None", "Identifyer": null, "identifyer": 11063, "year": "2014"}, {"autor": "jmr", "date": "2014-06-21 11:41:00", "content": "Nice pictures.... LR 5? How did you get the warm nice colors? I've created a preset in Aperture that I use to give my colour shots the look of Fujifilm Astia, or something close to it, that I find pleasing.", "link": "https://www.l-camera-forum.com/topic/314859-ttltl2-image-thread/page/8/?tab=comments#comment-2615249", "origin": "L-forum", "suborigin": "314859-ttltl2-image-thread", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "nice pictures.... lr 5? how did you get the warm nice colors? -----> i !!! 've -----> created !!!  a preset in aperture that -----> i !!!  use to give my colour shots the look of fujifilm astia, or something close to it, that -----> i !!!  find pleasing.", "sortedWord": "None", "Identifyer": null, "identifyer": 36482, "year": "2014"}, {"autor": "alexander", "date": "2014-06-22 05:44:00", "content": " I've created a preset in Aperture that I use to give my colour shots the look of Fujifilm Astia, or something close to it, that I find pleasing. So jbg and no RAW?", "link": "https://www.l-camera-forum.com/topic/314859-ttltl2-image-thread/page/8/?tab=comments#comment-2615584", "origin": "L-forum", "suborigin": "314859-ttltl2-image-thread", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": " -----> i !!! 've -----> created !!!  a preset in aperture that -----> i !!!  use to give my colour shots the look of fujifilm astia, or something close to it, that -----> i !!!  find pleasing. so jbg and no raw?", "sortedWord": "None", "Identifyer": null, "identifyer": 36486, "year": "2014"}, {"autor": "DigitalHeMan", "date": "2014-11-22 10:16:00", "content": "Can YOU move my thread to the \"proper forum\" please? Create a new thread. And be selective with just a couple of images. I clicked on your link but there are tens of photos and I would rather just seen one or two that you feel are good.", "link": "https://www.l-camera-forum.com/topic/237391-x-vario-da-capo/?tab=comments#comment-2711901", "origin": "L-forum", "suborigin": "237391-x-vario-da-capo", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "can you move my thread to the \"proper forum\" please? -----> create !!!  a new thread. and be selective with just a couple of images. i clicked on your link but there are tens of photos and i would rather just seen one or two that you feel are good.", "sortedWord": "None", "Identifyer": null, "identifyer": 14205, "year": "2014"}, {"autor": "spydrxx", "date": "2014-11-01 14:37:00", "content": "I never really liked the Leica strap, nor most others. The one exception was one I acquired about 10 years ago from Luigi. Since then I've used his as a generic template in making my own from leather (Tandy) adjusted to my particular needs - in terms of color, texture, length, width, and fastening mechanism. It has allowed me to create instant on/off straps for my TLR bodies as well. By far a better solution than dealing with somebody else's idea of what's best for me.", "link": "https://www.l-camera-forum.com/topic/236271-fixing-the-leica-strap/?tab=comments#comment-2698764", "origin": "L-forum", "suborigin": "236271-fixing-the-leica-strap", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "i never really liked the leica strap, nor most others. the one exception was one i acquired about 10 years ago from luigi. since then i've used his as a generic template in making my own from leather (tandy) adjusted to my particular needs - in terms of color, texture, length, width, and fastening mechanism. it has allowed -----> me !!!  -----> to !!!  -----> create !!!  instant on/off straps for my tlr bodies as well. by far a better solution than dealing with somebody else's idea of what's best for me.", "sortedWord": "None", "Identifyer": null, "identifyer": 89335, "year": "2014"}, {"autor": "Echo63", "date": "2014-11-01 15:53:00", "content": "I never really liked the Leica strap, nor most others. The one exception was one I acquired about 10 years ago from Luigi. Since then I've used his as a generic template in making my own from leather (Tandy) adjusted to my particular needs - in terms of color, texture, length, width, and fastening mechanism. It has allowed me to create instant on/off straps for my TLR bodies as well. By far a better solution than dealing with somebody else's idea of what's best for me. thats why i customised mine ! (my X100 wears a custom built adjustable strap too)", "link": "https://www.l-camera-forum.com/topic/236271-fixing-the-leica-strap/?tab=comments#comment-2698791", "origin": "L-forum", "suborigin": "236271-fixing-the-leica-strap", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "i never really liked the leica strap, nor most others. the one exception was one i acquired about 10 years ago from luigi. since then i've used his as a generic template in making my own from leather (tandy) adjusted to my particular needs - in terms of color, texture, length, width, and fastening mechanism. it has allowed -----> me !!!  -----> to !!!  -----> create !!!  instant on/off straps for my tlr bodies as well. by far a better solution than dealing with somebody else's idea of what's best for me. thats why i customised mine ! (my x100 wears a custom built adjustable strap too)", "sortedWord": "None", "Identifyer": null, "identifyer": 89336, "year": "2014"}, {"autor": "JeTexas", "date": "2014-05-08 19:09:00", "content": "I've used Adorama a couple times with good results. I only did the cheap 8x8 14-page books, though. I've been meaning to try this place: Artifact Uprising // Make your own photo book. Create your own photo album, photo calendar and photo cards.", "link": "https://www.l-camera-forum.com/topic/226143-recommendation-of-a-professional-online-photo-book-other-than-blurbcom/?tab=comments#comment-2586199", "origin": "L-forum", "suborigin": "226143-recommendation-of-a-professional-online-photo-book-other-than-blurbcom", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "i've used adorama a couple times with good results. i only did the cheap 8x8 14-page books, though. i've been meaning to try this place: artifact uprising // make your own photo book. -----> create !!!  your own photo album, photo calendar and photo cards.", "sortedWord": "None", "Identifyer": null, "identifyer": 92433, "year": "2014"}, {"autor": "3D-Kraft.com", "date": "2014-08-12 18:06:00", "content": "The A7S camera profile that is currently provided by Adobe for Lightroom/ACR delivers quite disappointing results. I created a set of profiles using X-Rite ColorChecker Passport that deliver a much better base for further adjustments. The samples in this article were created using the profiles.", "link": "https://www.l-camera-forum.com/topic/231833-any-sony-a7s-shooters-in-the-house/page/2/?tab=comments#comment-2648220", "origin": "L-forum", "suborigin": "231833-any-sony-a7s-shooters-in-the-house", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "the a7s camera profile that is currently provided by adobe for lightroom/acr delivers quite disappointing results. -----> i !!!  -----> created !!!  a set of profiles using x-rite colorchecker passport that deliver a much better base for further adjustments. the samples in this article were created using the profiles.", "sortedWord": "None", "Identifyer": null, "identifyer": 94347, "year": "2014"}, {"autor": "fotografr", "date": "2014-03-30 04:32:00", "content": " With Photoshop there is a very simple, easy way to make an action that can fix the stuck or hot pixels automatically, in 'batch' for any number of images. Should we show you how? Or would you rather ignore the money you spent on Photoshop. Actually, you don't have to. I just found this on another thread and assume it's what you're referring to: \" Originally Posted by pico View Post I do not know if this will be helpful to you, but ... At work I had to fix a lot of pictures from the same camera where it had a dead pixel row. I created an action in Photoshop and saved it as a droplet. It worked beautifully and patched all the images in a couple minutes. It worked because the location was identical in every frame, as one should expect. Briefly, the action was something like this: Copy background layer to new layer. Select single-pixel row (or column) marquee in the new layer. Move it carefully just a pixel to the right of the white (dead pixel) row or column. Command-C. Them move it over the dead row or column. Command-V. Flatten image. Save.\" Edited March 30, 2014 by fotografr", "link": "https://www.l-camera-forum.com/topic/224405-cmos-vs-ccd/?tab=comments#comment-2559209", "origin": "L-forum", "suborigin": "224405-cmos-vs-ccd", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": " with photoshop there is a very simple, easy way to make an action that can fix the stuck or hot pixels automatically, in 'batch' for any number of images. should we show you how? or would you rather ignore the money you spent on photoshop. actually, you don't have to. i just found this on another thread and assume it's what you're referring to: \" originally posted by pico view post i do not know if this will be helpful to you, but ... at work i had to fix a lot of pictures from the same camera where it had a dead pixel row. -----> i !!!  -----> created !!!  an action in photoshop and saved it as a droplet. it worked beautifully and patched all the images in a couple minutes. it worked because the location was identical in every frame, as one should expect. briefly, the action was something like this: copy background layer to new layer. select single-pixel row (or column) marquee in the new layer. move it carefully just a pixel to the right of the white (dead pixel) row or column. command-c. them move it over the dead row or column. command-v. flatten image. save.\" edited march 30, 2014 by fotografr", "sortedWord": "None", "Identifyer": null, "identifyer": 96222, "year": "2014"}, {"autor": "ian moore", "date": "2014-11-05 15:47:00", "content": " Can anyone advise me how to upload random pictures to the Leica forum? Do I have to create an album,or use a site like Photobucket? Many thanks. Ian Moore", "link": "https://www.l-camera-forum.com/topic/236623-uploading-random-pictures/?tab=comments#comment-2701161", "origin": "L-forum", "suborigin": "236623-uploading-random-pictures", "result": true, "Selector": "i have to create", "selectorShort": "create", "MarkedSent": " can anyone advise me how to upload random pictures to the leica forum? do -----> i !!!  -----> have !!!  -----> to !!!  -----> create !!!  an album,or use a site like photobucket? many thanks. ian moore", "sortedWord": "None", "Identifyer": null, "identifyer": 115171, "year": "2014"}, {"autor": "Howsey", "date": "2014-05-21 08:03:00", "content": " There is no \"upload images\" box when I try to add/create an album. I created one previously but for some reason I can't seem to do it now. When I click add album, I see the title & description box but no upload images. Am I doing something wrong or just being blind , thanks ?", "link": "https://www.l-camera-forum.com/topic/227435-trouble-creating-an-album/?tab=comments#comment-2594093", "origin": "L-forum", "suborigin": "227435-trouble-creating-an-album", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": " there is no \"upload images\" box when i try to add/create an album. -----> i !!!  -----> created !!!  one previously but for some reason -----> i !!!  can't seem to do it now. when i click add album, i see the title & description box but no upload images. am i doing something wrong or just being blind , thanks ?", "sortedWord": "None", "Identifyer": null, "identifyer": 119833, "year": "2014"}, {"autor": "DigitalHeMan", "date": "2014-05-22 20:36:00", "content": " Am trying to create a new thread i the M Lenses forum, but it just times out with no error message and no thread creation. Of course, logic says this thread won't be created either, but if it is does anyone have an idea why I can create one here, but not in the Lenses section?", "link": "https://www.l-camera-forum.com/topic/227521-trouble-creating-a-new-thread/?tab=comments#comment-2595146", "origin": "L-forum", "suborigin": "227521-trouble-creating-a-new-thread", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": " am trying to create a new thread i the m lenses forum, but it just times out with no error message and no thread creation. of course, logic says this thread won't be created either, but if it is does anyone have an idea why -----> i !!!  -----> can !!!  -----> create !!!  one here, but not in the lenses section?", "sortedWord": "None", "Identifyer": null, "identifyer": 119905, "year": "2014"}, {"autor": "DigitalHeMan", "date": "2014-05-22 20:39:00", "content": "Am trying to create a new thread i the M Lenses forum, but it just times out with no error message and no thread creation. Of course, logic says this thread won't be created either, but if it is does anyone have an idea why I can create one here, but not in the Lenses section? OK, so this thread was created, but I still can't create one in the M Lenses forum.... what gives?", "link": "https://www.l-camera-forum.com/topic/227521-trouble-creating-a-new-thread/?tab=comments#comment-2595147", "origin": "L-forum", "suborigin": "227521-trouble-creating-a-new-thread", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "am trying to create a new thread i the m lenses forum, but it just times out with no error message and no thread creation. of course, logic says this thread won't be created either, but if it is does anyone have an idea why -----> i !!!  -----> can !!!  -----> create !!!  one here, but not in the lenses section? ok, so this thread was created, but i still can't create one in the m lenses forum.... what gives?", "sortedWord": "None", "Identifyer": null, "identifyer": 119906, "year": "2014"}], "name": "Leicasortedout2014create"}