{"interestingcomments": [{"autor": "lct", "date": "2019-10-26 16:54:00", "content": "1 hour ago, Ko.Fe. said: BTW, \"decisive moment\" is smoke in the mirror from old fox. HCB was pumping film through his Leica just as Winogrand did. Just look at his contact sheets or read how much film he gunned through on trips like India. The only decisive moment for him was to look at ten frames in the sequence and decide which one will be best for sale. HCB did not sell his pictures as far as i recall. Was Magnum's job IINW. Interesting to read a bit of his \"smoke\" BTW: « We photographers deal in things which are continually vanishing, and when they have vanished, there is no contrivance on earth which can make them come back again. We cannot develop and print a memory. The writer has time to reflect. He can accept and reject, accept again; and before committing his thoughts to paper he is able to tie the several relevant elements together. There is also a period when his brain \"forgets\", and his subconscious works on classifying his thoughts. But for photographers, what has gone, has gone forever. From that fact stem the anxieties and strength of our profession. We cannot do our story over again, once we've got back to the hotel. Our task is to perceive reality, almost simultaneously recording it in the sketchbook which is our camera. We must neither try to manipulate reality while we are shooting, nor must we manipulate the results in a darkroom. These tricks are patently discernible to those who have eyes to see. » Henri Cartier-Bresson The Decisive Moment Foreword, page 5 July 22, 1952 Edited October 26, 2019 by lct", "link": "https://www.l-camera-forum.com/topic/302651-street-photography-with-m240-tips/page/3/?tab=comments#comment-3842640", "origin": "L-forum", "suborigin": "302651-street-photography-with-m240-tips", "result": true, "Selector": "we cannot develop", "selectorShort": "develop", "MarkedSent": "1 hour ago, ko.fe. said: btw, \"decisive moment\" is smoke in the mirror from old fox. hcb was pumping film through his leica just as winogrand did. just look at his contact sheets or read how much film he gunned through on trips like india. the only decisive moment for him was to look at ten frames in the sequence and decide which one will be best for sale. hcb did not sell his pictures as far as i recall. was magnum's job iinw. interesting to read a bit of his \"smoke\" btw: « we photographers deal in things which are continually vanishing, and when they have vanished, there is no contrivance on earth which can make them come back again. -----> we !!!  -----> can !!! -----> not !!!  -----> develop !!!  and print a memory. the writer has time to reflect. he can accept and reject, accept again; and before committing his thoughts to paper he is able to tie the several relevant elements together. there is also a period when his brain \"forgets\", and his subconscious works on classifying his thoughts. but for photographers, what has gone, has gone forever. from that fact stem the anxieties and strength of our profession. we cannot do our story over again, once we've got back to the hotel. our task is to perceive reality, almost simultaneously recording it in the sketchbook which is our camera. we must neither try to manipulate reality while we are shooting, nor must we manipulate the results in a darkroom. these tricks are patently discernible to those who have eyes to see. » henri cartier-bresson the decisive moment foreword, page 5 july 22, 1952 edited october 26, 2019 by lct", "sortedWord": "None", "Identifyer": null, "identifyer": 18959, "year": "2019"}, {"autor": "Steve Ricoh", "date": "2019-10-26 17:27:00", "content": "26 minutes ago, lct said: HCB did not sell his pictures as far as i recall. Was Magnum's job IINW. Interesting to read a bit of his \"smoke\" BTW: « We photographers deal in things which are continually vanishing, and when they have vanished, there is no contrivance on earth which can make them come back again. We cannot develop and print a memory. The writer has time to reflect. He can accept and reject, accept again; and before committing his thoughts to paper he is able to tie the several relevant elements together. There is also a period when his brain \"forgets\", and his subconscious works on classifying his thoughts. But for photographers, what has gone, has gone forever. From that fact stem the anxieties and strength of our profession. We cannot do our story over again, once we've got back to the hotel. Our task is to perceive reality, almost simultaneously recording it in the sketchbook which is our camera. We must neither try to manipulate reality while we are shooting, nor must we manipulate the results in a darkroom. These tricks are patently discernible to those who have eyes to see. » Henri Cartier-Bresson The Decisive Moment Foreword, page 5 July 22, 1952 I read somewhere that HCB wasn't shy of cropping negs at print stage (he had someone print for him). In his day there was no Leica forum, no Facebook, no Twitter, no Instagram etc., so his subject would not worry about an image of themselves being plastered world-wide. In today's world, you take an image, you get caught and many will know what you're going to do with it. Naturally they feel uncomfortable. I've been caught many times and on a few occasions it turned rather nasty with verbal abuse. That aspect of street photography makes me reluctant to return.", "link": "https://www.l-camera-forum.com/topic/302651-street-photography-with-m240-tips/page/3/?tab=comments#comment-3842657", "origin": "L-forum", "suborigin": "302651-street-photography-with-m240-tips", "result": true, "Selector": "we cannot develop", "selectorShort": "develop", "MarkedSent": "26 minutes ago, lct said: hcb did not sell his pictures as far as i recall. was magnum's job iinw. interesting to read a bit of his \"smoke\" btw: « we photographers deal in things which are continually vanishing, and when they have vanished, there is no contrivance on earth which can make them come back again. -----> we !!!  -----> can !!! -----> not !!!  -----> develop !!!  and print a memory. the writer has time to reflect. he can accept and reject, accept again; and before committing his thoughts to paper he is able to tie the several relevant elements together. there is also a period when his brain \"forgets\", and his subconscious works on classifying his thoughts. but for photographers, what has gone, has gone forever. from that fact stem the anxieties and strength of our profession. we cannot do our story over again, once we've got back to the hotel. our task is to perceive reality, almost simultaneously recording it in the sketchbook which is our camera. we must neither try to manipulate reality while we are shooting, nor must we manipulate the results in a darkroom. these tricks are patently discernible to those who have eyes to see. » henri cartier-bresson the decisive moment foreword, page 5 july 22, 1952 i read somewhere that hcb wasn't shy of cropping negs at print stage (he had someone print for him). in his day there was no leica forum, no facebook, no twitter, no instagram etc., so his subject would not worry about an image of themselves being plastered world-wide. in today's world, you take an image, you get caught and many will know what you're going to do with it. naturally they feel uncomfortable. i've been caught many times and on a few occasions it turned rather nasty with verbal abuse. that aspect of street photography makes me reluctant to return.", "sortedWord": "None", "Identifyer": null, "identifyer": 18960, "year": "2019"}, {"autor": "Ko.Fe.", "date": "2019-10-27 15:33:00", "content": "22 hours ago, lct said: HCB did not sell his pictures as far as i recall. Was Magnum's job IINW. Interesting to read a bit of his \"smoke\" BTW: « We photographers deal in things which are continually vanishing, and when they have vanished, there is no contrivance on earth which can make them come back again. We cannot develop and print a memory. The writer has time to reflect. He can accept and reject, accept again; and before committing his thoughts to paper he is able to tie the several relevant elements together. There is also a period when his brain \"forgets\", and his subconscious works on classifying his thoughts. But for photographers, what has gone, has gone forever. From that fact stem the anxieties and strength of our profession. We cannot do our story over again, once we've got back to the hotel. Our task is to perceive reality, almost simultaneously recording it in the sketchbook which is our camera. We must neither try to manipulate reality while we are shooting, nor must we manipulate the results in a darkroom. These tricks are patently discernible to those who have eyes to see. » Henri Cartier-Bresson The Decisive Moment Foreword, page 5 July 22, 1952 Remind me who was the founder of Magnum and why it was created... Well, you don't have to remind me, but maybe check it for yourself. As for manipulation in the darkroom check on this: https://ca.phaidon.com/agenda/photography/articles/2013/may/28/magnum-and-the-dying-art-of-darkroom-printing/ https://petapixel.com/2013/09/12/marked-photographs-show-iconic-prints-edited-darkroom/ Magnums prints were heavily processed. I read HCB books and books about him. I have some of them at home. Some of them might be rare if at all in English. If here is event or something happening just go where and forget all of these talks about \"you have to ask permission from every person in the frame\". This is not what humanity was for him. HCB first real job was hunting. He translated some of it to photography. This is where decisive moment is - where and why are you going, why are you taking peoples pictures and then. Of course it is not fare to impose something fake on your pictures after it was taken. But Magnum prints went through huge amount of dodging, burning, masking and else. By the printer. Magnum was created to monetize most effectively on pictures taken. To make sure all of the territories, big events are covered and to have dedicated printer. I do print by myself and after while I realize what big print is often chosen not just because it is cool to have it big, but simply because large paper size allows easier manipulations. Dodging, burning, masking and else what is shown in the links I provided. Edited October 27, 2019 by Ko.Fe.", "link": "https://www.l-camera-forum.com/topic/302651-street-photography-with-m240-tips/page/4/?tab=comments#comment-3843080", "origin": "L-forum", "suborigin": "302651-street-photography-with-m240-tips", "result": true, "Selector": "we cannot develop", "selectorShort": "develop", "MarkedSent": "22 hours ago, lct said: hcb did not sell his pictures as far as i recall. was magnum's job iinw. interesting to read a bit of his \"smoke\" btw: « we photographers deal in things which are continually vanishing, and when they have vanished, there is no contrivance on earth which can make them come back again. -----> we !!!  -----> can !!! -----> not !!!  -----> develop !!!  and print a memory. the writer has time to reflect. he can accept and reject, accept again; and before committing his thoughts to paper he is able to tie the several relevant elements together. there is also a period when his brain \"forgets\", and his subconscious works on classifying his thoughts. but for photographers, what has gone, has gone forever. from that fact stem the anxieties and strength of our profession. we cannot do our story over again, once we've got back to the hotel. our task is to perceive reality, almost simultaneously recording it in the sketchbook which is our camera. we must neither try to manipulate reality while we are shooting, nor must we manipulate the results in a darkroom. these tricks are patently discernible to those who have eyes to see. » henri cartier-bresson the decisive moment foreword, page 5 july 22, 1952 remind me who was the founder of magnum and why it was created... well, you don't have to remind me, but maybe check it for yourself. as for manipulation in the darkroom check on this: https://ca.phaidon.com/agenda/photography/articles/2013/may/28/magnum-and-the-dying-art-of-darkroom-printing/ https://petapixel.com/2013/09/12/marked-photographs-show-iconic-prints-edited-darkroom/ magnums prints were heavily processed. i read hcb books and books about him. i have some of them at home. some of them might be rare if at all in english. if here is event or something happening just go where and forget all of these talks about \"you have to ask permission from every person in the frame\". this is not what humanity was for him. hcb first real job was hunting. he translated some of it to photography. this is where decisive moment is - where and why are you going, why are you taking peoples pictures and then. of course it is not fare to impose something fake on your pictures after it was taken. but magnum prints went through huge amount of dodging, burning, masking and else. by the printer. magnum was created to monetize most effectively on pictures taken. to make sure all of the territories, big events are covered and to have dedicated printer. i do print by myself and after while i realize what big print is often chosen not just because it is cool to have it big, but simply because large paper size allows easier manipulations. dodging, burning, masking and else what is shown in the links i provided. edited october 27, 2019 by ko.fe.", "sortedWord": "None", "Identifyer": null, "identifyer": 18971, "year": "2019"}, {"autor": "jpreisch", "date": "2019-02-17 01:54:00", "content": " I have a new to me M240. It has trouble playing with Adobe Photoshop Lightroom Classic CC, 8.2 release, Camera raw 11.2. When I import a DNG image it looks OK in Library, but when I move to Develop it looks OK for about 5 sec, and then the color shifts to a strong green bias. If I turn off Lightroom and then turn it back on the image is OK. I have called and talked to Adobe Technical Help, and I have been told its my graphics card and I need to get an upgraded driver to work with the 8.2 release. Then I was told Its a corrupted catalog. And finally I was told that Adobe does not support the M240. The even sent me the following link https://helpx.adobe.com/camera-raw/kb/camera-raw-plug-supported-cameras.html?red=a to prove it to me. Well I went to the Leica store that sold me the camera. They couldn't believe it till they saw it. Then they couldn't believe that Adobe does not support the M240 till they saw the link. They were however able to create a work around for me by simply cropping the image by 1 pixel all the way around. It works. Thank you Leica. Why couldn't the tech support at Adobe figure this out, they after all developed the DNG format? Has anyone else seen this problem with their M240? If so how did you overcome it? Jim", "link": "https://www.l-camera-forum.com/topic/294372-m-240-vs-adobe-lightroom/?tab=comments#comment-3685618", "origin": "L-forum", "suborigin": "294372-m-240-vs-adobe-lightroom", "result": true, "Selector": "i move to develop", "selectorShort": "develop", "MarkedSent": " i have a new to me m240. it has trouble playing with adobe photoshop lightroom classic cc, 8.2 release, camera raw 11.2. when -----> i !!!  import a dng image it looks ok in library, but when -----> i !!!  -----> move !!!  -----> to !!!  -----> develop !!!  it looks ok for about 5 sec, and then the color shifts -----> to !!!  a strong green bias. if i turn off lightroom and then turn it back on the image is ok. i have called and talked to adobe technical help, and i have been told its my graphics card and i need to get an upgraded driver to work with the 8.2 release. then i was told its a corrupted catalog. and finally i was told that adobe does not support the m240. the even sent me the following link https://helpx.adobe.com/camera-raw/kb/camera-raw-plug-supported-cameras.html?red=a to prove it to me. well i went to the leica store that sold me the camera. they couldn't believe it till they saw it. then they couldn't believe that adobe does not support the m240 till they saw the link. they were however able to create a work around for me by simply cropping the image by 1 pixel all the way around. it works. thank you leica. why couldn't the tech support at adobe figure this out, they after all developed the dng format? has anyone else seen this problem with their m240? if so how did you overcome it? jim", "sortedWord": "None", "Identifyer": null, "identifyer": 19490, "year": "2019"}, {"autor": "jaapv", "date": "2019-02-17 09:18:00", "content": " I have developed many thousands of 240 images using ACR/PS and occasionally Lightroom. I have never seen this problem. Does the problem occur when you use another computer and copy of Lightroom? If not, simply reinstall.", "link": "https://www.l-camera-forum.com/topic/294372-m-240-vs-adobe-lightroom/?tab=comments#comment-3685737", "origin": "L-forum", "suborigin": "294372-m-240-vs-adobe-lightroom", "result": true, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": " -----> i !!!  -----> have !!!  -----> developed !!!  many thousands of 240 images using acr/ps and occasionally lightroom. i have never seen this problem. does the problem occur when you use another computer and copy of lightroom? if not, simply reinstall.", "sortedWord": "None", "Identifyer": null, "identifyer": 19496, "year": "2019"}, {"autor": "Del_Pierro", "date": "2019-04-01 17:57:00", "content": "Some images of my first photos with the Q2 from a day trip to the nice city of Boppard in the Rhine Gorge of Germany. Developed from DNG in Lightroom, adjustments are shadows, highlights, contrast and maybe some cropping / bw conversion / vignette. I had the Q1 for two years and the Q2 is a really nice iteration: Lots of cropping possible, no banding in the shadows anymore (my Q1 had banding even with the latest firmware), a much better on/off switch , weather sealing, great dynamic range and much more. So far I love it! All photos are available for download in full size here: Boppard with the Q2 Some samples: --img--  --img--  --img--  --img--  --img--  Edited April 1, 2019 by Del_Pierro", "link": "https://www.l-camera-forum.com/topic/303026-leica-q2-images-post-them-here/page/7/?tab=comments#comment-3713760", "origin": "L-forum", "suborigin": "303026-leica-q2-images-post-them-here", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "some images of my first photos with the q2 from a day trip to the nice city of boppard in the rhine gorge of germany. -----> developed !!!  from dng in lightroom, adjustments are shadows, highlights, contrast and maybe some cropping / bw conversion / vignette. i had the q1 for two years and the q2 is a really nice iteration: lots of cropping possible, no banding in the shadows anymore (my q1 had banding even with the latest firmware), a much better on/off switch , weather sealing, great dynamic range and much more. so far i love it! all photos are available for download in full size here: boppard with the q2 some samples: --img--  --img--  --img--  --img--  --img--  edited april 1, 2019 by del_pierro", "sortedWord": "None", "Identifyer": null, "identifyer": 52210, "year": "2019"}, {"autor": "Jerry Attrik", "date": "2019-12-11 11:47:00", "content": "Wilson, in post #124, \"... Alan....running about 3 month turn over...\" As of to-day my 3f. has been with him for 7 months. I developed withdrawal symptoms about 3 months ago.", "link": "https://www.l-camera-forum.com/topic/127326-repair-specialists/page/7/?tab=comments#comment-3871277", "origin": "L-forum", "suborigin": "127326-repair-specialists", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "wilson, in post #124, \"... alan....running about 3 month turn over...\" as of to-day my 3f. has been with him for 7 months. -----> i !!!  -----> developed !!!  withdrawal symptoms about 3 months ago.", "sortedWord": "None", "Identifyer": null, "identifyer": 34344, "year": "2019"}, {"autor": "Ernest", "date": "2019-05-01 01:57:00", "content": "18 hours ago, stray cat said: This is fantastic, Rog. The grey areas look like impasto applied with a palette knife. This, in itself, makes it an interesting use of a textural device on a non-textural surface. Yes, I think that it is interesting, too, that a photograph of a wall texture coaxes the mind into equating the surface of the photograph for the surface of the wall. As you point out, this looks very much like knife painting with heavy impasto. I did three different versions with this limited palette, simplifying the elements as I developed the work. I started out thinking about the black paintings from Ad Reinhardt, Frank Stella, and Robert Rauschenberg, mainly. And then, there is Mark Rothko and the Rothko Chapel. The notion of black as transition. Anyway, in this piece I used five different values from basically, five different photographs, not including the Prussian blue strip on the left side. The eye immediately goes to the upper left corner to the lightest value and follows that strip down where it ends on that vertical slab of gray. I reversed the normal sense of atmospheric perspective in that the darkest gray, almost black, is the farthest away, and then there is an intermediate gray in the center of the composition. Painters use atmospheric perspective painting distant objects in a composition with the lighter value. Of my color studies, I like the way this one works so quietly. The thin blue strips, one might say they are an homage to Barnett Newman, but I think here they work on peripheral vision. My eye is aware of the strips, glances at them, then comes back to the gray tones. They are bookending the composition, as you say. Love it. The blue strip on the left side seems to vibrate because its value is so close to the gray. As always, I certainly appreciate your informed perspective. Cheers, Rog", "link": "https://www.l-camera-forum.com/topic/290225-diptychs-triptychs-and-polytychs-open-thread/page/7/?tab=comments#comment-3732261", "origin": "L-forum", "suborigin": "290225-diptychs-triptychs-and-polytychs-open-thread", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "18 hours ago, stray cat said: this is fantastic, rog. the grey areas look like impasto applied with a palette knife. this, in itself, makes it an interesting use of a textural device on a non-textural surface. yes, i think that it is interesting, too, that a photograph of a wall texture coaxes the mind into equating the surface of the photograph for the surface of the wall. as you point out, this looks very much like knife painting with heavy impasto. -----> i !!!  did three different versions with this limited palette, simplifying the elements as -----> i !!!  -----> developed !!!  the work. i started out thinking about the black paintings from ad reinhardt, frank stella, and robert rauschenberg, mainly. and then, there is mark rothko and the rothko chapel. the notion of black as transition. anyway, in this piece i used five different values from basically, five different photographs, not including the prussian blue strip on the left side. the eye immediately goes to the upper left corner to the lightest value and follows that strip down where it ends on that vertical slab of gray. i reversed the normal sense of atmospheric perspective in that the darkest gray, almost black, is the farthest away, and then there is an intermediate gray in the center of the composition. painters use atmospheric perspective painting distant objects in a composition with the lighter value. of my color studies, i like the way this one works so quietly. the thin blue strips, one might say they are an homage to barnett newman, but i think here they work on peripheral vision. my eye is aware of the strips, glances at them, then comes back to the gray tones. they are bookending the composition, as you say. love it. the blue strip on the left side seems to vibrate because its value is so close to the gray. as always, i certainly appreciate your informed perspective. cheers, rog", "sortedWord": "None", "Identifyer": null, "identifyer": 63893, "year": "2019"}, {"autor": "Jerry Attrik", "date": "2019-11-04 21:03:00", "content": "On 10/18/2019 at 11:19 AM, jonnyboy said: There is no doubt cameras often become emotional items, especially with Leica.... Very true, Jonny. I sent a 3f, which I use for mono work.( I have a second 3f, for colour neg.) About 4 weeks after sending it for a full service I started developing 'withdrawal symptoms' and a few weeks later I was feverishly searching advertisements for a fully working 'locum' body. I still am, but if I prevaricate long enough my 3f, might return before Christmas. On 10/19/2019 at 10:45 PM, Jeff S said: .....no object. Digital cameras are crappy investments. e.g Digilux 1 ?", "link": "https://www.l-camera-forum.com/topic/302526-letting-your-leica-go/?tab=comments#comment-3847886", "origin": "L-forum", "suborigin": "302526-letting-your-leica-go", "result": true, "Selector": "i started developing", "selectorShort": "develop", "MarkedSent": "on 10/18/2019 at 11:19 am, jonnyboy said: there is no doubt cameras often become emotional items, especially with leica.... very true, jonny. i sent a 3f, which i use for mono work.( -----> i !!!  have a second 3f, for colour neg.) about 4 weeks after sending it for a full service -----> i !!!  -----> started !!!  -----> developing !!!  'withdrawal symptoms' and a few weeks later -----> i !!!  was feverishly searching advertisements for a fully working 'locum' body. i still am, but if i prevaricate long enough my 3f, might return before christmas. on 10/19/2019 at 10:45 pm, jeff s said: .....no object. digital cameras are crappy investments. e.g digilux 1 ?", "sortedWord": "None", "Identifyer": null, "identifyer": 83412, "year": "2019"}, {"autor": "TheDot", "date": "2019-03-22 19:47:00", "content": " As I start to get into quite a few roles of film with my Leica MP (and my recently acquired M7 which is another discussion altogether), I am starting to contemplate developing film at home. I have not developed at home for over 30 years, so I certainly have lost the art of doing so. However, there is no local lab to bring in my film so I either need to drive a bit or send it in via post - both which seem to be a bit of a hassle. I am curious whom also does their own film development? Just the film as I would scan to digital once developed (an enlarger would be an extra step that I am not prepared to do at the moment). And what is the best approach to develpm film? B&H has a film development kit which seems to have almost everything I need; but given how long its been since I last developed film I am wondering if a more efficient approach has been created. Any thoughts are greatly appreciated.", "link": "https://www.l-camera-forum.com/topic/295465-home-film-development/?tab=comments#comment-3707352", "origin": "L-forum", "suborigin": "295465-home-film-development", "result": true, "Selector": "i have not developed", "selectorShort": "develop", "MarkedSent": " as i start to get into quite a few roles of film with my leica mp (and my recently acquired m7 which is another discussion altogether), i am starting to contemplate developing film at home. -----> i !!!  -----> have !!!  -----> not !!!  -----> developed !!!  at home for over 30 years, so -----> i !!!  certainly -----> have !!!  lost the art of doing so. however, there is no local lab to bring in my film so i either need to drive a bit or send it in via post - both which seem to be a bit of a hassle. i am curious whom also does their own film development? just the film as i would scan to digital once developed (an enlarger would be an extra step that i am not prepared to do at the moment). and what is the best approach to develpm film? b&h has a film development kit which seems to have almost everything i need; but given how long its been since i last developed film i am wondering if a more efficient approach has been created. any thoughts are greatly appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 99025, "year": "2019"}, {"autor": "Mark II", "date": "2019-03-24 07:32:00", "content": "I would second the DD-X suggestion for developer, as it gives excellent results, keeps well and is easy to mix and use. I mostly develop B&W using a dilution of 1+4 as a single-shot developer. Kodak D-76 or Ilford ID-11 are pretty much equivalent and cheaper, but mixing the developer from the powder is a pain...", "link": "https://www.l-camera-forum.com/topic/295465-home-film-development/?tab=comments#comment-3708217", "origin": "L-forum", "suborigin": "295465-home-film-development", "result": true, "Selector": "i mostly develop", "selectorShort": "develop", "MarkedSent": "i would second the dd-x suggestion for developer, as it gives excellent results, keeps well and is easy to mix and use. -----> i !!!  -----> mostly !!!  -----> develop !!!  b&w using a dilution of 1+4 as a single-shot developer. kodak d-76 or ilford id-11 are pretty much equivalent and cheaper, but mixing the developer from the powder is a pain...", "sortedWord": "None", "Identifyer": null, "identifyer": 99033, "year": "2019"}, {"autor": "jmahto", "date": "2019-03-26 13:55:00", "content": "On 3/22/2019 at 12:47 PM, TheDot said: As I start to get into quite a few roles of film with my Leica MP (and my recently acquired M7 which is another discussion altogether), I am starting to contemplate developing film at home. I have not developed at home for over 30 years, so I certainly have lost the art of doing so. However, there is no local lab to bring in my film so I either need to drive a bit or send it in via post - both which seem to be a bit of a hassle. I am curious whom also does their own film development? Just the film as I would scan to digital once developed (an enlarger would be an extra step that I am not prepared to do at the moment). And what is the best approach to develpm film? B&H has a film development kit which seems to have almost everything I need; but given how long its been since I last developed film I am wondering if a more efficient approach has been created. Any thoughts are greatly appreciated. I have been doing for last year and half for BW. I use single load Paterson tank with plastic reel. DD-X (1+4), Ilfostop, ilford fixer and settled on Kodak films. Scan using Plustek. Use of changing bag requires some practice. Out of 30+ rolls, I have messed up only two rolls. They got stuck in the reel and I had to unload it back into the cartridge to start all over again (didn't lose any pictures). Just sacrifice one roll and keep it for practice. As for water temp, keeping 20c in summer is not a problem (I am in San Francisco area). In winter I have to mix tap hot water to bring it to 20c. I also use it to create a bath in a large deep tray to bring other chemicals to same temperature. One large jug, one gallon water jug for extra water, two glass 500cc mug for mixing developer and stopper and one 1 liter dark chemical bottle for fixer (since it gets reused). And yes, one good glass thermometer. Tap water is good and for final wash I keep a gallon of distilled water bottle that lasts for many rolls. Add few drops of photoflow in last wash. I never use squeeze. It dries nicely in bathroom. That is all you need. Most important lesson I have learned is to stick with smallest set of variables so that your results are consistent. You can see my flickr set for my results (in film album). Edited March 26, 2019 by jmahto", "link": "https://www.l-camera-forum.com/topic/295465-home-film-development/?tab=comments#comment-3709838", "origin": "L-forum", "suborigin": "295465-home-film-development", "result": true, "Selector": "i have not developed", "selectorShort": "develop", "MarkedSent": "on 3/22/2019 at 12:47 pm, thedot said: as i start to get into quite a few roles of film with my leica mp (and my recently acquired m7 which is another discussion altogether), i am starting to contemplate developing film at home. -----> i !!!  -----> have !!!  -----> not !!!  -----> developed !!!  at home for over 30 years, so -----> i !!!  certainly -----> have !!!  lost the art of doing so. however, there is no local lab to bring in my film so i either need to drive a bit or send it in via post - both which seem to be a bit of a hassle. i am curious whom also does their own film development? just the film as i would scan to digital once developed (an enlarger would be an extra step that i am not prepared to do at the moment). and what is the best approach to develpm film? b&h has a film development kit which seems to have almost everything i need; but given how long its been since i last developed film i am wondering if a more efficient approach has been created. any thoughts are greatly appreciated. i have been doing for last year and half for bw. i use single load paterson tank with plastic reel. dd-x (1+4), ilfostop, ilford fixer and settled on kodak films. scan using plustek. use of changing bag requires some practice. out of 30+ rolls, i have messed up only two rolls. they got stuck in the reel and i had to unload it back into the cartridge to start all over again (didn't lose any pictures). just sacrifice one roll and keep it for practice. as for water temp, keeping 20c in summer is not a problem (i am in san francisco area). in winter i have to mix tap hot water to bring it to 20c. i also use it to create a bath in a large deep tray to bring other chemicals to same temperature. one large jug, one gallon water jug for extra water, two glass 500cc mug for mixing developer and stopper and one 1 liter dark chemical bottle for fixer (since it gets reused). and yes, one good glass thermometer. tap water is good and for final wash i keep a gallon of distilled water bottle that lasts for many rolls. add few drops of photoflow in last wash. i never use squeeze. it dries nicely in bathroom. that is all you need. most important lesson i have learned is to stick with smallest set of variables so that your results are consistent. you can see my flickr set for my results (in film album). edited march 26, 2019 by jmahto", "sortedWord": "None", "Identifyer": null, "identifyer": 99044, "year": "2019"}, {"autor": "EoinC", "date": "2019-04-13 07:41:00", "content": "The whole process is simpler than it sounds. I use / do the following... Loading Tools: 1) Large dark bag (I also use this when traveling to load LF film). 2) Paterson tank/s (Universal takes 2x 135 or 1x 120 film/s) [I have several, including 1 small one for processing 1x 135 film]. 3) Bottle opener / cassette opener [when using my EOS, I don’t bother opening th cassette, as I can set it to leave a leader when rewinding]. 4) Small pair of scissors to trim the end of the film square to feed into the reel. Loading: 1) Lay the bag out on a flattish area [I do mine on the sofa]. 2) Place the components in the bag in an order / area where you know where to find them. Note that (at least with the Paterson set) the reel/s must be totally dry, or you may have problems feeding the film/s. Also check that the pawl ball bearing are moving freely. [for me the layout is tank / tank-funnel / cap down the left side; reel/s with axle tube next to tank; film/s in middle; scissors / opener on right side - you can practice feeling your way around these items without loading a film. It becomes very easy very quickly]. 3) Close and seal the bag zip. 4) Position yourself comfortably, having removed watch etc [Gary is correct about the phone - It’s happened so often to me that I wonder if there’s a CCTV that I’m not aware of. I’ve also had a fly with a sense of humour land on my nose, which produces a head dance that must look good on the CCTV]. 5) Open the first film, placing the opener back to the right side of the bag. 6) Find the end of the film, and use the scissors to trim square-ish. I use my fingers as a guide - No need to be accurate - and I also chamfer the corners to make it easier to feed. 7) Feel for the 2 raised lead-in pieces on the 1st reel, line them up, and feed the film in enough to pass the pawl ball bearings. Start ratcheting the 2 sides of the reel, with thumbs on top of the 2 raised lead-in pieces to ensure the film doesn’t jump out. 8 ) Continue feeding until you get to the end (cassette comes up to the reel, and resists pulling back). Tear the cassette off (unless you are using Rollei infrared, where you may have to cut the end of the film). Rathchet the remaining film into the reel. 9) Repeat for the 2nd film, if there is one. 10) Feed the reels onto the axle tube, and load the reels into the tank (flanged end of the axle tube to bottom of the tank. 11) Fit the sealing tank funnel into the tank, twisting it to lock in place. Try to gently reverse it to check that it is locked. The tank is now light-safe. 12) Fit the cap on the tank, and then you can remove your hands and open the bag. This all sounds much harder than it is. With dry reels, 2 films can be loaded in a few minutes, and it is very easy to do (unless you own a fly with a sense of humour). Developing Tools and Consumables: I do my developing at a small sink in a small shower room. I use: 100ml graduates 600ml graduates 1000ml graduates 1000-1200ml plastic Tupperware-ish jugs with sealing lids to store working solutions 3000ml plastic jugs for when I plan on doing a lot of developing Small funnels 100-200ml measuring cups 1000-1200ml plastic jugs Paper coffee filters for when my source chemicals are getting a bit lumpy (chemistry term) Developer [I usually use R09 (Rodinal) @ 1:50 one-shot, or Ilford DDX @ 1:4 or 1:9] - Mix enough to at least get through the session. Stop [I use Ilfostop and mix 1000ml @ 1:19, so that I can rotate the 600ml tank requirement over time - If left for a long time, Stop will get mould on top]. Fixer [I use Ilford @ 1:4 and mix 1000-1200ml, so that I can rotate the 600ml tank requirement over time. You can check solution strength and how long to fix for by testing in daylight - drop one of the end clippings of film into the fixer solution and see how long it takes to turn clear, with a bit of agitation every 30sec. Multiply that time by 2.5 - 3.0 to get how long to fix for]. Photoflo [I use Ilfodol @ 1:200 (5ml teaspoon in 1000ml) - Keep an eye on this solution as, over time it will start to gather ‘floaties’, which you don’t want to settle on your films. Throw away once you see this happening]. Developing: It takes me 20-30 minutes to develop a film run, start to hanging up to dry. Variation is partly on film being used and what I’m trying to achieve, and partly on how distracted I get during the process. The key (despite the distractions) is consistency. As mentioned, Massive Dev Chart website is a very good starting point. Use it, see how the results turn out, then adjust to suit what works for you. I use tap water, and don’t worry about the temperatures. I’m in Malaysia, but my developing is inside an apartment, so probably around 24 C. Prepare what you need before you start. I have the Developer, Stop, Fixer, and 3x 600ml bottles of water (for the rinse) ready at the sink, and the Ilfodol solution sitting behind me (it’s not time-critical). My agitation process is slow hand-to-hand rotations of the tank (like horizontally undoing a large threaded jar), whilst gently tipping end-to end about 30 deg each way. My Paterson Universal 2-film tank process is: 1) 600ml of water into tank and continuous agitation for 1 min. Tip out water (may have dye, depending upon film emulsion). 2) 600ml of working Developer solution into tank. Agitate for 30 sec continuous, then 5 sec (3 rocking sequences) every 1 min for the required total developing time. Tip out (reuse or dispose, depending upon whether one-shot or not). 3) 600ml of working Stop solution into tank. Agitate for 1 min continuous. Tip back into jug for re-use. 4) 600ml of workin Fixer solution into tank. Agitate for 1 min continuous, then 5 sec (3 rocking sequences) every 30 sec for the required total fixing time. Tip back into jug for re-use. Note some films, particularly if under-exposed, will colour the Fixer pink / crimson. 5) 600ml of water into tank and agitate 7x (Ilford say 5x). Tip out. 6) 600ml of water into tank and agitate 14x (Ilford say 10x). Tip out. 7) 600ml of water into tank and agitate 28x [I like numbers] (Ilford say 20x). Tip out. 8 ) Remove cap, sealing funnel, and reels. Films probably look dark on the reels, as you can’t see through the multiple layers. 9) Set up a jug or container with the Ilfodol solution at a height where you are able to roll the film back and forth, hand to hand in a ‘U’ shape, dipped in the solution. 10) Break open the first reel and do the slow hand-to-hand semaphore dance for 2 min. This ensures the film is well-coated in the photoflo. At the end of the time, stretch your arms out wide and drain the Ilfodol off the film back into the container. 11) Hang the film up to dry. I use pegs or clips at the top, hanging off a cotton thread in the shower, and attach a small weight to the bottom (paper clips) to keep them straight-ish. 12) Repeat 10 & 11 for the 2nd film. Notes: The first time you do this, you’ll realise how much easier it is than it sounds - It’s just very wordy to describe. I give the tank a couple of bangs on a hard surface after each agitation sequence, to ‘ensure’ no bubbles are left on the films. The agitations witty the Developer are gentle and slow. With the Stop, Fixer, and water, it doesn’t matter so much. Don’t worry about seconds, and how long it takes to go between stages. This is a very ‘organic’ and forgiving process. I have even had a film that I’d exposed 25 years ago and forgotten about (and didn’t know what the emulsion was) produce usable results from stand developing. You don’t need to get every last drop out as you move between sequences. There will be a little dilution through cross transfer, but it is negligible. Consistency is the key. Get consistent, then get creative. Jump in. The basic set-up is very low-cost and simple. Kitchen measuring cups and jugs are just as effective as graduates etc, so there is very little capital outlay. A change bag works well for me - As noted by others, I’d advise getting a large one, giving more room to play. Trust me (if you can) - You’re going to enjoy this. The first successful film you develop will bring back that same buzz you had years ago, and will have you wanting to go out and shoot more. Returning to film was the best photographic move I’ve done in the last 30 years, and developing at home has been a key enabler / enthusiasm-builder. As Gary suggested, jump into the ‘I like film...’ thread to see great photo’s, great banter, and a collection of very supportive people who will positively help you with any questions you have. I also develop C41, but the process is, to me, less enthralling - more routine. B&W is the biz! ENJOY", "link": "https://www.l-camera-forum.com/topic/295465-home-film-development/page/2/?tab=comments#comment-3721386", "origin": "L-forum", "suborigin": "295465-home-film-development", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "the whole process is simpler than it sounds. i use / do the following... loading tools: 1) large dark bag (i also use this when traveling to load lf film). 2) paterson tank/s (universal takes 2x 135 or 1x 120 film/s) [i have several, including 1 small one for processing 1x 135 film]. 3) bottle opener / cassette opener [when using my eos, i don’t bother opening th cassette, as i can set it to leave a leader when rewinding]. 4) small pair of scissors to trim the end of the film square to feed into the reel. loading: 1) lay the bag out on a flattish area [i do mine on the sofa]. 2) place the components in the bag in an order / area where you know where to find them. note that (at least with the paterson set) the reel/s must be totally dry, or you may have problems feeding the film/s. also check that the pawl ball bearing are moving freely. [for me the layout is tank / tank-funnel / cap down the left side; reel/s with axle tube next to tank; film/s in middle; scissors / opener on right side - you can practice feeling your way around these items without loading a film. it becomes very easy very quickly]. 3) close and seal the bag zip. 4) position yourself comfortably, having removed watch etc [gary is correct about the phone - it’s happened so often to me that i wonder if there’s a cctv that i’m not aware of. i’ve also had a fly with a sense of humour land on my nose, which produces a head dance that must look good on the cctv]. 5) open the first film, placing the opener back to the right side of the bag. 6) find the end of the film, and use the scissors to trim square-ish. i use my fingers as a guide - no need to be accurate - and i also chamfer the corners to make it easier to feed. 7) feel for the 2 raised lead-in pieces on the 1st reel, line them up, and feed the film in enough to pass the pawl ball bearings. start ratcheting the 2 sides of the reel, with thumbs on top of the 2 raised lead-in pieces to ensure the film doesn’t jump out. 8 ) continue feeding until you get to the end (cassette comes up to the reel, and resists pulling back). tear the cassette off (unless you are using rollei infrared, where you may have to cut the end of the film). rathchet the remaining film into the reel. 9) repeat for the 2nd film, if there is one. 10) feed the reels onto the axle tube, and load the reels into the tank (flanged end of the axle tube to bottom of the tank. 11) fit the sealing tank funnel into the tank, twisting it to lock in place. try to gently reverse it to check that it is locked. the tank is now light-safe. 12) fit the cap on the tank, and then you can remove your hands and open the bag. this all sounds much harder than it is. with dry reels, 2 films can be loaded in a few minutes, and it is very easy to do (unless you own a fly with a sense of humour). -----> developing !!!  tools and consumables: i do my -----> developing !!!  at a small sink in a small shower room. i use: 100ml graduates 600ml graduates 1000ml graduates 1000-1200ml plastic tupperware-ish jugs with sealing lids to store working solutions 3000ml plastic jugs for when i plan on doing a lot of developing small funnels 100-200ml measuring cups 1000-1200ml plastic jugs paper coffee filters for when my source chemicals are getting a bit lumpy (chemistry term) developer [i usually use r09 (rodinal) @ 1:50 one-shot, or ilford ddx @ 1:4 or 1:9] - mix enough to at least get through the session. stop [i use ilfostop and mix 1000ml @ 1:19, so that i can rotate the 600ml tank requirement over time - if left for a long time, stop will get mould on top]. fixer [i use ilford @ 1:4 and mix 1000-1200ml, so that i can rotate the 600ml tank requirement over time. you can check solution strength and how long to fix for by testing in daylight - drop one of the end clippings of film into the fixer solution and see how long it takes to turn clear, with a bit of agitation every 30sec. multiply that time by 2.5 - 3.0 to get how long to fix for]. photoflo [i use ilfodol @ 1:200 (5ml teaspoon in 1000ml) - keep an eye on this solution as, over time it will start to gather ‘floaties’, which you don’t want to settle on your films. throw away once you see this happening]. developing: it takes me 20-30 minutes to develop a film run, start to hanging up to dry. variation is partly on film being used and what i’m trying to achieve, and partly on how distracted i get during the process. the key (despite the distractions) is consistency. as mentioned, massive dev chart website is a very good starting point. use it, see how the results turn out, then adjust to suit what works for you. i use tap water, and don’t worry about the temperatures. i’m in malaysia, but my developing is inside an apartment, so probably around 24 c. prepare what you need before you start. i have the developer, stop, fixer, and 3x 600ml bottles of water (for the rinse) ready at the sink, and the ilfodol solution sitting behind me (it’s not time-critical). my agitation process is slow hand-to-hand rotations of the tank (like horizontally undoing a large threaded jar), whilst gently tipping end-to end about 30 deg each way. my paterson universal 2-film tank process is: 1) 600ml of water into tank and continuous agitation for 1 min. tip out water (may have dye, depending upon film emulsion). 2) 600ml of working developer solution into tank. agitate for 30 sec continuous, then 5 sec (3 rocking sequences) every 1 min for the required total developing time. tip out (reuse or dispose, depending upon whether one-shot or not). 3) 600ml of working stop solution into tank. agitate for 1 min continuous. tip back into jug for re-use. 4) 600ml of workin fixer solution into tank. agitate for 1 min continuous, then 5 sec (3 rocking sequences) every 30 sec for the required total fixing time. tip back into jug for re-use. note some films, particularly if under-exposed, will colour the fixer pink / crimson. 5) 600ml of water into tank and agitate 7x (ilford say 5x). tip out. 6) 600ml of water into tank and agitate 14x (ilford say 10x). tip out. 7) 600ml of water into tank and agitate 28x [i like numbers] (ilford say 20x). tip out. 8 ) remove cap, sealing funnel, and reels. films probably look dark on the reels, as you can’t see through the multiple layers. 9) set up a jug or container with the ilfodol solution at a height where you are able to roll the film back and forth, hand to hand in a ‘u’ shape, dipped in the solution. 10) break open the first reel and do the slow hand-to-hand semaphore dance for 2 min. this ensures the film is well-coated in the photoflo. at the end of the time, stretch your arms out wide and drain the ilfodol off the film back into the container. 11) hang the film up to dry. i use pegs or clips at the top, hanging off a cotton thread in the shower, and attach a small weight to the bottom (paper clips) to keep them straight-ish. 12) repeat 10 & 11 for the 2nd film. notes: the first time you do this, you’ll realise how much easier it is than it sounds - it’s just very wordy to describe. i give the tank a couple of bangs on a hard surface after each agitation sequence, to ‘ensure’ no bubbles are left on the films. the agitations witty the developer are gentle and slow. with the stop, fixer, and water, it doesn’t matter so much. don’t worry about seconds, and how long it takes to go between stages. this is a very ‘organic’ and forgiving process. i have even had a film that i’d exposed 25 years ago and forgotten about (and didn’t know what the emulsion was) produce usable results from stand developing. you don’t need to get every last drop out as you move between sequences. there will be a little dilution through cross transfer, but it is negligible. consistency is the key. get consistent, then get creative. jump in. the basic set-up is very low-cost and simple. kitchen measuring cups and jugs are just as effective as graduates etc, so there is very little capital outlay. a change bag works well for me - as noted by others, i’d advise getting a large one, giving more room to play. trust me (if you can) - you’re going to enjoy this. the first successful film you develop will bring back that same buzz you had years ago, and will have you wanting to go out and shoot more. returning to film was the best photographic move i’ve done in the last 30 years, and developing at home has been a key enabler / enthusiasm-builder. as gary suggested, jump into the ‘i like film...’ thread to see great photo’s, great banter, and a collection of very supportive people who will positively help you with any questions you have. i also develop c41, but the process is, to me, less enthralling - more routine. b&w is the biz! enjoy", "sortedWord": "None", "Identifyer": null, "identifyer": 99057, "year": "2019"}, {"autor": "}{B", "date": "2019-04-27 16:09:00", "content": "I've now read a bit about it and it is the one with anti-halation properties. It also appears to have a propensity to exhibit grain. This may be more to do with the developer being used although the examples I've seen online developed in Foma's own brew showed obvious grain. I'll pick up a couple of rolls to try as I've got a batch of Ilford Delta films ready to be processed .", "link": "https://www.l-camera-forum.com/topic/296643-fomapan-retropan-320-soft/?tab=comments#comment-3730383", "origin": "L-forum", "suborigin": "296643-fomapan-retropan-320-soft", "result": true, "Selector": "i've seen online developed", "selectorShort": "develop", "MarkedSent": "i've now read a bit about it and it is the one with anti-halation properties. it also appears to have a propensity to exhibit grain. this may be more to do with the developer being used although the examples -----> i !!! 've -----> seen !!!  -----> online !!!  -----> developed !!!  in foma's own brew showed obvious grain. i'll pick up a couple of rolls to try as i've got a batch of ilford delta films ready to be processed .", "sortedWord": "None", "Identifyer": null, "identifyer": 99422, "year": "2019"}, {"autor": "}{B", "date": "2019-05-31 10:13:00", "content": "I bought four rolls recently and I've used one so far. I rated it at box speed and used my M7 to set the value. I'll develop it myself in Ilfosol 3 and give it a bit longer than my usual five minutes for Delta100. I'll post an example in this thread I get a reasonable result. Edited May 31, 2019 by }{B", "link": "https://www.l-camera-forum.com/topic/296643-fomapan-retropan-320-soft/?tab=comments#comment-3750868", "origin": "L-forum", "suborigin": "296643-fomapan-retropan-320-soft", "result": true, "Selector": "i'll develop", "selectorShort": "develop", "MarkedSent": "i bought four rolls recently and i've used one so far. i rated it at box speed and used my m7 to set the value. -----> i !!! -----> 'll !!!  -----> develop !!!  it myself in ilfosol 3 and give it a bit longer than my usual five minutes for delta100. i'll post an example in this thread i get a reasonable result. edited may 31, 2019 by }{b", "sortedWord": "None", "Identifyer": null, "identifyer": 99427, "year": "2019"}, {"autor": "Ko.Fe.", "date": "2019-02-26 21:05:00", "content": "I quit from rolls once I went into film for real. I started with four bulks per year, now down to two. People like me often rolls less than 20 frames. My LR shows 3K+ frames scanned in 2018. I printed 100+ in the darkroom. I also developed few e6 and couple of dozens of c-41. Edited February 26, 2019 by Ko.Fe.", "link": "https://www.l-camera-forum.com/topic/292186-how-much-film-do-you-shoot-in-one-year/page/2/?tab=comments#comment-3691675", "origin": "L-forum", "suborigin": "292186-how-much-film-do-you-shoot-in-one-year", "result": true, "Selector": "i also developed", "selectorShort": "develop", "MarkedSent": "i quit from rolls once i went into film for real. i started with four bulks per year, now down to two. people like me often rolls less than 20 frames. my lr shows 3k+ frames scanned in 2018. i printed 100+ in the darkroom. -----> i !!!  -----> also !!!  -----> developed !!!  few e6 and couple of dozens of c-41. edited february 26, 2019 by ko.fe.", "sortedWord": "None", "Identifyer": null, "identifyer": 101035, "year": "2019"}, {"autor": "philipus", "date": "2019-10-30 11:03:00", "content": "I average about 100 rolls a year split between 135 and 120. The vast majority is colour, only 10-15% is XP2 which I develop in HC-110.", "link": "https://www.l-camera-forum.com/topic/292186-how-much-film-do-you-shoot-in-one-year/page/2/?tab=comments#comment-3844623", "origin": "L-forum", "suborigin": "292186-how-much-film-do-you-shoot-in-one-year", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i average about 100 rolls a year split between 135 and 120. the vast majority is colour, only 10-15% is xp2 which -----> i !!!  -----> develop !!!  in hc-110.", "sortedWord": "None", "Identifyer": null, "identifyer": 101043, "year": "2019"}, {"autor": "erniethemilk", "date": "2019-12-26 05:11:00", "content": "I’ve shot around 5 rolls of Tri-X this past month or so having recently picked up an M6 to go with my M-10-P. In fact I’m so enamoured with my M6 I’ve barely touched my M10 since I’ve had the M6! I love the simplicity of shooting film, and find it far less stressful than shooting digital - if I don’t feel the frame is worth shooting with film I don’t shoot it, rather than with digital where I try and make the photo work. I also invested in a home developing kit and scanner so I can develop my black and white at home rather than have to wait for the lab. So far so good, just need to find a way to find more time to shoot film now!", "link": "https://www.l-camera-forum.com/topic/292186-how-much-film-do-you-shoot-in-one-year/page/2/?tab=comments#comment-3879621", "origin": "L-forum", "suborigin": "292186-how-much-film-do-you-shoot-in-one-year", "result": true, "Selector": "i can develop", "selectorShort": "develop", "MarkedSent": "i’ve shot around 5 rolls of tri-x this past month or so having recently picked up an m6 to go with my m-10-p. in fact i’m so enamoured with my m6 i’ve barely touched my m10 since i’ve had the m6! i love the simplicity of shooting film, and find it far less stressful than shooting digital - if i don’t feel the frame is worth shooting with film i don’t shoot it, rather than with digital where i try and make the photo work. -----> i !!!  also invested in a home developing kit and scanner so -----> i !!!  -----> can !!!  -----> develop !!!  my black and white at home rather than have to wait for the lab. so far so good, just need to find a way to find more time to shoot film now!", "sortedWord": "None", "Identifyer": null, "identifyer": 101046, "year": "2019"}, {"autor": "Pyrogallol", "date": "2019-12-30 15:53:00", "content": "Yes, sounds as if the film was not developed at all but only fixed. I use Rodinal and it works right down to the last dregs so you should have got something. I wonder if the pink colour in the fixer indicates some cross contamination between developer and fixer? I just used up the last dregs in a 500ml bottle that was opened a year ago and it was fine, FP4 at 1:25 for 8 minutes. A couple of days ago I developed a sheet of 5x4 at 1:25 only using 4ml of Rodinal to make up 100ml used in a 10x8 print drum on a drum roller, continuous agitation. I don’t understand the desire to do stand development with no agitation, it is asking for uneven development. For normal 35mm films I use a Paterson tank with invertion agitation about every minute. Edited December 30, 2019 by Pyrogallol", "link": "https://www.l-camera-forum.com/topic/304848-developing-help-needed/?tab=comments#comment-3881958", "origin": "L-forum", "suborigin": "304848-developing-help-needed", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "yes, sounds as if the film was not developed at all but only fixed. i use rodinal and it works right down to the last dregs so you should have got something. i wonder if the pink colour in the fixer indicates some cross contamination between developer and fixer? i just used up the last dregs in a 500ml bottle that was opened a year ago and it was fine, fp4 at 1:25 for 8 minutes. a couple of days ago -----> i !!!  -----> developed !!!  a sheet of 5x4 at 1:25 only using 4ml of rodinal to make up 100ml used in a 10x8 print drum on a drum roller, continuous agitation. i don’t understand the desire to do stand development with no agitation, it is asking for uneven development. for normal 35mm films i use a paterson tank with invertion agitation about every minute. edited december 30, 2019 by pyrogallol", "sortedWord": "None", "Identifyer": null, "identifyer": 102054, "year": "2019"}, {"autor": "tommonego@gmail.com", "date": "2019-12-04 18:20:00", "content": "3 hours ago, Stuart Richardson said: It is just 1+4 from the concentrate. For 500mL you have 100mL of concentrate, and 400mL of water. The working solution lasts a few months, so some people mix it ahead of time, but you do not have to. You should not dilute again once you have made a working solution...it is just 1+4 from the original bottle. Thanks, I probably diluted it further like 1:9 50cc/500cc, because I remember the developing times being longer than listed. Interesting that I just received a roll of TMax back from another lab and the development was perfect, unlike the first lab I used. I have the chemistry, found my developing tanks, now just have to find the graduates and Kodak calibration thermometer.", "link": "https://www.l-camera-forum.com/topic/304121-tmax-developer-dilution/?tab=comments#comment-3867310", "origin": "L-forum", "suborigin": "304121-tmax-developer-dilution", "result": true, "Selector": "my developing", "selectorShort": "develop", "MarkedSent": "3 hours ago, stuart richardson said: it is just 1+4 from the concentrate. for 500ml you have 100ml of concentrate, and 400ml of water. the working solution lasts a few months, so some people mix it ahead of time, but you do not have to. you should not dilute again once you have made a working solution...it is just 1+4 from the original bottle. thanks, i probably diluted it further like 1:9 50cc/500cc, because i remember the developing times being longer than listed. interesting that i just received a roll of tmax back from another lab and the development was perfect, unlike the first lab i used. i have the chemistry, found -----> my !!!  -----> developing !!!  tanks, now just have to find the graduates and kodak calibration thermometer.", "sortedWord": "None", "Identifyer": null, "identifyer": 102074, "year": "2019"}, {"autor": "tom.w.bn", "date": "2019-12-14 10:50:00", "content": "Am 4.12.2019 um 19:20 schrieb tommonego@gmail.com: Thanks, I probably diluted it further like 1:9 50cc/500cc, because I remember the developing times being longer than listed. Interesting that I just received a roll of TMax back from another lab and the development was perfect, unlike the first lab I used. I have the chemistry, found my developing tanks, now just have to find the graduates and Kodak calibration thermometer. Why would you do that? Cost saving? Why do you want longer development times instead of shorter develpment times? 1+4 and the development times from the film data sheet will give you really good results. You will find development times for 1+9 on massive dev chart but I doubt that the results will be as good. If a developer with the intended dillution is too expensive, probably find a developer that needs a different dillution right from the start?", "link": "https://www.l-camera-forum.com/topic/304121-tmax-developer-dilution/?tab=comments#comment-3872977", "origin": "L-forum", "suborigin": "304121-tmax-developer-dilution", "result": true, "Selector": "my developing", "selectorShort": "develop", "MarkedSent": "am 4.12.2019 um 19:20 schrieb tommonego@gmail.com: thanks, i probably diluted it further like 1:9 50cc/500cc, because i remember the developing times being longer than listed. interesting that i just received a roll of tmax back from another lab and the development was perfect, unlike the first lab i used. i have the chemistry, found -----> my !!!  -----> developing !!!  tanks, now just have to find the graduates and kodak calibration thermometer. why would you do that? cost saving? why do you want longer development times instead of shorter develpment times? 1+4 and the development times from the film data sheet will give you really good results. you will find development times for 1+9 on massive dev chart but i doubt that the results will be as good. if a developer with the intended dillution is too expensive, probably find a developer that needs a different dillution right from the start?", "sortedWord": "None", "Identifyer": null, "identifyer": 102075, "year": "2019"}, {"autor": "105012", "date": "2019-11-22 21:21:00", "content": "Ektar 100 is an amazing film, I love its results for portraits. Looking over my Ektar portraits I really don’t know why people struggle with it? Beautiful, delicate skin tones. I always use my built-in lightmeter (in other words, my eyes) and pictures look great. In lower light levels I do sometimes pull out the Sekonic 208 to double check my estimate as I’ve learnt that that is where an incident meter is useful. All taken with one of my M3’s. I also develop the Ektar myself using a Jobo ATL and scan with a Pakon. I have also printed a small number of Ektar frames in the darkroom, just gorgeous results (RA-4). Maybe somewhere in that mix is the key to consistent great results from Ektar?", "link": "https://www.l-camera-forum.com/topic/303639-where-did-i-go-wrong-ektar-100/?tab=comments#comment-3859789", "origin": "L-forum", "suborigin": "303639-where-did-i-go-wrong-ektar-100", "result": true, "Selector": "i also develop", "selectorShort": "develop", "MarkedSent": "ektar 100 is an amazing film, i love its results for portraits. looking over my ektar portraits i really don’t know why people struggle with it? beautiful, delicate skin tones. i always use my built-in lightmeter (in other words, my eyes) and pictures look great. in lower light levels i do sometimes pull out the sekonic 208 to double check my estimate as i’ve learnt that that is where an incident meter is useful. all taken with one of my m3’s. -----> i !!!  -----> also !!!  -----> develop !!!  the ektar myself using a jobo atl and scan with a pakon. i have also printed a small number of ektar frames in the darkroom, just gorgeous results (ra-4). maybe somewhere in that mix is the key to consistent great results from ektar?", "sortedWord": "None", "Identifyer": null, "identifyer": 102108, "year": "2019"}, {"autor": "jmahto", "date": "2019-06-23 19:43:00", "content": "I developed TMax100 in Rodinal at 1:25 (5:30min at 21c) and 1:50 (12min at 20c) dilution. My test is not scientific but In the scans, I am not able to see any difference in the output (grain or contrast). Why one will use 1:25 dilution when it is twice the cost and no benefit?", "link": "https://www.l-camera-forum.com/topic/298449-rodinal-newbie/?tab=comments#comment-3765104", "origin": "L-forum", "suborigin": "298449-rodinal-newbie", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "-----> i !!!  -----> developed !!!  tmax100 in rodinal at 1:25 (5:30min at 21c) and 1:50 (12min at 20c) dilution. my test is not scientific but in the scans, i am not able to see any difference in the output (grain or contrast). why one will use 1:25 dilution when it is twice the cost and no benefit?", "sortedWord": "None", "Identifyer": null, "identifyer": 102432, "year": "2019"}, {"autor": "stunsworth", "date": "2019-05-15 09:23:00", "content": "It's 15 years or so since I've developed Tri-X, but I always exposed it at ISO 400 and developed it in Xtol diluted 1:3. It's a lovely film IMHO. I preferred it to HP5 as I thought it had a little more contrast, but after saying that I was happy to use the Ilford product if I couldn't get the Kodak.", "link": "https://www.l-camera-forum.com/topic/297279-tri-x/?tab=comments#comment-3740919", "origin": "L-forum", "suborigin": "297279-tri-x", "result": true, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "it's 15 years or so since -----> i !!! 've -----> developed !!!  tri-x, but -----> i !!!  always exposed it at iso 400 and -----> developed !!!  it in xtol diluted 1:3. it's a lovely film imho. i preferred it to hp5 as i thought it had a little more contrast, but after saying that i was happy to use the ilford product if i couldn't get the kodak.", "sortedWord": "None", "Identifyer": null, "identifyer": 102564, "year": "2019"}, {"autor": "105012", "date": "2019-05-15 12:35:00", "content": "I use Tri-X for most of my BW. Developed in Ilford-HC or Kodak HC-110 in my Jobo ATL (4:45 at 24degrees for my typical exposure profile) it produces results I love when put through an enlarger in the darkroom.", "link": "https://www.l-camera-forum.com/topic/297279-tri-x/?tab=comments#comment-3741034", "origin": "L-forum", "suborigin": "297279-tri-x", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "i use tri-x for most of my bw. -----> developed !!!  in ilford-hc or kodak hc-110 in my jobo atl (4:45 at 24degrees for my typical exposure profile) it produces results i love when put through an enlarger in the darkroom.", "sortedWord": "None", "Identifyer": null, "identifyer": 102566, "year": "2019"}, {"autor": "ianman", "date": "2019-05-15 15:02:00", "content": "I've developed Tri-x in Rodinal and HC110. I prefer the HC110 (dil. 'c') as the result is far less grainy.", "link": "https://www.l-camera-forum.com/topic/297279-tri-x/?tab=comments#comment-3741171", "origin": "L-forum", "suborigin": "297279-tri-x", "result": true, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "-----> i !!! 've -----> developed !!!  tri-x in rodinal and hc110. i prefer the hc110 (dil. 'c') as the result is far less grainy.", "sortedWord": "None", "Identifyer": null, "identifyer": 102568, "year": "2019"}, {"autor": "wlaidlaw", "date": "2019-05-11 20:17:00", "content": "1 hour ago, Herr Barnack said: As of July 2018, Fujifilm was supposedly \"looking into\" the possibility of resurrecting Acros 100. There has been no news since that initial report. I guess they stopped looking... 🙄 I find that if I get someone else to develop Adox Silvermax 100 in the correct Silvermax developer, it is every bit as fine grain as Acros. BTW Fotoimpex still have Acros in stock. I am allergic to Hydroquinone, so am limited in the developers I can use and when I have developed Silvermax in my usual HQ-free Rodinal, it has come out with rather blocky shadows and over contrasty. For slow film, I prefer Ilford FP4 therefore, which works beautifully with Rodinal. The film I want to try is Fomapan 100R B&W positive film but again, as it needs special developers containing HQ, I would have to give it to others to process. I used to love Agfa Scala B&W positive film. Wilson", "link": "https://www.l-camera-forum.com/topic/293955-fujifilm-hell-bent-on-discontinuing-films-why/page/2/?tab=comments#comment-3739067", "origin": "L-forum", "suborigin": "293955-fujifilm-hell-bent-on-discontinuing-films-why", "result": true, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "1 hour ago, herr barnack said: as of july 2018, fujifilm was supposedly \"looking into\" the possibility of resurrecting acros 100. there has been no news since that initial report. i guess they stopped looking... 🙄 i find that if i get someone else to develop adox silvermax 100 in the correct silvermax developer, it is every bit as fine grain as acros. btw fotoimpex still have acros in stock. -----> i !!!  am allergic to hydroquinone, so am limited in the developers -----> i !!!  can use and when -----> i !!!  -----> have !!!  -----> developed !!!  silvermax in my usual hq-free rodinal, it has come out with rather blocky shadows and over contrasty. for slow film, i prefer ilford fp4 therefore, which works beautifully with rodinal. the film i want to try is fomapan 100r b&w positive film but again, as it needs special developers containing hq, i would have to give it to others to process. i used to love agfa scala b&w positive film. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 102598, "year": "2019"}, {"autor": "Herr Barnack", "date": "2019-05-12 01:27:00", "content": "5 hours ago, wlaidlaw said: I find that if I get someone else to develop Adox Silvermax 100 in the correct Silvermax developer, it is every bit as fine grain as Acros. BTW Fotoimpex still have Acros in stock. I am allergic to Hydroquinone, so am limited in the developers I can use and when I have developed Silvermax in my usual HQ-free Rodinal, it has come out with rather blocky shadows and over contrasty. For slow film, I prefer Ilford FP4 therefore, which works beautifully with Rodinal. The film I want to try is Fomapan 100R B&W positive film but again, as it needs special developers containing HQ, I would have to give it to others to process. I used to love Agfa Scala B&W positive film. Wilson Adox Silvermax 100 is an interesting emulsion - I'm going to give it a try, seeing how it's been five years of nothing but hollow promises and endless waiting from the makers of http://www.filmferrania.it/p30 There's not even a buy page for P30 on their website any more: https://shop.filmferrania.it/ Edited May 12, 2019 by Herr Barnack", "link": "https://www.l-camera-forum.com/topic/293955-fujifilm-hell-bent-on-discontinuing-films-why/page/2/?tab=comments#comment-3739166", "origin": "L-forum", "suborigin": "293955-fujifilm-hell-bent-on-discontinuing-films-why", "result": true, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "5 hours ago, wlaidlaw said: i find that if i get someone else to develop adox silvermax 100 in the correct silvermax developer, it is every bit as fine grain as acros. btw fotoimpex still have acros in stock. -----> i !!!  am allergic to hydroquinone, so am limited in the developers -----> i !!!  can use and when -----> i !!!  -----> have !!!  -----> developed !!!  silvermax in my usual hq-free rodinal, it has come out with rather blocky shadows and over contrasty. for slow film, i prefer ilford fp4 therefore, which works beautifully with rodinal. the film i want to try is fomapan 100r b&w positive film but again, as it needs special developers containing hq, i would have to give it to others to process. i used to love agfa scala b&w positive film. wilson adox silvermax 100 is an interesting emulsion - i'm going to give it a try, seeing how it's been five years of nothing but hollow promises and endless waiting from the makers of http://www.filmferrania.it/p30 there's not even a buy page for p30 on their website any more: https://shop.filmferrania.it/ edited may 12, 2019 by herr barnack", "sortedWord": "None", "Identifyer": null, "identifyer": 102601, "year": "2019"}, {"autor": "EoinC", "date": "2019-04-13 08:03:00", "content": "On 2/22/2019 at 11:04 PM, TomB_tx said: Like others above, I shot lots of Tri-X in the 1960s when doing more reportage work in available light - often at EI 1200 developed in Acufine. I also did indoor sports with 2475 recording film. Yet I never liked heavy grain - so when possible I used Panatomic-X (ASA 64). In the 10 years since retiring and shooting film again, I've found I prefer the Ilford films, using PanF+ the most. I've had good tonality results with HP5+, but again prefer finer grain. Having tried TMax and Ilford Delta films, I prefer Delta, particularly for the handling when processing and drying. So I've ditched my remaining bulk of Tri-X and started loading Delta. On the other hand, I do like the results of HP5+ in 120 size, where the grain isn't an issue. I guess I should 120 Tri-X again. Still have a soft spot for Kodak, and will be doing more Ektachrome for color. Looking forward to 120 size in that also. Panatomic-X was also a favourite of mine (although I recollect it as being ASA 32), along with Techpan, and Tri-X. These days, in 135, my preference is for Delta 100, with Tri-X for anything requiring a bit more latitude. I like, but don’t love, the TMax films. For slower stuff, I really like the Adox CMS 20 (reminds me of Techpan), and also sometimes use Rollei RPX 25 and Ilford PanF+. For 120, Delta 100 and Tri-X are both crackingly good. For LF, Delta 100 and Tri-X 320 are beltingly crackingly good. I’m generally developing in R09 (Rodinal), or DDX. Note: I’m even more enamoured by Ilford through both their dedication to film, and their customer service. I’m based in Malaysia, and sent them an e-mail about a few (3, if I recall) 120 Delta 100 films that I shot that had pieces of non-associated paper floating on them. They were very positive in their responses and, unsolicited, sent me replacement films plus a large assortment of 135 and 120 additional films. In addition to their excellent products, they deserve my custom. Edited April 13, 2019 by EoinC", "link": "https://www.l-camera-forum.com/topic/294528-tmax-400-more-preferred-than-tri-x-among-leica-users/page/3/?tab=comments#comment-3721396", "origin": "L-forum", "suborigin": "294528-tmax-400-more-preferred-than-tri-x-among-leica-users", "result": true, "Selector": "i’m generally developing", "selectorShort": "develop", "MarkedSent": "on 2/22/2019 at 11:04 pm, tomb_tx said: like others above, i shot lots of tri-x in the 1960s when doing more reportage work in available light - often at ei 1200 developed in acufine. i also did indoor sports with 2475 recording film. yet i never liked heavy grain - so when possible i used panatomic-x (asa 64). in the 10 years since retiring and shooting film again, i've found i prefer the ilford films, using panf+ the most. i've had good tonality results with hp5+, but again prefer finer grain. having tried tmax and ilford delta films, i prefer delta, particularly for the handling when processing and drying. so i've ditched my remaining bulk of tri-x and started loading delta. on the other hand, i do like the results of hp5+ in 120 size, where the grain isn't an issue. i guess i should 120 tri-x again. still have a soft spot for kodak, and will be doing more ektachrome for color. looking forward to 120 size in that also. panatomic-x was also a favourite of mine (although i recollect it as being asa 32), along with techpan, and tri-x. these days, in 135, my preference is for delta 100, with tri-x for anything requiring a bit more latitude. i like, but don’t love, the tmax films. for slower stuff, i really like the adox cms 20 (reminds me of techpan), and also sometimes use rollei rpx 25 and ilford panf+. for 120, delta 100 and tri-x are both crackingly good. for lf, delta 100 and tri-x 320 are beltingly crackingly good. -----> i !!! ’m -----> generally !!!  -----> developing !!!  in r09 (rodinal), or ddx. note: i’m even more enamoured by ilford through both their dedication to film, and their customer service. i’m based in malaysia, and sent them an e-mail about a few (3, if i recall) 120 delta 100 films that i shot that had pieces of non-associated paper floating on them. they were very positive in their responses and, unsolicited, sent me replacement films plus a large assortment of 135 and 120 additional films. in addition to their excellent products, they deserve my custom. edited april 13, 2019 by eoinc", "sortedWord": "None", "Identifyer": null, "identifyer": 102716, "year": "2019"}, {"autor": "TomB_tx", "date": "2019-04-19 11:24:00", "content": " I also tried TriX again - snapshots of a friends 50th wedding anniversary with my 50 yr-old M4 and the film I used back then. I also developed in DD-X and was quite pleased with both the tonality and grain (reduced compared to Rodinal). Back 50 years ago I would have developed in either Ethol UFG (for 400 EI) or Acufine (for 1200 EI), but times change... However, again I found TriX curled (or bowed) so much across the film that I could not get sharp scans on my V700, whereas the Ilford films lie much flatter. Then I shot a roll of Fomo 400 and found it lay flatter yet. I had to weight the TriX film flat for a week until it would scan sharply. As a result I got some glass carriers for the scanner, which help a lot.", "link": "https://www.l-camera-forum.com/topic/294528-tmax-400-more-preferred-than-tri-x-among-leica-users/page/3/?tab=comments#comment-3725395", "origin": "L-forum", "suborigin": "294528-tmax-400-more-preferred-than-tri-x-among-leica-users", "result": true, "Selector": "i also developed", "selectorShort": "develop", "MarkedSent": " i also tried trix again - snapshots of a friends 50th wedding anniversary with my 50 yr-old m4 and the film i used back then. -----> i !!!  -----> also !!!  -----> developed !!!  in dd-x and was quite pleased with both the tonality and grain (reduced compared to rodinal). back 50 years ago i would have developed in either ethol ufg (for 400 ei) or acufine (for 1200 ei), but times change... however, again i found trix curled (or bowed) so much across the film that i could not get sharp scans on my v700, whereas the ilford films lie much flatter. then i shot a roll of fomo 400 and found it lay flatter yet. i had to weight the trix film flat for a week until it would scan sharply. as a result i got some glass carriers for the scanner, which help a lot.", "sortedWord": "None", "Identifyer": null, "identifyer": 102720, "year": "2019"}, {"autor": "EoinC", "date": "2019-03-20 10:46:00", "content": "Not a good shot, but it is nice film to use. I think I developed in Ilford DDX... --img-- A019 by Eoin Christie, on Flickr", "link": "https://www.l-camera-forum.com/topic/295379-adox-silvermax-experience/?tab=comments#comment-3706171", "origin": "L-forum", "suborigin": "295379-adox-silvermax-experience", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "not a good shot, but it is nice film to use. -----> i !!!  think -----> i !!!  -----> developed !!!  in ilford ddx... --img-- a019 by eoin christie, on flickr", "sortedWord": "None", "Identifyer": null, "identifyer": 102800, "year": "2019"}, {"autor": "Martin B", "date": "2019-01-19 17:05:00", "content": "For the 120 film day tomorrow: Printed from my 6x6 negative on silver gelatin 11x14\" Ilford Multigrade RC paper with Beseler 23C enlarger and Schneider-Kreuznach 80/2.8 enlarger lens. Developed with Dektol. --img--  Edited January 19, 2019 by Martin B", "link": "https://www.l-camera-forum.com/topic/293310-january-20-international-one-twenty-dayis-coming/?tab=comments#comment-3667677", "origin": "L-forum", "suborigin": "293310-january-20-international-one-twenty-dayis-coming", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "for the 120 film day tomorrow: printed from my 6x6 negative on silver gelatin 11x14\" ilford multigrade rc paper with beseler 23c enlarger and schneider-kreuznach 80/2.8 enlarger lens. -----> developed !!!  with dektol. --img--  edited january 19, 2019 by martin b", "sortedWord": "None", "Identifyer": null, "identifyer": 103085, "year": "2019"}, {"autor": "M9reno", "date": "2019-01-15 07:49:00", "content": "I have seen subtle dark lines like this on my own photos in the past. They are visible in the sky, but actually on closer inspection can appear anywhere on the negative as *light streaks*. Because they look like dark streaks on the final printed or scanned image, they are just more easily visible in lighter parts of the picture like the sky. In my case it was uneven first contact with the developer that was responsible. I develop inside a rotating drum, and maybe your lab is doing the same. The mark is the trail left by the developer as it slides down part of the film on first contact with it. The solution is to wet the film (pre-wash) before development. You pour water into the drum, and after a few rotations dump the water. Then you introduce the developer. The developer then hits the film more evenly and gradually, development is even, and the dark lines are eliminated. (PS: You seem to have bright lines as well as dark lines, but my guess is that “light” is just how “un-dark” appears when you are dealing with a number of very subtle dark streaks. It is basically the same problem: uneven development.) Since you do have your own darkroom, I would encourage you to go the extra step of doing your own film developing. It is simple, and gives you full control over the process. If you keep relying on the lab, while expecting perfection, then you can also expect headaches like this to continue! Good luck! Edited January 15, 2019 by M9reno", "link": "https://www.l-camera-forum.com/topic/293264-yet-another-what-might-have-caused-this-thread/?tab=comments#comment-3664756", "origin": "L-forum", "suborigin": "293264-yet-another-what-might-have-caused-this-thread", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i have seen subtle dark lines like this on my own photos in the past. they are visible in the sky, but actually on closer inspection can appear anywhere on the negative as *light streaks*. because they look like dark streaks on the final printed or scanned image, they are just more easily visible in lighter parts of the picture like the sky. in my case it was uneven first contact with the developer that was responsible. -----> i !!!  -----> develop !!!  inside a rotating drum, and maybe your lab is doing the same. the mark is the trail left by the developer as it slides down part of the film on first contact with it. the solution is to wet the film (pre-wash) before development. you pour water into the drum, and after a few rotations dump the water. then you introduce the developer. the developer then hits the film more evenly and gradually, development is even, and the dark lines are eliminated. (ps: you seem to have bright lines as well as dark lines, but my guess is that “light” is just how “un-dark” appears when you are dealing with a number of very subtle dark streaks. it is basically the same problem: uneven development.) since you do have your own darkroom, i would encourage you to go the extra step of doing your own film developing. it is simple, and gives you full control over the process. if you keep relying on the lab, while expecting perfection, then you can also expect headaches like this to continue! good luck! edited january 15, 2019 by m9reno", "sortedWord": "None", "Identifyer": null, "identifyer": 103353, "year": "2019"}, {"autor": "logan2z", "date": "2019-01-15 13:23:00", "content": " 5 hours ago, M9reno said: I have seen subtle dark lines like this on my own photos in the past. They are visible in the sky, but actually on closer inspection can appear anywhere on the negative as *light streaks*. Because they look like dark streaks on the final printed or scanned image, they are just more easily visible in lighter parts of the picture like the sky. In my case it was uneven first contact with the developer that was responsible. I develop inside a rotating drum, and maybe your lab is doing the same. The mark is the trail left by the developer as it slides down part of the film on first contact with it. The solution is to wet the film (pre-wash) before development. You pour water into the drum, and after a few rotations dump the water. Then you introduce the developer. The developer then hits the film more evenly and gradually, development is even, and the dark lines are eliminated. (PS: You seem to have bright lines as well as dark lines, but my guess is that “light” is just how “un-dark” appears when you are dealing with a number of very subtle dark streaks. It is basically the same problem: uneven development.) Since you do have your own darkroom, I would encourage you to go the extra step of doing your own film developing. It is simple, and gives you full control over the process. If you keep relying on the lab, while expecting perfection, then you can also expect headaches like this to continue! Good luck! Thanks for your thoughts. It's subtle, but I see more of a band than a single line, but maybe it's my eyes playing tricks on me. I recently switched labs because the previous one kept messing up my film so hoping this isn't a development problem, but it very well could be. I keep telling myself that I'm going to start developing my own film, but, given all of the potential pitfalls, have this false sense of security using a professional lab. But perhaps it's finally time to give it a go.", "link": "https://www.l-camera-forum.com/topic/293264-yet-another-what-might-have-caused-this-thread/?tab=comments#comment-3664891", "origin": "L-forum", "suborigin": "293264-yet-another-what-might-have-caused-this-thread", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": " 5 hours ago, m9reno said: i have seen subtle dark lines like this on my own photos in the past. they are visible in the sky, but actually on closer inspection can appear anywhere on the negative as *light streaks*. because they look like dark streaks on the final printed or scanned image, they are just more easily visible in lighter parts of the picture like the sky. in my case it was uneven first contact with the developer that was responsible. -----> i !!!  -----> develop !!!  inside a rotating drum, and maybe your lab is doing the same. the mark is the trail left by the developer as it slides down part of the film on first contact with it. the solution is to wet the film (pre-wash) before development. you pour water into the drum, and after a few rotations dump the water. then you introduce the developer. the developer then hits the film more evenly and gradually, development is even, and the dark lines are eliminated. (ps: you seem to have bright lines as well as dark lines, but my guess is that “light” is just how “un-dark” appears when you are dealing with a number of very subtle dark streaks. it is basically the same problem: uneven development.) since you do have your own darkroom, i would encourage you to go the extra step of doing your own film developing. it is simple, and gives you full control over the process. if you keep relying on the lab, while expecting perfection, then you can also expect headaches like this to continue! good luck! thanks for your thoughts. it's subtle, but i see more of a band than a single line, but maybe it's my eyes playing tricks on me. i recently switched labs because the previous one kept messing up my film so hoping this isn't a development problem, but it very well could be. i keep telling myself that i'm going to start developing my own film, but, given all of the potential pitfalls, have this false sense of security using a professional lab. but perhaps it's finally time to give it a go.", "sortedWord": "None", "Identifyer": null, "identifyer": 103354, "year": "2019"}, {"autor": "Xícara de Café", "date": "2019-08-13 12:13:00", "content": "Thanks very much everyone. I've just ordered a litre of Ilfotol. I couldn't find Photo Flo here. While I use a non-coloured and non-perfumed type of detergent, it could well be the cause of the problem. I have a 2-reel (35mm) Paterson tank. Usually i economise if I'm developing 1 neg by adding 300ml of developer and doing a gentle \"twiddle\" style agitation. Then for stop and fix I use 600ml of each and do inversions/rotations with the cap on to agitate. With both developer and fixer: continuous agitation for first 30sec then a 5sec agitation every following 30sec. My 5sec agitation with fixer (or when developing 2 negs with the cap on) involves two fluid inversions simultaneously rotating the tank. That was how i remember reading Adam's method in \"the negative\". I don't think there's any residual detergent on my tank and reels (no foaming, except after the last detergent step), but i'll give them a good soak and dry before using it again. Will also try Stuart's suggestion of increasing the developer volume to 600ml to see if that helps. All the best! Edited August 13, 2019 by Xícara de Café", "link": "https://www.l-camera-forum.com/topic/300211-trouble-washing-negatives/?tab=comments#comment-3796704", "origin": "L-forum", "suborigin": "300211-trouble-washing-negatives", "result": true, "Selector": "i'm developing", "selectorShort": "develop", "MarkedSent": "thanks very much everyone. i've just ordered a litre of ilfotol. i couldn't find photo flo here. while i use a non-coloured and non-perfumed type of detergent, it could well be the cause of the problem. i have a 2-reel (35mm) paterson tank. usually -----> i !!!  economise if -----> i !!! 'm -----> developing !!!  1 neg by adding 300ml of developer and doing a gentle \"twiddle\" style agitation. then for stop and fix i use 600ml of each and do inversions/rotations with the cap on to agitate. with both developer and fixer: continuous agitation for first 30sec then a 5sec agitation every following 30sec. my 5sec agitation with fixer (or when developing 2 negs with the cap on) involves two fluid inversions simultaneously rotating the tank. that was how i remember reading adam's method in \"the negative\". i don't think there's any residual detergent on my tank and reels (no foaming, except after the last detergent step), but i'll give them a good soak and dry before using it again. will also try stuart's suggestion of increasing the developer volume to 600ml to see if that helps. all the best! edited august 13, 2019 by xícara de café", "sortedWord": "None", "Identifyer": null, "identifyer": 104709, "year": "2019"}, {"autor": "mdp", "date": "2019-08-14 14:18:00", "content": "Here's the Ektar example, cropped. Developed with new Tetenal C41 chemicals... --img-- ", "link": "https://www.l-camera-forum.com/topic/300299-white-spots-on-negatives-help-please/?tab=comments#comment-3797546", "origin": "L-forum", "suborigin": "300299-white-spots-on-negatives-help-please", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "here's the ektar example, cropped. -----> developed !!!  with new tetenal c41 chemicals... --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 105048, "year": "2019"}, {"autor": "mdp", "date": "2019-08-15 22:03:00", "content": "56 minutes ago, Richardgb said: So, you're getting white marks on both b/w and colour negs an both are scanned to show here? Are you sure it's not the scanner or something on the film? Its definitely not the scanner, I'm pretty sure it's the film during processing. I've wiped the negatives and there are marks on the film. I looked at the bleach/fix for the colour I used, and although it was newly mixed, it had a lot of bits in it, so I filtered it. I'll also filter the water the next time I develop b&w.", "link": "https://www.l-camera-forum.com/topic/300299-white-spots-on-negatives-help-please/?tab=comments#comment-3798597", "origin": "L-forum", "suborigin": "300299-white-spots-on-negatives-help-please", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "56 minutes ago, richardgb said: so, you're getting white marks on both b/w and colour negs an both are scanned to show here? are you sure it's not the scanner or something on the film? its definitely not the scanner, i'm pretty sure it's the film during processing. i've wiped the negatives and there are marks on the film. i looked at the bleach/fix for the colour i used, and although it was newly mixed, it had a lot of bits in it, so i filtered it. -----> i !!! 'll also filter the water the next time -----> i !!!  -----> develop !!!  b&w.", "sortedWord": "None", "Identifyer": null, "identifyer": 105058, "year": "2019"}, {"autor": "kkcsm", "date": "2019-07-02 03:35:00", "content": " I’m pretty new to home developing. I’ve been sticking to massive dev chart times. My question for you experts: Is the time for stop bath and fixing critical? Developing time and temp is critical as there is a chemical reaction that can go too far or not far enough. However, once something is stopped or fixed, it cannot be more stopped or more fixed. Can I be a bit sloppy with those steps wrt increasing time? Or can film be over stopped or over fixed? -K", "link": "https://www.l-camera-forum.com/topic/298872-stop-and-fix-time/?tab=comments#comment-3770163", "origin": "L-forum", "suborigin": "298872-stop-and-fix-time", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": " i’m pretty new to home developing. i’ve been sticking to massive dev chart times. my question for you experts: is the time for stop bath and fixing critical? -----> developing !!!  time and temp is critical as there is a chemical reaction that can go too far or not far enough. however, once something is stopped or fixed, it cannot be more stopped or more fixed. can i be a bit sloppy with those steps wrt increasing time? or can film be over stopped or over fixed? -k", "sortedWord": "None", "Identifyer": null, "identifyer": 105066, "year": "2019"}, {"autor": "kkcsm", "date": "2019-07-18 03:29:00", "content": "I just took the temperature of some distilled water stored next to my chemicals, 20c. So, fine if I’m developing there. But if I’m developing at 24c, what is the effect of stopping and fixing at 20c? Or increasing the stop and fix time a few percent to compensate? Or increasing stop and fix time because I’ve used those chemicals 6 or 8 times previously?", "link": "https://www.l-camera-forum.com/topic/298872-stop-and-fix-time/?tab=comments#comment-3780571", "origin": "L-forum", "suborigin": "298872-stop-and-fix-time", "result": true, "Selector": "i’m developing", "selectorShort": "develop", "MarkedSent": "i just took the temperature of some distilled water stored next to my chemicals, 20c. so, fine if -----> i !!! ’m -----> developing !!!  there. but if i’m developing at 24c, what is the effect of stopping and fixing at 20c? or increasing the stop and fix time a few percent to compensate? or increasing stop and fix time because i’ve used those chemicals 6 or 8 times previously?", "sortedWord": "None", "Identifyer": null, "identifyer": 105073, "year": "2019"}, {"autor": "Nick_S", "date": "2019-07-29 20:56:00", "content": "You could try mixing the processing solutions from the raw chemicals. I recently picked up a like-new copy of the book Jacobson, C. I., and Jacobson, R.E. (1976). Developing: The Negative Technique. 18th Revised Edition. Focal Press, from my local Oxfam shop. It reproduces substitute formulae and processing procedures for Kodak C41 chemistry from BJP Annual (1975): colour negative developer; stop-bath for colour negative films; bleach-baths for colour negative films and fixing bath for colour negative films. Edited July 29, 2019 by Nick_S", "link": "https://www.l-camera-forum.com/topic/299543-c41-colour-film-developer/?tab=comments#comment-3787450", "origin": "L-forum", "suborigin": "299543-c41-colour-film-developer", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "you could try mixing the processing solutions from the raw chemicals. i recently picked up a like-new copy of the book jacobson, c. i., and jacobson, r.e. (1976). -----> developing !!! : the negative technique. 18th revised edition. focal press, from my local oxfam shop. it reproduces substitute formulae and processing procedures for kodak c41 chemistry from bjp annual (1975): colour negative developer; stop-bath for colour negative films; bleach-baths for colour negative films and fixing bath for colour negative films. edited july 29, 2019 by nick_s", "sortedWord": "None", "Identifyer": null, "identifyer": 105209, "year": "2019"}, {"autor": "Ko.Fe.", "date": "2019-10-31 12:08:00", "content": "I like Leica colour more. And I don’t like Superia, which I develop at home. I like Kodak Gold. BW module seems to make bw more natural.", "link": "https://www.l-camera-forum.com/topic/302444-homemade-method-of-simulating-film-with-leica-m9-testers-feedback-welcome/page/3/?tab=comments#comment-3845206", "origin": "L-forum", "suborigin": "302444-homemade-method-of-simulating-film-with-leica-m9-testers-feedback-welcome", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i like leica colour more. and -----> i !!!  don’t like superia, which -----> i !!!  -----> develop !!!  at home. i like kodak gold. bw module seems to make bw more natural.", "sortedWord": "None", "Identifyer": null, "identifyer": 110136, "year": "2019"}, {"autor": "camalogica", "date": "2019-10-31 14:10:00", "content": "2 hours ago, Ko.Fe. said: I like Leica colour more. And I don’t like Superia, which I develop at home. I like Kodak Gold. BW module seems to make bw more natural. Thanks for your comments!", "link": "https://www.l-camera-forum.com/topic/302444-homemade-method-of-simulating-film-with-leica-m9-testers-feedback-welcome/page/3/?tab=comments#comment-3845262", "origin": "L-forum", "suborigin": "302444-homemade-method-of-simulating-film-with-leica-m9-testers-feedback-welcome", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "2 hours ago, ko.fe. said: i like leica colour more. and -----> i !!!  don’t like superia, which -----> i !!!  -----> develop !!!  at home. i like kodak gold. bw module seems to make bw more natural. thanks for your comments!", "sortedWord": "None", "Identifyer": null, "identifyer": 110137, "year": "2019"}, {"autor": "camalogica", "date": "2019-12-09 10:17:00", "content": "14 hours ago, JonPB said: ISO series with TriX 400 simulation. This is a Capture One 9 screen shot showing ISO 200, 400, 800, and 1600 shot thumbnails (a) SOOC JPEG (with medium-high contrast), (b) with the DNG -> m9tofilm -> TIFF -> inverted, and (c) as 'b' plus auto-levels. Shutter speeds were set by the camera and formed an expected progression of 1/45, 1/90, 1/180, and 1/360. Shooting at a lower ISO does not seem to hurt anything, although there is less shadow detail (hard to see here). Shooting at a higher ISO definitely compresses the results into a narrower slice, and while a lot of information can be retained there is still a lot of loss here. My takeaway: shooting at the ISO expected by the program is worthwhile. Hi, I like all your testings and your conclusions about the program As said before, all the chemical simulation is done for the native film ISO. So, for TriX 400, ISO 400 should be always used to get the closest thing to the reality. (Since all the simulation calculations done for film behaviour were precalculated using this params). It's true that it's possible to push the image (+/-3 stops in camera) and then, at developing time, push the image the same number of stops. Only note that if using -autodevelop, this won't be optimal. My workflow for TriX400 is the following: 1. Shoot the DNG at ISO 400 pushed +/- 3 stops (or not). 2. Develop using: m9tofilm.exe -i \"E:\\DATA\\LeicaM9\\dng\\160\\02_CABANAL\" -o \"F:\\DEV\\output\" -f trix400 -frame false 3. Develop using Silverfast HDR (https://www.silverfast.com/show/silverfast-hdr/en.html) 4. Final adjustments using Lightroom Anyways, thank you very much for testing with so much detail!! Im really glad you like the output of the program 🙂", "link": "https://www.l-camera-forum.com/topic/302444-homemade-method-of-simulating-film-with-leica-m9-testers-feedback-welcome/page/4/?tab=comments#comment-3870137", "origin": "L-forum", "suborigin": "302444-homemade-method-of-simulating-film-with-leica-m9-testers-feedback-welcome", "result": true, "Selector": "develop", "selectorShort": "develop", "MarkedSent": "14 hours ago, jonpb said: iso series with trix 400 simulation. this is a capture one 9 screen shot showing iso 200, 400, 800, and 1600 shot thumbnails (a) sooc jpeg (with medium-high contrast), (b) with the dng -> m9tofilm -> tiff -> inverted, and (c) as 'b' plus auto-levels. shutter speeds were set by the camera and formed an expected progression of 1/45, 1/90, 1/180, and 1/360. shooting at a lower iso does not seem to hurt anything, although there is less shadow detail (hard to see here). shooting at a higher iso definitely compresses the results into a narrower slice, and while a lot of information can be retained there is still a lot of loss here. my takeaway: shooting at the iso expected by the program is worthwhile. hi, i like all your testings and your conclusions about the program as said before, all the chemical simulation is done for the native film iso. so, for trix 400, iso 400 should be always used to get the closest thing to the reality. (since all the simulation calculations done for film behaviour were precalculated using this params). it's true that it's possible to push the image (+/-3 stops in camera) and then, at developing time, push the image the same number of stops. only note that if using -autodevelop, this won't be optimal. my workflow for trix400 is the following: 1. shoot the dng at iso 400 pushed +/- 3 stops (or not). 2. -----> develop !!!  using: m9tofilm.exe -i \"e:\\data\\leicam9\\dng\\160\\02_cabanal\" -o \"f:\\dev\\output\" -f trix400 -frame false 3. develop using silverfast hdr (https://www.silverfast.com/show/silverfast-hdr/en.html) 4. final adjustments using lightroom anyways, thank you very much for testing with so much detail!! im really glad you like the output of the program 🙂", "sortedWord": "None", "Identifyer": null, "identifyer": 110151, "year": "2019"}, {"autor": "ramarren", "date": "2019-12-16 01:36:00", "content": "In looking for an LR replacement, I decided to try On1 Photo RAW 2020. I've now been through all of the foundation course videos for On1 Photo RAW 2020. The software impresses me in many ways, but irritates me in others. The courseware is not particularly good ... It has little sense, to me, of building on the fundamentals and expanding your understanding of 1) how the app operates and 2) how to use it effectively in a good workflow ... It's too much \"Oh and you can do this this way and it's really cool\" rather than \"here's what this does, and after you do that try this or that to get to the next step...\" The toolset is scattered (literally) all around the UI and not well organized in flow or order of use. I have spent a lot of time trying to remember which edge of the window to look at to find the next tool I need to use. Etc. The long and the short of it is that I think it's a decent app but I'm not thrilled with the UI, the tutorials, or the workflow at this point, after four days of study and practice. It's not by any means intuitive or simple to get a simple task done. It seems to make some difficult tasks a bit easier if you're willing to forgo actually understanding the details and just slap a \"style\" on, then tweak that until you get something you like. But that's not the way I tend to work. I develop my own 'styles' from first rendering principles, and I need to understand how the app works in terms of where it's storing its information and what it's doing to my files. The long and the short of it is that while I don't think On1 was wasted money, it's not getting the job I need done. Time to move on to the next contender and see whether it does me better. Meanwhile, I actually have a couple of projects that need to be done now. I guess I can use Lightroom Classic for a couple of months and see whether it still works the way I expect. Of course, Adobe will do their damnedest to try to pull me into their Creative Cloud thing, which I have no use for whatever. LR Classic should allow me to ignore CC entirely, but I have to pay $10 every month for the boon of using it. Sigh. I enjoy the challenge of all this, but there comes a point where I just want to my work done and stop futzing about with awkward tools. LR perpetual license did that for me for a very long time... It's a shame Adobe just can't leave it well enough to alone. G", "link": "https://www.l-camera-forum.com/topic/304357-lightroom-v67-perpetual-where-to-go-from-here-don%E2%80%99t-want-subscription-adobe-cc/?tab=comments#comment-3874060", "origin": "L-forum", "suborigin": "304357-lightroom-v67-perpetual-where-to-go-from-here-don%E2%80%99t-want-subscription-adobe-cc", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "in looking for an lr replacement, i decided to try on1 photo raw 2020. i've now been through all of the foundation course videos for on1 photo raw 2020. the software impresses me in many ways, but irritates me in others. the courseware is not particularly good ... it has little sense, to me, of building on the fundamentals and expanding your understanding of 1) how the app operates and 2) how to use it effectively in a good workflow ... it's too much \"oh and you can do this this way and it's really cool\" rather than \"here's what this does, and after you do that try this or that to get to the next step...\" the toolset is scattered (literally) all around the ui and not well organized in flow or order of use. i have spent a lot of time trying to remember which edge of the window to look at to find the next tool i need to use. etc. the long and the short of it is that i think it's a decent app but i'm not thrilled with the ui, the tutorials, or the workflow at this point, after four days of study and practice. it's not by any means intuitive or simple to get a simple task done. it seems to make some difficult tasks a bit easier if you're willing to forgo actually understanding the details and just slap a \"style\" on, then tweak that until you get something you like. but that's not the way i tend to work. -----> i !!!  -----> develop !!!  my own 'styles' from first rendering principles, and -----> i !!!  need to understand how the app works in terms of where it's storing its information and what it's doing to my files. the long and the short of it is that while i don't think on1 was wasted money, it's not getting the job i need done. time to move on to the next contender and see whether it does me better. meanwhile, i actually have a couple of projects that need to be done now. i guess i can use lightroom classic for a couple of months and see whether it still works the way i expect. of course, adobe will do their damnedest to try to pull me into their creative cloud thing, which i have no use for whatever. lr classic should allow me to ignore cc entirely, but i have to pay $10 every month for the boon of using it. sigh. i enjoy the challenge of all this, but there comes a point where i just want to my work done and stop futzing about with awkward tools. lr perpetual license did that for me for a very long time... it's a shame adobe just can't leave it well enough to alone. g", "sortedWord": "None", "Identifyer": null, "identifyer": 112347, "year": "2019"}, {"autor": "eev776", "date": "2019-12-23 12:00:00", "content": " After importing my photos to Lightroom what I see in a camera Embedded preview is looks fantastic to me, but when I switch to Develop DNG's my images appear very far from what it looks in Embedded preview. To solve this issue I'm trying to get a correct color profile for Leica CL. Anybody knows how to install Leca CL color profile and where to get one for Lightroom 2019? Thanks! --img--  Edited December 23, 2019 by eev776", "link": "https://www.l-camera-forum.com/topic/304673-lightroom-color-profiles-for-leica-cl-where-to-get-and-how-to-install/?tab=comments#comment-3878204", "origin": "L-forum", "suborigin": "304673-lightroom-color-profiles-for-leica-cl-where-to-get-and-how-to-install", "result": true, "Selector": "i switch to develop", "selectorShort": "develop", "MarkedSent": " after importing my photos -----> to !!!  lightroom what -----> i !!!  see in a camera embedded preview is looks fantastic -----> to !!!  me, but when -----> i !!!  -----> switch !!!  -----> to !!!  -----> develop !!!  dng's my images appear very far from what it looks in embedded preview. to solve this issue i'm trying to get a correct color profile for leica cl. anybody knows how to install leca cl color profile and where to get one for lightroom 2019? thanks! --img--  edited december 23, 2019 by eev776", "sortedWord": "None", "Identifyer": null, "identifyer": 112410, "year": "2019"}, {"autor": "jaapv", "date": "2019-12-23 13:42:00", "content": "1 hour ago, eev776 said: After importing my photos to Lightroom what I see in a camera Embedded preview is looks fantastic to me, but when I switch to Develop DNG's my images appear very far from what it looks in Embedded preview. To solve this issue I'm trying to get a correct color profile for Leica CL. Anybody knows how to install Leca CL color profile and where to get one for Lightroom 2019? Thanks! --img--  You can make your own, easily, see Frame-it's post above, but you can also tweak the image to your liking and save that as default. As for your example - a sunset is always completely inaccurate, whatever profile you use. You may like the left-hand one, but the right-hand one is probably closer to what the camera saw. Judge colour in \"normal\" light.", "link": "https://www.l-camera-forum.com/topic/304673-lightroom-color-profiles-for-leica-cl-where-to-get-and-how-to-install/?tab=comments#comment-3878254", "origin": "L-forum", "suborigin": "304673-lightroom-color-profiles-for-leica-cl-where-to-get-and-how-to-install", "result": true, "Selector": "i switch to develop", "selectorShort": "develop", "MarkedSent": "1 hour ago, eev776 said: after importing my photos -----> to !!!  lightroom what -----> i !!!  see in a camera embedded preview is looks fantastic -----> to !!!  me, but when -----> i !!!  -----> switch !!!  -----> to !!!  -----> develop !!!  dng's my images appear very far from what it looks in embedded preview. to solve this issue i'm trying to get a correct color profile for leica cl. anybody knows how to install leca cl color profile and where to get one for lightroom 2019? thanks! --img--  you can make your own, easily, see frame-it's post above, but you can also tweak the image to your liking and save that as default. as for your example - a sunset is always completely inaccurate, whatever profile you use. you may like the left-hand one, but the right-hand one is probably closer to what the camera saw. judge colour in \"normal\" light.", "sortedWord": "None", "Identifyer": null, "identifyer": 112413, "year": "2019"}, {"autor": "ramarren", "date": "2019-10-10 15:21:00", "content": "5 minutes ago, rob_w said: ... When you configure your Catalina machine what image processing software do you plan to use? I've been working with On1, Luminar, and RAW Power as LR replacements. I also have Affinity Photo, which is more a PS replacement. In terms of what fits my uses best, I'm not yet decided which is \"best\" but the notion of using RAW Power as a processing enhancement to Photos, and using Photos to do my overall image management stuff, is fairly appealing at present. And the fact that there are versions to run on iOS, iPadOS, and macOS means one system on all my devices. That's where my thinking is at present, anyway. I'm still developing the strategy. G", "link": "https://www.l-camera-forum.com/topic/300297-lightroom-perpetual-licence-and-macos-catalina/page/2/?tab=comments#comment-3833993", "origin": "L-forum", "suborigin": "300297-lightroom-perpetual-licence-and-macos-catalina", "result": true, "Selector": "i'm still developing", "selectorShort": "develop", "MarkedSent": "5 minutes ago, rob_w said: ... when you configure your catalina machine what image processing software do you plan to use? i've been working with on1, luminar, and raw power as lr replacements. i also have affinity photo, which is more a ps replacement. in terms of what fits my uses best, i'm not yet decided which is \"best\" but the notion of using raw power as a processing enhancement to photos, and using photos to do my overall image management stuff, is fairly appealing at present. and the fact that there are versions to run on ios, ipados, and macos means one system on all my devices. that's where my thinking is at present, anyway. -----> i !!! 'm -----> still !!!  -----> developing !!!  the strategy. g", "sortedWord": "None", "Identifyer": null, "identifyer": 112635, "year": "2019"}, {"autor": "ianman", "date": "2019-01-03 14:51:00", "content": "13 minutes ago, Simone_DF said: I work in IT and believe me, there no such thing as a software without bugs.﻿ I have been developing software in one form or another since school (in the 1980's on an Apple II), so yes I know full well that bug free software is the holy grail. However where I work, we would never use users, paying or otherwise, as guinea pigs. We have pride in our work, I know this has become rare but there are still pockets of it in existence. 13 minutes ago, Simone_DF said: And FYI the new features are not \"unusable\". Need improvements? Oh yes. Unusable? No.﻿ If the application crashes when I select a tool, it's unusable. Full stop (no pun intended). 13 minutes ago, Simone_DF said: Hello, welcome to planet Earth, year 2019.﻿ As you missed it completely, this was precisely my point... It seems to have become the norm on planet Earth, year 2019 for companies seem to rush out under par, unstable, unusable products. Wake up!!", "link": "https://www.l-camera-forum.com/topic/292401-luminar-3-vs-captureone-12/page/2/?tab=comments#comment-3657741", "origin": "L-forum", "suborigin": "292401-luminar-3-vs-captureone-12", "result": true, "Selector": "i have been developing", "selectorShort": "develop", "MarkedSent": "13 minutes ago, simone_df said: -----> i !!!  work in it and believe me, there no such thing as a software without bugs.﻿ -----> i !!!  -----> have !!!  -----> been !!!  -----> developing !!!  software in one form or another since school (in the 1980's on an apple ii), so yes i know full well that bug free software is the holy grail. however where i work, we would never use users, paying or otherwise, as guinea pigs. we have pride in our work, i know this has become rare but there are still pockets of it in existence. 13 minutes ago, simone_df said: and fyi the new features are not \"unusable\". need improvements? oh yes. unusable? no.﻿ if the application crashes when i select a tool, it's unusable. full stop (no pun intended). 13 minutes ago, simone_df said: hello, welcome to planet earth, year 2019.﻿ as you missed it completely, this was precisely my point... it seems to have become the norm on planet earth, year 2019 for companies seem to rush out under par, unstable, unusable products. wake up!!", "sortedWord": "None", "Identifyer": null, "identifyer": 112722, "year": "2019"}, {"autor": "Simone_DF", "date": "2019-01-07 10:46:00", "content": "On 1/3/2019 at 2:51 PM, ianman said: I have been developing software in one form or another since school (in the 1980's on an Apple II), so yes I know full well that bug free software is the holy grail. However where I work, we would never use users, paying or otherwise, as guinea pigs. We have pride in our work, I know this has become rare but there are still pockets of it in existence. If the application crashes when I select a tool, it's unusable. Full stop (no pun intended). As you missed it completely, this was precisely my point... It seems to have become the norm on planet Earth, year 2019 for companies seem to rush out under par, unstable, unusable products. Wake up!! Unfortunately, releasing untested software or with known issues is becoming more and more the norm, just look at last October's Microsoft update fiasco. The whole videogame sector is plagued by this issue, too. I never buy or even use first releases, I always wait for a few upgrades. That goes for hardware too, always wait for first revision.", "link": "https://www.l-camera-forum.com/topic/292401-luminar-3-vs-captureone-12/page/2/?tab=comments#comment-3660146", "origin": "L-forum", "suborigin": "292401-luminar-3-vs-captureone-12", "result": true, "Selector": "i have been developing", "selectorShort": "develop", "MarkedSent": "on 1/3/2019 at 2:51 pm, ianman said: -----> i !!!  -----> have !!!  -----> been !!!  -----> developing !!!  software in one form or another since school (in the 1980's on an apple ii), so yes i know full well that bug free software is the holy grail. however where i work, we would never use users, paying or otherwise, as guinea pigs. we have pride in our work, i know this has become rare but there are still pockets of it in existence. if the application crashes when i select a tool, it's unusable. full stop (no pun intended). as you missed it completely, this was precisely my point... it seems to have become the norm on planet earth, year 2019 for companies seem to rush out under par, unstable, unusable products. wake up!! unfortunately, releasing untested software or with known issues is becoming more and more the norm, just look at last october's microsoft update fiasco. the whole videogame sector is plagued by this issue, too. i never buy or even use first releases, i always wait for a few upgrades. that goes for hardware too, always wait for first revision.", "sortedWord": "None", "Identifyer": null, "identifyer": 112729, "year": "2019"}, {"autor": "Nowhereman", "date": "2019-08-19 10:11:00", "content": " I don't find govindkumar's review useful: it's more of a listing of features than a review and the fact that the article contains repeated offers (advertisements, that is) with coupons for the purchase of Luminar does not add to its credibility. The example pictures of \"before\" and \"after\" applying Luminar edits are the same type of pitch that you find on the Luminar website. There is no real comparison to Lightroom or other software in this respect. I've just spent about a half an hour — not enough for a real evaluation — reprocessing with Luminar Flex some M10 DNG files into somewhat high-contrast B&W — and find it difficult to get to a look I like that I got with Silver Efex. Actually, I used some \"formulas\" in AnalogEfex and ColorEfex (for B&W) that I've developed to get the type of look that I want. That it to say, for these particular looks, I find it easier (quicker) to get to than in SilverEfex, although the latter can get me there as well. I spent also spent another half an hour reprocessing color images in Luminar Flex. I found that, consistently, I couldn't get a look as good as I get with several presets/plugins that I get in Lightroom. Maybe I could get there if a spent a lot more time than I had used in my original edits. The \"inventive new ways of working\" in Luminar don't do much for me, despite the slick interface. There's a lot I don't like about the Adobe subscription model, but I don't see Luminar as a replacement for Lightroom Classic. I hasten to say that I start with a mistrust of Luminar because a couple of years ago I tried out some modules of the predecessor MacPhun app: I used the MacPhun Intensification module on some color images in an attempt at selective edits of parts of the images. The problem was that the resulting processed images had applied to a much larger, and even different areas, of the images than I had selected in the MacPhun view. When I wrote to MacPhun they conceded that this was a problem that would be fixed in the next update. But that update still had not fixed the problem. Generally, it's difficult to find useful reviews of image editing software or of VSCO-type presets of plugins: most of seems to be written by shills. I'm not saying that this is the case of govindkumar, but the coupons don't help and the review is not particularly useful. In the end, these are things one has to try for oneself.", "link": "https://www.l-camera-forum.com/topic/292401-luminar-3-vs-captureone-12/page/3/?tab=comments#comment-3801117", "origin": "L-forum", "suborigin": "292401-luminar-3-vs-captureone-12", "result": true, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": " i don't find govindkumar's review useful: it's more of a listing of features than a review and the fact that the article contains repeated offers (advertisements, that is) with coupons for the purchase of luminar does not add to its credibility. the example pictures of \"before\" and \"after\" applying luminar edits are the same type of pitch that you find on the luminar website. there is no real comparison to lightroom or other software in this respect. i've just spent about a half an hour — not enough for a real evaluation — reprocessing with luminar flex some m10 dng files into somewhat high-contrast b&w — and find it difficult to get to a look i like that i got with silver efex. actually, -----> i !!!  used some \"formulas\" in analogefex and colorefex (for b&w) that -----> i !!! 've -----> developed !!!  to get the type of look that -----> i !!!  want. that it to say, for these particular looks, i find it easier (quicker) to get to than in silverefex, although the latter can get me there as well. i spent also spent another half an hour reprocessing color images in luminar flex. i found that, consistently, i couldn't get a look as good as i get with several presets/plugins that i get in lightroom. maybe i could get there if a spent a lot more time than i had used in my original edits. the \"inventive new ways of working\" in luminar don't do much for me, despite the slick interface. there's a lot i don't like about the adobe subscription model, but i don't see luminar as a replacement for lightroom classic. i hasten to say that i start with a mistrust of luminar because a couple of years ago i tried out some modules of the predecessor macphun app: i used the macphun intensification module on some color images in an attempt at selective edits of parts of the images. the problem was that the resulting processed images had applied to a much larger, and even different areas, of the images than i had selected in the macphun view. when i wrote to macphun they conceded that this was a problem that would be fixed in the next update. but that update still had not fixed the problem. generally, it's difficult to find useful reviews of image editing software or of vsco-type presets of plugins: most of seems to be written by shills. i'm not saying that this is the case of govindkumar, but the coupons don't help and the review is not particularly useful. in the end, these are things one has to try for oneself.", "sortedWord": "None", "Identifyer": null, "identifyer": 112738, "year": "2019"}, {"autor": "Per P.", "date": "2019-09-17 21:39:00", "content": "In response to the original question: On longer trips I bring a small macbook with an external drive and Lightroom Classic with relevant presets installed. As a minimum I import to the drive as a backup. Usually I also do an iterative culling to end with selects for development. When time permits I will develop and maybe even keyword those selects. When home I load everything into the main catalog, check if any masterpieces were overlooked, review development settings, and cull rejects. The developed photos are now ready for an album, sending/posting, printing, etc.", "link": "https://www.l-camera-forum.com/topic/300319-edit-on-the-go-or-wait-to-get-home/page/6/?tab=comments#comment-3821935", "origin": "L-forum", "suborigin": "300319-edit-on-the-go-or-wait-to-get-home", "result": true, "Selector": "i will develop", "selectorShort": "develop", "MarkedSent": "in response to the original question: on longer trips i bring a small macbook with an external drive and lightroom classic with relevant presets installed. as a minimum i import to the drive as a backup. usually i also do an iterative culling to end with selects for development. when time permits -----> i !!!  -----> will !!!  -----> develop !!!  and maybe even keyword those selects. when home i load everything into the main catalog, check if any masterpieces were overlooked, review development settings, and cull rejects. the developed photos are now ready for an album, sending/posting, printing, etc.", "sortedWord": "None", "Identifyer": null, "identifyer": 113015, "year": "2019"}, {"autor": "Keith (M)", "date": "2019-02-22 12:31:00", "content": "Interesting about spacing. Just had a check of a roll of Tri-X I developed yesterday from my M7, on which I had used 35, 50 and 135mm lenses. The frame spacing is entirely consistent. Hope a new M-A is provided asap!", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/?tab=comments#comment-3688870", "origin": "L-forum", "suborigin": "294513-leica-m-a-problem", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "just had a check of a -----> roll !!!  of tri-x i developed yesterday from my m7, on which i had used 35, 50 and 135mm lenses.", "sortedWord": "roll", "Identifyer": null, "identifyer": 2730, "year": "2019"}, {"autor": "Paul Robinson", "date": "2019-02-22 13:41:00", "content": "1 hour ago, Keith (M) said: Interesting about spacing. Just had a check of a roll of Tri-X I developed yesterday from my M7, on which I had used 35, 50 and 135mm lenses. The frame spacing is entirely consistent. Hope a new M-A is provided asap! Thanks Keith, I found the spacing on my M7 to be just perfect giving a distinctive and consistent distance between the frames. Easy to differentiate making them easy to cut into strips. Regards, Paul", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/?tab=comments#comment-3688901", "origin": "L-forum", "suborigin": "294513-leica-m-a-problem", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "just had a check of a -----> roll !!!  of tri-x i developed yesterday from my m7, on which i had used 35, 50 and 135mm lenses.", "sortedWord": "roll", "Identifyer": null, "identifyer": 2734, "year": "2019"}, {"autor": "Edgar1920", "date": "2019-02-22 22:21:00", "content": "Hi guys One evidence of irregular film transport is if the cuts between the frames do not have the same position related to the perforation. If the camera works properly the cut is always in the middle between two holes. I develop an cut my films at home and never had to cut across a hole, regardless if the film was taken with a M body (1955-2011) or one of my Leica III bodies (1934). As far as I know the position between two frames is already defined like this since Barnack’s first prototype and has never been changed. The reason is that it is easier to handle the film strips if they are not cut across the hole. I do not know the exact perforation pitch (Kodak’s price list for bulk film indicates the perforation) but it should be something that the frame advance will be around 39mm. Btw: when I developed my first roll after using my 21mm Super-Angulon for the first time I was surprised of the reduced spacing. And as I changed lenses several times the spacing between two frames was irregular. Exactly as a.noctilux wrote. But as the cuts were always between tho holes I realized that the film advance mechanism is still working fine. Best regards. Frank", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/?tab=comments#comment-3689138", "origin": "L-forum", "suborigin": "294513-leica-m-a-problem", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop an cut my -----> films !!!  at home and never had to cut across a hole, regardless if the film was taken with a m body (1955-2011) or one of my leica iii bodies (1934).", "sortedWord": "film", "Identifyer": null, "identifyer": 2736, "year": "2019"}, {"autor": "Paul Robinson", "date": "2019-02-23 09:49:00", "content": "11 hours ago, Edgar1920 said: Hi guys One evidence of irregular film transport is if the cuts between the frames do not have the same position related to the perforation. If the camera works properly the cut is always in the middle between two holes. I develop an cut my films at home and never had to cut across a hole, regardless if the film was taken with a M body (1955-2011) or one of my Leica III bodies (1934). As far as I know the position between two frames is already defined like this since Barnack’s first prototype and has never been changed. The reason is that it is easier to handle the film strips if they are not cut across the hole. I do not know the exact perforation pitch (Kodak’s price list for bulk film indicates the perforation) but it should be something that the frame advance will be around 39mm. Btw: when I developed my first roll after using my 21mm Super-Angulon for the first time I was surprised of the reduced spacing. And as I changed lenses several times the spacing between two frames was irregular. Exactly as a.noctilux wrote. But as the cuts were always between tho holes I realized that the film advance mechanism is still working fine. Best regards. Frank Thanks Frank, great point and will now check my negatives to see if the spacings coincide with the holes. Interesting to note the sos Jung’s can change dependant in the lens choice. As I use almost exclusively a 35mm this has never come up. But I may want to add another wide-angle in the future. Kind regards, Paul", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/?tab=comments#comment-3689319", "origin": "L-forum", "suborigin": "294513-leica-m-a-problem", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop an cut my -----> films !!!  at home and never had to cut across a hole, regardless if the film was taken with a m body (1955-2011) or one of my leica iii bodies (1934).", "sortedWord": "film", "Identifyer": null, "identifyer": 2738, "year": "2019"}, {"autor": "Paul Robinson", "date": "2019-03-10 22:06:00", "content": "Hello Everyone, The replacement M-A arrived from Red Dot who cannot be praised enough for their prompt attention and service. I have put through two test films. The first test film produced negatives that in the most part showed consistent narrow spacings, however, on closer inspection there was still some noticeable spacing difference in part of the negative. This raised my concern, so I put through a second test film which produced negatives with narrow spacing which showed variation in spacings that were not consistent in size. I developed these films with other films taken on my M7 (all incidentally Kodak Tri-X). As expected, the M7 negatives all had wider spacings, but more importantly the spacing were all consistent and of the same width. It would appear that the M-A have smaller frame spacings compared to the M7, which I can live with. The worry again is the inconsistent noticable difference in size of the spacings between the frames of negatives produced on the M-A. Is this inconsistent variation in size between frame spacing the norm with negatives produced with the M-A or do I have another 'defective' new camera. I will put through a another test film tomorrow to see what the results from the negatives when developed. In the meantime, can anyone on the forum who regularly use M-As be willing to provide a digital copy of 'contact prints' showing the spacings between the negatives so I can compare them to my negatives. Would Wattsy be willing to help? Would very much appreciate any assistance. Regards, Paul Edited March 10, 2019 by Paul Robinson clarify information", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/2/?tab=comments#comment-3699945", "origin": "L-forum", "suborigin": "294513-leica-m-a-problem", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i developed these -----> films !!!  with other -----> films !!!  taken on my m7 (all incidentally kodak tri-x).", "sortedWord": "film", "Identifyer": null, "identifyer": 2746, "year": "2019"}, {"autor": "semi-ambivalent", "date": "2019-05-19 03:30:00", "content": "On 3/3/2019 at 3:37 AM, Paul Robinson said: Can anyone with an M-A and M7 let me know if the spacings on the negative are the same or different with these two cameras using the same lens. With thanks, Paul Paul, I can not do that but I can say a roll of film I developed today, which was shot using only a 50mm and a 28mm, had narrower spacing between frames in a block of frames shot with a 28mm, than those in a block of frames shot with the 50mm. I chalk this up to angle of incidence. I have an MP but have been using the M-A exclusively recently and I don't mark the camera used on the sleeves so I'm no help there. HTH", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/4/?tab=comments#comment-3743635", "origin": "L-forum", "suborigin": "294513-leica-m-a-problem", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "with thanks, paul paul, i can not do that but i can say a -----> roll !!!  of film i developed today, which was shot using only a 50mm and a 28mm, had narrower spacing between frames in a block of frames shot with a 28mm, than those in a block of frames shot with the 50mm.", "sortedWord": "roll", "Identifyer": null, "identifyer": 2786, "year": "2019"}, {"autor": "mann61", "date": "2019-01-24 18:28:00", "content": "I must try a yellow filter on my R lenses. Your shots have convinced me that yellow delivers enough contrast. I have a few rolls of tri-x and Rollei 200 and 400s. I have 10 rolls of cheap colour Fuji 200 which I will develop as b/w . It will be interesting how colour film developed as b/w will respond with a yellow filter.", "link": "https://www.l-camera-forum.com/topic/286217-r-lens-image-thread/page/14/?tab=comments#comment-3670885", "origin": "L-forum", "suborigin": "286217-r-lens-image-thread", "result": false, "Selector": "i will develop", "selectorShort": "develop", "MarkedSent": "i have 10 -----> rolls !!!  of cheap colour fuji 200 which i will develop as b/w .", "sortedWord": "roll", "Identifyer": null, "identifyer": 18546, "year": "2019"}, {"autor": "pridbor", "date": "2019-12-02 00:05:00", "content": "On 11/30/2019 at 1:38 AM, otto.f said: This lens does not exist to my knowledge, it would be the 3.4 then. The closest distance to object for this lens is 2.5m, so I doubt that this photo is made with this lens, unless the image is cropped. You are of course right on both accounts!!! it should have been 3.4, and I did say I (I think) 🙂 Just checked not cropped just reduced in size to fit the criteria for publishing here. I did the shot as a test of the R9 so I must confess to having swapped lenses also for testing purposes, but fail to remember whi9ch Photos were taken with what Lens. So I confess 🙂 but also a bit happy with the outcome of the roll which I developed myself, a good feeling to be Back to the Future 🙂 Thanks Otto! Preben", "link": "https://www.l-camera-forum.com/topic/303720-any-leica-r-film-camera-image-thread/page/2/?tab=comments#comment-3865669", "origin": "L-forum", "suborigin": "303720-any-leica-r-film-camera-image-thread", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "so i confess 🙂 but also a bit happy with the outcome of the -----> roll !!!  which i developed myself, a good feeling to be back to the future 🙂 thanks otto!", "sortedWord": "roll", "Identifyer": null, "identifyer": 22063, "year": "2019"}, {"autor": "otto.f", "date": "2019-12-02 06:58:00", "content": "6 hours ago, pridbor said: the roll which I developed myself Great! Well that’s good quality then! And an incentive to start with that myself.", "link": "https://www.l-camera-forum.com/topic/303720-any-leica-r-film-camera-image-thread/page/2/?tab=comments#comment-3865771", "origin": "L-forum", "suborigin": "303720-any-leica-r-film-camera-image-thread", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "6 hours ago, pridbor said: the -----> roll !!!  which i developed myself great!", "sortedWord": "roll", "Identifyer": null, "identifyer": 22064, "year": "2019"}, {"autor": "Ko.Fe.", "date": "2019-11-01 18:55:00", "content": "Not sure why it is on Leica R sub-forum. I have scanned old negatives and positives few years ago. I also scan my recent films I develop. I was not keen with buying of relic scanners by Nikon, Minolta. I wanted plug&play device for current OS and peripheral interfaces. So, after few trials I set on latest Plustek (8200i )and SilverFast software which comes with it. Nikon also has DSLR solution, it is ,probably, most fastest way (excluding dust and scratches removal). https://www.nikonusa.com/en/learn-and-explore/a/tips-and-techniques/digitizing-film-using-the-d850-and-es-2-negative-digitizer.html If emulsion of film is clear of scratches and dust, I would use this rig instead of scanners.", "link": "https://www.l-camera-forum.com/topic/301434-which-slide-scanner/?tab=comments#comment-3845981", "origin": "L-forum", "suborigin": "301434-which-slide-scanner", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i also scan my recent -----> films !!!  i develop.", "sortedWord": "film", "Identifyer": null, "identifyer": 22171, "year": "2019"}, {"autor": "Acekerman", "date": "2019-11-13 18:43:00", "content": " I've been a long time Leica M user and now a new to me Leica S 006 with 70mm CS. I'm blown away with this camera! For its age its stunning. I love the CCD sensor color and monochrom conversion, the resolution, the Medium depth of field, etc. All these years I had no idea. This has motivated my photography like the first time I developed mown B&W film decades ago. Thats all I got. Thanks for listening.", "link": "https://www.l-camera-forum.com/topic/303451-long-time-leica-m-user-now-with-a-leica-s/?tab=comments#comment-3854033", "origin": "L-forum", "suborigin": "303451-long-time-leica-m-user-now-with-a-leica-s", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "this has motivated my photography like the first time i developed mown b&w -----> film !!!  decades ago.", "sortedWord": "film", "Identifyer": null, "identifyer": 29831, "year": "2019"}, {"autor": "Herr Barnack", "date": "2019-10-18 13:56:00", "content": "Quote \"... my beloved M8. I cherished this camera so much...\" If you feel that strongly about your M8, don't sell it. You will end up regretting it. There is something to be said for the \"if you're not using it, sell it and get something you want or need\" school of thought. I am at present going through that with my Hasselblad XPAN II film camera. I have always liked the XPAN as it is unique in the world of photography. I have not used it much over the years, though. I enjoy developing my own film, but it is damn hard due to physical problems with my hands. My M-P 240 has taken over my photographic endeavors the past few years. The image quality of my prints is outstanding and digital workflow is so much more easy than that of film. So I sold my XPAN II kit on Ebay to fund the purchase of a Q2. I still have the XPAN here at home, as I'm waiting for the buyer's bank to get its act together and let him pay me for it. Packing it up for shipping it pulled at my heart strings pretty hard - but not having money to burn, this is the only way to pay for the Q2 which I'm certain will get alot more use than my XPAN ever did. From where I stand, \"if you're not using it, sell it and get something you want or need\" is a good philosophy but you have to operate with caution so you don't end up breaking your own heart. One piece of gear that I truly cherish is my 50mm f/1.0 Noctilux. I will never even think of selling it. There is no other lens in existence that does what it does IMHO. That lens is my holy grail, my beloved. She is here to stay and has been since 2008. I have never had that attachment to my XPAN, so I think that even though parting with it sucks, the Q2 will ease the pain of loss. Best of luck with your decision on the M8. I would keep it, though.", "link": "https://www.l-camera-forum.com/topic/302526-letting-your-leica-go/?tab=comments#comment-3838188", "origin": "L-forum", "suborigin": "302526-letting-your-leica-go", "result": false, "Selector": "i enjoy developing", "selectorShort": "develop", "MarkedSent": "i enjoy developing my own -----> film !!! , but it is damn hard due to physical problems with my hands.", "sortedWord": "film", "Identifyer": null, "identifyer": 83399, "year": "2019"}, {"autor": "Doc Henry", "date": "2019-12-16 12:06:00", "content": "1 hour ago, Stuart Richardson said: I tried Negative Lab Pro and it is ok, but not nearly as good as ColorPerfect. Unfortunately ColorPerfect is very difficult to learn and use, so Negative Lab Pro is probably the better option for most people. Stuart if you like color and film as me develop yourself it's very easy and you have beautiful and natural color better than digital Rg Henry Edited December 16, 2019 by Doc Henry", "link": "https://www.l-camera-forum.com/topic/304421-scanning-6x6-hasselblad/page/2/?tab=comments#comment-3874239", "origin": "L-forum", "suborigin": "304421-scanning-6x6-hasselblad", "result": false, "Selector": "me develop", "selectorShort": "develop", "MarkedSent": "stuart if you like color and -----> film !!!  as me develop yourself it's very easy and you have beautiful and natural color better than digital rg henry edited december 16, 2019 by doc henry", "sortedWord": "film", "Identifyer": null, "identifyer": 99383, "year": "2019"}, {"autor": "Stuart Richardson", "date": "2019-12-16 12:23:00", "content": "Hi Henry, I do develop film myself...I run a lab. Maybe I am missing something? Both ColorPerfect and Negative Lab Pro are software designed to give good color from positive scans or photos of C41 film...I do shoot C41 in 6x7 to 8x10, but prefer E6 if I am honest....", "link": "https://www.l-camera-forum.com/topic/304421-scanning-6x6-hasselblad/page/2/?tab=comments#comment-3874244", "origin": "L-forum", "suborigin": "304421-scanning-6x6-hasselblad", "result": false, "Selector": "i do develop", "selectorShort": "develop", "MarkedSent": "hi henry, i do develop -----> film !!!  myself...", "sortedWord": "film", "Identifyer": null, "identifyer": 99384, "year": "2019"}, {"autor": "Doc Henry", "date": "2019-12-16 12:54:00", "content": "24 minutes ago, Stuart Richardson said: Hi Henry, I do develop film myself...I run a lab. Maybe I am missing something? Both ColorPerfect and Negative Lab Pro are software designed to give good color from positive scans or photos of C41 film...I do shoot C41 in 6x7 to 8x10, but prefer E6 if I am honest.... Yes it's a good idea ! Bravo Stuart .... almost all my film pictures don't need correction with any softwares and I am glad to have directly the color providing from film without any correction Recently I changed my PC with Windows 10 (before I had Vista) and I don't buy photo softwares anymore . What a relief for morale and for the money Best Henry", "link": "https://www.l-camera-forum.com/topic/304421-scanning-6x6-hasselblad/page/2/?tab=comments#comment-3874250", "origin": "L-forum", "suborigin": "304421-scanning-6x6-hasselblad", "result": false, "Selector": "i do develop", "selectorShort": "develop", "MarkedSent": "24 minutes ago, stuart richardson said: hi henry, i do develop -----> film !!!  myself...", "sortedWord": "film", "Identifyer": null, "identifyer": 99385, "year": "2019"}, {"autor": "Doc Henry", "date": "2019-12-16 14:09:00", "content": " Stuart since 2014 I develop myself all films b&w or color , a great pleasure and with my Leica cameras ( and sometimes I in light difficult situation I need my Gossen lighmeter) Really I don't correct my pictures. Sometimes I have underexpos or overexpos picture I don't take them , but in general all my pictures are fine.Like you I don't like and use SF or VS. I use EpsonScan when I have my V700 it's simple and now with Nikon I use the original software of Nikon scan in linear curve with no correction in TIFF. Best Henry", "link": "https://www.l-camera-forum.com/topic/304421-scanning-6x6-hasselblad/page/3/?tab=comments#comment-3874282", "origin": "L-forum", "suborigin": "304421-scanning-6x6-hasselblad", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": " stuart since 2014 i develop myself all -----> films !!!  b&w or color , a great pleasure and with my leica cameras ( and sometimes i in light difficult situation i need my gossen lighmeter)", "sortedWord": "film", "Identifyer": null, "identifyer": 99388, "year": "2019"}, {"autor": "}{B", "date": "2019-06-06 12:54:00", "content": "I've developed my first roll of this film and it's not one I would turn to automatically. I rated it at box speed using my M7 and my F3.5 Nickel Elmar from 1933 for a true vintage look. It was developed in Ilfosol 3 for 7 1/2 minutes at 20Deg C and as expected the negs have a lot of grain. Just a couple of examples. Using a different developer and/or processing time may improve the final result but I'm not inclined to experiment as I'd rather use Delta100 or Fomapan100/200. --img-- ", "link": "https://www.l-camera-forum.com/topic/296643-fomapan-retropan-320-soft/?tab=comments#comment-3754531", "origin": "L-forum", "suborigin": "296643-fomapan-retropan-320-soft", "result": false, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "i've developed my first -----> roll !!!  of this film and it's not one i would turn to automatically.", "sortedWord": "roll", "Identifyer": null, "identifyer": 99429, "year": "2019"}, {"autor": "Martin B", "date": "2019-10-21 22:08:00", "content": "So far I had another good film turnout this year compared to my earlier post #11 in this thread - and the year is not over yet! 19 rolls of 35 mm films with approx. 36 frames on each (most of them self-rolled from 100' rolls of film) 25 rolls of 120 films (increase from 2018 after I got my Hasselblad 500 C/M which I shot a lot this year so far) 6 sheets of 4x5 film I printed less this year so far in my darkroom. All of my negatives and positives were digitized. Like last year, I developed B&W, color, and slide films all by myself and also did the scanning. If I go out shooting, it is nearly always on the weekend only. Edited October 21, 2019 by Martin B", "link": "https://www.l-camera-forum.com/topic/292186-how-much-film-do-you-shoot-in-one-year/page/2/?tab=comments#comment-3840054", "origin": "L-forum", "suborigin": "292186-how-much-film-do-you-shoot-in-one-year", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "like last year, i developed b&w, color, and slide -----> films !!!  all by myself and also did the scanning.", "sortedWord": "film", "Identifyer": null, "identifyer": 101040, "year": "2019"}, {"autor": "GrampaDoug", "date": "2019-12-29 20:42:00", "content": " I’m trying to get back into developing my own B&W 35mm film and having a major problem, my developed film is clear blank, nothing, nada, zilch. I’m using the Semi-Stand development process with Rodinal. I mix my Rodinal 1- 100 and do the semi-stand routine, total time 1 hour. After a good rinse I did the fix, agitation for a minute and 10 seconds per 60 for 5 minutes. Pretty standard. At first I thought that my film wasn’t properly loaded so I tried it again, using a great deal of care while loading. Developed the second roll, same thing, blank. I did note that when I dumped the fix there was a pink tint to the liquid, is that normal? Not to be defeated I tried a 3rd roll, same results. The frustration is setting in at this point and I’m starting to doubt myself. The only other variable is the chemistry. The Rodinal lasts forever, so I’m told, but the fix is a couple of years old. Could the fix go bad after a couple of years and strip the images? I have some fresh chemistry on order, due next week. I’ll try it again when they arrive. Has this happened to anyone else? What would cause this to happen? Help prevent a fellow photographer from taking up golf! Thanks, Doug", "link": "https://www.l-camera-forum.com/topic/304848-developing-help-needed/?tab=comments#comment-3881541", "origin": "L-forum", "suborigin": "304848-developing-help-needed", "result": false, "Selector": "my developed", "selectorShort": "develop", "MarkedSent": " i’m trying to get back into developing my own b&w 35mm -----> film !!!  and having a major problem, my developed -----> film !!!  is clear blank, nothing, nada, zilch.", "sortedWord": "film", "Identifyer": null, "identifyer": 102046, "year": "2019"}, {"autor": "tommonego@gmail.com", "date": "2019-12-18 12:46:00", "content": "3 hours ago, adan said: Interesting. I think I have Hewes 120 reels also - but I just grabbed them out of a mixed bin of reels and tanks at a shop 30 years ago, and had assumed for all these years that they were just a Nikor variant of some kind. They have the little \"dragon's tooth\" sticking out sideways at the mouth of the spiral, the other L-shape bend(s) in the center, and the thin triangular-outline center retaining clip. While I was doing retinal photography on film, we would develop 20-30 rolls a day, generally 4 rolls at a time. Not all our photographers were photographically trained so we had to teach them how to load reels with film, remember this is patient testing. We found the Hewes 35mm reels were far easier to use and faster to load, due to the dragon teeth. Their one problem that new they cost around $10 each in the 1980s, they are a heavy gauge of stainless and wouldn't bend when dropped. It really helped yesterday as I hadn't loaded a reel in years, but as all things you do thousands of times, muscle memory takes over.", "link": "https://www.l-camera-forum.com/topic/304510-did-it/?tab=comments#comment-3875379", "origin": "L-forum", "suborigin": "304510-did-it", "result": false, "Selector": "we would develop", "selectorShort": "develop", "MarkedSent": "while i was doing retinal photography on -----> film !!! , we would develop 20-30 rolls a day, generally 4 rolls at a time.", "sortedWord": "film", "Identifyer": null, "identifyer": 102061, "year": "2019"}, {"autor": "pridbor", "date": "2019-11-29 02:22:00", "content": " I have started to develop my own film and scan them onto my PC for post processing. I get somewhat grainy results and I don't know if that stems from the film itself or from my scanning. So I was wondering if one can send in negatives to have prints made the old fashion way not by having somebody else scanning and printing from there, just curious. Preben", "link": "https://www.l-camera-forum.com/topic/303951-prints-from-film-anymore/?tab=comments#comment-3863918", "origin": "L-forum", "suborigin": "303951-prints-from-film-anymore", "result": false, "Selector": "i have started to develop", "selectorShort": "develop", "MarkedSent": " i have started to develop my own -----> film !!!  and scan them onto my pc for post processing.", "sortedWord": "film", "Identifyer": null, "identifyer": 102156, "year": "2019"}, {"autor": "pridbor", "date": "2019-12-04 02:29:00", "content": "Once more I have to thank you all for your insight and sharing. Andy I saved your thorough post after reading it twice, and realizing that I will have to come back to it at a later day and not being able to find it again. Stuart you asked which process I used for development, and no not B&W but C-41. I bough a bunch of different films (companies) B&W as well as Color all using the same process namely the C-41. I didn't want to start out getting a bunch of developers for all kinds of film, if I couldn't even develop a single one with a decent result. I realize that this may/will change as soon as I feel a bit more comfortable with the development process and buying film with different development requirements. Which makes me curious as to if you gents have chosen a few types film you like and staying with them and their processes, and not having 10 different developers on hand? Anyhow I will keep at it and hope for good results, despite my question about the grain in my images I still am happy enough with the results. Thanks Preben", "link": "https://www.l-camera-forum.com/topic/303951-prints-from-film-anymore/?tab=comments#comment-3866937", "origin": "L-forum", "suborigin": "303951-prints-from-film-anymore", "result": false, "Selector": "i couldn't even develop", "selectorShort": "develop", "MarkedSent": "i didn't want to start out getting a bunch of developers for all kinds of -----> film !!! , if i couldn't even develop a single one with a decent result.", "sortedWord": "film", "Identifyer": null, "identifyer": 102171, "year": "2019"}, {"autor": "Ko.Fe.", "date": "2019-11-28 01:10:00", "content": "I develop all kinds of film in Rodinal. It is coarse, quick and easy developer at 1:25. Here is my little secret. It doesn't matter which film. The ISO is. If you developed any 400 film in Rodinal before, develop for same time.", "link": "https://www.l-camera-forum.com/topic/303911-delta-400-in-rodinal-dev-time/?tab=comments#comment-3863318", "origin": "L-forum", "suborigin": "303911-delta-400-in-rodinal-dev-time", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop all kinds of -----> film !!!  in rodinal.", "sortedWord": "film", "Identifyer": null, "identifyer": 102180, "year": "2019"}, {"autor": "Doug A", "date": "2019-11-27 21:35:00", "content": "Using a changing bag and the Ilford Film Washing Method I can develop 35mm or MF black and white film anywhere I can set up my old 11x14 Kodak Duraflex developing tray to catch drips or spills. The whole process needs just a bottle of Rodinal, a bottle of fixer, and a half gallon bottle of distilled water. No running water needed. Developing prints is a whole different ballgame! Edited November 27, 2019 by Doug A", "link": "https://www.l-camera-forum.com/topic/303683-film-processing/page/2/?tab=comments#comment-3863247", "origin": "L-forum", "suborigin": "303683-film-processing", "result": false, "Selector": "i can develop", "selectorShort": "develop", "MarkedSent": "using a changing bag and the ilford -----> film !!!  washing method i can develop 35mm or mf black and white -----> film !!!  anywhere i can set up my old 11x14 kodak duraflex developing tray to catch drips or spills.", "sortedWord": "film", "Identifyer": null, "identifyer": 102206, "year": "2019"}, {"autor": "Pyrogallol", "date": "2019-10-04 13:55:00", "content": "2 hours ago, Martin B said: I often use PanF+ 50 film (35 mm format), but normally develop with Xtol or a combination of Rodinal/Xtol (2-step development for the latter). I am not familiar with Tanol. Development times I use in Xtol (1:2) are about 10 minutes at ISO 50. What is special about Tanol? I use Rodinal all the time with FP4 and sometimes Tanol. With Pan F I was going to use Perceptol which is nice with the slower film, but decided to make more use of the Moersch Tanol. It is a “staining” developer in the pyro family and good for smooth rendition of shadow detail and skies. i have now developed a couple of films for 10 minutes and that seems about right. these two pictures were printed from Tanol negatives and I used one in the current Barnack Challenge, Leica 111 with Summar lens. more about Tanol can be found here. https://www.moersch-photochemie.de/files/articles/TanolundCo-eng.pdf --img--  Edited October 4, 2019 by Pyrogallol", "link": "https://www.l-camera-forum.com/topic/301617-pan-f-in-moersch-tanol/?tab=comments#comment-3830829", "origin": "L-forum", "suborigin": "301617-pan-f-in-moersch-tanol", "result": false, "Selector": "i have now developed", "selectorShort": "develop", "MarkedSent": "i have now developed a couple of -----> films !!!  for 10 minutes and that seems about right.", "sortedWord": "film", "Identifyer": null, "identifyer": 102305, "year": "2019"}, {"autor": "Matlock", "date": "2019-07-12 18:57:00", "content": "13 minutes ago, pico said: Pan F+ is available in 120. Developed a roll a couple of months ago.", "link": "https://www.l-camera-forum.com/topic/299205-behind-the-film-inside-the-ilford-factory/?tab=comments#comment-3777043", "origin": "L-forum", "suborigin": "299205-behind-the-film-inside-the-ilford-factory", "result": false, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "developed a -----> roll !!!  a couple of months ago.", "sortedWord": "roll", "Identifyer": null, "identifyer": 102363, "year": "2019"}, {"autor": "philipus", "date": "2019-06-19 17:15:00", "content": " A modern take on the Rondinax is now available for sale. http://www.ars-imago.com/-c-1146.html I think it's a terrific idea, if a rather pricey product. Still it won't be for me because I normally develop several films at once. That said, I'm very happy that products like this come to the market to make it easy for people to use film.", "link": "https://www.l-camera-forum.com/topic/298480-lab-box-the-modern-rondinax-now-selling/?tab=comments#comment-3762525", "origin": "L-forum", "suborigin": "298480-lab-box-the-modern-rondinax-now-selling", "result": false, "Selector": "i normally develop", "selectorShort": "develop", "MarkedSent": "still it won't be for me because i normally develop several -----> films !!!  at once.", "sortedWord": "film", "Identifyer": null, "identifyer": 102393, "year": "2019"}, {"autor": "benqui", "date": "2019-03-01 23:31:00", "content": "@A miller: thank you very much Adam for mention my b/w photos as examples for different types of film. On the one hand there are so many different b/w films on the market on the other hand I do not have the time (which is a polite way to say I don't fancy that) to test all of them. In most cases I use the Tmax 400 because it is very easy to push the film up to 1600 or more depending on the light. If I have a good light I also like the Delta 400. I develop the films by myself, but I hate scanning. A lab does this job for me. But to tell the truth, I am not able at all to see any difference on my scans or prints on photo paper between the Delta 400 and the Tmax 400. To me they all look the same. In many cases it is not a decision between these films it depends on what I have in my fridge. And when I think that I need more grain, I use the Tmax 3200 with 1000 or 1600. Thats all. I think it is a difficult discussion and especially when you look in the \"I like film\" thread you see photos with a completely different grain and look, but they were taken with the same film.", "link": "https://www.l-camera-forum.com/topic/294528-tmax-400-more-preferred-than-tri-x-among-leica-users/page/2/?tab=comments#comment-3693742", "origin": "L-forum", "suborigin": "294528-tmax-400-more-preferred-than-tri-x-among-leica-users", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop the -----> films !!!  by myself, but i hate scanning.", "sortedWord": "film", "Identifyer": null, "identifyer": 102706, "year": "2019"}, {"autor": "jmahto", "date": "2019-03-02 05:24:00", "content": "21 hours ago, PaulJohn said: With﻿ s﻿canning it's a good idea to avoid all image processing at the s﻿can stage and do it later in full control of the affe﻿c﻿﻿t﻿s. Selective adjustment of sharpening, contra﻿st a﻿nd clarity can yield good results I agree. I have been developing and scanning BW film myself for one year and only now I am able to understand how to switch off all the automated adjustments by scanning software.", "link": "https://www.l-camera-forum.com/topic/294528-tmax-400-more-preferred-than-tri-x-among-leica-users/page/2/?tab=comments#comment-3693833", "origin": "L-forum", "suborigin": "294528-tmax-400-more-preferred-than-tri-x-among-leica-users", "result": false, "Selector": "i have been developing", "selectorShort": "develop", "MarkedSent": "i have been developing and scanning bw -----> film !!!  myself for one year and only now i am able to understand how to switch off all the automated adjustments by scanning software.", "sortedWord": "film", "Identifyer": null, "identifyer": 102708, "year": "2019"}, {"autor": "jmahto", "date": "2019-04-11 17:43:00", "content": "I always have single malt by the side when I am developing film. Standing there and doing nothing in between inversions, tapping etc. is too boring. Just to be safe, I am thinking of not reusing chemical bottles for my drink.", "link": "https://www.l-camera-forum.com/topic/296087-devolping-film-drunk/?tab=comments#comment-3720453", "origin": "L-forum", "suborigin": "296087-devolping-film-drunk", "result": false, "Selector": "i am developing", "selectorShort": "develop", "MarkedSent": "i always have single malt by the side when i am developing -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 102723, "year": "2019"}, {"autor": "stray cat", "date": "2019-03-19 23:01:00", "content": "My best advice would be to just use a couple of rolls, develop as you see fit, make some prints and then decide for yourself. Is it better than Ilford or Kodak or Rollei? No - not better - it's different. My experience has not so far included wet printing (it does scan well), nor have I developed in Silvermax developer (development times in XTOL 1:1 are the same as for Tri-X), but I can confidently say that it is a glorious film: --img-- /applications/core/interface/js/spacer.png\">", "link": "https://www.l-camera-forum.com/topic/295379-adox-silvermax-experience/?tab=comments#comment-3705974", "origin": "L-forum", "suborigin": "295379-adox-silvermax-experience", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "my experience has not so far included wet printing (it does scan well), nor have i developed in silvermax developer (development times in xtol 1:1 are the same as for tri-x), but i can confidently say that it is a glorious -----> film !!! : --img-- /applications/core/interface/js/spacer.png\">", "sortedWord": "film", "Identifyer": null, "identifyer": 102799, "year": "2019"}, {"autor": "Torontoamateur", "date": "2019-03-20 12:45:00", "content": "13 hours ago, stray cat said: My best advice would be to just use a couple of rolls, develop as you see fit, make some prints and then decide for yourself. Is it better than Ilford or Kodak or Rollei? No - not better - it's different. My experience has not so far included wet printing (it does scan well), nor have I developed in Silvermax developer (development times in XTOL 1:1 are the same as for Tri-X), but I can confidently say that it is a glorious film: --img--  seems the window highlight blew out. I thought this film had latitude. But maybe because you did not use the Silvermax developer. I think that is the =key to the special character of the film.", "link": "https://www.l-camera-forum.com/topic/295379-adox-silvermax-experience/?tab=comments#comment-3706221", "origin": "L-forum", "suborigin": "295379-adox-silvermax-experience", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "my experience has not so far included wet printing (it does scan well), nor have i developed in silvermax developer (development times in xtol 1:1 are the same as for tri-x), but i can confidently say that it is a glorious -----> film !!! : --img--  seems the window highlight blew out.", "sortedWord": "film", "Identifyer": null, "identifyer": 102803, "year": "2019"}, {"autor": "jmahto", "date": "2019-02-19 06:27:00", "content": " Well, I am mildly disappointed that is why I am posting this... Today I had day off and I wanted to develop the TMax100 roll in my Nikon FM2 for almost a month. It is cold right now and I took great care to prepare the 20 Celsius bath, mixed developers etc. A perfect way to spend my afternoon. After that I unwound and took out the roll from my Nikon. To my shock it was Portra 160! All the time I had been pre visualizing BW and shooting. I don’t develop color rolls therefore my perfect 20 Celsius bath goes waste. Teaches me a lesson.", "link": "https://www.l-camera-forum.com/topic/294438-wrong-film/?tab=comments#comment-3686884", "origin": "L-forum", "suborigin": "294438-wrong-film", "result": false, "Selector": "i wanted to develop", "selectorShort": "develop", "MarkedSent": " well, i am mildly disappointed that is why i am posting this... today i had day off and i wanted to develop the tmax100 -----> roll !!!  in my nikon fm2 for almost a month.", "sortedWord": "roll", "Identifyer": null, "identifyer": 102862, "year": "2019"}, {"autor": "SteveYork", "date": "2019-02-19 13:56:00", "content": "A couple months ago I developed a roll of Kodak Gold thinking it was tri-x. Ouch!", "link": "https://www.l-camera-forum.com/topic/294438-wrong-film/?tab=comments#comment-3687088", "origin": "L-forum", "suborigin": "294438-wrong-film", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "a couple months ago i developed a -----> roll !!!  of kodak gold thinking it was tri-x. ouch!", "sortedWord": "roll", "Identifyer": null, "identifyer": 102866, "year": "2019"}, {"autor": "jmahto", "date": "2019-02-19 22:19:00", "content": "8 hours ago, SteveYork said: A couple months ago I developed a roll of Kodak Gold thinking it was tri-x. Ouch﻿! I have read that color film can be processed with BW chemistry. Other than speed difference, how did it come out?", "link": "https://www.l-camera-forum.com/topic/294438-wrong-film/?tab=comments#comment-3687437", "origin": "L-forum", "suborigin": "294438-wrong-film", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "8 hours ago, steveyork said: a couple months ago i developed a -----> roll !!!  of kodak gold thinking it was tri-x. ouch﻿!", "sortedWord": "roll", "Identifyer": null, "identifyer": 102870, "year": "2019"}, {"autor": "Lolarat", "date": "2019-02-24 20:27:00", "content": " I've started experimenting with Infrared film, unfortunately I am a little confused leading to the first film I developed being overexposed. I am using Rollei infrared 400iso when I looked it up it advised to set the iso at 25. I can't use the light meter due to using a filter on the lens. So did the same with my digital but the lowest iso was 100, so I thought I had to increase the shutter speed but I think I should have decreased it. How do I figure this out? For example if on my digital (again using infrared filter) the iso is 100 and shutter speed is 30secs, then how long would the shutter speed be for the film if set at iso25? I hope this makes sense! Thanks", "link": "https://www.l-camera-forum.com/topic/294590-infrared-film-iso-speed/?tab=comments#comment-3690293", "origin": "L-forum", "suborigin": "294590-infrared-film-iso-speed", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": " i've started experimenting with infrared -----> film !!! , unfortunately i am a little confused leading to the first -----> film !!!  i developed being overexposed.", "sortedWord": "film", "Identifyer": null, "identifyer": 102875, "year": "2019"}, {"autor": "Xícara de Café", "date": "2019-08-11 13:24:00", "content": " Dear darkroom doctors, I've been having ongoing issues with my negatives not washing properly, ie. having signs of residues or -- and perhaps this is another issue -- having blotchy regions, especially apparent in uniform regions without much detail. I've been trying various things. On my last roll of film, which I developed as usual in a Paterson tank, i used a real acidic stop bath (a solution using alcohol vinegar) rather than water and a hypo clearing agent (a fresh solution using sodium sulfite). Most of the roll was good, but on the following uninteresting shot you can see the type of blotching that I'm talking about: --img--  I developed the neg with Kodak D-76 for the required time (11 min for Ilford Delta 100 @ 20 degrees C), then added the stop bath for 30 seconds, then fixed for 10 minutes with standard Kodak fixer (perhaps too long? i was worried the fixer was getting old). I then washed the neg for 5 minutes under running water with just the spool in the open tank, bathed it for 5 min in the sodium sulfite solution, then washed for a further 5. Further, I gave 40 rotations of the tank (a la a partial Ilford method) in carbon filtered water. Then a minute to soak in a second bath of filtered water with a few drops of dish washing detergent. Any ideas where I might me going wrong? This is the first time that I've used an acidic stop bath with film and the first time I've used sodium sulfite. The result above is however fairly typical of other poor results that I've had in the past. Perhaps I should wash for longer but our water bills are huge.... I can't yet connect a hose to the tap in my darkroom (a bathroom) but will be doing that in the future so I can use the A. Adams method of forcing the water up from the bottom of the tank, rather than having running water entering from the top. I guess it could be the dish washing detergent, but i don't know. Any advice here most welcome! Thank you,", "link": "https://www.l-camera-forum.com/topic/300211-trouble-washing-negatives/?tab=comments#comment-3795446", "origin": "L-forum", "suborigin": "300211-trouble-washing-negatives", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "on my last -----> roll !!!  of film, which i developed as usual in a paterson tank, i used a real acidic stop bath (a solution using alcohol vinegar) rather than water and a hypo clearing agent (a fresh solution using sodium sulfite).", "sortedWord": "roll", "Identifyer": null, "identifyer": 104699, "year": "2019"}, {"autor": "mdp", "date": "2019-08-14 14:10:00", "content": " Hello - I've started getting white spots/marks on my home developed b&w negatives, please see tight crop below. I haven't changed anything in my process, which is Ilford DDX (always new, not re-used), and Ilford stop, fix & rinse aid (again, always new). I'm pretty sure it's marks on the negatives rather than dust being picked up by the scanner. The film is Delta 100. Plus I just developed my first roll of colour C41 (Ektar) with Tetenal C41 kit, and got very similar, but worse, white marks. Any ideas or suggestions what I'm doing wrong? Thanks. --img-- ", "link": "https://www.l-camera-forum.com/topic/300299-white-spots-on-negatives-help-please/?tab=comments#comment-3797536", "origin": "L-forum", "suborigin": "300299-white-spots-on-negatives-help-please", "result": false, "Selector": "i just developed", "selectorShort": "develop", "MarkedSent": "plus i just developed my first -----> roll !!!  of colour c41 (ektar) with tetenal c41 kit, and got very similar, but worse, white marks.", "sortedWord": "roll", "Identifyer": null, "identifyer": 105047, "year": "2019"}, {"autor": "Richardgb", "date": "2019-08-15 21:01:00", "content": "On 8/14/2019 at 3:10 PM, mdp said: Hello - I've started getting white spots/marks on my home developed b&w negatives, please see tight crop below. I haven't changed anything in my process, which is Ilford DDX (always new, not re-used), and Ilford stop, fix & rinse aid (again, always new). I'm pretty sure it's marks on the negatives rather than dust being picked up by the scanner. The film is Delta 100. Plus I just developed my first roll of colour C41 (Ektar) with Tetenal C41 kit, and got very similar, but worse, white marks. Any ideas or suggestions what I'm doing wrong? Thanks. --img--  On 8/14/2019 at 3:18 PM, mdp said: Here's the Ektar example, cropped. Developed with new Tetenal C41 chemicals... --img--  So, you're getting white marks on both b/w and colour negs an both are scanned to show here? Are you sure it's not the scanner or something on the film?", "link": "https://www.l-camera-forum.com/topic/300299-white-spots-on-negatives-help-please/?tab=comments#comment-3798556", "origin": "L-forum", "suborigin": "300299-white-spots-on-negatives-help-please", "result": false, "Selector": "i just developed", "selectorShort": "develop", "MarkedSent": "plus i just developed my first -----> roll !!!  of colour c41 (ektar) with tetenal c41 kit, and got very similar, but worse, white marks.", "sortedWord": "roll", "Identifyer": null, "identifyer": 105057, "year": "2019"}, {"autor": "mdp", "date": "2019-08-26 09:38:00", "content": "Good news and bad news... I've developed a roll of PanF & Ektar, the PanF was good, no white spots or marks, & that was using filtered water in the chemicals & de-ionised water for the rinsing, so that's a success. The Ektar was a disaster - it was covered completely in a powdery white coating when it dried. I was very careful with all the temperatures, so its not that, but used the existing chemicals, which had only been used once & I've now thrown away... I then washed the negatives and most of the residue washed off, but in doing so it did scratch them in places. So I think the fault is with the chemicals some how. I'll mix some fresh Tetenal & try again soon. I haven't had this issue with E6 Tetenal, that has worked fine on Ektachrome.", "link": "https://www.l-camera-forum.com/topic/300299-white-spots-on-negatives-help-please/?tab=comments#comment-3806354", "origin": "L-forum", "suborigin": "300299-white-spots-on-negatives-help-please", "result": false, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "i've developed a -----> roll !!!  of panf & ektar, the panf was good, no white spots or marks, & that was using filtered water in the chemicals & de-ionised water for the rinsing, so that's a success.", "sortedWord": "roll", "Identifyer": null, "identifyer": 105064, "year": "2019"}, {"autor": "pridbor", "date": "2019-07-03 16:45:00", "content": "I'm in the same situation as \"jeffz\", and I don't have this \"muscle-memory\", nor did I ever in the past have it, so anything which can make my life easier when developing is welcome 🙂 Currently I send my film to be developed at a Lab. But I'm not very patient, so if I could do my own, and if it would simplify the process, then I'm at least interested. And the cost would equate about 10 film developed by a Lab, so not too bad $$$ wise. Yes it's a new design, albeit now I learn not a new concept, and too little info is currently provided for me yet to commit. I should for example like to know how the winding the film onto the spool prevents the \"lockup\" I experience every other time I develop my film, and like many of you address how much Chemicals is required for a single roll of film. I will try to get a bit more info and share that with (inexperienced) people like me who will otherwise never get back to developing themselves again. Thanks all for your responses !!!! Preben", "link": "https://www.l-camera-forum.com/topic/298868-daylight-film-development-tank/?tab=comments#comment-3771049", "origin": "L-forum", "suborigin": "298868-daylight-film-development-tank", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i should for example like to know how the winding the -----> film !!!  onto the spool prevents the \"lockup\" i experience every other time i develop my -----> film !!! , and like many of you address how much chemicals is required for a single roll of -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 105085, "year": "2019"}, {"autor": "105012", "date": "2019-07-03 18:03:00", "content": "1 hour ago, pridbor said: ... I should for example like to know how the winding the film onto the spool prevents the \"lockup\" I experience every other time I develop my film, and like many of you address how much Chemicals is required for a single roll of film. ... Looks like it needs 270ml (continuous agitation), so approximately 8.5ml of HC-110 (Ilfotec HC) per roll if you use 1:32. Not as economical as a Rondix, but still good and I think still cost effective for one shot. I use JOBO reels these days and haven’t experienced any ‘lockup’ with them. Also haven’t experienced anything like that with my daylight tanks (haven’t used those for some years now due to the ATL). One thing I never do is allow any stabilizer or surfactant to contact the developing reels, I always remove the film into a separate container before applying those.", "link": "https://www.l-camera-forum.com/topic/298868-daylight-film-development-tank/?tab=comments#comment-3771129", "origin": "L-forum", "suborigin": "298868-daylight-film-development-tank", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i should for example like to know how the winding the -----> film !!!  onto the spool prevents the \"lockup\" i experience every other time i develop my -----> film !!! , and like many of you address how much chemicals is required for a single roll of -----> film !!! . ...", "sortedWord": "film", "Identifyer": null, "identifyer": 105087, "year": "2019"}, {"autor": "Millerbn", "date": "2019-11-13 16:00:00", "content": "I backed this kickstarter project and it just delivered a couple months ago. They were really slow to finalize the design and deliver the LabBox but I just developed my first rolls this past weekend. It's very easy to use and works really well. No complaints at all. Personally I want to do my own development but don't have a ton of space. This keeps things really minimal and compact. It's a little pricy compared to the more traditional systems we know of but that's okay for me if I'm able to minimize the the process. I'd recommend it, for sure.", "link": "https://www.l-camera-forum.com/topic/298868-daylight-film-development-tank/?tab=comments#comment-3853917", "origin": "L-forum", "suborigin": "298868-daylight-film-development-tank", "result": false, "Selector": "i just developed", "selectorShort": "develop", "MarkedSent": "but i just developed my first -----> rolls !!!  this past weekend.", "sortedWord": "roll", "Identifyer": null, "identifyer": 105090, "year": "2019"}, {"autor": "RayD28", "date": "2019-03-02 18:45:00", "content": " I've been developing film at home for a little over a year. I shoot FP4 or HP5, so far at box speed only. I've been using DD-X and I was getting low and needed to order more but I thought I'd try something new. I did some research and thought I'd try Ilfotec HC so I placed an order. Now I'm having second thoughts because I researched further and discovered a lot of what I read was actually regarding Kodak HC 110. (I know, dumb. I thought HC was a proprietary Ilford brand but I think it's just High Concentrate abbreviated.) Here are my questions: If I do everything by the book, (no pushing, recommended develop times and temperatures and dilution of 1+31), should I get about the same general results I got with DD-X? By results, I mean contrast, grain, and sharpness. Specifically regarding FP4 and grain, will there be a big difference between using DD-X or Ilfotec HC? Once I make the four liters of stock solution, how long of shelf life should I expect? At 1+31 I'll probably have enough developer to last years since I've been averaging about three rolls of film per month. If I make two liters of stock solution, will the remaining half liter of concentrate keep for a year or two? Thanks in advance for your advice. Ray", "link": "https://www.l-camera-forum.com/topic/294800-questions-regarding-ilfotec-hc/?tab=comments#comment-3694293", "origin": "L-forum", "suborigin": "294800-questions-regarding-ilfotec-hc", "result": false, "Selector": "i've been developing", "selectorShort": "develop", "MarkedSent": " i've been developing -----> film !!!  at home for a little over a year.", "sortedWord": "film", "Identifyer": null, "identifyer": 105291, "year": "2019"}], "name": "Leicasortedout2019develop"}