{"interestingcomments": [{"autor": "jrp", "date": "2019-11-19 08:57:00", "content": "... and new firmware (v1.3) for the Panasonic S1 series is now available: Quote Expanded media compatibility - CFexpress Type B memory card can be used. Expanded compatibility with Profoto wireless transmitters - Profoto wireless transmitters \"Air Remote TTL-O/P\" and \"Profoto Connect-O/P\" can be used. * All functions may not be available depending on the situation. Improved compatibility with Sigma interchangeable lenses and mount converter - It is possible to assign function to the Fn buttons of Sigma L-Mount interchangeable lenses. - When attaching a lens using the Sigma MC-21 mount converter and [Image Stabiizer] > [Lens] is set to ON , Body I.S.(Image Stabilizer) suppresses roll movement. Improved compatibility with Panasonic interchangeable lenses - It is possible to assign functions to the lens’ Fn buttons when the Panasonic LUMIX S PRO 70-200mm F2.8 O.I.S. (S-E70200) is mounted. Improved AF performance - It is possible to set [AF+MF] in AFC mode. - It is possible to set continuous AF on the live view screen in Creative Video mode or in other video recording mode when the video recording area is displayed. Improved performance of High Speed Video - It is possible to manually set the exposure according to the video exposure mode (P/A/S/M) in High Speed Video mode. Other added functions - It is possible to select the card slot to save the JPEG images developed by in-camera RAW processing. - [0.5 SEC] has been added for an option of [Duration Time (photo)] in [Auto Review]. - [Forced Flash OFF] can be selected in iA mode. - [AF Assist Light] has been added to the Focus tab of the [Video] menu. - [Off (Disable Press and Hold)] can be assigned to the Fn button. It disables operation when the button is long-pressed. - Fn button can be used for checking aperture effect while the button is pressed. Other improvements - There were cases where F value control failed depending on the maximum F value when non-Panasonic L-Mount lens is mounted. This bug has been fixed. - Luminance level of photos (including 6K/4K Photo and Post Focus images) can be set when playing back them over HDMI output. - AE can be locked with the [AF/AE LOCK] button when ISO Auto is set in M mode. - Image quality of long exposure shot has been improved. (When [Long Exposure NR] is set to OFF and [Vignetting Comp.] is set to ON.) - Aperture and shutter speed can be controlled using front/rear dials when the rear monitor is set to OFF. Improved operational stability - There were cases where Backup Recording using the Double Card Slot Function stopped during writing. This bug has been fixed. - AF operation following the pressing of [AF-ON] in MF mode was unstable when the LVF Frame Rate was at 120 fps and the camera was under dim lighting. This bug has been fixed. - There were cases where the images shot vertically did not rotate on playback. This bug has been fixed. - There were cases where [Image Stabilizer] was set to OFF when the battery was reinserted. This bug has been fixed. - Operational stability of image stabilizer has been improved. (When [Image Stabilizer] > [E-Stabilization(Video)] and [Boost I.S.(Video)] is ON. ) But the answer to the OP is to go into a Leica Store and mount the lens on an SL/SL2 with the latest firmware and see if anything happens.", "link": "https://www.l-camera-forum.com/topic/303528-where-to-find-list-of-current-firmware-for-l-lenses-by-panasonic-and-leica/?tab=comments#comment-3857436", "origin": "L-forum", "suborigin": "303528-where-to-find-list-of-current-firmware-for-l-lenses-by-panasonic-and-leica", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "... and new firmware (v1.3) for the panasonic s1 series is now available: quote expanded media compatibility - cfexpress type b memory card can be used. expanded compatibility with profoto wireless transmitters - profoto wireless transmitters \"air remote ttl-o/p\" and \"profoto connect-o/p\" can be used. * all functions may not be available depending on the situation. -----> improved !!!  compatibility with sigma interchangeable lenses and mount converter - it is possible to assign function to the fn buttons of sigma l-mount interchangeable lenses. - when attaching a lens using the sigma mc-21 mount converter and [image stabiizer] > [lens] is set to on , body i.s.(image stabilizer) suppresses roll movement. improved compatibility with panasonic interchangeable lenses - it is possible to assign functions to the lens’ fn buttons when the panasonic lumix s pro 70-200mm f2.8 o.i.s. (s-e70200) is mounted. improved af performance - it is possible to set [af+mf] in afc mode. - it is possible to set continuous af on the live view screen in creative video mode or in other video recording mode when the video recording area is displayed. improved performance of high speed video - it is possible to manually set the exposure according to the video exposure mode (p/a/s/m) in high speed video mode. other added functions - it is possible to select the card slot to save the jpeg images developed by in-camera raw processing. - [0.5 sec] has been added for an option of [duration time (photo)] in [auto review]. - [forced flash off] can be selected in ia mode. - [af assist light] has been added to the focus tab of the [video] menu. - [off (disable press and hold)] can be assigned to the fn button. it disables operation when the button is long-pressed. - fn button can be used for checking aperture effect while the button is pressed. other improvements - there were cases where f value control failed depending on the maximum f value when non-panasonic l-mount lens is mounted. this bug has been fixed. - luminance level of photos (including 6k/4k photo and post focus images) can be set when playing back them over hdmi output. - ae can be locked with the [af/ae lock] button when iso auto is set in m mode. - image quality of long exposure shot has been improved. (when [long exposure nr] is set to off and [vignetting comp.] is set to on.) - aperture and shutter speed can be controlled using front/rear dials when the rear monitor is set to off. improved operational stability - there were cases where backup recording using the double card slot function stopped during writing. this bug has been fixed. - af operation following the pressing of [af-on] in mf mode was unstable when the lvf frame rate was at 120 fps and the camera was under dim lighting. this bug has been fixed. - there were cases where the images shot vertically did not rotate on playback. this bug has been fixed. - there were cases where [image stabilizer] was set to off when the battery was reinserted. this bug has been fixed. - operational stability of image stabilizer has been improved. (when [image stabilizer] > [e-stabilization(video)] and [boost i.s.(video)] is on. ) but the answer to the op is to go into a leica store and mount the lens on an sl/sl2 with the latest firmware and see if anything happens.", "sortedWord": "None", "Identifyer": null, "identifyer": 48459, "year": "2019"}, {"autor": "FlashGordonPhotography", "date": "2019-07-11 21:50:00", "content": "According to Panasonic (for the S1R). Improved performance of the Image Stabilizer - The correction performance of the Body Image Stabilizer has been improved from 5.5 stops to 6.0 stops. *1 - The correction performance of the Dual I.S.2 has been improved from 6.0 stops to 6.5 stops. *2 *3 *1 Based on the CIPA standard [Yaw/Pitch direction : focusing distance f=50mm , when S-X50 is used.] *2 Based on the CIPA standard [Yaw/Pitch direction: focusing distance f=105mm, when S-R24105 is used.] *3 Based on the CIPA standard [Yaw/Pitch direction : focusing distance f=200mm , when S-R70200 is used.] Improved AF performance - [AF-ON: Near Shift] and [AF-ON: Far Shift] functions have been added. [AF-ON: Near Shift] preferably focuses on a subject nearby while [AF-ON: Far Shift] preferably focuses on a subject far away. - The tracking performance when using [Tracking] AF mode in video recording has been improved. - Live view display during auto focusing is now easier to see. Improved operational stability - Operational stability when using an XQD memory card has been improved. Gordon", "link": "https://www.l-camera-forum.com/topic/299177-new-s1r-firmware-update/?tab=comments#comment-3776452", "origin": "L-forum", "suborigin": "299177-new-s1r-firmware-update", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "according to panasonic (for the s1r). improved performance of the image stabilizer - the correction performance of the body image stabilizer has been improved from 5.5 stops to 6.0 stops. *1 - the correction performance of the dual i.s.2 has been improved from 6.0 stops to 6.5 stops. *2 *3 *1 based on the cipa standard [yaw/pitch direction : focusing distance f=50mm , when s-x50 is used.] *2 based on the cipa standard [yaw/pitch direction: focusing distance f=105mm, when s-r24105 is used.] *3 based on the cipa standard [yaw/pitch direction : focusing distance f=200mm , when s-r70200 is used.] -----> improved !!!  af performance - [af-on: near shift] and [af-on: far shift] functions have been added. [af-on: near shift] preferably focuses on a subject nearby while [af-on: far shift] preferably focuses on a subject far away. - the tracking performance when using [tracking] af mode in video recording has been improved. - live view display during auto focusing is now easier to see. improved operational stability - operational stability when using an xqd memory card has been improved. gordon", "sortedWord": "None", "Identifyer": null, "identifyer": 50212, "year": "2019"}, {"autor": "ron777", "date": "2019-07-12 03:56:00", "content": "6 hours ago, FlashGordonPhotography said: According to Panasonic (for the S1R). Improved performance of the Image Stabilizer - The correction performance of the Body Image Stabilizer has been improved from 5.5 stops to 6.0 stops. *1 - The correction performance of the Dual I.S.2 has been improved from 6.0 stops to 6.5 stops. *2 *3 *1 Based on the CIPA standard [Yaw/Pitch direction : focusing distance f=50mm , when S-X50 is used.] *2 Based on the CIPA standard [Yaw/Pitch direction: focusing distance f=105mm, when S-R24105 is used.] *3 Based on the CIPA standard [Yaw/Pitch direction : focusing distance f=200mm , when S-R70200 is used.] Improved AF performance - [AF-ON: Near Shift] and [AF-ON: Far Shift] functions have been added. [AF-ON: Near Shift] preferably focuses on a subject nearby while [AF-ON: Far Shift] preferably focuses on a subject far away. - The tracking performance when using [Tracking] AF mode in video recording has been improved. - Live view display during auto focusing is now easier to see. Improved operational stability - Operational stability when using an XQD memory card has been improved. Gordon Thank you, I had not encountered the explanation on the download page.", "link": "https://www.l-camera-forum.com/topic/299177-new-s1r-firmware-update/?tab=comments#comment-3776585", "origin": "L-forum", "suborigin": "299177-new-s1r-firmware-update", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "6 hours ago, flashgordonphotography said: according to panasonic (for the s1r). improved performance of the image stabilizer - the correction performance of the body image stabilizer has been improved from 5.5 stops to 6.0 stops. *1 - the correction performance of the dual i.s.2 has been improved from 6.0 stops to 6.5 stops. *2 *3 *1 based on the cipa standard [yaw/pitch direction : focusing distance f=50mm , when s-x50 is used.] *2 based on the cipa standard [yaw/pitch direction: focusing distance f=105mm, when s-r24105 is used.] *3 based on the cipa standard [yaw/pitch direction : focusing distance f=200mm , when s-r70200 is used.] -----> improved !!!  af performance - [af-on: near shift] and [af-on: far shift] functions have been added. [af-on: near shift] preferably focuses on a subject nearby while [af-on: far shift] preferably focuses on a subject far away. - the tracking performance when using [tracking] af mode in video recording has been improved. - live view display during auto focusing is now easier to see. improved operational stability - operational stability when using an xqd memory card has been improved. gordon thank you, i had not encountered the explanation on the download page.", "sortedWord": "None", "Identifyer": null, "identifyer": 50214, "year": "2019"}, {"autor": "Fedro", "date": "2019-06-19 19:15:00", "content": "4 hours ago, frame-it said: the mark 2 is not really an update..its what it should have been at the original x1d release sure, and ... so what? I have the original, it is an amazing camera, despite its shortcomings. Improved and at that price, it looks very good imho btw, I thought the 907x looks hot", "link": "https://www.l-camera-forum.com/topic/297697-007-vs-hassy-x1-d/page/4/?tab=comments#comment-3762623", "origin": "L-forum", "suborigin": "297697-007-vs-hassy-x1-d", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "4 hours ago, frame-it said: the mark 2 is not really an update..its what it should have been at the original x1d release sure, and ... so what? i have the original, it is an amazing camera, despite its shortcomings. -----> improved !!!  and at that price, it looks very good imho btw, i thought the 907x looks hot", "sortedWord": "None", "Identifyer": null, "identifyer": 26047, "year": "2019"}, {"autor": "albireo_double", "date": "2019-03-25 17:48:00", "content": "I really don't get where this hope for \"better AF\" comes from. From all that I have read and heard, the S3 will be the S007 with a new, higher resolution, higher DR, better colour sensor. Improved AF to me would mean multiple AF points, which I do not expect. I don't care if the present single AF point system focuses 10% faster, or even 25% faster (and that assuming it does not shred the \"permanent solution\" AF gears in the lenses). The reason I don't care is that I will not be able to use the camera in a different way. I will still have to focus and recompose, and for that way of working, the S007 is good enough as it is (ok, my S100 hunts and could be improved). Having multiple focus points would mean \"improved AF\" to me, but even then, like in pretty much all DSLRs, they would not cover enough of the viewfinder area to be hugely useful. In the sense, for example, that if I wish to place a person's eye, in a portrait shoot, in a \"rules of thirds\" position, I need to have a focusing point in that area. But that unfortunately is the domain of mirrorless now and very unlikely to change in the S3. Some kind of \"True Focus\" solution would also be useful, but I assume Leica would have boasted about it back in September if it were on the cards.", "link": "https://www.l-camera-forum.com/topic/294962-s007-now-or-s3-later/page/5/?tab=comments#comment-3709282", "origin": "L-forum", "suborigin": "294962-s007-now-or-s3-later", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "i really don't get where this hope for \"better af\" comes from. from all that i have read and heard, the s3 will be the s007 with a new, higher resolution, higher dr, better colour sensor. -----> improved !!!  af to me would mean multiple af points, which i do not expect. i don't care if the present single af point system focuses 10% faster, or even 25% faster (and that assuming it does not shred the \"permanent solution\" af gears in the lenses). the reason i don't care is that i will not be able to use the camera in a different way. i will still have to focus and recompose, and for that way of working, the s007 is good enough as it is (ok, my s100 hunts and could be improved). having multiple focus points would mean \"improved af\" to me, but even then, like in pretty much all dslrs, they would not cover enough of the viewfinder area to be hugely useful. in the sense, for example, that if i wish to place a person's eye, in a portrait shoot, in a \"rules of thirds\" position, i need to have a focusing point in that area. but that unfortunately is the domain of mirrorless now and very unlikely to change in the s3. some kind of \"true focus\" solution would also be useful, but i assume leica would have boasted about it back in september if it were on the cards.", "sortedWord": "None", "Identifyer": null, "identifyer": 30748, "year": "2019"}], "name": "Leicasortedout2019improve"}