{"interestingcomments": [{"autor": "AceVentura1986", "date": "2018-12-21 13:31:00", "content": "ME user here; bought mine in November, 2012. I have’t used it much in thE last few years as I tend to use my M9M much more. Owing to this, I’ve sort of developed a critical distance. I’ve recently culled through six years of photos for a Christmas gift, most shot indoors, between ISO 640 and 1250, and have an observation based on my photos. Shoot at 640 and you can push in Lightroom 2.5 stops, for an effective ISO of 3200. Shoot at 1250, and the phots just don’t look as good, even if you push only 1.5 stops, again to an effective ISO of 3200. This is true whether on-screen or in 4x6 prints. My photos shot at ISO 1250 and pushed 1.5 stops are generally inferior to my photos shot at 640 and pushed 2.5 stops in Lightroom. But, the 640 shots are completely usable up to an effective 3200. The culprit seems to be chroma noise and color fidelity. No matter what I did, 1250 pushed to 3200 yielded weird and spotty color, something not present in the 640 photos pushed to 3200. The 640 images had noticible luminance noise but it was very tight and random fairly much like film grain, but they demonstrated very little if any chroma noise. Also, the 1250 images seemed a bit flatter, something I attribute to substantially decreased dynamic range. Consequently, in my experience the ME is not a camera that is EFFECTIVELY limited to ISO 640 or even 800. It is a camera with DNGs that can EFFECTIVELY yield ISO 3200, provided you shoot RAW and keep the in-camera ISO to 640. The above applies to color photos. Converting to BW might extend the effective ISO, but I haven’t checked for this as I tend to use the M9M for BW work. As with all things photographic, YMMV. Edited December 21, 2018 by AceVentura1986", "link": "https://www.l-camera-forum.com/topic/291411-m9-or-q/?tab=comments#comment-3650751", "origin": "L-forum", "suborigin": "291411-m9-or-q", "result": true, "Selector": "i’ve sort of developed", "selectorShort": "develop", "MarkedSent": "me user here; bought mine in november, 2012. i have’t used it much in the last few years as i tend to use my m9m much more. owing to this, -----> i !!! ’ve -----> sort !!!  -----> of !!!  -----> developed !!!  a critical distance. i’ve recently culled through six years of photos for a christmas gift, most shot indoors, between iso 640 and 1250, and have an observation based on my photos. shoot at 640 and you can push in lightroom 2.5 stops, for an effective iso of 3200. shoot at 1250, and the phots just don’t look as good, even if you push only 1.5 stops, again to an effective iso of 3200. this is true whether on-screen or in 4x6 prints. my photos shot at iso 1250 and pushed 1.5 stops are generally inferior to my photos shot at 640 and pushed 2.5 stops in lightroom. but, the 640 shots are completely usable up to an effective 3200. the culprit seems to be chroma noise and color fidelity. no matter what i did, 1250 pushed to 3200 yielded weird and spotty color, something not present in the 640 photos pushed to 3200. the 640 images had noticible luminance noise but it was very tight and random fairly much like film grain, but they demonstrated very little if any chroma noise. also, the 1250 images seemed a bit flatter, something i attribute to substantially decreased dynamic range. consequently, in my experience the me is not a camera that is effectively limited to iso 640 or even 800. it is a camera with dngs that can effectively yield iso 3200, provided you shoot raw and keep the in-camera iso to 640. the above applies to color photos. converting to bw might extend the effective iso, but i haven’t checked for this as i tend to use the m9m for bw work. as with all things photographic, ymmv. edited december 21, 2018 by aceventura1986", "sortedWord": "None", "Identifyer": null, "identifyer": 36089, "year": "2018"}, {"autor": "Ko.Fe.", "date": "2018-12-23 18:25:00", "content": "On 12/21/2018 at 8:31 AM, AceVentura1986 said: ME user here; bought mine in November, 2012. I have’t used it much in thE last few years as I tend to use my M9M much more. Owing to this, I’ve sort of developed a critical distance. I’ve recently culled through six years of photos for a Christmas gift, most shot indoors, between ISO 640 and 1250, and have an observation based on my photos. Shoot at 640 and you can push in Lightroom 2.5 stops, for an effective ISO of 3200. Shoot at 1250, and the phots just don’t look as good, even if you push only 1.5 stops, again to an effective ISO of 3200. This is true whether on-screen or in 4x6 prints. My photos shot at ISO 1250 and pushed 1.5 stops are generally inferior to my photos shot at 640 and pushed 2.5 stops in Lightroom. But, the 640 shots are completely usable up to an effective 3200. The culprit seems to be chroma noise and color fidelity. No matter what I did, 1250 pushed to 3200 yielded weird and spotty color, something not present in the 640 photos pushed to 3200. The 640 images had noticible luminance noise but it was very tight and random fairly much like film grain, but they demonstrated very little if any chroma noise. Also, the 1250 images seemed a bit flatter, something I attribute to substantially decreased dynamic range. Consequently, in my experience the ME is not a camera that is EFFECTIVELY limited to ISO 640 or even 800. It is a camera with DNGs that can EFFECTIVELY yield ISO 3200, provided you shoot RAW and keep the in-camera ISO to 640. The above applies to color photos. Converting to BW might extend the effective ISO, but I haven’t checked for this as I tend to use the M9M for BW work. As with all things photographic, YMMV. Thank you for the info! I haven't gave up on OVF and on film yet. My M4-2 is my Monochrome. With ISO 400 film and f1.5 lens I'm not really limited by light expert very dark situations. I don't know how it works with M-E, but if I leave ISO and shutter on Auto it is often choosing low ISO and still sets moderate shutter speeds. It looks like comparing to another digital cameras, M-E is capable of handling low light under lower ISO. Two days ago we went to Rypley's Aquarium where we go few times per year. I have M-E set to 10MP JPEG1. It was going between 640 and 2500. Results were fine. With other cameras I have to keep it at 6400.... It looks like, if I'll get fast 35 lens (f1.4), then M-E will handle low light with 640 and 1250.", "link": "https://www.l-camera-forum.com/topic/291411-m9-or-q/?tab=comments#comment-3652130", "origin": "L-forum", "suborigin": "291411-m9-or-q", "result": true, "Selector": "i’ve sort of developed", "selectorShort": "develop", "MarkedSent": "on 12/21/2018 at 8:31 am, aceventura1986 said: me user here; bought mine in november, 2012. i have’t used it much in the last few years as i tend to use my m9m much more. owing to this, -----> i !!! ’ve -----> sort !!!  -----> of !!!  -----> developed !!!  a critical distance. i’ve recently culled through six years of photos for a christmas gift, most shot indoors, between iso 640 and 1250, and have an observation based on my photos. shoot at 640 and you can push in lightroom 2.5 stops, for an effective iso of 3200. shoot at 1250, and the phots just don’t look as good, even if you push only 1.5 stops, again to an effective iso of 3200. this is true whether on-screen or in 4x6 prints. my photos shot at iso 1250 and pushed 1.5 stops are generally inferior to my photos shot at 640 and pushed 2.5 stops in lightroom. but, the 640 shots are completely usable up to an effective 3200. the culprit seems to be chroma noise and color fidelity. no matter what i did, 1250 pushed to 3200 yielded weird and spotty color, something not present in the 640 photos pushed to 3200. the 640 images had noticible luminance noise but it was very tight and random fairly much like film grain, but they demonstrated very little if any chroma noise. also, the 1250 images seemed a bit flatter, something i attribute to substantially decreased dynamic range. consequently, in my experience the me is not a camera that is effectively limited to iso 640 or even 800. it is a camera with dngs that can effectively yield iso 3200, provided you shoot raw and keep the in-camera iso to 640. the above applies to color photos. converting to bw might extend the effective iso, but i haven’t checked for this as i tend to use the m9m for bw work. as with all things photographic, ymmv. thank you for the info! i haven't gave up on ovf and on film yet. my m4-2 is my monochrome. with iso 400 film and f1.5 lens i'm not really limited by light expert very dark situations. i don't know how it works with m-e, but if i leave iso and shutter on auto it is often choosing low iso and still sets moderate shutter speeds. it looks like comparing to another digital cameras, m-e is capable of handling low light under lower iso. two days ago we went to rypley's aquarium where we go few times per year. i have m-e set to 10mp jpeg1. it was going between 640 and 2500. results were fine. with other cameras i have to keep it at 6400.... it looks like, if i'll get fast 35 lens (f1.4), then m-e will handle low light with 640 and 1250.", "sortedWord": "None", "Identifyer": null, "identifyer": 36091, "year": "2018"}, {"autor": "jmahto", "date": "2018-09-10 15:32:00", "content": "Say hello to my cat Lonzo --img-- M2, 50lux ASPH. Tri-X 400. Developed in DD-X (1+4)--img-- ", "link": "https://www.l-camera-forum.com/topic/284086-leica-m-film-photos-feel-free-to-share-yours/page/10/?tab=comments#comment-3590721", "origin": "L-forum", "suborigin": "284086-leica-m-film-photos-feel-free-to-share-yours", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "say hello to my cat lonzo --img-- m2, 50lux asph. tri-x 400. -----> developed !!!  in dd-x (1+4)--img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 47881, "year": "2018"}, {"autor": "ianman", "date": "2018-10-06 19:08:00", "content": " These are wonderful. Thanks for posting examples using HC110. Did you do much cropping? I ask because of how it can magnify grain. Thanks! The top one wasn't cropped. The second was slightly rotated to straighten it and then cropped. Here is the original scan: --img--  I developed in HC100 at 1+95 using undiluted concentrate, for 14 minutes @ 20°C. I can't really be of any help regarding agitation as I us a Rodinax which required constant rotation.", "link": "https://www.l-camera-forum.com/topic/284086-leica-m-film-photos-feel-free-to-share-yours/page/14/?tab=comments#comment-3607645", "origin": "L-forum", "suborigin": "284086-leica-m-film-photos-feel-free-to-share-yours", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": " these are wonderful. thanks for posting examples using hc110. did you do much cropping? i ask because of how it can magnify grain. thanks! the top one wasn't cropped. the second was slightly rotated to straighten it and then cropped. here is the original scan: --img--  -----> i !!!  -----> developed !!!  in hc100 at 1+95 using undiluted concentrate, for 14 minutes @ 20°c. i can't really be of any help regarding agitation as i us a rodinax which required constant rotation.", "sortedWord": "None", "Identifyer": null, "identifyer": 47949, "year": "2018"}, {"autor": "Exodies", "date": "2018-12-30 18:05:00", "content": "I thought surely, it should be \"Les\". It was only when I started developing this shot that I figured out what they were trying to say... --img--  M typ 240, Apo-Summicron-M 1:2/50 ASPH.", "link": "https://www.l-camera-forum.com/topic/269584-the-silly-sign-department-post-your-silly-signs-here/page/15/?tab=comments#comment-3655546", "origin": "L-forum", "suborigin": "269584-the-silly-sign-department-post-your-silly-signs-here", "result": true, "Selector": "i started developing", "selectorShort": "develop", "MarkedSent": "i thought surely, it should be \"les\". it was only when -----> i !!!  -----> started !!!  -----> developing !!!  this shot that -----> i !!!  figured out what they were trying to say... --img--  m typ 240, apo-summicron-m 1:2/50 asph.", "sortedWord": "None", "Identifyer": null, "identifyer": 63350, "year": "2018"}, {"autor": "Chaemono", "date": "2018-06-07 01:31:00", "content": "\"Now you have two bodies but they use the same lens system. And you can use this lens system because the mount we developed here we already had the SL in mind.\" Then he points to the mount of the TL2 in his hand. \"This mount will also...this has much more opportunities than you see here at the moment.\" Complete the sentence “This mount will also...” A...be used for more L-mount lenses (I would have never guessed. Please, keep it a secret, Dr. Kaufmann). B...be used for the TL3 (Can’t wait for June 14 to be confirmed). C...be used for another FF body. D...be used for a MF mirrorless body in the future (now that’s more opportunities than we can see there ‘at the moment’). Edited June 7, 2018 by Chaemono", "link": "https://www.l-camera-forum.com/topic/285080-leica-cm-ml-new-leica-mirrorless-announcement/page/12/?tab=comments#comment-3533088", "origin": "L-forum", "suborigin": "285080-leica-cm-ml-new-leica-mirrorless-announcement", "result": true, "Selector": "we developed", "selectorShort": "develop", "MarkedSent": "\"now you have two bodies but they use the same lens system. and you can use this lens system because the mount -----> we !!!  -----> developed !!!  here -----> we !!!  already had the sl in mind.\" then he points to the mount of the tl2 in his hand. \"this mount will also...this has much more opportunities than you see here at the moment.\" complete the sentence “this mount will also...” a...be used for more l-mount lenses (i would have never guessed. please, keep it a secret, dr. kaufmann). b...be used for the tl3 (can’t wait for june 14 to be confirmed). c...be used for another ff body. d...be used for a mf mirrorless body in the future (now that’s more opportunities than we can see there ‘at the moment’). edited june 7, 2018 by chaemono", "sortedWord": "None", "Identifyer": null, "identifyer": 78546, "year": "2018"}, {"autor": "Guest VVJ", "date": "2018-06-07 23:47:00", "content": "\"Now you have two bodies but they use the same lens system. And you can use this lens system because the mount we developed here we already had the SL in mind.\" Then he points to the mount of the TL2 in his hand. \"This mount will also...this has much more opportunities than you see here at the moment.\" Complete the sentence “This mount will also...” A...be used for more L-mount lenses (I would have never guessed. Please, keep it a secret, Dr. Kaufmann). B...be used for the TL3 (Can’t wait for June 14 to be confirmed). C...be used for another FF body. D...be used for a MF mirrorless body in the future (now that’s more opportunities than we can see there ‘at the moment’). B seems pretty unlikely as Leica already seems to have forgotten that there is such a thing as a TL system... From their website: \"The new Leica SF 60 system flash is a compact powerhouse for Leica Cameras designed especially for the models of the S, SL, and M series. It is also fully compatible with the Leica Q and CL, for which it also offers TTL flash exposure control. The SF 60 is an extremely compact and powerful flash unit with an outstanding range of features, and is among the lightest and smallest of its performance class.\"", "link": "https://www.l-camera-forum.com/topic/285080-leica-cm-ml-new-leica-mirrorless-announcement/page/12/?tab=comments#comment-3533604", "origin": "L-forum", "suborigin": "285080-leica-cm-ml-new-leica-mirrorless-announcement", "result": true, "Selector": "we developed", "selectorShort": "develop", "MarkedSent": "\"now you have two bodies but they use the same lens system. and you can use this lens system because the mount -----> we !!!  -----> developed !!!  here -----> we !!!  already had the sl in mind.\" then he points to the mount of the tl2 in his hand. \"this mount will also...this has much more opportunities than you see here at the moment.\" complete the sentence “this mount will also...” a...be used for more l-mount lenses (i would have never guessed. please, keep it a secret, dr. kaufmann). b...be used for the tl3 (can’t wait for june 14 to be confirmed). c...be used for another ff body. d...be used for a mf mirrorless body in the future (now that’s more opportunities than we can see there ‘at the moment’). b seems pretty unlikely as leica already seems to have forgotten that there is such a thing as a tl system... from their website: \"the new leica sf 60 system flash is a compact powerhouse for leica cameras designed especially for the models of the s, sl, and m series. it is also fully compatible with the leica q and cl, for which it also offers ttl flash exposure control. the sf 60 is an extremely compact and powerful flash unit with an outstanding range of features, and is among the lightest and smallest of its performance class.\"", "sortedWord": "None", "Identifyer": null, "identifyer": 78554, "year": "2018"}, {"autor": "Stealth3kpl", "date": "2018-10-20 18:16:00", "content": "I also shoot colour c41 a stop over. I can't think how I've been developing my B+W for 250 rather than 400 for so long. I'm sure developing for 400 is the right thing to try looking at my scans, but I must make more of an effort to expose for the darkest of the shadows, I think. Take this one for instance. I was quite sure I'd found the darkest incident reading to expose for, but it is still quite underexposed beneath the chin giving that grainy look when I try to bring the brightness up. Pete --img--  Edited October 20, 2018 by Stealth3kpl", "link": "https://www.l-camera-forum.com/topic/290699-have-i-had-an-epiphany/?tab=comments#comment-3616183", "origin": "L-forum", "suborigin": "290699-have-i-had-an-epiphany", "result": true, "Selector": "i've been developing", "selectorShort": "develop", "MarkedSent": "i also shoot colour c41 a stop over. -----> i !!!  can't think how -----> i !!! 've -----> been !!!  -----> developing !!!  my b+w for 250 rather than 400 for so long. i'm sure developing for 400 is the right thing to try looking at my scans, but i must make more of an effort to expose for the darkest of the shadows, i think. take this one for instance. i was quite sure i'd found the darkest incident reading to expose for, but it is still quite underexposed beneath the chin giving that grainy look when i try to bring the brightness up. pete --img--  edited october 20, 2018 by stealth3kpl", "sortedWord": "None", "Identifyer": null, "identifyer": 103720, "year": "2018"}, {"autor": "wlaidlaw", "date": "2018-07-16 16:55:00", "content": "I will stick to my pair of Rondinax daylight tanks. Admittedly the #60 MF tank does not always remove the backing paper as it should and I have to do a bit of fiddling in a changing bag but I develop so little 120, I will live with it. My 35U works perfectly and only taking 200ml of liquid is very economical. On a different point has anyone tried the Ars Imago single processor developer/fixer yet. I have bought a pair of the A&B bottles but have not got round to using them yet. Someone on RFF posted that they found extra fixing was needed for perfect clearing, which rather negates the whole point of a single process. I am waiting until I have around 6 rolls of B&W ready to go before I mix the A & B liquids up, as they have a short life when mixed. Wilson", "link": "https://www.l-camera-forum.com/topic/286635-film-processing/?tab=comments#comment-3556967", "origin": "L-forum", "suborigin": "286635-film-processing", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i will stick to my pair of rondinax daylight tanks. admittedly the #60 mf tank does not always remove the backing paper as it should and i have to do a bit of fiddling in a changing bag but -----> i !!!  -----> develop !!!  so little 120, -----> i !!!  will live with it. my 35u works perfectly and only taking 200ml of liquid is very economical. on a different point has anyone tried the ars imago single processor developer/fixer yet. i have bought a pair of the a&b bottles but have not got round to using them yet. someone on rff posted that they found extra fixing was needed for perfect clearing, which rather negates the whole point of a single process. i am waiting until i have around 6 rolls of b&w ready to go before i mix the a & b liquids up, as they have a short life when mixed. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 104062, "year": "2018"}, {"autor": "RayD28", "date": "2018-02-22 01:19:00", "content": "I should have mentioned that I am new to developing film. This shot was from the second batch I've ever developed. More/stronger inversions should increase contrast (and perhaps increase the grain a little).I usually invert quite energetically, following the standard pattern of continuous inversión for one minute then four to five inversions each minute thereafter. However, small variations in the inversion pattern have neve seemed to make much difference. Maybe you just need to develop the film for slightly more time or increase the exposure a fraction?And if you are not wet-printing, there is plenty of scope to adjust things in post-processing, particularly if the negatives look good before they are scanned... Thanks for the input on inversions. I plan to do some post-processing but wanted to show the shot before I do so I could get input on the raw shot. HP5+ is not a fine grain fim generally speaking. In my opinion a different agitation wouldn’t bring any improvement for that. You can try another developer like Microphen as well, but do not expect any fine grain results. It’s a wrong film for that Thanks. I'll stick with current film and chemistry for a while until I get the hang of things. I mainly posted the questions so I don't learn bad habits. If you had been printing the image with an enlarger you would have chosen a harder paper grade to print on if you wanted more contrast. Yes, it's true, decisions needed to be made in the 'good old days'. It's a shame Lightroom won't let you do something similar, like an 'Auto Contrast' button if you want your decisions automated, or a slider to adjust contrast. To me the negative looks fine in terms of 'fresh out of the scanner' contrast. All the tones are there and all that needs doing is to adjust them, if only. You are never going to get fine grain from HP5, in this image it looks normal considering. Thanks for your input. I appreciate knowing that you believe this shot is representative of what the film can do. Ummm.. My Lightroom has contrast, highlights, shadows, blacks, whites, clarity and dehaze sliders. Why can't it control contrast and tonal scales? I'll post a post-processed shot with some minor adjustments. After scanning a B&W negative (no matter which film), you often have to slightly add more contrast to the final digitized image. Sometimes level adjustments are also beneficial. Regarding grain, this one looks pretty good to me for an HP5+ 400 film photo - still a lot better than Tri-X IMO --img-- . For lower grain, you could use Xtol developer which is rich in sulfites suppressing more severe grain formation. If this is still too much, switch to FP4+ 125 film - one of my favorite B&W films so far. Thanks for believing the grain looks ok. Small differences in agitation don’t matter. Just be consistent – that does matter. I agitate constantly for the first 30 or so seconds. I then agitate for 10 seconds every minute – this generally means 4 inversions. I usually tap the tank on the sink just in case there are any bubbles. I also don't fill that tank to the top - I want some room for the liquid to move. “and made no adjustments” – you have abandoned the most important tool you have in making a good picture. You need to assess from a creative perspective how the picture looks and what you want from it. In a conventional darkroom you would make a series of prints that would get you to your goal step by step – you can do the same electronically. A little more contrast should be easily achieved from any software. If your picture looks flat – fix it. “made no adjustments” is like playing Mozart without tuning your violin. Straight-out-of-the-camera is almost always a mistake. No famous picture ever succeeded without a good printer behind it (and that includes digital pictures improved by software). I'll post a post-processed shot. Thanks again to all of you.", "link": "https://www.l-camera-forum.com/topic/282040-need-help-troubleshooting-developing-technique/?tab=comments#comment-3466400", "origin": "L-forum", "suborigin": "282040-need-help-troubleshooting-developing-technique", "result": true, "Selector": "i've ever developed", "selectorShort": "develop", "MarkedSent": "i should have mentioned that i am new to developing film. this shot was from the second batch -----> i !!! 've -----> ever !!!  -----> developed !!! . more/stronger inversions should increase contrast (and perhaps increase the grain a little).i usually invert quite energetically, following the standard pattern of continuous inversión for one minute then four to five inversions each minute thereafter. however, small variations in the inversion pattern have neve seemed to make much difference. maybe you just need to develop the film for slightly more time or increase the exposure a fraction?and if you are not wet-printing, there is plenty of scope to adjust things in post-processing, particularly if the negatives look good before they are scanned... thanks for the input on inversions. i plan to do some post-processing but wanted to show the shot before i do so i could get input on the raw shot. hp5+ is not a fine grain fim generally speaking. in my opinion a different agitation wouldn’t bring any improvement for that. you can try another developer like microphen as well, but do not expect any fine grain results. it’s a wrong film for that thanks. i'll stick with current film and chemistry for a while until i get the hang of things. i mainly posted the questions so i don't learn bad habits. if you had been printing the image with an enlarger you would have chosen a harder paper grade to print on if you wanted more contrast. yes, it's true, decisions needed to be made in the 'good old days'. it's a shame lightroom won't let you do something similar, like an 'auto contrast' button if you want your decisions automated, or a slider to adjust contrast. to me the negative looks fine in terms of 'fresh out of the scanner' contrast. all the tones are there and all that needs doing is to adjust them, if only. you are never going to get fine grain from hp5, in this image it looks normal considering. thanks for your input. i appreciate knowing that you believe this shot is representative of what the film can do. ummm.. my lightroom has contrast, highlights, shadows, blacks, whites, clarity and dehaze sliders. why can't it control contrast and tonal scales? i'll post a post-processed shot with some minor adjustments. after scanning a b&w negative (no matter which film), you often have to slightly add more contrast to the final digitized image. sometimes level adjustments are also beneficial. regarding grain, this one looks pretty good to me for an hp5+ 400 film photo - still a lot better than tri-x imo --img-- . for lower grain, you could use xtol developer which is rich in sulfites suppressing more severe grain formation. if this is still too much, switch to fp4+ 125 film - one of my favorite b&w films so far. thanks for believing the grain looks ok. small differences in agitation don’t matter. just be consistent – that does matter. i agitate constantly for the first 30 or so seconds. i then agitate for 10 seconds every minute – this generally means 4 inversions. i usually tap the tank on the sink just in case there are any bubbles. i also don't fill that tank to the top - i want some room for the liquid to move. “and made no adjustments” – you have abandoned the most important tool you have in making a good picture. you need to assess from a creative perspective how the picture looks and what you want from it. in a conventional darkroom you would make a series of prints that would get you to your goal step by step – you can do the same electronically. a little more contrast should be easily achieved from any software. if your picture looks flat – fix it. “made no adjustments” is like playing mozart without tuning your violin. straight-out-of-the-camera is almost always a mistake. no famous picture ever succeeded without a good printer behind it (and that includes digital pictures improved by software). i'll post a post-processed shot. thanks again to all of you.", "sortedWord": "None", "Identifyer": null, "identifyer": 105470, "year": "2018"}, {"autor": "otto.f", "date": "2018-10-04 06:37:00", "content": "I don’t think you can determine ISO and developer time and strength on the basis of scans. Scanners have much more tolerance than enlargers and paper, also because you judge the image on a screen which is like a transparency. Shadows are much sooner problematic in prints than on a screen. Developing times delivered by Kodak and in the Massive Chart are meant for wet prints and in my view these times seem to be given for condensor enlargers, because you mostly get quite soft negatives. A development time of 3:75 that Kodak gives is too short anyway. You shouldn’t go shorter than 6 minutes in my view because all the little variations in temperature, solution and especially agitation are becoming relatively too important in such a short time. So in that case the dilution should be adjusted. I don’t understand actually why you would want ISO 200 with TriX in the first place, did you read that somewhere? In principle, nobody can tell you what your ISO should be in your system with your incident metering. I have two Gossen’s, a Digisix and a Sixtomat F2, both quite new, and they give with incident reading 2/3 stop difference, systematically. In my system a TriX is well served with ISO400 in HC110 - B for 6:30. I have a cold light head and even then these negatives are on the soft side, with no risk of loosing shadow detail. In my judgement your solution E was too weak for these exposures, I miss deep blacks. Edited October 4, 2018 by otto.f", "link": "https://www.l-camera-forum.com/topic/278723-tri-x-200-in-hc-110/page/2/?tab=comments#comment-3605985", "origin": "L-forum", "suborigin": "278723-tri-x-200-in-hc-110", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "i don’t think you can determine iso and developer time and strength on the basis of scans. scanners have much more tolerance than enlargers and paper, also because you judge the image on a screen which is like a transparency. shadows are much sooner problematic in prints than on a screen. -----> developing !!!  times delivered by kodak and in the massive chart are meant for wet prints and in my view these times seem to be given for condensor enlargers, because you mostly get quite soft negatives. a development time of 3:75 that kodak gives is too short anyway. you shouldn’t go shorter than 6 minutes in my view because all the little variations in temperature, solution and especially agitation are becoming relatively too important in such a short time. so in that case the dilution should be adjusted. i don’t understand actually why you would want iso 200 with trix in the first place, did you read that somewhere? in principle, nobody can tell you what your iso should be in your system with your incident metering. i have two gossen’s, a digisix and a sixtomat f2, both quite new, and they give with incident reading 2/3 stop difference, systematically. in my system a trix is well served with iso400 in hc110 - b for 6:30. i have a cold light head and even then these negatives are on the soft side, with no risk of loosing shadow detail. in my judgement your solution e was too weak for these exposures, i miss deep blacks. edited october 4, 2018 by otto.f", "sortedWord": "None", "Identifyer": null, "identifyer": 105518, "year": "2018"}, {"autor": "Stealth3kpl", "date": "2018-10-04 08:20:00", "content": "I don’t think you can determine ISO and developer time and strength on the basis of scans. Scanners have much more tolerance than enlargers and paper, also because you judge the image on a screen which is like a transparency. Shadows are much sooner problematic in prints than on a screen. Developing times delivered by Kodak and in the Massive Chart are meant for wet prints and in my view these times seem to be given for condensor enlargers, because you mostly get quite soft negatives. A development time of 3:75 that Kodak gives is too short anyway. You shouldn’t go shorter than 6 minutes in my view because all the little variations in temperature, solution and especially agitation are becoming relatively too important in such a short time. So in that case the dilution should be adjusted. I don’t understand actually why you would want ISO 200 with TriX in the first place, did you read that somewhere? In principle, nobody can tell you what your ISO should be in your system with your incident metering. I have two Gossen’s, a Digisix and a Sixtomat F2, both quite new, and they give with incident reading 2/3 stop difference, systematically. In my system a TriX is well served with ISO400 in HC110 - B for 6:30. I have a cold light head and even then these negatives are on the soft side, with no risk of loosing shadow detail. In my judgement your solution E was too weak for these exposures, I miss deep blacks. Hi Otto, Thanks for your informative post. It's my first time with HC110 and I had difficulty deciding what dilution to use to give at least 6ml per film (3 in the tank) but also give me a long development time (I would prefer longer than 7 mins). It's interesting what you say about different meters giving different readings. Another potential problem I have is my 4 thermometers, two of which are Patterson, disagree! I think I've run it through at 250 to ensure shadow detail thinking I can always darken things in post processing. Also, I've heard people saying they've settled on 320 as the true speed of TriX so I've been reluctant to shoot it faster than that. For example, if shooting sunny 16 and it's bright sunlight, should the shutter be set to 1/500 at f16, or 1/250? So I run the whole film at 250 and try to process accordingly. I take your point though. I'm starting a new film of Neopan 400 today so I think I will set the meter to 400 and see how it develops/scans. Pete", "link": "https://www.l-camera-forum.com/topic/278723-tri-x-200-in-hc-110/page/2/?tab=comments#comment-3606031", "origin": "L-forum", "suborigin": "278723-tri-x-200-in-hc-110", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "i don’t think you can determine iso and developer time and strength on the basis of scans. scanners have much more tolerance than enlargers and paper, also because you judge the image on a screen which is like a transparency. shadows are much sooner problematic in prints than on a screen. -----> developing !!!  times delivered by kodak and in the massive chart are meant for wet prints and in my view these times seem to be given for condensor enlargers, because you mostly get quite soft negatives. a development time of 3:75 that kodak gives is too short anyway. you shouldn’t go shorter than 6 minutes in my view because all the little variations in temperature, solution and especially agitation are becoming relatively too important in such a short time. so in that case the dilution should be adjusted. i don’t understand actually why you would want iso 200 with trix in the first place, did you read that somewhere? in principle, nobody can tell you what your iso should be in your system with your incident metering. i have two gossen’s, a digisix and a sixtomat f2, both quite new, and they give with incident reading 2/3 stop difference, systematically. in my system a trix is well served with iso400 in hc110 - b for 6:30. i have a cold light head and even then these negatives are on the soft side, with no risk of loosing shadow detail. in my judgement your solution e was too weak for these exposures, i miss deep blacks. hi otto, thanks for your informative post. it's my first time with hc110 and i had difficulty deciding what dilution to use to give at least 6ml per film (3 in the tank) but also give me a long development time (i would prefer longer than 7 mins). it's interesting what you say about different meters giving different readings. another potential problem i have is my 4 thermometers, two of which are patterson, disagree! i think i've run it through at 250 to ensure shadow detail thinking i can always darken things in post processing. also, i've heard people saying they've settled on 320 as the true speed of trix so i've been reluctant to shoot it faster than that. for example, if shooting sunny 16 and it's bright sunlight, should the shutter be set to 1/500 at f16, or 1/250? so i run the whole film at 250 and try to process accordingly. i take your point though. i'm starting a new film of neopan 400 today so i think i will set the meter to 400 and see how it develops/scans. pete", "sortedWord": "None", "Identifyer": null, "identifyer": 105520, "year": "2018"}, {"autor": "TomB_tx", "date": "2018-09-26 00:33:00", "content": "I’ve developed my own since the 1960s, with a 25 year break until 2010 when I started up again. B&W is easy. I use stainless tanks and reels, load film onto reels in a changing bag, and now use 1-shot developer (usually Rodinal) to do a roll or so a week. I mainly scan negatives now, and only wet print when I get something exceptional. I keep a couple of gallons of filtered water for mixing and rinsing film to keep all at room temperature.", "link": "https://www.l-camera-forum.com/topic/289848-might-bite-the-bullet-and-start-to-do-my-own-film-developing/?tab=comments#comment-3599981", "origin": "L-forum", "suborigin": "289848-might-bite-the-bullet-and-start-to-do-my-own-film-developing", "result": true, "Selector": "i’ve developed", "selectorShort": "develop", "MarkedSent": "-----> i !!! ’ve -----> developed !!!  my own since the 1960s, with a 25 year break until 2010 when -----> i !!!  started up again. b&w is easy. i use stainless tanks and reels, load film onto reels in a changing bag, and now use 1-shot developer (usually rodinal) to do a roll or so a week. i mainly scan negatives now, and only wet print when i get something exceptional. i keep a couple of gallons of filtered water for mixing and rinsing film to keep all at room temperature.", "sortedWord": "None", "Identifyer": null, "identifyer": 105524, "year": "2018"}, {"autor": "logan2z", "date": "2018-09-26 00:42:00", "content": "I’ve developed my own since the 1960s, with a 25 year break until 2010 when I started up again. B&W is easy. I use stainless tanks and reels, load film onto reels in a changing bag, and now use 1-shot developer (usually Rodinal) to do a roll or so a week. I mainly scan negatives now, and only wet print when I get something exceptional. I keep a couple of gallons of filtered water for mixing and rinsing film to keep all at room temperature. If I only wet printed when I got something exceptional my enlarger would be covered in cob webs --img--  Thanks for the input on the ease of B&W developing. I think I'm going to give it a shot. Any recommendations for a good, available stainless tank and reels? I keep reading reviews of the popular ones (eg. Paterson) but people complain that the tanks leak.", "link": "https://www.l-camera-forum.com/topic/289848-might-bite-the-bullet-and-start-to-do-my-own-film-developing/?tab=comments#comment-3599983", "origin": "L-forum", "suborigin": "289848-might-bite-the-bullet-and-start-to-do-my-own-film-developing", "result": true, "Selector": "i’ve developed", "selectorShort": "develop", "MarkedSent": "-----> i !!! ’ve -----> developed !!!  my own since the 1960s, with a 25 year break until 2010 when -----> i !!!  started up again. b&w is easy. i use stainless tanks and reels, load film onto reels in a changing bag, and now use 1-shot developer (usually rodinal) to do a roll or so a week. i mainly scan negatives now, and only wet print when i get something exceptional. i keep a couple of gallons of filtered water for mixing and rinsing film to keep all at room temperature. if i only wet printed when i got something exceptional my enlarger would be covered in cob webs --img--  thanks for the input on the ease of b&w developing. i think i'm going to give it a shot. any recommendations for a good, available stainless tank and reels? i keep reading reviews of the popular ones (eg. paterson) but people complain that the tanks leak.", "sortedWord": "None", "Identifyer": null, "identifyer": 105525, "year": "2018"}, {"autor": "Ko.Fe.", "date": "2018-09-26 22:53:00", "content": "I push to print. I was scanning for couple of years after learning how to develop BW, but once I start printing, I develop for printing, not scanning. Here is some conclusion about developing for scanning to be different from developing for printing. My negatives developed for printing do not scan well sometimes. Too dense, I guess.", "link": "https://www.l-camera-forum.com/topic/289519-pushing-a-film-in-dev-same-as-boosting-exposure-in-scanningpp/page/2/?tab=comments#comment-3600914", "origin": "L-forum", "suborigin": "289519-pushing-a-film-in-dev-same-as-boosting-exposure-in-scanningpp", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i push to print. -----> i !!!  was scanning for couple of years after learning how to -----> develop !!!  bw, but once -----> i !!!  start printing, -----> i !!!  -----> develop !!!  for printing, not scanning. here is some conclusion about developing for scanning to be different from developing for printing. my negatives developed for printing do not scan well sometimes. too dense, i guess.", "sortedWord": "None", "Identifyer": null, "identifyer": 105563, "year": "2018"}, {"autor": "jmahto", "date": "2018-09-26 23:28:00", "content": "I push to print. I was scanning for couple of years after learning how to develop BW, but once I start printing, I develop for printing, not scanning. Here is some conclusion about developing for scanning to be different from developing for printing. My negatives developed for printing do not scan well sometimes. Too dense, I guess. I can see that (from other discussions) I can get away with variation in development due to adjustments possible in scanning.", "link": "https://www.l-camera-forum.com/topic/289519-pushing-a-film-in-dev-same-as-boosting-exposure-in-scanningpp/page/2/?tab=comments#comment-3600926", "origin": "L-forum", "suborigin": "289519-pushing-a-film-in-dev-same-as-boosting-exposure-in-scanningpp", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i push to print. -----> i !!!  was scanning for couple of years after learning how to -----> develop !!!  bw, but once -----> i !!!  start printing, -----> i !!!  -----> develop !!!  for printing, not scanning. here is some conclusion about developing for scanning to be different from developing for printing. my negatives developed for printing do not scan well sometimes. too dense, i guess. i can see that (from other discussions) i can get away with variation in development due to adjustments possible in scanning.", "sortedWord": "None", "Identifyer": null, "identifyer": 105565, "year": "2018"}, {"autor": "pico", "date": "2018-09-15 23:33:00", "content": "I find this is a good article on stand developing: http://jbhildebrand.com/2011/tutorials/workflow-tutorial-2-stand-development-with-rodinal/ What works for me is: 6 ml of stock to 600 ml of water. Develop 1 hr. One hour is not necessary because the developer (Rodinal at 1:100 dilution) is largely exhausted in 35 minutes or less and exhaustion is what stand development is about. Edited September 15, 2018 by pico", "link": "https://www.l-camera-forum.com/topic/192945-stand-development/page/2/?tab=comments#comment-3593788", "origin": "L-forum", "suborigin": "192945-stand-development", "result": true, "Selector": "develop", "selectorShort": "develop", "MarkedSent": "i find this is a good article on stand developing: http://jbhildebrand.com/2011/tutorials/workflow-tutorial-2-stand-development-with-rodinal/ what works for me is: 6 ml of stock to 600 ml of water. -----> develop !!!  1 hr. one hour is not necessary because the developer (rodinal at 1:100 dilution) is largely exhausted in 35 minutes or less and exhaustion is what stand development is about. edited september 15, 2018 by pico", "sortedWord": "None", "Identifyer": null, "identifyer": 105596, "year": "2018"}, {"autor": "jmahto", "date": "2018-08-18 05:33:00", "content": " Well, my road trip through western states of USA is coming to an end and I shot exclusively TMax100 and Ektar 100, leaving my M240 at home. I will be developing TMax100 myself and will be following timings from massive development chart. I am a newbie at development and so far processed only one film (HP5 at 400) with reasonable success. I have DD-X and planning to use it for TMax100. Since it is my first TMax100 processing (shot at 100), I am thinking it will be best to process a sample section of my roll first to test before I commit to rest. Any advise from knowledgeable forum members will be appreciated.", "link": "https://www.l-camera-forum.com/topic/287595-now-what/?tab=comments#comment-3574285", "origin": "L-forum", "suborigin": "287595-now-what", "result": true, "Selector": "i will be developing", "selectorShort": "develop", "MarkedSent": " well, my road trip through western states of usa is coming to an end and i shot exclusively tmax100 and ektar 100, leaving my m240 at home. -----> i !!!  -----> will !!!  -----> be !!!  -----> developing !!!  tmax100 myself and -----> will !!!  -----> be !!!  following timings from massive development chart. i am a newbie at development and so far processed only one film (hp5 at 400) with reasonable success. i have dd-x and planning to use it for tmax100. since it is my first tmax100 processing (shot at 100), i am thinking it will be best to process a sample section of my roll first to test before i commit to rest. any advise from knowledgeable forum members will be appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 105612, "year": "2018"}, {"autor": "jmahto", "date": "2018-08-18 15:32:00", "content": "I am not sure if you are going about this the right way. I think you need practical help from someone near you. If you are new to developing film, you are also new to judging the outcome. Of course Adan here is right: just shoot another film at home and develop half of that film. When the film is dry you need to decide how good it is and I think this is where you should involve someone with experience. There are so many factors to consider. Best would be to then make (or have them made) a couple of small prints. Too hard, too soft? Lighter along the edges, so many things you can see right away . . . then, if you can improve, you develop the second half of the test roll and make adjustments (agitate more, or less, develop longer, or shorter, etc). After that you will have a much better idea how to develop the important bunch of films. Still, starting out I would use a single film tank first. When it goes well you can do more films at the time . . . Thanks for the advice. Unfortunately I don't have anyone who can guide me locally that's why internet is my only friend. I am going to do test roll first as you and others suggested. Based on Kodak data sheets and other sources, it seems that I can be off 10-20% and may still salvage it. I will be developing for scanning and I can do the further adjustments digitally. I will post results after I am done.", "link": "https://www.l-camera-forum.com/topic/287595-now-what/?tab=comments#comment-3574538", "origin": "L-forum", "suborigin": "287595-now-what", "result": true, "Selector": "i will be developing", "selectorShort": "develop", "MarkedSent": "i am not sure if you are going about this the right way. i think you need practical help from someone near you. if you are new to developing film, you are also new to judging the outcome. of course adan here is right: just shoot another film at home and develop half of that film. when the film is dry you need to decide how good it is and i think this is where you should involve someone with experience. there are so many factors to consider. best would be to then make (or have them made) a couple of small prints. too hard, too soft? lighter along the edges, so many things you can see right away . . . then, if you can improve, you develop the second half of the test roll and make adjustments (agitate more, or less, develop longer, or shorter, etc). after that you will have a much better idea how to develop the important bunch of films. still, starting out i would use a single film tank first. when it goes well you can do more films at the time . . . thanks for the advice. unfortunately i don't have anyone who can guide me locally that's why internet is my only friend. i am going to do test roll first as you and others suggested. based on kodak data sheets and other sources, it seems that i can be off 10-20% and may still salvage it. -----> i !!!  -----> will !!!  -----> be !!!  -----> developing !!!  for scanning and -----> i !!!  can do the further adjustments digitally. i will post results after i am done.", "sortedWord": "None", "Identifyer": null, "identifyer": 105617, "year": "2018"}, {"autor": "Ko.Fe.", "date": "2018-08-06 16:55:00", "content": "I’m not sure what this is but: If I remember well DDX is a syrop just like HC-110. With HC110 I know from experience that it is very important to shake very well and quite long before the final solution is homogene. You can see that when you hold it to the light, strings of syrop have to be gone after sufficient shaking. With HC110 you make first a stock solution of 1+4 before coming to solution B (1+31). I never used DDX, but HC-110 is my only developer for 400 films, which I use most, except 100 film in summer time. I never bother to dilute and using it straight from the bottle for years. I pure it to the medicine cap to measure. Say, 10ML, then I add water into this cap and drop it to the measuring cylinder where I have 150ML or so water added. This is then it gets gobbles. But steering cylinder with one hand deals with it and then I add water into medicine cap to flush the rest to HC-110 into mixing cylinder. It is has to be done five or so times and then I add water into cylinder to have right mix. By the time it is gone, mix is even. I develop this way for years now and dozens of 30 meters bulks. Never a problem. No long and heavy agitation. Was yours HC-110 genie? --img-- ", "link": "https://www.l-camera-forum.com/topic/287239-first-time-film-development-and-a-question/?tab=comments#comment-3567844", "origin": "L-forum", "suborigin": "287239-first-time-film-development-and-a-question", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i’m not sure what this is but: if i remember well ddx is a syrop just like hc-110. with hc110 i know from experience that it is very important to shake very well and quite long before the final solution is homogene. you can see that when you hold it to the light, strings of syrop have to be gone after sufficient shaking. with hc110 you make first a stock solution of 1+4 before coming to solution b (1+31). i never used ddx, but hc-110 is my only developer for 400 films, which i use most, except 100 film in summer time. i never bother to dilute and using it straight from the bottle for years. i pure it to the medicine cap to measure. say, 10ml, then i add water into this cap and drop it to the measuring cylinder where i have 150ml or so water added. this is then it gets gobbles. but steering cylinder with one hand deals with it and then i add water into medicine cap to flush the rest to hc-110 into mixing cylinder. it is has to be done five or so times and then i add water into cylinder to have right mix. by the time it is gone, mix is even. -----> i !!!  -----> develop !!!  this way for years now and dozens of 30 meters bulks. never a problem. no long and heavy agitation. was yours hc-110 genie? --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 105642, "year": "2018"}, {"autor": "250swb", "date": "2018-08-05 06:54:00", "content": "Developing at higher temperatures increases the grain and also needs to be compensated for with shorter times. It would be a good idea just to go all out and see what happens if you develop a roll of HP5 at 23C, personally I like grain but usually aim to increase it by choosing a grainy developer as this doesn't shorten the dev time. Knock a minute off the development time to start with but wherever you end up don't go below four minutes.", "link": "https://www.l-camera-forum.com/topic/287185-film-developing-and-chemical-temperatures/?tab=comments#comment-3566969", "origin": "L-forum", "suborigin": "287185-film-developing-and-chemical-temperatures", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "-----> developing !!!  at higher temperatures increases the grain and also needs to be compensated for with shorter times. it would be a good idea just to go all out and see what happens if you develop a roll of hp5 at 23c, personally i like grain but usually aim to increase it by choosing a grainy developer as this doesn't shorten the dev time. knock a minute off the development time to start with but wherever you end up don't go below four minutes.", "sortedWord": "None", "Identifyer": null, "identifyer": 105676, "year": "2018"}, {"autor": "RayD28", "date": "2018-08-05 12:41:00", "content": "Developing at higher temperatures increases the grain and also needs to be compensated for with shorter times. It would be a good idea just to go all out and see what happens if you develop a roll of HP5 at 23C, personally I like grain but usually aim to increase it by choosing a grainy developer as this doesn't shorten the dev time. Knock a minute off the development time to start with but wherever you end up don't go below four minutes. So, if film and developer manufacturers suggest 9 1/2 minutes at 20 C, and the Massive Dev. Chart suggests 8 minutes at 23 C. I will get more grain? (Those numbers are for example purposes only.)", "link": "https://www.l-camera-forum.com/topic/287185-film-developing-and-chemical-temperatures/?tab=comments#comment-3567083", "origin": "L-forum", "suborigin": "287185-film-developing-and-chemical-temperatures", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "-----> developing !!!  at higher temperatures increases the grain and also needs to be compensated for with shorter times. it would be a good idea just to go all out and see what happens if you develop a roll of hp5 at 23c, personally i like grain but usually aim to increase it by choosing a grainy developer as this doesn't shorten the dev time. knock a minute off the development time to start with but wherever you end up don't go below four minutes. so, if film and developer manufacturers suggest 9 1/2 minutes at 20 c, and the massive dev. chart suggests 8 minutes at 23 c. i will get more grain? (those numbers are for example purposes only.)", "sortedWord": "None", "Identifyer": null, "identifyer": 105677, "year": "2018"}, {"autor": "Martin B", "date": "2018-07-26 14:38:00", "content": "Depends how the film was stored - if at room temperature or higher, add one stop additional development needs for every 10 years of expiration. In this case you would develop it for a ASA 800 B&W film. If the film was kept in a freezer, you can use a standard ASA 100 development. If no development chart is provided, you can use a rule of thumb for B&W development which is that you add one third of the given development time at the base ISO for each pushed stop - in this case at ASA 100. So if it is 10 seconds at ASA 100, I would approx. develop it with 3 stops x 3.3 seconds --> 20 seconds for ASA 800. Edited July 26, 2018 by Martin B", "link": "https://www.l-camera-forum.com/topic/286761-agfapan-asa100-professional-expired-1980-processing/?tab=comments#comment-3561824", "origin": "L-forum", "suborigin": "286761-agfapan-asa100-professional-expired-1980-processing", "result": true, "Selector": "develop", "selectorShort": "develop", "MarkedSent": "depends how the film was stored - if at room temperature or higher, add one stop additional development needs for every 10 years of expiration. in this case you would develop it for a asa 800 b&w film. if the film was kept in a freezer, you can use a standard asa 100 development. if no development chart is provided, you can use a rule of thumb for b&w development which is that you add one third of the given development time at the base iso for each pushed stop - in this case at asa 100. so if it is 10 seconds at asa 100, i would approx. -----> develop !!!  it with 3 stops x 3.3 seconds --> 20 seconds for asa 800. edited july 26, 2018 by martin b", "sortedWord": "None", "Identifyer": null, "identifyer": 105724, "year": "2018"}, {"autor": "Pyrogallol", "date": "2018-02-28 19:15:00", "content": "I have been using Rodinal for a few years now and find it very reliable. It lasts right to the bottom of the bottle ( I do use Tetenal Protectan) and I have just used some from a friend who probably bought it 20+ years ago. Yesterday I used Rodinal for some 5x4 film. Developed in a print drum intended for 8x10 colour paper you can get away with using only a very small quantity of developer. I also use Microphen occasionally. Many years ago I always used D76 1+1 To answer the original question, if the films have been pushed a stop or two, ie underexposed, Microphen could be used as it should cope with the under exposure.", "link": "https://www.l-camera-forum.com/topic/282197-lots-of-different-rolls-of-bw-film-all-pushed-to-different-speeds/?tab=comments#comment-3471080", "origin": "L-forum", "suborigin": "282197-lots-of-different-rolls-of-bw-film-all-pushed-to-different-speeds", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "i have been using rodinal for a few years now and find it very reliable. it lasts right to the bottom of the bottle ( i do use tetenal protectan) and i have just used some from a friend who probably bought it 20+ years ago. yesterday i used rodinal for some 5x4 film. -----> developed !!!  in a print drum intended for 8x10 colour paper you can get away with using only a very small quantity of developer. i also use microphen occasionally. many years ago i always used d76 1+1 to answer the original question, if the films have been pushed a stop or two, ie underexposed, microphen could be used as it should cope with the under exposure.", "sortedWord": "None", "Identifyer": null, "identifyer": 105862, "year": "2018"}, {"autor": "mikemgb", "date": "2018-08-06 01:44:00", "content": "I developed the first film from my lens today. My example apparently suffers severe barrel distortion, it's OK if the camera is absolutely level but any tilt... --img-- ", "link": "https://www.l-camera-forum.com/topic/283856-first-7artisans-35mm-f2-lens-review/page/6/?tab=comments#comment-3567460", "origin": "L-forum", "suborigin": "283856-first-7artisans-35mm-f2-lens-review", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i developed the first -----> film !!!  from my lens today.", "sortedWord": "film", "Identifyer": null, "identifyer": 12996, "year": "2018"}, {"autor": "lct", "date": "2018-08-09 08:39:00", "content": "I developed the first film from my lens today. My example apparently suffers severe barrel distortion, it's OK if the camera is absolutely level but any tilt... --img-- Sheet121_010s.jpg This great little lens is not made for film i'm afraid. It needs 6-bit coding to correct distortion. I just tried it on my digital CL so far (see 7artisans 35/2 on the CL) and i yet prefer it to my Summicron 35/2 v4 on this body.", "link": "https://www.l-camera-forum.com/topic/283856-first-7artisans-35mm-f2-lens-review/page/6/?tab=comments#comment-3569376", "origin": "L-forum", "suborigin": "283856-first-7artisans-35mm-f2-lens-review", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i developed the first -----> film !!!  from my lens today.", "sortedWord": "film", "Identifyer": null, "identifyer": 12997, "year": "2018"}, {"autor": "ramarren", "date": "2018-11-04 19:11:00", "content": "Thanks! That was it, I'd bumped the EC override to +0.3 accidentally and didn't think to look at the setting dial. Doh! 🙄 I thought the roll of film I developed yesterday looked a tiny bit denser than expected. First roll, so that's good information from which to understand the metering calibration.", "link": "https://www.l-camera-forum.com/topic/291166-flashing-indicator-r62/?tab=comments#comment-3625500", "origin": "L-forum", "suborigin": "291166-flashing-indicator-r62", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "🙄 i thought the -----> roll !!!  of film i developed yesterday looked a tiny bit denser than expected.", "sortedWord": "roll", "Identifyer": null, "identifyer": 20831, "year": "2018"}, {"autor": "John McMaster", "date": "2018-09-25 11:07:00", "content": "All Leica site says is: 'Leica S3The excellence of the Leica S3 is the result of an extremely well-thought-out overall system. All of its individual components are precisely matched to one another and interact in perfect harmony to create the inimitable Leica look. Developed in close collaboration with professional photographers, the Leica S3 expertly fulfils their particular needs with its exceptional picture quality and outstanding flexibility, paired with uncomplicated handling and extreme robustness Leica ProFormat sensor, with 64-megapixel resolution High sensor sensitivity up to ISO 50000 Medium Format Cine 4K Video Available as of Spring 2019' john", "link": "https://www.l-camera-forum.com/topic/289805-leica-s3-announced-photokina/?tab=comments#comment-3599409", "origin": "L-forum", "suborigin": "289805-leica-s3-announced-photokina", "result": false, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "developed in close collaboration with professional photographers, the leica s3 expertly fulfils their particular needs with its exceptional picture quality and outstanding flexibility, paired with uncomplicated handling and extreme robustness leica proformat sensor, with 64-megapixel resolution high sensor sensitivity up to iso 50000 medium format cine 4k -----> video !!!  available as of spring 2019'", "sortedWord": "video", "Identifyer": null, "identifyer": 31660, "year": "2018"}, {"autor": "helged", "date": "2018-09-25 12:35:00", "content": "All Leica site says is: 'Leica S3The excellence of the Leica S3 is the result of an extremely well-thought-out overall system. All of its individual components are precisely matched to one another and interact in perfect harmony to create the inimitable Leica look. Developed in close collaboration with professional photographers, the Leica S3 expertly fulfils their particular needs with its exceptional picture quality and outstanding flexibility, paired with uncomplicated handling and extreme robustness Leica ProFormat sensor, with 64-megapixel resolution High sensor sensitivity up to ISO 50000 Medium Format Cine 4K Video Available as of Spring 2019' john Quite a jump in ISO compared to S007 (max ISO 3200, with push to 6400). Will be interesting to see what this will mean for low-light photography.", "link": "https://www.l-camera-forum.com/topic/289805-leica-s3-announced-photokina/?tab=comments#comment-3599477", "origin": "L-forum", "suborigin": "289805-leica-s3-announced-photokina", "result": false, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "developed in close collaboration with professional photographers, the leica s3 expertly fulfils their particular needs with its exceptional picture quality and outstanding flexibility, paired with uncomplicated handling and extreme robustness leica proformat sensor, with 64-megapixel resolution high sensor sensitivity up to iso 50000 medium format cine 4k -----> video !!!  available as of spring 2019' john quite a jump in iso compared to s007 (max iso 3200, with push to 6400).", "sortedWord": "video", "Identifyer": null, "identifyer": 31663, "year": "2018"}, {"autor": "George Furst", "date": "2018-01-14 16:12:00", "content": "I´m new to this forum so this is my first post. I Have to lift my hat to this treads topic and to your very interesting posts. Been looking to buy the working version of the 0-series by Leica and even the non working UR-serie which yours is based on. I love the hand craft and size of the UR Leica and it´s great to so one that´s dedicated to make it to a real working camera (which Leica should have done in the first place). Have you tried to shoot color with it? For me it’s the first time as well that I noticed this topic. I have to say it’s both interesting and enjoyable to read. I’m quite curious to recent developments on project no 2.I guess it is time for an update on the construction of UR Leica Replica No.2. It is being made in Seoul at this time. Of course I am risking that no one will wish to purchase this camera. I have well documented my experience with the first Replica UR that I started using almost one year ago. I know exactly what Mr. Barnack and Ernst Leitz II experienced during the period of 1914-1920. Operating the camera is really a joy. I have used it for street photography, while hiking in the mountains, and it has become second nature to slide the cover over the lens when I wind the film. Also it is small and easily fits into my pocket. At the same time I must always be careful to check that the lens is extended fully from the body. I have also found that if I use 400 ASA film, I do not need to use an exposure meter but just open up the iris diaphragm and set the wheel on top to the slower shutter speed and the pictures come out fine. In the bright light I just do the opposite. The pictures are very sharp as the lens is the same design ass to planar lens we are all familiar with from Zeiss. I also have no problem to know when the film is used up, I just shake the body. When it riddles, all the film is exposed as the feeding spool is empty and loose in its space. I then go home and in the evening unload the camera in the dark and load the film into the developing tank. I usually develop the film after two roles are in the tank. At the same time I load new film into the UR-Camera so it is ready for the next photo trip or hike in the mountains. I have described this film loading procedure before on the forum. Right now I have my first color film loaded and have taken half the roll. I am also having the second Camera made. It took a while to find the original lens at a decent price, and find a IIIa Camera cheap, and find on eBay another UR Leica Dummy at a reasonable price. My camera craftsman is now putting it all together and I expect to have it next month. Then I will put it on the forum buy and sell to see if there is any interest. Of course I will not post it until I have tested it and found that it is as good as my first copy. I am risking that someone is interested in such an unconventional but historic Camera. I was very pleased with the discussion found in the Ulf Richter Book Oskar Barnack-From the Idea to the Leica. It was recently reissues issued in 2017 by LHSA in an English translation by Rolf Fricke. It is the best discussion I have found on the original UR lens. At the same time there was little about the internals of the Camera. For instance the way in which the Camera tells you how many pictures are left on the camera. My example does not tell you this number. Also there is little about the film winding mechanism except to say that it is done by a wire cable. We did not use a wire cable, we used the gears from a III or standard Leica Camera in our sample. We felt that this was a better solution to this mechanism. I was a little discouraged that so few people responded to my Forum discussion of the Camera. I thought there would be more Forum questions but that may only mean that I have answered all the questions. As soon as I have color pictures developed, I will post them here. I plan to go to the 50 year gathering of the LHSA at Wetzlar next fall so I look forward to sharing this camera with others at that time. Edited January 14, 2018 by George Furst", "link": "https://www.l-camera-forum.com/topic/138638-working-ur-leica/page/3/?tab=comments#comment-3439892", "origin": "L-forum", "suborigin": "138638-working-ur-leica", "result": false, "Selector": "i usually develop", "selectorShort": "develop", "MarkedSent": "i usually develop the -----> film !!!  after two roles are in the tank.", "sortedWord": "film", "Identifyer": null, "identifyer": 35694, "year": "2018"}, {"autor": "George Furst", "date": "2018-03-06 13:32:00", "content": "A most fascinating thread! I have just purchased an UR and also a Null Series. Both are currently aboard jets approaching from different sides of the World. I eagerly await using the Null, and the prospect of an operational UR is VERY enticing! I must say your images are stunning! Who would believe “that” camera produced them, but of course it IS a Leica, with a Leica Lens. Has Mr. Kim expressed a desire to perform this conversion on another? I’d imagine he’s getting familiar with the process....now I must ask a silly question here, is UR pronounced “Oar”, or You’re”? I will first try to answer the question about the pronunciation of UR. I pronounce it “You’re”. But I defer this question to a speaker of the German Language as it stands for a German word and they pronounce the alphabet differently than we English do. Yes, Mr. Kim has asked me about more conversions and that is why I am having him make another on the assumption that someone else would like to have an operating UR Leica. I love the camera and it is my favorite film camera. I love the way it operates, its construction and size, and its excellent resolution. I too was surprised with the final pictures and so much so that I started developing all my films as I couldn’t wait for the developed pictures from the photo shop in Seoul. I continue to take pictures and recently developed some excellent examples of what this 100 year old Leitz Summar 42mm lens is capable of. It is a wonderful feeling to experience what Barnack and Ernst Leitz experienced. My only question is why didn’t Wetzlar produce the camera back in 1914 when they learned what a fine camera they had. Maybe that is because the camera design was ahead of the available movie film (or was it the war?). What I refer to is the “Lag factor”. The optics of the camera was ahead of the available film. Now we are able to appreciate the full capability of the camera because modern film is finer grained and much faster than film available then. Of course my inspiration in this project was the pictures taken soon after the UR Camera was made. I knew from them that we were starting with excellent optics.", "link": "https://www.l-camera-forum.com/topic/138638-working-ur-leica/page/3/?tab=comments#comment-3475116", "origin": "L-forum", "suborigin": "138638-working-ur-leica", "result": false, "Selector": "i started developing", "selectorShort": "develop", "MarkedSent": "i too was surprised with the final pictures and so much so that i started developing all my -----> films !!!  as i couldn’t wait for the developed pictures from the photo shop in seoul.", "sortedWord": "film", "Identifyer": null, "identifyer": 35699, "year": "2018"}, {"autor": "stray cat", "date": "2018-11-07 05:27:00", "content": "On 11/4/2018 at 9:20 PM, stray cat said: Thank you so much, Rog - I really value your thoughts and thought process on how you go about creating the art that you do. It is inspiring and illuminating. Your thoughts on the latent images, undeveloped for so long, and containing pictures of loved ones, reminded me of something that I'd almost forgotten - and I'm so glad you reminded me. This also fits well into the nature, I believe, of palimpsest. When Mum passed away in 2005 - Dad had already passed away - my brother and I and our families had the rather sad task of sorting things in their home - our old family home of many years. Mum was one who was loathe to get rid of anything so this was quite a big task. Anyway, amongst all the other stuff, in the loungeroom Sue and I came across an old Kodak folding autographic camera - the kind that took one of the weird film sizes like 127 or something. Through the red window at the back we could see there was an unfinished film in it, so Sue suggested kind of jokingly that she take my picture right there in the loungeroom as a kind of memento. We were living overseas at the time and things were a bit hectic - I guess I must have taken the film back with me to Fiji and developed it there. On the resulting negative sure enough there was I, on the threshold of turning 50 in the picture Sue had taken; now cue the music from the Twilight Zone - because a couple of frames earlier - there too was I, only this time in my late teens/early twenties. In the same room! Mum must have taken it at some stage and we'd forgotten all about it and she obviously hadn't used the camera again nor had the film developed. I guess that qualifies as a palimpsest. Yes, I know, photos or it didn't happen. I will search unflinchingly now until I find those negatives! Well, I found the negatives. A few of the above details were a little askew. It turns out that the photo I thought Sue had taken of me was in fact the other way round - I took a photo of her - and it was most likely in 2008 which is when I've recorded I developed the film. And in the original one of me from the 1970s (#3 on the roll of HP4 - Sue's photo is #9) it appears as though I took a self portrait. Still, the couple of photos, on the same roll taken probably 30 years apart, makes quite an interesting diptych. However, as it was not taken on a Leica, I'd better post it in the \"I Like Film\" thread lest I incur the wrath of the moderators.", "link": "https://www.l-camera-forum.com/topic/290225-diptychs-triptychs-and-polytychs-open-thread/page/4/?tab=comments#comment-3627012", "origin": "L-forum", "suborigin": "290225-diptychs-triptychs-and-polytychs-open-thread", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "it turns out that the photo i thought sue had taken of me was in fact the other way round - i took a photo of her - and it was most likely in 2008 which is when i've recorded i developed the -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 63832, "year": "2018"}, {"autor": "jmahto", "date": "2018-09-12 23:54:00", "content": " It has been so awesome so far! I started film 5 months ago (long ago shot film when it was only choice). So far shot 20 rolls. Many of them experimental. Remaining split between landscape, my better half and my cat. My cat has no clue and generally is not appreciative of wonderful Tri-X shots of him. Well, I shoot anyway. Over time, I started developing BW film as well and now I am quite comfortable (developed last 8 in DD-X). I got a decent number of shots that I can be proud of. Now my refrigerator is stocked with around 40 rolls of film. My first batch of DD-X is almost over and my M2 is smoother than ever. Now I am wondering what is ahead. I have gone past initial euphoria but still so much unexplored territory ahead. Photography had never been so exciting. --img--  I would like to hear stories of how you started your own journey and how did it go.My cat says Hi (Tri-X and M2)--img-- ", "link": "https://www.l-camera-forum.com/topic/289403-film-journey-of-a-beginner/?tab=comments#comment-3592212", "origin": "L-forum", "suborigin": "289403-film-journey-of-a-beginner", "result": false, "Selector": "i started developing", "selectorShort": "develop", "MarkedSent": "over time, i started developing bw -----> film !!!  as well and now i am quite comfortable (developed last 8 in dd-x).", "sortedWord": "film", "Identifyer": null, "identifyer": 102478, "year": "2018"}, {"autor": "dau", "date": "2018-12-28 20:22:00", "content": " If you are used to working in a completely dark dark room, then it's not all that difficult: Rewind the film slowly and stop rewinding before you pull the beginning of the film into the cartridge. Take the cartridge out of the camera. In the darkroom, pull the length of film which corresponds to the header and your fourteen exposures (and some reserve) out of the cartridge. Still in the darkroom, cut that part of the film off and move it into your development tank. In dim light, cut the beginning of the remaining film into the shape required by the camera and put the remaining film into the camera. In a pessimistic scenario, the header would take some 18cm, perhaps, and the 14 frames 56cm. I would add another 12cm or so just to be on the safe side. On the other hand, is the film very expensive? Otherwise, I would just develop the film and write the two unexposed thirds off. On the other hand, you might take some experimental shots just to fill the film. It's been a long time since I did this, and the camera I had then had a knife built in which let you cut the film after the last exposed frame. The take up spool was an empty cartridge, so that you could take it out in plain daylight.", "link": "https://www.l-camera-forum.com/topic/292680-reveal-photos-without-finishing-the-reel/?tab=comments#comment-3654489", "origin": "L-forum", "suborigin": "292680-reveal-photos-without-finishing-the-reel", "result": false, "Selector": "i would just develop", "selectorShort": "develop", "MarkedSent": "otherwise, i would just develop the -----> film !!!  and write the two unexposed thirds off.", "sortedWord": "film", "Identifyer": null, "identifyer": 103390, "year": "2018"}, {"autor": "Gen Feuillard", "date": "2018-10-14 16:13:00", "content": " Troubleshooting a couple of things.... I spend some time searching around deposits in developper ( filmphotography kits) all around, haven't seen anything similar to my problem. I'm wondering if I should wash my films even more (I develop a lot of expired films) or if it's a question of how I store it. Even though I can still develop, I filter it everytime I'm doing a batch, and just fid this phenomenon highly abnormal. It's a flaky, snowy depostis that grow from batch to batch. I use 1l plastic bottle, and this phenomenon doesn\"t appear in y Blix or stabilizer, i'm super prudent of cross-contamination... Also, I have a hard time simply putting my negatives in the roller, since I received a batch of super expired films who are super tight and super thought to put in the reel . I used to do that while my chemistries are slowly heating up, however for the past 2 sessions, I battled so hard with my films that I lost my temperature. I was wondering if rolling my negatives in advance and then start the heating-waiting process of my blix-developper would affect the film.", "link": "https://www.l-camera-forum.com/topic/290510-c-41-kit-questions/?tab=comments#comment-3612321", "origin": "L-forum", "suborigin": "290510-c-41-kit-questions", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i'm wondering if i should wash my -----> films !!!  even more (i develop a lot of expired -----> films !!! ) or if it's a question of how i store it.", "sortedWord": "film", "Identifyer": null, "identifyer": 103716, "year": "2018"}, {"autor": "adan", "date": "2018-10-23 00:01:00", "content": "If you use the ISO (International Standards Organization) standard or definition for determining ISO film speed: For black-and-white negative film, the \"speed point\" M is the point on the curve where density exceeds the base + fog density by 0.1, when the negative is developed so that a point N where the log of exposure is 1.3 units greater than the exposure at point m, has a density 0.8 greater than the density at point m. (translation: the speed of a film is that \"ISO\" that will produce \"normal\" shadow detail with \"normal\" development and a \"normal density range\" to the whole negative) .....then yes, it is technically a myth. No amount of pushed developing of TX exposed at 1600, will result in the same or \"right\" amount of shadow detail as TX shot at 400 and developed normally. For the same reason already noted - additional development is multiplicative. It will mess up that M=0.1/N=0.8 density relationship. Some compensating techniques or developers can squeeze out the absolute maximum amount of shadow detail to meet the ISO test, but not really more than 1/2 stop or so (ISO 640, maybe) to satisfy the ISO definition. Silver photography is magical, but it can't fight physics. Not enough photons = not enough silver. _________________ HOWEVER, if your standard is \"a usable picture in dim light,\" you can throw the ISO technical definition out the window, and just use the definition \"I got a usable picture.\" And in that case it is not so mythological. Ideally, one would call it an EI (exposure index) rather than an ISO (since it doesn't meet the ISO definition). Ideally, a \"good push\" would mean that a gray-card gray (not a shadow tone) comes out with about the same silver density as an unpushed negative, and about the same total amount of silver in the negative, but redistributed (less than normal in the shadows, about normal for a gray-card gray, and more than normal in the highlights). A \"heroic push\" as in the sample below, means a negative that with \"heroic\" measures in the darkroom (high-contrast paper, dodging, burning, maybe ferricyanide bleaching) can still produce a final picture. Just barely enough silver in the film - with any amount of film development - to coax out the necessary tonal distinctions to reveal the subject. I shot with a 28mm f/3.5 lens, under the \"available darkness\" of one 500-watt floodlight 40 meters/yds from the subject (back over my shoulder). I didn't really \"pick\" an EI for my TX - I just shot to avoid camera shake; 1/15th at f/3.5. Then I took an incident meter reading (which showed that that exposure in that light was about equivalent to EI 4000). I then just developed the film for \"infinity\" (30 minutes or so), and accepted the very thin neg that resulted (see simulated neg densities in the \"negative\" version). Definitely not really ISO 4000, or even close, according to the amount of shadow detail/density the ISO standard calls for - but just enough mid-tone/highlight density for a dramatic picture. In any case, you will start to see the classic \"charcoal and chalk\" look of pushed film with more than a 1-stop \"push\" - a few mid-tones that are \"about right,\" with increasingly inky black shadows and nearly blank white highlights everywhere else. Contrasty. --img-- ", "link": "https://www.l-camera-forum.com/topic/290699-have-i-had-an-epiphany/?tab=comments#comment-3617384", "origin": "L-forum", "suborigin": "290699-have-i-had-an-epiphany", "result": false, "Selector": "i then just developed", "selectorShort": "develop", "MarkedSent": "i then just developed the -----> film !!!  for \"infinity\" (30 minutes or so), and accepted the very thin neg that resulted (see simulated neg densities in the \"negative\" version).", "sortedWord": "film", "Identifyer": null, "identifyer": 103734, "year": "2018"}, {"autor": "Martin B", "date": "2018-08-09 11:50:00", "content": "true --img--  nice to see more people using and loving film these days It is just one sign of a clear trend by now that many younger photographers went back to film to differentiate from the mainstream digital mass. I started shooting film again about 4 years ago and meanwhile shoot more film than digital. But the main reason why I went back to film is that I can now develop all film by myself. If I had to send out each film to have it developed and scanned, it would be a very expensive and probably not worthwhile hobby. For me key with film is to do as much by yourself as you possibly can - starting from rolling your own 35 mm films from a 100' roll (reduces the price for a 36 frame cartridge about 50-70%) to scanning and potentially even printing with an enlarger setup. This compared to buying a > $3K digital camera with expensive lenses is then potentially the more affordable option, too - but again, you have to vest the time to handle everything by yourself (which I consider fun, too).", "link": "https://www.l-camera-forum.com/topic/287342-simple-film-guide/?tab=comments#comment-3569435", "origin": "L-forum", "suborigin": "287342-simple-film-guide", "result": false, "Selector": "i can now develop", "selectorShort": "develop", "MarkedSent": "but the main reason why i went back to -----> film !!!  is that i can now develop all -----> film !!!  by myself.", "sortedWord": "film", "Identifyer": null, "identifyer": 103952, "year": "2018"}, {"autor": "Martin B", "date": "2018-07-16 14:46:00", "content": "Hmmm...I would still prefer the conventional Paterson daylight developer tank which allows me to develop 35 mm, medium and large format films. Only advantage I can see from this setup linked above is that the 35 mm cartridge doesn't need to be opened sperately in the dark. For beginners this might be a benefit who are not used to roll film onto a reel in the dark - even I believe it is good to learn to do this because then it is easy to do it for all kind of film sizes, too. The labeling of the bottles might be a bit off - for B&W processes no bleach is needed but either water or stopper fluid after the development step instead. Even for color C-41 development, most development packs now prefer to have bleach and fixer combined (called Blix). The used iron EDTA complex for bleaching is much more stable now than the formerly cyanide based one - so Blix now lasts for quite long. The setup for heating the chemicals if needed (especially for C-41 or E-6) can be useful even the same can be accomplished well in any kind of water bath with temperature control. For B&W development, I found it much more important to cool the developer instead especially in summer time when stock developer has to be diluted with tap water (I am using 2-3 ice cubes in 1 liter of water and use some of it to get to 20 deg C with developer).", "link": "https://www.l-camera-forum.com/topic/286635-film-processing/?tab=comments#comment-3556879", "origin": "L-forum", "suborigin": "286635-film-processing", "result": false, "Selector": "me to develop", "selectorShort": "develop", "MarkedSent": "i would still prefer the conventional paterson daylight developer tank which allows me to develop 35 mm, medium and large format -----> films !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 104059, "year": "2018"}, {"autor": "Martin B", "date": "2018-11-08 16:11:00", "content": "I had my C-41 developer chemicals in closed 500 ml glass bottles filled to top and well sealed stored between 20-23 deg C for about 9 months without seeing issues. I developed about 25 films with them during this time. At the end of its lifetime, I saw precipitation in the Blix solution and the developer turned very dark and flocked out. A bit precipitation in the developer is not an issue since it also fully dissolves when pre-heated to 40 deg C. Rule of thumb is to avoid cross contamination between the chemicals to increase lifetime. In my E-6 slide development process I added additional washing steps between developers and fixer which increased lifetime a lot. I will do the same next time I am making and using new C-41 solutions, too. The most tedious developer chemicals I have used so far are the ones used in the RA-4 process. This stuff oxidizes very quickly even in closed bottles. One reason why I don't bother using it anymore.", "link": "https://www.l-camera-forum.com/topic/289664-c-41-process-chemicals-life/?tab=comments#comment-3627728", "origin": "L-forum", "suborigin": "289664-c-41-process-chemicals-life", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i developed about 25 -----> films !!!  with them during this time.", "sortedWord": "film", "Identifyer": null, "identifyer": 105409, "year": "2018"}, {"autor": "Chuck Albertson", "date": "2018-10-12 16:59:00", "content": " I used to develop Tri-X and HP5+ in the same tank of D-76, but since the latest version of TX was introduced (I think after they switched production to the same machines used to coat the T-Max films) the developing times have diverged and I now develop them separately. Haven't had any problems with Rodinal going sour, though. I don't use it as much as I used to, but I'm currently working through a bottle of the stuff I opened in June 2012 (I wrote the date on it with a Sharpie) and it still performs like a champ. the color changes from a pale wheat color to dark brown over time, but it hasn't affected developing times. I also recall getting the hairy eyeball from the pharmacist when buying a syringe (no needle!) to measure the 10 or 20cc you need for a small tank.", "link": "https://www.l-camera-forum.com/topic/290230-processing-film-chemistryfilm-compatibility/?tab=comments#comment-3611239", "origin": "L-forum", "suborigin": "290230-processing-film-chemistryfilm-compatibility", "result": false, "Selector": "i used to develop", "selectorShort": "develop", "MarkedSent": " i used to develop tri-x and hp5+ in the same tank of d-76, but since the latest version of tx was introduced (i think after they switched production to the same machines used to coat the t-max -----> films !!! )", "sortedWord": "film", "Identifyer": null, "identifyer": 105417, "year": "2018"}, {"autor": "mikemgb", "date": "2018-09-26 01:21:00", "content": "I always develop my own, for black and white I use HC-110 developer one shot, I keep Ilford stop and Kodak fix mixed, I can have a film developed from thinking about it to cleaned up in 30 minutes. As long as you don't push your fix beyond recommended you have very little chance of screwing up. For colour I mix a C41 kit and follow storage instructions exactly, after 3 months I throw it out and mix a new one. For E6 I save up as many films as a kit will develop and add a couple more then I will develop them all in one day.", "link": "https://www.l-camera-forum.com/topic/289848-might-bite-the-bullet-and-start-to-do-my-own-film-developing/?tab=comments#comment-3600000", "origin": "L-forum", "suborigin": "289848-might-bite-the-bullet-and-start-to-do-my-own-film-developing", "result": false, "Selector": "i always develop", "selectorShort": "develop", "MarkedSent": "i always develop my own, for black and white i use hc-110 developer one shot, i keep ilford stop and kodak fix mixed, i can have a -----> film !!!  developed from thinking about it to cleaned up in 30 minutes.", "sortedWord": "film", "Identifyer": null, "identifyer": 105526, "year": "2018"}, {"autor": "Pyrogallol", "date": "2018-01-29 19:22:00", "content": "This is an old topic, but I will add my thoughts. I have used Rodinal for several years now and like it as it lasts right to the final dregs in the bottle and gives me good printable negatives. I do not use the no-agitation method but do leave it for the final minute of development (8 minutes for FP4) to build up a little edge effect. In fact I use the exact opposite method with sheet film as I develop them, 5x4 upto 10x8, in a print drum designed for colour paper on a Durst print roller base, so the film gets constant agitation. It works ok for me.", "link": "https://www.l-camera-forum.com/topic/192945-stand-development/page/2/?tab=comments#comment-3450573", "origin": "L-forum", "suborigin": "192945-stand-development", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "in fact i use the exact opposite method with sheet -----> film !!!  as i develop them, 5x4 upto 10x8, in a print drum designed for colour paper on a durst print roller base, so the -----> film !!!  gets constant agitation.", "sortedWord": "film", "Identifyer": null, "identifyer": 105592, "year": "2018"}, {"autor": "Bill Clark", "date": "2018-09-15 21:24:00", "content": "I find this is a good article on stand developing: http://jbhildebrand.com/2011/tutorials/workflow-tutorial-2-stand-development-with-rodinal/ What works for me is: 6 ml of stock to 600 ml of water. Develop 1 hr. Works best with low iso films.", "link": "https://www.l-camera-forum.com/topic/192945-stand-development/page/2/?tab=comments#comment-3593732", "origin": "L-forum", "suborigin": "192945-stand-development", "result": false, "Selector": "develop", "selectorShort": "develop", "MarkedSent": "develop 1 hr. works best with low iso -----> films !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 105595, "year": "2018"}, {"autor": "jmahto", "date": "2018-08-22 22:52:00", "content": "Finally I did it. I tested first with a small snippet of roll (I had shot few test pictures in the beginning that I managed to cut by approximate guessing inside change bag). After that I developed two rolls together (I have two reel Peterson tank). I did get some spots though (actually a streak of spots running from one frame to another for 5-6 frames). They were on the sky and I fixed them in PS after the scan. I am guessing it was due to both the rolls together in the tank. This is the first time I did that and not sure what extra precaution need to be taken for two reels loaded vs only one reel loaded. In any case, I did another development for TMax400 (that I mistakenly pulled to 100). This time single reel only and everything was perfect. I will developed only one roll at a time for the time being before I figure out what happened. Oh, here are TMax 100 sample shots. I was more or less pleased. --img--  Thanks for all the good advice.--img--  --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/287595-now-what/?tab=comments#comment-3577308", "origin": "L-forum", "suborigin": "287595-now-what", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "after that i developed two -----> rolls !!!  together (i have two reel peterson tank).", "sortedWord": "roll", "Identifyer": null, "identifyer": 105624, "year": "2018"}, {"autor": "RayD28", "date": "2018-08-06 12:34:00", "content": "Jayant, your journey sounds almost exactly like mine except I've developed about ten rolls at home. I also use DD-X. I get the same blotches but not limited to any any particular part of the frame. In another post a few folks suggested using distilled water during the entire process and I'm going to try it. Since your blotches seem consistent, have you checked your scanner to make sure it's clean?", "link": "https://www.l-camera-forum.com/topic/287239-first-time-film-development-and-a-question/?tab=comments#comment-3567675", "origin": "L-forum", "suborigin": "287239-first-time-film-development-and-a-question", "result": false, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "jayant, your journey sounds almost exactly like mine except i've developed about ten -----> rolls !!!  at home.", "sortedWord": "roll", "Identifyer": null, "identifyer": 105636, "year": "2018"}, {"autor": "jmahto", "date": "2018-08-06 13:35:00", "content": "Jayant, your journey sounds almost exactly like mine except I've developed about ten rolls at home. I also use DD-X. I get the same blotches but not limited to any any particular part of the frame. In another post a few folks suggested using distilled water during the entire process and I'm going to try it. Since your blotches seem consistent, have you checked your scanner to make sure it's clean? Yes. My scanner is clean. I have scanned other rolls and they don’t have these spots. I should have said that even after these spots, my negatives are better than the local lab’s (had lots of dirt and scratches).", "link": "https://www.l-camera-forum.com/topic/287239-first-time-film-development-and-a-question/?tab=comments#comment-3567708", "origin": "L-forum", "suborigin": "287239-first-time-film-development-and-a-question", "result": false, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "jayant, your journey sounds almost exactly like mine except i've developed about ten -----> rolls !!!  at home.", "sortedWord": "roll", "Identifyer": null, "identifyer": 105637, "year": "2018"}, {"autor": "RayD28", "date": "2018-08-04 03:01:00", "content": "I've not noticed a quality difference over several degrees of temperature, as long as you adjust the development time for the temperature. I do all at \"room temperature\" which varies in Texas with season and heat or A/C settings. I do keep all solutions at the same temperature, storing 2 gallons of de-ionized water with the stock solutions for mixing and film rinse (using the Iilford 3-change method of washing instead of running water, as tap water temperature gets pretty high here in summer). So my processing may be anywhere in the range of 68 to 78 degrees F. Thanks, Tom. What you said in the first line of your question is the way to go, “keep it basic and by the book”. You do not say what film or developer you are using but either one probably gives you the time for the normal temperature of 20c. Ilford films give a chart of time adjustments for different temperatures which I have found useful in the summer. You can probably find the chart on the web and it might well be the same for any developer and film as I think it is a purely chemical reaction question? If you can keep your stop and fix temperatures within a few degrees of the developer that will help. You want to avoid any sharp increase or drop from one bath to another. I do not think you need to worry about the wash water increasing in temperature during the wash time, the gradual increase in temperature will just help the film to wash quicker. I do not think there will be any difference in quality of the negatives providing the temperature range is not too wide or has a dramatic jump between one bath and the next. The days of reticulated grain are long gone I hope. The last time I saw wrinkled emulsion was developing Ferannia colour slide film back in the 70’s. Thanks, P. I use Ilford DD-X and either FP4+ or HP5+, always at box speed. The smaller the film the less tolerance you’ll have for temperature fluctuations in the developer. The leeway varies per film too. Stopping and fixing a little bit warmer won’t harm. If it gets too hot you can get reticulation (crackles in the emulsion), but that will start only above 30 Celsius I guess. It also depends on your end product: are you developing to scan or for a wet print, AAD or AAA? In my experience scanning is more forgiving. In wet printing you can choose a lower grade paper with multicontrast filters if the negative is too hard, but in general a relatively soft negative is a better starting point in the search for the best contrast for your subject. A variation of one degree Celsius won’t give irreversible problems with multicontrast papers. Thanks, Otto. I shoot only 35mm. I suppose I develop to scan but like to think I could send film to a pro lab for wet prints if I have something special. I don't have a darkroom. In summary, it sounds like using a Massive Development chart or app and adjusting for temperature of chemicals is not a problem. Thanks again for the tips and insight.", "link": "https://www.l-camera-forum.com/topic/287185-film-developing-and-chemical-temperatures/?tab=comments#comment-3566446", "origin": "L-forum", "suborigin": "287185-film-developing-and-chemical-temperatures", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i suppose i develop to scan but like to think i could send -----> film !!!  to a pro lab for wet prints if i have something special.", "sortedWord": "film", "Identifyer": null, "identifyer": 105672, "year": "2018"}, {"autor": "RayD28", "date": "2018-07-27 00:03:00", "content": "My tap water is hard as well. What I do is to use for rins finishing destilled water a a last step for approximately 15 minutes and then I use the salad spinner to remove the rest. No water agent, no squeeze, no watermarks Agree with the post above - use distilled water from a bottle purchasable in a grocery store as final wash. Pour 250 ml of distilled water onto the reel which has still the developed film rolled inside. Pour a bit on top and on bottom of the reel, and then on the side and into the film lever. This is sufficient wo rinse off most of the hard/regular water drops. Then hang the film to dry, don't squeeze. Simply let the drops evaporate or rinse off. Ray, your issue is only in part due to rinsing. It would be best to also mix your chemistry in distilled water. Mixing the chemistry in destilled water (what is generally a good idea) will not prevent the film from the watermarks if using the hard tap water for rinsing Well, of course not. I wrote in addition to rinsing in distilled, also mix using distilled. I live in a hard water area as well and do get some watermarks despite using a wetting agent in the final rinse water. I hang the film up and wipe off the excess water around the sprocket holes with my wet fingers but do not wipe down the frames except to wipe off any large blobs of water, avoiding touching the emulsion. Usually you can rub off any small watermarks if they are on the back of the film once it is dry. Just did that this afternoon with a test roll in a pre-war Kodak Retina 1. The mark on your first picture looks quite big which seems unusual and the streak on the second picture does not look like a watermark. I ought to use distilled water but don’t. I have got some as it was recommended for mixing pyro developer. I think the best thing to avoid them is using wetting agent in the last rinse for a minute or so before taking out the spiral. Use proper photographic wetting agent, not washing up liquid. We have an under-sink reverse osmosis filter for drinking water, so I fill a couple of 1 gallon jugs from it and store them with my darkroom chemicals. RO filtering is almost to distilled water purity, so I use it for mixing and all film rinsing and washing. For washing I use the Ilford method of 3 tank fulls with lots of inversion agitation instead of a running water wash, which saves water and has been shown to give equivalent results. Using a 1-reel stainless tank I use about a half gallon of water per roll of film. After the 3-fills Ilford wash I use a final dip in RO water with 2-3 drops of flo before hanging to dry, which helps keep droplets from forming on the film, but is so dilute it doesn’t leave deposits. Not from my experience - wetting agent didn't stop watermark residues at all - I tried both with regular detergent liquid and with photographic wetting agents. They both did nothing - don't even see much difference in regard to dust accumulation on the film when drying. I found best is simply rinsing with distilled water, I am not using any wetting agent anymore. Do you have soft water, or a water softener? Soft water, but without my final distilled water rinse I will have water droplet stains on my negatives, too. Well, this was like playing a game of Clue and I've solved the mystery. The wife did it and it was in the bathroom! I told my lovely bride that I am spending a lot of time touching up the film I developed. She said it's her fault because she took the film hanger off the shower head and accidentally dropped the film onto the shower floor. I just checked the floor and it's still wet and gunky from this morning so it was wet and gunky when she dropped the film yesterday afternoon. She said she didn't mention it yesterday because she thought what I don't know won't hurt anything. I'm looking forward to using distilled water throughout the developing process. Thanks for everyone's analysis and advice!", "link": "https://www.l-camera-forum.com/topic/286943-watermarks/?tab=comments#comment-3562094", "origin": "L-forum", "suborigin": "286943-watermarks", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i told my lovely bride that i am spending a lot of time touching up the -----> film !!!  i developed.", "sortedWord": "film", "Identifyer": null, "identifyer": 105694, "year": "2018"}, {"autor": "Martin B", "date": "2018-07-27 11:12:00", "content": "Well, this was like playing a game of Clue and I've solved the mystery. The wife did it and it was in the bathroom! I told my lovely bride that I am spending a lot of time touching up the film I developed. She said it's her fault because she took the film hanger off the shower head and accidentally dropped the film onto the shower floor. I just checked the floor and it's still wet and gunky from this morning so it was wet and gunky when she dropped the film yesterday afternoon. She said she didn't mention it yesterday because she thought what I don't know won't hurt anything. I'm looking forward to using distilled water throughout the developing process. Thanks for everyone's analysis and advice! Good one - made me smile this morning --img--  !", "link": "https://www.l-camera-forum.com/topic/286943-watermarks/?tab=comments#comment-3562250", "origin": "L-forum", "suborigin": "286943-watermarks", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i told my lovely bride that i am spending a lot of time touching up the -----> film !!!  i developed.", "sortedWord": "film", "Identifyer": null, "identifyer": 105695, "year": "2018"}, {"autor": "Jodad", "date": "2018-07-31 12:48:00", "content": " Hi Guys, Can you help me out and let me know if I’ve got this right please? My understanding is that with semi stand development (one turn of the tank at the midpoint of the development time) the duration that the film is in the developer depends on the developer itself (and the dilution) rather than the film and speed (pushed or not). Generally. I tried stand development with a roll of 120 that I had preloaded into a tank months ago and never gotten round to developing. I totally forgot what the film was so I figured, based on what I remembered of some reading I did in the past, that stand development would solve that. I did it in HC110 for 45 mins with a turn halfway. It developed the film nicely. I was thinking, since the development time depends on the developer and not the film/speed then: 1) If I have a multi reel tank, I can put in a variety of B&W films of different brands with different box speeds and/or pushed/pulled speeds and they should all develop fine (assuming no issued with banding and streaking etc.) right? And, 2) If the answer to the above is a \"YES\", that I can develop any combination of B&W films at (almost) any combination of ISOs then, I guess that I could develop a single roll where some of the frames were shot at box and other frames pushed and others pulled perhaps. Am I right with the two statements I have made above?", "link": "https://www.l-camera-forum.com/topic/287112-does-stand-development-work-like-this/?tab=comments#comment-3564491", "origin": "L-forum", "suborigin": "287112-does-stand-development-work-like-this", "result": false, "Selector": "i can develop", "selectorShort": "develop", "MarkedSent": "and, 2) if the answer to the above is a \"yes\", that i can develop any combination of b&w -----> films !!!  at (almost) any combination of isos then, i guess that i could develop a single roll where some of the frames were shot at box and other frames pushed and others pulled perhaps.", "sortedWord": "film", "Identifyer": null, "identifyer": 105700, "year": "2018"}, {"autor": "mikemgb", "date": "2018-07-26 14:58:00", "content": "I may have a similar problem, Wayne - I have some old Agfa colour film from the 1950s I'd like to process. I think the best bet is going to be stand developing - an hour in Rodinal 1:100. I'd be really interested to hear of any other ideas - I'm sure people who have tried something like this will respond. I attempt to develop every film I find in cameras in charitiy shops. Black and white always develops well, colour not so much. The oldest film I have managed to get an image from is 25 year old Fuji. Kodak films seem to degrade faster and 15-20 years is about their limit, this is in C41. I have also tried developing in black and white chemicals and never had any luck with older colour film, I have always ended up with a negative so dense it's impossible to scan. There are companies out there that can often develop films of this age but they use custom soups that for obvious reasons they don't share!", "link": "https://www.l-camera-forum.com/topic/286761-agfapan-asa100-professional-expired-1980-processing/?tab=comments#comment-3561842", "origin": "L-forum", "suborigin": "286761-agfapan-asa100-professional-expired-1980-processing", "result": false, "Selector": "i attempt to develop", "selectorShort": "develop", "MarkedSent": "i attempt to develop every -----> film !!!  i find in cameras in charitiy shops.", "sortedWord": "film", "Identifyer": null, "identifyer": 105726, "year": "2018"}, {"autor": "Martin B", "date": "2018-07-26 15:01:00", "content": " I attempt to develop every film I find in cameras in charitiy shops. Black and white always develops well, colour not so much. The oldest film I have managed to get an image from is 25 year old Fuji. Kodak films seem to degrade faster and 15-20 years is about their limit, this is in C41. I made similar experience - also, color slide film seems to last longer than color negative film.", "link": "https://www.l-camera-forum.com/topic/286761-agfapan-asa100-professional-expired-1980-processing/?tab=comments#comment-3561843", "origin": "L-forum", "suborigin": "286761-agfapan-asa100-professional-expired-1980-processing", "result": false, "Selector": "i attempt to develop", "selectorShort": "develop", "MarkedSent": " i attempt to develop every -----> film !!!  i find in cameras in charitiy shops.", "sortedWord": "film", "Identifyer": null, "identifyer": 105727, "year": "2018"}, {"autor": "bruscwillis", "date": "2018-04-04 12:06:00", "content": "Hi Martin, I know the thread it's silent for two years but I was looking these days for a formula of split development with Rodinal and Xtol. I have a 100 feet roll of HP5 at home and I developed it until now in Rodinal , D76 and Xtol. Rodinal at 1:50 gave me an ugly grain (I read later about this combo HP5 +Rodinal as being not pleasant all the time). D76 1+1 was ok. Xtol stock gave me fine grain, detail in shadows and also a flat look which was difficult to correct without ruining the skin tones (film is not digital, you can't push those sliders like on a 7D raw file). So.. I was realized that I liked the shadows of Xtol stock and Rodinal 1:50 highlights and I was thinking that maybe I could do a split development. Your images posted for HP5 split development looks amazing! Sharp, nice grain, very good separation between light, mid-tones and shadows, nothing mushy (like HP5 in straight Rodinal 1:50). Maybe can you share your recipe of split development? Something like Xtol stock or 1+1 for some% of total development time AND Rodinal 1:50/1:100 for rest of development time. Or maybe in the reversed order, I really have no idea. I hope you still have an account here and you will read this post at some time. Many thanks, Bogdan", "link": "https://www.l-camera-forum.com/topic/258970-dual-development-which-one-to-use-first/?tab=comments#comment-3493952", "origin": "L-forum", "suborigin": "258970-dual-development-which-one-to-use-first", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i have a 100 feet -----> roll !!!  of hp5 at home and i developed it until now in rodinal , d76 and xtol.", "sortedWord": "roll", "Identifyer": null, "identifyer": 105808, "year": "2018"}, {"autor": "Martin B", "date": "2018-04-04 21:16:00", "content": "Hi Martin, I know the thread it's silent for two years but I was looking these days for a formula of split development with Rodinal and Xtol. I have a 100 feet roll of HP5 at home and I developed it until now in Rodinal , D76 and Xtol. Rodinal at 1:50 gave me an ugly grain (I read later about this combo HP5 +Rodinal as being not pleasant all the time). D76 1+1 was ok. Xtol stock gave me fine grain, detail in shadows and also a flat look which was difficult to correct without ruining the skin tones (film is not digital, you can't push those sliders like on a 7D raw file). So.. I was realized that I liked the shadows of Xtol stock and Rodinal 1:50 highlights and I was thinking that maybe I could do a split development. Your images posted for HP5 split development looks amazing! Sharp, nice grain, very good separation between light, mid-tones and shadows, nothing mushy (like HP5 in straight Rodinal 1:50). Maybe can you share your recipe of split development? Something like Xtol stock or 1+1 for some% of total development time AND Rodinal 1:50/1:100 for rest of development time. Or maybe in the reversed order, I really have no idea. I hope you still have an account here and you will read this post at some time. Many thanks, Bogdan Hi Bogdan, here is my recipe for HP5+ 400 at ISO 400: 20 deg C water temperature 1. Rodinal diluted 1:100 for 10 minutes. Agitate every 2 minutes. 2. 3x rinse with water for 30 seconds each time 3. Xtol diluted 1:2 for 6 minutes. Agitate every minute. 4. Stop solution for 1 minute, agitate. 5. Fixer solution for 10 minutes, agitate every minute. 6. 2x rinse with water 7. Hypo Clearing Agent wash for 2 minutes, agitate every 30 seconds. 8. Final water rinse.", "link": "https://www.l-camera-forum.com/topic/258970-dual-development-which-one-to-use-first/?tab=comments#comment-3494223", "origin": "L-forum", "suborigin": "258970-dual-development-which-one-to-use-first", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i have a 100 feet -----> roll !!!  of hp5 at home and i developed it until now in rodinal , d76 and xtol.", "sortedWord": "roll", "Identifyer": null, "identifyer": 105811, "year": "2018"}, {"autor": "Jodad", "date": "2018-02-26 10:59:00", "content": " Hey guys. So i now have a bunch of different rolls of B&W film (TMax, TriX,HP5,Foma100 etc.) that have been shot and are sitting in my fridge waiting to be developed. Most (other than a few 100s and 200s) are 400 ISO and some have been shot at box speed but most have been pushed between 1 and 2 stops. Is there a developer that I can use to develop all of these films? I'm not in the position to buy a bunch of different devs to suit each film. Is there sort of a jack of all trades developer that you guys recommend? Thanks Guys --img-- ", "link": "https://www.l-camera-forum.com/topic/282197-lots-of-different-rolls-of-bw-film-all-pushed-to-different-speeds/?tab=comments#comment-3469160", "origin": "L-forum", "suborigin": "282197-lots-of-different-rolls-of-bw-film-all-pushed-to-different-speeds", "result": false, "Selector": "i can use to develop", "selectorShort": "develop", "MarkedSent": "is there a developer that i can use to develop all of these -----> films !!! ?", "sortedWord": "film", "Identifyer": null, "identifyer": 105854, "year": "2018"}], "name": "Leicasortedout2018develop"}