{"interestingcomments": [{"autor": "andybarton", "date": "2008-03-23 19:46:00", "content": "I would make sure that all the images were safely stored off the card, then check the disk using \"Disk Utility\"", "link": "https://www.l-camera-forum.com/topic/48736-hlep-message-sd-card-locked-error-message/?tab=comments#comment-518429", "origin": "L-forum", "suborigin": "48736-hlep-message-sd-card-locked-error-message", "result": true, "Selector": "i would make", "selectorShort": "make", "MarkedSent": "-----> i !!!  -----> would !!!  -----> make !!!  sure that all the images were safely stored off the card, then check the disk using \"disk utility\"", "sortedWord": "None", "Identifyer": null, "identifyer": 40804, "year": "2008"}, {"autor": "Flat Earth", "date": "2008-10-30 20:10:00", "content": "Mark, thanks for sharing this. If I want to make custom framelines, do you think I can fill lines on the fixed mask with a gap-filling cyanolite glue and then use a black Sharpie to make it opaque? If I do this with the 24,50 and 90 lines I should get an M2 style finder. Jonathan", "link": "https://www.l-camera-forum.com/topic/66999-anatomy-of-the-leica-m8-framelines/?tab=comments#comment-700585", "origin": "L-forum", "suborigin": "66999-anatomy-of-the-leica-m8-framelines", "result": true, "Selector": "i want to make", "selectorShort": "make", "MarkedSent": "mark, thanks for sharing this. if -----> i !!!  -----> want !!!  -----> to !!!  -----> make !!!  custom framelines, do you think -----> i !!!  can fill lines on the fixed mask with a gap-filling cyanolite glue and then use a black sharpie -----> to !!!  -----> make !!!  it opaque? if i do this with the 24,50 and 90 lines i should get an m2 style finder. jonathan", "sortedWord": "None", "Identifyer": null, "identifyer": 44707, "year": "2008"}, {"autor": "Riccis", "date": "2008-06-25 17:47:00", "content": "Seeking advice here on dropping DSLR shooting of weddings and using the M8 as my primary tool. Like to hear from any wedding Pro's here on how they integrate the M8 into their work and how many they use on the day and what's in the trunk for back-up? Going on' date=' how many bodies & batteries do they carry for a full wedding and how many frames do they shoot? Is there great confidence in equipment, or do precautions need to be taken to ensure the finished product for the client? Any other advice? I'm an experienced wedding photographer, doing 2 or 3 weddings a month (1,000 frames each), on a Pro DSLR + zoom lenses, but I used to shoot weddings on film M's, have the lenses still and want to get back to the small package. Pro's using M8's for weddings seem to be a minute proportion of the total and I haven't found a nationally recognized Pro using a digital rangefinder for weddings, or even serious portraiture. Be glad to be put right on that. Appreciate any comments on this. This is about RF's and not an RF v DSLR thread, nor about why one lens is better than another, but a genuine call for guidance from you experienced guys.[/quote'] M'ate: My wedding kit is made up of 3 M8s and 2 M7s (for the clients that want me to shoot film only). I have a spare battery per camera and use about a battery and a half on my main body while the second body only uses one battery since it does not get that much use. The third body and a film M always stay in the bag as a backup, but I've been lucky to never have a failure. I cycle the bodies every wedding to ensure they get about the same use. Since you mention you used to shoot film Ms, the move to the M8 should be pretty straight forward. Just ensure you read about all the known issues (which IMHO are not such a big deal as some folks make it to be, at least for documentary wedding photography) and shoot RAW. Even when I was using DSLRs, I was never a machine gunner and my very tight edits yield around 300-500 images per wedding. I just shot a wedding 100% on film two weeks ago on 10 rolls (and not because of cost) and it was the perfect coverage. I try to make every shot count with digital since I don't want to spend too much time postprocessing, using a rangefinder camera helps a lot since I always can tell whether I got the shot I wanted or not. Believe it or not, there are a lot of wedding pros also using M8s including fellow member Jamie Roberts (James Roberts Photography - Weddings, Portraits & Special Events) and Andrew Niesen from LaCour (LaCour | Photography | Wedding Photography | Atlanta | New York | Miami). Please feel free to post any questions you may have. Cheers,", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/?tab=comments#comment-589756", "origin": "L-forum", "suborigin": "56314-m8-pro-wedding-photography", "result": true, "Selector": "i try to make", "selectorShort": "make", "MarkedSent": "seeking advice here on dropping dslr shooting of weddings and using the m8 as my primary tool. like to hear from any wedding pro's here on how they integrate the m8 into their work and how many they use on the day and what's in the trunk for back-up? going on' date=' how many bodies & batteries do they carry for a full wedding and how many frames do they shoot? is there great confidence in equipment, or do precautions need to be taken to ensure the finished product for the client? any other advice? i'm an experienced wedding photographer, doing 2 or 3 weddings a month (1,000 frames each), on a pro dslr + zoom lenses, but i used to shoot weddings on film m's, have the lenses still and want to get back to the small package. pro's using m8's for weddings seem to be a minute proportion of the total and i haven't found a nationally recognized pro using a digital rangefinder for weddings, or even serious portraiture. be glad to be put right on that. appreciate any comments on this. this is about rf's and not an rf v dslr thread, nor about why one lens is better than another, but a genuine call for guidance from you experienced guys.[/quote'] m'ate: my wedding kit is made up of 3 m8s and 2 m7s (for the clients that want me to shoot film only). i have a spare battery per camera and use about a battery and a half on my main body while the second body only uses one battery since it does not get that much use. the third body and a film m always stay in the bag as a backup, but i've been lucky to never have a failure. i cycle the bodies every wedding to ensure they get about the same use. since you mention you used to shoot film ms, the move to the m8 should be pretty straight forward. just ensure you read about all the known issues (which imho are not such a big deal as some folks make it to be, at least for documentary wedding photography) and shoot raw. even when i was using dslrs, i was never a machine gunner and my very tight edits yield around 300-500 images per wedding. i just shot a wedding 100% on film two weeks ago on 10 rolls (and not because of cost) and it was the perfect coverage. -----> i !!!  -----> try !!!  -----> to !!!  -----> make !!!  every shot count with digital since -----> i !!!  don't want -----> to !!!  spend too much time postprocessing, using a rangefinder camera helps a lot since -----> i !!!  always can tell whether -----> i !!!  got the shot -----> i !!!  wanted or not. believe it or not, there are a lot of wedding pros also using m8s including fellow member jamie roberts (james roberts photography - weddings, portraits & special events) and andrew niesen from lacour (lacour | photography | wedding photography | atlanta | new york | miami). please feel free to post any questions you may have. cheers,", "sortedWord": "None", "Identifyer": null, "identifyer": 44913, "year": "2008"}, {"autor": "sean_reid", "date": "2008-06-25 23:23:00", "content": "I shoot weddings professionally with an M8 as my primary camera. Backup is usually another M8 or an Epson R-D1 and then I also bring a 5D which stays with an assistant unless I need it. Overall, I love the M8 for this work but there are some caveats. 1) If the light is very low and I'm going to be up around ISO 1600 or higher, I prefer the 5D simply because the files are cleaner. 2) I sometimes have lighting sources in the frame when I'm shooting weddings by existing light (which is my norm). The IR-cut filters can tend to flare and this can be exacerbated by a lens that is not so well coated. Under these circumstances, I tend to prefer higher contrast lenses with the best possible coatings (this includes most of the recent ASPH lenses, the Zeiss ZMs, etc.) Wedding lenses I particularly like on the M8 are the 28 Summicron ASPH, 35/1.4 Lux ASPH and Leica 50/1.4 Lux ASPH *or* CV 50/1.5 Nokton. I don't filter the R-D1 (though there's some reason to) and with it I also like the CV 28/1.9 Ultron and CV 35/1.7 Ultron. I haven't yet shot a wedding with a CV 35/1.2 Nokton but that probably would work well even if filtered for the M8. 3) The method for changing ISO is a pain when one is working quickly. I made great efforts to get Leica to improve this but nothing has been done to date. Otherwise, its a great wedding camera if you like RFs and working with primes. For flash I freehand a corded Vivitar 285 with a remote sensor on the hot shoe. Cheers, Sean http://www.still-photo.net", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/?tab=comments#comment-589998", "origin": "L-forum", "suborigin": "56314-m8-pro-wedding-photography", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i shoot weddings professionally with an m8 as my primary camera. backup is usually another m8 or an epson r-d1 and then i also bring a 5d which stays with an assistant unless i need it. overall, i love the m8 for this work but there are some caveats. 1) if the light is very low and i'm going to be up around iso 1600 or higher, i prefer the 5d simply because the files are cleaner. 2) i sometimes have lighting sources in the frame when i'm shooting weddings by existing light (which is my norm). the ir-cut filters can tend to flare and this can be exacerbated by a lens that is not so well coated. under these circumstances, i tend to prefer higher contrast lenses with the best possible coatings (this includes most of the recent asph lenses, the zeiss zms, etc.) wedding lenses i particularly like on the m8 are the 28 summicron asph, 35/1.4 lux asph and leica 50/1.4 lux asph *or* cv 50/1.5 nokton. i don't filter the r-d1 (though there's some reason to) and with it i also like the cv 28/1.9 ultron and cv 35/1.7 ultron. i haven't yet shot a wedding with a cv 35/1.2 nokton but that probably would work well even if filtered for the m8. 3) the method for changing iso is a pain when one is working quickly. -----> i !!!  -----> made !!!  great efforts to get leica to improve this but nothing has been done to date. otherwise, its a great wedding camera if you like rfs and working with primes. for flash i freehand a corded vivitar 285 with a remote sensor on the hot shoe. cheers, sean http://www.still-photo.net", "sortedWord": "None", "Identifyer": null, "identifyer": 44916, "year": "2008"}, {"autor": "Michael Tyler", "date": "2008-07-03 07:49:00", "content": "To each his own... But the market doesn't lie. Millions of DSLRs sold and 99% wedding shooters use DSLRs as their main system around the globe. Doesn't get much more perfect then that, IMO. But yeah, this is a M8 forum so the overprotection is to be expected. An unfair statement. It's true the M8 has reliability issues, and I do keep my Canons at weddings also, but I have vastly (all caps VASTLY) more confidence that the M8 will render me a well-focused shot than the computerized gadgetry in my SLRs. Reliability is as reliability does. For some, myself included (and Sean I'm assuming), a rangefinder system provides a different sensory input for the eye and the brain. Compare an SLR to binoculars, whereas the rangefinder is the naked eye. Some people need the binoculars, and some prefer to see the whole vista at once. It's a creative choice. In the few months since I've switched to using a rangefinder system, the creative quality of my work has skyrocketed. I can understand making a blanket statement that DSLRs are perfect for weddings if you're shooting standard cookie-cutter weddings that look like the other 99% of shooters out there, everyone pressing the buttons and letting the camera's computer make the decisions. But if you're looking to stretch artistically and provide your clients with a unique documentation of the day, then a rangefinder is one of the \"perfect\" means of doing so.", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/3/?tab=comments#comment-594807", "origin": "L-forum", "suborigin": "56314-m8-pro-wedding-photography", "result": true, "Selector": "i can understand making", "selectorShort": "make", "MarkedSent": "to each his own... but the market doesn't lie. millions of dslrs sold and 99% wedding shooters use dslrs as their main system around the globe. doesn't get much more perfect then that, imo. but yeah, this is a m8 forum so the overprotection is to be expected. an unfair statement. it's true the m8 has reliability issues, and i do keep my canons at weddings also, but i have vastly (all caps vastly) more confidence that the m8 will render me a well-focused shot than the computerized gadgetry in my slrs. reliability is as reliability does. for some, myself included (and sean i'm assuming), a rangefinder system provides a different sensory input for the eye and the brain. compare an slr to binoculars, whereas the rangefinder is the naked eye. some people need the binoculars, and some prefer to see the whole vista at once. it's a creative choice. in the few months since i've switched to using a rangefinder system, the creative quality of my work has skyrocketed. -----> i !!!  -----> can !!!  -----> understand !!!  -----> making !!!  a blanket statement that dslrs are perfect for weddings if you're shooting standard cookie-cutter weddings that look like the other 99% of shooters out there, everyone pressing the buttons and letting the camera's computer make the decisions. but if you're looking to stretch artistically and provide your clients with a unique documentation of the day, then a rangefinder is one of the \"perfect\" means of doing so.", "sortedWord": "None", "Identifyer": null, "identifyer": 44953, "year": "2008"}, {"autor": "sean_reid", "date": "2008-07-03 16:02:00", "content": " For some, myself included (and Sean I'm assuming), a rangefinder system provides a different sensory input for the eye and the brain. Compare an SLR to binoculars, whereas the rangefinder is the naked eye. Some people need the binoculars, and some prefer to see the whole vista at once. It's a creative choice. That's absolutely true and its a point I've tried to make since I reviewed the Epson R-D1 in 2004. RF cameras certainly are not best for everyone but I'm very glad that there are at least two DRFs on the market for those of us who shoot digital and prefer rangefinder cameras. Cheers, Sean", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/4/?tab=comments#comment-595192", "origin": "L-forum", "suborigin": "56314-m8-pro-wedding-photography", "result": true, "Selector": "i've tried to make", "selectorShort": "make", "MarkedSent": " for some, myself included (and sean i'm assuming), a rangefinder system provides a different sensory input for the eye and the brain. compare an slr to binoculars, whereas the rangefinder is the naked eye. some people need the binoculars, and some prefer to see the whole vista at once. it's a creative choice. that's absolutely true and its a point -----> i !!! 've -----> tried !!!  -----> to !!!  -----> make !!!  since -----> i !!!  reviewed the epson r-d1 in 2004. rf cameras certainly are not best for everyone but i'm very glad that there are at least two drfs on the market for those of us who shoot digital and prefer rangefinder cameras. cheers, sean", "sortedWord": "None", "Identifyer": null, "identifyer": 44965, "year": "2008"}, {"autor": "Jamie Roberts", "date": "2008-07-08 14:52:00", "content": "{snipped}BTW, it is very nice to see exchanging of ideas (even if sometimes we don't agree) in a civil manner that does not resort to name calling and members getting booted... I also love and appreciate everyone's contributions. Thank you!!! Yes, it's very refreshing, to be sure... It's true that if you discount Riccis (which I'm personally not going to do) then you can say most of the top wedding photographers in the field shoot dSLRs. Many of the younger ones I've talked with don't know how to manually focus (and are proud of it) but all are really interested when they see how easy it is to nail focus with a rangefinder in very low light --img--  At WPPI Joe Buissink in his stage presentation even said, in horror, \"imagine all the great photographers of the past--having to shoot with rangefinders!\" Right then, I was chuckling and wanted to give him an M3 and an M8 --img--  I think that if the M8 didn't have the green streak artifact that Jeff A. unfortunately ran into on some key shots, he would be using M8s, though now he's using 1ds3s and evidently likes them a lot. I can't blame him; I loved my 1ds2 as well. But I do think the rangefinder has a stealth advantage, especially over the large white Canon L series zooms! Heck, not only have I scared kids with a 1 series and a 70-200 (nice pic, there, Dave!!) but I've nearly scarred them too--they run around right at lens hood level when that thing is on my shoulder. So YMMV. I know when I'm wearing the M8 only, people mistake me for a guest at large weddings, so they ignore me, and I do get better moments. Some people--large or small--are camera shy. When I'm wearing the DMR or 5d (or both, LOL!!) they invariably pose or purposely look away. Anyway, IMO the actual files, too, from the M can't be beat yet, except by the DMR or in the extremities of high ISO. In adverse lighting, the M8 just sings (as does the DMR) and I have the side-by-side 5d files to compare with. Small differences, but important, as I said. Coupled with the right processing, the M8 files just rock. This is workflow dependent though, so YMMV. And nothing looks like a Nocti shot wide open or close to it (1.2). Not the 50 1.4 Nikon, not the 50 1.2 Canon, not even the 85 R Lux (though it's really close!). There is a huge difference in the way the Nocti gathers and \"concentrates\" light while maintaining very high contrast. At 1.2, the Canon is a very nice lens, don't get me wrong, but it's not the same. PS--these are all proof quality--right out of C1. They haven't been colour corrected. The print versions are much better, and if I had time, I'd make them smaller and post... but I should be processing weddings... --img--  28 cron @ 3PM in June --img--  Lots of backlight; very little flare: --img--  90 cron pre ASPH at f2.0, used with a Canon 580 V2: --img--  Nocti @ 1.2: --img--  21 Elmarit pre-ASPH--so nicely corrected, and wonderful detail when blown up: --img--  Nocti @ 1.0 with a Canon 580V2: --img-- ", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/6/?tab=comments#comment-599319", "origin": "L-forum", "suborigin": "56314-m8-pro-wedding-photography", "result": true, "Selector": "i'd make", "selectorShort": "make", "MarkedSent": "{snipped}btw, it is very nice to see exchanging of ideas (even if sometimes we don't agree) in a civil manner that does not resort to name calling and members getting booted... i also love and appreciate everyone's contributions. thank you!!! yes, it's very refreshing, to be sure... it's true that if you discount riccis (which i'm personally not going to do) then you can say most of the top wedding photographers in the field shoot dslrs. many of the younger ones i've talked with don't know how to manually focus (and are proud of it) but all are really interested when they see how easy it is to nail focus with a rangefinder in very low light --img--  at wppi joe buissink in his stage presentation even said, in horror, \"imagine all the great photographers of the past--having to shoot with rangefinders!\" right then, i was chuckling and wanted to give him an m3 and an m8 --img--  i think that if the m8 didn't have the green streak artifact that jeff a. unfortunately ran into on some key shots, he would be using m8s, though now he's using 1ds3s and evidently likes them a lot. i can't blame him; i loved my 1ds2 as well. but i do think the rangefinder has a stealth advantage, especially over the large white canon l series zooms! heck, not only have i scared kids with a 1 series and a 70-200 (nice pic, there, dave!!) but i've nearly scarred them too--they run around right at lens hood level when that thing is on my shoulder. so ymmv. i know when i'm wearing the m8 only, people mistake me for a guest at large weddings, so they ignore me, and i do get better moments. some people--large or small--are camera shy. when i'm wearing the dmr or 5d (or both, lol!!) they invariably pose or purposely look away. anyway, imo the actual files, too, from the m can't be beat yet, except by the dmr or in the extremities of high iso. in adverse lighting, the m8 just sings (as does the dmr) and i have the side-by-side 5d files to compare with. small differences, but important, as i said. coupled with the right processing, the m8 files just rock. this is workflow dependent though, so ymmv. and nothing looks like a nocti shot wide open or close to it (1.2). not the 50 1.4 nikon, not the 50 1.2 canon, not even the 85 r lux (though it's really close!). there is a huge difference in the way the nocti gathers and \"concentrates\" light while maintaining very high contrast. at 1.2, the canon is a very nice lens, don't get me wrong, but it's not the same. ps--these are all proof quality--right out of c1. they haven't been colour corrected. the print versions are much better, and if -----> i !!!  had time, -----> i !!! -----> 'd !!!  -----> make !!!  them smaller and post... but i should be processing weddings... --img--  28 cron @ 3pm in june --img--  lots of backlight; very little flare: --img--  90 cron pre asph at f2.0, used with a canon 580 v2: --img--  nocti @ 1.2: --img--  21 elmarit pre-asph--so nicely corrected, and wonderful detail when blown up: --img--  nocti @ 1.0 with a canon 580v2: --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 45023, "year": "2008"}, {"autor": "Rolo", "date": "2008-07-10 08:29:00", "content": "And if you'll forgive me, on this digital thread, here's another from the same day, Fuji 400. The tonality is quite different from what I capture digitally today. Am I making sense here? I can bend a digital file as good as the next man, but this is untouched and all the pics from the sequence are perfect matches - very little post work needed. It was here that I learned to hand hold an M for 1/15 sec whilst holding breath and praying atthe same time.--img--  I shot a wedding in the same church a month ago with a DSLR and probably from the very same spot and probably at an iso that spoiled the image. Must compare the files. Rolo as dear friend Jamie said : With the M bodies, when you nail the focus the focus is indeed nailed --img-- ", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/8/?tab=comments#comment-600812", "origin": "L-forum", "suborigin": "56314-m8-pro-wedding-photography", "result": true, "Selector": "i making", "selectorShort": "make", "MarkedSent": "and if you'll forgive me, on this digital thread, here's another from the same day, fuji 400. the tonality is quite different from what i capture digitally today. am -----> i !!!  -----> making !!!  sense here? i can bend a digital file as good as the next man, but this is untouched and all the pics from the sequence are perfect matches - very little post work needed. it was here that i learned to hand hold an m for 1/15 sec whilst holding breath and praying atthe same time.--img--  i shot a wedding in the same church a month ago with a dslr and probably from the very same spot and probably at an iso that spoiled the image. must compare the files. rolo as dear friend jamie said : with the m bodies, when you nail the focus the focus is indeed nailed --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 45063, "year": "2008"}, {"autor": "Vieri", "date": "2008-07-10 15:36:00", "content": "Thanks, will not be shown in the Hall of Fame, but one that always brings a smile. Had to scramble on hands and knees to dig the negs out to take a look. It was shot on Fuji Superia 400 and actually on a Leica M3 and probably a 50mm Summicron. In a way I'm glad you asked because I have a discarded sample album that I come across from time to time and the tonality of the bride's preparation shots always stop me and I think WOW, wonder what film I used for that. Here's a sample and on screen it looks nowhere near as good as in print; in fact I'd be disappointed with a screen view today, but the prints !!* The film I'm referring to is Fuji Superia 800. Because I only had one camera body, plus a Mam 7 backup, I changed over after the first film to Superia 400. Ended up with Superia because it was my first wedding (of my 'Professional career'), was unpaid and I was invited to shoot only 5 hours before the ceremony. Next day, I bought a Nikon D70 which made life so much easier, but the end result was not as good. Sorry about the bio --img--  .... here's the 800 iso scan. Rolo And if you'll forgive me, on this digital thread, here's another from the same day, Fuji 400. The tonality is quite different from what I capture digitally today. Am I making sense here? I can bend a digital file as good as the next man, but this is untouched and all the pics from the sequence are perfect matches - very little post work needed. It was here that I learned to hand hold an M for 1/15 sec whilst holding breath and praying atthe same time.--img--  I shot a wedding in the same church a month ago with a DSLR and probably from the very same spot and probably at an iso that spoiled the image. Must compare the files. Rolo as dear friend Jamie said : With the M bodies, when you nail the focus the focus is indeed nailed Rolo, thank you very much for the information and for the bio which I enjoyed reading very much. I do agree with your points re: film vs digital and post, once you nailed it on film there isn't much you gotta do in PP; digital is a different beast altogether, more convenient most times when you are in a hurry and when you got your workflow down, but still film's character is IMHO unmatched in the end. This, of course, doesn't mean I don't use digital for my pro work, I do and love the time saving & convenience especially for color work; for my personal stuff is all film, and for BW digital doesn't come close - still, of course, IMHO. --img-- ", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/9/?tab=comments#comment-601119", "origin": "L-forum", "suborigin": "56314-m8-pro-wedding-photography", "result": true, "Selector": "i making", "selectorShort": "make", "MarkedSent": "thanks, will not be shown in the hall of fame, but one that always brings a smile. had to scramble on hands and knees to dig the negs out to take a look. it was shot on fuji superia 400 and actually on a leica m3 and probably a 50mm summicron. in a way i'm glad you asked because i have a discarded sample album that i come across from time to time and the tonality of the bride's preparation shots always stop me and i think wow, wonder what film i used for that. here's a sample and on screen it looks nowhere near as good as in print; in fact i'd be disappointed with a screen view today, but the prints !!* the film i'm referring to is fuji superia 800. because i only had one camera body, plus a mam 7 backup, i changed over after the first film to superia 400. ended up with superia because it was my first wedding (of my 'professional career'), was unpaid and i was invited to shoot only 5 hours before the ceremony. next day, i bought a nikon d70 which made life so much easier, but the end result was not as good. sorry about the bio --img--  .... here's the 800 iso scan. rolo and if you'll forgive me, on this digital thread, here's another from the same day, fuji 400. the tonality is quite different from what i capture digitally today. am -----> i !!!  -----> making !!!  sense here? i can bend a digital file as good as the next man, but this is untouched and all the pics from the sequence are perfect matches - very little post work needed. it was here that i learned to hand hold an m for 1/15 sec whilst holding breath and praying atthe same time.--img--  i shot a wedding in the same church a month ago with a dslr and probably from the very same spot and probably at an iso that spoiled the image. must compare the files. rolo as dear friend jamie said : with the m bodies, when you nail the focus the focus is indeed nailed rolo, thank you very much for the information and for the bio which i enjoyed reading very much. i do agree with your points re: film vs digital and post, once you nailed it on film there isn't much you gotta do in pp; digital is a different beast altogether, more convenient most times when you are in a hurry and when you got your workflow down, but still film's character is imho unmatched in the end. this, of course, doesn't mean i don't use digital for my pro work, i do and love the time saving & convenience especially for color work; for my personal stuff is all film, and for bw digital doesn't come close - still, of course, imho. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 45068, "year": "2008"}, {"autor": "woodyspedden", "date": "2008-04-19 23:42:00", "content": " And Mark we all owe you a kudos for all the work you have done to evaluate the M8, state its limitations, and educate us so we can make informed decisions. Thank you so much for all your work on our behalf Woody Spedden Fort Collins, Colorado USA", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/16/?tab=comments#comment-541202", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "we can make", "selectorShort": "make", "MarkedSent": " and mark -----> we !!!  all owe you a kudos for all the work you have done to evaluate the m8, state its limitations, and educate us so -----> we !!!  -----> can !!!  -----> make !!!  informed decisions. thank you so much for all your work on our behalf woody spedden fort collins, colorado usa", "sortedWord": "None", "Identifyer": null, "identifyer": 45579, "year": "2008"}, {"autor": "jobjob", "date": "2008-04-22 06:24:00", "content": "Thanks for the compliments :-) At the first and last one i made exposure metering on the highlights in the sky. The first one looks so dramatically cause a heavy storm was blowing over the island and the sun was only looking through some little holes. This are my first photos with the Panasonic wide converter on my Digilux. A very heavy and bulky piece with x 0,82. It made a good job with a minimum of distortion and i realy love the panorama style. JJ", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/12/?tab=comments#comment-542707", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "thanks for the compliments :-) at the first and last one -----> i !!!  -----> made !!!  exposure metering on the highlights in the sky. the first one looks so dramatically cause a heavy storm was blowing over the island and the sun was only looking through some little holes. this are my first photos with the panasonic wide converter on my digilux. a very heavy and bulky piece with x 0,82. it made a good job with a minimum of distortion and i realy love the panorama style. jj", "sortedWord": "None", "Identifyer": null, "identifyer": 15458, "year": "2008"}, {"autor": "John Thawley", "date": "2008-11-17 12:26:00", "content": "Bernd, That's a nice shot and perspective. I find that ISO-noise is only a problem if there's too little light. As the sensor is native 100 ISO that's what it can see. With less light, the higher ISO-settings has to figure out what's in the dark spots, hence the noise. I've done lots of 200 ISO shots (often by error ;-) in daylight that looks great. I think that is a situation that is \"global\" to many cameras. When I would shoot night racing I would try to \"sneak\" up on the higher ISO settings in-as-much as I did not want to \"go there.\" As a result, I'd be shooting slightly under exposed. I would blame the resulting noise on high ISO. Lately, though, I realized I needed to just go for it, set the ISO high and go for it... and expose the image properly. Suprisingly, my images now have less noise at 1600 than they used to at 800 ISO. And, I see the benefits at all high ISOs when I make sure there is enough \"headroom\" to expose the image properly. Once you get into the high ISO you've got to be sure and have a solid exposure. The minute you try to save it in post processing, you'll simply amplify the noise exponentially. I find 400 ISO on the Digilux 2 very workable in RAW. JT", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/14/?tab=comments#comment-718596", "origin": "L-forum", "suborigin": "20016-do-digilux-2-photos-have-distinctive-look", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "bernd, that's a nice shot and perspective. i find that iso-noise is only a problem if there's too little light. as the sensor is native 100 iso that's what it can see. with less light, the higher iso-settings has to figure out what's in the dark spots, hence the noise. i've done lots of 200 iso shots (often by error ;-) in daylight that looks great. i think that is a situation that is \"global\" to many cameras. when i would shoot night racing i would try to \"sneak\" up on the higher iso settings in-as-much as i did not want to \"go there.\" as a result, i'd be shooting slightly under exposed. i would blame the resulting noise on high iso. lately, though, i realized i needed to just go for it, set the iso high and go for it... and expose the image properly. suprisingly, my images now have less noise at 1600 than they used to at 800 iso. and, -----> i !!!  see the benefits at all high isos when -----> i !!!  -----> make !!!  sure there is enough \"headroom\" to expose the image properly. once you get into the high iso you've got to be sure and have a solid exposure. the minute you try to save it in post processing, you'll simply amplify the noise exponentially. i find 400 iso on the digilux 2 very workable in raw. jt", "sortedWord": "None", "Identifyer": null, "identifyer": 15494, "year": "2008"}, {"autor": "Graf Lomo", "date": "2008-08-09 12:17:00", "content": "This is the lttle lady that make the pictures of my R's. So I make a picture with my R8 and Summicron 50 of her. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/45395-lets-see-your-r/page/4/?tab=comments#comment-624134", "origin": "L-forum", "suborigin": "45395-lets-see-your-r", "result": true, "Selector": "i make", "selectorShort": "make", "MarkedSent": "this is the lttle lady that make the pictures of my r's. so -----> i !!!  -----> make !!!  a picture with my r8 and summicron 50 of her. --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 22879, "year": "2008"}, {"autor": "ho_co", "date": "2008-09-08 04:16:00", "content": "... I bought my Manfrotto in 1982, so can hardly blame them. John-- Unless: 1) Manfrotto was in compliance with standards when you bought; and 2) international standards were changed after that time, leaving Manfrotto out of compliance; then it doesn't seem to me to make any difference how old the tripod is. IMHO: 'Out of compliance then' + 'out of compliance now' means they bear some responsibility, though you may prefer not to press the issue. At any rate, welcome to the forum; and I hope this gets straightened out smoothly. Good luck!", "link": "https://www.l-camera-forum.com/topic/61879-leica-tripod-sockets/?tab=comments#comment-647242", "origin": "L-forum", "suborigin": "61879-leica-tripod-sockets", "result": true, "Selector": "me to make", "selectorShort": "make", "MarkedSent": "... i bought my manfrotto in 1982, so can hardly blame them. john-- unless: 1) manfrotto was in compliance with standards when you bought; and 2) international standards were changed after that time, leaving manfrotto out of compliance; then it doesn't seem -----> to !!!  -----> me !!!  -----> to !!!  -----> make !!!  any difference how old the tripod is. imho: 'out of compliance then' + 'out of compliance now' means they bear some responsibility, though you may prefer not to press the issue. at any rate, welcome to the forum; and i hope this gets straightened out smoothly. good luck!", "sortedWord": "None", "Identifyer": null, "identifyer": 86140, "year": "2008"}, {"autor": "merg51", "date": "2008-08-13 21:05:00", "content": "I'm new to the forum as well. I have a D2 with the 77mm adapter, which I'm happy with. At the point of decision I already had a number of 77mm filters: UV, polarizer, ND's, purchased for Canon lenses, I made a decision based upon convenience, and haven't experienced any downsides. John", "link": "https://www.l-camera-forum.com/topic/60135-digilux-2-69mm-filter-do-you-have-a-filter-on-your-d2/?tab=comments#comment-627578", "origin": "L-forum", "suborigin": "60135-digilux-2-69mm-filter-do-you-have-a-filter-on-your-d2", "result": true, "Selector": "i made", "selectorShort": "make", "MarkedSent": "i'm new to the forum as well. i have a d2 with the 77mm adapter, which i'm happy with. at the point of decision -----> i !!!  already had a number of 77mm filters: uv, polarizer, nd's, purchased for canon lenses, -----> i !!!  -----> made !!!  a decision based upon convenience, and haven't experienced any downsides. john", "sortedWord": "None", "Identifyer": null, "identifyer": 93784, "year": "2008"}, {"autor": "rafael_macia", "date": "2008-03-23 19:58:00", "content": "I would make sure that all the images were safely stored off the card, then check the disk using \"Disk Utility\" On Disk Utility status is read only cannot repair permissions or disc", "link": "https://www.l-camera-forum.com/topic/48736-hlep-message-sd-card-locked-error-message/?tab=comments#comment-518437", "origin": "L-forum", "suborigin": "48736-hlep-message-sd-card-locked-error-message", "result": false, "Selector": "i would make", "selectorShort": "make", "MarkedSent": "i would make sure that all the images were safely stored off the card, then check the disk using \"disk utility\" on disk utility status is read only cannot -----> repair !!!  permissions or disc", "sortedWord": "repair", "Identifyer": null, "identifyer": 40807, "year": "2008"}], "name": "Leicasortedout2008make"}