{"interestingcomments": [{"autor": "GlennB", "date": "2009-10-11 17:28:00", "content": "I will get my hands on an SC-29 to see if its sensor talks to the M8. If it does so, I'll get one and report on how it works with the M9 (when I get mine -- c'mon Leica). Bill, IF I'm reading the B&H photo description right (see below) the SC-29 cord's on camera \"sensor\" is strictly for lens autofocus assist and is called an \"illuminator\". This, to me. means it's some sort of light source (IR ?) that projects onto your shooting subject that the camera's AF sensor detects to set the focus. I don't believe that the Leica wizards have come up with an auto-focus M lens yet.--img--  \"In addition, the SC-29's AF Illuminator will also provide AF assistance to the camera in low-light conditions.\" I would really be surprised if the SC-29's \"illuminator\" acted like an on-camera \"auto flash\" (ala vivitar sensor cord) sensor on a M8 or M9. As always, I could be wrong.--img-- Glenn", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/4/?tab=comments#comment-1070928", "origin": "L-forum", "suborigin": "99414-reidreview-review-of-leica-sf58-flash-unit", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i will get my hands on an sc-29 to see if its sensor talks to the m8. if it does so, i'll get one and report on how it works with the m9 (when i get mine -- c'mon leica). bill, if i'm reading the b&h photo description right (see below) the sc-29 cord's on camera \"sensor\" is strictly for lens autofocus assist and is called an \"illuminator\". this, to me. means it's some sort of light source (ir ?) that projects onto your shooting subject that the camera's af sensor detects to set the focus. i don't believe that the leica wizards have -----> come !!!  -----> up !!!  -----> with !!!  an auto-focus m lens yet.--img--  \"in addition, the sc-29's af illuminator will also provide af assistance to the camera in low-light conditions.\" i would really be surprised if the sc-29's \"illuminator\" acted like an on-camera \"auto flash\" (ala vivitar sensor cord) sensor on a m8 or m9. as always, i could be wrong.--img-- glenn", "sortedWord": "None", "Identifyer": null, "identifyer": 37718, "year": "2009"}, {"autor": "Jeff S", "date": "2009-08-12 22:05:00", "content": "an inexpensive device he bought at IKEA which you can read about on his blog: Thanks, William...perfect timing! I was just in several stores last week looking for a better, but inexpensive, way to temporarily hang potential \"winners\" in a home space I'm dedicating as an extension to my \"lightroom.\" I came up with several possible solutions, but this is definitely worth considering. Jeff PS I just moved from the Bay Area last year...sure miss the weather...but not the quakes and fires.", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/page/2/?tab=comments#comment-992287", "origin": "L-forum", "suborigin": "93255-do-you-print-your-photographs", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "an inexpensive device he bought at ikea which you can read about on his blog: thanks, william...perfect timing! i was just in several stores last week looking for a better, but inexpensive, way to temporarily hang potential \"winners\" in a home space i'm dedicating as an extension to my \"lightroom.\" i -----> came !!!  -----> up !!!  -----> with !!!  several possible solutions, but this is definitely worth considering. jeff ps i just moved from the bay area last year...sure miss the weather...but not the quakes and fires.", "sortedWord": "None", "Identifyer": null, "identifyer": 40736, "year": "2009"}, {"autor": "MikeMyers", "date": "2009-09-15 19:22:00", "content": "That's a lot of information to digest. I think I need to take a break from this, and read on how to use \"channel mixer\" for Photoshop. Until now, I thought I was simply learning how to take interesting looking IR photos with the M8. From the linked discussions, I see that what I really need to do, is get the M8 to emulate the way Ektachrome IR slide film created pictures. Apparently this will take a good bit of experimentation and testing - but I'd have thought that since the Ektachrome IR was \"always\" the same, a set of procedures and values should allow me to translate in M8 image into what the slide film would have produced. (It might then need fine tuning, but maybe not, as the slide film never got \"fine tuned\".) Obviously, the M8 can do all the above quite nicely, so it's just left for me to learn what you guys have shown me. It still seems possible that one could come up with a procedure, a series of steps, that if followed exactly, would produce the equivalent of what the IR Ektachrome would have produced. If I want color, I'll need to use a tripod and take two shots, one \"normal\" and one with the IR filter. I've got to stop now, as I'm leaving on a two-week trip tomorrow. However, I'll have lots of time in the countryside to practice on these things, and will bring a Photoshop book with me so I can learn to use the channel mixer function. Thanks!!", "link": "https://www.l-camera-forum.com/topic/96795-taking-ir-photos-with-an-m82/?tab=comments#comment-1036615", "origin": "L-forum", "suborigin": "96795-taking-ir-photos-with-an-m82", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "that's a lot of information to digest. i think i need to take a break from this, and read on how to use \"channel mixer\" for photoshop. until now, i thought i was simply learning how to take interesting looking ir photos with the m8. from the linked discussions, i see that what i really need to do, is get the m8 to emulate the way ektachrome ir slide film created pictures. apparently this will take a good bit of experimentation and testing - but i'd have thought that since the ektachrome ir was \"always\" the same, a set of procedures and values should allow me to translate in m8 image into what the slide film would have produced. (it might then need fine tuning, but maybe not, as the slide film never got \"fine tuned\".) obviously, the m8 can do all the above quite nicely, so it's just left for me to learn what you guys have shown me. it still seems possible that one could -----> come !!!  -----> up !!!  -----> with !!!  a procedure, a series of steps, that if followed exactly, would produce the equivalent of what the ir ektachrome would have produced. if i want color, i'll need to use a tripod and take two shots, one \"normal\" and one with the ir filter. i've got to stop now, as i'm leaving on a two-week trip tomorrow. however, i'll have lots of time in the countryside to practice on these things, and will bring a photoshop book with me so i can learn to use the channel mixer function. thanks!!", "sortedWord": "None", "Identifyer": null, "identifyer": 43431, "year": "2009"}, {"autor": "wlaidlaw", "date": "2009-10-07 17:19:00", "content": "Many thanks for the quick response Wilson.Why on Earth didn't they implement a \"save\" or \"custom\" setting??? Unbeleivable! I'll experiment with some bubblewrap - I'm going to Ecuador next week and won't have time to accept the Leicagoodies postal order.--img--  Wilson, do/did you use the 24D in TTL mode for fill falsh? If so, what are your usual settings? As you may appreciate, I picked up this flash at the last minute and have a very steep learning curve in front of me if I can expect to use it with any degree of reproducibility in the contrasty tropical sunshine....--img--  I did use the 24 in TTL/GNC for fill in flash. It would not be a good choice however. Pre SF58, I mainly used to use a Metz 40MZ-2 in auto mode to do this. First I assume you are using this on an M8 or 9. If so, what you should do is go to the M8/9 menu and set slow speed sync to lens dependant. If you don't do this, then fill really does not work. I am not getting back to the UK until Friday afternoon but I could post you my SFILL as a loaner, since with my SF58 and a Sto-Fen soft box, I just don't use my SF24D now - would that reach you in time? You would also need to get some velcro Sticky Fixers as half the Velcro attachment system for the SFILL is on my 24. I think without the SFILL you will really struggle with fill, which is why Leicagoodies came up with it, the 24 is just too full frontal and brutal. Bubble wrap may work well enough. Try putting one layer of thin tissue paper between two layers of wrap as a diffusor. Wilson", "link": "https://www.l-camera-forum.com/topic/52775-leica-sf-24d-manual-pdf/page/3/?tab=comments#comment-1065994", "origin": "L-forum", "suborigin": "52775-leica-sf-24d-manual-pdf", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "many thanks for the quick response wilson.why on earth didn't they implement a \"save\" or \"custom\" setting??? unbeleivable! i'll experiment with some bubblewrap - i'm going to ecuador next week and won't have time to accept the leicagoodies postal order.--img--  wilson, do/did you use the 24d in ttl mode for fill falsh? if so, what are your usual settings? as you may appreciate, i picked up this flash at the last minute and have a very steep learning curve in front of me if i can expect to use it with any degree of reproducibility in the contrasty tropical sunshine....--img--  i did use the 24 in ttl/gnc for fill in flash. it would not be a good choice however. pre sf58, i mainly used to use a metz 40mz-2 in auto mode to do this. first i assume you are using this on an m8 or 9. if so, what you should do is go to the m8/9 menu and set slow speed sync to lens dependant. if you don't do this, then fill really does not work. i am not getting back to the uk until friday afternoon but i could post you my sfill as a loaner, since with my sf58 and a sto-fen soft box, i just don't use my sf24d now - would that reach you in time? you would also need to get some velcro sticky fixers as half the velcro attachment system for the sfill is on my 24. i think without the sfill you will really struggle -----> with !!!  fill, which is why leicagoodies -----> came !!!  -----> up !!!  -----> with !!!  it, the 24 is just too full frontal and brutal. bubble wrap may work well enough. try putting one layer of thin tissue paper between two layers of wrap as a diffusor. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 44308, "year": "2009"}, {"autor": "MikeMyers", "date": "2009-09-29 11:30:00", "content": "Wow; not only do I like it more, it's finally starting to look like what I expected an IR shot might look like in B&W; maybe I don't need to get the \"black\" filter after all. Thanks! (I did start to play with the image some more late last night, but I like what you did more than what I came up with!)", "link": "https://www.l-camera-forum.com/topic/84753-getting-ektachrome-infrared-colors-out-of-the-m8/page/2/?tab=comments#comment-1054340", "origin": "L-forum", "suborigin": "84753-getting-ektachrome-infrared-colors-out-of-the-m8", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "wow; not only do i like it more, it's finally starting to look like what i expected an ir shot might look like in b&w; maybe i don't need to get the \"black\" filter after all. thanks! (i did start to play -----> with !!!  the image some more late last night, but i like what you did more than what i -----> came !!!  -----> up !!!  -----> with !!! !)", "sortedWord": "None", "Identifyer": null, "identifyer": 44887, "year": "2009"}, {"autor": "azzo", "date": "2009-01-04 10:14:00", "content": "more, more MORE tears from laughter --img--  This guy is just incredible to say the least. --img--  btw - I just knew you'd come up with something of this sort after I asked you to tell all that I really did call. Tuo Amico --img-- ", "link": "https://www.l-camera-forum.com/topic/35319-i-love-my-m6/page/8/?tab=comments#comment-765991", "origin": "L-forum", "suborigin": "35319-i-love-my-m6", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "more, more more tears from laughter --img--  this guy is just incredible to say the least. --img--  btw - i just knew you'd -----> come !!!  -----> up !!!  -----> with !!!  something of this sort after i asked you to tell all that i really did call. tuo amico --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 48841, "year": "2009"}, {"autor": "Spiking", "date": "2009-01-30 20:30:00", "content": "Roma? Rome, too, has many hills. It's close, but it's not Rome. If wanted I could come up with an additional picture...", "link": "https://www.l-camera-forum.com/topic/75648-do-you-know-the-world-competition/page/2/?tab=comments#comment-795475", "origin": "L-forum", "suborigin": "75648-do-you-know-the-world-competition", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "roma? rome, too, has many hills. it's close, but it's not rome. if wanted i could -----> come !!!  -----> up !!!  -----> with !!!  an additional picture...", "sortedWord": "None", "Identifyer": null, "identifyer": 49393, "year": "2009"}], "name": "Leicasortedout2009with"}