{"interestingcomments": [{"autor": "01af", "date": "2015-01-28 14:26:00", "content": "Have you ever considered that perhaps your eyes are \"just not skilled enough\" to appreciate the nuances between the two outputs? As a matter of fact, I have. And I hereby repeat my request for you to provide us with an example where said \"nuances\" exist, so we can evaluate our eyes' skills and compare them to yours. Many people, including non-photographers, perceive a difference. So do I. But I don't perceive any differences which are actually rooted in sensor technology. I just perceive differences between cameras' outputs—which can be eliminated through appropriate processing. So in the end, there is nothing to be found in images from CCD sensors which cannot be had in images from CMOS sensors just as well. No intrinsic advantage in CCD sensors ... but a lot of intrinsic disadvantages (no live view, poor high-ISO performance, etc.). Some will say, well, the additional effort required for CMOS images to make them look like CCD images is a point in favour of CCD. But in my opinion, that's a foolish point of view because the effort required can be made as small as applying a custom profile, script, or action. Just a mouseclick or two. And I'm not only referring to the final outputs, but also to the behaviour of the files under post processing. At this point, you're losing me. What is \"behaviour of files under post-processing\" supposed to mean? Flexibility? Resilience? Malleableness? Effort required to come up with the desired final result? In all these points, I am seeing the advantages on the CMOS side of things ... or at the very least, no disadvantages. Then again, like you, I hope I haven't stepped on anybody's \"toes\". I'm afraid I stepped on yours. My apologies, I didn't mean to offend you ... much less as I always adored your photographs. Still I disagree with your opinion about the alleged virtues of the CCD sensor technology—and particularly after your open-letter campaign it is important to me to raise my voice in order to make it clear that not everybody agrees with you and your 400 friends. Let's have a little quiz. I show you two pictures (umm, magnified crops from pictures, actually), taken with the very same lens on a Leica M9 and a Leica M (Typ 240), and you tell me which you like better, and why. Here's the full frame, with a red frame indicating the crop: --img--  Here's the crop from the picture above: --img--  And finally, the crop from another capture of the same picture, taken from the same point of view with the same lens on the other camera: --img--  Both crops have been processed individually with Adobe Camera Raw. Remember, the question is not, \"What picture was taken with which camera?\" It also is not, \"How many differences can you spot?\" ... there are many minor differences, but that's not the point. The question is, \"Which do you like better?\" or alternatively, \"Which do you think will give the nicer print?\" (assuming we want to print big size).", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/3/?tab=comments#comment-2754476", "origin": "L-forum", "suborigin": "240288-400-leica-photographers-agree-we-love-ccd", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "have you ever considered that perhaps your eyes are \"just not skilled enough\" to appreciate the nuances between the two outputs? as a matter of fact, i have. and i hereby repeat my request for you to provide us with an example where said \"nuances\" exist, so we can evaluate our eyes' skills and compare them to yours. many people, including non-photographers, perceive a difference. so do i. but i don't perceive any differences which are actually rooted in sensor technology. i just perceive differences between cameras' outputs—which can be eliminated through appropriate processing. so in the end, there is nothing to be found in images from ccd sensors which cannot be had in images from cmos sensors just as well. no intrinsic advantage in ccd sensors ... but a lot of intrinsic disadvantages (no live view, poor high-iso performance, etc.). some will say, well, the additional effort required for cmos images to make them look like ccd images is a point in favour of ccd. but in my opinion, that's a foolish point of view because the effort required can be made as small as applying a custom profile, script, or action. just a mouseclick or two. and i'm not only referring to the final outputs, but also to the behaviour of the files under post processing. at this point, you're losing me. what is \"behaviour of files under post-processing\" supposed to mean? flexibility? resilience? malleableness? effort required to -----> come !!!  -----> up !!!  -----> with !!!  the desired final result? in all these points, i am seeing the advantages on the cmos side of things ... or at the very least, no disadvantages. then again, like you, i hope i haven't stepped on anybody's \"toes\". i'm afraid i stepped on yours. my apologies, i didn't mean to offend you ... much less as i always adored your photographs. still i disagree with your opinion about the alleged virtues of the ccd sensor technology—and particularly after your open-letter campaign it is important to me to raise my voice in order to make it clear that not everybody agrees with you and your 400 friends. let's have a little quiz. i show you two pictures (umm, magnified crops from pictures, actually), taken with the very same lens on a leica m9 and a leica m (typ 240), and you tell me which you like better, and why. here's the full frame, with a red frame indicating the crop: --img--  here's the crop from the picture above: --img--  and finally, the crop from another capture of the same picture, taken from the same point of view with the same lens on the other camera: --img--  both crops have been processed individually with adobe camera raw. remember, the question is not, \"what picture was taken with which camera?\" it also is not, \"how many differences can you spot?\" ... there are many minor differences, but that's not the point. the question is, \"which do you like better?\" or alternatively, \"which do you think will give the nicer print?\" (assuming we want to print big size).", "sortedWord": "None", "Identifyer": null, "identifyer": 39326, "year": "2015"}, {"autor": "Prosophos", "date": "2015-01-29 16:38:00", "content": "I think that its very hard to decide one way or the other (not owning either camera). Peter, If the issue is such a slam dunk as you say then why is it you will not publish any evidence (i.e. images) to back up your claims for CDD vs CMOS? We all see things differently which is fine, but if you are intending for a manufacturer to change such a core construction component then should you not at least provide some evidence to back up your claims? Surely this should be relatively easy given that they are both digital cameras and you have proven yourself very adept at online publishing. Not wishing to pick a fight or anything but surely this would add weight to your case? Antonio It's a fair question Antonio, and I'll respond to you because I believe you are genuinely asking and not trying to be clever. In truth, the differences are obvious to me and it amazes me that many people can't see the difference. Many others can, of course. For those that cannot see a difference, I don't think I'll change their minds with any demonstration I come up with. It's a trap to think otherwise, and it will create a forum thread-zilla that's even larger than this current thread. To be blunt, I don't want to put the effort into it. I'd rather enlist like-minded photographers/artists/enthusiasts who wish to see CCD continue - who are willing to sign my letter. As for the rest, they've decided to enter the LUF Leica M9/M-E/Monochrom sub-forum and create conflict. Why? Not sure, other than they enjoy the sport of it.", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/5/?tab=comments#comment-2755278", "origin": "L-forum", "suborigin": "240288-400-leica-photographers-agree-we-love-ccd", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i think that its very hard to decide one way or the other (not owning either camera). peter, if the issue is such a slam dunk as you say then why is it you will not publish any evidence (i.e. images) to back up your claims for cdd vs cmos? we all see things differently which is fine, but if you are intending for a manufacturer to change such a core construction component then should you not at least provide some evidence to back up your claims? surely this should be relatively easy given that they are both digital cameras and you have proven yourself very adept at online publishing. not wishing to pick a fight or anything but surely this would add weight to your case? antonio it's a fair question antonio, and i'll respond to you because i believe you are genuinely asking and not trying to be clever. in truth, the differences are obvious to me and it amazes me that many people can't see the difference. many others can, of course. for those that cannot see a difference, i don't think i'll change their minds -----> with !!!  any demonstration i -----> come !!!  -----> up !!!  -----> with !!! . it's a trap to think otherwise, and it will create a forum thread-zilla that's even larger than this current thread. to be blunt, i don't want to put the effort into it. i'd rather enlist like-minded photographers/artists/enthusiasts who wish to see ccd continue - who are willing to sign my letter. as for the rest, they've decided to enter the luf leica m9/m-e/monochrom sub-forum and create conflict. why? not sure, other than they enjoy the sport of it.", "sortedWord": "None", "Identifyer": null, "identifyer": 39376, "year": "2015"}, {"autor": "Antonio Russell", "date": "2015-01-29 16:56:00", "content": "It's a fair question Antonio, and I'll respond to you because I believe you are genuinely asking and not trying to be clever. In truth, the differences are obvious to me and it amazes me that many people can't see the difference. Many others can, of course. For those that cannot see a difference, I don't think I'll change their minds with any demonstration I come up with. It's a trap to think otherwise, and it will create a forum thread-zilla that's even larger than this current thread. To be blunt, I don't want to put the effort into it. I'd rather enlist like-minded photographers/artists/enthusiasts who wish to see CCD continue - who are willing to sign my letter. As for the rest, they've decided to enter the LUF Leica M9/M-E/Monochrom sub-forum and create conflict. Why? Not sure, other than they enjoy the sport of it. Fair enough. I must say that I am one of those who have looked at your site myself and can't really see any difference between the two, so I guess that if you are pushing for change based on your preference for CCD rather than anything objective that can be proven one way or another then I am thinking you will need a lot more signatures, and probably a lot of folks willing to put down some cash in advance. Leica are keen on their special editions aren't they! Good luck. Edited January 29, 2015 by A Aparicio", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/5/?tab=comments#comment-2755288", "origin": "L-forum", "suborigin": "240288-400-leica-photographers-agree-we-love-ccd", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "it's a fair question antonio, and i'll respond to you because i believe you are genuinely asking and not trying to be clever. in truth, the differences are obvious to me and it amazes me that many people can't see the difference. many others can, of course. for those that cannot see a difference, i don't think i'll change their minds -----> with !!!  any demonstration i -----> come !!!  -----> up !!!  -----> with !!! . it's a trap to think otherwise, and it will create a forum thread-zilla that's even larger than this current thread. to be blunt, i don't want to put the effort into it. i'd rather enlist like-minded photographers/artists/enthusiasts who wish to see ccd continue - who are willing to sign my letter. as for the rest, they've decided to enter the luf leica m9/m-e/monochrom sub-forum and create conflict. why? not sure, other than they enjoy the sport of it. fair enough. i must say that i am one of those who have looked at your site myself and can't really see any difference between the two, so i guess that if you are pushing for change based on your preference for ccd rather than anything objective that can be proven one way or another then i am thinking you will need a lot more signatures, and probably a lot of folks willing to put down some cash in advance. leica are keen on their special editions aren't they! good luck. edited january 29, 2015 by a aparicio", "sortedWord": "None", "Identifyer": null, "identifyer": 39378, "year": "2015"}, {"autor": "01af", "date": "2015-01-29 17:59:00", "content": "... I'll respond to you because I believe you are genuinely asking and not trying to be clever. [...] As for the rest, they've decided to enter the LUF Leica M9/M-E/M Monochrom sub-forum and create conflict. Why? Not sure, other than they enjoy the sport of it. So people either agree with you or create conflict!? This level of negativity surprises me—I wouldn't have expected this from you. I, for one, would genuinely like to know if you see something that I cannot see. So far, you have always refused to back up your claims with some substance; instead, you are always backing out with platitudes. Hence, my impression so far is, no substance from you. You don't see anything I don't. In truth, the differences are obvious to me and it amazes me that many people can't see the difference. Many others can, of course. For those that cannot see a difference, I don't think I'll change their minds with any demonstration I come up with. You divide people into two groups: those who see the difference and those who don't. You keep ignoring a third group—those who see the difference but don't consider it important because they know how to deal with it. (There may be a fourth group, for sake of completeness: those who see a difference but simply don't care.) Of course there are differences; they are easy enough to see. The question is, how to assess those differences? You believe they are substantial; I believe they are not. I have even backed up my claim with pictures ... but your reaction to this was exactly what you're expecting from others: blunt refusal to accept a proof. By the way: the first crop was from the M (Typ 240); the second from the M9. And I don't mean to slag CCD technology. In fact, my digital cameras with CCD sensors outnumber those with CMOS sensors, and I don't plan to get rid of any of them anytime soon. I just want to debunk the misconception that CCD sensors have anything to them that cannot be had with CMOS sensors also. Finally, I didn't leave a comment against your open-letter campaign on your own web-site because that's what I'd consider unfriendly and disrespectful. But if you come over here to the LUF and open a thread about your request then you have to deal with some discussion and contradicting viewpoints, and I expect you to handle that without getting snotty.", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/5/?tab=comments#comment-2755324", "origin": "L-forum", "suborigin": "240288-400-leica-photographers-agree-we-love-ccd", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "... i'll respond to you because i believe you are genuinely asking and not trying to be clever. [...] as for the rest, they've decided to enter the luf leica m9/m-e/m monochrom sub-forum and create conflict. why? not sure, other than they enjoy the sport of it. so people either agree with you or create conflict!? this level of negativity surprises me—i wouldn't have expected this from you. i, for one, would genuinely like to know if you see something that i cannot see. so far, you have always refused to back up your claims with some substance; instead, you are always backing out with platitudes. hence, my impression so far is, no substance from you. you don't see anything i don't. in truth, the differences are obvious to me and it amazes me that many people can't see the difference. many others can, of course. for those that cannot see a difference, i don't think i'll change their minds -----> with !!!  any demonstration i -----> come !!!  -----> up !!!  -----> with !!! . you divide people into two groups: those who see the difference and those who don't. you keep ignoring a third group—those who see the difference but don't consider it important because they know how to deal with it. (there may be a fourth group, for sake of completeness: those who see a difference but simply don't care.) of course there are differences; they are easy enough to see. the question is, how to assess those differences? you believe they are substantial; i believe they are not. i have even backed up my claim with pictures ... but your reaction to this was exactly what you're expecting from others: blunt refusal to accept a proof. by the way: the first crop was from the m (typ 240); the second from the m9. and i don't mean to slag ccd technology. in fact, my digital cameras with ccd sensors outnumber those with cmos sensors, and i don't plan to get rid of any of them anytime soon. i just want to debunk the misconception that ccd sensors have anything to them that cannot be had with cmos sensors also. finally, i didn't leave a comment against your open-letter campaign on your own web-site because that's what i'd consider unfriendly and disrespectful. but if you come over here to the luf and open a thread about your request then you have to deal with some discussion and contradicting viewpoints, and i expect you to handle that without getting snotty.", "sortedWord": "None", "Identifyer": null, "identifyer": 39379, "year": "2015"}, {"autor": "BerndReini", "date": "2015-01-29 23:28:00", "content": "I heard from someone at Leica that they tried to get the color signature of the M240 as close as possible to that of the M9, and I agree that since both shoot DNG, and Leica ships their cameras with Lightroom, they should be the ones to be able to get them as close as possible, not the user in post-processing. So unless I was misinformed and Leica did not intend to match the M240 to the M9, then we can assume that what we have with the current firmware us the closest match that Leica can come up with. Whether one is better or worse is a different question, but I have not read a single opinion of someone who bought the M240 as their first digital Leica because they did not like the colors and \"look\" of the M9 files at base ISO.", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/6/?tab=comments#comment-2755571", "origin": "L-forum", "suborigin": "240288-400-leica-photographers-agree-we-love-ccd", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i heard from someone at leica that they tried to get the color signature of the m240 as close as possible to that of the m9, and i agree that since both shoot dng, and leica ships their cameras with lightroom, they should be the ones to be able to get them as close as possible, not the user in post-processing. so unless i was misinformed and leica did not intend to match the m240 to the m9, then we can assume that what we have -----> with !!!  the current firmware us the closest match that leica can -----> come !!!  -----> up !!!  -----> with !!! . whether one is better or worse is a different question, but i have not read a single opinion of someone who bought the m240 as their first digital leica because they did not like the colors and \"look\" of the m9 files at base iso.", "sortedWord": "None", "Identifyer": null, "identifyer": 39387, "year": "2015"}, {"autor": "Winedemonium", "date": "2015-02-06 07:50:00", "content": "I've not waded through all 11 pages of this, so my apology if I am repeating someone else's point here - I imagine - though lack the technology knowledge to assert - that taking the CMOS sensor out of an M240 and putting a CCD sensor in its place might be quite expensive to do. The M240 was built with the CMOS sensor it uses from the ground up. I imagine too that Leica are not going to abandon CMOS for the next generation M camera. Given the pattern Leica have established across the S, M, and X cameras, the next generation will be an M typ 2xx with CMOS upgrade and some other new features, a new M Monochrom based on the M240 (i.e. a CMOS Monochrom), and an M-E-240 based on the current M240, but with something removed, and the top plate in grey. Give or take. The conundrum then is this, as I see it: Leica do make certain limited edition issues in very small quantities. Usually the changes are cosmetic, so don't incur the sort of preproduction R&D we are talking about here. So, a new CCD Leica M would require the development of a CCD sensor to fit the new body and hardware of the M240 (or newer still), sharing other innards with a more mainstream CMOS camera. The R&D might not be satisfied by resulting sales. On the other hand, Leica have an ongoing problem taking care of M8/.2, M9/M-E and M Monochrom users, and for that alone need to come up with a stable solution for those cameras. I would guess therefore, that if Leica come up with an updated CCD sensor for the M9 body, it is more likely that they would issue an updated M-E mkII based on the M9 than come up with an new M240-like CCD camera. That said, Leica have been known to surprise. And what Peter's petition has shown is that there is a customer base out there (no doubt larger than the actual number who have signed), and if you don't ask you don't get. I signed. I wish Peter well with his petition. Much like the Monochrom was referred to as the \"Henri\" after HCB, I think if Leica issue a new CCD M it should be called the \"Peter\". It will be, at least by me!, and I will buy one if Leica make it. Edited February 6, 2015 by Winedemonium", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/11/?tab=comments#comment-2760160", "origin": "L-forum", "suborigin": "240288-400-leica-photographers-agree-we-love-ccd", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i've not waded through all 11 pages of this, so my apology if i am repeating someone else's point here - i imagine - though lack the technology knowledge to assert - that taking the cmos sensor out of an m240 and putting a ccd sensor in its place might be quite expensive to do. the m240 was built with the cmos sensor it uses from the ground up. i imagine too that leica are not going to abandon cmos for the next generation m camera. given the pattern leica have established across the s, m, and x cameras, the next generation will be an m typ 2xx with cmos upgrade and some other new features, a new m monochrom based on the m240 (i.e. a cmos monochrom), and an m-e-240 based on the current m240, but with something removed, and the top plate in grey. give or take. the conundrum then is this, as i see it: leica do make certain limited edition issues in very small quantities. usually the changes are cosmetic, so don't incur the sort of preproduction r&d we are talking about here. so, a new ccd leica m would require the development of a ccd sensor to fit the new body and hardware of the m240 (or newer still), sharing other innards with a more mainstream cmos camera. the r&d might not be satisfied by resulting sales. on the other hand, leica have an ongoing problem taking care of m8/.2, m9/m-e and m monochrom users, and for that alone need to -----> come !!!  -----> up !!!  -----> with !!!  a stable solution for those cameras. i would guess therefore, that if leica come up with an updated ccd sensor for the m9 body, it is more likely that they would issue an updated m-e mkii based on the m9 than come up with an new m240-like ccd camera. that said, leica have been known to surprise. and what peter's petition has shown is that there is a customer base out there (no doubt larger than the actual number who have signed), and if you don't ask you don't get. i signed. i wish peter well with his petition. much like the monochrom was referred to as the \"henri\" after hcb, i think if leica issue a new ccd m it should be called the \"peter\". it will be, at least by me!, and i will buy one if leica make it. edited february 6, 2015 by winedemonium", "sortedWord": "None", "Identifyer": null, "identifyer": 39497, "year": "2015"}, {"autor": "Prosophos", "date": "2015-02-06 11:24:00", "content": "I've not waded through all 11 pages of this, so my apology if I am repeating someone else's point here - I imagine - though lack the technology knowledge to assert - that taking the CMOS sensor out of an M240 and putting a CCD sensor in its place might be quite expensive to do. The M240 was built with the CMOS sensor it uses from the ground up. I imagine too that Leica are not going to abandon CMOS for the next generation M camera. Given the pattern Leica have established across the S, M, and X cameras, the next generation will be an M typ 2xx with CMOS upgrade and some other new features, a new M Monochrom based on the M240 (i.e. a CMOS Monochrom), and an M-E-240 based on the current M240, but with something removed, and the top plate in grey. Give or take. The conundrum then is this, as I see it: Leica do make certain limited edition issues in very small quantities. Usually the changes are cosmetic, so don't incur the sort of preproduction R&D we are talking about here. So, a new CCD Leica M would require the development of a CCD sensor to fit the new body and hardware of the M240 (or newer still), sharing other innards with a more mainstream CMOS camera. The R&D might not be satisfied by resulting sales. On the other hand, Leica have an ongoing problem taking care of M8/.2, M9/M-E and M Monochrom users, and for that alone need to come up with a stable solution for those cameras. I would guess therefore, that if Leica come up with an updated CCD sensor for the M9 body, it is more likely that they would issue an updated M-E mkII based on the M9 than come up with an new M240-like CCD camera. That said, Leica have been known to surprise. And what Peter's petition has shown is that there is a customer base out there (no doubt larger than the actual number who have signed), and if you don't ask you don't get. I signed. I wish Peter well with his petition. Much like the Monochrom was referred to as the \"Henri\" after HCB, I think if Leica issue a new CCD M it should be called the \"Peter\". It will be, at least by me!, and I will buy one if Leica make it. Thank you! I always knew that it was going to be a long shot, but I decided it was worth trying when I realized that every single CMOS sensor-based camera I evaluated (and I've owned and used all of the headlining ones) was inferior to the M9/M-E at base ISO levels. Leica is in possession of a wonderful sensor that sets them apart from the competition. This is important. It is with great interest therefore that I follow their efforts to fix the corrosion issue. And I would be elated of course if they offered an updated CCD sensor in a future M camera. Thanks again.", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/11/?tab=comments#comment-2760252", "origin": "L-forum", "suborigin": "240288-400-leica-photographers-agree-we-love-ccd", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i've not waded through all 11 pages of this, so my apology if i am repeating someone else's point here - i imagine - though lack the technology knowledge to assert - that taking the cmos sensor out of an m240 and putting a ccd sensor in its place might be quite expensive to do. the m240 was built with the cmos sensor it uses from the ground up. i imagine too that leica are not going to abandon cmos for the next generation m camera. given the pattern leica have established across the s, m, and x cameras, the next generation will be an m typ 2xx with cmos upgrade and some other new features, a new m monochrom based on the m240 (i.e. a cmos monochrom), and an m-e-240 based on the current m240, but with something removed, and the top plate in grey. give or take. the conundrum then is this, as i see it: leica do make certain limited edition issues in very small quantities. usually the changes are cosmetic, so don't incur the sort of preproduction r&d we are talking about here. so, a new ccd leica m would require the development of a ccd sensor to fit the new body and hardware of the m240 (or newer still), sharing other innards with a more mainstream cmos camera. the r&d might not be satisfied by resulting sales. on the other hand, leica have an ongoing problem taking care of m8/.2, m9/m-e and m monochrom users, and for that alone need to -----> come !!!  -----> up !!!  -----> with !!!  a stable solution for those cameras. i would guess therefore, that if leica come up with an updated ccd sensor for the m9 body, it is more likely that they would issue an updated m-e mkii based on the m9 than come up with an new m240-like ccd camera. that said, leica have been known to surprise. and what peter's petition has shown is that there is a customer base out there (no doubt larger than the actual number who have signed), and if you don't ask you don't get. i signed. i wish peter well with his petition. much like the monochrom was referred to as the \"henri\" after hcb, i think if leica issue a new ccd m it should be called the \"peter\". it will be, at least by me!, and i will buy one if leica make it. thank you! i always knew that it was going to be a long shot, but i decided it was worth trying when i realized that every single cmos sensor-based camera i evaluated (and i've owned and used all of the headlining ones) was inferior to the m9/m-e at base iso levels. leica is in possession of a wonderful sensor that sets them apart from the competition. this is important. it is with great interest therefore that i follow their efforts to fix the corrosion issue. and i would be elated of course if they offered an updated ccd sensor in a future m camera. thanks again.", "sortedWord": "None", "Identifyer": null, "identifyer": 39499, "year": "2015"}, {"autor": "jaapv", "date": "2015-02-16 17:04:00", "content": "Not really . Those are by far not the only companies in the world. As everybody knows Leica explored the market and came up with CMOSIS, there are others European companies like Dalsa, etc. Absolutely no need to look over their shoulder. Even Sony has no problem supplying competitors with sensors, like Nikon or Leica. It is clearly an open and competitive market.", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/13/?tab=comments#comment-2765716", "origin": "L-forum", "suborigin": "240288-400-leica-photographers-agree-we-love-ccd", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "not really . those are by far not the only companies in the world. as everybody knows leica explored the market and -----> came !!!  -----> up !!!  -----> with !!!  cmosis, there are others european companies like dalsa, etc. absolutely no need to look over their shoulder. even sony has no problem supplying competitors with sensors, like nikon or leica. it is clearly an open and competitive market.", "sortedWord": "None", "Identifyer": null, "identifyer": 39533, "year": "2015"}, {"autor": "Lenshacker", "date": "2015-03-13 22:10:00", "content": "I've been trying to come up with a way to \"Visualize\" the image loss due to the DNG-8 compression algorithm, and give an idea of the detail that is to be gained by using M8RAW2DNG. I've written a FORTRAN program that reads in the uncompressed DNG file produced by Arvid's M8RAW2DNG code. My algorithm compresses the data values using the DNG-8 compression scheme, then restores the value using the decompression routine. It takes this restored value and subtracts it from the uncompressed/original value. This gives a measure of the Data Lost by the DNG-8 that is preserved in M8RAW2DNG. The loss comes in as the \"Square Root\" function used for the compression scheme is an \"Integer Square Root\", and throws away a lot of precision. The DNG8 is a Chaotic algorithm, the exact outcome depends on how close the original value is a an integer square root. For values that are on a boundary, naturally occurring noise can cause the compressed value to fluctuate. The DNG-8 compression Algorithm greatly magnifies peak-to-peak noise, but reduces overall noise. Hard to predict what it will do to a scene that you are looking at. Hence- Chaos. M8RAW2DNG file, --img-- L1015636 by fiftyonepointsix, on Flickr And the \"latent\" image that is lost to the scheme. --img-- L15636DF by fiftyonepointsix, on Flickr Edited March 13, 2015 by Lenshacker", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/5/?tab=comments#comment-2780182", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i've been trying to -----> come !!!  -----> up !!!  -----> with !!!  a way to \"visualize\" the image loss due to the dng-8 compression algorithm, and give an idea of the detail that is to be gained by using m8raw2dng. i've written a fortran program that reads in the uncompressed dng file produced by arvid's m8raw2dng code. my algorithm compresses the data values using the dng-8 compression scheme, then restores the value using the decompression routine. it takes this restored value and subtracts it from the uncompressed/original value. this gives a measure of the data lost by the dng-8 that is preserved in m8raw2dng. the loss comes in as the \"square root\" function used for the compression scheme is an \"integer square root\", and throws away a lot of precision. the dng8 is a chaotic algorithm, the exact outcome depends on how close the original value is a an integer square root. for values that are on a boundary, naturally occurring noise can cause the compressed value to fluctuate. the dng-8 compression algorithm greatly magnifies peak-to-peak noise, but reduces overall noise. hard to predict what it will do to a scene that you are looking at. hence- chaos. m8raw2dng file, --img-- l1015636 by fiftyonepointsix, on flickr and the \"latent\" image that is lost to the scheme. --img-- l15636df by fiftyonepointsix, on flickr edited march 13, 2015 by lenshacker", "sortedWord": "None", "Identifyer": null, "identifyer": 41603, "year": "2015"}, {"autor": "bla", "date": "2015-01-20 10:05:00", "content": " Dear M8 users, as a true fan of my little camera and an avid reader of M8 related discussions and reviews I have stumbled upon negative comments regarding the high ISO performance numerous times. Mostly they go along the lines of \"don't go above 160/320/640, as it becomes really unusable\", \"looks like my webcam\", \"terrible ISO performance\" etc. I think it is time to dedicate a thread showing those horrible images at higher ISO... --img--  My rules: - I said HIGH ISO, so no images below 1250 (have a look at the flickr M8 mid to high iso group, haha) - noise reduction (luminance should be mentioned, color is OK) - used raw converter should be mentioned - ISO value readily visible would be really useful - motive doesn't have to be mindblowing, as this thread is really about ISO performance To evaluate the ISO values when pushing in post I suggest the following table: ISO | f-stops above ISO160 1250 | 3.0 1800 | 3.5 2500 | 4.0 3500 | 4.5 5000 | 5.0 I know that there will be some noise and some reduction of dynamic range and it might be problematic to print at 3 by 2 miles, but let's see what you come up with. To start with I show some images that were deliberately underexposed and then pushed in LR 5.7, no luminance noise reduction, color noise as necessary, slight sharpening, own color profile. All images were recorded at base ISO 160 with the 14bit RAW mode. PS: My monitors are crappy, ancient and uncalibrated, so have mercy if the colors are wonky --img--  Both don't even show the same colors. I prefer the left one... (Fujitsu Siemens B17-2 x 2) --img-- --img-- --img-- --img-- --img--  Edited January 20, 2015 by bla", "link": "https://www.l-camera-forum.com/topic/240074-m8-hideous-unusable-high-iso-performance-thread/?tab=comments#comment-2750014", "origin": "L-forum", "suborigin": "240074-m8-hideous-unusable-high-iso-performance-thread", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " dear m8 users, as a true fan of my little camera and an avid reader of m8 related discussions and reviews i have stumbled upon negative comments regarding the high iso performance numerous times. mostly they go along the lines of \"don't go above 160/320/640, as it becomes really unusable\", \"looks like my webcam\", \"terrible iso performance\" etc. i think it is time to dedicate a thread showing those horrible images at higher iso... --img--  my rules: - i said high iso, so no images below 1250 (have a look at the flickr m8 mid to high iso group, haha) - noise reduction (luminance should be mentioned, color is ok) - used raw converter should be mentioned - iso value readily visible would be really useful - motive doesn't have to be mindblowing, as this thread is really about iso performance to evaluate the iso values when pushing in post i suggest the following table: iso | f-stops above iso160 1250 | 3.0 1800 | 3.5 2500 | 4.0 3500 | 4.5 5000 | 5.0 i know that there will be some noise and some reduction of dynamic range and it might be problematic to print at 3 by 2 miles, but let's see what you -----> come !!!  -----> up !!!  -----> with !!! . to start with i show some images that were deliberately underexposed and then pushed in lr 5.7, no luminance noise reduction, color noise as necessary, slight sharpening, own color profile. all images were recorded at base iso 160 with the 14bit raw mode. ps: my monitors are crappy, ancient and uncalibrated, so have mercy if the colors are wonky --img--  both don't even show the same colors. i prefer the left one... (fujitsu siemens b17-2 x 2) --img-- --img-- --img-- --img-- --img--  edited january 20, 2015 by bla", "sortedWord": "None", "Identifyer": null, "identifyer": 46298, "year": "2015"}, {"autor": "bla", "date": "2015-01-22 22:04:00", "content": "I had a go at the 7th image from the last series... the one with -6EV exposure. That is ISO 10000 equivalent, so don't expect wonders... In the dark areas there are some banding artefacts, so I tried a debanding idea that I recently came up with. The method does not change the luminance noise pattern. For the last step I tried to do some luminance noise reduction, but I feel I'm not quite getting the hang of it yet. ^^ - Arvid --img-- --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/240074-m8-hideous-unusable-high-iso-performance-thread/?tab=comments#comment-2751476", "origin": "L-forum", "suborigin": "240074-m8-hideous-unusable-high-iso-performance-thread", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i had a go at the 7th image from the last series... the one with -6ev exposure. that is iso 10000 equivalent, so don't expect wonders... in the dark areas there are some banding artefacts, so i tried a debanding idea that i recently -----> came !!!  -----> up !!!  -----> with !!! . the method does not change the luminance noise pattern. for the last step i tried to do some luminance noise reduction, but i feel i'm not quite getting the hang of it yet. ^^ - arvid --img-- --img-- --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 46317, "year": "2015"}, {"autor": "Heilbron", "date": "2015-03-15 15:14:00", "content": "Hi Leicameter Users, I recently purchased a Leicameter 4 on eBay for my M3. It's in great condition -- except for one issue that makes it extremely difficult to use. The top disk on the meter -- the one that allows you to select the correct film speed -- is very loose. This means that it does not stay fixed at the correct film speed. So invariably it shifts and then the exposure is completely inaccurate. I have no idea how to make it \"tight\" again so that once a film speed is selected it doesn't wobble about. I'm also not particularly mechanically inclined. I've canvassed various forums to see if someone has come up with a solution, but have failed to find one. I love the design of the meter and the fact that it couples so elegantly with the M3. If anyone has any suggestions on how to tighten the disk, I would very much appreciate hearing from them. Thanks in advance for any advice!", "link": "https://www.l-camera-forum.com/topic/182350-mr-or-mr-4-meter/?tab=comments#comment-2781135", "origin": "L-forum", "suborigin": "182350-mr-or-mr-4-meter", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "hi leicameter users, i recently purchased a leicameter 4 on ebay for my m3. it's in great condition -- except for one issue that makes it extremely difficult to use. the top disk on the meter -- the one that allows you to select the correct film speed -- is very loose. this means that it does not stay fixed at the correct film speed. so invariably it shifts and then the exposure is completely inaccurate. i have no idea how to make it \"tight\" again so that once a film speed is selected it doesn't wobble about. i'm also not particularly mechanically inclined. i've canvassed various forums to see if someone has -----> come !!!  -----> up !!!  -----> with !!!  a solution, but have failed to find one. i love the design of the meter and the fact that it couples so elegantly with the m3. if anyone has any suggestions on how to tighten the disk, i would very much appreciate hearing from them. thanks in advance for any advice!", "sortedWord": "None", "Identifyer": null, "identifyer": 3170, "year": "2015"}, {"autor": "Simon Bee", "date": "2015-11-23 22:20:00", "content": "http://us.leica-camera.com/Photography/Leica-M/Technical-Equipment/Filters/Leica-Filter New Leica filters!! Is this the solution we've been all waiting for? Bram The link does not appear to be working, more importantly though ... I hope Leica have at last come up with a suitable solution and are not going to charge those who have purchased the lens a fortune for it . Kind regards, Simon Edited November 23, 2015 by Simon Bee", "link": "https://www.l-camera-forum.com/topic/245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688/page/4/?tab=comments#comment-2935659", "origin": "L-forum", "suborigin": "245904-hood-fitting-problem-with-50mm-sx-black-chrome-11688", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "http://us.leica-camera.com/photography/leica-m/technical-equipment/filters/leica-filter new leica filters!! is this the solution we've been all waiting for? bram the link does not appear to be working, more importantly though ... i hope leica have at last -----> come !!!  -----> up !!!  -----> with !!!  a suitable solution and are not going to charge those who have purchased the lens a fortune for it . kind regards, simon edited november 23, 2015 by simon bee", "sortedWord": "None", "Identifyer": null, "identifyer": 19340, "year": "2015"}, {"autor": "bencoyote", "date": "2015-12-23 03:04:00", "content": "I wish Leica or Zeiss would make a new macro lens for the M series, now that the Live View and EVFs are available to supplement RF focus, which presumably will cary forward into future generations of the Leica M, with improvements. I'd think a 75mm or 90mm, perhaps f/2.8 or f/2 at max aperture, that focuses to at least 1:2 repro ratio would be good, one that is coupled to the rangefinder down to 0.7 meter, then relies on focus peaking at closer distances. It could have a slight detent or bump in the RF cam of the lens at 0.7m to let you know to switch viewfinders. The current Macro-Elmar 90mm/4 does not appeal to me, but a lens which would be designed for the current ergonomic state of art of the Leica M system would make sense to me. I like macro, I have the macro adapter and even with LV and focus peaking, it is damn hard to get decent macro shots with either the 50 or the 90AA. Despite my best hopes and a lot of effort the M is probably not the right camera for macro. The depth of field is just too thin. You can't hand hold it easily. LV burns your battery and even with a tripod physical objects move due to wind or their own volition. The best camera for macro that I've tried is the Olympus OM-D E-M1 with the 60mm macro lens. The small sensor with its larger DOF, good continious AF, in body stabilization and now focus stacking all just make it work really well for macro. I really hope the 60mm Macro-Elmar-TL has OIS and is really good and what I really want is probably a 90 or 120mm Macro-Elmar-SL lens. Then my big trip travel setup will be the M body, 28 cron, 50 lux, 90 cron. My backup body will be a SL with a whatever macro lens Leica comes up with, the 90-280, and the M-adapter-T. The M for most things but the SL for the things the M is not good at.", "link": "https://www.l-camera-forum.com/topic/247194-which-m-lenses-do-you-want-to-own/page/9/?tab=comments#comment-2954316", "origin": "L-forum", "suborigin": "247194-which-m-lenses-do-you-want-to-own", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "i wish leica or zeiss would make a new macro lens for the m series, now that the live view and evfs are available to supplement rf focus, which presumably will cary forward into future generations of the leica m, with improvements. i'd think a 75mm or 90mm, perhaps f/2.8 or f/2 at max aperture, that focuses to at least 1:2 repro ratio would be good, one that is coupled to the rangefinder down to 0.7 meter, then relies on focus peaking at closer distances. it could have a slight detent or bump in the rf cam of the lens at 0.7m to let you know to switch viewfinders. the current macro-elmar 90mm/4 does not appeal to me, but a lens which would be designed for the current ergonomic state of art of the leica m system would make sense to me. i like macro, i have the macro adapter and even with lv and focus peaking, it is damn hard to get decent macro shots with either the 50 or the 90aa. despite my best hopes and a lot of effort the m is probably not the right camera for macro. the depth of field is just too thin. you can't hand hold it easily. lv burns your battery and even with a tripod physical objects move due to wind or their own volition. the best camera for macro that i've tried is the olympus om-d e-m1 with the 60mm macro lens. the small sensor with its larger dof, good continious af, in body stabilization and now focus stacking all just make it work really well for macro. i really hope the 60mm macro-elmar-tl has ois and is really good and what i really want is probably a 90 or 120mm macro-elmar-sl lens. then my big trip travel setup will be the m body, 28 cron, 50 lux, 90 cron. my backup body will be a sl -----> with !!!  a whatever macro lens leica -----> comes !!!  -----> up !!!  -----> with !!! , the 90-280, and the m-adapter-t. the m for most things but the sl for the things the m is not good at.", "sortedWord": "None", "Identifyer": null, "identifyer": 20064, "year": "2015"}, {"autor": "2wk", "date": "2015-03-01 19:34:00", "content": " I know we got one update, for which I am grateful. There are a few things that are still on my wish list that could be simple additions. #1 please Please Please please Please.......An option to leave the self timer On! Probably not on everyone's list, but I was shooting hundreds of still life's the other day and having to turn on the self timer every single time is crazy. This could easily be altered in the menu. - SELT TIMER OFF - Self timer On 12s - Self timer On 2s - On for one shot 12s - On for one shot 2s I'm sure Leica could even come up with a better way of implementing it. #2 During a long exposure, I would really appreciate a countdown timer. The back LCD is on and there is plenty of real estate to include a timer of the current exposure. #3 Allowing the movie button to be configured as a custom button. I would love to assign this to the Film Mode, or even AF light on/off, metering mode etc. #4 I still don't understand why I can't shoot in only Raw mode. That's is. Short list from me. I do love this camera --img-- ", "link": "https://www.l-camera-forum.com/topic/241740-x-vario-firmware-update-recommendations/?tab=comments#comment-2772852", "origin": "L-forum", "suborigin": "241740-x-vario-firmware-update-recommendations", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " i know we got one update, for which i am grateful. there are a few things that are still on my wish list that could be simple additions. #1 please please please please please.......an option to leave the self timer on! probably not on everyone's list, but i was shooting hundreds of still life's the other day and having to turn on the self timer every single time is crazy. this could easily be altered in the menu. - selt timer off - self timer on 12s - self timer on 2s - on for one shot 12s - on for one shot 2s i'm sure leica could even -----> come !!!  -----> up !!!  -----> with !!!  a better way of implementing it. #2 during a long exposure, i would really appreciate a countdown timer. the back lcd is on and there is plenty of real estate to include a timer of the current exposure. #3 allowing the movie button to be configured as a custom button. i would love to assign this to the film mode, or even af light on/off, metering mode etc. #4 i still don't understand why i can't shoot in only raw mode. that's is. short list from me. i do love this camera --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 13780, "year": "2015"}, {"autor": "rivi1969", "date": "2015-01-30 20:48:00", "content": "I´m NOT trying to discourage people from buying X. I LOVE Leica; I´ve been shooting with almost all Leica digicams for the last few years! My \"reflections\" are purely subjective, can only compare IQ of \"my pics\" on \"my screen\". Maybe the silver X I´ve tried was a lemon - highly unlikely - it´s rather my too high expectations! Many users will surely be thrilled and I´ll be crucified:). On my X \"sharpness\" became acceptable from f/4, quite good-very good on f/5.6 and f/8, not improving on f/11 (dof vs diffraction). AWB is not very best/accurate (as mentioned) still, the camera renders very nice images but the \"spark\" from XVario images was missing! If only Leica could come up with a Visoflex for XVario! As someone said - XVario is a M-class camera with some very high quality M-class lenses in ONE body! Perhaps not for \"bookeh/speed\" enthusiasts.. but for \"the rest\":p. My X 113 delivers more than enough IQ wide open... \"Acceptable at f4\"? LOL --img-- ", "link": "https://www.l-camera-forum.com/topic/234960-rolling-review-on-leica-x-typ-113/page/2/?tab=comments#comment-2756126", "origin": "L-forum", "suborigin": "234960-rolling-review-on-leica-x-typ-113", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i´m not trying to discourage people from buying x. i love leica; i´ve been shooting with almost all leica digicams for the last few years! my \"reflections\" are purely subjective, can only compare iq of \"my pics\" on \"my screen\". maybe the silver x i´ve tried was a lemon - highly unlikely - it´s rather my too high expectations! many users will surely be thrilled and i´ll be crucified:). on my x \"sharpness\" became acceptable from f/4, quite good-very good on f/5.6 and f/8, not improving on f/11 (dof vs diffraction). awb is not very best/accurate (as mentioned) still, the camera renders very nice images but the \"spark\" from xvario images was missing! if only leica could -----> come !!!  -----> up !!!  -----> with !!!  a visoflex for xvario! as someone said - xvario is a m-class camera with some very high quality m-class lenses in one body! perhaps not for \"bookeh/speed\" enthusiasts.. but for \"the rest\":p. my x 113 delivers more than enough iq wide open... \"acceptable at f4\"? lol --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 14009, "year": "2015"}, {"autor": "AlanG", "date": "2015-02-24 23:23:00", "content": "If people buy Sony A7 varients to deal with SLR lenses why wont they buy a cost effective M equivalent for RF wide lenses? Some probably will. I just don't know if they can make a decent camera and sell it at a low enough price. As for the Sony, consider how much R&D must have gone into that and Sony already had most of the technology, software, and development system in place. If Konost can subcontract to a Chinese camera company for much of this, it might work... I can't say. But there are so many \"ifs\" that we all can come up with I see it as a very \"iffy\" venture...Too many \"what ifs\" for me to even try to list. If they have their engineering, testing, manufacturing, and marketing worked out along with a good business plan and financing, then my hat is off to them. Looking at the photos, I have to wonder why the neck strap lugs are vertical. Lenses are going to block some of the viewfinder pretty easily. I can't judge much else. Edited February 25, 2015 by AlanG", "link": "https://www.l-camera-forum.com/topic/241491-konost-merged/page/3/?tab=comments#comment-2770281", "origin": "L-forum", "suborigin": "241491-konost-merged", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "if people buy sony a7 varients to deal with slr lenses why wont they buy a cost effective m equivalent for rf wide lenses? some probably will. i just don't know if they can make a decent camera and sell it at a low enough price. as for the sony, consider how much r&d must have gone into that and sony already had most of the technology, software, and development system in place. if konost can subcontract to a chinese camera company for much of this, it might work... i can't say. but there are so many \"ifs\" that we all can -----> come !!!  -----> up !!!  -----> with !!!  i see it as a very \"iffy\" venture...too many \"what ifs\" for me to even try to list. if they have their engineering, testing, manufacturing, and marketing worked out along with a good business plan and financing, then my hat is off to them. looking at the photos, i have to wonder why the neck strap lugs are vertical. lenses are going to block some of the viewfinder pretty easily. i can't judge much else. edited february 25, 2015 by alang", "sortedWord": "None", "Identifyer": null, "identifyer": 93411, "year": "2015"}, {"autor": "250swb", "date": "2015-07-25 07:22:00", "content": "Actually the 997 was superceded by the 991. No such thing as a 998. As with Googling 'Leica M' a perfect example of the sort of clarity we can look forward to with Leica Typ numbers, I only came up with 998 because it appeared in a Google search. Steve", "link": "https://www.l-camera-forum.com/topic/247411-the-various-leica-typ-designations/page/2/?tab=comments#comment-2860126", "origin": "L-forum", "suborigin": "247411-the-various-leica-typ-designations", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "actually the 997 was superceded by the 991. no such thing as a 998. as -----> with !!!  googling 'leica m' a perfect example of the sort of clarity we can look forward to -----> with !!!  leica typ numbers, i only -----> came !!!  -----> up !!!  -----> with !!!  998 because it appeared in a google search. steve", "sortedWord": "None", "Identifyer": null, "identifyer": 93720, "year": "2015"}, {"autor": "Ozytripper", "date": "2015-11-04 08:06:00", "content": " Hi Everyone, I am from Melbourne Australia. Good to find this forum and hope to learn more from other members and to perhaps share some of my opinions as we. I have been using the Leica R system for nearly 30 years (1978 to about 2004), built up a good collection of lenses (from 35mm to 280 f2.8 modular lens. a couple of zooms as well) I had every model from the R3Mot to the R7 but finally decided let go of the system because my eyesight was getting worse (required auto focus) and the Leica R8 and R9 were just ridiculously large . I have since moved onto Canon (started with the 300D and kept upgrading till the 5D3) and then moved to Fujifilm when they launched the XE1. Currently on my 3rd XT1 (lost one, gave one away and finally bought a silver edition). I think Fuji has got it right in most aspects. I now have most of the new fuji lenses and find them to be very close to the Leica quality and feel. I still loved the Leica lenses and have been waiting patiently since I dropped the system; for Leica to come up with a proper autofocus camera but alas I have been disappointed to date. I am still hopeful and is still waiting. (I don't consider the SL or the Q to be the answer to my needs).", "link": "https://www.l-camera-forum.com/topic/252572-new-to-leica-and-leica-forum/?tab=comments#comment-2920559", "origin": "L-forum", "suborigin": "252572-new-to-leica-and-leica-forum", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " hi everyone, i am from melbourne australia. good to find this forum and hope to learn more from other members and to perhaps share some of my opinions as we. i have been using the leica r system for nearly 30 years (1978 to about 2004), built up a good collection of lenses (from 35mm to 280 f2.8 modular lens. a couple of zooms as well) i had every model from the r3mot to the r7 but finally decided let go of the system because my eyesight was getting worse (required auto focus) and the leica r8 and r9 were just ridiculously large . i have since moved onto canon (started with the 300d and kept upgrading till the 5d3) and then moved to fujifilm when they launched the xe1. currently on my 3rd xt1 (lost one, gave one away and finally bought a silver edition). i think fuji has got it right in most aspects. i now have most of the new fuji lenses and find them to be very close to the leica quality and feel. i still loved the leica lenses and have been waiting patiently since i dropped the system; for leica to -----> come !!!  -----> up !!!  -----> with !!!  a proper autofocus camera but alas i have been disappointed to date. i am still hopeful and is still waiting. (i don't consider the sl or the q to be the answer to my needs).", "sortedWord": "None", "Identifyer": null, "identifyer": 114869, "year": "2015"}, {"autor": "rickp13", "date": "2015-11-11 04:08:00", "content": "hi all if the group can come up with a good hotel suggestion, as in this thread, then we'd certainly try to stay there, simply to have a larger base of contact with the rest of the world travelers over the 3 days. --img--  cheers rick & karen", "link": "https://www.l-camera-forum.com/topic/251816-response-needed-lisbon-2016/page/2/?tab=comments#comment-2925750", "origin": "L-forum", "suborigin": "251816-response-needed-lisbon-2016", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "hi all if the group can -----> come !!!  -----> up !!!  -----> with !!!  a good hotel suggestion, as in this thread, then we'd certainly try to stay there, simply to have a larger base of contact -----> with !!!  the rest of the world travelers over the 3 days. --img--  cheers rick & karen", "sortedWord": "None", "Identifyer": null, "identifyer": 132935, "year": "2015"}, {"autor": "Dan Bachmann", "date": "2015-03-28 20:31:00", "content": "+2 Ritsuko and I booked Shinjuku Granbell 17-20 May. Can also cancel if necessary. Now we have mass and momentum! Any thoughts on the Kyoto Hotel? Once we have an area we are happy with, we'll come up with the official Leica One Challenge Asia document for the meeting points but most of us will already have planned together, but I'd like to see it translated into Japanese to be shared - it has been hard to find the Japanese Leica Forum members. It may also help Christoph get there in the last minute!", "link": "https://www.l-camera-forum.com/topic/222897-asia-one-challenge-2015/page/5/?tab=comments#comment-2788731", "origin": "L-forum", "suborigin": "222897-asia-one-challenge-2015", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "+2 ritsuko and i booked shinjuku granbell 17-20 may. can also cancel if necessary. now we have mass and momentum! any thoughts on the kyoto hotel? once we have an area we are happy -----> with !!! , we'll -----> come !!!  -----> up !!!  -----> with !!!  the official leica one challenge asia document for the meeting points but most of us will already have planned together, but i'd like to see it translated into japanese to be shared - it has been hard to find the japanese leica forum members. it may also help christoph get there in the last minute!", "sortedWord": "None", "Identifyer": null, "identifyer": 134041, "year": "2015"}, {"autor": "DigitalHeMan", "date": "2015-03-28 22:56:00", "content": "I've been looking this evening in Kyoto, and it's proving tricky. A lot of hotels where there are only one or two rooms left in the hotel. Will have another look tomorrow and finalise somewhere at least - that way I can always cancel later if necessary, and have a safeguard in case I can't find anything better. The last time I was there I stayed fairly close to Kyoto Station. Was fairly well situated to reach most of the sights. +2 Ritsuko and I booked Shinjuku Granbell 17-20 May. Can also cancel if necessary. Now we have mass and momentum! Any thoughts on the Kyoto Hotel? Once we have an area we are happy with, we'll come up with the official Leica One Challenge Asia document for the meeting points but most of us will already have planned together, but I'd like to see it translated into Japanese to be shared - it has been hard to find the Japanese Leica Forum members. It may also help Christoph get there in the last minute!", "link": "https://www.l-camera-forum.com/topic/222897-asia-one-challenge-2015/page/5/?tab=comments#comment-2788782", "origin": "L-forum", "suborigin": "222897-asia-one-challenge-2015", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i've been looking this evening in kyoto, and it's proving tricky. a lot of hotels where there are only one or two rooms left in the hotel. will have another look tomorrow and finalise somewhere at least - that way i can always cancel later if necessary, and have a safeguard in case i can't find anything better. the last time i was there i stayed fairly close to kyoto station. was fairly well situated to reach most of the sights. +2 ritsuko and i booked shinjuku granbell 17-20 may. can also cancel if necessary. now we have mass and momentum! any thoughts on the kyoto hotel? once we have an area we are happy -----> with !!! , we'll -----> come !!!  -----> up !!!  -----> with !!!  the official leica one challenge asia document for the meeting points but most of us will already have planned together, but i'd like to see it translated into japanese to be shared - it has been hard to find the japanese leica forum members. it may also help christoph get there in the last minute!", "sortedWord": "None", "Identifyer": null, "identifyer": 134042, "year": "2015"}, {"autor": "DigitalHeMan", "date": "2015-03-29 08:14:00", "content": "I have booked a room on hotels.com at \"Sakura Terrace The Gallery\" It's on the South side of the station. Not much information to find about it, other than it is a brand new hotel that only opened this month. I can cancel it until May 17th in case we come up with a better alternative, but Kyoto does seem to be busy around this week.", "link": "https://www.l-camera-forum.com/topic/222897-asia-one-challenge-2015/page/5/?tab=comments#comment-2788897", "origin": "L-forum", "suborigin": "222897-asia-one-challenge-2015", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i have booked a room on hotels.com at \"sakura terrace the gallery\" it's on the south side of the station. not much information to find about it, other than it is a brand new hotel that only opened this month. i can cancel it until may 17th in case we -----> come !!!  -----> up !!!  -----> with !!!  a better alternative, but kyoto does seem to be busy around this week.", "sortedWord": "None", "Identifyer": null, "identifyer": 134044, "year": "2015"}, {"autor": "DigitalHeMan", "date": "2015-04-29 20:11:00", "content": "So we're getting closer to our trips..... the list below reflects members that have confirmed to be in Japan with us at some point. In order to set some times and locations for meeting up, it would be helpful if you could each post the earliest 'convenient' time you would like to meet on the 17th and/or 18th. Based upon this information we'll come up with a suggestion for an initial meeting point so that we can discuss our individual or joint plans for the week. DigitalHeMan - May 14th DanBachmann +1 - May 17thStS - May 17therl +1 - May 18thchristoph_d +1 - May 23rd, joining in KyotoTorgian - Japan based, joining in KyotoSatijntje - May 18thfjheimann - May 18thocto +1 - May 16th babybinjp - Local, joining in Tokyo", "link": "https://www.l-camera-forum.com/topic/222897-asia-one-challenge-2015/page/7/?tab=comments#comment-2806910", "origin": "L-forum", "suborigin": "222897-asia-one-challenge-2015", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "so we're getting closer to our trips..... the list below reflects members that have confirmed to be in japan with us at some point. in order to set some times and locations for meeting up, it would be helpful if you could each post the earliest 'convenient' time you would like to meet on the 17th and/or 18th. based upon this information we'll -----> come !!!  -----> up !!!  -----> with !!!  a suggestion for an initial meeting point so that we can discuss our individual or joint plans for the week. digitalheman - may 14th danbachmann +1 - may 17thsts - may 17therl +1 - may 18thchristoph_d +1 - may 23rd, joining in kyototorgian - japan based, joining in kyotosatijntje - may 18thfjheimann - may 18thocto +1 - may 16th babybinjp - local, joining in tokyo", "sortedWord": "None", "Identifyer": null, "identifyer": 134083, "year": "2015"}, {"autor": "octo", "date": "2015-05-05 08:26:00", "content": "So we're getting closer to our trips..... the list below reflects members that have confirmed to be in Japan with us at some point. In order to set some times and locations for meeting up, it would be helpful if you could each post the earliest 'convenient' time you would like to meet on the 17th and/or 18th. Based upon this information we'll come up with a suggestion for an initial meeting point so that we can discuss our individual or joint plans for the week. DigitalHeMan - May 14th DanBachmann +1 - May 17th StS - May 17th erl +1 - May 18th christoph_d +1 - May 23rd, joining in Kyoto Torgian - Japan based, joining in Kyoto Satijntje - May 18th fjheimann - May 18th octo +1 - May 16th babybinjp - Local, joining in Tokyo We are landing in NRT, guess it stands for Narita, at 18:30 on the 16th. It seems that the majority arrive on the 18th. Quite a few are staying in the Granbell where it would be useful to post the time, name & address of the meeting place ( and any other information): if John claims he is sometimes technically challenged, then I am technically impaired. My cell phone is just that: a phone and the nearest I have to a modern implement is an IPod (version 4.2.1). We'll have to depend on the technically proficient if we need to communicate faster than a chat around a beer. See you soon!", "link": "https://www.l-camera-forum.com/topic/222897-asia-one-challenge-2015/page/8/?tab=comments#comment-2810635", "origin": "L-forum", "suborigin": "222897-asia-one-challenge-2015", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "so we're getting closer to our trips..... the list below reflects members that have confirmed to be in japan with us at some point. in order to set some times and locations for meeting up, it would be helpful if you could each post the earliest 'convenient' time you would like to meet on the 17th and/or 18th. based upon this information we'll -----> come !!!  -----> up !!!  -----> with !!!  a suggestion for an initial meeting point so that we can discuss our individual or joint plans for the week. digitalheman - may 14th danbachmann +1 - may 17th sts - may 17th erl +1 - may 18th christoph_d +1 - may 23rd, joining in kyoto torgian - japan based, joining in kyoto satijntje - may 18th fjheimann - may 18th octo +1 - may 16th babybinjp - local, joining in tokyo we are landing in nrt, guess it stands for narita, at 18:30 on the 16th. it seems that the majority arrive on the 18th. quite a few are staying in the granbell where it would be useful to post the time, name & address of the meeting place ( and any other information): if john claims he is sometimes technically challenged, then i am technically impaired. my cell phone is just that: a phone and the nearest i have to a modern implement is an ipod (version 4.2.1). we'll have to depend on the technically proficient if we need to communicate faster than a chat around a beer. see you soon!", "sortedWord": "None", "Identifyer": null, "identifyer": 134107, "year": "2015"}], "name": "Leicasortedout2015with"}