{"interestingcomments": [{"autor": "Jeff S", "date": "2014-05-27 13:56:00", "content": "The following is excerpted from a featured Amazon review of the ONA Union Street bag… \"After only 6 months of use, the stitching at the handle came undone. The last thing I want to do is carry expensive camera equipment and have the bag tip and come falling on the ground, no matter how well padded it is. I contacted customer service and received this response, which I feel grossly inadequate, \"we're very sorry to hear about the stitching on the handle of your bag. If we had known about your concerns on the handle beforehand, we would have informed you that the handle on top of the bag is a grab handle, intended for quick grabs, not for carrying the bag long distances. We've designed the bag with one handle because with the messenger design of the bag, having two handles would obstruct access to the inside of the bag.\" They did not admit the design flaw, but did offer to repair it under warranty. They stitched the handle through the interior of the bag and the stitches are exposed on the interior making the bag less attractive. I'm not happy with that type of craftsmanship from the warranty repair. It solves the problem, however, for now... but I still worry about it occurring again in the future.\" I also wonder if this comment regarding the use of cheaper labor has any relationship to these issues, which I suspect aren't the norm. I needed a bigger bag for travel last year and compared ONA to Billingham and, while the ONA bags looked nice, I found that the Billingham offered better functional details such as the way the top handle was secured as well as rain protection by fully overlapping top flap, flap on rear pocket, etc. Maybe not as cosmetically appealing, but clearly designed for real world use. Others, I'm sure, are happy with their ONA bags. Jeff", "link": "https://www.l-camera-forum.com/topic/227763-be-careful-trusting-the-strap-on-your-ona-berlin-bag/?tab=comments#comment-2598148", "origin": "L-forum", "suborigin": "227763-be-careful-trusting-the-strap-on-your-ona-berlin-bag", "result": true, "Selector": "we've designed", "selectorShort": "design", "MarkedSent": "the following is excerpted from a featured amazon review of the ona union street bag… \"after only 6 months of use, the stitching at the handle came undone. the last thing i want to do is carry expensive camera equipment and have the bag tip and come falling on the ground, no matter how well padded it is. i contacted customer service and received this response, which i feel grossly inadequate, \"we're very sorry to hear about the stitching on the handle of your bag. if we had known about your concerns on the handle beforehand, we would have informed you that the handle on top of the bag is a grab handle, intended for quick grabs, not for carrying the bag long distances. -----> we !!! 've -----> designed !!!  the bag with one handle because with the messenger design of the bag, having two handles would obstruct access to the inside of the bag.\" they did not admit the design flaw, but did offer to repair it under warranty. they stitched the handle through the interior of the bag and the stitches are exposed on the interior making the bag less attractive. i'm not happy with that type of craftsmanship from the warranty repair. it solves the problem, however, for now... but i still worry about it occurring again in the future.\" i also wonder if this comment regarding the use of cheaper labor has any relationship to these issues, which i suspect aren't the norm. i needed a bigger bag for travel last year and compared ona to billingham and, while the ona bags looked nice, i found that the billingham offered better functional details such as the way the top handle was secured as well as rain protection by fully overlapping top flap, flap on rear pocket, etc. maybe not as cosmetically appealing, but clearly designed for real world use. others, i'm sure, are happy with their ona bags. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 84821, "year": "2014"}, {"autor": "bla", "date": "2014-01-28 10:54:00", "content": "Hello, I would definitely like to have one. I never understood why they replaced the shutter cocking mechanism with that noisy motor in the M8. If I was to design such a camera it'd be like that: - RAW only (so no white balance is necessary), they could skip the whole image processing engine and rather provide good color profiles... - ISO wheel on the back like the M6 - shutter cocking manually with the lever (no need for thumbs-up) + discreet - obviously good image sensor and really good battery, so you don't have to change it all the time... It'd need much less power, so the battery would last much longer. People'd be like \"oh, a film camera, how sweet\", there'd be no temptation to check images all the time, the camera could be lighter, thinner and of course more reliable. Still I think it's not going to happen and if it was it'd be really expensive, following the idea of \"the less you get, the more you pay\" --img--  But I don't need more (On the M8 there isn't even a need for ISO, as higher ISOs do not improve the images over pushing base ISO...) Greetings, Arvid", "link": "https://www.l-camera-forum.com/topic/221045-a-digital-m6/?tab=comments#comment-2520201", "origin": "L-forum", "suborigin": "221045-a-digital-m6", "result": true, "Selector": "i was to design", "selectorShort": "design", "MarkedSent": "hello, i would definitely like to have one. i never understood why they replaced the shutter cocking mechanism with that noisy motor in the m8. if -----> i !!!  -----> was !!!  -----> to !!!  -----> design !!!  such a camera it'd be like that: - raw only (so no white balance is necessary), they could skip the whole image processing engine and rather provide good color profiles... - iso wheel on the back like the m6 - shutter cocking manually with the lever (no need for thumbs-up) + discreet - obviously good image sensor and really good battery, so you don't have -----> to !!!  change it all the time... it'd need much less power, so the battery would last much longer. people'd be like \"oh, a film camera, how sweet\", there'd be no temptation to check images all the time, the camera could be lighter, thinner and of course more reliable. still i think it's not going to happen and if it was it'd be really expensive, following the idea of \"the less you get, the more you pay\" --img--  but i don't need more (on the m8 there isn't even a need for iso, as higher isos do not improve the images over pushing base iso...) greetings, arvid", "sortedWord": "None", "Identifyer": null, "identifyer": 96372, "year": "2014"}, {"autor": "Abram", "date": "2014-11-19 18:55:00", "content": "I tracked down a ZM 35mm f/2 for a decent price and I will probably add the 28 and 50 eventually. (My three favorite focal lengths) I also have been shooting with a Mamiya 7II for the past year and I started with the 65mm lens, and only added the 150mm when I felt like I wanted a tighter crop (though the short base-length of the M7II makes it a little difficult to use up close). I can't wait to receive my camera and start shooting my personal work with it, if it interests anyone, my most recent work is on flickr (as I'm rebuilding my website currently to include my Design and Video work) http://www.flickr.com/agphotography", "link": "https://www.l-camera-forum.com/topic/237287-hello-from-california/?tab=comments#comment-2709963", "origin": "L-forum", "suborigin": "237287-hello-from-california", "result": false, "Selector": "my design", "selectorShort": "design", "MarkedSent": "i can't wait to receive my camera and start shooting my personal work with it, if it interests anyone, my most recent work is on flickr (as i'm rebuilding my website currently to include my design and -----> video !!!  work) http://www.flickr.com/agphotography", "sortedWord": "video", "Identifyer": null, "identifyer": 115124, "year": "2014"}], "name": "Leicasortedout2014design"}