{"interestingcomments": [{"autor": "derleicaman", "date": "2021-05-18 13:50:00", "content": "The story of the black dot began with the LHSA Black Paint M6. I felt that the red dot just stood out too much with the black paint. A bit too much bling. I specced the dot be black. Leica agreed with my suggestion. When HP Coen, the CEO of Leica saw my prototype at the PMA show, he said, “Bill, there is something wrong with the camera.” Meaning the black dot. I assured him this was what we planned for the camera. I guess Leica liked the black dot too, as they used it on the M8.2. The story is when Micro Division saw this, they pointed out the theirs was the black Leica dot, camera had the red dot, and made them stop using it. That’s why you haven’t seen an “official” black dot from Leica Camera ever since!", "link": "https://www.l-camera-forum.com/topic/320975-new-camera-arrived-and-i-did-diy-red-to-black-dot-conversion-on-my-m10/page/2/?tab=comments#comment-4203069", "origin": "L-forum", "suborigin": "320975-new-camera-arrived-and-i-did-diy-red-to-black-dot-conversion-on-my-m10", "result": true, "Selector": "my prototype", "selectorShort": "prototype", "MarkedSent": "the story of the black dot began with the lhsa black paint m6. i felt that the red dot just stood out too much with the black paint. a bit too much bling. i specced the dot be black. leica agreed with my suggestion. when hp coen, the ceo of leica saw -----> my !!!  -----> prototype !!!  at the pma show, he said, “bill, there is something wrong with the camera.” meaning the black dot. i assured him this was what we planned for the camera. i guess leica liked the black dot too, as they used it on the m8.2. the story is when micro division saw this, they pointed out the theirs was the black leica dot, camera had the red dot, and made them stop using it. that’s why you haven’t seen an “official” black dot from leica camera ever since!", "sortedWord": "None", "Identifyer": null, "identifyer": 8397, "year": "2021"}, {"autor": "jonoslack", "date": "2021-01-28 13:49:00", "content": " Introduction This is the third lens in Leica's historical lens series where they revisit classics and remake them with modern glass and coatings, but with the original basic design. The two previous lenses are the 28mm Summaron which is a tiny lens, originally released in 1954 with a screw mount. Then came the Leica Thambar M 90mm f2.2, a quirky soft focus portrait lens from the mid 30's. The Leica Noctilux 50mm f1.2 is rather a different beast. Released in 1966 it was the state of the art lens for shooting in low light, it was very expensive, and very difficult to make, estimates of how many were produced vary between 500 and 2,500. But I understand that the actual number was 1,757. As a result of this it has become a photographic legend and a serious collectors item with production lenses selling for well over $20,000 and even lens hoods changing hands for around $4,000! Sadly I do not have an original lens to compare with the new one, but I guess that will be true of most of the people who buy this lovely lens. --img--  --img--  --img--  I've been lucky enough to have a prototype copy of the Noctilux for almost the whole of the lockdown. I've used it on both the SL2 and the M10-R and have very much fallen in love. Of course it has it's vices and would not come out well in a technical comparison between the current f0.95 Noctilux (or the 50 f1.4 Summilux come to that!). Just a glance at the MTF curves shows that pretty clearly. But this lens is an important part of Leica's history and it's great that Leica should re-make it so that us lesser mortals can have a go with it! For more sample images you can read the article here: https://www.slack.co.uk/leica-noctilux-f1.2.html History In 1966 Leica was still a big player in the photojournalism world, and there was an increasing demand for fast lenses for shooting in very low light. Nikon, Minolta, Canon and Leica all produced f1.2 standard lenses in the 1960's. Canon was first out of the block in 1962 with the 58mm f1.2, they improved it to 55mm in 1968, but it was not until 1980 that the focal length was changed to 50mm. Nikon hit the market in 1965 with its 55mm f1.2, in 1978 they managed the 50mm f1.2 AI Nikkor. Minolta brought out their 58mm f1.2 in 1966, the same year that Leica trumped them with their 50mm f1.2 double Aspherical. Work started at Leica in 1957 on the production of aspherical elements: The first lens prototype produced in 1958 was the Summaron 35mm 1:2.8 ASPH This featured 2 Asph surfaces, but never went into production. A 52mm f1 Asph prototype also featuring 2 aspherical surfaces was produced in 1959, But Leica realised the image quality wasn't good enough at f1 and settled for f1.2. The first prototypes were made in April of 1964 Designed by Helmut Marx and Paul Sindel (Helmut Marx was Professor Max Berek's successor as head of the photographic lens design in Wetzlar, and creator of the first Summicron 50 in 1953). The Noctilux 50mm f1.2 was released as the 11820 in 1966. Professor Helmut Marx used an Elliott 402F computer helping design and saving lots of time ray tracing. This was before he had begun to develop his COMO optimisation program for lens design in the late 60s The Leica Noctilux 50mm f1.2 has two aspherical elements (front and rear) which were made on a specially built grinding machine that had to be operated manually. There was only one machine, and only one person capable of operating it (Gerd Bergmann), he had to discard many elements as rubbish. After the release in 1966 there was much research to produce an f1 version of the lens with 3 Aspherical elements, but in 1970 the project was abandoned because the aspherical technology was in its infancy, and the production costs were immense. The f1.2 lens remained in production only until 1975. In 1975 Walter Mandler in Canada designed an f1 Noctilux without any aspherical elements. It was launched in 1976 and was a great success, staying in production until 2008. In 2009 Leica introduced Peter Karbe's stunning f0.95 Noctilux, a double Gauss design with 2 aspherical elements. The Modern Lens The original Noctilux did not have a filter thread on the front element, it was part of the clip-on lens hood. The new lens does have a filter thread, and as far as I'm aware that's the only obvious difference between the new and old lenses. Even the lens hood is superficially identical (although it says \"LEICA CAMERA WETZLAR\" and misses out the 'GERMANY' on the original lens - or at least my prototype does!.) Otherwise the size, handling and appearance of the modern lens is just the same as its illustrious predecessor. By modern standards it's a small lens, about the same height as the current 50mm Summilux Asph and only a little fatter. It handles beautifully on an M body, perfectly balanced, but with a much longer focus throw than the more modern M lenses. It only focuses down to 1metre, I was hoping it would focus closer, but apparently that wasn't possible. Image Quality First of all I should say that I had quite an early prototype lens, but I expect that the image quality is pretty representative. It almost behaves like two different lenses. At f1.2 nothing is quite sharp, even in focus at the centre, by the edge of the frame it's very soft and there is quite a lot of vignetting. It doesn't sound so good, but it's actually rather a lovely dreamy look. By f2 the centre is quite sharp and the vignetting has mostly gone, however, the edges and corners are still quite soft. At f2.8 things have improved further and by f5.6 everything but the corners are incredibly sharp, however the corners are still soft and remain so at all apertures. Overall Contrast is fine, but not like a modern Leica Aspheric. However, stopped down, in common with the rigid Summicron the Noctilux has incredible micro-contrast and really great acuity. In fact the image quality is very comparable to the rigid summicron from about f4 and on. Bokeh is lovely (well, I think so, it's rather a personal subject). Stopping down a little the 16 aperture blades ensure that the aperture remains completely circular. Which Version? The Noctilux f1.2 is coming in two versions. The simple version is €7,000 and is black with an aluminium body, this is the one for normal mortals! There is also a Silver Chrome version with a brass body in a strictly limited edition of 100 copies. This retails for €15,000. and being brass I imagine it's pretty heavy; lovely, but more for collectors than for everyday use. I suppose one could buy both! Conclusion I really like the concept of remaking classic lenses, and this Noctilux is a lovely example, especially as the second hand price of the original lens makes it well outside the range of the average photographer. At €7,000 this lens seems like a something of a bargain, especially considering it's rather exotic double aspherical design. (Apparently it's still pretty difficult to make). Unlike the 90mm Thambar or the 28mm Summaron (lovely as they are), the Noctilux is very usable as an everyday lens, both on M and SL cameras (I guess it might also be fun on the CL). Dreamy and strange wide open, stopped down it is wonderfully sharp, and, if you like the look of the classic Leica lenses from the 50s and 60s then this would be an exciting addition. I'm going to start saving! Sample Images --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/317411-review-leica-noctilux-50mm-f12/?tab=comments#comment-4127255", "origin": "L-forum", "suborigin": "317411-review-leica-noctilux-50mm-f12", "result": true, "Selector": "my prototype", "selectorShort": "prototype", "MarkedSent": " introduction this is the third lens in leica's historical lens series where they revisit classics and remake them with modern glass and coatings, but with the original basic design. the two previous lenses are the 28mm summaron which is a tiny lens, originally released in 1954 with a screw mount. then came the leica thambar m 90mm f2.2, a quirky soft focus portrait lens from the mid 30's. the leica noctilux 50mm f1.2 is rather a different beast. released in 1966 it was the state of the art lens for shooting in low light, it was very expensive, and very difficult to make, estimates of how many were produced vary between 500 and 2,500. but i understand that the actual number was 1,757. as a result of this it has become a photographic legend and a serious collectors item with production lenses selling for well over $20,000 and even lens hoods changing hands for around $4,000! sadly i do not have an original lens to compare with the new one, but i guess that will be true of most of the people who buy this lovely lens. --img--  --img--  --img--  i've been lucky enough to have a prototype copy of the noctilux for almost the whole of the lockdown. i've used it on both the sl2 and the m10-r and have very much fallen in love. of course it has it's vices and would not come out well in a technical comparison between the current f0.95 noctilux (or the 50 f1.4 summilux come to that!). just a glance at the mtf curves shows that pretty clearly. but this lens is an important part of leica's history and it's great that leica should re-make it so that us lesser mortals can have a go with it! for more sample images you can read the article here: https://www.slack.co.uk/leica-noctilux-f1.2.html history in 1966 leica was still a big player in the photojournalism world, and there was an increasing demand for fast lenses for shooting in very low light. nikon, minolta, canon and leica all produced f1.2 standard lenses in the 1960's. canon was first out of the block in 1962 with the 58mm f1.2, they improved it to 55mm in 1968, but it was not until 1980 that the focal length was changed to 50mm. nikon hit the market in 1965 with its 55mm f1.2, in 1978 they managed the 50mm f1.2 ai nikkor. minolta brought out their 58mm f1.2 in 1966, the same year that leica trumped them with their 50mm f1.2 double aspherical. work started at leica in 1957 on the production of aspherical elements: the first lens prototype produced in 1958 was the summaron 35mm 1:2.8 asph this featured 2 asph surfaces, but never went into production. a 52mm f1 asph prototype also featuring 2 aspherical surfaces was produced in 1959, but leica realised the image quality wasn't good enough at f1 and settled for f1.2. the first prototypes were made in april of 1964 designed by helmut marx and paul sindel (helmut marx was professor max berek's successor as head of the photographic lens design in wetzlar, and creator of the first summicron 50 in 1953). the noctilux 50mm f1.2 was released as the 11820 in 1966. professor helmut marx used an elliott 402f computer helping design and saving lots of time ray tracing. this was before he had begun to develop his como optimisation program for lens design in the late 60s the leica noctilux 50mm f1.2 has two aspherical elements (front and rear) which were made on a specially built grinding machine that had to be operated manually. there was only one machine, and only one person capable of operating it (gerd bergmann), he had to discard many elements as rubbish. after the release in 1966 there was much research to produce an f1 version of the lens with 3 aspherical elements, but in 1970 the project was abandoned because the aspherical technology was in its infancy, and the production costs were immense. the f1.2 lens remained in production only until 1975. in 1975 walter mandler in canada designed an f1 noctilux without any aspherical elements. it was launched in 1976 and was a great success, staying in production until 2008. in 2009 leica introduced peter karbe's stunning f0.95 noctilux, a double gauss design with 2 aspherical elements. the modern lens the original noctilux did not have a filter thread on the front element, it was part of the clip-on lens hood. the new lens does have a filter thread, and as far as i'm aware that's the only obvious difference between the new and old lenses. even the lens hood is superficially identical (although it says \"leica camera wetzlar\" and misses out the 'germany' on the original lens - or at least -----> my !!!  -----> prototype !!!  does!.) otherwise the size, handling and appearance of the modern lens is just the same as its illustrious predecessor. by modern standards it's a small lens, about the same height as the current 50mm summilux asph and only a little fatter. it handles beautifully on an m body, perfectly balanced, but with a much longer focus throw than the more modern m lenses. it only focuses down to 1metre, i was hoping it would focus closer, but apparently that wasn't possible. image quality first of all i should say that i had quite an early prototype lens, but i expect that the image quality is pretty representative. it almost behaves like two different lenses. at f1.2 nothing is quite sharp, even in focus at the centre, by the edge of the frame it's very soft and there is quite a lot of vignetting. it doesn't sound so good, but it's actually rather a lovely dreamy look. by f2 the centre is quite sharp and the vignetting has mostly gone, however, the edges and corners are still quite soft. at f2.8 things have improved further and by f5.6 everything but the corners are incredibly sharp, however the corners are still soft and remain so at all apertures. overall contrast is fine, but not like a modern leica aspheric. however, stopped down, in common with the rigid summicron the noctilux has incredible micro-contrast and really great acuity. in fact the image quality is very comparable to the rigid summicron from about f4 and on. bokeh is lovely (well, i think so, it's rather a personal subject). stopping down a little the 16 aperture blades ensure that the aperture remains completely circular. which version? the noctilux f1.2 is coming in two versions. the simple version is €7,000 and is black with an aluminium body, this is the one for normal mortals! there is also a silver chrome version with a brass body in a strictly limited edition of 100 copies. this retails for €15,000. and being brass i imagine it's pretty heavy; lovely, but more for collectors than for everyday use. i suppose one could buy both! conclusion i really like the concept of remaking classic lenses, and this noctilux is a lovely example, especially as the second hand price of the original lens makes it well outside the range of the average photographer. at €7,000 this lens seems like a something of a bargain, especially considering it's rather exotic double aspherical design. (apparently it's still pretty difficult to make). unlike the 90mm thambar or the 28mm summaron (lovely as they are), the noctilux is very usable as an everyday lens, both on m and sl cameras (i guess it might also be fun on the cl). dreamy and strange wide open, stopped down it is wonderfully sharp, and, if you like the look of the classic leica lenses from the 50s and 60s then this would be an exciting addition. i'm going to start saving! sample images --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 17358, "year": "2021"}, {"autor": "insideline", "date": "2021-03-09 00:51:00", "content": "On 1/28/2021 at 6:49 AM, jonoslack said: Introduction This is the third lens in Leica's historical lens series where they revisit classics and remake them with modern glass and coatings, but with the original basic design. The two previous lenses are the 28mm Summaron which is a tiny lens, originally released in 1954 with a screw mount. Then came the Leica Thambar M 90mm f2.2, a quirky soft focus portrait lens from the mid 30's. The Leica Noctilux 50mm f1.2 is rather a different beast. Released in 1966 it was the state of the art lens for shooting in low light, it was very expensive, and very difficult to make, estimates of how many were produced vary between 500 and 2,500. But I understand that the actual number was 1,757. As a result of this it has become a photographic legend and a serious collectors item with production lenses selling for well over $20,000 and even lens hoods changing hands for around $4,000! Sadly I do not have an original lens to compare with the new one, but I guess that will be true of most of the people who buy this lovely lens. --img--  --img--  --img--  I've been lucky enough to have a prototype copy of the Noctilux for almost the whole of the lockdown. I've used it on both the SL2 and the M10-R and have very much fallen in love. Of course it has it's vices and would not come out well in a technical comparison between the current f0.95 Noctilux (or the 50 f1.4 Summilux come to that!). Just a glance at the MTF curves shows that pretty clearly. But this lens is an important part of Leica's history and it's great that Leica should re-make it so that us lesser mortals can have a go with it! For more sample images you can read the article here: https://www.slack.co.uk/leica-noctilux-f1.2.html History In 1966 Leica was still a big player in the photojournalism world, and there was an increasing demand for fast lenses for shooting in very low light. Nikon, Minolta, Canon and Leica all produced f1.2 standard lenses in the 1960's. Canon was first out of the block in 1962 with the 58mm f1.2, they improved it to 55mm in 1968, but it was not until 1980 that the focal length was changed to 50mm. Nikon hit the market in 1965 with its 55mm f1.2, in 1978 they managed the 50mm f1.2 AI Nikkor. Minolta brought out their 58mm f1.2 in 1966, the same year that Leica trumped them with their 50mm f1.2 double Aspherical. Work started at Leica in 1957 on the production of aspherical elements: The first lens prototype produced in 1958 was the Summaron 35mm 1:2.8 ASPH This featured 2 Asph surfaces, but never went into production. A 52mm f1 Asph prototype also featuring 2 aspherical surfaces was produced in 1959, But Leica realised the image quality wasn't good enough at f1 and settled for f1.2. The first prototypes were made in April of 1964 Designed by Helmut Marx and Paul Sindel (Helmut Marx was Professor Max Berek's successor as head of the photographic lens design in Wetzlar, and creator of the first Summicron 50 in 1953). The Noctilux 50mm f1.2 was released as the 11820 in 1966. Professor Helmut Marx used an Elliott 402F computer helping design and saving lots of time ray tracing. This was before he had begun to develop his COMO optimisation program for lens design in the late 60s The Leica Noctilux 50mm f1.2 has two aspherical elements (front and rear) which were made on a specially built grinding machine that had to be operated manually. There was only one machine, and only one person capable of operating it (Gerd Bergmann), he had to discard many elements as rubbish. After the release in 1966 there was much research to produce an f1 version of the lens with 3 Aspherical elements, but in 1970 the project was abandoned because the aspherical technology was in its infancy, and the production costs were immense. The f1.2 lens remained in production only until 1975. In 1975 Walter Mandler in Canada designed an f1 Noctilux without any aspherical elements. It was launched in 1976 and was a great success, staying in production until 2008. In 2009 Leica introduced Peter Karbe's stunning f0.95 Noctilux, a double Gauss design with 2 aspherical elements. The Modern Lens The original Noctilux did not have a filter thread on the front element, it was part of the clip-on lens hood. The new lens does have a filter thread, and as far as I'm aware that's the only obvious difference between the new and old lenses. Even the lens hood is superficially identical (although it says \"LEICA CAMERA WETZLAR\" and misses out the 'GERMANY' on the original lens - or at least my prototype does!.) Otherwise the size, handling and appearance of the modern lens is just the same as its illustrious predecessor. By modern standards it's a small lens, about the same height as the current 50mm Summilux Asph and only a little fatter. It handles beautifully on an M body, perfectly balanced, but with a much longer focus throw than the more modern M lenses. It only focuses down to 1metre, I was hoping it would focus closer, but apparently that wasn't possible. Image Quality First of all I should say that I had quite an early prototype lens, but I expect that the image quality is pretty representative. It almost behaves like two different lenses. At f1.2 nothing is quite sharp, even in focus at the centre, by the edge of the frame it's very soft and there is quite a lot of vignetting. It doesn't sound so good, but it's actually rather a lovely dreamy look. By f2 the centre is quite sharp and the vignetting has mostly gone, however, the edges and corners are still quite soft. At f2.8 things have improved further and by f5.6 everything but the corners are incredibly sharp, however the corners are still soft and remain so at all apertures. Overall Contrast is fine, but not like a modern Leica Aspheric. However, stopped down, in common with the rigid Summicron the Noctilux has incredible micro-contrast and really great acuity. In fact the image quality is very comparable to the rigid summicron from about f4 and on. Bokeh is lovely (well, I think so, it's rather a personal subject). Stopping down a little the 16 aperture blades ensure that the aperture remains completely circular. Which Version? The Noctilux f1.2 is coming in two versions. The simple version is €7,000 and is black with an aluminium body, this is the one for normal mortals! There is also a Silver Chrome version with a brass body in a strictly limited edition of 100 copies. This retails for €15,000. and being brass I imagine it's pretty heavy; lovely, but more for collectors than for everyday use. I suppose one could buy both! Conclusion I really like the concept of remaking classic lenses, and this Noctilux is a lovely example, especially as the second hand price of the original lens makes it well outside the range of the average photographer. At €7,000 this lens seems like a something of a bargain, especially considering it's rather exotic double aspherical design. (Apparently it's still pretty difficult to make). Unlike the 90mm Thambar or the 28mm Summaron (lovely as they are), the Noctilux is very usable as an everyday lens, both on M and SL cameras (I guess it might also be fun on the CL). Dreamy and strange wide open, stopped down it is wonderfully sharp, and, if you like the look of the classic Leica lenses from the 50s and 60s then this would be an exciting addition. I'm going to start saving! Sample Images --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  Jono, Thank you for the great review to the point I have the new 1.2 on order. Sorry to hijack this but can you please share what brand and info on the black round camera strap shown in these pictures as it looks lovely and I'd like to buy one. Thank you!", "link": "https://www.l-camera-forum.com/topic/317411-review-leica-noctilux-50mm-f12/page/14/?tab=comments#comment-4156622", "origin": "L-forum", "suborigin": "317411-review-leica-noctilux-50mm-f12", "result": true, "Selector": "my prototype", "selectorShort": "prototype", "MarkedSent": "on 1/28/2021 at 6:49 am, jonoslack said: introduction this is the third lens in leica's historical lens series where they revisit classics and remake them with modern glass and coatings, but with the original basic design. the two previous lenses are the 28mm summaron which is a tiny lens, originally released in 1954 with a screw mount. then came the leica thambar m 90mm f2.2, a quirky soft focus portrait lens from the mid 30's. the leica noctilux 50mm f1.2 is rather a different beast. released in 1966 it was the state of the art lens for shooting in low light, it was very expensive, and very difficult to make, estimates of how many were produced vary between 500 and 2,500. but i understand that the actual number was 1,757. as a result of this it has become a photographic legend and a serious collectors item with production lenses selling for well over $20,000 and even lens hoods changing hands for around $4,000! sadly i do not have an original lens to compare with the new one, but i guess that will be true of most of the people who buy this lovely lens. --img--  --img--  --img--  i've been lucky enough to have a prototype copy of the noctilux for almost the whole of the lockdown. i've used it on both the sl2 and the m10-r and have very much fallen in love. of course it has it's vices and would not come out well in a technical comparison between the current f0.95 noctilux (or the 50 f1.4 summilux come to that!). just a glance at the mtf curves shows that pretty clearly. but this lens is an important part of leica's history and it's great that leica should re-make it so that us lesser mortals can have a go with it! for more sample images you can read the article here: https://www.slack.co.uk/leica-noctilux-f1.2.html history in 1966 leica was still a big player in the photojournalism world, and there was an increasing demand for fast lenses for shooting in very low light. nikon, minolta, canon and leica all produced f1.2 standard lenses in the 1960's. canon was first out of the block in 1962 with the 58mm f1.2, they improved it to 55mm in 1968, but it was not until 1980 that the focal length was changed to 50mm. nikon hit the market in 1965 with its 55mm f1.2, in 1978 they managed the 50mm f1.2 ai nikkor. minolta brought out their 58mm f1.2 in 1966, the same year that leica trumped them with their 50mm f1.2 double aspherical. work started at leica in 1957 on the production of aspherical elements: the first lens prototype produced in 1958 was the summaron 35mm 1:2.8 asph this featured 2 asph surfaces, but never went into production. a 52mm f1 asph prototype also featuring 2 aspherical surfaces was produced in 1959, but leica realised the image quality wasn't good enough at f1 and settled for f1.2. the first prototypes were made in april of 1964 designed by helmut marx and paul sindel (helmut marx was professor max berek's successor as head of the photographic lens design in wetzlar, and creator of the first summicron 50 in 1953). the noctilux 50mm f1.2 was released as the 11820 in 1966. professor helmut marx used an elliott 402f computer helping design and saving lots of time ray tracing. this was before he had begun to develop his como optimisation program for lens design in the late 60s the leica noctilux 50mm f1.2 has two aspherical elements (front and rear) which were made on a specially built grinding machine that had to be operated manually. there was only one machine, and only one person capable of operating it (gerd bergmann), he had to discard many elements as rubbish. after the release in 1966 there was much research to produce an f1 version of the lens with 3 aspherical elements, but in 1970 the project was abandoned because the aspherical technology was in its infancy, and the production costs were immense. the f1.2 lens remained in production only until 1975. in 1975 walter mandler in canada designed an f1 noctilux without any aspherical elements. it was launched in 1976 and was a great success, staying in production until 2008. in 2009 leica introduced peter karbe's stunning f0.95 noctilux, a double gauss design with 2 aspherical elements. the modern lens the original noctilux did not have a filter thread on the front element, it was part of the clip-on lens hood. the new lens does have a filter thread, and as far as i'm aware that's the only obvious difference between the new and old lenses. even the lens hood is superficially identical (although it says \"leica camera wetzlar\" and misses out the 'germany' on the original lens - or at least -----> my !!!  -----> prototype !!!  does!.) otherwise the size, handling and appearance of the modern lens is just the same as its illustrious predecessor. by modern standards it's a small lens, about the same height as the current 50mm summilux asph and only a little fatter. it handles beautifully on an m body, perfectly balanced, but with a much longer focus throw than the more modern m lenses. it only focuses down to 1metre, i was hoping it would focus closer, but apparently that wasn't possible. image quality first of all i should say that i had quite an early prototype lens, but i expect that the image quality is pretty representative. it almost behaves like two different lenses. at f1.2 nothing is quite sharp, even in focus at the centre, by the edge of the frame it's very soft and there is quite a lot of vignetting. it doesn't sound so good, but it's actually rather a lovely dreamy look. by f2 the centre is quite sharp and the vignetting has mostly gone, however, the edges and corners are still quite soft. at f2.8 things have improved further and by f5.6 everything but the corners are incredibly sharp, however the corners are still soft and remain so at all apertures. overall contrast is fine, but not like a modern leica aspheric. however, stopped down, in common with the rigid summicron the noctilux has incredible micro-contrast and really great acuity. in fact the image quality is very comparable to the rigid summicron from about f4 and on. bokeh is lovely (well, i think so, it's rather a personal subject). stopping down a little the 16 aperture blades ensure that the aperture remains completely circular. which version? the noctilux f1.2 is coming in two versions. the simple version is €7,000 and is black with an aluminium body, this is the one for normal mortals! there is also a silver chrome version with a brass body in a strictly limited edition of 100 copies. this retails for €15,000. and being brass i imagine it's pretty heavy; lovely, but more for collectors than for everyday use. i suppose one could buy both! conclusion i really like the concept of remaking classic lenses, and this noctilux is a lovely example, especially as the second hand price of the original lens makes it well outside the range of the average photographer. at €7,000 this lens seems like a something of a bargain, especially considering it's rather exotic double aspherical design. (apparently it's still pretty difficult to make). unlike the 90mm thambar or the 28mm summaron (lovely as they are), the noctilux is very usable as an everyday lens, both on m and sl cameras (i guess it might also be fun on the cl). dreamy and strange wide open, stopped down it is wonderfully sharp, and, if you like the look of the classic leica lenses from the 50s and 60s then this would be an exciting addition. i'm going to start saving! sample images --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  --img--  jono, thank you for the great review to the point i have the new 1.2 on order. sorry to hijack this but can you please share what brand and info on the black round camera strap shown in these pictures as it looks lovely and i'd like to buy one. thank you!", "sortedWord": "None", "Identifyer": null, "identifyer": 17633, "year": "2021"}, {"autor": "derleicaman", "date": "2021-08-02 11:43:00", "content": "5 hours ago, mmx_2 said: The original M8 was sold in a “panda edition” (black, chrome dials) during middle2008-2009 (I got mine from ffordes in feb 2009). The cameras came in boxes (mine did at least), marked “chrome” and had a black paint finish. According to a Leica Rep less than 150 pandas where made as a paint finish test for the M8.2. They never had an official part number at Leica. These where the only black paint M8:s made. M8.2 came in black paint and likewise the M9. The M8.2 was also the first regular production Leica with the black dot. I specified the black dot on the LHSA Black Paint M6 TTL. When HP Coen, then CEO of Leica was looking at my prototype camera at PMA, he said, “Bill, there is something wrong with this camera!” I asked him what he was referring to. He said the dot was not red. I replied that was intentional. Glad he didn’t insist we make it red! 🙂 And so the black dot was born.", "link": "https://www.l-camera-forum.com/topic/323183-a-list-of-all-black-paint-m-cameras-analog-and-digital/?tab=comments#comment-4249824", "origin": "L-forum", "suborigin": "323183-a-list-of-all-black-paint-m-cameras-analog-and-digital", "result": true, "Selector": "my prototype", "selectorShort": "prototype", "MarkedSent": "5 hours ago, mmx_2 said: the original m8 was sold in a “panda edition” (black, chrome dials) during middle2008-2009 (i got mine from ffordes in feb 2009). the cameras came in boxes (mine did at least), marked “chrome” and had a black paint finish. according to a leica rep less than 150 pandas where made as a paint finish test for the m8.2. they never had an official part number at leica. these where the only black paint m8:s made. m8.2 came in black paint and likewise the m9. the m8.2 was also the first regular production leica with the black dot. i specified the black dot on the lhsa black paint m6 ttl. when hp coen, then ceo of leica was looking at -----> my !!!  -----> prototype !!!  camera at pma, he said, “bill, there is something wrong with this camera!” i asked him what he was referring to. he said the dot was not red. i replied that was intentional. glad he didn’t insist we make it red! 🙂 and so the black dot was born.", "sortedWord": "None", "Identifyer": null, "identifyer": 36678, "year": "2021"}, {"autor": "mmx_2", "date": "2021-08-03 07:19:00", "content": " 19 hours ago, derleicaman said: The M8.2 was also the first regular production Leica with the black dot. I specified the black dot on the LHSA Black Paint M6 TTL. When HP Coen, then CEO of Leica was looking at my prototype camera at PMA, he said, “Bill, there is something wrong with this camera!” I asked him what he was referring to. He said the dot was not red. I replied that was intentional. Glad he didn’t insist we make it red! 🙂 And so the black dot was born. As I have understood it, Leica Camera Ag had to stop using the black dot because of copyright infringement to Leica Microsystems GmbH, and this should be the reason why black dot is not available “from factory” anymore. My M8 Panda came with black dot, but I have also seen with red dot.", "link": "https://www.l-camera-forum.com/topic/323183-a-list-of-all-black-paint-m-cameras-analog-and-digital/page/2/?tab=comments#comment-4250262", "origin": "L-forum", "suborigin": "323183-a-list-of-all-black-paint-m-cameras-analog-and-digital", "result": true, "Selector": "my prototype", "selectorShort": "prototype", "MarkedSent": " 19 hours ago, derleicaman said: the m8.2 was also the first regular production leica with the black dot. i specified the black dot on the lhsa black paint m6 ttl. when hp coen, then ceo of leica was looking at -----> my !!!  -----> prototype !!!  camera at pma, he said, “bill, there is something wrong with this camera!” i asked him what he was referring to. he said the dot was not red. i replied that was intentional. glad he didn’t insist we make it red! 🙂 and so the black dot was born. as i have understood it, leica camera ag had to stop using the black dot because of copyright infringement to leica microsystems gmbh, and this should be the reason why black dot is not available “from factory” anymore. my m8 panda came with black dot, but i have also seen with red dot.", "sortedWord": "None", "Identifyer": null, "identifyer": 36679, "year": "2021"}, {"autor": "Jeff S", "date": "2021-08-04 01:21:00", "content": "On 8/2/2021 at 7:43 AM, derleicaman said: The M8.2 was also the first regular production Leica with the black dot. I specified the black dot on the LHSA Black Paint M6 TTL. When HP Coen, then CEO of Leica was looking at my prototype camera at PMA, he said, “Bill, there is something wrong with this camera!” I asked him what he was referring to. He said the dot was not red. I replied that was intentional. Glad he didn’t insist we make it red! 🙂 And so the black dot was born. Only the black paint M8.2, of course....the silver version maintained the red dot. Jeff", "link": "https://www.l-camera-forum.com/topic/323183-a-list-of-all-black-paint-m-cameras-analog-and-digital/page/2/?tab=comments#comment-4250745", "origin": "L-forum", "suborigin": "323183-a-list-of-all-black-paint-m-cameras-analog-and-digital", "result": true, "Selector": "my prototype", "selectorShort": "prototype", "MarkedSent": "on 8/2/2021 at 7:43 am, derleicaman said: the m8.2 was also the first regular production leica with the black dot. i specified the black dot on the lhsa black paint m6 ttl. when hp coen, then ceo of leica was looking at -----> my !!!  -----> prototype !!!  camera at pma, he said, “bill, there is something wrong with this camera!” i asked him what he was referring to. he said the dot was not red. i replied that was intentional. glad he didn’t insist we make it red! 🙂 and so the black dot was born. only the black paint m8.2, of course....the silver version maintained the red dot. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 36689, "year": "2021"}, {"autor": "derleicaman", "date": "2021-08-04 03:31:00", "content": "1 hour ago, IkarusJohn said: As a matter of interest, why only original Leica black paint. Is there another sort of Leica black paint, and if Leica applied it, what's the problem? More generally, what is the purpose of identifying all Leica cameras released with black paint? As Leica offers 'Redesign\", with a black paint option, I'm not really sure I understand the question - any Leica M can be black paint, applied by Leica. I can't imagine there's a secondhand price difference (for what that's worth). Is my \"original\" silver chrome M9 Monochrome worth more or less, as it was originally only released in black chrome? I'm not sure where this is going. Actually, I'm not even sure what my question is ... Well, actually the original M (MP, M3, M2 and M4) black paint cameras carry a huge premium over their silver chrome versions. My concept with the original LHSA Black Paint M6 TTL was to bring back the black paint M. Leica initially had no interest in doing this. Once they saw how good our prototypes looked, they did the Millenium and then numerous other black paint special editions. We did the LHSA MP3 in black paint as well. Eventually they did the M8.2 and then the M9 and M240 in black paint. No, there really is no premium for the digital black paint cameras. The M10-R BP May change that. Your silver chrome MM is fairly rare and should carry some premium over the black chrome version. I have a silver chrome one also, with the Leica script on top.", "link": "https://www.l-camera-forum.com/topic/323183-a-list-of-all-black-paint-m-cameras-analog-and-digital/page/2/?tab=comments#comment-4250807", "origin": "L-forum", "suborigin": "323183-a-list-of-all-black-paint-m-cameras-analog-and-digital", "result": true, "Selector": "our prototypes", "selectorShort": "prototype", "MarkedSent": "1 hour ago, ikarusjohn said: as a matter of interest, why only original leica black paint. is there another sort of leica black paint, and if leica applied it, what's the problem? more generally, what is the purpose of identifying all leica cameras released with black paint? as leica offers 'redesign\", with a black paint option, i'm not really sure i understand the question - any leica m can be black paint, applied by leica. i can't imagine there's a secondhand price difference (for what that's worth). is my \"original\" silver chrome m9 monochrome worth more or less, as it was originally only released in black chrome? i'm not sure where this is going. actually, i'm not even sure what my question is ... well, actually the original m (mp, m3, m2 and m4) black paint cameras carry a huge premium over their silver chrome versions. my concept with the original lhsa black paint m6 ttl was to bring back the black paint m. leica initially had no interest in doing this. once they saw how good -----> our !!!  -----> prototypes !!!  looked, they did the millenium and then numerous other black paint special editions. we did the lhsa mp3 in black paint as well. eventually they did the m8.2 and then the m9 and m240 in black paint. no, there really is no premium for the digital black paint cameras. the m10-r bp may change that. your silver chrome mm is fairly rare and should carry some premium over the black chrome version. i have a silver chrome one also, with the leica script on top.", "sortedWord": "None", "Identifyer": null, "identifyer": 36691, "year": "2021"}], "name": "Leicasortedout2021prototype"}