{"interestingcomments": [{"autor": "ECohen", "date": "2017-01-08 14:22:00", "content": " I'm just not happy with the Skin tones on the M-P240, too red, too saturated sometimes too magenta. I'm shooting Raw and using ACR. Also Im only using modern Leica lenses.I could use LR but my current workflow doesn't include LR........any help is welcome. I just cant get them balanced to my liking, easily (neutral a little more warm). I've not yet created a profile, mostly because the amount changes due to lighting variables like, Sun/Shade/Studio. Every shooting situation seems produce a different undesirable result on skin tones.....but in the same general direction I have only been using the 240 for about 2 years or so. I love the sharpness of the lenses and generally the color work I shoot, I can work with ....but the delicate look of skin tones I'm finding very difficult to achieve. I've used many cameras from different manufactures and they seem to be profiled more neutral. When I was working professionally (retired now) I had a similar problem with Hasselblad /Imacon. Where it took a lot of work to get natural color. That problem was solved by firmware profile updates from the manufacture. I don't think I'm going to see that from Leica at this point.The other day I found myself grabbing a Nikon for a few simple portraits because the color on people was easier to achieve. And on this particular project I just wanted to get it done. I have to figure out a system to get better more natural skin tones, I prefer everything else regarding the Leica system and am trying to make the 240 my only camera. I'm looking for a simpler life.I don't mind working hard to figure out a system....I could some guidance....please I know this subject has come up before but in searching this forum it was last discussed 5 15 2016 .......maybe there has been more experimentation on the issue. Maybe somebody has create a profile they world like to share with us? As always THANK YOU for your help and advice", "link": "https://www.l-camera-forum.com/topic/268079-skin-tones-with-the-m-p240/?tab=comments#comment-3181612", "origin": "L-forum", "suborigin": "268079-skin-tones-with-the-m-p240", "result": true, "Selector": "i've not yet created", "selectorShort": "create", "MarkedSent": " i'm just not happy with the skin tones on the m-p240, too red, too saturated sometimes too magenta. i'm shooting raw and using acr. also im only using modern leica lenses.i could use lr but my current workflow doesn't include lr........any help is welcome. i just cant get them balanced to my liking, easily (neutral a little more warm). -----> i !!! 've -----> not !!!  -----> yet !!!  -----> created !!!  a profile, mostly because the amount changes due to lighting variables like, sun/shade/studio. every shooting situation seems produce a different undesirable result on skin tones.....but in the same general direction i have only been using the 240 for about 2 years or so. i love the sharpness of the lenses and generally the color work i shoot, i can work with ....but the delicate look of skin tones i'm finding very difficult to achieve. i've used many cameras from different manufactures and they seem to be profiled more neutral. when i was working professionally (retired now) i had a similar problem with hasselblad /imacon. where it took a lot of work to get natural color. that problem was solved by firmware profile updates from the manufacture. i don't think i'm going to see that from leica at this point.the other day i found myself grabbing a nikon for a few simple portraits because the color on people was easier to achieve. and on this particular project i just wanted to get it done. i have to figure out a system to get better more natural skin tones, i prefer everything else regarding the leica system and am trying to make the 240 my only camera. i'm looking for a simpler life.i don't mind working hard to figure out a system....i could some guidance....please i know this subject has come up before but in searching this forum it was last discussed 5 15 2016 .......maybe there has been more experimentation on the issue. maybe somebody has create a profile they world like to share with us? as always thank you for your help and advice", "sortedWord": "None", "Identifyer": null, "identifyer": 12525, "year": "2017"}, {"autor": "LocalHero1953", "date": "2017-01-08 14:42:00", "content": "The M240 received a lot of criticism here for skin tones when it first came out (the M9 was far worse). Like some others, I created my own dual illumination profile, and devised LR colour corrections that dealt with the problems: typically too red/magenta on caucasian skins. As I recall these included shifting the red hue towards orange and reducing red and magenta saturation, and occasionally increasing red luminance. As Leica released new firmware and Adobe improved their profiles, I found the skin tones to rendered OK; not as good as the SL's skin tones and AWB, but acceptable for most lighting conditions and for all except the most difficult skins. I tried an IR cut filter for a while, but by that time the s/w and f/w improvements had kicked in; it didn't help with extreme skins, for which I make the colour adjustments I mention above. Edit. As to the cause, I have always attributed it to an interaction between the M's sensitivity to IR (though less than the M8 and M9), lighting which has a high IR component and particular skin types with capillaries close to the surface. But I don't claim special expertise in this area. Edited January 8, 2017 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/268079-skin-tones-with-the-m-p240/?tab=comments#comment-3181634", "origin": "L-forum", "suborigin": "268079-skin-tones-with-the-m-p240", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "the m240 received a lot of criticism here for skin tones when it first came out (the m9 was far worse). like some others, -----> i !!!  -----> created !!!  my own dual illumination profile, and devised lr colour corrections that dealt with the problems: typically too red/magenta on caucasian skins. as i recall these included shifting the red hue towards orange and reducing red and magenta saturation, and occasionally increasing red luminance. as leica released new firmware and adobe improved their profiles, i found the skin tones to rendered ok; not as good as the sl's skin tones and awb, but acceptable for most lighting conditions and for all except the most difficult skins. i tried an ir cut filter for a while, but by that time the s/w and f/w improvements had kicked in; it didn't help with extreme skins, for which i make the colour adjustments i mention above. edit. as to the cause, i have always attributed it to an interaction between the m's sensitivity to ir (though less than the m8 and m9), lighting which has a high ir component and particular skin types with capillaries close to the surface. but i don't claim special expertise in this area. edited january 8, 2017 by localhero1953", "sortedWord": "None", "Identifyer": null, "identifyer": 12527, "year": "2017"}, {"autor": "elmars", "date": "2017-01-08 21:07:00", "content": "--img--  I'm just not happy with the Skin tones on the M-P240, too red, too saturated sometimes too magenta. I'm shooting Raw and using ACR. Also Im only using modern Leica lenses.I could use LR but my current workflow doesn't include LR........any help is welcome. I just cant get them balanced to my liking, easily (neutral a little more warm). I've not yet created a profile, mostly because the amount changes due to lighting variables like, Sun/Shade/Studio. Every shooting situation seems produce a different undesirable result on skin tones.....but in the same general direction I have only been using the 240 for about 2 years or so. I love the sharpness of the lenses and generally the color work I shoot, I can work with ....but the delicate look of skin tones I'm finding very difficult to achieve. I've used many cameras from different manufactures and they seem to be profiled more neutral. When I was working professionally (retired now) I had a similar problem with Hasselblad /Imacon. Where it took a lot of work to get natural color. That problem was solved by firmware profile updates from the manufacture. I don't think I'm going to see that from Leica at this point.The other day I found myself grabbing a Nikon for a few simple portraits because the color on people was easier to achieve. And on this particular project I just wanted to get it done. I have to figure out a system to get better more natural skin tones, I prefer everything else regarding the Leica system and am trying to make the 240 my only camera. I'm looking for a simpler life.I don't mind working hard to figure out a system....I could some guidance....please I know this subject has come up before but in searching this forum it was last discussed 5 15 2016 .......maybe there has been more experimentation on the issue. Maybe somebody has create a profile they world like to share with us? As always THANK YOU for your help and advice I had the same problem. Try this preset. I can send it to You, if You send me Your Mailadress. Elmar", "link": "https://www.l-camera-forum.com/topic/268079-skin-tones-with-the-m-p240/?tab=comments#comment-3181929", "origin": "L-forum", "suborigin": "268079-skin-tones-with-the-m-p240", "result": true, "Selector": "i've not yet created", "selectorShort": "create", "MarkedSent": "--img--  i'm just not happy with the skin tones on the m-p240, too red, too saturated sometimes too magenta. i'm shooting raw and using acr. also im only using modern leica lenses.i could use lr but my current workflow doesn't include lr........any help is welcome. i just cant get them balanced to my liking, easily (neutral a little more warm). -----> i !!! 've -----> not !!!  -----> yet !!!  -----> created !!!  a profile, mostly because the amount changes due to lighting variables like, sun/shade/studio. every shooting situation seems produce a different undesirable result on skin tones.....but in the same general direction i have only been using the 240 for about 2 years or so. i love the sharpness of the lenses and generally the color work i shoot, i can work with ....but the delicate look of skin tones i'm finding very difficult to achieve. i've used many cameras from different manufactures and they seem to be profiled more neutral. when i was working professionally (retired now) i had a similar problem with hasselblad /imacon. where it took a lot of work to get natural color. that problem was solved by firmware profile updates from the manufacture. i don't think i'm going to see that from leica at this point.the other day i found myself grabbing a nikon for a few simple portraits because the color on people was easier to achieve. and on this particular project i just wanted to get it done. i have to figure out a system to get better more natural skin tones, i prefer everything else regarding the leica system and am trying to make the 240 my only camera. i'm looking for a simpler life.i don't mind working hard to figure out a system....i could some guidance....please i know this subject has come up before but in searching this forum it was last discussed 5 15 2016 .......maybe there has been more experimentation on the issue. maybe somebody has create a profile they world like to share with us? as always thank you for your help and advice i had the same problem. try this preset. i can send it to you, if you send me your mailadress. elmar", "sortedWord": "None", "Identifyer": null, "identifyer": 12530, "year": "2017"}, {"autor": "jaapv", "date": "2017-01-09 07:36:00", "content": "I'll file this under YMMV. I'm sure your manual profile works as well, and better for you --img-- As we are trying to create a subjective result, there will be varying methods and outcomes.", "link": "https://www.l-camera-forum.com/topic/268079-skin-tones-with-the-m-p240/?tab=comments#comment-3182131", "origin": "L-forum", "suborigin": "268079-skin-tones-with-the-m-p240", "result": true, "Selector": "we are trying to create", "selectorShort": "create", "MarkedSent": "i'll file this under ymmv. i'm sure your manual profile works as well, and better for you --img-- as -----> we !!!  -----> are !!!  -----> trying !!!  -----> to !!!  -----> create !!!  a subjective result, there will be varying methods and outcomes.", "sortedWord": "None", "Identifyer": null, "identifyer": 12540, "year": "2017"}, {"autor": "Milan_S", "date": "2017-12-12 07:52:00", "content": "--img--  I've created a Facebook group for this mythical Thambar lens, please post your photos taken with the old or the new Thambar 90mm f2.2https://www.facebook...2241810801278/", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/8/?tab=comments#comment-3416238", "origin": "L-forum", "suborigin": "279589-thambar-crazy", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "--img--  -----> i !!! 've -----> created !!!  a facebook group for this mythical thambar lens, please post your photos taken with the old or the new thambar 90mm f2.2https://www.facebook...2241810801278/", "sortedWord": "None", "Identifyer": null, "identifyer": 12151, "year": "2017"}, {"autor": "LocalHero1953", "date": "2017-12-12 08:57:00", "content": "--img-- 25383187_10156185407850827_802366155_o.jpg I've created a Facebook group for this mythical Thambar lens, please post your photos taken with the old or the new Thambar 90mm f2.2 https://www.facebook...2241810801278/ I can't link to it. Is it working?", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/8/?tab=comments#comment-3416262", "origin": "L-forum", "suborigin": "279589-thambar-crazy", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "--img-- 25383187_10156185407850827_802366155_o.jpg -----> i !!! 've -----> created !!!  a facebook group for this mythical thambar lens, please post your photos taken with the old or the new thambar 90mm f2.2 https://www.facebook...2241810801278/ i can't link to it. is it working?", "sortedWord": "None", "Identifyer": null, "identifyer": 12152, "year": "2017"}, {"autor": "honcho", "date": "2017-01-20 23:33:00", "content": " I just watched a Youtube vdo from Tony Northrup. He said there is no need to use an UVa filter as it actually degrades an inmage quality. What do you guys think on that ? The video is a mixture of truths, half truths and nonsense. He likes to create his images on the computer, I prefer to create mine in the camera.", "link": "https://www.l-camera-forum.com/topic/267310-do-we-really-need-to-use-an-uva-filter-on-our-lenses/page/2/?tab=comments#comment-3192551", "origin": "L-forum", "suborigin": "267310-do-we-really-need-to-use-an-uva-filter-on-our-lenses", "result": true, "Selector": "i prefer to create", "selectorShort": "create", "MarkedSent": " i just watched a youtube vdo from tony northrup. he said there is no need to use an uva filter as it actually degrades an inmage quality. what do you guys think on that ? the video is a mixture of truths, half truths and nonsense. he likes -----> to !!!  -----> create !!!  his images on the computer, -----> i !!!  -----> prefer !!!  -----> to !!!  -----> create !!!  mine in the camera.", "sortedWord": "None", "Identifyer": null, "identifyer": 88382, "year": "2017"}, {"autor": "LocalHero1953", "date": "2017-05-27 10:27:00", "content": "Another thought, is your Lightroom catalogue over 1TB. Prolly not, so keep the catalogue on the SSD as it uses the speed best, and put the image and side-car files on a large USB disc. The image files are accessed one by one (e.g. When you enter development module) so the lower speed is not such a pain. Hmm. I'll have to think about this. The raws and sidecar files, and any jpg/tif/psd files I have created from them, are kept together to make it easier for third party apps to read them (for the apocalyptic scenario of Adobe going out of business). The catalogue file (.lrcat) is 'only' 2.5Gb.", "link": "https://www.l-camera-forum.com/topic/272877-image-storage-bigger-and-bigger-storage-drives/?tab=comments#comment-3283680", "origin": "L-forum", "suborigin": "272877-image-storage-bigger-and-bigger-storage-drives", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "another thought, is your lightroom catalogue over 1tb. prolly not, so keep the catalogue on the ssd as it uses the speed best, and put the image and side-car files on a large usb disc. the image files are accessed one by one (e.g. when you enter development module) so the lower speed is not such a pain. hmm. i'll have to think about this. the raws and sidecar files, and any jpg/tif/psd files -----> i !!!  -----> have !!!  -----> created !!!  from them, are kept together to make it easier for third party apps to read them (for the apocalyptic scenario of adobe going out of business). the catalogue file (.lrcat) is 'only' 2.5gb.", "sortedWord": "None", "Identifyer": null, "identifyer": 92195, "year": "2017"}, {"autor": "Jeff S", "date": "2017-08-14 02:15:00", "content": "Mine were sold by Zone Vi, now defunct, but easily made. They were about 2x3 foot wide frames, about a half inch thick, with mesh screen inserts (like on a screen door). Prints could be laid flat to drain, with another screen on top to prohibit curl. I created a wooden rack under my counter, with grooves, that allowed me to slide in screens to stack in pairs. Jeff", "link": "https://www.l-camera-forum.com/topic/275528-my-new-darkroom-in-phuket-thailand/?tab=comments#comment-3336350", "origin": "L-forum", "suborigin": "275528-my-new-darkroom-in-phuket-thailand", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "mine were sold by zone vi, now defunct, but easily made. they were about 2x3 foot wide frames, about a half inch thick, with mesh screen inserts (like on a screen door). prints could be laid flat to drain, with another screen on top to prohibit curl. -----> i !!!  -----> created !!!  a wooden rack under my counter, with grooves, that allowed me to slide in screens to stack in pairs. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 106042, "year": "2017"}, {"autor": "Guest NEIL-D-WILLIAMS", "date": "2017-08-14 04:56:00", "content": "Mine were sold by Zone Vi, now defunct, but easily made. They were about 2x3 foot wide frames, about a half inch thick, with mesh screen inserts (like on a screen door). Prints could be laid flat to drain, with another screen on top to prohibit curl. I created a wooden rack under my counter, with grooves, that allowed me to slide in screens to stack in pairs. Jeff Something like this http://m.ebay.com/itm/KAISER-4048-PRINT-DRYING-RACK-FOR-PE-RC-PHOTO-PAPER-K4048-/191828225372?epid=1761603235&hash=item2ca9da6d5c%3Ag%3AlwMAAOSwoudW6ZgU&_trkparms=pageci%253A16a5e354-80ac-11e7-8d1b-74dbd180425c%257Cparentrq%253Adf14267e15d0aa4876e1c452ffffee1c%257Ciid%253A13I know it's to small but just trying to get my head around what it looks like Neil", "link": "https://www.l-camera-forum.com/topic/275528-my-new-darkroom-in-phuket-thailand/?tab=comments#comment-3336368", "origin": "L-forum", "suborigin": "275528-my-new-darkroom-in-phuket-thailand", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "mine were sold by zone vi, now defunct, but easily made. they were about 2x3 foot wide frames, about a half inch thick, with mesh screen inserts (like on a screen door). prints could be laid flat to drain, with another screen on top to prohibit curl. -----> i !!!  -----> created !!!  a wooden rack under my counter, with grooves, that allowed me to slide in screens to stack in pairs. jeff something like this http://m.ebay.com/itm/kaiser-4048-print-drying-rack-for-pe-rc-photo-paper-k4048-/191828225372?epid=1761603235&hash=item2ca9da6d5c%3ag%3alwmaaoswoudw6zgu&_trkparms=pageci%253a16a5e354-80ac-11e7-8d1b-74dbd180425c%257cparentrq%253adf14267e15d0aa4876e1c452ffffee1c%257ciid%253a13i know it's to small but just trying to get my head around what it looks like neil", "sortedWord": "None", "Identifyer": null, "identifyer": 106043, "year": "2017"}, {"autor": "walkingphotographer", "date": "2017-11-27 00:06:00", "content": " Hello Guys ! I'm a portrait and street photographer from Rome. Since my love story with the M system is now many years old, I decided few weeks ago to start a small leisure side project. I'm taking portraits of people I meet for work or fun holding one of my M cameras.This is the instagram account I created to share the pics: www.instagram.com/youandmym/ Thanks --img--  Eolo", "link": "https://www.l-camera-forum.com/topic/279245-you-and-my-m/?tab=comments#comment-3404527", "origin": "L-forum", "suborigin": "279245-you-and-my-m", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": " hello guys ! i'm a portrait and street photographer from rome. since my love story with the m system is now many years old, i decided few weeks ago to start a small leisure side project. -----> i !!! 'm taking portraits of people -----> i !!!  meet for work or fun holding one of my m cameras.this is the instagram account -----> i !!!  -----> created !!!  to share the pics: www.instagram.com/youandmym/ thanks --img--  eolo", "sortedWord": "None", "Identifyer": null, "identifyer": 114397, "year": "2017"}, {"autor": "plaidshirts", "date": "2017-04-12 13:59:00", "content": " Hello. My insatiable GAS has brought me to Leica M3 and M6 with a few lenses. I had been a longtime Canon user, now using Fujifilm for my digital photography. I've recently rediscovered film and have tried to get my hands on every iconic film cameras I've heard of growing up but was too poor to acquire, beginning with the Olympus OM-1. Since then I've bought, tried and sold about 50 film cameras from all the major players in the last century. From that I've narrowed it down to the cameras I absolutely love and will keep: Canon New F-1, Olympus OM4T, Nikonos V, Fujica ST801, Leica M3 and just in the last 2 weeks, the M6. Coming from the SLR world, there has been a bit of a learning curve using Leicas, but I see now why that name carries such a mystique. With SLR's it was always about capturing the moment in the easiest way possible. With Leicas, I feel like I'm creating art. I guess that's my point - Leicas, especially the M3, make me FEEL. I'm so glad I found these deals on eBay and CL (so lucky!) and honored to be part of this fraternity. Sincerely, Dan", "link": "https://www.l-camera-forum.com/topic/271299-hello-from-the-pacific-nw/?tab=comments#comment-3253468", "origin": "L-forum", "suborigin": "271299-hello-from-the-pacific-nw", "result": true, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": " hello. my insatiable gas has brought me to leica m3 and m6 with a few lenses. i had been a longtime canon user, now using fujifilm for my digital photography. i've recently rediscovered film and have tried to get my hands on every iconic film cameras i've heard of growing up but was too poor to acquire, beginning with the olympus om-1. since then i've bought, tried and sold about 50 film cameras from all the major players in the last century. from that i've narrowed it down to the cameras i absolutely love and will keep: canon new f-1, olympus om4t, nikonos v, fujica st801, leica m3 and just in the last 2 weeks, the m6. coming from the slr world, there has been a bit of a learning curve using leicas, but i see now why that name carries such a mystique. with slr's it was always about capturing the moment in the easiest way possible. with leicas, -----> i !!!  feel like -----> i !!! 'm -----> creating !!!  art. i guess that's my point - leicas, especially the m3, make me feel. i'm so glad i found these deals on ebay and cl (so lucky!) and honored to be part of this fraternity. sincerely, dan", "sortedWord": "None", "Identifyer": null, "identifyer": 114477, "year": "2017"}, {"autor": "Rangefinder", "date": "2017-01-05 10:04:00", "content": "Congrats. Are you taking it all on your motorcycle trip? I would at least put the lenses you're taking through some paces to ensure proper operation; otherwise the advice to stick to one lens initially makes sense. And unlike your film days, you'll need a storage and back-up plan for your files. Jeff Good morning, Jeff, Yes, sir, I'm taking the Leica with me. I'm going to familiarize myself with it long before I throw a leg over the scooter. Although I'll take the 28mm and the 90mm, the 50mm will be on the camera most of the time. As a long-time photographer, I'm pretty familiar with storing photos. When I travel, I take a little Mac Air with a 1TB hard drive. I create a folder and label it according to the trip and, then, use individual files within for each day's photos. When I get home, everything is transferred from the travel hard drive to one of the other externals. Heck, I even back those up to other drives. The camera should be in today. Getting antsy! Mike", "link": "https://www.l-camera-forum.com/topic/267503-new-guy-needs-advice-on-leica-purchase/page/3/?tab=comments#comment-3179395", "origin": "L-forum", "suborigin": "267503-new-guy-needs-advice-on-leica-purchase", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "congrats. are you taking it all on your motorcycle trip? i would at least put the lenses you're taking through some paces to ensure proper operation; otherwise the advice to stick to one lens initially makes sense. and unlike your film days, you'll need a storage and back-up plan for your files. jeff good morning, jeff, yes, sir, i'm taking the leica with me. i'm going to familiarize myself with it long before i throw a leg over the scooter. although i'll take the 28mm and the 90mm, the 50mm will be on the camera most of the time. as a long-time photographer, i'm pretty familiar with storing photos. when i travel, i take a little mac air with a 1tb hard drive. -----> i !!!  -----> create !!!  a folder and label it according to the trip and, then, use individual files within for each day's photos. when i get home, everything is transferred from the travel hard drive to one of the other externals. heck, i even back those up to other drives. the camera should be in today. getting antsy! mike", "sortedWord": "None", "Identifyer": null, "identifyer": 114588, "year": "2017"}, {"autor": "Guest NEIL-D-WILLIAMS", "date": "2017-09-08 21:57:00", "content": " I want to create a poll butt don't know how to do it....................can someone help me?? Neil", "link": "https://www.l-camera-forum.com/topic/276640-how-to-create-a-poll/?tab=comments#comment-3355035", "origin": "L-forum", "suborigin": "276640-how-to-create-a-poll", "result": true, "Selector": "i want to create", "selectorShort": "create", "MarkedSent": " -----> i !!!  -----> want !!!  -----> to !!!  -----> create !!!  a poll butt don't know how -----> to !!!  do it....................can someone help me?? neil", "sortedWord": "None", "Identifyer": null, "identifyer": 118462, "year": "2017"}, {"autor": "farnz", "date": "2017-06-26 19:13:00", "content": "This is not a question directed to Paulus who has already done such a good job in arranging everything: since some of us will be around on Friday night are there any plans to meet up for a bite to eat somewhere in Den Bosch? I expect to be arriving at just after 5pm and will be staying in the Golden Tulip near the centre so somewhere for a quick drink and something to eat at around 7 or 7.30 sounds like a nice idea. If anyone wants to keep in contact with me and doesn't already have my mobile number (which hasn't changed for 15 years or more) then please send me a PM and we can swap numbers. If you'd like to be included in a WhatsApp group so we can all keep in touch over the weekend then please let me know and PM me your mobile number and I'll create a group and add you to it. Pete.", "link": "https://www.l-camera-forum.com/topic/271704-netherlands-meeting-s-hertogenbosch/page/6/?tab=comments#comment-3303070", "origin": "L-forum", "suborigin": "271704-netherlands-meeting-s-hertogenbosch", "result": true, "Selector": "i'll create", "selectorShort": "create", "MarkedSent": "this is not a question directed to paulus who has already done such a good job in arranging everything: since some of us will be around on friday night are there any plans to meet up for a bite to eat somewhere in den bosch? i expect to be arriving at just after 5pm and will be staying in the golden tulip near the centre so somewhere for a quick drink and something to eat at around 7 or 7.30 sounds like a nice idea. if anyone wants to keep in contact with me and doesn't already have my mobile number (which hasn't changed for 15 years or more) then please send me a pm and we can swap numbers. if you'd like to be included in a whatsapp group so we can all keep in touch over the weekend then please let me know and pm me your mobile number and -----> i !!! -----> 'll !!!  -----> create !!!  a group and add you to it. pete.", "sortedWord": "None", "Identifyer": null, "identifyer": 131596, "year": "2017"}, {"autor": "christoph_d", "date": "2017-06-26 19:25:00", "content": "This is not a question directed to Paulus who has already done such a good job in arranging everything: since some of us will be around on Friday night are there any plans to meet up for a bite to eat somewhere in Den Bosch? I expect to be arriving at just after 5pm and will be staying in the Golden Tulip near the centre so somewhere for a quick drink and something to eat at around 7 or 7.30 sounds like a nice idea. If anyone wants to keep in contact with me and doesn't already have my mobile number (which hasn't changed for 15 years or more) then please send me a PM and we can swap numbers. If you'd like to be included in a WhatsApp group so we can all keep in touch over the weekend then please let me know and PM me your mobile number and I'll create a group and add you to it. Pete. Pete, Please include Veronique and I in the whatsapp group. Not yet sure about my availability on Friday evening, but sounds like a good idea. There are some great restaurants in Den Bosch! Rgds C.", "link": "https://www.l-camera-forum.com/topic/271704-netherlands-meeting-s-hertogenbosch/page/7/?tab=comments#comment-3303079", "origin": "L-forum", "suborigin": "271704-netherlands-meeting-s-hertogenbosch", "result": true, "Selector": "i'll create", "selectorShort": "create", "MarkedSent": "this is not a question directed to paulus who has already done such a good job in arranging everything: since some of us will be around on friday night are there any plans to meet up for a bite to eat somewhere in den bosch? i expect to be arriving at just after 5pm and will be staying in the golden tulip near the centre so somewhere for a quick drink and something to eat at around 7 or 7.30 sounds like a nice idea. if anyone wants to keep in contact with me and doesn't already have my mobile number (which hasn't changed for 15 years or more) then please send me a pm and we can swap numbers. if you'd like to be included in a whatsapp group so we can all keep in touch over the weekend then please let me know and pm me your mobile number and -----> i !!! -----> 'll !!!  -----> create !!!  a group and add you to it. pete. pete, please include veronique and i in the whatsapp group. not yet sure about my availability on friday evening, but sounds like a good idea. there are some great restaurants in den bosch! rgds c.", "sortedWord": "None", "Identifyer": null, "identifyer": 131598, "year": "2017"}, {"autor": "Sandokan", "date": "2017-06-26 22:48:00", "content": ".... If you'd like to be included in a WhatsApp group so we can all keep in touch over the weekend then please let me know and PM me your mobile number and I'll create a group and add you to it. Pete. Please include me in the Whatsapp group. But I may not arrive until late on Friday so will not promise to join you for a bite of food with lots of beer. --img--  Sent from my iPad using Tapatalk", "link": "https://www.l-camera-forum.com/topic/271704-netherlands-meeting-s-hertogenbosch/page/7/?tab=comments#comment-3303186", "origin": "L-forum", "suborigin": "271704-netherlands-meeting-s-hertogenbosch", "result": true, "Selector": "i'll create", "selectorShort": "create", "MarkedSent": ".... if you'd like to be included in a whatsapp group so we can all keep in touch over the weekend then please let me know and pm me your mobile number and -----> i !!! -----> 'll !!!  -----> create !!!  a group and add you to it. pete. please include me in the whatsapp group. but i may not arrive until late on friday so will not promise to join you for a bite of food with lots of beer. --img--  sent from my ipad using tapatalk", "sortedWord": "None", "Identifyer": null, "identifyer": 131599, "year": "2017"}, {"autor": "lanetomlane", "date": "2017-06-27 10:30:00", "content": "This is not a question directed to Paulus who has already done such a good job in arranging everything: since some of us will be around on Friday night are there any plans to meet up for a bite to eat somewhere in Den Bosch? I expect to be arriving at just after 5pm and will be staying in the Golden Tulip near the centre so somewhere for a quick drink and something to eat at around 7 or 7.30 sounds like a nice idea. If anyone wants to keep in contact with me and doesn't already have my mobile number (which hasn't changed for 15 years or more) then please send me a PM and we can swap numbers. If you'd like to be included in a WhatsApp group so we can all keep in touch over the weekend then please let me know and PM me your mobile number and I'll create a group and add you to it. Pete. Sounds like a plan to me Pete. We get off the ferry in Dunkirk around 1:00pm so expect to be there by five/six'ish. We're at the Best Western which is in the centre of town. I'll text you once we get there. Is it your round???? Cheers, Tom", "link": "https://www.l-camera-forum.com/topic/271704-netherlands-meeting-s-hertogenbosch/page/7/?tab=comments#comment-3303407", "origin": "L-forum", "suborigin": "271704-netherlands-meeting-s-hertogenbosch", "result": true, "Selector": "i'll create", "selectorShort": "create", "MarkedSent": "this is not a question directed to paulus who has already done such a good job in arranging everything: since some of us will be around on friday night are there any plans to meet up for a bite to eat somewhere in den bosch? i expect to be arriving at just after 5pm and will be staying in the golden tulip near the centre so somewhere for a quick drink and something to eat at around 7 or 7.30 sounds like a nice idea. if anyone wants to keep in contact with me and doesn't already have my mobile number (which hasn't changed for 15 years or more) then please send me a pm and we can swap numbers. if you'd like to be included in a whatsapp group so we can all keep in touch over the weekend then please let me know and pm me your mobile number and -----> i !!! -----> 'll !!!  -----> create !!!  a group and add you to it. pete. sounds like a plan to me pete. we get off the ferry in dunkirk around 1:00pm so expect to be there by five/six'ish. we're at the best western which is in the centre of town. i'll text you once we get there. is it your round???? cheers, tom", "sortedWord": "None", "Identifyer": null, "identifyer": 131600, "year": "2017"}, {"autor": "Bateleur", "date": "2017-06-29 14:21:00", "content": "This is not a question directed to Paulus who has already done such a good job in arranging everything: since some of us will be around on Friday night are there any plans to meet up for a bite to eat somewhere in Den Bosch? I expect to be arriving at just after 5pm and will be staying in the Golden Tulip near the centre so somewhere for a quick drink and something to eat at around 7 or 7.30 sounds like a nice idea. If anyone wants to keep in contact with me and doesn't already have my mobile number (which hasn't changed for 15 years or more) then please send me a PM and we can swap numbers. If you'd like to be included in a WhatsApp group so we can all keep in touch over the weekend then please let me know and PM me your mobile number and I'll create a group and add you to it. Pete. PM sent --img-- ", "link": "https://www.l-camera-forum.com/topic/271704-netherlands-meeting-s-hertogenbosch/page/8/?tab=comments#comment-3304737", "origin": "L-forum", "suborigin": "271704-netherlands-meeting-s-hertogenbosch", "result": true, "Selector": "i'll create", "selectorShort": "create", "MarkedSent": "this is not a question directed to paulus who has already done such a good job in arranging everything: since some of us will be around on friday night are there any plans to meet up for a bite to eat somewhere in den bosch? i expect to be arriving at just after 5pm and will be staying in the golden tulip near the centre so somewhere for a quick drink and something to eat at around 7 or 7.30 sounds like a nice idea. if anyone wants to keep in contact with me and doesn't already have my mobile number (which hasn't changed for 15 years or more) then please send me a pm and we can swap numbers. if you'd like to be included in a whatsapp group so we can all keep in touch over the weekend then please let me know and pm me your mobile number and -----> i !!! -----> 'll !!!  -----> create !!!  a group and add you to it. pete. pm sent --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 131625, "year": "2017"}, {"autor": "jaapv", "date": "2017-01-02 09:28:00", "content": "According to Leica the maximum voltage on the hot shoe is 600 Volts with the digital M cameras. I do not think that there is any flash that gets that high. There has not been a single report of Leica M electronics being damaged by trigger voltage over the last ten years. Let's not create any myths It all depends on what flash the guy in the video is using, and more specifically the trigger voltage of the flash he is using.Like Luke said, M8 can take up to 250 volts, so if the flash you intend to use on your M8 has a trigger voltage of no more than 250 volt you do not need to invest in a Wein Safe-Sync.There are a couple of places on the internet that provide trigger voltage information such as http://www.botzilla.com/photo/strobeVolts.html and http://dpanswers.com/roztr/volt_finder.php. Like anything internet use that information with caution. I always do my own measurement with a multi-meter. If a flash gets too close to the limit I'd place safe and not use it (or with a Wein Safe-sync).", "link": "https://www.l-camera-forum.com/topic/267838-flash-to-m8/?tab=comments#comment-3177373", "origin": "L-forum", "suborigin": "267838-flash-to-m8", "result": false, "Selector": "'s not create", "selectorShort": "create", "MarkedSent": "let's not create any myths it all depends on what flash the guy in the -----> video !!!  is using, and more specifically the trigger voltage of the flash he is using.like luke said, m8 can take up to 250 volts, so if the flash you intend to use on your m8 has a trigger voltage of no more than 250 volt you do not need to invest in a wein safe-sync.there are a couple of places on the internet that provide trigger voltage information such as http://www.botzilla.com/photo/strobevolts.html and http://dpanswers.com/roztr/volt_finder.php.", "sortedWord": "video", "Identifyer": null, "identifyer": 45638, "year": "2017"}, {"autor": "ramarren", "date": "2017-08-31 22:27:00", "content": " The iPad screen is what's giving you the crosshatch pattern. It's not designed to be an illuminant source. A flat-panel light box with LED or fluorescent light source is ideal for use with the BEOON. If you look at the base of the BEOON, it is designed to guide 35mm film with notches on both sides. But that means moving the unit each time you move a frame. What I do is create a channel using two pieces of thick paper (280 gsm printing paper works well), taping those down onto the light box at the width of the film, and then taping down a piece of thin, hardened glass on top of that. Be sure that all surfaces are scrupulously clean. Next, position a negative into the center of the mask and tape the BEOON down onto the glass. If you do this carefully, you can just feed your film strip in one end, emulsion side up, and gently pull it through for each frame. The framing and focus will not change and you can 'scan' an entire 36 exposure roll in a couple of minutes once the setup is done. BTW, I use the BEOON mostly for medium format scanning, using the same technique as above. I use a Macro-Elmarit-R 60mm lens fitted to the M-mount A ring with a Leica R Adapter M. This nets a great deal of range to fine-focus the target negative or slide. When capturing 6x6cm negatives, the BEOON has to be extended nearly to its limit with the 60mm lens, a little less so with a Micro-Nikkor 55mm. I can use either the BEOON loupe to focus and the M-D body to do the capture, or I can fit the SL body with an M Adapter L.", "link": "https://www.l-camera-forum.com/topic/276151-beoon-advice-please-functional-checks-prior-to-purchase/page/3/?tab=comments#comment-3349138", "origin": "L-forum", "suborigin": "276151-beoon-advice-please-functional-checks-prior-to-purchase", "result": false, "Selector": "i do is create", "selectorShort": "create", "MarkedSent": "what i do is create a channel using two pieces of thick paper (280 gsm printing paper works well), taping those down onto the light box at the width of the -----> film !!! , and then taping down a piece of thin, hardened glass on top of that.", "sortedWord": "film", "Identifyer": null, "identifyer": 98573, "year": "2017"}, {"autor": "Avatar", "date": "2017-08-31 23:44:00", "content": "The iPad screen is what's giving you the crosshatch pattern. It's not designed to be an illuminant source. A flat-panel light box with LED or fluorescent light source is ideal for use with the BEOON. If you look at the base of the BEOON, it is designed to guide 35mm film with notches on both sides. But that means moving the unit each time you move a frame. What I do is create a channel using two pieces of thick paper (280 gsm printing paper works well), taping those down onto the light box at the width of the film, and then taping down a piece of thin, hardened glass on top of that. Be sure that all surfaces are scrupulously clean. Next, position a negative into the center of the mask and tape the BEOON down onto the glass. If you do this carefully, you can just feed your film strip in one end, emulsion side up, and gently pull it through for each frame. The framing and focus will not change and you can 'scan' an entire 36 exposure roll in a couple of minutes once the setup is done. BTW, I use the BEOON mostly for medium format scanning, using the same technique as above. I use a Macro-Elmarit-R 60mm lens fitted to the M-mount A ring with a Leica R Adapter M. This nets a great deal of range to fine-focus the target negative or slide. When capturing 6x6cm negatives, the BEOON has to be extended nearly to its limit with the 60mm lens, a little less so with a Micro-Nikkor 55mm. I can use either the BEOON loupe to focus and the M-D body to do the capture, or I can fit the SL body with an M Adapter L. I figured it was the iPad and changed to another solution with a viewing light I forgot I had. No more cross hatch. So far, the results are not so great compared to the Epson 850. It's too early of course to be anything definitive. Focus might be part of it, the light source and then of course the Summarit lens. I have the negative sandwiched in between two medicine chest glass shelves. I will experiment with another way to do this as I have another idea to try! So it seems you focus first to set up with the Beoon lens? Maybe I am missing something but I don't see how the Beoon magnifier adjusts other than by moving the 'arm' up or down? Thanks for the comments! --img--  Edited September 1, 2017 by Avatar", "link": "https://www.l-camera-forum.com/topic/276151-beoon-advice-please-functional-checks-prior-to-purchase/page/3/?tab=comments#comment-3349160", "origin": "L-forum", "suborigin": "276151-beoon-advice-please-functional-checks-prior-to-purchase", "result": false, "Selector": "i do is create", "selectorShort": "create", "MarkedSent": "what i do is create a channel using two pieces of thick paper (280 gsm printing paper works well), taping those down onto the light box at the width of the -----> film !!! , and then taping down a piece of thin, hardened glass on top of that.", "sortedWord": "film", "Identifyer": null, "identifyer": 98575, "year": "2017"}, {"autor": "LUF Admin", "date": "2017-09-25 08:35:00", "content": "I'll try to explain...#1 Beliebteste Bilder (ohne Filter)- Images published over the last 30 days- In all categories and threads- Sorted by likes received over the last 14 days#2 Beliebteste Bilder (Nur Fotoforen, nur eigene Threads)- Images published over the last 30 days- Photo categories only, only images with own threads- Sorted by likes received over the last 14 days#3 Zufällige Bilder (3-10 Likes, aus den letzten 5 Tagen)- Images posted in the last 5 days- Having 3-10 likes over the last 14 days- Sorted by random#4 Neue Bilder (max 24h)- Images posted in the last 24 hours- Sorted by random Why these criteria? My goal with this page is not to create a kind of competition but to give a quick way to discover great and/or interesting images in the Leica Forum. It's trick to find the „right“ criteria thus I chose to start four sections: #1 shows the best current images with most likes As some threads have a lot of traffic and regular readers (like „Barnack's Monthly“ and „I like film“) I created the next section #2 shows images from the photo forums only with dedicated threads Both section show images which already received a lot of likes. In order to let you discover new and other interesting I created the other two sections: #3 shows „new and trending“ images who already received some likes and #4 shows new and completely random images All these sections change over the time What I didn't include is an „Alltime Best“ as this wouldn't change and only old images would show up. Good images but boring over the time --img--  Does that answer your questions? BTW: The current solution has some flaws: - It doesn't recognize quoted images - Some images aren't correctly scaled to thumbnails and show up as black images I know why this happens but would take too much time to fix. Thus I decided to ignore the German Engineer Part of my brain and to let it go --img--  Andreas", "link": "https://www.l-camera-forum.com/topic/275069-best-leica-forum-images-july-27th/page/4/?tab=comments#comment-3364796", "origin": "L-forum", "suborigin": "275069-best-leica-forum-images-july-27th", "result": false, "Selector": "i created", "selectorShort": "create", "MarkedSent": "it's trick to find the „right“ criteria thus i chose to start four sections: #1 shows the best current images with most likes as some threads have a lot of traffic and regular readers (like „barnack's monthly“ and „i like -----> film !!! “) i created the next section #2 shows images from the photo forums only with dedicated threads both section show images which already received a lot of likes.", "sortedWord": "film", "Identifyer": null, "identifyer": 118447, "year": "2017"}], "name": "Leicasortedout2017create"}