{"interestingcomments": [{"autor": "Wyck", "date": "2019-08-18 19:36:00", "content": "19 hours ago, oka said: I’m not sure what you mean with converted files but C1 doesn’t have M10P profile and generic one is way off from the M10 profile (with M10). This is major downside on C1 as I shoot with SL and M10P which has totally different colors. I solved my problem with creating generic profiles with Lumariver with great success. Your correct Oka. I also use C1 12 and noticed there isn't a profile for the M10P. A M10P file looks terrible colour wise when you try and use the M10 profile. I believe Bud is using the DNG Neutral profile. I'm not a fan of the DNG Neutral profile so I also created my own profiles using Lumariver. I have put in a support request to C1 for support of the M10P. I requested this when C1 11 was the current version late last year.", "link": "https://www.l-camera-forum.com/topic/297610-leica-m10-to-m10-p-conversion/page/8/?tab=comments#comment-3800748", "origin": "L-forum", "suborigin": "297610-leica-m10-to-m10-p-conversion", "result": true, "Selector": "i also created", "selectorShort": "create", "MarkedSent": "19 hours ago, oka said: i’m not sure what you mean with converted files but c1 doesn’t have m10p profile and generic one is way off from the m10 profile (with m10). this is major downside on c1 as i shoot with sl and m10p which has totally different colors. i solved my problem with creating generic profiles with lumariver with great success. your correct oka. i also use c1 12 and noticed there isn't a profile for the m10p. a m10p file looks terrible colour wise when you try and use the m10 profile. i believe bud is using the dng neutral profile. -----> i !!! 'm not a fan of the dng neutral profile so -----> i !!!  -----> also !!!  -----> created !!!  my own profiles using lumariver. i have put in a support request to c1 for support of the m10p. i requested this when c1 11 was the current version late last year.", "sortedWord": "None", "Identifyer": null, "identifyer": 8118, "year": "2019"}, {"autor": "rivi1969", "date": "2019-10-13 04:44:00", "content": " I decided to create a new topic just because I can’t thank enough for being part of this community. Thanks to Jono Slack who brought to our attention the Leica M9 refurbished program, and gave me a couple of very helpful hints in how to approach Leica Customer Service and expedite the process. Thanks to jdlaing who stood up and did the custom tax arrangement on my behalf; thanks to andyturk and Charadis who also offer me help on that matter. Thanks to David Stachan for his support and for sharing our passion for the wonderful M8 Looking forward to keep learning from all you guys. Sincerely, Ricardo Villagran --img-- ", "link": "https://www.l-camera-forum.com/topic/302358-thanks-to-this-community-i-got-my-dream-m9-p/?tab=comments#comment-3835048", "origin": "L-forum", "suborigin": "302358-thanks-to-this-community-i-got-my-dream-m9-p", "result": true, "Selector": "i decided to create", "selectorShort": "create", "MarkedSent": " -----> i !!!  -----> decided !!!  -----> to !!!  -----> create !!!  a new topic just because -----> i !!!  can’t thank enough for being part of this community. thanks to jono slack who brought to our attention the leica m9 refurbished program, and gave me a couple of very helpful hints in how to approach leica customer service and expedite the process. thanks to jdlaing who stood up and did the custom tax arrangement on my behalf; thanks to andyturk and charadis who also offer me help on that matter. thanks to david stachan for his support and for sharing our passion for the wonderful m8 looking forward to keep learning from all you guys. sincerely, ricardo villagran --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 34820, "year": "2019"}, {"autor": "digitalfx", "date": "2019-11-23 02:45:00", "content": "Found a work around for my specific need: I created a profile called Cine-4K/24 which has my Cine settings. Then I selected the Left FN button on top plate which switches to still mode and then adjusted all the settings to my preferred still settings and re-saved the profile. Now I can quickly switch between Cine and Still mode with all my setting intact on each side with a single button push. It’s actually a better solution than what I was attempting. But I still want to save a different function to the FN button next to evf.", "link": "https://www.l-camera-forum.com/topic/303719-sl2-fn-buttons/?tab=comments#comment-3859924", "origin": "L-forum", "suborigin": "303719-sl2-fn-buttons", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "found a work around for my specific need: -----> i !!!  -----> created !!!  a profile called cine-4k/24 which has my cine settings. then i selected the left fn button on top plate which switches to still mode and then adjusted all the settings to my preferred still settings and re-saved the profile. now i can quickly switch between cine and still mode with all my setting intact on each side with a single button push. it’s actually a better solution than what i was attempting. but i still want to save a different function to the fn button next to evf.", "sortedWord": "None", "Identifyer": null, "identifyer": 32486, "year": "2019"}, {"autor": "ramarren", "date": "2019-07-04 17:25:00", "content": "1 hour ago, Dave in Wales said: I'm very grateful to Ramarren for his patience and kindness in producing the examples that I requested. Playing around with FoV tables I have found an alternative set of examples. FoV tables.........https://www.nikonians.org/reviews/fov-tables....tell me that the FoV for an 18mm on a CL, DX format, is 76 degrees and that a 10mm is 109.20 degrees. Using.....https://imaging.nikon.com/lineup/lens/simulator/ just move the slider from form 76 to 109 degrees to see the difference in FoV. Don't worry about setting FX or DX just use the FoV angle. Now I'll sit back and wait for the flack I used this field of view calculator in my earlier response to you: http://www.mat.uc.pt/~rps/photos/angles.html Notice that the FULL FRAME APS-C stats I reported are the same as what you got out of the Nikon calculator. Salguiero's calculator has a lot more features but isn't as graphically oriented, and allowed me to also create the listing for these lenses fitted to SQUARE APS-C format.", "link": "https://www.l-camera-forum.com/topic/298369-a-mini-digital-swc-leica-cl-voigtl%C3%A4nder-10mm/page/3/?tab=comments#comment-3771678", "origin": "L-forum", "suborigin": "298369-a-mini-digital-swc-leica-cl-voigtl%C3%A4nder-10mm", "result": true, "Selector": "me to also create", "selectorShort": "create", "MarkedSent": "1 hour ago, dave in wales said: i'm very grateful to ramarren for his patience and kindness in producing the examples that i requested. playing around with fov tables i have found an alternative set of examples. fov tables.........https://www.nikonians.org/reviews/fov-tables....tell me that the fov for an 18mm on a cl, dx format, is 76 degrees and that a 10mm is 109.20 degrees. using.....https://imaging.nikon.com/lineup/lens/simulator/ just move the slider from form 76 to 109 degrees to see the difference in fov. don't worry about setting fx or dx just use the fov angle. now i'll sit back and wait for the flack i used this field of view calculator in my earlier response to you: http://www.mat.uc.pt/~rps/photos/angles.html notice that the full frame aps-c stats i reported are the same as what you got out of the nikon calculator. salguiero's calculator has a lot more features but isn't as graphically oriented, and allowed -----> me !!!  -----> to !!!  -----> also !!!  -----> create !!!  the listing for these lenses fitted -----> to !!!  square aps-c format.", "sortedWord": "None", "Identifyer": null, "identifyer": 39576, "year": "2019"}, {"autor": "LocalHero1953", "date": "2019-11-05 14:14:00", "content": "Summicron-SL 90. Oranges are not rendered accurately. The colours here should be more orange. I may have to create a dedicated profile till Adobe sorts one out. --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/303132-images-with-sigma-l-mount-cameras/?tab=comments#comment-3848221", "origin": "L-forum", "suborigin": "303132-images-with-sigma-l-mount-cameras", "result": true, "Selector": "i may have to create", "selectorShort": "create", "MarkedSent": "summicron-sl 90. oranges are not rendered accurately. the colours here should be more orange. -----> i !!!  -----> may !!!  -----> have !!!  -----> to !!!  -----> create !!!  a dedicated profile till adobe sorts one out. --img--  --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 46035, "year": "2019"}, {"autor": "Ingo", "date": "2019-04-12 08:59:00", "content": "During the beta test of the Q2 I created 'crop presets' for the Q2 dngs for 35mm, 50mm and 75mm. So in C1 I just had to apply the style to a photo to have it cropped. Of course this is just a workaround and I have to remember which crop I used for the photo but it's better than nothing. Anybody who want's to have the styles can drop me a PN and I will send them.", "link": "https://www.l-camera-forum.com/topic/296100-capture-one-and-leica-q2-crop-mode/?tab=comments#comment-3720822", "origin": "L-forum", "suborigin": "296100-capture-one-and-leica-q2-crop-mode", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "during the beta test of the q2 -----> i !!!  -----> created !!!  'crop presets' for the q2 dngs for 35mm, 50mm and 75mm. so in c1 i just had to apply the style to a photo to have it cropped. of course this is just a workaround and i have to remember which crop i used for the photo but it's better than nothing. anybody who want's to have the styles can drop me a pn and i will send them.", "sortedWord": "None", "Identifyer": null, "identifyer": 5121, "year": "2019"}, {"autor": "LeicaR10", "date": "2019-05-30 05:32:00", "content": "Dsauro, I personally own(ed) and use(d) for my professional landscape image work the Leica S2, 006 and 007, plus the X1-D and Fuji systems. I found my clients voted overwhelmingly with their wallets for images that I create with the S system. I found myself selling both the X1-D and Fuji systems simply because my clients and companies that buy my images didn't like the rendering or feeling. When I hike short distances for my landscapes, I take the S007 and several S lenses (age is a factor). But for long-distance hikes to remote locations, I pack and carry my M10-P system and a few lenses that I feel will meet my creative needs. Your genre of photography and preference for image rendering is a personal choice. For me and clients who purchase my images, they prefer my work with the Leica S or M systems. I find photographers who spend a lot of time dwelling on what camera to own might well be better off being concerned with creating photographs the make a person stop, look, think and perhaps feel, that moment in time they are attempting to capture. To me, the photograph that can do this is what photography is all about...not the number of MPs or the latest model of camera. r/ Mark", "link": "https://www.l-camera-forum.com/topic/297697-007-vs-hassy-x1-d/?tab=comments#comment-3750212", "origin": "L-forum", "suborigin": "297697-007-vs-hassy-x1-d", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "dsauro, i personally own(ed) and use(d) for my professional landscape image work the leica s2, 006 and 007, plus the x1-d and fuji systems. -----> i !!!  found my clients voted overwhelmingly with their wallets for images that -----> i !!!  -----> create !!!  with the s system. i found myself selling both the x1-d and fuji systems simply because my clients and companies that buy my images didn't like the rendering or feeling. when i hike short distances for my landscapes, i take the s007 and several s lenses (age is a factor). but for long-distance hikes to remote locations, i pack and carry my m10-p system and a few lenses that i feel will meet my creative needs. your genre of photography and preference for image rendering is a personal choice. for me and clients who purchase my images, they prefer my work with the leica s or m systems. i find photographers who spend a lot of time dwelling on what camera to own might well be better off being concerned with creating photographs the make a person stop, look, think and perhaps feel, that moment in time they are attempting to capture. to me, the photograph that can do this is what photography is all about...not the number of mps or the latest model of camera. r/ mark", "sortedWord": "None", "Identifyer": null, "identifyer": 25998, "year": "2019"}, {"autor": "dave.gt", "date": "2019-05-30 09:55:00", "content": "4 hours ago, LeicaR10 said: Dsauro, I personally own(ed) and use(d) for my professional landscape image work the Leica S2, 006 and 007, plus the X1-D and Fuji systems. I found my clients voted overwhelmingly with their wallets for images that I create with the S system. I found myself selling both the X1-D and Fuji systems simply because my clients and companies that buy my images didn't like the rendering or feeling. When I hike short distances for my landscapes, I take the S007 and several S lenses (age is a factor). But for long-distance hikes to remote locations, I pack and carry my M10-P system and a few lenses that I feel will meet my creative needs. Your genre of photography and preference for image rendering is a personal choice. For me and clients who purchase my images, they prefer my work with the Leica S or M systems. I find photographers who spend a lot of time dwelling on what camera to own might well be better off being concerned with creating photographs the make a person stop, look, think and perhaps feel, that moment in time they are attempting to capture. To me, the photograph that can do this is what photography is all about...not the number of MPs or the latest model of camera. r/ Mark Well, it's about time to hear from the silence a voice of honesty, and an individual mind. Thank you for your comments! Mark, I believe we have a lot in common and I think a lot of us who are not part of the group-think and prevalent gear trends are silenced by the sheer noise of gear mania. And that is unfortunate. There are few who want to be seen as contrary or not part of the crowd, but I have been that way all my life. Personally, I don't care what anyone uses to create their art. Unfortunately, there are many who don't consider their photography as art. However, they march to their own music as well. Just as the film v digital war still rages, gear wars are even worse it seems. My full-time exposure to Medium Fornat is only a few years, but I have found that I much prefer MF whether it be film or digital. My use of the H5D-50c has amazed me and my clients have appreciated the results as well. Gear selection is a personal thing with many ways to look at it. My preferences have nothing to do with smaller size and lighter weight. If I want snapshots, I always used my M or X1. But I appreciate, and prefer the quality and feel of heavier instruments like the M vs. lighter gear and I am delighted with the size, weight, quality, simplicity and results of both the S cameras and the H system. I am sure Phase One would be on my preferential gear list if I could afford even a used one. Everyone is different of course. For me, at the end of the day, did my gear provide me an experience, including gear aesthetics, that was pleasurable and did the results meet my expectations? My film cameras always have. The H system and the S system both fit my preferences like a well-tailored suit and are as comfortable as a favorite pair of jeans to me. And, the results always astonish me. Thanks again for your comments.! Edited May 30, 2019 by dave.gt", "link": "https://www.l-camera-forum.com/topic/297697-007-vs-hassy-x1-d/?tab=comments#comment-3750294", "origin": "L-forum", "suborigin": "297697-007-vs-hassy-x1-d", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "4 hours ago, leicar10 said: dsauro, i personally own(ed) and use(d) for my professional landscape image work the leica s2, 006 and 007, plus the x1-d and fuji systems. -----> i !!!  found my clients voted overwhelmingly with their wallets for images that -----> i !!!  -----> create !!!  with the s system. i found myself selling both the x1-d and fuji systems simply because my clients and companies that buy my images didn't like the rendering or feeling. when i hike short distances for my landscapes, i take the s007 and several s lenses (age is a factor). but for long-distance hikes to remote locations, i pack and carry my m10-p system and a few lenses that i feel will meet my creative needs. your genre of photography and preference for image rendering is a personal choice. for me and clients who purchase my images, they prefer my work with the leica s or m systems. i find photographers who spend a lot of time dwelling on what camera to own might well be better off being concerned with creating photographs the make a person stop, look, think and perhaps feel, that moment in time they are attempting to capture. to me, the photograph that can do this is what photography is all about...not the number of mps or the latest model of camera. r/ mark well, it's about time to hear from the silence a voice of honesty, and an individual mind. thank you for your comments! mark, i believe we have a lot in common and i think a lot of us who are not part of the group-think and prevalent gear trends are silenced by the sheer noise of gear mania. and that is unfortunate. there are few who want to be seen as contrary or not part of the crowd, but i have been that way all my life. personally, i don't care what anyone uses to create their art. unfortunately, there are many who don't consider their photography as art. however, they march to their own music as well. just as the film v digital war still rages, gear wars are even worse it seems. my full-time exposure to medium fornat is only a few years, but i have found that i much prefer mf whether it be film or digital. my use of the h5d-50c has amazed me and my clients have appreciated the results as well. gear selection is a personal thing with many ways to look at it. my preferences have nothing to do with smaller size and lighter weight. if i want snapshots, i always used my m or x1. but i appreciate, and prefer the quality and feel of heavier instruments like the m vs. lighter gear and i am delighted with the size, weight, quality, simplicity and results of both the s cameras and the h system. i am sure phase one would be on my preferential gear list if i could afford even a used one. everyone is different of course. for me, at the end of the day, did my gear provide me an experience, including gear aesthetics, that was pleasurable and did the results meet my expectations? my film cameras always have. the h system and the s system both fit my preferences like a well-tailored suit and are as comfortable as a favorite pair of jeans to me. and, the results always astonish me. thanks again for your comments.! edited may 30, 2019 by dave.gt", "sortedWord": "None", "Identifyer": null, "identifyer": 26001, "year": "2019"}, {"autor": "LeicaR10", "date": "2019-05-30 23:10:00", "content": "Jeff S, Your question is a good one. Perhaps the $5.00 Holga would suffice for my clients. For me, the Holga in my early young life, taught me creativity, vision and basic photographic skills were more important than an expensive camera. Unfortunately the Holga did have some limitations, like the faulty plastic lens that would fall out on occasion, a set f/8 stop and 2 shutter speeds (one I created by drilling the lens so I could make long exposures with the shutter). To answer your question about the Holga....I might just go buy one, as I might find my clients like the Holga landscape images because the way the unique plastic lens renders. Great idea...thanks! As for the Fuji and X1D, my clients simply didn't like how the images rendered. When I asked, my multiple clients would tell me they liked the image color, \"look\" and \"feeling\" much better with the Leica images. Client personal preferences are a driving factor for me as I found my Leica images sell and my X1D and Fuji images didn't sell any where near as well. Other photographers who use the X1D and Fuji might well have far different results. What my landscape images lacked taken with the X1D and Fuji systems, I fixed the problem by selling the systems and went back to the Leica S and M systems as my clients always vote with their wallets. r/ Mark PS I always enjoy reading your insightful comments. Edited May 30, 2019 by LeicaR10", "link": "https://www.l-camera-forum.com/topic/297697-007-vs-hassy-x1-d/?tab=comments#comment-3750683", "origin": "L-forum", "suborigin": "297697-007-vs-hassy-x1-d", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "jeff s, your question is a good one. perhaps the $5.00 holga would suffice for my clients. for me, the holga in my early young life, taught me creativity, vision and basic photographic skills were more important than an expensive camera. unfortunately the holga did have some limitations, like the faulty plastic lens that would fall out on occasion, a set f/8 stop and 2 shutter speeds (one -----> i !!!  -----> created !!!  by drilling the lens so -----> i !!!  could make long exposures with the shutter). to answer your question about the holga....i might just go buy one, as i might find my clients like the holga landscape images because the way the unique plastic lens renders. great idea...thanks! as for the fuji and x1d, my clients simply didn't like how the images rendered. when i asked, my multiple clients would tell me they liked the image color, \"look\" and \"feeling\" much better with the leica images. client personal preferences are a driving factor for me as i found my leica images sell and my x1d and fuji images didn't sell any where near as well. other photographers who use the x1d and fuji might well have far different results. what my landscape images lacked taken with the x1d and fuji systems, i fixed the problem by selling the systems and went back to the leica s and m systems as my clients always vote with their wallets. r/ mark ps i always enjoy reading your insightful comments. edited may 30, 2019 by leicar10", "sortedWord": "None", "Identifyer": null, "identifyer": 26004, "year": "2019"}, {"autor": "Jeff S", "date": "2019-05-31 00:30:00", "content": " 1 hour ago, LeicaR10 said: Jeff S, Your question is a good one. Perhaps the $5.00 Holga would suffice for my clients. For me, the Holga in my early young life, taught me creativity, vision and basic photographic skills were more important than an expensive camera. Unfortunately the Holga did have some limitations, like the faulty plastic lens that would fall out on occasion, a set f/8 stop and 2 shutter speeds (one I created by drilling the lens so I could make long exposures with the shutter). To answer your question about the Holga....I might just go buy one, as I might find my clients like the Holga landscape images because the way the unique plastic lens renders. Great idea...thanks! As for the Fuji and X1D, my clients simply didn't like how the images rendered. When I asked, my multiple clients would tell me they liked the image color, \"look\" and \"feeling\" much better with the Leica images. Client personal preferences are a driving factor for me as I found my Leica images sell and my X1D and Fuji images didn't sell any where near as well. Other photographers who use the X1D and Fuji might well have far different results. What my landscape images lacked taken with the X1D and Fuji systems, I fixed the problem by selling the systems and went back to the Leica S and M systems as my clients always vote with their wallets. r/ Mark PS I always enjoy reading your insightful comments. I wasn’t suggesting current use of a Holga, although that could be a fun and creative adventure! But I was serious concerning your early learnings, including that PP and printing skills can be critical in terms of the end product. I would have thought that with the X1D, for instance, careful color management, custom profiling and a disciplined PP workflow could lead to similarly stellar prints (color and appeal) as with the S, despite any out-of-camera/lens differences. The point was that while the Holga was a ‘toy’, the X1D (and Fuji) are superb modern tools, most of which by top manufacturers aren’t IQ limited these days. But I guess that comes dangerously close to the often debated question as to whether there is a ‘Leica look’. For me, the answer is no, as the user still controls too many important variables, from picture taking to final print display. Otherwise, we’d all produce similar results. Jeff Edited May 31, 2019 by Jeff S", "link": "https://www.l-camera-forum.com/topic/297697-007-vs-hassy-x1-d/page/2/?tab=comments#comment-3750703", "origin": "L-forum", "suborigin": "297697-007-vs-hassy-x1-d", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": " 1 hour ago, leicar10 said: jeff s, your question is a good one. perhaps the $5.00 holga would suffice for my clients. for me, the holga in my early young life, taught me creativity, vision and basic photographic skills were more important than an expensive camera. unfortunately the holga did have some limitations, like the faulty plastic lens that would fall out on occasion, a set f/8 stop and 2 shutter speeds (one -----> i !!!  -----> created !!!  by drilling the lens so -----> i !!!  could make long exposures with the shutter). to answer your question about the holga....i might just go buy one, as i might find my clients like the holga landscape images because the way the unique plastic lens renders. great idea...thanks! as for the fuji and x1d, my clients simply didn't like how the images rendered. when i asked, my multiple clients would tell me they liked the image color, \"look\" and \"feeling\" much better with the leica images. client personal preferences are a driving factor for me as i found my leica images sell and my x1d and fuji images didn't sell any where near as well. other photographers who use the x1d and fuji might well have far different results. what my landscape images lacked taken with the x1d and fuji systems, i fixed the problem by selling the systems and went back to the leica s and m systems as my clients always vote with their wallets. r/ mark ps i always enjoy reading your insightful comments. i wasn’t suggesting current use of a holga, although that could be a fun and creative adventure! but i was serious concerning your early learnings, including that pp and printing skills can be critical in terms of the end product. i would have thought that with the x1d, for instance, careful color management, custom profiling and a disciplined pp workflow could lead to similarly stellar prints (color and appeal) as with the s, despite any out-of-camera/lens differences. the point was that while the holga was a ‘toy’, the x1d (and fuji) are superb modern tools, most of which by top manufacturers aren’t iq limited these days. but i guess that comes dangerously close to the often debated question as to whether there is a ‘leica look’. for me, the answer is no, as the user still controls too many important variables, from picture taking to final print display. otherwise, we’d all produce similar results. jeff edited may 31, 2019 by jeff s", "sortedWord": "None", "Identifyer": null, "identifyer": 26006, "year": "2019"}, {"autor": "LeicaR10", "date": "2019-05-31 04:15:00", "content": "Jeff S, The use of the Holga in class taught me a lot about the very things you mentioned above. First, using ones creativity and inspiration to capture the moment in time, then processing the negatives and finally the print(s). The professor and teaching assistants were most helpful in instructing how to best get the end state of prints. Even though the camera itself had limitations, the negative and printing technique became ones personal expression of what was seen and created. It was a excellent teaching moment that lasted throughout my life whether it be the darkroom or later Light Room. Admittedly, the X1D and Fuji systems for me as an early user was limited by the availability of lenses, software bugs to a small degree, etc.. I did try various color management techniques and profiling in hopes of finding a solution to my clients criticism of the look and feel of the images. It finally dawned on me, the clients had become accustomed to a \"look\" and \"feel\" they liked. I was thinking that I could with time, get images they would buy for their collections. From my experience, I misjudged my clients tastes and thoughts. I was hesitant to go back to the Leica systems mainly due to the expense. I did like the smaller, lighter X1D, but those factors don't create the image....just keeps my muscles more happy. Ultimately, I moved back to the Leica S and M systems and my clients resumed purchasing for their collections. Last, I couldn't agree with you more about the debate of the Leica look and variables involved. Some say they can see and feel it...others not so much, if at all. If anything, I think my clients felt they liked the consistency of the \"look\" and \"feel\" of what they see in my images. Perhaps had I stayed with the other systems, in time I could have done the same thing. But for me and what the private collectors and clients purchase, I find it easier for me to convey my thoughts, creative vision in a medium they have grown accustomed too and ultimately buy. For me, the bottomline, if I can create an image with content that causes a person to stop, look, think and perhaps feel a moment in time...then I created a very good photograph that makes my client and me happy. r/ Mark Edited May 31, 2019 by LeicaR10", "link": "https://www.l-camera-forum.com/topic/297697-007-vs-hassy-x1-d/page/2/?tab=comments#comment-3750756", "origin": "L-forum", "suborigin": "297697-007-vs-hassy-x1-d", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "jeff s, the use of the holga in class taught me a lot about the very things you mentioned above. first, using ones creativity and inspiration to capture the moment in time, then processing the negatives and finally the print(s). the professor and teaching assistants were most helpful in instructing how to best get the end state of prints. even though the camera itself had limitations, the negative and printing technique became ones personal expression of what was seen and created. it was a excellent teaching moment that lasted throughout my life whether it be the darkroom or later light room. admittedly, the x1d and fuji systems for me as an early user was limited by the availability of lenses, software bugs to a small degree, etc.. i did try various color management techniques and profiling in hopes of finding a solution to my clients criticism of the look and feel of the images. it finally dawned on me, the clients had become accustomed to a \"look\" and \"feel\" they liked. i was thinking that i could with time, get images they would buy for their collections. from my experience, i misjudged my clients tastes and thoughts. i was hesitant to go back to the leica systems mainly due to the expense. i did like the smaller, lighter x1d, but those factors don't create the image....just keeps my muscles more happy. ultimately, i moved back to the leica s and m systems and my clients resumed purchasing for their collections. last, i couldn't agree with you more about the debate of the leica look and variables involved. some say they can see and feel it...others not so much, if at all. if anything, i think my clients felt they liked the consistency of the \"look\" and \"feel\" of what they see in my images. perhaps had i stayed with the other systems, in time i could have done the same thing. but for me and what the private collectors and clients purchase, i find it easier for me to convey my thoughts, creative vision in a medium they have grown accustomed too and ultimately buy. for me, the bottomline, if -----> i !!!  -----> can !!!  -----> create !!!  an image with content that causes a person to stop, look, think and perhaps feel a moment in time...then i created a very good photograph that makes my client and me happy. r/ mark edited may 31, 2019 by leicar10", "sortedWord": "None", "Identifyer": null, "identifyer": 26007, "year": "2019"}, {"autor": "Peter_S", "date": "2019-06-15 20:39:00", "content": "Am 30.5.2019 um 07:32 schrieb LeicaR10: Dsauro, I personally own(ed) and use(d) for my professional landscape image work the Leica S2, 006 and 007, plus the X1-D and Fuji systems. I found my clients voted overwhelmingly with their wallets for images that I create with the S system. I found myself selling both the X1-D and Fuji systems simply because my clients and companies that buy my images didn't like the rendering or feeling. When I hike short distances for my landscapes, I take the S007 and several S lenses (age is a factor). But for long-distance hikes to remote locations, I pack and carry my M10-P system and a few lenses that I feel will meet my creative needs. Your genre of photography and preference for image rendering is a personal choice. For me and clients who purchase my images, they prefer my work with the Leica S or M systems. I find photographers who spend a lot of time dwelling on what camera to own might well be better off being concerned with creating photographs the make a person stop, look, think and perhaps feel, that moment in time they are attempting to capture. To me, the photograph that can do this is what photography is all about...not the number of MPs or the latest model of camera. r/ Mark I own none of the two, but I wonder...can it be that this has more to do with the aspect ratio than anything else? I find 4:3 quite different from 3:2. (That is one of the reason that kept me from buying the M-Monochrom...I find 3:2 just not quite right for all my B/W photography).", "link": "https://www.l-camera-forum.com/topic/297697-007-vs-hassy-x1-d/page/3/?tab=comments#comment-3760218", "origin": "L-forum", "suborigin": "297697-007-vs-hassy-x1-d", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "am 30.5.2019 um 07:32 schrieb leicar10: dsauro, i personally own(ed) and use(d) for my professional landscape image work the leica s2, 006 and 007, plus the x1-d and fuji systems. -----> i !!!  found my clients voted overwhelmingly with their wallets for images that -----> i !!!  -----> create !!!  with the s system. i found myself selling both the x1-d and fuji systems simply because my clients and companies that buy my images didn't like the rendering or feeling. when i hike short distances for my landscapes, i take the s007 and several s lenses (age is a factor). but for long-distance hikes to remote locations, i pack and carry my m10-p system and a few lenses that i feel will meet my creative needs. your genre of photography and preference for image rendering is a personal choice. for me and clients who purchase my images, they prefer my work with the leica s or m systems. i find photographers who spend a lot of time dwelling on what camera to own might well be better off being concerned with creating photographs the make a person stop, look, think and perhaps feel, that moment in time they are attempting to capture. to me, the photograph that can do this is what photography is all about...not the number of mps or the latest model of camera. r/ mark i own none of the two, but i wonder...can it be that this has more to do with the aspect ratio than anything else? i find 4:3 quite different from 3:2. (that is one of the reason that kept me from buying the m-monochrom...i find 3:2 just not quite right for all my b/w photography).", "sortedWord": "None", "Identifyer": null, "identifyer": 26033, "year": "2019"}, {"autor": "LeicaR10", "date": "2019-08-24 04:35:00", "content": "Yudafu2, I have owned/own the S system cameras since 2009. I currently use the S007 for my pro landscape work and have many of the S lenses (4+ years). Like you, I tried the Fuji and Hasselblad X1D and associated lenses mainly because I wanted to take the medium format cameras on long-distance and remote hikes. I found my clients did not like the rendering of either the Fuji or Hasselblad systems and they voted with their wallets. It wasn't a color management, etc., that was the issue, it is simply the way the Leica S lenses draw. So, I sold the other systems and I went back to the S007 system and my clients are happy. As far as sensor of the other cameras, that did not play a factor for me. It is always photograph content that is key to separating a mere photo from a photograph that makes a person; Stop, Look, Think and if possible Feel, with feeling being the most difficult IMO to convey. As for the shutter being better, Yes it is better than previous S cameras. But for my work, I always use a tripod and don't handhold the camera. I have written other posts here on the S blog about my experience with the other systems and going back to the S. Personally, I like the user interface of the S and other Leica cameras too; i.e., simple and intuitive. It always gets down to two things anyways...shutter speed and f/stop the rest IMO is gravy. A drawback for me, the S camera weight became an issue for me hiking 20-30 KM a day in mountains at my age to be challenging. What I did to resolve my hiking/camera weight issue was to use the S camera for short distance hikes 0-10 KM and take S lenses that I think will help me create the photographs that I envision. I use the SL system for the long-distance hikes and M system for really challenging remote hikes. For me and my clients, the S system is superb and at least I have alternatives as well with the SL and M to help me get to the places I need to go to capture that moment in time. Hope this helps. r/ Mark Edited August 24, 2019 by LeicaR10", "link": "https://www.l-camera-forum.com/topic/300639-seeking-long-term-user-experiences-with-on-the-s007/?tab=comments#comment-3804701", "origin": "L-forum", "suborigin": "300639-seeking-long-term-user-experiences-with-on-the-s007", "result": true, "Selector": "me create", "selectorShort": "create", "MarkedSent": "yudafu2, i have owned/own the s system cameras since 2009. i currently use the s007 for my pro landscape work and have many of the s lenses (4+ years). like you, i tried the fuji and hasselblad x1d and associated lenses mainly because i wanted to take the medium format cameras on long-distance and remote hikes. i found my clients did not like the rendering of either the fuji or hasselblad systems and they voted with their wallets. it wasn't a color management, etc., that was the issue, it is simply the way the leica s lenses draw. so, i sold the other systems and i went back to the s007 system and my clients are happy. as far as sensor of the other cameras, that did not play a factor for me. it is always photograph content that is key to separating a mere photo from a photograph that makes a person; stop, look, think and if possible feel, with feeling being the most difficult imo to convey. as for the shutter being better, yes it is better than previous s cameras. but for my work, i always use a tripod and don't handhold the camera. i have written other posts here on the s blog about my experience with the other systems and going back to the s. personally, i like the user interface of the s and other leica cameras too; i.e., simple and intuitive. it always gets down to two things anyways...shutter speed and f/stop the rest imo is gravy. a drawback for me, the s camera weight became an issue for me hiking 20-30 km a day in mountains at my age to be challenging. what i did to resolve my hiking/camera weight issue was to use the s camera for short distance hikes 0-10 km and take s lenses that i think will help -----> me !!!  -----> create !!!  the photographs that i envision. i use the sl system for the long-distance hikes and m system for really challenging remote hikes. for me and my clients, the s system is superb and at least i have alternatives as well with the sl and m to help me get to the places i need to go to capture that moment in time. hope this helps. r/ mark edited august 24, 2019 by leicar10", "sortedWord": "None", "Identifyer": null, "identifyer": 29746, "year": "2019"}, {"autor": "Ernest", "date": "2019-08-14 18:41:00", "content": "23 hours ago, Steve Ricoh said: I find this image really plays with my vision and attention, flicking around but always following the pathway, but I guess you planned it that way. Thanks, Steve, for the comment because I was experimenting with the idea of the depth in a photograph, the illusion of 3-D and the fallibility of images in memory, even documented in a photograph. So, I wanted to create depth using the pedestrian image of a tree (black-and-white, full frame) and a related image, actually in color with shadow branches that mimic the black-and-white photo frame shot. The abstract arrangement echoes a view camera construction, perhaps a Linhof Technikardan. I am looking for ways to challenge the tyranny of the rectangle and this is what leads me to fragmented images. Cheers, Rog 🎬", "link": "https://www.l-camera-forum.com/topic/290225-diptychs-triptychs-and-polytychs-open-thread/page/9/?tab=comments#comment-3797789", "origin": "L-forum", "suborigin": "290225-diptychs-triptychs-and-polytychs-open-thread", "result": true, "Selector": "i wanted to create", "selectorShort": "create", "MarkedSent": "23 hours ago, steve ricoh said: i find this image really plays with my vision and attention, flicking around but always following the pathway, but i guess you planned it that way. thanks, steve, for the comment because i was experimenting with the idea of the depth in a photograph, the illusion of 3-d and the fallibility of images in memory, even documented in a photograph. so, -----> i !!!  -----> wanted !!!  -----> to !!!  -----> create !!!  depth using the pedestrian image of a tree (black-and-white, full frame) and a related image, actually in color with shadow branches that mimic the black-and-white photo frame shot. the abstract arrangement echoes a view camera construction, perhaps a linhof technikardan. i am looking for ways to challenge the tyranny of the rectangle and this is what leads me to fragmented images. cheers, rog 🎬", "sortedWord": "None", "Identifyer": null, "identifyer": 63944, "year": "2019"}, {"autor": "hockey44", "date": "2019-12-06 17:20:00", "content": " Good day, Please forgive this \"stupid\" question-- but i am stumped. I have about 1tb of photos in LR6 (Leica M240 and Q2). I have been 'lazy' and the images were stored on my MacBook Pro (and multiple backups). I finally bought a RAID drive and large additional back-up. I have copied my \"main image library\" (which has all my LR6 folders) to the RAID (which I can see as well). However, when I go to LR6 on my MacBook and click \"+\" on the folders and select the connected RAID it sees the copied \"Main Image library\" however I don't seem to be able to access the photos. (I have NOT deleted any of the photos yet from the laptop). I had assumed the LR6 catalog will remain on the laptop and by going to \"Folder\" and adding the RAID it would see the photos? I did not \"Move\" the photos using LR but rather manually simply copied this large library in multiple steps so it would not get hung up as I have read can happen sometimes when trying to move large libraries. I should add, within my \"Main Image library\" the subfolders are numeric (1000 series 2015, 2000+ 2016 etc.). It it helps I could send a screen shot as I can see the hierarchy of the folders but they are greyed out -- so I can see there must be some connectivity but not sure why the photos aren't accessible? Do I need to create Smart Profiles (I have not)? Do I need to wait for some time to allow the entire 1tb of photos to load? I have lots of photos to download and need to remove the existing folders (hence the external RAID) but stuck. Watched a few videos but it isn't clicking for me. Any thoughts greatly appreciated! Thanks", "link": "https://www.l-camera-forum.com/topic/304194-lightroom-external-drive-question/?tab=comments#comment-3868571", "origin": "L-forum", "suborigin": "304194-lightroom-external-drive-question", "result": true, "Selector": "i need to create", "selectorShort": "create", "MarkedSent": " good day, please forgive this \"stupid\" question-- but i am stumped. i have about 1tb of photos in lr6 (leica m240 and q2). i have been 'lazy' and the images were stored on my macbook pro (and multiple backups). i finally bought a raid drive and large additional back-up. i have copied my \"main image library\" (which has all my lr6 folders) to the raid (which i can see as well). however, when i go to lr6 on my macbook and click \"+\" on the folders and select the connected raid it sees the copied \"main image library\" however i don't seem to be able to access the photos. (i have not deleted any of the photos yet from the laptop). i had assumed the lr6 catalog will remain on the laptop and by going to \"folder\" and adding the raid it would see the photos? i did not \"move\" the photos using lr but rather manually simply copied this large library in multiple steps so it would not get hung up as i have read can happen sometimes when trying to move large libraries. i should add, within my \"main image library\" the subfolders are numeric (1000 series 2015, 2000+ 2016 etc.). it it helps i could send a screen shot as i can see the hierarchy of the folders but they are greyed out -- so i can see there must be some connectivity but not sure why the photos aren't accessible? do -----> i !!!  -----> need !!!  -----> to !!!  -----> create !!!  smart profiles (-----> i !!!  have not)? do i need to wait for some time to allow the entire 1tb of photos to load? i have lots of photos to download and need to remove the existing folders (hence the external raid) but stuck. watched a few videos but it isn't clicking for me. any thoughts greatly appreciated! thanks", "sortedWord": "None", "Identifyer": null, "identifyer": 91158, "year": "2019"}, {"autor": "pridbor", "date": "2019-12-02 00:54:00", "content": "Here are 2 examples from my B&W testing with my \"new found companion\" the M7. I'm in particular focusing on my adult daughter's face as I find it a bit grainy. I re-scanned the negatives after I created the post to be sure that I didn't accidentally have some kind of filtering set, so this is directly from the Epson V600 Photo scanner using Epsons Scan tool. I also tried to scan in Color and tiff but didn't see any difference so I stayed with the B&W 16 bit jpg scanned at 3200 to the same size as the negative. The whole purpose with my question about prints, was to compare the results from the darkroom paper prints against the outcome of prints from my scanned images, to find out how much of the \"grain\" in the image was a digital noise vs film grain. I assume that that topic has been dealt with in another post maybe? BTW the Film was an Ilford XP2 iso 400. I was also wondering how one can tell how grainy a given file is such that one can buy the proper one? Just by experience or is there a table one can look up in? As you can tell I'm new, again, to film but I love it so far! THANKs to you all for taking the time to respond with those long explanations which I cherish! Preben --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/303951-prints-from-film-anymore/?tab=comments#comment-3865688", "origin": "L-forum", "suborigin": "303951-prints-from-film-anymore", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "here are 2 examples from my b&w testing with my \"new found companion\" the m7. i'm in particular focusing on my adult daughter's face as i find it a bit grainy. -----> i !!!  re-scanned the negatives after -----> i !!!  -----> created !!!  the post to be sure that -----> i !!!  didn't accidentally have some kind of filtering set, so this is directly from the epson v600 photo scanner using epsons scan tool. i also tried to scan in color and tiff but didn't see any difference so i stayed with the b&w 16 bit jpg scanned at 3200 to the same size as the negative. the whole purpose with my question about prints, was to compare the results from the darkroom paper prints against the outcome of prints from my scanned images, to find out how much of the \"grain\" in the image was a digital noise vs film grain. i assume that that topic has been dealt with in another post maybe? btw the film was an ilford xp2 iso 400. i was also wondering how one can tell how grainy a given file is such that one can buy the proper one? just by experience or is there a table one can look up in? as you can tell i'm new, again, to film but i love it so far! thanks to you all for taking the time to respond with those long explanations which i cherish! preben --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 102161, "year": "2019"}, {"autor": "jmahto", "date": "2019-04-19 03:45:00", "content": "Well, I did few more experiments with TMax400 and Tri-X for myself. This time pushing the films in DD-X(1+4) (that's all I have). I ended up liking Tri-X pushed to 3200. It seems if I do want landscapes then I am better off with fine grain like Tmax100 and if I want high speed casual/portrait kind of effect then pushed Tri-X is better for me. See below. Therefore for the time being Tri-x is for me over Tmax400. As a fun experiment I tried to duplicate this look from M240 digital. I could create the contrasty look in LR but can't simulate the same grittiness in grain. Leica IIIc/f, 50 Summitar, Tri-X pushed to 3200 (DD-X(1+4), 15:30 min at 22c) Full pic and 1:1 zoom for the grain Say hello to Lonzo --img--  --img--  Edited April 19, 2019 by jmahto", "link": "https://www.l-camera-forum.com/topic/294528-tmax-400-more-preferred-than-tri-x-among-leica-users/page/3/?tab=comments#comment-3725222", "origin": "L-forum", "suborigin": "294528-tmax-400-more-preferred-than-tri-x-among-leica-users", "result": true, "Selector": "i could create", "selectorShort": "create", "MarkedSent": "well, i did few more experiments with tmax400 and tri-x for myself. this time pushing the films in dd-x(1+4) (that's all i have). i ended up liking tri-x pushed to 3200. it seems if i do want landscapes then i am better off with fine grain like tmax100 and if i want high speed casual/portrait kind of effect then pushed tri-x is better for me. see below. therefore for the time being tri-x is for me over tmax400. as a fun experiment i tried to duplicate this look from m240 digital. -----> i !!!  -----> could !!!  -----> create !!!  the contrasty look in lr but can't simulate the same grittiness in grain. leica iiic/f, 50 summitar, tri-x pushed to 3200 (dd-x(1+4), 15:30 min at 22c) full pic and 1:1 zoom for the grain say hello to lonzo --img--  --img--  edited april 19, 2019 by jmahto", "sortedWord": "None", "Identifyer": null, "identifyer": 102719, "year": "2019"}, {"autor": "ELAN", "date": "2019-12-22 14:55:00", "content": " Like many others here I am done with Adobe and trying out Capture One 20. Three issues are holding me back from switching to C1, perhaps someone here can show me the light. 1. No M10-P profile. The Generic Profile is under-saturated and flat, the M10 profile is over-saturated and too contrasty. Neither are a good starting point. Perhaps someone can share their M10-P profile? 2. How do I Import from SD card into a Catalog and have date-based album hierarchies created just like in LR. I managed to create date-based folders on disk, but not “albums” under User Collections. How do I get albums created automatically on import like those created temporarily under “Recent Imports”? 3. All my finished work is published to Smugmug. With the LR plug-in it’s very convenient to publish, especially when older photos are retouched and re-published with one click. For those using Smugmug, what is your publishing workflow on Capture One? Thanks in advance for any and all help.", "link": "https://www.l-camera-forum.com/topic/304654-help-switching-from-lr-to-capture-one/?tab=comments#comment-3877696", "origin": "L-forum", "suborigin": "304654-help-switching-from-lr-to-capture-one", "result": true, "Selector": "i managed to create", "selectorShort": "create", "MarkedSent": " like many others here i am done with adobe and trying out capture one 20. three issues are holding me back from switching to c1, perhaps someone here can show me the light. 1. no m10-p profile. the generic profile is under-saturated and flat, the m10 profile is over-saturated and too contrasty. neither are a good starting point. perhaps someone can share their m10-p profile? 2. how do i import from sd card into a catalog and have date-based album hierarchies created just like in lr. -----> i !!!  -----> managed !!!  -----> to !!!  -----> create !!!  date-based folders on disk, but not “albums” under user collections. how do i get albums created automatically on import like those created temporarily under “recent imports”? 3. all my finished work is published to smugmug. with the lr plug-in it’s very convenient to publish, especially when older photos are retouched and re-published with one click. for those using smugmug, what is your publishing workflow on capture one? thanks in advance for any and all help.", "sortedWord": "None", "Identifyer": null, "identifyer": 112555, "year": "2019"}, {"autor": "rim_light", "date": "2019-12-26 12:22:00", "content": "On 12/22/2019 at 3:55 PM, ELAN said: 2. How do I Import from SD card into a Catalog and have date-based album hierarchies created just like in LR. I managed to create date-based folders on disk, but not “albums” under User Collections. How do I get albums created automatically on import like those created temporarily under “Recent Imports”? Don't know if you did know this, but you can create date-based folders just without thinking about it. Pls have a look at the first screenshot. In the second screenshot you can see, that there are date-based folders at the catalog view provided. Or you choose the filter the choose the date you want (screenshot 3) Don't know if that helps you. --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/304654-help-switching-from-lr-to-capture-one/?tab=comments#comment-3879776", "origin": "L-forum", "suborigin": "304654-help-switching-from-lr-to-capture-one", "result": true, "Selector": "i managed to create", "selectorShort": "create", "MarkedSent": "on 12/22/2019 at 3:55 pm, elan said: 2. how do i import from sd card into a catalog and have date-based album hierarchies created just like in lr. -----> i !!!  -----> managed !!!  -----> to !!!  -----> create !!!  date-based folders on disk, but not “albums” under user collections. how do i get albums created automatically on import like those created temporarily under “recent imports”? don't know if you did know this, but you can create date-based folders just without thinking about it. pls have a look at the first screenshot. in the second screenshot you can see, that there are date-based folders at the catalog view provided. or you choose the filter the choose the date you want (screenshot 3) don't know if that helps you. --img-- --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 112557, "year": "2019"}, {"autor": "ELAN", "date": "2019-12-28 08:39:00", "content": "On 12/26/2019 at 2:22 PM, rim_light said: ...you can create date-based folders... Thanks of your reply. Yes, I am creating date folders on disk as you show. What I want is to create date-based Albums in the User Collection when importing. And as Lightroom does it, I'd like for multiple date albums to be created when the card has images from consecutive dates. So if I return from an awesome trip and have 3 days of images the following Albums would be created on import: 2019-12-24 Awesome trip 2019-12-25 Awesome trip 2019-12-26 Awesome trip --img-- ", "link": "https://www.l-camera-forum.com/topic/304654-help-switching-from-lr-to-capture-one/?tab=comments#comment-3880796", "origin": "L-forum", "suborigin": "304654-help-switching-from-lr-to-capture-one", "result": true, "Selector": "i am creating", "selectorShort": "create", "MarkedSent": "on 12/26/2019 at 2:22 pm, rim_light said: ...you can create date-based folders... thanks of your reply. yes, -----> i !!!  -----> am !!!  -----> creating !!!  date folders on disk as you show. what i want is to create date-based albums in the user collection when importing. and as lightroom does it, i'd like for multiple date albums to be created when the card has images from consecutive dates. so if i return from an awesome trip and have 3 days of images the following albums would be created on import: 2019-12-24 awesome trip 2019-12-25 awesome trip 2019-12-26 awesome trip --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 112558, "year": "2019"}, {"autor": "jaapv", "date": "2019-12-28 10:19:00", "content": "On 12/22/2019 at 3:55 PM, ELAN said: Like many others here I am done with Adobe and trying out Capture One 20. Three issues are holding me back from switching to C1, perhaps someone here can show me the light. 1. No M10-P profile. The Generic Profile is under-saturated and flat, the M10 profile is over-saturated and too contrasty. Neither are a good starting point. Perhaps someone can share their M10-P profile? 2. How do I Import from SD card into a Catalog and have date-based album hierarchies created just like in LR. I managed to create date-based folders on disk, but not “albums” under User Collections. How do I get albums created automatically on import like those created temporarily under “Recent Imports”? 3. All my finished work is published to Smugmug. With the LR plug-in it’s very convenient to publish, especially when older photos are retouched and re-published with one click. For those using Smugmug, what is your publishing workflow on Capture One? Thanks in advance for any and all help. I cannot understand why people who dislike the Adobe subscription model do not switch to Photoshop Elements, which is basically Lightroom in a different skin and a purchased licence. It avoids cumbersome learning curves and the need to relearn postprocessing in for instance C1, which I never could mesh with. There are other LR-like programs as well, like ON1.", "link": "https://www.l-camera-forum.com/topic/304654-help-switching-from-lr-to-capture-one/?tab=comments#comment-3880831", "origin": "L-forum", "suborigin": "304654-help-switching-from-lr-to-capture-one", "result": true, "Selector": "i managed to create", "selectorShort": "create", "MarkedSent": "on 12/22/2019 at 3:55 pm, elan said: like many others here i am done with adobe and trying out capture one 20. three issues are holding me back from switching to c1, perhaps someone here can show me the light. 1. no m10-p profile. the generic profile is under-saturated and flat, the m10 profile is over-saturated and too contrasty. neither are a good starting point. perhaps someone can share their m10-p profile? 2. how do i import from sd card into a catalog and have date-based album hierarchies created just like in lr. -----> i !!!  -----> managed !!!  -----> to !!!  -----> create !!!  date-based folders on disk, but not “albums” under user collections. how do i get albums created automatically on import like those created temporarily under “recent imports”? 3. all my finished work is published to smugmug. with the lr plug-in it’s very convenient to publish, especially when older photos are retouched and re-published with one click. for those using smugmug, what is your publishing workflow on capture one? thanks in advance for any and all help. i cannot understand why people who dislike the adobe subscription model do not switch to photoshop elements, which is basically lightroom in a different skin and a purchased licence. it avoids cumbersome learning curves and the need to relearn postprocessing in for instance c1, which i never could mesh with. there are other lr-like programs as well, like on1.", "sortedWord": "None", "Identifyer": null, "identifyer": 112559, "year": "2019"}, {"autor": "frame-it", "date": "2019-12-28 11:10:00", "content": "2 hours ago, ELAN said: Thanks of your reply. Yes, I am creating date folders on disk as you show. What I want is to create date-based Albums in the User Collection when importing. And as Lightroom does it, I'd like for multiple date albums to be created when the card has images from consecutive dates. So if I return from an awesome trip and have 3 days of images the following Albums would be created on import: 2019-12-24 Awesome trip 2019-12-25 Awesome trip 2019-12-26 Awesome trip https://www.azuloxworkshops.com/educational/capture-one/capture-one-catalogs-vs-sessions/", "link": "https://www.l-camera-forum.com/topic/304654-help-switching-from-lr-to-capture-one/?tab=comments#comment-3880855", "origin": "L-forum", "suborigin": "304654-help-switching-from-lr-to-capture-one", "result": true, "Selector": "i am creating", "selectorShort": "create", "MarkedSent": "2 hours ago, elan said: thanks of your reply. yes, -----> i !!!  -----> am !!!  -----> creating !!!  date folders on disk as you show. what i want is to create date-based albums in the user collection when importing. and as lightroom does it, i'd like for multiple date albums to be created when the card has images from consecutive dates. so if i return from an awesome trip and have 3 days of images the following albums would be created on import: 2019-12-24 awesome trip 2019-12-25 awesome trip 2019-12-26 awesome trip https://www.azuloxworkshops.com/educational/capture-one/capture-one-catalogs-vs-sessions/", "sortedWord": "None", "Identifyer": null, "identifyer": 112566, "year": "2019"}, {"autor": "rim_light", "date": "2019-12-28 12:18:00", "content": "3 hours ago, ELAN said: Thanks of your reply. Yes, I am creating date folders on disk as you show. What I want is to create date-based Albums in the User Collection when importing. And as Lightroom does it, I'd like for multiple date albums to be created when the card has images from consecutive dates. So if I return from an awesome trip and have 3 days of images the following Albums would be created on import: 2019-12-24 Awesome trip 2019-12-25 Awesome trip 2019-12-26 Awesome trip There are several options. Maybe it's the easiest way to make an intelligent album with all picture within the dates. Another way is to make an album and choose at import the albumname. --img-- ", "link": "https://www.l-camera-forum.com/topic/304654-help-switching-from-lr-to-capture-one/?tab=comments#comment-3880885", "origin": "L-forum", "suborigin": "304654-help-switching-from-lr-to-capture-one", "result": true, "Selector": "i am creating", "selectorShort": "create", "MarkedSent": "3 hours ago, elan said: thanks of your reply. yes, -----> i !!!  -----> am !!!  -----> creating !!!  date folders on disk as you show. what i want is to create date-based albums in the user collection when importing. and as lightroom does it, i'd like for multiple date albums to be created when the card has images from consecutive dates. so if i return from an awesome trip and have 3 days of images the following albums would be created on import: 2019-12-24 awesome trip 2019-12-25 awesome trip 2019-12-26 awesome trip there are several options. maybe it's the easiest way to make an intelligent album with all picture within the dates. another way is to make an album and choose at import the albumname. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 112569, "year": "2019"}, {"autor": "Wyck", "date": "2019-12-28 12:48:00", "content": "13 minutes ago, rim_light said: There are several options. Maybe it's the easiest way to make an intelligent album with all picture within the dates. Another way is to make an album and choose at import the albumname. --img--  I've just been looking at this too. The only problem here for Elan is you have to create the album first and I think the request is for the album to be generated from the dates of the files on import. Here is a link to a C1 support page with instructions on what rim_light has posted. https://support.captureone.com/hc/en-us/articles/360002515558-Adding-images-to-a-Collection-on-import I have various catalogues for projects. I also have a standard catalogue for each year for all my general rubbish I tend to photograph that doesn't fit into one of my long term projects. I've created a template catalogue that contains smart albums that have a generic name that I rename for the catalogues purpose. So for example I will start a new catalogue any day now for 2020, this will be built around my template - File | New Catalog and I will then select the template I have made that I use for all new catalogs. See image below of a catalog for my dog called Boozer. So when I go through my images and colour tag them they appear in the relevant colour graded smart album. --img--  I hope this helps and sorry if this is very basic, it's just the way I've been using C1.", "link": "https://www.l-camera-forum.com/topic/304654-help-switching-from-lr-to-capture-one/?tab=comments#comment-3880897", "origin": "L-forum", "suborigin": "304654-help-switching-from-lr-to-capture-one", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "13 minutes ago, rim_light said: there are several options. maybe it's the easiest way to make an intelligent album with all picture within the dates. another way is to make an album and choose at import the albumname. --img--  i've just been looking at this too. the only problem here for elan is you have to create the album first and i think the request is for the album to be generated from the dates of the files on import. here is a link to a c1 support page with instructions on what rim_light has posted. https://support.captureone.com/hc/en-us/articles/360002515558-adding-images-to-a-collection-on-import i have various catalogues for projects. i also have a standard catalogue for each year for all my general rubbish i tend to photograph that doesn't fit into one of my long term projects. -----> i !!! 've -----> created !!!  a template catalogue that contains smart albums that have a generic name that -----> i !!!  rename for the catalogues purpose. so for example i will start a new catalogue any day now for 2020, this will be built around my template - file | new catalog and i will then select the template i have made that i use for all new catalogs. see image below of a catalog for my dog called boozer. so when i go through my images and colour tag them they appear in the relevant colour graded smart album. --img--  i hope this helps and sorry if this is very basic, it's just the way i've been using c1.", "sortedWord": "None", "Identifyer": null, "identifyer": 112570, "year": "2019"}, {"autor": "evenise", "date": "2019-12-06 21:27:00", "content": "On 12/1/2019 at 4:51 PM, reynoldsyoung said: Have any of you folks tried Luminar 4 from Skylum software? Way fun! Several issues...like importing and printing...but, the editing is really easy and quite dramatic. Your thoughts??? I use it and like it since the first version. The only BIG problem is that the colour/saturation you see when in luminar itself is not what you get when going back to Photoshop. I created a profile with settings that I know will give me the \"final\" result I need when back in Photoshop (with a calibrated screen with Spider Elite) That way, no \"bad\" surprises. But that weakness of Luminar is still a huge problem, not at all pro.", "link": "https://www.l-camera-forum.com/topic/304030-luminar-4/?tab=comments#comment-3868738", "origin": "L-forum", "suborigin": "304030-luminar-4", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "on 12/1/2019 at 4:51 pm, reynoldsyoung said: have any of you folks tried luminar 4 from skylum software? way fun! several issues...like importing and printing...but, the editing is really easy and quite dramatic. your thoughts??? i use it and like it since the first version. the only big problem is that the colour/saturation you see when in luminar itself is not what you get when going back to photoshop. -----> i !!!  -----> created !!!  a profile with settings that -----> i !!!  know will give me the \"final\" result -----> i !!!  need when back in photoshop (with a calibrated screen with spider elite) that way, no \"bad\" surprises. but that weakness of luminar is still a huge problem, not at all pro.", "sortedWord": "None", "Identifyer": null, "identifyer": 112664, "year": "2019"}, {"autor": "NZDavid", "date": "2019-08-16 06:25:00", "content": "Editing or post-processing? I delete surplus pics as I go along, it saves a lot of time. When I get home I sort them and label them. I also create a selection of email res copies to send people.", "link": "https://www.l-camera-forum.com/topic/300319-edit-on-the-go-or-wait-to-get-home/page/2/?tab=comments#comment-3798703", "origin": "L-forum", "suborigin": "300319-edit-on-the-go-or-wait-to-get-home", "result": true, "Selector": "i also create", "selectorShort": "create", "MarkedSent": "editing or post-processing? i delete surplus pics as i go along, it saves a lot of time. when i get home i sort them and label them. -----> i !!!  -----> also !!!  -----> create !!!  a selection of email res copies to send people.", "sortedWord": "None", "Identifyer": null, "identifyer": 112929, "year": "2019"}, {"autor": "Stephen_C", "date": "2019-05-09 14:05:00", "content": "5 hours ago, rob_w said: In what form do you keep the photo in your picture library afterwards? I do not, as standard practice, create a separate image from the original RAW (DNG) file. I may find a picture using Photo Mechanic Plus (the new version that contains the catalogue features) but would then view it in Capture One. I use Photo Mechanic Plus merely to label and keyword my photos—and to find them later if I need to (because Photo Mechanic Plus is much more efficient at doing that than is Capture One). Occasionally I'll create a jpeg using Capture One—for posting on here or for sending to a friend, for example. However, I emphasise that I do not routinely create a TIFF file of each processed DNG. Stephen", "link": "https://www.l-camera-forum.com/topic/295660-a-replacement-for-lightroom/page/2/?tab=comments#comment-3737610", "origin": "L-forum", "suborigin": "295660-a-replacement-for-lightroom", "result": true, "Selector": "i'll create", "selectorShort": "create", "MarkedSent": "5 hours ago, rob_w said: in what form do you keep the photo in your picture library afterwards? i do not, as standard practice, create a separate image from the original raw (dng) file. i may find a picture using photo mechanic plus (the new version that contains the catalogue features) but would then view it in capture one. i use photo mechanic plus merely to label and keyword my photos—and to find them later if i need to (because photo mechanic plus is much more efficient at doing that than is capture one). occasionally -----> i !!! -----> 'll !!!  -----> create !!!  a jpeg using capture one—for posting on here or for sending to a friend, for example. however, i emphasise that i do not routinely create a tiff file of each processed dng. stephen", "sortedWord": "None", "Identifyer": null, "identifyer": 113133, "year": "2019"}, {"autor": "ChateauMonty", "date": "2019-07-11 22:59:00", "content": "I have just discovered that my newly acquired Adobe Photoshop Lightroom Ver 2.3 (the one I have) does not, apparently, allow me to create TIFF files (which I need when sending pics to my agent). Or to watermark files, or set profiles for eg my www, FB, Insta or agent. You can see my due diligence is A1. I hate the fact I cannot see file names in the main grid and only on the side menu. Imagine if the same principle applied on the restaurant menu? Side salad and fizzy water on the main menu. Steak tartare, cassoulet and foie gras tucked away in a side menu hidden behind the bar. I hate the fact it uploads everything to the cloud before you can even think about deleting the unusable images. If it ain't broke, don't fix it! Going back to the old caveman version I have on my old caveman iMac powered by kindly elves. Do not think I can face having to learn Capture One from scratch. Unless....", "link": "https://www.l-camera-forum.com/topic/295660-a-replacement-for-lightroom/page/4/?tab=comments#comment-3776490", "origin": "L-forum", "suborigin": "295660-a-replacement-for-lightroom", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "i have just discovered that my newly acquired adobe photoshop lightroom ver 2.3 (the one i have) does not, apparently, allow -----> me !!!  -----> to !!!  -----> create !!!  tiff files (which i need when sending pics -----> to !!!  my agent). or to watermark files, or set profiles for eg my www, fb, insta or agent. you can see my due diligence is a1. i hate the fact i cannot see file names in the main grid and only on the side menu. imagine if the same principle applied on the restaurant menu? side salad and fizzy water on the main menu. steak tartare, cassoulet and foie gras tucked away in a side menu hidden behind the bar. i hate the fact it uploads everything to the cloud before you can even think about deleting the unusable images. if it ain't broke, don't fix it! going back to the old caveman version i have on my old caveman imac powered by kindly elves. do not think i can face having to learn capture one from scratch. unless....", "sortedWord": "None", "Identifyer": null, "identifyer": 113156, "year": "2019"}, {"autor": "Jeff S", "date": "2019-07-11 23:15:00", "content": "14 minutes ago, ChateauMonty said: I have just discovered that my newly acquired Adobe Photoshop Lightroom Ver 2.3 (the one I have) does not, apparently, allow me to create TIFF files (which I need when sending pics to my agent). Or to watermark files, or set profiles for eg my www, FB, Insta or agent. You can see my due diligence is A1. I hate the fact I cannot see file names in the main grid and only on the side menu. Imagine if the same principle applied on the restaurant menu? Side salad and fizzy water on the main menu. Steak tartare, cassoulet and foie gras tucked away in a side menu hidden behind the bar. I hate the fact it uploads everything to the cloud before you can even think about deleting the unusable images. If it ain't broke, don't fix it! Going back to the old caveman version I have on my old caveman iMac powered by kindly elves. Do not think I can face having to learn Capture One from scratch. Unless.... Switch to Lightroom Classic. Same great features and control interface as prior perpetual LR license version. Jeff", "link": "https://www.l-camera-forum.com/topic/295660-a-replacement-for-lightroom/page/4/?tab=comments#comment-3776514", "origin": "L-forum", "suborigin": "295660-a-replacement-for-lightroom", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "14 minutes ago, chateaumonty said: i have just discovered that my newly acquired adobe photoshop lightroom ver 2.3 (the one i have) does not, apparently, allow -----> me !!!  -----> to !!!  -----> create !!!  tiff files (which i need when sending pics -----> to !!!  my agent). or to watermark files, or set profiles for eg my www, fb, insta or agent. you can see my due diligence is a1. i hate the fact i cannot see file names in the main grid and only on the side menu. imagine if the same principle applied on the restaurant menu? side salad and fizzy water on the main menu. steak tartare, cassoulet and foie gras tucked away in a side menu hidden behind the bar. i hate the fact it uploads everything to the cloud before you can even think about deleting the unusable images. if it ain't broke, don't fix it! going back to the old caveman version i have on my old caveman imac powered by kindly elves. do not think i can face having to learn capture one from scratch. unless.... switch to lightroom classic. same great features and control interface as prior perpetual lr license version. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 113157, "year": "2019"}, {"autor": "marchyman", "date": "2019-06-01 03:24:00", "content": "Wikipedia says a new release of Capture One has come out every November since 2014. If the above upgrade prices are typical it a little bit more expensive than Adobe's photo package of Photoshop plus Lighroom. To my mind the cost difference is not an issue. Especially since you don't have to upgrade. More important (to me) is the current lack of the equivalent of Lightroom CC for mobile devices that can sync with my desktop. That and the fact that when playing with a 30 day trial Capture One refused to read a catalog file I'd created the day before. That kind of turned me off even though I thought the editing features were better than Lighroom.", "link": "https://www.l-camera-forum.com/topic/297727-save-15-on-capture-one-pro-limited-time-offer/?tab=comments#comment-3751263", "origin": "L-forum", "suborigin": "297727-save-15-on-capture-one-pro-limited-time-offer", "result": true, "Selector": "i'd created", "selectorShort": "create", "MarkedSent": "wikipedia says a new release of capture one has come out every november since 2014. if the above upgrade prices are typical it a little bit more expensive than adobe's photo package of photoshop plus lighroom. to my mind the cost difference is not an issue. especially since you don't have to upgrade. more important (to me) is the current lack of the equivalent of lightroom cc for mobile devices that can sync with my desktop. that and the fact that when playing with a 30 day trial capture one refused to read a catalog file -----> i !!! -----> 'd !!!  -----> created !!!  the day before. that kind of turned me off even though i thought the editing features were better than lighroom.", "sortedWord": "None", "Identifyer": null, "identifyer": 113275, "year": "2019"}, {"autor": "ramarren", "date": "2019-05-15 13:51:00", "content": "Not having a Q2 and having Lightroom 6.14 (perpetual license), my first assumption is that the CCP (camera calibration profile) is either not there or not optimized for the Q2. That means LR is processing the DNG file using the in-built DNG profile, which in my experience has been off and produces garish colors on various Leica cameras I've used. Before LR was updated with better profiles for my M-P240, SL, and CL bodies, I used the Xrite color checker and Passport software to create better CCPs: that gives a more balanced color rendering as a default. Once LR had been updated with the Adobe standard based CCP for these cameras, the default color rendering was fine and I no longer needed the custom profiles I'd created.", "link": "https://www.l-camera-forum.com/topic/297292-lightroom-q2-raw-problems/?tab=comments#comment-3741112", "origin": "L-forum", "suborigin": "297292-lightroom-q2-raw-problems", "result": true, "Selector": "i'd created", "selectorShort": "create", "MarkedSent": "not having a q2 and having lightroom 6.14 (perpetual license), my first assumption is that the ccp (camera calibration profile) is either not there or not optimized for the q2. that means lr is processing the dng file using the in-built dng profile, which in my experience has been off and produces garish colors on various leica cameras i've used. before lr was updated with better profiles for my m-p240, sl, and cl bodies, i used the xrite color checker and passport software to create better ccps: that gives a more balanced color rendering as a default. once lr had been updated with the adobe standard based ccp for these cameras, the default color rendering was fine and -----> i !!!  no longer needed the custom profiles -----> i !!! -----> 'd !!!  -----> created !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 113344, "year": "2019"}, {"autor": "digger1914", "date": "2019-05-08 21:32:00", "content": "I also created my own profile for my M10 P. For some reason C1 have not updated their software to recognise the existence of a camera that has been around for over six months. So this means that it assigns the generic DNG profile to photos. How hard would it be for them to assign the M10 profile to the P and D variants that use the same sensor? FWIW I used Lumariver to create mine. It has worked very well!", "link": "https://www.l-camera-forum.com/topic/297020-colors-too-saturated-w-m10-presets-on-capture-one/?tab=comments#comment-3737235", "origin": "L-forum", "suborigin": "297020-colors-too-saturated-w-m10-presets-on-capture-one", "result": true, "Selector": "i also created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> also !!!  -----> created !!!  my own profile for my m10 p. for some reason c1 have not updated their software to recognise the existence of a camera that has been around for over six months. so this means that it assigns the generic dng profile to photos. how hard would it be for them to assign the m10 profile to the p and d variants that use the same sensor? fwiw i used lumariver to create mine. it has worked very well!", "sortedWord": "None", "Identifyer": null, "identifyer": 113415, "year": "2019"}, {"autor": "SiriusLux", "date": "2019-01-16 19:56:00", "content": "So, last night I succeeded to upgrade Lightroom to Lightroom 6. That means I did not have to buy a new license, I opted for the permanent upgrade at 73,78 €. It was not an easy find on their website, neither was it easy to install etc. Quite tricky, but it worked. As they recommended I had to create a new ID.", "link": "https://www.l-camera-forum.com/topic/292932-how-to-upgrade-from-lr5-to-lr6-in-2019/page/2/?tab=comments#comment-3665753", "origin": "L-forum", "suborigin": "292932-how-to-upgrade-from-lr5-to-lr6-in-2019", "result": true, "Selector": "i had to create", "selectorShort": "create", "MarkedSent": "so, last night i succeeded to upgrade lightroom to lightroom 6. that means i did not have to buy a new license, i opted for the permanent upgrade at 73,78 €. it was not an easy find on their website, neither was it easy to install etc. quite tricky, but it worked. as they recommended -----> i !!!  -----> had !!!  -----> to !!!  -----> create !!!  a new -----> i !!! d.", "sortedWord": "None", "Identifyer": null, "identifyer": 113730, "year": "2019"}, {"autor": "itsmebanky", "date": "2019-10-23 02:17:00", "content": " Hi All! I joined in August 2019, not too long ago. I finally started posting very recently and I noticed a few things: 1) I was only able to post once a day 2) this 1 post required approval from someone 3) when I create a post, there is a purple triangle next to the post 4) i suspect when I create a new post, my post is hidden and requires approval 5) can someone please help tell me how I can remove all these restrictions? I've poured over the rules and all over the forum but so far I have no clue how I can become a regular member and lift my 1 post per day restriction. 6) I purchased a lightly used M10-P and paired it with a used 35 Summilux. From what I can tell, my lens is the 12504 version, and I have no idea what the means. I sold my Canon 5D Mark IV and 6 L Lenses for this 1 body. All of that gear is not cover the addition of a lens. I mainly shoot mostly when I travel and I have a feeling my photographs are going to come back with a very different feeling after this next trip I'm going on next week. Hope to share and learn more with you all in the coming weeks. Thanks! Edited October 23, 2019 by itsmebanky", "link": "https://www.l-camera-forum.com/topic/302658-hello-new-forum-member-need-help/?tab=comments#comment-3840663", "origin": "L-forum", "suborigin": "302658-hello-new-forum-member-need-help", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": " hi all! i joined in august 2019, not too long ago. -----> i !!!  finally started posting very recently and -----> i !!!  noticed a few things: 1) -----> i !!!  was only able to post once a day 2) this 1 post required approval from someone 3) when -----> i !!!  -----> create !!!  a post, there is a purple triangle next to the post 4) -----> i !!!  suspect when -----> i !!!  -----> create !!!  a new post, my post is hidden and requires approval 5) can someone please help tell me how -----> i !!!  can remove all these restrictions? i've poured over the rules and all over the forum but so far i have no clue how i can become a regular member and lift my 1 post per day restriction. 6) i purchased a lightly used m10-p and paired it with a used 35 summilux. from what i can tell, my lens is the 12504 version, and i have no idea what the means. i sold my canon 5d mark iv and 6 l lenses for this 1 body. all of that gear is not cover the addition of a lens. i mainly shoot mostly when i travel and i have a feeling my photographs are going to come back with a very different feeling after this next trip i'm going on next week. hope to share and learn more with you all in the coming weeks. thanks! edited october 23, 2019 by itsmebanky", "sortedWord": "None", "Identifyer": null, "identifyer": 114093, "year": "2019"}, {"autor": "ramarren", "date": "2019-03-04 04:28:00", "content": "Never saw the note by Andreas ... I certainly don't read every post on this, or any other, site.. What stupidity has the EU foisted upon us now? I'll go hunt for his post. I'm sure it will irritate me and raise my blood pressure. Whatever the reason, reducing a photo forum to the same level as the photo email list that I created in 1991 is just insipidly ridiculous. Might as well toss the notion of a photo forum completely and go back to text-only emails. And, btw, I live in the USA and have absolutely no voice or influence in the politics of the EU. I have little enough in the USA.. 😶 Edited March 4, 2019 by ramarren", "link": "https://www.l-camera-forum.com/topic/294823-no-upload-sunday/?tab=comments#comment-3694825", "origin": "L-forum", "suborigin": "294823-no-upload-sunday", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "never saw the note by andreas ... i certainly don't read every post on this, or any other, site.. what stupidity has the eu foisted upon us now? i'll go hunt for his post. i'm sure it will irritate me and raise my blood pressure. whatever the reason, reducing a photo forum to the same level as the photo email list that -----> i !!!  -----> created !!!  in 1991 is just insipidly ridiculous. might as well toss the notion of a photo forum completely and go back to text-only emails. and, btw, i live in the usa and have absolutely no voice or influence in the politics of the eu. i have little enough in the usa.. 😶 edited march 4, 2019 by ramarren", "sortedWord": "None", "Identifyer": null, "identifyer": 117635, "year": "2019"}, {"autor": "PhotoCruiser", "date": "2019-12-05 13:12:00", "content": " I work on a Windows 10 workstation laptop. One of the SSD disks is only for photos and videos and the directory structure looks like this G://photos/year/country/20190625+location/xyz.dng's 20190625location is file name made of date YYYYMMDD and place or motiv where i took the pictures 1° I create e new directory in the correct folder 2° Photos get copied in the new folder 3° Lightroom import photos and store them in the catalogue stored in the same year folder as i have one Lightroom Cataloge for each year as more years in one folder make it too sluggish 4° Exported photos go in other client folders but always in the same year directory Probably ols school MS-Dos behaviour, but thats the way i can find the photos even after years as i usually remeber where and/or what year i took the photo Chris Edited December 5, 2019 by PhotoCruiser", "link": "https://www.l-camera-forum.com/topic/17530-workflow-examples/page/6/?tab=comments#comment-3867775", "origin": "L-forum", "suborigin": "17530-workflow-examples", "result": false, "Selector": "i create", "selectorShort": "create", "MarkedSent": "one of the ssd disks is only for photos and -----> videos !!!  and the directory structure looks like this g://photos/year/country/20190625+location/xyz.dng's 20190625location is file name made of date yyyymmdd and place or motiv where i took the pictures 1° i create e new directory in the correct folder 2° photos get copied in the new folder 3° lightroom import photos and store them in the catalogue stored in the same year folder as i have one lightroom cataloge for each year as more years in one folder make it too sluggish 4° exported photos go in other client folders but always in the same year directory probably ols school ms-dos behaviour, but thats the way i can find the photos even after years as i usually remeber where and/or what year i took the photo chris edited december 5, 2019 by photocruiser", "sortedWord": "video", "Identifyer": null, "identifyer": 111487, "year": "2019"}, {"autor": "Wyck", "date": "2019-12-22 11:39:00", "content": "5 hours ago, Patrickxyz said: At one point in the video, he „imports“ a tone curve from a Canon5D profile. Which tone curve have you used at that step? Have you imported a M10 tone curve? Are there any other peculiarities you would emphasize in creating the M10P profile? Thanks, Patrick I just watched the video again to remind myself as it was over a year ago that I created my profiles. I think it's the part at 6 minutes into the video that you refer to. Yes I just used the LeicaM10-Generic curve. Capture One support came back to me the other day with the following response to my further request for M10P support in version 20 with the following: \"Implementation of camera support by the R&D department can indeed take some time. But as I see, multiple requests have already been sent in regards to the camera support in question. Hereby, its release should be expected soon.\" I requested support of the M10P whilst version 11 was current and again when version 12 was released. Hopefully one day!", "link": "https://www.l-camera-forum.com/topic/304349-no-m10-p-support-in-capture-one-20/?tab=comments#comment-3877577", "origin": "L-forum", "suborigin": "304349-no-m10-p-support-in-capture-one-20", "result": false, "Selector": "i created", "selectorShort": "create", "MarkedSent": "thanks, patrick i just watched the -----> video !!!  again to remind myself as it was over a year ago that i created my profiles.", "sortedWord": "video", "Identifyer": null, "identifyer": 111836, "year": "2019"}, {"autor": "Patrickxyz", "date": "2019-12-22 12:01:00", "content": "vor 19 Minuten schrieb Wyck: I just watched the video again to remind myself as it was over a year ago that I created my profiles. I think it's the part at 6 minutes into the video that you refer to. Yes I just used the LeicaM10-Generic curve. Capture One support came back to me the other day with the following response to my further request for M10P support in version 20 with the following: \"Implementation of camera support by the R&D department can indeed take some time. But as I see, multiple requests have already been sent in regards to the camera support in question. Hereby, its release should be expected soon.\" I requested support of the M10P whilst version 11 was current and again when version 12 was released. Hopefully one day! Thanks. Will give it a try. I emailed CO as well to ask for explicit support for the M10P.", "link": "https://www.l-camera-forum.com/topic/304349-no-m10-p-support-in-capture-one-20/?tab=comments#comment-3877595", "origin": "L-forum", "suborigin": "304349-no-m10-p-support-in-capture-one-20", "result": false, "Selector": "i created", "selectorShort": "create", "MarkedSent": "vor 19 minuten schrieb wyck: i just watched the -----> video !!!  again to remind myself as it was over a year ago that i created my profiles.", "sortedWord": "video", "Identifyer": null, "identifyer": 111837, "year": "2019"}], "name": "Leicasortedout2019create"}