{"interestingcomments": [{"autor": "mantelknopf", "date": "2018-01-01 10:10:00", "content": "Hello, I wanted to create a profile for this trick in the M9 for lowlight: Auto ISO with highest value 640, at least 1/60 or even 1/125 shutter speed and an exposure compensation downwards. How many units can I underexpose to get the best effect? 2/3? 1 or even more? Does anyone there have experience that they are willing to share? Thank you very much! Gesendet von iPhone mit Tapatalk", "link": "https://www.l-camera-forum.com/topic/213316-m9-iso-performance-new-life/page/4/?tab=comments#comment-3429873", "origin": "L-forum", "suborigin": "213316-m9-iso-performance-new-life", "result": true, "Selector": "i wanted to create", "selectorShort": "create", "MarkedSent": "hello, -----> i !!!  -----> wanted !!!  -----> to !!!  -----> create !!!  a profile for this trick in the m9 for lowlight: auto iso with highest value 640, at least 1/60 or even 1/125 shutter speed and an exposure compensation downwards. how many units can i underexpose to get the best effect? 2/3? 1 or even more? does anyone there have experience that they are willing to share? thank you very much! gesendet von iphone mit tapatalk", "sortedWord": "None", "Identifyer": null, "identifyer": 38975, "year": "2018"}, {"autor": "scott kirkpatrick", "date": "2018-05-28 05:25:00", "content": "Thanks, sounds like a neat trick. I've been recording separately but never thought to use it as a bridge. Do you lay down the audio in editing stage first? Or drop in after your cuts? Audio has to come first, if I have been creating an archive of a production.", "link": "https://www.l-camera-forum.com/topic/284996-external-power-for-sl/?tab=comments#comment-3526528", "origin": "L-forum", "suborigin": "284996-external-power-for-sl", "result": true, "Selector": "i have been creating", "selectorShort": "create", "MarkedSent": "thanks, sounds like a neat trick. i've been recording separately but never thought to use it as a bridge. do you lay down the audio in editing stage first? or drop in after your cuts? audio has to come first, if -----> i !!!  -----> have !!!  -----> been !!!  -----> creating !!!  an archive of a production.", "sortedWord": "None", "Identifyer": null, "identifyer": 34478, "year": "2018"}, {"autor": "Irakly Shanidze", "date": "2018-05-28 16:04:00", "content": "Audio has to come first, if I have been creating an archive of a production. Audio always comes first, it's a backbone of a timeline. Unless, of course, it is some stock footage that is required to have no sound.", "link": "https://www.l-camera-forum.com/topic/284996-external-power-for-sl/?tab=comments#comment-3526916", "origin": "L-forum", "suborigin": "284996-external-power-for-sl", "result": true, "Selector": "i have been creating", "selectorShort": "create", "MarkedSent": "audio has to come first, if -----> i !!!  -----> have !!!  -----> been !!!  -----> creating !!!  an archive of a production. audio always comes first, it's a backbone of a timeline. unless, of course, it is some stock footage that is required to have no sound.", "sortedWord": "None", "Identifyer": null, "identifyer": 34481, "year": "2018"}, {"autor": "AlexNOR", "date": "2018-04-19 22:10:00", "content": " Hi, So, my first post here. Hate for it to be one where I ask for advice, but that's how it is. I just got a Leica Q a couple days ago. Even though I think of myself as \"tech savvy\", I cannot wrap my head around how exactly the User Profiles are supposed to work. According to the manual \"any combination of menu settings can be permanently stored, e.g. so that they can be retrieved quickly and easily at any time\", however this does not seem to be the case. Wondering if this is some kind of bug, if it's a known problem, or whether I am doing something wrong. I tried creating two profiles, the only difference being that one had the display setting set to EVF EXTENDED and the other profile had it to AUTO. Changing between profiles did nothing in terms of changing the display setting. It would stay as whatever I last directly set it at through the menu item. I tried it a couple times in case I set it wrong, and I also tried resetting everything on the camera. No bueno. Then I reset everything in the camera again. This time I tried saving more then one setting to each profile, just to see if I am not saving it correctly. I also made sure to choose the default profile in between the making of each profile in case that should matter. I made two new profiles with different settings in Display Settings, AF Mode, Digital Zoom and Exposure Compensation. After I had saved the two User Profiles, I switched back to the Default profile and altered the settings again and made sure it did not match what was supposedly saved to User Profile 1 and 2. Out of these four items, only AF Mode and Exposure Compensation changed when I switched between the profiles. Display Settings and Digital Zoom stayed at what I set it to in the Default Profile. I cannot see how I'm doing anything wrong when setting this up. Is this the way it's supposed to work, only with some of the menu items and not all? By the way, when I go to RESET and click YES at Reset User Profiles, the User Profiles does not seem to reset (at least there is something saved at profile 1 and 2 which are the ones I've been trying). However when I choose to reset the Camera Settings they do reset with everything else. Doesn't this seem a bit wierd? I love everything else about this camera (except perhaps that there is no lcd on/off button, which is sort of what I'm trying to achieve using the user profiles), just wish for this to work as I think it's supposed to work. Any advice is much appreciated.", "link": "https://www.l-camera-forum.com/topic/283847-user-profiles-will-only-saveload-some-settings/?tab=comments#comment-3503356", "origin": "L-forum", "suborigin": "283847-user-profiles-will-only-saveload-some-settings", "result": true, "Selector": "i tried creating", "selectorShort": "create", "MarkedSent": " hi, so, my first post here. hate for it to be one where i ask for advice, but that's how it is. i just got a leica q a couple days ago. even though i think of myself as \"tech savvy\", i cannot wrap my head around how exactly the user profiles are supposed to work. according to the manual \"any combination of menu settings can be permanently stored, e.g. so that they can be retrieved quickly and easily at any time\", however this does not seem to be the case. wondering if this is some kind of bug, if it's a known problem, or whether i am doing something wrong. -----> i !!!  -----> tried !!!  -----> creating !!!  two profiles, the only difference being that one had the display setting set to evf extended and the other profile had it to auto. changing between profiles did nothing in terms of changing the display setting. it would stay as whatever i last directly set it at through the menu item. i tried it a couple times in case i set it wrong, and i also tried resetting everything on the camera. no bueno. then i reset everything in the camera again. this time i tried saving more then one setting to each profile, just to see if i am not saving it correctly. i also made sure to choose the default profile in between the making of each profile in case that should matter. i made two new profiles with different settings in display settings, af mode, digital zoom and exposure compensation. after i had saved the two user profiles, i switched back to the default profile and altered the settings again and made sure it did not match what was supposedly saved to user profile 1 and 2. out of these four items, only af mode and exposure compensation changed when i switched between the profiles. display settings and digital zoom stayed at what i set it to in the default profile. i cannot see how i'm doing anything wrong when setting this up. is this the way it's supposed to work, only with some of the menu items and not all? by the way, when i go to reset and click yes at reset user profiles, the user profiles does not seem to reset (at least there is something saved at profile 1 and 2 which are the ones i've been trying). however when i choose to reset the camera settings they do reset with everything else. doesn't this seem a bit wierd? i love everything else about this camera (except perhaps that there is no lcd on/off button, which is sort of what i'm trying to achieve using the user profiles), just wish for this to work as i think it's supposed to work. any advice is much appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 5916, "year": "2018"}, {"autor": "Megan", "date": "2018-05-11 00:36:00", "content": "Not sure about the other settings, I just tried mine and it seemed to work fine. I created two profiles, the difference is JPEG SETTING -> SATURATION->monochrome vs. standard. I set the FN button to toggle between user profiles. They all work fine for me. So you might want to give it another try? Good Luck!", "link": "https://www.l-camera-forum.com/topic/283847-user-profiles-will-only-saveload-some-settings/?tab=comments#comment-3516597", "origin": "L-forum", "suborigin": "283847-user-profiles-will-only-saveload-some-settings", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "not sure about the other settings, i just tried mine and it seemed to work fine. -----> i !!!  -----> created !!!  two profiles, the difference is jpeg setting -> saturation->monochrome vs. standard. i set the fn button to toggle between user profiles. they all work fine for me. so you might want to give it another try? good luck!", "sortedWord": "None", "Identifyer": null, "identifyer": 5917, "year": "2018"}, {"autor": "bags27", "date": "2018-05-11 14:35:00", "content": "Hi, So, my first post here. Hate for it to be one where I ask for advice, but that's how it is. I just got a Leica Q a couple days ago. Even though I think of myself as \"tech savvy\", I cannot wrap my head around how exactly the User Profiles are supposed to work. According to the manual \"any combination of menu settings can be permanently stored, e.g. so that they can be retrieved quickly and easily at any time\", however this does not seem to be the case. Wondering if this is some kind of bug, if it's a known problem, or whether I am doing something wrong. I tried creating two profiles, the only difference being that one had the display setting set to EVF EXTENDED and the other profile had it to AUTO. Changing between profiles did nothing in terms of changing the display setting. It would stay as whatever I last directly set it at through the menu item. I tried it a couple times in case I set it wrong, and I also tried resetting everything on the camera. No bueno. Then I reset everything in the camera again. This time I tried saving more then one setting to each profile, just to see if I am not saving it correctly. I also made sure to choose the default profile in between the making of each profile in case that should matter. I made two new profiles with different settings in Display Settings, AF Mode, Digital Zoom and Exposure Compensation. After I had saved the two User Profiles, I switched back to the Default profile and altered the settings again and made sure it did not match what was supposedly saved to User Profile 1 and 2. Out of these four items, only AF Mode and Exposure Compensation changed when I switched between the profiles. Display Settings and Digital Zoom stayed at what I set it to in the Default Profile. I cannot see how I'm doing anything wrong when setting this up. Is this the way it's supposed to work, only with some of the menu items and not all? By the way, when I go to RESET and click YES at Reset User Profiles, the User Profiles does not seem to reset (at least there is something saved at profile 1 and 2 which are the ones I've been trying). However when I choose to reset the Camera Settings they do reset with everything else. Doesn't this seem a bit wierd? I love everything else about this camera (except perhaps that there is no lcd on/off button, which is sort of what I'm trying to achieve using the user profiles), just wish for this to work as I think it's supposed to work. Any advice is much appreciated. You may have hit on the one thing that profiles don't override (at least in my experience). I think that when you turn on a Q, it defaults to the last display setting you had before you turned it off, regardless of which profile you choose. Maybe that's true of digital zoom as well, but I never use that. But, if I understand you correctly, your main concern is changing display settings. If so, why bother to create 2 profiles that just differ by that one variable? After all, going from one profile to the other just to change display setting doesn't save any more work than just having one profile and toggling the display setting.", "link": "https://www.l-camera-forum.com/topic/283847-user-profiles-will-only-saveload-some-settings/?tab=comments#comment-3516897", "origin": "L-forum", "suborigin": "283847-user-profiles-will-only-saveload-some-settings", "result": true, "Selector": "i tried creating", "selectorShort": "create", "MarkedSent": "hi, so, my first post here. hate for it to be one where i ask for advice, but that's how it is. i just got a leica q a couple days ago. even though i think of myself as \"tech savvy\", i cannot wrap my head around how exactly the user profiles are supposed to work. according to the manual \"any combination of menu settings can be permanently stored, e.g. so that they can be retrieved quickly and easily at any time\", however this does not seem to be the case. wondering if this is some kind of bug, if it's a known problem, or whether i am doing something wrong. -----> i !!!  -----> tried !!!  -----> creating !!!  two profiles, the only difference being that one had the display setting set to evf extended and the other profile had it to auto. changing between profiles did nothing in terms of changing the display setting. it would stay as whatever i last directly set it at through the menu item. i tried it a couple times in case i set it wrong, and i also tried resetting everything on the camera. no bueno. then i reset everything in the camera again. this time i tried saving more then one setting to each profile, just to see if i am not saving it correctly. i also made sure to choose the default profile in between the making of each profile in case that should matter. i made two new profiles with different settings in display settings, af mode, digital zoom and exposure compensation. after i had saved the two user profiles, i switched back to the default profile and altered the settings again and made sure it did not match what was supposedly saved to user profile 1 and 2. out of these four items, only af mode and exposure compensation changed when i switched between the profiles. display settings and digital zoom stayed at what i set it to in the default profile. i cannot see how i'm doing anything wrong when setting this up. is this the way it's supposed to work, only with some of the menu items and not all? by the way, when i go to reset and click yes at reset user profiles, the user profiles does not seem to reset (at least there is something saved at profile 1 and 2 which are the ones i've been trying). however when i choose to reset the camera settings they do reset with everything else. doesn't this seem a bit wierd? i love everything else about this camera (except perhaps that there is no lcd on/off button, which is sort of what i'm trying to achieve using the user profiles), just wish for this to work as i think it's supposed to work. any advice is much appreciated. you may have hit on the one thing that profiles don't override (at least in my experience). i think that when you turn on a q, it defaults to the last display setting you had before you turned it off, regardless of which profile you choose. maybe that's true of digital zoom as well, but i never use that. but, if i understand you correctly, your main concern is changing display settings. if so, why bother to create 2 profiles that just differ by that one variable? after all, going from one profile to the other just to change display setting doesn't save any more work than just having one profile and toggling the display setting.", "sortedWord": "None", "Identifyer": null, "identifyer": 5918, "year": "2018"}, {"autor": "AlexNOR", "date": "2018-05-11 16:50:00", "content": "Not sure about the other settings, I just tried mine and it seemed to work fine. I created two profiles, the difference is JPEG SETTING -> SATURATION->monochrome vs. standard. I set the FN button to toggle between user profiles. They all work fine for me. So you might want to give it another try? Good Luck! Thank you for the reply. I didn't do a great job at explaining the issue in my original post, let me try to clarify: For most settings the User Profiles will work as you'd expect, such as with the menu item in your example. However, there are some menu items that the User Profiles will simply ignore, such as Digital Zoom, Self-Timer and Display Settings. There may be more, but these are the ones I've found as they are of insterest to me. Settings under these menus cannot be successfully saved to a User Profile in my experience. You may have hit on the one thing that profiles don't override (at least in my experience). I think that when you turn on a Q, it defaults to the last display setting you had before you turned it off, regardless of which profile you choose. Maybe that's true of digital zoom as well, but I never use that. But, if I understand you correctly, your main concern is changing display settings. If so, why bother to create 2 profiles that just differ by that one variable? After all, going from one profile to the other just to change display setting doesn't save any more work than just having one profile and toggling the display setting. There definetly seems to be a few menu items that is ignored by the User Profiles. It's not an issue when turing on or off the camera, it's that the User Profiles completely ignore these settings and will never overwrite your current selection even though the profile was saved with a different one. Actually, if you program the FN key to select User Profiles, it is quite a bit faster then going into the menu. All you need then is either 3 or 4 quick presses to change between the two profiles, which I find a whole lot easier and more convenient then going into the menu: FN > RIGHT > OK for User Profile 1, or FN > RIGHT > RIGHT > OK for User Profile 2. My whole idea with this was to try to replicate what I'm used to work with, which is a dedicated button to turn on/off live view. That said, as it turned out it is not possible to do it the way I want so I just have to work around it. No big deal.", "link": "https://www.l-camera-forum.com/topic/283847-user-profiles-will-only-saveload-some-settings/?tab=comments#comment-3516943", "origin": "L-forum", "suborigin": "283847-user-profiles-will-only-saveload-some-settings", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "not sure about the other settings, i just tried mine and it seemed to work fine. -----> i !!!  -----> created !!!  two profiles, the difference is jpeg setting -> saturation->monochrome vs. standard. i set the fn button to toggle between user profiles. they all work fine for me. so you might want to give it another try? good luck! thank you for the reply. i didn't do a great job at explaining the issue in my original post, let me try to clarify: for most settings the user profiles will work as you'd expect, such as with the menu item in your example. however, there are some menu items that the user profiles will simply ignore, such as digital zoom, self-timer and display settings. there may be more, but these are the ones i've found as they are of insterest to me. settings under these menus cannot be successfully saved to a user profile in my experience. you may have hit on the one thing that profiles don't override (at least in my experience). i think that when you turn on a q, it defaults to the last display setting you had before you turned it off, regardless of which profile you choose. maybe that's true of digital zoom as well, but i never use that. but, if i understand you correctly, your main concern is changing display settings. if so, why bother to create 2 profiles that just differ by that one variable? after all, going from one profile to the other just to change display setting doesn't save any more work than just having one profile and toggling the display setting. there definetly seems to be a few menu items that is ignored by the user profiles. it's not an issue when turing on or off the camera, it's that the user profiles completely ignore these settings and will never overwrite your current selection even though the profile was saved with a different one. actually, if you program the fn key to select user profiles, it is quite a bit faster then going into the menu. all you need then is either 3 or 4 quick presses to change between the two profiles, which i find a whole lot easier and more convenient then going into the menu: fn > right > ok for user profile 1, or fn > right > right > ok for user profile 2. my whole idea with this was to try to replicate what i'm used to work with, which is a dedicated button to turn on/off live view. that said, as it turned out it is not possible to do it the way i want so i just have to work around it. no big deal.", "sortedWord": "None", "Identifyer": null, "identifyer": 5920, "year": "2018"}, {"autor": "jip", "date": "2018-07-12 12:15:00", "content": " As much as it could be called a Review it's not really a review but more a showcase of what I've managed to create with the Leica R8 over the past 4 years. Take a look at the pictures, or read my opinions and some facts about the Leica R8 in my new article: http://jipvankuijk.nl/leica-r8/ --img-- ", "link": "https://www.l-camera-forum.com/topic/286527-review-leica-r8/?tab=comments#comment-3554484", "origin": "L-forum", "suborigin": "286527-review-leica-r8", "result": true, "Selector": "i've managed to create", "selectorShort": "create", "MarkedSent": " as much as it could be called a review it's not really a review but more a showcase of what -----> i !!! 've -----> managed !!!  -----> to !!!  -----> create !!!  with the leica r8 over the past 4 years. take a look at the pictures, or read my opinions and some facts about the leica r8 in my new article: http://jipvankuijk.nl/leica-r8/ --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 19714, "year": "2018"}, {"autor": "erlingmm", "date": "2018-04-13 20:16:00", "content": "At a minimum, they follow the forum, and his and other stories have been posted multiple times over YEARS. My point is that their policy sucks and there should have been a recall or some other more proactive communications and service approach. And for free. But that ship sailed. Jeff So you think Leica should contact unhappy customers based on their complaints in the Forum? I would seriously like to know whether he has received a quote or not so we can have a discussion based on facts. If not I have created a special thread for those who again and again, without any new information, need to come back repeatedly just to bash the S, feel free to contribute: https://www.l-camera-forum.com/topic/269702-bash-the-s/ Edited April 13, 2018 by erlingmm", "link": "https://www.l-camera-forum.com/topic/271009-af-drive-problems-leica-s-lenses-official-statement-by-leica/page/8/?tab=comments#comment-3499740", "origin": "L-forum", "suborigin": "271009-af-drive-problems-leica-s-lenses-official-statement-by-leica", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "at a minimum, they follow the forum, and his and other stories have been posted multiple times over years. my point is that their policy sucks and there should have been a recall or some other more proactive communications and service approach. and for free. but that ship sailed. jeff so you think leica should contact unhappy customers based on their complaints in the forum? i would seriously like to know whether he has received a quote or not so we can have a discussion based on facts. if not -----> i !!!  -----> have !!!  -----> created !!!  a special thread for those who again and again, without any new information, need to come back repeatedly just to bash the s, feel free to contribute: https://www.l-camera-forum.com/topic/269702-bash-the-s/ edited april 13, 2018 by erlingmm", "sortedWord": "None", "Identifyer": null, "identifyer": 26986, "year": "2018"}, {"autor": "Jeff S", "date": "2018-04-13 20:22:00", "content": "So you think Leica should contact unhappy customers based on their complaints in the Forum? I would seriously like to know whether he has received a quote or not. If not I have created a special thread for those who again and again, without any new information, need to come back repeatedly just to bash the S, feel free to contribute: https://www.l-camera-forum.com/topic/269702-bash-the-s/ And be sure to add your retort to each post. BTW, Leica didn’t acknowledge or follow up on M screen issues until the forum blew up with complaints. And then a Leica exec responded with a post here and announced a policy shortly after. And, yes, there have also been other instances where members posted here that Leica reached out to them after a forum post. Jeff Edited April 13, 2018 by Jeff S", "link": "https://www.l-camera-forum.com/topic/271009-af-drive-problems-leica-s-lenses-official-statement-by-leica/page/8/?tab=comments#comment-3499746", "origin": "L-forum", "suborigin": "271009-af-drive-problems-leica-s-lenses-official-statement-by-leica", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "so you think leica should contact unhappy customers based on their complaints in the forum? i would seriously like to know whether he has received a quote or not. if not -----> i !!!  -----> have !!!  -----> created !!!  a special thread for those who again and again, without any new information, need to come back repeatedly just to bash the s, feel free to contribute: https://www.l-camera-forum.com/topic/269702-bash-the-s/ and be sure to add your retort to each post. btw, leica didn’t acknowledge or follow up on m screen issues until the forum blew up with complaints. and then a leica exec responded with a post here and announced a policy shortly after. and, yes, there have also been other instances where members posted here that leica reached out to them after a forum post. jeff edited april 13, 2018 by jeff s", "sortedWord": "None", "Identifyer": null, "identifyer": 26987, "year": "2018"}, {"autor": "geetee1972", "date": "2018-10-31 13:45:00", "content": "I would be happy to help. Message me with your email address and I can create a DropBox folder for you with plenty of samples. They will all be natural light and DNG.", "link": "https://www.l-camera-forum.com/topic/291048-s007-dng-portrait-samples/?tab=comments#comment-3623108", "origin": "L-forum", "suborigin": "291048-s007-dng-portrait-samples", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "i would be happy to help. message me with your email address and -----> i !!!  -----> can !!!  -----> create !!!  a dropbox folder for you with plenty of samples. they will all be natural light and dng.", "sortedWord": "None", "Identifyer": null, "identifyer": 31828, "year": "2018"}, {"autor": "Paul J", "date": "2018-03-27 14:55:00", "content": "I think the photo of Thorsten and his wife attending the White House Christmas Party in the Mail article may give a clue as to why he is not troubled by our views. Never has the phrase \"Ivory Tower\" been so relevant. No one is immune from the problems we have created in our planet. Everyone is responsible and accountable.", "link": "https://www.l-camera-forum.com/topic/283052-luxury-camera-bags-by-thorsten-von-overgaard/page/11/?tab=comments#comment-3488842", "origin": "L-forum", "suborigin": "283052-luxury-camera-bags-by-thorsten-von-overgaard", "result": true, "Selector": "we have created", "selectorShort": "create", "MarkedSent": "i think the photo of thorsten and his wife attending the white house christmas party in the mail article may give a clue as to why he is not troubled by our views. never has the phrase \"ivory tower\" been so relevant. no one is immune from the problems -----> we !!!  -----> have !!!  -----> created !!!  in our planet. everyone is responsible and accountable.", "sortedWord": "None", "Identifyer": null, "identifyer": 85555, "year": "2018"}, {"autor": "sillbeers15", "date": "2018-06-06 13:18:00", "content": "Sorry, I don't really understand the sudden move to lenses in this discussion. It makes me feel that we are operating different threads here. Also, your \"desire to own\" is precisely why Leica are able to gouge their customers. The reason I move the discussion to the Leica SL lenses is precisely my point that all my rational for 'willing to pay' is all about going after the performance of the lenses, including the flashes and commander ( in the desire to fill light in situation of higher than 1/250 sec shutter speed situation especially to create shallow DOF images). My rational will be identical to yours if I silo my thoughts to just lights & wireless triggers. But to chase after the images I desire to create, my consideration must include core & primary motivation to support the Leica SL lenses.", "link": "https://www.l-camera-forum.com/topic/285299-leica-sf-60-flash-how-much-is-it-going-to-be-%E2%80%93-whats-your-guess/?tab=comments#comment-3532722", "origin": "L-forum", "suborigin": "285299-leica-sf-60-flash-how-much-is-it-going-to-be-%E2%80%93-whats-your-guess", "result": true, "Selector": "i desire to create", "selectorShort": "create", "MarkedSent": "sorry, i don't really understand the sudden move to lenses in this discussion. it makes me feel that we are operating different threads here. also, your \"desire to own\" is precisely why leica are able to gouge their customers. the reason i move the discussion to the leica sl lenses is precisely my point that all my rational for 'willing to pay' is all about going after the performance of the lenses, including the flashes and commander ( in the desire to fill light in situation of higher than 1/250 sec shutter speed situation especially to create shallow dof images). my rational will be identical to yours if i silo my thoughts to just lights & wireless triggers. but -----> to !!!  chase after the images -----> i !!!  -----> desire !!!  -----> to !!!  -----> create !!! , my consideration must include core & primary motivation -----> to !!!  support the leica sl lenses.", "sortedWord": "None", "Identifyer": null, "identifyer": 88637, "year": "2018"}, {"autor": "Brian C in Az", "date": "2018-11-08 02:35:00", "content": "8 hours ago, frame-it said: Luminar doesn't have a database system ? That is correct. For me that is a non issue. I keep all my files on an external 4TD SSD. I created my own file folder system. Since SSDs are so relatively cheap now, I can make duplicates as needed in various folders if need be. I downloaded the free 14 day trial. I also just received my SL today, so I charged the battery half full and went out as the sun was setting and shot 88 quick pics in bad light with the wrong settings because I forgot half of the manual and also forgot my reading glasses. All the controls were a blur.... I am impressed with the performance of the SL with 24-90 (seems to be the most common lens purchased with the camera). The exposures were MUCH better than I would have guessed. Even when shooting a few pictures using the street lights for the only source for portrait shots, the information in the file is astounding. I transferred the images to my 4TB WD passport. 5 GB in under a minute via Thunderport 3; impressive. I opened the street light portraits and I was amazed at how much info was there. I expected a bright light and all black and noisy shadows. The SL did a great job. Luminar was easy to use (I did watch the beginner's 40 minute intro video earlier today while waiting for UPS to deliver). In under 3 minutes I had a picture that I can actually print to 14\" and it looks good. I showed my fiancé the raw/jpeg image and the \"processed\" image and she is impressed with the improvements and the quality. Luminar is not a destructive program. It uses layers. When you save a project, it saves all the layers and each and every step within each layer. You can go straight to the original at anytime or go to any point in the process. If you decide to change the look, you can save both copies and both contain the original file plus every step to finished product. On my 2017 MacBookPro, no rendering step took more than 3 seconds. It was quicker than me making my decisions as to what to do. I can only guess that as I watch the other free tutorials and webinars on Luminar, that my finished projects will get even better. For $59, it is a steal. Use promo code Photoblog for an extra $10 off. That is where I first learned of the program. It was a featured ad when I was reading their review for the SL lens. I think I may also get Aurora ($99), it has HDR and I really think that I would enjoy using that as well.", "link": "https://www.l-camera-forum.com/topic/291258-luminar-software/?tab=comments#comment-3627478", "origin": "L-forum", "suborigin": "291258-luminar-software", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "8 hours ago, frame-it said: luminar doesn't have a database system ? that is correct. for me that is a non issue. i keep all my files on an external 4td ssd. -----> i !!!  -----> created !!!  my own file folder system. since ssds are so relatively cheap now, i can make duplicates as needed in various folders if need be. i downloaded the free 14 day trial. i also just received my sl today, so i charged the battery half full and went out as the sun was setting and shot 88 quick pics in bad light with the wrong settings because i forgot half of the manual and also forgot my reading glasses. all the controls were a blur.... i am impressed with the performance of the sl with 24-90 (seems to be the most common lens purchased with the camera). the exposures were much better than i would have guessed. even when shooting a few pictures using the street lights for the only source for portrait shots, the information in the file is astounding. i transferred the images to my 4tb wd passport. 5 gb in under a minute via thunderport 3; impressive. i opened the street light portraits and i was amazed at how much info was there. i expected a bright light and all black and noisy shadows. the sl did a great job. luminar was easy to use (i did watch the beginner's 40 minute intro video earlier today while waiting for ups to deliver). in under 3 minutes i had a picture that i can actually print to 14\" and it looks good. i showed my fiancé the raw/jpeg image and the \"processed\" image and she is impressed with the improvements and the quality. luminar is not a destructive program. it uses layers. when you save a project, it saves all the layers and each and every step within each layer. you can go straight to the original at anytime or go to any point in the process. if you decide to change the look, you can save both copies and both contain the original file plus every step to finished product. on my 2017 macbookpro, no rendering step took more than 3 seconds. it was quicker than me making my decisions as to what to do. i can only guess that as i watch the other free tutorials and webinars on luminar, that my finished projects will get even better. for $59, it is a steal. use promo code photoblog for an extra $10 off. that is where i first learned of the program. it was a featured ad when i was reading their review for the sl lens. i think i may also get aurora ($99), it has hdr and i really think that i would enjoy using that as well.", "sortedWord": "None", "Identifyer": null, "identifyer": 113539, "year": "2018"}, {"autor": "IamTheDistance", "date": "2018-11-03 18:23:00", "content": " Hi, my name is Er and I'm from Spain. I've been reading this forum for some months and yesterday finally I created an account. My English is poor so excuse me if I can't explain very well. I hope I can learn a lot about Leica!🙏🏻", "link": "https://www.l-camera-forum.com/topic/291144-maybe-a-future-leica-user/?tab=comments#comment-3624849", "origin": "L-forum", "suborigin": "291144-maybe-a-future-leica-user", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": " hi, my name is er and i'm from spain. -----> i !!! 've been reading this forum for some months and yesterday finally -----> i !!!  -----> created !!!  an account. my english is poor so excuse me if i can't explain very well. i hope i can learn a lot about leica!🙏🏻", "sortedWord": "None", "Identifyer": null, "identifyer": 114273, "year": "2018"}, {"autor": "pgk", "date": "2018-04-06 13:50:00", "content": " There's nothing to stop any of us creating a Stolen Leica Forum should we want to do so - but obviously its unlikely to be under the umbrella of the LUF. However I'm sure that it could be linked to in posts about say, a stolen Leica. I do agree though that any such forum would have to be actively maintained and any malicious posting would need to be ascertained and dealt with. One solution might be to post the theft report reference and relevant police contact?", "link": "https://www.l-camera-forum.com/topic/283425-has-anyone-proposed-having-a-stolen-leica-forum/page/3/?tab=comments#comment-3495276", "origin": "L-forum", "suborigin": "283425-has-anyone-proposed-having-a-stolen-leica-forum", "result": true, "Selector": "us creating", "selectorShort": "create", "MarkedSent": " there's nothing to stop any of -----> us !!!  -----> creating !!!  a stolen leica forum should we want to do so - but obviously its unlikely to be under the umbrella of the luf. however i'm sure that it could be linked to in posts about say, a stolen leica. i do agree though that any such forum would have to be actively maintained and any malicious posting would need to be ascertained and dealt with. one solution might be to post the theft report reference and relevant police contact?", "sortedWord": "None", "Identifyer": null, "identifyer": 116008, "year": "2018"}, {"autor": "pico", "date": "2018-12-31 17:22:00", "content": "I created a similar problem in a program that took picture uploads. My error was that I loaded the image, then saved it on the server before reading the file size. On the server the file was larger due to what we called its 'cluster factor' which is like rounding a number up to accommodate the much larger storage fractional of the server. Sure, I fixed it but it was an embarrassment. I cannot know if that is happening here, but you might try lowering the size by 10%.", "link": "https://www.l-camera-forum.com/topic/292787-picture-posting-conundrum/?tab=comments#comment-3656051", "origin": "L-forum", "suborigin": "292787-picture-posting-conundrum", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  a similar problem in a program that took picture uploads. my error was that i loaded the image, then saved it on the server before reading the file size. on the server the file was larger due to what we called its 'cluster factor' which is like rounding a number up to accommodate the much larger storage fractional of the server. sure, i fixed it but it was an embarrassment. i cannot know if that is happening here, but you might try lowering the size by 10%.", "sortedWord": "None", "Identifyer": null, "identifyer": 117689, "year": "2018"}, {"autor": "Exodies", "date": "2018-12-06 01:35:00", "content": "Create an activity, My Activity Streams looking like this:--img--  click on the star or dot at the beginning of each result to go to the first unread message in the tread.", "link": "https://www.l-camera-forum.com/topic/292068-where-is-that-handy-view-first-unread-function/?tab=comments#comment-3642682", "origin": "L-forum", "suborigin": "292068-where-is-that-handy-view-first-unread-function", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "-----> create !!!  an activity, my activity streams looking like this:--img--  click on the star or dot at the beginning of each result to go to the first unread message in the tread.", "sortedWord": "None", "Identifyer": null, "identifyer": 117698, "year": "2018"}, {"autor": "carlostaiwan", "date": "2018-08-14 15:01:00", "content": "a few more here: https://carlosgrphoto.com/filmreviews/ Thank you for referencing my blog --img--  A couple of years ago I started a project in which I want to shoot every color film available in the market. I'd like to create an easy guide for people who wants to start with film and doesn't know which film to use. So far, this is the list: (Did I forget anything?) REVIEWED Fujicolor SUPERIA x-tra 800 Kodak Gold 200 Rollei Redbird Redscale 400 Kodak Ultramax 400 FUJICOLOR INDUSTRIAL 100 業務記錄用 Adox color Implosion 100-400 Fujifilm Fujichrome Provia 100F Fujicolor ETERNA 250D Lomography color Negative 400 CineStill 50 DayLight AgfaPhoto CT Precisa 100 Kodak EKTAR 100 Kodak Colorplus 200 Fujifilm Superia 200 Fujicolor 100 (Only in Japan) Fujifilm Superia x-tra 400 FND IRO 200 SHOT BUT NOT REVIEWED Kodak Pro-Image 100 AgfaPhoto VISTA PLUS 200 HillVale Sunny 16 Fujicolor c200 FUJICOLOR INDUSTRIAL 400 業務記錄 Superia Premium 400 (Only in Japan)用 Fujifilm Superia Natura 1600 / Fujicolor Natura 1600 Kodak Vision 3 250D Superia Venus 800 (Only in Japan) Lomography 100 IN PROCESS AgfaPhoto VISTA PLUS 400 Kodak Portra 400 FPP RetroChrome 320 Rollei CR200 BOUGHT BUT NOT SHOT Lomography Lomochrome Purple 100-400 CINESTILL 800 ISO TUNGSTEN XPRO Kodak Portra 160 NOT BOUGHT YET Fujicolor Fujichrome Velvia 50 Fujicolor Fujichrome Velvia 100 Fujicolor Fujichrome Provia 400x Fujifilm PRO 160NS HillVale 200 Holiday Fujicolor PRO 400H I.D.S. Color-Spektar (ISO 200) I.D.S. Just Click It 160 Kodak Portra 800 Argenti VIVID ARROW 400 Lomography color Negative 800 Lomography Lomochrome Turquoise 100-400 LOMOGRAPHY REDSCALE XR ISO 50-200 Lucky Color Negative Film 100 I.D.S. COLOR-SPEKTAR 200 I.D.S. JUST CLICK IT. 160 35MM Kono! Kolorit 125 CN Kono! Rekorder 100 Kono! Kolorit 250 Kono! Kolorit 400 CN KODAK SUPER LOW SPEED iso f1.6 Revolog 36exp 460nm Revolog 36exp 600nm Revolog 36exp Plexus Revolog 36exp Kolor Revolog 36exp Rasp Revolog 12exp Tesla II Rollei Digibase CN200 Pro (C-41 Process) Rollei Vario Chrome 135-36 Rollei Crossbird 35mm Dubblefilm Bubblegum Dubblefilm Monsoon Dubblefilm Sunstroke Dubblefilm Moonstruck SAYAT NOVA 35mm-36 exp.", "link": "https://www.l-camera-forum.com/topic/287342-simple-film-guide/?tab=comments#comment-3572250", "origin": "L-forum", "suborigin": "287342-simple-film-guide", "result": false, "Selector": "i'd like to create", "selectorShort": "create", "MarkedSent": "i'd like to create an easy guide for people who wants to start with -----> film !!!  and doesn't know which -----> film !!!  to use.", "sortedWord": "film", "Identifyer": null, "identifyer": 103954, "year": "2018"}, {"autor": "Martin B", "date": "2018-08-14 20:35:00", "content": " Thank you for referencing my blog --img--  A couple of years ago I started a project in which I want to shoot every color film available in the market. I'd like to create an easy guide for people who wants to start with film and doesn't know which film to use. So far, this is the list: (Did I forget anything?) Sounds like an excellent plan! Even some of the \"fancy\" films are currently very over-hyped in social networks, I don't see them as being used often. I personally wouldn't focus too much on these, e. g. like purple/blue false color negative films etc, neither on some hyped B&W films like Street Candy etc. I believe the most available films in stores are the ones people will most likely have a comparison with. Certainly I would include some well known slide films like Fuji Provia or Velvia 100F. Just my 2 Cents!", "link": "https://www.l-camera-forum.com/topic/287342-simple-film-guide/?tab=comments#comment-3572461", "origin": "L-forum", "suborigin": "287342-simple-film-guide", "result": false, "Selector": "i'd like to create", "selectorShort": "create", "MarkedSent": "i'd like to create an easy guide for people who wants to start with -----> film !!!  and doesn't know which -----> film !!!  to use.", "sortedWord": "film", "Identifyer": null, "identifyer": 103955, "year": "2018"}], "name": "Leicasortedout2018create"}