{"interestingcomments": [{"autor": "hellerkar", "date": "2015-01-30 19:34:00", "content": " I have and continue to own Leica 8, 9, and M 240 cameras all of which I acquired when they were first launched. Each has its place and each has its strengths and weaknesses. Beauty is in the eye of the beholder, for sure, but I cannot recreate the \"look\" I have come to prefer from the source files of the M240. I find this most pronounced in pictures of people which is my most frequent and preferred subject matter. Others might not agree and might prefer the files they are getting or might think a compromise was needed to gain other advantages they needed or wanted.. Perhaps someone has a “secret sauce” in post processing that has not yet been shared and demonstrated….which may in fact be proprietary. Okay….but it has eluded me and has eluded others and not for want of trying. While I do not “like” change as much as I wish I did, this has never stopped me from pursuing and embracing it. I think the M240 has great versatility and wonderful features as a camera but something changed not for the better for me in terms of the images I can create with it. I hoped that the letter would continue a positive, informed discussion not only among photographers/customers but also with representatives from Leica, too. I would never discourage someone's success or satisfaction with the tools, features, and, ultimately, images they prefer. In fact, I like to celebrate that. Peter, personally, deserves more credibility and respect for his findings than some of the responses that have been posted here exhibit. His work is astonishingly good and he has devoted a great deal of time and open-minded experimentation to this effort. I agree with the letter (that's why I signed it) and share an interest in further developing the CCD sensor technology…or frankly, any technology, that creates files I can turn into the kinds of images I have come to treasure from the M9 (and the M8) with their CCD sensors. For those of you for whom the CMOS sensor is giving you preferred imagery? Wonderful. Does this mean that it is giving everyone preferred imagery? No. Does it mean that one can seamlessly \"convert\" a CMOS file into one that emerged from a CCD sensor? No, it doesn't. At least in many images where the differences matter most. Hence the letter. Thank you to those who have responded with courtesy, knowledge, helpfulness, and experience regardless of your “point of view”. We all learn and grow from this. For those who have chosen to post rude and misguidedly speculative posts? Well, I guess we learn something from that, too (albeit not about cameras, photography, or image creation).", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/7/?tab=comments#comment-2756084", "origin": "L-forum", "suborigin": "240288-400-leica-photographers-agree-we-love-ccd", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": " i have and continue to own leica 8, 9, and m 240 cameras all of which i acquired when they were first launched. each has its place and each has its strengths and weaknesses. beauty is in the eye of the beholder, for sure, but i cannot recreate the \"look\" i have come to prefer from the source files of the m240. i find this most pronounced in pictures of people which is my most frequent and preferred subject matter. others might not agree and might prefer the files they are getting or might think a compromise was needed to gain other advantages they needed or wanted.. perhaps someone has a “secret sauce” in post processing that has not yet been shared and demonstrated….which may in fact be proprietary. okay….but it has eluded me and has eluded others and not for want of trying. while i do not “like” change as much as i wish i did, this has never stopped me from pursuing and embracing it. -----> i !!!  think the m240 has great versatility and wonderful features as a camera but something changed not for the better for me in terms of the images -----> i !!!  -----> can !!!  -----> create !!!  with it. i hoped that the letter would continue a positive, informed discussion not only among photographers/customers but also with representatives from leica, too. i would never discourage someone's success or satisfaction with the tools, features, and, ultimately, images they prefer. in fact, i like to celebrate that. peter, personally, deserves more credibility and respect for his findings than some of the responses that have been posted here exhibit. his work is astonishingly good and he has devoted a great deal of time and open-minded experimentation to this effort. i agree with the letter (that's why i signed it) and share an interest in further developing the ccd sensor technology…or frankly, any technology, that creates files i can turn into the kinds of images i have come to treasure from the m9 (and the m8) with their ccd sensors. for those of you for whom the cmos sensor is giving you preferred imagery? wonderful. does this mean that it is giving everyone preferred imagery? no. does it mean that one can seamlessly \"convert\" a cmos file into one that emerged from a ccd sensor? no, it doesn't. at least in many images where the differences matter most. hence the letter. thank you to those who have responded with courtesy, knowledge, helpfulness, and experience regardless of your “point of view”. we all learn and grow from this. for those who have chosen to post rude and misguidedly speculative posts? well, i guess we learn something from that, too (albeit not about cameras, photography, or image creation).", "sortedWord": "None", "Identifyer": null, "identifyer": 39408, "year": "2015"}, {"autor": "Nr90", "date": "2015-03-17 13:54:00", "content": "Let's use m8raw2dngv12beta_mac and m8raw2dng-droplet. m8raw2dngv12beta_mac should give you a folder with three files: lensdb.ini sensdb.ini m8raw2dng What I did was create a folder in my users directory named: m8raw2dng. Copy the files from the m8raw2dngv12beta_mac folder into the newly created m8raw2dng folder. Now we must tell the droplet where to find the m8raw2dng executable. 1. Open the main.scpt in the droplet as described above 2. Go to line 6. This says: set TheApp to \"/Applications/m8raw2dng\" This tells the droplet that the m8raw2dng executable is in /Applications We put in the current user's directory so we change the line to: set TheApp to \"~/m8raw2dng/m8raw2dng\" (keep the tab in front of the line) (on unix systems the ~ is the path to the current user's home directory) 3. Save the file Next we must set the parameters. The most important being the output location (where to put the newly created DNG files). 1. Go to your Pictures folder 2. Create a folder called: m8raw (A different name is possible, if so change the following to reflect your folder's name) 3. Open the main.scpt in the droplet as before 4. Go to line 11. It says: set Params to \" -v -r -b -p -l -o /Users/YourName/Pictures\" This tells the droplet with which parameters it should run the m8raw2dng. For a full description go to: M8raw2dng – Tool to convert Leica M8 RAW files to DNG The most important one is the -o It sets the output directory. Change the line to: set Params to \" -v -r -b -p -l -o ~/Pictures/m8raw\" (change the path if you chose a different location / name) 5. Save the file Now your droplet is ready to be used. Drag a folder of RAW and JPG files on top of the droplet and it should output the resulting DNG files in your ~/Pictures/m8raw folder. You will probably find the resulting DNG files are magenta coloured and uneven. We can fix this later", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/6/?tab=comments#comment-2782212", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "i did was create", "selectorShort": "create", "MarkedSent": "let's use m8raw2dngv12beta_mac and m8raw2dng-droplet. m8raw2dngv12beta_mac should give you a folder with three files: lensdb.ini sensdb.ini m8raw2dng what -----> i !!!  -----> did !!!  -----> was !!!  -----> create !!!  a folder in my users directory named: m8raw2dng. copy the files from the m8raw2dngv12beta_mac folder into the newly created m8raw2dng folder. now we must tell the droplet where to find the m8raw2dng executable. 1. open the main.scpt in the droplet as described above 2. go to line 6. this says: set theapp to \"/applications/m8raw2dng\" this tells the droplet that the m8raw2dng executable is in /applications we put in the current user's directory so we change the line to: set theapp to \"~/m8raw2dng/m8raw2dng\" (keep the tab in front of the line) (on unix systems the ~ is the path to the current user's home directory) 3. save the file next we must set the parameters. the most important being the output location (where to put the newly created dng files). 1. go to your pictures folder 2. create a folder called: m8raw (a different name is possible, if so change the following to reflect your folder's name) 3. open the main.scpt in the droplet as before 4. go to line 11. it says: set params to \" -v -r -b -p -l -o /users/yourname/pictures\" this tells the droplet with which parameters it should run the m8raw2dng. for a full description go to: m8raw2dng – tool to convert leica m8 raw files to dng the most important one is the -o it sets the output directory. change the line to: set params to \" -v -r -b -p -l -o ~/pictures/m8raw\" (change the path if you chose a different location / name) 5. save the file now your droplet is ready to be used. drag a folder of raw and jpg files on top of the droplet and it should output the resulting dng files in your ~/pictures/m8raw folder. you will probably find the resulting dng files are magenta coloured and uneven. we can fix this later", "sortedWord": "None", "Identifyer": null, "identifyer": 41614, "year": "2015"}, {"autor": "ramarren", "date": "2015-07-02 13:16:00", "content": "I tried several different codes with the Summilux 35 v2 on the M-P and decided that no code worked best. I created a user config that turns off the lens codes for when I use that lens.", "link": "https://www.l-camera-forum.com/topic/185433-m-lens-codes/page/5/?tab=comments#comment-2846221", "origin": "L-forum", "suborigin": "185433-m-lens-codes", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "i tried several different codes with the summilux 35 v2 on the m-p and decided that no code worked best. -----> i !!!  -----> created !!!  a user config that turns off the lens codes for when -----> i !!!  use that lens.", "sortedWord": "None", "Identifyer": null, "identifyer": 7520, "year": "2015"}, {"autor": "Peter_S", "date": "2015-09-04 13:25:00", "content": "Hi! LDP LLC in the US did that for me. Sharpness was, perceived (made no tests or anything), slightly above the X1, and on-par with the M8. The problem is, that the color and noise changed - images have different colors, need different temperature adjustments, and noise was increased. I created several color profiles, which was OK. I used it mainly for b/w, for which it was awesome. A stressful day during my ski guide training in Canada, and gone it was... That said, I went back to the X1 after that and miss little, except the faster AF. The image IQ is still amazing (I suspect the AA filter in the X1 is very weak). My X1 has proven itself over and over, and kept on going when the Ms did not. It will be the first digital camera I will not part with. I recently did an X1 A3 print for a customer, and was amazed. Question... Did you do this yourself, or have a repair shop do it, or Leica? Thx! Edited September 4, 2015 by Peter_S", "link": "https://www.l-camera-forum.com/topic/247819-towards-a-modern-replacement-leica-x1/page/3/?tab=comments#comment-2882269", "origin": "L-forum", "suborigin": "247819-towards-a-modern-replacement-leica-x1", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "hi! ldp llc in the us did that for me. sharpness was, perceived (made no tests or anything), slightly above the x1, and on-par with the m8. the problem is, that the color and noise changed - images have different colors, need different temperature adjustments, and noise was increased. -----> i !!!  -----> created !!!  several color profiles, which was ok. i used it mainly for b/w, for which it was awesome. a stressful day during my ski guide training in canada, and gone it was... that said, i went back to the x1 after that and miss little, except the faster af. the image iq is still amazing (i suspect the aa filter in the x1 is very weak). my x1 has proven itself over and over, and kept on going when the ms did not. it will be the first digital camera i will not part with. i recently did an x1 a3 print for a customer, and was amazed. question... did you do this yourself, or have a repair shop do it, or leica? thx! edited september 4, 2015 by peter_s", "sortedWord": "None", "Identifyer": null, "identifyer": 13145, "year": "2015"}, {"autor": "steveBK", "date": "2015-06-13 14:28:00", "content": "I am happy the Q is 28mm.. since it means I'm not buying one immediately ;-) !! In any case, I'm a recent X 113 owner (and longtime M owner).. got it for its lightweight, yet classic handling (for a fixed lens compact-isn camera). When I see the Q, I am very impressed with what they have done, I see it as a refinement of the X. It seems they took much of the X 113 handling, and improved it for a larger/heavier, full frame body. For me, a 50mm Q would be very interesting. The pricing would still give me pause as an M240+50lux owner (and A7s owner).. exactly where it would fit in to my kit, and whether I'm just creating more expensive redundancy.", "link": "https://www.l-camera-forum.com/topic/246265-leica-x-prices-and-values/?tab=comments#comment-2833888", "origin": "L-forum", "suborigin": "246265-leica-x-prices-and-values", "result": true, "Selector": "i'm just creating", "selectorShort": "create", "MarkedSent": "i am happy the q is 28mm.. since it means i'm not buying one immediately ;-) !! in any case, i'm a recent x 113 owner (and longtime m owner).. got it for its lightweight, yet classic handling (for a fixed lens compact-isn camera). when i see the q, i am very impressed with what they have done, i see it as a refinement of the x. it seems they took much of the x 113 handling, and improved it for a larger/heavier, full frame body. for me, a 50mm q would be very interesting. the pricing would still give me pause as an m240+50lux owner (and a7s owner).. exactly where it would fit in to my kit, and whether -----> i !!! 'm -----> just !!!  -----> creating !!!  more expensive redundancy.", "sortedWord": "None", "Identifyer": null, "identifyer": 13200, "year": "2015"}, {"autor": "likealot", "date": "2015-06-18 23:32:00", "content": "For the price of an X Vario, you could also consider a M8 + Summicron 35 or 40mm with a 90 Elmar. To me that looks more in line with your upgrade path from the Nikon D5100 or as alternative to Fuji X100T. It will also keep its value much better than the X vario A very enticing suggestion and one which has traveled through my brain several times. However, every time I have also, thankfully, been self aware and remembered the fact that I am a mere amateur in terms of my knowledge of photography skills. Even my use of the current DSLR is mostly on auto mode (not for lack of willingness but rather lact of time due to other life commitments). Therefore I think the M8 (or any Mseries) would be too much of a steep learning curve for me. So I thought perhaps I could start with the X-Vario instead and work my way up. Somehow I have created an impression/belief that the X-Vario would be more forgiving than the M series (I am not sure why and it is very likely that I may be totally wrong).", "link": "https://www.l-camera-forum.com/topic/246539-to-x-or-not-to-x-help-a-newbie-please/?tab=comments#comment-2837883", "origin": "L-forum", "suborigin": "246539-to-x-or-not-to-x-help-a-newbie-please", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "for the price of an x vario, you could also consider a m8 + summicron 35 or 40mm with a 90 elmar. to me that looks more in line with your upgrade path from the nikon d5100 or as alternative to fuji x100t. it will also keep its value much better than the x vario a very enticing suggestion and one which has traveled through my brain several times. however, every time i have also, thankfully, been self aware and remembered the fact that i am a mere amateur in terms of my knowledge of photography skills. even my use of the current dslr is mostly on auto mode (not for lack of willingness but rather lact of time due to other life commitments). therefore i think the m8 (or any mseries) would be too much of a steep learning curve for me. so i thought perhaps i could start with the x-vario instead and work my way up. somehow -----> i !!!  -----> have !!!  -----> created !!!  an impression/belief that the x-vario would be more forgiving than the m series (-----> i !!!  am not sure why and it is very likely that -----> i !!!  may be totally wrong).", "sortedWord": "None", "Identifyer": null, "identifyer": 13633, "year": "2015"}, {"autor": "jip", "date": "2015-02-16 23:24:00", "content": "Here is a portrait of two other forum members, MerijnvZ (left) and LorenzVS (right), taken with the M, and 50mm Summilux-M ASPH. And some funky filters I created in Lightroom. --img-- ", "link": "https://www.l-camera-forum.com/topic/239964-open-thread-show-us-your-portraits/page/4/?tab=comments#comment-2765914", "origin": "L-forum", "suborigin": "239964-open-thread-show-us-your-portraits", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "here is a portrait of two other forum members, merijnvz (left) and lorenzvs (right), taken with the m, and 50mm summilux-m asph. and some funky filters -----> i !!!  -----> created !!!  in lightroom. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 42190, "year": "2015"}, {"autor": "Exodies", "date": "2015-11-20 08:28:00", "content": "We create the present at such an enormous rate that we have no resources left to cling to the past.", "link": "https://www.l-camera-forum.com/topic/243783-sorry-are-we-going-to-regret-low-resolution-images/?tab=comments#comment-2932671", "origin": "L-forum", "suborigin": "243783-sorry-are-we-going-to-regret-low-resolution-images", "result": true, "Selector": "we create", "selectorShort": "create", "MarkedSent": "-----> we !!!  -----> create !!!  the present at such an enormous rate that -----> we !!!  have no resources left to cling to the past.", "sortedWord": "None", "Identifyer": null, "identifyer": 93910, "year": "2015"}, {"autor": "honcho", "date": "2015-03-29 20:09:00", "content": "..... It allows highly selective adjustments which can transform an ordinary conversion.... True, although I often feel use of the structure slider should be prohibited until the user has passed a test. Creating and using custom presets is the way forward. I see them as a starting point, then it's back to Photoshop for refined selections and adjustments.", "link": "https://www.l-camera-forum.com/topic/242924-silver-efex-pro-alternative-and-cheaper-software/?tab=comments#comment-2789332", "origin": "L-forum", "suborigin": "242924-silver-efex-pro-alternative-and-cheaper-software", "result": true, "Selector": "creating", "selectorShort": "create", "MarkedSent": "..... it allows highly selective adjustments which can transform an ordinary conversion.... true, although i often feel use of the structure slider should be prohibited until the user has passed a test. -----> creating !!!  and using custom presets is the way forward. i see them as a starting point, then it's back to photoshop for refined selections and adjustments.", "sortedWord": "None", "Identifyer": null, "identifyer": 94094, "year": "2015"}, {"autor": "bernie.lcf", "date": "2015-05-03 09:49:00", "content": "I have been walking around Cafe Central a couple of times for the last 3-4 weeks. It's close to my home and I have a newborn that I am taking on long walks through the parks etc. Anyway, I noticed that this cafe is meanwhile just as packed as a lot of the other ones. So, if you need a very casual first meeting point where people would show up over the course of \"several hours\", you may want to pick another place. By the way: McDonalds coffee is actually not bad. Well, you have to know that McDonalds in Austria (and probably some other countries as well) has built so called \"McCafe\" corners in their restaurants. They use WMF 8000S series coffee machines (maybe the older 1500 depending on location). This is probably as good as it gets with an automatic coffee machine (if used with proper beans) and usually better than the large size classical espresso machines that are hard to clean and therefore don't get cleaned too well at most places. Creates a smoky taste in the coffee... Edited May 3, 2015 by bernie.lcf", "link": "https://www.l-camera-forum.com/topic/235444-the-winner-is-announced-vienna-one-challenge-2015/page/4/?tab=comments#comment-2809246", "origin": "L-forum", "suborigin": "235444-the-winner-is-announced-vienna-one-challenge-2015", "result": true, "Selector": "creates", "selectorShort": "create", "MarkedSent": "i have been walking around cafe central a couple of times for the last 3-4 weeks. it's close to my home and i have a newborn that i am taking on long walks through the parks etc. anyway, i noticed that this cafe is meanwhile just as packed as a lot of the other ones. so, if you need a very casual first meeting point where people would show up over the course of \"several hours\", you may want to pick another place. by the way: mcdonalds coffee is actually not bad. well, you have to know that mcdonalds in austria (and probably some other countries as well) has built so called \"mccafe\" corners in their restaurants. they use wmf 8000s series coffee machines (maybe the older 1500 depending on location). this is probably as good as it gets with an automatic coffee machine (if used with proper beans) and usually better than the large size classical espresso machines that are hard to clean and therefore don't get cleaned too well at most places. -----> creates !!!  a smoky taste in the coffee... edited may 3, 2015 by bernie.lcf", "sortedWord": "None", "Identifyer": null, "identifyer": 133489, "year": "2015"}, {"autor": "jip", "date": "2015-07-03 10:36:00", "content": "Nice having you all!! --img--  I also created a 'Facebook event' for the meeting, so if you are on Facebook add me: http://facebook.com/jipvankuijk and I will invite you for the 'event'. If not send me a PM (again if you already have) with confirmation that you ARE attending so I can make a list of people attending etc. Jip", "link": "https://www.l-camera-forum.com/topic/245379-leica-meeting-in-rotterdam-with-photowalk/page/2/?tab=comments#comment-2846853", "origin": "L-forum", "suborigin": "245379-leica-meeting-in-rotterdam-with-photowalk", "result": true, "Selector": "i also created", "selectorShort": "create", "MarkedSent": "nice having you all!! --img--  -----> i !!!  -----> also !!!  -----> created !!!  a 'facebook event' for the meeting, so if you are on facebook add me: http://facebook.com/jipvankuijk and i will invite you for the 'event'. if not send me a pm (again if you already have) with confirmation that you are attending so i can make a list of people attending etc. jip", "sortedWord": "None", "Identifyer": null, "identifyer": 133705, "year": "2015"}], "name": "Leicasortedout2015create"}