{"interestingcomments": [{"autor": "jaapv", "date": "2007-08-25 23:51:00", "content": "Afaik the VisoII should clear the M8, with the screw fully screwed in. The only possible hassle (on the III) might be that the tripping screw is the short version. It is either find the lengthening screw in that case or a minor diy solution. The main problem of the Viso II is that it lacks the quick return mirror. A decent Visoflex III should set you back about 100 to 150 $; a single prism finder probably not much less. The Visoflex II - prices are all over the place, some shops will give them away free or for 10$, sometimes they go for fancy prices on e-bay. I would put them at 75-125$. They most interesting use of any Visosflex is for macro, where the straight finder is a handy accessory,but it does switch left and right.. The 200, although it has its advocates and is a nice lens, is, imo, too far behind the 135/4.0 to be of real interest. The 280 is more interesting, if only because of its focal length.", "link": "https://www.l-camera-forum.com/topic/31884-visoflex-question/?tab=comments#comment-338114", "origin": "L-forum", "suborigin": "31884-visoflex-question", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "afaik the visoii should clear the m8, with the screw fully screwed in. the only possible hassle (on the iii) might be that the tripping screw is the short version. it is either find the lengthening screw in that case or a minor -----> diy !!!  solution. the main problem of the viso ii is that it lacks the quick return mirror. a decent visoflex iii should set you back about 100 to 150 $; a single prism finder probably not much less. the visoflex ii - prices are all over the place, some shops will give them away free or for 10$, sometimes they go for fancy prices on e-bay. i would put them at 75-125$. they most interesting use of any visosflex is for macro, where the straight finder is a handy accessory,but it does switch left and right.. the 200, although it has its advocates and is a nice lens, is, imo, too far behind the 135/4.0 to be of real interest. the 280 is more interesting, if only because of its focal length.", "sortedWord": "None", "Identifyer": null, "identifyer": 43624, "year": "2007"}, {"autor": "egibaud", "date": "2007-04-11 11:59:00", "content": "Great!!! thank you Just one question.... is the M8 cheaper when buying in DIY Kit? --img-- ", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/9/?tab=comments#comment-225585", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "great!!! thank you just one question.... is the m8 cheaper when buying in -----> diy !!!  kit? --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 45442, "year": "2007"}, {"autor": "hugov", "date": "2007-06-17 10:07:00", "content": "Sandy, you're probably right, but the 997x series specifically don't seem to have anything that is 16-bits and fast enough. Do you know of other manufacturers that make CCD-specific ADC/AFE devices? On a side note, I still have some doubts that it is in fact true 16-bit - seems suspicious that Leica designed in a 16-bit ADC but it only outputs 8-bit RAW files. I suspect that Mark is right, and the ADC is actually only 14-bits. Regarding timing generation, it is possible that the ADC/AFE device could generate the timing - many of the Analog Devices AD99xx AFE parts have integrated timing generators. Mark, I certainly wouldn't have wanted to desolder the CCD either... they are notoriously static-sensitive, and I doubt you can get a replacement sensor at a reasonable price! p.s. anyone know what happened to Huw Finney and his DIY digital Leica M2? (Leica and Rangefinders Forum: M2aD Project, A bit of premature fantasy. - photo.net and google for the other threads describing it)", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/14/?tab=comments#comment-283157", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "sandy, you're probably right, but the 997x series specifically don't seem to have anything that is 16-bits and fast enough. do you know of other manufacturers that make ccd-specific adc/afe devices? on a side note, i still have some doubts that it is in fact true 16-bit - seems suspicious that leica designed in a 16-bit adc but it only outputs 8-bit raw files. i suspect that mark is right, and the adc is actually only 14-bits. regarding timing generation, it is possible that the adc/afe device could generate the timing - many of the analog devices ad99xx afe parts have integrated timing generators. mark, i certainly wouldn't have wanted to desolder the ccd either... they are notoriously static-sensitive, and i doubt you can get a replacement sensor at a reasonable price! p.s. anyone know what happened to huw finney and his -----> diy !!!  digital leica m2? (leica and rangefinders forum: m2ad project, a bit of premature fantasy. - photo.net and google for the other threads describing it)", "sortedWord": "None", "Identifyer": null, "identifyer": 45536, "year": "2007"}, {"autor": "ericperlberg", "date": "2007-04-10 10:37:00", "content": "I'm hopeless with even the simplist diy stuff and I'm just blown away at your skill in pulling this off. I look forward with some apprehension to your exploration of how the M8 photographer is put together.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/6/?tab=comments#comment-224558", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i'm hopeless with even the simplist diy stuff and i'm just blown away at your -----> skill !!!  in pulling this off.", "sortedWord": "skill", "Identifyer": null, "identifyer": 45383, "year": "2007"}], "name": "Leicasortedout2007diy"}