{"interestingcomments": [{"autor": "lct", "date": "2009-04-25 17:47:00", "content": "I am having a Leitz 5.5 p/n 11251 machined to accept the standard Leica 39mm filters including the IR/UV. I'll not say who is doing it until I get it back and try it. If it works, I'll tell you all about it. And if it works, it will be the most cost effective secure method of adapting these filters to the 40mm Summicron C. Would be interesting to compare it with mine. 100% DIY but needs a bit of grinding though. One just needs: - a 39mm UV-IR Leica filter (#13410) - a Leica hood #12518 dedicated to the 'cron 40/2 - a 37mm rubber ring - a pin and a die grinder 1. Grind the filter housing of the hood in order to enlarge its inner diameter to 37mm: --img--  2. Remove the blocking ring of the filter with a pin or same: --img--  3. Insert the glass into the filter housing: --img--  4. Insert the rubber ring over the glass: --img--  5. Screw-in the hood and that's all. Edited April 25, 2009 by lct", "link": "https://www.l-camera-forum.com/topic/33548-uvir-filter-for-leica-summicron-c-40mm/page/2/?tab=comments#comment-881442", "origin": "L-forum", "suborigin": "33548-uvir-filter-for-leica-summicron-c-40mm", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i am having a leitz 5.5 p/n 11251 machined to accept the standard leica 39mm filters including the ir/uv. i'll not say who is doing it until i get it back and try it. if it works, i'll tell you all about it. and if it works, it will be the most cost effective secure method of adapting these filters to the 40mm summicron c. would be interesting to compare it with mine. 100% -----> diy !!!  but needs a bit of grinding though. one just needs: - a 39mm uv-ir leica filter (#13410) - a leica hood #12518 dedicated to the 'cron 40/2 - a 37mm rubber ring - a pin and a die grinder 1. grind the filter housing of the hood in order to enlarge its inner diameter to 37mm: --img--  2. remove the blocking ring of the filter with a pin or same: --img--  3. insert the glass into the filter housing: --img--  4. insert the rubber ring over the glass: --img--  5. screw-in the hood and that's all. edited april 25, 2009 by lct", "sortedWord": "None", "Identifyer": null, "identifyer": 45776, "year": "2009"}], "name": "Leicasortedout2009diy"}