{"interestingcomments": [{"autor": "wlaidlaw", "date": "2008-04-18 08:58:00", "content": "I tried to repair ribbon cables a couple of times by just soldering very fine individual wires, stripped out an old transformer, in place of the track that had cracked - not very satisfactory. I used to have to take off the tops of my various Contax SLR cameras as the copper tracks on the power switches/shutter release used to corrode from breath condensation and needed cleaning regularly. The ribbon cables seem to have been inserted by a worker with a shovel and were always crumpled and twisted. I developed a good relationship with Kyocera Contax UK and in the end had quite a few spares of the relevant ribbon cables for 139/RTS II/RTS III and RX cameras. You need a high quality thermostatic micro soldering iron, micro thin solder and a steady hand to replace them. When you are finished, you must remember to remove the flux (TCE or BCFE is best for this) or it will all corrode again. I always had plenty of BCFE (Bromo-chloro-fluor-ethane) as that used to be used in racing car fire extinguishing systems rather than the horrible corrosive foam they use nowadays, because it is kinder to the ozone layer. BCFE had to be replaced every 3 to 5 years and I would keep the old stuff, as it made wonderful cleaning fluid. The mechanics never used to mind if a fire extinguisher got fired off by accident, as it cleaned the whole engine beautifully. Now if you fire off an extinguisher by accident, they will hang you up by your finger nails, as it is hours of work to clean the horrible gunk off. When I gave up on film SLR's, I gave all my spare ribbon cables to my local repairer. Wilson", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/15/?tab=comments#comment-540055", "origin": "L-forum", "suborigin": "21079-anatomy-of-the-leica-m8", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i tried to repair ribbon cables a couple of times by just soldering very fine individual wires, stripped out an old transformer, in place of the track that had cracked - not very satisfactory. i used to have to take off the tops of my various contax slr cameras as the copper tracks on the power switches/shutter release used to corrode from breath condensation and needed cleaning regularly. the ribbon cables seem to have been inserted by a worker with a shovel and were always crumpled and twisted. -----> i !!!  -----> developed !!!  a good relationship with kyocera contax uk and in the end had quite a few spares of the relevant ribbon cables for 139/rts ii/rts iii and rx cameras. you need a high quality thermostatic micro soldering iron, micro thin solder and a steady hand to replace them. when you are finished, you must remember to remove the flux (tce or bcfe is best for this) or it will all corrode again. i always had plenty of bcfe (bromo-chloro-fluor-ethane) as that used to be used in racing car fire extinguishing systems rather than the horrible corrosive foam they use nowadays, because it is kinder to the ozone layer. bcfe had to be replaced every 3 to 5 years and i would keep the old stuff, as it made wonderful cleaning fluid. the mechanics never used to mind if a fire extinguisher got fired off by accident, as it cleaned the whole engine beautifully. now if you fire off an extinguisher by accident, they will hang you up by your finger nails, as it is hours of work to clean the horrible gunk off. when i gave up on film slr's, i gave all my spare ribbon cables to my local repairer. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 45569, "year": "2008"}, {"autor": "Annibale G.", "date": "2008-04-11 18:12:00", "content": " Anyone can tell his/her own developing tipe for Kodak Tri-X in D76? Just to cross-check with mine. Kodak Tri - X 400 in 400 asa Developing time: 11:30 kodak Tri - X 400 pushed 800 asa Developing time : 13:00 I'm also trying to find a correct time for Kodak T- Max 400 pushed at 400 , 800, 1600,3200. Developed in D76 as well. If you know, I'm pleased to get the correct time. Bye Annibale", "link": "https://www.l-camera-forum.com/topic/50424-developing-tri-x-in-d76/?tab=comments#comment-534966", "origin": "L-forum", "suborigin": "50424-developing-tri-x-in-d76", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": " anyone can tell his/her own developing tipe for kodak tri-x in d76? just to cross-check with mine. kodak tri - x 400 in 400 asa developing time: 11:30 kodak tri - x 400 pushed 800 asa developing time : 13:00 i'm also trying to find a correct time for kodak t- max 400 pushed at 400 , 800, 1600,3200. -----> developed !!!  in d76 as well. if you know, i'm pleased to get the correct time. bye annibale", "sortedWord": "None", "Identifyer": null, "identifyer": 107471, "year": "2008"}, {"autor": "AlexEs", "date": "2008-04-11 19:18:00", "content": "First, I used the standard times, you can find them inside the filmbox: D76 1:1, 9:45 But I was not satiesfied with the results and found an advice at the Kodak-homepage. Kodakt says: \"You can develop one 135-3 roll (80 square inches) in 473 mL (16 ounces) or two rolls together in 946 mL (one quart) of diluted developer. If you process one 135-36 roll in a 237 mL (8-ounce) tank or two 135-36 rolls in a 473 mL (16-ounce) tank, increase the development time by 10 percent.\" Now I develop the Tri-X like this: D76 1:1, 10:40. The results are much better. So, for the T-Max 400 I do it in the same way: 10 percent more... D76 1:1, 13:45 Good luck, Alex", "link": "https://www.l-camera-forum.com/topic/50424-developing-tri-x-in-d76/?tab=comments#comment-535032", "origin": "L-forum", "suborigin": "50424-developing-tri-x-in-d76", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "first, i used the standard times, you can find them inside the filmbox: d76 1:1, 9:45 but i was not satiesfied with the results and found an advice at the kodak-homepage. kodakt says: \"you can develop one 135-3 roll (80 square inches) in 473 ml (16 ounces) or two rolls together in 946 ml (one quart) of diluted developer. if you process one 135-36 roll in a 237 ml (8-ounce) tank or two 135-36 rolls in a 473 ml (16-ounce) tank, increase the development time by 10 percent.\" now -----> i !!!  -----> develop !!!  the tri-x like this: d76 1:1, 10:40. the results are much better. so, for the t-max 400 i do it in the same way: 10 percent more... d76 1:1, 13:45 good luck, alex", "sortedWord": "None", "Identifyer": null, "identifyer": 107473, "year": "2008"}], "name": "Leicasortedout2008develop"}