{"interestingcomments": [{"autor": "martinot", "date": "2020-09-07 22:11:00", "content": "On 9/6/2020 at 7:04 PM, jaapv said: I remember film and darkroom as a constant battle with dust... Yes. We have to be lucky that the dust in our computers do not migrate into the photos while we develop them in Lightroom or Capture One!", "link": "https://www.l-camera-forum.com/topic/312921-sensor-cleaning/page/2/?tab=comments#comment-4041876", "origin": "L-forum", "suborigin": "312921-sensor-cleaning", "result": true, "Selector": "we develop", "selectorShort": "develop", "MarkedSent": "on 9/6/2020 at 7:04 pm, jaapv said: i remember film and darkroom as a constant battle with dust... yes. -----> we !!!  have to be lucky that the dust in our computers do not migrate into the photos while -----> we !!!  -----> develop !!!  them in lightroom or capture one!", "sortedWord": "None", "Identifyer": null, "identifyer": 15750, "year": "2020"}, {"autor": "simonCL", "date": "2020-02-23 07:37:00", "content": " Hi all! Apologies in advance for the length of this post! I was wondering if you all are able to give me some advice or words of wisdom on whether I should get a Rangefinder Leica. At the moment I’m currently using and enjoying my Leica CL & 23mm f2 Summicron. Purchased in Oct 2018. I absolutely love shooting with the CL and for me it was the upgrade I was always wanting. I even adapt some rare and unique vintage m42 lenses to it and get some amazing results. Now I’m no professional photographer, just a hobby shooter but the Leica CL I have had really developed my love and passion for photography. At the time of purchasing the CL I was using a Nikon D7500 which I still have (but never use) so for me, at the time the CL was the next step up, and I never thought of going for a rangefinder (couldn’t afford the m10 and lenses anyway lol). But now having visited the Sydney Leica store on many occasions to try out the M10 and the rangefinder systems, I’ve grown more interest for a Rangefinder. I’m interested in the M240, maybe the M262. I like the appeal of a brassing body though (a bit of individualism I’d say). But honestly I’m not sure which system to go for (and I don’t have the money for a new M10). What are the PROS and CONS for each system? What makes you want to stay with that system? (if you have one) what would you recommend I do or go for? Now I’ve done heaps of research and reviews on both systems but I really want to hear from everyday people who use them. Thanks!", "link": "https://www.l-camera-forum.com/topic/306735-m10-m240-m262-or-stay-with-leica-cl/?tab=comments#comment-3918090", "origin": "L-forum", "suborigin": "306735-m10-m240-m262-or-stay-with-leica-cl", "result": true, "Selector": "i have had really developed", "selectorShort": "develop", "MarkedSent": " hi all! apologies in advance for the length of this post! i was wondering if you all are able to give me some advice or words of wisdom on whether i should get a rangefinder leica. at the moment i’m currently using and enjoying my leica cl & 23mm f2 summicron. purchased in oct 2018. i absolutely love shooting with the cl and for me it was the upgrade i was always wanting. i even adapt some rare and unique vintage m42 lenses to it and get some amazing results. now -----> i !!! ’m no professional photographer, just a hobby shooter but the leica cl -----> i !!!  -----> have !!!  -----> had !!!  -----> really !!!  -----> developed !!!  my love and passion for photography. at the time of purchasing the cl i was using a nikon d7500 which i still have (but never use) so for me, at the time the cl was the next step up, and i never thought of going for a rangefinder (couldn’t afford the m10 and lenses anyway lol). but now having visited the sydney leica store on many occasions to try out the m10 and the rangefinder systems, i’ve grown more interest for a rangefinder. i’m interested in the m240, maybe the m262. i like the appeal of a brassing body though (a bit of individualism i’d say). but honestly i’m not sure which system to go for (and i don’t have the money for a new m10). what are the pros and cons for each system? what makes you want to stay with that system? (if you have one) what would you recommend i do or go for? now i’ve done heaps of research and reviews on both systems but i really want to hear from everyday people who use them. thanks!", "sortedWord": "None", "Identifyer": null, "identifyer": 18022, "year": "2020"}, {"autor": "Sjz", "date": "2020-09-22 18:43:00", "content": "I could be overthinking things (although not sure how to interpret the above tables) could it be as simple as the M10M offers an unusual amount of recovery from the deep shadows, so people bring that detail out, ‘flattening’ the image? On reflection ‘flattening’ is not the right word, ‘creating a different style of image” would be more accurate. People can of course use curves or sliders to show far more of their image as black. i have found the Raw files look less ‘flat’ when I have been using colour filters. (i do know that posting my photos here and receiving comments helps me develop my thinking, and hopefully the end result.)", "link": "https://www.l-camera-forum.com/topic/313364-leica-monochrom-ccd-who%E2%80%99s-selling-why/page/3/?tab=comments#comment-4050513", "origin": "L-forum", "suborigin": "313364-leica-monochrom-ccd-who%E2%80%99s-selling-why", "result": true, "Selector": "me develop", "selectorShort": "develop", "MarkedSent": "i could be overthinking things (although not sure how to interpret the above tables) could it be as simple as the m10m offers an unusual amount of recovery from the deep shadows, so people bring that detail out, ‘flattening’ the image? on reflection ‘flattening’ is not the right word, ‘creating a different style of image” would be more accurate. people can of course use curves or sliders to show far more of their image as black. i have found the raw files look less ‘flat’ when i have been using colour filters. (i do know that posting my photos here and receiving comments helps -----> me !!!  -----> develop !!!  my thinking, and hopefully the end result.)", "sortedWord": "None", "Identifyer": null, "identifyer": 25261, "year": "2020"}, {"autor": "Ken Abrahams", "date": "2020-01-30 04:41:00", "content": "I have the M10M but I wouldn't be letting the M9M go. The M9M is unique in that its CCD sensor and lower megapixel sensor renders much nicer textures for the images I take on the street. Its harder to achieve the same exaggerated grain quality on the M10M in my assessment so far. The M10M is a very different camera with extremely high quality images at high ISO values, along with better functions such as quiet shutter. The M9M shutter sound is almost rude in comparison. There is no point trying to emulate the same quality of images possible with the M9M and instead the M10M offers a whole new way to capture and process images to one's individual styles of photography. I am loving the M10M and with further explorations I will develop a workflow that this camera along with my creativity is suited to. Its kind of a co creation process between camera and self, a personal development project in my view.", "link": "https://www.l-camera-forum.com/topic/305409-jono-slack-leica-m10-monochrom-field-report/page/8/?tab=comments#comment-3902397", "origin": "L-forum", "suborigin": "305409-jono-slack-leica-m10-monochrom-field-report", "result": true, "Selector": "i will develop", "selectorShort": "develop", "MarkedSent": "i have the m10m but i wouldn't be letting the m9m go. the m9m is unique in that its ccd sensor and lower megapixel sensor renders much nicer textures for the images i take on the street. its harder to achieve the same exaggerated grain quality on the m10m in my assessment so far. the m10m is a very different camera with extremely high quality images at high iso values, along with better functions such as quiet shutter. the m9m shutter sound is almost rude in comparison. there is no point trying to emulate the same quality of images possible with the m9m and instead the m10m offers a whole new way to capture and process images to one's individual styles of photography. -----> i !!!  am loving the m10m and with further explorations -----> i !!!  -----> will !!!  -----> develop !!!  a workflow that this camera along with my creativity is suited to. its kind of a co creation process between camera and self, a personal development project in my view.", "sortedWord": "None", "Identifyer": null, "identifyer": 25510, "year": "2020"}, {"autor": "kengai", "date": "2020-04-04 09:13:00", "content": " I'm rediscovering the pleasure of black and white, going back to the years when I was developing the TRI-X exposed at 1600/3200 ASA and in print I was still pulling for very contrasted blacks and whites. Now I'm thinking about whether to convert in b&w the M10 files or make some sacrifice to buy a used M246?", "link": "https://www.l-camera-forum.com/topic/308172-bw-passion-is-back/?tab=comments#comment-3946431", "origin": "L-forum", "suborigin": "308172-bw-passion-is-back", "result": true, "Selector": "i was developing", "selectorShort": "develop", "MarkedSent": " -----> i !!! 'm rediscovering the pleasure of black and white, going back to the years when -----> i !!!  -----> was !!!  -----> developing !!!  the tri-x exposed at 1600/3200 asa and in print -----> i !!!  -----> was !!!  still pulling for very contrasted blacks and whites. now i'm thinking about whether to convert in b&w the m10 files or make some sacrifice to buy a used m246?", "sortedWord": "None", "Identifyer": null, "identifyer": 26592, "year": "2020"}, {"autor": "otto.f", "date": "2020-04-10 06:22:00", "content": " On 4/4/2020 at 11:13 AM, kengai said: I'm rediscovering the pleasure of black and white, going back to the years when I was developing the TRI-X exposed at 1600/3200 ASA and in print I was still pulling for very contrasted blacks and whites. Now I'm thinking about whether to convert in b&w the M10 files or make some sacrifice to buy a used M246? Having owned the M10 I can say that I never found such a nice noise on digital M’s as with the M10 between 1600 and 3200 ASA, but that was in color. And it is a very decent noise. The TriX images from 1600/3200 ASA are very rough and coarse are a whole different style. I don’t think you can attain that with an M10 and I doubt if that’s possible with an M246. It will all come out too decent I guess. It could be possible with the MM1. The first introduction of the MM1 in LFI showed a series a photographer who had made it very rough, harsh and ‘grainy’ but I can’t say I direct associated it with TriX on 35mm film. More with Anton Corbijn’s medium format pushed TriX with Hasselblad. Of course you have to find your own outcome for your longings, but I agree with maron in post #2. You never loose with buying an M4 and start with TriX again in Rodinal. This developer and the camera have a sheer endless useability. And the M4 can always be sold with profit of you turn out to look for something else. Our memory is not very trustworthy. Maybe what you visualize in your head has been altered by 15 years of digital photography already and cannot be replicated anymore. We might now be used to a certain level of cleanliness of photo’s since the digital era started.", "link": "https://www.l-camera-forum.com/topic/308172-bw-passion-is-back/?tab=comments#comment-3950662", "origin": "L-forum", "suborigin": "308172-bw-passion-is-back", "result": true, "Selector": "i was developing", "selectorShort": "develop", "MarkedSent": " on 4/4/2020 at 11:13 am, kengai said: -----> i !!! 'm rediscovering the pleasure of black and white, going back to the years when -----> i !!!  -----> was !!!  -----> developing !!!  the tri-x exposed at 1600/3200 asa and in print -----> i !!!  -----> was !!!  still pulling for very contrasted blacks and whites. now i'm thinking about whether to convert in b&w the m10 files or make some sacrifice to buy a used m246? having owned the m10 i can say that i never found such a nice noise on digital m’s as with the m10 between 1600 and 3200 asa, but that was in color. and it is a very decent noise. the trix images from 1600/3200 asa are very rough and coarse are a whole different style. i don’t think you can attain that with an m10 and i doubt if that’s possible with an m246. it will all come out too decent i guess. it could be possible with the mm1. the first introduction of the mm1 in lfi showed a series a photographer who had made it very rough, harsh and ‘grainy’ but i can’t say i direct associated it with trix on 35mm film. more with anton corbijn’s medium format pushed trix with hasselblad. of course you have to find your own outcome for your longings, but i agree with maron in post #2. you never loose with buying an m4 and start with trix again in rodinal. this developer and the camera have a sheer endless useability. and the m4 can always be sold with profit of you turn out to look for something else. our memory is not very trustworthy. maybe what you visualize in your head has been altered by 15 years of digital photography already and cannot be replicated anymore. we might now be used to a certain level of cleanliness of photo’s since the digital era started.", "sortedWord": "None", "Identifyer": null, "identifyer": 26598, "year": "2020"}, {"autor": "Topsy", "date": "2020-11-03 17:33:00", "content": "23 hours ago, TomB_tx said: \"...without winding it 100% back!\" For 60 years I've always rewound 35mm film completely into the cassette. Never found a reason not to. Because it makes it easier to load the film onto a dev spool if the leader is left out. It's how I was taught and I still do it even though I no longer develop myself.", "link": "https://www.l-camera-forum.com/topic/313311-rumour-about-a-new-m6-1984-from-leica/page/3/?tab=comments#comment-4073375", "origin": "L-forum", "suborigin": "313311-rumour-about-a-new-m6-1984-from-leica", "result": true, "Selector": "i no longer develop", "selectorShort": "develop", "MarkedSent": "23 hours ago, tomb_tx said: \"...without winding it 100% back!\" for 60 years i've always rewound 35mm film completely into the cassette. never found a reason not to. because it makes it easier to load the film onto a dev spool if the leader is left out. it's how i was taught and -----> i !!!  still do it even though -----> i !!!  -----> no !!!  -----> longer !!!  -----> develop !!!  myself.", "sortedWord": "None", "Identifyer": null, "identifyer": 7030, "year": "2020"}, {"autor": "BradS", "date": "2020-11-03 18:49:00", "content": "7 minutes ago, lmans said: I process my own film but actually prefer to wind all the way into the cassette. That way in the field, I am not accidentally confusing what cassette has been used and which ones not. Just an added measure. It is not that big of a deal to either retrieve the film leader from the cassette or usually I just pry open the cassette when processing. I solved this problem by winding the exposed roll so that the leader is almost completely inside the canister - leaving just a half inch or so sticking out. I'll also keep exposed rolls in a separate bag from fresh. I develop all my own B&W and leaving the leader out allows the leader to be trimmed off in daylight, which is hugely valuable to me that it is worth the small extra effort required. Leaving the leader out with the M4-P and M6 however, has proven to be quite difficult for me so I still have an ordinary bottle opener in with the developing tank.", "link": "https://www.l-camera-forum.com/topic/313311-rumour-about-a-new-m6-1984-from-leica/page/3/?tab=comments#comment-4073419", "origin": "L-forum", "suborigin": "313311-rumour-about-a-new-m6-1984-from-leica", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "7 minutes ago, lmans said: i process my own film but actually prefer to wind all the way into the cassette. that way in the field, i am not accidentally confusing what cassette has been used and which ones not. just an added measure. it is not that big of a deal to either retrieve the film leader from the cassette or usually i just pry open the cassette when processing. i solved this problem by winding the exposed roll so that the leader is almost completely inside the canister - leaving just a half inch or so sticking out. i'll also keep exposed rolls in a separate bag from fresh. -----> i !!!  -----> develop !!!  all my own b&w and leaving the leader out allows the leader to be trimmed off in daylight, which is hugely valuable to me that it is worth the small extra effort required. leaving the leader out with the m4-p and m6 however, has proven to be quite difficult for me so i still have an ordinary bottle opener in with the developing tank.", "sortedWord": "None", "Identifyer": null, "identifyer": 7032, "year": "2020"}, {"autor": "nicci78", "date": "2020-09-18 05:05:00", "content": "From Sigma CEO interview at Imaging Ressource : « No plan to make APS-C L-mount cameras yet. If we continue the fp concept, probably we will stay with full-frame. But this is just an assumption. We don’t have such a plan right now. But just making an assumption for the future, if the sensor has large pixel numbers like 50, 60, 75 megapixels, you can take a very, very good image using APS-C with a crop mode. So in this case, you can use a very compact lens » https://www.imaging-resource.com/news/2020/09/16/sigma-interview-covid-fp-lens-designs-fld-sld-glass-and-more Looks like they are in a decision phase. Does it worth it to make APS-C cameras, when you can make very small full frame one. Even pixel count is in favour of 24x36. On the other hand, there are some hope : « we will probably develop brand new lenses for Leica L-mount APS-C cameras. » This thread is just to try to guess manufacturers next move. Do they still need APS-C or focusing on full frame is enough ? They may be still undecided. Or they already have plan to give up APS-C and m4/3.", "link": "https://www.l-camera-forum.com/topic/312975-the-end-of-aps-c-and-m43-cameras/page/4/?tab=comments#comment-4047906", "origin": "L-forum", "suborigin": "312975-the-end-of-aps-c-and-m43-cameras", "result": true, "Selector": "we will probably develop", "selectorShort": "develop", "MarkedSent": "from sigma ceo interview at imaging ressource : « no plan to make aps-c l-mount cameras yet. if we continue the fp concept, probably we will stay with full-frame. but this is just an assumption. we don’t have such a plan right now. but just making an assumption for the future, if the sensor has large pixel numbers like 50, 60, 75 megapixels, you can take a very, very good image using aps-c with a crop mode. so in this case, you can use a very compact lens » https://www.imaging-resource.com/news/2020/09/16/sigma-interview-covid-fp-lens-designs-fld-sld-glass-and-more looks like they are in a decision phase. does it worth it to make aps-c cameras, when you can make very small full frame one. even pixel count is in favour of 24x36. on the other hand, there are some hope : « -----> we !!!  -----> will !!!  -----> probably !!!  -----> develop !!!  brand new lenses for leica l-mount aps-c cameras. » this thread is just to try to guess manufacturers next move. do they still need aps-c or focusing on full frame is enough ? they may be still undecided. or they already have plan to give up aps-c and m4/3.", "sortedWord": "None", "Identifyer": null, "identifyer": 44609, "year": "2020"}, {"autor": "jaapv", "date": "2020-09-18 08:10:00", "content": " 3 hours ago, nicci78 said: From Sigma CEO interview at Imaging Ressource : « No plan to make APS-C L-mount cameras yet. If we continue the fp concept, probably we will stay with full-frame. But this is just an assumption. We don’t have such a plan right now. But just making an assumption for the future, if the sensor has large pixel numbers like 50, 60, 75 megapixels, you can take a very, very good image using APS-C with a crop mode. So in this case, you can use a very compact lens » https://www.imaging-resource.com/news/2020/09/16/sigma-interview-covid-fp-lens-designs-fld-sld-glass-and-more Looks like they are in a decision phase. Does it worth it to make APS-C cameras, when you can make very small full frame one. Even pixel count is in favour of 24x36. On the other hand, there are some hope : « we will probably develop brand new lenses for Leica L-mount APS-C cameras. » This thread is just to try to guess manufacturers next move. Do they still need APS-C or focusing on full frame is enough ? They may be still undecided. Or they already have plan to give up APS-C and m4/3. Isn't it telling that virtually nobody else on this site is making such a big thing of the lens choice for APS-C? For the CL/TL, they just grab an M lens and get on with it. I guess that lens manufacturers are not really interested in catering for a customer base of one.", "link": "https://www.l-camera-forum.com/topic/312975-the-end-of-aps-c-and-m43-cameras/page/4/?tab=comments#comment-4047970", "origin": "L-forum", "suborigin": "312975-the-end-of-aps-c-and-m43-cameras", "result": true, "Selector": "we will probably develop", "selectorShort": "develop", "MarkedSent": " 3 hours ago, nicci78 said: from sigma ceo interview at imaging ressource : « no plan to make aps-c l-mount cameras yet. if we continue the fp concept, probably we will stay with full-frame. but this is just an assumption. we don’t have such a plan right now. but just making an assumption for the future, if the sensor has large pixel numbers like 50, 60, 75 megapixels, you can take a very, very good image using aps-c with a crop mode. so in this case, you can use a very compact lens » https://www.imaging-resource.com/news/2020/09/16/sigma-interview-covid-fp-lens-designs-fld-sld-glass-and-more looks like they are in a decision phase. does it worth it to make aps-c cameras, when you can make very small full frame one. even pixel count is in favour of 24x36. on the other hand, there are some hope : « -----> we !!!  -----> will !!!  -----> probably !!!  -----> develop !!!  brand new lenses for leica l-mount aps-c cameras. » this thread is just to try to guess manufacturers next move. do they still need aps-c or focusing on full frame is enough ? they may be still undecided. or they already have plan to give up aps-c and m4/3. isn't it telling that virtually nobody else on this site is making such a big thing of the lens choice for aps-c? for the cl/tl, they just grab an m lens and get on with it. i guess that lens manufacturers are not really interested in catering for a customer base of one.", "sortedWord": "None", "Identifyer": null, "identifyer": 44613, "year": "2020"}, {"autor": "AlanZ", "date": "2020-06-27 13:08:00", "content": " Hello. Newbie to this forum but long time Leica user. I just today received my Leica TL2. I am a Leica shooter but I’ve been using a M9 and a M4-2. Can someone advise me on just a starting point with general menu settings. Most of my shots with the TL2 will be landscapes, sunsets, and nature shots. I know as I get used to it I’ll develop menu settings that fit me but can someone get me started so I can get out and use this today and tomorrow. Thank you.", "link": "https://www.l-camera-forum.com/topic/310920-best-general-settings/?tab=comments#comment-4000215", "origin": "L-forum", "suborigin": "310920-best-general-settings", "result": true, "Selector": "i’ll develop", "selectorShort": "develop", "MarkedSent": " hello. newbie to this forum but long time leica user. i just today received my leica tl2. i am a leica shooter but i’ve been using a m9 and a m4-2. can someone advise me on just a starting point with general menu settings. most of my shots with the tl2 will be landscapes, sunsets, and nature shots. -----> i !!!  know as -----> i !!!  get used to it -----> i !!! -----> ’ll !!!  -----> develop !!!  menu settings that fit me but can someone get me started so -----> i !!!  can get out and use this today and tomorrow. thank you.", "sortedWord": "None", "Identifyer": null, "identifyer": 45602, "year": "2020"}, {"autor": "masjah", "date": "2020-07-15 20:20:00", "content": "1 minute ago, AZN said: FWIW, the R lenses on the 24 MPix Leica SL (Typ 601) work brilliantly, especially with the Leica R->L lens mount adapter. For larger resolutions they work equally well on the Sony AR7III/ IV (I have the latter). From my perspective, cannot see the the point in spending vast amounts of money on a new SL2 or Canon R6 etc. when there are so many v.good options already available much more cheaply on the 2nd hand market. I have a particular need in that I've developed a benign tremor in my dotage so I need IBIS to use my R lenses off tripod, otherwise I could have managed with my M240 +EVF.", "link": "https://www.l-camera-forum.com/topic/311297-canon-r6/?tab=comments#comment-4009334", "origin": "L-forum", "suborigin": "311297-canon-r6", "result": true, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "1 minute ago, azn said: fwiw, the r lenses on the 24 mpix leica sl (typ 601) work brilliantly, especially with the leica r->l lens mount adapter. for larger resolutions they work equally well on the sony ar7iii/ iv (i have the latter). from my perspective, cannot see the the point in spending vast amounts of money on a new sl2 or canon r6 etc. when there are so many v.good options already available much more cheaply on the 2nd hand market. -----> i !!!  have a particular need in that -----> i !!! 've -----> developed !!!  a benign tremor in my dotage so i need ibis to use my r lenses off tripod, otherwise i could have managed with my m240 +evf.", "sortedWord": "None", "Identifyer": null, "identifyer": 20619, "year": "2020"}, {"autor": "mike3996", "date": "2020-12-16 13:51:00", "content": "I do the same. Leica M on full manual always, other cameras in A/M+auto ISO automatic programs. Leica M invites to go full manual mode: good shutter speed dial, good aperture dial, kind of poor metering (it's good metering but it's not like you can forget about it and let it do its thing). I have developed a clumsy but fluent method with M. I see some action coming my way, or otherwise check the exposure, I'll usually shoot a dud file just to check if I overexpose. Then I can go on confidently shooting and not having to chimp the exposure. Of course I will consult the metering aids in the viewfinder too but they are not always very useful when I have to overexpose by over a stop. Then of course, as an added benefit, you learn in a short time to approximate the light levels, you learn to automatically adjust the parameters if the light levels change rapidly, so on. Other systems (no Fujis but Nikon Df and Panasonic M4/3 cameras at the moment) are poorer at shutter speed dial / aperture dial department, but they do nice evaluative metering and mirrorless cameras even offer exposure preview.", "link": "https://www.l-camera-forum.com/topic/313287-confusing-myself-with-leica-fuji-cameras/?tab=comments#comment-4099865", "origin": "L-forum", "suborigin": "313287-confusing-myself-with-leica-fuji-cameras", "result": true, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "i do the same. leica m on full manual always, other cameras in a/m+auto iso automatic programs. leica m invites to go full manual mode: good shutter speed dial, good aperture dial, kind of poor metering (it's good metering but it's not like you can forget about it and let it do its thing). -----> i !!!  -----> have !!!  -----> developed !!!  a clumsy but fluent method with m. -----> i !!!  see some action coming my way, or otherwise check the exposure, -----> i !!! 'll usually shoot a dud file just to check if -----> i !!!  overexpose. then i can go on confidently shooting and not having to chimp the exposure. of course i will consult the metering aids in the viewfinder too but they are not always very useful when i have to overexpose by over a stop. then of course, as an added benefit, you learn in a short time to approximate the light levels, you learn to automatically adjust the parameters if the light levels change rapidly, so on. other systems (no fujis but nikon df and panasonic m4/3 cameras at the moment) are poorer at shutter speed dial / aperture dial department, but they do nice evaluative metering and mirrorless cameras even offer exposure preview.", "sortedWord": "None", "Identifyer": null, "identifyer": 90330, "year": "2020"}, {"autor": "250swb", "date": "2020-12-14 10:22:00", "content": "Times are only guides, and very rough guides at that. The times on the film carton or the developer bottle don't take into consideration how you metered the film, the light conditions when the film was exposed, what type of negative you want (so maybe a low contrast one for scanning, or higher contrast for darkroom printing), and it doesn't take into consideration your own preferences for more/less grain etc. I never develop Tri-X at the recommended times because it gives me negatives that are too dense, and this is because I meter from the ground, grass, and mid tones and not the scene in general which would contain far more highlights. So what you need to do is remember how you metered the scenes on the roll and take an average guesstimate and develop nearer the longer of the recommended times if you feel the shadows are going to be weak based on how you metered, or the towards the shorter of the times if you feel the highlights are going to be too dense. Standardising how you meter starts to make sense now because it is the first link in the chain. When you get the sort of negatives you like stick with that regime.", "link": "https://www.l-camera-forum.com/topic/316055-developing-times/?tab=comments#comment-4098471", "origin": "L-forum", "suborigin": "316055-developing-times", "result": true, "Selector": "i never develop", "selectorShort": "develop", "MarkedSent": "times are only guides, and very rough guides at that. the times on the film carton or the developer bottle don't take into consideration how you metered the film, the light conditions when the film was exposed, what type of negative you want (so maybe a low contrast one for scanning, or higher contrast for darkroom printing), and it doesn't take into consideration your own preferences for more/less grain etc. -----> i !!!  -----> never !!!  -----> develop !!!  tri-x at the recommended times because it gives me negatives that are too dense, and this is because -----> i !!!  meter from the ground, grass, and mid tones and not the scene in general which would contain far more highlights. so what you need to do is remember how you metered the scenes on the roll and take an average guesstimate and develop nearer the longer of the recommended times if you feel the shadows are going to be weak based on how you metered, or the towards the shorter of the times if you feel the highlights are going to be too dense. standardising how you meter starts to make sense now because it is the first link in the chain. when you get the sort of negatives you like stick with that regime.", "sortedWord": "None", "Identifyer": null, "identifyer": 99904, "year": "2020"}, {"autor": "emilkarl", "date": "2020-11-20 16:03:00", "content": "9 minutes ago, andybarton said: Looks like a developing problem to me, with developer running from the sprocket holes. How often does this happen? Patterson tank and spools to develop? Sorry, added some more info in the topic. I have not seen it with Tri-X. HP5+ especially when pushed to 800. I have shot a new roll of HP5 where I will redo the process and see if I get the same issue tonight or if it was a temporary thing. But this is the third roll it happened to. Quote I've developed some HP5+ pushed to 800. Used HC-110 at dilution B (1:31) for 10 minutes. 300ml in a Patersson 2 reel tank with 1 reel in the bottom. Agitated for the first 30 seconds then 12-15 seconds every minute starting at 1:00, 3 invertions Stop for 30 seconds Fix for 3:30. Edited November 20, 2020 by emilkarl", "link": "https://www.l-camera-forum.com/topic/315359-m6-light-leak-or-bromide-drag/?tab=comments#comment-4083953", "origin": "L-forum", "suborigin": "315359-m6-light-leak-or-bromide-drag", "result": true, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "9 minutes ago, andybarton said: looks like a developing problem to me, with developer running from the sprocket holes. how often does this happen? patterson tank and spools to develop? sorry, added some more info in the topic. i have not seen it with tri-x. hp5+ especially when pushed to 800. i have shot a new roll of hp5 where i will redo the process and see if i get the same issue tonight or if it was a temporary thing. but this is the third roll it happened to. quote -----> i !!! 've -----> developed !!!  some hp5+ pushed to 800. used hc-110 at dilution b (1:31) for 10 minutes. 300ml in a patersson 2 reel tank with 1 reel in the bottom. agitated for the first 30 seconds then 12-15 seconds every minute starting at 1:00, 3 invertions stop for 30 seconds fix for 3:30. edited november 20, 2020 by emilkarl", "sortedWord": "None", "Identifyer": null, "identifyer": 100153, "year": "2020"}, {"autor": "gteague", "date": "2020-08-28 03:57:00", "content": " many thanks for this detailed info. i processed all my film back in the day. i worked at the local newspaper (as the computer admin) and i lived back in the photo dept. i would develop for the photogs so they could go back out on assignment quicker and in exchange i had the run of the lab for myself. xp2 was a pain in the butt in many areas as a b&w film, but it had huge latitude and could be thrown in our c41 machine and you weren't stuck in a darkroom for 20 minutes off and on. back in the day it was like voodoo to have a film you could shoot from 100-1600 and still pull images off the negs. but it took special filters (poly-something) and paper and i never got enough contrast out of it. i was worried about the true b&w film processing, but some of the online labs i checked maintained they were good at it, so i'll throw a roll or two their way. i'm only wanting scans, not prints. btw, i rarely go out in the direct sun (if you had experienced a texas summer, you wouldn't either!) and take my walks during magic hour and 400 should be nearly perfect as the light fades. i do hardly any low light stuff and even less now that i don't go out to structures during the plague. i agree that the rollei doesn't seem suitable for dim available light work. or for flash, for that matter, although i don't use flash. tks agn! /guy", "link": "https://www.l-camera-forum.com/topic/312761-35mm-bwcolor-film-recommendation-wanted/?tab=comments#comment-4034808", "origin": "L-forum", "suborigin": "312761-35mm-bwcolor-film-recommendation-wanted", "result": true, "Selector": "i would develop", "selectorShort": "develop", "MarkedSent": " many thanks for this detailed info. i processed all my film back in the day. i worked at the local newspaper (as the computer admin) and i lived back in the photo dept. -----> i !!!  -----> would !!!  -----> develop !!!  for the photogs so they could go back out on assignment quicker and in exchange -----> i !!!  had the run of the lab for myself. xp2 was a pain in the butt in many areas as a b&w film, but it had huge latitude and could be thrown in our c41 machine and you weren't stuck in a darkroom for 20 minutes off and on. back in the day it was like voodoo to have a film you could shoot from 100-1600 and still pull images off the negs. but it took special filters (poly-something) and paper and i never got enough contrast out of it. i was worried about the true b&w film processing, but some of the online labs i checked maintained they were good at it, so i'll throw a roll or two their way. i'm only wanting scans, not prints. btw, i rarely go out in the direct sun (if you had experienced a texas summer, you wouldn't either!) and take my walks during magic hour and 400 should be nearly perfect as the light fades. i do hardly any low light stuff and even less now that i don't go out to structures during the plague. i agree that the rollei doesn't seem suitable for dim available light work. or for flash, for that matter, although i don't use flash. tks agn! /guy", "sortedWord": "None", "Identifyer": null, "identifyer": 100254, "year": "2020"}, {"autor": "Matlock", "date": "2020-08-28 06:41:00", "content": "I have a couple of Rollei 35s which I still use fairly regularly and also a Minolta TC-1 which makes the Rollei 35 look like a Hasselblad. I mainly use Ilford FP4 or Pan F which I usually develop myself and then scan. For Colour it is mainly Kodak Ektar and Fuji 200. (I also use my Leica M7, M5 and Konica Hexar RF on a fairly regular basis). I am in the UK and we still have a few very good labs but you can only find out which one suits you by trying them out, of course. I just wish that I still could do all my own processing as I used to, but I have no room for a darkroom at the moment.", "link": "https://www.l-camera-forum.com/topic/312761-35mm-bwcolor-film-recommendation-wanted/?tab=comments#comment-4034840", "origin": "L-forum", "suborigin": "312761-35mm-bwcolor-film-recommendation-wanted", "result": true, "Selector": "i usually develop", "selectorShort": "develop", "MarkedSent": "i have a couple of rollei 35s which i still use fairly regularly and also a minolta tc-1 which makes the rollei 35 look like a hasselblad. -----> i !!!  mainly use ilford fp4 or pan f which -----> i !!!  -----> usually !!!  -----> develop !!!  myself and then scan. for colour it is mainly kodak ektar and fuji 200. (i also use my leica m7, m5 and konica hexar rf on a fairly regular basis). i am in the uk and we still have a few very good labs but you can only find out which one suits you by trying them out, of course. i just wish that i still could do all my own processing as i used to, but i have no room for a darkroom at the moment.", "sortedWord": "None", "Identifyer": null, "identifyer": 100256, "year": "2020"}, {"autor": "gteague", "date": "2020-08-31 17:38:00", "content": "got my 8 rolls of 4 types of film in today along with a minty leitz minolta cl w/40mm lens. the shipping must have stacked up because the rollei 35s is due in an hour or so from a different shipper. ironic the cl shipped from japan via fx and the 35s from colorado via usps on the same day and they got here at the same time but it's because trump has wrecked the post office, at least in my area. i've tried iphone app scanners on my sx-70 instant prints and have had only indifferent results, so i'm likely going to be at the mercy of the lab scans although i guess the negs would be a backup if i got a film scanner. and yeah, i'm with you einst on the slide film. i used to develop ektachrome, but it was a huge pita to keep within 1/4-1/2º tolerance in a home darkroom. not that easy in a good one. /guy Edited August 31, 2020 by gteague", "link": "https://www.l-camera-forum.com/topic/312761-35mm-bwcolor-film-recommendation-wanted/page/2/?tab=comments#comment-4037070", "origin": "L-forum", "suborigin": "312761-35mm-bwcolor-film-recommendation-wanted", "result": true, "Selector": "i used to develop", "selectorShort": "develop", "MarkedSent": "got my 8 rolls of 4 types of film in today along with a minty leitz minolta cl w/40mm lens. the shipping must have stacked up because the rollei 35s is due in an hour or so from a different shipper. ironic the cl shipped from japan via fx and the 35s from colorado via usps on the same day and they got here at the same time but it's because trump has wrecked the post office, at least in my area. i've tried iphone app scanners on my sx-70 instant prints and have had only indifferent results, so i'm likely going to be at the mercy of the lab scans although i guess the negs would be a backup if i got a film scanner. and yeah, i'm with you einst on the slide film. -----> i !!!  -----> used !!!  -----> to !!!  -----> develop !!!  ektachrome, but it was a huge pita -----> to !!!  keep within 1/4-1/2º tolerance in a home darkroom. not that easy in a good one. /guy edited august 31, 2020 by gteague", "sortedWord": "None", "Identifyer": null, "identifyer": 100283, "year": "2020"}, {"autor": "Martin B", "date": "2020-09-01 16:36:00", "content": "1 hour ago, adan said: Kodak discontinued it in 2004, recommending TMax 100 as a substitute for the finest grain and best resolution (with simpler processing). The deal is that there are two classes of B&W film these days (although \"these days\" date back to the 1980s). High-tech \"engineered grain\" films that produce finer grain and better resolution for the same ISO than the films before 1980. But are also rather high-strung and picky about perfect exposure and processing. These would be the Ilford Delta (Delta-grain) and TMax (T(abular)-grain) films. Without getting too technical, the silver-halide crystals are \"grown\" to be flat and thin, but wide to capture a lot of light with a minimum of silver (tabular) and usually delta-shaped (triangular - ∆). The flat grains also make the emulsion thinner, for better sharpness (less diffusion of light in the \"Jello.\" (BTW - the delta-shape vanishes in developing the crystals into silver grains. You won't see triangles in the final pictures ) The others (Kodak Tri-X, Ilford HP5+, FP4+, Pan F) use \"old-school\" cubic crystals. Grainier and slightly fuzzier for a given ISO, but with more latitude and tolerance for exposure and development variations. Ilford uses a cute trick with FP4+. As a medium-speed film (ISO125), Ilford makes it with a mix of larger \"ISO 400\" crystals and smaller \"ISO 50\" crystals. Averaging out to ISO 125. This gives it extra latitude in high-contrast situations - the big \"fast\" crystals capture more light and tonal detail in the shadows, while the \"slow\" small crystals keep adding tonal density in bright highlights, where the fast crystals are grossly overexposed and have blocked up. Think of it as \"chemical HDR.\" It is the closest thing still made (at least by the big players) to the old Kodak Verichrome Pan, engineered for box-cameras and P&Ss with minimal exposure controls (shutter speeds and apertures) and thus sloppy exposures in varying light. Very forgiving. Ooops - gotta run. But I would recommend FP4+ as a starting point for someone getting back into B&W film. Excellent background info! FP4+ is my favorite film for exactly the reasons you mentioned. I was unaware that this is due to the crystal mix. But it certainly explains it. Personally, I love developing FP4+ with Xtol (1:1) which barely shows any grain in the final image. It normally provides sufficient edge sharpness even on 35 mm frames.", "link": "https://www.l-camera-forum.com/topic/312761-35mm-bwcolor-film-recommendation-wanted/page/2/?tab=comments#comment-4037671", "origin": "L-forum", "suborigin": "312761-35mm-bwcolor-film-recommendation-wanted", "result": true, "Selector": "i love developing", "selectorShort": "develop", "MarkedSent": "1 hour ago, adan said: kodak discontinued it in 2004, recommending tmax 100 as a substitute for the finest grain and best resolution (with simpler processing). the deal is that there are two classes of b&w film these days (although \"these days\" date back to the 1980s). high-tech \"engineered grain\" films that produce finer grain and better resolution for the same iso than the films before 1980. but are also rather high-strung and picky about perfect exposure and processing. these would be the ilford delta (delta-grain) and tmax (t(abular)-grain) films. without getting too technical, the silver-halide crystals are \"grown\" to be flat and thin, but wide to capture a lot of light with a minimum of silver (tabular) and usually delta-shaped (triangular - ∆). the flat grains also make the emulsion thinner, for better sharpness (less diffusion of light in the \"jello.\" (btw - the delta-shape vanishes in developing the crystals into silver grains. you won't see triangles in the final pictures ) the others (kodak tri-x, ilford hp5+, fp4+, pan f) use \"old-school\" cubic crystals. grainier and slightly fuzzier for a given iso, but with more latitude and tolerance for exposure and development variations. ilford uses a cute trick with fp4+. as a medium-speed film (iso125), ilford makes it with a mix of larger \"iso 400\" crystals and smaller \"iso 50\" crystals. averaging out to iso 125. this gives it extra latitude in high-contrast situations - the big \"fast\" crystals capture more light and tonal detail in the shadows, while the \"slow\" small crystals keep adding tonal density in bright highlights, where the fast crystals are grossly overexposed and have blocked up. think of it as \"chemical hdr.\" it is the closest thing still made (at least by the big players) to the old kodak verichrome pan, engineered for box-cameras and p&ss with minimal exposure controls (shutter speeds and apertures) and thus sloppy exposures in varying light. very forgiving. ooops - gotta run. but i would recommend fp4+ as a starting point for someone getting back into b&w film. excellent background info! fp4+ is my favorite film for exactly the reasons you mentioned. i was unaware that this is due to the crystal mix. but it certainly explains it. personally, -----> i !!!  -----> love !!!  -----> developing !!!  fp4+ with xtol (1:1) which barely shows any grain in the final image. it normally provides sufficient edge sharpness even on 35 mm frames.", "sortedWord": "None", "Identifyer": null, "identifyer": 100286, "year": "2020"}, {"autor": "bags27", "date": "2020-09-08 05:05:00", "content": "developed this today from my Fuji. Delta 100 in T-Max for 6 minutes--img-- ", "link": "https://www.l-camera-forum.com/topic/311861-6x9-and-6x8-negative-film-holders-for-dsl-scanning/?tab=comments#comment-4041954", "origin": "L-forum", "suborigin": "311861-6x9-and-6x8-negative-film-holders-for-dsl-scanning", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "-----> developed !!!  this today from my fuji. delta 100 in t-max for 6 minutes--img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 100371, "year": "2020"}, {"autor": "fotomas", "date": "2020-07-12 23:26:00", "content": "I normally develop if I have a greater project with C41. I also do some sheet-film and roll-film. Then it's a bit easier to fill the tanks. So usually I'm able to use 3-4 l at once. The critical part of the set is the developer part C. The rest keeps well. So I bought 5 small 25 ml brown glass bottles and filled 1/5 of part C in each and cover this with a protection gas. So I can mix 1 l developer with each. That don't last for ever but a few months longer if I keep it in original bottle. Mostly I didn't manage to use the last liter. But with four liters used I found this ok. In the past Maco direct sold the part C for 5 l from their C41developer separately. This was great. It wasn't from Fuji Hunt but it also worked to mix a working developer with the left parts of the Fuji Hunt set. Sadly now the only ofter only a smaller kit for 1 l, that is much more expensive. Unfortunately I don't know what is exactly in part C. I guess color developer CD-4, what is the critical part, and some sodium sulphite or sodium bisulphite to keep it. But without the exact amounts it will need some trials to find the right values to mix your own. I used to mix also C41 developer on my own in the past. So it makes no sense for me to spend time and resources to reverse engineer the Fuji kit. Maybe I go back to it, if things get worse.", "link": "https://www.l-camera-forum.com/topic/311190-tetanal-ultramax-what-happened/?tab=comments#comment-4007963", "origin": "L-forum", "suborigin": "311190-tetanal-ultramax-what-happened", "result": true, "Selector": "i normally develop", "selectorShort": "develop", "MarkedSent": "-----> i !!!  -----> normally !!!  -----> develop !!!  if -----> i !!!  have a greater project with c41. i also do some sheet-film and roll-film. then it's a bit easier to fill the tanks. so usually i'm able to use 3-4 l at once. the critical part of the set is the developer part c. the rest keeps well. so i bought 5 small 25 ml brown glass bottles and filled 1/5 of part c in each and cover this with a protection gas. so i can mix 1 l developer with each. that don't last for ever but a few months longer if i keep it in original bottle. mostly i didn't manage to use the last liter. but with four liters used i found this ok. in the past maco direct sold the part c for 5 l from their c41developer separately. this was great. it wasn't from fuji hunt but it also worked to mix a working developer with the left parts of the fuji hunt set. sadly now the only ofter only a smaller kit for 1 l, that is much more expensive. unfortunately i don't know what is exactly in part c. i guess color developer cd-4, what is the critical part, and some sodium sulphite or sodium bisulphite to keep it. but without the exact amounts it will need some trials to find the right values to mix your own. i used to mix also c41 developer on my own in the past. so it makes no sense for me to spend time and resources to reverse engineer the fuji kit. maybe i go back to it, if things get worse.", "sortedWord": "None", "Identifyer": null, "identifyer": 100627, "year": "2020"}, {"autor": "tommonego@gmail.com", "date": "2020-05-21 14:01:00", "content": "vor 10 Minuten schrieb Pyrogallol: I find that with Rollei 400 infrared I use a number of different red filters from just dark red, Leica Rh or Rd, to very dense, IR or even darker so that you cannot see anything through it. But they all seem to need five stops extra exposure over a normal black and white film, in bright sun 125th at f5.6 I mostly used an R72 filter, with that filter I found a loss in the shadows, could have been inaccurate metering, weather was changing in the hour I was out, I was using ISO 12. I have a 1970s era Leitz infrared filter, it is a little lighter than the R72, 39mm so doesn't fit most of my lenses, that I used ISO 25 and the exposures were over exposed. I also tried a Wratten 25, at ISO 50 and that was over exposed. Then I developed it in TMax developer (what I had) for 10 minutes at 75 degrees. --img--  Edited May 21, 2020 by tommonego@gmail.com", "link": "https://www.l-camera-forum.com/topic/309783-pushpull-film/?tab=comments#comment-3977728", "origin": "L-forum", "suborigin": "309783-pushpull-film", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "vor 10 minuten schrieb pyrogallol: i find that with rollei 400 infrared i use a number of different red filters from just dark red, leica rh or rd, to very dense, ir or even darker so that you cannot see anything through it. but they all seem to need five stops extra exposure over a normal black and white film, in bright sun 125th at f5.6 i mostly used an r72 filter, with that filter i found a loss in the shadows, could have been inaccurate metering, weather was changing in the hour i was out, i was using iso 12. i have a 1970s era leitz infrared filter, it is a little lighter than the r72, 39mm so doesn't fit most of my lenses, that i used iso 25 and the exposures were over exposed. i also tried a wratten 25, at iso 50 and that was over exposed. then -----> i !!!  -----> developed !!!  it in tmax developer (what -----> i !!!  had) for 10 minutes at 75 degrees. --img--  edited may 21, 2020 by tommonego@gmail.com", "sortedWord": "None", "Identifyer": null, "identifyer": 100680, "year": "2020"}, {"autor": "TheBestSLIsALeicaflex", "date": "2020-02-16 19:36:00", "content": "I bulk load a lot of Fomapan 100, because it is relatively inexpensive and I like the classic look. In the past I've mostly developed in Rodinal and HC-110, and those remain my mainstays, but recently I explored other developers -- Adox FX-39, Fomadon, Clayton F76, Diafne, Cinestill; I prefer the liquids. I'll shoot other films through the year, Ilford, maybe some Kodak, and even some oddball stuff, like Eastman copy films, but not in quantity. This thread reminds me that I have a couple bricks of EFKE in the freezer. It's nice that we still have such variety. Edited February 16, 2020 by TheBestSLIsALeicaflex", "link": "https://www.l-camera-forum.com/topic/306073-what-is-everyone%E2%80%99s-favourite-film-stocks/?tab=comments#comment-3914150", "origin": "L-forum", "suborigin": "306073-what-is-everyone%E2%80%99s-favourite-film-stocks", "result": true, "Selector": "i've mostly developed", "selectorShort": "develop", "MarkedSent": "i bulk load a lot of fomapan 100, because it is relatively inexpensive and i like the classic look. in the past -----> i !!! 've -----> mostly !!!  -----> developed !!!  in rodinal and hc-110, and those remain my mainstays, but recently -----> i !!!  explored other developers -- adox fx-39, fomadon, clayton f76, diafne, cinestill; -----> i !!!  prefer the liquids. i'll shoot other films through the year, ilford, maybe some kodak, and even some oddball stuff, like eastman copy films, but not in quantity. this thread reminds me that i have a couple bricks of efke in the freezer. it's nice that we still have such variety. edited february 16, 2020 by thebestslisaleicaflex", "sortedWord": "None", "Identifyer": null, "identifyer": 100784, "year": "2020"}, {"autor": "giannis", "date": "2020-04-21 12:43:00", "content": "5 hours ago, Stealth3kpl said: This is exactly what I'm looking for, thank you. I recall someone on the forum a few years ago saying something along the lines of don't treat it as you would a digital file. In what way would you clip the blacks? Just bringing in the black slider on levels? Pete Pretty much, but I used the curves dialog instead. Drag the black point until blacks are visibly crushed in non-important areas (like dark clothes). Then lift the midtones a bit (or a lot). The highlights you can keep as is, or since it's a well exposed+developed negative and you have some leeway, you can brighten them a bit without clipping. In curves you can apply an S-curve for more extreme midtone contrast. Usually though, I find that with good, low contrast negatives (which is what I develop towards too), just an upswept part around the midtones is enough, and you don't need to protect the highlights with a more aggressive S-curve because they still have lots of headroom. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/308741-adjusting-the-contrast-of-a-scanned-image/page/2/?tab=comments#comment-3958068", "origin": "L-forum", "suborigin": "308741-adjusting-the-contrast-of-a-scanned-image", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "5 hours ago, stealth3kpl said: this is exactly what i'm looking for, thank you. i recall someone on the forum a few years ago saying something along the lines of don't treat it as you would a digital file. in what way would you clip the blacks? just bringing in the black slider on levels? pete pretty much, but i used the curves dialog instead. drag the black point until blacks are visibly crushed in non-important areas (like dark clothes). then lift the midtones a bit (or a lot). the highlights you can keep as is, or since it's a well exposed+developed negative and you have some leeway, you can brighten them a bit without clipping. in curves you can apply an s-curve for more extreme midtone contrast. usually though, -----> i !!!  find that with good, low contrast negatives (which is what -----> i !!!  -----> develop !!!  towards too), just an upswept part around the midtones is enough, and you don't need to protect the highlights with a more aggressive s-curve because they still have lots of headroom. --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 100926, "year": "2020"}, {"autor": "Ouroboros", "date": "2020-05-12 09:21:00", "content": "On 12/26/2019 at 5:11 AM, erniethemilk said: I’ve shot around 5 rolls of Tri-X this past month or so having recently picked up an M6 to go with my M-10-P. In fact I’m so enamoured with my M6 I’ve barely touched my M10 since I’ve had the M6! I love the simplicity of shooting film, and find it far less stressful than shooting digital - if I don’t feel the frame is worth shooting with film I don’t shoot it, rather than with digital where I try and make the photo work. I also invested in a home developing kit and scanner so I can develop my black and white at home rather than have to wait for the lab. So far so good, just need to find a way to find more time to shoot film now! Well done! You’re one giant leap towards getting off the digital merry-go-round.", "link": "https://www.l-camera-forum.com/topic/292186-how-much-film-do-you-shoot-in-one-year/page/3/?tab=comments#comment-3971830", "origin": "L-forum", "suborigin": "292186-how-much-film-do-you-shoot-in-one-year", "result": true, "Selector": "i can develop", "selectorShort": "develop", "MarkedSent": "on 12/26/2019 at 5:11 am, erniethemilk said: i’ve shot around 5 rolls of tri-x this past month or so having recently picked up an m6 to go with my m-10-p. in fact i’m so enamoured with my m6 i’ve barely touched my m10 since i’ve had the m6! i love the simplicity of shooting film, and find it far less stressful than shooting digital - if i don’t feel the frame is worth shooting with film i don’t shoot it, rather than with digital where i try and make the photo work. -----> i !!!  also invested in a home developing kit and scanner so -----> i !!!  -----> can !!!  -----> develop !!!  my black and white at home rather than have to wait for the lab. so far so good, just need to find a way to find more time to shoot film now! well done! you’re one giant leap towards getting off the digital merry-go-round.", "sortedWord": "None", "Identifyer": null, "identifyer": 101055, "year": "2020"}, {"autor": "fatihayoglu", "date": "2020-04-02 16:33:00", "content": "thanks guys, very detailed answers here. However, I still couldn't get answer to my last 2 questions. Let's say I took a picture of exposure chart of 13 shades of grey (plus white to black) by exposing to the same grey area with 2 HP5 rolls EI400. If I develop them say one in Ilford 11 and the other one in Rodinal at 20C for given time on the charts, would I get more or less similar results in terms of exposure (I know sharpness, grain, etc depends on the used developer)? Also, as I have mentioned I usually shoot these films at EI800 or EI1600, which requires me to develop a bit more, so does it mean I simply move right on the chart and develop accordingly. The reason I am asking these, if I don't understand how the developers work for my shooting conditions, I will never be able to start to develop at home. Edited April 2, 2020 by fatihayoglu", "link": "https://www.l-camera-forum.com/topic/308086-visiting-maybe-again-developers-for-bw-film/?tab=comments#comment-3945098", "origin": "L-forum", "suborigin": "308086-visiting-maybe-again-developers-for-bw-film", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "thanks guys, very detailed answers here. however, i still couldn't get answer to my last 2 questions. let's say i took a picture of exposure chart of 13 shades of grey (plus white to black) by exposing to the same grey area with 2 hp5 rolls ei400. if -----> i !!!  -----> develop !!!  them say one in ilford 11 and the other one in rodinal at 20c for given time on the charts, would -----> i !!!  get more or less similar results in terms of exposure (-----> i !!!  know sharpness, grain, etc depends on the used developer)? also, as i have mentioned i usually shoot these films at ei800 or ei1600, which requires me to develop a bit more, so does it mean i simply move right on the chart and develop accordingly. the reason i am asking these, if i don't understand how the developers work for my shooting conditions, i will never be able to start to develop at home. edited april 2, 2020 by fatihayoglu", "sortedWord": "None", "Identifyer": null, "identifyer": 101143, "year": "2020"}, {"autor": "giannis", "date": "2020-04-02 17:28:00", "content": "51 minutes ago, fatihayoglu said: thanks guys, very detailed answers here. However, I still couldn't get answer to my last 2 questions. Let's say I took a picture of exposure chart of 13 shades of grey (plus white to black) by exposing to the same grey area with 2 HP5 rolls EI400. If I develop them say one in Ilford 11 and the other one in Rodinal at 20C for given time on the charts, would I get more or less similar results in terms of exposure (I know sharpness, grain, etc depends on the used developer)? Also, as I have mentioned I usually shoot these films at EI800 or EI1600, which requires me to develop a bit more, so does it mean I simply move right on the chart and develop accordingly. The reason I am asking these, if I don't understand how the developers work for my shooting conditions, I will never be able to start to develop at home. To answer your question explicitly, yes for HP5+ shot ISO400 if you develop with rodinal or id-11 for the recommended times, your results will be almost the same in terms of speed. If you're being pedantic and use a densitometer, you'll probably spot a small difference (a bit extra density in the shadows for id-11) which will be imperceptible with naked eyes. If you plan on pushing those films, you'll get better results in every possible way (grain size, contrast, shadow detail) if you use general purpose or pushing developers, instead of Rodinal. You can still try it with Rodinal though, if you have it already, and see how you like the results yourself.", "link": "https://www.l-camera-forum.com/topic/308086-visiting-maybe-again-developers-for-bw-film/?tab=comments#comment-3945145", "origin": "L-forum", "suborigin": "308086-visiting-maybe-again-developers-for-bw-film", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "51 minutes ago, fatihayoglu said: thanks guys, very detailed answers here. however, i still couldn't get answer to my last 2 questions. let's say i took a picture of exposure chart of 13 shades of grey (plus white to black) by exposing to the same grey area with 2 hp5 rolls ei400. if -----> i !!!  -----> develop !!!  them say one in ilford 11 and the other one in rodinal at 20c for given time on the charts, would -----> i !!!  get more or less similar results in terms of exposure (-----> i !!!  know sharpness, grain, etc depends on the used developer)? also, as i have mentioned i usually shoot these films at ei800 or ei1600, which requires me to develop a bit more, so does it mean i simply move right on the chart and develop accordingly. the reason i am asking these, if i don't understand how the developers work for my shooting conditions, i will never be able to start to develop at home. to answer your question explicitly, yes for hp5+ shot iso400 if you develop with rodinal or id-11 for the recommended times, your results will be almost the same in terms of speed. if you're being pedantic and use a densitometer, you'll probably spot a small difference (a bit extra density in the shadows for id-11) which will be imperceptible with naked eyes. if you plan on pushing those films, you'll get better results in every possible way (grain size, contrast, shadow detail) if you use general purpose or pushing developers, instead of rodinal. you can still try it with rodinal though, if you have it already, and see how you like the results yourself.", "sortedWord": "None", "Identifyer": null, "identifyer": 101146, "year": "2020"}, {"autor": "mikemgb", "date": "2020-04-21 00:55:00", "content": "I've been developing E6 and C41 for years, it's no more difficult that black and white as long as you control the temperatures. The only issue you may have right now, depending where you are, is finding chemicals, in the US most places are sold out, Freestyle has a 1 gallon kit but that's it.", "link": "https://www.l-camera-forum.com/topic/308743-c-41-home-developing/?tab=comments#comment-3957796", "origin": "L-forum", "suborigin": "308743-c-41-home-developing", "result": true, "Selector": "i've been developing", "selectorShort": "develop", "MarkedSent": "-----> i !!! 've -----> been !!!  -----> developing !!!  e6 and c41 for years, it's no more difficult that black and white as long as you control the temperatures. the only issue you may have right now, depending where you are, is finding chemicals, in the us most places are sold out, freestyle has a 1 gallon kit but that's it.", "sortedWord": "None", "Identifyer": null, "identifyer": 101250, "year": "2020"}, {"autor": "fotomas", "date": "2020-01-31 19:52:00", "content": "Beautiful pictures. The grain looks within a normal range to me. But could be a bit pronounced due sharpening in the digital process. If he uses a mini-lab-scanner it could be that it is a automated process and he has only rather few possibilities to make changes there, but I don't know. There was a similar discussion in the german forum a while ago where I posted to examples how different TRI-X can look just depending on exposure:https://www.l-camera-forum.com/topic/235207-rollei-blackbird-was-ist-hier-schiefgelaufen/?do=findComment&comment=2686823 One picture is on the edge of underexposure the other is well exposed. With negative-film underexposure enhances the grain pretty effectively, so don't expose for the highlights like in digital or with slide-film. Depending on the scanner and the scanning software, grain can be also increased strongly with wrong settings. Often it is better to scan without sharpening, but you have to find out. In general I have the impression that scanning B&W films accentuate the grain, while the photographic paper in the classical printing process tend to reduce the grain due to it's slight unsharpness in finest details. But I never proofed this with a test. The developer also has a influence on graininess. As stated T-MAX film could have a much finer grain as the TRI-X with the right developer. But when I use it for example with Rodinal I got a grain nearly as strong as with TRI-X and then I like the TRI-X grain more, because it's sharper. With my fine grain developer T-MAX has tremendous fine grain but only reaches 200 ASA since the highlights get blown if I develop to full speed. There you have to find a good combination. Maybe the most important, the TRI-X of today is not the same as the one in the sixties. When I was a student one of my professors told me that the photographic material has grown worse over the years. Unfortunately I couldn't really proof this because it was not possible to get fresh material from the past, but some experience with old films give me an idea. But a few years ago there was an great exhibition that shows the winers of 50 years of the Deutschen Jugendfotopreis, a competition from juveniles. There it becomes pretty clear: from the 1950ties until 1970 the bw-prints was mostly excellent. No grain, sharp, deep blacks and a great tonality. After 1970 it becomes gray and grainy. And all these pictures was made from pupils that don't have fancy professional stuff, mostly just cheap amateur equipment. So I don't wonder that Jim Marshalls pictures looked much better then today. I guess to get a quality that comes near like the one in the past today you have to use all possible tricks of optimization. A bit finer grain should be possible, but don't expect wonders;-) Edited January 31, 2020 by fotomas", "link": "https://www.l-camera-forum.com/topic/305288-too-much-grain/page/3/?tab=comments#comment-3903438", "origin": "L-forum", "suborigin": "305288-too-much-grain", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "beautiful pictures. the grain looks within a normal range to me. but could be a bit pronounced due sharpening in the digital process. if he uses a mini-lab-scanner it could be that it is a automated process and he has only rather few possibilities to make changes there, but i don't know. there was a similar discussion in the german forum a while ago where i posted to examples how different tri-x can look just depending on exposure:https://www.l-camera-forum.com/topic/235207-rollei-blackbird-was-ist-hier-schiefgelaufen/?do=findcomment&comment=2686823 one picture is on the edge of underexposure the other is well exposed. with negative-film underexposure enhances the grain pretty effectively, so don't expose for the highlights like in digital or with slide-film. depending on the scanner and the scanning software, grain can be also increased strongly with wrong settings. often it is better to scan without sharpening, but you have to find out. in general i have the impression that scanning b&w films accentuate the grain, while the photographic paper in the classical printing process tend to reduce the grain due to it's slight unsharpness in finest details. but i never proofed this with a test. the developer also has a influence on graininess. as stated t-max film could have a much finer grain as the tri-x with the right developer. but when i use it for example with rodinal i got a grain nearly as strong as with tri-x and then i like the tri-x grain more, because it's sharper. with my fine grain developer t-max has tremendous fine grain but only reaches 200 asa since the highlights get blown if -----> i !!!  -----> develop !!!  to full speed. there you have to find a good combination. maybe the most important, the tri-x of today is not the same as the one in the sixties. when i was a student one of my professors told me that the photographic material has grown worse over the years. unfortunately i couldn't really proof this because it was not possible to get fresh material from the past, but some experience with old films give me an idea. but a few years ago there was an great exhibition that shows the winers of 50 years of the deutschen jugendfotopreis, a competition from juveniles. there it becomes pretty clear: from the 1950ties until 1970 the bw-prints was mostly excellent. no grain, sharp, deep blacks and a great tonality. after 1970 it becomes gray and grainy. and all these pictures was made from pupils that don't have fancy professional stuff, mostly just cheap amateur equipment. so i don't wonder that jim marshalls pictures looked much better then today. i guess to get a quality that comes near like the one in the past today you have to use all possible tricks of optimization. a bit finer grain should be possible, but don't expect wonders;-) edited january 31, 2020 by fotomas", "sortedWord": "None", "Identifyer": null, "identifyer": 101612, "year": "2020"}, {"autor": "wlaidlaw", "date": "2020-02-08 22:22:00", "content": "1 hour ago, dimm said: Thank you. Does anybody know how to access their forum? I can't even open main page in order to register. It requires username and password which obviously I don't have. I would call Lasersoft's support centre in Kiel, Germany. When I was having a registration issue for a Plustek Film Scanner, where I had bought the quite expensive Silverfast software upgrade, I got a very helpful lady who spoke better English than my rusty German and she was able to sort the problem I had. The upgraded software did not cure the soft images from the Plustek, which I suspect is down to poor film to sensor alignment. I have gone back to using an SL601 camera on a Leitz BEOON copying stand, with a Schneider-Kreuznach 50mm/f2.8 Componon S enlarging lens (high resolution and very flat field), where any focus issues are down to me. I can scan a 36 exposure film in around 2 minutes to near perfect DNG files. I develop these in C1 V.20 and do the final tweaks in PS CS 2020, including conversion of colour negatives to positive, where I use an automator action to do a batch conversion. It is not perfect but near enough for a minor amount of tweaking to sort. Wilson Edited February 8, 2020 by wlaidlaw", "link": "https://www.l-camera-forum.com/topic/257324-the-unthinkable-switching-from-vuescan-to-silverfast/page/8/?tab=comments#comment-3908963", "origin": "L-forum", "suborigin": "257324-the-unthinkable-switching-from-vuescan-to-silverfast", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "1 hour ago, dimm said: thank you. does anybody know how to access their forum? i can't even open main page in order to register. it requires username and password which obviously i don't have. i would call lasersoft's support centre in kiel, germany. when i was having a registration issue for a plustek film scanner, where i had bought the quite expensive silverfast software upgrade, i got a very helpful lady who spoke better english than my rusty german and she was able to sort the problem i had. the upgraded software did not cure the soft images from the plustek, which i suspect is down to poor film to sensor alignment. i have gone back to using an sl601 camera on a leitz beoon copying stand, with a schneider-kreuznach 50mm/f2.8 componon s enlarging lens (high resolution and very flat field), where any focus issues are down to me. i can scan a 36 exposure film in around 2 minutes to near perfect dng files. -----> i !!!  -----> develop !!!  these in c1 v.20 and do the final tweaks in ps cs 2020, including conversion of colour negatives to positive, where -----> i !!!  use an automator action to do a batch conversion. it is not perfect but near enough for a minor amount of tweaking to sort. wilson edited february 8, 2020 by wlaidlaw", "sortedWord": "None", "Identifyer": null, "identifyer": 101919, "year": "2020"}, {"autor": "Aryel", "date": "2020-06-23 04:19:00", "content": "18 hours ago, Stealth3kpl said: No, but I would expect the grain to be more noticeable for obvious reasons. What was the problem you found? I just did the usual 1+4 for 8mins at 20C. I agitated continuously for about 30 secs in the first minute, then 5 inversions every minute after. I metered the TriX at 400. Pete Thanks for the info. I usually meter at 200 and develop at 400. There was nothing really wrong, I just found it to look a bit odd. I do not really know why... I enclose a sample. Not a great shot. Looking at it again now, I like it a bit more... I guess I simply like it more in id-11. Maybe, I should do the post-processing differently. In any case, thanks a lot for the info. I might give it another try. My film development is more stable now. I was not controlling the temperature so well when I developed this. --img-- ", "link": "https://www.l-camera-forum.com/topic/305287-ilford-dd-x/?tab=comments#comment-3997744", "origin": "L-forum", "suborigin": "305287-ilford-dd-x", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "18 hours ago, stealth3kpl said: no, but i would expect the grain to be more noticeable for obvious reasons. what was the problem you found? i just did the usual 1+4 for 8mins at 20c. i agitated continuously for about 30 secs in the first minute, then 5 inversions every minute after. i metered the trix at 400. pete thanks for the info. i usually meter at 200 and develop at 400. there was nothing really wrong, i just found it to look a bit odd. i do not really know why... i enclose a sample. not a great shot. looking at it again now, i like it a bit more... i guess i simply like it more in id-11. maybe, i should do the post-processing differently. in any case, thanks a lot for the info. i might give it another try. my film development is more stable now. -----> i !!!  was not controlling the temperature so well when -----> i !!!  -----> developed !!!  this. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 104795, "year": "2020"}, {"autor": "tom.w.bn", "date": "2020-10-05 12:18:00", "content": "The V2 profile is not new in C1 V20. I think that for landscapes in good light, this profil pronounces yellow and magenta a bit too much. I personally like a more neutral profil as base and I develop the colours from there to my taste. If you like it better... great.", "link": "https://www.l-camera-forum.com/topic/313235-m240-in-capture-one-improved-with-a-new-profile/?tab=comments#comment-4057618", "origin": "L-forum", "suborigin": "313235-m240-in-capture-one-improved-with-a-new-profile", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "the v2 profile is not new in c1 v20. i think that for landscapes in good light, this profil pronounces yellow and magenta a bit too much. -----> i !!!  personally like a more neutral profil as base and -----> i !!!  -----> develop !!!  the colours from there to my taste. if you like it better... great.", "sortedWord": "None", "Identifyer": null, "identifyer": 110849, "year": "2020"}, {"autor": "RayD28", "date": "2020-01-03 02:10:00", "content": "A slight twist. The light yesterday late afternoon was good so I grabbed my MP with a fresh roll of HP5 and went to the local park where there is usually a pickup basketball game. I started with my 50mm but it was just too tight to catch the action so I switched to 28mm. I had to get close to fill the frame so focusing the fast action was tough. I finally decided to use scale focusing. The light was not so strong that I could just go to f8 and 1/500 so I had to balance getting depth of field along with a fast as possible shutter speed. I shot 36 shots and I'm eager to see how often I hit focus but it will be a few days before I can develop the film at home. All the while I wished I brought the M240 so I could see how my focusing techniques worked (or not). I find the M240 LCD great for checking focus. I have Nikon gear and nice lenses but I bet auto focus would not have made a huge difference regarding hit rate. I can't tell you how many times Nikon's autofocus let me down. Ray", "link": "https://www.l-camera-forum.com/topic/304859-how-do-i-enjoy-my-m240-more/page/2/?tab=comments#comment-3884040", "origin": "L-forum", "suborigin": "304859-how-do-i-enjoy-my-m240-more", "result": false, "Selector": "i can develop", "selectorShort": "develop", "MarkedSent": "i shot 36 shots and i'm eager to see how often i hit focus but it will be a few days before i can develop the -----> film !!!  at home.", "sortedWord": "film", "Identifyer": null, "identifyer": 18537, "year": "2020"}, {"autor": "Charles Morgan", "date": "2020-10-26 07:44:00", "content": " I'm thinking very seriously about buying a digital Leica M. Most of my work is black and white film, and while I do a bit of colour, it is very much a secondary consideration. That said, I have been tremendously impressed by the M10R's ability to recover a huge amount of highlight detail. It may sound odd, but I have a real dislike, bordering on a phobia, of blown highlights. Even in film - I develop in PMK Pyro to ensure as much highlight detail is retained as possible. Obviously an M10 Monochrom would be a brilliant thing to have - just a question of those who use one, does the sensor have a similar capacity to recover highlight detail - or is the term a wide dynamic range? I appreciate much is about original exposure choice. Any help would be much appreciated - the one thing I cannot currently do is any testing, I am too far from a dealer!", "link": "https://www.l-camera-forum.com/topic/314530-m10-monochrom-highlight-recovery-question/?tab=comments#comment-4068479", "origin": "L-forum", "suborigin": "314530-m10-monochrom-highlight-recovery-question", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "even in -----> film !!!  - i develop in pmk pyro to ensure as much highlight detail is retained as possible.", "sortedWord": "film", "Identifyer": null, "identifyer": 24436, "year": "2020"}, {"autor": "shirubadanieru", "date": "2020-01-20 11:35:00", "content": "1 hour ago, mmradman said: I don't get this emulate film grain thing. Digital Monochrom gets very clean - digital if you like, files at low ISO and it has the ability to shoot cleaner than film at high ISO with obvious high ISO noise which looks like a film grain - more or less. I like film photography as is, only reason i don't use it as i used to is cost and convenience of digital, plus i didn't have M246 all that long in my photographic life. The M246 needs to pay for itself and shooting and processing rolls of B&W film is not going to do it for me*, home freezer would probably disagree with me. The new M10M brings some advances over the predecessors but for a second i don't doubt that both M9M and M246 have a lot to go for. *Note. After 4 years i shot equivalent of 250 rolls of film, at £20/film, processed and professionally scanned i broke even, I paid £5K for a brand new M246 in January 2016. Leica would love me if I bought new camera but I am not sure what a 50% more expensive camera can do for me. Each person has their own tastes, I know a lot prefer high contrast / clean files, but for me the greatest benefit of the MM1 is to be able to make files look as closely as possible to the results I got from Tri-X / Ilford...something that I feel I have never been able to achieve with color digital images, and that’s why I still shoot color on film. Digital does have a lot of benefits (including cost in the long term as film becomes more and more expensive) that film doesn’t, but to me the most important thing in the end is getting an output I’m happy with. With color, unfortunately no sensor gets close to recreating the film output and colors (M9 came the closest), but for B&W, the MM1 comes so close that I see no point for me in shooting B&W film. I still think film is better if you do your own development / scanning / printing, and enjoy the whole process, something that digital can’t offer...but given that I don’t develop / scan my rolls and send it to a camera shop, I do prefer to shoot B&W on digital if I have the chance given I have more control on the final image, and for me what I try to do with my editing is get close to results I get on film, including adding significant grain So I was just wondering if people who used the M10M, also tried the M9M and see any differences in the output at base ISO; from what I understand a lot of people who tried the 2nd iteration of the MM went back to the M9M as they didn’t enjoy the output from the typ246...", "link": "https://www.l-camera-forum.com/topic/305409-jono-slack-leica-m10-monochrom-field-report/page/6/?tab=comments#comment-3895388", "origin": "L-forum", "suborigin": "305409-jono-slack-leica-m10-monochrom-field-report", "result": false, "Selector": "i don’t develop", "selectorShort": "develop", "MarkedSent": "i still think -----> film !!!  is better if you do your own development / scanning / printing, and enjoy the whole process, something that digital can’t offer...but given that i don’t develop / scan my rolls and send it to a camera shop, i do prefer to shoot b&w on digital if i have the chance given i have more control on the final image, and for me what i try to do with my editing is get close to results i get on -----> film !!! , including adding significant grain so i was just wondering if people who used the m10m, also tried the m9m and see any differences in the output at base iso; from what i understand a lot of people who tried the 2nd iteration of the mm went back to the m9m as they didn’t enjoy the output from the typ246...", "sortedWord": "film", "Identifyer": null, "identifyer": 25478, "year": "2020"}, {"autor": "IkarusJohn", "date": "2020-01-23 20:46:00", "content": "Off topic, but I find it interesting that jazz and \"pop\" music have embraced the return to vinyl, but classical hasn't. Classical has firmly embraced digital recordings (even classic recordings like Beecham's La Boheme with Victoria de los Angeles reworked in digital), and seems reluctant to go back to vinyl. I agree, though, that film has rich blacks and something organic about it. I sometimes feel that Salgado has overdone the Tri-X look in some of his digital work. I've been experimenting with slower black & white film, and I am very pleased with the results. I would use my M-A and SWC (with Velvia 50) more, but frankly I'm too ;lazy. The last lot of film I had developed (basically couldn't be bothered doing it myself) was years worth, and a number of the rolls hadn't even been exposed (I'd mixed up the cannisters). The Monochrom really does work better for me, the romanticism of film aside.", "link": "https://www.l-camera-forum.com/topic/305530-your-opinion-about-the-leica-m10-monochrom/page/6/?tab=comments#comment-3897936", "origin": "L-forum", "suborigin": "305530-your-opinion-about-the-leica-m10-monochrom", "result": false, "Selector": "i had developed", "selectorShort": "develop", "MarkedSent": "the last lot of -----> film !!!  i had developed (basically couldn't be bothered doing it myself) was years worth, and a number of the rolls hadn't even been exposed (i'd mixed up the cannisters).", "sortedWord": "film", "Identifyer": null, "identifyer": 27991, "year": "2020"}, {"autor": "jaapv", "date": "2020-06-29 20:19:00", "content": "I started out with a 6x9 box camera. My father and I developed the film in a tray in the bathroom, put the negatives in contact frames in the windowsill for prints. I was seven.", "link": "https://www.l-camera-forum.com/topic/310595-sold-my-m9/page/3/?tab=comments#comment-4001521", "origin": "L-forum", "suborigin": "310595-sold-my-m9", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "my father and i developed the -----> film !!!  in a tray in the bathroom, put the negatives in contact frames in the windowsill for prints.", "sortedWord": "film", "Identifyer": null, "identifyer": 33005, "year": "2020"}, {"autor": "jdlaing", "date": "2020-06-29 20:40:00", "content": " 20 minutes ago, jaapv said: I started out with a 6x9 box camera. My father and I developed the film in a tray in the bathroom, put the negatives in contact frames in the windowsill for prints. I was seven. Wow. That’s before color TVs were invented! 😃", "link": "https://www.l-camera-forum.com/topic/310595-sold-my-m9/page/3/?tab=comments#comment-4001527", "origin": "L-forum", "suborigin": "310595-sold-my-m9", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "my father and i developed the -----> film !!!  in a tray in the bathroom, put the negatives in contact frames in the windowsill for prints.", "sortedWord": "film", "Identifyer": null, "identifyer": 33006, "year": "2020"}, {"autor": "M9reno", "date": "2020-01-05 10:11:00", "content": "Happy new year to you, too. I have a variation of your situation. Here is my own personal take. In cynical disbelief that the M9 corrosion fiasco would ever be solved by a redesigned sensor (I did not believe this promise), I traded my faithful grey M9 for an M240. It was late 2014. I had loved my M9 (my forum name is testament to that!). The trade-in was in anger at Leica at the time. I vowed to myself I would never buy another digital M. The 240 replacement would be my last. It was one of the factors that led me heavily to film use in the last five years. I learned to develop and wet-print my own film at home - even colour prints. Well, the redesigned M9 sensor came out and it was hat-eating time for me. I hardly ever use my M240 - it is basically a forgotten camera. It is infinitely more flexible and useful as a digital camera than the M9 - live view, electronic spirit level, R-lens capability, even movies. These are nice features to have, but since I rarely use them, the camera sits unused, or rather acts as a lens-testing platform to judge things like haze and bokeh on old lenses. My film cameras have all the fun - the M240 rarely leaves the cupboard, and almost never leaves the house. A few days ago a friend offered me his beautiful black M9P. Like new condition, new sensor, 7k actuations, and a (not low but still reasonable) price (£2,200). I felt an immediate bond to the M9. It feels like a camera I *know and understand* perfectly. And the images are stunning! Holding it and using it was/is a deeply tempting experience. Ultimately, however, I am declining it. For several reasons: 1. Shooting it side by side with the M240 the difference is visible. The M9 makes (to my eye) undeniably more beautiful images. M9 images look “filmic” right out of the camera. M240 images look dead by comparison, and although I know they can be adjusted in LR, I hate using LR. But is that difference worth buying an M9 again? 2. On the M9 (unlike the M240) my wide angle lenses (notably the Elmarit 28 ASPH, 2011 version, but also the Summilux 21) show a green cast along the edges and corners. The green shows up in overcast skies in landscapes, and in rooms with white walls indoors. I don’t like it, and here prefer the M240, which just gives me neutral colours all the way across the frame. 3. Believe it or not, I still feel sore about what happened with my M9 in 2014. To my mind there was an element of the weasel in Leica’s behaviour with the M9, particularly when they implied that sensor corrosion was a user-fault in wet-cleaning sensors. And when they ignored that my camera was corroded, and it went back and forth between Oxford and Solms before I had to go in person to Mayfair and got a fair solution there, it was infuriating. I am not a forgiving person - I’m sure you are, so forget my point 3. 4. I love film! If the M9 produces files that look filmic, that’s not so much a reason for me to buy another one, than a reason to shoot more film! Anyway, your thoughts may very well vary from mine. I totally see where you are coming from on this M9 dilemma! I look forward to reading this thread. It might even convince me to change my mind and buy my friend’s M9P! Edited January 5, 2020 by M9reno", "link": "https://www.l-camera-forum.com/topic/305059-is-the-m9-still-worth-it-in-2020/?tab=comments#comment-3885341", "origin": "L-forum", "suborigin": "305059-is-the-m9-still-worth-it-in-2020", "result": false, "Selector": "i learned to develop", "selectorShort": "develop", "MarkedSent": "i learned to develop and wet-print my own -----> film !!!  at home - even colour prints.", "sortedWord": "film", "Identifyer": null, "identifyer": 33618, "year": "2020"}, {"autor": "Shameetman", "date": "2020-04-23 19:02:00", "content": " A week ago I developed a rol of film, everything fine. Today I developed another role and many overexposed shots. I checked my camera and discovered a nasty hole. How is this possible? Leica repairs are usually not cheap, I want to make sure not to get this again. Any advice? --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/308818-suddenly-a-hole-in-my-m7-curtain-how-is-this-possible/?tab=comments#comment-3959651", "origin": "L-forum", "suborigin": "308818-suddenly-a-hole-in-my-m7-curtain-how-is-this-possible", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": " a week ago i developed a rol of -----> film !!! , everything fine.", "sortedWord": "film", "Identifyer": null, "identifyer": 4319, "year": "2020"}, {"autor": "Shameetman", "date": "2020-04-24 19:48:00", "content": "Bought liquid rubber and works perfect again. Developed a role and the leak is gone. 🙌🏼", "link": "https://www.l-camera-forum.com/topic/308818-suddenly-a-hole-in-my-m7-curtain-how-is-this-possible/?tab=comments#comment-3960330", "origin": "L-forum", "suborigin": "308818-suddenly-a-hole-in-my-m7-curtain-how-is-this-possible", "result": false, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "developed a -----> role !!!  and the leak is gone. 🙌🏼", "sortedWord": "role", "Identifyer": null, "identifyer": 4333, "year": "2020"}, {"autor": "Narsuitus", "date": "2020-12-07 18:22:00", "content": " 2 hours ago, plasticman said: Funnily enough I do the exact opposite. That is funny but totally understandable. I, too, am very satisfied emulating black&white film on my digital cameras. However, I enjoy developing film. Before the digital age, I enjoyed developing my own b&w film and color slide film. When it became too difficult for me to find a reliable source for 1-gallon E6 chemistry and a good supply of color slide film, I found it much easier to use a digital camera for all my color work. On the other hand, since I still shoot medium format and large format black & white film, it is easy for me to also shoot 35mm b&w film and develop all the film myself. If I ever find a medium format digital camera that I like, I will probably stop shooting black & white film. Edited December 7, 2020 by Narsuitus", "link": "https://www.l-camera-forum.com/topic/315812-shooting-both-film-and-digital/page/2/?tab=comments#comment-4094092", "origin": "L-forum", "suborigin": "315812-shooting-both-film-and-digital", "result": false, "Selector": "i enjoy developing", "selectorShort": "develop", "MarkedSent": "however, i enjoy developing -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 5821, "year": "2020"}, {"autor": "oldwino", "date": "2020-12-08 19:18:00", "content": "On 12/7/2020 at 9:18 AM, gabrielaszalos said: The actual hidden reason behind my original post was figuring out why I actually even need two cameras (both film and digital) because it’s not clear to me. I’m not even sure I need a digital camera, but I do like Leica and the experience. Most of use don't \"need\" two (or more) cameras at all. But for many, myself included, part of the appeal to photography is in using the gear, and most of the pleasure of using the gear, for me, is found with mechanical, film-eating cameras. I have a few digital cameras, too, and they are amazingly easy and consistent to use. The other day, my wife and I went for a walk in the woods, and I decided to take my trusty M2 and 35 'cron and a roll of Delta 400. It was wonderfully liberating, snapping away (just 36 times!), not expecting or caring about anything \"great\". I developed the film the next day, and scanned them later in the evening. So nice! Nothing looks like film...(and again I think about reactivating my darkroom)...", "link": "https://www.l-camera-forum.com/topic/315812-shooting-both-film-and-digital/page/2/?tab=comments#comment-4094777", "origin": "L-forum", "suborigin": "315812-shooting-both-film-and-digital", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i developed the -----> film !!!  the next day, and scanned them later in the evening.", "sortedWord": "film", "Identifyer": null, "identifyer": 5830, "year": "2020"}, {"autor": "gabrielaszalos", "date": "2020-12-08 19:59:00", "content": "40 minutes ago, oldwino said: Most of use don't \"need\" two (or more) cameras at all. But for many, myself included, part of the appeal to photography is in using the gear, and most of the pleasure of using the gear, for me, is found with mechanical, film-eating cameras. I have a few digital cameras, too, and they are amazingly easy and consistent to use. The other day, my wife and I went for a walk in the woods, and I decided to take my trusty M2 and 35 'cron and a roll of Delta 400. It was wonderfully liberating, snapping away (just 36 times!), not expecting or caring about anything \"great\". I developed the film the next day, and scanned them later in the evening. So nice! Nothing looks like film...(and again I think about reactivating my darkroom)... Thank you for this answer. I do share the sentiment.", "link": "https://www.l-camera-forum.com/topic/315812-shooting-both-film-and-digital/page/2/?tab=comments#comment-4094802", "origin": "L-forum", "suborigin": "315812-shooting-both-film-and-digital", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i developed the -----> film !!!  the next day, and scanned them later in the evening.", "sortedWord": "film", "Identifyer": null, "identifyer": 5833, "year": "2020"}, {"autor": "RayD28", "date": "2020-12-11 12:43:00", "content": " On 12/6/2020 at 1:16 PM, gabrielaszalos said: For those of you out there who own both film and digital Leicas - when do you choose digital over film? I know one obvious answer is commercial work for those who do that but I am more curious about other answers. Sorry to repeat some of the things others have listed. 1. Color. I have not shot color film in many years since my only option is mailing the film off. Plus the cost of color film and processing. I believe a roll of color film and development and scanning for tiffs is about $30 per roll. 2. Fast shutter speed, either for fast action or shallower DOF in bright scenes. 3. Histogram when the action is fast and light is tricky. 4. I need to chimp to make sure I'm getting the shot, especially focus when it's fast moving action in lower light. Also, camera shake is getting to be more common for me. 5. Ability to change ISO. I often have a film and digital M in my bag, usually with different focal lengths. It gives me options. My results might suffer because of not not having a single purpose. Also, I enjoy developing B&W film. I only wish I had a film dryer.", "link": "https://www.l-camera-forum.com/topic/315812-shooting-both-film-and-digital/page/4/?tab=comments#comment-4096507", "origin": "L-forum", "suborigin": "315812-shooting-both-film-and-digital", "result": false, "Selector": "i enjoy developing", "selectorShort": "develop", "MarkedSent": "also, i enjoy developing b&w -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 5861, "year": "2020"}, {"autor": "lmans", "date": "2020-12-02 13:41:00", "content": " I develop my own film and then use my Plustek scanner so the negatives can be processed using software. I prefer Pixelmator Software for my Mac. I like the analog feel and finished product of shooting film .... but other than developing with chemicals, I use the software as I don't have the room for a dark room, so a dry dark room is fine with me. While I used to have a printer, I found the quality is high when I use a company that prints what I select for them. Best of both worlds....jim", "link": "https://www.l-camera-forum.com/topic/315673-shoot-film-and-digitized-it/?tab=comments#comment-4090879", "origin": "L-forum", "suborigin": "315673-shoot-film-and-digitized-it", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": " i develop my own -----> film !!!  and then use my plustek scanner so the negatives can be processed using software.", "sortedWord": "film", "Identifyer": null, "identifyer": 6701, "year": "2020"}, {"autor": "lmans", "date": "2020-11-19 14:06:00", "content": " I read on this forum a suggestion that I use ...I re-wind the film all the way. Then when I develop, I pop the top off, and hold the film in my fist as I feed it into the spool. The reason being is that 'scratches' can be had coming out of the film canister as you feed it onto the spool. That 'felt' ....is not enough at times or dust gets in the felt or whatever. But either way I have noticed a lack of scratches in my negatives.", "link": "https://www.l-camera-forum.com/topic/315153-m6-loading/page/2/?tab=comments#comment-4083182", "origin": "L-forum", "suborigin": "315153-m6-loading", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "then when i develop, i pop the top off, and hold the -----> film !!!  in my fist as i feed it into the spool.", "sortedWord": "film", "Identifyer": null, "identifyer": 6823, "year": "2020"}, {"autor": "250swb", "date": "2020-11-21 08:27:00", "content": "On 11/19/2020 at 2:06 PM, lmans said: I read on this forum a suggestion that I use ...I re-wind the film all the way. Then when I develop, I pop the top off, and hold the film in my fist as I feed it into the spool. The reason being is that 'scratches' can be had coming out of the film canister as you feed it onto the spool. That 'felt' ....is not enough at times or dust gets in the felt or whatever. But either way I have noticed a lack of scratches in my negatives. Saving the film from another trip through the felt light seal is always a good thing. In photography it's all the little things that add up to reliability and repeatability. It doesn't need to be dust that scratches the film, feeding film onto reels can put the film at an acute angle as it travels through the light seal so friction can scratch the film. This is especially true if you are loading the film onto a reel in the confined space of a changing bag.", "link": "https://www.l-camera-forum.com/topic/315153-m6-loading/page/2/?tab=comments#comment-4084354", "origin": "L-forum", "suborigin": "315153-m6-loading", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "then when i develop, i pop the top off, and hold the -----> film !!!  in my fist as i feed it into the spool.", "sortedWord": "film", "Identifyer": null, "identifyer": 6824, "year": "2020"}, {"autor": "earthphoto", "date": "2020-11-02 15:34:00", "content": "Am 13.9.2020 um 19:27 schrieb a.noctilux: Why not, this would be based on MP plus some parts left from M7. The M3's style rewind is a pain to use on MP/M-A that I have for some years now. Even worse with the add-on \"lever\" hurting digits in hard use. Then why not with the articulated wind-on lever of M7 style ( I know that it's not the same as MP/M-A ! ). Maybe I'll buy one or two to replace M-As 😇. I love the M2/M3 rewind knob over my M6. Why? I develop film by myself. I have a MUCH MUCH better feeling of when the film is ready to take it out of the M2 without winding it 100% back! Try it out!", "link": "https://www.l-camera-forum.com/topic/313311-rumour-about-a-new-m6-1984-from-leica/page/3/?tab=comments#comment-4072704", "origin": "L-forum", "suborigin": "313311-rumour-about-a-new-m6-1984-from-leica", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop -----> film !!!  by myself.", "sortedWord": "film", "Identifyer": null, "identifyer": 7025, "year": "2020"}, {"autor": "andrew01", "date": "2020-11-02 18:10:00", "content": "2 hours ago, earthphoto said: I love the M2/M3 rewind knob over my M6. Why? I develop film by myself. I have a MUCH MUCH better feeling of when the film is ready to take it out of the M2 without winding it 100% back! Try it out! I think that part of the reason is that the leader is attached to the spring clip on the take up spool in M2 and M3, so you need to apply extra pressure on the rewind knob at the end. I prefer the M3 rewind action too. Its a bit slower but has a smoother high precision feel to it.", "link": "https://www.l-camera-forum.com/topic/313311-rumour-about-a-new-m6-1984-from-leica/page/3/?tab=comments#comment-4072827", "origin": "L-forum", "suborigin": "313311-rumour-about-a-new-m6-1984-from-leica", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop -----> film !!!  by myself.", "sortedWord": "film", "Identifyer": null, "identifyer": 7027, "year": "2020"}, {"autor": "Camaro5", "date": "2020-09-06 15:36:00", "content": "My prior analog work was all on a Hasselblad 503CX medium format camera. I've used various speeds of Tmax, Ektar, and some Fuji 120 roll films which did not exhibit the same level of grain that HP5+ had. The HP5+ just had more grain than I liked. Looking back, I should have used a film I was more familiar with for this particular shoot. I don't develop film myself; it gets sent to a lab on the west coast for developing & high-res scanning.", "link": "https://www.l-camera-forum.com/topic/312842-do-all-r-bodies-have-the-same-image-quality/?tab=comments#comment-4041058", "origin": "L-forum", "suborigin": "312842-do-all-r-bodies-have-the-same-image-quality", "result": false, "Selector": "i don't develop", "selectorShort": "develop", "MarkedSent": "i don't develop -----> film !!!  myself; it gets sent to a lab on the west coast for developing & high-res scanning.", "sortedWord": "film", "Identifyer": null, "identifyer": 20149, "year": "2020"}, {"autor": "Dreamplace", "date": "2020-09-06 21:54:00", "content": "6 hours ago, Camaro5 said: My prior analog work was all on a Hasselblad 503CX medium format camera. I've used various speeds of Tmax, Ektar, and some Fuji 120 roll films which did not exhibit the same level of grain that HP5+ had. The HP5+ just had more grain than I liked. Looking back, I should have used a film I was more familiar with for this particular shoot. I don't develop film myself; it gets sent to a lab on the west coast for developing & high-res scanning. Ahaaah.... No 35mm negative will ever get even close to the grain and image quality of medium format. If you want minimal grain, use a film like Tmax 100, and have it developed in Xtol (if the lab gives you that option...). But even then, it will be more grainy than (scans from) medium format negatives. Edited September 6, 2020 by Dreamplace", "link": "https://www.l-camera-forum.com/topic/312842-do-all-r-bodies-have-the-same-image-quality/page/2/?tab=comments#comment-4041290", "origin": "L-forum", "suborigin": "312842-do-all-r-bodies-have-the-same-image-quality", "result": false, "Selector": "i don't develop", "selectorShort": "develop", "MarkedSent": "i don't develop -----> film !!!  myself; it gets sent to a lab on the west coast for developing & high-res scanning.", "sortedWord": "film", "Identifyer": null, "identifyer": 20153, "year": "2020"}, {"autor": "Bohns", "date": "2020-11-10 21:02:00", "content": "I will sure test it with a B&W film I can develop myself. Then my wife and kids will keep it until the end of the month. This is the only tolerance I could obtain. They are tough.", "link": "https://www.l-camera-forum.com/topic/314920-leica-r8-second-hand-buy-advice/?tab=comments#comment-4077925", "origin": "L-forum", "suborigin": "314920-leica-r8-second-hand-buy-advice", "result": false, "Selector": "i can develop", "selectorShort": "develop", "MarkedSent": "i will sure test it with a b&w -----> film !!!  i can develop myself.", "sortedWord": "film", "Identifyer": null, "identifyer": 20660, "year": "2020"}, {"autor": "bags27", "date": "2020-11-03 05:13:00", "content": " I agree with your approach lenscap. I gave up on photography with the advent of digital (a big mistake on my part). But 15 years later, returning and to digital, I felt I had failed to develop my skills. So, I'm back to film. Making myself shoot and develop a couple of rolls of B&W at a time, if for nothing else just taking note of changing light. And I agree about the Nikon. I tried and tried to convince myself of the Z. However, I cannot get myself to buy it for the same reason you say: although it has, far and away, the best UI of any non-Leica, it remains, far and away, inferior to the Leica in UI. Once one uses a Leica, I'm afraid that is the end to that. There is an excellent Instagram thread called Mamiya7ruinedeverything. For FF film and digital there should be one called Leicaruinedeverything. I sold my Q for somewhat similar reasons as you. And if the M can no longer work for you, I agree with jaap. I'm attached to my CL and will snap up a CL2. Give it a look: you can focus M glass nicely through its EVF. But as my good friend Tailwagger keeps telling me: shoot, shoot, shoot.", "link": "https://www.l-camera-forum.com/topic/314747-struggling-to-decide-between-camera-formats-leicanikon/?tab=comments#comment-4073051", "origin": "L-forum", "suborigin": "314747-struggling-to-decide-between-camera-formats-leicanikon", "result": false, "Selector": "i had failed to develop", "selectorShort": "develop", "MarkedSent": "but 15 years later, returning and to digital, i felt i had failed to develop my -----> skills !!! .", "sortedWord": "skill", "Identifyer": null, "identifyer": 77354, "year": "2020"}, {"autor": "emilkarl", "date": "2020-11-21 09:29:00", "content": "Thanks for all the replies and theories. It actually seems like it was a development issue somewhere and not the camera.Yesterday I finished a new roll of HP5+ that I developed for 800. I followed the same recipe but was very careful with all of the steps. When rolling up the film on the reel. Made 100% sure that the reel was in the bottom of the tank, put the other reel on top.By no means perfect but there is at least no sign of bromide drag or light leaks. --img-- --img-- --img-- --img-- --img-- --img-- --img-- --img--  Edited November 21, 2020 by emilkarl", "link": "https://www.l-camera-forum.com/topic/315359-m6-light-leak-or-bromide-drag/?tab=comments#comment-4084368", "origin": "L-forum", "suborigin": "315359-m6-light-leak-or-bromide-drag", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "it actually seems like it was a development issue somewhere and not the camera.yesterday i finished a new -----> roll !!!  of hp5+ that i developed for 800.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100160, "year": "2020"}, {"autor": "Ouroboros", "date": "2020-11-21 11:07:00", "content": "1 hour ago, emilkarl said: Thanks for all the replies and theories. It actually seems like it was a development issue somewhere and not the camera.Yesterday I finished a new roll of HP5+ that I developed for 800. I followed the same recipe but was very careful with all of the steps. When rolling up the film on the reel. Made 100% sure that the reel was in the bottom of the tank, put the other reel on top.By no means perfect but there is at least no sign of bromide drag or light leaks. --img-- --img-- --img-- --img-- --img-- --img-- --img-- --img--  Good that you haven't repeated the problem this time. It's a light leak from somewhere in your handling method.", "link": "https://www.l-camera-forum.com/topic/315359-m6-light-leak-or-bromide-drag/?tab=comments#comment-4084423", "origin": "L-forum", "suborigin": "315359-m6-light-leak-or-bromide-drag", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "it actually seems like it was a development issue somewhere and not the camera.yesterday i finished a new -----> roll !!!  of hp5+ that i developed for 800.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100164, "year": "2020"}, {"autor": "tm35", "date": "2020-12-06 04:27:00", "content": "I am about to create another thread but found this post. These were taken with M6 on double-x film. I am wondering if these are sign of light leak? I thought it was development issue, but it happened at similar location on most shots in this roll so I ruled that out. But I would image leak would make it lighter rather than darker? I developed this roll after I sent my camera for CLA. Hope to figure out whether this is camera issue so that it can be addressed. Thanks. --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/315359-m6-light-leak-or-bromide-drag/?tab=comments#comment-4093079", "origin": "L-forum", "suborigin": "315359-m6-light-leak-or-bromide-drag", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i developed this -----> roll !!!  after i sent my camera for cla. hope to figure out whether this is camera issue so that it can be addressed.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100167, "year": "2020"}, {"autor": "Gibbo", "date": "2020-09-01 20:32:00", "content": "Indeed, Steve. I developed a roll today having shot it at 400 and it looks fine to me. I shall scan it later for a better look. Just not sure how to work out how long to develop it for if I push it to 800 say. The film I developed today was a 1+9 mixture for 13 minutes at 20°. The chart I found on Google just had standard times and said that times for push or pull were on a chart in the box the developer comes in. Well, not in mine 😂 Edited September 1, 2020 by Gibbo", "link": "https://www.l-camera-forum.com/topic/312914-just-to-be-awkward/?tab=comments#comment-4037859", "origin": "L-forum", "suborigin": "312914-just-to-be-awkward", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i developed a -----> roll !!!  today having shot it at 400 and it looks fine to me.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100229, "year": "2020"}, {"autor": "jmahto", "date": "2020-09-27 16:25:00", "content": " 15 minutes ago, andybarton said: This will keep you happy for hours. Or maybe 6.5 minutes. https://www.digitaltruth.com/devchart.php?Film=%Ilford+HP5%&Developer=&mdc=Search&TempUnits=C&TimeUnits=D They do a great App for your phone with all this on, too. I routinely use their app on iPhone and it has never let me down (over 50+ rolls so far). I have always had good results. I mostly use DD-X (1+4) but sometimes Rodinal too. For me value of app is for adjusting time for temp deviation (from 70F). I am too lazy to keep water temp to perfect 70F. I have also developed rolls expired 10 years ago and left unexposed in my drawer. They looked fine to me. For me BW development is quite fault tolerant. I might not get “the best” results but every time get “good” results. When I do mess up, it is due to really bad exposure and not due to development. Edited September 27, 2020 by jmahto", "link": "https://www.l-camera-forum.com/topic/312914-just-to-be-awkward/?tab=comments#comment-4053289", "origin": "L-forum", "suborigin": "312914-just-to-be-awkward", "result": false, "Selector": "i have also developed", "selectorShort": "develop", "MarkedSent": "i have also developed -----> rolls !!!  expired 10 years ago and left unexposed in my drawer.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100233, "year": "2020"}, {"autor": "bags27", "date": "2020-10-21 15:00:00", "content": "Good for you, George!! I began shooting film again around a year ago, and over the past 6 months have taken only a few digital shots. Develop my own B&W; send my color film out. I scan all the film myself, which is now fun (once I got the workflow) and saves bundles as it comes out high rez. It's fun playing with different combinations of film and developer. Perhaps it's the pandemic, which gives me more time at home, but whatever, I find film more meditative and holistic. I feel more in control with film--I'm not dependent on some algorithms crammed into a chip in the camera. Most importantly, I laugh at my incredibly stupid mistakes.", "link": "https://www.l-camera-forum.com/topic/314233-first-two-rolls-of-film-since/?tab=comments#comment-4066249", "origin": "L-forum", "suborigin": "314233-first-two-rolls-of-film-since", "result": false, "Selector": "develop", "selectorShort": "develop", "MarkedSent": "develop my own b&w; send my color -----> film !!!  out.", "sortedWord": "film", "Identifyer": null, "identifyer": 100318, "year": "2020"}, {"autor": "gteague", "date": "2020-10-21 15:05:00", "content": "4 minutes ago, bags27 said: Good for you, George!! I began shooting film again around a year ago, and over the past 6 months have taken only a few digital shots. Develop my own B&W; send my color film out. I scan all the film myself, which is now fun (once I got the workflow) and saves bundles as it comes out high rez. It's fun playing with different combinations of film and developer. Perhaps it's the pandemic, which gives me more time at home, but whatever, I find film more meditative and holistic. I feel more in control with film--I'm not dependent on some algorithms crammed into a chip in the camera. Most importantly, I laugh at my incredibly stupid mistakes. some of my best shots have resulted from stupid mistakes! /guy", "link": "https://www.l-camera-forum.com/topic/314233-first-two-rolls-of-film-since/?tab=comments#comment-4066254", "origin": "L-forum", "suborigin": "314233-first-two-rolls-of-film-since", "result": false, "Selector": "develop", "selectorShort": "develop", "MarkedSent": "develop my own b&w; send my color -----> film !!!  out.", "sortedWord": "film", "Identifyer": null, "identifyer": 100319, "year": "2020"}, {"autor": "Einst_Stein", "date": "2020-10-27 03:34:00", "content": " I develop my own film in my bathroom. It is rather simple, and does not need much space. I have a water bath heater with the size of a coffee cup which can control the temperature within 1 degree in the range of 10~50 degree. This simple setup is good enough for both B&W and C41 (and E6 too though I am to doing E6 anymore ). I use Paterson develop drum. I use one-shot chemistry for B&W, HC100, Rodinal, and PMK are my favorite, and I will stay with HC100 once my Rodinal and PMK runs out. C41 is not one-shot. The develop drum I have is not convenient for draining the used chemical back to the bottle. I used to use Jobo develop drum but I add to it the DUOLAB type lid (unfortunate, discontinued!) that you can screw the Job chemical bottle to the lid. The development starts with turning bottle-drum pair to pour the chemical into the drum, and stops by turning the bottle-drum pair to drain the chemical back to the bottle. I repeat this for every steps (dev, stop, fix, etc.). (Jobo's recommended setup, CPP or CPE, takes too much space, though it could be more efficient.). Depends on the amount of films to develop, I choose the drum of the right size (1~6 rolls at a time). The whole process is less an hour, not much more than driving to the photo labs (forget it, no longer a choice). Converting to digital file is through a digital camera. I have App Rodagon-D 75mm but 50mm f2 or f2.8 is very popular and easy to get.", "link": "https://www.l-camera-forum.com/topic/314233-first-two-rolls-of-film-since/?tab=comments#comment-4068966", "origin": "L-forum", "suborigin": "314233-first-two-rolls-of-film-since", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": " i develop my own -----> film !!!  in my bathroom.", "sortedWord": "film", "Identifyer": null, "identifyer": 100320, "year": "2020"}, {"autor": "Geoff Marshall", "date": "2020-06-27 21:45:00", "content": "Thanks for the info, I will order some of this film and give it a try. I don’t mind doing the development myself as I have developed mono transparency film in the past.", "link": "https://www.l-camera-forum.com/topic/310100-anyone-used-adox-scala-film/?tab=comments#comment-4000454", "origin": "L-forum", "suborigin": "310100-anyone-used-adox-scala-film", "result": false, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "i don’t mind doing the development myself as i have developed mono transparency -----> film !!!  in the past.", "sortedWord": "film", "Identifyer": null, "identifyer": 100416, "year": "2020"}, {"autor": "jwillyf", "date": "2020-08-20 21:40:00", "content": "Feeding back. I have now developed a roll of Acros 100 II having exposed it at ASA100 and developed it for 6 mins in Ilfotec HC 1:31 at. 20 deg C. Observations: A strong green colouring is seen when the dev is discarded. A pink colour is seen in the discarded fix and washing should be continued until the water is clear. If a lilac colour is seen on the dried negs, then the negs are inadequately fixed. It seems that fix needs to be continued for rather longer than the standard 4 minutes with Ilford Rapid fixer. The negs look a little thin and totally flat so perhaps an ASA of 80 and dev for 7 mins might be better. Having said that, digitising the negs with Plustek OpticFilm 8200i film scanner and conversion to positive with the excellent Grain2 Pixel software produced files with excellent tonal range, good latitude for post-processing, and with very fine grain.", "link": "https://www.l-camera-forum.com/topic/312049-dev-time-for-acros-100-ii/?tab=comments#comment-4030443", "origin": "L-forum", "suborigin": "312049-dev-time-for-acros-100-ii", "result": false, "Selector": "i have now developed", "selectorShort": "develop", "MarkedSent": "i have now developed a -----> roll !!!  of acros 100 ii having exposed it at asa100 and developed it for 6 mins in ilfotec hc 1:31 at.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100425, "year": "2020"}, {"autor": "Dmitry Belyakov", "date": "2020-07-08 15:55:00", "content": " Hello everybody, I am getting a little frustrated with my home processing results. Long story short - I've got a ~20 roll bag of ultramax I've been shooting around the house during lockdown, that I later developed with Tetenal Colortec. The majority of the rolls came out pretty bad - very dark and the base is of a weird color (re-blixing didn't help). Now I don't know what went wrong: the film (bought from different shops), storage (fridge/bag), moisture (fridge film is in plastic canisters in a plastic bag), my development (temperature/contamination)? I'll attach an example and hope somebody can suggest something. Oh and the funny thing is (not funny actually) - some rolls turn out alright, but most of them don't. I will appreciate any input you might have, Thank you. --img-- ", "link": "https://www.l-camera-forum.com/topic/311190-tetanal-ultramax-what-happened/?tab=comments#comment-4005890", "origin": "L-forum", "suborigin": "311190-tetanal-ultramax-what-happened", "result": false, "Selector": "i later developed", "selectorShort": "develop", "MarkedSent": "long story short - i've got a ~20 -----> roll !!!  bag of ultramax i've been shooting around the house during lockdown, that i later developed with tetenal colortec.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100609, "year": "2020"}, {"autor": "Dmitry Belyakov", "date": "2020-07-09 11:43:00", "content": "Hi guys and thanks a lot for you input! 14 hours ago, 250swb said: If the whole of the film is like the dark top strip I'd say perhaps it's chemical fogging. If your chemicals are too hot and also very fresh they can cause this effect. Yes that might be the freshness as I started wit ha new 1 liter kit and put 12 400iso rolls through it. However I got consistently bad results for the most part with 2 or 3 rolls of the bunch coming up ok. I'm leaning towards bad batch from a supplier because sometimes i developed two rolls where one came out alright and the other didn't. Also I have a pretty basic cheap thermometer that's analogue and hard to read accurately. I guess I could have been off perfect 38C° by ~1 degree. @250swb do you recon being a bit off on the temperature can give such radically bad results? Contamination is my other suspicion, because I didn't have the bottles labeled properly at first (just the lids) which since then has been corrected. i tried scanning them last night with both a dedicated scanner and an digital camera: unfortunately they are too contrasty and dense - the positives come out as if they were shot on an instant film (very high contrast and colour shifts). It's a great shame because I have 12 rolls of this and they're all in a mixed bag so I can't tell which one is which. Another lesson learned I guess... 6 hours ago, adan said: I tend to go with the \"different shops\" theory, unless you know exactly how they were stored in each store, and for how long, and how old they were (expiration dates). Film stored in too warm an environment can go bad before the expiration date (which assumes, at most, \"room\" temperatures - 72°F or less, except for that Pro-Image film supposedly designed for the tropics). Leaving color film in a car (or camera) baking in the sun can fog it pretty quickly - but I guess just shooting around the house during lockdown rules that out in this case. Color film has a lot of organic chemicals in it (dyes and such) and it is best to treat it like mayonnaise - don't let it get too warm for any length of time! Yes that was my thinking exactly, but I still want to rule every other option out before starting to blame the supplier. I stored the rolls in the fridge, as I do, and the film was supposed be good till 2021 when I got it. I do leave film in the camera however, sometimes for up to a week, @adan do you think this can cause such an issue? I also take a roll or two out of the fridge and keep them in my bag as spares at all times. Perhaps that's not advisable as well - I just wasn't sure if it's ok to load shoot film straight from the fridge. Also, I enjoyed the mayonnaise analogy In any case, I am now replacing the chemistry and getting a new more precise digital thermometer to at least try and eliminate these two parameters. P.S. I will attach an example of what I was able to pull out of the bad negative with a multi-exposure scan that took ages, vs the well-developed negative (both by me in the same chemistry) --img--  Edited July 9, 2020 by Dmitry Belyakov", "link": "https://www.l-camera-forum.com/topic/311190-tetanal-ultramax-what-happened/?tab=comments#comment-4006237", "origin": "L-forum", "suborigin": "311190-tetanal-ultramax-what-happened", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i'm leaning towards bad batch from a supplier because sometimes i developed two -----> rolls !!!  where one came out alright and the other didn't.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100612, "year": "2020"}, {"autor": "Caolan Brady", "date": "2020-06-09 21:15:00", "content": "5 hours ago, fatihayoglu said: Yes, I always check 1lt options. It makes sense for 2.5litre can develop 40. 16x2.5=40 Gotcha! I actually developed about 55 rolls today with the 2.5 kit and they all came out really nice. I'm scared to push even more though.", "link": "https://www.l-camera-forum.com/topic/310422-how-many-35mm-rolls-will-the-tetenal-c41-colortec-25l-kit-develop/?tab=comments#comment-3990614", "origin": "L-forum", "suborigin": "310422-how-many-35mm-rolls-will-the-tetenal-c41-colortec-25l-kit-develop", "result": false, "Selector": "i actually developed", "selectorShort": "develop", "MarkedSent": "i actually developed about 55 -----> rolls !!!  today with the 2.5 kit and they all came out really nice.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100745, "year": "2020"}, {"autor": "fatihayoglu", "date": "2020-06-09 21:33:00", "content": "27 minutes ago, Caolan Brady said: Gotcha! I actually developed about 55 rolls today with the 2.5 kit and they all came out really nice. I'm scared to push even more though. Wow, that’s really good actually, what films are you developing? OTH that means I need to wait and collect more films before I start to develop On that note, how do you keep your solutions fresh? What kind of bottles? Are you mixing in small quantities or the whole 2,5 litre? Edited June 9, 2020 by fatihayoglu", "link": "https://www.l-camera-forum.com/topic/310422-how-many-35mm-rolls-will-the-tetenal-c41-colortec-25l-kit-develop/?tab=comments#comment-3990621", "origin": "L-forum", "suborigin": "310422-how-many-35mm-rolls-will-the-tetenal-c41-colortec-25l-kit-develop", "result": false, "Selector": "i actually developed", "selectorShort": "develop", "MarkedSent": "i actually developed about 55 -----> rolls !!!  today with the 2.5 kit and they all came out really nice.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100746, "year": "2020"}, {"autor": "Caolan Brady", "date": "2020-06-12 22:38:00", "content": "On 6/9/2020 at 10:33 PM, fatihayoglu said: Wow, that’s really good actually, what films are you developing? OTH that means I need to wait and collect more films before I start to develop On that note, how do you keep your solutions fresh? What kind of bottles? Are you mixing in small quantities or the whole 2,5 litre? A mixture of different ISO's but mainly between 200 and 400 and all 35mm. I actually run a business developing film and we mainly use a machine but have been so busy we've used tanks but we tend to keep the solution in plastic 5 litre tubs we go through a lot daily and we mix it all up, never been an issue. I had about 150 rolls of my own to get done so wanted to see how many I could get out of the 2.5l kit, they all came out great, but I would say 50 is the maximum now.", "link": "https://www.l-camera-forum.com/topic/310422-how-many-35mm-rolls-will-the-tetenal-c41-colortec-25l-kit-develop/?tab=comments#comment-3992315", "origin": "L-forum", "suborigin": "310422-how-many-35mm-rolls-will-the-tetenal-c41-colortec-25l-kit-develop", "result": false, "Selector": "i start to develop", "selectorShort": "develop", "MarkedSent": "oth that means i need to wait and collect more -----> films !!!  before i start to develop on that note, how do you keep your solutions fresh?", "sortedWord": "film", "Identifyer": null, "identifyer": 100749, "year": "2020"}, {"autor": "Narsuitus", "date": "2020-06-07 15:08:00", "content": "Years ago, I shot color slide film, color print film, and black & white film in 35mm, 120 medium format, and 4x5 inch and 8x10 inch large format. I developed my color slide film in E4 chemistry and later in E6 chemistry. I developed my black & white film primarily in Kodak D76 or a customized two-bath variation of D76. I had a professional lab process my color print film. Today, I primarily shoot 35mm and 120 medium format black & white film (Ilford HP5+ 400 film and Fomapan ISO 100 film) in a customized two-bath variation of D76. --img--  Film Supply by Narsuitus, on Flickr", "link": "https://www.l-camera-forum.com/topic/306073-what-is-everyone%E2%80%99s-favourite-film-stocks/page/2/?tab=comments#comment-3989158", "origin": "L-forum", "suborigin": "306073-what-is-everyone%E2%80%99s-favourite-film-stocks", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i developed my color slide -----> film !!!  in e4 chemistry and later in e6 chemistry.", "sortedWord": "film", "Identifyer": null, "identifyer": 100800, "year": "2020"}, {"autor": "giannis", "date": "2020-05-29 17:18:00", "content": "1. You can do it in lower temps, but it gives the best results at the recommended 39ºC temp. Even deviating a degree or a couple seconds at the recommended temp, will yield a better colour balance than being on the spot at the extended times of a low temp regime. 2. You could do either. Follow the instructions for small tanks. I do 5 seconds (i.e. 2-3 inversions, or spinning the agitator stick) every 30 seconds in small tanks. It works fine. 3. There's instruction on the kit saying how to adjust time. Depends on the quantity as well. If you're using a 1L kit (i.e. pouring back the used developer into a 1L bottle with \"fresh\" developer), every subsequent film will need less percentage of increase, compared to using say 500ml. I mix my dev in 500ml batches, for every subsequent film I give +4% more time. If I mix it in 1L batches, for every subsequent film +2%. I count ISO400 films, as 1.5 film each. That is, if I develop 2 ISO400 film, I adjust my times as if I developed 3. You could count them as 2 if you want, to make your life easier and be on the safe side. But check the instructions on your kit to calculate things precisely.", "link": "https://www.l-camera-forum.com/topic/310080-questions-on-c41-development-at-home/?tab=comments#comment-3982779", "origin": "L-forum", "suborigin": "310080-questions-on-c41-development-at-home", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "that is, if i develop 2 iso400 -----> film !!! , i adjust my times as if i developed 3.", "sortedWord": "film", "Identifyer": null, "identifyer": 100826, "year": "2020"}, {"autor": "fatihayoglu", "date": "2020-05-29 19:21:00", "content": "2 hours ago, giannis said: 1. You can do it in lower temps, but it gives the best results at the recommended 39ºC temp. Even deviating a degree or a couple seconds at the recommended temp, will yield a better colour balance than being on the spot at the extended times of a low temp regime. 2. You could do either. Follow the instructions for small tanks. I do 5 seconds (i.e. 2-3 inversions, or spinning the agitator stick) every 30 seconds in small tanks. It works fine. 3. There's instruction on the kit saying how to adjust time. Depends on the quantity as well. If you're using a 1L kit (i.e. pouring back the used developer into a 1L bottle with \"fresh\" developer), every subsequent film will need less percentage of increase, compared to using say 500ml. I mix my dev in 500ml batches, for every subsequent film I give +4% more time. If I mix it in 1L batches, for every subsequent film +2%. I count ISO400 films, as 1.5 film each. That is, if I develop 2 ISO400 film, I adjust my times as if I developed 3. You could count them as 2 if you want, to make your life easier and be on the safe side. But check the instructions on your kit to calculate things precisely. That’s great mate thanks a lot", "link": "https://www.l-camera-forum.com/topic/310080-questions-on-c41-development-at-home/?tab=comments#comment-3982831", "origin": "L-forum", "suborigin": "310080-questions-on-c41-development-at-home", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "that is, if i develop 2 iso400 -----> film !!! , i adjust my times as if i developed 3.", "sortedWord": "film", "Identifyer": null, "identifyer": 100827, "year": "2020"}, {"autor": "fatihayoglu", "date": "2020-05-30 11:08:00", "content": "2 hours ago, 250swb said: As far as I can see the lower temperature makes no difference at all to the colour. Like I said, there is enough leeway in the technique so that by the time you have exhausted the kit it makes little or no difference if you have mixed low and high ISO films during processing, it is only if you have predominately processed high ISO films (or push processed) that you would throw the chemicals away sooner. I think you'll get to the theoretical time to throw the chemicals away whatever the ISO is and be thinking 'these must be good enough for a few more films yet'. And they will be, but that is where the cliff edge is, it's an unknown area beyond the safe 'use by' limit in the instructions. Either way the chemicals don't suddenly fail so perhaps until you get the hang of them photograph a test chart on each film to compare the first and then last to see if any difference in colour is creeping in. Thanks Steve, so for the first few tries, I will stick to given use by charts, which is 12 rolls for ISO400 and above or 16 rolls for ISO200 and below, both at 38. At least this way if I do a mistake I can narrow it down faster and also have an understanding what an optimal result should look like should the development go smoothly. In the future, probably I can process first Portra and Ektars and towards the end continue with Gold etc. On another question, all the instructions are given for either 1lt solution or 500ml. However my tank (if you'd recall) requires 600ml solution. Do you think I can pour 600ml back to the bottle once I develop first 2 rolls, where 400ml fish solution is, mix them and then develop another couple of rolls with the same duration for the first couple rolls? If that is not clear, what I mean is (fresh unused 1lt solution); develop 2 rolls with 600ml at 03:15, pour the developer back to the bottle where 400ml fresh developer is and develop another 2 rolls with mixed developer again at 03:15? Many thanks, Fatih", "link": "https://www.l-camera-forum.com/topic/310080-questions-on-c41-development-at-home/?tab=comments#comment-3983162", "origin": "L-forum", "suborigin": "310080-questions-on-c41-development-at-home", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "do you think i can pour 600ml back to the bottle once i develop first 2 -----> rolls !!! , where 400ml fish solution is, mix them and then develop another couple of -----> rolls !!!  with the same duration for the first couple -----> rolls !!! ?", "sortedWord": "roll", "Identifyer": null, "identifyer": 100833, "year": "2020"}, {"autor": "fatihayoglu", "date": "2020-05-20 12:25:00", "content": " Hi all, I have recently developed 2 rolls of TriX at home in Paterson 2 reel tank with stainless steel rolls (1st time) if that matters at all. One of the rolls have a darken area across the whole roll. By now I have developed 8 rolls and this is the first time it happens. First I thought a light leak, but that would be a lighten area. Then I have thought about not having enough developer in the tank but I am quite certain I have used 500ml solution in total which is recommended according Paterson website. Sadly I don't remember how this roll was placed in the tank, whether up or down. (Now I am thinking, maybe the tank requires 500ml solution with Paterson reels but with stainless steel, it might be different.) I have attached a copy of one of the pictures and looking for your feedback and thought on why this would happen. Many thanks, Fatih --img--  Edited May 20, 2020 by fatihayoglu", "link": "https://www.l-camera-forum.com/topic/309759-darken-region-across-the-roll/?tab=comments#comment-3977055", "origin": "L-forum", "suborigin": "309759-darken-region-across-the-roll", "result": false, "Selector": "i have recently developed", "selectorShort": "develop", "MarkedSent": " hi all, i have recently developed 2 -----> rolls !!!  of trix at home in paterson 2 reel tank with stainless steel -----> rolls !!!  (1st time) if that matters at all.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100877, "year": "2020"}, {"autor": "fatihayoglu", "date": "2020-05-20 18:16:00", "content": "2 hours ago, 250swb said: No, Paterson says 500ml for a medium format film (120), not two 35mm films. You have been misinterpreting the instructions. Actually you are wrong. Please see https://www.patersonphotographic.com/product/paterson-super-system-4-developing-tanks/ Quote n processing 300 ml of solution is required for a single 35mm film or 500m1 for two 35mm and one 120 roll film. And as I've said, I have developed 6 rolls before with plastic reels and never had any problem during development phase.", "link": "https://www.l-camera-forum.com/topic/309759-darken-region-across-the-roll/?tab=comments#comment-3977253", "origin": "L-forum", "suborigin": "309759-darken-region-across-the-roll", "result": false, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "and as i've said, i have developed 6 -----> rolls !!!  before with plastic reels and never had any problem during development phase.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100888, "year": "2020"}, {"autor": "250swb", "date": "2020-05-20 19:01:00", "content": "1 hour ago, fatihayoglu said: Actually you are wrong. Please see https://www.patersonphotographic.com/product/paterson-super-system-4-developing-tanks/ And as I've said, I have developed 6 rolls before with plastic reels and never had any problem during development phase. It's a confusing typo, and to be honest if you are being so mean as to not just round up the numbers so two 35mm films need 600ml of developer then you are forever going to be dithering on the edge of success or failure. Look underneath your tank, it tells you the guidelines, but they are only guidelines. Under the base of the tank it says 290ml per 35mm film (NOT 500ml for two) so don't tell me I'm wrong if I'm much closer to the real amount than you. If for example you use a developer that froths during agitation you definitely want more developer solution in the tank so the true miniscus remains below the bubbles. And if you are using alternative reels in a Paterson tank you have to consider two other things, the first would be how securely the new reels grip on the column, and secondly if they need more or less developer in the tank. You can determine both of these just by putting water into your tank and jiggling it about and then having a look to see if each reel is covered and if anything has moved. Edited May 20, 2020 by 250swb", "link": "https://www.l-camera-forum.com/topic/309759-darken-region-across-the-roll/?tab=comments#comment-3977293", "origin": "L-forum", "suborigin": "309759-darken-region-across-the-roll", "result": false, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "please see https://www.patersonphotographic.com/product/paterson-super-system-4-developing-tanks/ and as i've said, i have developed 6 -----> rolls !!!  before with plastic reels and never had any problem during development phase.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100889, "year": "2020"}, {"autor": "fatihayoglu", "date": "2020-05-20 19:34:00", "content": "32 minutes ago, 250swb said: It's a confusing typo, and to be honest if you are being so mean as to not just round up the numbers so two 35mm films need 600ml of developer then you are forever going to be dithering on the edge of success or failure. Look underneath your tank, it tells you the guidelines, but they are only guidelines. Under the base of the tank it says 290ml per 35mm film (NOT 500ml for two) so don't tell me I'm wrong if I'm much closer to the real amount than you. If for example you use a developer that froths during agitation you definitely want more developer solution in the tank so the true miniscus remains below the bubbles. And if you are using alternative reels in a Paterson tank you have to consider two other things, the first would be how securely the new reels grip on the column, and secondly if they need more or less developer in the tank. You can determine both of these just by putting water into your tank and jiggling it about and then having a look to see if each reel is covered and if anything has moved. first of all, if I came across wrong, I’m sorry for that but you’ve accused me with misinterpretation and I merely showed you the link where I get my information. Also giving the fact that I have developed 6 other rolls with plastic reels and 500ml developer, and haven’t had any issue with any of the pictures. So I thought I’m doing right. The only things which I have changed between the last time I’ve developed the rolls and this time is the steel reels. I have specifically purchased the ones for Paterson so they are tight with the centre column however I haven’t thought about their actual volumes, hence the requirement for more developer I think. I am also not tight with any chemicals believe me if it would say 600, I’d use 600 Edited May 20, 2020 by fatihayoglu", "link": "https://www.l-camera-forum.com/topic/309759-darken-region-across-the-roll/?tab=comments#comment-3977313", "origin": "L-forum", "suborigin": "309759-darken-region-across-the-roll", "result": false, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "also giving the fact that i have developed 6 other -----> rolls !!!  with plastic reels and 500ml developer, and haven’t had any issue with any of the pictures.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100892, "year": "2020"}, {"autor": "giannis", "date": "2020-05-23 17:10:00", "content": "On 5/20/2020 at 2:25 PM, fatihayoglu said: Hi all, I have recently developed 2 rolls of TriX at home in Paterson 2 reel tank with stainless steel rolls (1st time) if that matters at all. One of the rolls have a darken area across the whole roll. By now I have developed 8 rolls and this is the first time it happens. First I thought a light leak, but that would be a lighten area. Then I have thought about not having enough developer in the tank but I am quite certain I have used 500ml solution in total which is recommended according Paterson website. Sadly I don't remember how this roll was placed in the tank, whether up or down. (Now I am thinking, maybe the tank requires 500ml solution with Paterson reels but with stainless steel, it might be different.) I have attached a copy of one of the pictures and looking for your feedback and thought on why this would happen. Many thanks, Fatih --img--  I've found that 550ml just barely covers 2 rolls in a 2-reel paterson tank. With 500ml you're just a couple mm short of covering the upper roll, which is consistent with what I see in your pictures.", "link": "https://www.l-camera-forum.com/topic/309759-darken-region-across-the-roll/?tab=comments#comment-3979072", "origin": "L-forum", "suborigin": "309759-darken-region-across-the-roll", "result": false, "Selector": "i have recently developed", "selectorShort": "develop", "MarkedSent": "on 5/20/2020 at 2:25 pm, fatihayoglu said: hi all, i have recently developed 2 -----> rolls !!!  of trix at home in paterson 2 reel tank with stainless steel -----> rolls !!!  (1st time) if that matters at all.", "sortedWord": "roll", "Identifyer": null, "identifyer": 100895, "year": "2020"}, {"autor": "chrism", "date": "2020-05-11 01:10:00", "content": "I develop film for scanning, so I'm used to my negatives looking dull. I just do what it takes to make them look alive. My all-out version would look like this: Edited May 11, 2020 by chrism", "link": "https://www.l-camera-forum.com/topic/308741-adjusting-the-contrast-of-a-scanned-image/page/3/?tab=comments#comment-3970991", "origin": "L-forum", "suborigin": "308741-adjusting-the-contrast-of-a-scanned-image", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop -----> film !!!  for scanning, so i'm used to my negatives looking dull.", "sortedWord": "film", "Identifyer": null, "identifyer": 100946, "year": "2020"}, {"autor": "tommonego@gmail.com", "date": "2020-04-27 17:30:00", "content": "I have a cord across the shower in the bathroom where I develop my film, shut the shower curtins and there is very little dust. I use photo flo and a squeegee after the last rinse, hang it with plastic covered clips. In the winter it dries in a couple of hours, don't have a humid summer experience yet. When I had a dark room I built a plywood epoxy paint covered cabinet for film drying. I don't like the Senrac dryers they are too hot and the film has a curl coming out of them, used one for years at work when I had extreme deadlines.", "link": "https://www.l-camera-forum.com/topic/298113-diy-film-dryer/page/2/?tab=comments#comment-3962092", "origin": "L-forum", "suborigin": "298113-diy-film-dryer", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i have a cord across the shower in the bathroom where i develop my -----> film !!! , shut the shower curtins and there is very little dust.", "sortedWord": "film", "Identifyer": null, "identifyer": 101217, "year": "2020"}, {"autor": "bags27", "date": "2020-04-27 17:34:00", "content": "2 minutes ago, tommonego@gmail.com said: I have a cord across the shower in the bathroom where I develop my film, shut the shower curtins and there is very little dust. I use photo flo and a squeegee after the last rinse, hang it with plastic covered clips. exactly what I do, too. I first run the shower hottest possible. I think (hope!) the steam settles whatever remaining dust, and adds heat to the room, for faster drying.", "link": "https://www.l-camera-forum.com/topic/298113-diy-film-dryer/page/2/?tab=comments#comment-3962098", "origin": "L-forum", "suborigin": "298113-diy-film-dryer", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "2 minutes ago, tommonego@gmail.com said: i have a cord across the shower in the bathroom where i develop my -----> film !!! , shut the shower curtins and there is very little dust.", "sortedWord": "film", "Identifyer": null, "identifyer": 101218, "year": "2020"}, {"autor": "andym91", "date": "2020-04-20 21:24:00", "content": " Hi all I've been developing B&W film at home for over 20 years and am very comfortable with the whole process with different films and chemicals. I've decided to jump into color developing at home as well as it seems fairly simple with the C41 process. So have a few films exposed (2 Portra 160 on Rolleiflex and 1 Portra 160 on a Leica ) and will develop them in the next day or two. Question....Any big DO's and DONT'S before starting out? I get the temperature sensitivity and am not too concerned there, but for those of you who do this regularly, any tips? thanks in advance Andy", "link": "https://www.l-camera-forum.com/topic/308743-c-41-home-developing/?tab=comments#comment-3957729", "origin": "L-forum", "suborigin": "308743-c-41-home-developing", "result": false, "Selector": "i've been developing", "selectorShort": "develop", "MarkedSent": " hi all i've been developing b&w -----> film !!!  at home for over 20 years and am very comfortable with the whole process with different films and chemicals.", "sortedWord": "film", "Identifyer": null, "identifyer": 101245, "year": "2020"}, {"autor": "tommonego@gmail.com", "date": "2020-01-17 15:51:00", "content": "A couple of points. Never sharpen when scanning, apply sharpening when processing the image. Reticulation comes from drastic temperature changes during processing, not controlling the temperature of the wash can do it, especially super cold water, or the temperature of the water getting hot during processing either one. How the photographers of the early 1900's could wash prints and films in streams is beyond me. Time in the developer doesn't necessarily increase grain, if you over develop that will increase grain, but each developer and film has their own characteristics, time vs temperature. Back in the day Kodak Microdol X was the developer to bring down grain in films it's times were 9 minutes at 20 degrees C, if I remember correctly, but it produced \"mushy\" grain and most photographers used D76 with TriX. Developing film under 5 minutes in a standard tank (Nikkor, Paterson) can cause uneven development. Edited January 17, 2020 by tommonego@gmail.com", "link": "https://www.l-camera-forum.com/topic/305288-too-much-grain/page/3/?tab=comments#comment-3893177", "origin": "L-forum", "suborigin": "305288-too-much-grain", "result": false, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "developing -----> film !!!  under 5 minutes in a standard tank (nikkor, paterson) can cause uneven development.", "sortedWord": "film", "Identifyer": null, "identifyer": 101603, "year": "2020"}, {"autor": "jmahto", "date": "2020-03-14 05:19:00", "content": "I have developed more than 50 rolls in last two years and have tried all possible washing and drying method (except film dryer). This is what I have settled on now. First two washes is with continuous inversions of 1 min each. After that I do 5 washes with simply swirling the roll in Paterson tank using central spindle. Then I do final wash with distilled water and few drops of Kodak photo flo. All at the same temperature. After that I take the reel out and tap it on table to get some water out. Then I remove the film carefully and hang it in the garage with small weighted clip at the bottom to keep it straight. This works well without any streak marks or dust. Earlier I used to wash for longer time and dry it in dust free bathroom but now I see no difference compared to drying in garage where I do development as well. It is very convenient now to do everything in the same area. What I have learned is that you have to find your own method which works for you.", "link": "https://www.l-camera-forum.com/topic/306741-having-a-break-from-digital/page/2/?tab=comments#comment-3930889", "origin": "L-forum", "suborigin": "306741-having-a-break-from-digital", "result": false, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "i have developed more than 50 -----> rolls !!!  in last two years and have tried all possible washing and drying method (except film dryer).", "sortedWord": "roll", "Identifyer": null, "identifyer": 101647, "year": "2020"}, {"autor": "jaapv", "date": "2020-02-17 09:24:00", "content": "But if you are shooting with the sun more overhead, make sure that your subject is lighted similar to the background, get rid of that contrast as much as possible. Keep the sky out of your frame. And process for warm colours. Be prepared that you may have few keepers. Exposure bracket. I normally used about 50 films on a safari, and took 100. Then I would have contact sheets and pick one or two shots per film to print or have printed. I did prefer slide film later though, and printed Cibachrome. though. Different exposure technique! I would never use incident light metering for wildlife. Developing film that had been through the African heat for a few weeks never presented any problems. But I did keep it out of the direct sun. --img-- ", "link": "https://www.l-camera-forum.com/topic/306524-disappointment-with-safari-pics/?tab=comments#comment-3914424", "origin": "L-forum", "suborigin": "306524-disappointment-with-safari-pics", "result": false, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "developing -----> film !!!  that had been through the african heat for a few weeks never presented any problems.", "sortedWord": "film", "Identifyer": null, "identifyer": 101764, "year": "2020"}, {"autor": "philipus", "date": "2020-02-17 15:37:00", "content": "Out of curiosity Jaap, which film did you use for the above shots? 6 hours ago, jaapv said: But if you are shooting with the sun more overhead, make sure that your subject is lighted similar to the background, get rid of that contrast as much as possible. Keep the sky out of your frame. And process for warm colours. Be prepared that you may have few keepers. Exposure bracket. I normally used about 50 films on a safari, and took 100. Then I would have contact sheets and pick one or two shots per film to print or have printed. I did prefer slide film later though, and printed Cibachrome. though. Different exposure technique! I would never use incident light metering for wildlife. Developing film that had been through the African heat for a few weeks never presented any problems. But I did keep it out of the direct sun. --img-- ", "link": "https://www.l-camera-forum.com/topic/306524-disappointment-with-safari-pics/?tab=comments#comment-3914645", "origin": "L-forum", "suborigin": "306524-disappointment-with-safari-pics", "result": false, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "developing -----> film !!!  that had been through the african heat for a few weeks never presented any problems.", "sortedWord": "film", "Identifyer": null, "identifyer": 101766, "year": "2020"}, {"autor": "opton", "date": "2020-01-08 11:13:00", "content": "Don't think there will be problems. I often put in the film during the evening / night, because I'm not sure that my my bathroom door is 100 % light tight, and so I feel safer. Usually I develop the film not later than the next day, but it also happened that something came up and I didn't have time to develop the film subsequently. The longest time that I have left the film in the tank before development was one week - no problems!", "link": "https://www.l-camera-forum.com/topic/305033-how-long-can-you-leave-undeveloped-film-on-a-reel-in-a-paterson-tank/?tab=comments#comment-3887378", "origin": "L-forum", "suborigin": "305033-how-long-can-you-leave-undeveloped-film-on-a-reel-in-a-paterson-tank", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "usually i develop the -----> film !!!  not later than the next day, but it also happened that something came up and i didn't have time to develop the -----> film !!!  subsequently.", "sortedWord": "film", "Identifyer": null, "identifyer": 102044, "year": "2020"}, {"autor": "Doug A", "date": "2020-11-29 18:02:00", "content": "4 hours ago, Xícara de Café said: Anyone tired FA-1027? http://stores.photoformulary.com/fa-1027-film-developer/ I have developed a few rolls of HP5 Plus with FA-1027 at 1+9 and 1+14. The negatives look very much like my HP5 Plus negatives developed with Ilfotec DD-X. The developing times at 1+9 are shorter than I like at 5 to 6 minutes, depending on the temperature. 1+14 is more manageable. My workflow is hybrid - shooting film and making inkjet prints. Over time I find I am relying more on chemical sharpening of the negatives and less on digital sharpening of the scanned and printed image. And with this workflow I am getting my best results with Rodinal.", "link": "https://www.l-camera-forum.com/topic/315576-long-life-non-staining-dev-for-fast-film/?tab=comments#comment-4089328", "origin": "L-forum", "suborigin": "315576-long-life-non-staining-dev-for-fast-film", "result": false, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "http://stores.photoformulary.com/fa-1027-film-developer/ i have developed a few -----> rolls !!!  of hp5 plus with fa-1027 at 1+9 and 1+14.", "sortedWord": "roll", "Identifyer": null, "identifyer": 104571, "year": "2020"}, {"autor": "Steve Ricoh", "date": "2020-09-25 17:38:00", "content": "Looking at the scans, Gary, there’s plenty of contrast. I suppose it’s something you like, or not, but I like the shoot and whitewash personally. I understand the wow factor, I mean developing film in a coffee brew sounds like black magic, doesn’t it! BTW, what’s the benefit of using caffenol over a more traditional method?", "link": "https://www.l-camera-forum.com/topic/313357-anyone-developingdeveloped-hp5-in-r09/?tab=comments#comment-4052146", "origin": "L-forum", "suborigin": "313357-anyone-developingdeveloped-hp5-in-r09", "result": false, "Selector": "i mean developing", "selectorShort": "develop", "MarkedSent": "i understand the wow factor, i mean developing -----> film !!!  in a coffee brew sounds like black magic, doesn’t it!", "sortedWord": "film", "Identifyer": null, "identifyer": 104744, "year": "2020"}, {"autor": "fatihayoglu", "date": "2020-04-04 17:41:00", "content": " Hi all, So I am planning to develop my B&W films at home and doing some research about concentration etc. One thing i have found is, you can use Ilfostop and Ilford Rapid Fixer few times but there isn't any indication how many times. To my understanding, Ilfostop has a dye in it, which will change color when it gets exhausted and again to my understanding each mix (1+19) can be used about 5 times, is this correct? For Ilford Rapid Fixer, I get an indication about 10 times. By times, I mean developing 2x 35mm films in Paterson tank. Could you give me an indication? Many thanks, Fatih PS I use TriX and HP5", "link": "https://www.l-camera-forum.com/topic/308192-how-many-times-would-you-use-ilfostop-and-ilford-rapid-fixer/?tab=comments#comment-3946826", "origin": "L-forum", "suborigin": "308192-how-many-times-would-you-use-ilfostop-and-ilford-rapid-fixer", "result": false, "Selector": "i am planning to develop", "selectorShort": "develop", "MarkedSent": " hi all, so i am planning to develop my b&w -----> films !!!  at home and doing some research about concentration etc.", "sortedWord": "film", "Identifyer": null, "identifyer": 104893, "year": "2020"}], "name": "Leicasortedout2020develop"}