{"interestingcomments": [{"autor": "twcxz", "date": "2020-08-27 16:32:00", "content": " Hi everyone, I'm currently working on a project to once and for all fix the analogue Leica CL's broken take up spool problem, by 3D printing them. I've ran a roll through mine with version 2 of the spool and it works pretty good, but i'm working on version 3 which should be better still - I got the dimensions slightly wrong on this one - it's too short. How many of you CL owners would be interested in buying such an item? They'd cost around £20 and be sold through eBay all said and done, and I'd make a video showing how to take apart the CL and install them, as well as reassembly - International shipping would happen too through the eBay GSP as I'm UK based. The attached photo is version 2 and not by any means the final version as this is still in very early development, but the quality of the ones that go on sale will be much higher. This one was printed by a friend of mine, but I'm soon going to acquire my own printer and make them much better. I know also that this doesn't look anything like the original, but when I copied the original part dimension for dimension, curve by curve, it didn't work and suffered the same problems as the original.. immediately. Thus I simplified it and made it more \"3D Printer friendly.\" Thanks Tom --img-- ", "link": "https://www.l-camera-forum.com/topic/312749-fixing-the-achilles-heel-of-the-leica-cl-leitz-minolta-cl-with-a-brand-new-take-up-spool/?tab=comments#comment-4034502", "origin": "L-forum", "suborigin": "312749-fixing-the-achilles-heel-of-the-leica-cl-leitz-minolta-cl-with-a-brand-new-take-up-spool", "result": true, "Selector": "3d printing", "selectorShort": "print", "MarkedSent": " hi everyone, i'm currently working on a project to once and for all fix the analogue leica cl's broken take up spool problem, by -----> 3d !!!  -----> printing !!!  them. i've ran a roll through mine with version 2 of the spool and it works pretty good, but i'm working on version 3 which should be better still - i got the dimensions slightly wrong on this one - it's too short. how many of you cl owners would be interested in buying such an item? they'd cost around £20 and be sold through ebay all said and done, and i'd make a video showing how to take apart the cl and install them, as well as reassembly - international shipping would happen too through the ebay gsp as i'm uk based. the attached photo is version 2 and not by any means the final version as this is still in very early development, but the quality of the ones that go on sale will be much higher. this one was printed by a friend of mine, but i'm soon going to acquire my own printer and make them much better. i know also that this doesn't look anything like the original, but when i copied the original part dimension for dimension, curve by curve, it didn't work and suffered the same problems as the original.. immediately. thus i simplified it and made it more \"3d printer friendly.\" thanks tom --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 3497, "year": "2020"}, {"autor": "andrew01", "date": "2020-07-29 21:01:00", "content": "I use a Voigtlander meter on my M3. The KEKS meter is enormous! Design looks overly complicated too ( too many buttons). The reveni labs option looks more interesting for the price, but the 3D printed plastic screams cheap, which is not a great aesthetic match for a high precision vintage camera. I think they could outsource a CNC machined aluminium case from china and it wouldn't add that much to the manufacturing cost. Also I hate the branding on the front. Discreet is better. It is good that there is some competition for the Voigtlander meters which are overpriced in my opinion, but these options are not interesting enough for me to click buy.", "link": "https://www.l-camera-forum.com/topic/311749-for-the-non-metered-m-camera-keks-em-01-light-meter/?tab=comments#comment-4017964", "origin": "L-forum", "suborigin": "311749-for-the-non-metered-m-camera-keks-em-01-light-meter", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i use a voigtlander meter on my m3. the keks meter is enormous! design looks overly complicated too ( too many buttons). the reveni labs option looks more interesting for the price, but the -----> 3d !!!  -----> printed !!!  plastic screams cheap, which is not a great aesthetic match for a high precision vintage camera. i think they could outsource a cnc machined aluminium case from china and it wouldn't add that much to the manufacturing cost. also i hate the branding on the front. discreet is better. it is good that there is some competition for the voigtlander meters which are overpriced in my opinion, but these options are not interesting enough for me to click buy.", "sortedWord": "None", "Identifyer": null, "identifyer": 4739, "year": "2020"}, {"autor": "syam", "date": "2020-06-10 14:33:00", "content": " Just wanted to update this after several months. I'm still using version 2 of the 3D printed case. It has been through everything including hikes, road trips, daily shooting, family stuff. Definitely less than pre-quarantine, but still used quite a bit. I've made some refinements and plan to print a new case in the coming weeks. Minor changes for this V3 are: - Reducing the round size of the corners - Reducing wall thickness from 3mm to 2mm - Adding a hole for the focus LED - Adding more room around the on/off switch - Removing the Leica script branding on the top cover plate - Adding more space around the rear buttons and increasing the cutout size - Adding in interior cutouts for felt material to sit against the Q body - Removing the leash strap ring on the bottom of the case I'll be printing the new case using PET-G instead of PLA, so durability should be better than before (not that I ever dropped it). The eventual plan is still to have the case machined out of aluminum and anodized black to match the OE Leica Q finish, but that will wait until the design has been completely finalized. --img--  --img--  Edited June 10, 2020 by syam", "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/page/2/?tab=comments#comment-3990994", "origin": "L-forum", "suborigin": "299948-my-first-leica-q-designing-a-case", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": " just wanted to update this after several months. i'm still using version 2 of the -----> 3d !!!  -----> printed !!!  case. it has been through everything including hikes, road trips, daily shooting, family stuff. definitely less than pre-quarantine, but still used quite a bit. i've made some refinements and plan to print a new case in the coming weeks. minor changes for this v3 are: - reducing the round size of the corners - reducing wall thickness from 3mm to 2mm - adding a hole for the focus led - adding more room around the on/off switch - removing the leica script branding on the top cover plate - adding more space around the rear buttons and increasing the cutout size - adding in interior cutouts for felt material to sit against the q body - removing the leash strap ring on the bottom of the case i'll be printing the new case using pet-g instead of pla, so durability should be better than before (not that i ever dropped it). the eventual plan is still to have the case machined out of aluminum and anodized black to match the oe leica q finish, but that will wait until the design has been completely finalized. --img--  --img--  edited june 10, 2020 by syam", "sortedWord": "None", "Identifyer": null, "identifyer": 6585, "year": "2020"}, {"autor": "mmx_2", "date": "2020-06-11 18:33:00", "content": " Hi! I had some parts left over from a few other projects, so I decided to build a \"ring lamp\" for my Elmarit 100 lens. The lamp slides on to the hood and is then secured by a screw on the side. The lamp is powered by USB and as power source I use a powerbank for phones. The light source is made up of 10 1W power LEDs with narrow beam and focusing lenses. The whole thing is 3D printed, even the set screw and threads. To get the correct voltage for the LEDs, 3.3V, I have hidden a DC-DC converter inside the lamp that converts 5V (USB standard) to stabilized 3.3V. --img-- ", "link": "https://www.l-camera-forum.com/topic/310498-macro-lamp-for-apo-macro-elmarit-100/?tab=comments#comment-3991689", "origin": "L-forum", "suborigin": "310498-macro-lamp-for-apo-macro-elmarit-100", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": " hi! i had some parts left over from a few other projects, so i decided to build a \"ring lamp\" for my elmarit 100 lens. the lamp slides on to the hood and is then secured by a screw on the side. the lamp is powered by usb and as power source i use a powerbank for phones. the light source is made up of 10 1w power leds with narrow beam and focusing lenses. the whole thing is -----> 3d !!!  -----> printed !!! , even the set screw and threads. to get the correct voltage for the leds, 3.3v, i have hidden a dc-dc converter inside the lamp that converts 5v (usb standard) to stabilized 3.3v. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 21199, "year": "2020"}, {"autor": "madNbad", "date": "2020-11-19 03:09:00", "content": "I have one and it works well. Being 3D printed, it takes some breaking in plus I needed to add a piece of tape to keep it from moving around in the accessory shoe.", "link": "https://www.l-camera-forum.com/topic/315267-reveni-labs-offset-shoe-for-barnack-cameras/?tab=comments#comment-4082961", "origin": "L-forum", "suborigin": "315267-reveni-labs-offset-shoe-for-barnack-cameras", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i have one and it works well. being -----> 3d !!!  -----> printed !!! , it takes some breaking in plus i needed to add a piece of tape to keep it from moving around in the accessory shoe.", "sortedWord": "None", "Identifyer": null, "identifyer": 39393, "year": "2020"}, {"autor": "philipus", "date": "2020-09-06 14:14:00", "content": " I have a Coolscan 9000. You can scan a part of the film rebate with it. Here are photos of the three medium format film holders I have. This is the FH-869S to which I have fitted Focal Point ANR glass. As you can see it will permit scanning of parts of the film's edges, to create a sort of frame around the photo. Incidentally I could never get the ANR glass to work. I had Newton rings even with the glass. It should be noted, too, that with the glass attached (mine's fixed with a strip of duct tape) the film-glass sandwich can move so it's not the most stable, or easy to use, solution.--img--  This is the FH-869GR which allows scanning a bit more film edge than FH-869S. The drawback is that it's not possible to scan a whole strip in one go. --img--  This is the Image Mechanics wet mount tray, which was not made by Nikon but by some thrifty individuals who basically built it from other film holders. Here you can scan the whole film edge. The problem is that these trays are virtually impossible to find. In the last 6-7 years I've seen two on eBay, one of which I own. It should be easy enough to 3D print such a tray though. --img--  As for repairs, I had my 9000 repaired during the spring. The main board and power supply broke. It was done by Nikon Service here in the Netherlands. They didn't have the parts so I had to source them myself on eBay. But they happily repaired the scanner which thus far works perfectly. There's a list of Nikon Service points online which service Coolscans but lack of spare parts is a problem. Personally I wouldn't let this affect my decision because they are fantastic units that produce scans rivalling the best Flextights. And there's still a good market for second-hand spare parts. I had no problem at all to find the parts I needed. I also have a Flextight X1 which granted a slightly different scanner than the Precision II but still similar in how it works. And I have seen info online that the film holders are the same so perhaps the below is useful. This is the standard 120 film holder. As you can see it allows some of the film edge to be scanned. To give you an idea check in the I like film thread. Most of the 120 film photos I've posted the last several have been scanned with this film holder. --img--  This is the 4x5 holder. I'm pretty sure it would be possible to sandwich the film between two thin sheets of transparent OH film (incidentally what I use for wet mounting on the Nikon - a lot cheaper than mylar or whatever it's called). I haven't tried this though. --img--  My X1 was actually broken when I bought it but luckily Ffordes covered the considerable repair on the warranty and Hasselblad was able to make it as-new. Not long thereafter they stopped selling the Flextights. I suppose there are still spare parts but who knows how much.", "link": "https://www.l-camera-forum.com/topic/312927-imacon-precision-ii-or-nikon-9000ed/page/2/?tab=comments#comment-4041006", "origin": "L-forum", "suborigin": "312927-imacon-precision-ii-or-nikon-9000ed", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": " i have a coolscan 9000. you can scan a part of the film rebate with it. here are photos of the three medium format film holders i have. this is the fh-869s to which i have fitted focal point anr glass. as you can see it will permit scanning of parts of the film's edges, to create a sort of frame around the photo. incidentally i could never get the anr glass to work. i had newton rings even with the glass. it should be noted, too, that with the glass attached (mine's fixed with a strip of duct tape) the film-glass sandwich can move so it's not the most stable, or easy to use, solution.--img--  this is the fh-869gr which allows scanning a bit more film edge than fh-869s. the drawback is that it's not possible to scan a whole strip in one go. --img--  this is the image mechanics wet mount tray, which was not made by nikon but by some thrifty individuals who basically built it from other film holders. here you can scan the whole film edge. the problem is that these trays are virtually impossible to find. in the last 6-7 years i've seen two on ebay, one of which i own. it should be easy enough to -----> 3d !!!  -----> print !!!  such a tray though. --img--  as for repairs, i had my 9000 repaired during the spring. the main board and power supply broke. it was done by nikon service here in the netherlands. they didn't have the parts so i had to source them myself on ebay. but they happily repaired the scanner which thus far works perfectly. there's a list of nikon service points online which service coolscans but lack of spare parts is a problem. personally i wouldn't let this affect my decision because they are fantastic units that produce scans rivalling the best flextights. and there's still a good market for second-hand spare parts. i had no problem at all to find the parts i needed. i also have a flextight x1 which granted a slightly different scanner than the precision ii but still similar in how it works. and i have seen info online that the film holders are the same so perhaps the below is useful. this is the standard 120 film holder. as you can see it allows some of the film edge to be scanned. to give you an idea check in the i like film thread. most of the 120 film photos i've posted the last several have been scanned with this film holder. --img--  this is the 4x5 holder. i'm pretty sure it would be possible to sandwich the film between two thin sheets of transparent oh film (incidentally what i use for wet mounting on the nikon - a lot cheaper than mylar or whatever it's called). i haven't tried this though. --img--  my x1 was actually broken when i bought it but luckily ffordes covered the considerable repair on the warranty and hasselblad was able to make it as-new. not long thereafter they stopped selling the flextights. i suppose there are still spare parts but who knows how much.", "sortedWord": "None", "Identifyer": null, "identifyer": 100404, "year": "2020"}, {"autor": "250swb", "date": "2020-09-07 07:15:00", "content": "16 hours ago, philipus said: I have a Coolscan 9000. You can scan a part of the film rebate with it. Here are photos of the three medium format film holders I have. This is the FH-869S to which I have fitted Focal Point ANR glass. As you can see it will permit scanning of parts of the film's edges, to create a sort of frame around the photo. Incidentally I could never get the ANR glass to work. I had Newton rings even with the glass. It should be noted, too, that with the glass attached (mine's fixed with a strip of duct tape) the film-glass sandwich can move so it's not the most stable, or easy to use, solution.--img--  This is the FH-869GR which allows scanning a bit more film edge than FH-869S. The drawback is that it's not possible to scan a whole strip in one go. --img--  This is the Image Mechanics wet mount tray, which was not made by Nikon but by some thrifty individuals who basically built it from other film holders. Here you can scan the whole film edge. The problem is that these trays are virtually impossible to find. In the last 6-7 years I've seen two on eBay, one of which I own. It should be easy enough to 3D print such a tray though. --img--  As for repairs, I had my 9000 repaired during the spring. The main board and power supply broke. It was done by Nikon Service here in the Netherlands. They didn't have the parts so I had to source them myself on eBay. But they happily repaired the scanner which thus far works perfectly. There's a list of Nikon Service points online which service Coolscans but lack of spare parts is a problem. Personally I wouldn't let this affect my decision because they are fantastic units that produce scans rivalling the best Flextights. And there's still a good market for second-hand spare parts. I had no problem at all to find the parts I needed. I also have a Flextight X1 which granted a slightly different scanner than the Precision II but still similar in how it works. And I have seen info online that the film holders are the same so perhaps the below is useful. This is the standard 120 film holder. As you can see it allows some of the film edge to be scanned. To give you an idea check in the I like film thread. Most of the 120 film photos I've posted the last several have been scanned with this film holder. --img--  This is the 4x5 holder. I'm pretty sure it would be possible to sandwich the film between two thin sheets of transparent OH film (incidentally what I use for wet mounting on the Nikon - a lot cheaper than mylar or whatever it's called). I haven't tried this though. --img--  My X1 was actually broken when I bought it but luckily Ffordes covered the considerable repair on the warranty and Hasselblad was able to make it as-new. Not long thereafter they stopped selling the Flextights. I suppose there are still spare parts but who knows how much. Just a personal anecdote about film edges. I set about a project with medium format (using my 6x9 Fuji 'Texas Leica') that I was convinced needed film edges so got a Betterscanning film holder for my Epson V700. There were two things wrong in my planning, the first was I wanted to carry as little as possible, so no tripod with a spirit level, the second is that I can't stand sloping horizons in the larger formats, 35mm I feel is a bit freer. And of course every now and again I'd have a good shot and then no way to correct the horizon because of the film edge. So I cheated, I straightened and cropped the image and used Silver Efex Pro that has a tool to create an infinite number of user defined film edge effects and I got one to match, well nearly match. I was ashamed at cheating so dropped the film edges from all the shots. It's one of those 'be careful what you wish for' episodes in my photography.", "link": "https://www.l-camera-forum.com/topic/312927-imacon-precision-ii-or-nikon-9000ed/page/2/?tab=comments#comment-4041409", "origin": "L-forum", "suborigin": "312927-imacon-precision-ii-or-nikon-9000ed", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "16 hours ago, philipus said: i have a coolscan 9000. you can scan a part of the film rebate with it. here are photos of the three medium format film holders i have. this is the fh-869s to which i have fitted focal point anr glass. as you can see it will permit scanning of parts of the film's edges, to create a sort of frame around the photo. incidentally i could never get the anr glass to work. i had newton rings even with the glass. it should be noted, too, that with the glass attached (mine's fixed with a strip of duct tape) the film-glass sandwich can move so it's not the most stable, or easy to use, solution.--img--  this is the fh-869gr which allows scanning a bit more film edge than fh-869s. the drawback is that it's not possible to scan a whole strip in one go. --img--  this is the image mechanics wet mount tray, which was not made by nikon but by some thrifty individuals who basically built it from other film holders. here you can scan the whole film edge. the problem is that these trays are virtually impossible to find. in the last 6-7 years i've seen two on ebay, one of which i own. it should be easy enough to -----> 3d !!!  -----> print !!!  such a tray though. --img--  as for repairs, i had my 9000 repaired during the spring. the main board and power supply broke. it was done by nikon service here in the netherlands. they didn't have the parts so i had to source them myself on ebay. but they happily repaired the scanner which thus far works perfectly. there's a list of nikon service points online which service coolscans but lack of spare parts is a problem. personally i wouldn't let this affect my decision because they are fantastic units that produce scans rivalling the best flextights. and there's still a good market for second-hand spare parts. i had no problem at all to find the parts i needed. i also have a flextight x1 which granted a slightly different scanner than the precision ii but still similar in how it works. and i have seen info online that the film holders are the same so perhaps the below is useful. this is the standard 120 film holder. as you can see it allows some of the film edge to be scanned. to give you an idea check in the i like film thread. most of the 120 film photos i've posted the last several have been scanned with this film holder. --img--  this is the 4x5 holder. i'm pretty sure it would be possible to sandwich the film between two thin sheets of transparent oh film (incidentally what i use for wet mounting on the nikon - a lot cheaper than mylar or whatever it's called). i haven't tried this though. --img--  my x1 was actually broken when i bought it but luckily ffordes covered the considerable repair on the warranty and hasselblad was able to make it as-new. not long thereafter they stopped selling the flextights. i suppose there are still spare parts but who knows how much. just a personal anecdote about film edges. i set about a project with medium format (using my 6x9 fuji 'texas leica') that i was convinced needed film edges so got a betterscanning film holder for my epson v700. there were two things wrong in my planning, the first was i wanted to carry as little as possible, so no tripod with a spirit level, the second is that i can't stand sloping horizons in the larger formats, 35mm i feel is a bit freer. and of course every now and again i'd have a good shot and then no way to correct the horizon because of the film edge. so i cheated, i straightened and cropped the image and used silver efex pro that has a tool to create an infinite number of user defined film edge effects and i got one to match, well nearly match. i was ashamed at cheating so dropped the film edges from all the shots. it's one of those 'be careful what you wish for' episodes in my photography.", "sortedWord": "None", "Identifyer": null, "identifyer": 100406, "year": "2020"}, {"autor": "ianman", "date": "2020-07-07 10:41:00", "content": "Well yes, I meant the general idea too. The myth that all film Leicas are going to last to the end of time, and beyond. The fact is that one day, possibly sooner than we think, there will be not many people able to service/repair them. Parts may be repaired by 3d printed replacements, etc.", "link": "https://www.l-camera-forum.com/topic/277516-sensor-replacement-and-market-impact/page/4/?tab=comments#comment-4005249", "origin": "L-forum", "suborigin": "277516-sensor-replacement-and-market-impact", "result": false, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "parts may be -----> repaired !!!  by 3d printed replacements, etc.", "sortedWord": "repair", "Identifyer": null, "identifyer": 33303, "year": "2020"}, {"autor": "wlaidlaw", "date": "2020-05-22 06:45:00", "content": "You could give Alan/James a ring. His mobile number is on the website. I find their turn around is generally between 4 and 6 months. Alan did a lovely job replacing the totally rotted out red blinds on my 1941 IIIc Stepper, with new red blinds and doing a CLA. He then could not get the shutter times 100% accurate (Alan is a perfectionist). The camera had been factory upgraded to IIIf spec and after a bit of research, it was found that a lot of these cameras suffered from inaccurate shutter timing. The drag of the flash sync is just too great for a shutter not designed for it. Disconnected the flash sync and it timed perfectly. As I have a number of other LTM cameras with working flash sync (IIf, IIIg, Ig, Reid & Sigrist III-2 plus all my film M's) this was no great loss. Alan has done some amazing work for me, like working out how to rebuild my giant rangefinder Combat Graflex 70mm film camera from a 1950's US Navy manual, including having to get unobtainable broken parts 3D printed in titanium. Wilson Edited May 22, 2020 by wlaidlaw", "link": "https://www.l-camera-forum.com/topic/127326-repair-specialists/page/8/?tab=comments#comment-3978133", "origin": "L-forum", "suborigin": "127326-repair-specialists", "result": false, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "alan has done some amazing work for me, like working out how to rebuild my giant rangefinder combat graflex 70mm -----> film !!!  camera from a 1950's us navy manual, including having to get unobtainable broken parts 3d printed in titanium.", "sortedWord": "film", "Identifyer": null, "identifyer": 34362, "year": "2020"}, {"autor": "Avemarcus", "date": "2020-05-22 10:27:00", "content": " 3 hours ago, wlaidlaw said: You could give Alan/James a ring. His mobile number is on the website. I find their turn around is generally between 4 and 6 months. Alan did a lovely job replacing the totally rotted out red blinds on my 1941 IIIc Stepper, with new red blinds and doing a CLA. He then could not get the shutter times 100% accurate (Alan is a perfectionist). The camera had been factory upgraded to IIIf spec and after a bit of research, it was found that a lot of these cameras suffered from inaccurate shutter timing. The drag of the flash sync is just too great for a shutter not designed for it. Disconnected the flash sync and it timed perfectly. As I have a number of other LTM cameras with working flash sync (IIf, IIIg, Ig, Reid & Sigrist III-2 plus all my film M's) this was no great loss. Alan has done some amazing work for me, like working out how to rebuild my giant rangefinder Combat Graflex 70mm film camera from a 1950's US Navy manual, including having to get unobtainable broken parts 3D printed in titanium. Wilson Thank you so much for your response!", "link": "https://www.l-camera-forum.com/topic/127326-repair-specialists/page/8/?tab=comments#comment-3978214", "origin": "L-forum", "suborigin": "127326-repair-specialists", "result": false, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "alan has done some amazing work for me, like working out how to rebuild my giant rangefinder combat graflex 70mm -----> film !!!  camera from a 1950's us navy manual, including having to get unobtainable broken parts 3d printed in titanium.", "sortedWord": "film", "Identifyer": null, "identifyer": 34363, "year": "2020"}, {"autor": "Geoff Marshall", "date": "2020-05-26 15:36:00", "content": "On 5/22/2020 at 7:45 AM, wlaidlaw said: You could give Alan/James a ring. His mobile number is on the website. I find their turn around is generally between 4 and 6 months. Alan did a lovely job replacing the totally rotted out red blinds on my 1941 IIIc Stepper, with new red blinds and doing a CLA. He then could not get the shutter times 100% accurate (Alan is a perfectionist). The camera had been factory upgraded to IIIf spec and after a bit of research, it was found that a lot of these cameras suffered from inaccurate shutter timing. The drag of the flash sync is just too great for a shutter not designed for it. Disconnected the flash sync and it timed perfectly. As I have a number of other LTM cameras with working flash sync (IIf, IIIg, Ig, Reid & Sigrist III-2 plus all my film M's) this was no great loss. Alan has done some amazing work for me, like working out how to rebuild my giant rangefinder Combat Graflex 70mm film camera from a 1950's US Navy manual, including having to get unobtainable broken parts 3D printed in titanium. Wilson I sent my IIIf in to Cameraworks for repair and got a message from Alan today, things aren’t as bad as I thought and he has quoted a very reasonable cost for the repair. Looking forward to using my favourite film Leica again.", "link": "https://www.l-camera-forum.com/topic/127326-repair-specialists/page/8/?tab=comments#comment-3980997", "origin": "L-forum", "suborigin": "127326-repair-specialists", "result": false, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "alan has done some amazing work for me, like working out how to rebuild my giant rangefinder combat graflex 70mm -----> film !!!  camera from a 1950's us navy manual, including having to get unobtainable broken parts 3d printed in titanium.", "sortedWord": "film", "Identifyer": null, "identifyer": 34364, "year": "2020"}], "name": "Leicasortedout2020print"}