{"interestingcomments": [{"autor": "Dirk Mandeville", "date": "2017-02-03 18:56:00", "content": "I still don't get this at all.Unfortunately, I can't help you to understand it better because I don't know the details of their technology and they haven't shared much information publicly. It will be interesting to see what they come up with and how well it works. But unlike you, I suppose, I do see the potential benefits of such a system if they can get it to work. I also see the evf limitation of not being able to see outside the frame lines as a disadvantage that will turn some people off. Don't know if there is a way around that or not.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/4/?tab=comments#comment-3203796", "origin": "L-forum", "suborigin": "268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i still don't get this at all.unfortunately, i can't help you to understand it better because i don't know the details of their technology and they haven't shared much information publicly. it will be interesting to see what they -----> come !!!  -----> up !!!  -----> with !!!  and how well it works. but unlike you, i suppose, i do see the potential benefits of such a system if they can get it to work. i also see the evf limitation of not being able to see outside the frame lines as a disadvantage that will turn some people off. don't know if there is a way around that or not.", "sortedWord": "None", "Identifyer": null, "identifyer": 3346, "year": "2017"}, {"autor": "MRJohn", "date": "2017-02-21 22:16:00", "content": "My wish: interchangeable back, so you can turn it into an MD --img--  Seriously, please spend the next few years to come up with the best hybrid VF ever and forever.", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/13/?tab=comments#comment-3218707", "origin": "L-forum", "suborigin": "268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "my wish: interchangeable back, so you can turn it into an md --img--  seriously, please spend the next few years to -----> come !!!  -----> up !!!  -----> with !!!  the best hybrid vf ever and forever.", "sortedWord": "None", "Identifyer": null, "identifyer": 3523, "year": "2017"}, {"autor": "jevidon", "date": "2017-06-15 22:52:00", "content": "I SENT MY M9 INTO LEICA FOR AN UPGRADE TO M9P AND MENTIONED THAT THE SENSOR NEEDED CLEANING. THIS WA BEFORE THE SENSOR CORROSION ISSUE BECAME PUBLICIZED. THE SENSOR WAS REPLACED AND HAS BEEN TROUBLE FREE SINCE THEN. WHERN I CAME ON TO THIS THREAD, I CHECKED TO SEE WHAT THE SENSOR DATA WAS AND I CAME UP WITH THE FOLLOWING: CCD ID: 11 CCD BOARD ID: 2 CONTROL BD. ID: 2 M16C ID: 0 AS YOU CAN SEE, THE CCD ID IS NEITHER 5 NOR 15 NOR ANY OF THE OTHER SERIES YOU GUYS HAVE MENTIONED. SO I DON'T KNOW IF I HAVE THE NEW SENSOR OR THE OLD SENSOR. ANY COMMENTS OR INFORMATION WOULD BE APPRECIATED.", "link": "https://www.l-camera-forum.com/topic/272556-determining-new-sensor-m9/page/3/?tab=comments#comment-3296333", "origin": "L-forum", "suborigin": "272556-determining-new-sensor-m9", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i sent my m9 into leica for an upgrade to m9p and mentioned that the sensor needed cleaning. this wa before the sensor corrosion issue became publicized. the sensor was replaced and has been trouble free since then. whern i -----> came !!!  on to this thread, i checked to see what the sensor data was and i -----> came !!!  -----> up !!!  -----> with !!!  the following: ccd id: 11 ccd board id: 2 control bd. id: 2 m16c id: 0 as you can see, the ccd id is neither 5 nor 15 nor any of the other series you guys have mentioned. so i don't know if i have the new sensor or the old sensor. any comments or information would be appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 30051, "year": "2017"}, {"autor": "jaapv", "date": "2017-06-15 23:43:00", "content": "I SENT MY M9 INTO LEICA FOR AN UPGRADE TO M9P AND MENTIONED THAT THE SENSOR NEEDED CLEANING. THIS WA BEFORE THE SENSOR CORROSION ISSUE BECAME PUBLICIZED. THE SENSOR WAS REPLACED AND HAS BEEN TROUBLE FREE SINCE THEN. WHERN I CAME ON TO THIS THREAD, I CHECKED TO SEE WHAT THE SENSOR DATA WAS AND I CAME UP WITH THE FOLLOWING: CCD ID: 11 CCD BOARD ID: 2 CONTROL BD. ID: 2 M16C ID: 0 AS YOU CAN SEE, THE CCD ID IS NEITHER 5 NOR 15 NOR ANY OF THE OTHER SERIES YOU GUYS HAVE MENTIONED. SO I DON'T KNOW IF I HAVE THE NEW SENSOR OR THE OLD SENSOR. ANY COMMENTS OR INFORMATION WOULD BE APPRECIATED. Just ask Leica...", "link": "https://www.l-camera-forum.com/topic/272556-determining-new-sensor-m9/page/3/?tab=comments#comment-3296353", "origin": "L-forum", "suborigin": "272556-determining-new-sensor-m9", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i sent my m9 into leica for an upgrade to m9p and mentioned that the sensor needed cleaning. this wa before the sensor corrosion issue became publicized. the sensor was replaced and has been trouble free since then. whern i -----> came !!!  on to this thread, i checked to see what the sensor data was and i -----> came !!!  -----> up !!!  -----> with !!!  the following: ccd id: 11 ccd board id: 2 control bd. id: 2 m16c id: 0 as you can see, the ccd id is neither 5 nor 15 nor any of the other series you guys have mentioned. so i don't know if i have the new sensor or the old sensor. any comments or information would be appreciated. just ask leica...", "sortedWord": "None", "Identifyer": null, "identifyer": 30053, "year": "2017"}, {"autor": "olgierdc", "date": "2017-06-21 05:04:00", "content": "I SENT MY M9 INTO LEICA FOR AN UPGRADE TO M9P AND MENTIONED THAT THE SENSOR NEEDED CLEANING. THIS WA BEFORE THE SENSOR CORROSION ISSUE BECAME PUBLICIZED. THE SENSOR WAS REPLACED AND HAS BEEN TROUBLE FREE SINCE THEN. WHERN I CAME ON TO THIS THREAD, I CHECKED TO SEE WHAT THE SENSOR DATA WAS AND I CAME UP WITH THE FOLLOWING: CCD ID: 11 CCD BOARD ID: 2 CONTROL BD. ID: 2 M16C ID: 0 AS YOU CAN SEE, THE CCD ID IS NEITHER 5 NOR 15 NOR ANY OF THE OTHER SERIES YOU GUYS HAVE MENTIONED. SO I DON'T KNOW IF I HAVE THE NEW SENSOR OR THE OLD SENSOR. ANY COMMENTS OR INFORMATION WOULD BE APPRECIATED. When you sensor was replaced? I have the same. It was replaced in 2012.", "link": "https://www.l-camera-forum.com/topic/272556-determining-new-sensor-m9/page/3/?tab=comments#comment-3299660", "origin": "L-forum", "suborigin": "272556-determining-new-sensor-m9", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i sent my m9 into leica for an upgrade to m9p and mentioned that the sensor needed cleaning. this wa before the sensor corrosion issue became publicized. the sensor was replaced and has been trouble free since then. whern i -----> came !!!  on to this thread, i checked to see what the sensor data was and i -----> came !!!  -----> up !!!  -----> with !!!  the following: ccd id: 11 ccd board id: 2 control bd. id: 2 m16c id: 0 as you can see, the ccd id is neither 5 nor 15 nor any of the other series you guys have mentioned. so i don't know if i have the new sensor or the old sensor. any comments or information would be appreciated. when you sensor was replaced? i have the same. it was replaced in 2012.", "sortedWord": "None", "Identifyer": null, "identifyer": 30059, "year": "2017"}, {"autor": "pgk", "date": "2017-10-06 16:19:00", "content": "Rather a coincidence today, but in a charity shop I came across a Kodak DC3200 camera literally in a bin full of cameras. At £3 I was happy to buy it to put in the Gallery 'history' cabinet alongside my other obsolete photographic display items. However I thought it worth trying so I put 4 x AA batteries in and a CF card and it powered up and yes, worked fine. OK so its only 1MPixel but given that it dates form 2000-2002ish and it still works I'm impressed. The real advantage is with the AA batteries it uses as they've been around for a long time and hopefully will be for a long time to come. If a manufacturer could come up with a power-pack replacement which used readily available batteries like AAs to power loads of cameras via an adapter then many might have an extended life beyond their bespoke battery life.", "link": "https://www.l-camera-forum.com/topic/277516-sensor-replacement-and-market-impact/?tab=comments#comment-3371423", "origin": "L-forum", "suborigin": "277516-sensor-replacement-and-market-impact", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "rather a coincidence today, but in a charity shop i came across a kodak dc3200 camera literally in a bin full of cameras. at £3 i was happy to buy it to put in the gallery 'history' cabinet alongside my other obsolete photographic display items. however i thought it worth trying so i put 4 x aa batteries in and a cf card and it powered up and yes, worked fine. ok so its only 1mpixel but given that it dates form 2000-2002ish and it still works i'm impressed. the real advantage is with the aa batteries it uses as they've been around for a long time and hopefully will be for a long time to come. if a manufacturer could -----> come !!!  -----> up !!!  -----> with !!!  a power-pack replacement which used readily available batteries like aas to power loads of cameras via an adapter then many might have an extended life beyond their bespoke battery life.", "sortedWord": "None", "Identifyer": null, "identifyer": 33243, "year": "2017"}, {"autor": "mikemgb", "date": "2017-10-06 16:35:00", "content": " Rather a coincidence today, but in a charity shop I came across a Kodak DC3200 camera literally in a bin full of cameras. At £3 I was happy to buy it to put in the Gallery 'history' cabinet alongside my other obsolete photographic display items. However I thought it worth trying so I put 4 x AA batteries in and a CF card and it powered up and yes, worked fine. OK so its only 1MPixel but given that it dates form 2000-2002ish and it still works I'm impressed. The real advantage is with the AA batteries it uses as they've been around for a long time and hopefully will be for a long time to come. If a manufacturer could come up with a power-pack replacement which used readily available batteries like AAs to power loads of cameras via an adapter then many might have an extended life beyond their bespoke battery life. This actually happens for those of us who still use vintage cameras, many old batteries are no longer available but adapters that take modern batteries are available or we just make our own. Some people are starting to repair Li-Ion batteries by disassembling them and replacing the dead cells with modern ones.", "link": "https://www.l-camera-forum.com/topic/277516-sensor-replacement-and-market-impact/page/2/?tab=comments#comment-3371435", "origin": "L-forum", "suborigin": "277516-sensor-replacement-and-market-impact", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " rather a coincidence today, but in a charity shop i came across a kodak dc3200 camera literally in a bin full of cameras. at £3 i was happy to buy it to put in the gallery 'history' cabinet alongside my other obsolete photographic display items. however i thought it worth trying so i put 4 x aa batteries in and a cf card and it powered up and yes, worked fine. ok so its only 1mpixel but given that it dates form 2000-2002ish and it still works i'm impressed. the real advantage is with the aa batteries it uses as they've been around for a long time and hopefully will be for a long time to come. if a manufacturer could -----> come !!!  -----> up !!!  -----> with !!!  a power-pack replacement which used readily available batteries like aas to power loads of cameras via an adapter then many might have an extended life beyond their bespoke battery life. this actually happens for those of us who still use vintage cameras, many old batteries are no longer available but adapters that take modern batteries are available or we just make our own. some people are starting to repair li-ion batteries by disassembling them and replacing the dead cells with modern ones.", "sortedWord": "None", "Identifyer": null, "identifyer": 33244, "year": "2017"}, {"autor": "jaapv", "date": "2017-05-16 07:46:00", "content": " That is a very smart idea, Luigi. A pity Leica's marketing department was not competent enough to come up with it.. --img-- Now it is too late, the damage to Leica's image has been done. Somebody has not been doing his sums at Leica. One sale lost for this reason equals three free sensor replacements. Not counting follow-up sales in lenses, accessories and future sales. The net result of this action can only be negative.", "link": "https://www.l-camera-forum.com/topic/272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies/page/4/?tab=comments#comment-3275875", "origin": "L-forum", "suborigin": "272513-leica-ends-free-sensor-replacement-for-m9monochrom-bodies", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " that is a very smart idea, luigi. a pity leica's marketing department was not competent enough to -----> come !!!  -----> up !!!  -----> with !!!  it.. --img-- now it is too late, the damage to leica's image has been done. somebody has not been doing his sums at leica. one sale lost for this reason equals three free sensor replacements. not counting follow-up sales in lenses, accessories and future sales. the net result of this action can only be negative.", "sortedWord": "None", "Identifyer": null, "identifyer": 35645, "year": "2017"}, {"autor": "NB23", "date": "2017-03-14 14:37:00", "content": "Heaven knows, what hidden problems a used M8 can have. How do you come up with stuff like this? Why would a \"used M8 have hidden problems\" that only heaven knows? Cameras are not cars and if they work, they simply work. As plain as that. And there's no difference between a used M8 and a used nikon D50 except the user base. The nikon user base won't touch a d50 with a dirty stick while the leica user base tries hard to find some magical propeties unique to the M8. This repair should cost 350$.", "link": "https://www.l-camera-forum.com/topic/269959-m8-shutter-ate-itself/?tab=comments#comment-3233387", "origin": "L-forum", "suborigin": "269959-m8-shutter-ate-itself", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "heaven knows, what hidden problems a used m8 can have. how do you -----> come !!!  -----> up !!!  -----> with !!!  stuff like this? why would a \"used m8 have hidden problems\" that only heaven knows? cameras are not cars and if they work, they simply work. as plain as that. and there's no difference between a used m8 and a used nikon d50 except the user base. the nikon user base won't touch a d50 with a dirty stick while the leica user base tries hard to find some magical propeties unique to the m8. this repair should cost 350$.", "sortedWord": "None", "Identifyer": null, "identifyer": 43943, "year": "2017"}, {"autor": "pico", "date": "2017-02-04 23:13:00", "content": "Edit: I used the 10mm finder under varied circumstances and except for dark scenes where the bright lines suffered (rarely), it works perfectly well, even with glasses. Now why cannot Leica come up with such a lens and viewfinder? . Edited February 4, 2017 by pico", "link": "https://www.l-camera-forum.com/topic/253730-your-ultra-wide-angle-uwa-pictures-10mm-to-21mm/page/13/?tab=comments#comment-3204801", "origin": "L-forum", "suborigin": "253730-your-ultra-wide-angle-uwa-pictures-10mm-to-21mm", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "edit: i used the 10mm finder under varied circumstances and except for dark scenes where the bright lines suffered (rarely), it works perfectly well, even with glasses. now why cannot leica -----> come !!!  -----> up !!!  -----> with !!!  such a lens and viewfinder? . edited february 4, 2017 by pico", "sortedWord": "None", "Identifyer": null, "identifyer": 11719, "year": "2017"}, {"autor": "derleicaman", "date": "2017-12-08 16:18:00", "content": "LIK- Derleicaman said that you need a tripod to be able to appreciate the optical abberancies on the M10's screen... Have you found this to be so? Do you see an ACTUAL change in the picture's artifacts on the back screen as you stop down from wide open? Thanks, Albert --img--  Hello Albert, What I was referring to was the personal problem I have with using the back screen handheld because of my close-up eyesight not being that great. To see the rear screen clearly, I need to hold the camera at almost arm's length. To be able to compose, focus and shoot with the rear screen, I would need to mount the camera on a tripod. Hence the Viso 020 is a better solution for me. However, the Thambar is such an unruly beast in that the flare or glow at wider aperture is often really quite intense and makes focusing and even composition more difficult. I read the instructions for the original Thambar that someone linked here and I think anyone seriously contemplating this lens give it a read. In those instructions, it was pointed out that these problems I am talking about are obviated with the use of a rangefinder camera as you are not looking through the lens. This is a good point, but then again, makes visualizing the effect of the Thambar impossible. I don't remember if they made a short mount to use the Thambar lens head on a PLOOT reflex housing, but perhaps they did. Bottom line, I think I need to spend a lot more time with the lens and the M10 to come up with something workable in how I use the lens. This is one tough lens to get comfortable with in use. Top marks to the OP on his input and images taken with the new Thambar. They have been quite instructive and helpful in my own approach to this most difficult Leica lens. --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/5/?tab=comments#comment-3413790", "origin": "L-forum", "suborigin": "279589-thambar-crazy", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "lik- derleicaman said that you need a tripod to be able to appreciate the optical abberancies on the m10's screen... have you found this to be so? do you see an actual change in the picture's artifacts on the back screen as you stop down from wide open? thanks, albert --img--  hello albert, what i was referring to was the personal problem i have with using the back screen handheld because of my close-up eyesight not being that great. to see the rear screen clearly, i need to hold the camera at almost arm's length. to be able to compose, focus and shoot with the rear screen, i would need to mount the camera on a tripod. hence the viso 020 is a better solution for me. however, the thambar is such an unruly beast in that the flare or glow at wider aperture is often really quite intense and makes focusing and even composition more difficult. i read the instructions for the original thambar that someone linked here and i think anyone seriously contemplating this lens give it a read. in those instructions, it was pointed out that these problems i am talking about are obviated with the use of a rangefinder camera as you are not looking through the lens. this is a good point, but then again, makes visualizing the effect of the thambar impossible. i don't remember if they made a short mount to use the thambar lens head on a ploot reflex housing, but perhaps they did. bottom line, i think i need to spend a lot more time -----> with !!!  the lens and the m10 to -----> come !!!  -----> up !!!  -----> with !!!  something workable in how i use the lens. this is one tough lens to get comfortable with in use. top marks to the op on his input and images taken with the new thambar. they have been quite instructive and helpful in my own approach to this most difficult leica lens. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 12082, "year": "2017"}, {"autor": "NB23", "date": "2017-05-31 17:04:00", "content": "At 2.5 it's already intriguing. But I agree, around f4 it's very special, also 3.5 and 4.8 are great How can you come up with stuff like this, please? What about f3.3 and 6.3?", "link": "https://www.l-camera-forum.com/topic/190811-the-king-of-bokeh-killed-by-its-father/page/3/?tab=comments#comment-3286392", "origin": "L-forum", "suborigin": "190811-the-king-of-bokeh-killed-by-its-father", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "at 2.5 it's already intriguing. but i agree, around f4 it's very special, also 3.5 and 4.8 are great how can you -----> come !!!  -----> up !!!  -----> with !!!  stuff like this, please? what about f3.3 and 6.3?", "sortedWord": "None", "Identifyer": null, "identifyer": 19802, "year": "2017"}, {"autor": "NB23", "date": "2017-06-02 14:03:00", "content": "Must I write 2.8/4.0 and 4.0/5.6 then? Don't you get my meaning btw? Are we getting meticulous here? You mean you didn't understand that I was talking about half stops? 'Please… please… please… please…' (James Brown) PS: Leica changed the new Summarits from 2.5 to 2.4. Is that for you a reason write them comments? If I am to be serious for one minute, I'll answer you this; First of all, the \"king of bokeh\" is the King of nothing, and especially not bokeh. If it absolutely had to be the king of something, it would be the king of size. Maybe. I would call it the overhyped King. Second of all, aren't you tired of the Leica glass overglorification? I am. Sure, I play the game, often tongue in cheek. But in reality, there is no real optical gain to plain old minolta glass, for example. That's what my 20x24 darkroom prints tell me. Actually, some prints made with an old 28-70mm f2.8 Nikkor zoom are so glorious, one would swear it was shot with Leica. Do you see what I did there? I tricked you. How can one swear it's shot with Leica glass, anyways? It is because of the overhypification. Like if it was automatically better. We could verse into deep philosophy but let's spare us the bullsheet. The fact is that its all an illusion that we nourish and nurture. We want our Leica glass to be better. The fact is that in real life, you'd probably choose my Nikon prints to be the Leica prints, and my Leica prints to be the Nikon prints. And that's because you fed yourself the bullsheet (like most people) that a Leica print must necessarily look better. Now about the 2.4 vs 2.5, yes there was a lot of discussion about it. But it seems that you weren't there. The immediate conclusion was that it was a marketing move. And it was. Because in real life, there is no way a manufacturer can manufacture a 0.1 difference (in absolute terms, not in f-stops terms). And indeed, the lend wasn't changed. So tes, in other words, it was only marketing. In conclusion, all this lens talk is mostly bullshiite. I do not accept stuped terms such as micro contrast, macro contrast, foot print, finger print, and so on. Who created those terms? I can come up with my own expert words that mean absolutely nothing: median-contrast, multi-gamut, dryness of the image, chroma-transition between warm and cool colors, edge dimensionality (i.e. the edge dimensionality of Leica glass is, in average, 1.4 points better than Canon L glass, according to blabla measurements. The edge dimensionality is an advanced method of measuring micro contrast. It is the Micro-contrast of the Micro-contrast itself.). It is maybe my experience of having shot over a few million shots, and having printed over 20,000 prints, or maybe simple common sense, but all this is only blabla. The more I thibk about it the more I am certain: the Leica experience is a fondling experience. Just like sex: all about fondling and only fondlig.", "link": "https://www.l-camera-forum.com/topic/190811-the-king-of-bokeh-killed-by-its-father/page/3/?tab=comments#comment-3287615", "origin": "L-forum", "suborigin": "190811-the-king-of-bokeh-killed-by-its-father", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "must i write 2.8/4.0 and 4.0/5.6 then? don't you get my meaning btw? are we getting meticulous here? you mean you didn't understand that i was talking about half stops? 'please… please… please… please…' (james brown) ps: leica changed the new summarits from 2.5 to 2.4. is that for you a reason write them comments? if i am to be serious for one minute, i'll answer you this; first of all, the \"king of bokeh\" is the king of nothing, and especially not bokeh. if it absolutely had to be the king of something, it would be the king of size. maybe. i would call it the overhyped king. second of all, aren't you tired of the leica glass overglorification? i am. sure, i play the game, often tongue in cheek. but in reality, there is no real optical gain to plain old minolta glass, for example. that's what my 20x24 darkroom prints tell me. actually, some prints made with an old 28-70mm f2.8 nikkor zoom are so glorious, one would swear it was shot with leica. do you see what i did there? i tricked you. how can one swear it's shot with leica glass, anyways? it is because of the overhypification. like if it was automatically better. we could verse into deep philosophy but let's spare us the bullsheet. the fact is that its all an illusion that we nourish and nurture. we want our leica glass to be better. the fact is that in real life, you'd probably choose my nikon prints to be the leica prints, and my leica prints to be the nikon prints. and that's because you fed yourself the bullsheet (like most people) that a leica print must necessarily look better. now about the 2.4 vs 2.5, yes there was a lot of discussion about it. but it seems that you weren't there. the immediate conclusion was that it was a marketing move. and it was. because in real life, there is no way a manufacturer can manufacture a 0.1 difference (in absolute terms, not in f-stops terms). and indeed, the lend wasn't changed. so tes, in other words, it was only marketing. in conclusion, all this lens talk is mostly bullshiite. i do not accept stuped terms such as micro contrast, macro contrast, foot print, finger print, and so on. who created those terms? i can -----> come !!!  -----> up !!!  -----> with !!!  my own expert words that mean absolutely nothing: median-contrast, multi-gamut, dryness of the image, chroma-transition between warm and cool colors, edge dimensionality (i.e. the edge dimensionality of leica glass is, in average, 1.4 points better than canon l glass, according to blabla measurements. the edge dimensionality is an advanced method of measuring micro contrast. it is the micro-contrast of the micro-contrast itself.). it is maybe my experience of having shot over a few million shots, and having printed over 20,000 prints, or maybe simple common sense, but all this is only blabla. the more i thibk about it the more i am certain: the leica experience is a fondling experience. just like sex: all about fondling and only fondlig.", "sortedWord": "None", "Identifyer": null, "identifyer": 19804, "year": "2017"}, {"autor": "EddieJ", "date": "2017-06-02 22:10:00", "content": " If I am to be serious for one minute, I'll answer you this; First of all, the \"king of bokeh\" is the King of nothing, and especially not bokeh. If it absolutely had to be the king of something, it would be the king of size. Maybe. I would call it the overhyped King. I would agree with this summation, especially the price Second of all, aren't you tired of the Leica glass overglorification? I am.Sure, I play the game, often tongue in cheek. But in reality, there is no real optical gain to plain old minolta glass, for example. That's what my 20x24 darkroom prints tell me. Actually, some prints made with an old 28-70mm f2.8 Nikkor zoom are so glorious, one would swear it was shot with Leica. Do you see what I did there? I tricked you. How can one swear it's shot with Leica glass, anyways? It is because of the overhypification. Like if it was automatically better. We could verse into deep philosophy but let's spare us the bullsheet. The fact is that its all an illusion that we nourish and nurture. We want our Leica glass to be better. The fact is that in real life, you'd probably choose my Nikon prints to be the Leica prints, and my Leica prints to be the Nikon prints. And that's because you fed yourself the bullsheet (like most people) that a Leica print must necessarily look better. Plenty of over-glorification out there in the WWW. Plenty of hype as well. Perhaps we all need to take a chill-pill every now and then --img--  Now about the 2.4 vs 2.5, yes there was a lot of discussion about it. But it seems that you weren't there.The immediate conclusion was that it was a marketing move. And it was. Because in real life, there is no way a manufacturer can manufacture a 0.1 difference (in absolute terms, not in f-stops terms). And indeed, the lend wasn't changed. So tes, in other words, it was only marketing. In conclusion, all this lens talk is mostly bullshiite. I do not accept stuped terms such as micro contrast, macro contrast, foot print, finger print, and so on. Who created those terms? It is about bull-shite as its about marketing and advertising to sell what you don't need. Though I am still teaching and in the studio we still teach 32, 22, 16, 11, 8, 5.6, 4, 2.8, 2, 1.4, 1.2 etc half-stops, third-stops, full-stops et al. Then we relate this back to digital. Same with shutter speeds. I can come up with my own expert words that mean absolutely nothing: median-contrast, multi-gamut, dryness of the image, chroma-transition between warm and cool colors, edge dimensionality (i.e. the edge dimensionality of Leica glass is, in average, 1.4 points better than Canon L glass, according to blabla measurements. The edge dimensionality is an advanced method of measuring micro contrast. It is the Micro-contrast of the Micro-contrast itself.). It is maybe my experience of having shot over a few million shots, and having printed over 20,000 prints, or maybe simple common sense, but all this is only blabla. The more I thibk about it the more I am certain: the Leica experience is a fondling experience. Just like sex: all about fondling and only fondlig. Gotta love this comment. The only thing I'll add is that we still teach - live, breathe, sleep get to your your camera as if your camera was the extension of your eye.", "link": "https://www.l-camera-forum.com/topic/190811-the-king-of-bokeh-killed-by-its-father/page/3/?tab=comments#comment-3287919", "origin": "L-forum", "suborigin": "190811-the-king-of-bokeh-killed-by-its-father", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " if i am to be serious for one minute, i'll answer you this; first of all, the \"king of bokeh\" is the king of nothing, and especially not bokeh. if it absolutely had to be the king of something, it would be the king of size. maybe. i would call it the overhyped king. i would agree with this summation, especially the price second of all, aren't you tired of the leica glass overglorification? i am.sure, i play the game, often tongue in cheek. but in reality, there is no real optical gain to plain old minolta glass, for example. that's what my 20x24 darkroom prints tell me. actually, some prints made with an old 28-70mm f2.8 nikkor zoom are so glorious, one would swear it was shot with leica. do you see what i did there? i tricked you. how can one swear it's shot with leica glass, anyways? it is because of the overhypification. like if it was automatically better. we could verse into deep philosophy but let's spare us the bullsheet. the fact is that its all an illusion that we nourish and nurture. we want our leica glass to be better. the fact is that in real life, you'd probably choose my nikon prints to be the leica prints, and my leica prints to be the nikon prints. and that's because you fed yourself the bullsheet (like most people) that a leica print must necessarily look better. plenty of over-glorification out there in the www. plenty of hype as well. perhaps we all need to take a chill-pill every now and then --img--  now about the 2.4 vs 2.5, yes there was a lot of discussion about it. but it seems that you weren't there.the immediate conclusion was that it was a marketing move. and it was. because in real life, there is no way a manufacturer can manufacture a 0.1 difference (in absolute terms, not in f-stops terms). and indeed, the lend wasn't changed. so tes, in other words, it was only marketing. in conclusion, all this lens talk is mostly bullshiite. i do not accept stuped terms such as micro contrast, macro contrast, foot print, finger print, and so on. who created those terms? it is about bull-shite as its about marketing and advertising to sell what you don't need. though i am still teaching and in the studio we still teach 32, 22, 16, 11, 8, 5.6, 4, 2.8, 2, 1.4, 1.2 etc half-stops, third-stops, full-stops et al. then we relate this back to digital. same with shutter speeds. i can -----> come !!!  -----> up !!!  -----> with !!!  my own expert words that mean absolutely nothing: median-contrast, multi-gamut, dryness of the image, chroma-transition between warm and cool colors, edge dimensionality (i.e. the edge dimensionality of leica glass is, in average, 1.4 points better than canon l glass, according to blabla measurements. the edge dimensionality is an advanced method of measuring micro contrast. it is the micro-contrast of the micro-contrast itself.). it is maybe my experience of having shot over a few million shots, and having printed over 20,000 prints, or maybe simple common sense, but all this is only blabla. the more i thibk about it the more i am certain: the leica experience is a fondling experience. just like sex: all about fondling and only fondlig. gotta love this comment. the only thing i'll add is that we still teach - live, breathe, sleep get to your your camera as if your camera was the extension of your eye.", "sortedWord": "None", "Identifyer": null, "identifyer": 19806, "year": "2017"}, {"autor": "mmradman", "date": "2017-01-20 14:24:00", "content": " We know that some long R lenses can work on Leica S, focus distance is limitation in some instances due to inserted adaptor but also in some cases infinity focus can be achieved - adopted APO Telyt 280mm f4 or other lenses with APO 1.4 extender and LeiCo adaptor http://www.lei-ko.de/fotografie/Fotografie.html I also recall seeing (tried searching without success) either here on LUF or somewhere else on the web (Fred Miranda maybe) R lenses used on MF digital back with pretty coverage, some vignetting using wide like 19 mm and 28 mm but rapidly improving with longer lenses. My thinking is that with introduction of new Fuji GFX50 which have registry of 26.5mm and focal plane shutter some of R lenses can be used providing usual suspects (Novoflex, Kipon etc) come up with suitable adaptor. your thoughts...", "link": "https://www.l-camera-forum.com/topic/268468-r-lenses-and-medium-format-cameras/?tab=comments#comment-3192068", "origin": "L-forum", "suborigin": "268468-r-lenses-and-medium-format-cameras", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " we know that some long r lenses can work on leica s, focus distance is limitation in some instances due to inserted adaptor but also in some cases infinity focus can be achieved - adopted apo telyt 280mm f4 or other lenses with apo 1.4 extender and leico adaptor http://www.lei-ko.de/fotografie/fotografie.html i also recall seeing (tried searching without success) either here on luf or somewhere else on the web (fred miranda maybe) r lenses used on mf digital back with pretty coverage, some vignetting using wide like 19 mm and 28 mm but rapidly improving with longer lenses. my thinking is that -----> with !!!  introduction of new fuji gfx50 which have registry of 26.5mm and focal plane shutter some of r lenses can be used providing usual suspects (novoflex, kipon etc) -----> come !!!  -----> up !!!  -----> with !!!  suitable adaptor. your thoughts...", "sortedWord": "None", "Identifyer": null, "identifyer": 19494, "year": "2017"}, {"autor": "willeica", "date": "2017-12-29 08:59:00", "content": "VIDOM 70 has detailed description of various Elmars with classification. Do not remember now how many variants he found and how did he classify, but description of variants is much better than by Hasbroek Thanks Jerzy. Vidom will not have been seen by most English speaking members. Hasbroeck's book is far from perfect, but, at least, he attempted a classification in the English language of various lenses (not just the Elmar). Angela von Einem did the same thing for the I Model A and her book does include 50mm Elmar variations not noted by van Hasbroeck. The main point is that there are more variations than most collectors are aware of. In the present case we are all agreed that this looks like an engraving error and not another variation, unless, of course, someone can come up with another example. William", "link": "https://www.l-camera-forum.com/topic/280217-unknow-nickel-11-oclock-5cm-elmar/?tab=comments#comment-3427622", "origin": "L-forum", "suborigin": "280217-unknow-nickel-11-oclock-5cm-elmar", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "vidom 70 has detailed description of various elmars with classification. do not remember now how many variants he found and how did he classify, but description of variants is much better than by hasbroek thanks jerzy. vidom will not have been seen by most english speaking members. hasbroeck's book is far from perfect, but, at least, he attempted a classification in the english language of various lenses (not just the elmar). angela von einem did the same thing for the i model a and her book does include 50mm elmar variations not noted by van hasbroeck. the main point is that there are more variations than most collectors are aware of. in the present case we are all agreed that this looks like an engraving error and not another variation, unless, of course, someone can -----> come !!!  -----> up !!!  -----> with !!!  another example. william", "sortedWord": "None", "Identifyer": null, "identifyer": 37246, "year": "2017"}, {"autor": "willeica", "date": "2017-09-17 16:59:00", "content": "The Elmar from 1929 bears a 3,the other one a 1. Both were remounted by Leitz when the cameras got an Upgrade. 3 is 48.6mm and 1 is 49.6mm according to a table which I have: The full table is below: 0 - 50.5mm 1- 49.6mm 3 - 48.6mm 4 - 50.7mm 5 - 51mm 6 - 51.3mm 7 - 51.6mm 8 - 51.9mm I imagine the word 'nearest to' could be added here. Leica was, in my view, on a journey from a craft business to a mass manufacturer of camera lenses. The company hardly decided that on this day/week/month we will manufacture Elmars at, say, a focal length of 51mm. If JC or anyone has information from VIDOM or elsewhere about these markings it would be good to know how and why this happened and how Leica came up with the number system. William", "link": "https://www.l-camera-forum.com/topic/276822-whats-the-true-story-surrounding-the-birth-of-red-scale-elmars/page/3/?tab=comments#comment-3360813", "origin": "L-forum", "suborigin": "276822-whats-the-true-story-surrounding-the-birth-of-red-scale-elmars", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "the elmar from 1929 bears a 3,the other one a 1. both were remounted by leitz when the cameras got an upgrade. 3 is 48.6mm and 1 is 49.6mm according to a table which i have: the full table is below: 0 - 50.5mm 1- 49.6mm 3 - 48.6mm 4 - 50.7mm 5 - 51mm 6 - 51.3mm 7 - 51.6mm 8 - 51.9mm i imagine the word 'nearest to' could be added here. leica was, in my view, on a journey from a craft business to a mass manufacturer of camera lenses. the company hardly decided that on this day/week/month we will manufacture elmars at, say, a focal length of 51mm. if jc or anyone has information from vidom or elsewhere about these markings it would be good to know how and why this happened and how leica -----> came !!!  -----> up !!!  -----> with !!!  the number system. william", "sortedWord": "None", "Identifyer": null, "identifyer": 38029, "year": "2017"}, {"autor": "UliWer", "date": "2017-09-18 14:38:00", "content": "3 is 48.6mm and 1 is 49.6mm according to a table which I have: The full table is below: 0 - 50.5mm 1- 49.6mm 3 - 48.6mm 4 - 50.7mm 5 - 51mm 6 - 51.3mm 7 - 51.6mm 8 - 51.9mm I imagine the word 'nearest to' could be added here. Leica was, in my view, on a journey from a craft business to a mass manufacturer of camera lenses. The company hardly decided that on this day/week/month we will manufacture Elmars at, say, a focal length of 51mm. If JC or anyone has information from VIDOM or elsewhere about these markings it would be good to know how and why this happened and how Leica came up with the number system. William Do you have a source for this table? In the list which was found by telewatt and first published in the thread linked above in #18 the description for the different numbers apply to the pitch of the focussing thread. You find the text on p.10 under \"Focusing Mount, designation of pitch\": --img-- ", "link": "https://www.l-camera-forum.com/topic/276822-whats-the-true-story-surrounding-the-birth-of-red-scale-elmars/page/3/?tab=comments#comment-3361316", "origin": "L-forum", "suborigin": "276822-whats-the-true-story-surrounding-the-birth-of-red-scale-elmars", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "3 is 48.6mm and 1 is 49.6mm according to a table which i have: the full table is below: 0 - 50.5mm 1- 49.6mm 3 - 48.6mm 4 - 50.7mm 5 - 51mm 6 - 51.3mm 7 - 51.6mm 8 - 51.9mm i imagine the word 'nearest to' could be added here. leica was, in my view, on a journey from a craft business to a mass manufacturer of camera lenses. the company hardly decided that on this day/week/month we will manufacture elmars at, say, a focal length of 51mm. if jc or anyone has information from vidom or elsewhere about these markings it would be good to know how and why this happened and how leica -----> came !!!  -----> up !!!  -----> with !!!  the number system. william do you have a source for this table? in the list which was found by telewatt and first published in the thread linked above in #18 the description for the different numbers apply to the pitch of the focussing thread. you find the text on p.10 under \"focusing mount, designation of pitch\": --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 38032, "year": "2017"}, {"autor": "willeica", "date": "2017-09-23 15:12:00", "content": " Thanks Jerzy. As ever, you come up with great information. The lens on a I Model A would have had a smallest aperture of f18. So the lens head here would have been from a 1940s lens and it seems that this was then attached to a Red Scale mount with a triangle from 1953 or later. I have never seen an Elmar stripped down like this to show the screws which limit the rotation. I presume that the screw positions cannot be changed. Does this mean that a lens with a minimum aperture size of f16 cannot be subsequently changed to give either f18 or f22? William Edited September 23, 2017 by willeica", "link": "https://www.l-camera-forum.com/topic/276822-whats-the-true-story-surrounding-the-birth-of-red-scale-elmars/page/4/?tab=comments#comment-3363824", "origin": "L-forum", "suborigin": "276822-whats-the-true-story-surrounding-the-birth-of-red-scale-elmars", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " thanks jerzy. as ever, you -----> come !!!  -----> up !!!  -----> with !!!  great information. the lens on a i model a would have had a smallest aperture of f18. so the lens head here would have been from a 1940s lens and it seems that this was then attached to a red scale mount with a triangle from 1953 or later. i have never seen an elmar stripped down like this to show the screws which limit the rotation. i presume that the screw positions cannot be changed. does this mean that a lens with a minimum aperture size of f16 cannot be subsequently changed to give either f18 or f22? william edited september 23, 2017 by willeica", "sortedWord": "None", "Identifyer": null, "identifyer": 38046, "year": "2017"}, {"autor": "marcg", "date": "2017-10-31 10:50:00", "content": " I've been taking photographs for a long time (note, I don't call myself a photographer) and I was suddenly struck by a thought/question. Is it possible to say that dynamic range is the opposite of contrast in some way? It seems to me that dynamic range is about all the steps between maximum dark and maximum light and the more steps there are then the more of those steps there will be and of course the more subtle will be the gradations. On the other hand it seems to me that contrast is designed to emphasise differences in light and dark and to reduce the number of steps. I'm amazed that I have come up with this question – and I really should know or understand the answer by now. If people would like to contribute to this thread, please do so in easy language – not highly technical geek-speak. Ta Edited October 31, 2017 by marcg", "link": "https://www.l-camera-forum.com/topic/278294-contrast-and-dynamic-range/?tab=comments#comment-3385560", "origin": "L-forum", "suborigin": "278294-contrast-and-dynamic-range", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " i've been taking photographs for a long time (note, i don't call myself a photographer) and i was suddenly struck by a thought/question. is it possible to say that dynamic range is the opposite of contrast in some way? it seems to me that dynamic range is about all the steps between maximum dark and maximum light and the more steps there are then the more of those steps there will be and of course the more subtle will be the gradations. on the other hand it seems to me that contrast is designed to emphasise differences in light and dark and to reduce the number of steps. i'm amazed that i have -----> come !!!  -----> up !!!  -----> with !!!  this question – and i really should know or understand the answer by now. if people would like to contribute to this thread, please do so in easy language – not highly technical geek-speak. ta edited october 31, 2017 by marcg", "sortedWord": "None", "Identifyer": null, "identifyer": 86105, "year": "2017"}, {"autor": "pgk", "date": "2017-11-01 18:25:00", "content": "Is it possible to say that dynamic range is the opposite of contrast in some way? I'm amazed that I have come up with this question – and I really should know or understand the answer by now. The answer to your question above is no. But, you need to define precisely what you mean by contrast (scene contrast, micro contrast, lens contrast or what?).", "link": "https://www.l-camera-forum.com/topic/278294-contrast-and-dynamic-range/?tab=comments#comment-3386586", "origin": "L-forum", "suborigin": "278294-contrast-and-dynamic-range", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "is it possible to say that dynamic range is the opposite of contrast in some way? i'm amazed that i have -----> come !!!  -----> up !!!  -----> with !!!  this question – and i really should know or understand the answer by now. the answer to your question above is no. but, you need to define precisely what you mean by contrast (scene contrast, micro contrast, lens contrast or what?).", "sortedWord": "None", "Identifyer": null, "identifyer": 86112, "year": "2017"}, {"autor": "masjah", "date": "2017-07-25 22:05:00", "content": "A shift lens (I have the 28/2.8 PC SA R) works perfectly well with a Leica M equipped with R-M adapter and EVF2. I don't miss the tilt facility, since the image plane of architectural photographs is usually vertical. Of course an M uses stopped down metering anyway, so the manual diaphragm on this lens is no problem either. The lens is not included in the R lens list which comes up with the R-M adapter; this is unsurprising since any corrections would be heavily dependent on the shift applied, which of course cannot be known by the camera. A tripod is highly desirable, and the \"artificial horizon\" in the M is very useful.", "link": "https://www.l-camera-forum.com/topic/274993-architectural-photography/?tab=comments#comment-3323656", "origin": "L-forum", "suborigin": "274993-architectural-photography", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "a shift lens (i have the 28/2.8 pc sa r) works perfectly well with a leica m equipped with r-m adapter and evf2. i don't miss the tilt facility, since the image plane of architectural photographs is usually vertical. of course an m uses stopped down metering anyway, so the manual diaphragm on this lens is no problem either. the lens is not included in the r lens list which -----> comes !!!  -----> up !!!  -----> with !!!  the r-m adapter; this is unsurprising since any corrections would be heavily dependent on the shift applied, which of course cannot be known by the camera. a tripod is highly desirable, and the \"artificial horizon\" in the m is very useful.", "sortedWord": "None", "Identifyer": null, "identifyer": 86404, "year": "2017"}, {"autor": "Guest NEIL-D-WILLIAMS", "date": "2017-12-19 12:54:00", "content": "Okay so here is my take on it. I have been shooting the Leica S006 then S007 for around 2 years now. I have also been shooting Leica SL durning that time. But whenever I go out to shoot something important to me, weather that be a pretty model, a beautiful landscape or anywhere where I want the best IQ I ALWAYS take the S with S lenses...........I would be crazy not to --img--  I just went to Japan for 8 days and initially thought about taking the TL2 but my sensible head kicked in and said don't be stupid, take the best that you already have, so I took the S and glad that i did Pictures here I sold the SL because the IQ of the SL files compared to the S007 files is like \"carrots and pigs trotters\" in other words there is no comparison. I miss the SL for one thing only and that is it was good for me to shoot Noctilux and get all those squiggly bits that I like...........I have now managed to get some squiggly bits with my S120 under certain lighting conditions so it now looks like I will also let the Noctilux and my other M lenses go (I will keep the 50mm Elmar M) as that puppy looks sexy on my TL2. I have no intentions of selling off my S gear as I just know that one day Leica with get there heads out of there a$$es and listen to what the medium format guys are asking for and give us a mirrorless small compact S with 80+ megabytes ...............Kind of like Hasselblad have done with there X1D. I will buy a X1D field kit to use in the meantime while waiting for the paragraph above to material girl. We will then see if the new S will be compatible with the current S lenses (hopefully the new mirrorless S will have small lenses to go with it) again like the X1D I just need Raymond to get his head out of his a$$ and come up with some realistic numbers for my gear that I will be trading in for the X1D. I still have over 3 weeks before I get home so I am not panicking yet Neil", "link": "https://www.l-camera-forum.com/topic/278073-x1d/page/7/?tab=comments#comment-3421317", "origin": "L-forum", "suborigin": "278073-x1d", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "okay so here is my take on it. i have been shooting the leica s006 then s007 for around 2 years now. i have also been shooting leica sl durning that time. but whenever i go out to shoot something important to me, weather that be a pretty model, a beautiful landscape or anywhere where i want the best iq i always take the s with s lenses...........i would be crazy not to --img--  i just went to japan for 8 days and initially thought about taking the tl2 but my sensible head kicked in and said don't be stupid, take the best that you already have, so i took the s and glad that i did pictures here i sold the sl because the iq of the sl files compared to the s007 files is like \"carrots and pigs trotters\" in other words there is no comparison. i miss the sl for one thing only and that is it was good for me to shoot noctilux and get all those squiggly bits that i like...........i have now managed to get some squiggly bits with my s120 under certain lighting conditions so it now looks like i will also let the noctilux and my other m lenses go (i will keep the 50mm elmar m) as that puppy looks sexy on my tl2. i have no intentions of selling off my s gear as i just know that one day leica with get there heads out of there a$$es and listen to what the medium format guys are asking for and give us a mirrorless small compact s with 80+ megabytes ...............kind of like hasselblad have done with there x1d. i will buy a x1d field kit to use in the meantime while waiting for the paragraph above to material girl. we will then see if the new s will be compatible -----> with !!!  the current s lenses (hopefully the new mirrorless s will have small lenses to go -----> with !!!  it) again like the x1d i just need raymond to get his head out of his a$$ and -----> come !!!  -----> up !!!  -----> with !!!  some realistic numbers for my gear that i will be trading in for the x1d. i still have over 3 weeks before i get home so i am not panicking yet neil", "sortedWord": "None", "Identifyer": null, "identifyer": 91040, "year": "2017"}, {"autor": "docmoore", "date": "2017-12-19 22:42:00", "content": "Okay so here is my take on it. I have been shooting the Leica S006 then S007 for around 2 years now. I have also been shooting Leica SL durning that time. But whenever I go out to shoot something important to me, weather that be a pretty model, a beautiful landscape or anywhere where I want the best IQ I ALWAYS take the S with S lenses...........I would be crazy not to --img--  I just went to Japan for 8 days and initially thought about taking the TL2 but my sensible head kicked in and said don't be stupid, take the best that you already have, so I took the S and glad that i did Pictures here I sold the SL because the IQ of the SL files compared to the S007 files is like \"carrots and pigs trotters\" in other words there is no comparison. I miss the SL for one thing only and that is it was good for me to shoot Noctilux and get all those squiggly bits that I like...........I have now managed to get some squiggly bits with my S120 under certain lighting conditions so it now looks like I will also let the Noctilux and my other M lenses go (I will keep the 50mm Elmar M) as that puppy looks sexy on my TL2. I have no intentions of selling off my S gear as I just know that one day Leica with get there heads out of there a$$es and listen to what the medium format guys are asking for and give us a mirrorless small compact S with 80+ megabytes ...............Kind of like Hasselblad have done with there X1D. I will buy a X1D field kit to use in the meantime while waiting for the paragraph above to material girl. We will then see if the new S will be compatible with the current S lenses (hopefully the new mirrorless S will have small lenses to go with it) again like the X1D I just need Raymond to get his head out of his a$$ and come up with some realistic numbers for my gear that I will be trading in for the X1D. I still have over 3 weeks before I get home so I am not panicking yet Neil Neil, This may sound a bit strange ... coming from a X1D owner ...ex-S ( 3 times ) owner but I think if you are keeping the S then buying the X1D would be a mistake ... don’t misunderstand me ... the X1D is great but it cannot function as a backup for the S. Lighter yes but honestly that is not the issue for you or me. Live view on the S 007 equates to the view on the X1D ... add a Zacuto gratical EVF and you leave it in the dust. We’re you to drop the S and lenses ... makes more sense but to support and work with two systems may not make your photography any better. I love new car smell as much as anyone but the S is very fine and the X1D offers little imaging and lens wise that you cannot get with the S. Now a Phase One Achromatic 100 would add a bit to your universe Bob", "link": "https://www.l-camera-forum.com/topic/278073-x1d/page/8/?tab=comments#comment-3421750", "origin": "L-forum", "suborigin": "278073-x1d", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "okay so here is my take on it. i have been shooting the leica s006 then s007 for around 2 years now. i have also been shooting leica sl durning that time. but whenever i go out to shoot something important to me, weather that be a pretty model, a beautiful landscape or anywhere where i want the best iq i always take the s with s lenses...........i would be crazy not to --img--  i just went to japan for 8 days and initially thought about taking the tl2 but my sensible head kicked in and said don't be stupid, take the best that you already have, so i took the s and glad that i did pictures here i sold the sl because the iq of the sl files compared to the s007 files is like \"carrots and pigs trotters\" in other words there is no comparison. i miss the sl for one thing only and that is it was good for me to shoot noctilux and get all those squiggly bits that i like...........i have now managed to get some squiggly bits with my s120 under certain lighting conditions so it now looks like i will also let the noctilux and my other m lenses go (i will keep the 50mm elmar m) as that puppy looks sexy on my tl2. i have no intentions of selling off my s gear as i just know that one day leica with get there heads out of there a$$es and listen to what the medium format guys are asking for and give us a mirrorless small compact s with 80+ megabytes ...............kind of like hasselblad have done with there x1d. i will buy a x1d field kit to use in the meantime while waiting for the paragraph above to material girl. we will then see if the new s will be compatible -----> with !!!  the current s lenses (hopefully the new mirrorless s will have small lenses to go -----> with !!!  it) again like the x1d i just need raymond to get his head out of his a$$ and -----> come !!!  -----> up !!!  -----> with !!!  some realistic numbers for my gear that i will be trading in for the x1d. i still have over 3 weeks before i get home so i am not panicking yet neil neil, this may sound a bit strange ... coming from a x1d owner ...ex-s ( 3 times ) owner but i think if you are keeping the s then buying the x1d would be a mistake ... don’t misunderstand me ... the x1d is great but it cannot function as a backup for the s. lighter yes but honestly that is not the issue for you or me. live view on the s 007 equates to the view on the x1d ... add a zacuto gratical evf and you leave it in the dust. we’re you to drop the s and lenses ... makes more sense but to support and work with two systems may not make your photography any better. i love new car smell as much as anyone but the s is very fine and the x1d offers little imaging and lens wise that you cannot get with the s. now a phase one achromatic 100 would add a bit to your universe bob", "sortedWord": "None", "Identifyer": null, "identifyer": 91058, "year": "2017"}, {"autor": "wlaidlaw", "date": "2017-11-06 19:03:00", "content": "I was really struggling with the lovely condition (like new) boxed BEOON I had bought. I tried with a Zeiss ZM Planar 50/2, a Rollei Rolleinar 50mm and Schneider Kreuznach Componar 75mm. None of them would get near focus with any combination of extension tubes I could come up with. I have the A, B, C and D BEOON tubes plus a whole load of Periflex L39 tubes in different lengths. I bought a Schneider-Kreuznach Componon S 50mm f2.8, which is their top of the range enlarging/copying lens. It arrived today and is in very nice condition with just a very small amount of internal dust. I am delighted to say that it focuses perfectly with the B and D tubes. I am looking forward to actually copying/digitising some films. I bought a FirstCall LED A5 panel to replace my elderly Jessops fluorescent tube light box. It seems very evenly lit and well made. I will make a black card mask to go round the BEOON. Wilson", "link": "https://www.l-camera-forum.com/topic/275849-useful-to-shoot-some-slide-film-%E2%80%93-beoonm10/page/8/?tab=comments#comment-3390296", "origin": "L-forum", "suborigin": "275849-useful-to-shoot-some-slide-film-%E2%80%93-beoonm10", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i was really struggling with the lovely condition (like new) boxed beoon i had bought. i tried with a zeiss zm planar 50/2, a rollei rolleinar 50mm and schneider kreuznach componar 75mm. none of them would get near focus -----> with !!!  any combination of extension tubes i could -----> come !!!  -----> up !!!  -----> with !!! . i have the a, b, c and d beoon tubes plus a whole load of periflex l39 tubes in different lengths. i bought a schneider-kreuznach componon s 50mm f2.8, which is their top of the range enlarging/copying lens. it arrived today and is in very nice condition with just a very small amount of internal dust. i am delighted to say that it focuses perfectly with the b and d tubes. i am looking forward to actually copying/digitising some films. i bought a firstcall led a5 panel to replace my elderly jessops fluorescent tube light box. it seems very evenly lit and well made. i will make a black card mask to go round the beoon. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 98159, "year": "2017"}, {"autor": "Steve Ricoh", "date": "2017-11-06 19:16:00", "content": "I was really struggling with the lovely condition (like new) boxed BEOON I had bought. I tried with a Zeiss ZM Planar 50/2, a Rollei Rolleinar 50mm and Schneider Kreuznach Componar 75mm. None of them would get near focus with any combination of extension tubes I could come up with. I have the A, B, C and D BEOON tubes plus a whole load of Periflex L39 tubes in different lengths. I bought a Schneider-Kreuznach Componon S 50mm f2.8, which is their top of the range enlarging/copying lens. It arrived today and is in very nice condition with just a very small amount of internal dust. I am delighted to say that it focuses perfectly with the B and D tubes. I am looking forward to actually copying/digitising some films. I bought a FirstCall LED A5 panel to replace my elderly Jessops fluorescent tube light box. It seems very evenly lit and well made. I will make a black card mask to go round the BEOON. Wilson Are you using a FF camera? With the Leica M240 and the Shneider Componon-S 50mm f/2.8, it is normal to use tubes B, C and D for 1:1 registration of Object to Sensor. With a FF camera using tubes B+D with the Componon-S 50 f/2.8 should result in unused pixels. Interested to know what you're achieving as I have the same set up (I won't bore everyone with my less than acceptable experience).", "link": "https://www.l-camera-forum.com/topic/275849-useful-to-shoot-some-slide-film-%E2%80%93-beoonm10/page/8/?tab=comments#comment-3390305", "origin": "L-forum", "suborigin": "275849-useful-to-shoot-some-slide-film-%E2%80%93-beoonm10", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i was really struggling with the lovely condition (like new) boxed beoon i had bought. i tried with a zeiss zm planar 50/2, a rollei rolleinar 50mm and schneider kreuznach componar 75mm. none of them would get near focus -----> with !!!  any combination of extension tubes i could -----> come !!!  -----> up !!!  -----> with !!! . i have the a, b, c and d beoon tubes plus a whole load of periflex l39 tubes in different lengths. i bought a schneider-kreuznach componon s 50mm f2.8, which is their top of the range enlarging/copying lens. it arrived today and is in very nice condition with just a very small amount of internal dust. i am delighted to say that it focuses perfectly with the b and d tubes. i am looking forward to actually copying/digitising some films. i bought a firstcall led a5 panel to replace my elderly jessops fluorescent tube light box. it seems very evenly lit and well made. i will make a black card mask to go round the beoon. wilson are you using a ff camera? with the leica m240 and the shneider componon-s 50mm f/2.8, it is normal to use tubes b, c and d for 1:1 registration of object to sensor. with a ff camera using tubes b+d with the componon-s 50 f/2.8 should result in unused pixels. interested to know what you're achieving as i have the same set up (i won't bore everyone with my less than acceptable experience).", "sortedWord": "None", "Identifyer": null, "identifyer": 98160, "year": "2017"}, {"autor": "Steve Ricoh", "date": "2017-10-04 21:13:00", "content": "All taken with the BEOON 1:1 mask. I'm posting the results to demonstrate the difficult I'm having with the Schneider Componon S 50 f/2.8, although other BEOON users have more success. Pop asked me to provide test images. I'm hoping someone will come up with a strategy allowing successful 1:1 with the Componon. I've also have an El-Nikor 50 f/2.8, but the results with this lens are marginally worse. Edit: I also took one or two shots without the BEOON mask to help quantify the amount of negative visible. I did this simply by taping the negative to the 6mm sheet of glass I mentioned above. Edited October 4, 2017 by Steve Ricoh", "link": "https://www.l-camera-forum.com/topic/276684-beoon-enlarger-lenses-to-avoid-recommended-open-thread-please-add-your-experience-for-benefit-of-others/page/5/?tab=comments#comment-3370512", "origin": "L-forum", "suborigin": "276684-beoon-enlarger-lenses-to-avoid-recommended-open-thread-please-add-your-experience-for-benefit-of-others", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "all taken with the beoon 1:1 mask. i'm posting the results to demonstrate the difficult i'm having with the schneider componon s 50 f/2.8, although other beoon users have more success. pop asked me to provide test images. i'm hoping someone will -----> come !!!  -----> up !!!  -----> with !!!  a strategy allowing successful 1:1 -----> with !!!  the componon. i've also have an el-nikor 50 f/2.8, but the results with this lens are marginally worse. edit: i also took one or two shots without the beoon mask to help quantify the amount of negative visible. i did this simply by taping the negative to the 6mm sheet of glass i mentioned above. edited october 4, 2017 by steve ricoh", "sortedWord": "None", "Identifyer": null, "identifyer": 99264, "year": "2017"}, {"autor": "plasticman", "date": "2017-09-06 07:52:00", "content": "Yeah, one day some stuff happened, then somebody said something. --img--  I agree with you Steve that there's way too much of this sort of thing in the discussions. Just to underline that I really try not to have an axe to grind myself, over a year ago I initiated what I hoped was going to be a constructive discussion over on RFF: https://www.rangefinderforum.com/forums/showthread.php?t=154469 titled: \"Constructing the definitive DSLR scanning setup. Communal effort!\" * where I said \"I'm hoping we can all aim to keep it constructive, and make an attempt to come up with a sort of 'model' or 'ideal' setup for a reasonable price that present and future forum members can use as a reference for creating their own home 'scanners'.\" In any case, I'm very disappointed by the lack of substance behind the claims made for the BEOON recently. I've hardly seen any 100% crops or impartial side-by-side comparisons with decent dedicated film scanners. Just a lot of the usual \"my equipment is better than your equipment\"-type hot air that we've seen a million times here and elsewhere. * Typically for the topic, one of the moderators on RFF got into a weird fight with me almost straight away in the above thread, and apparently embarrassed by what he himself had said, and my and other people's responses, he waited a couple days then went through the entire thread and silently purged it of all the posts (both his own and everyone else's) that had even tangentially touched on his negative contribution, making what was left a confusing and incomplete mishmash of posts. During that time, my ability to Direct message on that forum was disabled, and afterwards I felt there was no point in continuing the discussion. Edited September 6, 2017 by plasticman", "link": "https://www.l-camera-forum.com/topic/276485-film-scanners/page/2/?tab=comments#comment-3353109", "origin": "L-forum", "suborigin": "276485-film-scanners", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "yeah, one day some stuff happened, then somebody said something. --img--  i agree with you steve that there's way too much of this sort of thing in the discussions. just to underline that i really try not to have an axe to grind myself, over a year ago i initiated what i hoped was going to be a constructive discussion over on rff: https://www.rangefinderforum.com/forums/showthread.php?t=154469 titled: \"constructing the definitive dslr scanning setup. communal effort!\" * where i said \"i'm hoping we can all aim to keep it constructive, and make an attempt to -----> come !!!  -----> up !!!  -----> with !!!  a sort of 'model' or 'ideal' setup for a reasonable price that present and future forum members can use as a reference for creating their own home 'scanners'.\" in any case, i'm very disappointed by the lack of substance behind the claims made for the beoon recently. i've hardly seen any 100% crops or impartial side-by-side comparisons with decent dedicated film scanners. just a lot of the usual \"my equipment is better than your equipment\"-type hot air that we've seen a million times here and elsewhere. * typically for the topic, one of the moderators on rff got into a weird fight with me almost straight away in the above thread, and apparently embarrassed by what he himself had said, and my and other people's responses, he waited a couple days then went through the entire thread and silently purged it of all the posts (both his own and everyone else's) that had even tangentially touched on his negative contribution, making what was left a confusing and incomplete mishmash of posts. during that time, my ability to direct message on that forum was disabled, and afterwards i felt there was no point in continuing the discussion. edited september 6, 2017 by plasticman", "sortedWord": "None", "Identifyer": null, "identifyer": 100034, "year": "2017"}, {"autor": "thebarnman", "date": "2017-04-17 03:51:00", "content": "Plasticman, thanks for the long post. It wasn't that long because it was interestingly filled with great detail. I would agree it's frustrating to have to use two sets of software to end up with low res scans (basically thumbnails,) and fine high resolution scans. The issue with your scanner's error message (apparently only happening with the Silverfast software) is concerning...even if it was from the Nikon scanner. It seems you don't have that issue when using Vuescan. Still, it's great to learn you were able to get past that, but only after setting it on manual focus. Does setting it on manual focus slow you down? I would not know how to manually focus a scanner; though it did not sound like it troubled you very much. Would it be better to manually focus the whole strip of film at one time...so it won't freeze or come up with some error message? From the end results; it sounds like your getting better scans. At the same time; I hope the learning curve is worth the extra time...regardless of money spent. Further thoughts: I wonder if the same issues would crop up if using a different scanner? Also; are you scanning B&W or Color? I would think color would be a nightmare due to all the different color settings, and types of color film. Edited April 17, 2017 by thebarnman", "link": "https://www.l-camera-forum.com/topic/257324-the-unthinkable-switching-from-vuescan-to-silverfast/page/3/?tab=comments#comment-3256183", "origin": "L-forum", "suborigin": "257324-the-unthinkable-switching-from-vuescan-to-silverfast", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "plasticman, thanks for the long post. it wasn't that long because it was interestingly filled with great detail. i would agree it's frustrating to have to use two sets of software to end up with low res scans (basically thumbnails,) and fine high resolution scans. the issue with your scanner's error message (apparently only happening with the silverfast software) is concerning...even if it was from the nikon scanner. it seems you don't have that issue when using vuescan. still, it's great to learn you were able to get past that, but only after setting it on manual focus. does setting it on manual focus slow you down? i would not know how to manually focus a scanner; though it did not sound like it troubled you very much. would it be better to manually focus the whole strip of film at one time...so it won't freeze or -----> come !!!  -----> up !!!  -----> with !!!  some error message? from the end results; it sounds like your getting better scans. at the same time; i hope the learning curve is worth the extra time...regardless of money spent. further thoughts: i wonder if the same issues would crop up if using a different scanner? also; are you scanning b&w or color? i would think color would be a nightmare due to all the different color settings, and types of color film. edited april 17, 2017 by thebarnman", "sortedWord": "None", "Identifyer": null, "identifyer": 101828, "year": "2017"}, {"autor": "plasticman", "date": "2017-04-17 04:28:00", "content": "Plasticman, thanks for the long post. It wasn't that long because it was interestingly filled with great detail. I would agree it's frustrating to have to use two sets of software to end up with low res scans (basically thumbnails,) and fine high resolution scans. The issue with your scanner's error message (apparently only happening with the Silverfast software) is concerning...even if it was from the Nikon scanner. It seems you don't have that issue when using Vuescan. Still, it's great to learn you were able to get past that, but only after setting it on manual focus. Does setting it on manual focus slow you down? I would not know how to manually focus a scanner; though it did not sound like it troubled you very much. Would it be better to manually focus the whole strip of film at one time...so it won't freeze or come up with some error message? From the end results; it sounds like your getting better scans. At the same time; I hope the learning curve is worth the extra time...regardless of money spent. Further thoughts: I wonder if the same issues would crop up if using a different scanner? Also; are you scanning B&W or Color? I would think color would be a nightmare due to all the different color settings, and types of color film. The autofocus is preferable for my workflow, because it takes each image in turn within the batch, and continues without user intervention - I'm a lazy scanning person. I'm unhappy that Silverfast simply stops and then subsequently crashes when it first encounters an autofocus problem - I'd rather it failed gracefully: skipping a frame with an informative error message, and then continuing with other frames, so the user could come back to failed frames afterwards, and manually focus if necessary. Usability isn't a strong point of the software. Incidentally, 95% of my photography is color film (almost always Portra 400 these days). Black-and-white scanning hasn't ever been a problem for Vuescan - the 16-bit monochrome files scan in just 3 or 4 minutes. Anyway, I'm trying to get some perspective on this: currently using a high-end scanner and two separate applications for a workflow that really mostly outputs just family photography... Some aspect of my obsessiveness may be implied from the fact that I started researching the feasibility of writing my own scanning software (my work currently involves writing a totally unrelated iOS application).", "link": "https://www.l-camera-forum.com/topic/257324-the-unthinkable-switching-from-vuescan-to-silverfast/page/3/?tab=comments#comment-3256190", "origin": "L-forum", "suborigin": "257324-the-unthinkable-switching-from-vuescan-to-silverfast", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "plasticman, thanks for the long post. it wasn't that long because it was interestingly filled with great detail. i would agree it's frustrating to have to use two sets of software to end up with low res scans (basically thumbnails,) and fine high resolution scans. the issue with your scanner's error message (apparently only happening with the silverfast software) is concerning...even if it was from the nikon scanner. it seems you don't have that issue when using vuescan. still, it's great to learn you were able to get past that, but only after setting it on manual focus. does setting it on manual focus slow you down? i would not know how to manually focus a scanner; though it did not sound like it troubled you very much. would it be better to manually focus the whole strip of film at one time...so it won't freeze or -----> come !!!  -----> up !!!  -----> with !!!  some error message? from the end results; it sounds like your getting better scans. at the same time; i hope the learning curve is worth the extra time...regardless of money spent. further thoughts: i wonder if the same issues would crop up if using a different scanner? also; are you scanning b&w or color? i would think color would be a nightmare due to all the different color settings, and types of color film. the autofocus is preferable for my workflow, because it takes each image in turn within the batch, and continues without user intervention - i'm a lazy scanning person. i'm unhappy that silverfast simply stops and then subsequently crashes when it first encounters an autofocus problem - i'd rather it failed gracefully: skipping a frame with an informative error message, and then continuing with other frames, so the user could come back to failed frames afterwards, and manually focus if necessary. usability isn't a strong point of the software. incidentally, 95% of my photography is color film (almost always portra 400 these days). black-and-white scanning hasn't ever been a problem for vuescan - the 16-bit monochrome files scan in just 3 or 4 minutes. anyway, i'm trying to get some perspective on this: currently using a high-end scanner and two separate applications for a workflow that really mostly outputs just family photography... some aspect of my obsessiveness may be implied from the fact that i started researching the feasibility of writing my own scanning software (my work currently involves writing a totally unrelated ios application).", "sortedWord": "None", "Identifyer": null, "identifyer": 101830, "year": "2017"}, {"autor": "Guest NEIL-D-WILLIAMS", "date": "2017-08-14 13:27:00", "content": "Or, \"Let me Bing it for you\"? Nah... What did you come up with??", "link": "https://www.l-camera-forum.com/topic/275528-my-new-darkroom-in-phuket-thailand/page/2/?tab=comments#comment-3336675", "origin": "L-forum", "suborigin": "275528-my-new-darkroom-in-phuket-thailand", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "or, \"let me bing it for you\"? nah... what did you -----> come !!!  -----> up !!!  -----> with !!! ??", "sortedWord": "None", "Identifyer": null, "identifyer": 106048, "year": "2017"}, {"autor": "StS", "date": "2017-03-02 05:14:00", "content": "Thanks a lot, John, and very sorry to hear about your hand. Thinking about left-handed photography - maybe a point-and-shoot upside down is an option? If the focusing can be managed, I'm sure everyone would agree about a Hasselblad exception; together with the Rolleiflex TLRs the only cameras I can come up with left-handed shutter release... All the best Stefan", "link": "https://www.l-camera-forum.com/topic/264778-australasian-one-challenge-advance-notice/page/11/?tab=comments#comment-3225048", "origin": "L-forum", "suborigin": "264778-australasian-one-challenge-advance-notice", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "thanks a lot, john, and very sorry to hear about your hand. thinking about left-handed photography - maybe a point-and-shoot upside down is an option? if the focusing can be managed, i'm sure everyone would agree about a hasselblad exception; together -----> with !!!  the rolleiflex tlrs the only cameras i can -----> come !!!  -----> up !!!  -----> with !!!  left-handed shutter release... all the best stefan", "sortedWord": "None", "Identifyer": null, "identifyer": 132255, "year": "2017"}], "name": "Leicasortedout2017with"}