{"interestingcomments": [{"autor": "250swb", "date": "2018-08-25 07:17:00", "content": "But I am wondering why Leica made this decision? I would assume it is because as the older Leica users die off the long held nostalgia for brassing diminishes. There aren't many consumer products where obvious wear is held in esteem, or where the wear is shown as a badge of valour in the field of photography. I would venture to guess that youngsters just don't 'get it'. And for those who can't remember, when Leica reintroduced black paint with the film MP there were far more baffled photographers across the board than the tiny few Leica users defending the black paint. And anyway, with Leica bringing out ultra expensive 'special edition' cameras with a worn finish such as the 'Lenny', it kind of devalues this enterprise if the ordinary grunts can get to do a DIY job.", "link": "https://www.l-camera-forum.com/topic/287719-m10-p-why-not-in-black-paint/?tab=comments#comment-3578971", "origin": "L-forum", "suborigin": "287719-m10-p-why-not-in-black-paint", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "but i am wondering why leica made this decision? i would assume it is because as the older leica users die off the long held nostalgia for brassing diminishes. there aren't many consumer products where obvious wear is held in esteem, or where the wear is shown as a badge of valour in the field of photography. i would venture to guess that youngsters just don't 'get it'. and for those who can't remember, when leica reintroduced black paint with the film mp there were far more baffled photographers across the board than the tiny few leica users defending the black paint. and anyway, with leica bringing out ultra expensive 'special edition' cameras with a worn finish such as the 'lenny', it kind of devalues this enterprise if the ordinary grunts can get to do a -----> diy !!!  job.", "sortedWord": "None", "Identifyer": null, "identifyer": 7613, "year": "2018"}, {"autor": "Kevinfinity", "date": "2018-08-26 19:14:00", "content": "I would assume it is because as the older Leica users die off the long held nostalgia for brassing diminishes. There aren't many consumer products where obvious wear is held in esteem, or where the wear is shown as a badge of valour in the field of photography. I would venture to guess that youngsters just don't 'get it'. And for those who can't remember, when Leica reintroduced black paint with the film MP there were far more baffled photographers across the board than the tiny few Leica users defending the black paint. And anyway, with Leica bringing out ultra expensive 'special edition' cameras with a worn finish such as the 'Lenny', it kind of devalues this enterprise if the ordinary grunts can get to do a DIY job. Thanks for the interesting information provided! It makes sense. I am 26 years old this year. I guess I could be considered as the \"youngsters\"? And I like the black paint Leica since I was 20. Always want to get my hands on an original black paint Leica M3 or M2. But no luck so far... : ( I love my black paint M9 with brassing after serval years of usage. M9P with brassing looks even better. By the way, I really don't like the matte black color of M10/P. I guess some people love the low profile of matte black. I know it's all subjective though. Edited August 26, 2018 by Kevinfinity", "link": "https://www.l-camera-forum.com/topic/287719-m10-p-why-not-in-black-paint/page/2/?tab=comments#comment-3580058", "origin": "L-forum", "suborigin": "287719-m10-p-why-not-in-black-paint", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i would assume it is because as the older leica users die off the long held nostalgia for brassing diminishes. there aren't many consumer products where obvious wear is held in esteem, or where the wear is shown as a badge of valour in the field of photography. i would venture to guess that youngsters just don't 'get it'. and for those who can't remember, when leica reintroduced black paint with the film mp there were far more baffled photographers across the board than the tiny few leica users defending the black paint. and anyway, with leica bringing out ultra expensive 'special edition' cameras with a worn finish such as the 'lenny', it kind of devalues this enterprise if the ordinary grunts can get to do a -----> diy !!!  job. thanks for the interesting information provided! it makes sense. i am 26 years old this year. i guess i could be considered as the \"youngsters\"? and i like the black paint leica since i was 20. always want to get my hands on an original black paint leica m3 or m2. but no luck so far... : ( i love my black paint m9 with brassing after serval years of usage. m9p with brassing looks even better. by the way, i really don't like the matte black color of m10/p. i guess some people love the low profile of matte black. i know it's all subjective though. edited august 26, 2018 by kevinfinity", "sortedWord": "None", "Identifyer": null, "identifyer": 7616, "year": "2018"}, {"autor": "jaapv", "date": "2018-06-04 11:22:00", "content": "I'm not 100% sure, but AFAIK the M9 still has the old method of adjusting vertically, i.e. by removing the red dot, softening the locking compound and adjusting by a special tool; can be bought on eBay for less than 50$ or made in DIY. From the M240 onwards it is a 2 mm hex nut.", "link": "https://www.l-camera-forum.com/topic/278343-m9-adjustment/?tab=comments#comment-3531355", "origin": "L-forum", "suborigin": "278343-m9-adjustment", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i'm not 100% sure, but afaik the m9 still has the old method of adjusting vertically, i.e. by removing the red dot, softening the locking compound and adjusting by a special tool; can be bought on ebay for less than 50$ or made in -----> diy !!! . from the m240 onwards it is a 2 mm hex nut.", "sortedWord": "None", "Identifyer": null, "identifyer": 37638, "year": "2018"}, {"autor": "tobey bilek", "date": "2018-06-08 14:13:00", "content": "Hi, my M9 has drifted a bit out of adjustment. It is definitely the camera - I have several lenses and it focuses short of where the rangefinder is indicating on all of them. I was a bit disappointed when I took it to a well known London dealer and they just took a photo of a distant hoarding and said 'no that's fine.' Is there a good camera mechanic is the south of England who can get it dead right? I don't want to send it on holiday to Wetzlar for a month and in any case I'm not convinced a careless delivery man somewhere between here and Germany couldn't knock it out again as soon as they'd fixed it. I know some people DIY but I would rather use a mechanic. Thanks for any info. John Do not use that dealer. There are two adjustment points on film leicas, infinity and 1 meter which is why 50 mm lenses are all marked at 1 meter. M10 has much better RF.", "link": "https://www.l-camera-forum.com/topic/278343-m9-adjustment/?tab=comments#comment-3533929", "origin": "L-forum", "suborigin": "278343-m9-adjustment", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hi, my m9 has drifted a bit out of adjustment. it is definitely the camera - i have several lenses and it focuses short of where the rangefinder is indicating on all of them. i was a bit disappointed when i took it to a well known london dealer and they just took a photo of a distant hoarding and said 'no that's fine.' is there a good camera mechanic is the south of england who can get it dead right? i don't want to send it on holiday to wetzlar for a month and in any case i'm not convinced a careless delivery man somewhere between here and germany couldn't knock it out again as soon as they'd fixed it. i know some people -----> diy !!!  but i would rather use a mechanic. thanks for any info. john do not use that dealer. there are two adjustment points on film leicas, infinity and 1 meter which is why 50 mm lenses are all marked at 1 meter. m10 has much better rf.", "sortedWord": "None", "Identifyer": null, "identifyer": 37639, "year": "2018"}, {"autor": "jaapv", "date": "2018-03-13 22:04:00", "content": "Slim. Chances are that you will only have to adjust the roller wheel with the hex key. 5-10 minutes even for somebody doing it for the first time. If the vertical is off it is a bit more elaborate but still quite doable in DIY. The third point is a don't touch.", "link": "https://www.l-camera-forum.com/topic/282694-m9-rangefinder-adjustment-near-eindhoven-the-netherlands/?tab=comments#comment-3480274", "origin": "L-forum", "suborigin": "282694-m9-rangefinder-adjustment-near-eindhoven-the-netherlands", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "slim. chances are that you will only have to adjust the roller wheel with the hex key. 5-10 minutes even for somebody doing it for the first time. if the vertical is off it is a bit more elaborate but still quite doable in -----> diy !!! . the third point is a don't touch.", "sortedWord": "None", "Identifyer": null, "identifyer": 38469, "year": "2018"}, {"autor": "Frase", "date": "2018-03-13 22:23:00", "content": " Slim. Chances are that you will only have to adjust the roller wheel with the hex key. 5-10 minutes even for somebody doing it for the first time. If the vertical is off it is a bit more elaborate but still quite doable in DIY. The third point is a don't touch. It takes more than 5-10 minutes even to adjust just close-up, especially on the M9 without live view. 50cm is quite a lot to be out by I've adjusted mine a few times but it was only out by 1cm ish at about 3m-4m. Its not a difficult job just a bit fiddly with a lot of trial and error. good luck", "link": "https://www.l-camera-forum.com/topic/282694-m9-rangefinder-adjustment-near-eindhoven-the-netherlands/?tab=comments#comment-3480284", "origin": "L-forum", "suborigin": "282694-m9-rangefinder-adjustment-near-eindhoven-the-netherlands", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " slim. chances are that you will only have to adjust the roller wheel with the hex key. 5-10 minutes even for somebody doing it for the first time. if the vertical is off it is a bit more elaborate but still quite doable in -----> diy !!! . the third point is a don't touch. it takes more than 5-10 minutes even to adjust just close-up, especially on the m9 without live view. 50cm is quite a lot to be out by i've adjusted mine a few times but it was only out by 1cm ish at about 3m-4m. its not a difficult job just a bit fiddly with a lot of trial and error. good luck", "sortedWord": "None", "Identifyer": null, "identifyer": 38470, "year": "2018"}, {"autor": "pico", "date": "2018-11-07 20:52:00", "content": "My stock V2 Leitz Canada 35mm Summilux works just fine on M9 and M10. BTW, somewhere there are photos showing exactly what part of the shroud must be shaved ~1mm for non-compliant versions. For some of us it is a simple DIY project. Oh, my version did 'drag' a tiny bit upon focusing on the M9. User Washington suggested exercising it, and that worked. Edited November 7, 2018 by pico", "link": "https://www.l-camera-forum.com/topic/288041-35mm-14-summilux-pre-asph/page/5/?tab=comments#comment-3627386", "origin": "L-forum", "suborigin": "288041-35mm-14-summilux-pre-asph", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my stock v2 leitz canada 35mm summilux works just fine on m9 and m10. btw, somewhere there are photos showing exactly what part of the shroud must be shaved ~1mm for non-compliant versions. for some of us it is a simple -----> diy !!!  project. oh, my version did 'drag' a tiny bit upon focusing on the m9. user washington suggested exercising it, and that worked. edited november 7, 2018 by pico", "sortedWord": "None", "Identifyer": null, "identifyer": 11193, "year": "2018"}, {"autor": "luigi bertolotti", "date": "2018-11-19 10:18:00", "content": "On ‎11‎/‎7‎/‎2018 at 8:49 PM, UliWer said: The Wiki of this forum and some postings say that you cannot use a Leitz Canada 35mm Summilux on a digital M without modification by Leica. I think that some of the examples here were taken with Canada versions and I tried one on the M10 - without problems. So, do the Canadian Summiluxes all work instead of the statements, or only some, or do they all need the modification? I think there isn't a general rule… my two Canadians (1.765.850 - chrome and 2.290.126 - black) fit fine on M8 and M240, lacking the protruding back shroud which interferes with body : I think it was a manufacturing component which could or could not be inserted, depending on some final QC test… (Canadian factory introduced \"new manufacturing methodologies…\") ; probably Leica CS still performs the modification on demand… but it can be also a DIY filing job, provided one protects at best the back glass. Edited November 19, 2018 by luigi bertolotti", "link": "https://www.l-camera-forum.com/topic/288041-35mm-14-summilux-pre-asph/page/5/?tab=comments#comment-3633555", "origin": "L-forum", "suborigin": "288041-35mm-14-summilux-pre-asph", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "on ‎11‎/‎7‎/‎2018 at 8:49 pm, uliwer said: the wiki of this forum and some postings say that you cannot use a leitz canada 35mm summilux on a digital m without modification by leica. i think that some of the examples here were taken with canada versions and i tried one on the m10 - without problems. so, do the canadian summiluxes all work instead of the statements, or only some, or do they all need the modification? i think there isn't a general rule… my two canadians (1.765.850 - chrome and 2.290.126 - black) fit fine on m8 and m240, lacking the protruding back shroud which interferes with body : i think it was a manufacturing component which could or could not be inserted, depending on some final qc test… (canadian factory introduced \"new manufacturing methodologies…\") ; probably leica cs still performs the modification on demand… but it can be also a -----> diy !!!  filing job, provided one protects at best the back glass. edited november 19, 2018 by luigi bertolotti", "sortedWord": "None", "Identifyer": null, "identifyer": 11203, "year": "2018"}, {"autor": "gbealnz", "date": "2018-06-24 01:20:00", "content": "can anyone explain what mod is required to mount the 50 on an m-l adapter and on the CL?? can the mod be user done? The rear cell extends too far from the lens proper, it is surplus really. The new 50mm I had contacted the area around but in front of the sensor on my SL, and also TL. The factory knew/know about this and can/will machine off a section of the rear cell, thus allowing it to fit without any contact. Why they just make the lenses standard so they will fit any Leica is beyond me. They state the 35mm doesn't have an issue, it is only the 50mm. DIY?? Yes, I would imagine so, a dremel or some other means of trimming the rear cell. Gary P.S. I swear I saw a picture somewhere on the inter-web, of the rear cell, pre-trimmed, and after-trimmed. I can't find it, but if I do I will post it.", "link": "https://www.l-camera-forum.com/topic/283856-first-7artisans-35mm-f2-lens-review/page/4/?tab=comments#comment-3542653", "origin": "L-forum", "suborigin": "283856-first-7artisans-35mm-f2-lens-review", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "can anyone explain what mod is required to mount the 50 on an m-l adapter and on the cl?? can the mod be user done? the rear cell extends too far from the lens proper, it is surplus really. the new 50mm i had contacted the area around but in front of the sensor on my sl, and also tl. the factory knew/know about this and can/will machine off a section of the rear cell, thus allowing it to fit without any contact. why they just make the lenses standard so they will fit any leica is beyond me. they state the 35mm doesn't have an issue, it is only the 50mm. -----> diy !!! ?? yes, i would imagine so, a dremel or some other means of trimming the rear cell. gary p.s. i swear i saw a picture somewhere on the inter-web, of the rear cell, pre-trimmed, and after-trimmed. i can't find it, but if i do i will post it.", "sortedWord": "None", "Identifyer": null, "identifyer": 12948, "year": "2018"}, {"autor": "pico", "date": "2018-09-01 20:56:00", "content": " DIY as in Do It Yourself? I have no German translation. --img-- ", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/?tab=comments#comment-3584254", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " -----> diy !!!  as in do it yourself? i have no german translation. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 84364, "year": "2018"}, {"autor": "onca", "date": "2018-09-01 21:30:00", "content": "DIY as in Do It Yourself? I have no German translation. --img--  \"selber machen\" --img-- ", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/?tab=comments#comment-3584271", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  as in do it yourself? i have no german translation. --img--  \"selber machen\" --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 84365, "year": "2018"}, {"autor": "jaapv", "date": "2018-09-02 07:59:00", "content": " DIY as in Do It Yourself? I have no German translation. --img--  \"Heimwerken\" or \"basteln\". In the sense you mean I would use \"basteln\". A person indulging in DIY will be called a \"Bastler\"", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/?tab=comments#comment-3584454", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": " -----> diy !!!  as in do it yourself? i have no german translation. --img--  \"heimwerken\" or \"basteln\". in the sense you mean i would use \"basteln\". a person indulging in diy will be called a \"bastler\"", "sortedWord": "None", "Identifyer": null, "identifyer": 84370, "year": "2018"}, {"autor": "M9reno", "date": "2018-09-02 11:10:00", "content": "\"Heimwerken\" or \"basteln\". In the sense you mean I would use \"basteln\". A person indulging in DIY will be called a \"Bastler\" The sub-forum would be called “Inglorious Bastlers”.", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/?tab=comments#comment-3584531", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "\"heimwerken\" or \"basteln\". in the sense you mean i would use \"basteln\". a person indulging in -----> diy !!!  will be called a \"bastler\" the sub-forum would be called “inglorious bastlers”.", "sortedWord": "None", "Identifyer": null, "identifyer": 84373, "year": "2018"}, {"autor": "mikemgb", "date": "2018-09-02 11:33:00", "content": "Good idea as far as I'm ready to learn how to improve or repair the hardware.. and provide it not consists in buying added devices. --img--  DIY jobs always require the purchase of new tools. --img-- ", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/?tab=comments#comment-3584552", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "good idea as far as i'm ready to learn how to improve or repair the hardware.. and provide it not consists in buying added devices. --img--  -----> diy !!!  jobs always require the purchase of new tools. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 84374, "year": "2018"}, {"autor": "mnutzer", "date": "2018-09-02 11:56:00", "content": "DIY jobs always require the purchase of new tools. --img--  Don't forget enough plasters and gauze bandages and of course a good whiskey to disinfect your wounds and calm your mind afterwards. --img--  I know some craftsmen living well payed by completing or fundamentally repairing their customers' semi-finished items. --img-- ", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/?tab=comments#comment-3584567", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  jobs always require the purchase of new tools. --img--  don't forget enough plasters and gauze bandages and of course a good whiskey to disinfect your wounds and calm your mind afterwards. --img--  i know some craftsmen living well payed by completing or fundamentally repairing their customers' semi-finished items. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 84375, "year": "2018"}, {"autor": "papimuzo", "date": "2018-09-02 12:03:00", "content": "DIY jobs always require the purchase of new tools. --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/?tab=comments#comment-3584573", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "-----> diy !!!  jobs always require the purchase of new tools. --img--  --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 84376, "year": "2018"}, {"autor": "onca", "date": "2018-09-02 12:46:00", "content": "Well, in this sense you could translate DIY into the german word \"verschlimmbessern\", which means make it worse afterwards --img-- ", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/?tab=comments#comment-3584608", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "well, in this sense you could translate -----> diy !!!  into the german word \"verschlimmbessern\", which means make it worse afterwards --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 84377, "year": "2018"}, {"autor": "pico", "date": "2018-09-02 15:28:00", "content": "Well, in this sense you could translate DIY into the german word \"verschlimmbessern\", which means make it worse afterwards --img--  Excellent. I appreciate kaputtverbessern because our family knew kaputt from our Canadian grandparents since childhood. (Grandpere was an inventor and craftsman who had little tolerance for things bound to be kaputt at any moment.) Edited September 2, 2018 by pico", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/?tab=comments#comment-3584714", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "well, in this sense you could translate -----> diy !!!  into the german word \"verschlimmbessern\", which means make it worse afterwards --img--  excellent. i appreciate kaputtverbessern because our family knew kaputt from our canadian grandparents since childhood. (grandpere was an inventor and craftsman who had little tolerance for things bound to be kaputt at any moment.) edited september 2, 2018 by pico", "sortedWord": "None", "Identifyer": null, "identifyer": 84378, "year": "2018"}, {"autor": "pico", "date": "2018-09-02 20:38:00", "content": "Okay so far most responses tend towards mocking the proposal. Negative posits have established milestones at the point dividing stuck in the moment and creative thinking. Innovation within a consumer's aspirations coupled with their DIY ability to make things real creates the difference to the better. It is upon you. Live or die with it. Edited September 2, 2018 by pico", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/page/2/?tab=comments#comment-3584894", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "okay so far most responses tend towards mocking the proposal. negative posits have established milestones at the point dividing stuck in the moment and creative thinking. innovation within a consumer's aspirations coupled with their -----> diy !!!  ability to make things real creates the difference to the better. it is upon you. live or die with it. edited september 2, 2018 by pico", "sortedWord": "None", "Identifyer": null, "identifyer": 84385, "year": "2018"}, {"autor": "darylgo", "date": "2018-09-03 10:48:00", "content": "So Pico, what do you have in mind? I can give an example of a don't do this DIY when I pulled apart a 135/4 only to find it extremely baffling to get the proper alignment again. DAG saved the day, he recommended I not try this again. Edited September 3, 2018 by darylgo", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/page/2/?tab=comments#comment-3585195", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "so pico, what do you have in mind? i can give an example of a don't do this -----> diy !!!  when i pulled apart a 135/4 only to find it extremely baffling to get the proper alignment again. dag saved the day, he recommended i not try this again. edited september 3, 2018 by darylgo", "sortedWord": "None", "Identifyer": null, "identifyer": 84387, "year": "2018"}, {"autor": "DaveM3", "date": "2018-10-04 09:21:00", "content": "I think a DIY forum is a great idea. I know from experience that it is becoming very difficult to find camera repairers (and I have used 3 so far) that: a) have a solid reputation (even Leica themselves seem to have a patchy reputation), --img-- /uploads/emoticons/default_cool.png\"> are in the same locality (or country even), --img-- /uploads/emoticons/default_cool.png\"> can do the job quickly and c) at a reasonable price Not everyone is suited to doing their own repairs but there are many who are competent enough and just need a bit of guidance, insight and most importantly correct information regarding what it takes to say repair a shutter or lubricate an M3 etc. I, for one would be prepared to attempt my own maintenance, why not - it's definitely not rocket science. Youtube isn't much help as there is a distinct void of quality video tutorials or even printed info. So, yes let's do it but the big question is: is there anybody here on the forum who can and is prepared to provide detailed, accurate and reliable information? I doubt it myself, but would love to be proven wrong.", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/page/2/?tab=comments#comment-3606050", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i think a -----> diy !!!  forum is a great idea. i know from experience that it is becoming very difficult to find camera repairers (and i have used 3 so far) that: a) have a solid reputation (even leica themselves seem to have a patchy reputation), --img-- /uploads/emoticons/default_cool.png\"> are in the same locality (or country even), --img-- /uploads/emoticons/default_cool.png\"> can do the job quickly and c) at a reasonable price not everyone is suited to doing their own repairs but there are many who are competent enough and just need a bit of guidance, insight and most importantly correct information regarding what it takes to say repair a shutter or lubricate an m3 etc. i, for one would be prepared to attempt my own maintenance, why not - it's definitely not rocket science. youtube isn't much help as there is a distinct void of quality video tutorials or even printed info. so, yes let's do it but the big question is: is there anybody here on the forum who can and is prepared to provide detailed, accurate and reliable information? i doubt it myself, but would love to be proven wrong.", "sortedWord": "None", "Identifyer": null, "identifyer": 84398, "year": "2018"}, {"autor": "Ko.Fe.", "date": "2018-08-30 06:50:00", "content": "I'm from time and place of mostly rangefinders made. So called Russian rangefinders, while many of the are Ukrainian. Actually, most are. I use same rangefinder made in sixties. I could sell film M, once service will become less available. But FED-2 is totally DIY serviceable. I purchased broken one for parts. But fixed it instead. --img-- ", "link": "https://www.l-camera-forum.com/topic/288017-what-drew-you-to-rangefinder-photography/?tab=comments#comment-3582492", "origin": "L-forum", "suborigin": "288017-what-drew-you-to-rangefinder-photography", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "i'm from time and place of mostly rangefinders made. so called russian rangefinders, while many of the are ukrainian. actually, most are. i use same rangefinder made in sixties. i could sell film m, once service will become less available. but fed-2 is totally -----> diy !!!  serviceable. i purchased broken one for parts. but fixed it instead. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 84512, "year": "2018"}, {"autor": "microview", "date": "2018-03-23 20:24:00", "content": "As the rangefinder mechanism is mechanical (surely?) someone like Malcolm Taylor could make that adjustment. (DIY solutions have been posted on the forum but I wouldn't be tempted!) Worth ringing Mayfair on a weekday and ask if Jimmy Hughes is able to do this for you in London.", "link": "https://www.l-camera-forum.com/topic/282761-update-on-uk-repairers/?tab=comments#comment-3486404", "origin": "L-forum", "suborigin": "282761-update-on-uk-repairers", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "as the rangefinder mechanism is mechanical (surely?) someone like malcolm taylor could make that adjustment. (-----> diy !!!  solutions have been posted on the forum but i wouldn't be tempted!) worth ringing mayfair on a weekday and ask if jimmy hughes is able to do this for you in london.", "sortedWord": "None", "Identifyer": null, "identifyer": 84952, "year": "2018"}, {"autor": "Richardgb", "date": "2018-03-23 22:21:00", "content": "As the rangefinder mechanism is mechanical (surely?) someone like Malcolm Taylor could make that adjustment. (DIY solutions have been posted on the forum but I wouldn't be tempted!) Worth ringing Mayfair on a weekday and ask if Jimmy Hughes is able to do this for you in London. Sadly, no, Mayfair refer rangefinder adjustment to Wetzlar. However, I'm in touch with a UK repairer who, although they don't do digital Leica, will look at the rangefinder as it's mechanical. Will keep you posted.", "link": "https://www.l-camera-forum.com/topic/282761-update-on-uk-repairers/?tab=comments#comment-3486460", "origin": "L-forum", "suborigin": "282761-update-on-uk-repairers", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "as the rangefinder mechanism is mechanical (surely?) someone like malcolm taylor could make that adjustment. (-----> diy !!!  solutions have been posted on the forum but i wouldn't be tempted!) worth ringing mayfair on a weekday and ask if jimmy hughes is able to do this for you in london. sadly, no, mayfair refer rangefinder adjustment to wetzlar. however, i'm in touch with a uk repairer who, although they don't do digital leica, will look at the rangefinder as it's mechanical. will keep you posted.", "sortedWord": "None", "Identifyer": null, "identifyer": 84953, "year": "2018"}, {"autor": "masjah", "date": "2018-01-13 08:32:00", "content": "Here in the UK you can buy a \"standard\" size frame very cheaply indeed, but which looks OK, from several major chain stores (either household furnishings or DIY). I used to belong to an exhibition group of amateur photographers that displayed in places such as regional libraries. Surprisingly perhaps, displayed together, they don't look at all cheap and nasty. We too cut our own mattes, so we could tailor whatever size of cropped print we had to the standard 40mm x 50mm frame. The only snag we found was that being a cheap frame, with repeated re-use, the \"tangs\" (or whatever the word is) that you bend in and out to hold the back in place, eventually broke or came loose. This was remedied by one of the group buying a gun from a frame supplier which would insert fresh ones.", "link": "https://www.l-camera-forum.com/topic/280813-looking-for-framing-help/?tab=comments#comment-3438868", "origin": "L-forum", "suborigin": "280813-looking-for-framing-help", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "here in the uk you can buy a \"standard\" size frame very cheaply indeed, but which looks ok, from several major chain stores (either household furnishings or -----> diy !!! ). i used to belong to an exhibition group of amateur photographers that displayed in places such as regional libraries. surprisingly perhaps, displayed together, they don't look at all cheap and nasty. we too cut our own mattes, so we could tailor whatever size of cropped print we had to the standard 40mm x 50mm frame. the only snag we found was that being a cheap frame, with repeated re-use, the \"tangs\" (or whatever the word is) that you bend in and out to hold the back in place, eventually broke or came loose. this was remedied by one of the group buying a gun from a frame supplier which would insert fresh ones.", "sortedWord": "None", "Identifyer": null, "identifyer": 85721, "year": "2018"}, {"autor": "JMF", "date": "2018-04-20 10:43:00", "content": "Interesting thread! Any form of conclusion whether conventional scan (eg with Nikon Coolscan 90000) or camera-reproduction (from a state-of-the-art FF sensor) is prefered/comparable for 35mm positive (slide) film? Hi, since my Nikon Coolscan V \"died\", I have been using my SL to scan slide film - when not using the only remaining local lab - using either a Focotar 50 or a 60 macro Elmarit R with success. Here is an example of Provia 100 ( shot with a Minilux through a plane window ) scanned : --img--  Mexico City by JM__, on Flickr This is not a straight out of scan result. Been scanning 6x6 slides too. I also did my share of DIY adjustments to make the Beeon stand more stable and faster to work with. My 2 cents, JM. Edited April 20, 2018 by JMF", "link": "https://www.l-camera-forum.com/topic/275849-useful-to-shoot-some-slide-film-%E2%80%93-beoonm10/page/9/?tab=comments#comment-3503552", "origin": "L-forum", "suborigin": "275849-useful-to-shoot-some-slide-film-%E2%80%93-beoonm10", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "interesting thread! any form of conclusion whether conventional scan (eg with nikon coolscan 90000) or camera-reproduction (from a state-of-the-art ff sensor) is prefered/comparable for 35mm positive (slide) film? hi, since my nikon coolscan v \"died\", i have been using my sl to scan slide film - when not using the only remaining local lab - using either a focotar 50 or a 60 macro elmarit r with success. here is an example of provia 100 ( shot with a minilux through a plane window ) scanned : --img--  mexico city by jm__, on flickr this is not a straight out of scan result. been scanning 6x6 slides too. i also did my share of -----> diy !!!  adjustments to make the beeon stand more stable and faster to work with. my 2 cents, jm. edited april 20, 2018 by jmf", "sortedWord": "None", "Identifyer": null, "identifyer": 98187, "year": "2018"}, {"autor": "Steve Ricoh", "date": "2018-04-20 21:09:00", "content": "Hi, since my Nikon Coolscan V \"died\", I have been using my SL to scan slide film - when not using the only remaining local lab - using either a Focotar 50 or a 60 macro Elmarit R with success. ...I also did my share of DIY adjustments to make the Beeon stand more stable and faster to work with. My 2 cents, JM. JM, I would be interested to know how you've modified the BEOON for stability and for speed of work, if you don't mind sharing this info. Cheers!", "link": "https://www.l-camera-forum.com/topic/275849-useful-to-shoot-some-slide-film-%E2%80%93-beoonm10/page/9/?tab=comments#comment-3503893", "origin": "L-forum", "suborigin": "275849-useful-to-shoot-some-slide-film-%E2%80%93-beoonm10", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "hi, since my nikon coolscan v \"died\", i have been using my sl to scan slide film - when not using the only remaining local lab - using either a focotar 50 or a 60 macro elmarit r with success. ...i also did my share of -----> diy !!!  adjustments to make the beeon stand more stable and faster to work with. my 2 cents, jm. jm, i would be interested to know how you've modified the beoon for stability and for speed of work, if you don't mind sharing this info. cheers!", "sortedWord": "None", "Identifyer": null, "identifyer": 98189, "year": "2018"}, {"autor": "gbealnz", "date": "2018-03-13 21:51:00", "content": "Being into DIY, and tight as, I did what Ole suggested, worked a treat. Mine was with an old 8x10 tray but the bigger the better. Back in the day we had a big tray that had water circulating, which was all well and good, but as soon as you put a recently fixed print into the tank, you really were back to square one. Now I just \"store them up\" and wash the whole lot in one batch. Gary", "link": "https://www.l-camera-forum.com/topic/282687-archival-print-washers-current-options/?tab=comments#comment-3480265", "origin": "L-forum", "suborigin": "282687-archival-print-washers-current-options", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "being into -----> diy !!! , and tight as, i did what ole suggested, worked a treat. mine was with an old 8x10 tray but the bigger the better. back in the day we had a big tray that had water circulating, which was all well and good, but as soon as you put a recently fixed print into the tank, you really were back to square one. now i just \"store them up\" and wash the whole lot in one batch. gary", "sortedWord": "None", "Identifyer": null, "identifyer": 105757, "year": "2018"}, {"autor": "adan", "date": "2018-12-07 06:17:00", "content": "As Exodies says, you have to set your computer screen brightness so its brightest whites are as \"dark\" as a piece of white paper set beside the screen. By dialing down your LCD brightness (in my case with a Mac Cinema display about 50% of full brightness), to edit pictures with daylight coming in the window onto the paper. And, where needed, by adjusting your ambient light on the paper (in your workspace) - open the window blinds, only work in daytime, add some really bright (ideally, daylight-balanced) room lighting for nightime editing/printing, etc. etc. That is the only way to get prints the same brightness as what you see on-screen - make sure you are viewing the picture both on the screen and the print with equal brightnesses. _____________________ As to color spaces, that applies only to the Working Space you choose in Lightroom - Adobe 1998 is the \"preferred\" colo(u)r space for LR or Photoshop and most other picture editing, unless you have a guaranteed reason to use something else. LR Preferences or some other menu item should let you change back from ProPhoto to Adobe 1998. Profiles are similar to - but not identical to - color spaces. So don't mix them up - they do different things. You should have a Profile for your computer screen, built either with Apple's built-in profiling software or with a third-party hardware device. For DIY with Apple's software, see: System Preferences > Displays > Color > Calibrate and go through the steps it asks for to set white point (yellower or bluer - default computer screens tend to be very blue), and gamma (a contrast curve) - and then save that profile with a name (\"Graeme's Profile Dec. 2018\" or some such). The default gamma setting is generally 2.2. The white point depends on various things, including how \"yellow\" your printing paper is. Usually somewhere between D5000 and D5500 K (degrees kelvin - a yellowish sunlight color). (BTW - I am selling $1000 worth of prints per month using the \"close to useless\" built-in Mac calibration software. And the prints match the screen exactly (despite the limitations of printing pigments vs. glowing screen pixels)). You should set up your Epson and LR printing controls/dialogue boxes so that 1) \"Printer Color Management\" is turned OFF (the printer sits down and shuts up, and lets LR have full control of the color data to print) and 2) then set up your LR printing preferences so that it can - in fact - accurately use that control. \"Lightroom Manages Color\" - ON. That includes choosing a Printer/Paper Profile (and there should be a ton of Epson paper profiles already installed - they came with your Epson P600 software): E.G. - \"SC P600 Series Premium Photo Paper Glossy.\" NB - for the most part, most photo inkjet papers (Luster, various Glossies, glossy Canvas) will work the same with that Premium Glossy profile. I mix-and-match Fiber Gloss, Premium Glossy, Premium Luster, from either Epson or Moab - and the prints all look the same. It is only if you are using matte papers that the profiles may get really different for each paper type and brand. (You can get third-party hardware/software to create your own paper profiles, but Epson's canned profiles are quite good. Other paper makers (Moab, Kodak, Hahnemühle, Ilford inkjet.....) usually have profiles for their own papers available online for free download.) And choosing a Rendering Intent - by default, \"Relative Colorimetric\" is preferred, with \"Perceptual\" as a secondary choice. Complex to explain the exact difference, which practically speaking is very little except with strongly-saturated colors. And turning on/off Black Point Compensation - usually ON is best to keep the shadows open and with maximum detail. My own settings for PhotoShop (LR's big brother) on a Mac Pro and Cinema display - Working Color Space: Adobe RGB 1998 - Display profile: custom-built with Apple's software, for gamma 2.2, white point D5400. Display brightness adjusted by hand, as Exodies says, to match \"screen white\" to \"paper white\" - usually that is 50-60% of the maximum brightness the Mac display can produce. - Printing dialogue box settings: \"Photoshop Manages Color,\" \"SC-P800 series Exhibition Fiber Glossy\" paper profile, \"Relative Colorimetric\" rendering intent, \"Black Point Compensation\" - ON. In Epson's own control panel (accessed from the PS Print Dialogue via the tab \"Print Settings\") the only thing I set is the basic paper type, to control which black ink gets used (photo or matte): \"Printer Settings - Photo Paper.\"", "link": "https://www.l-camera-forum.com/topic/292089-colour-profiles/?tab=comments#comment-3643226", "origin": "L-forum", "suborigin": "292089-colour-profiles", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "as exodies says, you have to set your computer screen brightness so its brightest whites are as \"dark\" as a piece of white paper set beside the screen. by dialing down your lcd brightness (in my case with a mac cinema display about 50% of full brightness), to edit pictures with daylight coming in the window onto the paper. and, where needed, by adjusting your ambient light on the paper (in your workspace) - open the window blinds, only work in daytime, add some really bright (ideally, daylight-balanced) room lighting for nightime editing/printing, etc. etc. that is the only way to get prints the same brightness as what you see on-screen - make sure you are viewing the picture both on the screen and the print with equal brightnesses. _____________________ as to color spaces, that applies only to the working space you choose in lightroom - adobe 1998 is the \"preferred\" colo(u)r space for lr or photoshop and most other picture editing, unless you have a guaranteed reason to use something else. lr preferences or some other menu item should let you change back from prophoto to adobe 1998. profiles are similar to - but not identical to - color spaces. so don't mix them up - they do different things. you should have a profile for your computer screen, built either with apple's built-in profiling software or with a third-party hardware device. for -----> diy !!!  with apple's software, see: system preferences > displays > color > calibrate and go through the steps it asks for to set white point (yellower or bluer - default computer screens tend to be very blue), and gamma (a contrast curve) - and then save that profile with a name (\"graeme's profile dec. 2018\" or some such). the default gamma setting is generally 2.2. the white point depends on various things, including how \"yellow\" your printing paper is. usually somewhere between d5000 and d5500 k (degrees kelvin - a yellowish sunlight color). (btw - i am selling $1000 worth of prints per month using the \"close to useless\" built-in mac calibration software. and the prints match the screen exactly (despite the limitations of printing pigments vs. glowing screen pixels)). you should set up your epson and lr printing controls/dialogue boxes so that 1) \"printer color management\" is turned off (the printer sits down and shuts up, and lets lr have full control of the color data to print) and 2) then set up your lr printing preferences so that it can - in fact - accurately use that control. \"lightroom manages color\" - on. that includes choosing a printer/paper profile (and there should be a ton of epson paper profiles already installed - they came with your epson p600 software): e.g. - \"sc p600 series premium photo paper glossy.\" nb - for the most part, most photo inkjet papers (luster, various glossies, glossy canvas) will work the same with that premium glossy profile. i mix-and-match fiber gloss, premium glossy, premium luster, from either epson or moab - and the prints all look the same. it is only if you are using matte papers that the profiles may get really different for each paper type and brand. (you can get third-party hardware/software to create your own paper profiles, but epson's canned profiles are quite good. other paper makers (moab, kodak, hahnemühle, ilford inkjet.....) usually have profiles for their own papers available online for free download.) and choosing a rendering intent - by default, \"relative colorimetric\" is preferred, with \"perceptual\" as a secondary choice. complex to explain the exact difference, which practically speaking is very little except with strongly-saturated colors. and turning on/off black point compensation - usually on is best to keep the shadows open and with maximum detail. my own settings for photoshop (lr's big brother) on a mac pro and cinema display - working color space: adobe rgb 1998 - display profile: custom-built with apple's software, for gamma 2.2, white point d5400. display brightness adjusted by hand, as exodies says, to match \"screen white\" to \"paper white\" - usually that is 50-60% of the maximum brightness the mac display can produce. - printing dialogue box settings: \"photoshop manages color,\" \"sc-p800 series exhibition fiber glossy\" paper profile, \"relative colorimetric\" rendering intent, \"black point compensation\" - on. in epson's own control panel (accessed from the ps print dialogue via the tab \"print settings\") the only thing i set is the basic paper type, to control which black ink gets used (photo or matte): \"printer settings - photo paper.\"", "sortedWord": "None", "Identifyer": null, "identifyer": 113522, "year": "2018"}, {"autor": "dkCambridgeshire", "date": "2018-05-14 23:23:00", "content": " A friend's D-Lux 109 with a sticky/hesitant zoom control was so slow to zoom that composition was tedious and shots were missed. An SOS Email to Leica Mayfair remains unanswered. Today we decided to try a DIY remedy. I asked my friend if he had any switch cleaning lubricant and he produced a can of SERVISOL. I squirted a small amount into an egg cup, dipped in a Q tip, and wiped it around the hairline gap between the zoom control lever and the camera top plate … ensuring that the Servisol worked its way into the gap … and then worked the zoom control lever back and forth and wiped off the excess. VOILA!! Problem solved … zoom control now works perfectly and positively and with no hesitancy. If you try this, it's at your own risk. I used a tiny amount of Servisol and did not apply it to the camera directly from the aerosol can. dunk Edited May 14, 2018 by dkCambridgeshire", "link": "https://www.l-camera-forum.com/topic/284600-d-lux-109-%E2%80%A6-stickyhesitant-zoom-control/?tab=comments#comment-3518809", "origin": "L-forum", "suborigin": "284600-d-lux-109-%E2%80%A6-stickyhesitant-zoom-control", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "today we decided to try a diy -----> remedy !!! .", "sortedWord": "remedy", "Identifyer": null, "identifyer": 18050, "year": "2018"}, {"autor": "earleygallery", "date": "2018-07-30 19:36:00", "content": "I’m a big fan of the R3 and had one of the last new ones which recently developed a shutter fault. They’re not unreliable but some suffer from electrical faults which cannot be easily repaired now. Use that first roll to try some shots at 1/1000th and also use both auto metering modes to check it's all working correctly. The foam light seals on the film door and indicator window may also need replacing which is simple to DIY.", "link": "https://www.l-camera-forum.com/topic/287032-leica-r/?tab=comments#comment-3564197", "origin": "L-forum", "suborigin": "287032-leica-r", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "the foam light seals on the -----> film !!!  door and indicator window may also need replacing which is simple to diy.", "sortedWord": "film", "Identifyer": null, "identifyer": 23521, "year": "2018"}, {"autor": "wildlightphoto", "date": "2018-09-18 19:57:00", "content": "My DIY contributions would include how I re-assembled my 280/4 APO so that the diaphragm would work properly after it returned from Leica's \"service\".After a 4-month service turnaround I was not going to send it back for this repair. I should mention that they were kind enough to FedEx a replacement for the missing lens cap.", "link": "https://www.l-camera-forum.com/topic/288154-could-we-have-a-diy-forum/page/2/?tab=comments#comment-3595483", "origin": "L-forum", "suborigin": "288154-could-we-have-a-diy-forum", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "my diy contributions would include how i re-assembled my 280/4 apo so that the diaphragm would work properly after it returned from leica's \"service\".after a 4-month service turnaround i was not going to send it back for this -----> repair !!! .", "sortedWord": "repair", "Identifyer": null, "identifyer": 84394, "year": "2018"}], "name": "Leicasortedout2018diy"}