{"interestingcomments": [{"autor": "LeicaR10", "date": "2020-08-11 02:24:00", "content": "Dsalamena, To answer your question in your post #87, the M10 and M10-R color are very similar but not identical. At lower ISO the M10 files are cleaner for noise. But for resolution and at higher ISO the M10-R is better. If you consistently make large prints, consider the M10-R, if not, the M10 works just fine. If you want a excellent review comparison for the M10 and M10-R cameras, I recommend you subscribe to Reid Reviews and you can make an informed decision vs taking my word for it. Both cameras are superb, I create very large prints for my clients and therefore need the M10-R. Before that, the M10-P worked almost as well for me. Hope this helps. r/ Mark Edited August 11, 2020 by LeicaR10", "link": "https://www.l-camera-forum.com/topic/314837-m-10-r-image-thread/page/5/?tab=comments#comment-4025063", "origin": "L-forum", "suborigin": "314837-m-10-r-image-thread", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "dsalamena, to answer your question in your post #87, the m10 and m10-r color are very similar but not identical. at lower iso the m10 files are cleaner for noise. but for resolution and at higher iso the m10-r is better. if you consistently make large prints, consider the m10-r, if not, the m10 works just fine. if you want a excellent review comparison for the m10 and m10-r cameras, i recommend you subscribe to reid reviews and you can make an informed decision vs taking my word for it. both cameras are superb, -----> i !!!  -----> create !!!  very large prints for my clients and therefore need the m10-r. before that, the m10-p worked almost as well for me. hope this helps. r/ mark edited august 11, 2020 by leicar10", "sortedWord": "None", "Identifyer": null, "identifyer": 99488, "year": "2020"}, {"autor": "stevegaskin", "date": "2020-01-22 11:33:00", "content": "Quote I was a little concerned that when I'm out on the street that my cola bottle might be identified and become a talking point or even a target, so I've created this lovely black discreet logo. I kept the release button red for aesthetic purposes and ease of use --img-- 😂😂", "link": "https://www.l-camera-forum.com/topic/269215-black-logo-for-m10/page/2/?tab=comments#comment-3896843", "origin": "L-forum", "suborigin": "269215-black-logo-for-m10", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "quote -----> i !!!  was a little concerned that when -----> i !!! 'm out on the street that my cola bottle might be identified and become a talking point or even a target, so -----> i !!! 've -----> created !!!  this lovely black discreet logo. i kept the release button red for aesthetic purposes and ease of use --img-- 😂😂", "sortedWord": "None", "Identifyer": null, "identifyer": 8761, "year": "2020"}, {"autor": "Jeff S", "date": "2020-10-29 00:58:00", "content": "3 minutes ago, Tom1234 said: I detect 24 meg aesthetic love… as the m10 can not be abandoned to the used market. Not GAS (gear acquisition syndrome). The oldest camera a person can not let go of… is it not loved? I can not bring myself to sell my M7's so I must love film and this is true… actions reveal inner motives. Your problems. Nothing at all to do with my decisions or opinions. I have no sentimental attachment to gear, and have never had a problem buying or selling. Tools for a task. I gave up film after 40 years when I decided not to build a fifth darkroom after another house move. I gave up large format when I got too old to haul the gear. Again, I create the aesthetic, regardless of MP. The SL2 is fabulous at 47MP; the MM likewise at 18, and I chose the latter primarily for the unique b/w workflow experience. Please speak for yourself. Your premise holds no water for me. Jeff", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/7/?tab=comments#comment-4070105", "origin": "L-forum", "suborigin": "314500-24meg-verses-40meg-aesthetic", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "3 minutes ago, tom1234 said: i detect 24 meg aesthetic love… as the m10 can not be abandoned to the used market. not gas (gear acquisition syndrome). the oldest camera a person can not let go of… is it not loved? i can not bring myself to sell my m7's so i must love film and this is true… actions reveal inner motives. your problems. nothing at all to do with my decisions or opinions. i have no sentimental attachment to gear, and have never had a problem buying or selling. tools for a task. i gave up film after 40 years when i decided not to build a fifth darkroom after another house move. i gave up large format when i got too old to haul the gear. again, -----> i !!!  -----> create !!!  the aesthetic, regardless of mp. the sl2 is fabulous at 47mp; the mm likewise at 18, and i chose the latter primarily for the unique b/w workflow experience. please speak for yourself. your premise holds no water for me. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 9018, "year": "2020"}, {"autor": "Tom1234", "date": "2020-10-29 01:08:00", "content": "7 minutes ago, Jeff S said: Your problems. Nothing at all to do with my decisions or opinions. I have no sentimental attachment to gear, and have never had a problem buying or selling. Tools for a task. I gave up film after 40 years when I decided not to build a fifth darkroom after another house move. I gave up large format when I got too old to haul the gear. Again, I create the aesthetic, regardless of MP. The SL2 is fabulous at 47MP; the MM likewise at 18, and I chose the latter primarily for the unique b/w workflow experience. Please speak for yourself. Your premise holds no water for me. Jeff Sorry. I am not trying to define you. Go ahead define yourself. Still you must at least like the m10 aesthetic to keep it. And how you use that to create your own aesthetic is of course your own affair.", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/7/?tab=comments#comment-4070109", "origin": "L-forum", "suborigin": "314500-24meg-verses-40meg-aesthetic", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "7 minutes ago, jeff s said: your problems. nothing at all to do with my decisions or opinions. i have no sentimental attachment to gear, and have never had a problem buying or selling. tools for a task. i gave up film after 40 years when i decided not to build a fifth darkroom after another house move. i gave up large format when i got too old to haul the gear. again, -----> i !!!  -----> create !!!  the aesthetic, regardless of mp. the sl2 is fabulous at 47mp; the mm likewise at 18, and i chose the latter primarily for the unique b/w workflow experience. please speak for yourself. your premise holds no water for me. jeff sorry. i am not trying to define you. go ahead define yourself. still you must at least like the m10 aesthetic to keep it. and how you use that to create your own aesthetic is of course your own affair.", "sortedWord": "None", "Identifyer": null, "identifyer": 9019, "year": "2020"}, {"autor": "Tom1234", "date": "2020-10-30 07:23:00", "content": "9 hours ago, Steven said: Following up to the request of @Raymondl, and to satisfy myself as well, I continued my unscientific, real life comparison of the Sony A7SIII’s 12MP sensor, and the 24MP sensor from the M10P. This is time, instead of using my Sumilux 35 ASPH pre FLE, I decided to go with the Nokton 35 1.4 MC vII. I chose this lens because it has a more vintage classic look, IMO, and I wanted to see if we could lose that character with a very modern camera like the Sony if it would render as nicely. All photos where shot in raw, about 20 secs apart from each other. They are not always exactly the same cause I did it handheld. I wish I had more people, and in general more interesting stuff but France just got under lock down again so I had to do it all at home. My kids and my dog move too fast for lens change, and my wife has stopped accepting to be the subject of these camera tests long ago. The photos are all very very boring, but the point of this test was just to compare the cameras in different scenarios. A note on shooting with both camera: On the M10P , it was actually easier to focus with the RF than with the Focus peaking on the Sony, even if the Sony is nice. The metering on the A7SIII outperforms the M10P almost every time, even though I used the M10P in live mode to avoid spot metering. I did the blind test to myself, and to be honest I could not always guess which camera was which. But almost every time I shocked myself and preferred the Sony to the Leica. Of course, shooting wise, the Sony was still disgusting, and the Leica was a total pleasure. But what I remember from this is that 12MP vs 24MP produces no aesthetics difference (since this is what this thread is about). Besides that, of course I prefer my Leica, but if one day I go out to shoot video with my Sony, I know that I could bring my 35 mil with me and still get photos as well. Let me know if you have any interrogation on the way I took the photos, settings, etc.... Now my question to you is not which camera is Sony and which is Leica, but which one did you prefer ? https://drive.google.com/drive/folders/1WClYBcwQb_i2Nw6DHF8-4vHfUtxCPF31?usp=sharing Your pictures have produced some advanced thoughts. The setting is world class beautiful. https://drive.google.com/drive/folders/1WClYBcwQb_i2Nw6DHF8-4vHfUtxCPF31 TECHNICAL COMMENT ON THE TEST: For each two pictures, one picture is usually more sharp than the other. Can not say which I like best. The sharper picture had more of a \"still life\" feel to it. The less sharp more of an atmospheric feel. Which I liked more depended on subject matter. I can not say that I saw the M10 24 meg smoothness verses the M10-R 40 meg light harshness though yet another version of this effect is illustrated in your pictures. Overall I liked the sharper one better because it catches that \"still life\" aesthetic. Yet the sharpness was somewhat of a smooth-sharpness, not with a irritating harsh edge, maybe due to lens choice. Increasingly I see this as important, that if the sensor has the highest level of megabytes, it will be \"sharp\" but it might also produce a pixelation type digital-harsh-edge harshness that is not exactly seen but felt, since that edge harshness is only slightly there out at the highest levels of resolution. The paragraph immediately above is the only explanation I can give for the M10's pictures being more satisfying (somehow less harsh) than the M10-R's. Yet with software the M10-R's rendition might be smoothable to end this lightly irritating harshness and thus create the best still life's (see below Art Comment). So overall I would say that if a person is good with post production software the M10-R might be the better choice. Yet I dislike spending hours in post and prefer the adjustment be selectable in the camera. HIGHER MEG SENSOR HARSHNESS: In the interest of the intellectual study of the arts I will venture an explanation which might be torn down latter. Some will say this 40 meg harshness is just a matter of contrast technically but I would go further and say that it might be the sharp 40 line pairs (80 lines) MTF test-lines of the lens interacting with the inherent digital pixelation harshness of small pixel (40 meg based) digital sensor capture. Thus the 24 meg digital with big pixels and less resolution can not produce this harshness at the higher resolution 80 line mtf test point but the 40 meg can see this fine edge making it rough/harsh where the 24meg sensor misses this fine detail. If the camera software does not soften up this new increased detail a bit then you get a sort of micro edge harshness that 24 meg could not produce. Through your choice (not a mistake) of a less sharp and artistically rendering lens (Voitlander Nokton 35mm1.4), the lens helps make the picture work, softening the digital harshness effect. With a sharper Leica lens directing light to a sharper Leica 40 meg sensor, a harshness might be produced which irritates as seen by we ultra sensitive viewers, and as found in the previous M10 24meg vs M10-R 40meg pictures by we ultra-sensitives (not trolls). As in Formula One racing… the most moneyed race engineers hit the limits of the physics first and see problematic phenomena that create problems to be dealt with. Less moneyed race teams working with known technology do not see these problems. Thus the M10-R 40 meg plus the sharpest of Leica lenses may be producing this harsh line edge which makes M10's softer edge line edge more desirable. Fix it in post as they say (if that is fully possible). The M10 is definitely a standout camera in the history of digital cameras in both how it treats sharpness and color saturation. ART COMMENT: One of the many explanations for the \"still life\" effect is: as the eye looks around it sees something that looks real because of an extremely high level of detail, yet your mind also knows that \"it is not real it is a picture\". This dichotomy is intriguing, to vacillate between the emotional-mental sensation of real and unreal. Again, by using smallest F-stops and high meg sensors and sharpest lenses, placing the ultra high resolution in various places around the scene where the eye would not normally see so much detail, signals the mind that something otherworldly is going on. Again, the emotion is one of \"this is real but it is not real\" which is otherworldly giving an accompanying intrigue. So in Still Life you have at least two intrigues: 1- Picture representation verses reality and 2- The beyond human focus detail verses what your eye-mind is normally encountering in the real world. In the USA some call this aesthetic \"American Realism\" as the ultra high detail of a painter's Still Life \"table top subject\" is applied to \"a scene much larger than a table top\". In the picture your eye sees more detail than it would ever see in real life. All around the frame picture elements \"pop\" into life as their detail is noticed. BACK TO CAMERAS: The ability of the 40 meg sensor to create this Still Life ultra sharpness effect, means I would favor the sharper higher meg picture if the harshness can be lessoned by some de-sharpening. Also maybe software can soften the 40 meg picture down to the more atmospheric softer focus effect of the 24 meg? Fixing in post production software to me frequently creates a picture that looks way too extreme, artificial, and childish like advertising shock techniques so I would rather the camera produce a satisfying rendition in a more eye-natural manner. I do not want to spend hours playing with software sliders that mainly result in an unrealistic looking \"mechanical\" picture. Do I have the time or interest in trying to make the two cameras match one another in post... probably not. I will leave this for people like the great Overgaard. Still can he make one camera perform like two cameras... it is too much to ask. If not or with a little changing of the picture in post... two cameras sit out there on the market with unique and justifiable existences. The artsy 24 meg soft sharpness camera M10 and the 40 meg M10-R with an edge hardness that can likely be lessoned in software to produce a fascinating Still Life ultra high resolution rendition. One website I read comments that the M10-R's 40 megs helps see the original rendition of older Leica lenses (Steve Huff's site). To me this is a holy grail for camera bodies - to bring out the old Leica lens characteristics. I find it odd that people want their lenses \"corrected\" by software. Clearly they have missed the concept of \"art\" as a \"partially real and part modified\" representation of reality. IF I MADE DECISIONS FOR THE LEICA COMPANY: I would NOT only let the time and attention of the marketplace decide the popularity of my camera and aesthetic. I would also produce download instructions for manually entered adjustments for the different aesthetics and also produce template files where possible. Why let 3rd parties decide your economic survival? Why leave the user in the dark without the knowledge to fully use the camera? Yet best would be a checkbox in the camera's menu software that would produce the 24meg softer aesthetic or the 40 meg sharper still life aesthetic. Thanks for the picture test Steve... you got me thinking.", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/9/?tab=comments#comment-4070680", "origin": "L-forum", "suborigin": "314500-24meg-verses-40meg-aesthetic", "result": true, "Selector": "me frequently creates", "selectorShort": "create", "MarkedSent": "9 hours ago, steven said: following up to the request of @raymondl, and to satisfy myself as well, i continued my unscientific, real life comparison of the sony a7siii’s 12mp sensor, and the 24mp sensor from the m10p. this is time, instead of using my sumilux 35 asph pre fle, i decided to go with the nokton 35 1.4 mc vii. i chose this lens because it has a more vintage classic look, imo, and i wanted to see if we could lose that character with a very modern camera like the sony if it would render as nicely. all photos where shot in raw, about 20 secs apart from each other. they are not always exactly the same cause i did it handheld. i wish i had more people, and in general more interesting stuff but france just got under lock down again so i had to do it all at home. my kids and my dog move too fast for lens change, and my wife has stopped accepting to be the subject of these camera tests long ago. the photos are all very very boring, but the point of this test was just to compare the cameras in different scenarios. a note on shooting with both camera: on the m10p , it was actually easier to focus with the rf than with the focus peaking on the sony, even if the sony is nice. the metering on the a7siii outperforms the m10p almost every time, even though i used the m10p in live mode to avoid spot metering. i did the blind test to myself, and to be honest i could not always guess which camera was which. but almost every time i shocked myself and preferred the sony to the leica. of course, shooting wise, the sony was still disgusting, and the leica was a total pleasure. but what i remember from this is that 12mp vs 24mp produces no aesthetics difference (since this is what this thread is about). besides that, of course i prefer my leica, but if one day i go out to shoot video with my sony, i know that i could bring my 35 mil with me and still get photos as well. let me know if you have any interrogation on the way i took the photos, settings, etc.... now my question to you is not which camera is sony and which is leica, but which one did you prefer ? https://drive.google.com/drive/folders/1wclybcwqb_i2nw6dhf8-4vhfutxcpf31?usp=sharing your pictures have produced some advanced thoughts. the setting is world class beautiful. https://drive.google.com/drive/folders/1wclybcwqb_i2nw6dhf8-4vhfutxcpf31 technical comment on the test: for each two pictures, one picture is usually more sharp than the other. can not say which i like best. the sharper picture had more of a \"still life\" feel to it. the less sharp more of an atmospheric feel. which i liked more depended on subject matter. i can not say that i saw the m10 24 meg smoothness verses the m10-r 40 meg light harshness though yet another version of this effect is illustrated in your pictures. overall i liked the sharper one better because it catches that \"still life\" aesthetic. yet the sharpness was somewhat of a smooth-sharpness, not with a irritating harsh edge, maybe due to lens choice. increasingly i see this as important, that if the sensor has the highest level of megabytes, it will be \"sharp\" but it might also produce a pixelation type digital-harsh-edge harshness that is not exactly seen but felt, since that edge harshness is only slightly there out at the highest levels of resolution. the paragraph immediately above is the only explanation i can give for the m10's pictures being more satisfying (somehow less harsh) than the m10-r's. yet with software the m10-r's rendition might be smoothable to end this lightly irritating harshness and thus create the best still life's (see below art comment). so overall i would say that if a person is good with post production software the m10-r might be the better choice. yet i dislike spending hours in post and prefer the adjustment be selectable in the camera. higher meg sensor harshness: in the interest of the intellectual study of the arts i will venture an explanation which might be torn down latter. some will say this 40 meg harshness is just a matter of contrast technically but i would go further and say that it might be the sharp 40 line pairs (80 lines) mtf test-lines of the lens interacting with the inherent digital pixelation harshness of small pixel (40 meg based) digital sensor capture. thus the 24 meg digital with big pixels and less resolution can not produce this harshness at the higher resolution 80 line mtf test point but the 40 meg can see this fine edge making it rough/harsh where the 24meg sensor misses this fine detail. if the camera software does not soften up this new increased detail a bit then you get a sort of micro edge harshness that 24 meg could not produce. through your choice (not a mistake) of a less sharp and artistically rendering lens (voitlander nokton 35mm1.4), the lens helps make the picture work, softening the digital harshness effect. with a sharper leica lens directing light to a sharper leica 40 meg sensor, a harshness might be produced which irritates as seen by we ultra sensitive viewers, and as found in the previous m10 24meg vs m10-r 40meg pictures by we ultra-sensitives (not trolls). as in formula one racing… the most moneyed race engineers hit the limits of the physics first and see problematic phenomena that create problems to be dealt with. less moneyed race teams working with known technology do not see these problems. thus the m10-r 40 meg plus the sharpest of leica lenses may be producing this harsh line edge which makes m10's softer edge line edge more desirable. fix it in post as they say (if that is fully possible). the m10 is definitely a standout camera in the history of digital cameras in both how it treats sharpness and color saturation. art comment: one of the many explanations for the \"still life\" effect is: as the eye looks around it sees something that looks real because of an extremely high level of detail, yet your mind also knows that \"it is not real it is a picture\". this dichotomy is intriguing, to vacillate between the emotional-mental sensation of real and unreal. again, by using smallest f-stops and high meg sensors and sharpest lenses, placing the ultra high resolution in various places around the scene where the eye would not normally see so much detail, signals the mind that something otherworldly is going on. again, the emotion is one of \"this is real but it is not real\" which is otherworldly giving an accompanying intrigue. so in still life you have at least two intrigues: 1- picture representation verses reality and 2- the beyond human focus detail verses what your eye-mind is normally encountering in the real world. in the usa some call this aesthetic \"american realism\" as the ultra high detail of a painter's still life \"table top subject\" is applied to \"a scene much larger than a table top\". in the picture your eye sees more detail than it would ever see in real life. all around the frame picture elements \"pop\" into life as their detail is noticed. back to cameras: the ability of the 40 meg sensor to create this still life ultra sharpness effect, means i would favor the sharper higher meg picture if the harshness can be lessoned by some de-sharpening. also maybe software can soften the 40 meg picture down to the more atmospheric softer focus effect of the 24 meg? fixing in post production software to -----> me !!!  -----> frequently !!!  -----> creates !!!  a picture that looks way too extreme, artificial, and childish like advertising shock techniques so i would rather the camera produce a satisfying rendition in a more eye-natural manner. i do not want to spend hours playing with software sliders that mainly result in an unrealistic looking \"mechanical\" picture. do i have the time or interest in trying to make the two cameras match one another in post... probably not. i will leave this for people like the great overgaard. still can he make one camera perform like two cameras... it is too much to ask. if not or with a little changing of the picture in post... two cameras sit out there on the market with unique and justifiable existences. the artsy 24 meg soft sharpness camera m10 and the 40 meg m10-r with an edge hardness that can likely be lessoned in software to produce a fascinating still life ultra high resolution rendition. one website i read comments that the m10-r's 40 megs helps see the original rendition of older leica lenses (steve huff's site). to me this is a holy grail for camera bodies - to bring out the old leica lens characteristics. i find it odd that people want their lenses \"corrected\" by software. clearly they have missed the concept of \"art\" as a \"partially real and part modified\" representation of reality. if i made decisions for the leica company: i would not only let the time and attention of the marketplace decide the popularity of my camera and aesthetic. i would also produce download instructions for manually entered adjustments for the different aesthetics and also produce template files where possible. why let 3rd parties decide your economic survival? why leave the user in the dark without the knowledge to fully use the camera? yet best would be a checkbox in the camera's menu software that would produce the 24meg softer aesthetic or the 40 meg sharper still life aesthetic. thanks for the picture test steve... you got me thinking.", "sortedWord": "None", "Identifyer": null, "identifyer": 9059, "year": "2020"}, {"autor": "Steven", "date": "2020-10-30 07:50:00", "content": "23 minutes ago, Tom1234 said: Your pictures have produced some advanced thoughts. The setting is world class beautiful. https://drive.google.com/drive/folders/1WClYBcwQb_i2Nw6DHF8-4vHfUtxCPF31 TECHNICAL COMMENT ON THE TEST: For each two pictures, one picture is usually more sharp than the other. Can not say which I like best. The sharper picture had more of a \"still life\" feel to it. The less sharp more of an atmospheric feel. Which I liked more depended on subject matter. I can not say that I saw the M10 24 meg smoothness verses the M10-R 40 meg light harshness though yet another version of this effect is illustrated in your pictures. Overall I liked the sharper one better because it catches that \"still life\" aesthetic. Yet the sharpness was somewhat of a smooth-sharpness, not with a irritating harsh edge, maybe due to lens choice. Increasingly I see this as important, that if the sensor has the highest level of megabytes, it will be \"sharp\" but it might also produce a pixelation type digital-harsh-edge harshness that is not exactly seen but felt, since that edge harshness is only slightly there out at the highest levels of resolution. The paragraph immediately above is the only explanation I can give for the M10's pictures being more satisfying (somehow less harsh) than the M10-R's. Yet with software the M10-R's rendition might be smoothable to end this lightly irritating harshness and thus create the best still life's (see below Art Comment). So overall I would say that if a person is good with post production software the M10-R might be the better choice. Yet I dislike spending hours in post and prefer the adjustment be selectable in the camera. HIGHER MEG SENSOR HARSHNESS: In the interest of the intellectual study of the arts I will venture an explanation which might be torn down latter. Some will say this 40 meg harshness is just a matter of contrast technically but I would go further and say that it might be the sharp 40 line pairs (80 lines) MTF test-lines of the lens interacting with the inherent digital pixelation harshness of small pixel (40 meg based) digital sensor capture. Thus the 24 meg digital with big pixels and less resolution can not produce this harshness at the higher resolution 80 line mtf test point but the 40 meg can see this fine edge making it rough/harsh where the 24meg sensor misses this fine detail. If the camera software does not soften up this new increased detail a bit then you get a sort of micro edge harshness that 24 meg could not produce. Through your choice (not a mistake) of a less sharp and artistically rendering lens (Voitlander Nokton 35mm1.4), the lens helps make the picture work, softening the digital harshness effect. With a sharper Leica lens directing light to a sharper Leica 40 meg sensor, a harshness might be produced which irritates as seen by we ultra sensitive viewers, and as found in the previous M10 24meg vs M10-R 40meg pictures by we ultra-sensitives (not trolls). As in Formula One racing… the most moneyed race engineers hit the limits of the physics first and see problematic phenomena that create problems to be dealt with. Less moneyed race teams working with known technology do not see these problems. Thus the M10-R 40 meg plus the sharpest of Leica lenses may be producing this harsh line edge which makes M10's softer edge line edge more desirable. Fix it in post as they say (if that is fully possible). The M10 is definitely a standout camera in the history of digital cameras in both how it treats sharpness and color saturation. ART COMMENT: One of the many explanations for the \"still life\" effect is: as the eye looks around it sees something that looks real because of an extremely high level of detail, yet your mind also knows that \"it is not real it is a picture\". This dichotomy is intriguing, to vacillate between the emotional-mental sensation of real and unreal. Again, by using smallest F-stops and high meg sensors and sharpest lenses, placing the ultra high resolution in various places around the scene where the eye would not normally see so much detail, signals the mind that something otherworldly is going on. Again, the emotion is one of \"this is real but it is not real\" which is otherworldly giving an accompanying intrigue. So in Still Life you have at least two intrigues: 1- Picture representation verses reality and 2- The beyond human focus detail verses what your eye-mind is normally encountering in the real world. In the USA some call this aesthetic \"American Realism\" as the ultra high detail of a painter's Still Life \"table top subject\" is applied to \"a scene much larger than a table top\". In the picture your eye sees more detail than it would ever see in real life. All around the frame picture elements \"pop\" into life as their detail is noticed. BACK TO CAMERAS: The ability of the 40 meg sensor to create this Still Life ultra sharpness effect, means I would favor the sharper higher meg picture if the harshness can be lessoned by some de-sharpening. Also maybe software can soften the 40 meg picture down to the more atmospheric softer focus effect of the 24 meg? Fixing in post production software to me frequently creates a picture that looks way too extreme, artificial, and childish like advertising shock techniques so I would rather the camera produce a satisfying rendition in a more eye-natural manner. I do not want to spend hours playing with software sliders that mainly result in an unrealistic looking \"mechanical\" picture. Do I have the time or interest in trying to make the two cameras match one another in post... probably not. I will leave this for people like the great Overgaard. Still can he make one camera perform like two cameras... it is too much to ask. If not or with a little changing of the picture in post... two cameras sit out there on the market with unique and justifiable existences. The artsy 24 meg soft sharpness camera M10 and the 40 meg M10-R with an edge hardness that can likely be lessoned in software to produce a fascinating Still Life ultra high resolution rendition. One website I read comments that the M10-R's 40 megs helps see the original rendition of older Leica lenses (Steve Huff's site). To me this is a holy grail for camera bodies - to bring out the old Leica lens characteristics. I find it odd that people want their lenses \"corrected\" by software. Clearly they have missed the concept of \"art\" as a \"partially real and part modified\" representation of reality. IF I MADE DECISIONS FOR THE LEICA COMPANY: I would NOT only let the time and attention of the marketplace decide the popularity of my camera and aesthetic. I would also produce download instructions for manually entered adjustments for the different aesthetics and also produce template files where possible. Why let 3rd parties decide your economic survival? Why leave the user in the dark without the knowledge to fully use the camera? Yet best would be a checkbox in the camera's menu software that would produce the 24meg softer aesthetic or the 40 meg sharper still life aesthetic. Thanks for the picture test Steve... you got me thinking. Brilliant post Tom. I enjoyed reading through it very much, and a lot of your points have left me thinking. But before I can make my mind too, I must ask you something. You mention that one series of the photos I took in the test looks sharper, more still life. Could you tell me if it’s series A or series B? I want to see if your feel is based on actual MP count, or if other factors could have influenced it, for example maybe better DR of the M10R/A7S3 sensors ..... in any case, some people said before they this thread was useless. Your post proved it isn’t. At least not for everyone, not for me... I enjoy this conversation. cheers", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/9/?tab=comments#comment-4070696", "origin": "L-forum", "suborigin": "314500-24meg-verses-40meg-aesthetic", "result": true, "Selector": "me frequently creates", "selectorShort": "create", "MarkedSent": "23 minutes ago, tom1234 said: your pictures have produced some advanced thoughts. the setting is world class beautiful. https://drive.google.com/drive/folders/1wclybcwqb_i2nw6dhf8-4vhfutxcpf31 technical comment on the test: for each two pictures, one picture is usually more sharp than the other. can not say which i like best. the sharper picture had more of a \"still life\" feel to it. the less sharp more of an atmospheric feel. which i liked more depended on subject matter. i can not say that i saw the m10 24 meg smoothness verses the m10-r 40 meg light harshness though yet another version of this effect is illustrated in your pictures. overall i liked the sharper one better because it catches that \"still life\" aesthetic. yet the sharpness was somewhat of a smooth-sharpness, not with a irritating harsh edge, maybe due to lens choice. increasingly i see this as important, that if the sensor has the highest level of megabytes, it will be \"sharp\" but it might also produce a pixelation type digital-harsh-edge harshness that is not exactly seen but felt, since that edge harshness is only slightly there out at the highest levels of resolution. the paragraph immediately above is the only explanation i can give for the m10's pictures being more satisfying (somehow less harsh) than the m10-r's. yet with software the m10-r's rendition might be smoothable to end this lightly irritating harshness and thus create the best still life's (see below art comment). so overall i would say that if a person is good with post production software the m10-r might be the better choice. yet i dislike spending hours in post and prefer the adjustment be selectable in the camera. higher meg sensor harshness: in the interest of the intellectual study of the arts i will venture an explanation which might be torn down latter. some will say this 40 meg harshness is just a matter of contrast technically but i would go further and say that it might be the sharp 40 line pairs (80 lines) mtf test-lines of the lens interacting with the inherent digital pixelation harshness of small pixel (40 meg based) digital sensor capture. thus the 24 meg digital with big pixels and less resolution can not produce this harshness at the higher resolution 80 line mtf test point but the 40 meg can see this fine edge making it rough/harsh where the 24meg sensor misses this fine detail. if the camera software does not soften up this new increased detail a bit then you get a sort of micro edge harshness that 24 meg could not produce. through your choice (not a mistake) of a less sharp and artistically rendering lens (voitlander nokton 35mm1.4), the lens helps make the picture work, softening the digital harshness effect. with a sharper leica lens directing light to a sharper leica 40 meg sensor, a harshness might be produced which irritates as seen by we ultra sensitive viewers, and as found in the previous m10 24meg vs m10-r 40meg pictures by we ultra-sensitives (not trolls). as in formula one racing… the most moneyed race engineers hit the limits of the physics first and see problematic phenomena that create problems to be dealt with. less moneyed race teams working with known technology do not see these problems. thus the m10-r 40 meg plus the sharpest of leica lenses may be producing this harsh line edge which makes m10's softer edge line edge more desirable. fix it in post as they say (if that is fully possible). the m10 is definitely a standout camera in the history of digital cameras in both how it treats sharpness and color saturation. art comment: one of the many explanations for the \"still life\" effect is: as the eye looks around it sees something that looks real because of an extremely high level of detail, yet your mind also knows that \"it is not real it is a picture\". this dichotomy is intriguing, to vacillate between the emotional-mental sensation of real and unreal. again, by using smallest f-stops and high meg sensors and sharpest lenses, placing the ultra high resolution in various places around the scene where the eye would not normally see so much detail, signals the mind that something otherworldly is going on. again, the emotion is one of \"this is real but it is not real\" which is otherworldly giving an accompanying intrigue. so in still life you have at least two intrigues: 1- picture representation verses reality and 2- the beyond human focus detail verses what your eye-mind is normally encountering in the real world. in the usa some call this aesthetic \"american realism\" as the ultra high detail of a painter's still life \"table top subject\" is applied to \"a scene much larger than a table top\". in the picture your eye sees more detail than it would ever see in real life. all around the frame picture elements \"pop\" into life as their detail is noticed. back to cameras: the ability of the 40 meg sensor to create this still life ultra sharpness effect, means i would favor the sharper higher meg picture if the harshness can be lessoned by some de-sharpening. also maybe software can soften the 40 meg picture down to the more atmospheric softer focus effect of the 24 meg? fixing in post production software to -----> me !!!  -----> frequently !!!  -----> creates !!!  a picture that looks way too extreme, artificial, and childish like advertising shock techniques so i would rather the camera produce a satisfying rendition in a more eye-natural manner. i do not want to spend hours playing with software sliders that mainly result in an unrealistic looking \"mechanical\" picture. do i have the time or interest in trying to make the two cameras match one another in post... probably not. i will leave this for people like the great overgaard. still can he make one camera perform like two cameras... it is too much to ask. if not or with a little changing of the picture in post... two cameras sit out there on the market with unique and justifiable existences. the artsy 24 meg soft sharpness camera m10 and the 40 meg m10-r with an edge hardness that can likely be lessoned in software to produce a fascinating still life ultra high resolution rendition. one website i read comments that the m10-r's 40 megs helps see the original rendition of older leica lenses (steve huff's site). to me this is a holy grail for camera bodies - to bring out the old leica lens characteristics. i find it odd that people want their lenses \"corrected\" by software. clearly they have missed the concept of \"art\" as a \"partially real and part modified\" representation of reality. if i made decisions for the leica company: i would not only let the time and attention of the marketplace decide the popularity of my camera and aesthetic. i would also produce download instructions for manually entered adjustments for the different aesthetics and also produce template files where possible. why let 3rd parties decide your economic survival? why leave the user in the dark without the knowledge to fully use the camera? yet best would be a checkbox in the camera's menu software that would produce the 24meg softer aesthetic or the 40 meg sharper still life aesthetic. thanks for the picture test steve... you got me thinking. brilliant post tom. i enjoyed reading through it very much, and a lot of your points have left me thinking. but before i can make my mind too, i must ask you something. you mention that one series of the photos i took in the test looks sharper, more still life. could you tell me if it’s series a or series b? i want to see if your feel is based on actual mp count, or if other factors could have influenced it, for example maybe better dr of the m10r/a7s3 sensors ..... in any case, some people said before they this thread was useless. your post proved it isn’t. at least not for everyone, not for me... i enjoy this conversation. cheers", "sortedWord": "None", "Identifyer": null, "identifyer": 9062, "year": "2020"}, {"autor": "Jeff S", "date": "2020-10-30 14:26:00", "content": "6 hours ago, Tom1234 said: Fixing in post production software to me frequently creates a picture that looks way too extreme, artificial, and childish like advertising shock techniques so I would rather the camera produce a satisfying rendition in a more eye-natural manner. I do not want to spend hours playing with software sliders that mainly result in an unrealistic looking \"mechanical\" picture. Do I have the time or interest in trying to make the two cameras match one another in post... probably not. I will leave this for people like the great Overgaard. Still can he make one camera perform like two cameras... it is too much to ask. If not or with a little changing of the picture in post... two cameras sit out there on the market with unique and justifiable existences. The artsy 24 meg soft sharpness camera M10 and the 40 meg M10-R with an edge hardness that can likely be lessoned in software to produce a fascinating Still Life ultra high resolution rendition. Post processing, like everything else in photography, requires a good eye and good judgment/decision making. It’s not about pushing a bunch of sliders around, any more than making a gorgeous silver print comes from waving a burning or dodging wand all over the place hoping for success. Anybody can learn techniques; the hard pard is always deciding when, where and to what degree to apply them. Changes are often subtle, on a localized level (not just global), where a very good print suddenly becomes one that ‘sings’. And even then, display lighting is critical. Nuances, small changes, not gross enhancements often make the most important differences. No different than using a camera; some people consistently aim it in subtly but noticeably better directions than others. A good eye and good decision making. Digital post processing also needn’t be hard or tedious or time consuming. After 30+ years working in darkrooms, I find digital PP incredibly convenient and flexible. Creating custom presets and/or different default import settings only adds to the potential time saving. Likewise, making a custom color profile for a camera under common lighting conditions is quick and easy using a tool like the ColorChecker Passport. Similarly, I print using ImagePrint software and it operates in full time soft proof mode so what I see on screen is closer to what I get in print, and it includes custom profiles for all papers and lighting conditions. These and other tools are not cheating, and are not designed to alter a camera’s natural output, but rather to refine to suit one’s style and taste, just as it’s always been in photography. A fine black and white silver print never came straight from the camera (even Weston’s contact prints required skill and judgment), nor does most any digital print in my experience. The files from an M10 Monochrom, for instance, are typically flat and dull; who wants to see a print straight out of camera? Again, I have cameras with 18, 24, and 47 MP, and I know that you would be unable to reliably pick which of my prints (which I custom mat and frame on my own) are derived from each. And they don’t all look alike; different pics deserve and receive different rendering characteristics (and hyper realism isn’t among them). Jeff", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/10/?tab=comments#comment-4070897", "origin": "L-forum", "suborigin": "314500-24meg-verses-40meg-aesthetic", "result": true, "Selector": "me frequently creates", "selectorShort": "create", "MarkedSent": "6 hours ago, tom1234 said: fixing in post production software to -----> me !!!  -----> frequently !!!  -----> creates !!!  a picture that looks way too extreme, artificial, and childish like advertising shock techniques so i would rather the camera produce a satisfying rendition in a more eye-natural manner. i do not want to spend hours playing with software sliders that mainly result in an unrealistic looking \"mechanical\" picture. do i have the time or interest in trying to make the two cameras match one another in post... probably not. i will leave this for people like the great overgaard. still can he make one camera perform like two cameras... it is too much to ask. if not or with a little changing of the picture in post... two cameras sit out there on the market with unique and justifiable existences. the artsy 24 meg soft sharpness camera m10 and the 40 meg m10-r with an edge hardness that can likely be lessoned in software to produce a fascinating still life ultra high resolution rendition. post processing, like everything else in photography, requires a good eye and good judgment/decision making. it’s not about pushing a bunch of sliders around, any more than making a gorgeous silver print comes from waving a burning or dodging wand all over the place hoping for success. anybody can learn techniques; the hard pard is always deciding when, where and to what degree to apply them. changes are often subtle, on a localized level (not just global), where a very good print suddenly becomes one that ‘sings’. and even then, display lighting is critical. nuances, small changes, not gross enhancements often make the most important differences. no different than using a camera; some people consistently aim it in subtly but noticeably better directions than others. a good eye and good decision making. digital post processing also needn’t be hard or tedious or time consuming. after 30+ years working in darkrooms, i find digital pp incredibly convenient and flexible. creating custom presets and/or different default import settings only adds to the potential time saving. likewise, making a custom color profile for a camera under common lighting conditions is quick and easy using a tool like the colorchecker passport. similarly, i print using imageprint software and it operates in full time soft proof mode so what i see on screen is closer to what i get in print, and it includes custom profiles for all papers and lighting conditions. these and other tools are not cheating, and are not designed to alter a camera’s natural output, but rather to refine to suit one’s style and taste, just as it’s always been in photography. a fine black and white silver print never came straight from the camera (even weston’s contact prints required skill and judgment), nor does most any digital print in my experience. the files from an m10 monochrom, for instance, are typically flat and dull; who wants to see a print straight out of camera? again, i have cameras with 18, 24, and 47 mp, and i know that you would be unable to reliably pick which of my prints (which i custom mat and frame on my own) are derived from each. and they don’t all look alike; different pics deserve and receive different rendering characteristics (and hyper realism isn’t among them). jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 9083, "year": "2020"}, {"autor": "Good To Be Retired", "date": "2020-05-14 20:10:00", "content": " Having determined that, for what I happen to like doing, an IR/UV Cut filter might be beneficial, I was wondering if I should create a new Lumariver custom profile for use with the IR/UV Cut filter attached. The appropriate approach would be to just make the profiles and see what happens, but the weather isn't currently cooperation and I'm working sort of on a thought experiment here until the sun peeks out. Any thoughts would be appreciated.", "link": "https://www.l-camera-forum.com/topic/309535-m240-customers-profiles-and-iruv-cut-filters/?tab=comments#comment-3973476", "origin": "L-forum", "suborigin": "309535-m240-customers-profiles-and-iruv-cut-filters", "result": true, "Selector": "i should create", "selectorShort": "create", "MarkedSent": " having determined that, for what -----> i !!!  happen to like doing, an ir/uv cut filter might be beneficial, -----> i !!!  was wondering if -----> i !!!  -----> should !!!  -----> create !!!  a new lumariver custom profile for use with the ir/uv cut filter attached. the appropriate approach would be to just make the profiles and see what happens, but the weather isn't currently cooperation and i'm working sort of on a thought experiment here until the sun peeks out. any thoughts would be appreciated.", "sortedWord": "None", "Identifyer": null, "identifyer": 17357, "year": "2020"}, {"autor": "Good To Be Retired", "date": "2020-03-02 22:37:00", "content": " 12 hours ago, tedd said: or do I have to either suck up the destructive nature of Nik or get used to Lightroom's ugly grain simulation? I'm not sure what your work flow might be, but it sounds like you may be shooting jpeg only. In which case you would have a destructive edit pretty much regardless of what you do. I have a number of choices when converting to B & W, but as I only shoot raw I first create a tiff and perform the conversions on that. The raw file is kept unaltered sorta like a negative. I recommend you try tiffs and Silver Efex Pro. Edited March 2, 2020 by Good To Be Retired", "link": "https://www.l-camera-forum.com/topic/307010-converting-files-to-bnw-best-practice/?tab=comments#comment-3923634", "origin": "L-forum", "suborigin": "307010-converting-files-to-bnw-best-practice", "result": true, "Selector": "i first create", "selectorShort": "create", "MarkedSent": " 12 hours ago, tedd said: or do i have to either suck up the destructive nature of nik or get used to lightroom's ugly grain simulation? i'm not sure what your work flow might be, but it sounds like you may be shooting jpeg only. in which case you would have a destructive edit pretty much regardless of what you do. -----> i !!!  have a number of choices when converting to b & w, but as -----> i !!!  only shoot raw -----> i !!!  -----> first !!!  -----> create !!!  a tiff and perform the conversions on that. the raw file is kept unaltered sorta like a negative. i recommend you try tiffs and silver efex pro. edited march 2, 2020 by good to be retired", "sortedWord": "None", "Identifyer": null, "identifyer": 17487, "year": "2020"}, {"autor": "peterm1_Leica", "date": "2020-03-08 11:31:00", "content": "I am mainly using Lightroom and Nik Silver Efex. I find that Nik runs under Lightroom quite OK as a plugin and while it is technically true that you need to \"drop out\" of Lightroom when you select Nik in the \"Edit Photo in....\" option in Lightroom this is no great hardship as the process is quite automated. Then when the edits are completed in Nik just click on \"save\" within the Nik plugin and the image is automatically exported back into Lightroom as a new virtual image. This it is never destructive as you suggest - the original Lightroom image is still there and always available to use for other purposes. Hence nothing is ever lost (maybe this is something I selected when setting up Lightroom I cannot recall). BTW if you ever need to you can right click on any image in Lightroom and select \"create virtual image\". This creates a duplicate of the Lightroom image so you can process the image in Lightroom in two different ways. You do not need to do this before using Nik plugin as the software does it for you. If I only want a simple and quick conversion to B/W, I find that converting to B/W is pretty good in Lightroom. (In this case I would create a virtual image so as to ensure that the old image is always available for other purposes). Then just click the \"black and white\" option and the image is converted. Then use the color balance sliders to the left or right to achieve a color filter effect similar to that which would have been achieved when shooting black and white film with an actual color filter on the lens. You can also change contrast structure etc. The main reason I do not use Lightroom this way every time is that one of the finishing effects I like to use in Nik Silver Efex is the toning effect (using a slight silver tone in the final image). I find a slight tinge of this color tone )almost invisible) gives a better result for many images. The following image was converted in this manner with this slight toning. --img-- A Friendly Face with Coffee by Life in Shadows, on Flickr Edited March 8, 2020 by peterm1_Leica", "link": "https://www.l-camera-forum.com/topic/307010-converting-files-to-bnw-best-practice/?tab=comments#comment-3927274", "origin": "L-forum", "suborigin": "307010-converting-files-to-bnw-best-practice", "result": true, "Selector": "i would create", "selectorShort": "create", "MarkedSent": "i am mainly using lightroom and nik silver efex. i find that nik runs under lightroom quite ok as a plugin and while it is technically true that you need to \"drop out\" of lightroom when you select nik in the \"edit photo in....\" option in lightroom this is no great hardship as the process is quite automated. then when the edits are completed in nik just click on \"save\" within the nik plugin and the image is automatically exported back into lightroom as a new virtual image. this it is never destructive as you suggest - the original lightroom image is still there and always available to use for other purposes. hence nothing is ever lost (maybe this is something i selected when setting up lightroom i cannot recall). btw if you ever need to you can right click on any image in lightroom and select \"create virtual image\". this creates a duplicate of the lightroom image so you can process the image in lightroom in two different ways. you do not need to do this before using nik plugin as the software does it for you. if i only want a simple and quick conversion to b/w, i find that converting to b/w is pretty good in lightroom. (in this case -----> i !!!  -----> would !!!  -----> create !!!  a virtual image so as to ensure that the old image is always available for other purposes). then just click the \"black and white\" option and the image is converted. then use the color balance sliders to the left or right to achieve a color filter effect similar to that which would have been achieved when shooting black and white film with an actual color filter on the lens. you can also change contrast structure etc. the main reason i do not use lightroom this way every time is that one of the finishing effects i like to use in nik silver efex is the toning effect (using a slight silver tone in the final image). i find a slight tinge of this color tone )almost invisible) gives a better result for many images. the following image was converted in this manner with this slight toning. --img-- a friendly face with coffee by life in shadows, on flickr edited march 8, 2020 by peterm1_leica", "sortedWord": "None", "Identifyer": null, "identifyer": 17493, "year": "2020"}, {"autor": "tedd", "date": "2020-03-15 07:22:00", "content": "On 3/2/2020 at 1:15 PM, lct said: Silver Efex here. What do you mean by destructive if i may ask? Just that you can't make a few edits in SFX, move back to LR and then go back to SFX and change what you did there without starting from scratch. You can use a separate file as others have said below, but then you're starting from the top again. I tend to edit an image, leave it for a day then come back to it and pull back on my over-zealous editing. This is impossible in SFX due to the destructive nature (unless I am missing something?). On 3/2/2020 at 7:01 PM, Jean-Michel said: LR has all the controls you need to convert files into black and white. The only way to show grain. - and I film days one did all that one could do to avoid showing grain - is to use film and print on silver-gelatin paper. As soon as you move to a scan of your negative or paper print you go from grain to electronic noise. I have a high-res dedicated 35mm scanner which shows grain in almost the same way as my enlarger! Grain is a part of the negative itself, scanning doesn't get rid of it and it certainly does pick it up (though cheaper scanners can introduce colour and luminescence noise just like a digital camera on top of it). I actually really like subtle grain in bnw as I feel it gives your eyes something to lock on to. On 3/2/2020 at 10:37 PM, Good To Be Retired said: I'm not sure what your work flow might be, but it sounds like you may be shooting jpeg only. In which case you would have a destructive edit pretty much regardless of what you do. I have a number of choices when converting to B & W, but as I only shoot raw I first create a tiff and perform the conversions on that. The raw file is kept unaltered sorta like a negative. I recommend you try tiffs and Silver Efex Pro. Definitely shooting RAW On 3/3/2020 at 6:42 PM, marchyman said: The B&W panel has eight sliders to adjust the B&W mix:, Red Orange, Yellow, Green, Aqua, Blue, Purple, and Magenta. Capture One has something similar, but with six sliders: Red, Yellow, Green, Cyan, Blue, Magenta. This is exactly what I was after, thanks. I'd been using the RNI 5 pack with film sim (HP5 primarily) and for some reason they lose this option. A shame as otherwise it does a pretty good job for a starting point! On 3/8/2020 at 11:31 AM, peterm1_Leica said: I am mainly using Lightroom and Nik Silver Efex. I find that Nik runs under Lightroom quite OK as a plugin and while it is technically true that you need to \"drop out\" of Lightroom when you select Nik in the \"Edit Photo in....\" option in Lightroom this is no great hardship as the process is quite automated. Then when the edits are completed in Nik just click on \"save\" within the Nik plugin and the image is automatically exported back into Lightroom as a new virtual image. This it is never destructive as you suggest - the original Lightroom image is still there and always available to use for other purposes. Hence nothing is ever lost (maybe this is something I selected when setting up Lightroom I cannot recall). BTW if you ever need to you can right click on any image in Lightroom and select \"create virtual image\". This creates a duplicate of the Lightroom image so you can process the image in Lightroom in two different ways. You do not need to do this before using Nik plugin as the software does it for you. If I only want a simple and quick conversion to B/W, I find that converting to B/W is pretty good in Lightroom. (In this case I would create a virtual image so as to ensure that the old image is always available for other purposes). Then just click the \"black and white\" option and the image is converted. Then use the color balance sliders to the left or right to achieve a color filter effect similar to that which would have been achieved when shooting black and white film with an actual color filter on the lens. You can also change contrast structure etc. The main reason I do not use Lightroom this way every time is that one of the finishing effects I like to use in Nik Silver Efex is the toning effect (using a slight silver tone in the final image). I find a slight tinge of this color tone )almost invisible) gives a better result for many images. The following image was converted in this manner with this slight toning. A Friendly Face with Coffee by Life in Shadows, on Flickr Great image! Maybe I do need to give SFX a go and just suck it up that I can't go back and make subtle changes later. --- Thank you to everyone for the replies!", "link": "https://www.l-camera-forum.com/topic/307010-converting-files-to-bnw-best-practice/?tab=comments#comment-3931607", "origin": "L-forum", "suborigin": "307010-converting-files-to-bnw-best-practice", "result": true, "Selector": "i first create", "selectorShort": "create", "MarkedSent": "on 3/2/2020 at 1:15 pm, lct said: silver efex here. what do you mean by destructive if i may ask? just that you can't make a few edits in sfx, move back to lr and then go back to sfx and change what you did there without starting from scratch. you can use a separate file as others have said below, but then you're starting from the top again. i tend to edit an image, leave it for a day then come back to it and pull back on my over-zealous editing. this is impossible in sfx due to the destructive nature (unless i am missing something?). on 3/2/2020 at 7:01 pm, jean-michel said: lr has all the controls you need to convert files into black and white. the only way to show grain. - and i film days one did all that one could do to avoid showing grain - is to use film and print on silver-gelatin paper. as soon as you move to a scan of your negative or paper print you go from grain to electronic noise. i have a high-res dedicated 35mm scanner which shows grain in almost the same way as my enlarger! grain is a part of the negative itself, scanning doesn't get rid of it and it certainly does pick it up (though cheaper scanners can introduce colour and luminescence noise just like a digital camera on top of it). i actually really like subtle grain in bnw as i feel it gives your eyes something to lock on to. on 3/2/2020 at 10:37 pm, good to be retired said: i'm not sure what your work flow might be, but it sounds like you may be shooting jpeg only. in which case you would have a destructive edit pretty much regardless of what you do. -----> i !!!  have a number of choices when converting to b & w, but as -----> i !!!  only shoot raw -----> i !!!  -----> first !!!  -----> create !!!  a tiff and perform the conversions on that. the raw file is kept unaltered sorta like a negative. i recommend you try tiffs and silver efex pro. definitely shooting raw on 3/3/2020 at 6:42 pm, marchyman said: the b&w panel has eight sliders to adjust the b&w mix:, red orange, yellow, green, aqua, blue, purple, and magenta. capture one has something similar, but with six sliders: red, yellow, green, cyan, blue, magenta. this is exactly what i was after, thanks. i'd been using the rni 5 pack with film sim (hp5 primarily) and for some reason they lose this option. a shame as otherwise it does a pretty good job for a starting point! on 3/8/2020 at 11:31 am, peterm1_leica said: i am mainly using lightroom and nik silver efex. i find that nik runs under lightroom quite ok as a plugin and while it is technically true that you need to \"drop out\" of lightroom when you select nik in the \"edit photo in....\" option in lightroom this is no great hardship as the process is quite automated. then when the edits are completed in nik just click on \"save\" within the nik plugin and the image is automatically exported back into lightroom as a new virtual image. this it is never destructive as you suggest - the original lightroom image is still there and always available to use for other purposes. hence nothing is ever lost (maybe this is something i selected when setting up lightroom i cannot recall). btw if you ever need to you can right click on any image in lightroom and select \"create virtual image\". this creates a duplicate of the lightroom image so you can process the image in lightroom in two different ways. you do not need to do this before using nik plugin as the software does it for you. if i only want a simple and quick conversion to b/w, i find that converting to b/w is pretty good in lightroom. (in this case i would create a virtual image so as to ensure that the old image is always available for other purposes). then just click the \"black and white\" option and the image is converted. then use the color balance sliders to the left or right to achieve a color filter effect similar to that which would have been achieved when shooting black and white film with an actual color filter on the lens. you can also change contrast structure etc. the main reason i do not use lightroom this way every time is that one of the finishing effects i like to use in nik silver efex is the toning effect (using a slight silver tone in the final image). i find a slight tinge of this color tone )almost invisible) gives a better result for many images. the following image was converted in this manner with this slight toning. a friendly face with coffee by life in shadows, on flickr great image! maybe i do need to give sfx a go and just suck it up that i can't go back and make subtle changes later. --- thank you to everyone for the replies!", "sortedWord": "None", "Identifyer": null, "identifyer": 17497, "year": "2020"}, {"autor": "LeicaR10", "date": "2020-08-14 22:22:00", "content": " Jplomley, I use the M10-M for my commercial landscape photography business. The camera and M lenses are superb. My clients are very demanding for detail and very large prints. I create 4' X 6' B&W prints and larger and have nothing but very high praise for the camera and M lenses. Tonal range and detail is often breath taking according to my clients. The M10-R is the same way. I found my clients did not like the \"too perfect\" rendering of the excellent SL2 and SL lenses and wanted more natural rendering and color. When I did use M lenses on the SL2, I did not stop down below f/8 for highest resolution, only when I needed more DOF. BTW, I sold the SL2 system and now only use the M10-M + R and S3 systems. My business requires that I photograph landscapes in very remote and often environmentally harsh conditions. The S3 does the bulk of my work for very large and detailed print requirements from my clients. Only when I am challenged by the remoteness of the hike do I take the M cameras. In all cases, it gets down to your personal tastes and expectations what your genre of photography and how you want to create your photographs. I hope this helps. r/ Mark", "link": "https://www.l-camera-forum.com/topic/312315-m10m-for-landscapes/?tab=comments#comment-4027250", "origin": "L-forum", "suborigin": "312315-m10m-for-landscapes", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": " jplomley, i use the m10-m for my commercial landscape photography business. the camera and m lenses are superb. my clients are very demanding for detail and very large prints. -----> i !!!  -----> create !!!  4' x 6' b&w prints and larger and have nothing but very high praise for the camera and m lenses. tonal range and detail is often breath taking according to my clients. the m10-r is the same way. i found my clients did not like the \"too perfect\" rendering of the excellent sl2 and sl lenses and wanted more natural rendering and color. when i did use m lenses on the sl2, i did not stop down below f/8 for highest resolution, only when i needed more dof. btw, i sold the sl2 system and now only use the m10-m + r and s3 systems. my business requires that i photograph landscapes in very remote and often environmentally harsh conditions. the s3 does the bulk of my work for very large and detailed print requirements from my clients. only when i am challenged by the remoteness of the hike do i take the m cameras. in all cases, it gets down to your personal tastes and expectations what your genre of photography and how you want to create your photographs. i hope this helps. r/ mark", "sortedWord": "None", "Identifyer": null, "identifyer": 23712, "year": "2020"}, {"autor": "Sjz", "date": "2020-09-15 21:26:00", "content": "I still think that for me, the MM1 photo thread has the most consistently high quality images. (The Q2 thread is also superb with some great recent B+W additions from Snoopy). I don’t own a MM1 (or Q2) and I can’t decide if it’s the camera or the nature of the person who buys it, that generate those great images, but there appears to be a something there. I have a M10M and an APO 50 - with them I can create a photo which looks like a technical drawing and I have taken softer photos of my sons which allow their characters to somehow reflect through. The range goes from clinical to atmospheric, I think it is an ‘interesting’ pairing. I am lucky to also have a ‘Lux 28 although I am still near the foothills of that learning curve, however I would not attribute the words clinical or sterile to that combination either. I don’t want a film look, I could get that by using film, however I do enjoy the twilight zone between the historic realism some of us, me included, (wrongly?) attribute to film and the look Leica digital cameras create. Not because it looks like film but because it is the look I enjoy. I can appreciate, but do not enjoy, photos which make me think ‘is it a photo or an exquisitely drawn cartoon’. (I am exaggerating to make the point - but I do think some other brands pull their users towards that,). [I have a film camera (it takes two small coin batteries) which needs repaired as the electronics fry the batteries - it is over 30 years old. Even that will never be a door stop, at worst it will be a beautiful display ornament, suspect my Leicas will also end up that way however I will have enjoyed using them for many many years before that.]", "link": "https://www.l-camera-forum.com/topic/313364-leica-monochrom-ccd-who%E2%80%99s-selling-why/?tab=comments#comment-4046612", "origin": "L-forum", "suborigin": "313364-leica-monochrom-ccd-who%E2%80%99s-selling-why", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "i still think that for me, the mm1 photo thread has the most consistently high quality images. (the q2 thread is also superb with some great recent b+w additions from snoopy). i don’t own a mm1 (or q2) and i can’t decide if it’s the camera or the nature of the person who buys it, that generate those great images, but there appears to be a something there. -----> i !!!  have a m10m and an apo 50 - with them -----> i !!!  -----> can !!!  -----> create !!!  a photo which looks like a technical drawing and -----> i !!!  have taken softer photos of my sons which allow their characters to somehow reflect through. the range goes from clinical to atmospheric, i think it is an ‘interesting’ pairing. i am lucky to also have a ‘lux 28 although i am still near the foothills of that learning curve, however i would not attribute the words clinical or sterile to that combination either. i don’t want a film look, i could get that by using film, however i do enjoy the twilight zone between the historic realism some of us, me included, (wrongly?) attribute to film and the look leica digital cameras create. not because it looks like film but because it is the look i enjoy. i can appreciate, but do not enjoy, photos which make me think ‘is it a photo or an exquisitely drawn cartoon’. (i am exaggerating to make the point - but i do think some other brands pull their users towards that,). [i have a film camera (it takes two small coin batteries) which needs repaired as the electronics fry the batteries - it is over 30 years old. even that will never be a door stop, at worst it will be a beautiful display ornament, suspect my leicas will also end up that way however i will have enjoyed using them for many many years before that.]", "sortedWord": "None", "Identifyer": null, "identifyer": 25207, "year": "2020"}, {"autor": "wilfredo", "date": "2020-09-16 02:08:00", "content": "4 hours ago, Sjz said: I still think that for me, the MM1 photo thread has the most consistently high quality images. (The Q2 thread is also superb with some great recent B+W additions from Snoopy). I don’t own a MM1 (or Q2) and I can’t decide if it’s the camera or the nature of the person who buys it, that generate those great images, but there appears to be a something there. I have a M10M and an APO 50 - with them I can create a photo which looks like a technical drawing and I have taken softer photos of my sons which allow their characters to somehow reflect through. The range goes from clinical to atmospheric, I think it is an ‘interesting’ pairing. I am lucky to also have a ‘Lux 28 although I am still near the foothills of that learning curve, however I would not attribute the words clinical or sterile to that combination either. I don’t want a film look, I could get that by using film, however I do enjoy the twilight zone between the historic realism some of us, me included, (wrongly?) attribute to film and the look Leica digital cameras create. Not because it looks like film but because it is the look I enjoy. I can appreciate, but do not enjoy, photos which make me think ‘is it a photo or an exquisitely drawn cartoon’. (I am exaggerating to make the point - but I do think some other brands pull their users towards that,). [I have a film camera (it takes two small coin batteries) which needs repaired as the electronics fry the batteries - it is over 30 years old. Even that will never be a door stop, at worst it will be a beautiful display ornament, suspect my Leicas will also end up that way however I will have enjoyed using them for many many years before that.] I resonate with a lot of what you've expressed. You have amazing options at your disposal! You wrote: \"I don’t want a film look, I could get that by using film, however I do enjoy the twilight zone between the historic realism some of us, me included, (wrongly?) attribute to film and the look Leica digital cameras create.\" I put myself in the same camp. The \"twilight zone\" is what I usually aim for in my own personal photography. Thank you for sharing these thoughts and insights. The tension between \"clinical and atmospheric\" is a balancing act, and depends on the mood or situation of the day. Lots of food for thought.", "link": "https://www.l-camera-forum.com/topic/313364-leica-monochrom-ccd-who%E2%80%99s-selling-why/?tab=comments#comment-4046721", "origin": "L-forum", "suborigin": "313364-leica-monochrom-ccd-who%E2%80%99s-selling-why", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "4 hours ago, sjz said: i still think that for me, the mm1 photo thread has the most consistently high quality images. (the q2 thread is also superb with some great recent b+w additions from snoopy). i don’t own a mm1 (or q2) and i can’t decide if it’s the camera or the nature of the person who buys it, that generate those great images, but there appears to be a something there. -----> i !!!  have a m10m and an apo 50 - with them -----> i !!!  -----> can !!!  -----> create !!!  a photo which looks like a technical drawing and -----> i !!!  have taken softer photos of my sons which allow their characters to somehow reflect through. the range goes from clinical to atmospheric, i think it is an ‘interesting’ pairing. i am lucky to also have a ‘lux 28 although i am still near the foothills of that learning curve, however i would not attribute the words clinical or sterile to that combination either. i don’t want a film look, i could get that by using film, however i do enjoy the twilight zone between the historic realism some of us, me included, (wrongly?) attribute to film and the look leica digital cameras create. not because it looks like film but because it is the look i enjoy. i can appreciate, but do not enjoy, photos which make me think ‘is it a photo or an exquisitely drawn cartoon’. (i am exaggerating to make the point - but i do think some other brands pull their users towards that,). [i have a film camera (it takes two small coin batteries) which needs repaired as the electronics fry the batteries - it is over 30 years old. even that will never be a door stop, at worst it will be a beautiful display ornament, suspect my leicas will also end up that way however i will have enjoyed using them for many many years before that.] i resonate with a lot of what you've expressed. you have amazing options at your disposal! you wrote: \"i don’t want a film look, i could get that by using film, however i do enjoy the twilight zone between the historic realism some of us, me included, (wrongly?) attribute to film and the look leica digital cameras create.\" i put myself in the same camp. the \"twilight zone\" is what i usually aim for in my own personal photography. thank you for sharing these thoughts and insights. the tension between \"clinical and atmospheric\" is a balancing act, and depends on the mood or situation of the day. lots of food for thought.", "sortedWord": "None", "Identifyer": null, "identifyer": 25209, "year": "2020"}, {"autor": "Jeff S", "date": "2020-06-06 03:01:00", "content": "I’m not advocating or prescribing any specific tone curve. I couldn’t care less what comes out of camera or LR, as I create my own curve(s) as desired (never flat) for any given pic or group of pics. I don’t own an M10 Monochrom, content to use the original Monochrom, but I see no reason why one can’t save a preset in LR Classic and apply it. Jeff Edited June 6, 2020 by Jeff S", "link": "https://www.l-camera-forum.com/topic/310250-m10m-lightroom-auto-adjustment/?tab=comments#comment-3988030", "origin": "L-forum", "suborigin": "310250-m10m-lightroom-auto-adjustment", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "i’m not advocating or prescribing any specific tone curve. -----> i !!!  couldn’t care less what comes out of camera or lr, as -----> i !!!  -----> create !!!  my own curve(s) as desired (never flat) for any given pic or group of pics. i don’t own an m10 monochrom, content to use the original monochrom, but i see no reason why one can’t save a preset in lr classic and apply it. jeff edited june 6, 2020 by jeff s", "sortedWord": "None", "Identifyer": null, "identifyer": 26220, "year": "2020"}, {"autor": "Jeff S", "date": "2020-06-06 05:15:00", "content": "30 minutes ago, NRKstudio said: How do you create profiles with only LR Classic? I only see options to create Presets. Or import Profiles (not create them). Also I’ve been using Martin labs presets; for the monochrom Mastin Labs offers some really solid b/w presets (most of them change the tone curve, and if they don’t change the curve I set it to the Leica automatic monochrom curve). My language wasn't precise....of course one can create presets within LR Classic, and one can create or use use third party profiles and import/store them in LR Classic (for instance using XRite Color Checker). Either way, once created or stored, the options are there to access and use as desired. https://www.lightroomqueen.com/camera-profiles/ I typically create my own tone curve on an image by image basis, regardless of the starting point. Jeff Edited June 6, 2020 by Jeff S", "link": "https://www.l-camera-forum.com/topic/310250-m10m-lightroom-auto-adjustment/?tab=comments#comment-3988053", "origin": "L-forum", "suborigin": "310250-m10m-lightroom-auto-adjustment", "result": true, "Selector": "i typically create", "selectorShort": "create", "MarkedSent": "30 minutes ago, nrkstudio said: how do you create profiles with only lr classic? i only see options to create presets. or import profiles (not create them). also i’ve been using martin labs presets; for the monochrom mastin labs offers some really solid b/w presets (most of them change the tone curve, and if they don’t change the curve i set it to the leica automatic monochrom curve). my language wasn't precise....of course one can create presets within lr classic, and one can create or use use third party profiles and import/store them in lr classic (for instance using xrite color checker). either way, once created or stored, the options are there to access and use as desired. https://www.lightroomqueen.com/camera-profiles/ -----> i !!!  -----> typically !!!  -----> create !!!  my own tone curve on an image by image basis, regardless of the starting point. jeff edited june 6, 2020 by jeff s", "sortedWord": "None", "Identifyer": null, "identifyer": 26224, "year": "2020"}, {"autor": "Shameetman", "date": "2020-06-29 13:17:00", "content": "On 6/26/2020 at 1:38 PM, jaapv said: Isn’t the relative colour saturation a simple matter of calibrating the cameras properly, which is part of any colour-managed workflow? Could be, but so far I have not managed to duplicate M9 colors with other cameras. Unlike many others I'm a fan of saturated colors and I'm not aiming for a clean true to real life color image. I like the saturated reds of the M9 a lot. When I compare the files of the Hasselblad to the ones of the M9 the behavior of the sliders in Lightroom is very different. With the M9 I can create colors which I can't duplicate with the X1D, but I can also get great color with the X1D that I can't get from the M9. I realize that the M9 is unique and that I should enjoy it as long as possible. Like certain film stocks it will eventually die, but there must come other nice things in return.", "link": "https://www.l-camera-forum.com/topic/310595-sold-my-m9/page/3/?tab=comments#comment-4001273", "origin": "L-forum", "suborigin": "310595-sold-my-m9", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "on 6/26/2020 at 1:38 pm, jaapv said: isn’t the relative colour saturation a simple matter of calibrating the cameras properly, which is part of any colour-managed workflow? could be, but so far i have not managed to duplicate m9 colors with other cameras. unlike many others i'm a fan of saturated colors and i'm not aiming for a clean true to real life color image. i like the saturated reds of the m9 a lot. when i compare the files of the hasselblad to the ones of the m9 the behavior of the sliders in lightroom is very different. with the m9 -----> i !!!  -----> can !!!  -----> create !!!  colors which -----> i !!!  can't duplicate with the x1d, but -----> i !!!  -----> can !!!  also get great color with the x1d that -----> i !!!  can't get from the m9. i realize that the m9 is unique and that i should enjoy it as long as possible. like certain film stocks it will eventually die, but there must come other nice things in return.", "sortedWord": "None", "Identifyer": null, "identifyer": 33002, "year": "2020"}, {"autor": "ToddSch", "date": "2020-01-06 11:52:00", "content": "@M9reno I have an M9 with new sensor and also experienced the exact issue on my Elmarit (11606). Like you, I was a little devastated as I love the 28 focal length and I really like the Elmarit size (and price). I was considering selling until I came across this old trick. https://www.reidreviews.com/examples/flatfieldnew.html Ater reading this I remembered that I needed to create LCC exposure when using my old P4 with Sinarback 54, which cleaned up any lens abnormalities or corner casts due to camera movements. I just picked up an M9 this past summer (And yes, very happy in 2020 with it), but have been using CMOS sensors pretty much 100% since 2010. It has been a while since I had a CCD in my hands and I do think that one of the challenges with CCD's is that they are more susceptible to this issue than CMOS. Below is in example from my set-up. The first image is straight out of camera, no processing. The second is with the FF correction and looks much better. So far, I have been happy with the results, although I wish I did not have to do this for each frame. good luck! --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/305059-is-the-m9-still-worth-it-in-2020/page/2/?tab=comments#comment-3886034", "origin": "L-forum", "suborigin": "305059-is-the-m9-still-worth-it-in-2020", "result": true, "Selector": "i needed to create", "selectorShort": "create", "MarkedSent": "@m9reno i have an m9 with new sensor and also experienced the exact issue on my elmarit (11606). like you, i was a little devastated as i love the 28 focal length and i really like the elmarit size (and price). i was considering selling until i came across this old trick. https://www.reidreviews.com/examples/flatfieldnew.html ater reading this -----> i !!!  remembered that -----> i !!!  -----> needed !!!  -----> to !!!  -----> create !!!  lcc exposure when using my old p4 with sinarback 54, which cleaned up any lens abnormalities or corner casts due -----> to !!!  camera movements. i just picked up an m9 this past summer (and yes, very happy in 2020 with it), but have been using cmos sensors pretty much 100% since 2010. it has been a while since i had a ccd in my hands and i do think that one of the challenges with ccd's is that they are more susceptible to this issue than cmos. below is in example from my set-up. the first image is straight out of camera, no processing. the second is with the ff correction and looks much better. so far, i have been happy with the results, although i wish i did not have to do this for each frame. good luck! --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 33647, "year": "2020"}, {"autor": "Merv-O", "date": "2020-03-21 09:39:00", "content": "On 3/11/2020 at 11:19 PM, mnutzer said: Thanks for remembering one of my shots. In Sept. 2019 after about 10 years I have changed from the M8.2 to an M10-P and never regretted it one single day. All things M8.2 did are done much better by M10-P, as higher usable ISO, faster image storage and higher battery capacity. Not to forget those pleasant conveniences such as constant image control by display or electronic viewfinder, the spirit level or the net grille. Arvid seems to have ended his m8raw2dng project and there should be no assistence anymore. Here's his m8raw2dng-droplet.app.zipfor download again, but without a very helpful step by step explanation given from another member of the LUF I never would have got it to run. Now I'm very thankful to got rid of that annoying button dance every time I startet the M8.2 for taking photos with that factory raw program and save time as those raws don't need to be converted first to dngs before one can develop them by a picture image program. It sounds hard but it's better to spare for a much more modern digital Leica-M like an M10 than investing your hard earned money into outdated stuff like M8. Peter Karbe, chief lens designer of Leica, told from the M8 as his most hated digital Leica-M, an important and necessary step for Leica but now only history. As the owner of an M (typ 240), SL, CL digital, M 8.2 and a D-Lux, I tried the M10 and in comparison to the SL and the M (typ 240), I didn't see a big enough differential except for the Visoflex 020 v. the EVF 2. The SL, though bigger, outperforms the M10 on several bases. To start, the AF lenses make it a virtual DSLR for fast shoots, the M-Lens Adapter allows me to use my precious glass on an advanced body and the focus peaking is not overly contrasted (it's adjustable). I'm heavily invested in Leica and I have created a flexible kit with the adapters and camera choices. I recently bought a mint 35-70 R-mount and adapter for less than $500 (U.S.) for the M (tip 240) and am enjoying telephoto on an M camera for the first time. Conversely, I purchased the fixed lens D-Lux because I was being denied entry into certain concerts and venues with my replaceable lens camera bodies. I love the M 8.2 because the 10.3 mp CCD sensor is special. Its simple menu, classic look and feel, renders certain subjects excellently. Plus, with the RF calibrated properly, my pictures are sharp enough for what I need it for (up to 8 x 10). Having wrestled with new technology v. old, the only tech that counts is the photographer and what he seeks to render. Like golf, a bad golfer with the best equipment is still a poor golfer, while a good golfer with the worst equipment can still shine. The 10m/M10-P is a wonderful camera, but its incremental improvements did not improve my experience with what I already have. Remember, please distinguish between the M8 and the M8.2--there are remarkable differences that make the 8.2 relevant today, even without 6-bit lenses....Cheers and keep shooting wonderful pictures.", "link": "https://www.l-camera-forum.com/topic/297521-buy-an-m8-in-2019/page/2/?tab=comments#comment-3935757", "origin": "L-forum", "suborigin": "297521-buy-an-m8-in-2019", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "on 3/11/2020 at 11:19 pm, mnutzer said: thanks for remembering one of my shots. in sept. 2019 after about 10 years i have changed from the m8.2 to an m10-p and never regretted it one single day. all things m8.2 did are done much better by m10-p, as higher usable iso, faster image storage and higher battery capacity. not to forget those pleasant conveniences such as constant image control by display or electronic viewfinder, the spirit level or the net grille. arvid seems to have ended his m8raw2dng project and there should be no assistence anymore. here's his m8raw2dng-droplet.app.zipfor download again, but without a very helpful step by step explanation given from another member of the luf i never would have got it to run. now i'm very thankful to got rid of that annoying button dance every time i startet the m8.2 for taking photos with that factory raw program and save time as those raws don't need to be converted first to dngs before one can develop them by a picture image program. it sounds hard but it's better to spare for a much more modern digital leica-m like an m10 than investing your hard earned money into outdated stuff like m8. peter karbe, chief lens designer of leica, told from the m8 as his most hated digital leica-m, an important and necessary step for leica but now only history. as the owner of an m (typ 240), sl, cl digital, m 8.2 and a d-lux, i tried the m10 and in comparison to the sl and the m (typ 240), i didn't see a big enough differential except for the visoflex 020 v. the evf 2. the sl, though bigger, outperforms the m10 on several bases. to start, the af lenses make it a virtual dslr for fast shoots, the m-lens adapter allows me to use my precious glass on an advanced body and the focus peaking is not overly contrasted (it's adjustable). -----> i !!! 'm heavily invested in leica and -----> i !!!  -----> have !!!  -----> created !!!  a flexible kit with the adapters and camera choices. i recently bought a mint 35-70 r-mount and adapter for less than $500 (u.s.) for the m (tip 240) and am enjoying telephoto on an m camera for the first time. conversely, i purchased the fixed lens d-lux because i was being denied entry into certain concerts and venues with my replaceable lens camera bodies. i love the m 8.2 because the 10.3 mp ccd sensor is special. its simple menu, classic look and feel, renders certain subjects excellently. plus, with the rf calibrated properly, my pictures are sharp enough for what i need it for (up to 8 x 10). having wrestled with new technology v. old, the only tech that counts is the photographer and what he seeks to render. like golf, a bad golfer with the best equipment is still a poor golfer, while a good golfer with the worst equipment can still shine. the 10m/m10-p is a wonderful camera, but its incremental improvements did not improve my experience with what i already have. remember, please distinguish between the m8 and the m8.2--there are remarkable differences that make the 8.2 relevant today, even without 6-bit lenses....cheers and keep shooting wonderful pictures.", "sortedWord": "None", "Identifyer": null, "identifyer": 42459, "year": "2020"}, {"autor": "MikeMyers", "date": "2020-02-03 01:03:00", "content": "To me, it's not distorting the image, it's just showing me things that I can't see with my eyes, because my eyes can't pick up infrared illumination. On the other hand, if I enjoy blocking out much of the visible spectrum, and shooting images mostly with infrared, why should I mind getting images that are illuminated both by visible light, and by infrared light? If the result is ugly, that's one thing - but what if the M8 images ADD something to the image (which they literally do)? By the time I get done editing in Nik Collection, the resulting image is no longer what I saw. When I watch the guys demonstrate PhotoLab 3, or even Lightroom, the resulting photo is beautiful, but it's not what people saw when they snapped the shutter? I need to think about this a lot more, and I'll buy the filter anyway, but I may or may not use it, depending on what I'm trying to create.", "link": "https://www.l-camera-forum.com/topic/306038-does-m82-have-a-built-in-ir-cut-filter/?tab=comments#comment-3905007", "origin": "L-forum", "suborigin": "306038-does-m82-have-a-built-in-ir-cut-filter", "result": true, "Selector": "i'm trying to create", "selectorShort": "create", "MarkedSent": "to me, it's not distorting the image, it's just showing me things that i can't see with my eyes, because my eyes can't pick up infrared illumination. on the other hand, if i enjoy blocking out much of the visible spectrum, and shooting images mostly with infrared, why should i mind getting images that are illuminated both by visible light, and by infrared light? if the result is ugly, that's one thing - but what if the m8 images add something to the image (which they literally do)? by the time i get done editing in nik collection, the resulting image is no longer what i saw. when i watch the guys demonstrate photolab 3, or even lightroom, the resulting photo is beautiful, but it's not what people saw when they snapped the shutter? -----> i !!!  need -----> to !!!  think about this a lot more, and -----> i !!! 'll buy the filter anyway, but -----> i !!!  may or may not use it, depending on what -----> i !!! 'm -----> trying !!!  -----> to !!!  -----> create !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 42625, "year": "2020"}, {"autor": "nicci78", "date": "2020-09-09 08:24:00", "content": " So I received the 56mm DC DN. It is all plastic fantastic. Or more precisely in thermal stable composite. Same elastic property than aluminium and better than polycarbonate, but in composite. What I like so far : - tiny size (even with lens hood). - lightweight and perfectly balance with CL. - f/1.4 sharp wide open. - moisture protected mount. - half press shutter instant manual focusing retouching in AF mode. - 50cm minimum focusing distance. - non aspherical lens design = creamy bokeh without onion rings. What is strange : - warm colour cast. Very different than colder Leica. Looks like Canon colour. Easily corrected by Lightroom. I will create a profile for that. - AF is ok. But a bit slower that Leica TL lenses. It can hunt too. So not the best for action. PS : I forgot to upgrade the lens firmware. Still 1.0", "link": "https://www.l-camera-forum.com/topic/311874-sigma-163056-for-aps-c-sensors/page/3/?tab=comments#comment-4042548", "origin": "L-forum", "suborigin": "311874-sigma-163056-for-aps-c-sensors", "result": true, "Selector": "i will create", "selectorShort": "create", "MarkedSent": " so i received the 56mm dc dn. it is all plastic fantastic. or more precisely in thermal stable composite. same elastic property than aluminium and better than polycarbonate, but in composite. what i like so far : - tiny size (even with lens hood). - lightweight and perfectly balance with cl. - f/1.4 sharp wide open. - moisture protected mount. - half press shutter instant manual focusing retouching in af mode. - 50cm minimum focusing distance. - non aspherical lens design = creamy bokeh without onion rings. what is strange : - warm colour cast. very different than colder leica. looks like canon colour. easily corrected by lightroom. -----> i !!!  -----> will !!!  -----> create !!!  a profile for that. - af is ok. but a bit slower that leica tl lenses. it can hunt too. so not the best for action. ps : i forgot to upgrade the lens firmware. still 1.0", "sortedWord": "None", "Identifyer": null, "identifyer": 39663, "year": "2020"}, {"autor": "gteague", "date": "2020-09-09 14:44:00", "content": "6 hours ago, nicci78 said: So I received the 56mm DC DN. It is all plastic fantastic. Or more precisely in thermal stable composite. Same elastic property than aluminium and better than polycarbonate, but in composite. What I like so far : - tiny size (even with lens hood). - lightweight and perfectly balance with CL. - f/1.4 sharp wide open. - moisture protected mount. - half press shutter instant manual focusing retouching in AF mode. - 50cm minimum focusing distance. - non aspherical lens design = creamy bokeh without onion rings. What is strange : - warm colour cast. Very different than colder Leica. Looks like Canon colour. Easily corrected by Lightroom. I will create a profile for that. - AF is ok. But a bit slower that Leica TL lenses. It can hunt too. So not the best for action. PS : I forgot to upgrade the lens firmware. Still 1.0 i like the lens on my s1 better as it makes the s1 the size of, and look and handle about like a nikon f3 hp with a normal lens. and the 2x function yields about a 110/1.4, perfect for portraits in the plague age. now the cl has a 1.7x function, but that's pushing the limit without ios for me. i haven't noticed any color shift from my other lenses, but i haven't been looking for it either so it must not be very far off. sure, the lens focuses just very slightly slower than native l-mount lenses on the s1, but it focuses faster than the sigma 45/2.8 i used to own and just as fast as the sigma 70/2.art macro and the tl 23/2. for me, it's a total non-issue. i got rid of the 45/2.8 because it just didn't perform quality-wise so of course if you have those issues with it, i'd return it. i'm just reporting these things aren't issues for me on either of two bodies. do i wish it was as sharp as the 70 art macro? yes, but that's one of my sharpest lenses. /guy Edited September 9, 2020 by gteague", "link": "https://www.l-camera-forum.com/topic/311874-sigma-163056-for-aps-c-sensors/page/3/?tab=comments#comment-4042760", "origin": "L-forum", "suborigin": "311874-sigma-163056-for-aps-c-sensors", "result": true, "Selector": "i will create", "selectorShort": "create", "MarkedSent": "6 hours ago, nicci78 said: so i received the 56mm dc dn. it is all plastic fantastic. or more precisely in thermal stable composite. same elastic property than aluminium and better than polycarbonate, but in composite. what i like so far : - tiny size (even with lens hood). - lightweight and perfectly balance with cl. - f/1.4 sharp wide open. - moisture protected mount. - half press shutter instant manual focusing retouching in af mode. - 50cm minimum focusing distance. - non aspherical lens design = creamy bokeh without onion rings. what is strange : - warm colour cast. very different than colder leica. looks like canon colour. easily corrected by lightroom. -----> i !!!  -----> will !!!  -----> create !!!  a profile for that. - af is ok. but a bit slower that leica tl lenses. it can hunt too. so not the best for action. ps : i forgot to upgrade the lens firmware. still 1.0 i like the lens on my s1 better as it makes the s1 the size of, and look and handle about like a nikon f3 hp with a normal lens. and the 2x function yields about a 110/1.4, perfect for portraits in the plague age. now the cl has a 1.7x function, but that's pushing the limit without ios for me. i haven't noticed any color shift from my other lenses, but i haven't been looking for it either so it must not be very far off. sure, the lens focuses just very slightly slower than native l-mount lenses on the s1, but it focuses faster than the sigma 45/2.8 i used to own and just as fast as the sigma 70/2.art macro and the tl 23/2. for me, it's a total non-issue. i got rid of the 45/2.8 because it just didn't perform quality-wise so of course if you have those issues with it, i'd return it. i'm just reporting these things aren't issues for me on either of two bodies. do i wish it was as sharp as the 70 art macro? yes, but that's one of my sharpest lenses. /guy edited september 9, 2020 by gteague", "sortedWord": "None", "Identifyer": null, "identifyer": 39671, "year": "2020"}, {"autor": "gteague", "date": "2020-08-22 20:53:00", "content": "so i still can't remember the icons from one session to the next, but based on the praise for the new screen i've whipped it into usability for me. i didn't turn on touch but i have managed to whittle down the favorites, /fn/ and right button functions to just 2-4 each. and since there's a user profile selection on that screen, i've created profiles for /color/ /mono/ and /panorama/ which latter basically eliminates me having to have scene mode assigned to a function button. i think that selecting the film style using the right button and then selecting it as opposed to selecting a user profile is about a toss up in terms of button pushes though and it's easier to push the right button than the left side buttons when holding the cl to your eye. so, the right button does digital zoom and toggle among the 3 settings. and the /fn/ button shows self-timer settings. i still have items like the focus area so i've benefited from the digital zoom and the info screen in this update. /guy", "link": "https://www.l-camera-forum.com/topic/312494-firmware-version-4-available-for-cl/page/6/?tab=comments#comment-4031595", "origin": "L-forum", "suborigin": "312494-firmware-version-4-available-for-cl", "result": true, "Selector": "i've created", "selectorShort": "create", "MarkedSent": "so i still can't remember the icons from one session to the next, but based on the praise for the new screen i've whipped it into usability for me. i didn't turn on touch but i have managed to whittle down the favorites, /fn/ and right button functions to just 2-4 each. and since there's a user profile selection on that screen, -----> i !!! 've -----> created !!!  profiles for /color/ /mono/ and /panorama/ which latter basically eliminates me having to have scene mode assigned to a function button. i think that selecting the film style using the right button and then selecting it as opposed to selecting a user profile is about a toss up in terms of button pushes though and it's easier to push the right button than the left side buttons when holding the cl to your eye. so, the right button does digital zoom and toggle among the 3 settings. and the /fn/ button shows self-timer settings. i still have items like the focus area so i've benefited from the digital zoom and the info screen in this update. /guy", "sortedWord": "None", "Identifyer": null, "identifyer": 42009, "year": "2020"}, {"autor": "LeicaR10", "date": "2020-01-23 02:18:00", "content": "Wlaidlaw, I owned the R9 and DMR for about 5 years. I eventually sold it when other digital Leica cameras evolved and my business client base grew. The photographs the DMR helped me create still sell to this day. The files, color and rendering are superb with the DMR and R lenses. You can look at photographs taken in the R Forum and many are excellent. Like many R9 w/DMR photographers, we were hoping for the Leica R10 with an improved digital sensor. At times, I regret not keeping my R9 and DMR because I found when coupled with the R lenses the system was simply superb. If you want a bit of Leica R history and a unique capability with the DMR (only 3,000 were made) then you might consider buying it and using it...the photographic rendering of the DMR and R lenses remains stellar. r/ Mark", "link": "https://www.l-camera-forum.com/topic/305621-offered-a-near-mint-dmr-do-i-or-dont-i/?tab=comments#comment-3897418", "origin": "L-forum", "suborigin": "305621-offered-a-near-mint-dmr-do-i-or-dont-i", "result": true, "Selector": "me create", "selectorShort": "create", "MarkedSent": "wlaidlaw, i owned the r9 and dmr for about 5 years. i eventually sold it when other digital leica cameras evolved and my business client base grew. the photographs the dmr helped -----> me !!!  -----> create !!!  still sell to this day. the files, color and rendering are superb with the dmr and r lenses. you can look at photographs taken in the r forum and many are excellent. like many r9 w/dmr photographers, we were hoping for the leica r10 with an improved digital sensor. at times, i regret not keeping my r9 and dmr because i found when coupled with the r lenses the system was simply superb. if you want a bit of leica r history and a unique capability with the dmr (only 3,000 were made) then you might consider buying it and using it...the photographic rendering of the dmr and r lenses remains stellar. r/ mark", "sortedWord": "None", "Identifyer": null, "identifyer": 21717, "year": "2020"}, {"autor": "LeicaR10", "date": "2020-08-06 01:32:00", "content": "David, I have owned all the S cameras to date and now the S3. To answer your question on AF speed I need to say I rarely use AF on any past or present S camera as I do landscape photography. I can say the S3 AF speed is not the SL2 in speed. It is faster, but to me, it means nothing as I do everything manually. I have the S3 for the sensor size, improved color and of course, the superb S lenses for rendering the scenes. My clients are very demanding for detail in the very large prints that I create. A number of Leica dealers are now receiving their S3 demos and perhaps you might consider doing a AF speed test with them. r/ Mark Edited August 6, 2020 by LeicaR10", "link": "https://www.l-camera-forum.com/topic/311910-predictive-focusing-on-s3/?tab=comments#comment-4022239", "origin": "L-forum", "suborigin": "311910-predictive-focusing-on-s3", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "david, i have owned all the s cameras to date and now the s3. to answer your question on af speed i need to say i rarely use af on any past or present s camera as i do landscape photography. i can say the s3 af speed is not the sl2 in speed. it is faster, but to me, it means nothing as i do everything manually. i have the s3 for the sensor size, improved color and of course, the superb s lenses for rendering the scenes. my clients are very demanding for detail in the very large prints that -----> i !!!  -----> create !!! . a number of leica dealers are now receiving their s3 demos and perhaps you might consider doing a af speed test with them. r/ mark edited august 6, 2020 by leicar10", "sortedWord": "None", "Identifyer": null, "identifyer": 27281, "year": "2020"}, {"autor": "LeicaR10", "date": "2020-08-09 02:12:00", "content": "BernardC, Your last sentence in your Post #13 is my same assessment. As I stated in earlier posts here, AF is something I don't use for landscape photography. The S cameras OVF is superb and ditto for the S lenses. Everyone has different requirements and may need AF and it is there. Sometimes, photographers seem to forget the S lens were designed on 13+ year old AF technology. What makes S lenses special are the optics. The S lenses were engineered from the ground up to work with digital sensors and can out resolve future sensor resolution improvements. If Leica wants to go beyond 60 MP, the S lenses optically will do that in spades. If photographers need or want faster AF...buy into the SL system or some other brand. But for myself and my demanding clients, the S system helps me create photographs they gladly buy. Last, IMO your post is spot on. r/ Mark", "link": "https://www.l-camera-forum.com/topic/311910-predictive-focusing-on-s3/?tab=comments#comment-4023839", "origin": "L-forum", "suborigin": "311910-predictive-focusing-on-s3", "result": true, "Selector": "me create", "selectorShort": "create", "MarkedSent": "bernardc, your last sentence in your post #13 is my same assessment. as i stated in earlier posts here, af is something i don't use for landscape photography. the s cameras ovf is superb and ditto for the s lenses. everyone has different requirements and may need af and it is there. sometimes, photographers seem to forget the s lens were designed on 13+ year old af technology. what makes s lenses special are the optics. the s lenses were engineered from the ground up to work with digital sensors and can out resolve future sensor resolution improvements. if leica wants to go beyond 60 mp, the s lenses optically will do that in spades. if photographers need or want faster af...buy into the sl system or some other brand. but for myself and my demanding clients, the s system helps -----> me !!!  -----> create !!!  photographs they gladly buy. last, imo your post is spot on. r/ mark", "sortedWord": "None", "Identifyer": null, "identifyer": 27294, "year": "2020"}, {"autor": "LeicaR10", "date": "2020-04-12 23:02:00", "content": "Djmay, I agree with your comments in your post #32. One can have the best and most expensive camera gear like the S3, Phase One, Hasselblad etc., and easily take ordinary, boring photos. Photographers seem to forget the camera and lenses are merely tools to capture a moment in time. There is a huge difference between a mere photo and one that is created to make the viewer; Stop, Look, Think and if possible Feel something about the moment in time. All the discussions about resolution and performance are in the grand scheme of photography are mute...it is the Content of the photograph that really matters and separates mere photos from those that are superb photographs. Every photographer has a reason for buying camera gear with most never mastering photography through content. Last, my corporate and private collectors rarely ask me what camera or lens I used to create a photograph. They buy and collect for the visionary impression the photograph renders at that moment in time, not for the resolution of the camera sensor or lens. r/ Mark", "link": "https://www.l-camera-forum.com/topic/308258-s3-vs-s006-vs-sl-resolution/page/2/?tab=comments#comment-3952538", "origin": "L-forum", "suborigin": "308258-s3-vs-s006-vs-sl-resolution", "result": true, "Selector": "i used to create", "selectorShort": "create", "MarkedSent": "djmay, i agree with your comments in your post #32. one can have the best and most expensive camera gear like the s3, phase one, hasselblad etc., and easily take ordinary, boring photos. photographers seem to forget the camera and lenses are merely tools to capture a moment in time. there is a huge difference between a mere photo and one that is created to make the viewer; stop, look, think and if possible feel something about the moment in time. all the discussions about resolution and performance are in the grand scheme of photography are mute...it is the content of the photograph that really matters and separates mere photos from those that are superb photographs. every photographer has a reason for buying camera gear with most never mastering photography through content. last, my corporate and private collectors rarely ask me what camera or lens -----> i !!!  -----> used !!!  -----> to !!!  -----> create !!!  a photograph. they buy and collect for the visionary impression the photograph renders at that moment in time, not for the resolution of the camera sensor or lens. r/ mark", "sortedWord": "None", "Identifyer": null, "identifyer": 28005, "year": "2020"}, {"autor": "glenerrolrd", "date": "2020-03-09 12:27:00", "content": " The comparison to Fuji is typical of a Japanese Consumer Products company . Any specification that can easily be measured or defined is compared . Examples MPs , pixel size etc. Almost none of which are particularly relevant to comparisons . Image Quality is a good example ...DxO Mark does a good job of evaluating sensor performance and explains how attributes affect typical usage . Portraits for example benefit from color depth which impacts your ability to define small graduations of tones . Landscape is more interested in dynamic range because it allows you to pull back the shadows ( and varies by ISO utilized ) . High ISO performance is important in Sports to allow for the higher shutter speeds . In addition cameras are set up thru firmware to spread the dynamic range across the tone curve ....Nikon s D5 squeezes the highlights and shadows to achieve amazing high ISO performance ..at the expense of midtone separation . A MF camera should have superb base ISO performance assuming at least some tripod usage . The Leica sensor used in the SL2 is very very competitive with ANY sensor out their ..DxO rates the Q a 96 and the S1R 99 . That’s comparable to the newest Sony sensor in the A7R4 . So the BS about Leica having old technology is just that BS . OVF verse EVF .....the viewfinder is a lot more than a means to focus .. An OVF allows the photographer to gain a feel for the subject I find impossible with an EVF . For seeing and composing I would take an OVF any day . An OVF can see everything you can see ..meaning a full DR as the eye sees it . Try that with an EVF ..example fashion on a beach ..good luck . We all know that OVF s can be outstanding or crap from the days of the SLR cameras . The Leica S has a typical Leica OVF which is terrific . On the other hand an OVF is awful for focus and EVF with a magnified view just establishes a totally different level of accuracy . Using fast lenses wide open with an OVF is almost luck dependent . I could create a list of dozen or more attributes that might be used to compare a Fuji EVF MF camera to the S3 ..in the end a good choice is dependent on the weights (importance ) the photographer places on these attributes .", "link": "https://www.l-camera-forum.com/topic/307247-the-s3-pricing-is-a-mistake/page/2/?tab=comments#comment-3927950", "origin": "L-forum", "suborigin": "307247-the-s3-pricing-is-a-mistake", "result": true, "Selector": "i could create", "selectorShort": "create", "MarkedSent": " the comparison to fuji is typical of a japanese consumer products company . any specification that can easily be measured or defined is compared . examples mps , pixel size etc. almost none of which are particularly relevant to comparisons . image quality is a good example ...dxo mark does a good job of evaluating sensor performance and explains how attributes affect typical usage . portraits for example benefit from color depth which impacts your ability to define small graduations of tones . landscape is more interested in dynamic range because it allows you to pull back the shadows ( and varies by iso utilized ) . high iso performance is important in sports to allow for the higher shutter speeds . in addition cameras are set up thru firmware to spread the dynamic range across the tone curve ....nikon s d5 squeezes the highlights and shadows to achieve amazing high iso performance ..at the expense of midtone separation . a mf camera should have superb base iso performance assuming at least some tripod usage . the leica sensor used in the sl2 is very very competitive with any sensor out their ..dxo rates the q a 96 and the s1r 99 . that’s comparable to the newest sony sensor in the a7r4 . so the bs about leica having old technology is just that bs . ovf verse evf .....the viewfinder is a lot more than a means to focus .. an ovf allows the photographer to gain a feel for the subject i find impossible with an evf . for seeing and composing i would take an ovf any day . an ovf can see everything you can see ..meaning a full dr as the eye sees it . try that with an evf ..example fashion on a beach ..good luck . we all know that ovf s can be outstanding or crap from the days of the slr cameras . the leica s has a typical leica ovf which is terrific . on the other hand an ovf is awful for focus and evf with a magnified view just establishes a totally different level of accuracy . using fast lenses wide open with an ovf is almost luck dependent . -----> i !!!  -----> could !!!  -----> create !!!  a list of dozen or more attributes that might be used to compare a fuji evf mf camera to the s3 ..in the end a good choice is dependent on the weights (importance ) the photographer places on these attributes .", "sortedWord": "None", "Identifyer": null, "identifyer": 28408, "year": "2020"}, {"autor": "LeicaR10", "date": "2020-03-18 10:41:00", "content": "Davidmknoble, I agree with you about the S system continuing on with Leica. I find it interesting that some S system photographers appear to forget the history of the camera. The S system saved Leica from oblivion. Dr Kaufmann and senior management realized the company could not compete in a bloated and super competitive DSLR market with fielding the R10. Hence the R10 and R system as a whole was cancelled. The company double downed and bet on creating the S system for professional photographers...not the masses. The S2 ($23K+) when initially fielded was herald by the pros and critics as a futuristic MF camera...ahead of its time. The camera and superior S lenses continue to outperform the competition for resolution, color, aberrations etc. The S cameras are all excellent for their intended design and capability afforded at the time of fielding. The S camera, lenses and photographs that are created are truly a class of its own. I keep reading photographers keep asking for more MPs and lenses for the S. For what end? Leica understands and listens to the pros whom the S system is designed to meet their requirements. All the lenses made to date, exceed most pros requirements. Professionally, if I was to need longer focal length, I can buy a Leica adapter and put a long lens on the S be it Contax or Hasselblad. PC lens...don't need it or want it. All PC corrections I need are fixed using Photoshop or Lightroom. Does the S need more than 64 MPs. Not needed for my corporate clients and private collectors photographs that I create for them. If I needed more, I would go rent/lease a Phase One for a particular job and return it. All the S lenses and now S3 more than meets many pro photographers requirements. So asking and expecting more from Leica for the S, I think one can expect improvements in firmware, perhaps AF and maybe some day a EVF vs OVF. For many pros we continue to ask Leica to keep the OVF vs EVF. Last, I feel photographers would be better served and find more enjoyment using their current camera if they spent their time creating beautiful and enduring photographs rather than looking for the next model of whatever. r/ Mark Edited March 18, 2020 by LeicaR10", "link": "https://www.l-camera-forum.com/topic/307363-s3-predictions-live-or-die/?tab=comments#comment-3933765", "origin": "L-forum", "suborigin": "307363-s3-predictions-live-or-die", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "davidmknoble, i agree with you about the s system continuing on with leica. i find it interesting that some s system photographers appear to forget the history of the camera. the s system saved leica from oblivion. dr kaufmann and senior management realized the company could not compete in a bloated and super competitive dslr market with fielding the r10. hence the r10 and r system as a whole was cancelled. the company double downed and bet on creating the s system for professional photographers...not the masses. the s2 ($23k+) when initially fielded was herald by the pros and critics as a futuristic mf camera...ahead of its time. the camera and superior s lenses continue to outperform the competition for resolution, color, aberrations etc. the s cameras are all excellent for their intended design and capability afforded at the time of fielding. the s camera, lenses and photographs that are created are truly a class of its own. i keep reading photographers keep asking for more mps and lenses for the s. for what end? leica understands and listens to the pros whom the s system is designed to meet their requirements. all the lenses made to date, exceed most pros requirements. professionally, if i was to need longer focal length, i can buy a leica adapter and put a long lens on the s be it contax or hasselblad. pc lens...don't need it or want it. all pc corrections i need are fixed using photoshop or lightroom. does the s need more than 64 mps. not needed for my corporate clients and private collectors photographs that -----> i !!!  -----> create !!!  for them. if i needed more, i would go rent/lease a phase one for a particular job and return it. all the s lenses and now s3 more than meets many pro photographers requirements. so asking and expecting more from leica for the s, i think one can expect improvements in firmware, perhaps af and maybe some day a evf vs ovf. for many pros we continue to ask leica to keep the ovf vs evf. last, i feel photographers would be better served and find more enjoyment using their current camera if they spent their time creating beautiful and enduring photographs rather than looking for the next model of whatever. r/ mark edited march 18, 2020 by leicar10", "sortedWord": "None", "Identifyer": null, "identifyer": 28498, "year": "2020"}, {"autor": "davidmknoble", "date": "2020-03-18 12:33:00", "content": "1 hour ago, LeicaR10 said: Does the S need more than 64 MPs. Not needed for my corporate clients and private collectors photographs that I create for them. If @LeicaR10 well said. You know, I don't have wall space to hang multiple 128 MP images up and I probably don't have the skills to handhold any camera at that resolution without some shake (that has a mirror). I am happy with 37.5 MP and I hope to get the S3 over time as I think it will have some image enhancement out of the camera compared to the S007. I am wondering if Leica will create the SEV with an EVF and maybe higher MP, but also have an S4 with optical and stop at 64 MP. Interestingly, I still use my longest focal lengths with the SL- the APO R 280mm f/2.8 with an APO 1.4 and 2.0 converter, and I also have a Nikon 500mm f/4 P ED-IF with a 1.4 converter. Of course I use a tripod, but those provide me wildlife and extended work. Stopping at 180mm for the S is fine and I get great landscape shots with that. Nice post, would enjoy seeing your work... David.", "link": "https://www.l-camera-forum.com/topic/307363-s3-predictions-live-or-die/?tab=comments#comment-3933829", "origin": "L-forum", "suborigin": "307363-s3-predictions-live-or-die", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "1 hour ago, leicar10 said: does the s need more than 64 mps. not needed for my corporate clients and private collectors photographs that -----> i !!!  -----> create !!!  for them. if @leicar10 well said. you know, i don't have wall space to hang multiple 128 mp images up and i probably don't have the skills to handhold any camera at that resolution without some shake (that has a mirror). i am happy with 37.5 mp and i hope to get the s3 over time as i think it will have some image enhancement out of the camera compared to the s007. i am wondering if leica will create the sev with an evf and maybe higher mp, but also have an s4 with optical and stop at 64 mp. interestingly, i still use my longest focal lengths with the sl- the apo r 280mm f/2.8 with an apo 1.4 and 2.0 converter, and i also have a nikon 500mm f/4 p ed-if with a 1.4 converter. of course i use a tripod, but those provide me wildlife and extended work. stopping at 180mm for the s is fine and i get great landscape shots with that. nice post, would enjoy seeing your work... david.", "sortedWord": "None", "Identifyer": null, "identifyer": 28499, "year": "2020"}, {"autor": "Tears Everywhere", "date": "2020-05-04 10:57:00", "content": "I should create a new topic: Romance of the three optical giants: Taylor Hobson, Schneider and Leica. 😄", "link": "https://www.l-camera-forum.com/topic/309062-leitz-xenon-5cm-f15-brief-guide-rumors-and-facts/page/3/?tab=comments#comment-3966721", "origin": "L-forum", "suborigin": "309062-leitz-xenon-5cm-f15-brief-guide-rumors-and-facts", "result": true, "Selector": "i should create", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> should !!!  -----> create !!!  a new topic: romance of the three optical giants: taylor hobson, schneider and leica. 😄", "sortedWord": "None", "Identifyer": null, "identifyer": 36766, "year": "2020"}, {"autor": "willeica", "date": "2020-05-04 12:08:00", "content": " 6 hours ago, derleicaman said: Greetings to you all. The Xenon has always been a favorite of mine, and currently I have seven in my collection. I don’t know if it is the romantic notion of a high speed lens from the early days of the Leica, or just the name itself. It’s just cool! Anyway, I am extending an invitation to you all here to write an in depth article on the Xenon, or perhaps a series of articles for the LHSA Viewfinder. I am thinking something along the lines of development, production and variations and the patent story. I did include one of my Xenons in my Bokeh Kings article a few years ago. Well, who’s up for the challenge? William, Tears Everywhere, pgk, Roydonian? Let’s do it! Thanks Bill, I'm happy to throw in my few pennies/cents. I'm with Paul (pgk) in saying that this is a story which does not begin with Schneider and end with Leitz. While any magazine article must have boundaries, the story of camera lens development is a continuous one from the 1840s up to the present and, even then, the story begins way before that period. In the Royal Dublin Dublin Society (RDS), where I am a member, we have an original example of the first edition of Newton's Opticks which was published in 1704 and which was the cornerstone of a lot of subsequent optical studies. I recently had a chance to inspect it and found that someone had actually borrowed the book on a library ticket around 1960. Thankfully, the book was returned within the requisite two weeks as the most recent copy of the original edition which sold at auction fetched about $90,000. I have not contacted Jim Lager yet about this specific Xenon topic as the details were coming in very thick and fast over the weekend. I'm also looking around for a topic for a possible LHSA ZOOM meeting hosted from Dublin during the Summer while we are all in full or semi lockdown. I'm trying to find a 'vintage theme' that will engage members. 1 hour ago, Tears Everywhere said: I should create a new topic: Romance of the three optical giants: Taylor Hobson, Schneider and Leica. 😄 Tears Everywhere, you seem to have a lot of material. I have written over 40 articles on photography and cameras, a lot of them about vintage Leicas, for various publications and websites over the past 5 years and I would also be happy to give a hand with any drafting for a Viewfinder article. William", "link": "https://www.l-camera-forum.com/topic/309062-leitz-xenon-5cm-f15-brief-guide-rumors-and-facts/page/4/?tab=comments#comment-3966764", "origin": "L-forum", "suborigin": "309062-leitz-xenon-5cm-f15-brief-guide-rumors-and-facts", "result": true, "Selector": "i should create", "selectorShort": "create", "MarkedSent": " 6 hours ago, derleicaman said: greetings to you all. the xenon has always been a favorite of mine, and currently i have seven in my collection. i don’t know if it is the romantic notion of a high speed lens from the early days of the leica, or just the name itself. it’s just cool! anyway, i am extending an invitation to you all here to write an in depth article on the xenon, or perhaps a series of articles for the lhsa viewfinder. i am thinking something along the lines of development, production and variations and the patent story. i did include one of my xenons in my bokeh kings article a few years ago. well, who’s up for the challenge? william, tears everywhere, pgk, roydonian? let’s do it! thanks bill, i'm happy to throw in my few pennies/cents. i'm with paul (pgk) in saying that this is a story which does not begin with schneider and end with leitz. while any magazine article must have boundaries, the story of camera lens development is a continuous one from the 1840s up to the present and, even then, the story begins way before that period. in the royal dublin dublin society (rds), where i am a member, we have an original example of the first edition of newton's opticks which was published in 1704 and which was the cornerstone of a lot of subsequent optical studies. i recently had a chance to inspect it and found that someone had actually borrowed the book on a library ticket around 1960. thankfully, the book was returned within the requisite two weeks as the most recent copy of the original edition which sold at auction fetched about $90,000. i have not contacted jim lager yet about this specific xenon topic as the details were coming in very thick and fast over the weekend. i'm also looking around for a topic for a possible lhsa zoom meeting hosted from dublin during the summer while we are all in full or semi lockdown. i'm trying to find a 'vintage theme' that will engage members. 1 hour ago, tears everywhere said: -----> i !!!  -----> should !!!  -----> create !!!  a new topic: romance of the three optical giants: taylor hobson, schneider and leica. 😄 tears everywhere, you seem to have a lot of material. i have written over 40 articles on photography and cameras, a lot of them about vintage leicas, for various publications and websites over the past 5 years and i would also be happy to give a hand with any drafting for a viewfinder article. william", "sortedWord": "None", "Identifyer": null, "identifyer": 36767, "year": "2020"}, {"autor": "Rona!d", "date": "2020-10-22 13:57:00", "content": "My kids (and I) are having a highly modified 1/10 scale 406 to teach them off-road driving. Has reduction gear, 4WD, high torque motor, diff-locks, winch which can tow the vehicles weight (about 4 kg) vertically, all RC equipment water sealed etc. I created a track for their Unimog driving license, they are pretty good in driving low speed. One day we´ll have to get this in fullsize they say, but as a convertible 😉 --img-- ", "link": "https://www.l-camera-forum.com/topic/313277-unimog/?tab=comments#comment-4066748", "origin": "L-forum", "suborigin": "313277-unimog", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "my kids (and i) are having a highly modified 1/10 scale 406 to teach them off-road driving. has reduction gear, 4wd, high torque motor, diff-locks, winch which can tow the vehicles weight (about 4 kg) vertically, all rc equipment water sealed etc. -----> i !!!  -----> created !!!  a track for their unimog driving license, they are pretty good in driving low speed. one day we´ll have to get this in fullsize they say, but as a convertible 😉 --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 58707, "year": "2020"}, {"autor": "Dennis", "date": "2020-12-28 17:35:00", "content": " I can bet that with a Nikon D700 (to mention one) and a specific Nikon ED lens, plus Capture One, I can create whatever look you want. I understand the character, rendering, 3d-pop... But the Leica look, I think it doesn't exist. Like the Cron King of Bokeh... They are urban legends, keen to tell in our stories, but they are not based on anything. and by the way, whatever the Leica-look looks like, I like it very much. 🙌 Good vibes", "link": "https://www.l-camera-forum.com/topic/316440-the-main-problem-of-the-leica-look/page/4/?tab=comments#comment-4107409", "origin": "L-forum", "suborigin": "316440-the-main-problem-of-the-leica-look", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": " -----> i !!!  -----> can !!!  bet that with a nikon d700 (to mention one) and a specific nikon ed lens, plus capture one, -----> i !!!  -----> can !!!  -----> create !!!  whatever look you want. i understand the character, rendering, 3d-pop... but the leica look, i think it doesn't exist. like the cron king of bokeh... they are urban legends, keen to tell in our stories, but they are not based on anything. and by the way, whatever the leica-look looks like, i like it very much. 🙌 good vibes", "sortedWord": "None", "Identifyer": null, "identifyer": 81729, "year": "2020"}, {"autor": "Chaemono", "date": "2020-12-28 17:40:00", "content": "vor 1 Minute schrieb Dennis: I can bet that with a Nikon D700 (to mention one) and a specific Nikon ED lens, plus Capture One, I can create whatever look you want. I understand the character, rendering, 3d-pop... But the Leica look, I think it doesn't exist. Like the Cron King of Bokeh... They are urban legends, keen to tell in our stories, but they are not based on anything. and by the way, whatever the Leica-look looks like, I like it very much. 🙌 Good vibes Many times you probably can emulate it. Last sentence of the write-up. https://www.artphotoacademy.com/the-leica-look/ With an existing computer technology it is entirely possible to emulate the Leica look in post-production, yet, getting it in-camera takes no time, while the alternative requires serious Photoshop skills, sizable amounts of time and, in the first place, knowing what you are trying to emulate.", "link": "https://www.l-camera-forum.com/topic/316440-the-main-problem-of-the-leica-look/page/4/?tab=comments#comment-4107412", "origin": "L-forum", "suborigin": "316440-the-main-problem-of-the-leica-look", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "vor 1 minute schrieb dennis: -----> i !!!  -----> can !!!  bet that with a nikon d700 (to mention one) and a specific nikon ed lens, plus capture one, -----> i !!!  -----> can !!!  -----> create !!!  whatever look you want. i understand the character, rendering, 3d-pop... but the leica look, i think it doesn't exist. like the cron king of bokeh... they are urban legends, keen to tell in our stories, but they are not based on anything. and by the way, whatever the leica-look looks like, i like it very much. 🙌 good vibes many times you probably can emulate it. last sentence of the write-up. https://www.artphotoacademy.com/the-leica-look/ with an existing computer technology it is entirely possible to emulate the leica look in post-production, yet, getting it in-camera takes no time, while the alternative requires serious photoshop skills, sizable amounts of time and, in the first place, knowing what you are trying to emulate.", "sortedWord": "None", "Identifyer": null, "identifyer": 81730, "year": "2020"}, {"autor": "LBJ2", "date": "2020-12-28 17:55:00", "content": "15 minutes ago, Dennis said: I can bet that with a Nikon D700 (to mention one) and a specific Nikon ED lens, plus Capture One, I can create whatever look you want. I understand the character, rendering, 3d-pop... But the Leica look, I think it doesn't exist. Like the Cron King of Bokeh... They are urban legends, keen to tell in our stories, but they are not based on anything. and by the way, whatever the Leica-look looks like, I like it very much. 🙌 Good vibes You have a lot of company with similar sentiments! At the end of the day a memorable image is made up of many attributes. A certain optical signature is only part of the final result. I've seen beautiful images that are to my eye, flat as a pancake for instance, and void of any signature look. I like the saying if you want an interesting image take a picture of something interesting!", "link": "https://www.l-camera-forum.com/topic/316440-the-main-problem-of-the-leica-look/page/4/?tab=comments#comment-4107431", "origin": "L-forum", "suborigin": "316440-the-main-problem-of-the-leica-look", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "15 minutes ago, dennis said: -----> i !!!  -----> can !!!  bet that with a nikon d700 (to mention one) and a specific nikon ed lens, plus capture one, -----> i !!!  -----> can !!!  -----> create !!!  whatever look you want. i understand the character, rendering, 3d-pop... but the leica look, i think it doesn't exist. like the cron king of bokeh... they are urban legends, keen to tell in our stories, but they are not based on anything. and by the way, whatever the leica-look looks like, i like it very much. 🙌 good vibes you have a lot of company with similar sentiments! at the end of the day a memorable image is made up of many attributes. a certain optical signature is only part of the final result. i've seen beautiful images that are to my eye, flat as a pancake for instance, and void of any signature look. i like the saying if you want an interesting image take a picture of something interesting!", "sortedWord": "None", "Identifyer": null, "identifyer": 81732, "year": "2020"}, {"autor": "LocalHero1953", "date": "2020-06-11 12:07:00", "content": "I've had to go back and check how I've set it up. It's actually not a list of unread posts or threads, but a list of the latest threads with posts, but only for those forums and subforums I've selected. I created a new activity stream: under 'Show me' I selected 'Content only'; under 'Content types' I selected 'Topics'. That shows an arrow for a drop box where you can select the forums/subforums of interest. Edited June 11, 2020 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/310297-sifting-new-forum-content/?tab=comments#comment-3991438", "origin": "L-forum", "suborigin": "310297-sifting-new-forum-content", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "i've had to go back and check how i've set it up. it's actually not a list of unread posts or threads, but a list of the latest threads with posts, but only for those forums and subforums i've selected. -----> i !!!  -----> created !!!  a new activity stream: under 'show me' -----> i !!!  selected 'content only'; under 'content types' -----> i !!!  selected 'topics'. that shows an arrow for a drop box where you can select the forums/subforums of interest. edited june 11, 2020 by localhero1953", "sortedWord": "None", "Identifyer": null, "identifyer": 82829, "year": "2020"}, {"autor": "Exodies", "date": "2020-05-22 22:23:00", "content": "9 hours ago, zeitz said: Exodies, how do you move the files from your Mac to your iPhone and iPad? Do you use the Adobe cloud in your Adobe subscription or do you use an Apple cloud? <snip> I upload from the SD card to either the iPad or the Mac using the USBc card reader from Apple. Lightroom on the Mac is configured to duplicate to local storage any pictures in Lightroom mobile. I create a synchronised collection on Mac for any pictures I want to share which I first uploaded to Mac. So, all pictures are on the Mac, some pictures are also in Adobe’s cloud.", "link": "https://www.l-camera-forum.com/topic/309745-preferred-cloud-storage/?tab=comments#comment-3978584", "origin": "L-forum", "suborigin": "309745-preferred-cloud-storage", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "9 hours ago, zeitz said: exodies, how do you move the files from your mac to your iphone and ipad? do you use the adobe cloud in your adobe subscription or do you use an apple cloud? <snip> i upload from the sd card to either the ipad or the mac using the usbc card reader from apple. lightroom on the mac is configured to duplicate to local storage any pictures in lightroom mobile. -----> i !!!  -----> create !!!  a synchronised collection on mac for any pictures -----> i !!!  want to share which -----> i !!!  first uploaded to mac. so, all pictures are on the mac, some pictures are also in adobe’s cloud.", "sortedWord": "None", "Identifyer": null, "identifyer": 90705, "year": "2020"}, {"autor": "Dennis", "date": "2020-05-22 23:39:00", "content": " Nothing better for me than DropBox. 3Tb storage, my two computers and my mobile is sync to it. Every time I create a new folder, I change a name to a picture or whatever changes you are doing, everything is sync. You can share links (password protected or not) have comments on line, see who watch and download your files when shared. My Capture One Catalogs are synced Besides a couple of external HD where I have everything, plus a Time Machine on the iMac, DropBox is the man!", "link": "https://www.l-camera-forum.com/topic/309745-preferred-cloud-storage/?tab=comments#comment-3978610", "origin": "L-forum", "suborigin": "309745-preferred-cloud-storage", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": " nothing better for me than dropbox. 3tb storage, my two computers and my mobile is sync to it. every time -----> i !!!  -----> create !!!  a new folder, -----> i !!!  change a name to a picture or whatever changes you are doing, everything is sync. you can share links (password protected or not) have comments on line, see who watch and download your files when shared. my capture one catalogs are synced besides a couple of external hd where i have everything, plus a time machine on the imac, dropbox is the man!", "sortedWord": "None", "Identifyer": null, "identifyer": 90706, "year": "2020"}, {"autor": "adan", "date": "2020-01-03 20:50:00", "content": "If one's goal is simply to put a ball into a hole, there are lots of better ways of doing it than hitting the ball with a crooked stick. But what happens to, say, \"The Masters\" - when every player reaches the clubhouse with a score of 18? I'm not sure who would be the bigger \"control freak.\" Me with my manual RF and occasionally difficult lenses - or someone assembling their pictures computationally? Maybe H-CB was right - throw away the camera and go back to the pencil. Although someone at the gallery was showing me his AI-computed \"paintings\" just a couple of days ago. Rather boring printed flat on metal - but with 3D printing to reproduce the \"brushstrokes\"....? I'm glad I experienced photography when the technology was \"diverse\" - tens of film types, a dozen different formats that could not easily be substituted for one another, alternative processes (silver, gum, carbon, C-41, Cibachrome, dye-transfers, cyanotype, ambrotype/tintype), lenses from Leica to Lomo, each with their own characteristic limitations - and thus their own unavoidably unique character. Of course that can all be simulated in a virtual world - we can create a \"75 Summilux\" or a \"Hasselblad SWC\" algorithm. But I like the authenticity of a real SWC image, where there is a black border with notches in it, and a specific DoF for a specific FoV - because that particular device was built that way in the first place. And is in B&W not because it was computed from a color image, but because I made a command decision - before even leaving the house - that my cameras would be loaded with B&W film that day. Nor colorized because I changed my mind later. Not because someone selected a menu item labelled \"Hassy SWC_border_f16_B&W.\" (BTW, such a computed image would be rejected by the press contests I contribute to.) --img--  I'm not an old fogey - change and the future are inescapable, and humans will develop any possible technology eventually. Change, in fact, makes for more interesting reportage photography - humans are always doing the darndest new things, and that makes for \"new\" pictures even with \"old\" gear. But I have a subtle worry that a technological sameness - everything reduced to 1s and 0s - may produce a gray social conformity and leveling that the authoritarian regimes of the 20th century could have only dreamt of.", "link": "https://www.l-camera-forum.com/topic/303745-computational-photography/page/2/?tab=comments#comment-3884511", "origin": "L-forum", "suborigin": "303745-computational-photography", "result": true, "Selector": "we can create", "selectorShort": "create", "MarkedSent": "if one's goal is simply to put a ball into a hole, there are lots of better ways of doing it than hitting the ball with a crooked stick. but what happens to, say, \"the masters\" - when every player reaches the clubhouse with a score of 18? i'm not sure who would be the bigger \"control freak.\" me with my manual rf and occasionally difficult lenses - or someone assembling their pictures computationally? maybe h-cb was right - throw away the camera and go back to the pencil. although someone at the gallery was showing me his ai-computed \"paintings\" just a couple of days ago. rather boring printed flat on metal - but with 3d printing to reproduce the \"brushstrokes\"....? i'm glad i experienced photography when the technology was \"diverse\" - tens of film types, a dozen different formats that could not easily be substituted for one another, alternative processes (silver, gum, carbon, c-41, cibachrome, dye-transfers, cyanotype, ambrotype/tintype), lenses from leica to lomo, each with their own characteristic limitations - and thus their own unavoidably unique character. of course that -----> can !!!  all be simulated in a virtual world - -----> we !!!  -----> can !!!  -----> create !!!  a \"75 summilux\" or a \"hasselblad swc\" algorithm. but i like the authenticity of a real swc image, where there is a black border with notches in it, and a specific dof for a specific fov - because that particular device was built that way in the first place. and is in b&w not because it was computed from a color image, but because i made a command decision - before even leaving the house - that my cameras would be loaded with b&w film that day. nor colorized because i changed my mind later. not because someone selected a menu item labelled \"hassy swc_border_f16_b&w.\" (btw, such a computed image would be rejected by the press contests i contribute to.) --img--  i'm not an old fogey - change and the future are inescapable, and humans will develop any possible technology eventually. change, in fact, makes for more interesting reportage photography - humans are always doing the darndest new things, and that makes for \"new\" pictures even with \"old\" gear. but i have a subtle worry that a technological sameness - everything reduced to 1s and 0s - may produce a gray social conformity and leveling that the authoritarian regimes of the 20th century could have only dreamt of.", "sortedWord": "None", "Identifyer": null, "identifyer": 90914, "year": "2020"}, {"autor": "A miller", "date": "2020-02-23 03:09:00", "content": "Great thought, Pete, but I fear this may be too narrow in scope for a engaging thread. It reminds me of the time when I started a Flickr group of IIIg users in NYC - it never went anywhere. Or, the slightly more successful series of threads that I created in the Leica Lens subform for various different types of specific lenses (the idea being that people will populate the thread with photos from a single lens, such as the 50mm summilux). It got some engagement for a few weeks and then fizzled. My suggestion would be to just join the fun on the \"I Like Film\" thread. Embrace it - it is really quite unique!", "link": "https://www.l-camera-forum.com/topic/306690-film-series-kodak-tmax-400/?tab=comments#comment-3918050", "origin": "L-forum", "suborigin": "306690-film-series-kodak-tmax-400", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "great thought, pete, but i fear this may be too narrow in scope for a engaging thread. it reminds me of the time when i started a flickr group of iiig users in nyc - it never went anywhere. or, the slightly more successful series of threads that -----> i !!!  -----> created !!!  in the leica lens subform for various different types of specific lenses (the idea being that people will populate the thread with photos from a single lens, such as the 50mm summilux). it got some engagement for a few weeks and then fizzled. my suggestion would be to just join the fun on the \"i like film\" thread. embrace it - it is really quite unique!", "sortedWord": "None", "Identifyer": null, "identifyer": 101689, "year": "2020"}, {"autor": "LocalHero1953", "date": "2020-12-11 08:19:00", "content": "I created large format negatives from digital images and then contact printed cyanotypes from them. I did the conversion in Lightroom with an inverted tone curve, and printed onto digital transfer film.", "link": "https://www.l-camera-forum.com/topic/315992-digital-negatives/?tab=comments#comment-4096362", "origin": "L-forum", "suborigin": "315992-digital-negatives", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> created !!!  large format negatives from digital images and then contact printed cyanotypes from them. i did the conversion in lightroom with an inverted tone curve, and printed onto digital transfer film.", "sortedWord": "None", "Identifyer": null, "identifyer": 104556, "year": "2020"}, {"autor": "Keith (M)", "date": "2020-12-11 19:45:00", "content": "No problems running LR Classic v10.1 on my iMac (2017 21.5\", 16GB, Radeon Pro 560 4GB) with Catalina 10.15.7. I installed Big Sur 11.0.1. on my 8GB 2017 MB 13\" to see if there were likely to be problems and in the main it has been trouble free. Currently LR Classic is v10.0 and runs fine. The only hiccup I've noticed is that the PS 'Actions' I had created have disappeared.", "link": "https://www.l-camera-forum.com/topic/316004-lr-classic-101-freezes-computers/?tab=comments#comment-4096796", "origin": "L-forum", "suborigin": "316004-lr-classic-101-freezes-computers", "result": true, "Selector": "i had created", "selectorShort": "create", "MarkedSent": "no problems running lr classic v10.1 on my imac (2017 21.5\", 16gb, radeon pro 560 4gb) with catalina 10.15.7. i installed big sur 11.0.1. on my 8gb 2017 mb 13\" to see if there were likely to be problems and in the main it has been trouble free. currently lr classic is v10.0 and runs fine. the only hiccup -----> i !!! 've noticed is that the ps 'actions' -----> i !!!  -----> had !!!  -----> created !!!  have disappeared.", "sortedWord": "None", "Identifyer": null, "identifyer": 109449, "year": "2020"}, {"autor": "ianforber", "date": "2020-08-19 16:09:00", "content": " Apologies if this has been discussed before - I tried a search but couldn’t find anything. I am trying to refine my haphazard workflow now that I have a nice new Q2. I’ve decided to ditch Lightroom because I never got on with it, having previously used Aperture for years. I’ve been using Luminar 4 for a few months but am trialling Capture One at the moment and it looks likely that I’ll move over to C1 when my trial is over. The question I’m wrestling with is whether to bother keeping my raw/DNG files or to refine a workflow focused on the “final” jpeg/tiff. The context is that I’m a purely hobbyist photographer and a pretty poor one at that. I’ve been taking photographs on and off since the late 1970s but more regularly since 2003-ish. My digital archive currently consists of around 2000 files - I delete most of what I take because it isn’t very good and about half of my archive only survives because it has sentimental value rather than artistic merit. Same with film - I take much less film-based images these days but most gets dumped immediately and I probably have a third-full A4 binder with 35mm and medium format slide and negs: if I lost that tomorrow it wouldn’t bother me because they aren’t very good. That might sound depressing but isn’t meant to - I’m always trying to up my game! Over half of my photographs are black and white, so I process the few DNG that make it past initial deletion. Sometimes, I have left it at that, sometimes I have created a final jpeg/tiff version that bakes in the changes. I’m just wondering whether to always do that, produce a tiff version and delete everything else, including the original DNG and rely on whatever software I use (eg C1) any small jpegs I might need in the future. Does this make sense? I can’t remember ever going back to a raw file and reprocessing it so I am wondering why I’m keeping any of them. Thank you in advance for any thoughts to help me out of my confusion!", "link": "https://www.l-camera-forum.com/topic/312468-do-you-delete-your-rawdng-if-not-why-not/?tab=comments#comment-4029755", "origin": "L-forum", "suborigin": "312468-do-you-delete-your-rawdng-if-not-why-not", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": " apologies if this has been discussed before - i tried a search but couldn’t find anything. i am trying to refine my haphazard workflow now that i have a nice new q2. i’ve decided to ditch lightroom because i never got on with it, having previously used aperture for years. i’ve been using luminar 4 for a few months but am trialling capture one at the moment and it looks likely that i’ll move over to c1 when my trial is over. the question i’m wrestling with is whether to bother keeping my raw/dng files or to refine a workflow focused on the “final” jpeg/tiff. the context is that i’m a purely hobbyist photographer and a pretty poor one at that. i’ve been taking photographs on and off since the late 1970s but more regularly since 2003-ish. my digital archive currently consists of around 2000 files - i delete most of what i take because it isn’t very good and about half of my archive only survives because it has sentimental value rather than artistic merit. same with film - i take much less film-based images these days but most gets dumped immediately and i probably have a third-full a4 binder with 35mm and medium format slide and negs: if i lost that tomorrow it wouldn’t bother me because they aren’t very good. that might sound depressing but isn’t meant to - i’m always trying to up my game! over half of my photographs are black and white, so i process the few dng that make it past initial deletion. sometimes, -----> i !!!  -----> have !!!  left it at that, sometimes -----> i !!!  -----> have !!!  -----> created !!!  a final jpeg/tiff version that bakes in the changes. i’m just wondering whether to always do that, produce a tiff version and delete everything else, including the original dng and rely on whatever software i use (eg c1) any small jpegs i might need in the future. does this make sense? i can’t remember ever going back to a raw file and reprocessing it so i am wondering why i’m keeping any of them. thank you in advance for any thoughts to help me out of my confusion!", "sortedWord": "None", "Identifyer": null, "identifyer": 110045, "year": "2020"}, {"autor": "marchyman", "date": "2020-08-19 18:45:00", "content": "17 minutes ago, andybarton said: Would you throw away your film negatives? I'm with andybarton on this. I currently process in Capture One and use a process recipe to generate jpeg images that I'm going to share. Once those jpeg image have been uploaded to a web server, photo site, etc., they are deleted. I can always create the jpeg again if needed. About the only images I throw away are those of the inside of the lens cap, my out-of-focus feet, etc.", "link": "https://www.l-camera-forum.com/topic/312468-do-you-delete-your-rawdng-if-not-why-not/?tab=comments#comment-4029820", "origin": "L-forum", "suborigin": "312468-do-you-delete-your-rawdng-if-not-why-not", "result": true, "Selector": "i can always create", "selectorShort": "create", "MarkedSent": "17 minutes ago, andybarton said: would you throw away your film negatives? i'm with andybarton on this. i currently process in capture one and use a process recipe to generate jpeg images that i'm going to share. once those jpeg image have been uploaded to a web server, photo site, etc., they are deleted. -----> i !!!  -----> can !!!  -----> always !!!  -----> create !!!  the jpeg again if needed. about the only images i throw away are those of the inside of the lens cap, my out-of-focus feet, etc.", "sortedWord": "None", "Identifyer": null, "identifyer": 110052, "year": "2020"}, {"autor": "LocalHero1953", "date": "2020-12-27 08:15:00", "content": "22 hours ago, P1505 said: Hi all. Does anyone here have any real world experience of using the panels from here: https://www.bwvision.com/bw-artisan-pro-panel/ Im wanting to move beyond basic and global presets like Silver Efex and Lightroom presets. But I also don’t want to spend days in Photoshop per photo. Hours is fine, days is not. Not yet anyway. The concept of selections and masks to apply various highlights etc, i quite like that idea. Im more into documentary than fine art architecture or landscape. So for most of the projects I’m working on the editing is as minimal as possible. Colour tweaks to keep the series consistent but no cropping and never any manipulation. But I do like the idea of have a couple of image series Whitchurch are more heavily played with. More art, less documentary. Then you have an obvious route that doesn't require you to spend more money: use Lightroom without using presets. Silverefex ditto. It was a very long time before I started using presets in Lightroom. Even now, the presets I use in Lightroom are almost all ones I have created myself. Both apps are powerful. I spend quite a lot of time post processing; almost all of it is in Lightroom, jumping to Photoshop when it is easier there (e.g. content-aware fill, precise masking). If I use Silverefex, it is often as a smart layer from within Photoshop, so that I can adjust the Nik tools non-destructively. If I felt I'd have to spend days in Photoshop then I'd conclude that I'd taken the wrong photo to start with. If I'm spending long hours, it's simply because I'm experimenting or learning.", "link": "https://www.l-camera-forum.com/topic/316427-bw-artisan-pro-panels/?tab=comments#comment-4106452", "origin": "L-forum", "suborigin": "316427-bw-artisan-pro-panels", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "22 hours ago, p1505 said: hi all. does anyone here have any real world experience of using the panels from here: https://www.bwvision.com/bw-artisan-pro-panel/ im wanting to move beyond basic and global presets like silver efex and lightroom presets. but i also don’t want to spend days in photoshop per photo. hours is fine, days is not. not yet anyway. the concept of selections and masks to apply various highlights etc, i quite like that idea. im more into documentary than fine art architecture or landscape. so for most of the projects i’m working on the editing is as minimal as possible. colour tweaks to keep the series consistent but no cropping and never any manipulation. but i do like the idea of have a couple of image series whitchurch are more heavily played with. more art, less documentary. then you have an obvious route that doesn't require you to spend more money: use lightroom without using presets. silverefex ditto. it was a very long time before i started using presets in lightroom. even now, the presets -----> i !!!  use in lightroom are almost all ones -----> i !!!  -----> have !!!  -----> created !!!  myself. both apps are powerful. i spend quite a lot of time post processing; almost all of it is in lightroom, jumping to photoshop when it is easier there (e.g. content-aware fill, precise masking). if i use silverefex, it is often as a smart layer from within photoshop, so that i can adjust the nik tools non-destructively. if i felt i'd have to spend days in photoshop then i'd conclude that i'd taken the wrong photo to start with. if i'm spending long hours, it's simply because i'm experimenting or learning.", "sortedWord": "None", "Identifyer": null, "identifyer": 110248, "year": "2020"}, {"autor": "01maciel", "date": "2020-12-13 10:30:00", "content": " Thanks for all the feedback I was asking for. Agreed, the blurry frame is way too large. After a day or so the outer frame looks quite rediculous to me. Can't remember why I decided to stick that frame around the white frame. vor 48 Minuten schrieb LocalHero1953: The important thing for me is to work out WHY my image was rubbish and avoid that mistake next time. IMHO this is the key point. Sort of root cause analysis. Nowadays, digital photography means one can take a myriad of photos. Difficult enough to classify the photos later on into 'OK' and 'dull'. vor 7 Stunden schrieb mnutzer: What would you like to show us, a bumpy road of cobblestones next to the time on a factory clock? Good point. Sometimes there is content in a photo, sometimes it looks just like a nice photo with bright colours, nice people. It depends on what the photographer wants to show. This photo above actually has some content, even a mini story, at least in my mind: The old road which is in need of repair apparently, an empty builing, the clock- could be a symbol of standstill (in fact the clock didn't work anymore and the time is not accurate). Finally and to underline the story is the old lady left hand side with a walking aid pointing to the big picture: the leftovers, the residual population of an entire region. - I guess, I was not able to show this mini story in the photo since you were asking for content. Which in turn means I still have to improve my photography skills:) One more reason to go out and get some more practice. I'll try to create a new version of the photo shortly. I look forward to seeing this prensentation improved and finalized.", "link": "https://www.l-camera-forum.com/topic/316038-presentation-is-everything/?tab=comments#comment-4097800", "origin": "L-forum", "suborigin": "316038-presentation-is-everything", "result": true, "Selector": "i'll try to create", "selectorShort": "create", "MarkedSent": " thanks for all the feedback i was asking for. agreed, the blurry frame is way too large. after a day or so the outer frame looks quite rediculous to me. can't remember why i decided to stick that frame around the white frame. vor 48 minuten schrieb localhero1953: the important thing for me is to work out why my image was rubbish and avoid that mistake next time. imho this is the key point. sort of root cause analysis. nowadays, digital photography means one can take a myriad of photos. difficult enough to classify the photos later on into 'ok' and 'dull'. vor 7 stunden schrieb mnutzer: what would you like to show us, a bumpy road of cobblestones next to the time on a factory clock? good point. sometimes there is content in a photo, sometimes it looks just like a nice photo with bright colours, nice people. it depends on what the photographer wants to show. this photo above actually has some content, even a mini story, at least in my mind: the old road which is in need of repair apparently, an empty builing, the clock- could be a symbol of standstill (in fact the clock didn't work anymore and the time is not accurate). finally and to underline the story is the old lady left hand side with a walking aid pointing to the big picture: the leftovers, the residual population of an entire region. - i guess, i was not able to show this mini story in the photo since you were asking for content. which in turn means i still have to improve my photography skills:) one more reason to go out and get some more practice. -----> i !!! -----> 'll !!!  -----> try !!!  -----> to !!!  -----> create !!!  a new version of the photo shortly. i look forward to seeing this prensentation improved and finalized.", "sortedWord": "None", "Identifyer": null, "identifyer": 110384, "year": "2020"}, {"autor": "LocalHero1953", "date": "2020-12-13 10:37:00", "content": "2 minutes ago, 01maciel said: Thanks for all the feedback I was asking for. Agreed, the blurry frame is way too large. After a day or so the outer frame looks quite rediculous to me. Can't remember why I decided to stick that frame around the white frame. IMHO this is the key point. Sort of root cause analysis. Nowadays, digital photography means one can take a myriad of photos. Difficult enough to classify the photos later on into 'OK' and 'dull'. Good point. Sometimes there is content in a photo, sometimes it looks just like a nice photo with bright colours, nice people. It depends on what the photographer wants to show. This photo above actually has some content, even a mini story, at least in my mind: The old road which is in need of repair apparently, an empty builing, the clock- could be a symbol of standstill (in fact the clock didn't work anymore and the time is not accurate). Finally and to underline the story is the old lady left hand side with a walking aid pointing to the big picture: the leftovers, the residual population of an entire region. - I guess, I was not able to show this mini story in the photo since you were asking for content. Which in turn means I still have to improve my photography skills:) One more reason to go out and get some more practice. I'll try to create a new version of the photo shortly. I look forward to seeing this prensentation improved and finalized. It's always worth asking someone else what they see in the picture. If they don't see what you wanted to show, then either they have no observational talent or your image is not as clear as it is in your head🙂. TBH I didn't even notice the old lady in the shadows; perhaps I was distracted by the frame😉. To be fair, it might look clearer in a larger presentation format than my screen.", "link": "https://www.l-camera-forum.com/topic/316038-presentation-is-everything/?tab=comments#comment-4097802", "origin": "L-forum", "suborigin": "316038-presentation-is-everything", "result": true, "Selector": "i'll try to create", "selectorShort": "create", "MarkedSent": "2 minutes ago, 01maciel said: thanks for all the feedback i was asking for. agreed, the blurry frame is way too large. after a day or so the outer frame looks quite rediculous to me. can't remember why i decided to stick that frame around the white frame. imho this is the key point. sort of root cause analysis. nowadays, digital photography means one can take a myriad of photos. difficult enough to classify the photos later on into 'ok' and 'dull'. good point. sometimes there is content in a photo, sometimes it looks just like a nice photo with bright colours, nice people. it depends on what the photographer wants to show. this photo above actually has some content, even a mini story, at least in my mind: the old road which is in need of repair apparently, an empty builing, the clock- could be a symbol of standstill (in fact the clock didn't work anymore and the time is not accurate). finally and to underline the story is the old lady left hand side with a walking aid pointing to the big picture: the leftovers, the residual population of an entire region. - i guess, i was not able to show this mini story in the photo since you were asking for content. which in turn means i still have to improve my photography skills:) one more reason to go out and get some more practice. -----> i !!! -----> 'll !!!  -----> try !!!  -----> to !!!  -----> create !!!  a new version of the photo shortly. i look forward to seeing this prensentation improved and finalized. it's always worth asking someone else what they see in the picture. if they don't see what you wanted to show, then either they have no observational talent or your image is not as clear as it is in your head🙂. tbh i didn't even notice the old lady in the shadows; perhaps i was distracted by the frame😉. to be fair, it might look clearer in a larger presentation format than my screen.", "sortedWord": "None", "Identifyer": null, "identifyer": 110385, "year": "2020"}, {"autor": "MikeMyers", "date": "2020-11-20 14:41:00", "content": " HISTORY: For as long as I can remember, I've been taking photos with whatever camera I pick for that day, then move the images to my computer. Long ago I selected Adobe Lightroom to manage my photos - bought the software, and it was mine to use, until I bought an even newer version of Lightroom. Lightroom allowed me to move my images into a logical location on my computer, keep track of images, so I could find them in the future, and edit the images. My thoughts on this changed when adobe went to a subscription mode, so I would be paying a monthly fee to adobe from then on, forever. I'm still paying, but I want to eventually get out. Early this year, I bought my Leica M10, and created a new file storage location on my computer. I wasn't sure what program I would use for editing, but after trying several, I settled on PhotoLab 3, which recently became PhotoLab 4. PhotoLab is an image editor. It doesn't replace the full Lightroom system including where and how to store images. I create folders where I want, and copy my new photos there using my own organization system so I can find them later. I followed the same format for photo organization as I have been using in Lightroom, separating images by country, then by the year they were taken, then by the location/purpose for the photos. This has worked for me over all these years in Lightroom, and I replicated it with a brand new top level folder for PhotoLab IMAGE TRANSFER: How the images got from my memory card onto the computer was and still is handled by one of my favorite programs, Photo Mechanic. Photo Mechanic \"ingests\" the images from the card, and quickly allows me to delete the junk images should I wish to. It is very fast, even with hundreds of RAW images. It can rename the images as they are ingested into something more useful than the ordinary file name, and it allows me to add lots of information to the \"metadata\", doing all this to every image as it is ingested. After image review, until this year, I would then use Lightrooom's \"Import\" tools to get these images into my Lightroom System. For other editors, such as Luminar or PhotoLab, I can move the images into an appropriate folder, in a location where I hope to be able to find those images years from now. NEW: Camera Bits, the company that provides PhotoMechanic, has now released PhotoMechanic Plus - which combines the previous software with a new DAM system (Digital Asset Management). This does what Lightroom used to do for me, and goes far beyond it. From what I've read, I will easily be able to find my photos based on many criteria. Since I'm new at this, and am still learning, instead of describing it in my words, I'll just post this link: https://home.camerabits.com/tour-photo-mechanic-plus/ People have told me that my photo organization is essentially the same as what my parents and grandparents did, placing photos in a shoe box with a label. At first I laughed, but not any more. My life seems to have changed so much now - taking photos with the Leica, editing them in my new software, and using the DAM function to allow me to find my images in the future - and all of it I \"own\" (well, the license, not the software), no need to make any monthly payments so that it can/will continue. Having said all that, how do the rest of you deal with this? When you take a photo today, how will you be able to find it ten years from now, or is the \"digital shoebox\" method still adequate?", "link": "https://www.l-camera-forum.com/topic/315353-what-happens-to-your-images-when-they-leave-the-camera/?tab=comments#comment-4083905", "origin": "L-forum", "suborigin": "315353-what-happens-to-your-images-when-they-leave-the-camera", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": " history: for as long as i can remember, i've been taking photos with whatever camera i pick for that day, then move the images to my computer. long ago i selected adobe lightroom to manage my photos - bought the software, and it was mine to use, until i bought an even newer version of lightroom. lightroom allowed me to move my images into a logical location on my computer, keep track of images, so i could find them in the future, and edit the images. my thoughts on this changed when adobe went to a subscription mode, so i would be paying a monthly fee to adobe from then on, forever. i'm still paying, but i want to eventually get out. early this year, i bought my leica m10, and created a new file storage location on my computer. i wasn't sure what program i would use for editing, but after trying several, i settled on photolab 3, which recently became photolab 4. photolab is an image editor. it doesn't replace the full lightroom system including where and how to store images. -----> i !!!  -----> create !!!  folders where -----> i !!!  want, and copy my new photos there using my own organization system so -----> i !!!  can find them later. i followed the same format for photo organization as i have been using in lightroom, separating images by country, then by the year they were taken, then by the location/purpose for the photos. this has worked for me over all these years in lightroom, and i replicated it with a brand new top level folder for photolab image transfer: how the images got from my memory card onto the computer was and still is handled by one of my favorite programs, photo mechanic. photo mechanic \"ingests\" the images from the card, and quickly allows me to delete the junk images should i wish to. it is very fast, even with hundreds of raw images. it can rename the images as they are ingested into something more useful than the ordinary file name, and it allows me to add lots of information to the \"metadata\", doing all this to every image as it is ingested. after image review, until this year, i would then use lightrooom's \"import\" tools to get these images into my lightroom system. for other editors, such as luminar or photolab, i can move the images into an appropriate folder, in a location where i hope to be able to find those images years from now. new: camera bits, the company that provides photomechanic, has now released photomechanic plus - which combines the previous software with a new dam system (digital asset management). this does what lightroom used to do for me, and goes far beyond it. from what i've read, i will easily be able to find my photos based on many criteria. since i'm new at this, and am still learning, instead of describing it in my words, i'll just post this link: https://home.camerabits.com/tour-photo-mechanic-plus/ people have told me that my photo organization is essentially the same as what my parents and grandparents did, placing photos in a shoe box with a label. at first i laughed, but not any more. my life seems to have changed so much now - taking photos with the leica, editing them in my new software, and using the dam function to allow me to find my images in the future - and all of it i \"own\" (well, the license, not the software), no need to make any monthly payments so that it can/will continue. having said all that, how do the rest of you deal with this? when you take a photo today, how will you be able to find it ten years from now, or is the \"digital shoebox\" method still adequate?", "sortedWord": "None", "Identifyer": null, "identifyer": 110678, "year": "2020"}, {"autor": "Kwesi", "date": "2020-11-20 21:45:00", "content": "Hi Mike, Great topic. Early on, I auditioned Capture One. at the time it was clear that it was geared for studio shooting and had no DAM component so I gave up on it. I tried apple's pro photo software and found that also wanting. I settled on Lightroom primarily because I needed to be able to organize and retrieve the thousands of images I was creating as an architectural photographer and also for my personal work. I give Adobe a lot of credit for understanding very early on that we creatives are a messy, unorganized bunch that need all the help they can get in an easy and intuitive way. I grew up shooting slide film so have always been very good at getting the exposure right in camera. so my primary need was organizational, that being said, I have only shot raw since my first digital SLR, the canon Eos 2oD so the raw conversion has and still is a very important factor for me. I have stuck with Lightroom all these years because it gets me as a photographer, - from organizing to raw conversion to printing. Like you I balked at the thought of paying a subscription fee but at the end of the day I've come to realize that that is the same model I use in the rest of my life. From Spotify to Netflix to my local carwash, the list goes on and on. Computer processing power and ever increasing internet bandwidth is allowing photoshop, Lightrooom and others to be able to do things to bitmapped images that was impossible just a a few years ago. For my work, It is nice to be able to stay current effortlessly, and a subscription program allows me to do that.", "link": "https://www.l-camera-forum.com/topic/315353-what-happens-to-your-images-when-they-leave-the-camera/?tab=comments#comment-4084201", "origin": "L-forum", "suborigin": "315353-what-happens-to-your-images-when-they-leave-the-camera", "result": true, "Selector": "i was creating", "selectorShort": "create", "MarkedSent": "hi mike, great topic. early on, i auditioned capture one. at the time it was clear that it was geared for studio shooting and had no dam component so i gave up on it. i tried apple's pro photo software and found that also wanting. -----> i !!!  settled on lightroom primarily because -----> i !!!  needed to be able to organize and retrieve the thousands of images -----> i !!!  -----> was !!!  -----> creating !!!  as an architectural photographer and also for my personal work. i give adobe a lot of credit for understanding very early on that we creatives are a messy, unorganized bunch that need all the help they can get in an easy and intuitive way. i grew up shooting slide film so have always been very good at getting the exposure right in camera. so my primary need was organizational, that being said, i have only shot raw since my first digital slr, the canon eos 2od so the raw conversion has and still is a very important factor for me. i have stuck with lightroom all these years because it gets me as a photographer, - from organizing to raw conversion to printing. like you i balked at the thought of paying a subscription fee but at the end of the day i've come to realize that that is the same model i use in the rest of my life. from spotify to netflix to my local carwash, the list goes on and on. computer processing power and ever increasing internet bandwidth is allowing photoshop, lightrooom and others to be able to do things to bitmapped images that was impossible just a a few years ago. for my work, it is nice to be able to stay current effortlessly, and a subscription program allows me to do that.", "sortedWord": "None", "Identifyer": null, "identifyer": 110681, "year": "2020"}, {"autor": "zeitz", "date": "2020-11-12 03:10:00", "content": "Open the photo in Photoshop. Create a new canvas (file/new...) with the size you want. \"Window/arrange/tile vertically\" to see both images on the screen. Drag the photo to the new canvas. Save using \"File/save as\". Then you are done.", "link": "https://www.l-camera-forum.com/topic/315038-exporting-photo-with-a-simple-white-border-out-of-lightroom/?tab=comments#comment-4078688", "origin": "L-forum", "suborigin": "315038-exporting-photo-with-a-simple-white-border-out-of-lightroom", "result": true, "Selector": "create", "selectorShort": "create", "MarkedSent": "open the photo in photoshop. -----> create !!!  a new canvas (file/new...) with the size you want. \"window/arrange/tile vertically\" to see both images on the screen. drag the photo to the new canvas. save using \"file/save as\". then you are done.", "sortedWord": "None", "Identifyer": null, "identifyer": 110862, "year": "2020"}, {"autor": "zeitz", "date": "2020-10-25 21:19:00", "content": "When I use Capture One, I find my disk written with such files as .cof, .cop, and .cos and a set of folders that I didn't create. The .cos file seems to be the equivalent of a .xmp file; but I can't open .cos with any text editor that I have to verify that. .xmp files can be opened with a text editor and read by the user. I would rather have large files than a bunch of smaller associated files and folders scattered around my drive. If you use a .dng file or another propriety raw file, Adobe does not touch the original raw data; Adobe never did. The .dng spec allows adjustment data to be placed inside the .dng file, but the raw data is not changed in any way and the adjustments are easily reversed. The computer's operating system changes the file's date. Other propriety raw files require a sidecar because Adobe can't write into proprietary raw, .nef for instance. And the user has the option to use .xmp files even with .dng raw. It sounds to me that Capture One has not implemented the full .dng spec. (I also find it odd that Capture One has no hesitancy to work with Adobe's .dng format while it will not allow Adobe software to work with Phase One .iiq files. But that is another topic.) I am missing the point. The icon80 didn't want the files to get large. To me more files for each image are just as bad. Further it is the user's option in Photoshop to flatten the image / merge the layers or keep them separate. Capture One uses .tif (another Adobe product) for file distribution which preserves layers and produces big files. While Adobe's .tif is OK with Capture One, Capture One does not implement .psd.", "link": "https://www.l-camera-forum.com/topic/314298-photo-editor-for-m10m/page/2/?tab=comments#comment-4068366", "origin": "L-forum", "suborigin": "314298-photo-editor-for-m10m", "result": true, "Selector": "i didn't create", "selectorShort": "create", "MarkedSent": "when -----> i !!!  use capture one, -----> i !!!  find my disk written with such files as .cof, .cop, and .cos and a set of folders that -----> i !!!  -----> did !!! -----> n't !!!  -----> create !!! . the .cos file seems to be the equivalent of a .xmp file; but i can't open .cos with any text editor that i have to verify that. .xmp files can be opened with a text editor and read by the user. i would rather have large files than a bunch of smaller associated files and folders scattered around my drive. if you use a .dng file or another propriety raw file, adobe does not touch the original raw data; adobe never did. the .dng spec allows adjustment data to be placed inside the .dng file, but the raw data is not changed in any way and the adjustments are easily reversed. the computer's operating system changes the file's date. other propriety raw files require a sidecar because adobe can't write into proprietary raw, .nef for instance. and the user has the option to use .xmp files even with .dng raw. it sounds to me that capture one has not implemented the full .dng spec. (i also find it odd that capture one has no hesitancy to work with adobe's .dng format while it will not allow adobe software to work with phase one .iiq files. but that is another topic.) i am missing the point. the icon80 didn't want the files to get large. to me more files for each image are just as bad. further it is the user's option in photoshop to flatten the image / merge the layers or keep them separate. capture one uses .tif (another adobe product) for file distribution which preserves layers and produces big files. while adobe's .tif is ok with capture one, capture one does not implement .psd.", "sortedWord": "None", "Identifyer": null, "identifyer": 110921, "year": "2020"}, {"autor": "Luke_Miller", "date": "2020-10-26 12:50:00", "content": "15 hours ago, zeitz said: When I use Capture One, I find my disk written with such files as .cof, .cop, and .cos and a set of folders that I didn't create. That occurs when using C1 in Sessions Mode. In Catalog Mode edits and metadata are stored in the C1 catalog similar to Lightroom.", "link": "https://www.l-camera-forum.com/topic/314298-photo-editor-for-m10m/page/2/?tab=comments#comment-4068619", "origin": "L-forum", "suborigin": "314298-photo-editor-for-m10m", "result": true, "Selector": "i didn't create", "selectorShort": "create", "MarkedSent": "15 hours ago, zeitz said: when -----> i !!!  use capture one, -----> i !!!  find my disk written with such files as .cof, .cop, and .cos and a set of folders that -----> i !!!  -----> did !!! -----> n't !!!  -----> create !!! . that occurs when using c1 in sessions mode. in catalog mode edits and metadata are stored in the c1 catalog similar to lightroom.", "sortedWord": "None", "Identifyer": null, "identifyer": 110924, "year": "2020"}, {"autor": "Wyck", "date": "2020-05-28 14:21:00", "content": "The M10P does work with C1 and I believe I have also read somewhere the M10D works too. Initially the M10P DNG files used to be overly saturated and I created my own ICC profile or used DNG Neutral as a profile. However since the update I can now select the Leica M10 Generic profile and everything work ok and the colours are good too. If you look at the link above that Gerbs has Kindly posted you will see that it only shows support for the M10, however, if you look at the Leica M9 it doesn't suggest it supports the M9P or even the M240P but it does. I think if C1 created an ICC name for every variation of the M digital cameras the list would become quite long. I hope this helps.", "link": "https://www.l-camera-forum.com/topic/309479-capture-one-pro-20-now-on-sale/?tab=comments#comment-3982083", "origin": "L-forum", "suborigin": "309479-capture-one-pro-20-now-on-sale", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "the m10p does work with c1 and i believe i have also read somewhere the m10d works too. initially the m10p dng files used to be overly saturated and -----> i !!!  -----> created !!!  my own icc profile or used dng neutral as a profile. however since the update i can now select the leica m10 generic profile and everything work ok and the colours are good too. if you look at the link above that gerbs has kindly posted you will see that it only shows support for the m10, however, if you look at the leica m9 it doesn't suggest it supports the m9p or even the m240p but it does. i think if c1 created an icc name for every variation of the m digital cameras the list would become quite long. i hope this helps.", "sortedWord": "None", "Identifyer": null, "identifyer": 111157, "year": "2020"}, {"autor": "tommonego@gmail.com", "date": "2020-06-20 16:42:00", "content": "After tearing my hair out, found the \"Load Settings\" button and the xmp files I created were there. Digging around for a while there is a lot to like in this version, just was a big change from and upgrade they did 2 to 3 months ago. It is still tough to reverse the curve setting will have to work on that.", "link": "https://www.l-camera-forum.com/topic/310735-photoshop-frustration/?tab=comments#comment-3996397", "origin": "L-forum", "suborigin": "310735-photoshop-frustration", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "after tearing my hair out, found the \"load settings\" button and the xmp files -----> i !!!  -----> created !!!  were there. digging around for a while there is a lot to like in this version, just was a big change from and upgrade they did 2 to 3 months ago. it is still tough to reverse the curve setting will have to work on that.", "sortedWord": "None", "Identifyer": null, "identifyer": 111650, "year": "2020"}, {"autor": "marchyman", "date": "2020-05-27 20:40:00", "content": "14 hours ago, horosu said: Apparently, JPEG and TIFF Grayscale files can't be edited in this piece of software! In 2020! Yup. A known (but apparently not well known) limitation of Capture One. I convert grayscale images to RGB and then import the converted image into Capture One. I use a Mac. For jpeg images I use the Mac command line program \"sips\" to do the conversion. Sips comes with macOS. When scanning B&W negatives or prints I create 16 bit grayscale tiff files and bring those images into Affinity Photo. I use the Affinity Photo levels tool to adjust levels -- my scans are linear raw files -- and then Affinity's Inpainting brush to take care of dust spots. It is better/faster than the Capture One tools at doing that job. I export the file as a rgb/16 file. The exported file is then brought into Capture One. The extra step of exporting the file is done to conserve disk space. Example from an image I used to figure out my workflow: The scanned 16-bit grayscale file was about 13 MB The saved edited 16-bit grayscale after spot removal and conversion to 16-bit RGB was about 90 MB. That seemed a bit much The same image as above, but exported as a 16-bit RGB file was less than 40 MB And it's not just Capture One. Several image editors I tried could not process grayscale images.", "link": "https://www.l-camera-forum.com/topic/310014-c1-pro-20-cant-crop-a-tiff-filein-2020-really/?tab=comments#comment-3981724", "origin": "L-forum", "suborigin": "310014-c1-pro-20-cant-crop-a-tiff-filein-2020-really", "result": true, "Selector": "i create", "selectorShort": "create", "MarkedSent": "14 hours ago, horosu said: apparently, jpeg and tiff grayscale files can't be edited in this piece of software! in 2020! yup. a known (but apparently not well known) limitation of capture one. i convert grayscale images to rgb and then import the converted image into capture one. i use a mac. for jpeg images i use the mac command line program \"sips\" to do the conversion. sips comes with macos. when scanning b&w negatives or prints -----> i !!!  -----> create !!!  16 bit grayscale tiff files and bring those images into affinity photo. i use the affinity photo levels tool to adjust levels -- my scans are linear raw files -- and then affinity's inpainting brush to take care of dust spots. it is better/faster than the capture one tools at doing that job. i export the file as a rgb/16 file. the exported file is then brought into capture one. the extra step of exporting the file is done to conserve disk space. example from an image i used to figure out my workflow: the scanned 16-bit grayscale file was about 13 mb the saved edited 16-bit grayscale after spot removal and conversion to 16-bit rgb was about 90 mb. that seemed a bit much the same image as above, but exported as a 16-bit rgb file was less than 40 mb and it's not just capture one. several image editors i tried could not process grayscale images.", "sortedWord": "None", "Identifyer": null, "identifyer": 111758, "year": "2020"}, {"autor": "burningheart", "date": "2020-05-19 00:58:00", "content": "I noticed another thing in the converted catalog there is no Histogram data of the original M10M files. I just created a brand new catalog with the latest version and imported all of my M10M raw images No pixelation but it means I am back at square one as far as editing some of my catalogs have files from multiple cameras so I expect the same result when I convert them. Hopefully support will do something then again the M10M was not officially supported until today.", "link": "https://www.l-camera-forum.com/topic/309702-m10m-capture-one-users-be-cautious-with-todays-upgrade/?tab=comments#comment-3976189", "origin": "L-forum", "suborigin": "309702-m10m-capture-one-users-be-cautious-with-todays-upgrade", "result": true, "Selector": "i just created", "selectorShort": "create", "MarkedSent": "i noticed another thing in the converted catalog there is no histogram data of the original m10m files. -----> i !!!  -----> just !!!  -----> created !!!  a brand new catalog with the latest version and imported all of my m10m raw images no pixelation but it means i am back at square one as far as editing some of my catalogs have files from multiple cameras so i expect the same result when i convert them. hopefully support will do something then again the m10m was not officially supported until today.", "sortedWord": "None", "Identifyer": null, "identifyer": 111866, "year": "2020"}, {"autor": "Stealth3kpl", "date": "2020-04-07 11:31:00", "content": " I think this is a problem associated with the M240/SD card rather than Lightroom. The last time I used my M240 was 3 or 4 years ago in Nepal. Towards the end of that month long trip I noticed a couple of thumbnails were getting mixed up in the camera. I was flicking through the images on the back of the camera and noticed that a thumbnail from, say, image 1000 had been brought over to, say, image 1007. I don't recall what issues that brought in Lightroom later. Fast forward to a couple of days ago. I took a picture whilst walking through the park with my Summitar. I processed a copy to B+W in Lightroom. This morning when I opened up Lightroom, I have the B+W image still, but Lightroom is reading a rogue thumbnail file in the DNG displaying an image taken 4 years ago! If I export that DNG file, the correct image is in the file. What can I do about this in Lightroom to get the correct image back inorder to process it? If I now create a copy, I just get another image of a goat! Pete --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/308298-lightroom-correcting-the-thumbnail/?tab=comments#comment-3948812", "origin": "L-forum", "suborigin": "308298-lightroom-correcting-the-thumbnail", "result": true, "Selector": "i now create", "selectorShort": "create", "MarkedSent": " i think this is a problem associated with the m240/sd card rather than lightroom. the last time i used my m240 was 3 or 4 years ago in nepal. towards the end of that month long trip i noticed a couple of thumbnails were getting mixed up in the camera. i was flicking through the images on the back of the camera and noticed that a thumbnail from, say, image 1000 had been brought over to, say, image 1007. i don't recall what issues that brought in lightroom later. fast forward to a couple of days ago. i took a picture whilst walking through the park with my summitar. i processed a copy to b+w in lightroom. this morning when i opened up lightroom, i have the b+w image still, but lightroom is reading a rogue thumbnail file in the dng displaying an image taken 4 years ago! if i export that dng file, the correct image is in the file. what can i do about this in lightroom to get the correct image back inorder to process it? if -----> i !!!  -----> now !!!  -----> create !!!  a copy, -----> i !!!  just get another image of a goat! pete --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 112089, "year": "2020"}, {"autor": "Herr Barnack", "date": "2020-02-15 13:00:00", "content": "@plasticman the thing you have to realize is that when people act like jackasses, they aren't just acting. Given the epidemic of RPD (Rectal Personality Disorder) that our modern world sometimes seems to be a breeding ground for I am seriously considering launching a line of casual wear that I have been threatening to create for years. Baseball caps, tee shirts, sweat shirts and hoodies emblazoned with the catchphrase \"Life's short - don't be a penis.\" I have no doubt my line of clothing would be a runaway best seller.", "link": "https://www.l-camera-forum.com/topic/306476-when-is-it-ok-to-start-being-a-forum-jackss/?tab=comments#comment-3913254", "origin": "L-forum", "suborigin": "306476-when-is-it-ok-to-start-being-a-forum-jackss", "result": true, "Selector": "i have been threatening to create", "selectorShort": "create", "MarkedSent": "@plasticman the thing you have to realize is that when people act like jackasses, they aren't just acting. given the epidemic of rpd (rectal personality disorder) that our modern world sometimes seems -----> to !!!  be a breeding ground for -----> i !!!  am seriously considering launching a line of casual wear that -----> i !!!  -----> have !!!  -----> been !!!  -----> threatening !!!  -----> to !!!  -----> create !!!  for years. baseball caps, tee shirts, sweat shirts and hoodies emblazoned with the catchphrase \"life's short - don't be a penis.\" i have no doubt my line of clothing would be a runaway best seller.", "sortedWord": "None", "Identifyer": null, "identifyer": 116755, "year": "2020"}, {"autor": "105012", "date": "2020-11-16 00:55:00", "content": "Hi Everyone Here are some of my rejections, I chose 'Gleaming' instead (thanks Erl, Alex C, earleygallery, Dan Bachmann!) because it seemed to me to create a small mystery and story and because the one wheel was tentatively poised above the water reminding me of that famous moment behind the Gare Saint-Lazare... --img-- --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/315120-2020-covid-specialchallenge-outtakes/?tab=comments#comment-4081033", "origin": "L-forum", "suborigin": "315120-2020-covid-specialchallenge-outtakes", "result": true, "Selector": "me to create", "selectorShort": "create", "MarkedSent": "hi everyone here are some of my rejections, i chose 'gleaming' instead (thanks erl, alex c, earleygallery, dan bachmann!) because it seemed -----> to !!!  -----> me !!!  -----> to !!!  -----> create !!!  a small mystery and story and because the one wheel was tentatively poised above the water reminding -----> me !!!  of that famous moment behind the gare saint-lazare... --img-- --img-- --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 128845, "year": "2020"}, {"autor": "jaapv", "date": "2020-10-30 10:23:00", "content": "3 hours ago, Tom1234 said: Fixing in post production software to me frequently creates a picture that looks way too extreme, artificial, and childish like advertising shock techniques This is a simple matter of skill and restraint, not of the process itself. Post production software is not meant to \"fix\" images. It is meant to bring out the image one wants to produce. It does not correct, it adjusts, if used properly. 2 hours ago, Steven said: Again, by using smallest F-stops That will really degrade the image through diffraction. 3 hours ago, Tom1234 said: I find it odd that people want their lenses \"corrected\" by software. So do I, as that is a misconception. Modern electronically integrated lenses are optimized to the maximum optically, leaving some aberrations to be corrected by software - the ones that are better corrected that way. The result is a better lens than could be designed using optical means alone.", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/9/?tab=comments#comment-4070740", "origin": "L-forum", "suborigin": "314500-24meg-verses-40meg-aesthetic", "result": false, "Selector": "me frequently creates", "selectorShort": "create", "MarkedSent": "3 hours ago, tom1234 said: fixing in post production software to me frequently creates a picture that looks way too extreme, artificial, and childish like advertising shock techniques this is a simple matter of -----> skill !!!  and restraint, not of the process itself.", "sortedWord": "skill", "Identifyer": null, "identifyer": 9065, "year": "2020"}, {"autor": "TomB_tx", "date": "2020-06-19 17:12:00", "content": "I bought a splitter like this that creates 2 Minox strips off a 35mm film: https://www.ebay.com/itm/Film-slitter-to-cut-any-roll-film-current-or-vintage-size-to-any-smaller-size/164243778245 I'm creating a reel-to-reel base to crank the film through in a changing bag. In the meantime I use Blue Moon Minox film, which is good. I also have a splitter that cuts 220 film on the spool to one section for 127 and the remainder for 16mm, as I have a few 16mm submini cameras also.", "link": "https://www.l-camera-forum.com/topic/310694-leica-minox/?tab=comments#comment-3995807", "origin": "L-forum", "suborigin": "310694-leica-minox", "result": false, "Selector": "i'm creating", "selectorShort": "create", "MarkedSent": "i bought a splitter like this that creates 2 minox strips off a 35mm -----> film !!! : https://www.ebay.com/itm/film-slitter-to-cut-any-roll-film-current-or-vintage-size-to-any-smaller-size/164243778245 i'm creating a reel-to-reel base to crank the -----> film !!!  through in a changing bag.", "sortedWord": "film", "Identifyer": null, "identifyer": 88165, "year": "2020"}, {"autor": "adan", "date": "2020-11-22 05:00:00", "content": "--img--  My system really has not changed since 2000 or so (including film scans as well as digital originals). I use PhotoShop (currently CS6), with Adobe Bridge to view the collections, and Adobe Camera Raw for raw processing. I use PS because I do a lot of graphics work beyond photography - but I also like the fact that filing and cataloging can be done in a separate module, with lots of \"manual\" organization and control. Basically, in the Mac's provided \"Pictures\" folder on my main HD, I have subfolders for every year, and sub-subfolders for every month of each year, and a \"Digital Originals\" (and/or \"Film Scans\") folder in each of those. Card comes out of the camera and into the card reader and is copied to the desktop. Gets renamed with camera used and subject matter/contents. Then drag/dropped into the Mac's master Pictures folder collection in the correct year/month folder. For film, I just create a folder for a given set of scans, with similar naming conventions. I then use Bridge to review and edit (keep or discard) the thumbnails, and double-click any image I want to edit or view full-scale, to open it into Photoshop via Adobe Camera Raw. Occasionally, I will add a \"Digital Reworks\" folder in a particular year/month folder, for pix with extensive PS editing I want to save. Now, in addition, I have a whole separate folder for my magazine InDesign files, where I keep additional \"finished\" copies of the pictures for each story in that issue. Makes it a lot easier to swap them around at the final selection and layout stage. And all of those are backed-up regularly onto two external hard drives. Drag-n-drop, and go have lunch while the gigabytes migrate. I do make prints as needed, up to A2/22\" x 17\" - they pay for everything else.", "link": "https://www.l-camera-forum.com/topic/315353-what-happens-to-your-images-when-they-leave-the-camera/page/2/?tab=comments#comment-4084857", "origin": "L-forum", "suborigin": "315353-what-happens-to-your-images-when-they-leave-the-camera", "result": false, "Selector": "i just create", "selectorShort": "create", "MarkedSent": "for -----> film !!! , i just create a folder for a given set of scans, with similar naming conventions.", "sortedWord": "film", "Identifyer": null, "identifyer": 110701, "year": "2020"}, {"autor": "jaapv", "date": "2020-11-22 09:57:00", "content": "4 hours ago, adan said: --img--  My system really has not changed since 2000 or so (including film scans as well as digital originals). I use PhotoShop (currently CS6), with Adobe Bridge to view the collections, and Adobe Camera Raw for raw processing. I use PS because I do a lot of graphics work beyond photography - but I also like the fact that filing and cataloging can be done in a separate module, with lots of \"manual\" organization and control. Basically, in the Mac's provided \"Pictures\" folder on my main HD, I have subfolders for every year, and sub-subfolders for every month of each year, and a \"Digital Originals\" (and/or \"Film Scans\") folder in each of those. Card comes out of the camera and into the card reader and is copied to the desktop. Gets renamed with camera used and subject matter/contents. Then drag/dropped into the Mac's master Pictures folder collection in the correct year/month folder. For film, I just create a folder for a given set of scans, with similar naming conventions. I then use Bridge to review and edit (keep or discard) the thumbnails, and double-click any image I want to edit or view full-scale, to open it into Photoshop via Adobe Camera Raw. Occasionally, I will add a \"Digital Reworks\" folder in a particular year/month folder, for pix with extensive PS editing I want to save. Now, in addition, I have a whole separate folder for my magazine InDesign files, where I keep additional \"finished\" copies of the pictures for each story in that issue. Makes it a lot easier to swap them around at the final selection and layout stage. And all of those are backed-up regularly onto two external hard drives. Drag-n-drop, and go have lunch while the gigabytes migrate. I do make prints as needed, up to A2/22\" x 17\" - they pay for everything else. Looks a lot like my system; only mine is a bit more messy. I am waiting for an AI program to sort and tag, I find it too time-consuming to do so in LR or Bridge All my image file go onto a separate data disk/ SSD with a second backup one - Bridge does so automatically. I have an automatic Cloud backup as well.", "link": "https://www.l-camera-forum.com/topic/315353-what-happens-to-your-images-when-they-leave-the-camera/page/2/?tab=comments#comment-4084954", "origin": "L-forum", "suborigin": "315353-what-happens-to-your-images-when-they-leave-the-camera", "result": false, "Selector": "i just create", "selectorShort": "create", "MarkedSent": "for -----> film !!! , i just create a folder for a given set of scans, with similar naming conventions.", "sortedWord": "film", "Identifyer": null, "identifyer": 110705, "year": "2020"}], "name": "Leicasortedout2020create"}