{"interestingcomments": [{"autor": "TrickyMrT", "date": "2020-09-23 10:10:00", "content": "7 hours ago, paulsydaus said: I think the biggest changes with an M11 will likely be; Improved/redesigned ISO wheel faster electronics, maybe Maestro 3 bigger buffer UHS-II card reader better external EVF accessory. Slight body redesign electronic shutter modes. Hopefully they also include the thumb rest from the M10D. Maybe low energy Bluetooth support. That’s about it... They will almost certainly not include IBIS, sensor cleansing or a built in EVF. The thumb rest would be extrem great! Improved/redesigned ISO wheel ==> Maybe something which could be pushed down? better external EVF accessory. ==> I keep my fingers crossed for it. The current one is not good", "link": "https://www.l-camera-forum.com/topic/313173-m10-upgreade-to-m10-r-or-not/page/2/?tab=comments#comment-4050817", "origin": "L-forum", "suborigin": "313173-m10-upgreade-to-m10-r-or-not", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "7 hours ago, paulsydaus said: i think the biggest changes with an m11 will likely be; improved/redesigned iso wheel faster electronics, maybe maestro 3 bigger buffer uhs-ii card reader better external evf accessory. slight body redesign electronic shutter modes. hopefully they also include the thumb rest from the m10d. maybe low energy bluetooth support. that’s about it... they will almost certainly not include ibis, sensor cleansing or a built in evf. the thumb rest would be extrem great! -----> improved !!! /redesigned iso wheel ==> maybe something which could be pushed down? better external evf accessory. ==> i keep my fingers crossed for it. the current one is not good", "sortedWord": "None", "Identifyer": null, "identifyer": 9293, "year": "2020"}, {"autor": "scroy", "date": "2020-09-23 10:21:00", "content": "8 minutes ago, TrickyMrT said: The thumb rest would be extrem great! Improved/redesigned ISO wheel ==> Maybe something which could be pushed down? better external EVF accessory. ==> I keep my fingers crossed for it. The current one is not good Less heat ; M10R/M10M both get pretty hot after a shooting on a warm day.", "link": "https://www.l-camera-forum.com/topic/313173-m10-upgreade-to-m10-r-or-not/page/2/?tab=comments#comment-4050822", "origin": "L-forum", "suborigin": "313173-m10-upgreade-to-m10-r-or-not", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "8 minutes ago, trickymrt said: the thumb rest would be extrem great! -----> improved !!! /redesigned iso wheel ==> maybe something which could be pushed down? better external evf accessory. ==> i keep my fingers crossed for it. the current one is not good less heat ; m10r/m10m both get pretty hot after a shooting on a warm day.", "sortedWord": "None", "Identifyer": null, "identifyer": 9294, "year": "2020"}, {"autor": "SrMi", "date": "2020-01-05 17:00:00", "content": " Since Leica does not update SL manual after firmware changes, I hope that the following list can be helpful. Firmware 2.2 (12/2016) New Top Features: Added support for Leica Image Shuttle 3.5 (Windows) Improved support for Leica Image Shuttle 3.5 (MAC) and for Adobe® Photoshop® Lightroom® Tethered Plug-In 1.1.0 (MAC) Changed exp. limitation in combination with 6bit coded M-lenses Bug Fixes Fixed, missing data in EXIF in combination with lens adapters Several minor bug fixes Firmware 3.0 (5/2017) New top features Up to 35% faster writing DNG files to SD card Optimization of the writing process allows to reduce the time needed for saving DNG files up to 35%. This allows to be quicker ready to continue shooting after a burst session. Optimized Autofocus MF-/AF-control optimized Autofocus reaction time is shortened Improved AF tracking of objects with SL lenses Improved: zooming while recording video Improved: AF field chances while recording video § Improved: AFc while recoding video New firmware for lenses is included Improved accuracy of the focus position Improved AFc accuracy if an object moves towards the lens New firmware for the VARIO-ELMARIT-SL 24-90 f/2.8-4 ASPH. § New firmware for the APO-VARIO-ELMARIT-SL 90-280 f/2.8-4 Bugfixes Firmware 3.1 (2/2018) New top features New firmware for Summilux-SL 1:1.4/50 ASPH. is included Improved accuracy of the auto focus position ! Improved auto focus speed Improve image quality for JPG files Over all color balance is improved for JPG files under certain light situations Firmware 3.2 (4/2018) AF Position can be locked to avoid unwanted changes New menu item added „Joystick Lock on/off“ New power saving mode New menu item added „Power Saving Mode on/off“ This allows the camera to switch off the electronic viewfinder to save battery power. Support for Leica flashes Support for SF40, future SF60 and SFC1 Additional features New menu item “USB-Mode” allows to use mass storage or PTP USB connection type ! Keyboard improvements: Missing brackets for the wifi password input Keyboard improvements: Blinking cursor during text input Improved image colour for JPG under some light conditions Manual colour temperature preset was optimized (Setting changed from 6600K to 6500K) Firmware 3.3 (9/2018) Power Saving Mode Changed functionality: While not using electronic Viewfinder or any operating elements, the camera will go into ‘Auto Power Off’ after a fixed amount of time. Changed the timing from 3 to 10 seconds. Auto Review Additional option ‘Shutter pressed’ has been added to Auto Review settings Option ‘Off’ no longer enables the camera to show Auto Review while shutter release is pressed. Firmware 3.4 (2/2019) Easy Connect New QR code for easy pairing of smartphone and camera. Fixed WLAN name and password, no submenus for setting name and password. No submenus for setting a connection mode, e.g. Create WLAN or Join WLAN. Compatibility with upcoming lenses from L-Mount Alliance partners Body-lens communication standard extended for compatibility with upcoming L-Mount lenses. Additional menu for updating the lens-firmware of upcoming lenses from L-Mount Alliance partners via SL camera body. Compatibility with upcoming L-Mount lenses, that are equipped with an AF/MF switch on the lens barrel. In this case the lens switch is the master for AF/MF mode. Compatibility with upcoming L-Mount lenses, that are equipped with an OIS mode switch on the lens barrel. In this case the lens switch is the master for OIS mode. Bugfix In some cases the VARIO-ELMARIT-SL 24-90 f/2.8-4 ASPH. did show front focus issues. Lens Firmware 1.1 does solve this issue. Firmware 3.5 (3/2019) Compatibility with upcoming lenses from L-Mount Alliance partners The firmware update enables compatibility with current and future L-Mount lenses from Leica as well as from our L-Mount Alliance partners Panasonic und Sigma. Firmware 3.6 (8/2019) Camera FW 3.6 Compatibility with existing and upcoming lenses from L-Mount Alliance partners Improvement on compatibility with existing and upcoming lenses from L-Mount Alliance partners. Improvement on compatibility with L-Mount lenses that are equipped with an AF/MF selection on the lens. Improvement on compatibility with L-Mount lenses that are equipped with an OIS mode switch on the lens. Lens FW 1.2 For the VARIO-ELMARIT-SL 24-90 f/2.8-4 ASPH. FW 1.2 reduces the noise from aperture drive while zooming. Lens FW 1.1 For the APO-VARIO-ELMARIT-SL 90-280 f/2.8-4 FW 1.1 reduces the noise from aperture drive while zooming.", "link": "https://www.l-camera-forum.com/topic/305075-list-of-all-leica-sl-firmware-changes/?tab=comments#comment-3885571", "origin": "L-forum", "suborigin": "305075-list-of-all-leica-sl-firmware-changes", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": " since leica does not update sl manual after firmware changes, i hope that the following list can be helpful. firmware 2.2 (12/2016) new top features: added support for leica image shuttle 3.5 (windows) improved support for leica image shuttle 3.5 (mac) and for adobe® photoshop® lightroom® tethered plug-in 1.1.0 (mac) changed exp. limitation in combination with 6bit coded m-lenses bug fixes fixed, missing data in exif in combination with lens adapters several minor bug fixes firmware 3.0 (5/2017) new top features up to 35% faster writing dng files to sd card optimization of the writing process allows to reduce the time needed for saving dng files up to 35%. this allows to be quicker ready to continue shooting after a burst session. optimized autofocus mf-/af-control optimized autofocus reaction time is shortened improved af tracking of objects with sl lenses improved: zooming while recording video improved: af field chances while recording video § improved: afc while recoding video new firmware for lenses is included improved accuracy of the focus position improved afc accuracy if an object moves towards the lens new firmware for the vario-elmarit-sl 24-90 f/2.8-4 asph. § new firmware for the apo-vario-elmarit-sl 90-280 f/2.8-4 bugfixes firmware 3.1 (2/2018) new top features new firmware for summilux-sl 1:1.4/50 asph. is included improved accuracy of the auto focus position ! -----> improved !!!  auto focus speed improve image quality for jpg files over all color balance is -----> improved !!!  for jpg files under certain light situations firmware 3.2 (4/2018) af position can be locked to avoid unwanted changes new menu item added „joystick lock on/off“ new power saving mode new menu item added „power saving mode on/off“ this allows the camera to switch off the electronic viewfinder to save battery power. support for leica flashes support for sf40, future sf60 and sfc1 additional features new menu item “usb-mode” allows to use mass storage or ptp usb connection type ! keyboard improvements: missing brackets for the wifi password input keyboard improvements: blinking cursor during text input improved image colour for jpg under some light conditions manual colour temperature preset was optimized (setting changed from 6600k to 6500k) firmware 3.3 (9/2018) power saving mode changed functionality: while not using electronic viewfinder or any operating elements, the camera will go into ‘auto power off’ after a fixed amount of time. changed the timing from 3 to 10 seconds. auto review additional option ‘shutter pressed’ has been added to auto review settings option ‘off’ no longer enables the camera to show auto review while shutter release is pressed. firmware 3.4 (2/2019) easy connect new qr code for easy pairing of smartphone and camera. fixed wlan name and password, no submenus for setting name and password. no submenus for setting a connection mode, e.g. create wlan or join wlan. compatibility with upcoming lenses from l-mount alliance partners body-lens communication standard extended for compatibility with upcoming l-mount lenses. additional menu for updating the lens-firmware of upcoming lenses from l-mount alliance partners via sl camera body. compatibility with upcoming l-mount lenses, that are equipped with an af/mf switch on the lens barrel. in this case the lens switch is the master for af/mf mode. compatibility with upcoming l-mount lenses, that are equipped with an ois mode switch on the lens barrel. in this case the lens switch is the master for ois mode. bugfix in some cases the vario-elmarit-sl 24-90 f/2.8-4 asph. did show front focus issues. lens firmware 1.1 does solve this issue. firmware 3.5 (3/2019) compatibility with upcoming lenses from l-mount alliance partners the firmware update enables compatibility with current and future l-mount lenses from leica as well as from our l-mount alliance partners panasonic und sigma. firmware 3.6 (8/2019) camera fw 3.6 compatibility with existing and upcoming lenses from l-mount alliance partners improvement on compatibility with existing and upcoming lenses from l-mount alliance partners. improvement on compatibility with l-mount lenses that are equipped with an af/mf selection on the lens. improvement on compatibility with l-mount lenses that are equipped with an ois mode switch on the lens. lens fw 1.2 for the vario-elmarit-sl 24-90 f/2.8-4 asph. fw 1.2 reduces the noise from aperture drive while zooming. lens fw 1.1 for the apo-vario-elmarit-sl 90-280 f/2.8-4 fw 1.1 reduces the noise from aperture drive while zooming.", "sortedWord": "None", "Identifyer": null, "identifyer": 35420, "year": "2020"}, {"autor": "Jeff S", "date": "2020-10-22 20:22:00", "content": "Improved red channel and skin tones according to Leica. Of course many other variables, including lenses, lighting, etc, etc. Jeff", "link": "https://www.l-camera-forum.com/topic/314428-leica-s3-for-portraits/?tab=comments#comment-4066960", "origin": "L-forum", "suborigin": "314428-leica-s3-for-portraits", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "-----> improved !!!  red channel and skin tones according to leica. of course many other variables, including lenses, lighting, etc, etc. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 26752, "year": "2020"}, {"autor": "tom0511", "date": "2020-03-08 20:39:00", "content": "As a customer i am with you. However I am also tired of \"reducing cost at any price\"...I think a DSLR is just more expensive to produce. My wish would be to not reduce the price but on the other side put some more new technology in the camera. Improve the AF system (maybe it has happend?), give it a nicer display,... etc. We all want to earn good money for our job, so why Leica emploeys should not.", "link": "https://www.l-camera-forum.com/topic/307247-the-s3-pricing-is-a-mistake/?tab=comments#comment-3927582", "origin": "L-forum", "suborigin": "307247-the-s3-pricing-is-a-mistake", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "as a customer i am with you. however i am also tired of \"reducing cost at any price\"...i think a dslr is just more expensive to produce. my wish would be to not reduce the price but on the other side put some more new technology in the camera. -----> improve !!!  the af system (maybe it has happend?), give it a nicer display,... etc. we all want to earn good money for our job, so why leica emploeys should not.", "sortedWord": "None", "Identifyer": null, "identifyer": 28390, "year": "2020"}, {"autor": "Sarnian", "date": "2020-01-17 14:38:00", "content": "M10 Monochrom £7,250.00 https://store.leica-camera.com/uk/en/detail/index/sArticle/2831 Product information \"M10 Monochrom, Black\" The essentials: Compact digital view and rangefinder system camera with a dedicated black-and-white image sensor New 40 Megapixel monochrome sensor Base ISO of 160 - Improved high ISO performance Exposure times: 16min. – 1/4000s Touchscreen Silent shutter Reduced to black and grey design into the finest detail M10-P based body Product description: A new dimension of black-and-white photography With a newly developed 40-megapixel black-and-white sensor, the Leica M10 Monochrom offers unrivaled sharpness and resolution in all lighting conditions. Improved detail rendition for greater image quality The fact that no color filter arrays are required means that there are fewer layers of glass and filter to impede the transmission of light or cause deflections. This is especially advantageous in a traditional rangefinder camera and results in decreased, fine-grained image noise. The M10 Monochrom delivers an exceptionally broad sensitivity range - from ISO 160 to ISO 100,000, while retaining full detail with the finest grain. This enormous sensitivity spectrum enables imagery with an extremely broad dynamic range - yielding results with areas of shadow and illumination clearly defined, particularly when shooting in uneven, high-contrast light. Understated and discreet for low-profile shooting The M10 Monochrom lives in a body technically identical with the M10-P range. The pared-back look and almost inaudible shutter make photographing with the M10 Monochrom a most discreet experience, ideal for capturing authentic moments without drawing attention to yourself. The strict omission of any color-inlaid engravings further emphasizes the camera’s monochrome character.Utilising the full scope of the camera’s capability With its high-resolution image sensor and faithful detail rendition, the Leica M10 Monochrom has significantly raised the bar in terms of camera quality and performance. This, in turn, means that only equally high-capacity lenses will be able to utilise all of the camera’s performance reserves. Leica’s M lenses — globally recognised as the world’s best full-frame lenses - are the perfect match for the Leica M10 Monochrom, giving rise to an exceptionally high-performance combination.A reliable companion - Made in Germany As with all Leica M cameras, the M10 Monochrom is made almost entirely by hand by experienced specialists in an elaborate construction and assembly process and is robust enough to take on even the toughest of conditions. The Leica M10 Monochrom stands for exceptional quality and reliability that assures a companion for life. Scope of delivery: M10 Monochrom | Carrying strap | Battery | Charger & Cables | Quick start guide | 3 months trial Adobe Lightroom Edited January 17, 2020 by Sarnian", "link": "https://www.l-camera-forum.com/topic/279433-who-wants-leica-to-make-a-s-monochrom/page/2/?tab=comments#comment-3893084", "origin": "L-forum", "suborigin": "279433-who-wants-leica-to-make-a-s-monochrom", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "m10 monochrom £7,250.00 https://store.leica-camera.com/uk/en/detail/index/sarticle/2831 product information \"m10 monochrom, black\" the essentials: compact digital view and rangefinder system camera with a dedicated black-and-white image sensor new 40 megapixel monochrome sensor base iso of 160 - improved high iso performance exposure times: 16min. – 1/4000s touchscreen silent shutter reduced to black and grey design into the finest detail m10-p based body product description: a new dimension of black-and-white photography with a newly developed 40-megapixel black-and-white sensor, the leica m10 monochrom offers unrivaled sharpness and resolution in all lighting conditions. -----> improved !!!  detail rendition for greater image quality the fact that no color filter arrays are required means that there are fewer layers of glass and filter to impede the transmission of light or cause deflections. this is especially advantageous in a traditional rangefinder camera and results in decreased, fine-grained image noise. the m10 monochrom delivers an exceptionally broad sensitivity range - from iso 160 to iso 100,000, while retaining full detail with the finest grain. this enormous sensitivity spectrum enables imagery with an extremely broad dynamic range - yielding results with areas of shadow and illumination clearly defined, particularly when shooting in uneven, high-contrast light. understated and discreet for low-profile shooting the m10 monochrom lives in a body technically identical with the m10-p range. the pared-back look and almost inaudible shutter make photographing with the m10 monochrom a most discreet experience, ideal for capturing authentic moments without drawing attention to yourself. the strict omission of any color-inlaid engravings further emphasizes the camera’s monochrome character.utilising the full scope of the camera’s capability with its high-resolution image sensor and faithful detail rendition, the leica m10 monochrom has significantly raised the bar in terms of camera quality and performance. this, in turn, means that only equally high-capacity lenses will be able to utilise all of the camera’s performance reserves. leica’s m lenses — globally recognised as the world’s best full-frame lenses - are the perfect match for the leica m10 monochrom, giving rise to an exceptionally high-performance combination.a reliable companion - made in germany as with all leica m cameras, the m10 monochrom is made almost entirely by hand by experienced specialists in an elaborate construction and assembly process and is robust enough to take on even the toughest of conditions. the leica m10 monochrom stands for exceptional quality and reliability that assures a companion for life. scope of delivery: m10 monochrom | carrying strap | battery | charger & cables | quick start guide | 3 months trial adobe lightroom edited january 17, 2020 by sarnian", "sortedWord": "None", "Identifyer": null, "identifyer": 28726, "year": "2020"}, {"autor": "jaapv", "date": "2020-09-17 18:06:00", "content": "49 minutes ago, lucerne said: to: Hey You You state that you have a newish 64 bit system. So do I on my 7 year old Macbook Pro. See my earlier post. Standalone LR6 on my Macbook Pro continues to work after today's OS upgrade. I haven't had to do any re-installation. I pay nothing (original free Leica offer)and never have. Why are some responders pointing to the problems with 32bit. In your particular case (and mine) its irrelevant. However, if you de-installed and now need to re-install, the original installer program is possibly 32 bit and may be the only portion you need to acquire. Adobe should be able to provide that. I wont be paying unless and until absolutely necessary. The additional features of CC don't interest me. So. To repeat, I can confirm that a pre-installed LR6 standalone version continued to work under the new Catalina OS released today. I'm using it right now! Not only extra features. Improved algorithms = improved image quality. Noticeable, I might add", "link": "https://www.l-camera-forum.com/topic/313418-purchased-copy-of-adobe-lightroom-non-functional/?tab=comments#comment-4047646", "origin": "L-forum", "suborigin": "313418-purchased-copy-of-adobe-lightroom-non-functional", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "49 minutes ago, lucerne said: to: hey you you state that you have a newish 64 bit system. so do i on my 7 year old macbook pro. see my earlier post. standalone lr6 on my macbook pro continues to work after today's os upgrade. i haven't had to do any re-installation. i pay nothing (original free leica offer)and never have. why are some responders pointing to the problems with 32bit. in your particular case (and mine) its irrelevant. however, if you de-installed and now need to re-install, the original installer program is possibly 32 bit and may be the only portion you need to acquire. adobe should be able to provide that. i wont be paying unless and until absolutely necessary. the additional features of cc don't interest me. so. to repeat, i can confirm that a pre-installed lr6 standalone version continued to work under the new catalina os released today. i'm using it right now! not only extra features. -----> improved !!!  algorithms = -----> improved !!!  image quality. noticeable, i might add", "sortedWord": "None", "Identifyer": null, "identifyer": 110994, "year": "2020"}, {"autor": "Jeff S", "date": "2020-09-17 18:07:00", "content": "Just now, jaapv said: Not only extra features. Improved algorithms = improved image quality. Noticeable, I might add +1 Jeff", "link": "https://www.l-camera-forum.com/topic/313418-purchased-copy-of-adobe-lightroom-non-functional/?tab=comments#comment-4047647", "origin": "L-forum", "suborigin": "313418-purchased-copy-of-adobe-lightroom-non-functional", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "just now, jaapv said: not only extra features. -----> improved !!!  algorithms = -----> improved !!!  image quality. noticeable, i might add +1 jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 110995, "year": "2020"}], "name": "Leicasortedout2020improve"}