{"interestingcomments": [{"autor": "adan", "date": "2021-02-23 01:10:00", "content": " 44 minutes ago, SrMi said: That is not the right way to determine base ISO (i.e., ISO with the best SNR) That's only half the story - as is highlight headroom. The key word in dynamic range is \"range\" - how many stops in total, from end to end, can be captured. without losing detail to blown highlights - or shadows to \"excess\" noise (the noise floor). https://en.wikipedia.org/wiki/Noise_floor When I tested ISO 100 and 200 with my M10, I looked for a very high-brightness-range scene - deep inky shadows, and also bright specular highlights (sun reflecting off polished bronze) At ISO 100, the SNR was very good in the deepest shadows (virtually no noise) - but the specular highlight headroom was miserable. At ISO 200, the highlight detail separation was a stop (or so) better - but the SNR was worse in the deepest shadows (more noise). Also by about a stop. So both those ISOs had effectively the same dynamic range, simply clipped at opposite ends of the range. In other words, it is easy to keep improving the SNR by increasing the S(ignal) with more and more exposure - but if that results in blown highlights, it is pointless. Gotta measure at both ends. The base ISO (or best ISO) was probably pretty close to Stefan Daniel's vague estimate of \"about 135\" - right in between ISO 100 and ISO 200 (but sadly, not actually a value one can select with the M10). If I had an M10M of my own, I would do a similar test. (If you want something done right, do it yourself. ) - find a scene with an extreme brightness range (inky shadows, sunlit whites and near-whites, specular highlights). Ideally something with a brightness range of 13 stops or more. - set the lowest available ISO and meter a gray card (only objective way to compare exposures with internal reflective meters). Photograph the gray card as a reference. - Make an exposure of the scene. - repeat at all the reasonable ISOs, being sure to include the \"in-between\" ISOs (125, 160, 250, 320, 500, 640) and not just the \"round-number\" dial ISOs (100-200-400-800). -Take those dozen or so exposures and open them on the computer, and determine which ISO reveals both maximum noise-free shadow detail and separable (unclipped) highlights. = Maximum dynamic range - to within a 1/6th stop or so. BTW - this is an example of a 13-stop test scene (on film) - metered exposure EV13 in the sunlit textured white-tile wall, EV0 in the \"shaded shadows\" bottom center. FIlm, of course, \"pulls\" better than digital; this was a severe \"pull\" (meter the shadows, underexpose them 3 stops to \"zone 2\", give N-3 underdevelopment, get detail everywhere ). --img-- ", "link": "https://www.l-camera-forum.com/topic/318212-m10-mono-base-iso/?tab=comments#comment-4147086", "origin": "L-forum", "suborigin": "318212-m10-mono-base-iso", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": " 44 minutes ago, srmi said: that is not the right way to determine base iso (i.e., iso with the best snr) that's only half the story - as is highlight headroom. the key word in dynamic range is \"range\" - how many stops in total, from end to end, can be captured. without losing detail to blown highlights - or shadows to \"excess\" noise (the noise floor). https://en.wikipedia.org/wiki/noise_floor when i tested iso 100 and 200 with my m10, i looked for a very high-brightness-range scene - deep inky shadows, and also bright specular highlights (sun reflecting off polished bronze) at iso 100, the snr was very good in the deepest shadows (virtually no noise) - but the specular highlight headroom was miserable. at iso 200, the highlight detail separation was a stop (or so) better - but the snr was worse in the deepest shadows (more noise). also by about a stop. so both those isos had effectively the same dynamic range, simply clipped at opposite ends of the range. in other words, it is easy to keep improving the snr by increasing the s(ignal) with more and more exposure - but if that results in blown highlights, it is pointless. gotta measure at both ends. the base iso (or best iso) was probably pretty close to stefan daniel's vague estimate of \"about 135\" - right in between iso 100 and iso 200 (but sadly, not actually a value one can select with the m10). if i had an m10m of my own, i would do a similar test. (if you want something done right, -----> do !!!  -----> it !!!  -----> yourself !!! . ) - find a scene with an extreme brightness range (inky shadows, sunlit whites and near-whites, specular highlights). ideally something with a brightness range of 13 stops or more. - set the lowest available iso and meter a gray card (only objective way to compare exposures with internal reflective meters). photograph the gray card as a reference. - make an exposure of the scene. - repeat at all the reasonable isos, being sure to include the \"in-between\" isos (125, 160, 250, 320, 500, 640) and not just the \"round-number\" dial isos (100-200-400-800). -take those dozen or so exposures and open them on the computer, and determine which iso reveals both maximum noise-free shadow detail and separable (unclipped) highlights. = maximum dynamic range - to within a 1/6th stop or so. btw - this is an example of a 13-stop test scene (on film) - metered exposure ev13 in the sunlit textured white-tile wall, ev0 in the \"shaded shadows\" bottom center. film, of course, \"pulls\" better than digital; this was a severe \"pull\" (meter the shadows, underexpose them 3 stops to \"zone 2\", give n-3 underdevelopment, get detail everywhere ). --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 23945, "year": "2021"}, {"autor": "SrMi", "date": "2021-02-23 02:13:00", "content": "53 minutes ago, adan said: That's only half the story - as is highlight headroom. The key word in dynamic range is \"range\" - how many stops in total, from end to end, can be captured. without losing detail to blown highlights - or shadows to \"excess\" noise (the noise floor). https://en.wikipedia.org/wiki/Noise_floor When I tested ISO 100 and 200 with my M10, I looked for a very high-brightness-range scene - deep inky shadows, and also bright specular highlights (sun reflecting off polished bronze) At ISO 100, the SNR was very good in the deepest shadows (virtually no noise) - but the specular highlight headroom was miserable. At ISO 200, the highlight detail separation was a stop (or so) better - but the SNR was worse in the deepest shadows (more noise). Also by about a stop. So both those ISOs had effectively the same dynamic range, simply clipped at opposite ends of the range. In other words, it is easy to keep improving the SNR by increasing the S(ignal) with more and more exposure - but if that results in blown highlights, it is pointless. Gotta measure at both ends. The base ISO (or best ISO) was probably pretty close to Stefan Daniel's vague estimate of \"about 135\" - right in between ISO 100 and ISO 200 (but sadly, not actually a value one can select with the M10). If I had an M10M of my own, I would do a similar test. (If you want something done right, do it yourself. ) - find a scene with an extreme brightness range (inky shadows, sunlit whites and near-whites, specular highlights). Ideally something with a brightness range of 13 stops or more. - set the lowest available ISO and meter a gray card (only objective way to compare exposures with internal reflective meters). Photograph the gray card as a reference. - Make an exposure of the scene. - repeat at all the reasonable ISOs, being sure to include the \"in-between\" ISOs (125, 160, 250, 320, 500, 640) and not just the \"round-number\" dial ISOs (100-200-400-800). -Take those dozen or so exposures and open them on the computer, and determine which ISO reveals both maximum noise-free shadow detail and separable (unclipped) highlights. = Maximum dynamic range - to within a 1/6th stop or so. BTW - this is an example of a 13-stop test scene (on film) - metered exposure EV13 in the sunlit textured white-tile wall, EV0 in the \"shaded shadows\" bottom center. FIlm, of course, \"pulls\" better than digital; this was a severe \"pull\" (meter the shadows, underexpose them 3 stops to \"zone 2\", give N-3 underdevelopment, get detail everywhere ). <snip> Blown highlights are determined by exposure, not by dynamic range. You can always expose so that the highlights are not blown. What you are observing is the characteristics of the automatic exposure. To determine the DR, you need to expose manually so that the sensor is just saturated, i.e., no highlights are blown, and then look at the noise in the shadows.", "link": "https://www.l-camera-forum.com/topic/318212-m10-mono-base-iso/?tab=comments#comment-4147116", "origin": "L-forum", "suborigin": "318212-m10-mono-base-iso", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "53 minutes ago, adan said: that's only half the story - as is highlight headroom. the key word in dynamic range is \"range\" - how many stops in total, from end to end, can be captured. without losing detail to blown highlights - or shadows to \"excess\" noise (the noise floor). https://en.wikipedia.org/wiki/noise_floor when i tested iso 100 and 200 with my m10, i looked for a very high-brightness-range scene - deep inky shadows, and also bright specular highlights (sun reflecting off polished bronze) at iso 100, the snr was very good in the deepest shadows (virtually no noise) - but the specular highlight headroom was miserable. at iso 200, the highlight detail separation was a stop (or so) better - but the snr was worse in the deepest shadows (more noise). also by about a stop. so both those isos had effectively the same dynamic range, simply clipped at opposite ends of the range. in other words, it is easy to keep improving the snr by increasing the s(ignal) with more and more exposure - but if that results in blown highlights, it is pointless. gotta measure at both ends. the base iso (or best iso) was probably pretty close to stefan daniel's vague estimate of \"about 135\" - right in between iso 100 and iso 200 (but sadly, not actually a value one can select with the m10). if i had an m10m of my own, i would do a similar test. (if you want something done right, -----> do !!!  -----> it !!!  -----> yourself !!! . ) - find a scene with an extreme brightness range (inky shadows, sunlit whites and near-whites, specular highlights). ideally something with a brightness range of 13 stops or more. - set the lowest available iso and meter a gray card (only objective way to compare exposures with internal reflective meters). photograph the gray card as a reference. - make an exposure of the scene. - repeat at all the reasonable isos, being sure to include the \"in-between\" isos (125, 160, 250, 320, 500, 640) and not just the \"round-number\" dial isos (100-200-400-800). -take those dozen or so exposures and open them on the computer, and determine which iso reveals both maximum noise-free shadow detail and separable (unclipped) highlights. = maximum dynamic range - to within a 1/6th stop or so. btw - this is an example of a 13-stop test scene (on film) - metered exposure ev13 in the sunlit textured white-tile wall, ev0 in the \"shaded shadows\" bottom center. film, of course, \"pulls\" better than digital; this was a severe \"pull\" (meter the shadows, underexpose them 3 stops to \"zone 2\", give n-3 underdevelopment, get detail everywhere ). <snip> blown highlights are determined by exposure, not by dynamic range. you can always expose so that the highlights are not blown. what you are observing is the characteristics of the automatic exposure. to determine the dr, you need to expose manually so that the sensor is just saturated, i.e., no highlights are blown, and then look at the noise in the shadows.", "sortedWord": "None", "Identifyer": null, "identifyer": 23946, "year": "2021"}, {"autor": "Mute-on", "date": "2021-11-28 03:31:00", "content": "Orange looks fantastic! Better than Hermès because you did it yourself (with professional assistance). Enjoy", "link": "https://www.l-camera-forum.com/topic/327000-poor-mans-leica-herm%C3%A8s-edition/?tab=comments#comment-4321669", "origin": "L-forum", "suborigin": "327000-poor-mans-leica-herm%C3%A8s-edition", "result": true, "Selector": "did it yourself", "selectorShort": "yourself", "MarkedSent": "orange looks fantastic! better than hermès because you -----> did !!!  -----> it !!!  -----> yourself !!!  (with professional assistance). enjoy", "sortedWord": "None", "Identifyer": null, "identifyer": 29989, "year": "2021"}, {"autor": "250swb", "date": "2021-11-26 12:04:00", "content": "17 hours ago, James T. Doe said: I just bought an M3 DS and it has the same problem. I've seen videos showing how easy it is to make an adjustment yourself (even Gus Lazarro -the Leica repair guy- has posted on repair forums that it's a pretty easy adjustment) but so far all the videos I've seen only talk about increasing tension on the closing curtain tensioner to fix a left-edge shadow. The OP (and I) have the shadow on the right-edge - so does that mean I'd have to DECREASE tension the opening curtain tensioner? --img--  --img--  I agree with a.noctilux that is left side shutter capping, not right side. To be honest if you can't work that out send it for adjustment and don't try to do it yourself.", "link": "https://www.l-camera-forum.com/topic/325699-leica-m3-shutter-issue/?tab=comments#comment-4320593", "origin": "L-forum", "suborigin": "325699-leica-m3-shutter-issue", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "17 hours ago, james t. doe said: i just bought an m3 ds and it has the same problem. i've seen videos showing how easy it is to make an adjustment yourself (even gus lazarro -the leica repair guy- has posted on repair forums that it's a pretty easy adjustment) but so far all the videos i've seen only talk about increasing tension on the closing curtain tensioner to fix a left-edge shadow. the op (and i) have the shadow on the right-edge - so does that mean i'd have to decrease tension the opening curtain tensioner? --img--  --img--  i agree with a.noctilux that is left side shutter capping, not right side. to be honest if you can't work that out send -----> it !!!  for adjustment and -----> do !!! n't try to -----> do !!!  -----> it !!!  -----> yourself !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 48532, "year": "2021"}, {"autor": "Leon Berg", "date": "2021-08-07 15:25:00", "content": "vor 6 Stunden schrieb Reactivestills: Hi All, I will be looking to purchase two of the same body in the coming months. Either M-A/P In your honest opinion is it worth buying a film Leica in 2021/22 - Will Leica cease to care about analogue cameras Or am I better holding on for digital and paying double the cost. I enjoy both formats but if film processing and sales dwindle in the next 10 years will it be a complete waste of money. Please advise. Thanks Hi. I have no evidence for that, but I tend to claim that digital cameras will be more prone to fail and break than any analog camera one day. Of course I do understand that some people don't like to take the time to develop or like post processing on the computer because it gives you certain freedom. I just cant't think under which circumstances I would pay the money, even if I had it, for a digital Leica, except a SL(S) I don't like the size of the digital M, very easy. It feels to me like a Leica M6/MP on steroids.. I love my film Leica. It has been the best investment in my photography life ever. Of course you have to like the process that comes with it.. whether it is to send the negatives to a lab or learn how to do it yourself. The approach changed my photographic behavior and my view on photography. It was something I always wanted to do and learn and it took me long to actually daring it. Now it feels like I have never done it differently! I truly feel good about it. And along the analog journey you meet so many wonderful people, so many supporting souls that share the love for something truly special. If you're a good photographer I don't care what the medium is you take your photos on, I can understand that as a pro you might need the digital medium for certain freedom or because it is expected of you.. dunno. I will never go back to digital. Good luck and enjoy your journey.", "link": "https://www.l-camera-forum.com/topic/323361-is-it-worth-buying-analogue-in-2021/page/2/?tab=comments#comment-4252901", "origin": "L-forum", "suborigin": "323361-is-it-worth-buying-analogue-in-2021", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "vor 6 stunden schrieb reactivestills: hi all, i will be looking to purchase two of the same body in the coming months. either m-a/p in your honest opinion is it worth buying a film leica in 2021/22 - will leica cease to care about analogue cameras or am i better holding on for digital and paying double the cost. i enjoy both formats but if film processing and sales dwindle in the next 10 years will it be a complete waste of money. please advise. thanks hi. i have no evidence for that, but i tend to claim that digital cameras will be more prone to fail and break than any analog camera one day. of course i do understand that some people don't like to take the time to develop or like post processing on the computer because it gives you certain freedom. i just cant't think under which circumstances i would pay the money, even if i had it, for a digital leica, except a sl(s) i don't like the size of the digital m, very easy. it feels to me like a leica m6/mp on steroids.. i love my film leica. it has been the best investment in my photography life ever. of course you have to like the process that comes with it.. whether -----> it !!!  is to send the negatives to a lab or learn how to -----> do !!!  -----> it !!!  -----> yourself !!! . the approach changed my photographic behavior and my view on photography. it was something i always wanted to do and learn and it took me long to actually daring it. now it feels like i have never done it differently! i truly feel good about it. and along the analog journey you meet so many wonderful people, so many supporting souls that share the love for something truly special. if you're a good photographer i don't care what the medium is you take your photos on, i can understand that as a pro you might need the digital medium for certain freedom or because it is expected of you.. dunno. i will never go back to digital. good luck and enjoy your journey.", "sortedWord": "None", "Identifyer": null, "identifyer": 791, "year": "2021"}, {"autor": "LocalHero1953", "date": "2021-11-17 08:10:00", "content": "Putting on my deerstalker and puffing on my meerschaum stuffed with an ounce of shag........these are the options: The lens was 6 bit coded before CLA and the technician replaced the mount with an uncoded one. Solution: ask the tech. The lens was coded by an amateur with just a marker pen, and the technician cleaned the code off. Solution: ask the tech if there was a painted code. The lens was not coded before CLA, and your M assigned it the only code it knew (from a previous ownership - or you did it yourself and have forgotten). Solution: accept it and move on, and tell your M again that it's a 35/2. Do you still have a receipt or other info from when you bought the lens? Was it said to be 6 bit coded? Edited November 17 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/326671-lens-naming-6-bit-code-has-vanished-after-service-352-v4-m10-d/?tab=comments#comment-4315018", "origin": "L-forum", "suborigin": "326671-lens-naming-6-bit-code-has-vanished-after-service-352-v4-m10-d", "result": true, "Selector": "did it yourself", "selectorShort": "yourself", "MarkedSent": "putting on my deerstalker and puffing on my meerschaum stuffed with an ounce of shag........these are the options: the lens was 6 bit coded before cla and the technician replaced the mount with an uncoded one. solution: ask the tech. the lens was coded by an amateur with just a marker pen, and the technician cleaned the code off. solution: ask the tech if there was a painted code. the lens was not coded before cla, and your m assigned -----> it !!!  the only code -----> it !!!  knew (from a previous ownership - or you -----> did !!!  -----> it !!!  -----> yourself !!!  and have forgotten). solution: accept it and move on, and tell your m again that it's a 35/2. do you still have a receipt or other info from when you bought the lens? was it said to be 6 bit coded? edited november 17 by localhero1953", "sortedWord": "None", "Identifyer": null, "identifyer": 14323, "year": "2021"}, {"autor": "grahamc", "date": "2021-11-17 08:16:00", "content": "5 minutes ago, LocalHero1953 said: Putting on my deerstalker and puffing on my meerschaum stuffed with an ounce of shag........these are the options: The lens was 6 bit coded before CLA and the technician replaced the mount with an uncoded one. Solution: ask the tech. The lens was coded by an amateur with just a marker pen, and the technician cleaned the code off. Solution: ask the tech if there was a painted code. The lens was not coded before CLA, and your M assigned it the only code it knew (from a previous ownership - or you did it yourself and have forgotten). Solution: accept it and move on, and tell your M again that it's a 35/2. Do you still have a receipt or other info from when you bought the lens? Was it said to be 6 bit coded? Thanks ! I agree that this is where we are at with this investigation. I agree with Points 1 and 2 and will ask the tech RE point 3 ... I definitely didn't set into camera and not sure if 10-D can do so (Anyone know if they can ? ) . it would be a strange (but not impossible) coincidence if the first owner of my 10-D set it has his default . but considering I also haven't knowingly made any changes this option might be unlikely. With the unlikeliness of #3 I guess we are looking at something changing with the mount . I'll reach out and ask Sooner I get can this over with the sooner I can get off to an opium den, Watson ! Edited November 17 by grahamc", "link": "https://www.l-camera-forum.com/topic/326671-lens-naming-6-bit-code-has-vanished-after-service-352-v4-m10-d/?tab=comments#comment-4315022", "origin": "L-forum", "suborigin": "326671-lens-naming-6-bit-code-has-vanished-after-service-352-v4-m10-d", "result": true, "Selector": "did it yourself", "selectorShort": "yourself", "MarkedSent": "5 minutes ago, localhero1953 said: putting on my deerstalker and puffing on my meerschaum stuffed with an ounce of shag........these are the options: the lens was 6 bit coded before cla and the technician replaced the mount with an uncoded one. solution: ask the tech. the lens was coded by an amateur with just a marker pen, and the technician cleaned the code off. solution: ask the tech if there was a painted code. the lens was not coded before cla, and your m assigned -----> it !!!  the only code -----> it !!!  knew (from a previous ownership - or you -----> did !!!  -----> it !!!  -----> yourself !!!  and have forgotten). solution: accept it and move on, and tell your m again that it's a 35/2. do you still have a receipt or other info from when you bought the lens? was it said to be 6 bit coded? thanks ! i agree that this is where we are at with this investigation. i agree with points 1 and 2 and will ask the tech re point 3 ... i definitely didn't set into camera and not sure if 10-d can do so (anyone know if they can ? ) . it would be a strange (but not impossible) coincidence if the first owner of my 10-d set it has his default . but considering i also haven't knowingly made any changes this option might be unlikely. with the unlikeliness of #3 i guess we are looking at something changing with the mount . i'll reach out and ask sooner i get can this over with the sooner i can get off to an opium den, watson ! edited november 17 by grahamc", "sortedWord": "None", "Identifyer": null, "identifyer": 14325, "year": "2021"}, {"autor": "beewee", "date": "2021-02-26 07:35:00", "content": "9 hours ago, LocalHero1953 said: If these lenses were designed and patented by other brands, it would be strange if those others didn't actually make them - just Leica. Sony should be well capable of making the this 16-35 since they presumably own the Minolta-Konica patents - but their 16-35 design is quite different. Owning the rights to a design doesn’t mean: A company can make that design at a cost that its target customers will be willing to pay for it A company have the manufacturing know how to implement the design Often times a company will file a patent just to keep competitors from being able take advantage of a design, even if they themselves cannot make use of it. Patent claims are a bit like prospecting stakes. You put stakes down to keep your competitors out of a certain space. Whether you choose to mine the claim or not is a different issue. Sometimes you might make more money leasing (ie. licensing) the stake/claim to another party and have them do the hard work than doing it yourself and trying to sell the goods. Edited February 26 by beewee", "link": "https://www.l-camera-forum.com/topic/317998-new-rumor-sigma-28-7028-contemporary/page/2/?tab=comments#comment-4149051", "origin": "L-forum", "suborigin": "317998-new-rumor-sigma-28-7028-contemporary", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "9 hours ago, localhero1953 said: if these lenses were designed and patented by other brands, it would be strange if those others didn't actually make them - just leica. sony should be well capable of making the this 16-35 since they presumably own the minolta-konica patents - but their 16-35 design is quite different. owning the rights to a design doesn’t mean: a company can make that design at a cost that its target customers will be willing to pay for it a company have the manufacturing know how to implement the design often times a company will file a patent just to keep competitors from being able take advantage of a design, even if they themselves cannot make use of it. patent claims are a bit like prospecting stakes. you put stakes down to keep your competitors out of a certain space. whether you choose to mine the claim or not is a different issue. sometimes you might make more money leasing (ie. licensing) the stake/claim to another party and have them do the hard work than -----> doing !!!  -----> it !!!  -----> yourself !!!  and trying to sell the goods. edited february 26 by beewee", "sortedWord": "None", "Identifyer": null, "identifyer": 47791, "year": "2021"}, {"autor": "Pyrogallol", "date": "2021-11-12 19:33:00", "content": "Just process them normally, If you are doing it yourself do one first and see how it comes out then increase or decrease the development for the next one. If anything they will have lost a bit of contrast over time, if they have not been stored in the fridge, so increase the development a bit to compensate. if you are sending them to a lab to be developed you won’t have any control over what they do. The unused ones should be ok to use, just try one and see, I have plenty of five year old film.", "link": "https://www.l-camera-forum.com/topic/326484-help-developing-film-shot-around-5-years-ago-without-labels/?tab=comments#comment-4312152", "origin": "L-forum", "suborigin": "326484-help-developing-film-shot-around-5-years-ago-without-labels", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "just process them normally, if you are -----> doing !!!  -----> it !!!  -----> yourself !!!  do one first and see how -----> it !!!  comes out then increase or decrease the development for the next one. if anything they will have lost a bit of contrast over time, if they have not been stored in the fridge, so increase the development a bit to compensate. if you are sending them to a lab to be developed you won’t have any control over what they do. the unused ones should be ok to use, just try one and see, i have plenty of five year old film.", "sortedWord": "None", "Identifyer": null, "identifyer": 97508, "year": "2021"}, {"autor": "chasdfg", "date": "2021-01-13 09:36:00", "content": "If I had an M10P or M10, i'd feel harder pressed to get an M10D. I recall you have an M10P (can't keep track though, I know you sold the M10R?), so the difference is even less than the M10 to M10D move because you're getting a screen less camera but everything else aside from the thumb rest and lack of screen are the same. I love the thumb rest, but if I didn't try it, I wouldn't miss it. I see my M10D depreciating at around $100USD a month give or take. That's maybe 4 rolls of film + processing and scanning (depends if you do it yourself i guess). If you'll use it a lot, you'll get your money's worth. If you have other gear and shoot 1 roll of film a month, then it's probably not worthwhile (I aim to use this camera and my M10M evenly, so say 2 rolls of film a month...the price I pay short of shooting 2 extra rolls of film is $50USD, which i try to convince myself is just the convenience of shooting the M10D over a film camera. Or you could give up some other indulgence to own the camera which amounts to $50USD...or tell yourself you'll give it up).", "link": "https://www.l-camera-forum.com/topic/316665-md-262-50-summilux-or-an-m10-d/page/2/?tab=comments#comment-4117318", "origin": "L-forum", "suborigin": "316665-md-262-50-summilux-or-an-m10-d", "result": false, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "that's maybe 4 -----> rolls !!!  of film + processing and scanning (depends if you do it yourself i guess).", "sortedWord": "roll", "Identifyer": null, "identifyer": 15213, "year": "2021"}, {"autor": "seneschal", "date": "2021-07-10 20:43:00", "content": "In the end it's a question of how much damage can I do... if it needed new blinds I would have to send it to a pro shop anyway and I would have to carry that cost. If it can be repaired and it appears to be easy from doing the research, then it's the process of balancing the risk of doing damage and the cost of the potential repair versus the dopamine hit of learning new skills and about learning how the camera works, coupled with the time in a repair shop versus the immediacy of doing it yourself. There are some things I would not touch, at least not without some practice... I'm not going to dismantle and service a coupled rangefinder on a Leica or attempt DIY open heart surgery! It's not for everyone, but for those who might dare but are concerned about the risk of doing this job, I hope that I have given them the thumbs up that it can be done quite easily if you have the right tools... take advantage of me being stupid enough to take a risk and having come out the other side of it safely. By the way, it doesn't always turn out like this. I have planted a surfboard into a sandbar, smashed it and nearly drowned, by \"bravely\" going for the wrong wave and realising too late that I had made a mistake. I've had more than a few close scrapes like this when climbing or snowboarding or riding a bike... never learned my lesson. Not brave, not totally reckless, sometimes lucky.", "link": "https://www.l-camera-forum.com/topic/322598-porous-shutter-blind-repair-on-iiif/?tab=comments#comment-4235766", "origin": "L-forum", "suborigin": "322598-porous-shutter-blind-repair-on-iiif", "result": false, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "if it can be -----> repaired !!!  and it appears to be easy from doing the research, then it's the process of balancing the risk of doing damage and the cost of the potential repair versus the dopamine hit of learning new skills and about learning how the camera works, coupled with the time in a repair shop versus the immediacy of doing it yourself.", "sortedWord": "repair", "Identifyer": null, "identifyer": 37229, "year": "2021"}], "name": "Leicasortedout2021yourself"}