{"interestingcomments": [{"autor": "Jeff S", "date": "2021-03-31 18:20:00", "content": "15 minutes ago, jplomley said: Thank goodness he recovered! His B&W prints are sublime, always wanted to take a workshop with Mr. Butcher back when I was shooting 4x5. The M10M would be a very interesting proposition for this subject material. Would be difficult to resist a color interpretation as well..... He was a color photographer early on, then lost a son, immersed himself in nature and switched to b/w. I’ve admired his work (including darkroom skills), and conservation efforts, for many years, especially when I too was shooting 4x5 b/w. A respected photo dealer friend of mine was similarly impressed when I long ago introduced his work to her. He has remarkably hung in there, despite various health setbacks. Jeff", "link": "https://www.l-camera-forum.com/topic/312315-m10m-for-landscapes/?tab=comments#comment-4171579", "origin": "L-forum", "suborigin": "312315-m10m-for-landscapes", "result": true, "Selector": "i long ago introduced", "selectorShort": "introduce", "MarkedSent": "15 minutes ago, jplomley said: thank goodness he recovered! his b&w prints are sublime, always wanted to take a workshop with mr. butcher back when i was shooting 4x5. the m10m would be a very interesting proposition for this subject material. would be difficult to resist a color interpretation as well..... he was a color photographer early on, then lost a son, immersed himself in nature and switched to b/w. i’ve admired his work (including darkroom skills), and conservation efforts, for many years, especially when i too was shooting 4x5 b/w. a respected photo dealer friend of mine was similarly impressed when -----> i !!!  -----> long !!!  -----> ago !!!  -----> introduced !!!  his work to her. he has remarkably hung in there, despite various health setbacks. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 23722, "year": "2021"}, {"autor": "Herr Barnack", "date": "2021-11-04 13:45:00", "content": "16 hours ago, didier said: I hope he gets a special 007 edition of that Lens Leica could make especially for that occasion Rather than Sean Connery's \"Bond... James Bond,\" I could introduce myself as \"Chicken... Leica Chicken.\" Edited November 4 by Herr Barnack", "link": "https://www.l-camera-forum.com/topic/325987-reid-review-of-cv-apo-35-20-leica-apo-35-20-and-zeiss-35-28/?tab=comments#comment-4306823", "origin": "L-forum", "suborigin": "325987-reid-review-of-cv-apo-35-20-leica-apo-35-20-and-zeiss-35-28", "result": true, "Selector": "i could introduce", "selectorShort": "introduce", "MarkedSent": "16 hours ago, didier said: i hope he gets a special 007 edition of that lens leica could make especially for that occasion rather than sean connery's \"bond... james bond,\" -----> i !!!  -----> could !!!  -----> introduce !!!  myself as \"chicken... leica chicken.\" edited november 4 by herr barnack", "sortedWord": "None", "Identifyer": null, "identifyer": 16542, "year": "2021"}, {"autor": "Henry Taylor", "date": "2021-06-27 23:36:00", "content": " Having a Beer at \"Cook's Corner\" I was introduced to one of the bikers Ol Lady. Couldn't resist and had to get her picture SL OM 50 f1.4 --img--  Edited June 27 by Henry Taylor Changed Picture", "link": "https://www.l-camera-forum.com/topic/322204-ol-lady/?tab=comments#comment-4227549", "origin": "L-forum", "suborigin": "322204-ol-lady", "result": true, "Selector": "i was introduced", "selectorShort": "introduce", "MarkedSent": " having a beer at \"cook's corner\" -----> i !!!  -----> was !!!  -----> introduced !!!  to one of the bikers ol lady. couldn't resist and had to get her picture sl om 50 f1.4 --img--  edited june 27 by henry taylor changed picture", "sortedWord": "None", "Identifyer": null, "identifyer": 44095, "year": "2021"}, {"autor": "willeica", "date": "2021-10-28 12:54:00", "content": "1 hour ago, 250swb said: That's putting me in my place. Kind of also dumps on all those millions of 'unintelligent' people who referred to the film box for exposure guidance and who had no interest at all in figuring anything out beyond that, and why should they, the rules for making a snapshot were printed for them? Your 'Sunny Day' is not my 'Sunny Day' and so on. As I illustrated above with the VPK, Kodak was taking a running jump at this long before they started putting Sunny 16 in film boxes which presumably was after Dr Nagel got them on the way with pre-filled cassettes in the Retina from 1933/34 onwards. Leica had popularised 35mm somewhat with the reloadable FILCAs, but 35mm really took off after the pre-loaded cassettes in a box came on the scene. The 70 + year old 'Swiss Photos' Perutz bulk film in a Leica FILCA which I processed last year contained no Scheiner rating on the film edge. Of course, I had no idea about this or even the age of the film, which could have been up to 85 years old, before getting the advice of a very experienced friend who can almost 'talk to' the film and proceeding to develop it. I used the word 'intelligent' above in the context of how a normal person might perceive such instructions. There is no inference here about who is and who is not intelligent. While, we are at it, I don't recall ever seeing Sunny 16 advice on roll film, but I could be wrong about this. 23 minutes ago, pgk said: Sunny 16 IS guidance and is not an absolute, precision way of determining exposure. My first camera was a Kodak 828 which had a limited number of asjustments and yes, I used the printed guidance with the film as the camera had no meter. There was an inevitable reliance on exposure latitude and transparencies were always difficult to get good exposures from. Exposure seems to be regarded as a black art. It isn't, but you do need to know what you are trying to achieve as it varies depending on what you are doing. FWIW I believe Sunny 16 to be an approximation only and not worth excessive discussion IMO. I agree with all of that, Paul. By coincidence the last film which I used a month or so ago was a roll of 828 exposed in a Kodak Bantam Special. I'm waiting on my friend, mentioned above, to have time to help me with getting the film off the paper backing and onto a spool, before processing. She is really great at handling strange film types/sizes in changing bags which she calls 'nun's knickers'. I must introduce you to her on your next visit to Dublin. William", "link": "https://www.l-camera-forum.com/topic/325629-why-the-sunny-16-rule-doesnt-work/page/3/?tab=comments#comment-4301540", "origin": "L-forum", "suborigin": "325629-why-the-sunny-16-rule-doesnt-work", "result": true, "Selector": "i must introduce", "selectorShort": "introduce", "MarkedSent": "1 hour ago, 250swb said: that's putting me in my place. kind of also dumps on all those millions of 'unintelligent' people who referred to the film box for exposure guidance and who had no interest at all in figuring anything out beyond that, and why should they, the rules for making a snapshot were printed for them? your 'sunny day' is not my 'sunny day' and so on. as i illustrated above with the vpk, kodak was taking a running jump at this long before they started putting sunny 16 in film boxes which presumably was after dr nagel got them on the way with pre-filled cassettes in the retina from 1933/34 onwards. leica had popularised 35mm somewhat with the reloadable filcas, but 35mm really took off after the pre-loaded cassettes in a box came on the scene. the 70 + year old 'swiss photos' perutz bulk film in a leica filca which i processed last year contained no scheiner rating on the film edge. of course, i had no idea about this or even the age of the film, which could have been up to 85 years old, before getting the advice of a very experienced friend who can almost 'talk to' the film and proceeding to develop it. i used the word 'intelligent' above in the context of how a normal person might perceive such instructions. there is no inference here about who is and who is not intelligent. while, we are at it, i don't recall ever seeing sunny 16 advice on roll film, but i could be wrong about this. 23 minutes ago, pgk said: sunny 16 is guidance and is not an absolute, precision way of determining exposure. my first camera was a kodak 828 which had a limited number of asjustments and yes, i used the printed guidance with the film as the camera had no meter. there was an inevitable reliance on exposure latitude and transparencies were always difficult to get good exposures from. exposure seems to be regarded as a black art. it isn't, but you do need to know what you are trying to achieve as it varies depending on what you are doing. fwiw i believe sunny 16 to be an approximation only and not worth excessive discussion imo. i agree with all of that, paul. by coincidence the last film which i used a month or so ago was a roll of 828 exposed in a kodak bantam special. i'm waiting on my friend, mentioned above, to have time to help me with getting the film off the paper backing and onto a spool, before processing. she is really great at handling strange film types/sizes in changing bags which she calls 'nun's knickers'. -----> i !!!  -----> must !!!  -----> introduce !!!  you to her on your next visit to dublin. william", "sortedWord": "None", "Identifyer": null, "identifyer": 97811, "year": "2021"}, {"autor": "andybarton", "date": "2021-10-29 07:28:00", "content": "18 hours ago, willeica said: I must introduce you to her on your next visit to Dublin. Getting your hands in some nun's knickers. There's an offer you can't refuse, Paul", "link": "https://www.l-camera-forum.com/topic/325629-why-the-sunny-16-rule-doesnt-work/page/4/?tab=comments#comment-4302120", "origin": "L-forum", "suborigin": "325629-why-the-sunny-16-rule-doesnt-work", "result": true, "Selector": "i must introduce", "selectorShort": "introduce", "MarkedSent": "18 hours ago, willeica said: -----> i !!!  -----> must !!!  -----> introduce !!!  you to her on your next visit to dublin. getting your hands in some nun's knickers. there's an offer you can't refuse, paul", "sortedWord": "None", "Identifyer": null, "identifyer": 97819, "year": "2021"}, {"autor": "poli", "date": "2021-11-05 07:27:00", "content": "7 hours ago, bcapphoto said: If you could do it again ... would have you kept your MD262 and grabbed an M246? Or are you happy you skipped out on the M246 and swapped your MD262 for an M10D? IMO - it doesn't make sense to have both an M246 and M10D. An M10D and M10M? Maybe. But not 2 bodies from 2 different generations. Makes batteries, muscle memory, etc. weird. If I could do it all again I would stick to the md and get a m246. but… knowing myself… after a while i would still want an m10d and m10m. The problem with looking back at decisions is that your perspective changes over time. So it is kind of useless and can be frustrating. Also if you want simplicity and ONE camera. And you are sure you stick to that for a long while, I’d say: get the m10-d. The low ligt performance is noticeably better. And the body is slimmer. Which is really nice. And just one camera to grab, not having the choice for me always is a ‘thing’. Now that I have a second (film) camera I did introduce a new ‘problem’… I know it might sound crazy.🤪 And yes, I also think it makes sense to stick to one system. Less clutter of different batteries and charges. So the setup you have is really really nice! I hope this helped you 🙂", "link": "https://www.l-camera-forum.com/topic/326041-leica-m10-d-vs-md-262/page/2/?tab=comments#comment-4307408", "origin": "L-forum", "suborigin": "326041-leica-m10-d-vs-md-262", "result": false, "Selector": "i did introduce", "selectorShort": "introduce", "MarkedSent": "now that i have a second (-----> film !!! ) camera i did introduce a new ‘problem’… i know it might sound crazy.", "sortedWord": "film", "Identifyer": null, "identifyer": 2176, "year": "2021"}, {"autor": "logan2z", "date": "2021-03-15 00:42:00", "content": " I purchased my M-A new about 4 years ago and the camera has been faultless. Yesterday, however, I was out shooting and encountered a bit of a glitch with the film advance. I know there have been reports in the past of new M-As with film advance problems, but mine has never missed a beat before and this problem seems a bit different than those reported by others. Here's what happened: I had the M-A around my neck and I was holding a second camera body in my hand. I took a shot with the M-A and used the hand that was holding the second body to advance the film on the M-A. It was a bit awkward to do with the other body in my hand, and I realized after releasing the film advance lever that I hadn't extended it far enough to cock the shutter. So I pulled the lever again until I heard the shutter cock. I took another shot and noticed that the rewind knob didn't turn as I advanced the film. I fired the shutter again, then advanced the film again, and this time noticed that the rewind knob did turn. So I figured that I had caused a glitch by not fully advancing the film on the last shot but the problem had corrected itself. I shot a few more pictures and the rewind knob seemed to rotate as expected when I advanced the film so all seemed ok. However, today I was out shooting again and noticed that the rewind knob didn't always turn (or barely turned) when I advanced the film. Whenever I noticed that, I fired off a few frames and advanced the film after each shot, and the film would sometimes advance correctly, but not always. I had a possible theory that perhaps I had managed to introduce some slack into the film that required a few winds of the film advance to be taken up. But once it started advancing correctly, I assumed it would continue to do so, but that wasn't always the case. So I'm not sure exactly what is going on. Does anyone have a theory as to what might be causing this?", "link": "https://www.l-camera-forum.com/topic/318937-intermittent-m-a-film-advance-glitch/?tab=comments#comment-4160869", "origin": "L-forum", "suborigin": "318937-intermittent-m-a-film-advance-glitch", "result": false, "Selector": "i had managed to introduce", "selectorShort": "introduce", "MarkedSent": "i had a possible theory that perhaps i had managed to introduce some slack into the -----> film !!!  that required a few winds of the -----> film !!!  advance to be taken up.", "sortedWord": "film", "Identifyer": null, "identifyer": 5277, "year": "2021"}, {"autor": "Boojay", "date": "2021-08-27 06:25:00", "content": "Directly taken from Cameraquest - great source of info How to Recognize Version II?Version II on the filter ringVersion I has no I or II designationVersion I introduced in 2008 for film How to Recognize SC or MC?SC or Single Coated lenses are marked SC on the filter ringMC or Multi Coated lenses have no MC or SC markings", "link": "https://www.l-camera-forum.com/topic/296994-voigtl%C3%A4nder-nokton-3514-ii/page/4/?tab=comments#comment-4264508", "origin": "L-forum", "suborigin": "296994-voigtl%C3%A4nder-nokton-3514-ii", "result": false, "Selector": "i introduced", "selectorShort": "introduce", "MarkedSent": "directly taken from cameraquest - great source of info how to recognize version ii?version ii on the filter ringversion i has no i or ii designationversion i introduced in 2008 for -----> film !!!  how to recognize sc or mc?sc or single coated lenses are marked sc on the filter ringmc or multi coated lenses have no mc or sc markings", "sortedWord": "film", "Identifyer": null, "identifyer": 13315, "year": "2021"}], "name": "Leicasortedout2021introduce"}