{"interestingcomments": [{"autor": "jaapv", "date": "2010-04-19 21:34:00", "content": "That's a lot of information to digest. I think I need to take a break from this, and read on how to use \"channel mixer\" for Photoshop. Until now, I thought I was simply learning how to take interesting looking IR photos with the M8. From the linked discussions, I see that what I really need to do, is get the M8 to emulate the way Ektachrome IR slide film created pictures. Apparently this will take a good bit of experimentation and testing - but I'd have thought that since the Ektachrome IR was \"always\" the same, a set of procedures and values should allow me to translate in M8 image into what the slide film would have produced. (It might then need fine tuning, but maybe not, as the slide film never got \"fine tuned\".) Obviously, the M8 can do all the above quite nicely, so it's just left for me to learn what you guys have shown me. It still seems possible that one could come up with a procedure, a series of steps, that if followed exactly, would produce the equivalent of what the IR Ektachrome would have produced. If I want color, I'll need to use a tripod and take two shots, one \"normal\" and one with the IR filter. I've got to stop now, as I'm leaving on a two-week trip tomorrow. However, I'll have lots of time in the countryside to practice on these things, and will bring a Photoshop book with me so I can learn to use the channel mixer function. Thanks!! You'll have to dig up an old LFI. It must have been about nine months ago that the whole procedure was described.", "link": "https://www.l-camera-forum.com/topic/96795-taking-ir-photos-with-an-m82/?tab=comments#comment-1299213", "origin": "L-forum", "suborigin": "96795-taking-ir-photos-with-an-m82", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "that's a lot of information to digest. i think i need to take a break from this, and read on how to use \"channel mixer\" for photoshop. until now, i thought i was simply learning how to take interesting looking ir photos with the m8. from the linked discussions, i see that what i really need to do, is get the m8 to emulate the way ektachrome ir slide film created pictures. apparently this will take a good bit of experimentation and testing - but i'd have thought that since the ektachrome ir was \"always\" the same, a set of procedures and values should allow me to translate in m8 image into what the slide film would have produced. (it might then need fine tuning, but maybe not, as the slide film never got \"fine tuned\".) obviously, the m8 can do all the above quite nicely, so it's just left for me to learn what you guys have shown me. it still seems possible that one could -----> come !!!  -----> up !!!  -----> with !!!  a procedure, a series of steps, that if followed exactly, would produce the equivalent of what the ir ektachrome would have produced. if i want color, i'll need to use a tripod and take two shots, one \"normal\" and one with the ir filter. i've got to stop now, as i'm leaving on a two-week trip tomorrow. however, i'll have lots of time in the countryside to practice on these things, and will bring a photoshop book with me so i can learn to use the channel mixer function. thanks!! you'll have to dig up an old lfi. it must have been about nine months ago that the whole procedure was described.", "sortedWord": "None", "Identifyer": null, "identifyer": 43434, "year": "2010"}, {"autor": "LuxBob", "date": "2010-08-05 18:40:00", "content": "If nobody comes up with something I could come up with some possibilities, most taken on the go though and none of them exotic or sparkling - just my taste.", "link": "https://www.l-camera-forum.com/topic/119687-name-this-car/page/14/?tab=comments#comment-1397674", "origin": "L-forum", "suborigin": "119687-name-this-car", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "if nobody -----> comes !!!  -----> up !!!  -----> with !!!  something i could come -----> up !!!  -----> with !!!  some possibilities, most taken on the go though and none of them exotic or sparkling - just my taste.", "sortedWord": "None", "Identifyer": null, "identifyer": 56416, "year": "2010"}, {"autor": "kkochheiser", "date": "2010-08-10 11:04:00", "content": " VERY nice indeed! 328s were amazingly modern cars for the 1930s. A lighter one like this would have been a successful racer even after the war. Let's see what I can come up with next... Kent", "link": "https://www.l-camera-forum.com/topic/119687-name-this-car/page/15/?tab=comments#comment-1402205", "origin": "L-forum", "suborigin": "119687-name-this-car", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " very nice indeed! 328s were amazingly modern cars for the 1930s. a lighter one like this would have been a successful racer even after the war. let's see what i can -----> come !!!  -----> up !!!  -----> with !!!  next... kent", "sortedWord": "None", "Identifyer": null, "identifyer": 56433, "year": "2010"}], "name": "Leicasortedout2010with"}