{"interestingcomments": [{"autor": "BAASCH", "date": "2016-04-28 07:18:00", "content": "I received my new Vario a few days ago, did one shoot with a model with it, and it fully lives up to my expectations. It's a wonderful piece of photographic machinery. It really is like having four primes. The Canon and its lenses didn't leave their bag during the shoot. So is the Vario perfect? Of course not. But I agree with some of the participants here that a firmware update would probably suffice to 'renew' it. A few weeks ago, I exchanged a few emails with a very friendly person working at Leica concerning my X2, and I am compiling a list of requests/suggestions that I intend to send to him. Here's what I have so far. Comments and additional items welcome (but bear in mind that, being the one who sends it, I will only include the ones that I agree with). When using spot for light metering in conjunction with manual focus, provide a mark at the center of the image indicating the size of the area that is used for metering (the X2 has this, but on the Vario there is no mark at all). Auto ISO in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. Make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing a user profile or the light metering mode, and perhaps other functions. Make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). Allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add ISO and f-stop values to the information that can be shown. Add focus type (manual/auto) to the EXIF information written with the image files. Add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. Improve live view to reflect the chosen exposure more accurately (when half-pressing the shutter button). Shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off'. Enable user to enter basic copyright information that will be added to all images automatically. These improvements, or any subset of them, would make the Vario even more wonderful than it already is. And Leica would score goodwill points all over the place with a firmware update like this. I'll be sending the email in a week or so, and will report back on the reply.", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/4/?tab=comments#comment-3034897", "origin": "L-forum", "suborigin": "253974-xv-its-getting-old", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "i received my new vario a few days ago, did one shoot with a model with it, and it fully lives up to my expectations. it's a wonderful piece of photographic machinery. it really is like having four primes. the canon and its lenses didn't leave their bag during the shoot. so is the vario perfect? of course not. but i agree with some of the participants here that a firmware update would probably suffice to 'renew' it. a few weeks ago, i exchanged a few emails with a very friendly person working at leica concerning my x2, and i am compiling a list of requests/suggestions that i intend to send to him. here's what i have so far. comments and additional items welcome (but bear in mind that, being the one who sends it, i will only include the ones that i agree with). when using spot for light metering in conjunction with manual focus, provide a mark at the center of the image indicating the size of the area that is used for metering (the x2 has this, but on the vario there is no mark at all). auto iso in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing a user profile or the light metering mode, and perhaps other functions. make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add iso and f-stop values to the information that can be shown. add focus type (manual/auto) to the exif information written with the image files. add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. -----> improve !!!  live view to reflect the chosen exposure more accurately (when half-pressing the shutter button). shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off'. enable user to enter basic copyright information that will be added to all images automatically. these improvements, or any subset of them, would make the vario even more wonderful than it already is. and leica would score goodwill points all over the place with a firmware update like this. i'll be sending the email in a week or so, and will report back on the reply.", "sortedWord": "None", "Identifyer": null, "identifyer": 12442, "year": "2016"}, {"autor": "Sho-Bud", "date": "2016-05-02 11:48:00", "content": "I received my new Vario a few days ago, did one shoot with a model with it, and it fully lives up to my expectations. It's a wonderful piece of photographic machinery. It really is like having four primes. The Canon and its lenses didn't leave their bag during the shoot. So is the Vario perfect? Of course not. But I agree with some of the participants here that a firmware update would probably suffice to 'renew' it. A few weeks ago, I exchanged a few emails with a very friendly person working at Leica concerning my X2, and I am compiling a list of requests/suggestions that I intend to send to him. Here's what I have so far. Comments and additional items welcome (but bear in mind that, being the one who sends it, I will only include the ones that I agree with). When using spot for light metering in conjunction with manual focus, provide a mark at the center of the image indicating the size of the area that is used for metering (the X2 has this, but on the Vario there is no mark at all). Auto ISO in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. Make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing a user profile or the light metering mode, and perhaps other functions. Make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). Allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add ISO and f-stop values to the information that can be shown. Add focus type (manual/auto) to the EXIF information written with the image files. Add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. Improve live view to reflect the chosen exposure more accurately (when half-pressing the shutter button). Shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off'. Enable user to enter basic copyright information that will be added to all images automatically. These improvements, or any subset of them, would make the Vario even more wonderful than it already is. And Leica would score goodwill points all over the place with a firmware update like this. I'll be sending the email in a week or so, and will report back on the reply. And maybe also: 1. A buttonguard, eg. sometimes accidentally one of the buttons left of the screen are pressed. So an option that you would have to press the 6 o'clock of the 4-way button simultanious would be great. 2.Continuous auto focus, ( I also have an Olympus XZ-1, everyone was raving about it's focus speed, but actually, it has a permanent continuous auto focus, which speeds up things considerably) 3. Focus peaking 4. When face detection is switched on, and the camera fails to recognize a face, it falls back to multi-point auto focus. I would like it to choose to what mode it falls back. The easiest way would be if face detection isn't a separate mode, but an option you can switch on or of. So you can choose your preferred focus mode, and additionally switch on or of the face detection. 5. Face detection with nearest eye detection. 6. More precise auto focus algorithm. 7. Multi-point spot metering", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/4/?tab=comments#comment-3037519", "origin": "L-forum", "suborigin": "253974-xv-its-getting-old", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "i received my new vario a few days ago, did one shoot with a model with it, and it fully lives up to my expectations. it's a wonderful piece of photographic machinery. it really is like having four primes. the canon and its lenses didn't leave their bag during the shoot. so is the vario perfect? of course not. but i agree with some of the participants here that a firmware update would probably suffice to 'renew' it. a few weeks ago, i exchanged a few emails with a very friendly person working at leica concerning my x2, and i am compiling a list of requests/suggestions that i intend to send to him. here's what i have so far. comments and additional items welcome (but bear in mind that, being the one who sends it, i will only include the ones that i agree with). when using spot for light metering in conjunction with manual focus, provide a mark at the center of the image indicating the size of the area that is used for metering (the x2 has this, but on the vario there is no mark at all). auto iso in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing a user profile or the light metering mode, and perhaps other functions. make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add iso and f-stop values to the information that can be shown. add focus type (manual/auto) to the exif information written with the image files. add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. -----> improve !!!  live view to reflect the chosen exposure more accurately (when half-pressing the shutter button). shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off'. enable user to enter basic copyright information that will be added to all images automatically. these improvements, or any subset of them, would make the vario even more wonderful than it already is. and leica would score goodwill points all over the place with a firmware update like this. i'll be sending the email in a week or so, and will report back on the reply. and maybe also: 1. a buttonguard, eg. sometimes accidentally one of the buttons left of the screen are pressed. so an option that you would have to press the 6 o'clock of the 4-way button simultanious would be great. 2.continuous auto focus, ( i also have an olympus xz-1, everyone was raving about it's focus speed, but actually, it has a permanent continuous auto focus, which speeds up things considerably) 3. focus peaking 4. when face detection is switched on, and the camera fails to recognize a face, it falls back to multi-point auto focus. i would like it to choose to what mode it falls back. the easiest way would be if face detection isn't a separate mode, but an option you can switch on or of. so you can choose your preferred focus mode, and additionally switch on or of the face detection. 5. face detection with nearest eye detection. 6. more precise auto focus algorithm. 7. multi-point spot metering", "sortedWord": "None", "Identifyer": null, "identifyer": 12443, "year": "2016"}, {"autor": "BAASCH", "date": "2016-05-16 10:59:00", "content": "Here's the full text of the email I just sent to Leica. I didn't copy most of the suggestions provided by some of you, because I thought they were either unfeasible or low priority (sorry!). Now let's see what happens... I do hope Leica will allocate some resources to implement at least the most important improvements. We exchanged a few emails earlier, and I am taking the liberty to approach you again. After acquiring a second hand X2 last month, I now bought a new X Vario. I am positively stunned by the image quality. This camera is not much loved by many, but it deserves high praise! However, it also deserves… a 1.2 (or 2.0) firmware update. I know Leica would make many loyal X Vario users very happy (and even more loyal) with an update that would take care of the following things. A subset of these improvements would also be very welcome, to be sure, which is why I put the items in order of importance, as I see it. I also asked for improvement suggestions at the Leica forum, and it seems my initiative was well received there. Add exposure lock. Half-pressing the shutter button is not always an option, because the user may want to focus on a different part of the scene than the part that the exposure should be based on. When using spot for light metering in conjunction with manual focus, provide a mark at the center of the image so user knows which area is used for metering (the X2 has this). Make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing user profile or light metering mode, or perhaps other functions. Make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). Allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add ISO and f-stop to the information that can be shown. For example, I’d like to see the histogram, but not the rule of thirds grid. Allow user to choose to have the exposure bar (I mean the display feature showing light measurement in third stops relative to a zero point in the middle) visible at all times (now it disappears after about 12 seconds, which is inconvenient when using spot metering to measure different light values in a scene). Auto ISO in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. Make the shutter speed adjustable in smaller increments through use of a button/dial. When using an incident light meter, precise shutter speed values sometimes need to be set on the camera. Get rid of the semi-transparent bars on top and bottom of the most information-rich display view. They obscure parts of the target frame, and seem to serve no real purpose. Change the histogram to the one seen on the X2 with the horizontal bar showing Adams’ Zones. Improve live view to reflect the chosen exposure more accurately (when half-pressing the shutter button), and/or allow user to turn it off completely, making the viewfinder, whether LCD or EFV, function more like an optical viewfinder. Add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. The jpegs this camera produces are excellent, and for some situations, having film simulation bracketing would remove the need for shooting DNG. Add focus type (manual/auto) to the EXIF information written with the image files. Shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off’. Enable user to enter basic copyright information that will be added to all images automatically. Leica is in a position to make this amazing camera even better. Many people are still buying the X Vario, new, and I am sure they are all hoping for improvements like those listed above. Please, take the X Vario from “sehr gut” to “fabelhaft”!", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/5/?tab=comments#comment-3045766", "origin": "L-forum", "suborigin": "253974-xv-its-getting-old", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "here's the full text of the email i just sent to leica. i didn't copy most of the suggestions provided by some of you, because i thought they were either unfeasible or low priority (sorry!). now let's see what happens... i do hope leica will allocate some resources to implement at least the most important improvements. we exchanged a few emails earlier, and i am taking the liberty to approach you again. after acquiring a second hand x2 last month, i now bought a new x vario. i am positively stunned by the image quality. this camera is not much loved by many, but it deserves high praise! however, it also deserves… a 1.2 (or 2.0) firmware update. i know leica would make many loyal x vario users very happy (and even more loyal) with an update that would take care of the following things. a subset of these improvements would also be very welcome, to be sure, which is why i put the items in order of importance, as i see it. i also asked for improvement suggestions at the leica forum, and it seems my initiative was well received there. add exposure lock. half-pressing the shutter button is not always an option, because the user may want to focus on a different part of the scene than the part that the exposure should be based on. when using spot for light metering in conjunction with manual focus, provide a mark at the center of the image so user knows which area is used for metering (the x2 has this). make the six o’clock position of the circular button on the back and the movie recording button both programmable, so user can set them to choosing user profile or light metering mode, or perhaps other functions. make the self-timer stick (i.e. if user activates the self-timer, it should remain active until user selects normal shooting mode again). allow the user to pick exactly which information is shown on the monitor/viewfinder while shooting, and add iso and f-stop to the information that can be shown. for example, i’d like to see the histogram, but not the rule of thirds grid. allow user to choose to have the exposure bar (i mean the display feature showing light measurement in third stops relative to a zero point in the middle) visible at all times (now it disappears after about 12 seconds, which is inconvenient when using spot metering to measure different light values in a scene). auto iso in manual mode (added with firmware 1.1) should be optional, i.e. user should be able to have it turned off by default. make the shutter speed adjustable in smaller increments through use of a button/dial. when using an incident light meter, precise shutter speed values sometimes need to be set on the camera. get rid of the semi-transparent bars on top and bottom of the most information-rich display view. they obscure parts of the target frame, and seem to serve no real purpose. change the histogram to the one seen on the x2 with the horizontal bar showing adams’ zones. -----> improve !!!  live view to reflect the chosen exposure more accurately (when half-pressing the shutter button), and/or allow user to turn it off completely, making the viewfinder, whether lcd or efv, function more like an optical viewfinder. add preset film bracketing: let user choose two or three color reproduction styles, and let the camera produce these for each shot. the jpegs this camera produces are excellent, and for some situations, having film simulation bracketing would remove the need for shooting dng. add focus type (manual/auto) to the exif information written with the image files. shorten the time elapsed before the camera is ready to shoot again when ‘auto review’ is sett to 'off’. enable user to enter basic copyright information that will be added to all images automatically. leica is in a position to make this amazing camera even better. many people are still buying the x vario, new, and i am sure they are all hoping for improvements like those listed above. please, take the x vario from “sehr gut” to “fabelhaft”!", "sortedWord": "None", "Identifyer": null, "identifyer": 12451, "year": "2016"}, {"autor": "TMorita", "date": "2016-05-21 02:21:00", "content": "> 9. Get rid of the semi-transparent bars on top and bottom of the most information-rich display view. They obscure parts of the target frame, and seem to serve no real purpose. Pressing the INFO button will make them disable them temporarily. > 11. Improve live view to reflect the chosen exposure more accurately (when half-pressing the shutter button), and/or allow user to turn it off completely, making the viewfinder, whether LCD or EFV, function more like an optical viewfinder. That feature is called \"aperture preview\" on most cameras. The camera first does focusing at max aperture, then switches to the specified aperture so the DoF can be checked. You're basically asking for the \"disable the aperture preview\" feature that I mentioned in a previous post in this thread, BTW. Toshi Edited May 21, 2016 by TMorita", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/5/?tab=comments#comment-3048426", "origin": "L-forum", "suborigin": "253974-xv-its-getting-old", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "> 9. get rid of the semi-transparent bars on top and bottom of the most information-rich display view. they obscure parts of the target frame, and seem to serve no real purpose. pressing the info button will make them disable them temporarily. > 11. -----> improve !!!  live view to reflect the chosen exposure more accurately (when half-pressing the shutter button), and/or allow user to turn it off completely, making the viewfinder, whether lcd or efv, function more like an optical viewfinder. that feature is called \"aperture preview\" on most cameras. the camera first does focusing at max aperture, then switches to the specified aperture so the dof can be checked. you're basically asking for the \"disable the aperture preview\" feature that i mentioned in a previous post in this thread, btw. toshi edited may 21, 2016 by tmorita", "sortedWord": "None", "Identifyer": null, "identifyer": 12452, "year": "2016"}, {"autor": "BAASCH", "date": "2016-05-21 07:34:00", "content": "> 9. Get rid of the semi-transparent bars on top and bottom of the most information-rich display view. They obscure parts of the target frame, and seem to serve no real purpose. Pressing the INFO button will make them disable them temporarily. > 11. Improve live view to reflect the chosen exposure more accurately (when half-pressing the shutter button), and/or allow user to turn it off completely, making the viewfinder, whether LCD or EFV, function more like an optical viewfinder. That feature is called \"aperture preview\" on most cameras. The camera first does focusing at max aperture, then switches to the specified aperture so the DoF can be checked. You're basically asking for the \"disable the aperture preview\" feature that I mentioned in a previous post in this thread, BTW. Pressing INFO gets rid of the semi-transparent bars and the content of those bars. I was asking for the bars themselves to disappear; the data shown can be retained (using shaded lettering visible on any background). About the aperture preview, my main request is to make it a lot more accurate (it is quite inaccurate now).", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/page/5/?tab=comments#comment-3048487", "origin": "L-forum", "suborigin": "253974-xv-its-getting-old", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "> 9. get rid of the semi-transparent bars on top and bottom of the most information-rich display view. they obscure parts of the target frame, and seem to serve no real purpose. pressing the info button will make them disable them temporarily. > 11. -----> improve !!!  live view to reflect the chosen exposure more accurately (when half-pressing the shutter button), and/or allow user to turn it off completely, making the viewfinder, whether lcd or efv, function more like an optical viewfinder. that feature is called \"aperture preview\" on most cameras. the camera first does focusing at max aperture, then switches to the specified aperture so the dof can be checked. you're basically asking for the \"disable the aperture preview\" feature that i mentioned in a previous post in this thread, btw. pressing info gets rid of the semi-transparent bars and the content of those bars. i was asking for the bars themselves to disappear; the data shown can be retained (using shaded lettering visible on any background). about the aperture preview, my main request is to make it a lot more accurate (it is quite inaccurate now).", "sortedWord": "None", "Identifyer": null, "identifyer": 12453, "year": "2016"}, {"autor": "Ole Fasmer", "date": "2016-04-14 17:30:00", "content": "araldit will work fine on cast iron. Improve strength, by drilling a hole in both parts and inserting a steel pin together with the glue.", "link": "https://www.l-camera-forum.com/topic/258759-leica-focomat-1c-broken-part/page/2/?tab=comments#comment-3026578", "origin": "L-forum", "suborigin": "258759-leica-focomat-1c-broken-part", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "araldit will work fine on cast iron. -----> improve !!!  strength, by drilling a hole in both parts and inserting a steel pin together with the glue.", "sortedWord": "None", "Identifyer": null, "identifyer": 106662, "year": "2016"}], "name": "Leicasortedout2016improve"}