{"interestingcomments": [{"autor": "4X5B&W", "date": "2017-02-03 01:48:00", "content": "I think what Leica has done with the M10 is the way most traditional Leica owners of film M's have really appreciated, and digital only shooters are now finding an appreciation for, such as simplification of design rather than a feature driven design. All this talk of ever higher and higher ISO capabilities seems to be strange for people who tend to shoot at base ISO speed to get the ultimate quality from the sensor and lenses. Again this constant talk about larger MP sensors is also a distraction, talk to people who have the 36MP+ cameras and they will tell you about how unsharp their images are when hand held. Of course if you shoot hand held in daylight, you could always bump up the ISO speed to compensate for hand held vibration…..and have poorer sensor performance, Humm!! Don't want a Leica M that can only perform well an a massive tripod. So my thoughts on future potential refinements: Improve the viewfinder even more, just because it's better than ever is no reason to not try to improve future viewfinders. Reduce the size and weight to M4 proportions or slightly smaller, other manufacturers are producing smaller FF bodies that are great and encroaching into typical Leica M territory. Improve sensor performance without drastically adding more MP's, just better image quality to take advantage of Leica's fabulous lenses. Hey, try to meet the competition price wise, not to beat them pricewise, just be more competitive and attract more customers as a result. Edited February 3, 2017 by 4X5B&W", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/3/?tab=comments#comment-3203271", "origin": "L-forum", "suborigin": "268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts", "result": true, "Selector": "improve", "selectorShort": "improve", "MarkedSent": "i think what leica has done with the m10 is the way most traditional leica owners of film m's have really appreciated, and digital only shooters are now finding an appreciation for, such as simplification of design rather than a feature driven design. all this talk of ever higher and higher iso capabilities seems to be strange for people who tend to shoot at base iso speed to get the ultimate quality from the sensor and lenses. again this constant talk about larger mp sensors is also a distraction, talk to people who have the 36mp+ cameras and they will tell you about how unsharp their images are when hand held. of course if you shoot hand held in daylight, you could always bump up the iso speed to compensate for hand held vibration…..and have poorer sensor performance, humm!! don't want a leica m that can only perform well an a massive tripod. so my thoughts on future potential refinements: improve the viewfinder even more, just because it's better than ever is no reason to not try to improve future viewfinders. reduce the size and weight to m4 proportions or slightly smaller, other manufacturers are producing smaller ff bodies that are great and encroaching into typical leica m territory. -----> improve !!!  sensor performance without drastically adding more mp's, just better image quality to take advantage of leica's fabulous lenses. hey, try to meet the competition price wise, not to beat them pricewise, just be more competitive and attract more customers as a result. edited february 3, 2017 by 4x5b&w", "sortedWord": "None", "Identifyer": null, "identifyer": 3321, "year": "2017"}, {"autor": "Daniel Beacock", "date": "2017-01-19 22:32:00", "content": "Why I would switch: Form factor - wouldn't have bothered me with my 240... until I got an M7 and then M4 & M3. I simply love those smaller bodies and think the size of the M10 is fantastic. Big plus for me. Better EVF - I do a lot of theatre photography where my primary lens choice is 85mm Canon FD f1.2L. I'd love no blackout ideally, but cutting the current blackout by 2/3rds would be extremely welcome. Better ISO - I usually go no higher than 1600, maybe 2000 on the 240 at a real push, but for theatre photography higher ISO would be invaluable. Bigger buffer - I'm not looking for 'machine gun' speeds, but I do hit the buffers occasionally and bigger would be better. Intervalometer - I occasionally do time lapses so that would be appealing ISO dial - initially didn't like it due to aesthetics, but can now see huge benefits, especially the way it has been implemented. Improved OVF - being a glasses wearer I'd love a wider POV. Why I would hesitate to switch: Smaller batteries - love the 240's capacity and would miss that. Video - controversial I know, but I do use it occasionally and it is the only camera I currently own capable of producing that kind of quality. Coloured focus peaking - minor point but I do change colours according to ease of use for certain backgrounds. No black paint version - I do love the gradual brassing of my 240, although I'm sure I'll not appreciate it so much when it comes to resale! Things I'm not bothered about: Wifi - really, really not bothered Movable focus point - again, irrelevant to me. So will I switch? Right now, no. To be honest mostly due to lack of funds! But I am more than happy with the 240 and it is more than capable. An M10 would definitely make my life easier, but I am happy to wait and eventually pick up a second hand M10P a few years down the line. Sent from my iPad using Tapatalk", "link": "https://www.l-camera-forum.com/topic/268389-why-m240-users-will-not-switch-to-m10/page/2/?tab=comments#comment-3191430", "origin": "L-forum", "suborigin": "268389-why-m240-users-will-not-switch-to-m10", "result": true, "Selector": "improved", "selectorShort": "improve", "MarkedSent": "why i would switch: form factor - wouldn't have bothered me with my 240... until i got an m7 and then m4 & m3. i simply love those smaller bodies and think the size of the m10 is fantastic. big plus for me. better evf - i do a lot of theatre photography where my primary lens choice is 85mm canon fd f1.2l. i'd love no blackout ideally, but cutting the current blackout by 2/3rds would be extremely welcome. better iso - i usually go no higher than 1600, maybe 2000 on the 240 at a real push, but for theatre photography higher iso would be invaluable. bigger buffer - i'm not looking for 'machine gun' speeds, but i do hit the buffers occasionally and bigger would be better. intervalometer - i occasionally do time lapses so that would be appealing iso dial - initially didn't like it due to aesthetics, but can now see huge benefits, especially the way it has been implemented. -----> improved !!!  ovf - being a glasses wearer i'd love a wider pov. why i would hesitate to switch: smaller batteries - love the 240's capacity and would miss that. video - controversial i know, but i do use it occasionally and it is the only camera i currently own capable of producing that kind of quality. coloured focus peaking - minor point but i do change colours according to ease of use for certain backgrounds. no black paint version - i do love the gradual brassing of my 240, although i'm sure i'll not appreciate it so much when it comes to resale! things i'm not bothered about: wifi - really, really not bothered movable focus point - again, irrelevant to me. so will i switch? right now, no. to be honest mostly due to lack of funds! but i am more than happy with the 240 and it is more than capable. an m10 would definitely make my life easier, but i am happy to wait and eventually pick up a second hand m10p a few years down the line. sent from my ipad using tapatalk", "sortedWord": "None", "Identifyer": null, "identifyer": 20239, "year": "2017"}, {"autor": "FlashGordonPhotography", "date": "2017-11-06 06:53:00", "content": " XID = 50 megapixels. S = 37.X megapixels. XID lenses work and XID can be used with H lenses or now with adaptor and electronic shutter ( which is too slow @300ms read times) but still ...hello Leica M/Zeis Otus/<Milvus/Hasselblad V lenses and others... S lenses break down. S costs much more than XID hmmmmm tough choice NOT. Only people who have not worked with Hasselblad files would ever say the S files are 'better'. Lightroom has worked with Hasselblad files for years....but it is true Phocus deliver better raw conversion... btw - Hasselblad XID has 30/45 and 90 readily available - and Leica S has only a 30 not 45 or 90 available so umm how was this comparison made exactly by OP...? Well........ There is most certainly a 45mm for the S system. Don't know where you got the idea there isn't. There is a permanent fix for the S lenses. It's been in place for several months. All new manufactured lenses have the new part. Broken lenses are serviced for free. S adaptors are available for HC, V and Contax lenses. Some maintain AF as well. Plus the S has a reasonably complete range of lenses. rarely need an adapted lens. The S has a 100mm. Close enough to the 90 and it's faster by a stop and a half. S lenses are the benchmark for miniMF lenses. The X1D lenses are great but the S lenses are better. And faster. And with better blur characteristics. Each lens is also available in a FP version to give a higher shutter speed OR CS version (except the zoom and 100). Plus there's a full range (10 lenses). The X1D has three and the fourth is two months late. Almost zero chance there will be the lenses Hasselblad promises, when they promise them. The X1D firmware is still in the advanced beta stage. Improving? Definitely. Finished? Definitely not. Everything is faster on the S. And it have 4 times the battery life. In the real world there's something about those S lenses. The difference in IQ is small. 37.5 to 51 isn't that big in real world usage. Non-existent if you like the 2:3 ratio. Unlike most, I actually own both cameras....... Gordon Edited November 6, 2017 by FlashGordonPhotography", "link": "https://www.l-camera-forum.com/topic/278073-x1d/page/3/?tab=comments#comment-3389820", "origin": "L-forum", "suborigin": "278073-x1d", "result": true, "Selector": "improving", "selectorShort": "improve", "MarkedSent": " xid = 50 megapixels. s = 37.x megapixels. xid lenses work and xid can be used with h lenses or now with adaptor and electronic shutter ( which is too slow @300ms read times) but still ...hello leica m/zeis otus/<milvus/hasselblad v lenses and others... s lenses break down. s costs much more than xid hmmmmm tough choice not. only people who have not worked with hasselblad files would ever say the s files are 'better'. lightroom has worked with hasselblad files for years....but it is true phocus deliver better raw conversion... btw - hasselblad xid has 30/45 and 90 readily available - and leica s has only a 30 not 45 or 90 available so umm how was this comparison made exactly by op...? well........ there is most certainly a 45mm for the s system. don't know where you got the idea there isn't. there is a permanent fix for the s lenses. it's been in place for several months. all new manufactured lenses have the new part. broken lenses are serviced for free. s adaptors are available for hc, v and contax lenses. some maintain af as well. plus the s has a reasonably complete range of lenses. rarely need an adapted lens. the s has a 100mm. close enough to the 90 and it's faster by a stop and a half. s lenses are the benchmark for minimf lenses. the x1d lenses are great but the s lenses are better. and faster. and with better blur characteristics. each lens is also available in a fp version to give a higher shutter speed or cs version (except the zoom and 100). plus there's a full range (10 lenses). the x1d has three and the fourth is two months late. almost zero chance there will be the lenses hasselblad promises, when they promise them. the x1d firmware is still in the advanced beta stage. -----> improving !!! ? definitely. finished? definitely not. everything is faster on the s. and it have 4 times the battery life. in the real world there's something about those s lenses. the difference in iq is small. 37.5 to 51 isn't that big in real world usage. non-existent if you like the 2:3 ratio. unlike most, i actually own both cameras....... gordon edited november 6, 2017 by flashgordonphotography", "sortedWord": "None", "Identifyer": null, "identifyer": 90961, "year": "2017"}], "name": "Leicasortedout2017improve"}