{"interestingcomments": [{"autor": "Mr.Prime", "date": "2020-02-29 14:18:00", "content": " I realized, after using an M3 since Christmas (my foray into the Leica world) that I would also like a digital version. Yesterday I lost an M-D on ebay, it went for US$4,100 and I had bid $4,000. Looking around there just aren’t any available for good prices. I was thinking about the possibility of getting an M 240 / 262 and converting it to an M-D myself by removing the screen and buttons and replacing the leather covering. Given falling prices on the M10 and stupid prices on the M10D that might be a better starting point but there likely isn’t much of a difference in the work required. No doubt there’s a bit more work involved than I’ve alluded to but I’m a fairly handy kind of guy (I design and build my own hi-fi electronics and speakers for example) and thought perhaps somebody else in a similar predicament to myself may have done something similar ??? Edited February 29, 2020 by Mr.Prime typo", "link": "https://www.l-camera-forum.com/topic/306944-diy-convert-m-or-m10-to-m-d-or-m10d/?tab=comments#comment-3921955", "origin": "L-forum", "suborigin": "306944-diy-convert-m-or-m10-to-m-d-or-m10d", "result": true, "Selector": "i design", "selectorShort": "design", "MarkedSent": " i realized, after using an m3 since christmas (my foray into the leica world) that i would also like a digital version. yesterday i lost an m-d on ebay, it went for us$4,100 and i had bid $4,000. looking around there just aren’t any available for good prices. i was thinking about the possibility of getting an m 240 / 262 and converting it to an m-d myself by removing the screen and buttons and replacing the leather covering. given falling prices on the m10 and stupid prices on the m10d that might be a better starting point but there likely isn’t much of a difference in the work required. no doubt there’s a bit more work involved than -----> i !!! ’ve alluded to but -----> i !!! ’m a fairly handy kind of guy (-----> i !!!  -----> design !!!  and build my own hi-fi electronics and speakers for example) and thought perhaps somebody else in a similar predicament to myself may have done something similar ??? edited february 29, 2020 by mr.prime typo", "sortedWord": "None", "Identifyer": null, "identifyer": 17937, "year": "2020"}, {"autor": "dllewellyn", "date": "2020-09-15 15:54:00", "content": "R: Brian \"CCD's are much more sensitive to IR than a CMOS sensor, roughly 10x. \" Nope. 100% wrong there. Both made of silicon. CCD's a cheaper to make than CMOS but use more power than CCD and have slower readouts. Early CMOS sensors used a lot of the sensor space for the circuits so pixel size was smaller which means noise was greater (smaller photon wells = less dynamic range). CMOS sensors cost more to design but are less expensive in the long run. For a long time now, when you look at the chip under a microscope, you can see the pixels are edge-to-edge. And with Back Side Illuminated (BSI) sensors, now even more so. When you buy glass from Schott (and I do), you can specify, within reason, whatever thickness you want. If Leica/Kodak/Truesense/On Semi wanted to by 0.5mm glass, it isn't a problem. And they could have easily added coatings to change the UV and IR response. It's not that big of a deal. Plenty of companies that offer coating services and you can model some pretty complex response curves. And if they had added the coatings, they wouldn't have had the 'corrosion'. Maybe the datasheet specified coatings, but, at least for a lot of cameras, the coatings aren't there. We were the first company that figured out how to re-purpose a consumer camera for vegetation remote sensing by making a filter that passed plant absorption (blue or red light) to one color channel and a plant reflection channel (NIR) to another color channel. Plants reflect the NIR because the longer, lower energy wavelengths don't have enough energy to support photosynthesis. So if you look at how a plant is absorbing and reflecting light, you can determine things like biomass, plant health, etc. We also knew how to measure the camera spectral response so we knew how the RGB channels opened and close in the visible and NIR. It turns out that the red channel is open in the red and stay open throughout the NIR while the blue and green channels don't open up until around 800nm. So we designed a filter that passed visible blue and green light, blocked red light, passed NIR from 680nm to 800nm and then blocked light above 800nm - and that was one filter on one piece of glass. That way, only the red channel saw NIR. Once you had a picture with that information, you could run the picture through a computer program to calculate things like NDVI (Normalized Difference Vegetation Index).", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/5/?tab=comments#comment-4046433", "origin": "L-forum", "suborigin": "313260-sensor-corrosion-analysis-and-fix-merged", "result": true, "Selector": "we designed", "selectorShort": "design", "MarkedSent": "r: brian \"ccd's are much more sensitive to ir than a cmos sensor, roughly 10x. \" nope. 100% wrong there. both made of silicon. ccd's a cheaper to make than cmos but use more power than ccd and have slower readouts. early cmos sensors used a lot of the sensor space for the circuits so pixel size was smaller which means noise was greater (smaller photon wells = less dynamic range). cmos sensors cost more to design but are less expensive in the long run. for a long time now, when you look at the chip under a microscope, you can see the pixels are edge-to-edge. and with back side illuminated (bsi) sensors, now even more so. when you buy glass from schott (and i do), you can specify, within reason, whatever thickness you want. if leica/kodak/truesense/on semi wanted to by 0.5mm glass, it isn't a problem. and they could have easily added coatings to change the uv and ir response. it's not that big of a deal. plenty of companies that offer coating services and you can model some pretty complex response curves. and if they had added the coatings, they wouldn't have had the 'corrosion'. maybe the datasheet specified coatings, but, at least for a lot of cameras, the coatings aren't there. we were the first company that figured out how to re-purpose a consumer camera for vegetation remote sensing by making a filter that passed plant absorption (blue or red light) to one color channel and a plant reflection channel (nir) to another color channel. plants reflect the nir because the longer, lower energy wavelengths don't have enough energy to support photosynthesis. so if you look at how a plant is absorbing and reflecting light, you can determine things like biomass, plant health, etc. we also knew how to measure the camera spectral response so we knew how the rgb channels opened and close in the visible and nir. it turns out that the red channel is open in the red and stay open throughout the nir while the blue and green channels don't open up until around 800nm. so -----> we !!!  -----> designed !!!  a filter that passed visible blue and green light, blocked red light, passed nir from 680nm to 800nm and then blocked light above 800nm - and that was one filter on one piece of glass. that way, only the red channel saw nir. once you had a picture with that information, you could run the picture through a computer program to calculate things like ndvi (normalized difference vegetation index).", "sortedWord": "None", "Identifyer": null, "identifyer": 30229, "year": "2020"}, {"autor": "BrianS", "date": "2020-09-16 00:00:00", "content": " 49 minutes ago, jaapv said: Which would not be a problem - The user would need to use IR cut filters in front of the lens, which is no hardship. The only drawback would be the need to use flat field correction for certain WA lenses. We've used Hot Mirror filters for years, with our M8 and with some lenses on the M9. I have about 12 of them. The M8 drew much criticism over the need for external filters and the IR problem. Leica/ONSEMI avoided this completely by using BG55 glass, which is much more stable environmentally than S8612. The protective coating of the S8612 as used in the M9 did not stand up to the job of preventing corrosion. Dan claims that the Data Sheets published for years, revised a few times- are all wrong- that the M9 sensor's cover glass has no protective coating at all. If that had been the case, as per the S8612 Data Sheet- the corrosion problem would have been much worse than it was. Schott states that unprotected S8612 glass will corrode after a few months. My M9 went 7 years. Dan's article on MaxMax labeling Kodak and Leica as \"Stupid, Stupid, Stupid\" does not identify the glass, which is specified in the Datasheet. The Data Sheet also states that the cover glass is provided by Schott, and the performance of the cover glass in the Data Sheet is from Schott. I believe the Data Sheets from Schott and Kodak/TrueSense/ONSEMI. I work with groups that make custom glass, and make custom sensors. To state that silicon sensors are all the same was just way too much. A couple of years ago one of my coworkers needed to make a low-cost VNIR sensor, I went through the data sheets for a number of CMOS and CCD COTS sensors. The IR had been bred out of the CMOS sensors of the time, Hamamatsu CCD's had 10dB higher sensitivity in the IR. All were Silicon sensors. Same with ONSEMI CCD's without IR absorbing glass, better IR- but the emphasis had been placed on Visible. The spectral response of my DCS200ir is about the same in IR as Visible. Kodak started using Indium Tin Oxide to extend blue response. Once again- follow a technology for 40 years, you pick up some things. I hack lenses, known for converting Sonnars to Leica mount and adjusting Jupiters. That's lens hacking for relaxation.From working in an Optical Research Lab for over 40 years. I'm a Lens Hacker, but had two optical engineers work for me to design the real stuff. Kodak came to us for IR technology back in the 80s. Seemed fair that I give them a call in 2009 and ask for a Monochrome M9. I actually asked for a full-spectrum M9, told them I'd buy 6 of them. It would have been under $50K for all of them. Way cheaper than Sensors Unlimited stuff. The Kodak Engineer told me that had a meeting with Leica coming up, and they would discuss it. Kodak had wanted to do a Monochrome M8 to pick up where the DCS760m had failed- due to a banding problem. Preaching to the choir. Once I got the M Monochrom, I had to get the shim for an F1.5 J-3 and Sonnar within 0.01mm. I have about 20 5cm F1.5 Sonnars and J-3's in my collection. Past 100 lenses in Leica mount now. For the M Monochrom: the shims are optimized for different color filters. Deep color filters shift the focus towards infinity, enough to have to adjust the shim. 0.1mm is far off for a lens. I no longer do lens work- Skyllaney in the UK offers the service professionally. Gone are the days that I'd convert a Sonnar to Leica mount for $25 and left-over parts. Some of those Sonnars that I converted sell for a lot these days. All a clever plan to shoot with and take apart hundreds of lenses. Edited September 16, 2020 by BrianS", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/6/?tab=comments#comment-4046688", "origin": "L-forum", "suborigin": "313260-sensor-corrosion-analysis-and-fix-merged", "result": true, "Selector": "me to design", "selectorShort": "design", "MarkedSent": " 49 minutes ago, jaapv said: which would not be a problem - the user would need to use ir cut filters in front of the lens, which is no hardship. the only drawback would be the need to use flat field correction for certain wa lenses. we've used hot mirror filters for years, with our m8 and with some lenses on the m9. i have about 12 of them. the m8 drew much criticism over the need for external filters and the ir problem. leica/onsemi avoided this completely by using bg55 glass, which is much more stable environmentally than s8612. the protective coating of the s8612 as used in the m9 did not stand up to the job of preventing corrosion. dan claims that the data sheets published for years, revised a few times- are all wrong- that the m9 sensor's cover glass has no protective coating at all. if that had been the case, as per the s8612 data sheet- the corrosion problem would have been much worse than it was. schott states that unprotected s8612 glass will corrode after a few months. my m9 went 7 years. dan's article on maxmax labeling kodak and leica as \"stupid, stupid, stupid\" does not identify the glass, which is specified in the datasheet. the data sheet also states that the cover glass is provided by schott, and the performance of the cover glass in the data sheet is from schott. i believe the data sheets from schott and kodak/truesense/onsemi. i work with groups that make custom glass, and make custom sensors. to state that silicon sensors are all the same was just way too much. a couple of years ago one of my coworkers needed to make a low-cost vnir sensor, i went through the data sheets for a number of cmos and ccd cots sensors. the ir had been bred out of the cmos sensors of the time, hamamatsu ccd's had 10db higher sensitivity in the ir. all were silicon sensors. same with onsemi ccd's without ir absorbing glass, better ir- but the emphasis had been placed on visible. the spectral response of my dcs200ir is about the same in ir as visible. kodak started using indium tin oxide to extend blue response. once again- follow a technology for 40 years, you pick up some things. i hack lenses, known for converting sonnars to leica mount and adjusting jupiters. that's lens hacking for relaxation.from working in an optical research lab for over 40 years. i'm a lens hacker, but had two optical engineers work for -----> me !!!  -----> to !!!  -----> design !!!  the real stuff. kodak came to us for ir technology back in the 80s. seemed fair that i give them a call in 2009 and ask for a monochrome m9. i actually asked for a full-spectrum m9, told them i'd buy 6 of them. it would have been under $50k for all of them. way cheaper than sensors unlimited stuff. the kodak engineer told me that had a meeting with leica coming up, and they would discuss it. kodak had wanted to do a monochrome m8 to pick up where the dcs760m had failed- due to a banding problem. preaching to the choir. once i got the m monochrom, i had to get the shim for an f1.5 j-3 and sonnar within 0.01mm. i have about 20 5cm f1.5 sonnars and j-3's in my collection. past 100 lenses in leica mount now. for the m monochrom: the shims are optimized for different color filters. deep color filters shift the focus towards infinity, enough to have to adjust the shim. 0.1mm is far off for a lens. i no longer do lens work- skyllaney in the uk offers the service professionally. gone are the days that i'd convert a sonnar to leica mount for $25 and left-over parts. some of those sonnars that i converted sell for a lot these days. all a clever plan to shoot with and take apart hundreds of lenses. edited september 16, 2020 by brians", "sortedWord": "None", "Identifyer": null, "identifyer": 30247, "year": "2020"}, {"autor": "FlashGordonPhotography", "date": "2020-07-27 21:31:00", "content": "I'm 100% behind Nicci. Bigger battery. IBIS, high resolution sensor, weather sealing. I'm not a buyer without a better battery and IBIS. For me, the EVF is fine. I'd rather have the battery life. If we're designing, then: Dump the controller and add a joystick (from the SL) built in thumb rest (from the M10D) Move the buttons to the right of the screen and solve multiple issues. USBC charging 8 minute maximum exposure time. Get the Fotos app working 100% reliably (so we don't need a flippy screen) with full camera control and menus. Make the grip with an arca swiss dovetail and battery access. Make the menus fully touch capable. 1 more custom button on the front of the body. Gordon", "link": "https://www.l-camera-forum.com/topic/311632-hoping-that-cl2-mini-sl2/page/2/?tab=comments#comment-4016880", "origin": "L-forum", "suborigin": "311632-hoping-that-cl2-mini-sl2", "result": true, "Selector": "we're designing", "selectorShort": "design", "MarkedSent": "i'm 100% behind nicci. bigger battery. ibis, high resolution sensor, weather sealing. i'm not a buyer without a better battery and ibis. for me, the evf is fine. i'd rather have the battery life. if -----> we !!! -----> 're !!!  -----> designing !!! , then: dump the controller and add a joystick (from the sl) built in thumb rest (from the m10d) move the buttons to the right of the screen and solve multiple issues. usbc charging 8 minute maximum exposure time. get the fotos app working 100% reliably (so we don't need a flippy screen) with full camera control and menus. make the grip with an arca swiss dovetail and battery access. make the menus fully touch capable. 1 more custom button on the front of the body. gordon", "sortedWord": "None", "Identifyer": null, "identifyer": 42692, "year": "2020"}, {"autor": "HuntingSand", "date": "2020-09-24 17:54:00", "content": "For no good reason - except that I like well designed objects - I am a big fan of the T series. Had the original, and now have the TL2. Note that image characteristics are ever so slightly different between the two, the original was, for lack of a better word, crisper, but lacked higher ISO capabilities. There isn't much in it re pixel count (16 vs. 24), so you could also, like Jaap and some others I know of, pick up a well-preserved T or TL, screw any kind of lens on it you want, and see how the two of you get along. If it doesn't work out, you could sell it again for no loss at all (usually). AF speed and responsiveness (among other things) is improved on the TL2, there's even face detect, which I don't remember my original T had. One feature I personally appreciate on the TL2 is the GPS functionality of the Visoflex. I travel a lot, and those coordinates are useful to have. Other than that, I like the various skins you can throw on (or clip on) the T/TL/TL2, the 16/32GB internal storage, and when you decide you want to move on from the 18mm to some higher end glass such as the artsy 35mm f1.4, the incredibly versatile 11-23mm or the very sharp 55-135mm, those options are all available. It gets to be a bit of an investment by that point, though (unless you go the Sigma route). All that being said, if you really only are looking for a versatile, high quality, pocketable travel camera, as others have stated, there are excellent alternatives on the market. The T series has come to an end.", "link": "https://www.l-camera-forum.com/topic/313612-tempted-by-the-tl2-should-i-be/?tab=comments#comment-4051536", "origin": "L-forum", "suborigin": "313612-tempted-by-the-tl2-should-i-be", "result": true, "Selector": "i like well designed", "selectorShort": "design", "MarkedSent": "for no good reason - except that -----> i !!!  -----> like !!!  -----> well !!!  -----> designed !!!  objects - -----> i !!!  am a big fan of the t series. had the original, and now have the tl2. note that image characteristics are ever so slightly different between the two, the original was, for lack of a better word, crisper, but lacked higher iso capabilities. there isn't much in it re pixel count (16 vs. 24), so you could also, like jaap and some others i know of, pick up a well-preserved t or tl, screw any kind of lens on it you want, and see how the two of you get along. if it doesn't work out, you could sell it again for no loss at all (usually). af speed and responsiveness (among other things) is improved on the tl2, there's even face detect, which i don't remember my original t had. one feature i personally appreciate on the tl2 is the gps functionality of the visoflex. i travel a lot, and those coordinates are useful to have. other than that, i like the various skins you can throw on (or clip on) the t/tl/tl2, the 16/32gb internal storage, and when you decide you want to move on from the 18mm to some higher end glass such as the artsy 35mm f1.4, the incredibly versatile 11-23mm or the very sharp 55-135mm, those options are all available. it gets to be a bit of an investment by that point, though (unless you go the sigma route). all that being said, if you really only are looking for a versatile, high quality, pocketable travel camera, as others have stated, there are excellent alternatives on the market. the t series has come to an end.", "sortedWord": "None", "Identifyer": null, "identifyer": 44249, "year": "2020"}, {"autor": "ramarren", "date": "2020-09-04 13:54:00", "content": "48 minutes ago, nicci78 said: But where is the smaller lenses ?? That’s all the problem. I would love to buy the smaller lenses for my CL. But there are only 11 APS-C lenses in L-mount alliance. Everything else is full frame ! In theory, APS-C should yield to smaller lenses. But hypothetical lens is useless to me. Leica is not invested anymore into the TL lenses business. What’s left for CL ? Being a 1.5x teleconverter only ? Handy for long focal length for sure. But a nightmare in ultra wide angle with lack of proper lens. Even as teleconverter, the days of APS-C is counted. Being stuck to 24 or 26MP, make them redundant against full frame 47MP (crop mode at 20MP) and 60MP (crop mode at 26MP) Please bring more APS-C lenses or kill the system and provide us small full frame bodies and lenses instead. I guess that most manufacturers already made their mind about that This long whinge for more lenses begs some questions: How many lenses does a photographer really need? And how many different lenses are going to be profitable to manufacture? Designing and tooling up to manufacture a lens is a hugely expensive undertaking ... it takes the sales of thousands of lenses to pay for it if you want to keep the price per lens at a reasonable level. How much are you willing to pay for each small, fast lens ... as much as you would for a Leica M lens, or more (there are more things needed for a full TL series lens)?And how many other people do you suppose might also want to spend that amount of money per lens? This is, after all, a business that depends upon its profitability for survival. G", "link": "https://www.l-camera-forum.com/topic/312975-the-end-of-aps-c-and-m43-cameras/page/2/?tab=comments#comment-4039805", "origin": "L-forum", "suborigin": "312975-the-end-of-aps-c-and-m43-cameras", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "48 minutes ago, nicci78 said: but where is the smaller lenses ?? that’s all the problem. i would love to buy the smaller lenses for my cl. but there are only 11 aps-c lenses in l-mount alliance. everything else is full frame ! in theory, aps-c should yield to smaller lenses. but hypothetical lens is useless to me. leica is not invested anymore into the tl lenses business. what’s left for cl ? being a 1.5x teleconverter only ? handy for long focal length for sure. but a nightmare in ultra wide angle with lack of proper lens. even as teleconverter, the days of aps-c is counted. being stuck to 24 or 26mp, make them redundant against full frame 47mp (crop mode at 20mp) and 60mp (crop mode at 26mp) please bring more aps-c lenses or kill the system and provide us small full frame bodies and lenses instead. i guess that most manufacturers already made their mind about that this long whinge for more lenses begs some questions: how many lenses does a photographer really need? and how many different lenses are going to be profitable to manufacture? -----> designing !!!  and tooling up to manufacture a lens is a hugely expensive undertaking ... it takes the sales of thousands of lenses to pay for it if you want to keep the price per lens at a reasonable level. how much are you willing to pay for each small, fast lens ... as much as you would for a leica m lens, or more (there are more things needed for a full tl series lens)?and how many other people do you suppose might also want to spend that amount of money per lens? this is, after all, a business that depends upon its profitability for survival. g", "sortedWord": "None", "Identifyer": null, "identifyer": 44575, "year": "2020"}, {"autor": "wlaidlaw", "date": "2020-05-01 22:46:00", "content": "I have recently been on exactly the same search. I also have been in communication with Martin Grahl of Novoflex. As I understand it there are 5 models of R Bellows as follows: Novoflex R3 manual diaphragm model ) For cameras R3 to R7 and 1, 2 or 3 cam lenses Novoflex R3 Automatic diaphragm model ) For cameras R3 to R7 and 2 or 3 cam lenses. R cam lenses are a question mark and may mount but not have auto-diaphragm Leica 16860 query made by Novoflex ) For cameras R3 to R7 and 2 or 3 cam lenses. R cam lenses are a question mark and may mount but not have auto-diaphragm Any of the above must not be used with ROM cameras or ROM lenses Novoflex BR-2 ) For R8 and 9 cameras but may work with earlier cameras, possibly other than auto diaphragm. Designed for 3 Cam, R Cam and ROM lenses Leica 16880 ) Identical to the above and definitely made by Novoflex All of the bellows will also work with the non-focus helicoid Novoflex R mount bellows lenses, the 40, 60 and 100mm Noflexar lenses. I have just bought a 16880/BR-2 from Italy. It has a chrome or stainless front mount rather than the black front mount of earlier bellows. Wilson --img-- ", "link": "https://www.l-camera-forum.com/topic/309047-searching-for-a-leica-r-bellows-16880-or-equivalent/?tab=comments#comment-3965053", "origin": "L-forum", "suborigin": "309047-searching-for-a-leica-r-bellows-16880-or-equivalent", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "i have recently been on exactly the same search. i also have been in communication with martin grahl of novoflex. as i understand it there are 5 models of r bellows as follows: novoflex r3 manual diaphragm model ) for cameras r3 to r7 and 1, 2 or 3 cam lenses novoflex r3 automatic diaphragm model ) for cameras r3 to r7 and 2 or 3 cam lenses. r cam lenses are a question mark and may mount but not have auto-diaphragm leica 16860 query made by novoflex ) for cameras r3 to r7 and 2 or 3 cam lenses. r cam lenses are a question mark and may mount but not have auto-diaphragm any of the above must not be used with rom cameras or rom lenses novoflex br-2 ) for r8 and 9 cameras but may work with earlier cameras, possibly other than auto diaphragm. -----> designed !!!  for 3 cam, r cam and rom lenses leica 16880 ) identical to the above and definitely made by novoflex all of the bellows will also work with the non-focus helicoid novoflex r mount bellows lenses, the 40, 60 and 100mm noflexar lenses. i have just bought a 16880/br-2 from italy. it has a chrome or stainless front mount rather than the black front mount of earlier bellows. wilson --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 21536, "year": "2020"}, {"autor": "dkCambridgeshire", "date": "2020-07-24 08:20:00", "content": "The London Inn, St. John's Street, Stamford Lincs. UK . Designed (in the style of 17th C.) by Stamford architect Henry F Traylen; built 1939/40 --img--  Leica X Vario dunk", "link": "https://www.l-camera-forum.com/topic/290932-stamford-lincs-uk-architecture/page/2/?tab=comments#comment-4014528", "origin": "L-forum", "suborigin": "290932-stamford-lincs-uk-architecture", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "the london inn, st. john's street, stamford lincs. uk . -----> designed !!!  (in the style of 17th c.) by stamford architect henry f traylen; built 1939/40 --img--  leica x vario dunk", "sortedWord": "None", "Identifyer": null, "identifyer": 55195, "year": "2020"}, {"autor": "John Z. Goriup", "date": "2020-12-29 23:56:00", "content": " Another one of those unlikely moments, when you see something you thought imposible - in this case, seeing all three of the Alfa-Romeo 'Disco Volante' styling exercises in one place. Designed by Bertone, with famed stylist Franco Scaglione leading the effort, the old design studio / coachbuilder had received a commission from Alfa-Romeo to study and to design a series of cars based on researching the effects, and the reduction of aerodynamic drag. Three models were constructed in three consecutive years ( '53, '54 & '55 ), all based on the Alfa 1900 chassis and powertrain, ending up with the B.A.T. 5 which achieved a Cda of approx. 0.19. and actually clocked some runs in excess of 200 kilometers per hour These were one-offs, always introduced at the Turin Auto show and subsequently spent decades as curiosities in various corners of the world, under widely varying circumstances, until one determined collector undertook the effort locate, buy & consolidate all three under one roof in his collection. He had them restored and has since displayed them as a unit of three to emphasize the original intent, validate the concept and illustrate the advances in automotive aerodynamics via this project. These are quite historic cars which never were intended for mass-production, but nevertheless excerted considerable influence throughout the industry. M9-P / 35mm Summicron Asph. JZG --img-- ", "link": "https://www.l-camera-forum.com/topic/316530-they-really-do-look-like-ufos/?tab=comments#comment-4108410", "origin": "L-forum", "suborigin": "316530-they-really-do-look-like-ufos", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": " another one of those unlikely moments, when you see something you thought imposible - in this case, seeing all three of the alfa-romeo 'disco volante' styling exercises in one place. -----> designed !!!  by bertone, with famed stylist franco scaglione leading the effort, the old design studio / coachbuilder had received a commission from alfa-romeo to study and to design a series of cars based on researching the effects, and the reduction of aerodynamic drag. three models were constructed in three consecutive years ( '53, '54 & '55 ), all based on the alfa 1900 chassis and powertrain, ending up with the b.a.t. 5 which achieved a cda of approx. 0.19. and actually clocked some runs in excess of 200 kilometers per hour these were one-offs, always introduced at the turin auto show and subsequently spent decades as curiosities in various corners of the world, under widely varying circumstances, until one determined collector undertook the effort locate, buy & consolidate all three under one roof in his collection. he had them restored and has since displayed them as a unit of three to emphasize the original intent, validate the concept and illustrate the advances in automotive aerodynamics via this project. these are quite historic cars which never were intended for mass-production, but nevertheless excerted considerable influence throughout the industry. m9-p / 35mm summicron asph. jzg --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 58653, "year": "2020"}, {"autor": "adan", "date": "2020-03-06 18:16:00", "content": "For me, wet-printing was always just \"a necessary evil.\" For the first 25 years of my career there was no other option, so I learned how to do it proficiently. I had the advantage of access to institutional, professional darkrooms with the elbow-room for high-end enlargers, drum dryers, drying racks, rotary washing tanks and so on. And relative \"clean-room\" conditions - although I still went through several quarts/litres of stuff like this over the years, spotting every individual wet-print (the #000 brushes also needed replacing every couple of months or so): https://www.freestylephoto.biz/category/58-Photo-Artistry/Spotting Once I moved into graphic design and editing, and did not want to invade the busy space of the newspaper photographers, I had to start building my own darkrooms in apartment bathrooms. Worked fine for the \"wet\" stage (once I designed a quick-assembly/quick-breakdown wooden table for the trays, that fit onto a standard bathtub's corners, and another table that would fit over a standard sink/toilet to make another flat workspace for the enlarger). But no space for controlled drying - had to give up using fiber paper. Never could print larger than 11 x 14. But even then, wet-printing was a PITA. Mostly, I gave up B&W altogether and shot color slides. All of which made it extremely desirable to go hybrid and get a Nikon Coolscan LS-10 the instant it was introduced for $2999.99 (most previous pro scanners sold for $40,000-$500,000**, installed (1980s $$)). The \"accessible\" printers and paper for digital prints were pretty much cr*p for the next decade - but I trusted in the future, and now we have fiber-gloss papers, archival inks that match or exceed the lifetime of wet materials, and table-top printers that can produce 16x20s in 1/15th the space of wet trays/racks. Nothing so much resembles the look and feel of a dye-transfer color print of yore as a 14\" x 21\" inkjet on fiber-gloss paper. Which takes 10 minutes to print, dry to dry. ___________ **I managed the installation of a new, very-small-newspaper darkroom, and digital -color-scanning system in 1992. The \"cheap but pro\" scanner for the time was the LeafScan 35 - $40,000 (and 8 minutes per three-pass color scan). http://www.promarketinc.com/catalog/scanners/leafscan35.html https://ingeniumcanada.org/ingenium/collection-research/collection-item.php?id=2005.0060.001", "link": "https://www.l-camera-forum.com/topic/307115-film-photography-has-found-its-feet-again/?tab=comments#comment-3926116", "origin": "L-forum", "suborigin": "307115-film-photography-has-found-its-feet-again", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "for me, wet-printing was always just \"a necessary evil.\" for the first 25 years of my career there was no other option, so i learned how to do it proficiently. i had the advantage of access to institutional, professional darkrooms with the elbow-room for high-end enlargers, drum dryers, drying racks, rotary washing tanks and so on. and relative \"clean-room\" conditions - although i still went through several quarts/litres of stuff like this over the years, spotting every individual wet-print (the #000 brushes also needed replacing every couple of months or so): https://www.freestylephoto.biz/category/58-photo-artistry/spotting once i moved into graphic design and editing, and did not want to invade the busy space of the newspaper photographers, i had to start building my own darkrooms in apartment bathrooms. worked fine for the \"wet\" stage (once -----> i !!!  -----> designed !!!  a quick-assembly/quick-breakdown wooden table for the trays, that fit onto a standard bathtub's corners, and another table that would fit over a standard sink/toilet to make another flat workspace for the enlarger). but no space for controlled drying - had to give up using fiber paper. never could print larger than 11 x 14. but even then, wet-printing was a pita. mostly, i gave up b&w altogether and shot color slides. all of which made it extremely desirable to go hybrid and get a nikon coolscan ls-10 the instant it was introduced for $2999.99 (most previous pro scanners sold for $40,000-$500,000**, installed (1980s $$)). the \"accessible\" printers and paper for digital prints were pretty much cr*p for the next decade - but i trusted in the future, and now we have fiber-gloss papers, archival inks that match or exceed the lifetime of wet materials, and table-top printers that can produce 16x20s in 1/15th the space of wet trays/racks. nothing so much resembles the look and feel of a dye-transfer color print of yore as a 14\" x 21\" inkjet on fiber-gloss paper. which takes 10 minutes to print, dry to dry. ___________ **i managed the installation of a new, very-small-newspaper darkroom, and digital -color-scanning system in 1992. the \"cheap but pro\" scanner for the time was the leafscan 35 - $40,000 (and 8 minutes per three-pass color scan). http://www.promarketinc.com/catalog/scanners/leafscan35.html https://ingeniumcanada.org/ingenium/collection-research/collection-item.php?id=2005.0060.001", "sortedWord": "None", "Identifyer": null, "identifyer": 101677, "year": "2020"}, {"autor": "philipus", "date": "2020-05-01 20:30:00", "content": "Very nice construction Joachim. And that is a funny, very to the point German word, made me smile. In the meantime I have updated my design somewhat, described here: https://philipus.com/project-film-dryer-ver-20 On 4/26/2020 at 11:08 PM, mdachs said: To proceed the discussion from August, my problem ist not the drying but very often dust, especially bw film. German DIY warehouses offer fans ( the wonderful german composite is \"Rohreinschublüfter\") being able to convey 180m³ per hour. Vacuuming is this fan capable to surpass a at least to small HEPA-filter. A solution for my drying question. Regards Joachim --img-- ", "link": "https://www.l-camera-forum.com/topic/298113-diy-film-dryer/page/2/?tab=comments#comment-3964988", "origin": "L-forum", "suborigin": "298113-diy-film-dryer", "result": false, "Selector": "my design", "selectorShort": "design", "MarkedSent": "in the meantime i have updated my design somewhat, described here: https://philipus.com/project-film-dryer-ver-20 on 4/26/2020 at 11:08 pm, mdachs said: to proceed the discussion from august, my problem ist not the drying but very often dust, especially bw -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 101219, "year": "2020"}], "name": "Leicasortedout2020design"}