{"interestingcomments": [{"autor": "cbretteville", "date": "2013-03-20 14:32:00", "content": "Did you do it yourself? I'm considering this 'upgrade' for my M6. No problem doing it your self. Remove one retaining ring and replace the original with a straight one. I did this on my M6 with a wind on lever purchased from DAG. I've since put the original back. You should use a flexiclamp to losen and fasten the retaining ring, it is easy to get marks on it if you use a pair of pliers. Carl", "link": "https://www.l-camera-forum.com/topic/141350-i-love-my-m4/page/6/?tab=comments#comment-2277266", "origin": "L-forum", "suborigin": "141350-i-love-my-m4", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "did you -----> do !!!  -----> it !!!  -----> yourself !!! ? i'm considering this 'upgrade' for my m6. no problem doing it your self. remove one retaining ring and replace the original with a straight one. i did this on my m6 with a wind on lever purchased from dag. i've since put the original back. you should use a flexiclamp to losen and fasten the retaining ring, it is easy to get marks on it if you use a pair of pliers. carl", "sortedWord": "None", "Identifyer": null, "identifyer": 23, "year": "2013"}, {"autor": "Falstaff", "date": "2013-03-20 17:39:00", "content": "Did you do it yourself? I'm considering this 'upgrade' for my M6. No I didn't but it was done by an ex-Leica tech while I watched. No problem doing it your self. Remove one retaining ring and replace the original with a straight one. I did this on my M6 with a wind on lever purchased from DAG. I've since put the original back. You should use a flexiclamp to losen and fasten the retaining ring, it is easy to get marks on it if you use a pair of pliers. Carl As Carl says, do not use pliers. The man who did it used a rubbery material to get a good grip to the top retaining ring and just unscrewed it, changed the lever and screwed the top back on. Falstaff", "link": "https://www.l-camera-forum.com/topic/141350-i-love-my-m4/page/6/?tab=comments#comment-2277413", "origin": "L-forum", "suborigin": "141350-i-love-my-m4", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "did you -----> do !!!  -----> it !!!  -----> yourself !!! ? i'm considering this 'upgrade' for my m6. no i didn't but it was done by an ex-leica tech while i watched. no problem doing it your self. remove one retaining ring and replace the original with a straight one. i did this on my m6 with a wind on lever purchased from dag. i've since put the original back. you should use a flexiclamp to losen and fasten the retaining ring, it is easy to get marks on it if you use a pair of pliers. carl as carl says, do not use pliers. the man who did it used a rubbery material to get a good grip to the top retaining ring and just unscrewed it, changed the lever and screwed the top back on. falstaff", "sortedWord": "None", "Identifyer": null, "identifyer": 25, "year": "2013"}, {"autor": "Michael Hiles", "date": "2013-05-15 20:11:00", "content": "Thanks, so any C41 machine you might find in drugstores should be able to handle high speed films too (800 & 1600)? Yes. The process is standard (i.e. not film specific). Hugh 38 makes a good point. My local Walmart has a dedicated Photo area managed by someone who cares about doing a good job. So he maintains the machine, and is careful. He gets enough volume that he can still do C41, although most of his business is helping people manipulate their SD cards in the \"do it yourself\" print machines.", "link": "https://www.l-camera-forum.com/topic/204698-where-to-go-for-developing/?tab=comments#comment-2322347", "origin": "L-forum", "suborigin": "204698-where-to-go-for-developing", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "thanks, so any c41 machine you might find in drugstores should be able to handle high speed films too (800 & 1600)? yes. the process is standard (i.e. not film specific). hugh 38 makes a good point. my local walmart has a dedicated photo area managed by someone who cares about doing a good job. so he maintains the machine, and is careful. he gets enough volume that he can still -----> do !!!  c41, although most of his business is helping people manipulate their sd cards in the \"-----> do !!!  -----> it !!!  -----> yourself !!! \" print machines.", "sortedWord": "None", "Identifyer": null, "identifyer": 107436, "year": "2013"}, {"autor": "stephen.w", "date": "2013-03-20 10:15:00", "content": "Sorry, I was not clear. It is the wind-on crank for advancing the film that I had changed.Falstaff Did you do it yourself? I'm considering this 'upgrade' for my M6.", "link": "https://www.l-camera-forum.com/topic/141350-i-love-my-m4/page/6/?tab=comments#comment-2277093", "origin": "L-forum", "suborigin": "141350-i-love-my-m4", "result": false, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "it is the wind-on crank for advancing the -----> film !!!  that i had changed.falstaff did you do it yourself?", "sortedWord": "film", "Identifyer": null, "identifyer": 22, "year": "2013"}], "name": "Leicasortedout2013yourself"}