{"interestingcomments": [{"autor": "Peter L", "date": "2013-08-21 14:03:00", "content": " And where is the \"hurrah a XV\" crowd from the other day now? Still here and very happy with the Leica X Vario, so what are you shooting with,or just hanging out on the X vario forum to come up with some negative comment, you must be bored, not having an X Vario", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/?tab=comments#comment-2402363", "origin": "L-forum", "suborigin": "211136-issues-with-new-x-vario", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " and where is the \"hurrah a xv\" crowd from the other day now? still here and very happy -----> with !!!  the leica x vario, so what are you shooting -----> with !!! ,or just hanging out on the x vario forum to -----> come !!!  -----> up !!!  -----> with !!!  some negative comment, you must be bored, not having an x vario", "sortedWord": "None", "Identifyer": null, "identifyer": 13280, "year": "2013"}, {"autor": "ahkai", "date": "2013-08-23 22:00:00", "content": "Still here and very happy with the Leica X Vario, so what are you shooting with,or just hanging out on the X vario forum to come up with some negative comment, you must be bored, not having an X Vario hahahaha... nice one :-)", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/page/3/?tab=comments#comment-2404017", "origin": "L-forum", "suborigin": "211136-issues-with-new-x-vario", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "still here and very happy -----> with !!!  the leica x vario, so what are you shooting -----> with !!! ,or just hanging out on the x vario forum to -----> come !!!  -----> up !!!  -----> with !!!  some negative comment, you must be bored, not having an x vario hahahaha... nice one :-)", "sortedWord": "None", "Identifyer": null, "identifyer": 13315, "year": "2013"}, {"autor": "PeterHK", "date": "2013-07-04 07:51:00", "content": "Experienced first hand today why Schmidt Marketing in HK has such a horrible reputation. Instead of trying to give some after sales service, they instead spent all their energy on coming up with bureaucratic reasoning why they can not. Am surprised they did not argue that my middle name was spelled wrong on the guarantee certificate.", "link": "https://www.l-camera-forum.com/topic/205161-hong-kong-leica-distributor-schmidt-marketing-underwhelming-customer-experience/?tab=comments#comment-2365776", "origin": "L-forum", "suborigin": "205161-hong-kong-leica-distributor-schmidt-marketing-underwhelming-customer-experience", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": "experienced first hand today why schmidt marketing in hk has such a horrible reputation. instead of trying to give some after sales service, they instead spent all their energy on -----> coming !!!  -----> up !!!  -----> with !!!  bureaucratic reasoning why they can not. am surprised they did not argue that my middle name was spelled wrong on the guarantee certificate.", "sortedWord": "None", "Identifyer": null, "identifyer": 87593, "year": "2013"}, {"autor": "Luke_Miller", "date": "2013-03-06 14:54:00", "content": "Great Joe Demb idea for ceiling bounce & diffused fill flash with the SF-24D! But have you made any progress in your cogitations upon how to adapt that unit into a swiveling flash? I wait with great anticipation. Still working on that. I came up with a rig using an articulating arm that shows some promise. The challenge is attaching it to the body. At the moment an Arca-Swiss L plate is the attachment point, but I'm not satisfied that is the best solution. Trying to avoid adding significant bulk & weight, which sorts of defeats the purpose.", "link": "https://www.l-camera-forum.com/topic/199813-sf-24d-bounced-flash-part-two/?tab=comments#comment-2262624", "origin": "L-forum", "suborigin": "199813-sf-24d-bounced-flash-part-two", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "great joe demb idea for ceiling bounce & diffused fill flash with the sf-24d! but have you made any progress in your cogitations upon how to adapt that unit into a swiveling flash? i wait with great anticipation. still working on that. i -----> came !!!  -----> up !!!  -----> with !!!  a rig using an articulating arm that shows some promise. the challenge is attaching it to the body. at the moment an arca-swiss l plate is the attachment point, but i'm not satisfied that is the best solution. trying to avoid adding significant bulk & weight, which sorts of defeats the purpose.", "sortedWord": "None", "Identifyer": null, "identifyer": 89975, "year": "2013"}, {"autor": "jaapv", "date": "2013-07-09 16:29:00", "content": "Sony has plenty of Minolta expertise to design lenses, not to mention their connection with Zeiss. I would expect them to come up with something pretty good in that line.", "link": "https://www.l-camera-forum.com/topic/214267-the-sony-a7-thread-merged/page/2/?tab=comments#comment-2370223", "origin": "L-forum", "suborigin": "214267-the-sony-a7-thread-merged", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "sony has plenty of minolta expertise to design lenses, not to mention their connection with zeiss. i would expect them to -----> come !!!  -----> up !!!  -----> with !!!  something pretty good in that line.", "sortedWord": "None", "Identifyer": null, "identifyer": 92671, "year": "2013"}, {"autor": "Rick", "date": "2013-07-09 16:54:00", "content": " Michael, I think Stephen is right, this is Photoshop. I don't have my RX1 with me here to measure but the mount is huge on the RX1. I think Sony understands this. I understand the Zeiss lens is almost glued to the RX1 sensor, but if Sony could come up with a set of Zeiss lenses that would work on a FF camera as well as my RX1 then Leica would eventually have competition and some would buy Sony. But, how long would it take for Sony to offer lenses like my WATE? And, how big would they be? By the time Sony has these offerings, what will the Leica M technology be like? Heck, 5-10 years from now Leica will probably offer such innovations as a black chrome finish. You'd have to stick with Leica then. Edited July 9, 2013 by RickLeica", "link": "https://www.l-camera-forum.com/topic/214267-the-sony-a7-thread-merged/page/2/?tab=comments#comment-2370270", "origin": "L-forum", "suborigin": "214267-the-sony-a7-thread-merged", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " michael, i think stephen is right, this is photoshop. i don't have my rx1 with me here to measure but the mount is huge on the rx1. i think sony understands this. i understand the zeiss lens is almost glued to the rx1 sensor, but if sony could -----> come !!!  -----> up !!!  -----> with !!!  a set of zeiss lenses that would work on a ff camera as well as my rx1 then leica would eventually have competition and some would buy sony. but, how long would it take for sony to offer lenses like my wate? and, how big would they be? by the time sony has these offerings, what will the leica m technology be like? heck, 5-10 years from now leica will probably offer such innovations as a black chrome finish. you'd have to stick with leica then. edited july 9, 2013 by rickleica", "sortedWord": "None", "Identifyer": null, "identifyer": 92674, "year": "2013"}, {"autor": "IkarusJohn", "date": "2013-07-10 01:30:00", "content": "Anyway, if Sony should create a new mount they wouldn’t see a need to deal with Italian flag issues; they could design the new lenses so there are no issues. Photographers trying to adapt their M lenses would be on their own then. Frankly I don’t expect anything like a solution to the Italian flag problem coming from Sony. Is this really the right way to look at this? Leica has, largely, resolved the Italian Flag issues with the M9 with their own lenses. There will be exceptions to this, but let's accept that the Italian Flag issue can be resolved with the M mount and register distance of M lenses. Now, I accept that if Sony decide to do a full frame interchangeable lens version of the RX-1 (to avoid Nex discussions), they will need to come up with a new camera and new lenses, rather than trying to shoehorn a full frame sensor into the Nex format and E mount. Sony is a leading sensor manufacturer, and they are teamed up with Zeiss, who already make M mount lenses. What's stopping Sony from using the M mount on your analysis? The lenses are already there, and Sony makes sensors - surely they have the skill to make the micro lenses on their sensors and to write the software to deal with the Italian Flag? So, let's compare the two options: - a new mount, new camera, new lenses. It could be a very good thing, but wouldn't the required form factor (size) push them towards the same sort of design decisions Leica made back in 1953 when they came out with the M3? - a new camera using the M mount (perhaps with their own branded Zeiss AF lenses, and zooms), thereby attracting existing Leica M & R lens owners (not a huge number, but not insignificant either) and boosting Zeiss ZM mount lenses. As I understand the technical barrier to this, it is a sensor and software issue. I would expect Sony to have greater expertise in these fields than Leica - for the M9 they subcontracted to Kodak and Jenoptik, and for the M (typ 240) to CMOSis and brought the software coding in-house (if I understand correctly). Put it another way, which is more appealing or less costly and less hassle for Sony. A completely new system, or sensor and software design, which they are apparently good at? Against this, Sony do have a history of trying too introduce their own standards rather than using existing standards - how many times have they released products with their own storage media, their own batteries and adapters. Drives me crazy, and has put me off Sony on more than one occasion. Cheers John", "link": "https://www.l-camera-forum.com/topic/214267-the-sony-a7-thread-merged/page/2/?tab=comments#comment-2370598", "origin": "L-forum", "suborigin": "214267-the-sony-a7-thread-merged", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "anyway, if sony should create a new mount they wouldn’t see a need to deal with italian flag issues; they could design the new lenses so there are no issues. photographers trying to adapt their m lenses would be on their own then. frankly i don’t expect anything like a solution to the italian flag problem coming from sony. is this really the right way to look at this? leica has, largely, resolved the italian flag issues with the m9 with their own lenses. there will be exceptions to this, but let's accept that the italian flag issue can be resolved with the m mount and register distance of m lenses. now, i accept that if sony decide to do a full frame interchangeable lens version of the rx-1 (to avoid nex discussions), they will need to -----> come !!!  -----> up !!!  -----> with !!!  a new camera and new lenses, rather than trying to shoehorn a full frame sensor into the nex format and e mount. sony is a leading sensor manufacturer, and they are teamed up with zeiss, who already make m mount lenses. what's stopping sony from using the m mount on your analysis? the lenses are already there, and sony makes sensors - surely they have the skill to make the micro lenses on their sensors and to write the software to deal with the italian flag? so, let's compare the two options: - a new mount, new camera, new lenses. it could be a very good thing, but wouldn't the required form factor (size) push them towards the same sort of design decisions leica made back in 1953 when they came out with the m3? - a new camera using the m mount (perhaps with their own branded zeiss af lenses, and zooms), thereby attracting existing leica m & r lens owners (not a huge number, but not insignificant either) and boosting zeiss zm mount lenses. as i understand the technical barrier to this, it is a sensor and software issue. i would expect sony to have greater expertise in these fields than leica - for the m9 they subcontracted to kodak and jenoptik, and for the m (typ 240) to cmosis and brought the software coding in-house (if i understand correctly). put it another way, which is more appealing or less costly and less hassle for sony. a completely new system, or sensor and software design, which they are apparently good at? against this, sony do have a history of trying too introduce their own standards rather than using existing standards - how many times have they released products with their own storage media, their own batteries and adapters. drives me crazy, and has put me off sony on more than one occasion. cheers john", "sortedWord": "None", "Identifyer": null, "identifyer": 92685, "year": "2013"}, {"autor": "kdriceman", "date": "2013-07-24 10:55:00", "content": "The reason might be that it won't perform well with your wider M lenses and lacks a rangefinder? That, and the rangefinder experience are the only reasons I'm able to come up with. Decent enough reasons, but it is a large premium to pay when I have bodies that give me both the rangefinder experience and give stunning results with my wide M lenses...", "link": "https://www.l-camera-forum.com/topic/214267-the-sony-a7-thread-merged/page/12/?tab=comments#comment-2381197", "origin": "L-forum", "suborigin": "214267-the-sony-a7-thread-merged", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "the reason might be that it won't perform well with your wider m lenses and lacks a rangefinder? that, and the rangefinder experience are the only reasons i'm able to -----> come !!!  -----> up !!!  -----> with !!! . decent enough reasons, but it is a large premium to pay when i have bodies that give me both the rangefinder experience and give stunning results with my wide m lenses...", "sortedWord": "None", "Identifyer": null, "identifyer": 92869, "year": "2013"}, {"autor": "hoppyman", "date": "2013-11-18 21:22:00", "content": " I tend to agree : for Leica \"broaden the market\" doesn't mean to reach Sony numbers : if the X line has been, till now, satisfactory for them, and the X Vario too makes good numbers (always considering their expectations, market, and production capacity) there is a sense in pursuing that road with a system camera : APS-C can give some advantage on the lenses' size (imagine an A7 with a Noctilux or a Summilux 21... --img-- ) and Leica is obviously mindful on this side. Probably, a fundamental choice for them, can be which kind of mount they engineer : by logic, it ought to be new, to accomodate a new specific lens' lineup... but they know that some sort of M compatibility, even with adapter, would be welcome by many people. I would add that Leica Camera have already designed a very good prime and a zoom that work extremely well with the X system sensor. I don't know more than anyone else of course but I would guess that whatever new design they come up with would allow use of the M & R lenses via adaptors too?", "link": "https://www.l-camera-forum.com/topic/216719-ceo-alfred-schopf-and-future-products/page/2/?tab=comments#comment-2468617", "origin": "L-forum", "suborigin": "216719-ceo-alfred-schopf-and-future-products", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " i tend to agree : for leica \"broaden the market\" doesn't mean to reach sony numbers : if the x line has been, till now, satisfactory for them, and the x vario too makes good numbers (always considering their expectations, market, and production capacity) there is a sense in pursuing that road with a system camera : aps-c can give some advantage on the lenses' size (imagine an a7 with a noctilux or a summilux 21... --img-- ) and leica is obviously mindful on this side. probably, a fundamental choice for them, can be which kind of mount they engineer : by logic, it ought to be new, to accomodate a new specific lens' lineup... but they know that some sort of m compatibility, even with adapter, would be welcome by many people. i would add that leica camera have already designed a very good prime and a zoom that work extremely well with the x system sensor. i don't know more than anyone else of course but i would guess that whatever new design they -----> come !!!  -----> up !!!  -----> with !!!  would allow use of the m & r lenses via adaptors too?", "sortedWord": "None", "Identifyer": null, "identifyer": 95838, "year": "2013"}, {"autor": "rosuna", "date": "2013-11-18 21:41:00", "content": "I would add that Leica Camera have already designed a very good prime and a zoom that work extremely well with the X system sensor. I don't know more than anyone else of course but I would guess that whatever new design they come up with would allow use of the M & R lenses via adaptors too? None is interested in crop modes. People accept it, if there is no alternative. But now we have one...", "link": "https://www.l-camera-forum.com/topic/216719-ceo-alfred-schopf-and-future-products/page/2/?tab=comments#comment-2468630", "origin": "L-forum", "suborigin": "216719-ceo-alfred-schopf-and-future-products", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i would add that leica camera have already designed a very good prime and a zoom that work extremely well with the x system sensor. i don't know more than anyone else of course but i would guess that whatever new design they -----> come !!!  -----> up !!!  -----> with !!!  would allow use of the m & r lenses via adaptors too? none is interested in crop modes. people accept it, if there is no alternative. but now we have one...", "sortedWord": "None", "Identifyer": null, "identifyer": 95840, "year": "2013"}, {"autor": "AlanG", "date": "2013-12-02 21:35:00", "content": "If the next M was much like the current M but had some of the following:- Lighter weight and perhaps a tad smaller like M6/MP - Another jump in DR, more pleasing highlight roll off like film perhaps - Multiple viewfinder magnifications etc. etc. I can't say what they might do for other markets but evolving the M is a given. Wouldn't it also have a better EVF and faster live view shooting? It is the mirrorless camera characteristics that will most likely be worked on. I doubt if they will come up with a new rangefinder design at this point. I could be wrong since they've had 60 years to think about how to improve it. So is it that big a stretch for there to also be a model that has a built in EVF and no rangefinder? And is it such an additional reach that they'd make a line of AF lenses for it considering at one time they made an entire SLR system alongside the M.", "link": "https://www.l-camera-forum.com/topic/216719-ceo-alfred-schopf-and-future-products/page/6/?tab=comments#comment-2478801", "origin": "L-forum", "suborigin": "216719-ceo-alfred-schopf-and-future-products", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "if the next m was much like the current m but had some of the following:- lighter weight and perhaps a tad smaller like m6/mp - another jump in dr, more pleasing highlight roll off like film perhaps - multiple viewfinder magnifications etc. etc. i can't say what they might do for other markets but evolving the m is a given. wouldn't it also have a better evf and faster live view shooting? it is the mirrorless camera characteristics that will most likely be worked on. i doubt if they will -----> come !!!  -----> up !!!  -----> with !!!  a new rangefinder design at this point. i could be wrong since they've had 60 years to think about how to improve it. so is it that big a stretch for there to also be a model that has a built in evf and no rangefinder? and is it such an additional reach that they'd make a line of af lenses for it considering at one time they made an entire slr system alongside the m.", "sortedWord": "None", "Identifyer": null, "identifyer": 95920, "year": "2013"}, {"autor": "AlanG", "date": "2013-11-12 16:39:00", "content": "I don't think you can just shoot at 100 ISO and then lift the dark images up to 6400+ in post. Some cameras go to 200,000 now. Besides, you won't see anything on the LCD when reviewing the images. So it would be pretty useless in practice for me in my applications. And talk about being time consuming in post. You couldn't even review your images until you've adjusted them. As a thought exercise, I'm just trying to come up with a fast and intuitive way to move and set all three exposure values. I have thought of a number of ways to further refine and implement this. For instance, the joy stick I diagrammed could have a button at each point of the triangle. You could press one, or two of those buttons to lock in a value for ISO, shutter speed, or F stop after moving the joystick... leaving the other one or two values to change. This would pretty much eliminate the need for the PSAM dial and possibly some other controls and would be really quick in use. Edited November 12, 2013 by AlanG", "link": "https://www.l-camera-forum.com/topic/216043-nikon-steps-in-with-an-alternativemerged/page/6/?tab=comments#comment-2463823", "origin": "L-forum", "suborigin": "216043-nikon-steps-in-with-an-alternativemerged", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i don't think you can just shoot at 100 iso and then lift the dark images up to 6400+ in post. some cameras go to 200,000 now. besides, you won't see anything on the lcd when reviewing the images. so it would be pretty useless in practice for me in my applications. and talk about being time consuming in post. you couldn't even review your images until you've adjusted them. as a thought exercise, i'm just trying to -----> come !!!  -----> up !!!  -----> with !!!  a fast and intuitive way to move and set all three exposure values. i have thought of a number of ways to further refine and implement this. for instance, the joy stick i diagrammed could have a button at each point of the triangle. you could press one, or two of those buttons to lock in a value for iso, shutter speed, or f stop after moving the joystick... leaving the other one or two values to change. this would pretty much eliminate the need for the psam dial and possibly some other controls and would be really quick in use. edited november 12, 2013 by alang", "sortedWord": "None", "Identifyer": null, "identifyer": 96696, "year": "2013"}, {"autor": "StS", "date": "2013-03-24 17:37:00", "content": "Thank you, but to be honest, I'm still fighting with prepositions. Since there is no rule, it needs to learned out of the context, so reading helps. Another effect might actually be my lack of vocabulary. If I can't come up with a colloquial term, an easy fix might be to try an English-conversion of a latin term. So Plagiarismus becomes plagiarism... Back to topic, I wonder, how many photographer's arms have been broken by the mirror recoil of a Hasselblad... --img--  Stefan", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/11/?tab=comments#comment-2280827", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "thank you, but to be honest, i'm still fighting with prepositions. since there is no rule, it needs to learned out of the context, so reading helps. another effect might actually be my lack of vocabulary. if i can't -----> come !!!  -----> up !!!  -----> with !!!  a colloquial term, an easy fix might be to try an english-conversion of a latin term. so plagiarismus becomes plagiarism... back to topic, i wonder, how many photographer's arms have been broken by the mirror recoil of a hasselblad... --img--  stefan", "sortedWord": "None", "Identifyer": null, "identifyer": 103315, "year": "2013"}, {"autor": "StS", "date": "2013-10-21 21:09:00", "content": "Well, the selection process as it is at the moment appears to be the best compromise - at least, I can't come up with something better. Unless something dramatic happens, I'll attend the 2014 challenge, regardless of the outcome of this vote. As discussed during the dinner, my recommendation for a location in Japan would have been Kyoto. Should Tokyo win the challenge, contrary to expectations, I can ask some people about local intelligence. My vote during the Wetzlar dinner went to New York, we have very active members there, and I thought it might be nice to give them a chance to join. Feasibility is relative, in this context - thinking about it, I paid more for the flight to Krakow than to New York. Time difference is only six hours to CET (and five to UK). Istanbul would be an easy target from my situation, having a numerous Turkish minority over here, I get three daily direct flights with Türk Hava Yollari (aka Turkish Airlines). Since THY is heading upmarket, their flights are pretty good, they are one of my favourite airlines. I also remember two excellent restaurants in Sultanahmet --img--  Stefan", "link": "https://www.l-camera-forum.com/topic/215043-istanbul-challenge-the-winner/page/2/?tab=comments#comment-2447578", "origin": "L-forum", "suborigin": "215043-istanbul-challenge-the-winner", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "well, the selection process as it is at the moment appears to be the best compromise - at least, i can't -----> come !!!  -----> up !!!  -----> with !!!  something better. unless something dramatic happens, i'll attend the 2014 challenge, regardless of the outcome of this vote. as discussed during the dinner, my recommendation for a location in japan would have been kyoto. should tokyo win the challenge, contrary to expectations, i can ask some people about local intelligence. my vote during the wetzlar dinner went to new york, we have very active members there, and i thought it might be nice to give them a chance to join. feasibility is relative, in this context - thinking about it, i paid more for the flight to krakow than to new york. time difference is only six hours to cet (and five to uk). istanbul would be an easy target from my situation, having a numerous turkish minority over here, i get three daily direct flights with türk hava yollari (aka turkish airlines). since thy is heading upmarket, their flights are pretty good, they are one of my favourite airlines. i also remember two excellent restaurants in sultanahmet --img--  stefan", "sortedWord": "None", "Identifyer": null, "identifyer": 134594, "year": "2013"}, {"autor": "Tim B", "date": "2013-02-21 19:59:00", "content": "Yes, it is certainly time we had a meet. I may be available if we avoid Sundays, but I'm pretty fully committed until after at least 12th April. And I would love to go up the Shard, but refuse to pay the exorbitant fee especially given the booking conditions - no doubt my loss --img--  ! But I'll wait and see what we all come up with. Tim", "link": "https://www.l-camera-forum.com/topic/198756-london-leica-meet-shard/?tab=comments#comment-2249702", "origin": "L-forum", "suborigin": "198756-london-leica-meet-shard", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "yes, it is certainly time we had a meet. i may be available if we avoid sundays, but i'm pretty fully committed until after at least 12th april. and i would love to go up the shard, but refuse to pay the exorbitant fee especially given the booking conditions - no doubt my loss --img--  ! but i'll wait and see what we all -----> come !!!  -----> up !!!  -----> with !!! . tim", "sortedWord": "None", "Identifyer": null, "identifyer": 136380, "year": "2013"}, {"autor": "theno23", "date": "2013-05-14 07:18:00", "content": "going to be in london this saturday, anyone interested in meeting up? Normally yes, but this is \"garden assault\" weekend, and I've come up with excuses every other time! Might be around for a beer or something in the evening though?", "link": "https://www.l-camera-forum.com/topic/198756-london-leica-meet-shard/page/6/?tab=comments#comment-2321066", "origin": "L-forum", "suborigin": "198756-london-leica-meet-shard", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "going to be in london this saturday, anyone interested in meeting up? normally yes, but this is \"garden assault\" weekend, and i've -----> come !!!  -----> up !!!  -----> with !!!  excuses every other time! might be around for a beer or something in the evening though?", "sortedWord": "None", "Identifyer": null, "identifyer": 136483, "year": "2013"}, {"autor": "Gibbo", "date": "2013-02-14 13:43:00", "content": " How about it guys? Shout out if there are any dates in April that you cannot make and I'll see what I can come up with --img-- ", "link": "https://www.l-camera-forum.com/topic/198288-yet-another-bristol-meet/?tab=comments#comment-2242981", "origin": "L-forum", "suborigin": "198288-yet-another-bristol-meet", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " how about it guys? shout out if there are any dates in april that you cannot make and i'll see what i can -----> come !!!  -----> up !!!  -----> with !!!  --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 136487, "year": "2013"}, {"autor": "masjah", "date": "2013-02-14 14:39:00", "content": "How about it guys? Shout out if there are any dates in April that you cannot make and I'll see what I can come up with --img--  Gibbo, might not be a problem in practice, but please do bear in mind that the second Seaside Challenge is in Whitby on Saturday 13th April!", "link": "https://www.l-camera-forum.com/topic/198288-yet-another-bristol-meet/?tab=comments#comment-2243029", "origin": "L-forum", "suborigin": "198288-yet-another-bristol-meet", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "how about it guys? shout out if there are any dates in april that you cannot make and i'll see what i can -----> come !!!  -----> up !!!  -----> with !!!  --img--  gibbo, might not be a problem in practice, but please do bear in mind that the second seaside challenge is in whitby on saturday 13th april!", "sortedWord": "None", "Identifyer": null, "identifyer": 136488, "year": "2013"}, {"autor": "Gibbo", "date": "2013-02-14 15:38:00", "content": "That, as they say, is a good point. However, Bristol may suit the southern contingent more. Let's see if there is any take up over the next couple of weeks and if not come up with another date --img-- ", "link": "https://www.l-camera-forum.com/topic/198288-yet-another-bristol-meet/?tab=comments#comment-2243085", "origin": "L-forum", "suborigin": "198288-yet-another-bristol-meet", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "that, as they say, is a good point. however, bristol may suit the southern contingent more. let's see if there is any take -----> up !!!  over the next couple of weeks and if not -----> come !!!  -----> up !!!  -----> with !!!  another date --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 136489, "year": "2013"}], "name": "Leicasortedout2013with"}