{"interestingcomments": [{"autor": "jaapv", "date": "2010-04-24 14:27:00", "content": " The point at which the roller enganges the helicoid maybe? And if you read my post you will see the adjustments are NOT independent - the whole point . I suggest you ask Leica - it is not my design....", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/5/?tab=comments#comment-1304177", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": " the point at which the roller enganges the helicoid maybe? and if you read my post you will see the adjustments are not independent - the whole point . i suggest you ask leica - it is not -----> my !!!  -----> design !!! ....", "sortedWord": "None", "Identifyer": null, "identifyer": 30725, "year": "2010"}, {"autor": "Julian Thompson", "date": "2010-04-24 14:41:00", "content": "I suggest you ask Leica - it is not my design.... No - clearly it isn't, and clearly you don't understand it either! The midpoint of focus is automatically set as the thread is a constant pitch on the lens. Bending the arm would move the roller, yes, but has nothing whatsoever to do with a routine rangefinder adjustment. No disrespect but there is a tremendous amount of work detailled in this thread - enough so that one could successfully adjust one's own rangefinder (as has been successfully done by 4 people I know of following the thread plus myself and carsten originally) Feel free to add to the knowledge base by backing up your claims with some graphs or other information but otherwise just leave it - it isn't helping at all and just makes you sound daft to the people who actually do understand how it works. Edited April 24, 2010 by Julian Thompson", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/5/?tab=comments#comment-1304193", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "my design", "selectorShort": "design", "MarkedSent": "i suggest you ask leica - it is not -----> my !!!  -----> design !!! .... no - clearly it isn't, and clearly you don't understand it either! the midpoint of focus is automatically set as the thread is a constant pitch on the lens. bending the arm would move the roller, yes, but has nothing whatsoever to do with a routine rangefinder adjustment. no disrespect but there is a tremendous amount of work detailled in this thread - enough so that one could successfully adjust one's own rangefinder (as has been successfully done by 4 people i know of following the thread plus myself and carsten originally) feel free to add to the knowledge base by backing up your claims with some graphs or other information but otherwise just leave it - it isn't helping at all and just makes you sound daft to the people who actually do understand how it works. edited april 24, 2010 by julian thompson", "sortedWord": "None", "Identifyer": null, "identifyer": 30726, "year": "2010"}, {"autor": "elansprint72", "date": "2010-04-28 22:27:00", "content": " Clever dicks and usual suspects please abstain.... this old friend and, arguably, piece of modern sculpture was resting at LM prior to doing what it was conceived to do. Designed in England, funded by America, built in England, improved by America, raced in France..... Enjoyed by many................ --img-- ", "link": "https://www.l-camera-forum.com/topic/119687-name-this-car/?tab=comments#comment-1309075", "origin": "L-forum", "suborigin": "119687-name-this-car", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": " clever dicks and usual suspects please abstain.... this old friend and, arguably, piece of modern sculpture was resting at lm prior to doing what it was conceived to do. -----> designed !!!  in england, funded by america, built in england, improved by america, raced in france..... enjoyed by many................ --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 56147, "year": "2010"}], "name": "Leicasortedout2010design"}