{"interestingcomments": [{"autor": "Ecar", "date": "2013-03-17 09:07:00", "content": "Designed, A few thoughts: Do you shoot RAW and then convert? If so, did you try different converters? It could be JPEG artifacts. Can you see the lines before doing any post-processing? How much do you push sliders such as exposure, contrast, clarity? Aggressive post-processing could be an obvious culprit. Does it happen will all your lenses? It could be a reflection from a particular lens. Did the camera take a hit? It could be a very small light leak - try taking a picture with the lens cap on and see if those bands appear. Hope this helps. And btw, I still love my M8's (well, the M8.2 a bit more than the M8;))", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/12/?tab=comments#comment-2273883", "origin": "L-forum", "suborigin": "160294-still-loving-the-m8", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!! , a few thoughts: do you shoot raw and then convert? if so, did you try different converters? it could be jpeg artifacts. can you see the lines before doing any post-processing? how much do you push sliders such as exposure, contrast, clarity? aggressive post-processing could be an obvious culprit. does it happen will all your lenses? it could be a reflection from a particular lens. did the camera take a hit? it could be a very small light leak - try taking a picture with the lens cap on and see if those bands appear. hope this helps. and btw, i still love my m8's (well, the m8.2 a bit more than the m8;))", "sortedWord": "None", "Identifyer": null, "identifyer": 42862, "year": "2013"}, {"autor": "designed", "date": "2013-03-17 09:38:00", "content": "Designed, A few thoughts: Do you shoot RAW and then convert? If so, did you try different converters? It could be JPEG artifacts. Can you see the lines before doing any post-processing? How much do you push sliders such as exposure, contrast, clarity? Aggressive post-processing could be an obvious culprit. Does it happen will all your lenses? It could be a reflection from a particular lens. Did the camera take a hit? It could be a very small light leak - try taking a picture with the lens cap on and see if those bands appear. Thanks for your ideas! Unfortunately I have ruled nearly all of them out already: - the lines appear in both Aperture & ACR - they are nearly invisible before any PP, but my b&ws are quite conservative so it shouldn't be a problem, and most certainly it hasn't been a problem before. - this happens with at least with my 21mm Elmarit as well as 50mm Zeiss, not sure about the 35. - the lines seem to affect bright (and possibly blue?) areas (sky), so I doubt the lens cap test will reveal anything, but will give it a go. And before anyone asks other usual but irrelevant things: - no, it's not the memory card - no, it's not the battery either. Oh well, it's a fantastic day, I'll try to go hunt some photos and see what turns up in those.", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/12/?tab=comments#comment-2273905", "origin": "L-forum", "suborigin": "160294-still-loving-the-m8", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!! , a few thoughts: do you shoot raw and then convert? if so, did you try different converters? it could be jpeg artifacts. can you see the lines before doing any post-processing? how much do you push sliders such as exposure, contrast, clarity? aggressive post-processing could be an obvious culprit. does it happen will all your lenses? it could be a reflection from a particular lens. did the camera take a hit? it could be a very small light leak - try taking a picture with the lens cap on and see if those bands appear. thanks for your ideas! unfortunately i have ruled nearly all of them out already: - the lines appear in both aperture & acr - they are nearly invisible before any pp, but my b&ws are quite conservative so it shouldn't be a problem, and most certainly it hasn't been a problem before. - this happens with at least with my 21mm elmarit as well as 50mm zeiss, not sure about the 35. - the lines seem to affect bright (and possibly blue?) areas (sky), so i doubt the lens cap test will reveal anything, but will give it a go. and before anyone asks other usual but irrelevant things: - no, it's not the memory card - no, it's not the battery either. oh well, it's a fantastic day, i'll try to go hunt some photos and see what turns up in those.", "sortedWord": "None", "Identifyer": null, "identifyer": 42863, "year": "2013"}, {"autor": "Leica Blog", "date": "2013-10-09 11:00:00", "content": " A unique Leica M, designed by Apple-designer Jony Ive and Marc Newson, will join in the (RED) Auction on November 23rd 2013. The proceeds will be used for charitable purposes in Africa. The post Apple’s Jony Ive Designed Leica M for (RED) Auction appeared first on Leica Forum Blog. Read more...", "link": "https://www.l-camera-forum.com/topic/214364-apple%E2%80%99s-jony-ive-designed-leica-m-for-red-auction/?tab=comments#comment-2438089", "origin": "L-forum", "suborigin": "214364-apple%E2%80%99s-jony-ive-designed-leica-m-for-red-auction", "result": true, "Selector": "ive designed", "selectorShort": "design", "MarkedSent": " a unique leica m, designed by apple-designer jony ive and marc newson, will join in the (red) auction on november 23rd 2013. the proceeds will be used for charitable purposes in africa. the post apple’s jony -----> i !!! -----> ve !!!  -----> designed !!!  leica m for (red) auction appeared first on leica forum blog. read more...", "sortedWord": "None", "Identifyer": null, "identifyer": 79689, "year": "2013"}, {"autor": "jaapv", "date": "2013-07-09 16:05:00", "content": "The timeframe on SAR appears to be more than slightly optimistic too. Leica has a considerable expertise in DRF design, control over the sensor, good ties with giant companies like Fujitsu and Jenoptik and still had/has a rocky road to run to get the production of the M running smoothly.. Designing a full-frame short register mirrorless is a bit more demanding than shoehorning an APS-C sensor into a point-and shoot body or designing a single lens- FF sensor unit. I doubt that Sony has any interest in adding exotic Leica lenses to their complications.", "link": "https://www.l-camera-forum.com/topic/214267-the-sony-a7-thread-merged/page/2/?tab=comments#comment-2370206", "origin": "L-forum", "suborigin": "214267-the-sony-a7-thread-merged", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "the timeframe on sar appears to be more than slightly optimistic too. leica has a considerable expertise in drf design, control over the sensor, good ties with giant companies like fujitsu and jenoptik and still had/has a rocky road to run to get the production of the m running smoothly.. -----> designing !!!  a full-frame short register mirrorless is a bit more demanding than shoehorning an aps-c sensor into a point-and shoot body or -----> designing !!!  a single lens- ff sensor unit. i doubt that sony has any interest in adding exotic leica lenses to their complications.", "sortedWord": "None", "Identifyer": null, "identifyer": 92669, "year": "2013"}], "name": "Leicasortedout2013design"}