{"interestingcomments": [{"autor": "zeitz", "date": "2020-09-21 17:51:00", "content": "I benefitted greatly from working with a Hahnemuehle certified printer in my area. In addition to learning his workflow, he sold me my Eizo monitor, advised me on which printer to buy and made custom profiles for the papers I use that are not Hahnemuehle products. (I also got to try a Phase One monochrome camera.) There are four Hahnemuehle certified printers in in the New York area. Two are in Brooklyn, one is in Peekskill, the other is in Beacon. Paying one of them for a one hour lesson would go very far in getting you started on the right path. I would think that one of them would be happy to offer you a training session. I also benefitted greatly from a workshop in Santa Fe, NM, in which Alan Ross is one of the instructors. I was introduced to this workshop through the Hahnemuehle printer. Alan worked for Ansel Adams and still prints Ansel's negatives. Alan is also a master digital printer, using Photoshop and a Canon iPF printer. He offers direct one-on-one instruction. In the COVID era he may do remote training. But spending a few hours with him in Santa Fe to learn his entire workflow is very instructive and great fun. Alan is quite a gentleman and an excellent instructor.", "link": "https://www.l-camera-forum.com/topic/313527-good-printer-for-monochrom-images/?tab=comments#comment-4049968", "origin": "L-forum", "suborigin": "313527-good-printer-for-monochrom-images", "result": true, "Selector": "i was introduced", "selectorShort": "introduce", "MarkedSent": "i benefitted greatly from working with a hahnemuehle certified printer in my area. in addition to learning his workflow, he sold me my eizo monitor, advised me on which printer to buy and made custom profiles for the papers i use that are not hahnemuehle products. (i also got to try a phase one monochrome camera.) there are four hahnemuehle certified printers in in the new york area. two are in brooklyn, one is in peekskill, the other is in beacon. paying one of them for a one hour lesson would go very far in getting you started on the right path. i would think that one of them would be happy to offer you a training session. i also benefitted greatly from a workshop in santa fe, nm, in which alan ross is one of the instructors. -----> i !!!  -----> was !!!  -----> introduced !!!  to this workshop through the hahnemuehle printer. alan worked for ansel adams and still prints ansel's negatives. alan is also a master digital printer, using photoshop and a canon ipf printer. he offers direct one-on-one instruction. in the covid era he may do remote training. but spending a few hours with him in santa fe to learn his entire workflow is very instructive and great fun. alan is quite a gentleman and an excellent instructor.", "sortedWord": "None", "Identifyer": null, "identifyer": 25311, "year": "2020"}, {"autor": "MaristFernas", "date": "2020-10-16 08:05:00", "content": " Hiya people, I haven’t introduced myself yet, and I will. A few things in short: I am a musician (use to be a photographer in the nineties with mostly manual gear: Leica M 50 mm f2.0. Contax with Zeiss 85 mm f1.4 and 25 mm. Made my bread with it. Am planning to get back in Leica digital after a years of Sigma gear SD10/15/1M with 50 and 70 lenses. I have a few questions: 1) I have been looking on youtube and found many AF speedexamples for the x1 and the x2. Little movies where you see how fast (or slow) the AF is. But I have to find one of the X itself? I really would like to see one. Is here someone that has such a nice little example of an X focussing on several different objects in a lighted room or outside? 2) I would like to know if the Olympus or Leica EVF also has the little focus rectangle that colors if something is in focus like on your lcd screen? Does it also has the focuspeaking as in the lcd? Otherwise, I would not have a use for a evf... 3) Is the focusring sturdy or loose? E.g. compared to the Q. well, many questions, I hope I am not to much of a bother. I already am planning to buy a black Q this december. I know this to be a very good camera. However, for my wife (and also for myself) I really would like this X gem. The X1/2 are to small for my taste. I ‘need’ a bigger camera I have found a nice one almost new but it is a long ride so I would like to know beforehand... have a great one!", "link": "https://www.l-camera-forum.com/topic/314257-x-and-af-speed-questions/?tab=comments#comment-4063491", "origin": "L-forum", "suborigin": "314257-x-and-af-speed-questions", "result": true, "Selector": "i haven’t introduced", "selectorShort": "introduce", "MarkedSent": " hiya people, -----> i !!!  -----> have !!! -----> n’t !!!  -----> introduced !!!  myself yet, and -----> i !!!  will. a few things in short: i am a musician (use to be a photographer in the nineties with mostly manual gear: leica m 50 mm f2.0. contax with zeiss 85 mm f1.4 and 25 mm. made my bread with it. am planning to get back in leica digital after a years of sigma gear sd10/15/1m with 50 and 70 lenses. i have a few questions: 1) i have been looking on youtube and found many af speedexamples for the x1 and the x2. little movies where you see how fast (or slow) the af is. but i have to find one of the x itself? i really would like to see one. is here someone that has such a nice little example of an x focussing on several different objects in a lighted room or outside? 2) i would like to know if the olympus or leica evf also has the little focus rectangle that colors if something is in focus like on your lcd screen? does it also has the focuspeaking as in the lcd? otherwise, i would not have a use for a evf... 3) is the focusring sturdy or loose? e.g. compared to the q. well, many questions, i hope i am not to much of a bother. i already am planning to buy a black q this december. i know this to be a very good camera. however, for my wife (and also for myself) i really would like this x gem. the x1/2 are to small for my taste. i ‘need’ a bigger camera i have found a nice one almost new but it is a long ride so i would like to know beforehand... have a great one!", "sortedWord": "None", "Identifyer": null, "identifyer": 10273, "year": "2020"}, {"autor": "MaristFernas", "date": "2020-10-19 05:47:00", "content": "On 10/16/2020 at 1:35 PM, MaristFernas said: Hiya people, I haven’t introduced myself yet, and I will. A few things in short: I am a musician (use to be a photographer in the nineties with mostly manual gear: Leica M 50 mm f2.0. Contax with Zeiss 85 mm f1.4 and 25 mm. Made my bread with it. Am planning to get back in Leica digital after a years of Sigma gear SD10/15/1M with 50 and 70 lenses. I have a few questions: 1) I have been looking on youtube and found many AF speedexamples for the x1 and the x2. Little movies where you see how fast (or slow) the AF is. essay writer But I have to find one of the X itself? I really would like to see one. Is here someone that has such a nice little example of an X focussing on several different objects in a lighted room or outside? 2) I would like to know if the Olympus or Leica EVF also has the little focus rectangle that colors if something is in focus like on your lcd screen? Does it also has the focuspeaking as in the lcd? Otherwise, I would not have a use for a evf... 3) Is the focusring sturdy or loose? E.g. compared to the Q. well, many questions, I hope I am not to much of a bother. I already am planning to buy a black Q this december. I know this to be a very good camera. However, for my wife (and also for myself) I really would like this X gem. The X1/2 are to small for my taste. I ‘need’ a bigger camera I have found a nice one almost new but it is a long ride so I would like to know beforehand... have a great one! thank you my issue has been solved Edited October 19, 2020 by MaristFernas", "link": "https://www.l-camera-forum.com/topic/314257-x-and-af-speed-questions/?tab=comments#comment-4064978", "origin": "L-forum", "suborigin": "314257-x-and-af-speed-questions", "result": true, "Selector": "i haven’t introduced", "selectorShort": "introduce", "MarkedSent": "on 10/16/2020 at 1:35 pm, maristfernas said: hiya people, -----> i !!!  -----> have !!! -----> n’t !!!  -----> introduced !!!  myself yet, and -----> i !!!  will. a few things in short: i am a musician (use to be a photographer in the nineties with mostly manual gear: leica m 50 mm f2.0. contax with zeiss 85 mm f1.4 and 25 mm. made my bread with it. am planning to get back in leica digital after a years of sigma gear sd10/15/1m with 50 and 70 lenses. i have a few questions: 1) i have been looking on youtube and found many af speedexamples for the x1 and the x2. little movies where you see how fast (or slow) the af is. essay writer but i have to find one of the x itself? i really would like to see one. is here someone that has such a nice little example of an x focussing on several different objects in a lighted room or outside? 2) i would like to know if the olympus or leica evf also has the little focus rectangle that colors if something is in focus like on your lcd screen? does it also has the focuspeaking as in the lcd? otherwise, i would not have a use for a evf... 3) is the focusring sturdy or loose? e.g. compared to the q. well, many questions, i hope i am not to much of a bother. i already am planning to buy a black q this december. i know this to be a very good camera. however, for my wife (and also for myself) i really would like this x gem. the x1/2 are to small for my taste. i ‘need’ a bigger camera i have found a nice one almost new but it is a long ride so i would like to know beforehand... have a great one! thank you my issue has been solved edited october 19, 2020 by maristfernas", "sortedWord": "None", "Identifyer": null, "identifyer": 10278, "year": "2020"}, {"autor": "ShawnK", "date": "2020-05-28 02:32:00", "content": " I got introduced to Sujimoto's work when Sharookh enlightened me, so thnx to him.", "link": "https://www.l-camera-forum.com/topic/309483-after-sujimoto/?tab=comments#comment-3981823", "origin": "L-forum", "suborigin": "309483-after-sujimoto", "result": true, "Selector": "i got introduced", "selectorShort": "introduce", "MarkedSent": " -----> i !!!  -----> got !!!  -----> introduced !!!  to sujimoto's work when sharookh enlightened me, so thnx to him.", "sortedWord": "None", "Identifyer": null, "identifyer": 55740, "year": "2020"}], "name": "Leicasortedout2020introduce"}