{"interestingcomments": [{"autor": "hutchinson14", "date": "2019-05-15 17:05:00", "content": " Has anyone had issues with the VisoFlex on a Leica M10? like not working correctly when switching the camera on coming up with a sliver/light gray screen with banding top and bottom? Sometimes working correctly but when pressing the button on the front for zoom sometimes causing it to go to the sliver/light gray screen? Returned it back to the camera shop I bought it from and they have tested it all day and no fault found. I updated the firmware last week to use the Leica FOTOS app could this have caused issues?", "link": "https://www.l-camera-forum.com/topic/297307-visoflex-issues-with-leica-m10/?tab=comments#comment-3741280", "origin": "L-forum", "suborigin": "297307-visoflex-issues-with-leica-m10", "result": true, "Selector": "coming up with", "selectorShort": "with", "MarkedSent": " has anyone had issues with the visoflex on a leica m10? like not working correctly when switching the camera on -----> coming !!!  -----> up !!!  -----> with !!!  a sliver/light gray screen -----> with !!!  banding top and bottom? sometimes working correctly but when pressing the button on the front for zoom sometimes causing it to go to the sliver/light gray screen? returned it back to the camera shop i bought it from and they have tested it all day and no fault found. i updated the firmware last week to use the leica fotos app could this have caused issues?", "sortedWord": "None", "Identifyer": null, "identifyer": 6574, "year": "2019"}, {"autor": "Chaemono", "date": "2019-07-27 13:00:00", "content": "vor 49 Minuten schrieb budjames: Do you mean that the SL2 will be \"bigger and heavier\" than the current SL? The current SL is already too big and heavy for what it does for me. Regards, Bud James No, I mean bigger and heavier than the M10. Slightly wider but not materially so than the SL to fit IBIS. Jono and Thorsten Overgaard assume it will come with the 47 MPx S1R/Q2 sensor. Therefore, I’d say at this point, this is a fair bet. But it takes time to come up with a solution to make that sensor work well all kinds of wide and legacy M and R lenses, I guess. At this point, I stopped caring what sensor the SL2 will sport. Everybody cooks their RAW files anyway and the better the algorithms, the better the ‘sensor’s performance.’ 😁 I’d say Sony and Panasonic use the most clever algorithms. It’s impressive how much better the S1R performs than the Q2 in the DxOMark charts even though it’s essentially the same sensor. 😂 vor 51 Minuten schrieb budjames: I've been shooting with my \"new\" M10-P this morning to test it out. Focus is accurate throughout the focus range for my APO Summicron 50. BTW, I think the M10-P goes well with the 28 Summilux-M wide open. You should try it. It’s about time you went a bit wide. 😁", "link": "https://www.l-camera-forum.com/topic/297610-leica-m10-to-m10-p-conversion/page/6/?tab=comments#comment-3785968", "origin": "L-forum", "suborigin": "297610-leica-m10-to-m10-p-conversion", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "vor 49 minuten schrieb budjames: do you mean that the sl2 will be \"bigger and heavier\" than the current sl? the current sl is already too big and heavy for what it does for me. regards, bud james no, i mean bigger and heavier than the m10. slightly wider but not materially so than the sl to fit ibis. jono and thorsten overgaard assume it will come with the 47 mpx s1r/q2 sensor. therefore, i’d say at this point, this is a fair bet. but it takes time to -----> come !!!  -----> up !!!  -----> with !!!  a solution to make that sensor work well all kinds of wide and legacy m and r lenses, i guess. at this point, i stopped caring what sensor the sl2 will sport. everybody cooks their raw files anyway and the better the algorithms, the better the ‘sensor’s performance.’ 😁 i’d say sony and panasonic use the most clever algorithms. it’s impressive how much better the s1r performs than the q2 in the dxomark charts even though it’s essentially the same sensor. 😂 vor 51 minuten schrieb budjames: i've been shooting with my \"new\" m10-p this morning to test it out. focus is accurate throughout the focus range for my apo summicron 50. btw, i think the m10-p goes well with the 28 summilux-m wide open. you should try it. it’s about time you went a bit wide. 😁", "sortedWord": "None", "Identifyer": null, "identifyer": 8078, "year": "2019"}, {"autor": "budjames", "date": "2019-07-27 14:24:00", "content": "1 hour ago, Chaemono said: No, I mean bigger and heavier than the M10. Slightly wider but not materially so than the SL to fit IBIS. Jono and Thorsten Overgaard assume it will come with the 47 MPx S1R/Q2 sensor. Therefore, I’d say at this point, this is a fair bet. But it takes time to come up with a solution to make that sensor work well all kinds of wide and legacy M and R lenses, I guess. At this point, I stopped caring what sensor the SL2 will sport. Everybody cooks their RAW files anyway and the better the algorithms, the better the ‘sensor’s performance.’ 😁 I’d say Sony and Panasonic use the most clever algorithms. It’s impressive how much better the S1R performs than the Q2 in the DxOMark charts even though it’s essentially the same sensor. 😂 BTW, I think the M10-P goes well with the 28 Summilux-M wide open. You should try it. It’s about time you went a bit wide. 😁 My go to lens is the Summilux 35. I own the Summicron 28, but I don’t use it much. Regards, Bud James Please check out my fine art and travel photography at www.budjames.photography or on Instagram at www.instagram.com/budjamesphoto.", "link": "https://www.l-camera-forum.com/topic/297610-leica-m10-to-m10-p-conversion/page/6/?tab=comments#comment-3785997", "origin": "L-forum", "suborigin": "297610-leica-m10-to-m10-p-conversion", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "1 hour ago, chaemono said: no, i mean bigger and heavier than the m10. slightly wider but not materially so than the sl to fit ibis. jono and thorsten overgaard assume it will come with the 47 mpx s1r/q2 sensor. therefore, i’d say at this point, this is a fair bet. but it takes time to -----> come !!!  -----> up !!!  -----> with !!!  a solution to make that sensor work well all kinds of wide and legacy m and r lenses, i guess. at this point, i stopped caring what sensor the sl2 will sport. everybody cooks their raw files anyway and the better the algorithms, the better the ‘sensor’s performance.’ 😁 i’d say sony and panasonic use the most clever algorithms. it’s impressive how much better the s1r performs than the q2 in the dxomark charts even though it’s essentially the same sensor. 😂 btw, i think the m10-p goes well with the 28 summilux-m wide open. you should try it. it’s about time you went a bit wide. 😁 my go to lens is the summilux 35. i own the summicron 28, but i don’t use it much. regards, bud james please check out my fine art and travel photography at www.budjames.photography or on instagram at www.instagram.com/budjamesphoto.", "sortedWord": "None", "Identifyer": null, "identifyer": 8079, "year": "2019"}, {"autor": "Cronilux", "date": "2019-07-28 19:49:00", "content": "Am 27.7.2019 um 15:00 schrieb Chaemono: No, I mean bigger and heavier than the M10. Slightly wider but not materially so than the SL to fit IBIS. Jono and Thorsten Overgaard assume it will come with the 47 MPx S1R/Q2 sensor. Therefore, I’d say at this point, this is a fair bet. But it takes time to come up with a solution to make that sensor work well all kinds of wide and legacy M and R lenses, I guess. At this point, I stopped caring what sensor the SL2 will sport. Everybody cooks their RAW files anyway and the better the algorithms, the better the ‘sensor’s performance.’ 😁 I’d say Sony and Panasonic use the most clever algorithms. It’s impressive how much better the S1R performs than the Q2 in the DxOMark charts even though it’s essentially the same sensor. 😂 BTW, I think the M10-P goes well with the 28 Summilux-M wide open. You should try it. It’s about time you went a bit wide. 😁 The SL2 will be pretty accurately have 47.2mp. It’s basically a Panasonic camera. Should be released at the end of this year.", "link": "https://www.l-camera-forum.com/topic/297610-leica-m10-to-m10-p-conversion/page/6/?tab=comments#comment-3786823", "origin": "L-forum", "suborigin": "297610-leica-m10-to-m10-p-conversion", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "am 27.7.2019 um 15:00 schrieb chaemono: no, i mean bigger and heavier than the m10. slightly wider but not materially so than the sl to fit ibis. jono and thorsten overgaard assume it will come with the 47 mpx s1r/q2 sensor. therefore, i’d say at this point, this is a fair bet. but it takes time to -----> come !!!  -----> up !!!  -----> with !!!  a solution to make that sensor work well all kinds of wide and legacy m and r lenses, i guess. at this point, i stopped caring what sensor the sl2 will sport. everybody cooks their raw files anyway and the better the algorithms, the better the ‘sensor’s performance.’ 😁 i’d say sony and panasonic use the most clever algorithms. it’s impressive how much better the s1r performs than the q2 in the dxomark charts even though it’s essentially the same sensor. 😂 btw, i think the m10-p goes well with the 28 summilux-m wide open. you should try it. it’s about time you went a bit wide. 😁 the sl2 will be pretty accurately have 47.2mp. it’s basically a panasonic camera. should be released at the end of this year.", "sortedWord": "None", "Identifyer": null, "identifyer": 8082, "year": "2019"}, {"autor": "grick", "date": "2019-09-01 17:59:00", "content": "On 6/6/2019 at 1:12 PM, hockey44 said: I followed advice here and started recording video with lens cap and let it run until nearly dead. I've tried searching this and come up with nothing. I don't know where to look. Could you please link the thread in a reply? Thanks. Greg", "link": "https://www.l-camera-forum.com/topic/281925-mp-240-battery-seems-drop-dead/?tab=comments#comment-3811267", "origin": "L-forum", "suborigin": "281925-mp-240-battery-seems-drop-dead", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 6/6/2019 at 1:12 pm, hockey44 said: i followed advice here and started recording video with lens cap and let it run until nearly dead. i've tried searching this and -----> come !!!  -----> up !!!  -----> with !!!  nothing. i don't know where to look. could you please link the thread in a reply? thanks. greg", "sortedWord": "None", "Identifyer": null, "identifyer": 13813, "year": "2019"}, {"autor": "sshire", "date": "2019-03-04 01:17:00", "content": "I do like double caps. Better than finding a good place to put a lens down while replacing it with another. But, I was never really happy gluing two caps together. I’ve had nightmare images of the caps coming unglued and bouncing a Cron off the street. As usual, with way too much time and a pretty complete machine shop in the basement (one hobby is building steam engines) I came up with this. This is the first prototype and the 2d version should be better. Here’s a little video showing some of the production. Enjoy --img-- ", "link": "https://www.l-camera-forum.com/topic/293896-using-double-rear-cap-to-speed-up-changing-lens/page/2/?tab=comments#comment-3694788", "origin": "L-forum", "suborigin": "293896-using-double-rear-cap-to-speed-up-changing-lens", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "i do like double caps. better than finding a good place to put a lens down while replacing it with another. but, i was never really happy gluing two caps together. i’ve had nightmare images of the caps coming unglued and bouncing a cron off the street. as usual, -----> with !!!  way too much time and a pretty complete machine shop in the basement (one hobby is building steam engines) i -----> came !!!  -----> up !!!  -----> with !!!  this. this is the first prototype and the 2d version should be better. here’s a little video showing some of the production. enjoy --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 20798, "year": "2019"}, {"autor": "Einst_Stein", "date": "2019-03-23 01:03:00", "content": "On 3/3/2019 at 5:17 PM, sshire said: I do like double caps. Better than finding a good place to put a lens down while replacing it with another. But, I was never really happy gluing two caps together. I’ve had nightmare images of the caps coming unglued and bouncing a Cron off the street. As usual, with way too much time and a pretty complete machine shop in the basement (one hobby is building steam engines) I came up with this. This is the first prototype and the 2d version should be better. Here’s a little video showing some of the production. Enjoy --img--  I find glue them and wrap with tap is very secure for holding them. The potential problem might be the plastic caps that can get loose after a while. The danger is dropping the lens. So i always hold the lens upwards while switching, and hold them by the lens, not the caps. It takes some practice.", "link": "https://www.l-camera-forum.com/topic/293896-using-double-rear-cap-to-speed-up-changing-lens/page/2/?tab=comments#comment-3707494", "origin": "L-forum", "suborigin": "293896-using-double-rear-cap-to-speed-up-changing-lens", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "on 3/3/2019 at 5:17 pm, sshire said: i do like double caps. better than finding a good place to put a lens down while replacing it with another. but, i was never really happy gluing two caps together. i’ve had nightmare images of the caps coming unglued and bouncing a cron off the street. as usual, -----> with !!!  way too much time and a pretty complete machine shop in the basement (one hobby is building steam engines) i -----> came !!!  -----> up !!!  -----> with !!!  this. this is the first prototype and the 2d version should be better. here’s a little video showing some of the production. enjoy --img--  i find glue them and wrap with tap is very secure for holding them. the potential problem might be the plastic caps that can get loose after a while. the danger is dropping the lens. so i always hold the lens upwards while switching, and hold them by the lens, not the caps. it takes some practice.", "sortedWord": "None", "Identifyer": null, "identifyer": 20801, "year": "2019"}, {"autor": "AndreasG", "date": "2019-03-25 13:52:00", "content": "Am 4.3.2019 um 02:17 schrieb sshire: I do like double caps. Better than finding a good place to put a lens down while replacing it with another. But, I was never really happy gluing two caps together. I’ve had nightmare images of the caps coming unglued and bouncing a Cron off the street. As usual, with way too much time and a pretty complete machine shop in the basement (one hobby is building steam engines) I came up with this. This is the first prototype and the 2d version should be better. Here’s a little video showing some of the production. Enjoy --img--  Great machining, you even master the knurling, this is far beyond my capability!", "link": "https://www.l-camera-forum.com/topic/293896-using-double-rear-cap-to-speed-up-changing-lens/page/2/?tab=comments#comment-3709138", "origin": "L-forum", "suborigin": "293896-using-double-rear-cap-to-speed-up-changing-lens", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "am 4.3.2019 um 02:17 schrieb sshire: i do like double caps. better than finding a good place to put a lens down while replacing it with another. but, i was never really happy gluing two caps together. i’ve had nightmare images of the caps coming unglued and bouncing a cron off the street. as usual, -----> with !!!  way too much time and a pretty complete machine shop in the basement (one hobby is building steam engines) i -----> came !!!  -----> up !!!  -----> with !!!  this. this is the first prototype and the 2d version should be better. here’s a little video showing some of the production. enjoy --img--  great machining, you even master the knurling, this is far beyond my capability!", "sortedWord": "None", "Identifyer": null, "identifyer": 20802, "year": "2019"}, {"autor": "Jeff S", "date": "2019-04-08 23:34:00", "content": "The latest sensor for the M9/Monochrom is said to fix the issue, so no further replacements should be needed. For years, before the fix, Leica installed the same corrosion-prone sensor. (This was similar to the situation that existed for years before Leica finally came up with a fix for the problematic S lens AF motors.) As far as CCD vs CMOS, there are already a few thousand posts on the matter. Pick a side. Jeff", "link": "https://www.l-camera-forum.com/topic/296008-monochrom-ccd-first-compared-to-m246-cmos/?tab=comments#comment-3718558", "origin": "L-forum", "suborigin": "296008-monochrom-ccd-first-compared-to-m246-cmos", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "the latest sensor for the m9/monochrom is said to fix the issue, so no further replacements should be needed. for years, before the fix, leica installed the same corrosion-prone sensor. (this was similar to the situation that existed for years before leica finally -----> came !!!  -----> up !!!  -----> with !!!  a fix for the problematic s lens af motors.) as far as ccd vs cmos, there are already a few thousand posts on the matter. pick a side. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 24185, "year": "2019"}, {"autor": "CharlieLoon", "date": "2019-06-25 01:26:00", "content": " I'm hoping for some help here... I am new to shooting Leica. I had previously been shooting with a Hasselblad (using the waist level finder), and prior to that a normal 35mm SLR. I find with my Leica Monochrom (M9M), I tend to get blurry vision in my non-dominant eye. I do shoot with my left eye shut, but that is also how I shot with my Hasselblad and my 35mm SLR. I never had blurry vision in my left eye with these cameras (with the Hasselblad, I often held the camera up to my chest, with my eye right up to the magnifier of the WLF). I know I am not closing my left eye too tightly. I do not have any issues if I keep my left eye open with the Leica, but I find it too hard to compose an image that way. I already saw an ophthalmologist--I still have 20/20 vision. I have gone through a lot of posts and seen others mention this problem, but I haven't seen anyone come up with any solutions aside from keeping both eyes open. That just doesn't work for me unfortunately. Also, since the M9M has a CCD sensor, the Visoflex isn't an option for me. Could the built-in diopter have anything to do with this? I believe it must have something to do with the rangefinder since I can't reproduce the issue with any other cameras. I'm at a loss here and ready to sell the camera. I do really enjoy the images, so if anyone has any advice, I'd appreciate it.", "link": "https://www.l-camera-forum.com/topic/298645-blurry-vision-in-non-dominant-eye/?tab=comments#comment-3765845", "origin": "L-forum", "suborigin": "298645-blurry-vision-in-non-dominant-eye", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": " i'm hoping for some help here... i am new to shooting leica. i had previously been shooting with a hasselblad (using the waist level finder), and prior to that a normal 35mm slr. i find with my leica monochrom (m9m), i tend to get blurry vision in my non-dominant eye. i do shoot with my left eye shut, but that is also how i shot with my hasselblad and my 35mm slr. i never had blurry vision in my left eye with these cameras (with the hasselblad, i often held the camera up to my chest, with my eye right up to the magnifier of the wlf). i know i am not closing my left eye too tightly. i do not have any issues if i keep my left eye open with the leica, but i find it too hard to compose an image that way. i already saw an ophthalmologist--i still have 20/20 vision. i have gone through a lot of posts and seen others mention this problem, but i haven't seen anyone -----> come !!!  -----> up !!!  -----> with !!!  any solutions aside from keeping both eyes open. that just doesn't work for me unfortunately. also, since the m9m has a ccd sensor, the visoflex isn't an option for me. could the built-in diopter have anything to do with this? i believe it must have something to do with the rangefinder since i can't reproduce the issue with any other cameras. i'm at a loss here and ready to sell the camera. i do really enjoy the images, so if anyone has any advice, i'd appreciate it.", "sortedWord": "None", "Identifyer": null, "identifyer": 29273, "year": "2019"}, {"autor": "michali", "date": "2019-07-30 16:39:00", "content": "On 7/28/2019 at 4:19 PM, jaapv said: Hi Mike! It is very likely corrosion. Those must have been about the last ones of the old type... It should be under warranty by what came out back then, but obviously I cannot speak for Leica. Contact Andrea at CS and ask. So, I've been in contact with Leica CS regarding the corrosion on my M9 & Monochrom sensors which were replaced in 2015. When I wrote to them I said that I would assume that the replaced sensors would carry a 5 year warranty from 2015. Here's the reply I received this morning: \"We regret to learn that you have problems again with the sensors of both your Leica M9 and your Leica MM. Both cameras are older than 5 years, we charge a contribution of €1330 + VAT for affected cameras that are older than 5 years. The deciding factor is the age of the camera for which we allowed an additional 3 year good will period, not the age of the sensor. Included in this price for sensor replacement is a free general overhaul of your Leica M camera and a one year warranty on the same terms as for new products. This offer expresses our commitment to conserving the value of the camera. The general overhaul of the Leica M camera includes the following items: Cleaning and overhaul of the shutter cocking mechanisms Cleaning and maintenance/repair of the multifunction wheel Cleaning of the main switch and shutter speed dial Adjustment of the baseplate locking system Refurbishment of engravings Renewal of the protective film on the baseplate Maintenance/repair of viewfinder displays In addition to the chargeable repair, you have the option to take advantage of our attractive upgrade program to a M 240, M 262 or MM 246, M10/M10-P or Leica SL incl. M-Adapter. Please kindly fill out the repair form and the proforma invoice and send with the goods.\" Other than the corroded sensors, my cameras don't need any overhaul, that's all marketing BS. To say that I'm pissed off is an uderstatement! Leica's attitude is unconscionable. If I decide to go the repair route I'm in for €2, 660- plus 19% = €3, 165- If I decide to take advantage of their so-called \"attractive upgrade program\" I'm still going to have to part with money. All for something that is entirely due to their faulty supply chain and manufacturing process, and no fault of this consumer who in good faith purchased 2 \"high-end quality\" cameras. Selling the cameras as they are is not an option. So either way, I'm going to have to fork out more money to Leica or sit with two expensive paper weights.... OK I've had my rant. I've now asked them to send me the options of their \"attractive upgrade program\". Let's see what they come up with........... Best, Mike Edited July 30, 2019 by michali", "link": "https://www.l-camera-forum.com/topic/293305-leica-m9-corrosion-with-new-sensor/page/3/?tab=comments#comment-3787967", "origin": "L-forum", "suborigin": "293305-leica-m9-corrosion-with-new-sensor", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 7/28/2019 at 4:19 pm, jaapv said: hi mike! it is very likely corrosion. those must have been about the last ones of the old type... it should be under warranty by what came out back then, but obviously i cannot speak for leica. contact andrea at cs and ask. so, i've been in contact with leica cs regarding the corrosion on my m9 & monochrom sensors which were replaced in 2015. when i wrote to them i said that i would assume that the replaced sensors would carry a 5 year warranty from 2015. here's the reply i received this morning: \"we regret to learn that you have problems again with the sensors of both your leica m9 and your leica mm. both cameras are older than 5 years, we charge a contribution of €1330 + vat for affected cameras that are older than 5 years. the deciding factor is the age of the camera for which we allowed an additional 3 year good will period, not the age of the sensor. included in this price for sensor replacement is a free general overhaul of your leica m camera and a one year warranty on the same terms as for new products. this offer expresses our commitment to conserving the value of the camera. the general overhaul of the leica m camera includes the following items: cleaning and overhaul of the shutter cocking mechanisms cleaning and maintenance/repair of the multifunction wheel cleaning of the main switch and shutter speed dial adjustment of the baseplate locking system refurbishment of engravings renewal of the protective film on the baseplate maintenance/repair of viewfinder displays in addition to the chargeable repair, you have the option to take advantage of our attractive upgrade program to a m 240, m 262 or mm 246, m10/m10-p or leica sl incl. m-adapter. please kindly fill out the repair form and the proforma invoice and send with the goods.\" other than the corroded sensors, my cameras don't need any overhaul, that's all marketing bs. to say that i'm pissed off is an uderstatement! leica's attitude is unconscionable. if i decide to go the repair route i'm in for €2, 660- plus 19% = €3, 165- if i decide to take advantage of their so-called \"attractive upgrade program\" i'm still going to have to part with money. all for something that is entirely due to their faulty supply chain and manufacturing process, and no fault of this consumer who in good faith purchased 2 \"high-end quality\" cameras. selling the cameras as they are is not an option. so either way, i'm going to have to fork out more money to leica or sit with two expensive paper weights.... ok i've had my rant. i've now asked them to send me the options of their \"attractive upgrade program\". let's see what they -----> come !!!  -----> up !!!  -----> with !!! ........... best, mike edited july 30, 2019 by michali", "sortedWord": "None", "Identifyer": null, "identifyer": 30505, "year": "2019"}, {"autor": "Gobert", "date": "2019-07-30 19:07:00", "content": "2 hours ago, michali said: So, I've been in contact with Leica CS regarding the corrosion on my M9 & Monochrom sensors which were replaced in 2015. When I wrote to them I said that I would assume that the replaced sensors would carry a 5 year warranty from 2015. Here's the reply I received this morning: \"We regret to learn that you have problems again with the sensors of both your Leica M9 and your Leica MM. Both cameras are older than 5 years, we charge a contribution of €1330 + VAT for affected cameras that are older than 5 years. The deciding factor is the age of the camera for which we allowed an additional 3 year good will period, not the age of the sensor. Included in this price for sensor replacement is a free general overhaul of your Leica M camera and a one year warranty on the same terms as for new products. This offer expresses our commitment to conserving the value of the camera. The general overhaul of the Leica M camera includes the following items: Cleaning and overhaul of the shutter cocking mechanisms Cleaning and maintenance/repair of the multifunction wheel Cleaning of the main switch and shutter speed dial Adjustment of the baseplate locking system Refurbishment of engravings Renewal of the protective film on the baseplate Maintenance/repair of viewfinder displays In addition to the chargeable repair, you have the option to take advantage of our attractive upgrade program to a M 240, M 262 or MM 246, M10/M10-P or Leica SL incl. M-Adapter. Please kindly fill out the repair form and the proforma invoice and send with the goods.\" Other than the corroded sensors, my cameras don't need any overhaul, that's all marketing BS. To say that I'm pissed off is an uderstatement! Leica's attitude is unconscionable. If I decide to go the repair route I'm in for €2, 660- plus 19% = €3, 165- If I decide to take advantage of their so-called \"attractive upgrade program\" I'm still going to have to part with money. All for something that is entirely due to their faulty supply chain and manufacturing process, and no fault of this consumer who in good faith purchased 2 \"high-end quality\" cameras. Selling the cameras as they are is not an option. So either way, I'm going to have to fork out more money to Leica or sit with two expensive paper weights.... OK I've had my rant. I've now asked them to send me the options of their \"attractive upgrade program\". Let's see what they come up with........... Best, Mike Sue them! You are in the States. Edited July 30, 2019 by Gobert", "link": "https://www.l-camera-forum.com/topic/293305-leica-m9-corrosion-with-new-sensor/page/3/?tab=comments#comment-3788051", "origin": "L-forum", "suborigin": "293305-leica-m9-corrosion-with-new-sensor", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "2 hours ago, michali said: so, i've been in contact with leica cs regarding the corrosion on my m9 & monochrom sensors which were replaced in 2015. when i wrote to them i said that i would assume that the replaced sensors would carry a 5 year warranty from 2015. here's the reply i received this morning: \"we regret to learn that you have problems again with the sensors of both your leica m9 and your leica mm. both cameras are older than 5 years, we charge a contribution of €1330 + vat for affected cameras that are older than 5 years. the deciding factor is the age of the camera for which we allowed an additional 3 year good will period, not the age of the sensor. included in this price for sensor replacement is a free general overhaul of your leica m camera and a one year warranty on the same terms as for new products. this offer expresses our commitment to conserving the value of the camera. the general overhaul of the leica m camera includes the following items: cleaning and overhaul of the shutter cocking mechanisms cleaning and maintenance/repair of the multifunction wheel cleaning of the main switch and shutter speed dial adjustment of the baseplate locking system refurbishment of engravings renewal of the protective film on the baseplate maintenance/repair of viewfinder displays in addition to the chargeable repair, you have the option to take advantage of our attractive upgrade program to a m 240, m 262 or mm 246, m10/m10-p or leica sl incl. m-adapter. please kindly fill out the repair form and the proforma invoice and send with the goods.\" other than the corroded sensors, my cameras don't need any overhaul, that's all marketing bs. to say that i'm pissed off is an uderstatement! leica's attitude is unconscionable. if i decide to go the repair route i'm in for €2, 660- plus 19% = €3, 165- if i decide to take advantage of their so-called \"attractive upgrade program\" i'm still going to have to part with money. all for something that is entirely due to their faulty supply chain and manufacturing process, and no fault of this consumer who in good faith purchased 2 \"high-end quality\" cameras. selling the cameras as they are is not an option. so either way, i'm going to have to fork out more money to leica or sit with two expensive paper weights.... ok i've had my rant. i've now asked them to send me the options of their \"attractive upgrade program\". let's see what they -----> come !!!  -----> up !!!  -----> with !!! ........... best, mike sue them! you are in the states. edited july 30, 2019 by gobert", "sortedWord": "None", "Identifyer": null, "identifyer": 30508, "year": "2019"}, {"autor": "Arrow", "date": "2019-11-23 19:25:00", "content": "On 7/30/2019 at 6:39 PM, michali said: So, I've been in contact with Leica CS regarding the corrosion on my M9 & Monochrom sensors which were replaced in 2015. When I wrote to them I said that I would assume that the replaced sensors would carry a 5 year warranty from 2015. Here's the reply I received this morning: \"We regret to learn that you have problems again with the sensors of both your Leica M9 and your Leica MM. Both cameras are older than 5 years, we charge a contribution of €1330 + VAT for affected cameras that are older than 5 years. The deciding factor is the age of the camera for which we allowed an additional 3 year good will period, not the age of the sensor. Included in this price for sensor replacement is a free general overhaul of your Leica M camera and a one year warranty on the same terms as for new products. This offer expresses our commitment to conserving the value of the camera. The general overhaul of the Leica M camera includes the following items: Cleaning and overhaul of the shutter cocking mechanisms Cleaning and maintenance/repair of the multifunction wheel Cleaning of the main switch and shutter speed dial Adjustment of the baseplate locking system Refurbishment of engravings Renewal of the protective film on the baseplate Maintenance/repair of viewfinder displays In addition to the chargeable repair, you have the option to take advantage of our attractive upgrade program to a M 240, M 262 or MM 246, M10/M10-P or Leica SL incl. M-Adapter. Please kindly fill out the repair form and the proforma invoice and send with the goods.\" Other than the corroded sensors, my cameras don't need any overhaul, that's all marketing BS. To say that I'm pissed off is an uderstatement! Leica's attitude is unconscionable. If I decide to go the repair route I'm in for €2, 660- plus 19% = €3, 165- If I decide to take advantage of their so-called \"attractive upgrade program\" I'm still going to have to part with money. All for something that is entirely due to their faulty supply chain and manufacturing process, and no fault of this consumer who in good faith purchased 2 \"high-end quality\" cameras. Selling the cameras as they are is not an option. So either way, I'm going to have to fork out more money to Leica or sit with two expensive paper weights.... OK I've had my rant. I've now asked them to send me the options of their \"attractive upgrade program\". Let's see what they come up with........... Best, Mike There is no upgrade option to an M3 mentioned.", "link": "https://www.l-camera-forum.com/topic/293305-leica-m9-corrosion-with-new-sensor/page/5/?tab=comments#comment-3860423", "origin": "L-forum", "suborigin": "293305-leica-m9-corrosion-with-new-sensor", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 7/30/2019 at 6:39 pm, michali said: so, i've been in contact with leica cs regarding the corrosion on my m9 & monochrom sensors which were replaced in 2015. when i wrote to them i said that i would assume that the replaced sensors would carry a 5 year warranty from 2015. here's the reply i received this morning: \"we regret to learn that you have problems again with the sensors of both your leica m9 and your leica mm. both cameras are older than 5 years, we charge a contribution of €1330 + vat for affected cameras that are older than 5 years. the deciding factor is the age of the camera for which we allowed an additional 3 year good will period, not the age of the sensor. included in this price for sensor replacement is a free general overhaul of your leica m camera and a one year warranty on the same terms as for new products. this offer expresses our commitment to conserving the value of the camera. the general overhaul of the leica m camera includes the following items: cleaning and overhaul of the shutter cocking mechanisms cleaning and maintenance/repair of the multifunction wheel cleaning of the main switch and shutter speed dial adjustment of the baseplate locking system refurbishment of engravings renewal of the protective film on the baseplate maintenance/repair of viewfinder displays in addition to the chargeable repair, you have the option to take advantage of our attractive upgrade program to a m 240, m 262 or mm 246, m10/m10-p or leica sl incl. m-adapter. please kindly fill out the repair form and the proforma invoice and send with the goods.\" other than the corroded sensors, my cameras don't need any overhaul, that's all marketing bs. to say that i'm pissed off is an uderstatement! leica's attitude is unconscionable. if i decide to go the repair route i'm in for €2, 660- plus 19% = €3, 165- if i decide to take advantage of their so-called \"attractive upgrade program\" i'm still going to have to part with money. all for something that is entirely due to their faulty supply chain and manufacturing process, and no fault of this consumer who in good faith purchased 2 \"high-end quality\" cameras. selling the cameras as they are is not an option. so either way, i'm going to have to fork out more money to leica or sit with two expensive paper weights.... ok i've had my rant. i've now asked them to send me the options of their \"attractive upgrade program\". let's see what they -----> come !!!  -----> up !!!  -----> with !!! ........... best, mike there is no upgrade option to an m3 mentioned.", "sortedWord": "None", "Identifyer": null, "identifyer": 30559, "year": "2019"}, {"autor": "pedaes", "date": "2019-11-24 11:11:00", "content": "32 minutes ago, paulmac said: Absolutely fair point but the M9 issue was not something caused by \"fair wear and tear\" but was a design flaw that was inbuilt into the camera from new. It was as a ticking time bomb and affected or will affect a great many of the original sensor M9's. My cameras cost me an average of £3000-£5000 each and that's an awful lot of money to have spent on a camera that came with an inbuilt fault. I absolutely accept that it wasn't Leica's fault and that these things happen - it's not the end of the world!. It was unforeseen and I'm sure that Leica were devastated by this failure. As you say though it was VERY poor the way that they handled the issue - firstly denying it and then reneging on their stated policy of fixing it for free. I originally saw it as a non issue and something that would be fixed anyway so \"why bother\" Leica would sort it and stand by their customers. That's all I am upset about, the going back on their word and taking heed of the accountants who no doubt came up with some formula that said \"Yes there will be hassle and a loss of faith but there will be new customers buying future products so no lasting damage\". I always thought Leica were a company who above all else were concerned to make the very best and would always stand by their products. Although we will all agree it could have been handled better, in fairness I think they gave notice the 'free' replacement was ending and there was a window to register your camera. Must be a quite news day for this topic to be reserrected! Edited November 24, 2019 by pedaes", "link": "https://www.l-camera-forum.com/topic/293305-leica-m9-corrosion-with-new-sensor/page/6/?tab=comments#comment-3860905", "origin": "L-forum", "suborigin": "293305-leica-m9-corrosion-with-new-sensor", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "32 minutes ago, paulmac said: absolutely fair point but the m9 issue was not something caused by \"fair wear and tear\" but was a design flaw that was inbuilt into the camera from new. it was as a ticking time bomb and affected or will affect a great many of the original sensor m9's. my cameras cost me an average of £3000-£5000 each and that's an awful lot of money to have spent on a camera that came with an inbuilt fault. i absolutely accept that it wasn't leica's fault and that these things happen - it's not the end of the world!. it was unforeseen and i'm sure that leica were devastated by this failure. as you say though it was very poor the way that they handled the issue - firstly denying it and then reneging on their stated policy of fixing it for free. i originally saw it as a non issue and something that would be fixed anyway so \"why bother\" leica would sort it and stand by their customers. that's all i am upset about, the going back on their word and taking heed of the accountants who no doubt -----> came !!!  -----> up !!!  -----> with !!!  some formula that said \"yes there will be hassle and a loss of faith but there will be new customers buying future products so no lasting damage\". i always thought leica were a company who above all else were concerned to make the very best and would always stand by their products. although we will all agree it could have been handled better, in fairness i think they gave notice the 'free' replacement was ending and there was a window to register your camera. must be a quite news day for this topic to be reserrected! edited november 24, 2019 by pedaes", "sortedWord": "None", "Identifyer": null, "identifyer": 30577, "year": "2019"}, {"autor": "Graham (G4FUJ)", "date": "2019-08-02 08:56:00", "content": "More general use, but I can never remember the name of them. However an e-Bay search for \"U-shaped screwdriver\" came up with the correct idea - not sure about size though.", "link": "https://www.l-camera-forum.com/topic/299836-vertical-alignment/?tab=comments#comment-3789666", "origin": "L-forum", "suborigin": "299836-vertical-alignment", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "more general use, but i can never remember the name of them. however an e-bay search for \"u-shaped screwdriver\" -----> came !!!  -----> up !!!  -----> with !!!  the correct idea - not sure about size though.", "sortedWord": "None", "Identifyer": null, "identifyer": 43083, "year": "2019"}, {"autor": "PCPix", "date": "2019-03-25 13:42:00", "content": "On 3/23/2019 at 9:08 AM, evikne said: Actually one of the \"laziest\" pictures I have ever taken. Ha - reminds me of a photojournalist friend in South Africa who was asked to come up with a story about the Transkei by his editor - knowing he was in CapeTown and would have to drive through the area on his way back... He shot all of the images from the driver’s seat, the editor loved the image set, had no idea he had been so ‘lazy’ - and the term ‘drive-by documentary ‘ was born...;-)", "link": "https://www.l-camera-forum.com/topic/292493-35mm-shots/page/6/?tab=comments#comment-3709126", "origin": "L-forum", "suborigin": "292493-35mm-shots", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 3/23/2019 at 9:08 am, evikne said: actually one of the \"laziest\" pictures i have ever taken. ha - reminds me of a photojournalist friend in south africa who was asked to -----> come !!!  -----> up !!!  -----> with !!!  a story about the transkei by his editor - knowing he was in capetown and would have to drive through the area on his way back... he shot all of the images from the driver’s seat, the editor loved the image set, had no idea he had been so ‘lazy’ - and the term ‘drive-by documentary ‘ was born...;-)", "sortedWord": "None", "Identifyer": null, "identifyer": 10603, "year": "2019"}, {"autor": "microview", "date": "2019-03-23 18:55:00", "content": "25 minutes ago, Photon42 said: The 50/1.2 unfortunately looks like it is going to be large. I am very satisfied with the 35/1.8S. Lovely lens. The two lenses are identical in size, the 50 I think +8gm or so, but negligible difference to the hand. (I have both – would opt for faster 35 optic if Nikon comes up with one.)", "link": "https://www.l-camera-forum.com/topic/288286-m-lens-to-nikon-z-mount-adapter/page/5/?tab=comments#comment-3707960", "origin": "L-forum", "suborigin": "288286-m-lens-to-nikon-z-mount-adapter", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "25 minutes ago, photon42 said: the 50/1.2 unfortunately looks like it is going to be large. i am very satisfied with the 35/1.8s. lovely lens. the two lenses are identical in size, the 50 i think +8gm or so, but negligible difference to the hand. (i have both – would opt for faster 35 optic if nikon -----> comes !!!  -----> up !!!  -----> with !!!  one.)", "sortedWord": "None", "Identifyer": null, "identifyer": 15579, "year": "2019"}, {"autor": "bianco", "date": "2019-01-01 11:41:00", "content": "i initially bought just the thumb support. after using the CL with just that during a 4 hour community event that i had to cover and i had the camera always ready on my hand, 2 hours on - i felt my hand cramping. eventually, i bought the handgrip for better comfort. and for the next event that i had to cover (still 4 hours), i got caught offguard needing to capture a moment when i was changing battery! the design flaw on the handgrip that i thought was bad hindered me from changing batteries fast. anyways, i just closed the battery door and shoved the handgrip in one of my pouches while i took the photos. after that, i put it back on. hope they come up with an updated version with a cutout/window for the battery/memory card door.", "link": "https://www.l-camera-forum.com/topic/292620-handgrip-cl-impressions-from-use/page/2/?tab=comments#comment-3656333", "origin": "L-forum", "suborigin": "292620-handgrip-cl-impressions-from-use", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i initially bought just the thumb support. after using the cl with just that during a 4 hour community event that i had to cover and i had the camera always ready on my hand, 2 hours on - i felt my hand cramping. eventually, i bought the handgrip for better comfort. and for the next event that i had to cover (still 4 hours), i got caught offguard needing to capture a moment when i was changing battery! the design flaw on the handgrip that i thought was bad hindered me from changing batteries fast. anyways, i just closed the battery door and shoved the handgrip in one of my pouches while i took the photos. after that, i put it back on. hope they -----> come !!!  -----> up !!!  -----> with !!!  an updated version -----> with !!!  a cutout/window for the battery/memory card door.", "sortedWord": "None", "Identifyer": null, "identifyer": 43240, "year": "2019"}, {"autor": "AlanYWM", "date": "2019-03-29 11:29:00", "content": "Personally, I prefer the size of the a7RIII to the S1R. Especially with M lenses. I tried the 21mm summilux on the S1R and I don't like what I see at the corners. When I use my M lenses, I prefer the setup up to be small. Also, the a7RIII had no problems with my R lenses. With the S1R, I had to compensate for the approximately 2/3 stop under exposure when using R lens. Maybe Panasonic will come up with a firmware upgrade to resolve this.", "link": "https://www.l-camera-forum.com/topic/305981-images-from-panasonic-cameras-merged/page/7/?tab=comments#comment-3711750", "origin": "L-forum", "suborigin": "305981-images-from-panasonic-cameras-merged", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "personally, i prefer the size of the a7riii to the s1r. especially with m lenses. i tried the 21mm summilux on the s1r and i don't like what i see at the corners. when i use my m lenses, i prefer the setup up to be small. also, the a7riii had no problems with my r lenses. with the s1r, i had to compensate for the approximately 2/3 stop under exposure when using r lens. maybe panasonic will -----> come !!!  -----> up !!!  -----> with !!!  a firmware upgrade to resolve this.", "sortedWord": "None", "Identifyer": null, "identifyer": 45844, "year": "2019"}, {"autor": "thighslapper", "date": "2019-07-16 07:40:00", "content": "Not sure I agree about the two first points about the Panasonic..... Noise is apparent at all ISO's on the S1R ...... but it is entirely dependent on the default settings of the Detail panel in LR ...... which has changed now LR has a dedicated profile for the S1R. Increasing sharpening accentuates this as the Detail setting in sharpening is too high for the 47mpx images ....... it needs to be 10 or less. Shadow recovery is much better than the SL at all ISO's in my experience ...... to the extent that although I bracketed very high dynamic range shots on a recent trip, I could process them from a single image 95% of the time. I presume the roving focus point is a result of the touch screen ..... I have mine deactivated by the lock lever as I rarely use it ... and it's only a thumb flick away. I converted to .dng initially as there was no LR profile and have continued with this as the file sizes are much smaller ..... and for the sake of consistency with all my other Leica images. It only adds a few minutes to importing the files. I delete the old RW2's. I'm becoming increasingly attached to this camera and Leica will have to come up with something special in the SL2 to get me to change .... 😟", "link": "https://www.l-camera-forum.com/topic/299320-a-two-weeks-trip-to-the-alps-with-sl-and-s1r/?tab=comments#comment-3779231", "origin": "L-forum", "suborigin": "299320-a-two-weeks-trip-to-the-alps-with-sl-and-s1r", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "not sure i agree about the two first points about the panasonic..... noise is apparent at all iso's on the s1r ...... but it is entirely dependent on the default settings of the detail panel in lr ...... which has changed now lr has a dedicated profile for the s1r. increasing sharpening accentuates this as the detail setting in sharpening is too high for the 47mpx images ....... it needs to be 10 or less. shadow recovery is much better than the sl at all iso's in my experience ...... to the extent that although i bracketed very high dynamic range shots on a recent trip, i could process them from a single image 95% of the time. i presume the roving focus point is a result of the touch screen ..... i have mine deactivated by the lock lever as i rarely use it ... and it's only a thumb flick away. i converted to .dng initially as there was no lr profile and have continued with this as the file sizes are much smaller ..... and for the sake of consistency with all my other leica images. it only adds a few minutes to importing the files. i delete the old rw2's. i'm becoming increasingly attached to this camera and leica will have to -----> come !!!  -----> up !!!  -----> with !!!  something special in the sl2 to get me to change .... 😟", "sortedWord": "None", "Identifyer": null, "identifyer": 50164, "year": "2019"}, {"autor": "michali", "date": "2019-05-29 20:18:00", "content": "On 5/28/2019 at 1:21 PM, jaapv said: Quite agree. Leica falls short on the long end - in all their systems. However, looking at vintage, I am convinced that the Vario-Elmar 105-280 R with converters will give better quality than the Canon albeit slightly shorter and Manual Focus. Thanks Jaap. I have both the Leica APO-Telyt R f4 280mm and the Leica 105-280mm R plus my old Carl Zeiss Apo T 300m f2.8 behemoth. They're all too cumbersome and heavy, I'm also quite a bit older from when I bought these lenses 20 or so years ago.... I picked up the Canon 400mm f5.6 L plus Canon MK3 1.4 x Tele Converter and the Sigma MC-21 adaptor this afternoon. The Canon lens weighs all of 1.2kg! Using my cats as models, the initial results are very pleasing. Some info worth noting: The Sigma MC-21 EF converter on the S1R is impressive -single point auto focus works really well & even with the Canon 1.4 xTC there’s no noticeable lag in auto focus. Full EXIF info is also transmitted. This combination will work until Leica comes up with a Tele Converter.... Best, Mike", "link": "https://www.l-camera-forum.com/topic/297648-panasonic-teleconverters-coming-soon/?tab=comments#comment-3750055", "origin": "L-forum", "suborigin": "297648-panasonic-teleconverters-coming-soon", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "on 5/28/2019 at 1:21 pm, jaapv said: quite agree. leica falls short on the long end - in all their systems. however, looking at vintage, i am convinced that the vario-elmar 105-280 r with converters will give better quality than the canon albeit slightly shorter and manual focus. thanks jaap. i have both the leica apo-telyt r f4 280mm and the leica 105-280mm r plus my old carl zeiss apo t 300m f2.8 behemoth. they're all too cumbersome and heavy, i'm also quite a bit older from when i bought these lenses 20 or so years ago.... i picked up the canon 400mm f5.6 l plus canon mk3 1.4 x tele converter and the sigma mc-21 adaptor this afternoon. the canon lens weighs all of 1.2kg! using my cats as models, the initial results are very pleasing. some info worth noting: the sigma mc-21 ef converter on the s1r is impressive -single point auto focus works really well & even with the canon 1.4 xtc there’s no noticeable lag in auto focus. full exif info is also transmitted. this combination will work until leica -----> comes !!!  -----> up !!!  -----> with !!!  a tele converter.... best, mike", "sortedWord": "None", "Identifyer": null, "identifyer": 50408, "year": "2019"}, {"autor": "Jeff S", "date": "2019-05-31 15:38:00", "content": "1 hour ago, ron777 said: Thanks, the link was informative and did provide a phone number that I had not been able to find. 800)211-7262 That’s also the first number that comes up with Google ‘Panasonic camera customer support’. Jeff", "link": "https://www.l-camera-forum.com/topic/297793-panasonic-mystical-customer-service/?tab=comments#comment-3751009", "origin": "L-forum", "suborigin": "297793-panasonic-mystical-customer-service", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "1 hour ago, ron777 said: thanks, the link was informative and did provide a phone number that i had not been able to find. 800)211-7262 that’s also the first number that -----> comes !!!  -----> up !!!  -----> with !!!  google ‘panasonic camera customer support’. jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 50443, "year": "2019"}, {"autor": "Chaemono", "date": "2019-04-07 05:33:00", "content": "The biggest and most significant difference that I can see so far without having checked yet for distortion, PF/CA, flare, etc. is how the lenses capture and deal with light. ISO is set to 100, aperture to f/1.4, and the scene is equally lighted. The camera is in A mode and meters, comes up with the exact same shutter speed. One lens leads to a better overall exposed image. The 50 Summilux-SL somehow 'bundles' the light where it's important while it protects the Highlights. This will matter in high contrast scenes because it basically means one can shoot the Leica lens at a faster shutter speed and still get Shadow detail while Highlights aren't blown. It's called dynamic range and it's the lens that contributes to it this time. The Lumix S 50/1.4 is no match for the 50 Summilux-SL in this regard, but hardly any 50 is. I will post more in high contrast situations. S1 + Lumix S 50/1.4 DNG file here: https://cc2032.zenfolio.com/img/g17788397-o750076470.dat?dl=2&tk=E6-TlQMwM71Iz-jTB_14klVb3qoXnXdVAuPzcvYg_sw= --img-- ISO 100 f/1.4 @1/6400 sec. opened in Preview and exported as untouched JPEG S1 + 50 Summilux-SL DNG file here: https://cc2032.zenfolio.com/img/g179726984-o750076470.dat?dl=2&tk=narQOMxDfDsYAGx0-yyvltYDQh5kWk6Ric4XVIXdabs= --img-- ISO 100 f/1.4 @1/6400 sec. opened in Preview and exported as untouched JPEG", "link": "https://www.l-camera-forum.com/topic/295559-no-one-with-hands-on-experience-with-new-pana-lenses/?tab=comments#comment-3717322", "origin": "L-forum", "suborigin": "295559-no-one-with-hands-on-experience-with-new-pana-lenses", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "the biggest and most significant difference that i can see so far without having checked yet for distortion, pf/ca, flare, etc. is how the lenses capture and deal with light. iso is set to 100, aperture to f/1.4, and the scene is equally lighted. the camera is in a mode and meters, -----> comes !!!  -----> up !!!  -----> with !!!  the exact same shutter speed. one lens leads to a better overall exposed image. the 50 summilux-sl somehow 'bundles' the light where it's important while it protects the highlights. this will matter in high contrast scenes because it basically means one can shoot the leica lens at a faster shutter speed and still get shadow detail while highlights aren't blown. it's called dynamic range and it's the lens that contributes to it this time. the lumix s 50/1.4 is no match for the 50 summilux-sl in this regard, but hardly any 50 is. i will post more in high contrast situations. s1 + lumix s 50/1.4 dng file here: https://cc2032.zenfolio.com/img/g17788397-o750076470.dat?dl=2&tk=e6-tlqmwm71iz-jtb_14klvb3qoxnxdvaupzcvyg_sw= --img-- iso 100 f/1.4 @1/6400 sec. opened in preview and exported as untouched jpeg s1 + 50 summilux-sl dng file here: https://cc2032.zenfolio.com/img/g179726984-o750076470.dat?dl=2&tk=narqomxdfdsyagx0-yyvltydqh5kwk6ric4xvixdabs= --img-- iso 100 f/1.4 @1/6400 sec. opened in preview and exported as untouched jpeg", "sortedWord": "None", "Identifyer": null, "identifyer": 50901, "year": "2019"}, {"autor": "jaapv", "date": "2019-02-04 15:14:00", "content": "That 70-200 is certainly interesting, but the focal length and design is clearly aimed at full frame. I'll wait and see what Sigma comes up with. It looks like a good alternative to the Leica offering, though.", "link": "https://www.l-camera-forum.com/topic/293985-three-lumix-s-l-mount-lenses/?tab=comments#comment-3678015", "origin": "L-forum", "suborigin": "293985-three-lumix-s-l-mount-lenses", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "that 70-200 is certainly interesting, but the focal length and design is clearly aimed at full frame. i'll wait and see what sigma -----> comes !!!  -----> up !!!  -----> with !!! . it looks like a good alternative to the leica offering, though.", "sortedWord": "None", "Identifyer": null, "identifyer": 51501, "year": "2019"}, {"autor": "can-photo", "date": "2019-03-10 20:54:00", "content": "--img-- Huge files! DNGs are about 80+MB and JPGs are 10+MB. So need to come up with a better workflow! However, it makes cropping possible! Edited March 10, 2019 by can-photo", "link": "https://www.l-camera-forum.com/topic/303026-leica-q2-images-post-them-here/?tab=comments#comment-3699907", "origin": "L-forum", "suborigin": "303026-leica-q2-images-post-them-here", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "--img-- huge files! dngs are about 80+mb and jpgs are 10+mb. so need to -----> come !!!  -----> up !!!  -----> with !!!  a better workflow! however, it makes cropping possible! edited march 10, 2019 by can-photo", "sortedWord": "None", "Identifyer": null, "identifyer": 52075, "year": "2019"}, {"autor": "Leica Guy", "date": "2019-03-12 14:05:00", "content": "On 3/10/2019 at 2:54 PM, can-photo said: --img-- Huge files! DNGs are about 80+MB and JPGs are 10+MB. So need to come up with a better workflow! However, it makes cropping possible! Read in the other big Q2 thread about lossless compression usibg Adobe plug in or LR “Update Metadata” to take 80MB down to 50MB. It works. --img--  Edited March 12, 2019 by iQ2 (formerly Infiniumguy)", "link": "https://www.l-camera-forum.com/topic/303026-leica-q2-images-post-them-here/?tab=comments#comment-3701061", "origin": "L-forum", "suborigin": "303026-leica-q2-images-post-them-here", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "on 3/10/2019 at 2:54 pm, can-photo said: --img-- huge files! dngs are about 80+mb and jpgs are 10+mb. so need to -----> come !!!  -----> up !!!  -----> with !!!  a better workflow! however, it makes cropping possible! read in the other big q2 thread about lossless compression usibg adobe plug in or lr “update metadata” to take 80mb down to 50mb. it works. --img--  edited march 12, 2019 by iq2 (formerly infiniumguy)", "sortedWord": "None", "Identifyer": null, "identifyer": 52085, "year": "2019"}, {"autor": "LucisPictor", "date": "2019-01-02 14:00:00", "content": "Leica does not really support the firmware of their \"compact\" cameras. The DLUX109 neither had firmware updates for years. Now, all hope is lost, since the new version is out. When I look at Fuji and their update policy. That's simply amazing! You sometimes get a new camera with an update. But then, Fuji is much bigger than Leica. I guess that Leica just doesn't have the manpower to improve firmware constantly. The come up with some nee software versions for theis system cameras. That's all we can expect, I'm afraid.", "link": "https://www.l-camera-forum.com/topic/292674-why-leica-x-typ-113-does-not-have-updated-firmware/?tab=comments#comment-3657096", "origin": "L-forum", "suborigin": "292674-why-leica-x-typ-113-does-not-have-updated-firmware", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "leica does not really support the firmware of their \"compact\" cameras. the dlux109 neither had firmware updates for years. now, all hope is lost, since the new version is out. when i look at fuji and their update policy. that's simply amazing! you sometimes get a new camera with an update. but then, fuji is much bigger than leica. i guess that leica just doesn't have the manpower to improve firmware constantly. the -----> come !!!  -----> up !!!  -----> with !!!  some nee software versions for theis system cameras. that's all we can expect, i'm afraid.", "sortedWord": "None", "Identifyer": null, "identifyer": 10639, "year": "2019"}, {"autor": "wlaidlaw", "date": "2019-03-29 08:47:00", "content": "5 hours ago, GRBrown said: Englewood Camera is in Englewood, Colorado, not Littlewood. When I searched under the seller name in Littlewood, CO, it came up with Englewood Camera, who also happened to be Leica Dealers, which I thought was too big a coincidence. Wilson", "link": "https://www.l-camera-forum.com/topic/294956-minolta-xd-7-seal-kit-for-r4-mot/?tab=comments#comment-3711676", "origin": "L-forum", "suborigin": "294956-minolta-xd-7-seal-kit-for-r4-mot", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "5 hours ago, grbrown said: englewood camera is in englewood, colorado, not littlewood. when i searched under the seller name in littlewood, co, it -----> came !!!  -----> up !!!  -----> with !!!  englewood camera, who also happened to be leica dealers, which i thought was too big a coincidence. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 22716, "year": "2019"}, {"autor": "alan.y", "date": "2019-06-20 20:03:00", "content": "Above all I'm just dumbfounded by the literal-mindedness of the video. It's almost insultingly childish. Every single motif, including the protagonist's photograph, is a combination of digital and analogue. Also note that the protagonist is called JACK GUY. Who the hell came up with this stuff? I don't believe Vieri meant to expressed \"disdain\" towards wealthy amateurs. His overall point, as I take it, is that one should be more thoughtful and deliberate about gear choice, which is salutary. Also for balance, one of the X2D promo videos below. It's nice to see a female professional photographer featured. Edited June 20, 2019 by alan.y", "link": "https://www.l-camera-forum.com/topic/297697-007-vs-hassy-x1-d/page/6/?tab=comments#comment-3763410", "origin": "L-forum", "suborigin": "297697-007-vs-hassy-x1-d", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "above all i'm just dumbfounded by the literal-mindedness of the video. it's almost insultingly childish. every single motif, including the protagonist's photograph, is a combination of digital and analogue. also note that the protagonist is called jack guy. who the hell -----> came !!!  -----> up !!!  -----> with !!!  this stuff? i don't believe vieri meant to expressed \"disdain\" towards wealthy amateurs. his overall point, as i take it, is that one should be more thoughtful and deliberate about gear choice, which is salutary. also for balance, one of the x2d promo videos below. it's nice to see a female professional photographer featured. edited june 20, 2019 by alan.y", "sortedWord": "None", "Identifyer": null, "identifyer": 26103, "year": "2019"}, {"autor": "Fedro", "date": "2019-06-20 20:19:00", "content": " 15 minutes ago, alan.y said: Above all I'm just dumbfounded by the literal-mindedness of the video. It's almost insultingly childish. Every single motif, including the protagonist's photograph, is a combination of digital and analogue. Also note that the protagonist is called JACK GUY. Who the hell came up with this stuff? I don't believe Vieri meant to expressed \"disdain\" towards wealthy amateurs. His overall point, as I take it, is that one should be more thoughtful and deliberate about gear choice, which is salutary. Also for balance, one of the X2D promo videos below. It's nice to see a female professional photographer featured. I totally agree with you, but have to say that Leica and Hasselblad are quite similar in terms of targets positioning for this kind of stuff \"Digital Body, Analog soul\" anyone?", "link": "https://www.l-camera-forum.com/topic/297697-007-vs-hassy-x1-d/page/7/?tab=comments#comment-3763425", "origin": "L-forum", "suborigin": "297697-007-vs-hassy-x1-d", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " 15 minutes ago, alan.y said: above all i'm just dumbfounded by the literal-mindedness of the video. it's almost insultingly childish. every single motif, including the protagonist's photograph, is a combination of digital and analogue. also note that the protagonist is called jack guy. who the hell -----> came !!!  -----> up !!!  -----> with !!!  this stuff? i don't believe vieri meant to expressed \"disdain\" towards wealthy amateurs. his overall point, as i take it, is that one should be more thoughtful and deliberate about gear choice, which is salutary. also for balance, one of the x2d promo videos below. it's nice to see a female professional photographer featured. i totally agree with you, but have to say that leica and hasselblad are quite similar in terms of targets positioning for this kind of stuff \"digital body, analog soul\" anyone?", "sortedWord": "None", "Identifyer": null, "identifyer": 26105, "year": "2019"}, {"autor": "Jan1985", "date": "2019-06-04 20:49:00", "content": "For me I just was curious about the question if they REALLY work on it or they skipped this product line to come up with the news in the next weeks... I am really excited about the S3 in general, especially the price tag 🙂", "link": "https://www.l-camera-forum.com/topic/293664-when-will-s3-be-available-merged/page/10/?tab=comments#comment-3753657", "origin": "L-forum", "suborigin": "293664-when-will-s3-be-available-merged", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "for me i just was curious about the question if they really work on it or they skipped this product line to -----> come !!!  -----> up !!!  -----> with !!!  the news in the next weeks... i am really excited about the s3 in general, especially the price tag 🙂", "sortedWord": "None", "Identifyer": null, "identifyer": 29011, "year": "2019"}, {"autor": "Stuart Richardson", "date": "2019-11-08 10:34:00", "content": "Agreed. The best 50mm I ever used in terms of look was the 50mm E60 Summilux R. It was a modern, but non-aspherical formulation. I am sure that it was not as sharp as the aspherical lenses, but it had absolutely beautiful rendering. I think most of the S lenses do have aspherical elements, but given the lack of any size restrictions and the state of Leica's optical prowess 10 years ago, they came up with lenses that are incredibly balanced...extremely sharp and low in aberrations, while also being exceptionally pleasing of character. I think part of this is from the format as well...being slightly longer than 35mm gives the advantage of less depth of field, but not so much so that it is a struggle to get everything in focus if that is the composition you are after...", "link": "https://www.l-camera-forum.com/topic/303261-can-the-new-sl-compete-or-even-sostitute-in-some-fields-the-s/?tab=comments#comment-3850537", "origin": "L-forum", "suborigin": "303261-can-the-new-sl-compete-or-even-sostitute-in-some-fields-the-s", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "agreed. the best 50mm i ever used in terms of look was the 50mm e60 summilux r. it was a modern, but non-aspherical formulation. i am sure that it was not as sharp as the aspherical lenses, but it had absolutely beautiful rendering. i think most of the s lenses do have aspherical elements, but given the lack of any size restrictions and the state of leica's optical prowess 10 years ago, they -----> came !!!  -----> up !!!  -----> with !!!  lenses that are incredibly balanced...extremely sharp and low in aberrations, while also being exceptionally pleasing of character. i think part of this is from the format as well...being slightly longer than 35mm gives the advantage of less depth of field, but not so much so that it is a struggle to get everything in focus if that is the composition you are after...", "sortedWord": "None", "Identifyer": null, "identifyer": 29417, "year": "2019"}, {"autor": "davidmknoble", "date": "2019-12-03 18:51:00", "content": "This is an interesting discussion and several suggestions have been made of the Leica model that is the 'flagship.' I would propose this: Leica has tried to develop a 'flagship' brand. By that I mean they have tried to become the best of each type of camera. Sure, it was simpler when it was only 35mm film - and each successive body type had a different market and different user. If you look at the most reliable mechanically, you would probably come up with something like: Leica IIIC, Leica M3, Leica MP. Then there were the unique: Leica M2R, Leica MD and others. Finally there were some that were more affordable: Leica M2, M4 and M6. (don't critique me too much here - I did this off the cuff to show a point). So, today we have the Leica M series which is advertised as the most compact 35mm, full frame (and full frame film) body because of the rangefinder (mirrorless) and with the highest quality images in the smallest possible packages (i.e., small lenses with great image quality). Then, we have the SL market with mirrorless that has provided some new outstanding primes, small, same filter size and incredible images and focusing speed compared to other lenses. Leica opened up the mount and so there are others in the market, but probably some 'flagship' lenses at least. Finally, we have the S series which is clearly a 'flagship' in the medium format market. The image quality of the S has been incredible since the first model and the lenses have not only great optical quality, but also larger f/stops (smaller numbers) than the other manufacturers. Focus speed and motors were not the focus, (no pun intended) because the medium format was not geared towards sporting events and documentary work. Also, the S lenses have this central shutter concept which is perfect for studio lighting. While other brands have that too, Leica built it in their high quality lenses to ensure all medium format users might find the lenses they need. The Leica Q falls somewhere between the M and SL I think, but the other Leica models - Dlux, Clux, V, X, and to some extent the CL are branches into reasonable camera systems, but not nearly as competitive as other brands. In summary, I think we have 3 (maybe 4) 'flagship' models of cameras with Leica - all for different purposes, but stellar in their field. So, the M for documentary, travel, small size, the SL for fast autofocus and multiple lens attachments (M, S, Nikon, Canon) and the S with incredible medium format capabilities and brighter lenses to focus with (2, 2.5 and 2.8 apertures). That is why I believe the S3 will come and will be great when it does. Leica has typically delayed the S in order to fine tune the sensor output. The SL and the now seen M10-monochrom use very similar sensor size and pixel density. The S has the same density, but a larger size - but the S is known for images that need very little touchup to use, if exposed under proper lighting. Sorry for rambling, does anyone think this makes sense or have I gone off the deep end?", "link": "https://www.l-camera-forum.com/topic/303929-leica-flagship-camera/page/2/?tab=comments#comment-3866748", "origin": "L-forum", "suborigin": "303929-leica-flagship-camera", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "this is an interesting discussion and several suggestions have been made of the leica model that is the 'flagship.' i would propose this: leica has tried to develop a 'flagship' brand. by that i mean they have tried to become the best of each type of camera. sure, it was simpler when it was only 35mm film - and each successive body type had a different market and different user. if you look at the most reliable mechanically, you would probably -----> come !!!  -----> up !!!  -----> with !!!  something like: leica iiic, leica m3, leica mp. then there were the unique: leica m2r, leica md and others. finally there were some that were more affordable: leica m2, m4 and m6. (don't critique me too much here - i did this off the cuff to show a point). so, today we have the leica m series which is advertised as the most compact 35mm, full frame (and full frame film) body because of the rangefinder (mirrorless) and with the highest quality images in the smallest possible packages (i.e., small lenses with great image quality). then, we have the sl market with mirrorless that has provided some new outstanding primes, small, same filter size and incredible images and focusing speed compared to other lenses. leica opened up the mount and so there are others in the market, but probably some 'flagship' lenses at least. finally, we have the s series which is clearly a 'flagship' in the medium format market. the image quality of the s has been incredible since the first model and the lenses have not only great optical quality, but also larger f/stops (smaller numbers) than the other manufacturers. focus speed and motors were not the focus, (no pun intended) because the medium format was not geared towards sporting events and documentary work. also, the s lenses have this central shutter concept which is perfect for studio lighting. while other brands have that too, leica built it in their high quality lenses to ensure all medium format users might find the lenses they need. the leica q falls somewhere between the m and sl i think, but the other leica models - dlux, clux, v, x, and to some extent the cl are branches into reasonable camera systems, but not nearly as competitive as other brands. in summary, i think we have 3 (maybe 4) 'flagship' models of cameras with leica - all for different purposes, but stellar in their field. so, the m for documentary, travel, small size, the sl for fast autofocus and multiple lens attachments (m, s, nikon, canon) and the s with incredible medium format capabilities and brighter lenses to focus with (2, 2.5 and 2.8 apertures). that is why i believe the s3 will come and will be great when it does. leica has typically delayed the s in order to fine tune the sensor output. the sl and the now seen m10-monochrom use very similar sensor size and pixel density. the s has the same density, but a larger size - but the s is known for images that need very little touchup to use, if exposed under proper lighting. sorry for rambling, does anyone think this makes sense or have i gone off the deep end?", "sortedWord": "None", "Identifyer": null, "identifyer": 29743, "year": "2019"}, {"autor": "Stuart Richardson", "date": "2019-05-09 11:03:00", "content": "It certainly does not feel like a vibrant camera system these days...still, I look forward to seeing what they come up with. I hope they sort out whatever issues the camera may have and that we see it on the market soon. The longer it takes, the more compelling options show up on the scene, and consequently the harder case it is to make to pay as much as they will likely demand. I am still very interested in the camera, but I agree that Leica's policy of utter silence around their future plans is really not serving them well here. While I understand their idea that they have fleshed out the system enough for most needs, I think they miss how important little details can be in making people feel like a system is being supported. For example, even though there has not been a lens in years, if they had released something...anything in that time, it would feel less dire. What about an extension tube or bellows or tele-converter....anything would make it look like they are at least thinking about the S system. As it is now, the last lens released was in the summer of 2014...five years ago. I am not aware of any major accessories since then other than the S adapter L. That is ages and ages ago in camera terms.", "link": "https://www.l-camera-forum.com/topic/294962-s007-now-or-s3-later/page/6/?tab=comments#comment-3737495", "origin": "L-forum", "suborigin": "294962-s007-now-or-s3-later", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "it certainly does not feel like a vibrant camera system these days...still, i look forward to seeing what they -----> come !!!  -----> up !!!  -----> with !!! . i hope they sort out whatever issues the camera may have and that we see it on the market soon. the longer it takes, the more compelling options show up on the scene, and consequently the harder case it is to make to pay as much as they will likely demand. i am still very interested in the camera, but i agree that leica's policy of utter silence around their future plans is really not serving them well here. while i understand their idea that they have fleshed out the system enough for most needs, i think they miss how important little details can be in making people feel like a system is being supported. for example, even though there has not been a lens in years, if they had released something...anything in that time, it would feel less dire. what about an extension tube or bellows or tele-converter....anything would make it look like they are at least thinking about the s system. as it is now, the last lens released was in the summer of 2014...five years ago. i am not aware of any major accessories since then other than the s adapter l. that is ages and ages ago in camera terms.", "sortedWord": "None", "Identifyer": null, "identifyer": 30783, "year": "2019"}, {"autor": "Jan1985", "date": "2019-05-09 11:14:00", "content": "vor 4 Minuten schrieb Stuart Richardson: It certainly does not feel like a vibrant camera system these days...still, I look forward to seeing what they come up with. I hope they sort out whatever issues the camera may have and that we see it on the market soon. The longer it takes, the more compelling options show up on the scene, and consequently the harder case it is to make to pay as much as they will likely demand. I am still very interested in the camera, but I agree that Leica's policy of utter silence around their future plans is really not serving them well here. While I understand their idea that they have fleshed out the system enough for most needs, I think they miss how important little details can be in making people feel like a system is being supported. For example, even though there has not been a lens in years, if they had released something...anything in that time, it would feel less dire. What about an extension tube or bellows or tele-converter....anything would make it look like they are at least thinking about the S system. As it is now, the last lens released was in the summer of 2014...five years ago. I am not aware of any major accessories since then other than the S adapter L. That is ages and ages ago in camera terms. It always seems that Leica is immunized against all dynamics that market dictates the manufacturers. Some call this arrogance or a missing sense for reality. Do they consciously prepare the graveyard for the S Line? You are right. If they REALLY would invest in this system they had been released new lenses. Look at other manufactures. They come up with new lens design every year. I know Leica is another league and philosophy. But in the other lineups they invested a lot in development. What I love about the S is that this distinctive special look the lenses produce. You know what I mean? Even that are \"only\" 38MPX. They render so nicely. But I guess there is not much difference to FF system today... or?", "link": "https://www.l-camera-forum.com/topic/294962-s007-now-or-s3-later/page/6/?tab=comments#comment-3737502", "origin": "L-forum", "suborigin": "294962-s007-now-or-s3-later", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "vor 4 minuten schrieb stuart richardson: it certainly does not feel like a vibrant camera system these days...still, i look forward to seeing what they -----> come !!!  -----> up !!!  -----> with !!! . i hope they sort out whatever issues the camera may have and that we see it on the market soon. the longer it takes, the more compelling options show up on the scene, and consequently the harder case it is to make to pay as much as they will likely demand. i am still very interested in the camera, but i agree that leica's policy of utter silence around their future plans is really not serving them well here. while i understand their idea that they have fleshed out the system enough for most needs, i think they miss how important little details can be in making people feel like a system is being supported. for example, even though there has not been a lens in years, if they had released something...anything in that time, it would feel less dire. what about an extension tube or bellows or tele-converter....anything would make it look like they are at least thinking about the s system. as it is now, the last lens released was in the summer of 2014...five years ago. i am not aware of any major accessories since then other than the s adapter l. that is ages and ages ago in camera terms. it always seems that leica is immunized against all dynamics that market dictates the manufacturers. some call this arrogance or a missing sense for reality. do they consciously prepare the graveyard for the s line? you are right. if they really would invest in this system they had been released new lenses. look at other manufactures. they come up with new lens design every year. i know leica is another league and philosophy. but in the other lineups they invested a lot in development. what i love about the s is that this distinctive special look the lenses produce. you know what i mean? even that are \"only\" 38mpx. they render so nicely. but i guess there is not much difference to ff system today... or?", "sortedWord": "None", "Identifyer": null, "identifyer": 30784, "year": "2019"}, {"autor": "BernardC", "date": "2019-05-09 14:03:00", "content": "2 hours ago, Jan1985 said: Look at other manufactures. They come up with new lens design every year. I know Leica is another league and philosophy. But in the other lineups they invested a lot in development. That's true of consumer cameras, but it's hardly been true of medium format over the years. It's a different mindset. People who spend 'medium format money' don't appreciate seeing their equipment made obsolete every few years. I know that Fuji and Hasselblad have been very busy of late, but their systems are completely new. The S system had lots of announcements when it was new too. We can only hope that they do not imitate Sony and release 8 different versions of their standard zoom in 5 years.", "link": "https://www.l-camera-forum.com/topic/294962-s007-now-or-s3-later/page/7/?tab=comments#comment-3737608", "origin": "L-forum", "suborigin": "294962-s007-now-or-s3-later", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "2 hours ago, jan1985 said: look at other manufactures. they -----> come !!!  -----> up !!!  -----> with !!!  new lens design every year. i know leica is another league and philosophy. but in the other lineups they invested a lot in development. that's true of consumer cameras, but it's hardly been true of medium format over the years. it's a different mindset. people who spend 'medium format money' don't appreciate seeing their equipment made obsolete every few years. i know that fuji and hasselblad have been very busy of late, but their systems are completely new. the s system had lots of announcements when it was new too. we can only hope that they do not imitate sony and release 8 different versions of their standard zoom in 5 years.", "sortedWord": "None", "Identifyer": null, "identifyer": 30787, "year": "2019"}, {"autor": "Photon42", "date": "2019-04-03 16:14:00", "content": "5 hours ago, BerkMillers said: Coming from the M system now my new Fuji GFX 50R puts a smile on my face every time i pick it up. Always wanted to test digital MF and I´m thankful that Fuji made the step to introduce an affordable system to the market. I have never even considered about purchasing a digital (used) S with its ridiculous high prices. Coming from M system I´m aware of the premium you have to pay, and I´m no more willing to do so... ok, each to his own, but for me Fuji is the way to go. So we are are all happy campers 😎 Used S cameras are not much more expensive than new Fujis MF. But I guess we are leaving the topic slightly. I congratulate Fuji for its move. Bold one when it happened and reasonable from the perspective of an APS-C offering. Of course the price point is important. When Leica came out with the S2, they were competitive more or less with the existing players Hasselblad and P1. Now the situation is somewhat different with new contenders (X1D, Fuji, Pentax) and they seem to move into a place where they are with the SL and M. However a lot of people always check other systems just because the next technology incarnation of their existing one does not answer some challenges the competitors come up with. This no matter how well the present systems works. That was my point. My entry ticket to MF was mostly likely cheaper than yours, btw.", "link": "https://www.l-camera-forum.com/topic/295658-the-mf-market-and-fujifilm/page/2/?tab=comments#comment-3714946", "origin": "L-forum", "suborigin": "295658-the-mf-market-and-fujifilm", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "5 hours ago, berkmillers said: coming from the m system now my new fuji gfx 50r puts a smile on my face every time i pick it up. always wanted to test digital mf and i´m thankful that fuji made the step to introduce an affordable system to the market. i have never even considered about purchasing a digital (used) s with its ridiculous high prices. coming from m system i´m aware of the premium you have to pay, and i´m no more willing to do so... ok, each to his own, but for me fuji is the way to go. so we are are all happy campers 😎 used s cameras are not much more expensive than new fujis mf. but i guess we are leaving the topic slightly. i congratulate fuji for its move. bold one when it happened and reasonable from the perspective of an aps-c offering. of course the price point is important. when leica came out with the s2, they were competitive more or less with the existing players hasselblad and p1. now the situation is somewhat different -----> with !!!  new contenders (x1d, fuji, pentax) and they seem to move into a place where they are -----> with !!!  the sl and m. however a lot of people always check other systems just because the next technology incarnation of their existing one does not answer some challenges the competitors -----> come !!!  -----> up !!!  -----> with !!! . this no matter how well the present systems works. that was my point. my entry ticket to mf was mostly likely cheaper than yours, btw.", "sortedWord": "None", "Identifyer": null, "identifyer": 30996, "year": "2019"}, {"autor": "xiaubauu2009", "date": "2019-04-04 02:31:00", "content": "10 hours ago, Photon42 said: So we are are all happy campers 😎 Used S cameras are not much more expensive than new Fujis MF. But I guess we are leaving the topic slightly. I congratulate Fuji for its move. Bold one when it happened and reasonable from the perspective of an APS-C offering. Of course the price point is important. Whe﻿n Leica came out with the S2, they were competitive more or less with the existing players Hasselblad and P1. Now the situation is somewhat different﻿ with new contenders (X1D, Fuji, Pentax) and they seem to move into a place where they are with the SL and M.﻿ However a lot of people always check other systems just because the next technology incarnation of their existing one does not answer some challenges the competitors come up with. This no matter how well the present systems works. That was my point. ﻿ My entry ticket to MF was mostly likely cheaper than yours, btw. I don't think it's matter of just answering what the competition is doing, S has a problem even standing on its own. And don't think we need to revisit it. At the time of S introduction to the market, the 'cheap' option for the MF market is the Pentax 645D, and to be honest, their optics is nowhere near as capable as the S glass and Leica do have such appeal compare to PhaseOne in terms of IQ if you don't consider adapting those digital back to a tech cam. (Since P1 was just basically rebadging some mamiya 645 lens, the IQ is hit and miss). It was a good time for S I guess, you can even call it revolutionary. Somehow, they remain static for 10 years, and see what this lead them... (Static only compare to the market) Also, I don't think S should be considered or viewed like the M, M is a unique one of a kind experience that nobody else is doing. Hence it can afford to be 'out of sync'. S... on the other hand... is a MF, with SLR design, promising to deliver uncompromising IQ, and rugged reliability... quite a few product appear in the market with these quality and even small company like P1 manage to dig itself out from the hole with the XF and the new blue ring monster lens while some company like Hassy manage to dig itself back into the oblivion with their closed system digital back and the half ass X1D. Anyway, not that important now as S is kind of affordable in MF terms second hand and people buy it to get the Leica color science or just to fulfill a desire to owned the most expensive Leica equipment. Edited April 4, 2019 by xiaubauu2009", "link": "https://www.l-camera-forum.com/topic/295658-the-mf-market-and-fujifilm/page/2/?tab=comments#comment-3715239", "origin": "L-forum", "suborigin": "295658-the-mf-market-and-fujifilm", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "10 hours ago, photon42 said: so we are are all happy campers 😎 used s cameras are not much more expensive than new fujis mf. but i guess we are leaving the topic slightly. i congratulate fuji for its move. bold one when it happened and reasonable from the perspective of an aps-c offering. of course the price point is important. whe﻿n leica came out with the s2, they were competitive more or less with the existing players hasselblad and p1. now the situation is somewhat different﻿ -----> with !!!  new contenders (x1d, fuji, pentax) and they seem to move into a place where they are -----> with !!!  the sl and m.﻿ however a lot of people always check other systems just because the next technology incarnation of their existing one does not answer some challenges the competitors -----> come !!!  -----> up !!!  -----> with !!! . this no matter how well the present systems works. that was my point. ﻿ my entry ticket to mf was mostly likely cheaper than yours, btw. i don't think it's matter of just answering what the competition is doing, s has a problem even standing on its own. and don't think we need to revisit it. at the time of s introduction to the market, the 'cheap' option for the mf market is the pentax 645d, and to be honest, their optics is nowhere near as capable as the s glass and leica do have such appeal compare to phaseone in terms of iq if you don't consider adapting those digital back to a tech cam. (since p1 was just basically rebadging some mamiya 645 lens, the iq is hit and miss). it was a good time for s i guess, you can even call it revolutionary. somehow, they remain static for 10 years, and see what this lead them... (static only compare to the market) also, i don't think s should be considered or viewed like the m, m is a unique one of a kind experience that nobody else is doing. hence it can afford to be 'out of sync'. s... on the other hand... is a mf, with slr design, promising to deliver uncompromising iq, and rugged reliability... quite a few product appear in the market with these quality and even small company like p1 manage to dig itself out from the hole with the xf and the new blue ring monster lens while some company like hassy manage to dig itself back into the oblivion with their closed system digital back and the half ass x1d. anyway, not that important now as s is kind of affordable in mf terms second hand and people buy it to get the leica color science or just to fulfill a desire to owned the most expensive leica equipment. edited april 4, 2019 by xiaubauu2009", "sortedWord": "None", "Identifyer": null, "identifyer": 30998, "year": "2019"}, {"autor": "pridbor", "date": "2019-02-14 16:39:00", "content": "How about an adapter like this? I noticed on your Photo that the Slide guides were attached with screws, so I came up with the idea of creating a new \"plate\" with a smaller opening for the Slide and new screw holes for attachment of the plate and original slide guides. Now I just need to find out where I can get it cut out and find the small kind of screws etc ... Does anyone know a source of such small screws? --img--  Edited February 14, 2019 by pridbor", "link": "https://www.l-camera-forum.com/topic/293639-leitz-device-but-what-is-it/?tab=comments#comment-3684324", "origin": "L-forum", "suborigin": "293639-leitz-device-but-what-is-it", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "how about an adapter like this? i noticed on your photo that the slide guides were attached -----> with !!!  screws, so i -----> came !!!  -----> up !!!  -----> with !!!  the idea of creating a new \"plate\" -----> with !!!  a smaller opening for the slide and new screw holes for attachment of the plate and original slide guides. now i just need to find out where i can get it cut out and find the small kind of screws etc ... does anyone know a source of such small screws? --img--  edited february 14, 2019 by pridbor", "sortedWord": "None", "Identifyer": null, "identifyer": 88456, "year": "2019"}, {"autor": "chrism", "date": "2019-08-02 19:11:00", "content": "From my source: Quote I'm sorry for the major delay and appreciate you being patient. The software team has confirmed that for the time being, we will not be adding support via VueScan or any other third party application. Someone else has asked about making FlexColor open source so that end users can maintain and update it. But our team has confirmed that this isn't possible due to restrictions on some of the source code and the restructuring required. In addition to that, the source code is not useful for a 64 bit system because as you know, all the UI code is strongly tied to a 32 bit only framework. If anything changes with this, I will let you know. To which I replied: Quote Thanks for getting back to me. I can't imagine why the software team would say that. Essentially they are say the scanner is doomed and we won't let anyone rescue it. I wonder if they are familiar with the fable of Æsop about the dog in the manger? Frankly it seems there is something rotten about this whole business. I have seen two monthly Hasselblad newsletters come out that still say nothing about the discontinuation of the Flextight line. It looks like a company trying to sell off remaining stock to unsuspecting customers, who will buy an expensive item with no idea it has been orphaned. It stinks. I suspect Victor Hasselblad would be disgusted. There is NO reason to prevent someone else making these scanners useable in the future. It won't cost Hasselblad a penny. Selling brand new scanners to customers who have not been told they are discontinued and the software is about to become useless will expose the company to lawsuits, and rightly so. This reeks of short-term bean-counters making decisions that may maximise profit for a quarter or two, but cause a huge loss of respect for the brand shortly after that. It makes me want to pick them up and shake them! I'm sorry you have to work for such idiots. By all means pass this e-mail on to everyone in the company so they may know how angry I am with them. At this point I may as well sell my X1 and manage as best I can with an old Nikon 9000 (also discontinued but still supported by VueScan and by Silverfast). It's a disgrace. Now let me add that I am in no way cross with you personally. You have been a great help to me and you deserve to work for a more honest company than Hasselbald seems to be at present. My leukemia is sliding into relapse and there will be some more chemo shortly. Currently laid up with shingles in the worst part of the body imaginable. I can stand up to take some photos, and even to develop the film, but I can't sit down at the scanner to digitise them! If I could, I'd throw the bloody scanner at the software team, and I wish you'd tell them so! I don't know if we'll have occasion to talk again, but if not I wish you all the best for the future. If they change their mind please tell me about it. I've gone out on a limb promising the author of VueScan all sorts of support from users if he gets the necessary engineering details and comes up with working software. It's not just current owners being let down, but all those buying new scanners with no idea that they are buying a discontinued product, and then again, anyone who might develop software to keep them functional. Pretty hard to defend against a lawsuit where the plaintiff's case is that \"You sold me a $25,000 scanner without telling me it was about to become useless.\" Maybe Hasselblad have no lawyers on staff. Oh, well, I hope it works out for those to whom it will matter in the longer term. I shan't have to worry about that - I have bought up five old Macintoshes to keep the scanner going. I daresay I won't outlive the first of them. Not my problem after that! And the reply: Quote I'm sorry that it's taken me a while to reply. I sent your email to my direct manager and few other managers. I have hope that they will pass it on to the decision makers of the company, but I'm sure you already know not to expect any changes on this subject. I want to let you know that I appreciate your response and thoughtfulness. I have been given a few reasons for the inability to move forward with FlexColor and with a third party, some of which I have shared with you. They are logical reasons, but I still think that we should still try. Even though the current 10.14 OS can be used, and an older computer can be dedicated to scanning, I think we should put forth more effort with this. So it looks like Hasselblad has dumped us. No support from them, and no possibility of letting anyone else support the scanners. And I thought Swedes were reasonable and honest people...", "link": "https://www.l-camera-forum.com/topic/297786-hasselblad-imacon-flextight-scanners-discontinued/page/2/?tab=comments#comment-3790095", "origin": "L-forum", "suborigin": "297786-hasselblad-imacon-flextight-scanners-discontinued", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "from my source: quote i'm sorry for the major delay and appreciate you being patient. the software team has confirmed that for the time being, we will not be adding support via vuescan or any other third party application. someone else has asked about making flexcolor open source so that end users can maintain and update it. but our team has confirmed that this isn't possible due to restrictions on some of the source code and the restructuring required. in addition to that, the source code is not useful for a 64 bit system because as you know, all the ui code is strongly tied to a 32 bit only framework. if anything changes with this, i will let you know. to which i replied: quote thanks for getting back to me. i can't imagine why the software team would say that. essentially they are say the scanner is doomed and we won't let anyone rescue it. i wonder if they are familiar with the fable of æsop about the dog in the manger? frankly it seems there is something rotten about this whole business. i have seen two monthly hasselblad newsletters come out that still say nothing about the discontinuation of the flextight line. it looks like a company trying to sell off remaining stock to unsuspecting customers, who will buy an expensive item with no idea it has been orphaned. it stinks. i suspect victor hasselblad would be disgusted. there is no reason to prevent someone else making these scanners useable in the future. it won't cost hasselblad a penny. selling brand new scanners to customers who have not been told they are discontinued and the software is about to become useless will expose the company to lawsuits, and rightly so. this reeks of short-term bean-counters making decisions that may maximise profit for a quarter or two, but cause a huge loss of respect for the brand shortly after that. it makes me want to pick them up and shake them! i'm sorry you have to work for such idiots. by all means pass this e-mail on to everyone in the company so they may know how angry i am with them. at this point i may as well sell my x1 and manage as best i can with an old nikon 9000 (also discontinued but still supported by vuescan and by silverfast). it's a disgrace. now let me add that i am in no way cross with you personally. you have been a great help to me and you deserve to work for a more honest company than hasselbald seems to be at present. my leukemia is sliding into relapse and there will be some more chemo shortly. currently laid up with shingles in the worst part of the body imaginable. i can stand up to take some photos, and even to develop the film, but i can't sit down at the scanner to digitise them! if i could, i'd throw the bloody scanner at the software team, and i wish you'd tell them so! i don't know if we'll have occasion to talk again, but if not i wish you all the best for the future. if they change their mind please tell me about it. i've gone out on a limb promising the author of vuescan all sorts of support from users if he gets the necessary engineering details and -----> comes !!!  -----> up !!!  -----> with !!!  working software. it's not just current owners being let down, but all those buying new scanners with no idea that they are buying a discontinued product, and then again, anyone who might develop software to keep them functional. pretty hard to defend against a lawsuit where the plaintiff's case is that \"you sold me a $25,000 scanner without telling me it was about to become useless.\" maybe hasselblad have no lawyers on staff. oh, well, i hope it works out for those to whom it will matter in the longer term. i shan't have to worry about that - i have bought up five old macintoshes to keep the scanner going. i daresay i won't outlive the first of them. not my problem after that! and the reply: quote i'm sorry that it's taken me a while to reply. i sent your email to my direct manager and few other managers. i have hope that they will pass it on to the decision makers of the company, but i'm sure you already know not to expect any changes on this subject. i want to let you know that i appreciate your response and thoughtfulness. i have been given a few reasons for the inability to move forward with flexcolor and with a third party, some of which i have shared with you. they are logical reasons, but i still think that we should still try. even though the current 10.14 os can be used, and an older computer can be dedicated to scanning, i think we should put forth more effort with this. so it looks like hasselblad has dumped us. no support from them, and no possibility of letting anyone else support the scanners. and i thought swedes were reasonable and honest people...", "sortedWord": "None", "Identifyer": null, "identifyer": 99982, "year": "2019"}, {"autor": "logan2z", "date": "2019-01-06 21:34:00", "content": " Not sure if anyone here is currently using the Analyzer Pro, but I finally got around to performing a calibration and am wondering if my exposure compensation results make sense. I calibrated for Ilford Multigrade Fiber Classic and ended up with positive exposure offsets for all filter grades. This is a bit unexpected since the Analyzer is calibrated for Ilford MG IV RC paper and, given the data sheet for both papers, MG IV RC is a slower paper than the Fiber Classic. I would think that would lead to negative exposure offsets rather than positive ones. I realize there are lots of variables at play here but I invested a significant time in the calibration procedure and want to make sure the data I came up with is reasonably accurate. I haven't gotten around to making a print since performing the calibration so perhaps all is fine, just wanted to see if others have had a similar experience when calibrating for this paper.", "link": "https://www.l-camera-forum.com/topic/293015-rh-designs-analyzer-pro-calibration-question/?tab=comments#comment-3659894", "origin": "L-forum", "suborigin": "293015-rh-designs-analyzer-pro-calibration-question", "result": true, "Selector": "came up with", "selectorShort": "with", "MarkedSent": " not sure if anyone here is currently using the analyzer pro, but i finally got around to performing a calibration and am wondering if my exposure compensation results make sense. i calibrated for ilford multigrade fiber classic and ended up with positive exposure offsets for all filter grades. this is a bit unexpected since the analyzer is calibrated for ilford mg iv rc paper and, given the data sheet for both papers, mg iv rc is a slower paper than the fiber classic. i would think that would lead to negative exposure offsets rather than positive ones. i realize there are lots of variables at play here but i invested a significant time in the calibration procedure and want to make sure the data i -----> came !!!  -----> up !!!  -----> with !!!  is reasonably accurate. i haven't gotten around to making a print since performing the calibration so perhaps all is fine, just wanted to see if others have had a similar experience when calibrating for this paper.", "sortedWord": "None", "Identifyer": null, "identifyer": 104959, "year": "2019"}, {"autor": "kinross", "date": "2019-04-15 09:01:00", "content": "Thanks for link. Seems straightforward. Will give trial version a go with converter and see how I get on. Jeff, I am using LR 6 OK with 006 although it does not seem to appear in any support list For LR I can find. I have tried ON 1. Found it good but unable to process TIFF files exported from it in Image Print Black. Would not load on to working page. Flageed it up with ON support but they are unable to come up with a work around. Mike.", "link": "https://www.l-camera-forum.com/topic/296188-do-photo-lab/?tab=comments#comment-3722731", "origin": "L-forum", "suborigin": "296188-do-photo-lab", "result": true, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "thanks for link. seems straightforward. will give trial version a go with converter and see how i get on. jeff, i am using lr 6 ok with 006 although it does not seem to appear in any support list for lr i can find. i have tried on 1. found it good but unable to process tiff files exported from it in image print black. would not load on to working page. flageed it -----> up !!!  -----> with !!!  on support but they are unable to -----> come !!!  -----> up !!!  -----> with !!!  a work around. mike.", "sortedWord": "None", "Identifyer": null, "identifyer": 113445, "year": "2019"}, {"autor": "Dirk Mandeville", "date": "2019-01-15 00:11:00", "content": "I have to agree with this request. Haven’t been on the forum in awhile and the new format caught me by surprise. How do you filter out the posts written in German/English if you aren’t fluent in the particular language? For that matter, how do you follow certain sub forums but not others and have only the ones you follow show up under “unread content”? I could do that on the old forum software, but can’t figure out how with this new software. It’s either not possible or not intuitive. Is there a faq or wiki for the new software somewhere? I have yet to find it. Edit: found the faq, but it isn’t helping me. Says to click on “view new content” in the upper right hand corner of the page for a drop-down menu, which will allow you to filter by forum. But there is no “view new content” button anywhere on the page. The “unread content” link comes up with a filter, but doesn’t allow me to choose which forums I want to follow. Very non-user friendly. Edited January 15, 2019 by Dirk Mandeville", "link": "https://www.l-camera-forum.com/topic/293167-just-how-difficult-to-separate-german-english/?tab=comments#comment-3664687", "origin": "L-forum", "suborigin": "293167-just-how-difficult-to-separate-german-english", "result": true, "Selector": "comes up with", "selectorShort": "with", "MarkedSent": "i have to agree with this request. haven’t been on the forum in awhile and the new format caught me by surprise. how do you filter out the posts written in german/english if you aren’t fluent in the particular language? for that matter, how do you follow certain sub forums but not others and have only the ones you follow show up under “unread content”? i could do that on the old forum software, but can’t figure out how with this new software. it’s either not possible or not intuitive. is there a faq or wiki for the new software somewhere? i have yet to find it. edit: found the faq, but it isn’t helping me. says to click on “view new content” in the upper right hand corner of the page for a drop-down menu, which will allow you to filter by forum. but there is no “view new content” button anywhere on the page. the “unread content” link -----> comes !!!  -----> up !!!  -----> with !!!  a filter, but doesn’t allow me to choose which forums i want to follow. very non-user friendly. edited january 15, 2019 by dirk mandeville", "sortedWord": "None", "Identifyer": null, "identifyer": 114251, "year": "2019"}, {"autor": "AlanYWM", "date": "2019-04-09 17:49:00", "content": "1 hour ago, michali said: My point is that there appear to be issues with shutter vibrations on some mirrorless cameras, which I never encountered with DSLRs. As an example, this image is shot hand held with my old Sony α 700 and Leica Apo Telyt 280mm f4 at 1/250 ---img-- no stabilisation in either the lens or the camera. Yes. It looks like the Panasonic S1R is prone to some sort of shutter vibrations when using mechanical shutter. This is not the case with the Sony a9 camera. I have already done quite a bit of testing and found that on the S1R, image sharpness starts to get better above 1/50sec with a 400mm @ f4 on a tripod. The sharpness more or less will peak at 1/100sec and above. Beyond 1/100sec, sharpness is about on par with electronic shutter. This is quite a big difference from the Sony a9 where on the same setup, I can get sharp images even at 1/15sec. I am not sure why the S1R is behaving like this. You can get sharp images on adapted lenses up to about 100mm at very low shutter speeds (1sec) but above that focal length, things become worse off. If the cause is because of shutter vibration, then it should be consistent across all focal lengths. I hope it is not unique to my camera 😄 Anyway, my findings have already been reported to the local Panasonic office and my understanding is that this information will be given to Panasonic Japan for their consideration. I am keeping my fingers crossed that Panasonic will come up with a remedy.", "link": "https://www.l-camera-forum.com/topic/305981-images-from-panasonic-cameras-merged/page/13/?tab=comments#comment-3719100", "origin": "L-forum", "suborigin": "305981-images-from-panasonic-cameras-merged", "result": false, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "i am keeping my fingers crossed that panasonic will come up with a -----> remedy !!! .", "sortedWord": "remedy", "Identifyer": null, "identifyer": 45968, "year": "2019"}, {"autor": "dave.gt", "date": "2019-06-21 19:39:00", "content": "Actually, I enjoyed the video. Entertaining, and I do not read anything into commercial videos anyway. Like the Volvo commercial a year or so ago.., it was just a freaking video marketing an SUV (and a good one, too) yet people all over the world came up with their own stories of the so-called \"family\". Get real.:) It appears I am not alone when it comes to OVF, and that is cool. But I do have to wonder if Hasselblad forgot the charm of the V system is in the WLF.... but that is just me, I'm sure. Now, back to the Leica S. Simplicity has in the past been the hallmark of Leica cameras. The Leica S is so simple. Yet, other systems want to include every bell and whistle. Ok, fine, but Leica really does not need to follow everyone else and it doesn't. I like the S3 specs just like they are at 64mp. If I cannot make excellent images with the new S3.... then I guess the problem will be me and my opinion is just one from an outlier. Lol, I just go my own way.", "link": "https://www.l-camera-forum.com/topic/297697-007-vs-hassy-x1-d/page/7/?tab=comments#comment-3764010", "origin": "L-forum", "suborigin": "297697-007-vs-hassy-x1-d", "result": false, "Selector": "came up with", "selectorShort": "with", "MarkedSent": "like the volvo commercial a year or so ago.., it was just a freaking -----> video !!!  marketing an suv (and a good one, too) yet people all over the world came up with their own stories of the so-called \"family\".", "sortedWord": "video", "Identifyer": null, "identifyer": 26113, "year": "2019"}, {"autor": "peterv", "date": "2019-03-25 22:06:00", "content": "Oh and one more thing, if we're putting together a wish list for the S3: I came across an old slide used I think by Leitz Cine Wetzlar - as Sonderoptic call themselves nowadays - that showed that 16:9 on the Leica Pro Format sensor is actually larger than the Alexa 65 in 16:9 mode 🙂 The S system could generate so much more interests from the video and cinema world if Leica can come up with a useful professional codec, just sayin’ 🙂", "link": "https://www.l-camera-forum.com/topic/294962-s007-now-or-s3-later/page/5/?tab=comments#comment-3709442", "origin": "L-forum", "suborigin": "294962-s007-now-or-s3-later", "result": false, "Selector": "come up with", "selectorShort": "with", "MarkedSent": "oh and one more thing, if we're putting together a wish list for the s3: i came across an old slide used i think by leitz cine wetzlar - as sonderoptic call themselves nowadays - that showed that 16:9 on the leica pro format sensor is actually larger than the alexa 65 in 16:9 mode 🙂 the s system could generate so much more interests from the -----> video !!!  and cinema world if leica can come up with a useful professional codec, just sayin’ 🙂", "sortedWord": "video", "Identifyer": null, "identifyer": 30756, "year": "2019"}], "name": "Leicasortedout2019with"}