{"interestingcomments": [{"autor": "tobey bilek", "date": "2014-05-05 18:47:00", "content": "This is often said, but is not true. With digital one needs storage. One needs regular software updates and most likely several programs which all come with a price. It may well work out less expensive than film for a heavy user, but don't think that there are no other associated costs to digital photography than just a camera. ABSOLUTELY. Digital is a money pit. On the other hand the quality over 35 mm film and instant access and my ability to soft proof files and send then to a competent lab that delivers exactly what I send them outweighs the large associated costs for me. Previously I used to develop and print my color and monochrome. Color supplies at quantities for home use have been getting difficult for 30 years. Monochrome is still viable. Ink jet printers do not interest me all that much. Don`t go digital for money savings. It is not there for low volume.", "link": "https://www.l-camera-forum.com/topic/226275-m9-longevity/page/3/?tab=comments#comment-2583727", "origin": "L-forum", "suborigin": "226275-m9-longevity", "result": true, "Selector": "i used to develop", "selectorShort": "develop", "MarkedSent": "this is often said, but is not true. with digital one needs storage. one needs regular software updates and most likely several programs which all come with a price. it may well work out less expensive than film for a heavy user, but don't think that there are no other associated costs to digital photography than just a camera. absolutely. digital is a money pit. on the other hand the quality over 35 mm film and instant access and my ability to soft proof files and send then to a competent lab that delivers exactly what i send them outweighs the large associated costs for me. previously -----> i !!!  -----> used !!!  -----> to !!!  -----> develop !!!  and print my color and monochrome. color supplies at quantities for home use have been getting difficult for 30 years. monochrome is still viable. ink jet printers do not interest me all that much. don`t go digital for money savings. it is not there for low volume.", "sortedWord": "None", "Identifyer": null, "identifyer": 33593, "year": "2014"}, {"autor": "bla", "date": "2014-01-30 14:57:00", "content": "I am currently developing the next version. With a bunch of new features. I have already a working fix for the separate sensor halves --img--  (see attached images, they're pushed very, very extreme though) There will be other improvements, too... I'll see what I manage to do and hope to release it soon. Greetings, Arvid PS: I am not that familiar with cygwin. What do you need it for and which sources would I need to compile for it? The windows or the linux ones? --img-- --img--  Edited January 30, 2014 by bla", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/3/?tab=comments#comment-2521963", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "i am currently developing", "selectorShort": "develop", "MarkedSent": "-----> i !!!  -----> am !!!  -----> currently !!!  -----> developing !!!  the next version. with a bunch of new features. i have already a working fix for the separate sensor halves --img--  (see attached images, they're pushed very, very extreme though) there will be other improvements, too... i'll see what i manage to do and hope to release it soon. greetings, arvid ps: i am not that familiar with cygwin. what do you need it for and which sources would i need to compile for it? the windows or the linux ones? --img-- --img--  edited january 30, 2014 by bla", "sortedWord": "None", "Identifyer": null, "identifyer": 41568, "year": "2014"}, {"autor": "TheGodParticle/Hari", "date": "2014-07-22 10:48:00", "content": "If you are even thinking about the weight of your gear, you are falling off the twig. Suffering is the first step of creativity. --img--  I've developed some issues with my wrists and though temporary, weight is an inconvenience for me I tend to use only one lens for a period of time and the 0.95 makes it's presence adequately felt after a few hours of shooting In general true that about suffering and creativity, I haven't made any genius breakthroughs yet though --img-- ", "link": "https://www.l-camera-forum.com/topic/228818-the-noctilux-f1-is-still-magical/page/7/?tab=comments#comment-2635191", "origin": "L-forum", "suborigin": "228818-the-noctilux-f1-is-still-magical", "result": true, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "if you are even thinking about the weight of your gear, you are falling off the twig. suffering is the first step of creativity. --img--  -----> i !!! 've -----> developed !!!  some issues with my wrists and though temporary, weight is an inconvenience for me -----> i !!!  tend to use only one lens for a period of time and the 0.95 makes it's presence adequately felt after a few hours of shooting in general true that about suffering and creativity, -----> i !!!  haven't made any genius breakthroughs yet though --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 17994, "year": "2014"}, {"autor": "Guest tanks", "date": "2014-01-07 03:10:00", "content": " Btw... the iSnipe description seems to me even a bit exaggerate... really on \"small arm traiectories\" the Coriolis effect can be numerically appreciable ? I am not sure it is or not. However, all the ballistic calculator software that I have tried have mentioned compensating for it. In most cases ballistic calculators are used to help developing loads, and gross adjustments rather than the final word. In the Marines we used to use ballistic tables already printed, my spotter would tell me how many clicks I'd have to adjust the scope in order to hit my target. For example, I will be hunting Elk in Wyoming starting October 15th 2014. I will need to develop a load for a 250 grain bullet as the shots there will be over 300 yards, and the 300 grain bullet I use for African game is not as flat shooting. The ballistic calculator helps me play around with parameters in coming up with the velocity needed for the trajectory I want, while still keeping chamber pressures within safety margins. Then, I work out a load and experiment until I get the most accurate, fastest load within safety parameters. Luckily, in the US we can reload our own ammo and experiment with various combinations.", "link": "https://www.l-camera-forum.com/topic/219308-impressed-with-another-leica-product/?tab=comments#comment-2503381", "origin": "L-forum", "suborigin": "219308-impressed-with-another-leica-product", "result": true, "Selector": "i will need to develop", "selectorShort": "develop", "MarkedSent": " btw... the isnipe description seems to me even a bit exaggerate... really on \"small arm traiectories\" the coriolis effect can be numerically appreciable ? i am not sure it is or not. however, all the ballistic calculator software that i have tried have mentioned compensating for it. in most cases ballistic calculators are used to help developing loads, and gross adjustments rather than the final word. in the marines we used to use ballistic tables already printed, my spotter would tell me how many clicks i'd have to adjust the scope in order to hit my target. for example, i will be hunting elk in wyoming starting october 15th 2014. -----> i !!!  -----> will !!!  -----> need !!!  -----> to !!!  -----> develop !!!  a load for a 250 grain bullet as the shots there -----> will !!!  be over 300 yards, and the 300 grain bullet -----> i !!!  use for african game is not as flat shooting. the ballistic calculator helps me play around with parameters in coming up with the velocity needed for the trajectory i want, while still keeping chamber pressures within safety margins. then, i work out a load and experiment until i get the most accurate, fastest load within safety parameters. luckily, in the us we can reload our own ammo and experiment with various combinations.", "sortedWord": "None", "Identifyer": null, "identifyer": 89751, "year": "2014"}, {"autor": "almoore", "date": "2014-01-07 14:35:00", "content": "I will be hunting Elk in Wyoming starting October 15th 2014. I will need to develop a load for a 250 grain bullet as the shots there will be over 300 yards, and the 300 grain bullet I use for African game... This is all so last century. When I want to terminate a moose, chipmunk or elephant I simply call in a predator drone from the comfort of my own home. It's like the switch from film to digital - I could never go back to the fuss of the old days. Embrace the future...", "link": "https://www.l-camera-forum.com/topic/219308-impressed-with-another-leica-product/?tab=comments#comment-2503743", "origin": "L-forum", "suborigin": "219308-impressed-with-another-leica-product", "result": true, "Selector": "i will need to develop", "selectorShort": "develop", "MarkedSent": "i will be hunting elk in wyoming starting october 15th 2014. -----> i !!!  -----> will !!!  -----> need !!!  -----> to !!!  -----> develop !!!  a load for a 250 grain bullet as the shots there -----> will !!!  be over 300 yards, and the 300 grain bullet -----> i !!!  use for african game... this is all so last century. when i want to terminate a moose, chipmunk or elephant i simply call in a predator drone from the comfort of my own home. it's like the switch from film to digital - i could never go back to the fuss of the old days. embrace the future...", "sortedWord": "None", "Identifyer": null, "identifyer": 89753, "year": "2014"}, {"autor": "graeme_clarke", "date": "2014-03-16 22:50:00", "content": " After the best part of a week in South Africa photographing wildlife with a Sony A7R and Leica 280 + 2x converter lenses, I developed vertical double vision. I'd concentrated hard on focusing on the subject and often used the viewfinder 10x facility used to get a sharp picture - which took a lot of time and care when using the 280 and 2x combined. I'd taken about 2000 images On returning to the UK at the beginning of March, tests run by the doctor (CT scan, blood tests) and optometrist all are normal. It's only now that vision is returning to normal when looking straight ahead or to the right. Looking left is still blurred. Some kind of strained muscle may be the cause. My question is this - has anyone else experienced similar difficulties when using a camera with an EVF? Is there likely to be a link between extended use of an EVF this way and some kind of eyestrain in one eye compared to the other (either one of the oblique muscles that move one eye, or ciliary muscles in one eye) that can lead to double vision for a couple of weeks or so? I'd very much value your comments. Best wishes, Graeme", "link": "https://www.l-camera-forum.com/topic/223705-evf-and-double-vision-is-there-a-link/?tab=comments#comment-2551125", "origin": "L-forum", "suborigin": "223705-evf-and-double-vision-is-there-a-link", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": " after the best part of a week in south africa photographing wildlife with a sony a7r and leica 280 + 2x converter lenses, -----> i !!!  -----> developed !!!  vertical double vision. i'd concentrated hard on focusing on the subject and often used the viewfinder 10x facility used to get a sharp picture - which took a lot of time and care when using the 280 and 2x combined. i'd taken about 2000 images on returning to the uk at the beginning of march, tests run by the doctor (ct scan, blood tests) and optometrist all are normal. it's only now that vision is returning to normal when looking straight ahead or to the right. looking left is still blurred. some kind of strained muscle may be the cause. my question is this - has anyone else experienced similar difficulties when using a camera with an evf? is there likely to be a link between extended use of an evf this way and some kind of eyestrain in one eye compared to the other (either one of the oblique muscles that move one eye, or ciliary muscles in one eye) that can lead to double vision for a couple of weeks or so? i'd very much value your comments. best wishes, graeme", "sortedWord": "None", "Identifyer": null, "identifyer": 96246, "year": "2014"}, {"autor": "rodluvan", "date": "2014-01-31 08:49:00", "content": "I agree that it is possible, and that the market is small. It would seem to appeal to photographers who: I. Value simplicity above all, but not too much: a) They value simplicity so much that a screen on the camera is too thick & distracting, and any buttons for digital functions are too many. --img--  But they don't mind carrying, powering and connecting a secondary screen (smartphone/tablet/pc) to change camera settings, format a card or review an image; creating a film-like experience is worth the extra complexity. Again, with the either-or. This is infantile and dishonest representation of a position and ignoring the common view that using a Leica at all is \"the appreciation of simplicity above all but not to much!\" Who, in any situation in life wants too much of anything? It's a definitional contradiction. Implementing this design idea is not a principle step, but a difference in degrees. You yourself have decided to give up 9fps, TTL composition, split second AF, i.e. you want simplicity but not too much. And again, as others have pointed out, it says more about you than about anyone else, if you consider carrying a smartphone a chore. However the entire point of the camera is not to have to dial in settings, chimp photos every 1 minute or format your mem-card, it's to appreciate the experience of taking photos without being distracted by the technology present in modern digital cameras so why on earth would you negate that by using your mobile phone? Still, if you wanted to, the slim, roughed, stylish Digital M6 in combination with a smartphone and a Leica app running while you're taking photos, has the possibility of hugely increasing functionality and usability at the same time. A dedicated app running on a, in effect, hand-held computer with a superior screen makes much sense. Granted, it introduces some restrictions as well , but it improves on other things. That's the nature of reality. --img--  But they do still require the immediacy and convenience of digital because waiting for film to be developed and scanned sometimes takes too long. Yes, so? Another, a childish ignorance of nuances. According to your logic, people using film today (like me), should use a brownie and Sunny 16 otherwise why even bother? Film is a medium that is going extinct, not many films are left, and not many professional labs are left, certainly not in rural areas and so forth. Developing yourself is simply not an option to many for many reasons, one, again, is that chemicals are increasingly difficult to come by.", "link": "https://www.l-camera-forum.com/topic/221045-a-digital-m6/page/9/?tab=comments#comment-2522473", "origin": "L-forum", "suborigin": "221045-a-digital-m6", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "i agree that it is possible, and that the market is small. it would seem to appeal to photographers who: i. value simplicity above all, but not too much: a) they value simplicity so much that a screen on the camera is too thick & distracting, and any buttons for digital functions are too many. --img--  but they don't mind carrying, powering and connecting a secondary screen (smartphone/tablet/pc) to change camera settings, format a card or review an image; creating a film-like experience is worth the extra complexity. again, with the either-or. this is infantile and dishonest representation of a position and ignoring the common view that using a leica at all is \"the appreciation of simplicity above all but not to much!\" who, in any situation in life wants too much of anything? it's a definitional contradiction. implementing this design idea is not a principle step, but a difference in degrees. you yourself have decided to give up 9fps, ttl composition, split second af, i.e. you want simplicity but not too much. and again, as others have pointed out, it says more about you than about anyone else, if you consider carrying a smartphone a chore. however the entire point of the camera is not to have to dial in settings, chimp photos every 1 minute or format your mem-card, it's to appreciate the experience of taking photos without being distracted by the technology present in modern digital cameras so why on earth would you negate that by using your mobile phone? still, if you wanted to, the slim, roughed, stylish digital m6 in combination with a smartphone and a leica app running while you're taking photos, has the possibility of hugely increasing functionality and usability at the same time. a dedicated app running on a, in effect, hand-held computer with a superior screen makes much sense. granted, it introduces some restrictions as well , but it improves on other things. that's the nature of reality. --img--  but they do still require the immediacy and convenience of digital because waiting for film to be developed and scanned sometimes takes too long. yes, so? another, a childish ignorance of nuances. according to your logic, people using film today (like me), should use a brownie and sunny 16 otherwise why even bother? film is a medium that is going extinct, not many films are left, and not many professional labs are left, certainly not in rural areas and so forth. -----> developing !!!  yourself is simply not an option to many for many reasons, one, again, is that chemicals are increasingly difficult to come by.", "sortedWord": "None", "Identifyer": null, "identifyer": 96531, "year": "2014"}, {"autor": "Guest JonathanP", "date": "2014-07-24 13:11:00", "content": "I've now developed a Lightroom plugin (Mac only) that I have made freely available: Lightroom Plugin for M240 Shadows processing Hope some of you might find it of use --img--  Jonathan", "link": "https://www.l-camera-forum.com/topic/229863-correcting-the-green-shadows/page/3/?tab=comments#comment-2636533", "origin": "L-forum", "suborigin": "229863-correcting-the-green-shadows", "result": true, "Selector": "i've now developed", "selectorShort": "develop", "MarkedSent": "-----> i !!! 've -----> now !!!  -----> developed !!!  a lightroom plugin (mac only) that -----> i !!!  have made freely available: lightroom plugin for m240 shadows processing hope some of you might find it of use --img--  jonathan", "sortedWord": "None", "Identifyer": null, "identifyer": 108703, "year": "2014"}, {"autor": "mirekti", "date": "2014-07-26 01:18:00", "content": "I've now developed a Lightroom plugin (Mac only) that I have made freely available: I believe this is highly appreciated among the members here. Would making a win version be too much effort for you? I understand making money out of it isn't your priority, but I'd gladly contribute if needed.", "link": "https://www.l-camera-forum.com/topic/229863-correcting-the-green-shadows/page/3/?tab=comments#comment-2637363", "origin": "L-forum", "suborigin": "229863-correcting-the-green-shadows", "result": true, "Selector": "i've now developed", "selectorShort": "develop", "MarkedSent": "-----> i !!! 've -----> now !!!  -----> developed !!!  a lightroom plugin (mac only) that -----> i !!!  have made freely available: -----> i !!!  believe this is highly appreciated among the members here. would making a win version be too much effort for you? i understand making money out of it isn't your priority, but i'd gladly contribute if needed.", "sortedWord": "None", "Identifyer": null, "identifyer": 108708, "year": "2014"}, {"autor": "viramati", "date": "2014-08-22 07:50:00", "content": "I've now developed a Lightroom plugin (Mac only) that I have made freely available: Lightroom Plugin for M240 Shadows processing Hope some of you might find it of use --img--  Jonathan Thanks it really works", "link": "https://www.l-camera-forum.com/topic/229863-correcting-the-green-shadows/page/4/?tab=comments#comment-2654441", "origin": "L-forum", "suborigin": "229863-correcting-the-green-shadows", "result": true, "Selector": "i've now developed", "selectorShort": "develop", "MarkedSent": "-----> i !!! 've -----> now !!!  -----> developed !!!  a lightroom plugin (mac only) that -----> i !!!  have made freely available: lightroom plugin for m240 shadows processing hope some of you might find it of use --img--  jonathan thanks it really works", "sortedWord": "None", "Identifyer": null, "identifyer": 108722, "year": "2014"}, {"autor": "xristian", "date": "2014-08-17 03:32:00", "content": "Hi All: I recently discovered photography as a hobby. I started shooting with a Rolleicord, then recently upgraded to an M3 with a 1930's Elmar 5cm lens. I'm considering upgrading to Summicron, but not sure if that's just GAS. Maybe somebody here can tell me if it's worth the upgrade? I'm also looking for a place to upload photos I've developed and receive constructive criticism. Hopefully, this is the place. Looking forward to learning more about photography!", "link": "https://www.l-camera-forum.com/topic/186962-welcome/page/3/?tab=comments#comment-2650911", "origin": "L-forum", "suborigin": "186962-welcome", "result": true, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "hi all: i recently discovered photography as a hobby. i started shooting with a rolleicord, then recently upgraded to an m3 with a 1930's elmar 5cm lens. i'm considering upgrading to summicron, but not sure if that's just gas. maybe somebody here can tell me if it's worth the upgrade? -----> i !!! 'm also looking for a place to upload photos -----> i !!! 've -----> developed !!!  and receive constructive criticism. hopefully, this is the place. looking forward to learning more about photography!", "sortedWord": "None", "Identifyer": null, "identifyer": 113810, "year": "2014"}, {"autor": "IWC Doppel", "date": "2014-04-21 13:37:00", "content": "A few from the day with Terry's 35mm Biogon, mostly at f4. Thanks for letting me have a play. Developing them was interesting, it was quite different in it's tonality, probably exaggerated by the overcast day, I did play a bit in LR --img-- --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/217319-spring-into-bath-april-19th-easter-saturday/page/7/?tab=comments#comment-2572295", "origin": "L-forum", "suborigin": "217319-spring-into-bath-april-19th-easter-saturday", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "a few from the day with terry's 35mm biogon, mostly at f4. thanks for letting me have a play. -----> developing !!!  them was interesting, it was quite different in it's tonality, probably exaggerated by the overcast day, i did play a bit in lr --img-- --img-- --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 135212, "year": "2014"}, {"autor": "RexS", "date": "2014-07-21 18:56:00", "content": " I thought I’d share this experience as it is M8-related… This weekend I loaded Ilford FP4 Plus in my IIIc + Summicron and walked down to the riverfront to try out this film. I used a light yellow filter (0) and shot it at ISO80 – 100. I’ve never developed FP4, so I tried the same developer/time combination as I would with my favorite film (APX100) out of shear ignorance on my part. I couldn’t get into the darkroom this weekend because of some construction work (and the dust!), so on a lark I shot the negatives with the M8 mounted on an old BEOON stand with a Canon FD 50/3.5 macro lens. I opened the .dng files with Apple Aperture, reversed the curves to produce a positive image, and then grey-scaled the image to get rid of the color cast produced by the light box I was using. The low-resolution .jpg here is not a great photo as I was experimenting with film exposure and development. But I was pleasantly surprised by the detail and tone produced by a minimum of effort. It really was more satisfying than any of the negative scans I’ve made. I admit that some more manipulation with Aperture (or Photoshop) would no doubt improve the digital image, but at least I have a place to start. --img-- ", "link": "https://www.l-camera-forum.com/topic/230886-m8-and-beoon/?tab=comments#comment-2634803", "origin": "L-forum", "suborigin": "230886-m8-and-beoon", "result": false, "Selector": "i’ve never developed", "selectorShort": "develop", "MarkedSent": "i’ve never developed fp4, so i tried the same developer/time combination as i would with my favorite -----> film !!!  (apx100) out of shear ignorance on my part.", "sortedWord": "film", "Identifyer": null, "identifyer": 42153, "year": "2014"}, {"autor": "wattsy", "date": "2014-01-07 10:34:00", "content": "It all sounds a bit geeky to me. Whatever happened to shooting as a sporting activity? For example, I will be hunting Elk in Wyoming starting October 15th 2014. I will need to develop a load for a 250 grain bullet as the shots there will be over 300 yards Have you ever considered using a bit of fieldcraft skill and knowledge to get closer?", "link": "https://www.l-camera-forum.com/topic/219308-impressed-with-another-leica-product/?tab=comments#comment-2503571", "origin": "L-forum", "suborigin": "219308-impressed-with-another-leica-product", "result": false, "Selector": "i will need to develop", "selectorShort": "develop", "MarkedSent": "i will need to develop a load for a 250 grain bullet as the shots there will be over 300 yards have you ever considered using a bit of fieldcraft -----> skill !!!  and knowledge to get closer?", "sortedWord": "skill", "Identifyer": null, "identifyer": 89752, "year": "2014"}, {"autor": "dgc", "date": "2014-02-04 01:57:00", "content": "Bear with me, the final set, 100% crop. As I said, I see no significant differences with my untrained eye, the Plustek appears a little more contrasty, but this, I am sure could also be manipulated in LR for the DSLR image. A few comments, mainly aimed at those thinking about digitalising their own film: 1. developing film is easy and is all kitchen sink stuff - 20 mins tops for 2 films. I have found B+W quite user-friendly and at beginner level it does not need to be an exact science, providing you follow the general developing instructions. It does give me a lot of satisfaction developing my own film. 2. the Plustek is easier to use than setting up a DSLR on a tripod etc. The image took about 2 mins to scan on the Plustek. I found the DSLR set up a chore, which was the main reason for getting the Plustek. 3. with the DSLR set-up you can treat yourself to a macro lens, which is good fun in its own right. 4. The Plustek was considerably cheaper than my macro lens - it probably cost a third of the lens. 5. The Plustek fits in my carry-on bag; very portable. I look forward to your comments. David --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/221448-dslr-v-plustek-compare-and-contrast/?tab=comments#comment-2525083", "origin": "L-forum", "suborigin": "221448-dslr-v-plustek-compare-and-contrast", "result": false, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "developing -----> film !!!  is easy and is all kitchen sink stuff - 20 mins tops for 2 films.", "sortedWord": "film", "Identifyer": null, "identifyer": 100704, "year": "2014"}, {"autor": "Dikaiosune01", "date": "2014-11-04 12:04:00", "content": "I read in this write-up about stand development using Rodinal that it would be possible to expose one and the same roll at different EI and get ok results. Has anyone tried this? I would like to thank you for sharing that article. Very helpful in bettering my understanding of stand development. I've been meaning to try it for a while but have had too many questions. The weather is finally reaching 23 ish degrees Celsius (as opposed to the 35 last week) making it more environmentally feasible to finally give stand development a try. So if you'd indulge me and let me hijack this 'stand development' thread with my own questions. (1) If I have a development tank large enough. that can hold over 1 liter of chemicals; can i develop 2 rolls of 35mm film. 7 ml solution and 700 ml of water? 1 hour. inversions every 10 seconds for the first minute. Stand 30 minutes, one slow inversion, stand 30 minutes. (2) Can anyone elaborate more on the temperature control for stand development? Highest and lowest temperatures you've tried? (3) Am I wrong in assuming that one roll of 135 film the equivalent to one roll of 120 film and equivalent to one 4x5 sheet film? (it kind of seemed to work for me while I was souping HC110 and HP5). Does the same rationale apply to stand development? (4) I want to try stand development with sheet film (4x5 sheet film) in a 1 liter Patterson tank and the Mod 45 holders. Because of this, I do need one liter of fluids to ensure the sheet is immersed. At the same time I should only use 3.5 ml of rodinal. (1) Do I need to have 350 ml of water for every 3.5ml of developer? What do I need to do to get that 1 liter of solution that I need? thank you thank you thank you", "link": "https://www.l-camera-forum.com/topic/202052-stand-developing-hp5-in-either-rodinal-or-d76/page/2/?tab=comments#comment-2700459", "origin": "L-forum", "suborigin": "202052-stand-developing-hp5-in-either-rodinal-or-d76", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "that can hold over 1 liter of chemicals; can i develop 2 -----> rolls !!!  of 35mm film.", "sortedWord": "roll", "Identifyer": null, "identifyer": 107212, "year": "2014"}, {"autor": "aesop", "date": "2014-05-04 08:36:00", "content": " Help required for a rather odd situation. I need to develop an important 35mm roll of Ilford FP4+ erroneously rated at ISO 400 (yup, I know) in Kodak HC110. The Massive Dev Chart has no output for this specific rating and I have done a fair bit of research without any joy, so I would appreciate any real-world input (including successful real-world approximations) on time and dilution. Many thanks in advance.", "link": "https://www.l-camera-forum.com/topic/226492-how-long-to-develop-fp4iso-400-in-hc110/?tab=comments#comment-2582657", "origin": "L-forum", "suborigin": "226492-how-long-to-develop-fp4iso-400-in-hc110", "result": false, "Selector": "i need to develop", "selectorShort": "develop", "MarkedSent": "i need to develop an important 35mm -----> roll !!!  of ilford fp4+ erroneously rated at iso 400 (yup, i know) in kodak hc110.", "sortedWord": "roll", "Identifyer": null, "identifyer": 107271, "year": "2014"}, {"autor": "Colin1974", "date": "2014-03-08 21:36:00", "content": "Thanks for your generous words. Being a relative newcomer, I used a dSLR first (a Nikon D40), then tried out various other dSLR's and compacts. Five years ago, I started using a Minolta 35mm SLR and from then on, I was hooked on the challenge of \"not knowing\" until that cardboard envelope came back. If I was working professionally, rather than creatively, I would highly recommend the Sony A900 with the best Minolta lenses you could afford. I can only develop B&W film, as I couldn't handle the accuracy of colour. Luckily, I live near a branch of Snappy Snaps, who are fantastic with film. I really need a camera that will last as a long term purchase, and I don't have that sort of confidence in digital technology (not just reliability, but also future compatibility and never ending upgrades). Anyway, I'll keep you all informed on how it goes. Colin.", "link": "https://www.l-camera-forum.com/topic/223239-on-the-right-trackfinally/?tab=comments#comment-2545918", "origin": "L-forum", "suborigin": "223239-on-the-right-trackfinally", "result": false, "Selector": "i can only develop", "selectorShort": "develop", "MarkedSent": "i can only develop b&w -----> film !!! , as i couldn't handle the accuracy of colour.", "sortedWord": "film", "Identifyer": null, "identifyer": 107302, "year": "2014"}, {"autor": "JohnBragg1", "date": "2014-11-17 11:26:00", "content": " Hi from the far south west of England. I am based in Penwithick near St Austell in Cornwall. I shoot film in LeicaM6 and have an interest in collecting all the cameras that I could never afford before the digital revolution. Especially Nikon pro models . I develop my own film and shoot Ilford HP5+ and Kodak Tri-X mostly. I have a long time interest in darkroom work, but these days I scan my negs and have adapted to a hybrid workflow.", "link": "https://www.l-camera-forum.com/topic/186962-welcome/page/4/?tab=comments#comment-2708204", "origin": "L-forum", "suborigin": "186962-welcome", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop my own -----> film !!!  and shoot ilford hp5+ and kodak tri-x mostly.", "sortedWord": "film", "Identifyer": null, "identifyer": 113814, "year": "2014"}, {"autor": "jip", "date": "2014-12-03 10:39:00", "content": "Ooh I didn't see the link to your website before, now that Robert pointed it out to me I took a look! --img--  Great shots, I wanna learn to develop film like that, I barely got the basics maybe next year when I move into a apartment I have some more room for development stuff.", "link": "https://www.l-camera-forum.com/topic/237836-hello-from-finland/?tab=comments#comment-2720000", "origin": "L-forum", "suborigin": "237836-hello-from-finland", "result": false, "Selector": "i wanna learn to develop", "selectorShort": "develop", "MarkedSent": " great shots, i wanna learn to develop -----> film !!!  like that, i barely got the basics maybe next year when i move into a apartment i have some more room for development stuff.", "sortedWord": "film", "Identifyer": null, "identifyer": 115093, "year": "2014"}, {"autor": "Fa.Brice", "date": "2014-11-29 14:44:00", "content": " Hello guys! I'm new here but not new with Leica. I own a M6 0.85 TTL with a Japanese Summicron and my first step in Leica's world was 3 years ago with a M5. I develop my b&w films myself and I'm at the beginning to start with color home development. See you guys!!", "link": "https://www.l-camera-forum.com/topic/237785-hi-from-quebec/?tab=comments#comment-2717031", "origin": "L-forum", "suborigin": "237785-hi-from-quebec", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop my b&w -----> films !!!  myself and i'm at the beginning to start with color home development.", "sortedWord": "film", "Identifyer": null, "identifyer": 115095, "year": "2014"}, {"autor": "JohnBragg1", "date": "2014-11-18 05:21:00", "content": " Hi from the far south west of England. I am based in Penwithick near St Austell in Cornwall. I shoot film in a Leica M6 and have an interest in collecting all the cameras that I could never afford before the digital revolution. Especially Nikon pro models . I develop my own film and shoot Ilford HP5+ and Kodak Tri-X mostly. I have a long time interest in darkroom work, but these days I scan my negs and have adapted to a hybrid workflow.", "link": "https://www.l-camera-forum.com/topic/237247-hello-from-cornwall-uk/?tab=comments#comment-2708787", "origin": "L-forum", "suborigin": "237247-hello-from-cornwall-uk", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop my own -----> film !!!  and shoot ilford hp5+ and kodak tri-x mostly.", "sortedWord": "film", "Identifyer": null, "identifyer": 115099, "year": "2014"}, {"autor": "VinnyTheLens", "date": "2014-09-26 00:38:00", "content": " Greetings, I am new to the forum. I have been shooting with a M6 now for a few years and love it. I develop my own B&W film as well. The M6 is my first Leica. It is a very rewarding experience shooting with the Leica camera. I also own a Fuji Xpro-1 and I am feeling the urge to purchase a Leica M-E used. I am wondering if it is even worth it at this point being the technology is dated and I fear that my Fuji would shoot just as well due to its low light capabilities over the M9 / M-E. Does any one out there Own both the Fuji and M9 / M-E? Any thoughts? Nice meeting everyone, V", "link": "https://www.l-camera-forum.com/topic/234571-greetings-from-new-member/?tab=comments#comment-2678464", "origin": "L-forum", "suborigin": "234571-greetings-from-new-member", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop my own b&w -----> film !!!  as well.", "sortedWord": "film", "Identifyer": null, "identifyer": 115207, "year": "2014"}, {"autor": "surfingsalmon", "date": "2014-07-27 15:50:00", "content": " I finally joined the forum so I can view the attached pictures you all have been posting, be it gear or photographs! What great pictures, thank you! Definitely worth signing up just for that. On to myself, my name is Patrick and I live near Washington, DC. I got bit by the rangefinder bug about a year ago, and I finally hit the Leica stage. I picked up a Leica M2 and had a CLA done by Youxin Ye. I never knew split images could be so bright! Before, I had a Canonet 28, Yashica MG-1, and a Zorki 4 with a Jupiter 8. --img--  I am really loving shooting film, especially black and white. I feel as if I am becoming one with the camera! I have started developing on my own rolls and it's satisfying and relieving! I find it relieving because I can get my black and white rolls developed anytime I want in my own house! If you want to take a look at my work, check out my tumblr and my personal blog. I am excited to share my Leica experience with everyone. I am equally excited to absorb the wealth of knowledge and experience contained here!", "link": "https://www.l-camera-forum.com/topic/231185-hello-and-thanks/?tab=comments#comment-2638155", "origin": "L-forum", "suborigin": "231185-hello-and-thanks", "result": false, "Selector": "i have started developing", "selectorShort": "develop", "MarkedSent": "i have started developing on my own -----> rolls !!!  and it's satisfying and relieving!", "sortedWord": "roll", "Identifyer": null, "identifyer": 115237, "year": "2014"}, {"autor": "milosr", "date": "2014-07-07 15:26:00", "content": " I am very glad and thankful to be part of this mighty forum … fairly new to the world of Leicas, but I already feel like I belong there. I own a Leica M6 with a Summicron 35mm IVth Gen non-ASPH lens. My photography blog is accessible at Miloš R. Photography. It's also rather fresh, but there's already some material online. Please hop in, have a look, say hi! --img--  Always looking forward to chitchat, engaging comments (and constructive feedback)! I develop my own BW film, and scan the developed film. I haven't gotten around making prints quite yet, but that's next in line. Meanwhile I'll browse around this lovely place and see what it all has to offer. Until soon! Miloš", "link": "https://www.l-camera-forum.com/topic/230146-hello-everybody/?tab=comments#comment-2625887", "origin": "L-forum", "suborigin": "230146-hello-everybody", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop my own bw -----> film !!! , and scan the developed -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 115280, "year": "2014"}, {"autor": "Three Legged Cat", "date": "2014-07-07 21:59:00", "content": "I am very glad and thankful to be part of this mighty forum … fairly new to the world of Leicas, but I already feel like I belong there.I own a Leica M6 with a Summicron 35mm IVth Gen non-ASPH lens. My photography blog is accessible at Miloš R. Photography. It's also rather fresh, but there's already some material online. Please hop in, have a look, say hi! --img--  Always looking forward to chitchat, engaging comments (and constructive feedback)! I develop my own BW film, and scan the developed film. I haven't gotten around making prints quite yet, but that's next in line. Meanwhile I'll browse around this lovely place and see what it all has to offer. Until soon! Miloš Hi Milos, I'm new here too... I just checked out your photos of Grasse - it's been a while since I've been there (2008 I think, on holiday in Mougins...), and they brought back fond memories. I hope like me you have a good experience of using this forum. Kind Regards.", "link": "https://www.l-camera-forum.com/topic/230146-hello-everybody/?tab=comments#comment-2626118", "origin": "L-forum", "suborigin": "230146-hello-everybody", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop my own bw -----> film !!! , and scan the developed -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 115281, "year": "2014"}, {"autor": "Aplum", "date": "2014-01-26 20:34:00", "content": " Hi everyone, sorry if this has been asked before. I am saving up for my first Leica, I am a college student so I am by no means rich. The two Leica cameras that I have in mind are the M6 and M8. To start off. I have to say I prefer digital only because I don't have any places around me to develop film. At first I was almost certain that the M8 would be the camera for me. However after doing more research I found out that the M8 had problems such as sensor or LCD failure. I can't afford to buy a camera and have it break:(. Which is why I started considering the M6, all that means is having to wait longer for my film to be developed. So what do you guys think?", "link": "https://www.l-camera-forum.com/topic/220957-new-user-m8-or-m6/?tab=comments#comment-2519159", "origin": "L-forum", "suborigin": "220957-new-user-m8-or-m6", "result": false, "Selector": "me to develop", "selectorShort": "develop", "MarkedSent": "i have to say i prefer digital only because i don't have any places around me to develop -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 115387, "year": "2014"}, {"autor": "philipus", "date": "2014-03-30 15:35:00", "content": "Thanks everybody for a very nice meeting yesterday. This forum is like a secret globe-spanning club where one will feel warmly welcome no matter where on the planet one happens to be. I'm sorry that I arrived later than anticipated and didn't get a chance to speak more with you, Andy. And Dan, good luck with the Globetrotters talk. I will post some photos as soon as I've developed the rolls. All the best, looking forward to the next time Philip", "link": "https://www.l-camera-forum.com/topic/224259-spur-of-the-moment-london-meeting-since-philipus-will-be-in-town/?tab=comments#comment-2559453", "origin": "L-forum", "suborigin": "224259-spur-of-the-moment-london-meeting-since-philipus-will-be-in-town", "result": false, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": "i will post some photos as soon as i've developed the -----> rolls !!! .", "sortedWord": "roll", "Identifyer": null, "identifyer": 135542, "year": "2014"}], "name": "Leicasortedout2014develop"}