{"interestingcomments": [{"autor": "schattenundlicht", "date": "2017-09-25 19:00:00", "content": "Although I might be veering a little off topic here, in case anybody wishes to compare the above schematic drawings to the original Tessar patent by Rudolph: --img--  which reads as follows (any errors of transscription are not mine but from OCR extraction by Google): UNITED STATES PATENT OFFICE.PAUL RUDOLPH, OF .IENA, GERMANY, ASSIGNOR TO THE FIRM OF CARL I ZEISS, OF JENA, GERMANY.PHOTOGRAPHIC OBJECTIVE.SPECIFICATION forming part of Letters Patent No. 721,240, dated February 24, 1903.Application filed July 15,1902. Serial No. 115,696. (No model.)To all whom it may concern:Be it known that I, PAUL RUDOLPH, doctor of philosophy, a subject of the Duke of Saxo- Altenburg,residing at Carl Zeiss strasse, Jena, in the Grand Duchy of Saxe-Weimar, German Empire, have invented a newand useful Photographic Objective, of which the following is a specification.The objective here to be described is designed for the purposes of photography and projection and is distinguished from the existing types of astigmatically-corrected 0bjeotives by the advantage that with com paratively small numbers of components and refiexions a large relative aperture for which the objective is spherically corrected and a relatively large area of anastigmatic flatness of the field is attained. This achievement is the result of arranging four single lenses in two groups separated by the diaphragm, the two components of one of the groups inclosing an air-space between their two surfaces, facing one another, while the two components of the other group are joined in a cemented surface, and the pair of facing surfaces having a negative power, while the cemented surface has a collective effect.In the annexed drawinga diagram is shown of an objective constructed according to the invention.The objective described in Patent No. 444,714-and the objective described in Patsit No. 660,202 may be considered to have been combined in the present objective. The objective of Patent No. 444,714 is restricted to two groups of cemented lenses separated by the diaphragm, and the opposite efiects by which astigmatic correction is obtained are derived solely from the refractive action of cemented surfaces. In the objective of Patent No. 660,202 the said correction is based on the opposite powers of two pairs of facing surfaces, each group of lenses having an airspace between its components. In the new objective the opposite effects producing astigmatic correction are obtained by giving to the power of the cemented surface of the group of lenses in contact the opposite sign to that of the power of the pair of facing surfaces presented by the other group of lenses. There are two ways possible in which this new principle of opposite effects can be realized.First, a negative cemented surface may be employed, together with a positive pair of facing surfaces, and, secondly, a positive cemented surface with a negative pair of facing surfaces. The first combination leads to a less favorable result; but the second combination, which embodies the present invention, is fruitful in an extraordinary degree. A cemented surface at one side of the diaphragm and a pair of facing surfaces at the other side are well known in objectives, which consist of four components arranged in two groups; but hitherto the power of the cemented surface possessed the same sign as the power of the pair of facing surfaces. In the Petzval objective both have dispersive efiect, and the same obtains in Steinheils portraiture antiplanet.The example of the improved objectiveshown in the drawing is described below by exact data as to radii, thicknesses, diaphragm intervals, and glasses employed. Where particular conditions demand it, the glasses mentioned may be replaced by other kinds materially differing from them, and the forms of the lenses, as well as the order of their arrangement, may be departed from and still the construction kept within the bounds of the present invention.The objective shown is spherically corrected for a relative aperture of 1 :5.5. The anastigmatic flatness of the image extends to about sixty degrees.L L signify the glass lenses; d (1 their thicknesses at the axis; r W, the radii of the lens-surfaces b and b the distances from the diaphragm to the adjoining lens-fronts, and Z the axial distance between the facing surfaces. The numerical values of radii, thicknesses, and distances relate to the focal length of the whole objective as to the unit. Simple multiplication of these values by the focal length required supplies the data of construction for an objective of the desired focus. The glasses used are denoted by n, if, and M referring, respectively, to the D and F line of the solar spectrum and the Hy line of the hydrogen spectrum.The objective shown consists of the single lenses L L L and L. L and L possess collective, L and L dispersive, effect. The group L L is separated by the diaphragm B from the group L L. There is an air-space between L and L and the effect of the pair of facing surfaces 'r r bounding this space is dispersive. L and L are cemented together at the surface 1\", which cemented surface has collective efiect.Radiz. Thick'nesses and Distances.L L-*. L LWhat I claim as my invention, and desire to secure by Letters Patent, is-A spherically, chromatically and astigmatically corrected objective, consisting of four lenses separated by the diaphragm into two groups each of two lenses, of which groups one includes a pair of facing surfaces and the other a cemented surface, the power of the pair of facing surfaces being negative and that of the cemented surface positive.In testimony whereof I have signed my name to this specification in the presence of two subscribing witnesses.PAUL RUDOLPH.Witnesses:EMIL DONITZ, PAUL KRÜGER. Edited September 25, 2017 by schattenundlicht", "link": "https://www.l-camera-forum.com/topic/276822-whats-the-true-story-surrounding-the-birth-of-red-scale-elmars/page/4/?tab=comments#comment-3365175", "origin": "L-forum", "suborigin": "276822-whats-the-true-story-surrounding-the-birth-of-red-scale-elmars", "result": true, "Selector": "my invention", "selectorShort": "invention", "MarkedSent": "although i might be veering a little off topic here, in case anybody wishes to compare the above schematic drawings to the original tessar patent by rudolph: --img--  which reads as follows (any errors of transscription are not mine but from ocr extraction by google): united states patent office.paul rudolph, of .iena, germany, assignor to the firm of carl i zeiss, of jena, germany.photographic objective.specification forming part of letters patent no. 721,240, dated february 24, 1903.application filed july 15,1902. serial no. 115,696. (no model.)to all whom it may concern:be it known that i, paul rudolph, doctor of philosophy, a subject of the duke of saxo- altenburg,residing at carl zeiss strasse, jena, in the grand duchy of saxe-weimar, german empire, have invented a newand useful photographic objective, of which the following is a specification.the objective here to be described is designed for the purposes of photography and projection and is distinguished from the existing types of astigmatically-corrected 0bjeotives by the advantage that with com paratively small numbers of components and refiexions a large relative aperture for which the objective is spherically corrected and a relatively large area of anastigmatic flatness of the field is attained. this achievement is the result of arranging four single lenses in two groups separated by the diaphragm, the two components of one of the groups inclosing an air-space between their two surfaces, facing one another, while the two components of the other group are joined in a cemented surface, and the pair of facing surfaces having a negative power, while the cemented surface has a collective effect.in the annexed drawinga diagram is shown of an objective constructed according to the invention.the objective described in patent no. 444,714-and the objective described in patsit no. 660,202 may be considered to have been combined in the present objective. the objective of patent no. 444,714 is restricted to two groups of cemented lenses separated by the diaphragm, and the opposite efiects by which astigmatic correction is obtained are derived solely from the refractive action of cemented surfaces. in the objective of patent no. 660,202 the said correction is based on the opposite powers of two pairs of facing surfaces, each group of lenses having an airspace between its components. in the new objective the opposite effects producing astigmatic correction are obtained by giving to the power of the cemented surface of the group of lenses in contact the opposite sign to that of the power of the pair of facing surfaces presented by the other group of lenses. there are two ways possible in which this new principle of opposite effects can be realized.first, a negative cemented surface may be employed, together with a positive pair of facing surfaces, and, secondly, a positive cemented surface with a negative pair of facing surfaces. the first combination leads to a less favorable result; but the second combination, which embodies the present invention, is fruitful in an extraordinary degree. a cemented surface at one side of the diaphragm and a pair of facing surfaces at the other side are well known in objectives, which consist of four components arranged in two groups; but hitherto the power of the cemented surface possessed the same sign as the power of the pair of facing surfaces. in the petzval objective both have dispersive efiect, and the same obtains in steinheils portraiture antiplanet.the example of the improved objectiveshown in the drawing is described below by exact data as to radii, thicknesses, diaphragm intervals, and glasses employed. where particular conditions demand it, the glasses mentioned may be replaced by other kinds materially differing from them, and the forms of the lenses, as well as the order of their arrangement, may be departed from and still the construction kept within the bounds of the present invention.the objective shown is spherically corrected for a relative aperture of 1 :5.5. the anastigmatic flatness of the image extends to about sixty degrees.l l signify the glass lenses; d (1 their thicknesses at the axis; r w, the radii of the lens-surfaces b and b the distances from the diaphragm to the adjoining lens-fronts, and z the axial distance between the facing surfaces. the numerical values of radii, thicknesses, and distances relate to the focal length of the whole objective as to the unit. simple multiplication of these values by the focal length required supplies the data of construction for an objective of the desired focus. the glasses used are denoted by n, if, and m referring, respectively, to the d and f line of the solar spectrum and the hy line of the hydrogen spectrum.the objective shown consists of the single lenses l l l and l. l and l possess collective, l and l dispersive, effect. the group l l is separated by the diaphragm b from the group l l. there is an air-space between l and l and the effect of the pair of facing surfaces 'r r bounding this space is dispersive. l and l are cemented together at the surface 1\", which cemented surface has collective efiect.radiz. thick'nesses and distances.l l-*. l lwhat i claim as -----> my !!!  -----> invention !!! , and desire to secure by letters patent, is-a spherically, chromatically and astigmatically corrected objective, consisting of four lenses separated by the diaphragm into two groups each of two lenses, of which groups one includes a pair of facing surfaces and the other a cemented surface, the power of the pair of facing surfaces being negative and that of the cemented surface positive.in testimony whereof i have signed -----> my !!!  name to this specification in the presence of two subscribing witnesses.paul rudolph.witnesses:emil donitz, paul krüger. edited september 25, 2017 by schattenundlicht", "sortedWord": "None", "Identifyer": null, "identifyer": 38056, "year": "2017"}], "name": "Leicasortedout2017invention"}