{"interestingcomments": [{"autor": "hoppyman", "date": "2018-10-31 20:43:00", "content": "I would be very surprised if the price for a used Typ 007 dropped as sharply as you hope there when the S3 starts to become available. I guess that might vary according to the marketplace where you can shop too? The price for that one is unknown currently of course but I would guess it will be quite a bit more expensive. It might be some time before anyone starts to replace their current S, if many do. i shoot primarily in studio with the S. If it’s of interest you can browse my portrait galleries here: The filenames starting with S . You would have to scroll back a fair way to see shots with the Typ 006 or S2 http://www.pbase.com/hoppyman/cp I process DNG in Lightroom and use the Adobe Standard profile as the basis of my developing. I think the embedded profile is mainly of interest were you not shooting DNG. Really there are so many variables that can influence how the files are rendered from subject to light to profile to develop settings to viewing hardware etc , I think it would be very difficult to make any firm conclusions from comparisons. Some forum members express a preference for the images from the earlier sensor too. I am an amateur but I have shot a fair volume of photos with the S system. I have never seen a dramatic difference as far as that goes. Other factors like dynamic range are more significant to me. Perhaps you might have an opportunity to rent an S to see if its suited you best over the Pentax? I can't comment anything about that one or Capture One. Edited October 31, 2018 by hoppyman", "link": "https://www.l-camera-forum.com/topic/291048-s007-dng-portrait-samples/?tab=comments#comment-3623291", "origin": "L-forum", "suborigin": "291048-s007-dng-portrait-samples", "result": true, "Selector": "my developing", "selectorShort": "developing", "MarkedSent": "i would be very surprised if the price for a used typ 007 dropped as sharply as you hope there when the s3 starts to become available. i guess that might vary according to the marketplace where you can shop too? the price for that one is unknown currently of course but i would guess it will be quite a bit more expensive. it might be some time before anyone starts to replace their current s, if many do. i shoot primarily in studio with the s. if it’s of interest you can browse my portrait galleries here: the filenames starting with s . you would have to scroll back a fair way to see shots with the typ 006 or s2 http://www.pbase.com/hoppyman/cp i process dng in lightroom and use the adobe standard profile as the basis of -----> my !!!  -----> developing !!! . i think the embedded profile is mainly of interest were you not shooting dng. really there are so many variables that can influence how the files are rendered from subject to light to profile to develop settings to viewing hardware etc , i think it would be very difficult to make any firm conclusions from comparisons. some forum members express a preference for the images from the earlier sensor too. i am an amateur but i have shot a fair volume of photos with the s system. i have never seen a dramatic difference as far as that goes. other factors like dynamic range are more significant to me. perhaps you might have an opportunity to rent an s to see if its suited you best over the pentax? i can't comment anything about that one or capture one. edited october 31, 2018 by hoppyman", "sortedWord": "None", "Identifyer": null, "identifyer": 31829, "year": "2018"}], "name": "Leicasortedout2018developing"}