{"interestingcomments": [{"autor": "Jeff S", "date": "2019-09-24 01:58:00", "content": "On 9/9/2019 at 12:30 PM, wilfredo said: Even after Post Processing with Silver Efex Pro, I was not satisfied. I realize that Monochrom Type I users are a minority within a minority of Leica photographers. It's not a camera for the general public, or even Leica fans at large, hence Leica sees no profit in CCD sensors. Leica (like all business enterprises) follows the money. We (MMI shooters) see what we see - even when others don't see. Stefan Daniel recently said this about CCD technology and rendering when recently interviewed for the 10 year anniversary of the M9 (Google translation)... “In 2009, CMOS sensors had already begun to take precedence over CCDs. Why still opt for CCD technology, and why at Kodak in particular? [Laughs] That's pretty funny because today I still get requests for a new M with a CCD. Some photographers seem to like, and regret, the rendering of the CCD. But as for why we stayed on CCD in the M9, it's very simple: Kodak, at that time, was the only company that wanted to customize a sensor with the network of micro-lenses that we had designed. So, the choice was quickly made since it was the only one. In any case, even in 2019, I'm sure that if we released a Leica M CCD sensor, it would sell to some fans of the CCD look. But it's not in the program and, in any case, technology no longer exists.Finally, it has not completely disappeared, since it is still used in some industrial sensors, but for photography, the CCD has completely disappeared. In any case, today, this technology would have no interest compared to CMOS. Most importantly, it is the image processing algorithms that have the most influence on color rendering than the sensor technology itself. It also depends on the photographer's eye and some placebo effect. I'm sure if today we were doing a blind test between two images taken with a CCD and a CMOS, most people who would see these images can not say which one corresponds to which sensor. In my opinion, it is more a story of image processing than technology.” https://translate.googleusercontent.com/translate_c?depth=1&hl=fr&nv=1&rurl=translate.google.fr&sl=fr&sp=nmt4&tl=en&u=http://mizuwari.fr/index.php/2019/09/09/le-leica-m9-a-dix-ans-entretien-avec-stefan-daniel-pere-du-premier-hybride-24-x-36-mm/&xid=17259,15700022,15700186,15700190,15700256,15700259,15700262,15700265&usg=ALkJrhiyb6JjbH47lU-OAfztxN44T2T1Bw", "link": "https://www.l-camera-forum.com/topic/281741-m10m-will-have-what/page/2/?tab=comments#comment-3825122", "origin": "L-forum", "suborigin": "281741-m10m-will-have-what", "result": true, "Selector": "we had designed", "selectorShort": "design", "MarkedSent": "on 9/9/2019 at 12:30 pm, wilfredo said: even after post processing with silver efex pro, i was not satisfied. i realize that monochrom type i users are a minority within a minority of leica photographers. it's not a camera for the general public, or even leica fans at large, hence leica sees no profit in ccd sensors. leica (like all business enterprises) follows the money. we (mmi shooters) see what we see - even when others don't see. stefan daniel recently said this about ccd technology and rendering when recently interviewed for the 10 year anniversary of the m9 (google translation)... “in 2009, cmos sensors had already begun to take precedence over ccds. why still opt for ccd technology, and why at kodak in particular? [laughs] that's pretty funny because today i still get requests for a new m with a ccd. some photographers seem to like, and regret, the rendering of the ccd. but as for why -----> we !!!  stayed on ccd in the m9, it's very simple: kodak, at that time, was the only company that wanted to customize a sensor with the network of micro-lenses that -----> we !!!  -----> had !!!  -----> designed !!! . so, the choice was quickly made since it was the only one. in any case, even in 2019, i'm sure that if we released a leica m ccd sensor, it would sell to some fans of the ccd look. but it's not in the program and, in any case, technology no longer exists.finally, it has not completely disappeared, since it is still used in some industrial sensors, but for photography, the ccd has completely disappeared. in any case, today, this technology would have no interest compared to cmos. most importantly, it is the image processing algorithms that have the most influence on color rendering than the sensor technology itself. it also depends on the photographer's eye and some placebo effect. i'm sure if today we were doing a blind test between two images taken with a ccd and a cmos, most people who would see these images can not say which one corresponds to which sensor. in my opinion, it is more a story of image processing than technology.” https://translate.googleusercontent.com/translate_c?depth=1&hl=fr&nv=1&rurl=translate.google.fr&sl=fr&sp=nmt4&tl=en&u=http://mizuwari.fr/index.php/2019/09/09/le-leica-m9-a-dix-ans-entretien-avec-stefan-daniel-pere-du-premier-hybride-24-x-36-mm/&xid=17259,15700022,15700186,15700190,15700256,15700259,15700262,15700265&usg=alkjrhiyb6jjbh47lu-oafztxn44t2t1bw", "sortedWord": "None", "Identifyer": null, "identifyer": 29026, "year": "2019"}, {"autor": "rivi1969", "date": "2019-08-03 13:27:00", "content": "7 minutes ago, ianman said: Well, the first sentence was pretty clear but wrong as Jono was given wrong information, and I think the new one is not clear. It just adds confusion and doesn't add any real information. I would either leave out the text between parenthesis or write \"(2000 is very low)\". Jono was not giving wrong information. Leica Customer service told me the same thing about the M9 50,000 life expectancy. Funny that people in this forums know better than Leica itself about their products. “Expectancy” doesn’t mean they will suddenly die at click 50001. Quote from the email I got: ”The shutter have all less than 2000 shots. We design it to last for 50,000.” 🤔 Edited August 3, 2019 by rivi1969", "link": "https://www.l-camera-forum.com/topic/299868-m9-shutter-life-expectancy/page/2/?tab=comments#comment-3790532", "origin": "L-forum", "suborigin": "299868-m9-shutter-life-expectancy", "result": true, "Selector": "we design", "selectorShort": "design", "MarkedSent": "7 minutes ago, ianman said: well, the first sentence was pretty clear but wrong as jono was given wrong information, and i think the new one is not clear. it just adds confusion and doesn't add any real information. i would either leave out the text between parenthesis or write \"(2000 is very low)\". jono was not giving wrong information. leica customer service told me the same thing about the m9 50,000 life expectancy. funny that people in this forums know better than leica itself about their products. “expectancy” doesn’t mean they will suddenly die at click 50001. quote from the email i got: ”the shutter have all less than 2000 shots. -----> we !!!  -----> design !!!  it to last for 50,000.” 🤔 edited august 3, 2019 by rivi1969", "sortedWord": "None", "Identifyer": null, "identifyer": 35146, "year": "2019"}, {"autor": "Charadis", "date": "2019-08-04 05:57:00", "content": "16 hours ago, rivi1969 said: Jono was not giving wrong information. Leica Customer service told me the same thing about the M9 50,000 life expectancy. Funny that people in this forums know better than Leica itself about their products. “Expectancy” doesn’t mean they will suddenly die at click 50001. Quote from the email I got: ”The shutter have all less than 2000 shots. We design it to last for 50,000.” 🤔 I got the same email mentioning this, which made me concerned at first. Having never owned a rangefinder before, it definitely leaves me wondering if a refurbed M9 should be my first", "link": "https://www.l-camera-forum.com/topic/299868-m9-shutter-life-expectancy/page/2/?tab=comments#comment-3790961", "origin": "L-forum", "suborigin": "299868-m9-shutter-life-expectancy", "result": true, "Selector": "we design", "selectorShort": "design", "MarkedSent": "16 hours ago, rivi1969 said: jono was not giving wrong information. leica customer service told me the same thing about the m9 50,000 life expectancy. funny that people in this forums know better than leica itself about their products. “expectancy” doesn’t mean they will suddenly die at click 50001. quote from the email i got: ”the shutter have all less than 2000 shots. -----> we !!!  -----> design !!!  it to last for 50,000.” 🤔 i got the same email mentioning this, which made me concerned at first. having never owned a rangefinder before, it definitely leaves me wondering if a refurbed m9 should be my first", "sortedWord": "None", "Identifyer": null, "identifyer": 35150, "year": "2019"}, {"autor": "105012", "date": "2019-02-04 08:01:00", "content": "I have a couple of these, mine are not open-ended in the middle. They are quite large and they require the lenses to be in one particular rotational position in order to engage. I painted a red dot to signify the position to save time. In the end, I designed my own much smaller ones that accept the lens in any rotation and 3D printed them.", "link": "https://www.l-camera-forum.com/topic/293969-optech-double-lens-mount-cap/?tab=comments#comment-3677759", "origin": "L-forum", "suborigin": "293969-optech-double-lens-mount-cap", "result": true, "Selector": "i designed", "selectorShort": "design", "MarkedSent": "i have a couple of these, mine are not open-ended in the middle. they are quite large and they require the lenses to be in one particular rotational position in order to engage. i painted a red dot to signify the position to save time. in the end, -----> i !!!  -----> designed !!!  my own much smaller ones that accept the lens in any rotation and 3d printed them.", "sortedWord": "None", "Identifyer": null, "identifyer": 20882, "year": "2019"}, {"autor": "dkCambridgeshire", "date": "2019-03-24 13:59:00", "content": " Yesterday I used auto extension tubes on a non-Leica camera with an AF telephoto zoom lens to obtain the attached bank vole image. I've been struggling with manual focus Leica R lenses and Leica R tubes to obtain similar images but with only limited success. Using the AF c/u system yesterday was a revelation and a pleasure compared to using my SL with Leica R manual focus tubes. Extension tubes have always been a priority with most other manufacturers' systems but so far the new 'L' mount partnership does not offer any 'tubes'. If I could buy L mount auto-tubes I'd willingly buy e.g. an SL 90-280mm lens. Some might suggest using achromatic supplementary close-up lenses but fully auto 'tubes' have their advantages … not least their compatibility with the whole range of 'L' mount lenses (including APS-C TL lenses). Designing a set of fully auto L-mount extension tubes should be a fairly straightforward exercise - and they'd likely sell very well too. Would anyone else like a set if they were available? dunk Trying to photograph fast moving small mammals from a respectable subject distance 'in the field' is very difficult unless a camera system offers AF extension tubes. --img-- ", "link": "https://www.l-camera-forum.com/topic/295523-anyone-need-a-set-of-l-mount-auto-extension-tubes/?tab=comments#comment-3708414", "origin": "L-forum", "suborigin": "295523-anyone-need-a-set-of-l-mount-auto-extension-tubes", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": " yesterday i used auto extension tubes on a non-leica camera with an af telephoto zoom lens to obtain the attached bank vole image. i've been struggling with manual focus leica r lenses and leica r tubes to obtain similar images but with only limited success. using the af c/u system yesterday was a revelation and a pleasure compared to using my sl with leica r manual focus tubes. extension tubes have always been a priority with most other manufacturers' systems but so far the new 'l' mount partnership does not offer any 'tubes'. if i could buy l mount auto-tubes i'd willingly buy e.g. an sl 90-280mm lens. some might suggest using achromatic supplementary close-up lenses but fully auto 'tubes' have their advantages … not least their compatibility with the whole range of 'l' mount lenses (including aps-c tl lenses). -----> designing !!!  a set of fully auto l-mount extension tubes should be a fairly straightforward exercise - and they'd likely sell very well too. would anyone else like a set if they were available? dunk trying to photograph fast moving small mammals from a respectable subject distance 'in the field' is very difficult unless a camera system offers af extension tubes. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 49213, "year": "2019"}, {"autor": "LUF Admin", "date": "2019-02-04 13:07:00", "content": " Panasonic starts the Lumix S System with three lenses: LUMIX S PRO 50mm F1.4 LUMIX S 24-105mm F4 MACRO O.I.S. LUMIX S PRO 70-200mm F4 O.I.S. Here are some images and the official press release: LUMIX S PRO 50mm F1.4 Images --img--  --img--  LUMIX S 24-105mm F4 MACRO O.I.S. Images --img--  LUMIX S PRO 70-200mm F4 O.I.S. Images --img--  Zitat Panasonic Launches Three L-Mount Interchangeable Lenses for the LUMIX S Series Full-frame Digital Single Lens Mirrorless Camera LUMIX S PRO 50mm F1.4 (S-X50), LUMIX S PRO 70-200mm F4 O.I.S. (S-R70200) and LUMIX S 24-105mm F4 MACRO O.I.S. (S-R24105) Panasonic is proud to introduce three new interchangeable lenses based on the L-Mount system for the LUMIX S Series Full-frame Digital Single Lens Mirrorless Camera. Specially focusing on professional use, the LUMIX S Series pursues uncompromising photographic expression with its high-quality cameras and lenses. LUMIX S PRO 50mm F1.4 (S-X50) A large-aperture fixed focal length lens that forms the core of the LUMIX S Series of lenses LUMIX S PRO 70-200mm F4 O.I.S. (S-R70200) A telephoto zoom lens that features high resolution with stunning clarity across the entire zoom range LUMIX S 24-105mm F4 MACRO O.I.S. (S-R24105) A versatile standard zoom lens with macro shot capability covering wide-angle to medium telephoto The L-Mount is a lens mount for mirrorless cameras that was launched by Leica and is equally suitable for both the APS-C format and full-frame cameras. Leica Camera, Panasonic and Sigma are set to offer a user-friendly solution that will allow photographers to ‘mix and match’ any of the three manufacturers’ APS-C and full-frame cameras with any lens from each other’s product portfolios. The aim of the L-Mount Alliance is to provide customers with a diverse and future-proof range of products. The advantages are a large inner diameter of 51.6 mm that enables the realization of extremely fast lenses and extremely compact dimensions. The configuration of the lens-to-camera communication interface is future-proof and the L-Mount also offers an option for the construction of sealed systems that are insensitive to dust and moisture. The L-Mount thereby opens up an almost limitless spectrum of new creative possibilities. All interchangeable lenses of the LUMIX S Series provide high performance yet the “LUMIX S PRO” lenses further boast ultimate optical performance to be certified by LEICA for clearing stringent LEICA standards. Panasonic is committed to designing and developing 10 or more lenses with a focus on “LUMIX S PRO” lenses by 2020 and further expanding the S Series lens lineup. LUMIX S PRO 50mm F1.4 (S-X50) The LUMIX S PRO 50mm F1.4 is a large-aperture fixed focal length LUMIX S PRO lens that nucleates all LUMIX S Series lenses. Ensuring versatile use with its 50mm focal length and F1.4 high speed, the LUMIX S PRO 50mm F1.4 boasts stunningly high resolution and a descriptive performance from the center to the corners of the image despite its large aperture. It provides smooth defocus gradation from the focus peak to the neighboring area of the image. It also describes the point light sources in the background as impressive, beautiful bokeh. The optical performance of this LUMIX S PRO lens is outstandingly high to clear stringent LEICA standards. Comprising 13 lenses in 11 groups, the use of 2 aspherical lenses and 3 ED (Extra-low Dispersion) lenses effectively suppresses both axial chromatic aberration and chromatic aberration of magnification. Astigmatism is also corrected with those aspherical lenses, achieving high resolving performance. A double focus system combining a linear motor and stepping motor achieves sensor drive at a maximum speed of 480 fps. It realizes fast, high-precision AF to ensure that you will never miss a photo opportunity. Adoption of a focus clutch mechanism enables instant AF/MF switching and accurate manual focusing. The LUMIX S PRO 50mm F1.4 also excels in video recording performance with a mechanism that suppresses focus breathing, which was a fatal problem of all interchangeable lenses designed for still image photography. The refined design of the LUMIX S Series provides high operability as a tool for professionals. The rugged dust/splash-resistant* design withstand use under harsh conditions even in 10 degrees below zero for high mobility. The filter diameter is 77mm, with an 11-blade circular aperture diaphragm. *Dust and Splash Resistant does not guarantee that damage will not occur if this lens is subjected to direct contact with dust and water. LUMIX S PRO 70-200mm F4 O.I.S. (S-R70200) The second lens is also a LUMIX S PRO lens. The LUMIX S PRO 70-200mm F4 O.I.S. telephoto zoom lens provides high-resolution, high-contrast images across the entire zoom range. It can be used for wide-ranging situations, from portraits to sports. Panasonic LUMIX’s image stabilization system 5-Axis Dual I.S. (Image Stabilzier) 2*1 can be used with the LUMIX S PRO 70-200mm F4 O.I.S. for the first time as a lens of a full-frame mirrorless camera system, to ensure that you will never miss a photo opportunity. The optical performance of this LUMIX S PRO lens is outstandingly high to clear stringent LEICA standards. The lens unit comprises 23 lenses in 17 groups and the use of an aspherical lens and 3 ED (Extra- low Dispersion) lenses effectively suppresses both axial chromatic aberration and chromatic aberration of magnification. Designed in pursuit of optimum lens alignment, it achieves beautiful bokeh with minimum vignetting. The O.I.S. (Optical Image Stabilizer) in the lens effectively compensates for the hand-shake movement, making it easy to shoot even without a tripod or in low-lit situations. Complying with the camera’s Body I.S., the 5-Axis Dual I.S. 2*1 makes it possible to use 6-stop slower shutter speed*2. The high-precision linear motor achieves sensor drive at a maximum speed of 480 fps for fast auto focusing. The adoption of a focus clutch mechanism enables instant AF/MF switching and accurate manual focusing. The LUMIX S PRO 70-200mm F4 O.I.S. also excels in video recording performance with a mechanism that suppresses focus breathing, which was a fatal problem of all interchangeable lenses designed for still image photography. The refined design of the LUMIX S Series provides high operability as a tool for professionals. The rugged dust/splash-resistant*3 design withstand use under harsh conditions even in 10 degrees below zero for high mobility. The filter diameter is 77mm, with a 9-blade circular aperture diaphragm. *1 5-Axis Dual I.S. 2 can be used with the camera LUMIX S1R and S1, as of February 1, 2019. *2 Based on the CIPA standard [Yaw/Pitch direction: focusing distance f=200mm, when LUMIX S1R is used. *3 Dust and Splash Resistant does not guarantee that damage will not occur if this lens is subjected to direct contact with dust and water. LUMIX S 24-105mm F4 MACRO O.I.S. (S-R24105) The LUMIX S 24-105mm F4 MACRO O.I.S. is a versatile standard zoom lens covering wide-angle to medium-telephoto. It assures high descriptive performance across the entire zoom range. In addition to its versatile use with a wide and long zoom range, the LUMIX S 24-105mm F4 MACRO O.I.S. enables 0.5x macro shooting with a minimum focusing distance of 0.3m. Panasonic LUMIX’s image stabilization system 5-Axis Dual I.S. (Image Stabilzier) 2*1 can be used with LUMIX S 24-105mm F4 MACRO O.I.S. for the first time as a lens of full-frame mirrorless camera system, never to miss the photo opportunity. The lens unit comprises 16 lenses in 13 groups and the use of 2 aspherical lenses and 2 ED (Extra- low Dispersion) lenses effectively suppresses chromatic aberration and achieves high resolution. The O.I.S. (Optical Image Stabilizer) in the lens effectively compensates for the hand-shake movement, making it easy to shoot even without a tripod or in low-lit situations. Complying with the camera’s Body I.S., the 5-Axis Dual I.S. 2*1 makes it possible to use 6-stop slower shutter speed*2. The high-precision linear motor achieves sensor drive at a maximum speed of 480 fps for fast auto focusing. The LUMIX S 24-105mm F4 MACRO O.I.S. also excels in video recording performance with a mechanism that suppresses focus breathing, which was a fatal problem of all interchangeable lenses designed for still image photography. The refined design of the LUMIX S Series provides high operability as a tool for professionals. The rugged dust/splash-resistant*3 design withstand use under harsh conditions even in 10 degrees below zero for high mobility. In addition, a fluorine coating on the front element repel water and oil and prevent them from attaching. The filter diameter is 77mm, with a 9-blade circular aperture diaphragm. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/293985-three-lumix-s-l-mount-lenses/?tab=comments#comment-3677917", "origin": "L-forum", "suborigin": "293985-three-lumix-s-l-mount-lenses", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": " panasonic starts the lumix s system with three lenses: lumix s pro 50mm f1.4 lumix s 24-105mm f4 macro o.i.s. lumix s pro 70-200mm f4 o.i.s. here are some images and the official press release: lumix s pro 50mm f1.4 images --img--  --img--  lumix s 24-105mm f4 macro o.i.s. images --img--  lumix s pro 70-200mm f4 o.i.s. images --img--  zitat panasonic launches three l-mount interchangeable lenses for the lumix s series full-frame digital single lens mirrorless camera lumix s pro 50mm f1.4 (s-x50), lumix s pro 70-200mm f4 o.i.s. (s-r70200) and lumix s 24-105mm f4 macro o.i.s. (s-r24105) panasonic is proud to introduce three new interchangeable lenses based on the l-mount system for the lumix s series full-frame digital single lens mirrorless camera. specially focusing on professional use, the lumix s series pursues uncompromising photographic expression with its high-quality cameras and lenses. lumix s pro 50mm f1.4 (s-x50) a large-aperture fixed focal length lens that forms the core of the lumix s series of lenses lumix s pro 70-200mm f4 o.i.s. (s-r70200) a telephoto zoom lens that features high resolution with stunning clarity across the entire zoom range lumix s 24-105mm f4 macro o.i.s. (s-r24105) a versatile standard zoom lens with macro shot capability covering wide-angle to medium telephoto the l-mount is a lens mount for mirrorless cameras that was launched by leica and is equally suitable for both the aps-c format and full-frame cameras. leica camera, panasonic and sigma are set to offer a user-friendly solution that will allow photographers to ‘mix and match’ any of the three manufacturers’ aps-c and full-frame cameras with any lens from each other’s product portfolios. the aim of the l-mount alliance is to provide customers with a diverse and future-proof range of products. the advantages are a large inner diameter of 51.6 mm that enables the realization of extremely fast lenses and extremely compact dimensions. the configuration of the lens-to-camera communication interface is future-proof and the l-mount also offers an option for the construction of sealed systems that are insensitive to dust and moisture. the l-mount thereby opens up an almost limitless spectrum of new creative possibilities. all interchangeable lenses of the lumix s series provide high performance yet the “lumix s pro” lenses further boast ultimate optical performance to be certified by leica for clearing stringent leica standards. panasonic is committed to designing and developing 10 or more lenses with a focus on “lumix s pro” lenses by 2020 and further expanding the s series lens lineup. lumix s pro 50mm f1.4 (s-x50) the lumix s pro 50mm f1.4 is a large-aperture fixed focal length lumix s pro lens that nucleates all lumix s series lenses. ensuring versatile use with its 50mm focal length and f1.4 high speed, the lumix s pro 50mm f1.4 boasts stunningly high resolution and a descriptive performance from the center to the corners of the image despite its large aperture. it provides smooth defocus gradation from the focus peak to the neighboring area of the image. it also describes the point light sources in the background as impressive, beautiful bokeh. the optical performance of this lumix s pro lens is outstandingly high to clear stringent leica standards. comprising 13 lenses in 11 groups, the use of 2 aspherical lenses and 3 ed (extra-low dispersion) lenses effectively suppresses both axial chromatic aberration and chromatic aberration of magnification. astigmatism is also corrected with those aspherical lenses, achieving high resolving performance. a double focus system combining a linear motor and stepping motor achieves sensor drive at a maximum speed of 480 fps. it realizes fast, high-precision af to ensure that you will never miss a photo opportunity. adoption of a focus clutch mechanism enables instant af/mf switching and accurate manual focusing. the lumix s pro 50mm f1.4 also excels in video recording performance with a mechanism that suppresses focus breathing, which was a fatal problem of all interchangeable lenses designed for still image photography. the refined design of the lumix s series provides high operability as a tool for professionals. the rugged dust/splash-resistant* design withstand use under harsh conditions even in 10 degrees below zero for high mobility. the filter diameter is 77mm, with an 11-blade circular aperture diaphragm. *dust and splash resistant does not guarantee that damage will not occur if this lens is subjected to direct contact with dust and water. lumix s pro 70-200mm f4 o.i.s. (s-r70200) the second lens is also a lumix s pro lens. the lumix s pro 70-200mm f4 o.i.s. telephoto zoom lens provides high-resolution, high-contrast images across the entire zoom range. it can be used for wide-ranging situations, from portraits to sports. panasonic lumix’s image stabilization system 5-axis dual i.s. (image stabilzier) 2*1 can be used with the lumix s pro 70-200mm f4 o.i.s. for the first time as a lens of a full-frame mirrorless camera system, to ensure that you will never miss a photo opportunity. the optical performance of this lumix s pro lens is outstandingly high to clear stringent leica standards. the lens unit comprises 23 lenses in 17 groups and the use of an aspherical lens and 3 ed (extra- low dispersion) lenses effectively suppresses both axial chromatic aberration and chromatic aberration of magnification. -----> designed !!!  in pursuit of optimum lens alignment, it achieves beautiful bokeh with minimum vignetting. the o.i.s. (optical image stabilizer) in the lens effectively compensates for the hand-shake movement, making it easy to shoot even without a tripod or in low-lit situations. complying with the camera’s body i.s., the 5-axis dual i.s. 2*1 makes it possible to use 6-stop slower shutter speed*2. the high-precision linear motor achieves sensor drive at a maximum speed of 480 fps for fast auto focusing. the adoption of a focus clutch mechanism enables instant af/mf switching and accurate manual focusing. the lumix s pro 70-200mm f4 o.i.s. also excels in video recording performance with a mechanism that suppresses focus breathing, which was a fatal problem of all interchangeable lenses designed for still image photography. the refined design of the lumix s series provides high operability as a tool for professionals. the rugged dust/splash-resistant*3 design withstand use under harsh conditions even in 10 degrees below zero for high mobility. the filter diameter is 77mm, with a 9-blade circular aperture diaphragm. *1 5-axis dual i.s. 2 can be used with the camera lumix s1r and s1, as of february 1, 2019. *2 based on the cipa standard [yaw/pitch direction: focusing distance f=200mm, when lumix s1r is used. *3 dust and splash resistant does not guarantee that damage will not occur if this lens is subjected to direct contact with dust and water. lumix s 24-105mm f4 macro o.i.s. (s-r24105) the lumix s 24-105mm f4 macro o.i.s. is a versatile standard zoom lens covering wide-angle to medium-telephoto. it assures high descriptive performance across the entire zoom range. in addition to its versatile use with a wide and long zoom range, the lumix s 24-105mm f4 macro o.i.s. enables 0.5x macro shooting with a minimum focusing distance of 0.3m. panasonic lumix’s image stabilization system 5-axis dual i.s. (image stabilzier) 2*1 can be used with lumix s 24-105mm f4 macro o.i.s. for the first time as a lens of full-frame mirrorless camera system, never to miss the photo opportunity. the lens unit comprises 16 lenses in 13 groups and the use of 2 aspherical lenses and 2 ed (extra- low dispersion) lenses effectively suppresses chromatic aberration and achieves high resolution. the o.i.s. (optical image stabilizer) in the lens effectively compensates for the hand-shake movement, making it easy to shoot even without a tripod or in low-lit situations. complying with the camera’s body i.s., the 5-axis dual i.s. 2*1 makes it possible to use 6-stop slower shutter speed*2. the high-precision linear motor achieves sensor drive at a maximum speed of 480 fps for fast auto focusing. the lumix s 24-105mm f4 macro o.i.s. also excels in video recording performance with a mechanism that suppresses focus breathing, which was a fatal problem of all interchangeable lenses designed for still image photography. the refined design of the lumix s series provides high operability as a tool for professionals. the rugged dust/splash-resistant*3 design withstand use under harsh conditions even in 10 degrees below zero for high mobility. in addition, a fluorine coating on the front element repel water and oil and prevent them from attaching. the filter diameter is 77mm, with a 9-blade circular aperture diaphragm. --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 51499, "year": "2019"}, {"autor": "MEB", "date": "2019-05-03 21:52:00", "content": "Eli Broad Art Museum on the campus of Michigan State University. Designed by Zaha Hadid. Even after 7 years of living near this astonishing structure, I cannot figure out the best way to photograph it. The exterior is entirely stainless steel and glass and, to the best of my knowledge, there is not a right angle in the entire building. Q2. Thanks for looking, Mark. --img-- ", "link": "https://www.l-camera-forum.com/topic/303026-leica-q2-images-post-them-here/page/16/?tab=comments#comment-3734197", "origin": "L-forum", "suborigin": "303026-leica-q2-images-post-them-here", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "eli broad art museum on the campus of michigan state university. -----> designed !!!  by zaha hadid. even after 7 years of living near this astonishing structure, i cannot figure out the best way to photograph it. the exterior is entirely stainless steel and glass and, to the best of my knowledge, there is not a right angle in the entire building. q2. thanks for looking, mark. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 52386, "year": "2019"}, {"autor": "syam", "date": "2019-08-06 06:07:00", "content": "Thanks for the tips! Current progress on revision 1 of the top and bottom shells. --img--  --img--  A couple of features I've designed into the case so far: 1. Protection on all sides and corners 2. Battery Door Access 3. Peak Design Plate Mount 4. Front finger grip 5. Rear thumb grip 6. Diopter Adjuster Block-off 7. Power Switch Block to stop it at S (preventing switching into C since I never use continuous mode) The plan now is to 3D print the 2 part case and test the ergonomics and tolerances of the parts. Will also be lining the inside with a soft thin material to avoid scratching. Please keep the comments and feedback coming. Thanks. Edited August 6, 2019 by syam adding pictures and text", "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/?tab=comments#comment-3792213", "origin": "L-forum", "suborigin": "299948-my-first-leica-q-designing-a-case", "result": true, "Selector": "i've designed", "selectorShort": "design", "MarkedSent": "thanks for the tips! current progress on revision 1 of the top and bottom shells. --img--  --img--  a couple of features -----> i !!! 've -----> designed !!!  into the case so far: 1. protection on all sides and corners 2. battery door access 3. peak design plate mount 4. front finger grip 5. rear thumb grip 6. diopter adjuster block-off 7. power switch block to stop it at s (preventing switching into c since i never use continuous mode) the plan now is to 3d print the 2 part case and test the ergonomics and tolerances of the parts. will also be lining the inside with a soft thin material to avoid scratching. please keep the comments and feedback coming. thanks. edited august 6, 2019 by syam adding pictures and text", "sortedWord": "None", "Identifyer": null, "identifyer": 6568, "year": "2019"}, {"autor": "Matsaly", "date": "2019-08-06 16:32:00", "content": " 10 hours ago, syam said: Thanks for the tips! Current progress on revision 1 of the top and bottom shells. --img-- --img--  --img-- --img--  A couple of features I've designed into the case so far: 6. Diopter Adjuster Block-off 7. Power Switch Block to stop it at S (preventing switching into C since I never use continuous mode) Interesting design concept. Can you elaborate on what you mean on \"6. Diopter Adjuster Block-off.\" Re 7. Power switch block. Not sure users want to have C mode blocked off. While I rarely use C mode, I still want occasional access to it. On my Q-P I managed to wedge a small diameter \"O ring\" underneath the shutter release which provides enough resistance to avoid inadvertently selecting C mode but still allows one to choose C mode if desired. Would silicone or a \"grippy\" rubbery material be an option for your design? Just an idea.", "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/?tab=comments#comment-3792506", "origin": "L-forum", "suborigin": "299948-my-first-leica-q-designing-a-case", "result": true, "Selector": "i've designed", "selectorShort": "design", "MarkedSent": " 10 hours ago, syam said: thanks for the tips! current progress on revision 1 of the top and bottom shells. --img-- --img--  --img-- --img--  a couple of features -----> i !!! 've -----> designed !!!  into the case so far: 6. diopter adjuster block-off 7. power switch block to stop it at s (preventing switching into c since i never use continuous mode) interesting design concept. can you elaborate on what you mean on \"6. diopter adjuster block-off.\" re 7. power switch block. not sure users want to have c mode blocked off. while i rarely use c mode, i still want occasional access to it. on my q-p i managed to wedge a small diameter \"o ring\" underneath the shutter release which provides enough resistance to avoid inadvertently selecting c mode but still allows one to choose c mode if desired. would silicone or a \"grippy\" rubbery material be an option for your design? just an idea.", "sortedWord": "None", "Identifyer": null, "identifyer": 6571, "year": "2019"}, {"autor": "peterv", "date": "2019-02-25 18:12:00", "content": "From the interview linked above: Stephan Schulz: \"Our L-mount is 51.6 millimeter in diameter, so that's big enough for any design we could wish to design. This was checked by Peter Karbe and his team many, many years ago to make any lens you can dream about. It's big enough for the full-frame, and this L-mount was made for full frame. Surely at the time they must have considered squeezing a Leica Pro Format sensor in there.", "link": "https://www.l-camera-forum.com/topic/294431-forthcoming-s-lenses/page/5/?tab=comments#comment-3690850", "origin": "L-forum", "suborigin": "294431-forthcoming-s-lenses", "result": true, "Selector": "we could wish to design", "selectorShort": "design", "MarkedSent": "from the interview linked above: stephan schulz: \"our l-mount is 51.6 millimeter in diameter, so that's big enough for any -----> design !!!  -----> we !!!  -----> could !!!  -----> wish !!!  -----> to !!!  -----> design !!! . this was checked by peter karbe and his team many, many years ago to make any lens you can dream about. it's big enough for the full-frame, and this l-mount was made for full frame. surely at the time they must have considered squeezing a leica pro format sensor in there.", "sortedWord": "None", "Identifyer": null, "identifyer": 31259, "year": "2019"}, {"autor": "Jeff S", "date": "2019-02-25 18:21:00", "content": " 5 minutes ago, peterv said: From the interview linked above: Stephan Schulz: \"Our L-mount is 51.6 millimeter in diameter, so that's big enough for any design we could wish to design. This was checked by Peter Karbe and his team many, many years ago to make any lens you can dream about. It's big enough for the full-frame, and this L-mount was made for full frame. Surely at the time they must have considered squeezing a Leica Pro Format sensor in there. Stephan made a similar comment about full frame in a 2018 Photokina interview, essentially taking a shot at Sony, et. al... https://www.reddotforum.com/content/2018/09/photokina-2018-details-on-the-l-mount-alliance/ Jeff", "link": "https://www.l-camera-forum.com/topic/294431-forthcoming-s-lenses/page/5/?tab=comments#comment-3690857", "origin": "L-forum", "suborigin": "294431-forthcoming-s-lenses", "result": true, "Selector": "we could wish to design", "selectorShort": "design", "MarkedSent": " 5 minutes ago, peterv said: from the interview linked above: stephan schulz: \"our l-mount is 51.6 millimeter in diameter, so that's big enough for any -----> design !!!  -----> we !!!  -----> could !!!  -----> wish !!!  -----> to !!!  -----> design !!! . this was checked by peter karbe and his team many, many years ago to make any lens you can dream about. it's big enough for the full-frame, and this l-mount was made for full frame. surely at the time they must have considered squeezing a leica pro format sensor in there. stephan made a similar comment about full frame in a 2018 photokina interview, essentially taking a shot at sony, et. al... https://www.reddotforum.com/content/2018/09/photokina-2018-details-on-the-l-mount-alliance/ jeff", "sortedWord": "None", "Identifyer": null, "identifyer": 31260, "year": "2019"}], "name": "Leicasortedout2019design"}