{"interestingcomments": [{"autor": "too old to care", "date": "2011-08-23 01:02:00", "content": " The 501C came this afternoon. I loaded it and took it to the park and shot a roll of film. After that I developed it and currently it is drying in the basement. Later I am going to print a couple of 11x14's to judge the sharpness. So far all is well. I now know why so many Leica owners also have Hasselblads. I think I am really going to like this camera. Thanks again for the suggestions. Oh, I also forgot how nice it is to work with a large negative. Wayne", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/6/?tab=comments#comment-1772784", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": " the 501c came this afternoon. i loaded it and took it to the park and shot a roll of film. after that -----> i !!!  -----> developed !!!  it and currently it is drying in the basement. later i am going to print a couple of 11x14's to judge the sharpness. so far all is well. i now know why so many leica owners also have hasselblads. i think i am really going to like this camera. thanks again for the suggestions. oh, i also forgot how nice it is to work with a large negative. wayne", "sortedWord": "None", "Identifyer": null, "identifyer": 103214, "year": "2011"}, {"autor": "pico", "date": "2011-08-23 01:15:00", "content": "The 501C came this afternoon. I loaded it and took it to the park and shot a roll of film. After that I developed it and currently it is drying in the basement. Later I am going to print a couple of 11x14's to judge the sharpness. So far all is well. I now know why so many Leica owners also have Hasselblads. I think I am really going to like this camera. Thanks again for the suggestions. Oh, I also forgot how nice it is to work with a large negative. Wayne Please keep in mind that 'infininty' on a and 501 is very far away. I still find it necessary to focus carefully at distant subjects. I will look carefully for such in your photos.", "link": "https://www.l-camera-forum.com/topic/159392-how-many-leica-owners-also-have-a-hasselblad/page/6/?tab=comments#comment-1772790", "origin": "L-forum", "suborigin": "159392-how-many-leica-owners-also-have-a-hasselblad", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "the 501c came this afternoon. i loaded it and took it to the park and shot a roll of film. after that -----> i !!!  -----> developed !!!  it and currently it is drying in the basement. later i am going to print a couple of 11x14's to judge the sharpness. so far all is well. i now know why so many leica owners also have hasselblads. i think i am really going to like this camera. thanks again for the suggestions. oh, i also forgot how nice it is to work with a large negative. wayne please keep in mind that 'infininty' on a and 501 is very far away. i still find it necessary to focus carefully at distant subjects. i will look carefully for such in your photos.", "sortedWord": "None", "Identifyer": null, "identifyer": 103215, "year": "2011"}], "name": "Leicasortedout2011develop"}