{"interestingcomments": [{"autor": "TheGodParticle/Hari", "date": "2015-08-24 00:38:00", "content": "28/2 chrom 35/1.4 steel rim with OLLUX 35/1.4FLE chrom 35/2.8 Summaron black paint 50/1.4 E43 v1 black paint 50/2 rigid black paint 90/1 prototyp", "link": "https://www.l-camera-forum.com/topic/247194-which-m-lenses-do-you-want-to-own/page/6/?tab=comments#comment-2876207", "origin": "L-forum", "suborigin": "247194-which-m-lenses-do-you-want-to-own", "result": true, "Selector": "prototyp", "selectorShort": "prototyp", "MarkedSent": "28/2 chrom 35/1.4 steel rim with ollux 35/1.4fle chrom 35/2.8 summaron black paint 50/1.4 e43 v1 black paint 50/2 rigid black paint 90/1 -----> prototyp !!! ", "sortedWord": "None", "Identifyer": null, "identifyer": 20001, "year": "2015"}, {"autor": "michaelwj", "date": "2015-12-05 10:37:00", "content": "28/2 chrom 35/1.4 steel rim with OLLUX 35/1.4FLE chrom 35/2.8 Summaron black paint 50/1.4 E43 v1 black paint 50/2 rigid black paint 90/1 prototyp So just the common, easy to find, really cheap lenses that were made in huge quantities? Cheers, Michael", "link": "https://www.l-camera-forum.com/topic/247194-which-m-lenses-do-you-want-to-own/page/7/?tab=comments#comment-2942950", "origin": "L-forum", "suborigin": "247194-which-m-lenses-do-you-want-to-own", "result": true, "Selector": "prototyp", "selectorShort": "prototyp", "MarkedSent": "28/2 chrom 35/1.4 steel rim with ollux 35/1.4fle chrom 35/2.8 summaron black paint 50/1.4 e43 v1 black paint 50/2 rigid black paint 90/1 -----> prototyp !!!  so just the common, easy to find, really cheap lenses that were made in huge quantities? cheers, michael", "sortedWord": "None", "Identifyer": null, "identifyer": 20022, "year": "2015"}, {"autor": "M9reno", "date": "2015-09-13 14:26:00", "content": "Ed, I've finally managed to secure Wilhelm Albert's volume, as well as a bound photocopy of the Hahne List. The former is decidedly very interesting: Albert's documentation (mostly consisting of 175 picture pages) of Leitz's prototypes from 1927 to 1961. Many of these items reappear in Lars Netopil's lavishly illustrated \"Prototyp Leica\" (2010) - a book to be consulted alongside Albert's. Both books are precious documents of the rich material that Leica Camera AG raided from its own factory museum in 2003, selling off to private collectors during those dark days of imminent bankruptcy - Netopil documents the trove of presumably the largest of these collectors, the Thai millionaire Surat Osathanugrah. (Incidentally, I wonder what will or has happened to Mr. Osathanugrah's collection since his death in 2008 - alas, irretrievably dispersed?) In any case, since today's factory museum in Wetzlar is a poor shadow of what it once was, and the company pays little more than commercial lip-service to 'old Leicas' (as reflected pitifully in the recent company policy not to service any equipment from before 1960!), these are hugely important books for anyone interested in photographic history. They document the enormous variety and evolutionary vigour of the Leica ecosystem before and after World War II, and would be a salutary reminder to any company (including Leica, if it would only pay attention) that it should never have complacent ideas of its perceived position on an evolutionary 'ladder': \"Look in the mirror, and don't be tempted to equate transient domination with either intrinsic superiority or prospects for extended survival.\" (Stephen Jay Gould)", "link": "https://www.l-camera-forum.com/topic/235927-leica-books/?tab=comments#comment-2887342", "origin": "L-forum", "suborigin": "235927-leica-books", "result": true, "Selector": "prototyp", "selectorShort": "prototyp", "MarkedSent": "ed, i've finally managed to secure wilhelm albert's volume, as well as a bound photocopy of the hahne list. the former is decidedly very interesting: albert's documentation (mostly consisting of 175 picture pages) of leitz's prototypes from 1927 to 1961. many of these items reappear in lars netopil's lavishly illustrated \"-----> prototyp !!!  leica\" (2010) - a book to be consulted alongside albert's. both books are precious documents of the rich material that leica camera ag raided from its own factory museum in 2003, selling off to private collectors during those dark days of imminent bankruptcy - netopil documents the trove of presumably the largest of these collectors, the thai millionaire surat osathanugrah. (incidentally, i wonder what will or has happened to mr. osathanugrah's collection since his death in 2008 - alas, irretrievably dispersed?) in any case, since today's factory museum in wetzlar is a poor shadow of what it once was, and the company pays little more than commercial lip-service to 'old leicas' (as reflected pitifully in the recent company policy not to service any equipment from before 1960!), these are hugely important books for anyone interested in photographic history. they document the enormous variety and evolutionary vigour of the leica ecosystem before and after world war ii, and would be a salutary reminder to any company (including leica, if it would only pay attention) that it should never have complacent ideas of its perceived position on an evolutionary 'ladder': \"look in the mirror, and don't be tempted to equate transient domination with either intrinsic superiority or prospects for extended survival.\" (stephen jay gould)", "sortedWord": "None", "Identifyer": null, "identifyer": 128118, "year": "2015"}], "name": "Leicasortedout2015prototyp"}