{"interestingcomments": [{"autor": "chrism", "date": "2012-08-04 14:50:00", "content": " I finally got to use the 35u today (I got a second one with film clip and strap intact). Tri-X @ 400, in Rodinal/Blazinol 1:50 for 13 minutes, then stop, fix and wash. The film is drying right now, but the negs look as if they will be just right. I'm not claiming any great artistic content, but I'll scan the likely looking ones this evening and see if there's any worth posting up as examples of output. It is likely to cause a repetitive strain injury after about a half hour total of twiddling the knob! Here's one answer to that problem: DIY - RONDINAX 35U Motorized with Meccano - YouTube I've been practising loading the Jobo daylight loading tank I mentioned above, and it's pretty tricky to get the film started. So far I've just done dry runs with a sacrificial long-outdated film. I'll have to load a canister with a short strip from the bulk loader and see if I can make it work for real... Chris", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/page/2/?tab=comments#comment-2079198", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "here's one answer to that problem: diy - rondinax 35u motorized with meccano - youtube i've been practising loading the jobo daylight loading tank i mentioned above, and it's pretty tricky to get the -----> film !!!  started.", "sortedWord": "film", "Identifyer": null, "identifyer": 107020, "year": "2012"}, {"autor": "janrzm", "date": "2012-08-05 06:00:00", "content": "I finally got to use the 35u today (I got a second one with film clip and strap intact). Tri-X @ 400, in Rodinal/Blazinol 1:50 for 13 minutes, then stop, fix and wash. The film is drying right now, but the negs look as if they will be just right. I'm not claiming any great artistic content, but I'll scan the likely looking ones this evening and see if there's any worth posting up as examples of output. It is likely to cause a repetitive strain injury after about a half hour total of twiddling the knob! Here's one answer to that problem:DIY - RONDINAX 35U Motorized with Meccano - YouTube I've been practising loading the Jobo daylight loading tank I mentioned above, and it's pretty tricky to get the film started. So far I've just done dry runs with a sacrificial long-outdated film. I'll have to load a canister with a short strip from the bulk loader and see if I can make it work for real... Chris Hey Chris. Awesome. Yes, I've seen the link before, I thought I'd mentioned it in my post somewhere but maybe I forgot....I have looked in to it and plan to try something similar when I get a spare minute. Incidentally I also have the Rondinax 60 which I intend to use now I've just bought myself a Hasselblad.....Ooops. All the best, Jason", "link": "https://www.l-camera-forum.com/topic/180884-agfa-rondinax-35u-user-report/page/2/?tab=comments#comment-2079574", "origin": "L-forum", "suborigin": "180884-agfa-rondinax-35u-user-report", "result": false, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "here's one answer to that problem:diy - rondinax 35u motorized with meccano - youtube i've been practising loading the jobo daylight loading tank i mentioned above, and it's pretty tricky to get the -----> film !!!  started.", "sortedWord": "film", "Identifyer": null, "identifyer": 107022, "year": "2012"}], "name": "Leicasortedout2012diy"}