{"interestingcomments": [{"autor": "enboe", "date": "2016-06-05 03:55:00", "content": " Leica has created a digital version of their M7 film offering. I was fortunate enough to purchase one of these cameras three weeks ago. I put my name on the local wait list even before the camera was announced, but was bumped a couple of positions by higher-priority customers and saw the opportunity to have a camera in hand in time for a planned vacation, so I bit. Shooting Leicas is a major entertainment outlet for me, and I have shot with every mainline production M I can think of, M1, M2, M3, M4, M5, M4-2, M4-P, M6, M6TTL, M7, MP, M-A, M8, M8.2, M9P, Monochrom, M-P240, M246, and M262. Still, the screen-less Leica digital sounded like loads of fun, and did not disappoint. I have had the chance to shoot my M-D for one day at Universal Studios Hollywood and for 8 days in the various attractions in Orlando, Florida. During this time, I averaged 150 frames per day, for a total of just under 1400 images. I shot the camera “naked” of any case or protector for the minimum bulk. I attached the new 35mm/2.0/ASPH/II lens and an E39 UVa and didn’t look back. The camera shoots like an M7. It meters like an M7, focuses like an M7, and uses the same muscle memories for the on/off switch that I developed with my M7. The big difference is not the extra depth, which is truly minimal, but rather the adjustable ISO dial on the back, which you don’t get to leverage on an M7 without changing rolls of film. Having any speed film from 200-6400 ISO at the twist of a dial is very handy. The rest of the body works like an M7, and the bump on the back of the top plate holds your thumb very much like a film winding lever. All in all, an excellent handling design. O.K., there is one tiny new item I need to train myself on, that is the use of the function button and rear control thumb wheel to adjust exposure compensation. Luckily the meter is good enough you don’t need to use it often. The shutter sound is discrete like an M should be, very much like the one in the M262, which has the current best M digital shutter. Several aspects of performance warrant discussion. First and foremost, the image quality is every bit as good as any of the other ‘240 class cameras. The default compressed DNG files are superb and offer lots of flexibility for image editing. The second area worth note is the metering. The pattern used is the ‘240-series “Classic” pattern, which uses reflections off of the central blades of the shutter curtain. Metering reflected off of curtain works very well and quickly, although the metering can occasionally be fooled by high or low-key lighting. The solution is what I term, “nodding the camera”. You simply point the camera down for lower shutter speeds, up for higher shutter speeds, then hold the exposure with a half-press of the shutter release and recompose your final shot. Using this approach, I achieved exposures that were around ½ stop underexposed 98-99% of the time. The slight underexposure is perfect for ensuring you don’t blow out your highlights, and the dynamic range of the sensor and resultant files pulls the details out of the rest of the image and the shadows without issue. The continuous burst buffer is good for 10 shots in a sequence. Battery consumption hovered around 15% per day for an average 150 photos, which extrapolates to 1000 photos on a full charge. These numbers were achieved by turning the camera off between periods of use. I did confirm the hard way, however, that the camera does not have an auto-off, and I would up with a dead battery one morning. I would recommend having a spare charged battery readily available in case you make a similar mistake. The M-D comes with a hard black paint finish over brass. I would have preferred a silver chrome version, and may pick one up in the future if offered, but the black paint chosen for the current version is very durable, with no signs of wear after 9 days in busy amusement parks. This is no MP black lacquer, and your camera will not resemble the Kravitz ‘240 for quite a long time of use. Other than the aforementioned dead battery, the camera was 100% reliable, with no crashes or hang-ups. It wrote every single image I took to SD card without error, something no other M digital I have owned can claim. It really is that good. If I were to make two changes, I would add silver chrome as an option for the top and bottom plates and hardware, and maybe a two-position on/off switch versus the current Off/S/C/Timer. I did overachieve and put the camera into Continuous mode when I wanted Single, but no harm came, and no images or opportunities were lost. Oh, and did I mention it had the cleanest sensor straight out of the box of the 11 digital Ms I’ve purchased since 2006? Not a speck of dust! I did have the chance to share the camera over lunch with a friend named Kevin who has made a career out of photography. He loves his M’s, but also shoots a lot of Canons for digital stills, and other gear for video. I explained the philosophy behind the camera as a reliable tool where you stay focused on your subject and environment to be ready for the next shot, not reviewing the past image. I caught him chimping the ISO dial a few times, and when I commented he said, “you’re right, this will take some getting used to, but it’s a good thing, and I need to get me one of these (M-D).” Kevin supervises a number of other photography professionals, and I would not be surprised to see their department adopting a no-screen shooters challenge as a way of capturing more “decisive moment” images. This, of course, requires equipment that is 100% reliable and predictable, and photographers with the skills to make the most out of the equipment on every image. The M-D is up to the task. So, who should buy this camera? This is a little bit hard to define. The camera is ultra-reliable, produces excellent images, and is totally predictable. It should be durable enough to last for decades. I would expect the batteries and SD cards will be the lifespan-limiting commodities, not the M-D. If you want a “decisive moment” Leica M digital for still images only, and have at least some skill with M cameras, this is an excellent selection, and could be your only M. If you need to work at the limits of M capabilities, lenses wider than 28 or longer than 90 (subjective), shoot macro, hold cameras overhead or away from your eye for perspective or safety,, shoot at f/0.95, or need to capture short video clips, then a ‘240 may be a better tool, but don’t forget the lessons the M-D and prior film M cameras teach us.", "link": "https://www.l-camera-forum.com/topic/261262-a-few-comments-based-upon-two-outings-with-the-leica-m-d-type-262-camera/?tab=comments#comment-3056848", "origin": "L-forum", "suborigin": "261262-a-few-comments-based-upon-two-outings-with-the-leica-m-d-type-262-camera", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": " leica has created a digital version of their m7 film offering. i was fortunate enough to purchase one of these cameras three weeks ago. i put my name on the local wait list even before the camera was announced, but was bumped a couple of positions by higher-priority customers and saw the opportunity to have a camera in hand in time for a planned vacation, so i bit. shooting leicas is a major entertainment outlet for me, and i have shot with every mainline production m i can think of, m1, m2, m3, m4, m5, m4-2, m4-p, m6, m6ttl, m7, mp, m-a, m8, m8.2, m9p, monochrom, m-p240, m246, and m262. still, the screen-less leica digital sounded like loads of fun, and did not disappoint. i have had the chance to shoot my m-d for one day at universal studios hollywood and for 8 days in the various attractions in orlando, florida. during this time, i averaged 150 frames per day, for a total of just under 1400 images. i shot the camera “naked” of any case or protector for the minimum bulk. i attached the new 35mm/2.0/asph/ii lens and an e39 uva and didn’t look back. the camera shoots like an m7. it meters like an m7, focuses like an m7, and uses the same muscle memories for the on/off switch that -----> i !!!  -----> developed !!!  with my m7. the big difference is not the extra depth, which is truly minimal, but rather the adjustable iso dial on the back, which you don’t get to leverage on an m7 without changing rolls of film. having any speed film from 200-6400 iso at the twist of a dial is very handy. the rest of the body works like an m7, and the bump on the back of the top plate holds your thumb very much like a film winding lever. all in all, an excellent handling design. o.k., there is one tiny new item i need to train myself on, that is the use of the function button and rear control thumb wheel to adjust exposure compensation. luckily the meter is good enough you don’t need to use it often. the shutter sound is discrete like an m should be, very much like the one in the m262, which has the current best m digital shutter. several aspects of performance warrant discussion. first and foremost, the image quality is every bit as good as any of the other ‘240 class cameras. the default compressed dng files are superb and offer lots of flexibility for image editing. the second area worth note is the metering. the pattern used is the ‘240-series “classic” pattern, which uses reflections off of the central blades of the shutter curtain. metering reflected off of curtain works very well and quickly, although the metering can occasionally be fooled by high or low-key lighting. the solution is what i term, “nodding the camera”. you simply point the camera down for lower shutter speeds, up for higher shutter speeds, then hold the exposure with a half-press of the shutter release and recompose your final shot. using this approach, i achieved exposures that were around ½ stop underexposed 98-99% of the time. the slight underexposure is perfect for ensuring you don’t blow out your highlights, and the dynamic range of the sensor and resultant files pulls the details out of the rest of the image and the shadows without issue. the continuous burst buffer is good for 10 shots in a sequence. battery consumption hovered around 15% per day for an average 150 photos, which extrapolates to 1000 photos on a full charge. these numbers were achieved by turning the camera off between periods of use. i did confirm the hard way, however, that the camera does not have an auto-off, and i would up with a dead battery one morning. i would recommend having a spare charged battery readily available in case you make a similar mistake. the m-d comes with a hard black paint finish over brass. i would have preferred a silver chrome version, and may pick one up in the future if offered, but the black paint chosen for the current version is very durable, with no signs of wear after 9 days in busy amusement parks. this is no mp black lacquer, and your camera will not resemble the kravitz ‘240 for quite a long time of use. other than the aforementioned dead battery, the camera was 100% reliable, with no crashes or hang-ups. it wrote every single image i took to sd card without error, something no other m digital i have owned can claim. it really is that good. if i were to make two changes, i would add silver chrome as an option for the top and bottom plates and hardware, and maybe a two-position on/off switch versus the current off/s/c/timer. i did overachieve and put the camera into continuous mode when i wanted single, but no harm came, and no images or opportunities were lost. oh, and did i mention it had the cleanest sensor straight out of the box of the 11 digital ms i’ve purchased since 2006? not a speck of dust! i did have the chance to share the camera over lunch with a friend named kevin who has made a career out of photography. he loves his m’s, but also shoots a lot of canons for digital stills, and other gear for video. i explained the philosophy behind the camera as a reliable tool where you stay focused on your subject and environment to be ready for the next shot, not reviewing the past image. i caught him chimping the iso dial a few times, and when i commented he said, “you’re right, this will take some getting used to, but it’s a good thing, and i need to get me one of these (m-d).” kevin supervises a number of other photography professionals, and i would not be surprised to see their department adopting a no-screen shooters challenge as a way of capturing more “decisive moment” images. this, of course, requires equipment that is 100% reliable and predictable, and photographers with the skills to make the most out of the equipment on every image. the m-d is up to the task. so, who should buy this camera? this is a little bit hard to define. the camera is ultra-reliable, produces excellent images, and is totally predictable. it should be durable enough to last for decades. i would expect the batteries and sd cards will be the lifespan-limiting commodities, not the m-d. if you want a “decisive moment” leica m digital for still images only, and have at least some skill with m cameras, this is an excellent selection, and could be your only m. if you need to work at the limits of m capabilities, lenses wider than 28 or longer than 90 (subjective), shoot macro, hold cameras overhead or away from your eye for perspective or safety,, shoot at f/0.95, or need to capture short video clips, then a ‘240 may be a better tool, but don’t forget the lessons the m-d and prior film m cameras teach us.", "sortedWord": "None", "Identifyer": null, "identifyer": 19840, "year": "2016"}, {"autor": "lambda", "date": "2016-04-22 09:45:00", "content": "hi ernst, i always shoot with base iso and pull the iso when i develop the raws. you will find some threads about this procedure in the forum. this is( imo) the best way to shoot high iso! so i really do not need to change my setting. lambda.", "link": "https://www.l-camera-forum.com/topic/259525-replace-m8-shutter-or-lcd-rear-screen/?tab=comments#comment-3031235", "origin": "L-forum", "suborigin": "259525-replace-m8-shutter-or-lcd-rear-screen", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "hi ernst, -----> i !!!  always shoot with base iso and pull the iso when -----> i !!!  -----> develop !!!  the raws. you will find some threads about this procedure in the forum. this is( imo) the best way to shoot high iso! so i really do not need to change my setting. lambda.", "sortedWord": "None", "Identifyer": null, "identifyer": 46761, "year": "2016"}, {"autor": "Doc Henry", "date": "2016-04-26 14:15:00", "content": "I use film and digital sensors too. Once you've got your negative you need either to scan it or enlarge it. However careful people are, both those processes are vulnerable to dust. Just as with digital, a little extra work solves the problem. I do not like \"sharp\" lines and edges by \"smoothing\" of digital images , not natural I develop myself color as b&w and i print with my enlarger , no ink jet Best Henry Edited April 26, 2016 by Doc Henry", "link": "https://www.l-camera-forum.com/topic/259734-is-this-dust-on-sensor/?tab=comments#comment-3033857", "origin": "L-forum", "suborigin": "259734-is-this-dust-on-sensor", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i use film and digital sensors too. once you've got your negative you need either to scan it or enlarge it. however careful people are, both those processes are vulnerable to dust. just as with digital, a little extra work solves the problem. -----> i !!!  do not like \"sharp\" lines and edges by \"smoothing\" of digital images , not natural -----> i !!!  -----> develop !!!  myself color as b&w and -----> i !!!  print with my enlarger , no ink jet best henry edited april 26, 2016 by doc henry", "sortedWord": "None", "Identifyer": null, "identifyer": 47003, "year": "2016"}, {"autor": "Keith (M)", "date": "2016-12-16 15:59:00", "content": " To sum my recent experiences with Labs (originally posted in the \"I like film... (Open Thread)\" ) On the subject of Labs, over the last couple of weeks I have had results back from (1) MeinLab (Germany), (2) Canadian Film Lab and (3) Palm Lab Birmingham. (1) & (2) were 35mm C41 dev & scan. In both cases the scanned files are excellent, better than I could achieve in terms of resolution etc with my V700. Very pleased with the results - albeit at a price. (3) were E6 & C41 6x6cm & 6x9cm dev only. Quick turnaround, inexpensive. Excellent clean results, minimum effort needed to clone out dust spots etc. Scanned at 3200dpi on my V700 and imported into LR CC - which is where the fun begins in trying to achieve a neutral colour balance, freedom from colour casts etc. For 120 roll film I will use Palm Lab again. For 35mm C41 - the decision is more difficult. Mein Lab are decidedly quicker but a little more expensive. Black & white? Simples - I develop them at the kitchen sink, scan the same day, no colour balance problems! --img--  Edited December 16, 2016 by Keith (M)", "link": "https://www.l-camera-forum.com/topic/263455-good-uk-developing-and-scanning-labs/page/5/?tab=comments#comment-3168062", "origin": "L-forum", "suborigin": "263455-good-uk-developing-and-scanning-labs", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": " to sum my recent experiences with labs (originally posted in the \"i like film... (open thread)\" ) on the subject of labs, over the last couple of weeks i have had results back from (1) meinlab (germany), (2) canadian film lab and (3) palm lab birmingham. (1) & (2) were 35mm c41 dev & scan. in both cases the scanned files are excellent, better than i could achieve in terms of resolution etc with my v700. very pleased with the results - albeit at a price. (3) were e6 & c41 6x6cm & 6x9cm dev only. quick turnaround, inexpensive. excellent clean results, minimum effort needed to clone out dust spots etc. scanned at 3200dpi on my v700 and imported into lr cc - which is where the fun begins in trying to achieve a neutral colour balance, freedom from colour casts etc. for 120 roll film i will use palm lab again. for 35mm c41 - the decision is more difficult. mein lab are decidedly quicker but a little more expensive. black & white? simples - -----> i !!!  -----> develop !!!  them at the kitchen sink, scan the same day, no colour balance problems! --img--  edited december 16, 2016 by keith (m)", "sortedWord": "None", "Identifyer": null, "identifyer": 100529, "year": "2016"}, {"autor": "M.Hilo", "date": "2016-01-01 07:38:00", "content": " Since photo forums existed the Paterson system is a returning story - about the loading problems and the reactions of people who manage to make it work for them. To me the paterson system is like continuously driving a car in reverse. It is something I will never get used too, no matter how careful I would be. Obviously there are people who can make it work and good for them! I lucked out because for some reason I began developing (end 70ties) with HP Combina tanks. A plastic system, their reels take the film from the inside to the outside, it's always easy. The film gets pulled on to the reels, instead of pushed on to the reels . . If I were you I would forget about the Paterson tanks, continue with the Hewes system and if you come across a Combina tank, get it to see for yourself. Make sure it is complete with orange loader that comes in two parts. If you do not quite understand how to work it, you can pm me. They're called HP Combina or Gepe or Krause . . . They exist for 135 film, 1 reel, 2 reel and 5 reel tanks and for 120 film 1 reel and 3 reel tanks . . .", "link": "https://www.l-camera-forum.com/topic/254703-sticky-paterson-reelsive-tried-it-all-and-nothing-works/page/2/?tab=comments#comment-2959555", "origin": "L-forum", "suborigin": "254703-sticky-paterson-reelsive-tried-it-all-and-nothing-works", "result": true, "Selector": "i began developing", "selectorShort": "develop", "MarkedSent": " since photo forums existed the paterson system is a returning story - about the loading problems and the reactions of people who manage to make it work for them. to me the paterson system is like continuously driving a car in reverse. it is something i will never get used too, no matter how careful i would be. obviously there are people who can make it work and good for them! -----> i !!!  lucked out because for some reason -----> i !!!  -----> began !!!  -----> developing !!!  (end 70ties) with hp combina tanks. a plastic system, their reels take the film from the inside to the outside, it's always easy. the film gets pulled on to the reels, instead of pushed on to the reels . . if i were you i would forget about the paterson tanks, continue with the hewes system and if you come across a combina tank, get it to see for yourself. make sure it is complete with orange loader that comes in two parts. if you do not quite understand how to work it, you can pm me. they're called hp combina or gepe or krause . . . they exist for 135 film, 1 reel, 2 reel and 5 reel tanks and for 120 film 1 reel and 3 reel tanks . . .", "sortedWord": "None", "Identifyer": null, "identifyer": 105142, "year": "2016"}, {"autor": "mikemgb", "date": "2016-12-28 21:23:00", "content": "It's worth trying, Mike. I've got 4 rolls of 1991120 Tech Pan and whatever's left of a 100' roll of 1984 135 Tri-X sitting beside me. I just need to figure out what I want to shoot with them. This is worse than camera / lens GAS... I shot a roll of the 127 colour this morning and processed in B&W chemistry, the film was completely opaque, if I try another roll I'll have to see if I can find someone who still does C-22 processing. Of the 2 35 mm rolls, the Kodak can was empty, just a cut off end inside. I developed the Ansco in Ilfosol-3 at 12.5 minutes, it has images but is extremely dense and very badly fogged. I'm going to let it sit in fix for an hour or so and see if that lightens it up any. I need to get some HC-110, I'll see if my local store can order me some tomorrow.", "link": "https://www.l-camera-forum.com/topic/267734-processing-vintage-film/?tab=comments#comment-3174677", "origin": "L-forum", "suborigin": "267734-processing-vintage-film", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "it's worth trying, mike. i've got 4 rolls of 1991120 tech pan and whatever's left of a 100' roll of 1984 135 tri-x sitting beside me. i just need to figure out what i want to shoot with them. this is worse than camera / lens gas... i shot a roll of the 127 colour this morning and processed in b&w chemistry, the film was completely opaque, if i try another roll i'll have to see if i can find someone who still does c-22 processing. of the 2 35 mm rolls, the kodak can was empty, just a cut off end inside. -----> i !!!  -----> developed !!!  the ansco in ilfosol-3 at 12.5 minutes, it has images but is extremely dense and very badly fogged. i'm going to let it sit in fix for an hour or so and see if that lightens it up any. i need to get some hc-110, i'll see if my local store can order me some tomorrow.", "sortedWord": "None", "Identifyer": null, "identifyer": 106388, "year": "2016"}, {"autor": "TomB_tx", "date": "2016-11-27 12:45:00", "content": "Yes, Panatomic-X was my favorite, for the same reasons, but I developed in UFG. For me PanF has taken its place, in Rodinal.", "link": "https://www.l-camera-forum.com/topic/266379-book-on-fine-grain-developing-old-and-free/?tab=comments#comment-3156522", "origin": "L-forum", "suborigin": "266379-book-on-fine-grain-developing-old-and-free", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "yes, panatomic-x was my favorite, for the same reasons, but -----> i !!!  -----> developed !!!  in ufg. for me panf has taken its place, in rodinal.", "sortedWord": "None", "Identifyer": null, "identifyer": 106449, "year": "2016"}, {"autor": "yigitaltay", "date": "2016-08-07 11:41:00", "content": " Hi all, I finally gathered all the stuff and chemicals to develop my films. I am using D-76 stock solution for development, Ilfostop and Ilford rapid fixer. I am using Kodak Photoflo as wetting agent. And I have some questions and need your advice. I experienced the first problem with dissolving D-76 in 3L double distilled water at 55℃. Entire mixture dissolved (no precipitate there) but still the solution was blurry even after 24 hours. And I had to filter it. Does it always happen to you too? I shot Fomapan 400 at 400 ISO. As far as I read from the forum, it has an actual ISO rating not more than 200. I was expecting an underdeveloped film at the end of the process. But film turned out to be over-developed. And it looks very contrasty as if it is pushed 2-3 stops. Is it a general feature that you expect from Fomapan? This is my first time using this film. At 19℃, I developed for 8:45 min (first 1 min continuous agitation and then every minute 10 second agitation) , 2 min for stop and 5 min fix. I washed with water in between baths to increase the lifetime of chemicals. Can you comment on how can I improve the development process? Here some results: --img--  --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/263272-my-first-film-development-experience/?tab=comments#comment-3092255", "origin": "L-forum", "suborigin": "263272-my-first-film-development-experience", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": " hi all, i finally gathered all the stuff and chemicals to develop my films. i am using d-76 stock solution for development, ilfostop and ilford rapid fixer. i am using kodak photoflo as wetting agent. and i have some questions and need your advice. i experienced the first problem with dissolving d-76 in 3l double distilled water at 55℃. entire mixture dissolved (no precipitate there) but still the solution was blurry even after 24 hours. and i had to filter it. does it always happen to you too? i shot fomapan 400 at 400 iso. as far as i read from the forum, it has an actual iso rating not more than 200. i was expecting an underdeveloped film at the end of the process. but film turned out to be over-developed. and it looks very contrasty as if it is pushed 2-3 stops. is it a general feature that you expect from fomapan? this is my first time using this film. at 19℃, -----> i !!!  -----> developed !!!  for 8:45 min (first 1 min continuous agitation and then every minute 10 second agitation) , 2 min for stop and 5 min fix. i washed with water in between baths to increase the lifetime of chemicals. can you comment on how can i improve the development process? here some results: --img--  --img--  --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 106507, "year": "2016"}, {"autor": "vhfreund", "date": "2016-08-21 09:37:00", "content": "Hi all, I finally gathered all the stuff and chemicals to develop my films. I am using D-76 stock solution for development, Ilfostop and Ilford rapid fixer. I am using Kodak Photoflo as wetting agent. And I have some questions and need your advice. I experienced the first problem with dissolving D-76 in 3L double distilled water at 55℃. Entire mixture dissolved (no precipitate there) but still the solution was blurry even after 24 hours. And I had to filter it. Does it always happen to you too? I shot Fomapan 400 at 400 ISO. As far as I read from the forum, it has an actual ISO rating not more than 200. I was expecting an underdeveloped film at the end of the process. But film turned out to be over-developed. And it looks very contrasty as if it is pushed 2-3 stops. Is it a general feature that you expect from Fomapan? This is my first time using this film. At 19℃, I developed for 8:45 min (first 1 min continuous agitation and then every minute 10 second agitation) , 2 min for stop and 5 min fix. I washed with water in between baths to increase the lifetime of chemicals. Can you comment on how can I improve the development process? Here some results: --img--  --img--  --img-- I use ID-11 which is told to be basically the same as D76. After dissolving part B of the components, I never managed to get all powder completely dissolved. There are always some minor residuals, however on the data sheet this is being mentioned as normal. I alway wait until the next day before I use the stock solution. I always have a stock which I dilute 1:1 for single use, which gives consistent results. I recommend not to rinse with water after use of the stop bath. That doesn´t seem to make sense. There is no point in saving chemicals. Fixer isn´t too expensive. Yes your pictures are either overexposed or overdeveloped. I don´t have experience with D76 nor do I know anything about the film you used. I also restarted doing my own processing recently after 13 years of abstinence. I used to develop T-MAX in a rotational processor. I than restarted with TRI-X with Ilfosol and I was not so happy with the results. The negatives were far too dense. I now use Ilford FP4 plus and ID-11 and I am very pleased with the results! No rinsing in the beginning. I start with the developer immediately agitating 30 sec continuously at 20 C, thereafter twice every minute. The data sheet says 11min, I stop after 10:45 min because emptying of the drum takes a bit of time. Then stopping with 2% acidic acid 1 min, fixing 3 min and rinsing at about 20 C for about 20 min. Finally putting the reel in distilled water and carefully adding some droplets of wetting agent. I never swipe the water off! I also achieved good results with Ilford HP5 plus processed in Perceptol. Starting with box speed and according to the data sheet at 20 C is always a good idea! Best Theodor", "link": "https://www.l-camera-forum.com/topic/263272-my-first-film-development-experience/page/2/?tab=comments#comment-3099575", "origin": "L-forum", "suborigin": "263272-my-first-film-development-experience", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "hi all, i finally gathered all the stuff and chemicals to develop my films. i am using d-76 stock solution for development, ilfostop and ilford rapid fixer. i am using kodak photoflo as wetting agent. and i have some questions and need your advice. i experienced the first problem with dissolving d-76 in 3l double distilled water at 55℃. entire mixture dissolved (no precipitate there) but still the solution was blurry even after 24 hours. and i had to filter it. does it always happen to you too? i shot fomapan 400 at 400 iso. as far as i read from the forum, it has an actual iso rating not more than 200. i was expecting an underdeveloped film at the end of the process. but film turned out to be over-developed. and it looks very contrasty as if it is pushed 2-3 stops. is it a general feature that you expect from fomapan? this is my first time using this film. at 19℃, -----> i !!!  -----> developed !!!  for 8:45 min (first 1 min continuous agitation and then every minute 10 second agitation) , 2 min for stop and 5 min fix. i washed with water in between baths to increase the lifetime of chemicals. can you comment on how can i improve the development process? here some results: --img--  --img--  --img-- i use id-11 which is told to be basically the same as d76. after dissolving part b of the components, i never managed to get all powder completely dissolved. there are always some minor residuals, however on the data sheet this is being mentioned as normal. i alway wait until the next day before i use the stock solution. i always have a stock which i dilute 1:1 for single use, which gives consistent results. i recommend not to rinse with water after use of the stop bath. that doesn´t seem to make sense. there is no point in saving chemicals. fixer isn´t too expensive. yes your pictures are either overexposed or overdeveloped. i don´t have experience with d76 nor do i know anything about the film you used. i also restarted doing my own processing recently after 13 years of abstinence. i used to develop t-max in a rotational processor. i than restarted with tri-x with ilfosol and i was not so happy with the results. the negatives were far too dense. i now use ilford fp4 plus and id-11 and i am very pleased with the results! no rinsing in the beginning. i start with the developer immediately agitating 30 sec continuously at 20 c, thereafter twice every minute. the data sheet says 11min, i stop after 10:45 min because emptying of the drum takes a bit of time. then stopping with 2% acidic acid 1 min, fixing 3 min and rinsing at about 20 c for about 20 min. finally putting the reel in distilled water and carefully adding some droplets of wetting agent. i never swipe the water off! i also achieved good results with ilford hp5 plus processed in perceptol. starting with box speed and according to the data sheet at 20 c is always a good idea! best theodor", "sortedWord": "None", "Identifyer": null, "identifyer": 106530, "year": "2016"}, {"autor": "Martin B", "date": "2016-09-02 18:32:00", "content": "I am doing both - B&W and color printing. I was fortunate enough to get hold on a second Beseler diffuser-based enlarger with color head for color prints which I develop with the RA-4 process. Regarding enlargers, yes, you can do B&W and color prints with such color-head based enlarger. But it is not the same B&W printing without additional adjustments compared to a traditional condenser based enlarger. The contrast between both types of enlargers is shown differently in the developed B&W print - but you can adjust the settings with the color head based enlarger to make it look very similar. I decided to keep two enlargers - one Beseler 45M (condenser-based) for B&W only, and the Beseler 67S II for color prints. I am only using contrast filters if absolutely necessary for B&W prints. Filters for color prints are already within the color head - yellow, magenta, and blue. For color prints, leave the blue alone in zero position and start with 60 for yellow and 60 for magenta. Adjust the settings after making a test print. The largest prints I am making are 14x11\" - I am limited in space in my dry darkroom, and this is the maximum size of easel I can fit in underneath each enlarger. I am mostly using 35mm format negatives - here you need a 50 mm enlarger lens. I am using a Wollensak 50 mm Raptar lens on my 45M enlarger, and a Nikkor 50/2.8 EL-enlarger lens on my 67S II enlarger. I bought the Nikkor 50/2.8 EL lens for about $30 used in excellent condition on ebay since the original lens of this enlarger suffered from fungus inside the lens elements. For digital negatives which I print in 4x5\" size, I am using a Wollensak 162 mm Raptar lens on my Beseler 45M enlarger. This focal length is also suitable for medium format negative prints. I am using two timers (one I got for free, the other one I bought for $30 in mint condition on Amazon):both are Time-O-Lite models. I wouldn't go crazy here investing in high end ones...... Edited September 2, 2016 by Martin B", "link": "https://www.l-camera-forum.com/topic/264089-help-needed-in-buying-dark-room-equipment/?tab=comments#comment-3105985", "origin": "L-forum", "suborigin": "264089-help-needed-in-buying-dark-room-equipment", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i am doing both - b&w and color printing. -----> i !!!  was fortunate enough to get hold on a second beseler diffuser-based enlarger with color head for color prints which -----> i !!!  -----> develop !!!  with the ra-4 process. regarding enlargers, yes, you can do b&w and color prints with such color-head based enlarger. but it is not the same b&w printing without additional adjustments compared to a traditional condenser based enlarger. the contrast between both types of enlargers is shown differently in the developed b&w print - but you can adjust the settings with the color head based enlarger to make it look very similar. i decided to keep two enlargers - one beseler 45m (condenser-based) for b&w only, and the beseler 67s ii for color prints. i am only using contrast filters if absolutely necessary for b&w prints. filters for color prints are already within the color head - yellow, magenta, and blue. for color prints, leave the blue alone in zero position and start with 60 for yellow and 60 for magenta. adjust the settings after making a test print. the largest prints i am making are 14x11\" - i am limited in space in my dry darkroom, and this is the maximum size of easel i can fit in underneath each enlarger. i am mostly using 35mm format negatives - here you need a 50 mm enlarger lens. i am using a wollensak 50 mm raptar lens on my 45m enlarger, and a nikkor 50/2.8 el-enlarger lens on my 67s ii enlarger. i bought the nikkor 50/2.8 el lens for about $30 used in excellent condition on ebay since the original lens of this enlarger suffered from fungus inside the lens elements. for digital negatives which i print in 4x5\" size, i am using a wollensak 162 mm raptar lens on my beseler 45m enlarger. this focal length is also suitable for medium format negative prints. i am using two timers (one i got for free, the other one i bought for $30 in mint condition on amazon):both are time-o-lite models. i wouldn't go crazy here investing in high end ones...... edited september 2, 2016 by martin b", "sortedWord": "None", "Identifyer": null, "identifyer": 106562, "year": "2016"}, {"autor": "EoinC", "date": "2016-09-03 04:45:00", "content": "I am doing both - B&W and color printing. I was fortunate enough to get hold on a second Beseler diffuser-based enlarger with color head for color prints which I develop with the RA-4 process. Regarding enlargers, yes, you can do B&W and color prints with such color-head based enlarger. But it is not the same B&W printing without additional adjustments compared to a traditional condenser based enlarger. The contrast between both types of enlargers is shown differently in the developed B&W print - but you can adjust the settings with the color head based enlarger to make it look very similar. I decided to keep two enlargers - one Beseler 45M (condenser-based) for B&W only, and the Beseler 67S II for color prints. I am only using contrast filters if absolutely necessary for B&W prints. Filters for color prints are already within the color head - yellow, magenta, and blue. For color prints, leave the blue alone in zero position and start with 60 for yellow and 60 for magenta. Adjust the settings after making a test print. The largest prints I am making are 14x11\" - I am limited in space in my dry darkroom, and this is the maximum size of easel I can fit in underneath each enlarger. I am mostly using 35mm format negatives - here you need a 50 mm enlarger lens. I am using a Wollensak 50 mm Raptar lens on my 45M enlarger, and a Nikkor 50/2.8 EL-enlarger lens on my 67S II enlarger. I bought the Nikkor 50/2.8 EL lens for about $30 used in excellent condition on ebay since the original lens of this enlarger suffered from fungus inside the lens elements. For digital negatives which I print in 4x5\" size, I am using a Wollensak 162 mm Raptar lens on my Beseler 45M enlarger. This focal length is also suitable for medium format negative prints. I am using two timers (one I got for free, the other one I bought for $30 in mint condition on Amazon):both are Time-O-Lite models. I wouldn't go crazy here investing in high end ones...... Thank you, Martin. Can you please describe your digital negative workflow? I've been looking at producing inkjet negatives on Pictorico or Inkpress transparency film, but am still at the thinking stage.", "link": "https://www.l-camera-forum.com/topic/264089-help-needed-in-buying-dark-room-equipment/page/2/?tab=comments#comment-3106141", "origin": "L-forum", "suborigin": "264089-help-needed-in-buying-dark-room-equipment", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i am doing both - b&w and color printing. -----> i !!!  was fortunate enough to get hold on a second beseler diffuser-based enlarger with color head for color prints which -----> i !!!  -----> develop !!!  with the ra-4 process. regarding enlargers, yes, you can do b&w and color prints with such color-head based enlarger. but it is not the same b&w printing without additional adjustments compared to a traditional condenser based enlarger. the contrast between both types of enlargers is shown differently in the developed b&w print - but you can adjust the settings with the color head based enlarger to make it look very similar. i decided to keep two enlargers - one beseler 45m (condenser-based) for b&w only, and the beseler 67s ii for color prints. i am only using contrast filters if absolutely necessary for b&w prints. filters for color prints are already within the color head - yellow, magenta, and blue. for color prints, leave the blue alone in zero position and start with 60 for yellow and 60 for magenta. adjust the settings after making a test print. the largest prints i am making are 14x11\" - i am limited in space in my dry darkroom, and this is the maximum size of easel i can fit in underneath each enlarger. i am mostly using 35mm format negatives - here you need a 50 mm enlarger lens. i am using a wollensak 50 mm raptar lens on my 45m enlarger, and a nikkor 50/2.8 el-enlarger lens on my 67s ii enlarger. i bought the nikkor 50/2.8 el lens for about $30 used in excellent condition on ebay since the original lens of this enlarger suffered from fungus inside the lens elements. for digital negatives which i print in 4x5\" size, i am using a wollensak 162 mm raptar lens on my beseler 45m enlarger. this focal length is also suitable for medium format negative prints. i am using two timers (one i got for free, the other one i bought for $30 in mint condition on amazon):both are time-o-lite models. i wouldn't go crazy here investing in high end ones...... thank you, martin. can you please describe your digital negative workflow? i've been looking at producing inkjet negatives on pictorico or inkpress transparency film, but am still at the thinking stage.", "sortedWord": "None", "Identifyer": null, "identifyer": 106567, "year": "2016"}, {"autor": "Martin B", "date": "2016-02-02 15:59:00", "content": "Now that imade a print or two, a few questions have popped up in my mind: 1. What do you use to time print development in they trays? I've been using the massive dev app timer but my phone goes to sleep at the worst possible time. 2. What do you use to squeegee water from the prints? I'm trying to not break the bank, looking for inexpensive solutions. 1. Nothing, I simply count the seconds, and I am fairly consistent with the counting. I found the cell phone unusable since it emits quite a bit of light in my otherwise fairly dark room which I use to develop the prints. 2. Check Amazon, get a simple but big enough one which is also used for car windows.", "link": "https://www.l-camera-forum.com/topic/255986-new-to-the-darkrooma-few-questions/?tab=comments#comment-2981412", "origin": "L-forum", "suborigin": "255986-new-to-the-darkrooma-few-questions", "result": true, "Selector": "i use to develop", "selectorShort": "develop", "MarkedSent": "now that imade a print or two, a few questions have popped up in my mind: 1. what do you use to time print development in they trays? i've been using the massive dev app timer but my phone goes to sleep at the worst possible time. 2. what do you use to squeegee water from the prints? i'm trying to not break the bank, looking for inexpensive solutions. 1. nothing, i simply count the seconds, and i am fairly consistent with the counting. -----> i !!!  found the cell phone unusable since it emits quite a bit of light in my otherwise fairly dark room which -----> i !!!  -----> use !!!  -----> to !!!  -----> develop !!!  the prints. 2. check amazon, get a simple but big enough one which is also used for car windows.", "sortedWord": "None", "Identifyer": null, "identifyer": 106888, "year": "2016"}, {"autor": "M.Hilo", "date": "2016-01-18 06:43:00", "content": "Let us know how it works for you. . It did and it didn't. My developer was fresh and I used the maximum dilution of this anti fog stuff. I first printed from an Agfa Record Rapid 30X40 envelope graded hard. When putting the sheet in the easel, I left only one weak yellow light on in the furthest corner of my darkroom (about 6 meters from the enlarger) and while printing that got turned off (happens automatically when I expose). I developed with again that same light only. The print was totally soft and the white edges around the images were totally medium grey. I ditched that envelope. Then I took a same grade hard sheet from a 50X60 envelope, cut it in half and tested, plus made a print. No problems with the white around the image, but the print was still much too soft. I then switched to Ilford Warmtone multigrade and got the perfect print easily. I am keeping this envelope Record Rapid (and about 10 others) and will try again with more contrasty negatives. So, there are two basic problems when doing this: first the problem of the paper turning grey, instead of remaining white in unexposed parts. I know I could not have made my darkroom any darker, it was almost like working in the full dark. I used a late model Leitz easel and this one really does cover the paper under the blades, etc. The sides of my first print's paper were evenly grey. I believe no anti fog stuff can help there. With the second print it could have worked, or the paper just did not have this problem. But the paper had turned too soft. About 1.5 to 2 grades in multi grade thinking. This negative I could not get right, but other negatives maybe. It's a pity because from my early work I miss only this one image and all the others are on Record Rapid . . . I got this Record Rapid when Agfa stopped making it, about 20 to 15 years ago. About 30 envelopes 50X60 grade hard. I used about half of that for a couple of years, then switched to Ilford warmtone. This was the first time I made a serious effort.", "link": "https://www.l-camera-forum.com/topic/255132-what-i-found/?tab=comments#comment-2971045", "origin": "L-forum", "suborigin": "255132-what-i-found", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "let us know how it works for you. . it did and it didn't. my developer was fresh and i used the maximum dilution of this anti fog stuff. i first printed from an agfa record rapid 30x40 envelope graded hard. when putting the sheet in the easel, i left only one weak yellow light on in the furthest corner of my darkroom (about 6 meters from the enlarger) and while printing that got turned off (happens automatically when i expose). -----> i !!!  -----> developed !!!  with again that same light only. the print was totally soft and the white edges around the images were totally medium grey. i ditched that envelope. then i took a same grade hard sheet from a 50x60 envelope, cut it in half and tested, plus made a print. no problems with the white around the image, but the print was still much too soft. i then switched to ilford warmtone multigrade and got the perfect print easily. i am keeping this envelope record rapid (and about 10 others) and will try again with more contrasty negatives. so, there are two basic problems when doing this: first the problem of the paper turning grey, instead of remaining white in unexposed parts. i know i could not have made my darkroom any darker, it was almost like working in the full dark. i used a late model leitz easel and this one really does cover the paper under the blades, etc. the sides of my first print's paper were evenly grey. i believe no anti fog stuff can help there. with the second print it could have worked, or the paper just did not have this problem. but the paper had turned too soft. about 1.5 to 2 grades in multi grade thinking. this negative i could not get right, but other negatives maybe. it's a pity because from my early work i miss only this one image and all the others are on record rapid . . . i got this record rapid when agfa stopped making it, about 20 to 15 years ago. about 30 envelopes 50x60 grade hard. i used about half of that for a couple of years, then switched to ilford warmtone. this was the first time i made a serious effort.", "sortedWord": "None", "Identifyer": null, "identifyer": 106899, "year": "2016"}, {"autor": "david strachan", "date": "2016-05-13 07:26:00", "content": "Pop, I see the attachments show the number of \"Downloads\". One of my images has been downloaded 1,252 times. What does this mean? Should I start developing a neurotic twitch immediately?", "link": "https://www.l-camera-forum.com/topic/260406-finding-all-my-posted-pictures/?tab=comments#comment-3043884", "origin": "L-forum", "suborigin": "260406-finding-all-my-posted-pictures", "result": true, "Selector": "i start developing", "selectorShort": "develop", "MarkedSent": "pop, i see the attachments show the number of \"downloads\". one of my images has been downloaded 1,252 times. what does this mean? should -----> i !!!  -----> start !!!  -----> developing !!!  a neurotic twitch immediately?", "sortedWord": "None", "Identifyer": null, "identifyer": 118781, "year": "2016"}, {"autor": "pop", "date": "2016-05-13 09:44:00", "content": "Pop, I see the attachments show the number of \"Downloads\". One of my images has been downloaded 1,252 times. What does this mean? Should I start developing a neurotic twitch immediately? Yes, you should. \"Downloading\" is a technical term which refers to the number of times the image file has been sent by the server to any other destination. Usually, each time you open a thread containing a particular image is counted as a \"download\" for that image. With a bit of look, your image has been looked at this many times.", "link": "https://www.l-camera-forum.com/topic/260406-finding-all-my-posted-pictures/?tab=comments#comment-3043936", "origin": "L-forum", "suborigin": "260406-finding-all-my-posted-pictures", "result": true, "Selector": "i start developing", "selectorShort": "develop", "MarkedSent": "pop, i see the attachments show the number of \"downloads\". one of my images has been downloaded 1,252 times. what does this mean? should -----> i !!!  -----> start !!!  -----> developing !!!  a neurotic twitch immediately? yes, you should. \"downloading\" is a technical term which refers to the number of times the image file has been sent by the server to any other destination. usually, each time you open a thread containing a particular image is counted as a \"download\" for that image. with a bit of look, your image has been looked at this many times.", "sortedWord": "None", "Identifyer": null, "identifyer": 118782, "year": "2016"}, {"autor": "Keith (M)", "date": "2016-08-19 14:56:00", "content": "It is good to see a reasoned dialogue debating both sides of the argument - it is not unknown for such things to descend into the ad-hominen groove so am happy to see that this is not the case here. I would only add that if one were to delete 'Ag Photo / Peak Imaging' from my comment re level of service and insert 'Leica', would the argument have been raised in the first place? (a rhetorical question - I think the discussion has run its course). And now back to scanning the roll of Acros 100 from my GW690II that I developed this morning... Much more fun! --img--  Edited August 19, 2016 by Keith (M)", "link": "https://www.l-camera-forum.com/topic/263455-good-uk-developing-and-scanning-labs/page/2/?tab=comments#comment-3098880", "origin": "L-forum", "suborigin": "263455-good-uk-developing-and-scanning-labs", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "and now back to scanning the -----> roll !!!  of acros 100 from my gw690ii that i developed this morning... much more fun! --img--", "sortedWord": "roll", "Identifyer": null, "identifyer": 100485, "year": "2016"}, {"autor": "fotohuis", "date": "2016-10-24 15:35:00", "content": "To get the best out of Delta 100 film I would suggest you DD-X. FP4+ is an old school cubical type emulsion. Very good results you can have with ID11/D76. With R09/Rodinal you will loose some film speed but you will have crisp negatives with high acutance. However in 35mm it is already pretty grainy. Cubical type films are also more forgiving in a bit wrong exposure. The rest is also a matter of taste. I can only suggest to start with one film (and one developer) and follow the manufacturer instructions so far. The last part and correction in printing will do the Split Grade system for you. However the way to a perfect print is starting with a good exposure and film development. I am already developing my films (and doing wet prints) over 50 years so in principle I can tell you that with every film and a suitable developer you can reach a good result. My favorites are the Fomapan 100-200 films. But also with OrWo Filmotec N74+ or Kodak 5222 Double-X (in principle cine films) you can have perfect prints. And if you like B&W slides you can reach with Rollei Retro 400(S) (an Agfa Gevaert aviation type emulsion) E.I. 125 a perfect result. It is always a match between a certain type film, a suitable exposure and a suitable developer.", "link": "https://www.l-camera-forum.com/topic/265760-ilford-delta-vs-fp4plus/?tab=comments#comment-3134595", "origin": "L-forum", "suborigin": "265760-ilford-delta-vs-fp4plus", "result": false, "Selector": "i am already developing", "selectorShort": "develop", "MarkedSent": "i am already developing my -----> films !!!  (and doing wet prints) over 50 years so in principle i can tell you that with every film and a suitable developer you can reach a good result.", "sortedWord": "film", "Identifyer": null, "identifyer": 104176, "year": "2016"}, {"autor": "david strachan", "date": "2016-12-06 10:43:00", "content": "FP4 was always my choice, and D76. I still buy FP4 + and use Ilfotec LC29, nowadays. Even when I occasionally buy 4x5, or 120. I develop at tap temps, often very low temperatures (130C), using a rocking drum roller, at low concentrations...no streaks or worrying about when to shake rattle n roll. I drink coffee, read the paper and watch the roller. Several films in a batch. A long tonal range can be compressed in printing, but you can't go backwards...like low contrast vs high contrast lenses. all best to the film mob... Edited December 6, 2016 by david strachan", "link": "https://www.l-camera-forum.com/topic/265760-ilford-delta-vs-fp4plus/?tab=comments#comment-3161583", "origin": "L-forum", "suborigin": "265760-ilford-delta-vs-fp4plus", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop at tap temps, often very low temperatures (130c), using a rocking drum roller, at low concentrations...no streaks or worrying about when to shake rattle n -----> roll !!! .", "sortedWord": "roll", "Identifyer": null, "identifyer": 104180, "year": "2016"}, {"autor": "ph.", "date": "2016-02-14 16:11:00", "content": "Some years since I last developed a film. The Patersons dependence on getting the film pushed from the outside inwards -in my experience- was too sensitive to wear. With time friction would increase and make it ever more difficult to \"push-twist\", so I gave up on that system. I did however keep my \"Kindermann\" stainless steel tanks and a few of their steel reels. They load \"from the inside out\" and film has to be pressed in a slight curve to fit. The Kindermann type also had a film leading device to aid loading if you worried that with hand-loading some rounds might stick and destroy part of the film. p.", "link": "https://www.l-camera-forum.com/topic/254703-sticky-paterson-reelsive-tried-it-all-and-nothing-works/page/2/?tab=comments#comment-2989266", "origin": "L-forum", "suborigin": "254703-sticky-paterson-reelsive-tried-it-all-and-nothing-works", "result": false, "Selector": "i last developed", "selectorShort": "develop", "MarkedSent": "some years since i last developed a -----> film !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 105155, "year": "2016"}, {"autor": "Doc Henry", "date": "2016-09-27 09:17:00", "content": "Yigit, the problem is that it is difficult for a particular to buy. These products are toxic.You can order from manufacturers like Sigma but you have to order a lot and I think that is regulated. I develop myself b&w and color film and already it amounts to me cheaper with products packaged by Kodak (D76) or Ilford (Ilfosol) .For color film it costs me around 2 Euros/roll development of Portra instead of 7 Euros.For b&w it's still cheaperTo see if it's worth or not , but these are products which can degrade with time if poorly preserved. Rg Henry Don't forget to share with us your pictures.You are welcome. Thanks --img--  http://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/page-1087 Edited September 27, 2016 by Doc Henry", "link": "https://www.l-camera-forum.com/topic/264975-photographic-chemical-supplies-in-netherlands/?tab=comments#comment-3119593", "origin": "L-forum", "suborigin": "264975-photographic-chemical-supplies-in-netherlands", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop myself b&w and color -----> film !!!  and already it amounts to me cheaper with products packaged by kodak (d76) or ilford (ilfosol) .for", "sortedWord": "film", "Identifyer": null, "identifyer": 106458, "year": "2016"}, {"autor": "yigitaltay", "date": "2016-09-27 11:40:00", "content": "Hi again. Actually the price is not important and indeed commercial products are cheaper. I just would like to try other recipes available in literature. I am chemist so I am more interested in experimenting on those kind of things. And by the way, as far as I know, you cannot order from Sigma for personal use. They deliver only to company addresses. Yigit, the problem is that it is difficult for a particular to buy. These products are toxic.You can order from manufacturers like Sigma but you have to order a lot and I think that is regulated. I develop myself b&w and color film and already it amounts to me cheaper with products packaged by Kodak (D76) or Ilford (Ilfosol) .For color film it costs me around 2 Euros/roll development of Portra instead of 7 Euros.For b&w it's still cheaperTo see if it's worth or not , but these are products which can degrade with time if poorly preserved. Rg Henry Don't forget to share with us your pictures.You are welcome. Thanks --img-- http://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/page-1087", "link": "https://www.l-camera-forum.com/topic/264975-photographic-chemical-supplies-in-netherlands/?tab=comments#comment-3119646", "origin": "L-forum", "suborigin": "264975-photographic-chemical-supplies-in-netherlands", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop myself b&w and color -----> film !!!  and already it amounts to me cheaper with products packaged by kodak (d76) or ilford (ilfosol) .for", "sortedWord": "film", "Identifyer": null, "identifyer": 106459, "year": "2016"}, {"autor": "Doc Henry", "date": "2016-08-09 06:39:00", "content": "Yigit you're right to dissolve D76 at 50°C.It's recommended by Kodak. It's better you use for 1 L each time. Buy sachets for 1 Litre more convenientand it saves money in time. I have Paterson tanks of 1L. Store in a closed bottle protected from light (see picture below) . Best Henry My home photo lab.: Enlarger Focomat + plastic bottles Rowi + compressor for dusts on film I develop b&w and C41 color --img--  --img--  M8-35 LA The results --img--  http://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/?p=3092977 http://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/?p=3092692 http://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/?p=3092432 Edited August 9, 2016 by Doc Henry", "link": "https://www.l-camera-forum.com/topic/263272-my-first-film-development-experience/?tab=comments#comment-3093205", "origin": "L-forum", "suborigin": "263272-my-first-film-development-experience", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "enlarger focomat + plastic bottles rowi + compressor for dusts on -----> film !!!  i develop b&w and c41 color --img--", "sortedWord": "film", "Identifyer": null, "identifyer": 106524, "year": "2016"}, {"autor": "maxip", "date": "2016-01-03 13:45:00", "content": " Hey guys! I just developed my first film at home. Tri X 400 at 1600. Shot on my M6 with a 35 Summicron and Yellow Filter. This is my go to setup. Today I tried do develop my first role at home with the following recipe: -18:30 in Rodinal 1+50 at 19°C/68°F -Agitate 30 seconds initially, then 2 inversions every 2 minutes-Rinse/stop with 19°C/68°F water for 1 minute-Adox Adofix 1+9 fixer for 4.5 minutes-1 min wash-Adox Adoflo 35 seconds with distilled water-hang to dry Bye the way, I know Rodinal is probably the most inappropriate developer one can use for pushing tri x at 1600. Here ist the outcome. Strange streaks all over the negatives.. So much grain and a strange tone curve. --img--  --img--  Any ideas what caused this problem? --img--  Edited January 3, 2016 by maxip", "link": "https://www.l-camera-forum.com/topic/255157-first-time-developing-black-white-film-at-home-fail/?tab=comments#comment-2961098", "origin": "L-forum", "suborigin": "255157-first-time-developing-black-white-film-at-home-fail", "result": false, "Selector": "i just developed", "selectorShort": "develop", "MarkedSent": "i just developed my first -----> film !!!  at home.", "sortedWord": "film", "Identifyer": null, "identifyer": 106753, "year": "2016"}, {"autor": "Martin B", "date": "2016-02-02 19:36:00", "content": "The dye is NOT supposed to remain in the film, and IS supposed to be removed. Once the shutter is triggered, it has served its purpose. It gives no benefit when printing, and might cause problems. B&W film should be dead neutral gray when finished - TMax should be even less gray, almost clear: http://static.photo.net/attachments/bboard/00P/00P4O3-42751684.jpg If it remains, and is perfectly even, it won't be a huge deal. A tiny increase in density and thus required print exposure. The pink color will result in slightly higher contrast if using variable-contrast (e.g. Ilford Multigrade) papers (which use pinkish filters to increase contrast anyway). https://img1.etsystatic.com/019/0/8863923/il_570xN.579662613_ppg0.jpg The real problem is that the dye washes out unevenly, so it may produce \"blotches\" in the print. Get rid of it all! Thanks so much, this is very helpful advice! I saw that still some dye must have remained on my previously developed TMax 400 film - invisible to the eye, but when I photographed my negatives and then opened the RAW file in PS, I saw a slight reddish color tint (removed by conversion in B&W). The reddish tint did not come from the LED light panel which I used to illuminate the negatives to photograph them - I did the same development procedure on Tri-X film, and didn't see any reddish color tint in my photographed negatives. I suspect a little bit red leftover from the dye doesn't harm either. It was fully evenly distributed on the film.", "link": "https://www.l-camera-forum.com/topic/255157-first-time-developing-black-white-film-at-home-fail/page/2/?tab=comments#comment-2981595", "origin": "L-forum", "suborigin": "255157-first-time-developing-black-white-film-at-home-fail", "result": false, "Selector": "my previously developed", "selectorShort": "develop", "MarkedSent": "i saw that still some dye must have remained on my previously developed tmax 400 -----> film !!!  - invisible to the eye, but when i photographed my negatives and then opened the raw file in ps, i saw a slight reddish color tint (removed by conversion in b&w).", "sortedWord": "film", "Identifyer": null, "identifyer": 106778, "year": "2016"}, {"autor": "PaulJohn", "date": "2016-01-01 17:53:00", "content": "Not to speak for Steve but like he was saying I like the first of your 3 images in the gallery the most, with a bit more micro contrast to punch it up a bit more it could look pretty dramatic. Try unsharp mask on it with fairly large radius of several pixels. The grain certainly doesn't hurt it, honestly though I think ones eyes change a bit the more you get used to looking at film images and forget about the digital stuff. I have more experience on film than on digital although it is only recently I have developed and scanned at home and count my self a novice in home development. I remember that before digital the film industry was striving to remove grain. It used to be regarded as the chemical equivalent of noise. Kodak 400TX is a medium speed fine grained film was the fruit of all that development. Here is a properly exposed, developed and scanned shot on 400TX. Don't get me wrong I love the gritty strong grain images where the context suits it. It is all subjective opinion but mine is that weddings and birds don't suit strong gritty grain. I like subtle grain for these types of photos.. Look at the beautiful subtle grain on this shot https://www.flickr.com/photos/patrickjoust/5341204182 Thanks for your opinions and a happy new year to you and yours. Edited January 1, 2016 by PaulJohn", "link": "https://www.l-camera-forum.com/topic/250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that/page/2/?tab=comments#comment-2959845", "origin": "L-forum", "suborigin": "250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that", "result": false, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "i have more experience on -----> film !!!  than on digital although it is only recently i have developed and scanned at home and count my self a novice in home development.", "sortedWord": "film", "Identifyer": null, "identifyer": 106827, "year": "2016"}, {"autor": "philipus", "date": "2016-01-03 23:11:00", "content": "Just a question, which scanner was used? It seems to me (and I realise these are internet jpgs) the scanner doesn't quite resolve the grain. In my humble experience, with Tri-X (edit: in 135) there will be grain. Sure it can be reduced by using different developers, but Tri-X won't look like fine-grained films. An interesting take. I do like grain but I think the grain on this particular image is too pronounced. Too contrasty. As you have suggested I have adjusted my scanning and found better settings. Once scanned I have found you can't play with the files like digital so I need to relearn my workflow to work more closely with my scanner. My new improved scan: Old one for easier comparison: Thanks for the advice Paul I have more experience on film than on digital although it is only recently I have developed and scanned at home and count my self a novice in home development. I remember that before digital the film industry was striving to remove grain. It used to be regarded as the chemical equivalent of noise. Kodak 400TX is a medium speed fine grained film was the fruit of all that development. Here is a properly exposed, developed and scanned shot on 400TX. Don't get me wrong I love the gritty strong grain images where the context suits it. It is all subjective opinion but mine is that weddings and birds don't suit strong gritty grain. I like subtle grain for these types of photos.. Look at the beautiful subtle grain on this shot https://www.flickr.com/photos/patrickjoust/5341204182 Thanks for your opinions and a happy new year to you and yours. Edited January 3, 2016 by philipus", "link": "https://www.l-camera-forum.com/topic/250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that/page/3/?tab=comments#comment-2961512", "origin": "L-forum", "suborigin": "250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that", "result": false, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "i have more experience on -----> film !!!  than on digital although it is only recently i have developed and scanned at home and count my self a novice in home development.", "sortedWord": "film", "Identifyer": null, "identifyer": 106844, "year": "2016"}, {"autor": "philipus", "date": "2016-01-04 22:33:00", "content": "Thanks for writing back Paul. And I apologise if my post appeared critical. I actually don't think the grain looks 'wrong' (and it is a nice photograph too btw). Personally I don't think there is a right or wrong when it comes to grain. It looks as it does for a number of reasons. Of course, how one wants an image to look is another matter and grain is an important part of a film image, particularly for small format film. I am not familiar with the V550 but in case it helps below are a few images scanned on my Coolscan 9000. I should say that I usually edit my images. For my b&w that means running a script with Levels, Curves and Unsharp Mask which evidently affects contrast and grain. But I picked the first three because I didn't process them much at all. The fourth one I did more, in particular with USM so that's perhaps not so representative. I should also say my developing skills aren't the best so that definitely accounts for flaws. The Coolscans have a very sharp light source (though the 9000 less so) so that may not be comparable to the V550. But even on a more mid-range scanner like the V550 the advice to scan at fullest resolution and downsize will have a big positive impact on the appearance of grain. That said, grain can be very good for scanned images since it can, with skillful sharpening, make them appear sharper than they are. There are many ways to sharpen - it's a skill in itself the beginning of which I'm only beginning to understand - and one usually has to perform it both in several steps during editing and at various places of an image. I was once given the general advice to use Amount at 60-100% and the Radius at 0.6-0.8 (with Threshold at 1) to snap up the grain without it looking too artificial. One can also flip the Amount and Radius values, i.e. set a very low (10-12) Amount and a very high Radius (40-80) which will work a bit like adding contrast to the image but in a better way. Anyway there are lots of different ways and it's a matter of picking one or a few that give results which one likes. br Philip --img--  Flickr (2000ppi) --img--  Flickr (2000ppi) --img--  Flickr (2000ppi) --img--  Flickr (2000ppi) An Epson V550. Obviously you think the grain doesn't look right. Please can you post a link to a photo where the grain is properly resolved so I can see the difference. My searches on flickr for 400TX haven't revealed anything different to my own scans so far (as far as I can tell). I do appreciate that Tri-X is not fine grained but it is less coarse than some other popular 400 speed b&w films. From my research of film and developer recipes I am looking forward to trying TMAX with XTOL for a subtle grain and HP5+ with Rodinal for a stronger grain. Edited January 4, 2016 by philipus", "link": "https://www.l-camera-forum.com/topic/250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that/page/4/?tab=comments#comment-2962242", "origin": "L-forum", "suborigin": "250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that", "result": false, "Selector": "my developing", "selectorShort": "develop", "MarkedSent": "i should also say my developing -----> skills !!!  aren't the best so that definitely accounts for flaws.", "sortedWord": "skill", "Identifyer": null, "identifyer": 106850, "year": "2016"}, {"autor": "rpavich", "date": "2016-02-02 21:18:00", "content": "Thanks for the post, I too have a Rondinax 35U and wanted to try C-41 processing. Your results made me envious. Did you batch develop film? Or are you storing the balance of the chemicals? Also, did you warm up your Rondinax? Thanks in advance I think I just developed one roll. I put some water in it to start because the directions say to do a 1 minute water soak first. All water and chems at temp. Since then I've tried doing it at room temp (17c) and it turned out fine also. I lengthened the dev times according to the Tetenal directions.", "link": "https://www.l-camera-forum.com/topic/250239-tried-the-rondinax-35u-and-c-41-today-for-the-first-time/?tab=comments#comment-2981667", "origin": "L-forum", "suborigin": "250239-tried-the-rondinax-35u-and-c-41-today-for-the-first-time", "result": false, "Selector": "i just developed", "selectorShort": "develop", "MarkedSent": "i think i just developed one -----> roll !!! .", "sortedWord": "roll", "Identifyer": null, "identifyer": 106877, "year": "2016"}, {"autor": "Martin B", "date": "2016-01-17 01:29:00", "content": " Hello all, Just want to introduce myself - I am doing photography since 1985. As the headline states, I grew up in Germany but live for professional reasons not related to photography since 2005 permanently in the US. I just recently acquired my first Leica camera - the Leica M6 since I always wanted to have a fully mechanic reliable camera including a light meter. I want to do B&W film photography with this camera since I still develop my own film and use my darkroom to make silver gelatin prints both from digital files (using homemade digital negatives) and from film negatives. My style is predominantly landscape and fine art photography combined with B&W converted infrared photography. This said, I am also using digital cameras in parallel to film cameras. For infrared, I am currently using a converted Canon 5D MkII full frame DSLR with 715 nm cutoff filter, for digital landscape/macro/fine art work I am using a Sony A7R - predominantly with Leica and Voigtlander lenses plus adapter. I am not fixed to just one brand regarding photo gear and simply use what I consider best for my needs. I am looking forward to share photos and experience regarding Leica cameras and M mount lenses. Martin", "link": "https://www.l-camera-forum.com/topic/255704-new-leica-m-user-from-usgermany/?tab=comments#comment-2970253", "origin": "L-forum", "suborigin": "255704-new-leica-m-user-from-usgermany", "result": false, "Selector": "i still develop", "selectorShort": "develop", "MarkedSent": "i want to do b&w -----> film !!!  photography with this camera since i still develop my own -----> film !!!  and use my darkroom to make silver gelatin prints both from digital files (using homemade digital negatives) and from -----> film !!!  negatives.", "sortedWord": "film", "Identifyer": null, "identifyer": 114707, "year": "2016"}], "name": "Leicasortedout2016develop"}