{"interestingcomments": [{"autor": "BerndReini", "date": "2015-01-28 16:38:00", "content": "Sigh. I didn't ask to you say which picture came from which camera. Instead, I'd like to know which do you like better? Sorry, I must have exhausted you with my comment. I simply didn't want to fuel the fire over the CCD vs. CMOS debate, simply state that I do see a difference. And I do see a difference in a tiny little degraded JPEG posted online viewed on my laptop. I would certainly see it on the original file on my calibrated Eizo display. So since you want to know what that perceived difference is for me, here it goes: the bottom photograph looks more flat, the mid tones are less separated, so solid objects are not as clearly differentiated from each other (branches to sky, grass from the curb, side of the curb from top of curb etc.). There is a steeper contrast curve in the mid tones in the top photograph (film has an even steeper mid tone curve). The bottom photograph looks more linear in contrast. You could try to apply \"clarity\" in LR, which does look more artificial though. So for this reason, I like the top photograph better. But the difference is subtle, so if I didn't have a direct comparison, I could live with either one. the reason I chose not to get the M240 is that not knowing which photographs I was working with, I was applying a lot more tweaking to the M240 files than the M9 files. This may be due to a preference I have developed over many years of using the M9. So I hope I didn't exhaust you even more with this answer, but I prefer the top image, and I don't care which camera it was made with.", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/3/?tab=comments#comment-2754557", "origin": "L-forum", "suborigin": "240288-400-leica-photographers-agree-we-love-ccd", "result": true, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "sigh. i didn't ask to you say which picture came from which camera. instead, i'd like to know which do you like better? sorry, i must have exhausted you with my comment. i simply didn't want to fuel the fire over the ccd vs. cmos debate, simply state that i do see a difference. and i do see a difference in a tiny little degraded jpeg posted online viewed on my laptop. i would certainly see it on the original file on my calibrated eizo display. so since you want to know what that perceived difference is for me, here it goes: the bottom photograph looks more flat, the mid tones are less separated, so solid objects are not as clearly differentiated from each other (branches to sky, grass from the curb, side of the curb from top of curb etc.). there is a steeper contrast curve in the mid tones in the top photograph (film has an even steeper mid tone curve). the bottom photograph looks more linear in contrast. you could try to apply \"clarity\" in lr, which does look more artificial though. so for this reason, i like the top photograph better. but the difference is subtle, so if i didn't have a direct comparison, i could live with either one. the reason i chose not to get the m240 is that not knowing which photographs i was working with, i was applying a lot more tweaking to the m240 files than the m9 files. this may be due to a preference -----> i !!!  -----> have !!!  -----> developed !!!  over many years of using the m9. so i hope i didn't exhaust you even more with this answer, but i prefer the top image, and i don't care which camera it was made with.", "sortedWord": "None", "Identifyer": null, "identifyer": 39340, "year": "2015"}, {"autor": "Doc Henry", "date": "2015-06-12 12:47:00", "content": "Dave , just to tell you I develop in my home lab pictures on Ilford paper (silver) and I appreciate with great pleasure enlargement of some mountain landscapes pictures I shot recently ... some pictures are better reproduced in paper than in scanner (for posting in Leica Forum) specially for the deep black http://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/?p=2830703 I enjoy my Focomat enlarger versus inkjet printer through my computer.The \"silver\" paper gives an undeniable plus and without appeal to the images printed on inkjet , really sharper and with deep black and gray scale Best Henry Edited June 12, 2015 by Doc Henry", "link": "https://www.l-camera-forum.com/topic/245097-irwin-puts-on-film-vs-digital-and-printing/?tab=comments#comment-2833087", "origin": "L-forum", "suborigin": "245097-irwin-puts-on-film-vs-digital-and-printing", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "dave , just to tell you -----> i !!!  -----> develop !!!  in my home lab pictures on ilford paper (silver) and -----> i !!!  appreciate with great pleasure enlargement of some mountain landscapes pictures -----> i !!!  shot recently ... some pictures are better reproduced in paper than in scanner (for posting in leica forum) specially for the deep black http://www.l-camera-forum.com/topic/205842-i-like-filmopen-thread/?p=2830703 i enjoy my focomat enlarger versus inkjet printer through my computer.the \"silver\" paper gives an undeniable plus and without appeal to the images printed on inkjet , really sharper and with deep black and gray scale best henry edited june 12, 2015 by doc henry", "sortedWord": "None", "Identifyer": null, "identifyer": 93863, "year": "2015"}, {"autor": "pico", "date": "2015-09-17 14:13:00", "content": "In small tanks, stand development is complete at ~40 minutes. Developing longer doesn't hurt. There are developers which produce softer grain. Rodinal/Adonal is the opposite of soft with crisp, well defined grain.HC-110 is similar. I use Rodinal with joy for 100-speed and lower films. For softer grain look to developers which include, for example, sodium-sulphite at typically a 15% solution. (You add it yourself to the solution.) It partially dissolves the grain. You like it or do not. I do not like it. The swirl stick is not so good. Leave a bubble in the developer - the space unfilled under the protruding cap. That bubble will adequately agitate regardless of stand development or not. Best of luck!", "link": "https://www.l-camera-forum.com/topic/250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that/?tab=comments#comment-2889763", "origin": "L-forum", "suborigin": "250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "in small tanks, stand development is complete at ~40 minutes. -----> developing !!!  longer doesn't hurt. there are developers which produce softer grain. rodinal/adonal is the opposite of soft with crisp, well defined grain.hc-110 is similar. i use rodinal with joy for 100-speed and lower films. for softer grain look to developers which include, for example, sodium-sulphite at typically a 15% solution. (you add it yourself to the solution.) it partially dissolves the grain. you like it or do not. i do not like it. the swirl stick is not so good. leave a bubble in the developer - the space unfilled under the protruding cap. that bubble will adequately agitate regardless of stand development or not. best of luck!", "sortedWord": "None", "Identifyer": null, "identifyer": 106792, "year": "2015"}, {"autor": "rpavich", "date": "2015-09-17 16:07:00", "content": "In small tanks, stand development is complete at ~40 minutes. Developing longer doesn't hurt. There are developers which produce softer grain. Rodinal/Adonal is the opposite of soft with crisp, well defined grain.HC-110 is similar. I use Rodinal with joy for 100-speed and lower films. For softer grain look to developers which include, for example, sodium-sulphite at typically a 15% solution. (You add it yourself to the solution.) It partially dissolves the grain. You like it or do not. I do not like it. The swirl stick is not so good. Leave a bubble in the developer - the space unfilled under the protruding cap. That bubble will adequately agitate regardless of stand development or not. Best of luck! Interesting! Thanks Pico...I'll see about a different developer.", "link": "https://www.l-camera-forum.com/topic/250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that/?tab=comments#comment-2889816", "origin": "L-forum", "suborigin": "250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that", "result": true, "Selector": "developing", "selectorShort": "develop", "MarkedSent": "in small tanks, stand development is complete at ~40 minutes. -----> developing !!!  longer doesn't hurt. there are developers which produce softer grain. rodinal/adonal is the opposite of soft with crisp, well defined grain.hc-110 is similar. i use rodinal with joy for 100-speed and lower films. for softer grain look to developers which include, for example, sodium-sulphite at typically a 15% solution. (you add it yourself to the solution.) it partially dissolves the grain. you like it or do not. i do not like it. the swirl stick is not so good. leave a bubble in the developer - the space unfilled under the protruding cap. that bubble will adequately agitate regardless of stand development or not. best of luck! interesting! thanks pico...i'll see about a different developer.", "sortedWord": "None", "Identifyer": null, "identifyer": 106793, "year": "2015"}, {"autor": "fotohuis", "date": "2015-11-09 08:36:00", "content": "Reduction of grain with less agitation is working only with high acutance type developers. Beutler, FX-1, R09/Rodinal (which is containing para-Amino Phenol or Metol). But when doing stand development (no agitation) the sharpness is getting worse. Also these type of developers are giving more sharpness in a higher dilution. However you have to take care to take a minimum amount of concentrate for each 135-36 or 120 roll film, like 5ml-5,5ml for R09/Rodinal. Ultra Fine Grain type developers are always giving less sharpness. Normally the grain reduction is archieved by a high amount of Sodiumsulfite or a salt (Potassium- or Sodiumchloride) in the receipt or the use of a CD type ingrediënt like para- or ortho- Phenylene Diamine (MCM100 - W665). Some films like Fomapan Creative 200, a mix between classical cubical type Silver crystals and hexagonal crystals are doing great in a type developer with para- or ortho- Phenylene Diamine. I had great results in 35mm with this film and Windisch W665. Develop 1+0 (= Stock) during 9:45 minutes at 20C. Officially you need to do some rippening with these type of developers. The USA variant is Panthermic 777, based on para- Phenylene Diamine. However the para version is much more staining and toxid then the ortho- version of this product. In the past it was used in hair dye. Can you imagine .....", "link": "https://www.l-camera-forum.com/topic/250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that/?tab=comments#comment-2924280", "origin": "L-forum", "suborigin": "250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that", "result": true, "Selector": "develop", "selectorShort": "develop", "MarkedSent": "reduction of grain with less agitation is working only with high acutance type developers. beutler, fx-1, r09/rodinal (which is containing para-amino phenol or metol). but when doing stand development (no agitation) the sharpness is getting worse. also these type of developers are giving more sharpness in a higher dilution. however you have to take care to take a minimum amount of concentrate for each 135-36 or 120 roll film, like 5ml-5,5ml for r09/rodinal. ultra fine grain type developers are always giving less sharpness. normally the grain reduction is archieved by a high amount of sodiumsulfite or a salt (potassium- or sodiumchloride) in the receipt or the use of a cd type ingrediënt like para- or ortho- phenylene diamine (mcm100 - w665). some films like fomapan creative 200, a mix between classical cubical type silver crystals and hexagonal crystals are doing great in a type developer with para- or ortho- phenylene diamine. i had great results in 35mm with this film and windisch w665. -----> develop !!!  1+0 (= stock) during 9:45 minutes at 20c. officially you need to do some rippening with these type of developers. the usa variant is panthermic 777, based on para- phenylene diamine. however the para version is much more staining and toxid then the ortho- version of this product. in the past it was used in hair dye. can you imagine .....", "sortedWord": "None", "Identifyer": null, "identifyer": 106801, "year": "2015"}, {"autor": "rpavich", "date": "2015-09-18 15:37:00", "content": "Do you not think it would have been better to put the blix in after the developer and before the wash? Make sure you haven't screwed up your stabiliser by contaminating it with blix. Steve I probably stated it wrong here; (I was going by memory.) When I developed though, I kept the paper from Unicolor in front of my and went step by step.", "link": "https://www.l-camera-forum.com/topic/250239-tried-the-rondinax-35u-and-c-41-today-for-the-first-time/?tab=comments#comment-2890328", "origin": "L-forum", "suborigin": "250239-tried-the-rondinax-35u-and-c-41-today-for-the-first-time", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "do you not think it would have been better to put the blix in after the developer and before the wash? make sure you haven't screwed up your stabiliser by contaminating it with blix. steve i probably stated it wrong here; (i was going by memory.) when -----> i !!!  -----> developed !!!  though, -----> i !!!  kept the paper from unicolor in front of my and went step by step.", "sortedWord": "None", "Identifyer": null, "identifyer": 106866, "year": "2015"}, {"autor": "Doc Henry", "date": "2015-09-18 18:46:00", "content": "Well...I tried my hand at developing C-41 for the first time with my new to me Rondinax 35U and boy, I really butchered up the process. ... Then I realized I hadn't started the clock so I wasn't positive when the time would be up, so I estimated. Then things went a little more smoothly until I got to the wash part and wasn't sure if I should open it up to do a real running water wash or not so I just did a rinse and turn 4 times for about a minute each. Then blix...then stabilizer. I was AMAZED when I pulled the negs from the wheel and saw the good news! At the moment they are hanging and I'll know more tomorrow morning but I just thought I'd tell you that it's a pretty cool unit and if I can mess the process up THIS much and still have an acceptable negative then I'm happy. RP congrat for your first development in C41 --img--  The result is fine IMO. Chrism has motorized his Rondinax. If he goes through here, he'll give you some tips ! Question : after \"rev.\" you must use \"Fix\". isn't ? what's \"blix\" ? and before \"Stab\" you must wash 5 mn in water All rev. and fix. process must be at constant temperature and tank closed ! As you know, I have Paterson tank to develop and the first time I developed at 38°C Now I do it at 30°C , so products are better preserved. As you know in film thread (I like film) I recently posted some pictures dev. at 30°C Best Henry PS : which film ? Edited September 18, 2015 by Doc Henry", "link": "https://www.l-camera-forum.com/topic/250239-tried-the-rondinax-35u-and-c-41-today-for-the-first-time/?tab=comments#comment-2890418", "origin": "L-forum", "suborigin": "250239-tried-the-rondinax-35u-and-c-41-today-for-the-first-time", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "well...i tried my hand at developing c-41 for the first time with my new to me rondinax 35u and boy, i really butchered up the process. ... then i realized i hadn't started the clock so i wasn't positive when the time would be up, so i estimated. then things went a little more smoothly until i got to the wash part and wasn't sure if i should open it up to do a real running water wash or not so i just did a rinse and turn 4 times for about a minute each. then blix...then stabilizer. i was amazed when i pulled the negs from the wheel and saw the good news! at the moment they are hanging and i'll know more tomorrow morning but i just thought i'd tell you that it's a pretty cool unit and if i can mess the process up this much and still have an acceptable negative then i'm happy. rp congrat for your first development in c41 --img--  the result is fine imo. chrism has motorized his rondinax. if he goes through here, he'll give you some tips ! question : after \"rev.\" you must use \"fix\". isn't ? what's \"blix\" ? and before \"stab\" you must wash 5 mn in water all rev. and fix. process must be at constant temperature and tank closed ! as you know, -----> i !!!  have paterson tank to develop and the first time -----> i !!!  -----> developed !!!  at 38°c now i do it at 30°c , so products are better preserved. as you know in film thread (i like film) i recently posted some pictures dev. at 30°c best henry ps : which film ? edited september 18, 2015 by doc henry", "sortedWord": "None", "Identifyer": null, "identifyer": 106867, "year": "2015"}, {"autor": "rpavich", "date": "2015-09-18 19:38:00", "content": "RP congrat for your first development in C41 --img--  The result is fine IMO. Chrism has motorized his Rondinax. If he goes through here, he'll give you some tips ! Question : after \"rev.\" you must use \"Fix\". isn't ? what's \"blix\" ? and before \"Stab\" you must wash 5 mn in water All rev. and fix. process must be at constant temperature and tank closed ! As you know, I have Paterson tank to develop and the first time I developed at 38°C Now I do it at 30°C , so products are better preserved. As you know in film thread (I like film) I recently posted some pictures dev. at 30°C Best Henry PS : which film ? I know..I left out a lot of steps repeating it here because I was reciting it from memory....but when I developed I used the script that came in the Unicolor kit that has each individual step.", "link": "https://www.l-camera-forum.com/topic/250239-tried-the-rondinax-35u-and-c-41-today-for-the-first-time/?tab=comments#comment-2890440", "origin": "L-forum", "suborigin": "250239-tried-the-rondinax-35u-and-c-41-today-for-the-first-time", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "rp congrat for your first development in c41 --img--  the result is fine imo. chrism has motorized his rondinax. if he goes through here, he'll give you some tips ! question : after \"rev.\" you must use \"fix\". isn't ? what's \"blix\" ? and before \"stab\" you must wash 5 mn in water all rev. and fix. process must be at constant temperature and tank closed ! as you know, -----> i !!!  have paterson tank to develop and the first time -----> i !!!  -----> developed !!!  at 38°c now i do it at 30°c , so products are better preserved. as you know in film thread (i like film) i recently posted some pictures dev. at 30°c best henry ps : which film ? i know..i left out a lot of steps repeating it here because i was reciting it from memory....but when i developed i used the script that came in the unicolor kit that has each individual step.", "sortedWord": "None", "Identifyer": null, "identifyer": 106871, "year": "2015"}, {"autor": "rpavich", "date": "2015-09-22 13:41:00", "content": "But don't forget to check on the longer development times for 30C processing. It may be different with your Unicolor chemicals but for instance with the Tetenal kit and fresh chemicals it goes from 3' 15\" seconds at 38C to 8' 00\" at 30C. Of course these times need extending as the chemicals become exhausted. But as the processing time is longer the percentage of time changing chemicals is proportionally less, so allowing a fraction more 'dither time' and less panic. Good luck. Steve I did my developing at 30 C this weekend and they came out great. I just went by the chart in the chemical kit for the roller style of developing. Thanks for the tip.", "link": "https://www.l-camera-forum.com/topic/250239-tried-the-rondinax-35u-and-c-41-today-for-the-first-time/?tab=comments#comment-2892298", "origin": "L-forum", "suborigin": "250239-tried-the-rondinax-35u-and-c-41-today-for-the-first-time", "result": true, "Selector": "my developing", "selectorShort": "develop", "MarkedSent": "but don't forget to check on the longer development times for 30c processing. it may be different with your unicolor chemicals but for instance with the tetenal kit and fresh chemicals it goes from 3' 15\" seconds at 38c to 8' 00\" at 30c. of course these times need extending as the chemicals become exhausted. but as the processing time is longer the percentage of time changing chemicals is proportionally less, so allowing a fraction more 'dither time' and less panic. good luck. steve i did -----> my !!!  -----> developing !!!  at 30 c this weekend and they came out great. i just went by the chart in the chemical kit for the roller style of developing. thanks for the tip.", "sortedWord": "None", "Identifyer": null, "identifyer": 106873, "year": "2015"}, {"autor": "rpavich", "date": "2015-11-20 19:13:00", "content": " I was mulling over the question of shooting Tri-X at different speeds and was wondering if during a roll, what would happen if I found myself needing to shoot at high ISO and then much lower ISO. So, I took these shots in my office at work. I developed them in Diafine at the normal 3 minute time.My scanner automatically compensated for any major deviation in lightness or darkness. No...they are not great and yes, I have some surge marks but it does answer the question for me; \" what if I have to go indoors to shoot a few shots at 1600 when I've already shot most of my roll of Tri-X at 400??\"I just thought it was interesting information. I'm NOT a pro, I'm NOT claiming some special insight...just putting this here for information.--img-- ", "link": "https://www.l-camera-forum.com/topic/253376-shot-a-roll-of-tri-x-frame-by-frame-at-200-400-800-1600-and-3200/?tab=comments#comment-2933162", "origin": "L-forum", "suborigin": "253376-shot-a-roll-of-tri-x-frame-by-frame-at-200-400-800-1600-and-3200", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": " i was mulling over the question of shooting tri-x at different speeds and was wondering if during a roll, what would happen if i found myself needing to shoot at high iso and then much lower iso. so, i took these shots in my office at work. -----> i !!!  -----> developed !!!  them in diafine at the normal 3 minute time.my scanner automatically compensated for any major deviation in lightness or darkness. no...they are not great and yes, i have some surge marks but it does answer the question for me; \" what if i have to go indoors to shoot a few shots at 1600 when i've already shot most of my roll of tri-x at 400??\"i just thought it was interesting information. i'm not a pro, i'm not claiming some special insight...just putting this here for information.--img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 106930, "year": "2015"}, {"autor": "rpavich", "date": "2015-11-17 14:19:00", "content": " Hi, I have started to get funny looking grain on my B&W shots that I've developed with HC-110. This has been the way the last two rolls have looked. I'm suspecting that my fixer is old but that's just a random guess. I'm using Dilution B and this was stock box speed Tri-X.Has anyone seen this?They sort of look like rice grains. --img-- ", "link": "https://www.l-camera-forum.com/topic/253230-question-about-funny-looking-grain/?tab=comments#comment-2930539", "origin": "L-forum", "suborigin": "253230-question-about-funny-looking-grain", "result": true, "Selector": "i've developed", "selectorShort": "develop", "MarkedSent": " hi, -----> i !!!  have started to get funny looking grain on my b&w shots that -----> i !!! 've -----> developed !!!  with hc-110. this has been the way the last two rolls have looked. i'm suspecting that my fixer is old but that's just a random guess. i'm using dilution b and this was stock box speed tri-x.has anyone seen this?they sort of look like rice grains. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 106963, "year": "2015"}, {"autor": "Herr Barnack", "date": "2015-01-25 21:12:00", "content": "Lenses do not need to be cleaned with lens cleaner liquid and lens cleaning tissue or a microfiber cloth nearly as often as many people imagine that they do. I have read of people actually removing the lens coatings from their lens front element due to obsessive over-cleaning. That does not help your image quality, even if your front & rear lens elements are surgically sterile. My usual lens cleaning regimen is to use a Giotto rocket blower bulb to blow dust off my front element. This usually is sufficient. If I have a stubborn dust particle, I will knock it loose with a horse hair lens brush and then use the blower. Once in a great while, I will get a rain drop on my front element that dries and leaves a water spot. for this, I use a microfiber cloth with photographic lens cleaner spray applied to the cloth. My two microfiber cloths that I use on my M lenses are stored in a ziplock bag and are used only on my camera lenses. I have a second lens cloth that I carry in my pocket, which is for cleaning my glasses. This cloth is never used on a camera lens. I wash my camera lens cleaning cloths by hand using a bit of laundry detergent in a clean bowl, rinse multiple times, then wring them out and hang them on a plastic coat hanger to air dry in a dust free area, just the same as if I were hanging just developed rolls of film to dry. Of course, the wash and rinse water is either distilled water or purified bottled drinking water. Maybe I'm a bit obsessive with the cloths I use on my megadollar Leica M lenses, but then again I have never scratched a lens element by careless cleaning. --img--  I have not used a UV filter for lens protection until I began experimenting with this practice very recently. If I discover that a high quality UV filter like B+W or Heliopan does not degrade image quality, I may begin shooting with UV filters on my lenses all the time. At present, I only put a UV filter on a lens if I am photographing in a very windy, dry & dusty place where dirt and dust are in the air, or in a situation where I am in very close proximity to people, as in photographing at an event like a music festival, sports event, etc. I have never had a lens front element damaged due to not using a UV filter in 35+ years of photography. This is how I do it; YMMV. Edited January 25, 2015 by Carlos Danger", "link": "https://www.l-camera-forum.com/topic/240268-cleaning-your-leica-lens/?tab=comments#comment-2752853", "origin": "L-forum", "suborigin": "240268-cleaning-your-leica-lens", "result": false, "Selector": "i were hanging just developed", "selectorShort": "develop", "MarkedSent": "i wash my camera lens cleaning cloths by hand using a bit of laundry detergent in a clean bowl, rinse multiple times, then wring them out and hang them on a plastic coat hanger to air dry in a dust free area, just the same as if i were hanging just developed -----> rolls !!!  of film to dry.", "sortedWord": "roll", "Identifyer": null, "identifyer": 87237, "year": "2015"}, {"autor": "sanzaw", "date": "2015-08-21 10:12:00", "content": "Your approach makes limited use of the tablet for photography. My need is to be able to back up daily for insurance against loss or irreparable damage en route. A small netbook meets my current needs. Next week, I'll be trying out introducing a wireless portable drive to see if it speeds up the workflow. Here's a few modifications to the workflow I'm going to try: Still shoot DNG+JPEG, but use smaller SD cards (16GB) and do intra-day on-the-go backups to the WD wireless drive (2TB). The aim here is to minimize loading time at the end-of-day, especially avoiding the supremely slow loading time to the iPad camera roll. As loading to the wireless drive takes place, review the shots via iPad wirelessly using the WD app Shortlist candidates as usual by electing to \"Open in Photos\", which will launch the camera roll so that the JPEG will be saved Likewise, if I would like to develop any of the candidate shots, open the DNG in PhotoGene This allows me to achieve 2 more capabilities: Reduce the time-to-load dramatically by not loading the candidates to the iPad camera roll, and Make backups at the same time. But that's the \"theory\". Will post the reality findings next week. Stay tuned! --img--  Edited August 21, 2015 by sanzaw", "link": "https://www.l-camera-forum.com/topic/243892-use-of-a-tablet-computer-for-travel/?tab=comments#comment-2874992", "origin": "L-forum", "suborigin": "243892-use-of-a-tablet-computer-for-travel", "result": false, "Selector": "i would like to develop", "selectorShort": "develop", "MarkedSent": "as loading to the wireless drive takes place, review the shots via ipad wirelessly using the wd app shortlist candidates as usual by electing to \"open in photos\", which will launch the camera -----> roll !!!  so that the jpeg will be saved likewise, if i would like to develop any of the candidate shots, open the dng in photogene this allows me to achieve 2 more capabilities: reduce the time-to-load dramatically by not loading the candidates to the ipad camera -----> roll !!! , and make backups at the same time.", "sortedWord": "roll", "Identifyer": null, "identifyer": 94072, "year": "2015"}, {"autor": "rpavich", "date": "2015-09-17 08:57:00", "content": " I'm coming from the digital world and I'm developing my first films. Now that I can reliably get film onto a reel, and get it developed, my next question is this: how do I reduce contrast and grain when developing? I shot a roll of Kentmere 400 @400 to test a new camera from KEH so the images aren't keepsakes. I decided to stand develop them because I'd never done it.I used this recipe: Adonal 1:100 Agitate for 1 minute (used Paterson tank stir stick gently) Agitate at every 30 minute mark for 10 seconds the same way Total time 90 minutes. Wash Fix Wash HangHere is a representative shot. It had SO MUCH contrast that I had to slam the contrast slider in Lightroom all the way to the left.I know that contrast and grain are controlled via the developing process (at least partially) so how can I tame that aspect of it? --img-- ", "link": "https://www.l-camera-forum.com/topic/250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that/?tab=comments#comment-2889571", "origin": "L-forum", "suborigin": "250210-how-to-reduce-grain-and-contrast-in-developing-never-thought-id-ask-that", "result": false, "Selector": "i'm developing", "selectorShort": "develop", "MarkedSent": " i'm coming from the digital world and i'm developing my first -----> films !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 106789, "year": "2015"}, {"autor": "jonnyboy", "date": "2015-11-28 14:39:00", "content": " Hi guys, So it's that time of the year when is getting dark outside at 4pm and is difficult to shoot at 400asa so I'm currently shooting a roll with the meter of the M6 set to 1600. I develop my own rolls but I never pushed film.Could anyone tell me a bit more how to get results using Ilfosol 3 as a developer?I develop on a Paterson kit, 2 rolls at the time...All I need to know is:Is the dilution of Ilfosol still the same when I push film?How long the rolls has to stay in the developer and how often to I agitate the tanks? Any help would be really appreciated!Thanks", "link": "https://www.l-camera-forum.com/topic/253717-pushing-tri-x-to-1600-with-ilfosol-3/?tab=comments#comment-2938636", "origin": "L-forum", "suborigin": "253717-pushing-tri-x-to-1600-with-ilfosol-3", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i develop my own -----> rolls !!! ", "sortedWord": "roll", "Identifyer": null, "identifyer": 106924, "year": "2015"}, {"autor": "rpavich", "date": "2015-08-15 13:41:00", "content": " Well...I decided to try my hand at developing at home. I got everything ready and thought it would go reasonably smooth but... The ONE thing that I didn't check out well enough was how to load the reel, but when I realized that I was committed inside my changing bag so I figured, the worst that could happen is that I'd ruin the film. Well, I did. I had a really hard time getting it ON the reel, and wasn't sure how tight it should be but after I was done developing, I looked up a YT video and oh boy....waaaaaayyyyy too tight. So I finished it and it's drying but it's really bad. It will become my practice film when it's dry. --img--  One question; do you like the steel reels or the \"quick load\" plastic ones? The quick load plastic ones (that ratchet) seem much easier for a noob like me. It was a good experience over all, it gave me an idea of what I'd need to do as far as the rest of the steps. One thing I'll mention also, my changing bag is only 16\" x 17\" and it seemed really cramped. My instinct is to buy a bigger one that's sort of a pop-tent design but I'm wondering if that's just a knee jerk reaction to my experience?", "link": "https://www.l-camera-forum.com/topic/248990-wowmy-first-try-at-home-developing-bw-was-so-bad/?tab=comments#comment-2872046", "origin": "L-forum", "suborigin": "248990-wowmy-first-try-at-home-developing-bw-was-so-bad", "result": false, "Selector": "i was done developing", "selectorShort": "develop", "MarkedSent": "i had a really hard time getting it on the reel, and wasn't sure how tight it should be but after i was done developing, i looked up a yt -----> video !!! ", "sortedWord": "video", "Identifyer": null, "identifyer": 106942, "year": "2015"}, {"autor": "Wayne", "date": "2015-08-15 21:27:00", "content": " I am taking a leap here and guessing that this is the best place on this forum to ask this question: I have never developed a roll of black and white film in my life. Further, I have never watched anyone develop a roll of black and white film. Even further, I have no interest is building a sophisticated black room for the purpose of developing and printing, chemically, from negatives. My interest is is obtaining the minimum amount of equipment and skill to develop black and white film solely for the purpose of creating digital prints from the negatives. I have searched the web and been unable to find any tutorial on the most simplistic way of reaching my goal. I have been able to find sites that offer comprehensive information on the process and equipment involved in setting up a full blown dark room, but nothing covering just the most basic process. I have heard of individuals developing a roll of film with nothing more than a canister, chemical, and a darkened space......even nothing more than a hand muff.....but have never seen the process explained in detail, or, exactly what is needed to do it. Is such information available on the web. I anticipate getting my M3 back from CLR in a few months and, if possible, would like to give it a try. Thanks, Wayne", "link": "https://www.l-camera-forum.com/topic/249007-developing-film/?tab=comments#comment-2872279", "origin": "L-forum", "suborigin": "249007-developing-film", "result": false, "Selector": "i have never developed", "selectorShort": "develop", "MarkedSent": " i am taking a leap here and guessing that this is the best place on this forum to ask this question: i have never developed a -----> roll !!!  of black and white film in my life.", "sortedWord": "roll", "Identifyer": null, "identifyer": 107035, "year": "2015"}, {"autor": "rpavich", "date": "2015-08-15 21:43:00", "content": "I am taking a leap here and guessing that this is the best place on this forum to ask this question: I have never developed a roll of black and white film in my life. Further, I have never watched anyone develop a roll of black and white film. Even further, I have no interest is building a sophisticated black room for the purpose of developing and printing, chemically, from negatives. My interest is is obtaining the minimum amount of equipment and skill to develop black and white film solely for the purpose of creating digital prints from the negatives. I have searched the web and been unable to find any tutorial on the most simplistic way of reaching my goal. I have been able to find sites that offer comprehensive information on the process and equipment involved in setting up a full blown dark room, but nothing covering just the most basic process. I have heard of individuals developing a roll of film with nothing more than a canister, chemical, and a darkened space......even nothing more than a hand muff.....but have never seen the process explained in detail, or, exactly what is needed to do it. Is such information available on the web. I anticipate getting my M3 back from CLR in a few months and, if possible, would like to give it a try. Thanks, Wayne I'm a lot like you. I've no interest in all of the rest of the stuff that goes along with shooting film, I just want good scanned negatives cheap. --img--  Youtube is your friend. There are dozens of videos showing exactly what to do to develop black and white film at home....dozens. Not to mention loads of websites with instructions. I'm currently trying a \"monobath\" developer to make things even more simple. Just google \"R3 Monobath\" to get info.", "link": "https://www.l-camera-forum.com/topic/249007-developing-film/?tab=comments#comment-2872285", "origin": "L-forum", "suborigin": "249007-developing-film", "result": false, "Selector": "i have never developed", "selectorShort": "develop", "MarkedSent": "i am taking a leap here and guessing that this is the best place on this forum to ask this question: i have never developed a -----> roll !!!  of black and white film in my life.", "sortedWord": "roll", "Identifyer": null, "identifyer": 107036, "year": "2015"}, {"autor": "jonnyboy", "date": "2015-05-03 10:59:00", "content": " I started few months ago shooting my first rolls of film, and last month I started developing my own rolls.After the first 3 attempt (wasted 3 rolls) I finally got into it!! I have been developing Ilford HP5 in a Paterson kit, 2 rolls at once with decent results. Last week I bought few Tri-X400 just to give it a go....and this morning I develop the film, 1 roll. Nothing came out! --img-- Somehow everytime I develop 1 roll it always got wasted I dont understand why....I use half of everything when I use 1 roll (300ml solutions) but nothing has come out! Any thoughts?Gutted I lost my 30's birthday pictures --img-- ", "link": "https://www.l-camera-forum.com/topic/244546-begin-in-darkroom/?tab=comments#comment-2809307", "origin": "L-forum", "suborigin": "244546-begin-in-darkroom", "result": false, "Selector": "i started developing", "selectorShort": "develop", "MarkedSent": " i started few months ago shooting my first -----> rolls !!!  of film, and last month i started developing my own rolls.after the first 3 attempt (wasted 3 -----> rolls !!! ) i finally got into it!!", "sortedWord": "roll", "Identifyer": null, "identifyer": 107103, "year": "2015"}, {"autor": "jonnyboy", "date": "2015-05-03 12:03:00", "content": "No it's not black, I would say is the opposite! Just figure it out I entered the wrong dilution in the Dev Tool....it was supposed to be 1+9 but instead I used 1+14...that may be the thing? Silly me!Also, if I always develop 2 rolls at once....if I develop 1 roll do I have to use half of the solutions or can I stick to the normal 600ml?", "link": "https://www.l-camera-forum.com/topic/244546-begin-in-darkroom/?tab=comments#comment-2809342", "origin": "L-forum", "suborigin": "244546-begin-in-darkroom", "result": false, "Selector": "i always develop", "selectorShort": "develop", "MarkedSent": "silly me!also, if i always develop 2 -----> rolls !!!  at once....if i develop 1 roll do i have to use half of the solutions or can i stick to the normal 600ml?", "sortedWord": "roll", "Identifyer": null, "identifyer": 107105, "year": "2015"}, {"autor": "Doc Henry", "date": "2015-05-03 12:33:00", "content": "Jonny, I also use Ilford HP5 and I develop a single roll every time in Ilfosol S diluted 1 : 4 - 10 minutes -20°C . I also use a two-roll Paterson tank. The reason given by Philipp is possible, not enough developer ? but Paterson tank can hold up to 800 ml (I just checked) , if you put 2 rolls together.What about the result of the second roll ? well developed ? Best Henry Edited May 3, 2015 by Doc Henry", "link": "https://www.l-camera-forum.com/topic/244546-begin-in-darkroom/?tab=comments#comment-2809358", "origin": "L-forum", "suborigin": "244546-begin-in-darkroom", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "jonny, i also use ilford hp5 and i develop a single -----> roll !!!  every time in ilfosol s diluted 1 : 4 - 10 minutes -20°c .", "sortedWord": "roll", "Identifyer": null, "identifyer": 107107, "year": "2015"}, {"autor": "Michael Hiles", "date": "2015-05-03 12:36:00", "content": "No it's not black, I would say is the opposite! Just figure it out I entered the wrong dilution in the Dev Tool....it was supposed to be 1+9 but instead I used 1+14...that may be the thing? Silly me! Also, if I always develop 2 rolls at once....if I develop 1 roll do I have to use half of the solutions or can I stick to the normal 600ml? The dilution mistake should produce lower contrast negatives - but not nothing. For the quantity, your instructions from the tank should tell you how much developer you need for 1 roll. Or just test it out with empty reels. Philipp's point is worth considering - if you use 1/2 the developer and by mistake put the sigle roll of film in the top of the tank, you will certainly have problems. As you agitate during development, some solution will get onto the film, but the effect would be difficult to predict. Not only the developer, but the fixer. But you clearly are making some variety of mistake - developing 1 roll in a 2 roll tank is no problem, and there should be no tricks. Common sense rules. Edited May 3, 2015 by Michael Hiles", "link": "https://www.l-camera-forum.com/topic/244546-begin-in-darkroom/?tab=comments#comment-2809360", "origin": "L-forum", "suborigin": "244546-begin-in-darkroom", "result": false, "Selector": "i always develop", "selectorShort": "develop", "MarkedSent": "also, if i always develop 2 -----> rolls !!!  at once....if i develop 1 roll do i have to use half of the solutions or can i stick to the normal 600ml?", "sortedWord": "roll", "Identifyer": null, "identifyer": 107108, "year": "2015"}, {"autor": "jonnyboy", "date": "2015-05-06 19:46:00", "content": "I could have used the chemicals in the wrong way - although I have every Jug labeled with different color so that I dont get confused...but mistakes occurs every once in a while so it could be the case...it did happen to me already though...and once, I had the same issue (before developing my own) with 1 roll developed by Snappy Snaps. I have been thinking about it...I could have used the chemicals in the wrong order once....maybe twice (but i doubt it!)...but a service like Snappy Snap (which is far from professional, but still!) will not make mistakes with chemicals.I used the fixer only 2, I dont think it was used too much...or am I wrong?What's bugging me is: could it be that when I chance the lens to the camera there is light filtering through the curtain and mess up the film? Because that's the only thing I have on my mind that's happened in those 3 wasted rolls.....I changed the lens --img--  I really just started developing films and I'm far away to feel confident enough to move into 'grown-up system'...the Paterson tank is an economic and decent way for me right now to start learning and move my first steps....I like to do one step at the time...eventually I wil get into the proper biz once I get more into it. So far I'm pretty satisfied with the first rolls I developed - there been some waste but hey that's how you learn things!", "link": "https://www.l-camera-forum.com/topic/244546-begin-in-darkroom/?tab=comments#comment-2811688", "origin": "L-forum", "suborigin": "244546-begin-in-darkroom", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "so far i'm pretty satisfied with the first -----> rolls !!!  i developed - there been some waste", "sortedWord": "roll", "Identifyer": null, "identifyer": 107117, "year": "2015"}, {"autor": "Rytis", "date": "2015-05-07 05:22:00", "content": " Ive been reading this forum for a while and just recently decided join in. Appreciate for all info you guys put up here-its just great! My photographic joerney started about 4 years ago.At first i was exited more about dials and buttons on the camera more than final image itself.When the time went by im started to get anoyed by the technical side of photography, dive in to film and mirrorless .Film was and still is ok, have a nice collection of contax cameras and i like to develop my film myself,but mirrorless (my choice was fuji) still cant get a grip with it.. Recently i bumt in to very well priced and good condition grey M9.. it just swept me of my feet. Im sure you heard a lot bla bla bla,like how it changed the way someone photographed before..that it is \"an extencion of the eye..\" and all that stuff, but for me its simplicity of the camera,that i cant get enough with, it feels great,just to take pictures and thats all ,what about photography should be. For the lens ive got VC 35/1.4 MC for now , i cant beleave the IQ im getting, not to mention rendering and character.Currently im selling some of my fuji stuff and looking around for 50mm. This time gotta be Leica one. I never said so,but this time im pretty sure im in the right hands now..or i should say other way around..ive got the right camera for me. Best regards Rytis", "link": "https://www.l-camera-forum.com/topic/244734-hello-everyone/?tab=comments#comment-2811946", "origin": "L-forum", "suborigin": "244734-hello-everyone", "result": false, "Selector": "i like to develop", "selectorShort": "develop", "MarkedSent": "i was exited more about dials and buttons on the camera more than final image itself.when the time went by im started to get anoyed by the technical side of photography, dive in to -----> film !!!  and mirrorless .film was and still is ok, have a nice collection of contax cameras and i like to develop my -----> film !!!  myself,but mirrorless (my choice was fuji) still cant get a grip with it..", "sortedWord": "film", "Identifyer": null, "identifyer": 114956, "year": "2015"}, {"autor": "jip", "date": "2015-08-02 21:23:00", "content": " Tomorrow I'm developing my roll of FP4+ which I also shot that day with the Leica R8, and Sandokan (Ravi) his Apo-Summicron-R 90mm, I hope he got some nice shots with my Summilux-R 80mm --img-- ", "link": "https://www.l-camera-forum.com/topic/245379-leica-meeting-in-rotterdam-with-photowalk/page/6/?tab=comments#comment-2865172", "origin": "L-forum", "suborigin": "245379-leica-meeting-in-rotterdam-with-photowalk", "result": false, "Selector": "i'm developing", "selectorShort": "develop", "MarkedSent": " tomorrow i'm developing my -----> roll !!!  of fp4+ which i also shot that day with the leica r8, and sandokan (ravi) his apo-summicron-r 90mm, i hope he got some nice shots with my summilux-r 80mm --img--", "sortedWord": "roll", "Identifyer": null, "identifyer": 133772, "year": "2015"}], "name": "Leicasortedout2015develop"}