{"interestingcomments": [{"autor": "LeicaS2", "date": "2021-05-17 20:57:00", "content": "Hey Apatel, Harry Benz does custom work. That’s how the JLoop was invented at “J”s request. I suggest you request Harry to do an “A” Strap, which would be a regular open strap with a snap on both ends, one leading to a hand strap and the other end to the short connector he calls a dongle that comes with the JLoop, since snaps could not attach directly to the eyehole. He will do it and perhaps name it after you, but you will need to be patient for say ten weeks. Harry should name it after me since I just invented it, but the letter J has already been taken. Jack --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/320770-gordy%E2%80%99s-strap-question/?tab=comments#comment-4202752", "origin": "L-forum", "suborigin": "320770-gordy%E2%80%99s-strap-question", "result": true, "Selector": "i just invented", "selectorShort": "invent", "MarkedSent": "hey apatel, harry benz does custom work. that’s how the jloop was invented at “j”s request. i suggest you request harry to do an “a” strap, which would be a regular open strap with a snap on both ends, one leading to a hand strap and the other end to the short connector he calls a dongle that comes with the jloop, since snaps could not attach directly to the eyehole. he will do it and perhaps name it after you, but you will need to be patient for say ten weeks. harry should name it after me since -----> i !!!  -----> just !!!  -----> invented !!!  it, but the letter j has already been taken. jack --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 8367, "year": "2021"}, {"autor": "Louis", "date": "2021-08-02 18:54:00", "content": " 3 hours ago, HuntingSand said: Hi Louis, thanks for checking in. Indeed, there's a real need to get back to normal here, which includes all the small and large pleasures the French capital can provide. This \"sanitary dictatorship\" as it is called here may have ramification for next year's elections, though. Anyway, La Coupole is open for business, which is all that matters 🙂 You know, there is something that you should always keep in mind: French people love to complain!... There is something in the DNA that never makes people satisfied. Happy, yes; but never satisfied! They would have complained even if the government said anything different. I guess this is a kind of self-therapy to get the tension out of the system!... Don' t forget we invented both \"Revolution\" and Guillotine! 🤣 Ahhhhh; La Coupole! Where all the freethinkers, all the \"Wannabes\" , and all the others loved to gather for a \"Choucroute\" or just a glass of wine! Where you can see the celebrities from all around the world; and all those who want to see them; and of course; the tourists!.... This is how it used to be and I miss it so much!... I don't know how much it has changed since I moved from Paris; although it had not changed from many decades!.... Nostalgia!..... Enjoy your glass of wine, my friend! Edited August 2 by Louis", "link": "https://www.l-camera-forum.com/topic/323238-paris-covid-related-protests/page/2/?tab=comments#comment-4250056", "origin": "L-forum", "suborigin": "323238-paris-covid-related-protests", "result": true, "Selector": "we invented", "selectorShort": "invent", "MarkedSent": " 3 hours ago, huntingsand said: hi louis, thanks for checking in. indeed, there's a real need to get back to normal here, which includes all the small and large pleasures the french capital can provide. this \"sanitary dictatorship\" as it is called here may have ramification for next year's elections, though. anyway, la coupole is open for business, which is all that matters 🙂 you know, there is something that you should always keep in mind: french people love to complain!... there is something in the dna that never makes people satisfied. happy, yes; but never satisfied! they would have complained even if the government said anything different. i guess this is a kind of self-therapy to get the tension out of the system!... don' t forget -----> we !!!  -----> invented !!!  both \"revolution\" and guillotine! 🤣 ahhhhh; la coupole! where all the freethinkers, all the \"wannabes\" , and all the others loved to gather for a \"choucroute\" or just a glass of wine! where you can see the celebrities from all around the world; and all those who want to see them; and of course; the tourists!.... this is how it used to be and i miss it so much!... i don't know how much it has changed since i moved from paris; although it had not changed from many decades!.... nostalgia!..... enjoy your glass of wine, my friend! edited august 2 by louis", "sortedWord": "None", "Identifyer": null, "identifyer": 46597, "year": "2021"}], "name": "Leicasortedout2021invent"}