{"interestingcomments": [{"autor": "Geitekaas", "date": "2018-10-20 12:50:00", "content": " Hiya people, I haven’t introduced myself yet, and I will. A few things in short: I am a musician (use to be a photographer in the nineties with mostly manual gear: Leica M 50 mm f2.0. Contax with Zeiss 85 mm f1.4 and 25 mm. Made my bread with it. Am planning to get back in Leica digital after a years of Sigma gear SD10/15/1M with 50 and 70 lenses. I have a few questions: 1) I have been looking on youtube and found many AF speedexamples for the x1 and the x2. Little movies where you see how fast (or slow) the AF is. But I have to find one of the X itself? I really would like to see one. Is here someone that has such a nice little example of an X focussing on several different objects in a lighted room or outside? 2) I would like to know if the Olympus or Leica EVF also has the little focus rectangle that colors if something is in focus like on your lcd screen? Does it also has the focuspeaking as in the lcd? Otherwise, I would not have a use for a evf... 3) Is the focusring sturdy or loose? E.g. compared to the Q. well, many questions, I hope I am not to much of a bother. I already am planning to buy a black Q this december. I know this to be a very good camera. However, for my wife (and also for myself) I really would like this X gem. The X1/2 are to small for my taste. I ‘need’ a bigger camera😀 I have found a nice one almost new but it is a long ride so I would like to know beforehand... have a great one!", "link": "https://www.l-camera-forum.com/topic/290694-x-and-af-speed-questions/?tab=comments#comment-3616015", "origin": "L-forum", "suborigin": "290694-x-and-af-speed-questions", "result": true, "Selector": "i haven’t introduced", "selectorShort": "introduce", "MarkedSent": " hiya people, -----> i !!!  -----> have !!! -----> n’t !!!  -----> introduced !!!  myself yet, and -----> i !!!  will. a few things in short: i am a musician (use to be a photographer in the nineties with mostly manual gear: leica m 50 mm f2.0. contax with zeiss 85 mm f1.4 and 25 mm. made my bread with it. am planning to get back in leica digital after a years of sigma gear sd10/15/1m with 50 and 70 lenses. i have a few questions: 1) i have been looking on youtube and found many af speedexamples for the x1 and the x2. little movies where you see how fast (or slow) the af is. but i have to find one of the x itself? i really would like to see one. is here someone that has such a nice little example of an x focussing on several different objects in a lighted room or outside? 2) i would like to know if the olympus or leica evf also has the little focus rectangle that colors if something is in focus like on your lcd screen? does it also has the focuspeaking as in the lcd? otherwise, i would not have a use for a evf... 3) is the focusring sturdy or loose? e.g. compared to the q. well, many questions, i hope i am not to much of a bother. i already am planning to buy a black q this december. i know this to be a very good camera. however, for my wife (and also for myself) i really would like this x gem. the x1/2 are to small for my taste. i ‘need’ a bigger camera😀 i have found a nice one almost new but it is a long ride so i would like to know beforehand... have a great one!", "sortedWord": "None", "Identifyer": null, "identifyer": 11159, "year": "2018"}, {"autor": "Deliberate1", "date": "2018-09-14 11:15:00", "content": "I probably has been manufactured secretly more than five years back --img--  Congratulations on the James Bond Edition! Strange, but my Q seems quite agitated ever since I introduced it to my 007. M seems unaffected, if not aloof. My IIIc remains clueless. David", "link": "https://www.l-camera-forum.com/topic/289368-date-on-exterior-box/?tab=comments#comment-3592976", "origin": "L-forum", "suborigin": "289368-date-on-exterior-box", "result": true, "Selector": "i introduced", "selectorShort": "introduce", "MarkedSent": "i probably has been manufactured secretly more than five years back --img--  congratulations on the james bond edition! strange, but my q seems quite agitated ever since -----> i !!!  -----> introduced !!!  it to my 007. m seems unaffected, if not aloof. my iiic remains clueless. david", "sortedWord": "None", "Identifyer": null, "identifyer": 32325, "year": "2018"}, {"autor": "geetee1972", "date": "2018-07-02 16:37:00", "content": "Rob - it's ironic that the very evident colour cast you're seeing, is the same one I tend to introduce deliberately when I post process. I'm almost tempted to ask whether this modification is available as an after market option! But of course what you're seeing is a problem, as what you want is a neutral position to work from, not one with a cast. The weather here in the UK is currently ridiculously hot and clear. How about I provide you with a reference image from my SL? If we align the settings then we can create a pretty good comparisson for you to talk to Leica about.", "link": "https://www.l-camera-forum.com/topic/286138-color-cast-issue-leica-sl-vs-s/page/2/?tab=comments#comment-3548258", "origin": "L-forum", "suborigin": "286138-color-cast-issue-leica-sl-vs-s", "result": true, "Selector": "i tend to introduce", "selectorShort": "introduce", "MarkedSent": "rob - it's ironic that the very evident colour cast you're seeing, is the same one -----> i !!!  -----> tend !!!  -----> to !!!  -----> introduce !!!  deliberately when -----> i !!!  post process. i'm almost tempted to ask whether this modification is available as an after market option! but of course what you're seeing is a problem, as what you want is a neutral position to work from, not one with a cast. the weather here in the uk is currently ridiculously hot and clear. how about i provide you with a reference image from my sl? if we align the settings then we can create a pretty good comparisson for you to talk to leica about.", "sortedWord": "None", "Identifyer": null, "identifyer": 32853, "year": "2018"}, {"autor": "helged", "date": "2018-07-03 10:27:00", "content": "Rob - it's ironic that the very evident colour cast you're seeing, is the same one I tend to introduce deliberately when I post process. I'm almost tempted to ask whether this modification is available as an after market option! ... Good point! Your colour palette, Greg, reminds me strongly about 75mm Summilux-M shoot wide open. Beautiful tonal rendering...!", "link": "https://www.l-camera-forum.com/topic/286138-color-cast-issue-leica-sl-vs-s/page/2/?tab=comments#comment-3548720", "origin": "L-forum", "suborigin": "286138-color-cast-issue-leica-sl-vs-s", "result": true, "Selector": "i tend to introduce", "selectorShort": "introduce", "MarkedSent": "rob - it's ironic that the very evident colour cast you're seeing, is the same one -----> i !!!  -----> tend !!!  -----> to !!!  -----> introduce !!!  deliberately when -----> i !!!  post process. i'm almost tempted to ask whether this modification is available as an after market option! ... good point! your colour palette, greg, reminds me strongly about 75mm summilux-m shoot wide open. beautiful tonal rendering...!", "sortedWord": "None", "Identifyer": null, "identifyer": 32859, "year": "2018"}, {"autor": "Ambro51", "date": "2018-07-13 12:57:00", "content": "So I’m thinking about viewfinders. For the UR, This was uncharted territory for Barnack. Did he “really” use and carry the folding finder? It is so long with the lens compressed, makes the easily pocketable camera tough to carry unless you pull it off each time. ••••• I’m going to introduce a radical thought....the accessory shoe IS a viewfinder! Sleek and perfectly proportioned. Here’s how, when you hold the camera to the eye, it’s easy to get it perfectly level looking across the flat bottom of the shoe. The sides Are the width of the picture field. You cover the central point of the picture with the front shoe stop piece...you’re “framed”. Try it", "link": "https://www.l-camera-forum.com/topic/138638-working-ur-leica/page/5/?tab=comments#comment-3555123", "origin": "L-forum", "suborigin": "138638-working-ur-leica", "result": true, "Selector": "i’m going to introduce", "selectorShort": "introduce", "MarkedSent": "so i’m thinking about viewfinders. for the ur, this was uncharted territory for barnack. did he “really” use and carry the folding finder? it is so long with the lens compressed, makes the easily pocketable camera tough to carry unless you pull it off each time. ••••• -----> i !!! ’m -----> going !!!  -----> to !!!  -----> introduce !!!  a radical thought....the accessory shoe is a viewfinder! sleek and perfectly proportioned. here’s how, when you hold the camera to the eye, it’s easy to get it perfectly level looking across the flat bottom of the shoe. the sides are the width of the picture field. you cover the central point of the picture with the front shoe stop piece...you’re “framed”. try it", "sortedWord": "None", "Identifyer": null, "identifyer": 35734, "year": "2018"}, {"autor": "vicente dolz", "date": "2018-10-13 08:23:00", "content": "Good Morning. I introduce myself in this forum, since I release a Leica Q. I have other Leicas (analog) and my capricious nature has made me try other brands but I always go back to Leica. A hug for everyone", "link": "https://www.l-camera-forum.com/topic/186962-welcome/page/6/?tab=comments#comment-3611561", "origin": "L-forum", "suborigin": "186962-welcome", "result": true, "Selector": "i introduce", "selectorShort": "introduce", "MarkedSent": "good morning. -----> i !!!  -----> introduce !!!  myself in this forum, since -----> i !!!  release a leica q. i have other leicas (analog) and my capricious nature has made me try other brands but i always go back to leica. a hug for everyone", "sortedWord": "None", "Identifyer": null, "identifyer": 113869, "year": "2018"}], "name": "Leicasortedout2018introduce"}