{"interestingcomments": [{"autor": "asiafish", "date": "2017-02-04 00:18:00", "content": "Leica has created a digital version of their M7 film offering. I was fortunate enough to purchase one of these cameras three weeks ago. I put my name on the local wait list even before the camera was announced, but was bumped a couple of positions by higher-priority customers and saw the opportunity to have a camera in hand in time for a planned vacation, so I bit. Shooting Leicas is a major entertainment outlet for me, and I have shot with every mainline production M I can think of, M1, M2, M3, M4, M5, M4-2, M4-P, M6, M6TTL, M7, MP, M-A, M8, M8.2, M9P, Monochrom, M-P240, M246, and M262. Still, the screen-less Leica digital sounded like loads of fun, and did not disappoint. I have had the chance to shoot my M-D for one day at Universal Studios Hollywood and for 8 days in the various attractions in Orlando, Florida. During this time, I averaged 150 frames per day, for a total of just under 1400 images. I shot the camera “naked” of any case or protector for the minimum bulk. I attached the new 35mm/2.0/ASPH/II lens and an E39 UVa and didn’t look back. The camera shoots like an M7. It meters like an M7, focuses like an M7, and uses the same muscle memories for the on/off switch that I developed with my M7. The big difference is not the extra depth, which is truly minimal, but rather the adjustable ISO dial on the back, which you don’t get to leverage on an M7 without changing rolls of film. Having any speed film from 200-6400 ISO at the twist of a dial is very handy. The rest of the body works like an M7, and the bump on the back of the top plate holds your thumb very much like a film winding lever. All in all, an excellent handling design. O.K., there is one tiny new item I need to train myself on, that is the use of the function button and rear control thumb wheel to adjust exposure compensation. Luckily the meter is good enough you don’t need to use it often. The shutter sound is discrete like an M should be, very much like the one in the M262, which has the current best M digital shutter. Several aspects of performance warrant discussion. First and foremost, the image quality is every bit as good as any of the other ‘240 class cameras. The default compressed DNG files are superb and offer lots of flexibility for image editing. The second area worth note is the metering. The pattern used is the ‘240-series “Classic” pattern, which uses reflections off of the central blades of the shutter curtain. Metering reflected off of curtain works very well and quickly, although the metering can occasionally be fooled by high or low-key lighting. The solution is what I term, “nodding the camera”. You simply point the camera down for lower shutter speeds, up for higher shutter speeds, then hold the exposure with a half-press of the shutter release and recompose your final shot. Using this approach, I achieved exposures that were around ½ stop underexposed 98-99% of the time. The slight underexposure is perfect for ensuring you don’t blow out your highlights, and the dynamic range of the sensor and resultant files pulls the details out of the rest of the image and the shadows without issue. The continuous burst buffer is good for 10 shots in a sequence. Battery consumption hovered around 15% per day for an average 150 photos, which extrapolates to 1000 photos on a full charge. These numbers were achieved by turning the camera off between periods of use. I did confirm the hard way, however, that the camera does not have an auto-off, and I would up with a dead battery one morning. I would recommend having a spare charged battery readily available in case you make a similar mistake. The M-D comes with a hard black paint finish over brass. I would have preferred a silver chrome version, and may pick one up in the future if offered, but the black paint chosen for the current version is very durable, with no signs of wear after 9 days in busy amusement parks. This is no MP black lacquer, and your camera will not resemble the Kravitz ‘240 for quite a long time of use. Other than the aforementioned dead battery, the camera was 100% reliable, with no crashes or hang-ups. It wrote every single image I took to SD card without error, something no other M digital I have owned can claim. It really is that good. If I were to make two changes, I would add silver chrome as an option for the top and bottom plates and hardware, and maybe a two-position on/off switch versus the current Off/S/C/Timer. I did overachieve and put the camera into Continuous mode when I wanted Single, but no harm came, and no images or opportunities were lost. Oh, and did I mention it had the cleanest sensor straight out of the box of the 11 digital Ms I’ve purchased since 2006? Not a speck of dust! I did have the chance to share the camera over lunch with a friend named Kevin who has made a career out of photography. He loves his M’s, but also shoots a lot of Canons for digital stills, and other gear for video. I explained the philosophy behind the camera as a reliable tool where you stay focused on your subject and environment to be ready for the next shot, not reviewing the past image. I caught him chimping the ISO dial a few times, and when I commented he said, “you’re right, this will take some getting used to, but it’s a good thing, and I need to get me one of these (M-D).” Kevin supervises a number of other photography professionals, and I would not be surprised to see their department adopting a no-screen shooters challenge as a way of capturing more “decisive moment” images. This, of course, requires equipment that is 100% reliable and predictable, and photographers with the skills to make the most out of the equipment on every image. The M-D is up to the task. So, who should buy this camera? This is a little bit hard to define. The camera is ultra-reliable, produces excellent images, and is totally predictable. It should be durable enough to last for decades. I would expect the batteries and SD cards will be the lifespan-limiting commodities, not the M-D. If you want a “decisive moment” Leica M digital for still images only, and have at least some skill with M cameras, this is an excellent selection, and could be your only M. If you need to work at the limits of M capabilities, lenses wider than 28 or longer than 90 (subjective), shoot macro, hold cameras overhead or away from your eye for perspective or safety,, shoot at f/0.95, or need to capture short video clips, then a ‘240 may be a better tool, but don’t forget the lessons the M-D and prior film M cameras teach us. Great overview, but an M1? You used the no-viewfinder M?", "link": "https://www.l-camera-forum.com/topic/261262-a-few-comments-based-upon-two-outings-with-the-leica-m-d-type-262-camera/page/3/?tab=comments#comment-3204035", "origin": "L-forum", "suborigin": "261262-a-few-comments-based-upon-two-outings-with-the-leica-m-d-type-262-camera", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "leica has created a digital version of their m7 film offering. i was fortunate enough to purchase one of these cameras three weeks ago. i put my name on the local wait list even before the camera was announced, but was bumped a couple of positions by higher-priority customers and saw the opportunity to have a camera in hand in time for a planned vacation, so i bit. shooting leicas is a major entertainment outlet for me, and i have shot with every mainline production m i can think of, m1, m2, m3, m4, m5, m4-2, m4-p, m6, m6ttl, m7, mp, m-a, m8, m8.2, m9p, monochrom, m-p240, m246, and m262. still, the screen-less leica digital sounded like loads of fun, and did not disappoint. i have had the chance to shoot my m-d for one day at universal studios hollywood and for 8 days in the various attractions in orlando, florida. during this time, i averaged 150 frames per day, for a total of just under 1400 images. i shot the camera “naked” of any case or protector for the minimum bulk. i attached the new 35mm/2.0/asph/ii lens and an e39 uva and didn’t look back. the camera shoots like an m7. it meters like an m7, focuses like an m7, and uses the same muscle memories for the on/off switch that -----> i !!!  -----> developed !!!  with my m7. the big difference is not the extra depth, which is truly minimal, but rather the adjustable iso dial on the back, which you don’t get to leverage on an m7 without changing rolls of film. having any speed film from 200-6400 iso at the twist of a dial is very handy. the rest of the body works like an m7, and the bump on the back of the top plate holds your thumb very much like a film winding lever. all in all, an excellent handling design. o.k., there is one tiny new item i need to train myself on, that is the use of the function button and rear control thumb wheel to adjust exposure compensation. luckily the meter is good enough you don’t need to use it often. the shutter sound is discrete like an m should be, very much like the one in the m262, which has the current best m digital shutter. several aspects of performance warrant discussion. first and foremost, the image quality is every bit as good as any of the other ‘240 class cameras. the default compressed dng files are superb and offer lots of flexibility for image editing. the second area worth note is the metering. the pattern used is the ‘240-series “classic” pattern, which uses reflections off of the central blades of the shutter curtain. metering reflected off of curtain works very well and quickly, although the metering can occasionally be fooled by high or low-key lighting. the solution is what i term, “nodding the camera”. you simply point the camera down for lower shutter speeds, up for higher shutter speeds, then hold the exposure with a half-press of the shutter release and recompose your final shot. using this approach, i achieved exposures that were around ½ stop underexposed 98-99% of the time. the slight underexposure is perfect for ensuring you don’t blow out your highlights, and the dynamic range of the sensor and resultant files pulls the details out of the rest of the image and the shadows without issue. the continuous burst buffer is good for 10 shots in a sequence. battery consumption hovered around 15% per day for an average 150 photos, which extrapolates to 1000 photos on a full charge. these numbers were achieved by turning the camera off between periods of use. i did confirm the hard way, however, that the camera does not have an auto-off, and i would up with a dead battery one morning. i would recommend having a spare charged battery readily available in case you make a similar mistake. the m-d comes with a hard black paint finish over brass. i would have preferred a silver chrome version, and may pick one up in the future if offered, but the black paint chosen for the current version is very durable, with no signs of wear after 9 days in busy amusement parks. this is no mp black lacquer, and your camera will not resemble the kravitz ‘240 for quite a long time of use. other than the aforementioned dead battery, the camera was 100% reliable, with no crashes or hang-ups. it wrote every single image i took to sd card without error, something no other m digital i have owned can claim. it really is that good. if i were to make two changes, i would add silver chrome as an option for the top and bottom plates and hardware, and maybe a two-position on/off switch versus the current off/s/c/timer. i did overachieve and put the camera into continuous mode when i wanted single, but no harm came, and no images or opportunities were lost. oh, and did i mention it had the cleanest sensor straight out of the box of the 11 digital ms i’ve purchased since 2006? not a speck of dust! i did have the chance to share the camera over lunch with a friend named kevin who has made a career out of photography. he loves his m’s, but also shoots a lot of canons for digital stills, and other gear for video. i explained the philosophy behind the camera as a reliable tool where you stay focused on your subject and environment to be ready for the next shot, not reviewing the past image. i caught him chimping the iso dial a few times, and when i commented he said, “you’re right, this will take some getting used to, but it’s a good thing, and i need to get me one of these (m-d).” kevin supervises a number of other photography professionals, and i would not be surprised to see their department adopting a no-screen shooters challenge as a way of capturing more “decisive moment” images. this, of course, requires equipment that is 100% reliable and predictable, and photographers with the skills to make the most out of the equipment on every image. the m-d is up to the task. so, who should buy this camera? this is a little bit hard to define. the camera is ultra-reliable, produces excellent images, and is totally predictable. it should be durable enough to last for decades. i would expect the batteries and sd cards will be the lifespan-limiting commodities, not the m-d. if you want a “decisive moment” leica m digital for still images only, and have at least some skill with m cameras, this is an excellent selection, and could be your only m. if you need to work at the limits of m capabilities, lenses wider than 28 or longer than 90 (subjective), shoot macro, hold cameras overhead or away from your eye for perspective or safety,, shoot at f/0.95, or need to capture short video clips, then a ‘240 may be a better tool, but don’t forget the lessons the m-d and prior film m cameras teach us. great overview, but an m1? you used the no-viewfinder m?", "sortedWord": "None", "Identifyer": null, "identifyer": 19883, "year": "2017"}, {"autor": "LocalHero1953", "date": "2017-11-26 17:21:00", "content": "CL + Summaron 35/2.8 Chasing shadows this morning in the bright sunlight among the tourists and cyclists. Leica has taken a major step forward with the CL in one element of of responsiveness: wake-up from sleep. From pressing the shutter to taking a picture, from sleep, is nearly instantaneous. The M240 takes nearly two seconds (identical SD cards). I am a veteran of the wars on this forum between those who want a responsive camera and those who say \"it's your technique at fault - press the shutter to wake-up as you bring it your eye - or, switch off sleep mode\". I have news for you: the CL has sorted this! I have a feeling that the CL EVF is faster (refresh rate?) than the TL2. Several times I was too quick on the shutter, as if I had developed a habit of anticipation of movement into the frame which is no longer needed. A matter for someone who has both cameras to check - I could be wrong. Asymmetry --img--  Casting a long shadow --img-- ", "link": "https://www.l-camera-forum.com/topic/320292-cl-the-image-thread/page/3/?tab=comments#comment-3404217", "origin": "L-forum", "suborigin": "320292-cl-the-image-thread", "result": true, "Selector": "i had developed", "selectorShort": "develop", "MarkedSent": "cl + summaron 35/2.8 chasing shadows this morning in the bright sunlight among the tourists and cyclists. leica has taken a major step forward with the cl in one element of of responsiveness: wake-up from sleep. from pressing the shutter to taking a picture, from sleep, is nearly instantaneous. the m240 takes nearly two seconds (identical sd cards). i am a veteran of the wars on this forum between those who want a responsive camera and those who say \"it's your technique at fault - press the shutter to wake-up as you bring it your eye - or, switch off sleep mode\". i have news for you: the cl has sorted this! i have a feeling that the cl evf is faster (refresh rate?) than the tl2. several times -----> i !!!  was too quick on the shutter, as if -----> i !!!  -----> had !!!  -----> developed !!!  a habit of anticipation of movement into the frame which is no longer needed. a matter for someone who has both cameras to check - i could be wrong. asymmetry --img--  casting a long shadow --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 36075, "year": "2017"}, {"autor": "SonomaBear", "date": "2017-08-05 05:28:00", "content": "A truly lousy photograph but this file should do what you want. It is a DNG taken a few minutes ago with my Q looking at laptop screen with 50mm crop, f1.7 1/125 second. About 43megs... https://www.dropbox.com/s/ht96o2wzu2e23vx/L1030016.DNG?dl=0 (please do not judge me by this piece of whatever... my worst photo in days!) Opened it in LR -- it was showing the 50mm perspective. Develop module cropping expansion showed the entire 28mm perspective. I only use LR, so good luck with anything else. YMMV... Q.E.D. Henry", "link": "https://www.l-camera-forum.com/topic/275366-leica-q-dng-crop-mode/?tab=comments#comment-3330517", "origin": "L-forum", "suborigin": "275366-leica-q-dng-crop-mode", "result": true, "Selector": "develop", "selectorShort": "develop", "MarkedSent": "a truly lousy photograph but this file should do what you want. it is a dng taken a few minutes ago with my q looking at laptop screen with 50mm crop, f1.7 1/125 second. about 43megs... https://www.dropbox.com/s/ht96o2wzu2e23vx/l1030016.dng?dl=0 (please do not judge me by this piece of whatever... my worst photo in days!) opened it in lr -- it was showing the 50mm perspective. -----> develop !!!  module cropping expansion showed the entire 28mm perspective. i only use lr, so good luck with anything else. ymmv... q.e.d. henry", "sortedWord": "None", "Identifyer": null, "identifyer": 5459, "year": "2017"}, {"autor": "George Furst", "date": "2017-05-22 13:30:00", "content": "I am on my six month anniversary of using this UR Replica Camera and now I have accumulated over 1000 pictures taken with the camera. I love the size of it and also how easily it fits into my pocket. Even though the camera is metal it is also not too heavy so I am able to take it everywhere. To date I have only taken B/W pictures. The film I have used is bulk load 100Tmax and APX400. Also I develop and scan all the pictures here at home. I have found it very easy to load the camera and load the film using a dark bag and a picnic table when in the field. so here are a few examples of pictures taken over the last few months. The pictures include my 1973 MGB that I drive here in Korea. I happens to be the only one in Korea and gets allot of attention, especially from the younger generation. Another picture is a grab shot of students in down town Daejeon enjoying the worm weather. Another picture is of a group of people waiting outside of the famous SumShimDong bakery here in Daejeon. Another picture was taken in Seoul with the \"My Juice\" restaurant in MyungDong section of the area near the Seoul Train Station. The last picture was taken a few days ago and shows the rice fields just filled with water in preparation for the planting in the following weeks. These pictures show the versatility of the camera, the first Leica. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/138638-working-ur-leica/page/2/?tab=comments#comment-3280244", "origin": "L-forum", "suborigin": "138638-working-ur-leica", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i am on my six month anniversary of using this ur replica camera and now i have accumulated over 1000 pictures taken with the camera. i love the size of it and also how easily it fits into my pocket. even though the camera is metal it is also not too heavy so i am able to take it everywhere. to date i have only taken b/w pictures. the film i have used is bulk load 100tmax and apx400. also -----> i !!!  -----> develop !!!  and scan all the pictures here at home. i have found it very easy to load the camera and load the film using a dark bag and a picnic table when in the field. so here are a few examples of pictures taken over the last few months. the pictures include my 1973 mgb that i drive here in korea. i happens to be the only one in korea and gets allot of attention, especially from the younger generation. another picture is a grab shot of students in down town daejeon enjoying the worm weather. another picture is of a group of people waiting outside of the famous sumshimdong bakery here in daejeon. another picture was taken in seoul with the \"my juice\" restaurant in myungdong section of the area near the seoul train station. the last picture was taken a few days ago and shows the rice fields just filled with water in preparation for the planting in the following weeks. these pictures show the versatility of the camera, the first leica. --img-- --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 35686, "year": "2017"}, {"autor": "pico", "date": "2017-08-21 22:12:00", "content": "Software development is not remotely as it was when I was a programmer using C (or c) which we could develop with or without proprietary libraries. Early firmware for the Leicas has dependencies rooted in known, proprietary development systems which makes it easy for inexperienced 'programmers' to make firmware without any experience in real software requisites. So their automagic code sucks. Leica M9 users - your firmware works largely by accident. . Edited August 21, 2017 by pico", "link": "https://www.l-camera-forum.com/topic/275834-why-so-many-individual-apps/?tab=comments#comment-3342476", "origin": "L-forum", "suborigin": "275834-why-so-many-individual-apps", "result": true, "Selector": "we could develop", "selectorShort": "develop", "MarkedSent": "software development is not remotely as it was when i was a programmer using c (or c) which -----> we !!!  -----> could !!!  -----> develop !!!  with or without proprietary libraries. early firmware for the leicas has dependencies rooted in known, proprietary development systems which makes it easy for inexperienced 'programmers' to make firmware without any experience in real software requisites. so their automagic code sucks. leica m9 users - your firmware works largely by accident. . edited august 21, 2017 by pico", "sortedWord": "None", "Identifyer": null, "identifyer": 92293, "year": "2017"}, {"autor": "Ko.Fe.", "date": "2017-09-06 20:38:00", "content": "Well, I don't think were are any film resurgence. Talking from weekly film user perspective, not from internet articles reader. So, scanners are made accordingly to the real market situation. It means, nothing big, nothing new. Taking negative pictures with digital camera is nothing new, either. I don't have so clean negatives for it. I develop quick and dirty. --img--  And I scan it quick and with crap on it cleaned with nothing but Epson flatbed. They still make them, I guess... I even still use first Plustek they made. 7200 model. Home developed (yesterday) Kodak not so Gold 200. Camera was 5$ P&S. --img--  Edited September 6, 2017 by Ko.Fe.", "link": "https://www.l-camera-forum.com/topic/276485-film-scanners/page/2/?tab=comments#comment-3353639", "origin": "L-forum", "suborigin": "276485-film-scanners", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "well, i don't think were are any film resurgence. talking from weekly film user perspective, not from internet articles reader. so, scanners are made accordingly to the real market situation. it means, nothing big, nothing new. taking negative pictures with digital camera is nothing new, either. i don't have so clean negatives for it. -----> i !!!  -----> develop !!!  quick and dirty. --img--  and i scan it quick and with crap on it cleaned with nothing but epson flatbed. they still make them, i guess... i even still use first plustek they made. 7200 model. home developed (yesterday) kodak not so gold 200. camera was 5$ p&s. --img--  edited september 6, 2017 by ko.fe.", "sortedWord": "None", "Identifyer": null, "identifyer": 100041, "year": "2017"}, {"autor": "otto.f", "date": "2017-07-08 20:43:00", "content": "Yes I bought a Linhof 4*5 Kardan Color last year and prepared my studio for it for next year when I partially retire. No chemicals yet. Intend to scan from color negative developed by lab, to start with Except that I develop B&W myself and use a JOBO drum without much trouble. The critical point in LF is even development of that large negatives. Do you guys work easier with the MOD54 than the JOBO in that respect?", "link": "https://www.l-camera-forum.com/topic/274146-anyone-shooting-large-format-on-here-apart-from-me/page/2/?tab=comments#comment-3311236", "origin": "L-forum", "suborigin": "274146-anyone-shooting-large-format-on-here-apart-from-me", "result": true, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "yes i bought a linhof 4*5 kardan color last year and prepared my studio for it for next year when i partially retire. no chemicals yet. intend to scan from color negative developed by lab, to start with except that -----> i !!!  -----> develop !!!  b&w myself and use a jobo drum without much trouble. the critical point in lf is even development of that large negatives. do you guys work easier with the mod54 than the jobo in that respect?", "sortedWord": "None", "Identifyer": null, "identifyer": 103482, "year": "2017"}, {"autor": "A miller", "date": "2017-11-05 20:31:00", "content": "Nice! How are you developing?Thanks. I developed vicaiously through my NYC lab. No need to reinvent the wheel with results this good! --img-- ", "link": "https://www.l-camera-forum.com/topic/274395-ferrania-p30-alpha/?tab=comments#comment-3389620", "origin": "L-forum", "suborigin": "274395-ferrania-p30-alpha", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "nice! how are you developing?thanks. -----> i !!!  -----> developed !!!  vicaiously through my nyc lab. no need to reinvent the wheel with results this good! --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 104113, "year": "2017"}, {"autor": "Martin B", "date": "2017-11-12 15:05:00", "content": "Recent shots I took with P30 from the second manufacturing batch which supposedly should have been scratch-free. Unfortunately this turned out not to be the case - certainly less of an issue compared to the first batch but still present. Took me a while in PP to remove the horizontal scratch going from beginning to the end of this film through all the negatives in a linear fashion (in the upper part of the image). First image shows the scratch, second and following ones have it removed in PP. Taken with Leica M6 and CV 28/2. Developed in Rodinal/Xtol. --img--  --img--  --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/274395-ferrania-p30-alpha/page/2/?tab=comments#comment-3394348", "origin": "L-forum", "suborigin": "274395-ferrania-p30-alpha", "result": true, "Selector": "developed", "selectorShort": "develop", "MarkedSent": "recent shots i took with p30 from the second manufacturing batch which supposedly should have been scratch-free. unfortunately this turned out not to be the case - certainly less of an issue compared to the first batch but still present. took me a while in pp to remove the horizontal scratch going from beginning to the end of this film through all the negatives in a linear fashion (in the upper part of the image). first image shows the scratch, second and following ones have it removed in pp. taken with leica m6 and cv 28/2. -----> developed !!!  in rodinal/xtol. --img--  --img--  --img--  --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 104120, "year": "2017"}, {"autor": "M9reno", "date": "2017-03-16 19:44:00", "content": "It all depends on what you have in the darkroom. I've gone for a Jobo CPP3 and lift bought new, a Heiland analyser, and similar other items that, while far from cheap, are not unreasonable when compared to Leica prices, and have immeasurably improved my developing and printing experience. I ditched the trays due in great part to ventilation issues, my darkroom (basement) being small and quite enclosed. Now even large 20\" x 16\" prints are done enclosed in a drum. Everyone of course will do it differently and find joy in their own way.", "link": "https://www.l-camera-forum.com/topic/269097-why-darkroom/page/2/?tab=comments#comment-3235081", "origin": "L-forum", "suborigin": "269097-why-darkroom", "result": true, "Selector": "my developing", "selectorShort": "develop", "MarkedSent": "it all depends on what you have in the darkroom. i've gone for a jobo cpp3 and lift bought new, a heiland analyser, and similar other items that, while far from cheap, are not unreasonable when compared to leica prices, and have immeasurably improved -----> my !!!  -----> developing !!!  and printing experience. i ditched the trays due in great part to ventilation issues, my darkroom (basement) being small and quite enclosed. now even large 20\" x 16\" prints are done enclosed in a drum. everyone of course will do it differently and find joy in their own way.", "sortedWord": "None", "Identifyer": null, "identifyer": 105995, "year": "2017"}, {"autor": "krsboz", "date": "2017-07-30 00:41:00", "content": " Greetings all! I just finished developing two rolls of TriX and the results of one roll has me scratching my head. Both shot on my M4. I'll call the rolls Roll \"Good\" and Roll \"Bleh.\" Roll \"Bleh\" was shot on Thursday of this week. Uneventful loading and shooting. I've done this dozens and dozens of times. Roll \"Good\" was shot on Friday. No issues. Today they were both loaded onto their spools in the same bag, at the same time. Roll Good was first and wound up as the bottom reel in the (Two-Reel) Paterson tank. Roll Bleh was the second one loaded and became the top reel. I developed. D76 stock, etc. I used 800ml of liquid per step. i.e. 800ml of D76, 800ml of stop, etc.. I've processed my own film hundreds of times. This was an uneventful processing. When I finished and unrolled to hang, Roll Bleh was first unspooled. An iPhone pic of the negs are attached. The header was fully exposed. It then fades into a slightly lighter dark. And it then fades into some sort of partial-horizontal fog for nearly the entire roll. The tail frames of the film was entirely unexposed. Roll Good, at the bottom of the two rolls is 100% fine. Perfect frames throughout. The horizontal fog tells me that it's a processing issue? Roll Good was shot after Roll Bleh so nothing tells me it's a camera issue. No? Perplexed. Anyone have any thoughts? Many thanks. --img-- ", "link": "https://www.l-camera-forum.com/topic/275177-developing-snafu-what-did-i-do/?tab=comments#comment-3326148", "origin": "L-forum", "suborigin": "275177-developing-snafu-what-did-i-do", "result": true, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": " greetings all! i just finished developing two rolls of trix and the results of one roll has me scratching my head. both shot on my m4. i'll call the rolls roll \"good\" and roll \"bleh.\" roll \"bleh\" was shot on thursday of this week. uneventful loading and shooting. i've done this dozens and dozens of times. roll \"good\" was shot on friday. no issues. today they were both loaded onto their spools in the same bag, at the same time. roll good was first and wound up as the bottom reel in the (two-reel) paterson tank. roll bleh was the second one loaded and became the top reel. -----> i !!!  -----> developed !!! . d76 stock, etc. i used 800ml of liquid per step. i.e. 800ml of d76, 800ml of stop, etc.. i've processed my own film hundreds of times. this was an uneventful processing. when i finished and unrolled to hang, roll bleh was first unspooled. an iphone pic of the negs are attached. the header was fully exposed. it then fades into a slightly lighter dark. and it then fades into some sort of partial-horizontal fog for nearly the entire roll. the tail frames of the film was entirely unexposed. roll good, at the bottom of the two rolls is 100% fine. perfect frames throughout. the horizontal fog tells me that it's a processing issue? roll good was shot after roll bleh so nothing tells me it's a camera issue. no? perplexed. anyone have any thoughts? many thanks. --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 106124, "year": "2017"}, {"autor": "pico", "date": "2017-07-24 21:49:00", "content": "It is for working blind and for fixed time. I know tubes, but who prints in RA4 these days? I assume, it was about BW printing here, where no fixed time, no tubes to work blind applies. Okay, no response so I will address your presumptions. First, B&W printing is largely a completion process - we develop as long as it takes to make the gradation. Processing longer introduces the opportunity for fogging, chemically or from overexposure to safe-light in tray. Pulling (taking the paper out early in development) is rarely helpful and a sign of an uninformed amateur. I know some B&W printers do tray development and do such things as use a cotton ball of developer heated to accelerate local development and/or potassium chloride to bleach local areas. I have process countless images in the same way and was once approached by the best custom B&W processing lab in Chicago to the same for them. I was a very good B&W printer. Regardless, processing to completion is more than adequate. A rotating tube works. Finally, the OP has a small darkroom - no room for large trays. Next? Edited July 24, 2017 by pico", "link": "https://www.l-camera-forum.com/topic/274968-printing-a-6x6/?tab=comments#comment-3322974", "origin": "L-forum", "suborigin": "274968-printing-a-6x6", "result": true, "Selector": "we develop", "selectorShort": "develop", "MarkedSent": "it is for working blind and for fixed time. i know tubes, but who prints in ra4 these days? i assume, it was about bw printing here, where no fixed time, no tubes to work blind applies. okay, no response so i will address your presumptions. first, b&w printing is largely a completion process - -----> we !!!  -----> develop !!!  as long as it takes to make the gradation. processing longer introduces the opportunity for fogging, chemically or from overexposure to safe-light in tray. pulling (taking the paper out early in development) is rarely helpful and a sign of an uninformed amateur. i know some b&w printers do tray development and do such things as use a cotton ball of developer heated to accelerate local development and/or potassium chloride to bleach local areas. i have process countless images in the same way and was once approached by the best custom b&w processing lab in chicago to the same for them. i was a very good b&w printer. regardless, processing to completion is more than adequate. a rotating tube works. finally, the op has a small darkroom - no room for large trays. next? edited july 24, 2017 by pico", "sortedWord": "None", "Identifyer": null, "identifyer": 106148, "year": "2017"}, {"autor": "waterlenz", "date": "2017-02-13 21:05:00", "content": " I have developed C41 only once and that was with the Kodak chemistry with its exacting temperature requirement (see Andy's post above). That was done in a full-time photo lab at a university (not at home) with fancy temperature control plumbing. Even so it was a PITA and convinced me it was not worth the trouble - this was also at a time when one had 1-hour processing (at least for 35mm) - I was developing 120 film. Kodak E6 which I have done several times in home darkrooms is much easier to temperature regulate. I am curious if you who are doing C41 (Preben and Michael) are using the Kodak chemistry or some other with possibly less stringent temperature requirements? Edited February 13, 2017 by waterlenz", "link": "https://www.l-camera-forum.com/topic/268899-next-step-in-development/?tab=comments#comment-3212186", "origin": "L-forum", "suborigin": "268899-next-step-in-development", "result": true, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": " -----> i !!!  -----> have !!!  -----> developed !!!  c41 only once and that was with the kodak chemistry with its exacting temperature requirement (see andy's post above). that was done in a full-time photo lab at a university (not at home) with fancy temperature control plumbing. even so it was a pita and convinced me it was not worth the trouble - this was also at a time when one had 1-hour processing (at least for 35mm) - i was developing 120 film. kodak e6 which i have done several times in home darkrooms is much easier to temperature regulate. i am curious if you who are doing c41 (preben and michael) are using the kodak chemistry or some other with possibly less stringent temperature requirements? edited february 13, 2017 by waterlenz", "sortedWord": "None", "Identifyer": null, "identifyer": 106361, "year": "2017"}, {"autor": "Jed Orme", "date": "2017-01-06 17:00:00", "content": "As a retiree who went from a Nikon D7000 to a Leica M (by way of the Fuji X-100/S), I realized that when traveling or even just general usage, I wanted something that was smaller & more light weight. The Leica M with three lenses in the focal ranges you are thinking of was perfect for me. I also really enjoyed getting back to my origins in photography with manual focusing & using the rangefinder patch to do so. I also got very involved in learning how to process & edit in Lightroom & Photoshop, which I still enjoy doing, apart from the capture experiences. However, with age I also developed some vision issues which made it more difficult to focus the M. So I now have a Leica Q, with its options of either auto focus or manual focusing using the very capable magnification & peaking aids. I tend to think of the Q as a smaller & lighter weight, fixed lens SL (since the sensor & processor are pretty much the same). So this might even be an option for your dad if he can live with the one lens only condition; but if so, the 28mm f/1.7 Summilux on the Q is a wonderful lens. Also take into consideration, if he is not going to want to get into using a photo editor for processing, he may want to create jpeg files only. In this case, you will want to select one of these Leica's that produces the best jpeg files, either SOOC or with the least amount of adjusting needed afterwords. Since I have been a RAW only shooter, I can't give any advice about this. But good luck & my best wishes to your father in his retirement with one of these fine Leica alternative camera systems.", "link": "https://www.l-camera-forum.com/topic/268015-first-leica-sl-or-m240/?tab=comments#comment-3180469", "origin": "L-forum", "suborigin": "268015-first-leica-sl-or-m240", "result": true, "Selector": "i also developed", "selectorShort": "develop", "MarkedSent": "as a retiree who went from a nikon d7000 to a leica m (by way of the fuji x-100/s), i realized that when traveling or even just general usage, i wanted something that was smaller & more light weight. the leica m with three lenses in the focal ranges you are thinking of was perfect for me. i also really enjoyed getting back to my origins in photography with manual focusing & using the rangefinder patch to do so. i also got very involved in learning how to process & edit in lightroom & photoshop, which i still enjoy doing, apart from the capture experiences. however, with age -----> i !!!  -----> also !!!  -----> developed !!!  some vision issues which made it more difficult to focus the m. so -----> i !!!  now have a leica q, with its options of either auto focus or manual focusing using the very capable magnification & peaking aids. i tend to think of the q as a smaller & lighter weight, fixed lens sl (since the sensor & processor are pretty much the same). so this might even be an option for your dad if he can live with the one lens only condition; but if so, the 28mm f/1.7 summilux on the q is a wonderful lens. also take into consideration, if he is not going to want to get into using a photo editor for processing, he may want to create jpeg files only. in this case, you will want to select one of these leica's that produces the best jpeg files, either sooc or with the least amount of adjusting needed afterwords. since i have been a raw only shooter, i can't give any advice about this. but good luck & my best wishes to your father in his retirement with one of these fine leica alternative camera systems.", "sortedWord": "None", "Identifyer": null, "identifyer": 114606, "year": "2017"}, {"autor": "ellegant", "date": "2017-10-28 02:11:00", "content": "About five years ago I bought a used M8.2. It worked fine until several weeks ago. I turned on my M8.2 and when I pressed the Menu button instead of the display I got a screen full of barcode like stripes. From my research on the internet this may not be an uncommon issue! And of course no replacement LCD screens are available. Bah humbug! I have a ten year old Canon A710is that has never given me a lick of trouble. Works as well as when I first took it out of the box. If Canon can could do it, why couldn't Leica? Reminds me of the advice some give to never buy a new car the first year it comes out. Well I now have a classy paper weight. Maybe back to film in my fifty year old M4...and yes I am the original owner of the M4! Wonder how many rolls of film I could have had developed and scanned for the price of my used M8.2. I understand Leica may offer a credit towards an upgrade...don't think I would take it.", "link": "https://www.l-camera-forum.com/topic/271284-m8-screen-supply/?tab=comments#comment-3383520", "origin": "L-forum", "suborigin": "271284-m8-screen-supply", "result": false, "Selector": "i could have had developed", "selectorShort": "develop", "MarkedSent": "wonder how many -----> rolls !!!  of film i could have had developed and scanned for the price of my used m8.2.", "sortedWord": "roll", "Identifyer": null, "identifyer": 43982, "year": "2017"}, {"autor": "jaapv", "date": "2017-11-15 20:05:00", "content": "About five years ago I bought a used M8.2. It worked fine until several weeks ago. I turned on my M8.2 and when I pressed the Menu button instead of the display I got a screen full of barcode like stripes. From my research on the internet this may not be an uncommon issue! And of course no replacement LCD screens are available. Bah humbug! I have a ten year old Canon A710is that has never given me a lick of trouble. Works as well as when I first took it out of the box. If Canon can could do it, why couldn't Leica? Reminds me of the advice some give to never buy a new car the first year it comes out. Well I now have a classy paper weight. Maybe back to film in my fifty year old M4...and yes I am the original owner of the M4! Wonder how many rolls of film I could have had developed and scanned for the price of my used M8.2. I understand Leica may offer a credit towards an upgrade...don't think I would take it. Did you explore whether this is really a defect in the screen? It might as well be a loose flex connector, or a faulty circuit board, etc. Which, as such, would be a more economical repair than an LCD replacement, which at close to 1000 $ would exceed the value of the camera anyway.", "link": "https://www.l-camera-forum.com/topic/271284-m8-screen-supply/?tab=comments#comment-3396382", "origin": "L-forum", "suborigin": "271284-m8-screen-supply", "result": false, "Selector": "i could have had developed", "selectorShort": "develop", "MarkedSent": "wonder how many -----> rolls !!!  of film i could have had developed and scanned for the price of my used m8.2.", "sortedWord": "roll", "Identifyer": null, "identifyer": 43990, "year": "2017"}, {"autor": "heycadet", "date": "2017-12-08 16:52:00", "content": " Hey there! Having some issues with possible light leak on my M6. I've had it a few years with no issues. I developed 10 rolls this months and I see it on most rolls; but not in every photo. It seems to happen on both me 35mm and 50mm Canadian summicrons. I am guessing it has something to do with the shutter cloth; but I'm not sure. It's in an identical place everything it appears, but it has varying intensity across photos. You can see it here: https://drive.google.com/open?id=1rtBgmrOlI2Kh8SGsfa-_Adq8jIAF3TQT https://drive.google.com/open?id=1fpbTs0eVXuRW9OymL19CkeYpKsnDvvYL These two photos were taken one after the other. One has it and one does not. The only thing that would have changed would be shutter or aperture: https://drive.google.com/open?id=1OYRxwqPmD-iFxCl4LXWxLehiKySvPiY_ https://drive.google.com/open?id=1rtBgmrOlI2Kh8SGsfa-_Adq8jIAF3TQT Looking for some opinions before I send it in for service. There's only one guy around me that can service and it's an 8 to 12 week wait right now --img--  Thanks!", "link": "https://www.l-camera-forum.com/topic/279646-m6-light-leak-maybe-help/?tab=comments#comment-3413823", "origin": "L-forum", "suborigin": "279646-m6-light-leak-maybe-help", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i developed 10 -----> rolls !!!  this months", "sortedWord": "roll", "Identifyer": null, "identifyer": 6250, "year": "2017"}, {"autor": "wojtek_87", "date": "2017-11-29 09:33:00", "content": "Hello to everyone, this is my very first post here as a newcomer. I finally ended up with Leica --img-- Some time ago I bought the Q which is an awesome tool for street shooting but as one guy said that after the Q, M is just a matter of time. I have bought an M6 with Summilux 35 - Mandler's design, however I met this lens couple months before. I tried it with the MP (240). The look is fantastic - exactly what I was looking for. I hope to post some more stuff when I develop some film rolls --img--  --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/266277-show-us-some-mandler-magic/page/13/?tab=comments#comment-3406297", "origin": "L-forum", "suborigin": "266277-show-us-some-mandler-magic", "result": false, "Selector": "i develop", "selectorShort": "develop", "MarkedSent": "i hope to post some more stuff when i develop some -----> film !!!  rolls --img--", "sortedWord": "film", "Identifyer": null, "identifyer": 16129, "year": "2017"}, {"autor": "George Furst", "date": "2017-03-14 13:13:00", "content": "Above I promised to show you some photos taken with the UR Leica in a different situation than my prior photographs, Here is an example of the response of the camera and lens to a lower light situation. The camera was set at the lowest speed (I screwed the shutter receiving drum to the weakest spring tension by turning the knob on the top of the camera to the extreme clockwise direction). I think this speed is around 200th of a second with the 8mm slit on the shutter installed in the camera (this was discussed in a prior post). Also the lens iris was set at 10, the most wide open available with the over 100 year old 42mm Micro Summar lens. That means it is set at f4.5.The film is Kodak 100Tmax that I have developed in D76 1:1 for 24 minutes at 20 degrees C. This means that I have pushed the film from 100asa to 400asa. I realize that this increases the grain size but that was the only B/W film I had available and it was also my chance to expand my film processing experience.After the film was dried and cut into strips I scanned it on my Epson Perfection 4870 scanner. I did sharpen the pictures and also spot removed the dust spots and a few scratches on the film. These were the only modifications I did to the negatives in the post process stage of image forming.All photographs were taken hand held. I also did measure the distances carefully and set those distances by using the calibration, in meters, that were on the dummy modified to be a replica UR Leica (this focus check was discussed in another post). I picked 4 photos from the 23 taken in the sitting.The subject of the pictures is a good friend HyeSan and her 9 month old baby Raon (pronounced Rhyon in English). The name means \"Glad\" in old Korean language. I have her permission to post these pictures on this site. --img-- --img--  Edited March 14, 2017 by George Furst", "link": "https://www.l-camera-forum.com/topic/138638-working-ur-leica/page/2/?tab=comments#comment-3233308", "origin": "L-forum", "suborigin": "138638-working-ur-leica", "result": false, "Selector": "i have developed", "selectorShort": "develop", "MarkedSent": "that means it is set at f4.5.the -----> film !!!  is kodak 100tmax that i have developed in d76 1:1 for 24 minutes at 20 degrees c. this means that i have pushed the -----> film !!!  from 100asa to 400asa.", "sortedWord": "film", "Identifyer": null, "identifyer": 35683, "year": "2017"}, {"autor": "Archiver", "date": "2017-06-05 04:17:00", "content": "My photography journey began as a child in the 80's, using Dad's Pentax and Minolta SLR's. Years later, I began using digital cameras from Canon, and got back into film during the mid 2000's. Ironically, Lomo cameras were the spur to this return. At the time, a Leica M seemed like a mythical, esoteric artifact, immortal and unchanging as the Sphinx or the Taj Mahal. DSLR's were just too heavy after a while, and buying a Zeiss Ikon in 2008 gave me a taste for what rangefinder shooting could be like. When the M9 was announced, I knew that I had to have this camera. My name went into several waiting lists, but to no avail. If you have a slightly obsessive bent, and when you want something it's like your world revolves around its arrival, you know what I was feeling. When the second round came to Australia in early 2010, I called a few shops with the intention of asking about stock of Zeiss lenses. I wanted to round out my collection in preparation of my nebulous M9. When I called one shop, I enquired about lenses, then asked offhandedly if they had an M9 in the shop. \"Yes.\" \"Yes??? You mean, on the shelf, and not waiting for someone???\" \"Yes, it's in stock now. We've only got one left, everyone else on the list has theirs now.\" I SCREAMED like a little girl being taken to Disneyland for the first time, and was at the shop with a bundle of cash within the hour. It was like the hand of God had given me the most frustrating camera I could have imagined. Being used to matrix metering in DSLR's, nothing prepared me for the centre weighted metering of the M9, so my images were either over or underexposed. Rapid focus was out of the question. But I had just bought the most expensive thing of my life, and I wasn't going to be beaten. I spent hours every day for a month, shooting anything and everything, until I developed the skills and habits that opened this German Ark of the Covenant. Since then, I bought a chrome M7 and several more Zeiss, Voigtlander and Leica lenses including the 50 Summicron, 28 Elmarit and 75 Summarit. My M9 is currently in the repair centre awaiting sensor replacement, and remains my favourite digital camera. --img--  --img--  Edited June 5, 2017 by Archiver", "link": "https://www.l-camera-forum.com/topic/242491-your-first-leica-tell-your-story/page/5/?tab=comments#comment-3289357", "origin": "L-forum", "suborigin": "242491-your-first-leica-tell-your-story", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i spent hours every day for a month, shooting anything and everything, until i developed the -----> skills !!!  and habits that opened this german ark of the covenant.", "sortedWord": "skill", "Identifyer": null, "identifyer": 82166, "year": "2017"}, {"autor": "tllabron", "date": "2017-07-11 03:56:00", "content": "You have not lived until you have done large format, or at least 6x9cm medium format. I hope your vision is no worse than mine. Look to a Linhof Super Technika with the added viewfinder. If you use perspective controls then first use rangefinder focus, pop the back open and make small adjustments. A lot of LF users would admit they use minimal, trivial perspective controls. Be happy. Oh, if you like wide-angle look into Silvestri cameras. There are more simple options for MF. ---------------------------------------------------------------------------------------------------------------------- I loved my Linhof Master Technika camera. I carried it once into the mountains to the head waters (beginning waters) of the Colorado River here in the USA, I got stunning pictures. That is when I was younger and could pack the 17 pound Gitzo tripod and my Linhof and 3 lenses with plates and 2 - 6X7 roll backs up the trail. Someone asked earlier about changing film in the field and I had with my a fairly lightweight darkbag that I carried along with me and some boxes of film so if I shot all my film I could reload the plate holders. Years and years ago there were always a variety of darkbags available, but now-a-days you probably could only get one if you knew someone that had one and could talk them out of it. You just have to have a sensitive touch to mark your film box and your storage box to remember which is which when you are performing the job. Just don't do it in a hurry at the last minute when you need it yesterday, because you may make a mistake you will regret. I used my Linhof when I was in Iceland and took pictures of the waterfalls and geysers and the beautiful landscapes and the icelandic horse. The only place I did not take my Linhof Master Technika was on my African Safari. The longest lens I had for my LF was 275mm f/5.6 Rotlar Rodenstock lens so I left it on board ship and took only my two Leica SL bodies and my lenses that included a 400mm Telyt 6.8 lens, which was on my cameras most of the time. Although I did wish I had the Linhof when were arrived at Mount Kilimanjaro National Park and I was not able to record on 4X5 a shot of the mountain and the plain. I was beautiful. There also was some discussions about drums. I had a Beseler motorized base with variable rotation control and a 8X10 Drum and a 16X20 drum for developing prints and also developing my 4X5 negatives and slides. You must be sure to rotate the drums slow enough as to make sure the fluids are contact with the film but fast enough to give you good developments times. A way of finding this technique out is to develop TRI-X film at different speeds. The faster the speeds the courser the grain is the slower the speed the finer the grain is the result. I have to admit that I have no idea if this is what will happen with the newer emulsions being used today beccause I have not developed film in very long time, so take these suggestions with a grain of salt. Tom L.L.", "link": "https://www.l-camera-forum.com/topic/274146-anyone-shooting-large-format-on-here-apart-from-me/page/2/?tab=comments#comment-3313098", "origin": "L-forum", "suborigin": "274146-anyone-shooting-large-format-on-here-apart-from-me", "result": false, "Selector": "i have not developed", "selectorShort": "develop", "MarkedSent": "i have not developed -----> film !!!  in very long time, so take these suggestions with a grain of salt.", "sortedWord": "film", "Identifyer": null, "identifyer": 103489, "year": "2017"}, {"autor": "Martin B", "date": "2017-09-29 11:57:00", "content": " A friend of mine handed me yesterday five rolls of first batch of Ferrania P30 films. I put the first one in my M3 camera - stay tuned for results. I will develop this film myself but likely not using one of the described standard methods.", "link": "https://www.l-camera-forum.com/topic/274395-ferrania-p30-alpha/?tab=comments#comment-3367263", "origin": "L-forum", "suborigin": "274395-ferrania-p30-alpha", "result": false, "Selector": "i will develop", "selectorShort": "develop", "MarkedSent": "i will develop this -----> film !!!  myself but likely not using one of the described standard methods.", "sortedWord": "film", "Identifyer": null, "identifyer": 104101, "year": "2017"}, {"autor": "Martin B", "date": "2017-10-06 11:18:00", "content": "My findings of this P30 film so far: + very low and fine grain (which I personally like) + film does not curl and is quite flat after drying - ideal for scanning + vintage feel of the photos taken with this film - alpha batch had some scratch issues with the films (might derive from defective cartridges or some issue during manufacturing). - richness in contrast can easily lead to under- or overexposure. Controlling it is difficult - best is to average out the scene with high contrast elements for fairly correct exposure - a bit limited in grey scale - Ilford FP4 in comparison has a much wider grey scale tonal range but is much less contrasty. - very limited in shadow details (probably comes with having the high contrast advantage) I will add later how the P30 film does for silver gelatin printing which I will examine soon. Overall I really like this film so far - it is different than most other B&W films which I have used before and leads to photos reminding me of early 20th century B&W prints but with low grain. Regarding development, it seems quite similar to other low speed B&W films. After I developed my first roll of P30 film, my first thought was that I did something wrong - a lot of blanked out areas on the negative. Turned out that this is a film property with the high contrast (black) areas. More tests with some rolls of the second batch of produced P30 film will follow. Edited October 6, 2017 by Martin B", "link": "https://www.l-camera-forum.com/topic/274395-ferrania-p30-alpha/?tab=comments#comment-3371265", "origin": "L-forum", "suborigin": "274395-ferrania-p30-alpha", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "after i developed my first -----> roll !!!  of p30 film, my first thought was that i did something wrong - a lot of blanked out areas on the negative.", "sortedWord": "roll", "Identifyer": null, "identifyer": 104108, "year": "2017"}, {"autor": "Stealth3kpl", "date": "2017-11-12 17:01:00", "content": "I once loaded up my developing tank with a film I'd shot in Venice. I lifted the tank by its lid in order too transport it to the bathroom for processing. Unfortunately, the rest of the tank was left behind. I was not so lucky. I don't pick up my tank by its lid anymore. Pete", "link": "https://www.l-camera-forum.com/topic/275689-sunday-morning-two-doh-moments/?tab=comments#comment-3394432", "origin": "L-forum", "suborigin": "275689-sunday-morning-two-doh-moments", "result": false, "Selector": "my developing", "selectorShort": "develop", "MarkedSent": "i once loaded up my developing tank with a -----> film !!!  i'd shot in venice.", "sortedWord": "film", "Identifyer": null, "identifyer": 106020, "year": "2017"}, {"autor": "Ko.Fe.", "date": "2017-08-22 17:00:00", "content": "If color or bw negative is overdeveloped it is darker and more dense. I have done it --img--  And then it is harder for scanner and I guess this is how it comes with more contrast. Under enlarger it makes it more difficult and with narrower choice of filters, papers. I do develop longer due to pushing of bw ISO 400 films. If film is right and I'm doing it right, then it comes with increased contrast. Well, on prints and slightly. But then, again, it limits me with filters and paper choice.", "link": "https://www.l-camera-forum.com/topic/275997-development-time/?tab=comments#comment-3343000", "origin": "L-forum", "suborigin": "275997-development-time", "result": false, "Selector": "i do develop", "selectorShort": "develop", "MarkedSent": "i do develop longer due to pushing of bw iso 400 -----> films !!! .", "sortedWord": "film", "Identifyer": null, "identifyer": 106117, "year": "2017"}, {"autor": "Martin B", "date": "2017-07-18 18:00:00", "content": "Newer C-41 packs contain [Fe(EDTA)]- complex which is much more stable than the formerly used [Fe(CN)6]3- complex as Blix agent. Therefore the Blix solution lasts for quite a long time if stored with minimal oxygen amount in the bottle (fill nearly to top of bottle to avoid air inside). The developer is oxidized by each development - you can see the change by a slightly more orange color after a while and a precipitate at room temperature which dissolves when heated up to 30 deg C. I don't see the need to refresh the developer soon. I am using my C-41 developer, Blix, and stabilizer solutions since over 1.5 years by now without any issue - so far I developed about 20 color films with it, the rest of the time the solutions sit in well closed glass bottles in a dark cabinet underneath my sink at room temperature. What I learned here in this forum from group member Adan is that the stabilizer step should be the final one - no wash with water afterwards!", "link": "https://www.l-camera-forum.com/topic/274547-blix-question/?tab=comments#comment-3318557", "origin": "L-forum", "suborigin": "274547-blix-question", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i am using my c-41 developer, blix, and stabilizer solutions since over 1.5 years by now without any issue - so far i developed about 20 color -----> films !!!  with it, the rest of the time the solutions sit in well closed glass bottles in a dark cabinet underneath my sink at room temperature.", "sortedWord": "film", "Identifyer": null, "identifyer": 106157, "year": "2017"}, {"autor": "Wayne", "date": "2017-07-18 18:41:00", "content": "Newer C-41 packs contain [Fe(EDTA)]- complex which is much more stable than the formerly used [Fe(CN)6]3- complex as Blix agent. Therefore the Blix solution lasts for quite a long time if stored with minimal oxygen amount in the bottle (fill nearly to top of bottle to avoid air inside). The developer is oxidized by each development - you can see the change by a slightly more orange color after a while and a precipitate at room temperature which dissolves when heated up to 30 deg C. I don't see the need to refresh the developer soon. I am using my C-41 developer, Blix, and stabilizer solutions since over 1.5 years by now without any issue - so far I developed about 20 color films with it, the rest of the time the solutions sit in well closed glass bottles in a dark cabinet underneath my sink at room temperature. What I learned here in this forum from group member Adan is that the stabilizer step should be the final one - no wash with water afterwards! Thanks for the response. I have yet to experience any visible degradation of negatives due to prolonged use of the developer. What I do notice is that after about 15 or 20 rolls of film the volume of developer in the liter bottle is down by what seems to be as much 40%. From this I assume that the developing process consumes developer. What I do not know is....if this consumption of developer leaves a greater concentration of one or another component of the developer solution in the remaining developer, i.e. results in changing the developer solution. Thanks again.", "link": "https://www.l-camera-forum.com/topic/274547-blix-question/?tab=comments#comment-3318575", "origin": "L-forum", "suborigin": "274547-blix-question", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": "i am using my c-41 developer, blix, and stabilizer solutions since over 1.5 years by now without any issue - so far i developed about 20 color -----> films !!!  with it, the rest of the time the solutions sit in well closed glass bottles in a dark cabinet underneath my sink at room temperature.", "sortedWord": "film", "Identifyer": null, "identifyer": 106158, "year": "2017"}, {"autor": "RayD28", "date": "2017-06-06 01:08:00", "content": " Yesterday I developed my first two rolls of film. They were shot using an M3, 50mm Summicron DR, HP5+ @ISO 400, and I used a handheld light meter for each shot. I developed with Ilford DD-X. My biggest worry was getting the film on the Paterson reels, but I practiced with wasted film and it went excellent. I had my notes laid out and checklists. I used the Ilford beginner's guide because I wanted a process that is easy and repeatable. I struggled getting the chemicals at 20C -- had to use a pan of ice to get correct temperature. I used the Massive Developer Chart app on my iPad and used the timer feature. All went well until the alarm went off to pour out the developer and put in the stop bath. After I poured the stop bath I meant to hit the continue button on the iPad but I instead hit RESET. No worries, I followed my notes and just used a timer. After the final rinse and foto flo, I looked at the film and I was thrilled to see images. I hung the film in my bathroom to dry about 2:00. At 3:30 I was on the 'net googling how to dry film faster with a hair dryer but patience finally won and I let them dry overnight. Today at 5:00 AM I cut the film into strips and started to digitize them with an DSLR. I used a light pad for illumination and a film holder that is for a scanner. I used a Nikon D800 with a Nikon 105MM-Macro lens. I mounted the lens on a tripod with the camera above the light pad that laid horrozontally. Focused using live-view, bracketed exposures, and used the timer to reduce camera shake. Getting the film and camera aligned at the proper plan is nearly impossible with this setup. The images clearly show some shots with parts of the frame out of focus. Here are a couple of images. --img--  Edited June 6, 2017 by Raycpa", "link": "https://www.l-camera-forum.com/topic/273211-first-try-at-developing-film-and-creating-images-with-a-dslr/?tab=comments#comment-3289995", "origin": "L-forum", "suborigin": "273211-first-try-at-developing-film-and-creating-images-with-a-dslr", "result": false, "Selector": "i developed", "selectorShort": "develop", "MarkedSent": " yesterday i developed my first two -----> rolls !!!  of film.", "sortedWord": "roll", "Identifyer": null, "identifyer": 106191, "year": "2017"}, {"autor": "Martin B", "date": "2017-03-27 11:33:00", "content": "If I only develop one roll of film within the Paterson two-reel system, I always use less solution than when I develop two rolls of film at once in the tank. With one roll of film, I stick to 300 ml each for developer, stopper, fixer, and hyper wash. I always add the reel with the film on the bottom and place an empty reel on top of it to avoid that agitation/inversion pushes the reel up during the process.", "link": "https://www.l-camera-forum.com/topic/270512-how-much-developer-to-use-when-developing-one-role-of-35mm-film-in-a-patterson-two-tank-system/?tab=comments#comment-3242557", "origin": "L-forum", "suborigin": "270512-how-much-developer-to-use-when-developing-one-role-of-35mm-film-in-a-patterson-two-tank-system", "result": false, "Selector": "i only develop", "selectorShort": "develop", "MarkedSent": "if i only develop one -----> roll !!!  of film within the paterson two-reel system, i always use less solution than when i develop two rolls of film at once in the tank.", "sortedWord": "roll", "Identifyer": null, "identifyer": 106244, "year": "2017"}, {"autor": "Martin B", "date": "2017-02-15 14:48:00", "content": "I do my own C-41, also. The deal with the stringent time/temperature requirements in built into the film. It takes a non-infinitesimal amount of time for developer to soak from the surface of the film down to the bottom-most layer (red-light-sensitive, cyan dye), so it will start developing 5-10 seconds later than the top layer. C-41 film manufacturers accound for that delay with film chemistry, so that if you develop exactly 3:15 minutes at exactly 100°F, the layers come out exactly even, even with a different starting time per layer. I read your posts here above with interests, but your experience with the C-41 process does not fully match my own. I am also doing C-41 at home, and I have now developed > 10 color films with my chemicals since last year. First to clarify - 100F is 37.8 deg C. I never go so low in temperature during the development and BLIX steps. I always do the development with followed BLIX at 40 +/- 1 deg C (102 to 106 F). I use 3:30 minutes for the development and 6:30 minutes for BLIX. I am using the Unicolor C-41 chemicals. IMO it is nearly impossible to keep the temperature as exact and accurate as you described above. There are too many factors involved. My experience is - don't bother too much, as long as you are in the 40 deg C ballpark, you are absolutely fine. Colors turn out very well, there is no smearing or cyan looking whites etc. This works for different color films (for example Kodak Ektar, Porta) which I tested. Before I pour the warm developer into the film tank, I pre-soak the film at about 40 deg C in warm water for 2 minutes to get rid of the colored dye (mostly blue or green) and pre-equilibrate the color film temperature. After I poured in the developer (and the same is true for the BLIX afterwards), I always place my tank in a warm water bath which is around 45 deg C (it needs to be warmer outside to maintain about 40+/-1 deg C inside the tank). I had my color films developed at 39, 40, and 41 deg C at 3:30 minutes, and I never saw any kind of difference here. Possible that the Unicolor pack uses a more flexible developer. For B&W - I tested with Ilford XP2 film - it is very easy. Same procedure, B&W comes out very well. Big advantage here is that you can shoot the XP2 film at different ISO speeds and develop all frames the same with C-41. The higher ISO frames will show up with more contrast, but still okay and usable. Another advantage of XP2 film is its low grain amount if this is desired. With a dedicated high ISO or pushed B&W film, you need to stick to an ISO value throughout the film and adopt development times for all frames accordingly. Ilford XP2 @ ISO 400, developed with C-41. Leica M6, Leica 50/2 lens --img--  Ilford XP2 pushed 2 stops to ISO 1600, developed with same C-41 as above. Leica M6, Leica 35/2 lens. --img--  Edited February 15, 2017 by Martin B", "link": "https://www.l-camera-forum.com/topic/268899-next-step-in-development/?tab=comments#comment-3213642", "origin": "L-forum", "suborigin": "268899-next-step-in-development", "result": false, "Selector": "i have now developed", "selectorShort": "develop", "MarkedSent": "i am also doing c-41 at home, and i have now developed > 10 color -----> films !!!  with my chemicals since last year.", "sortedWord": "film", "Identifyer": null, "identifyer": 106365, "year": "2017"}, {"autor": "pridbor", "date": "2017-01-25 02:57:00", "content": "Gents first of all thanks for the encouragements and advice you all have come forth with. This past weekend saw me develop my first (3) film in more years than I care think about !!! :-) First a rapidly taken test B&W film, and then a B&W + a Color from this last X-Mas. I would really like for you to comment on the quality of the 2 photos of my grandkids. The reason for the last photo is that I'm looking for one of you telling me what the vertical artifact is. Now I did experience a lot of the situations which you gents had warned me about, hard to enter film into the reel knicks on the film, water drops on the film, despite me having (tried) to dry it with the rubber \"thing\". I managed to \"post clean\" with a little distilled water on the backside of the film. Well a confession is in place I did try to clean on the emulsion side of the film, and had a disaster on hand for those few images Ooops. Well needless to say I'm hooked, and think in secret, not letting the wife in on my thought yet, of the real Darkroom activities :-) More questions later. Thanks again all !!! Preben --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/268327-took-the-first-step-yesterday/?tab=comments#comment-3196194", "origin": "L-forum", "suborigin": "268327-took-the-first-step-yesterday", "result": false, "Selector": "me develop", "selectorShort": "develop", "MarkedSent": "this past weekend saw me develop my first (3) -----> film !!!  in more years than i care think about !!! :-)", "sortedWord": "film", "Identifyer": null, "identifyer": 106411, "year": "2017"}, {"autor": "pridbor", "date": "2017-01-25 06:28:00", "content": "The first couple of film I took, I had developed professionally; and the negatives came back flat! I see your point about touching the glass of the scanner, and I must have been lucky with most of my scans, as only 2 had this effect. So after drying the film it came out slightly curved \"landscape\" wise on the entire length of the film. What do you gents do? Do you have flat negatives, and how do you do that? And if not does the curvature alter the image quality? Thanks again Preben", "link": "https://www.l-camera-forum.com/topic/268327-took-the-first-step-yesterday/?tab=comments#comment-3196235", "origin": "L-forum", "suborigin": "268327-took-the-first-step-yesterday", "result": false, "Selector": "i had developed", "selectorShort": "develop", "MarkedSent": "the first couple of -----> film !!!  i took, i had developed professionally; and the negatives came back flat!", "sortedWord": "film", "Identifyer": null, "identifyer": 106413, "year": "2017"}, {"autor": "Martin B", "date": "2017-01-25 12:27:00", "content": "The first couple of film I took, I had developed professionally; and the negatives came back flat! I see your point about touching the glass of the scanner, and I must have been lucky with most of my scans, as only 2 had this effect. So after drying the film it came out slightly curved \"landscape\" wise on the entire length of the film. What do you gents do? Do you have flat negatives, and how do you do that? And if not does the curvature alter the image quality? Thanks again Preben This sometimes happens especially with thicker Kodak film negatives (never had this problem with thinner Ilford negative films). I use some light weights (wooden cloth clamps) at the end of the hanging film when it is drying. If this is not enough, I cut the film after drying into sections (one section has five frames since my archive foil fits this number of frames in one row). Then I put each section on a clean letter-sized glass plate and add a clean white letter sized paper on top of the film sections. On top of it I put 4-5 heavy books and let it sit there for 2-3 days. The film is fairly flat afterwards and suitable to be used for scanning/digitizing. As pop pointed out earlier, use a film negative holder to fully flatten the negatives before digitizing. Edited January 25, 2017 by Martin B", "link": "https://www.l-camera-forum.com/topic/268327-took-the-first-step-yesterday/?tab=comments#comment-3196428", "origin": "L-forum", "suborigin": "268327-took-the-first-step-yesterday", "result": false, "Selector": "i had developed", "selectorShort": "develop", "MarkedSent": "the first couple of -----> film !!!  i took, i had developed professionally; and the negatives came back flat!", "sortedWord": "film", "Identifyer": null, "identifyer": 106416, "year": "2017"}], "name": "Leicasortedout2017develop"}