{"interestingcomments": [{"autor": "105012", "date": "2019-02-02 13:21:00", "content": "I’ve been gluing rear caps together for my Fuji and Leica kits for some years, really speeds up lens changes. I’ve progressed to my own design of dual sided lens cap which I 3D print (Leica ones are in red for obvious reasons, including standing out in the bag!). The 3D model I’ve designed is programmable so I can print any depth, super shallow or whatever... Edited February 2, 2019 by 105012", "link": "https://www.l-camera-forum.com/topic/293896-using-double-rear-cap-to-speed-up-changing-lens/?tab=comments#comment-3676416", "origin": "L-forum", "suborigin": "293896-using-double-rear-cap-to-speed-up-changing-lens", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "i’ve been gluing rear caps together for my fuji and leica kits for some years, really speeds up lens changes. i’ve progressed to my own design of dual sided lens cap which i -----> 3d !!!  -----> print !!!  (leica ones are in red for obvious reasons, including standing out in the bag!). the 3d model i’ve designed is programmable so i can print any depth, super shallow or whatever... edited february 2, 2019 by 105012", "sortedWord": "None", "Identifyer": null, "identifyer": 20773, "year": "2019"}, {"autor": "syam", "date": "2019-08-05 02:20:00", "content": " Hi Everyone, New member here, just recently acquired a lightly used Leica Q and I'm falling back in love with photography. First time Leica owner and loving everything about the Q. I've had my trusty Nikon D7000 with a collection of lenses for just about 7 years now, the starter Nikon D40 for 5 years before that, and was itching to upgrade. My shooting has mostly been street, landscape, 'artistic' and portraits in the past, and definitely have lots of content to shoot living in Brooklyn, NY. I was set on jumping into a Sony A7iii with a 24-105 and a wide angle prime but always came back to the Leica Q in all my research, cost comparing, reading, youtube, etc. Finally just decided just to go for it and give the Q a few months to see if it could work for my style and subject matter of shooting. I figured that worst case, if it couldn't be my only camera, that I would just sell for roughly the same price I paid in a few months. I started watching B&H, Adorama, and MPB used inventory for a few little while and scored a good deal (I think) on a very lightly used Q off of MPB a few weeks back. Ordered the MegaGear Half Case, Glass Screen Protector, B+W XS Pro MRNC Filter, and JFOTO Thumbs-up Grip right away to use with my Peak Design Slide Strap and quickly taped up the microphone and speaker ports. I've taken just shy of 1k pictures now and love how sharp and fast the focus is, handling is exactly what I wanted, size is a huge plus over the DSLR, and overall image quality and color rendition is amazing. I'm a Mechanical Engineer in Product Design as my day job, so of course I am in the middle of designing my own case that has an additional front finger grip, built in thumb grip (a la fuji xt-3), and a few other things. I have a few 3D printers so the idea is to try out the design and ergonomics with 3D printed models first, then when everything is perfect, have it CNC'd out of either aluminum or brass and coated black. I started the design by 3D modeling the Q. Love that a majority of the dimensions are nice whole numbers - exactly how I like to design parts. Now onto designing the bottom half of the case and working through a few iterations. Will update as progress continues. Any thoughts or input would be very much appreciated! --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/?tab=comments#comment-3791554", "origin": "L-forum", "suborigin": "299948-my-first-leica-q-designing-a-case", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": " hi everyone, new member here, just recently acquired a lightly used leica q and i'm falling back in love with photography. first time leica owner and loving everything about the q. i've had my trusty nikon d7000 with a collection of lenses for just about 7 years now, the starter nikon d40 for 5 years before that, and was itching to upgrade. my shooting has mostly been street, landscape, 'artistic' and portraits in the past, and definitely have lots of content to shoot living in brooklyn, ny. i was set on jumping into a sony a7iii with a 24-105 and a wide angle prime but always came back to the leica q in all my research, cost comparing, reading, youtube, etc. finally just decided just to go for it and give the q a few months to see if it could work for my style and subject matter of shooting. i figured that worst case, if it couldn't be my only camera, that i would just sell for roughly the same price i paid in a few months. i started watching b&h, adorama, and mpb used inventory for a few little while and scored a good deal (i think) on a very lightly used q off of mpb a few weeks back. ordered the megagear half case, glass screen protector, b+w xs pro mrnc filter, and jfoto thumbs-up grip right away to use with my peak design slide strap and quickly taped up the microphone and speaker ports. i've taken just shy of 1k pictures now and love how sharp and fast the focus is, handling is exactly what i wanted, size is a huge plus over the dslr, and overall image quality and color rendition is amazing. i'm a mechanical engineer in product design as my day job, so of course i am in the middle of designing my own case that has an additional front finger grip, built in thumb grip (a la fuji xt-3), and a few other things. i have a few -----> 3d !!!  printers so the idea is to try out the design and ergonomics with -----> 3d !!!  -----> printed !!!  models first, then when everything is perfect, have it cnc'd out of either aluminum or brass and coated black. i started the design by 3d modeling the q. love that a majority of the dimensions are nice whole numbers - exactly how i like to design parts. now onto designing the bottom half of the case and working through a few iterations. will update as progress continues. any thoughts or input would be very much appreciated! --img--  --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 6565, "year": "2019"}, {"autor": "syam", "date": "2019-08-08 03:32:00", "content": "On 8/6/2019 at 3:55 AM, LexS said: - more space around the Thumbs button, impossible to use as designed now. - rear thumbs grip unnecessary: grip enhanced by the case already. - create a \"stop\" between the main switch single shot and continuous. - After 3D printing the case yesterday, I found that the buttons need more space to comfortably press, so I\"ll be changing the geometry around the buttons to have a more flush cutout. - I'm really liking the rear thumb grip addition on the case. The combo with the front grip really makes the thing solid to hold, but this can easily be removed too. - I designed in a stop to block off the continuous mode completely since I never use it and it works ok. Could be better for the next version On 8/6/2019 at 12:32 PM, Matsaly said: Interesting design concept. Can you elaborate on what you mean on \"6. Diopter Adjuster Block-off.\" Re 7. Power switch block. Not sure users want to have C mode blocked off. While I rarely use C mode, I still want occasional access to it. On my Q-P I managed to wedge a small diameter \"O ring\" underneath the shutter release which provides enough resistance to avoid inadvertently selecting C mode but still allows one to choose C mode if desired. Would silicone or a \"grippy\" rubbery material be an option for your design? Just an idea. - For the diopter, I just simply put some case material around the diopter so nothing can bump into the dial and change the focus - I've been trying to rethink blocking off continuous shooting mode. Not sure if i'll keep the block off or not, but I really haven't had a problem with turning it to continuous by accident. I usually just leave it in single shot mode and wake the camera with a shutter press given the new aggressive power saving mode has been pretty frugal. - The exterior surface could have a soft-touch type paint, or specific sections with molded in rubber grips. That is an option but a more complex one of course. Some shots of the 3D prints for now until I get some time to redesign the problem areas: --img-- ", "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/?tab=comments#comment-3793414", "origin": "L-forum", "suborigin": "299948-my-first-leica-q-designing-a-case", "result": true, "Selector": "3d printing", "selectorShort": "print", "MarkedSent": "on 8/6/2019 at 3:55 am, lexs said: - more space around the thumbs button, impossible to use as designed now. - rear thumbs grip unnecessary: grip enhanced by the case already. - create a \"stop\" between the main switch single shot and continuous. - after -----> 3d !!!  -----> printing !!!  the case yesterday, i found that the buttons need more space to comfortably press, so i\"ll be changing the geometry around the buttons to have a more flush cutout. - i'm really liking the rear thumb grip addition on the case. the combo with the front grip really makes the thing solid to hold, but this can easily be removed too. - i designed in a stop to block off the continuous mode completely since i never use it and it works ok. could be better for the next version on 8/6/2019 at 12:32 pm, matsaly said: interesting design concept. can you elaborate on what you mean on \"6. diopter adjuster block-off.\" re 7. power switch block. not sure users want to have c mode blocked off. while i rarely use c mode, i still want occasional access to it. on my q-p i managed to wedge a small diameter \"o ring\" underneath the shutter release which provides enough resistance to avoid inadvertently selecting c mode but still allows one to choose c mode if desired. would silicone or a \"grippy\" rubbery material be an option for your design? just an idea. - for the diopter, i just simply put some case material around the diopter so nothing can bump into the dial and change the focus - i've been trying to rethink blocking off continuous shooting mode. not sure if i'll keep the block off or not, but i really haven't had a problem with turning it to continuous by accident. i usually just leave it in single shot mode and wake the camera with a shutter press given the new aggressive power saving mode has been pretty frugal. - the exterior surface could have a soft-touch type paint, or specific sections with molded in rubber grips. that is an option but a more complex one of course. some shots of the 3d prints for now until i get some time to redesign the problem areas: --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 6572, "year": "2019"}, {"autor": "syam", "date": "2019-08-22 15:37:00", "content": "15 hours ago, jaapv said: I'm afraid that I cannot say that the esthetics of the camera are improved this way... I don't necessarily disagree with you, but i don't particularly like how a half-case looks either. I would rather protect the camera with a cohesive design than not. Also the plan for the 3d print is only to evaluate the ergonomics and design, since it's inexpensive as I have access to several 3D printers. After the design is complete, I can have it CNC'd from aluminum or brass and coated black. 14 hours ago, m9photo said: Compare your design with Tekiac, I own one and really like it. I've looked at the design of the Tekiac and think it's a good design, but I wanted something that would protect all sides and faces of the Q (as much as possible). Plan is to make this design the best it can be and offer the files for manufacture if anyone wants it. 14 hours ago, Donzo98 said: Need to leave the hot shoe open to allow use of the Thumbs Up or flash. I can easily add a magnetic cover to block off the hot shoe that is easily removable. With this design there's no reason to use a thumbs-up as the case has a thumb securing grip already built in. Placement is also much better than the thumbs-up as it works with the thumb cutout on the camera (I have it also) and more like the Q2 thumbs-up placement. I also don't have a flash for the Q (yet) so have no need for the hot shoe - would rather have it covered up completely to avoid any dust or water entering from there. All great feedback. Thanks! I'll continue to improve the design over the next few weeks and 3D print a new updated case and continue to refine until I feel it is perfect.", "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/?tab=comments#comment-3803715", "origin": "L-forum", "suborigin": "299948-my-first-leica-q-designing-a-case", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "15 hours ago, jaapv said: i'm afraid that i cannot say that the esthetics of the camera are improved this way... i don't necessarily disagree with you, but i don't particularly like how a half-case looks either. i would rather protect the camera with a cohesive design than not. also the plan for the -----> 3d !!!  -----> print !!!  is only to evaluate the ergonomics and design, since it's inexpensive as i have access to several -----> 3d !!!  printers. after the design is complete, i can have it cnc'd from aluminum or brass and coated black. 14 hours ago, m9photo said: compare your design with tekiac, i own one and really like it. i've looked at the design of the tekiac and think it's a good design, but i wanted something that would protect all sides and faces of the q (as much as possible). plan is to make this design the best it can be and offer the files for manufacture if anyone wants it. 14 hours ago, donzo98 said: need to leave the hot shoe open to allow use of the thumbs up or flash. i can easily add a magnetic cover to block off the hot shoe that is easily removable. with this design there's no reason to use a thumbs-up as the case has a thumb securing grip already built in. placement is also much better than the thumbs-up as it works with the thumb cutout on the camera (i have it also) and more like the q2 thumbs-up placement. i also don't have a flash for the q (yet) so have no need for the hot shoe - would rather have it covered up completely to avoid any dust or water entering from there. all great feedback. thanks! i'll continue to improve the design over the next few weeks and 3d print a new updated case and continue to refine until i feel it is perfect.", "sortedWord": "None", "Identifyer": null, "identifyer": 6579, "year": "2019"}, {"autor": "JeremyG", "date": "2019-08-22 20:09:00", "content": "19 hours ago, m9photo said: Compare your design with Tekiac, I own one and really like it. I too have a 3D-printed Tekiac case and much prefer it to the Leica leather half case.", "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/?tab=comments#comment-3803920", "origin": "L-forum", "suborigin": "299948-my-first-leica-q-designing-a-case", "result": true, "Selector": "3d-printed", "selectorShort": "print", "MarkedSent": "19 hours ago, m9photo said: compare your design with tekiac, i own one and really like it. i too have a -----> 3d !!! -printed tekiac case and much prefer it to the leica leather half case.", "sortedWord": "None", "Identifyer": null, "identifyer": 6580, "year": "2019"}, {"autor": "syam", "date": "2019-09-11 20:50:00", "content": "6 hours ago, RRock said: Hi Syam! I just wanted to ask if you would share the 3D model of the Q? I am working on a holster-type case for a backpack strap. Of course I would share my results here in the forum as well. I uploaded the 3D model of the Leica Q onto thingiverse here: https://www.thingiverse.com/thing:3856985 I've been using the Version 2 3D printed case for a little bit now and am liking it a lot. I still have a few tweaks to make but overall, the design is working very much how I envisioned it. Edited September 11, 2019 by syam", "link": "https://www.l-camera-forum.com/topic/299948-my-first-leica-q-designing-a-case/?tab=comments#comment-3818305", "origin": "L-forum", "suborigin": "299948-my-first-leica-q-designing-a-case", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "6 hours ago, rrock said: hi syam! i just wanted to ask if you would share the 3d model of the q? i am working on a holster-type case for a backpack strap. of course i would share my results here in the forum as well. i uploaded the -----> 3d !!!  model of the leica q onto thingiverse here: https://www.thingiverse.com/thing:3856985 i've been using the version 2 -----> 3d !!!  -----> printed !!!  case for a little bit now and am liking it a lot. i still have a few tweaks to make but overall, the design is working very much how i envisioned it. edited september 11, 2019 by syam", "sortedWord": "None", "Identifyer": null, "identifyer": 6583, "year": "2019"}, {"autor": "thebarnman", "date": "2019-02-19 20:16:00", "content": "On 1/26/2019 at 4:19 PM, wlaidlaw said: I contacted Paepke Fototechnik a couple of weeks ago to ask if they had a battery compartment door for an R9. They came back to me advising that they neither have any spare parts for the R8 and 9, nor do they service them. They do service the earlier R3 - 7 models. I believe following a conversation with Jimmy Hughes at Leica UK that Boris Jamchtchik of Photo Arsenal bought Leica's remaining stock of R8 and 9 spare parts. However as he can't be bothered to answer either emails or messages sent via Facebook Messenger, this does not help us R8/9 owners one whit and I don't think Leica have done us any favours with this action. Wilson Maybe someone can take a sample of one and create a 3D print of it.", "link": "https://www.l-camera-forum.com/topic/289777-servicing-r-cameras-the-end-of-the-story-for-r8-and-r9/page/3/?tab=comments#comment-3687348", "origin": "L-forum", "suborigin": "289777-servicing-r-cameras-the-end-of-the-story-for-r8-and-r9", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "on 1/26/2019 at 4:19 pm, wlaidlaw said: i contacted paepke fototechnik a couple of weeks ago to ask if they had a battery compartment door for an r9. they came back to me advising that they neither have any spare parts for the r8 and 9, nor do they service them. they do service the earlier r3 - 7 models. i believe following a conversation with jimmy hughes at leica uk that boris jamchtchik of photo arsenal bought leica's remaining stock of r8 and 9 spare parts. however as he can't be bothered to answer either emails or messages sent via facebook messenger, this does not help us r8/9 owners one whit and i don't think leica have done us any favours with this action. wilson maybe someone can take a sample of one and create a -----> 3d !!!  -----> print !!!  of it.", "sortedWord": "None", "Identifyer": null, "identifyer": 21114, "year": "2019"}, {"autor": "wlaidlaw", "date": "2019-02-19 22:58:00", "content": "2 hours ago, thebarnman said: Maybe someone can take a sample of one and create a 3D print of it. It is not something I have to have, as the grip on the Motor-Winder I use replaces the original battery cover and holds the 2 x CR123A batteries that power both the camera and the Motor Winder. It was just something to have in case the motor winder fails at some point but I suspect it is more reliable than the camera. That is certainly what I have found on my M7. Wilson", "link": "https://www.l-camera-forum.com/topic/289777-servicing-r-cameras-the-end-of-the-story-for-r8-and-r9/page/3/?tab=comments#comment-3687478", "origin": "L-forum", "suborigin": "289777-servicing-r-cameras-the-end-of-the-story-for-r8-and-r9", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "2 hours ago, thebarnman said: maybe someone can take a sample of one and create a -----> 3d !!!  -----> print !!!  of it. it is not something i have to have, as the grip on the motor-winder i use replaces the original battery cover and holds the 2 x cr123a batteries that power both the camera and the motor winder. it was just something to have in case the motor winder fails at some point but i suspect it is more reliable than the camera. that is certainly what i have found on my m7. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 21115, "year": "2019"}, {"autor": "zeitz", "date": "2019-07-30 02:14:00", "content": "Carbon fiber is one type of composite material. Composite means that the material is composed of two or more types of substances bound together to take advantage of differing characteristics of the substances. The substances are not mixed together like an alloy of metals. Most everyone is familiar with fiberglass (or glass-reinforced plastic) which is glass fibers (usually a mat) sprayed or brushed with plastic that is hardened chemically. Fiberglass has been around for a long time. Carbon fiber is carbon threads often woven into a mat and impregnated with an epoxy resin. The resin is hardened by cooking the assembly at a certain temperature. Carbon fiber has been around longer than many people realize. There are many other types of composites. I venture a guess that a majority of interchangeable lens digital cameras are made of fiber reinforced polycarbonate. The selection of a material (composite or metal) depends on the engineering, cost and marketing implications. For instance, it might be too expensive to tool up for composites for items that are going to be made in small numbers. But there is no reason that a Leica M could not be made of composite materials. We all accept and want carbon fiber tripods because low weight and high strength are critical. From a marketing perspective Leica owners would likely revolt and avoid an M that is not metal. However other markets seem to like the look of carbon fiber weave and stick decorative carbon fiber panels, say, in the interior of a car merely as a marketing tool. I don't know of any attempts to 3D print composites. Such a process would require simultaneously printing two very different materials.", "link": "https://www.l-camera-forum.com/topic/299713-carbon-fiber-printed-cameras/?tab=comments#comment-3787617", "origin": "L-forum", "suborigin": "299713-carbon-fiber-printed-cameras", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "carbon fiber is one type of composite material. composite means that the material is composed of two or more types of substances bound together to take advantage of differing characteristics of the substances. the substances are not mixed together like an alloy of metals. most everyone is familiar with fiberglass (or glass-reinforced plastic) which is glass fibers (usually a mat) sprayed or brushed with plastic that is hardened chemically. fiberglass has been around for a long time. carbon fiber is carbon threads often woven into a mat and impregnated with an epoxy resin. the resin is hardened by cooking the assembly at a certain temperature. carbon fiber has been around longer than many people realize. there are many other types of composites. i venture a guess that a majority of interchangeable lens digital cameras are made of fiber reinforced polycarbonate. the selection of a material (composite or metal) depends on the engineering, cost and marketing implications. for instance, it might be too expensive to tool up for composites for items that are going to be made in small numbers. but there is no reason that a leica m could not be made of composite materials. we all accept and want carbon fiber tripods because low weight and high strength are critical. from a marketing perspective leica owners would likely revolt and avoid an m that is not metal. however other markets seem to like the look of carbon fiber weave and stick decorative carbon fiber panels, say, in the interior of a car merely as a marketing tool. i don't know of any attempts to -----> 3d !!!  -----> print !!!  composites. such a process would require simultaneously printing two very different materials.", "sortedWord": "None", "Identifyer": null, "identifyer": 83573, "year": "2019"}, {"autor": "marchyman", "date": "2019-12-30 18:37:00", "content": "I use a canon 50mm f/1.8 with a cheap extension tube set and a 3d printed slide holder to make slide copies. I use a scanner for film because I never made a holder to keep the film flat enough to use with the DSLR. But to answer your question, a 50 mm lens and about 20 mm of extension gave me a good view for 35mm slide copying. You do have to play some games to set the aperture of the lens -- I use f/8. The lens default of wide open leaves you with a DoF that is way too small and with my cheapie extension tubes there is no way the camera can control the aperture. An enlarger lens if available would probably be a better choice. I had the 50 f/1.8 and didn't want to buy something else.", "link": "https://www.l-camera-forum.com/topic/304857-macro-lens-for-scanning-film-w-dslr/?tab=comments#comment-3882058", "origin": "L-forum", "suborigin": "304857-macro-lens-for-scanning-film-w-dslr", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "i use a canon 50mm f/1.8 with a cheap extension tube set and a -----> 3d !!!  -----> printed !!!  slide holder to make slide copies. i use a scanner for film because i never made a holder to keep the film flat enough to use with the dslr. but to answer your question, a 50 mm lens and about 20 mm of extension gave me a good view for 35mm slide copying. you do have to play some games to set the aperture of the lens -- i use f/8. the lens default of wide open leaves you with a dof that is way too small and with my cheapie extension tubes there is no way the camera can control the aperture. an enlarger lens if available would probably be a better choice. i had the 50 f/1.8 and didn't want to buy something else.", "sortedWord": "None", "Identifyer": null, "identifyer": 112161, "year": "2019"}, {"autor": "stray cat", "date": "2019-09-10 00:16:00", "content": "Well, you pose a question on the LUF and you get immediate results. I tried emailing the shtengel link but didn't hear back overnight. Doesn't mean I won't and if I do I'll post his response for future reference of anyone else having the same problem. However I had a PM from LUF member Gary Wyck who recommended a fellow named Frank who he'd used with success in the past. So just half an hour ago I emailed Frank at sforza746@yahoo.com and he replied from the USA straight away suggesting he could insert a 3D printed, metal reinforced flap for a reasonable premium on his mirror cleaning service. So it's off to the USA for my coolscan and I am confident it will come back better than ever. Thank you so much 105012 and Gary W for your fast and thoughtful responses.", "link": "https://www.l-camera-forum.com/topic/301279-nikon-coolscan-9000ed-helpadvice-needed/?tab=comments#comment-3816839", "origin": "L-forum", "suborigin": "301279-nikon-coolscan-9000ed-helpadvice-needed", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": "well, you pose a question on the luf and you get immediate results. i tried emailing the shtengel link but didn't hear back overnight. doesn't mean i won't and if i do i'll post his response for future reference of anyone else having the same problem. however i had a pm from luf member gary wyck who recommended a fellow named frank who he'd used with success in the past. so just half an hour ago i emailed frank at sforza746@yahoo.com and he replied from the usa straight away suggesting he could insert a -----> 3d !!!  -----> printed !!! , metal reinforced flap for a reasonable premium on his mirror cleaning service. so it's off to the usa for my coolscan and i am confident it will come back better than ever. thank you so much 105012 and gary w for your fast and thoughtful responses.", "sortedWord": "None", "Identifyer": null, "identifyer": 113057, "year": "2019"}, {"autor": "stray cat", "date": "2019-09-11 09:50:00", "content": " Further to my queries that extended far and wide I received the following email from Gleb Shtengel (gleb@shtengel.com): Hi, Philip, I have just ordered a new batch of flap doors - I will have them in 2-3 weeks. I will then need to do reinforcement on them. After that I can send you one. I sell them for $65 plus the cost of shipping, which should be about $20 to Australia. Gleb. So there is an excellent piece of news, that Gleb is having these delicate and pesky doors 3D printed, then reinforcing them and offering them for sale. Again, when the door/flap goes, the scanner is rendered completely useless, so having a spare would seem like good insurance for a reasonable cost.", "link": "https://www.l-camera-forum.com/topic/301279-nikon-coolscan-9000ed-helpadvice-needed/?tab=comments#comment-3817853", "origin": "L-forum", "suborigin": "301279-nikon-coolscan-9000ed-helpadvice-needed", "result": true, "Selector": "3d printed", "selectorShort": "print", "MarkedSent": " further to my queries that extended far and wide i received the following email from gleb shtengel (gleb@shtengel.com): hi, philip, i have just ordered a new batch of flap doors - i will have them in 2-3 weeks. i will then need to do reinforcement on them. after that i can send you one. i sell them for $65 plus the cost of shipping, which should be about $20 to australia. gleb. so there is an excellent piece of news, that gleb is having these delicate and pesky doors -----> 3d !!!  -----> printed !!! , then reinforcing them and offering them for sale. again, when the door/flap goes, the scanner is rendered completely useless, so having a spare would seem like good insurance for a reasonable cost.", "sortedWord": "None", "Identifyer": null, "identifyer": 113060, "year": "2019"}, {"autor": "zeitz", "date": "2019-04-13 19:39:00", "content": "Robert poses an interesting issue. I have to ask myself which photo-related companies I trust. I know I don't trust Apple; buggy OS updates are rushed to release; AirPower was an imaginary product; a new MacPro also has yet to reach reality and the current one is 5 years out of date; Apple decisions are purely based on profit margin product by product. I don't trust Microsoft because of numerous Windows problems before I switched to Mac. (But for some reason I trust Dell.) I don't really trust Leica either; I am expecting my M8 and M9 to fail and be unrepairable. But that really has more to do with spares for electronic parts; you can't 3D print a new sensor or a new display. I don't trust Nikon, especially because I couldn't get a new autofocus motor for a lens that is no longer manufactured but not that old. I don't trust that Adobe will make decisions that favor the way I use their products; at they start of CC they guaranteed original software owners would never pay more than $10 per month; I know I don't trust that statement anymore than I trusted the M8 upgrade program announcement. But I do trust that Adobe will continue in business for a very long time. And I trust that .dng raw files will be readable by some software as long as I care about them.", "link": "https://www.l-camera-forum.com/topic/295660-a-replacement-for-lightroom/page/2/?tab=comments#comment-3721774", "origin": "L-forum", "suborigin": "295660-a-replacement-for-lightroom", "result": true, "Selector": "3d print", "selectorShort": "print", "MarkedSent": "robert poses an interesting issue. i have to ask myself which photo-related companies i trust. i know i don't trust apple; buggy os updates are rushed to release; airpower was an imaginary product; a new macpro also has yet to reach reality and the current one is 5 years out of date; apple decisions are purely based on profit margin product by product. i don't trust microsoft because of numerous windows problems before i switched to mac. (but for some reason i trust dell.) i don't really trust leica either; i am expecting my m8 and m9 to fail and be unrepairable. but that really has more to do with spares for electronic parts; you can't -----> 3d !!!  -----> print !!!  a new sensor or a new display. i don't trust nikon, especially because i couldn't get a new autofocus motor for a lens that is no longer manufactured but not that old. i don't trust that adobe will make decisions that favor the way i use their products; at they start of cc they guaranteed original software owners would never pay more than $10 per month; i know i don't trust that statement anymore than i trusted the m8 upgrade program announcement. but i do trust that adobe will continue in business for a very long time. and i trust that .dng raw files will be readable by some software as long as i care about them.", "sortedWord": "None", "Identifyer": null, "identifyer": 113118, "year": "2019"}], "name": "Leicasortedout2019print"}