{"interestingcomments": [{"autor": "pedaes", "date": "2020-11-25 14:07:00", "content": "9 hours ago, MikeMyers said: Sensor Cleaning? There is a very accurate dust detection feature with instructions in your camera's menu. A blower will just blow the dust about, and will do nothing for oil spots or 'attached' dust. Unless you live very close to a friendly store you have to learn to do it yourself, it is not difficult. The first step is to purchase some top brand and genuine swabs of the right size (get plenty) and liquid (or use uncontaminated IPA). In my experience, new Leica's need a wet clean early in their life as you seem to get an initial few oil spots that don''t repeat. You can then research and buy genuine products for subsequent 'dry' cleans, such as the gel pad sticks as used by Leica in the factory and 'static' brushes. Neither of the dry tools mentioned will remove oil, and will probably smear it around. Keep checking with the detection feature, be patient and expect it to take several repeat goes to get a perfect clean. For dust detection - a white (computer/monitor) screen works well.On a i-Mac, I use 'Notes' and expand it out to the whole screen. There are loads of helpful 'how to' You Tube videos - just use your judgement to find a credible one. Good luck.", "link": "https://www.l-camera-forum.com/topic/315480-how-to-remove-sensor-dust-from-a-m10-sensor/?tab=comments#comment-4086901", "origin": "L-forum", "suborigin": "315480-how-to-remove-sensor-dust-from-a-m10-sensor", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "9 hours ago, mikemyers said: sensor cleaning? there is a very accurate dust detection feature with instructions in your camera's menu. a blower will just blow the dust about, and will do nothing for oil spots or 'attached' dust. unless you live very close to a friendly store you have to learn to -----> do !!!  -----> it !!!  -----> yourself !!! , -----> it !!!  is not difficult. the first step is to purchase some top brand and genuine swabs of the right size (get plenty) and liquid (or use uncontaminated ipa). in my experience, new leica's need a wet clean early in their life as you seem to get an initial few oil spots that don''t repeat. you can then research and buy genuine products for subsequent 'dry' cleans, such as the gel pad sticks as used by leica in the factory and 'static' brushes. neither of the dry tools mentioned will remove oil, and will probably smear it around. keep checking with the detection feature, be patient and expect it to take several repeat goes to get a perfect clean. for dust detection - a white (computer/monitor) screen works well.on a i-mac, i use 'notes' and expand it out to the whole screen. there are loads of helpful 'how to' you tube videos - just use your judgement to find a credible one. good luck.", "sortedWord": "None", "Identifyer": null, "identifyer": 11554, "year": "2020"}, {"autor": "pedaes", "date": "2020-09-01 21:01:00", "content": "Welcome to the Forum. Learn to do it yourself. I doubt anyone in a camera store will have had any formal training in sensor cleaning so you can learn yourself as well as they have. YouTube is your friend. . It is not difficult but will need a little investment in good kit. For the type of 'loose' dust you are describing I personally rate the Artic Butterfly static brush. The next stage would be to use the Eye Lead sticky pads (as used by Leica) and finally for any oily/grease marks a wet clean with the correct size swab and cleaning fluid - from Visible Dust as with the Butterfly brush. It is a bit scary first time but you will soon get confidence. Do not be surprised if it takes several attempts to get the sensor perfectly clean every time. Edited September 1, 2020 by pedaes", "link": "https://www.l-camera-forum.com/topic/312921-sensor-cleaning/?tab=comments#comment-4037882", "origin": "L-forum", "suborigin": "312921-sensor-cleaning", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "welcome to the forum. learn to -----> do !!!  -----> it !!!  -----> yourself !!! . i doubt anyone in a camera store will have had any formal training in sensor cleaning so you can learn yourself as well as they have. youtube is your friend. . it is not difficult but will need a little investment in good kit. for the type of 'loose' dust you are describing i personally rate the artic butterfly static brush. the next stage would be to use the eye lead sticky pads (as used by leica) and finally for any oily/grease marks a wet clean with the correct size swab and cleaning fluid - from visible dust as with the butterfly brush. it is a bit scary first time but you will soon get confidence. do not be surprised if it takes several attempts to get the sensor perfectly clean every time. edited september 1, 2020 by pedaes", "sortedWord": "None", "Identifyer": null, "identifyer": 15720, "year": "2020"}, {"autor": "M2Pete", "date": "2020-09-02 02:51:00", "content": "Thank you for your replies! Film focused luddite here. I guess the old adage, \"If you want something done right, do it yourself.\" applies.", "link": "https://www.l-camera-forum.com/topic/312921-sensor-cleaning/?tab=comments#comment-4038014", "origin": "L-forum", "suborigin": "312921-sensor-cleaning", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "thank you for your replies! film focused luddite here. i guess the old adage, \"if you want something done right, -----> do !!!  -----> it !!!  -----> yourself !!! .\" applies.", "sortedWord": "None", "Identifyer": null, "identifyer": 15726, "year": "2020"}, {"autor": "jdlaing", "date": "2020-09-02 02:53:00", "content": "Just now, M2Pete said: Thank you for your replies! Film focused luddite here. I guess the old adage, \"If you want something done right, do it yourself.\" applies. There are posts here on the forum that will guide you thru the safest process. Use the search box and look for sensor cleaning.", "link": "https://www.l-camera-forum.com/topic/312921-sensor-cleaning/?tab=comments#comment-4038016", "origin": "L-forum", "suborigin": "312921-sensor-cleaning", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "just now, m2pete said: thank you for your replies! film focused luddite here. i guess the old adage, \"if you want something done right, -----> do !!!  -----> it !!!  -----> yourself !!! .\" applies. there are posts here on the forum that will guide you thru the safest process. use the search box and look for sensor cleaning.", "sortedWord": "None", "Identifyer": null, "identifyer": 15728, "year": "2020"}, {"autor": "Herr Barnack", "date": "2020-11-22 05:35:00", "content": "@theumbrellacorp - first of all, welcome to the forum and congratulations on your M-P 240! Do it yourself sensor glass cover (that is what you are cleaning, not the actual sensor) cleaning is not difficult and is not dangerous to the camera, provided you follow your M-P 240's instructions on sensor cleaning and the directions for the sensor cleaning swabs and fluid. The main thing is to not use too much cleaning fluid. First, I use my Giottos Rocket Blaster dust removal blower bulb to any remove loose dust. Next, I use Photographic Solutions Type 3 Sensor Swab (the 24mm wide sensor swabs) and I put three evenly spaced drops of Photographic Solutions Eclipse Optic Cleaning Solution on one edge of the swab, turn it over ans apply two evenly spaced drops to the reverse (other) edge of the swab. I then wait about 10 seconds to give the fluid a chance to uniformly absorb into the edges of the swab. I usually need to clean my camera sensor's glass cover 2-3 times per year and have done so for the 5 1/2 years that I have owned my M-P 240; I have had zero problems related to sensor cleaning. There's really no reason to pay a camera store $50 or more to clean your sensor when doing it yourself is simple and you will get good results - just follow all directions given by Leica and Photographic Solutions and everything will turn out fine.", "link": "https://www.l-camera-forum.com/topic/315072-leica-cla-experience-for-mp-240/?tab=comments#comment-4084862", "origin": "L-forum", "suborigin": "315072-leica-cla-experience-for-mp-240", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "@theumbrellacorp - first of all, welcome to the forum and congratulations on your m-p 240! -----> do !!!  -----> it !!!  -----> yourself !!!  sensor glass cover (that is what you are cleaning, not the actual sensor) cleaning is not difficult and is not dangerous to the camera, provided you follow your m-p 240's instructions on sensor cleaning and the directions for the sensor cleaning swabs and fluid. the main thing is to not use too much cleaning fluid. first, i use my giottos rocket blaster dust removal blower bulb to any remove loose dust. next, i use photographic solutions type 3 sensor swab (the 24mm wide sensor swabs) and i put three evenly spaced drops of photographic solutions eclipse optic cleaning solution on one edge of the swab, turn it over ans apply two evenly spaced drops to the reverse (other) edge of the swab. i then wait about 10 seconds to give the fluid a chance to uniformly absorb into the edges of the swab. i usually need to clean my camera sensor's glass cover 2-3 times per year and have done so for the 5 1/2 years that i have owned my m-p 240; i have had zero problems related to sensor cleaning. there's really no reason to pay a camera store $50 or more to clean your sensor when doing it yourself is simple and you will get good results - just follow all directions given by leica and photographic solutions and everything will turn out fine.", "sortedWord": "None", "Identifyer": null, "identifyer": 16113, "year": "2020"}, {"autor": "mirekti", "date": "2020-01-12 22:04:00", "content": "47 minutes ago, microview said: If you are in Chicago, would not Tamarkin be the best place to go – and let an expert fix your camera? I had no clue, moved in area two years ago. Certainly I can go there, and most likely will. ...but adjusting the rangefinder sounds easy, and there’s that feeling of accomplishment if you do it yourself.", "link": "https://www.l-camera-forum.com/topic/244454-rangefinder-slightly-off-at-infinity/?tab=comments#comment-3890230", "origin": "L-forum", "suborigin": "244454-rangefinder-slightly-off-at-infinity", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "47 minutes ago, microview said: if you are in chicago, would not tamarkin be the best place to go – and let an expert fix your camera? i had no clue, moved in area two years ago. certainly i can go there, and most likely will. ...but adjusting the rangefinder sounds easy, and there’s that feeling of accomplishment if you -----> do !!!  -----> it !!!  -----> yourself !!! .", "sortedWord": "None", "Identifyer": null, "identifyer": 18736, "year": "2020"}, {"autor": "dllewellyn", "date": "2020-09-12 21:28:00", "content": "But Schott doesn’t apply coatings normally. You buy the glass from Schott and do it yourself. I have been buying glass from them since 1996.", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/2/?tab=comments#comment-4044820", "origin": "L-forum", "suborigin": "313260-sensor-corrosion-analysis-and-fix-merged", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "but schott doesn’t apply coatings normally. you buy the glass from schott and -----> do !!!  -----> it !!!  -----> yourself !!! . i have been buying glass from them since 1996.", "sortedWord": "None", "Identifyer": null, "identifyer": 30179, "year": "2020"}, {"autor": "michali", "date": "2020-10-02 07:33:00", "content": "9 hours ago, twicij said: Hi, I bought a beautiful apparently unused Leica R lens from an estate sale to use with my CL, but it doesn’t fit my Novoflex adapter. It looks like the mounting flange was changed to a Nikon F mount, that's the cap on the back of the lens. Where can I get a Leica mounting flange to switch it back? Can I do this myself? It looks straightforward. If not, who can do it? The lens is a Leitz Elmar-R 1:4/180 3371192. Thanks for your help, D You could do it yourself, I changed a number of my R lenses to Leitax Sony alpha mounts & then back to their original R mounts again when I sold the Sony α900. However it's easier & simpler purchase one of these Nikon F to L Mount adaptors for under $30- : Haoge Manual Lens Mount Adapter for Nikon Nikkor F/AI/AIS/D Lens to Leica L Mount Camera I have a couple of these Haoge adaptors in R to L mount, they're well made. Edited October 2, 2020 by michali", "link": "https://www.l-camera-forum.com/topic/313823-r-lens-mount-change-back-to-leica-help/?tab=comments#comment-4055724", "origin": "L-forum", "suborigin": "313823-r-lens-mount-change-back-to-leica-help", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "9 hours ago, twicij said: hi, i bought a beautiful apparently unused leica r lens from an estate sale to use with my cl, but it doesn’t fit my novoflex adapter. it looks like the mounting flange was changed to a nikon f mount, that's the cap on the back of the lens. where can i get a leica mounting flange to switch it back? can i do this myself? it looks straightforward. if not, who can do it? the lens is a leitz elmar-r 1:4/180 3371192. thanks for your help, d you could -----> do !!!  -----> it !!!  -----> yourself !!! , i changed a number of my r lenses to leitax sony alpha mounts & then back to their original r mounts again when i sold the sony α900. however it's easier & simpler purchase one of these nikon f to l mount adaptors for under $30- : haoge manual lens mount adapter for nikon nikkor f/ai/ais/d lens to leica l mount camera i have a couple of these haoge adaptors in r to l mount, they're well made. edited october 2, 2020 by michali", "sortedWord": "None", "Identifyer": null, "identifyer": 20819, "year": "2020"}, {"autor": "jaapv", "date": "2020-05-17 13:04:00", "content": "You could do it yourself. https://interiordesign.lovetoknow.com/How_to_Resilver_a_Mirror alternately camera repair shops can do it or know where to have it done.", "link": "https://www.l-camera-forum.com/topic/309649-looking-for-pentaprism-re-silvering-service/?tab=comments#comment-3975171", "origin": "L-forum", "suborigin": "309649-looking-for-pentaprism-re-silvering-service", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "you could -----> do !!!  -----> it !!!  -----> yourself !!! . https://interiordesign.lovetoknow.com/how_to_resilver_a_mirror alternately camera repair shops can do it or know where to have it done.", "sortedWord": "None", "Identifyer": null, "identifyer": 21527, "year": "2020"}, {"autor": "james.liam", "date": "2020-01-29 01:22:00", "content": "I had my battery replaced with the 2000, no issues at all. Before doing it yourself, I suggest you look through this thread. The options available are not that costly and unless you know your way with a soldering iron, it may be the best way to proceed, better than the unpredictability of fleaBay and PRC batteries. Or PRC anything. Edited January 29, 2020 by james.liam", "link": "https://www.l-camera-forum.com/topic/305847-md-r8-battery-cell-replacement-2000mah/?tab=comments#comment-3901768", "origin": "L-forum", "suborigin": "305847-md-r8-battery-cell-replacement-2000mah", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "i had my battery replaced with the 2000, no issues at all. before -----> doing !!!  -----> it !!!  -----> yourself !!! , i suggest you look through this thread. the options available are not that costly and unless you know your way with a soldering iron, it may be the best way to proceed, better than the unpredictability of fleabay and prc batteries. or prc anything. edited january 29, 2020 by james.liam", "sortedWord": "None", "Identifyer": null, "identifyer": 21915, "year": "2020"}, {"autor": "Leica Duncan", "date": "2020-01-29 09:27:00", "content": "7 hours ago, james.liam said: I had my battery replaced with the 2000, no issues at all. Before doing it yourself, I suggest you look through this thread. The options available are not that costly and unless you know your way with a soldering iron, it may be the best way to proceed, better than the unpredictability of fleaBay and PRC batteries. Or PRC anything. Thanks james.liam, that is reassuring. I am not adverse to having a go if I can convince myself that the ebay product is up to it. Then again, looking at the other thread you have pointed to, if a professional refurb can be that reasonable, that might well be a wiser choice.", "link": "https://www.l-camera-forum.com/topic/305847-md-r8-battery-cell-replacement-2000mah/?tab=comments#comment-3901913", "origin": "L-forum", "suborigin": "305847-md-r8-battery-cell-replacement-2000mah", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "7 hours ago, james.liam said: i had my battery replaced with the 2000, no issues at all. before -----> doing !!!  -----> it !!!  -----> yourself !!! , i suggest you look through this thread. the options available are not that costly and unless you know your way with a soldering iron, it may be the best way to proceed, better than the unpredictability of fleabay and prc batteries. or prc anything. thanks james.liam, that is reassuring. i am not adverse to having a go if i can convince myself that the ebay product is up to it. then again, looking at the other thread you have pointed to, if a professional refurb can be that reasonable, that might well be a wiser choice.", "sortedWord": "None", "Identifyer": null, "identifyer": 21916, "year": "2020"}, {"autor": "Leica Duncan", "date": "2020-01-29 10:03:00", "content": "8 hours ago, james.liam said: I had my battery replaced with the 2000, no issues at all. Before doing it yourself, I suggest you look through this thread. The options available are not that costly and unless you know your way with a soldering iron, it may be the best way to proceed, better than the unpredictability of fleaBay and PRC batteries. Or PRC anything. Thanks james.liam, that is reassuring. I am not adverse to having a go if I can convince myself that the ebay product is up to it. Then again, looking at the other thread you have pointed to, if a professional refurb can be that reasonable, that might well be a wiser choice.", "link": "https://www.l-camera-forum.com/topic/305847-md-r8-battery-cell-replacement-2000mah/?tab=comments#comment-3901927", "origin": "L-forum", "suborigin": "305847-md-r8-battery-cell-replacement-2000mah", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": "8 hours ago, james.liam said: i had my battery replaced with the 2000, no issues at all. before -----> doing !!!  -----> it !!!  -----> yourself !!! , i suggest you look through this thread. the options available are not that costly and unless you know your way with a soldering iron, it may be the best way to proceed, better than the unpredictability of fleabay and prc batteries. or prc anything. thanks james.liam, that is reassuring. i am not adverse to having a go if i can convince myself that the ebay product is up to it. then again, looking at the other thread you have pointed to, if a professional refurb can be that reasonable, that might well be a wiser choice.", "sortedWord": "None", "Identifyer": null, "identifyer": 21917, "year": "2020"}, {"autor": "Herr Barnack", "date": "2020-11-05 16:15:00", "content": "@plasticman you do make some valid observations. For those who want to shoot film, you can develop your own and save some money; not as much as in the past, though. Chemistry costs money, but in the long run do it yourself developing is still less costly than outsourcing your developing. $11,000 USD for an M10 Monochrom is beyond insane. A person could fly coach class to New York, buy an M10M at B&H, fly back home to Sweden and still be money ahead, having gotten to see and shop in the most wonderfulest photographer's shrine in all the world! Edited November 5, 2020 by Herr Barnack", "link": "https://www.l-camera-forum.com/topic/314801-kodak-raising-prices-again-in-2021/page/2/?tab=comments#comment-4074494", "origin": "L-forum", "suborigin": "314801-kodak-raising-prices-again-in-2021", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "@plasticman you do make some valid observations. for those who want to shoot film, you can develop your own and save some money; not as much as in the past, though. chemistry costs money, but in the long run -----> do !!!  -----> it !!!  -----> yourself !!!  developing is still less costly than outsourcing your developing. $11,000 usd for an m10 monochrom is beyond insane. a person could fly coach class to new york, buy an m10m at b&h, fly back home to sweden and still be money ahead, having gotten to see and shop in the most wonderfulest photographer's shrine in all the world! edited november 5, 2020 by herr barnack", "sortedWord": "None", "Identifyer": null, "identifyer": 99672, "year": "2020"}, {"autor": "Steve Ricoh", "date": "2020-11-05 17:04:00", "content": "39 minutes ago, Herr Barnack said: @plasticman you do make some valid observations. For those who want to shoot film, you can develop your own and save some money; not as much as in the past, though. Chemistry costs money, but in the long run do it yourself developing is still less costly than outsourcing your developing. $11,000 USD for an M10 Monochrom is beyond insane. A person could fly coach class to New York, buy an M10M at B&H, fly back home to Sweden and still be money ahead, having gotten to see and shop in the most wonderfulest photographer's shrine in all the world! Or a shorter flight to the U.K., with the monetary saving going into airline shares. They’re going to bounce back, right, as long as they don’t bounce too much trying to land. Regarding the comment about waste materials. Electronic equipment is subject to WEE regulations. Are there any regulations stopping me flushing nasty chemicals and precious metals down the drain. I mean regulations that can be enforced. If Kodak subsequently reduce costs once the production line is set up, I’ll declare myself a Dutchman.", "link": "https://www.l-camera-forum.com/topic/314801-kodak-raising-prices-again-in-2021/page/2/?tab=comments#comment-4074518", "origin": "L-forum", "suborigin": "314801-kodak-raising-prices-again-in-2021", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "39 minutes ago, herr barnack said: @plasticman you do make some valid observations. for those who want to shoot film, you can develop your own and save some money; not as much as in the past, though. chemistry costs money, but in the long run -----> do !!!  -----> it !!!  -----> yourself !!!  developing is still less costly than outsourcing your developing. $11,000 usd for an m10 monochrom is beyond insane. a person could fly coach class to new york, buy an m10m at b&h, fly back home to sweden and still be money ahead, having gotten to see and shop in the most wonderfulest photographer's shrine in all the world! or a shorter flight to the u.k., with the monetary saving going into airline shares. they’re going to bounce back, right, as long as they don’t bounce too much trying to land. regarding the comment about waste materials. electronic equipment is subject to wee regulations. are there any regulations stopping me flushing nasty chemicals and precious metals down the drain. i mean regulations that can be enforced. if kodak subsequently reduce costs once the production line is set up, i’ll declare myself a dutchman.", "sortedWord": "None", "Identifyer": null, "identifyer": 99673, "year": "2020"}, {"autor": "giannis", "date": "2020-06-27 14:18:00", "content": "On 5/30/2020 at 12:47 AM, Geoff Marshall said: interested to know if it’s comparable to the old Agfa film Very much. Maybe it's the same recipe actually, seeing that Adox has the quite a bit of IP (including emulsion recipes) from AGFA. It's the same film as Silvermax 100, the different ISO is because the film has different ISO when processed as negative or positive. Also, what will be defining for the quality you get, is the processing. A lab with experience at B&W reversal (not many left) will give excellent results. Another good option that reverses very well, is Fomapan R100. You can even get a reversal kit to do it yourself. Foma's reversal kit also works for Scala, by slightly adjusting the first dev time.", "link": "https://www.l-camera-forum.com/topic/310100-anyone-used-adox-scala-film/?tab=comments#comment-4000245", "origin": "L-forum", "suborigin": "310100-anyone-used-adox-scala-film", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "on 5/30/2020 at 12:47 am, geoff marshall said: interested to know if it’s comparable to the old agfa film very much. maybe it's the same recipe actually, seeing that adox has the quite a bit of ip (including emulsion recipes) from agfa. it's the same film as silvermax 100, the different iso is because the film has different iso when processed as negative or positive. also, what will be defining for the quality you get, is the processing. a lab with experience at b&w reversal (not many left) will give excellent results. another good option that reverses very well, is fomapan r100. you can even get a reversal kit to -----> do !!!  -----> it !!!  -----> yourself !!! . foma's reversal kit also works for scala, by slightly adjusting the first dev time.", "sortedWord": "None", "Identifyer": null, "identifyer": 100415, "year": "2020"}, {"autor": "Einst_Stein", "date": "2020-02-12 15:45:00", "content": " It looks normal to me. The best way to clear your doubt is to send him some other films, such as Tmax or Delta. If the difference is consistent, then it is his style. It is hard to say it is a flaw. If you don’t like, find other developer or do it yourself. My experiences, non-c41 B&W is hard to satisfy by the photo lab, it has too much personality. Only you know what you want. Better to do it yourself. Otherwise you have to live with a consistent developer and take it as part of the given variables to adjust your shooting. Or simply use C41 B&W to reduce the processing variations.", "link": "https://www.l-camera-forum.com/topic/305288-too-much-grain/page/4/?tab=comments#comment-3911654", "origin": "L-forum", "suborigin": "305288-too-much-grain", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": " it looks normal to me. the best way to clear your doubt is to send him some other films, such as tmax or delta. if the difference is consistent, then it is his style. it is hard to say it is a flaw. if you -----> do !!! n’t like, find other developer or -----> do !!!  -----> it !!!  -----> yourself !!! . my experiences, non-c41 b&w is hard to satisfy by the photo lab, it has too much personality. only you know what you want. better to do it yourself. otherwise you have to live with a consistent developer and take it as part of the given variables to adjust your shooting. or simply use c41 b&w to reduce the processing variations.", "sortedWord": "None", "Identifyer": null, "identifyer": 101618, "year": "2020"}, {"autor": "Stuart Richardson", "date": "2020-03-05 20:43:00", "content": " Yes. I think my view is skewed as well as I do it professionally. Making darkroom prints for others can be a chore. Doing it yourself as a hobby (or even for your art) can be really rewarding. It is nice that you are on your feet instead of at a computer, but it is easier to work with a client next to you to get the work exactly how they like it ahead of time with digital, and it is also easier to do that kind of work up front, and then do the actual printing part without needing to pay quite so much attention, while you are doing other tasks. Repeat jobs and reprints are also a million times easier, so if you are doing editions, or if the framer damages a print, or even if someone comes back a few years later and wants more, it is very easy to do a nearly perfect reproduction. With film it means starting from scratch every time, unless you take very scrupulous notes for every print and every job.", "link": "https://www.l-camera-forum.com/topic/307115-film-photography-has-found-its-feet-again/?tab=comments#comment-3925409", "origin": "L-forum", "suborigin": "307115-film-photography-has-found-its-feet-again", "result": true, "Selector": "doing it yourself", "selectorShort": "yourself", "MarkedSent": " yes. i think my view is skewed as well as i do it professionally. making darkroom prints for others can be a chore. -----> doing !!!  -----> it !!!  -----> yourself !!!  as a hobby (or even for your art) can be really rewarding. it is nice that you are on your feet instead of at a computer, but it is easier to work with a client next to you to get the work exactly how they like it ahead of time with digital, and it is also easier to do that kind of work up front, and then do the actual printing part without needing to pay quite so much attention, while you are doing other tasks. repeat jobs and reprints are also a million times easier, so if you are doing editions, or if the framer damages a print, or even if someone comes back a few years later and wants more, it is very easy to do a nearly perfect reproduction. with film it means starting from scratch every time, unless you take very scrupulous notes for every print and every job.", "sortedWord": "None", "Identifyer": null, "identifyer": 101665, "year": "2020"}, {"autor": "ianman", "date": "2020-01-02 13:11:00", "content": "2 minutes ago, andybarton said: Would you rather the forum compresses and resizes you’re photographs rather than do it yourself, with complete control? If it automatically resizes to the max allowed what other control could the user have?", "link": "https://www.l-camera-forum.com/topic/304962-request-one-click-photo-upload-capability-to-luf/page/2/?tab=comments#comment-3883624", "origin": "L-forum", "suborigin": "304962-request-one-click-photo-upload-capability-to-luf", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "2 minutes ago, andybarton said: would you rather the forum compresses and resizes you’re photographs rather than -----> do !!!  -----> it !!!  -----> yourself !!! , with complete control? if it automatically resizes to the max allowed what other control could the user have?", "sortedWord": "None", "Identifyer": null, "identifyer": 117157, "year": "2020"}, {"autor": "firoze", "date": "2020-01-02 13:13:00", "content": "Just now, andybarton said: Would you rather the forum compresses and resizes you’re photographs rather than do it yourself, with complete control? Andy, the solution is to use the FB system. One can either upload one-click, in which case the image is of good but not best quality, or if one wanted best quality then one could manually resize the image to 2048p in which case FB would not tamper with the file. However, unlike LUF, on FB there is no file size constraint, so it is easy to resize.", "link": "https://www.l-camera-forum.com/topic/304962-request-one-click-photo-upload-capability-to-luf/page/2/?tab=comments#comment-3883627", "origin": "L-forum", "suborigin": "304962-request-one-click-photo-upload-capability-to-luf", "result": true, "Selector": "do it yourself", "selectorShort": "yourself", "MarkedSent": "just now, andybarton said: would you rather the forum compresses and resizes you’re photographs rather than -----> do !!!  -----> it !!!  -----> yourself !!! , with complete control? andy, the solution is to use the fb system. one can either upload one-click, in which case the image is of good but not best quality, or if one wanted best quality then one could manually resize the image to 2048p in which case fb would not tamper with the file. however, unlike luf, on fb there is no file size constraint, so it is easy to resize.", "sortedWord": "None", "Identifyer": null, "identifyer": 117159, "year": "2020"}], "name": "Leicasortedout2020yourself"}