{"interestingcomments": [{"autor": "rramesh", "date": "2021-07-13 05:33:00", "content": "Great bag. Comes in various colors. Designed to protect the camera from rain. Works well in Singapore where it rains every other day. https://www.amazon.com/Billingham-Hadley-Canvas-Chocolate-Leather/dp/B08JDYY7ZC/ref=sr_1_1?dchild=1&keywords=billingham+hadley+small&qid=1626154256&sr=8-1", "link": "https://www.l-camera-forum.com/topic/322676-looking-for-a-small-travel-bag-for-a-m10-preferably-available-from-amazon-with-bh-being-second-choice/?tab=comments#comment-4237203", "origin": "L-forum", "suborigin": "322676-looking-for-a-small-travel-bag-for-a-m10-preferably-available-from-amazon-with-bh-being-second-choice", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "great bag. comes in various colors. -----> designed !!!  to protect the camera from rain. works well in singapore where it rains every other day. https://www.amazon.com/billingham-hadley-canvas-chocolate-leather/dp/b08jdyy7zc/ref=sr_1_1?dchild=1&keywords=billingham+hadley+small&qid=1626154256&sr=8-1", "sortedWord": "None", "Identifyer": null, "identifyer": 6695, "year": "2021"}, {"autor": "jonoslack", "date": "2021-10-06 13:14:00", "content": " I recently wrote about the new 35mm APO Summicron M and before that about the SL Summicron lenses. It occurred to me that I hadn't written about any of the other APO M lenses, and as the 75 has been my favourite M lens for many years, I thought it would be a good idea to rectify the situation. There are currently 5 such lenses which have all appeared since 1998 (there were several APO R lenses before that, but they were all telephoto designs). APO Summicron M 90 f2 1998 APO Telyt M 135 f3.4 1998 APO Summicron M 75mm f2 2005 APO Summicron M 50mm f2 2012 APO Summicron M 35mm f2 2021 I bought my 75mm around 2007, shortly after buying my M8 and it's still in frequent use today. I also have the 50mm which I bought on release and am now the proud possessor of the 35mm. Leica were kind enough to loan me the 90 and 135mm lenses for this article. For more sample images and articles you can visit Jonos website: www.slack.co.uk --img--  May the Force be with you (Botallack, Cornwall 2016) Leica M10 with 50 APO M 1/1000 ISO 100 APO Lenses So, what exactly is an APO lens? The truth is that it's rather a vague term and not to be confused with Apochromatic, which isn't vague at all! Longitudinal Chromatic Aberrations occur when different colours focus at different distances from a lens and cause colour fringing around high contrast edges. An Achromatic lens is one which is corrected to ensure that two wavelengths of light focus in the same plane - an Apochromatic lens is where 3 wavelengths of light focus on the same plane. This is well and good, but it doesn't cover the bokeh, so although it's relevant where an image is completely in focus, it isn't when it's not. --img--  Joel Meyerowitz at the launch of the M10 (Wetzlar 2017) Leica M10 with 50 APO M 1/90 ISO 400 f2.8 With Leica's APO lenses chromatic aberrations are reduced by the use of low dispersion glass elements in the lens design. The intention is to reduce chromatic aberration in all areas, both in focus and out of focus. As more APO lenses have appeared they have refined the design, so that they have become more and more successful, culminating in the SL Summicron lenses and the new 35 APO Summicron M. --img--  Vroom (Young riders in Xingping in 2012) Leica M9 Monochrom with 75 APO M 1/180 ISO 1250 f4.8 So for practical purposes we might define an APO lens as one which contains one or more low dispersion glass elements. Indeed Leica has made this statement: Apochromatic and more The prefix ‘APO’ in the name denotes Leica lenses with the best imaging performance. From telephotos to wide-angles, all Summicron-SL lenses in the SL-System portfolio bear these coveted three letters before their names. For a long time, this distinction was reserved exclusively for telephoto lenses, as only they could achieve the exceptional quality required. It is now over 40 years since the first APO lens built by Leica made its appearance – the APO-TELYT-R 180 mm f/3.4, in 1975. In 2012, the APO-Summicron-M 50 mm f/2 ASPH. became the first standard lens to bear this prestigious prefix. --img--  Making a Splash (Glykanera, Crete, September 2009) Leica M9 with 75 APO M 1/160 ISO 350 Thanks to technological progress, more complex construction and new manufacturing methods employed in the SL-System, the design engineers were able to perfectly maximise the optical performance. To us at Leica, APO means more than just the correction of longitudinal chromatic aberration, for which the purely scientific definition of the term ‘apochromatic’ stands. This is emphasising that the Leica APO lenses (at least the modern ones) aim to remove chromatic aberrations completely. --img--  Peter Karbe, Leica (Wetzlar 2018) Leica M10 with 75 APO M 1/350 ISO 200 f2.4 But this is not just about Chromatic aberration, as Peter Karbe explained to me, the lack of aberrations results in much more contrast at the point of focus than in an ordinary lens, and that this contrast falls off very quickly in front and behind the point of focus. This means that an f2 lens can appear to have the same depth of field as an f1.4 lens (or even less in the case of the 75 f1.4 compared to the 75 f2 M lens). --img--  Waiter at the Blue House, Loutro (Crete 2015) Leica SL with 75 APO M 1/80 ISO 125 f2 I think that this rapid fall-off of contrast confers a special look on the Leica APO lenses, which are very detailed when in focus, but with a quick roll-off into gentle bokeh: Indeed, I think the whole look is 'gentle', the in-focus area, although showing a lot of detail doesn't have that 'crunchy' look that many older lenses have when stopped down. To Summarise Leica's definition of an APO lens seems to be, quite simply, one which utilises low dispersion glass in construction with the intention of reducing chromatic aberrations, both in focus and out of focus. Reducing the aberrations increases contrast noticeably when in focus, which has the visual effect of simulating a narrower depth of field, because the contrast drops sharply as focus is lost. This has allowed them to produce a range of f2 lenses which have the apparent depth of field of faster lenses, this in turn allows the lenses to be smaller and lighter and makes it possible to make them very high quality, they are however extremely difficult to manufacture, which explains why they are so expensive. --img--  Fags and Fingers (China 2012) Leica M9 Monochrom with 75 APO M 1/125 ISO 320 f2.8 Focusing There is quite a lot of information about difficulties focusing the 90 APO on the internet, but nothing about issues with the other APO lenses, even, the 135 APO Telyt. I was a little surprised by this, and so I thought I’d do some proper testing, not just close up, but at a range of distances. The results were enlightening. Of course it’s possible that there was a specific problem with my 90mm APO, but I don’t think so as I've checked it out with other owners who have similar issues. For the testing I used my M10-R together with the Visoflex EVF, focusing with the rangefinder and then checking it in the EVF. 135 mm APO Telyt This is a long focal length for rangefinder focusing, and the frame lines are correspondingly small, but in actual use I found it’s perfectly possible, even at f3.4. Focusing was straightforward and accurate all the way from the minimum focus distance (1.5 metre) to infinity. Stopping down mostly extends the area in focus beyond the point of accurate focus, but it also extends it towards the camera. 90mm APO Summicron This feels like it was designed principally for portraits, it focuses accurately using the rangefinder up to about 4 or 5 metres, even at f2. Stopping down does keep the original focus point in focus, but the in-focus area extends beyond that point, close to the camera remains out of focus. By 30 metres I found it was back-focusing by 2 or 3 metres. So that when I focused on a car number plate 30 metres away using the rangefinder, and then checked in the EVF, the point of accurate focus was 2 or 3 metres closer. --img--  Helen's Purple Poppy (Middle Fen Cottage, June 2021) Leica SL2 with 90 APO M 1/5000 ISO 100 f2.4 However, it's worth mentioning in this context that the 90 APO was designed more than 20 years ago, well before the days of digital M cameras and many of the lenses 'out in the wild' are probably quite old, some may have been calibrated to specific cameras (which may have had poorly calibrated rangefinders). It's hardly surprising that they should be out a bit. Probably if one was to buy a new one it would be much closer to correct. As an interesting historical aside, the first of the 90 APO lenses were manufactured in Canada and around 50 produced. However, making the lens elements proved too challenging and in 1998 it was decided to move production to Solms. 75, 50 and 35 APO Summicron These lenses all have a floating element, and as you would expect focusing is accurate and manageable at all distances (and all f stops), with the area in focus extending both forwards and backwards when stopping down. --img--  Keith doing his Marlon Brando impersonation (Dunwich, June 2021) Leica M10-R with 35 APO M 1/60 ISO 100 f5.6 Image Quality I've seen a tendency on the internet chatrooms to refer to the modern Leica lenses, and especially the APO lenses as 'clinical' or 'sterile', whereas vintage and older lenses are described as 'artistic'. To me that sounds like it's better to paint a picture with a 50 year old paintbrush! Which doesn't mean for a second that I don't recognise the charm and character of lots of older lenses, but it's a funny old world where 'clinical' = good and 'artistic' = not so good! --img--  Clint & his Moll; Dotty (Middle Fen Cottage March 2021) Leica M10-R with 35 APO M 1/4000 ISO 100 f2 The modern APO M lenses are far from lacking character; they have wonderful bokeh, and fantastic detail when in focus, what's more they don't have the 'crunchy' look that many older lenses have when stopped down. All 5 of these lenses produce wonderful images, right from the widest aperture, there is no need to stop down to improve quality. What's more the drawing of the lens doesn't change when you do stop down. --img--  Vespa Man (Gunton Arms September 2020) Leica M10-R with 35 APO M 1/1000 ISO 100 f2.4 In addition they all work really well on the SL family of cameras, the 90mm in particular is better on the SL (or with an EVF on an M) because of the difficulty in focusing at distance with the rangefinder. But the important thing for me is that all 5 lenses draw consistently, which means that if you're shooting a wedding or a holiday or just a walk with the dog, then you can swap between different APO M lenses without radically changing the look. Conclusion Lets face it, in this digital age with very acceptable high ISO fast lenses are not needed for their light gathering properties, and whilst it might be fun to shoot at f1.4, the tiny depth of field makes it a risky undertaking if you're shooting something that matters. Designing and manufacturing extremely fast lenses inevitably requires some compromises and they generally need to be stopped down before reaching peak performance. --img--  Busted! (Cambridge Folk Festival July 2019) Leica M10-R with 50 APO M 1/250 ISO 100 f2 Even though the Leica APO lenses have a greater depth of field than faster lenses, the rapid contrast fall-off as the lens goes out of focus makes the lens look faster than it is with better bokeh. By giving up on the bragging rights of very fast lenses Leica APO lenses perform perfectly from the widest aperture. --img--  Stop! (Central Italy May 2016) Leica M10-R with 50 APO M 1/250 ISO 100 f2 All these lenses are fantastic quality, with the 50 and 35 being particularly special. I think they have real character, and what's more it's a character born of modern technical innovation, not one which is a function of out of date design or technical shortcomings. Whilst most companies are pursuing the goal of faster and faster prime lenses which are growing larger and larger as a result, Leica have quietly brought out a range of smaller higher quality lenses. --img--  Matty (Middle Fen Cottage May 2019) Leica SL2 with 75 APO M 1/60 ISO 6400 f2 --img--  Closest Focus with the various APO M lenses For the 35 APO I've shown both the rangefinder limit (0.7 metre) and the 0.3 metre needing EVF or Live View Each image represents the whole of the frame --img--  The Lenses (Middle Fen Cottage June 2021) Leica SL2 with 75 APO Summicron SL 1/160 ISO 1250 f2 --img--  Lust (The Birmingham and Worcester Canal 2021) Leica M10-R with 35 APO M 1/60 ISO 100 f4.8 Acknowledgements Peter Karbe for checking an earlier draft of this article. Stefan Daniel for arranging the loan of the 90 and 135 and for all his help. Peter Farnz and Andy Piper from the Leica User forum for really helpful discussions about what an APO lens really is (or isn't)!", "link": "https://www.l-camera-forum.com/topic/325136-jonathan-slack-leica-apo-m-lenses/?tab=comments#comment-4287475", "origin": "L-forum", "suborigin": "325136-jonathan-slack-leica-apo-m-lenses", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": " i recently wrote about the new 35mm apo summicron m and before that about the sl summicron lenses. it occurred to me that i hadn't written about any of the other apo m lenses, and as the 75 has been my favourite m lens for many years, i thought it would be a good idea to rectify the situation. there are currently 5 such lenses which have all appeared since 1998 (there were several apo r lenses before that, but they were all telephoto designs). apo summicron m 90 f2 1998 apo telyt m 135 f3.4 1998 apo summicron m 75mm f2 2005 apo summicron m 50mm f2 2012 apo summicron m 35mm f2 2021 i bought my 75mm around 2007, shortly after buying my m8 and it's still in frequent use today. i also have the 50mm which i bought on release and am now the proud possessor of the 35mm. leica were kind enough to loan me the 90 and 135mm lenses for this article. for more sample images and articles you can visit jonos website: www.slack.co.uk --img--  may the force be with you (botallack, cornwall 2016) leica m10 with 50 apo m 1/1000 iso 100 apo lenses so, what exactly is an apo lens? the truth is that it's rather a vague term and not to be confused with apochromatic, which isn't vague at all! longitudinal chromatic aberrations occur when different colours focus at different distances from a lens and cause colour fringing around high contrast edges. an achromatic lens is one which is corrected to ensure that two wavelengths of light focus in the same plane - an apochromatic lens is where 3 wavelengths of light focus on the same plane. this is well and good, but it doesn't cover the bokeh, so although it's relevant where an image is completely in focus, it isn't when it's not. --img--  joel meyerowitz at the launch of the m10 (wetzlar 2017) leica m10 with 50 apo m 1/90 iso 400 f2.8 with leica's apo lenses chromatic aberrations are reduced by the use of low dispersion glass elements in the lens design. the intention is to reduce chromatic aberration in all areas, both in focus and out of focus. as more apo lenses have appeared they have refined the design, so that they have become more and more successful, culminating in the sl summicron lenses and the new 35 apo summicron m. --img--  vroom (young riders in xingping in 2012) leica m9 monochrom with 75 apo m 1/180 iso 1250 f4.8 so for practical purposes we might define an apo lens as one which contains one or more low dispersion glass elements. indeed leica has made this statement: apochromatic and more the prefix ‘apo’ in the name denotes leica lenses with the best imaging performance. from telephotos to wide-angles, all summicron-sl lenses in the sl-system portfolio bear these coveted three letters before their names. for a long time, this distinction was reserved exclusively for telephoto lenses, as only they could achieve the exceptional quality required. it is now over 40 years since the first apo lens built by leica made its appearance – the apo-telyt-r 180 mm f/3.4, in 1975. in 2012, the apo-summicron-m 50 mm f/2 asph. became the first standard lens to bear this prestigious prefix. --img--  making a splash (glykanera, crete, september 2009) leica m9 with 75 apo m 1/160 iso 350 thanks to technological progress, more complex construction and new manufacturing methods employed in the sl-system, the design engineers were able to perfectly maximise the optical performance. to us at leica, apo means more than just the correction of longitudinal chromatic aberration, for which the purely scientific definition of the term ‘apochromatic’ stands. this is emphasising that the leica apo lenses (at least the modern ones) aim to remove chromatic aberrations completely. --img--  peter karbe, leica (wetzlar 2018) leica m10 with 75 apo m 1/350 iso 200 f2.4 but this is not just about chromatic aberration, as peter karbe explained to me, the lack of aberrations results in much more contrast at the point of focus than in an ordinary lens, and that this contrast falls off very quickly in front and behind the point of focus. this means that an f2 lens can appear to have the same depth of field as an f1.4 lens (or even less in the case of the 75 f1.4 compared to the 75 f2 m lens). --img--  waiter at the blue house, loutro (crete 2015) leica sl with 75 apo m 1/80 iso 125 f2 i think that this rapid fall-off of contrast confers a special look on the leica apo lenses, which are very detailed when in focus, but with a quick roll-off into gentle bokeh: indeed, i think the whole look is 'gentle', the in-focus area, although showing a lot of detail doesn't have that 'crunchy' look that many older lenses have when stopped down. to summarise leica's definition of an apo lens seems to be, quite simply, one which utilises low dispersion glass in construction with the intention of reducing chromatic aberrations, both in focus and out of focus. reducing the aberrations increases contrast noticeably when in focus, which has the visual effect of simulating a narrower depth of field, because the contrast drops sharply as focus is lost. this has allowed them to produce a range of f2 lenses which have the apparent depth of field of faster lenses, this in turn allows the lenses to be smaller and lighter and makes it possible to make them very high quality, they are however extremely difficult to manufacture, which explains why they are so expensive. --img--  fags and fingers (china 2012) leica m9 monochrom with 75 apo m 1/125 iso 320 f2.8 focusing there is quite a lot of information about difficulties focusing the 90 apo on the internet, but nothing about issues with the other apo lenses, even, the 135 apo telyt. i was a little surprised by this, and so i thought i’d do some proper testing, not just close up, but at a range of distances. the results were enlightening. of course it’s possible that there was a specific problem with my 90mm apo, but i don’t think so as i've checked it out with other owners who have similar issues. for the testing i used my m10-r together with the visoflex evf, focusing with the rangefinder and then checking it in the evf. 135 mm apo telyt this is a long focal length for rangefinder focusing, and the frame lines are correspondingly small, but in actual use i found it’s perfectly possible, even at f3.4. focusing was straightforward and accurate all the way from the minimum focus distance (1.5 metre) to infinity. stopping down mostly extends the area in focus beyond the point of accurate focus, but it also extends it towards the camera. 90mm apo summicron this feels like it was designed principally for portraits, it focuses accurately using the rangefinder up to about 4 or 5 metres, even at f2. stopping down does keep the original focus point in focus, but the in-focus area extends beyond that point, close to the camera remains out of focus. by 30 metres i found it was back-focusing by 2 or 3 metres. so that when i focused on a car number plate 30 metres away using the rangefinder, and then checked in the evf, the point of accurate focus was 2 or 3 metres closer. --img--  helen's purple poppy (middle fen cottage, june 2021) leica sl2 with 90 apo m 1/5000 iso 100 f2.4 however, it's worth mentioning in this context that the 90 apo was designed more than 20 years ago, well before the days of digital m cameras and many of the lenses 'out in the wild' are probably quite old, some may have been calibrated to specific cameras (which may have had poorly calibrated rangefinders). it's hardly surprising that they should be out a bit. probably if one was to buy a new one it would be much closer to correct. as an interesting historical aside, the first of the 90 apo lenses were manufactured in canada and around 50 produced. however, making the lens elements proved too challenging and in 1998 it was decided to move production to solms. 75, 50 and 35 apo summicron these lenses all have a floating element, and as you would expect focusing is accurate and manageable at all distances (and all f stops), with the area in focus extending both forwards and backwards when stopping down. --img--  keith doing his marlon brando impersonation (dunwich, june 2021) leica m10-r with 35 apo m 1/60 iso 100 f5.6 image quality i've seen a tendency on the internet chatrooms to refer to the modern leica lenses, and especially the apo lenses as 'clinical' or 'sterile', whereas vintage and older lenses are described as 'artistic'. to me that sounds like it's better to paint a picture with a 50 year old paintbrush! which doesn't mean for a second that i don't recognise the charm and character of lots of older lenses, but it's a funny old world where 'clinical' = good and 'artistic' = not so good! --img--  clint & his moll; dotty (middle fen cottage march 2021) leica m10-r with 35 apo m 1/4000 iso 100 f2 the modern apo m lenses are far from lacking character; they have wonderful bokeh, and fantastic detail when in focus, what's more they don't have the 'crunchy' look that many older lenses have when stopped down. all 5 of these lenses produce wonderful images, right from the widest aperture, there is no need to stop down to improve quality. what's more the drawing of the lens doesn't change when you do stop down. --img--  vespa man (gunton arms september 2020) leica m10-r with 35 apo m 1/1000 iso 100 f2.4 in addition they all work really well on the sl family of cameras, the 90mm in particular is better on the sl (or with an evf on an m) because of the difficulty in focusing at distance with the rangefinder. but the important thing for me is that all 5 lenses draw consistently, which means that if you're shooting a wedding or a holiday or just a walk with the dog, then you can swap between different apo m lenses without radically changing the look. conclusion lets face it, in this digital age with very acceptable high iso fast lenses are not needed for their light gathering properties, and whilst it might be fun to shoot at f1.4, the tiny depth of field makes it a risky undertaking if you're shooting something that matters. -----> designing !!!  and manufacturing extremely fast lenses inevitably requires some compromises and they generally need to be stopped down before reaching peak performance. --img--  busted! (cambridge folk festival july 2019) leica m10-r with 50 apo m 1/250 iso 100 f2 even though the leica apo lenses have a greater depth of field than faster lenses, the rapid contrast fall-off as the lens goes out of focus makes the lens look faster than it is with better bokeh. by giving up on the bragging rights of very fast lenses leica apo lenses perform perfectly from the widest aperture. --img--  stop! (central italy may 2016) leica m10-r with 50 apo m 1/250 iso 100 f2 all these lenses are fantastic quality, with the 50 and 35 being particularly special. i think they have real character, and what's more it's a character born of modern technical innovation, not one which is a function of out of date design or technical shortcomings. whilst most companies are pursuing the goal of faster and faster prime lenses which are growing larger and larger as a result, leica have quietly brought out a range of smaller higher quality lenses. --img--  matty (middle fen cottage may 2019) leica sl2 with 75 apo m 1/60 iso 6400 f2 --img--  closest focus with the various apo m lenses for the 35 apo i've shown both the rangefinder limit (0.7 metre) and the 0.3 metre needing evf or live view each image represents the whole of the frame --img--  the lenses (middle fen cottage june 2021) leica sl2 with 75 apo summicron sl 1/160 iso 1250 f2 --img--  lust (the birmingham and worcester canal 2021) leica m10-r with 35 apo m 1/60 iso 100 f4.8 acknowledgements peter karbe for checking an earlier draft of this article. stefan daniel for arranging the loan of the 90 and 135 and for all his help. peter farnz and andy piper from the leica user forum for really helpful discussions about what an apo lens really is (or isn't)!", "sortedWord": "None", "Identifyer": null, "identifyer": 7600, "year": "2021"}, {"autor": "Guest", "date": "2021-02-20 08:24:00", "content": "Designed by Gustav Kleinberg & Otto Zimmermann https://www.l-camera-forum.com/leica-wiki.en/index.php/Gustav_Kleinberg Edited February 20 by Guest", "link": "https://www.l-camera-forum.com/topic/158389-summicron-collapsible-50mm/page/3/?tab=comments#comment-4145128", "origin": "L-forum", "suborigin": "158389-summicron-collapsible-50mm", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "-----> designed !!!  by gustav kleinberg & otto zimmermann https://www.l-camera-forum.com/leica-wiki.en/index.php/gustav_kleinberg edited february 20 by guest", "sortedWord": "None", "Identifyer": null, "identifyer": 18972, "year": "2021"}, {"autor": "Steven", "date": "2021-03-18 16:03:00", "content": "1 minute ago, shirubadanieru said: looking forward! Which are the remaining?contenders? lol By the way I was able to pick only one, at least for now & if I were to get a second one maybe it'd be the UC Hexanon which was my fav non leica lens alongside the rollei 40mm. Well, I suppose you will not be surprised to find out that in my potential \"Final 3\", there will be a guaranteed spot for: - The Summilux Pre Asph v1, aka Steel Rim. It earned a spot for its beautiful design and look, its classic Leica glow, its value as investment, as it has now entered the collectible category, and of course, it's the most compact lens I own. I cannot imagine ever parting with this lens. I'd be happy to be buried with it. - To complement the little Mandler gem mentioned just above, I am about to receive my latest acquisition, the Summilux Aspherical, aka, the 35AA. I haven't tried yet, but if the rumours are true, it will be a perfect \"modern alternative\" with IQ reaching the level of cine lenses, fine colour transitions, sharp in the center with a touch of Mandler around the frame, and of course, a low light beast. It is also know to have the most magic 3D pop effect we all love. As far as the investment value, no need to say that it's one of the most sought after lens for collectioners, and it's value has not stopped going up and should continue to reach astronomical prices. - The third and last lens, is almost the one in the title of this thread. The Nokton 35mm 1.4 MC 1, Silver limited edition. Only 250 copies around the world, it has already doubled in value since it came out. Design wise, it is an exact knockoff of the Steel Rim. In the way it renders, I place it somewhere between the FLE and the Pre Asph, but a little closer to the modern lens. As you might have understood, this will be my beat around lens. The one that is ok to lose if I really need to lose one, or the one that I take out when it's raining, or the one that I can be a little more careless with. It also has a second advantage for me: it is as compact as the steel rim, but much more usable at night if I find myself in a city environment. Love this little gem. What I like about this setup is that although three lenses of the same focal length can seem like a lot to some, it's not to me, and with these three lens, I know exactly when I need to take each one, and it saves me time choosing (and regretting) the lens I pick up in the morning. I'm getting closer to my Nirvana.", "link": "https://www.l-camera-forum.com/topic/317301-voigtlander-nokton-35mm-f14ii-or-ultron-35mm-f2/page/9/?tab=comments#comment-4163326", "origin": "L-forum", "suborigin": "317301-voigtlander-nokton-35mm-f14ii-or-ultron-35mm-f2", "result": true, "Selector": "design", "selectorShort": "design", "MarkedSent": "1 minute ago, shirubadanieru said: looking forward! which are the remaining?contenders? lol by the way i was able to pick only one, at least for now & if i were to get a second one maybe it'd be the uc hexanon which was my fav non leica lens alongside the rollei 40mm. well, i suppose you will not be surprised to find out that in my potential \"final 3\", there will be a guaranteed spot for: - the summilux pre asph v1, aka steel rim. it earned a spot for its beautiful design and look, its classic leica glow, its value as investment, as it has now entered the collectible category, and of course, it's the most compact lens i own. i cannot imagine ever parting with this lens. i'd be happy to be buried with it. - to complement the little mandler gem mentioned just above, i am about to receive my latest acquisition, the summilux aspherical, aka, the 35aa. i haven't tried yet, but if the rumours are true, it will be a perfect \"modern alternative\" with iq reaching the level of cine lenses, fine colour transitions, sharp in the center with a touch of mandler around the frame, and of course, a low light beast. it is also know to have the most magic 3d pop effect we all love. as far as the investment value, no need to say that it's one of the most sought after lens for collectioners, and it's value has not stopped going up and should continue to reach astronomical prices. - the third and last lens, is almost the one in the title of this thread. the nokton 35mm 1.4 mc 1, silver limited edition. only 250 copies around the world, it has already doubled in value since it came out. -----> design !!!  wise, it is an exact knockoff of the steel rim. in the way it renders, i place it somewhere between the fle and the pre asph, but a little closer to the modern lens. as you might have understood, this will be my beat around lens. the one that is ok to lose if i really need to lose one, or the one that i take out when it's raining, or the one that i can be a little more careless with. it also has a second advantage for me: it is as compact as the steel rim, but much more usable at night if i find myself in a city environment. love this little gem. what i like about this setup is that although three lenses of the same focal length can seem like a lot to some, it's not to me, and with these three lens, i know exactly when i need to take each one, and it saves me time choosing (and regretting) the lens i pick up in the morning. i'm getting closer to my nirvana.", "sortedWord": "None", "Identifyer": null, "identifyer": 23746, "year": "2021"}, {"autor": "shirubadanieru", "date": "2021-03-18 23:49:00", "content": "7 hours ago, Steven said: Well, I suppose you will not be surprised to find out that in my potential \"Final 3\", there will be a guaranteed spot for: - The Summilux Pre Asph v1, aka Steel Rim. It earned a spot for its beautiful design and look, its classic Leica glow, its value as investment, as it has now entered the collectible category, and of course, it's the most compact lens I own. I cannot imagine ever parting with this lens. I'd be happy to be buried with it. - To complement the little Mandler gem mentioned just above, I am about to receive my latest acquisition, the Summilux Aspherical, aka, the 35AA. I haven't tried yet, but if the rumours are true, it will be a perfect \"modern alternative\" with IQ reaching the level of cine lenses, fine colour transitions, sharp in the center with a touch of Mandler around the frame, and of course, a low light beast. It is also know to have the most magic 3D pop effect we all love. As far as the investment value, no need to say that it's one of the most sought after lens for collectioners, and it's value has not stopped going up and should continue to reach astronomical prices. - The third and last lens, is almost the one in the title of this thread. The Nokton 35mm 1.4 MC 1, Silver limited edition. Only 250 copies around the world, it has already doubled in value since it came out. Design wise, it is an exact knockoff of the Steel Rim. In the way it renders, I place it somewhere between the FLE and the Pre Asph, but a little closer to the modern lens. As you might have understood, this will be my beat around lens. The one that is ok to lose if I really need to lose one, or the one that I take out when it's raining, or the one that I can be a little more careless with. It also has a second advantage for me: it is as compact as the steel rim, but much more usable at night if I find myself in a city environment. Love this little gem. What I like about this setup is that although three lenses of the same focal length can seem like a lot to some, it's not to me, and with these three lens, I know exactly when I need to take each one, and it saves me time choosing (and regretting) the lens I pick up in the morning. I'm getting closer to my Nirvana. Nice to see the steel rim there : ) I was a bit torn between the Steel Rim and 8e for a while but I think the Steel Rim does everything the 8e does, while being slightly smaller (I think but might be wrong) and also looking better (external design wise), and it provides a unique rendering at f1.4 beyond the 8e capabilities. That being said, the 8e is great and right there behind it (and its value is also increasing tremendously). Interesting to see the Norton f1.4 silver limited edition, those are made by mapcamera here in Japan and do indeed look much better than the regular version. I just never get excited to shoot voigtlander lens that’s why I didn’t get it; I know they are great but if I have a Leica lens and a voigtlander lens I will always end up picking the Leica lens. But for the purposes you mentioned that makes sense to keep it for rougher situations. Also interesting to see that the APO Cron is not there, to be honest I don’t like any modern 35 from leica so I wouldn’t pick it but given that it’s the hot new item I thought you might still be in the honeymoon phase lol", "link": "https://www.l-camera-forum.com/topic/317301-voigtlander-nokton-35mm-f14ii-or-ultron-35mm-f2/page/9/?tab=comments#comment-4163606", "origin": "L-forum", "suborigin": "317301-voigtlander-nokton-35mm-f14ii-or-ultron-35mm-f2", "result": true, "Selector": "design", "selectorShort": "design", "MarkedSent": "7 hours ago, steven said: well, i suppose you will not be surprised to find out that in my potential \"final 3\", there will be a guaranteed spot for: - the summilux pre asph v1, aka steel rim. it earned a spot for its beautiful design and look, its classic leica glow, its value as investment, as it has now entered the collectible category, and of course, it's the most compact lens i own. i cannot imagine ever parting with this lens. i'd be happy to be buried with it. - to complement the little mandler gem mentioned just above, i am about to receive my latest acquisition, the summilux aspherical, aka, the 35aa. i haven't tried yet, but if the rumours are true, it will be a perfect \"modern alternative\" with iq reaching the level of cine lenses, fine colour transitions, sharp in the center with a touch of mandler around the frame, and of course, a low light beast. it is also know to have the most magic 3d pop effect we all love. as far as the investment value, no need to say that it's one of the most sought after lens for collectioners, and it's value has not stopped going up and should continue to reach astronomical prices. - the third and last lens, is almost the one in the title of this thread. the nokton 35mm 1.4 mc 1, silver limited edition. only 250 copies around the world, it has already doubled in value since it came out. -----> design !!!  wise, it is an exact knockoff of the steel rim. in the way it renders, i place it somewhere between the fle and the pre asph, but a little closer to the modern lens. as you might have understood, this will be my beat around lens. the one that is ok to lose if i really need to lose one, or the one that i take out when it's raining, or the one that i can be a little more careless with. it also has a second advantage for me: it is as compact as the steel rim, but much more usable at night if i find myself in a city environment. love this little gem. what i like about this setup is that although three lenses of the same focal length can seem like a lot to some, it's not to me, and with these three lens, i know exactly when i need to take each one, and it saves me time choosing (and regretting) the lens i pick up in the morning. i'm getting closer to my nirvana. nice to see the steel rim there : ) i was a bit torn between the steel rim and 8e for a while but i think the steel rim does everything the 8e does, while being slightly smaller (i think but might be wrong) and also looking better (external design wise), and it provides a unique rendering at f1.4 beyond the 8e capabilities. that being said, the 8e is great and right there behind it (and its value is also increasing tremendously). interesting to see the norton f1.4 silver limited edition, those are made by mapcamera here in japan and do indeed look much better than the regular version. i just never get excited to shoot voigtlander lens that’s why i didn’t get it; i know they are great but if i have a leica lens and a voigtlander lens i will always end up picking the leica lens. but for the purposes you mentioned that makes sense to keep it for rougher situations. also interesting to see that the apo cron is not there, to be honest i don’t like any modern 35 from leica so i wouldn’t pick it but given that it’s the hot new item i thought you might still be in the honeymoon phase lol", "sortedWord": "None", "Identifyer": null, "identifyer": 23747, "year": "2021"}, {"autor": "Stuart Richardson", "date": "2021-09-08 00:43:00", "content": "I think it is probably assuming that with long exposure the priority is for lower noise, rather than shorter exposure time. So once you start getting into times below the handheld threshold, it lowers the ISO back down to limit noise as it assumes you are using a tripod and doing a long exposure, most of which are better suited by lower ISO and longer time, versus increasing the ISO way up when the times are still long enough to require a tripod. Perhaps I am not explaining it well, but that might be how I would set up Auto ISO, if I were designing the system. But honestly, I do think the solution is just to do it manually...", "link": "https://www.l-camera-forum.com/topic/324312-auto-iso-and-long-exposure-times-with-sl2-s/?tab=comments#comment-4271476", "origin": "L-forum", "suborigin": "324312-auto-iso-and-long-exposure-times-with-sl2-s", "result": true, "Selector": "i were designing", "selectorShort": "design", "MarkedSent": "i think it is probably assuming that with long exposure the priority is for lower noise, rather than shorter exposure time. so once you start getting into times below the handheld threshold, it lowers the iso back down to limit noise as it assumes you are using a tripod and doing a long exposure, most of which are better suited by lower iso and longer time, versus increasing the iso way up when the times are still long enough to require a tripod. perhaps -----> i !!!  am not explaining it well, but that might be how -----> i !!!  would set up auto iso, if -----> i !!!  -----> were !!!  -----> designing !!!  the system. but honestly, i do think the solution is just to do it manually...", "sortedWord": "None", "Identifyer": null, "identifyer": 31661, "year": "2021"}, {"autor": "tharsh", "date": "2021-09-30 13:42:00", "content": "After 50 years of schlepping camera gear around from many manufacturers in many bags or hardcases I picked up the Q2 as my final camera. I have only had it a few weeks but it is what I now want for my photography. I am keeping some of my specialty systems like a mirrorless full frame with a prime 600 for wildlife and sports but the rest are all going. I now have more post imaging workflow but part of my transition is moving from having it all come out of the camera as a final to editing in a method of reflection allowing me to design or tune the image. So less images in total but more in which I am content having. And as far as the Q2 the images are simply amazing. At this point in time it has come down to sensor sensor sensor and of course the unassuming but simply marvelous matched lens. I am free from lens selection of which it never ends. I am free from camera stores and endless purchases. I may pick up the monochrome model also!", "link": "https://www.l-camera-forum.com/topic/324968-from-leica-m-system-to-leica-q2/?tab=comments#comment-4284157", "origin": "L-forum", "suborigin": "324968-from-leica-m-system-to-leica-q2", "result": true, "Selector": "me to design", "selectorShort": "design", "MarkedSent": "after 50 years of schlepping camera gear around from many manufacturers in many bags or hardcases i picked up the q2 as my final camera. i have only had it a few weeks but it is what i now want for my photography. i am keeping some of my specialty systems like a mirrorless full frame with a prime 600 for wildlife and sports but the rest are all going. i now have more post imaging workflow but part of my transition is moving from having it all come out of the camera as a final -----> to !!!  editing in a method of reflection allowing -----> me !!!  -----> to !!!  -----> design !!!  or tune the image. so less images in total but more in which i am content having. and as far as the q2 the images are simply amazing. at this point in time it has come down to sensor sensor sensor and of course the unassuming but simply marvelous matched lens. i am free from lens selection of which it never ends. i am free from camera stores and endless purchases. i may pick up the monochrome model also!", "sortedWord": "None", "Identifyer": null, "identifyer": 54446, "year": "2021"}, {"autor": "kentroberts", "date": "2021-09-30 14:46:00", "content": "1 hour ago, tharsh said: After 50 years of schlepping camera gear around from many manufacturers in many bags or hardcases I picked up the Q2 as my final camera. I have only had it a few weeks but it is what I now want for my photography. I am keeping some of my specialty systems like a mirrorless full frame with a prime 600 for wildlife and sports but the rest are all going. I now have more post imaging workflow but part of my transition is moving from having it all come out of the camera as a final to editing in a method of reflection allowing me to design or tune the image. So less images in total but more in which I am content having. And as far as the Q2 the images are simply amazing. At this point in time it has come down to sensor sensor sensor and of course the unassuming but simply marvelous matched lens. I am free from lens selection of which it never ends. I am free from camera stores and endless purchases. I may pick up the monochrome model also! I agree with thrash. I'm at a stage in life where more tools, more options, more decisions, isn't a benefit anymore. Others are at a different stage in their life/career so they may prefer to have many options, more power to them.", "link": "https://www.l-camera-forum.com/topic/324968-from-leica-m-system-to-leica-q2/?tab=comments#comment-4284182", "origin": "L-forum", "suborigin": "324968-from-leica-m-system-to-leica-q2", "result": true, "Selector": "me to design", "selectorShort": "design", "MarkedSent": "1 hour ago, tharsh said: after 50 years of schlepping camera gear around from many manufacturers in many bags or hardcases i picked up the q2 as my final camera. i have only had it a few weeks but it is what i now want for my photography. i am keeping some of my specialty systems like a mirrorless full frame with a prime 600 for wildlife and sports but the rest are all going. i now have more post imaging workflow but part of my transition is moving from having it all come out of the camera as a final -----> to !!!  editing in a method of reflection allowing -----> me !!!  -----> to !!!  -----> design !!!  or tune the image. so less images in total but more in which i am content having. and as far as the q2 the images are simply amazing. at this point in time it has come down to sensor sensor sensor and of course the unassuming but simply marvelous matched lens. i am free from lens selection of which it never ends. i am free from camera stores and endless purchases. i may pick up the monochrome model also! i agree with thrash. i'm at a stage in life where more tools, more options, more decisions, isn't a benefit anymore. others are at a different stage in their life/career so they may prefer to have many options, more power to them.", "sortedWord": "None", "Identifyer": null, "identifyer": 54449, "year": "2021"}, {"autor": "_Michael", "date": "2021-09-30 17:37:00", "content": "3 hours ago, tharsh said: After 50 years of schlepping camera gear around from many manufacturers in many bags or hardcases I picked up the Q2 as my final camera. I have only had it a few weeks but it is what I now want for my photography. I am keeping some of my specialty systems like a mirrorless full frame with a prime 600 for wildlife and sports but the rest are all going. I now have more post imaging workflow but part of my transition is moving from having it all come out of the camera as a final to editing in a method of reflection allowing me to design or tune the image. So less images in total but more in which I am content having. And as far as the Q2 the images are simply amazing. At this point in time it has come down to sensor sensor sensor and of course the unassuming but simply marvelous matched lens. I am free from lens selection of which it never ends. I am free from camera stores and endless purchases. I may pick up the monochrome model also! This is the path I am on, but with \"only\" 40 years give or take of schlepping. The Q2 is a remarkably capable camera. 28mm has become a better all-around focal length than I had thought prior to jumping into the original Q. I've pretty much always been a 35-50mm person but also still have a big Canon rig for long focal length. (but hate lugging it around). I recently acquired a Q2M and it's really incredible. It has opened my eyes to some new approaches and new satisfaction, and that's frankly a bit difficult to do sometimes. My in-head debate now is how I streamline and support color. For casual stuff, it's easy. The approximately 28mm 1x focal the iPhone Pro is pretty incredible. Not going make large prints with it of course, but more than capable for casual. For better results I am moving away from M (I think). The EVF advantages...especially with the lack of delay in the image...are solid, so it's a Q2 or stay with the SL I have and have flexibility. Yes, its bigger than the Q and a M body, but for me at 6'3\" and XL hands it is not significant. Currently a strong lean towards Q2 and calling it done. At least until I start arguing with myself again.", "link": "https://www.l-camera-forum.com/topic/324968-from-leica-m-system-to-leica-q2/?tab=comments#comment-4284271", "origin": "L-forum", "suborigin": "324968-from-leica-m-system-to-leica-q2", "result": true, "Selector": "me to design", "selectorShort": "design", "MarkedSent": "3 hours ago, tharsh said: after 50 years of schlepping camera gear around from many manufacturers in many bags or hardcases i picked up the q2 as my final camera. i have only had it a few weeks but it is what i now want for my photography. i am keeping some of my specialty systems like a mirrorless full frame with a prime 600 for wildlife and sports but the rest are all going. i now have more post imaging workflow but part of my transition is moving from having it all come out of the camera as a final -----> to !!!  editing in a method of reflection allowing -----> me !!!  -----> to !!!  -----> design !!!  or tune the image. so less images in total but more in which i am content having. and as far as the q2 the images are simply amazing. at this point in time it has come down to sensor sensor sensor and of course the unassuming but simply marvelous matched lens. i am free from lens selection of which it never ends. i am free from camera stores and endless purchases. i may pick up the monochrome model also! this is the path i am on, but with \"only\" 40 years give or take of schlepping. the q2 is a remarkably capable camera. 28mm has become a better all-around focal length than i had thought prior to jumping into the original q. i've pretty much always been a 35-50mm person but also still have a big canon rig for long focal length. (but hate lugging it around). i recently acquired a q2m and it's really incredible. it has opened my eyes to some new approaches and new satisfaction, and that's frankly a bit difficult to do sometimes. my in-head debate now is how i streamline and support color. for casual stuff, it's easy. the approximately 28mm 1x focal the iphone pro is pretty incredible. not going make large prints with it of course, but more than capable for casual. for better results i am moving away from m (i think). the evf advantages...especially with the lack of delay in the image...are solid, so it's a q2 or stay with the sl i have and have flexibility. yes, its bigger than the q and a m body, but for me at 6'3\" and xl hands it is not significant. currently a strong lean towards q2 and calling it done. at least until i start arguing with myself again.", "sortedWord": "None", "Identifyer": null, "identifyer": 54453, "year": "2021"}, {"autor": "jrp", "date": "2021-06-05 13:14:00", "content": "I’m all for accentuating the positive but even the remote trigger function is limited in usability. If you have pictures on your card, it will take a long time to scan them before you can remote shoot. Once you have shot, if you had the patience to get that far, the app will disconnect next time your camera or phone goes into lower power mode, forcing you to repeat the setup process. This is understandable since Wi-fi consumes battery. Wi-fi should not, however, be needed to set the gps or remote trigger. The Bluetooth connection should suffice for that. Designing the app so that it only used Wi-fi for transferring images to your phone would be clunky, but not as unusable as the current broken design.", "link": "https://www.l-camera-forum.com/topic/315206-leica-fotos-worst-app-ever-used/page/3/?tab=comments#comment-4214156", "origin": "L-forum", "suborigin": "315206-leica-fotos-worst-app-ever-used", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "i’m all for accentuating the positive but even the remote trigger function is limited in usability. if you have pictures on your card, it will take a long time to scan them before you can remote shoot. once you have shot, if you had the patience to get that far, the app will disconnect next time your camera or phone goes into lower power mode, forcing you to repeat the setup process. this is understandable since wi-fi consumes battery. wi-fi should not, however, be needed to set the gps or remote trigger. the bluetooth connection should suffice for that. -----> designing !!!  the app so that it only used wi-fi for transferring images to your phone would be clunky, but not as unusable as the current broken design.", "sortedWord": "None", "Identifyer": null, "identifyer": 33332, "year": "2021"}, {"autor": "wlaidlaw", "date": "2021-06-05 14:07:00", "content": "50 minutes ago, jrp said: I’m all for accentuating the positive but even the remote trigger function is limited in usability. If you have pictures on your card, it will take a long time to scan them before you can remote shoot. Once you have shot, if you had the patience to get that far, the app will disconnect next time your camera or phone goes into lower power mode, forcing you to repeat the setup process. This is understandable since Wi-fi consumes battery. Wi-fi should not, however, be needed to set the gps or remote trigger. The Bluetooth connection should suffice for that. Designing the app so that it only used Wi-fi for transferring images to your phone would be clunky, but not as unusable as the current broken design. I don't think the M10 series have Bluetooth, so the app has to be WiFi based. I think the SL and CL initialise via Bluetooth, which is why they are virtually instant connect, whereas Fotos on my M10-R takes about 35 seconds before it fires up on the app. Wilson", "link": "https://www.l-camera-forum.com/topic/315206-leica-fotos-worst-app-ever-used/page/3/?tab=comments#comment-4214171", "origin": "L-forum", "suborigin": "315206-leica-fotos-worst-app-ever-used", "result": true, "Selector": "designing", "selectorShort": "design", "MarkedSent": "50 minutes ago, jrp said: i’m all for accentuating the positive but even the remote trigger function is limited in usability. if you have pictures on your card, it will take a long time to scan them before you can remote shoot. once you have shot, if you had the patience to get that far, the app will disconnect next time your camera or phone goes into lower power mode, forcing you to repeat the setup process. this is understandable since wi-fi consumes battery. wi-fi should not, however, be needed to set the gps or remote trigger. the bluetooth connection should suffice for that. -----> designing !!!  the app so that it only used wi-fi for transferring images to your phone would be clunky, but not as unusable as the current broken design. i don't think the m10 series have bluetooth, so the app has to be wifi based. i think the sl and cl initialise via bluetooth, which is why they are virtually instant connect, whereas fotos on my m10-r takes about 35 seconds before it fires up on the app. wilson", "sortedWord": "None", "Identifyer": null, "identifyer": 33333, "year": "2021"}, {"autor": "Ambro51", "date": "2021-05-20 23:26:00", "content": "A TLR from the USA. I’ve not used this camera since the first roll, probably because of memories of hauling a bulky TLR years ago. .....a shame, I’ve not used it more, and Yes it does fully operate. This is the highest recorded serial number in the second series of Ansco Automatic Reflex Cameras. Designed by Henry Dreyfuss, a solid chunk for sure! --img-- ", "link": "https://www.l-camera-forum.com/topic/318752-nicht-immer-nur-kaviar-english-version/page/14/?tab=comments#comment-4204609", "origin": "L-forum", "suborigin": "318752-nicht-immer-nur-kaviar-english-version", "result": true, "Selector": "designed", "selectorShort": "design", "MarkedSent": "a tlr from the usa. i’ve not used this camera since the first roll, probably because of memories of hauling a bulky tlr years ago. .....a shame, i’ve not used it more, and yes it does fully operate. this is the highest recorded serial number in the second series of ansco automatic reflex cameras. -----> designed !!!  by henry dreyfuss, a solid chunk for sure! --img-- ", "sortedWord": "None", "Identifyer": null, "identifyer": 35061, "year": "2021"}, {"autor": "NZDavid", "date": "2021-01-18 03:40:00", "content": " Pages for Mac is excellent and does heaps. Like all software, it's quirky and takes a while to get what you want but it is very capable. There is plenty of online help available. We used Publisher for our association magazine in print and it's clunky; Pages is much neater. After our March lockdown, I re-designed the newsletter as an e-magazine in Pages. See: http://rtanz.co.nz. Edited January 18 by NZDavid", "link": "https://www.l-camera-forum.com/topic/317067-indesign-alternatives/?tab=comments#comment-4120381", "origin": "L-forum", "suborigin": "317067-indesign-alternatives", "result": true, "Selector": "i re-designed", "selectorShort": "design", "MarkedSent": " pages for mac is excellent and does heaps. like all software, it's quirky and takes a while to get what you want but it is very capable. there is plenty of online help available. we used publisher for our association magazine in print and it's clunky; pages is much neater. after our march lockdown, -----> i !!!  -----> re !!! -designed the newsletter as an e-----> - !!! magazine in pages. see: http://rtanz.co.nz. edited january 18 by nzdavid", "sortedWord": "None", "Identifyer": null, "identifyer": 109899, "year": "2021"}, {"autor": "Ambro51", "date": "2021-03-13 11:24:00", "content": " Wollensak was an old and respected firm, but only made ONE model still Camera. That was the Wollensak Stereo 10. It shared a body and many features with the Revere 33. It did have faster lenses, F 2.7, and also had a top shutter speed of 1/300. While alll stereo cameras back in the day we’re designed around Kodachrome film, this limits them today in many ways, since ASA 10 film is a distant memory. A Solid Camera with the smoothest operation imaginable! Focusing is beautifully handled by rotating the knob on the left top. It’s BIG! It kind of reminds me of a ‘50s Ocean Liner 😀 --img--  Edited March 13 by Ambro51", "link": "https://www.l-camera-forum.com/topic/318752-nicht-immer-nur-kaviar-english-version/page/4/?tab=comments#comment-4159599", "origin": "L-forum", "suborigin": "318752-nicht-immer-nur-kaviar-english-version", "result": false, "Selector": "we’re designed", "selectorShort": "design", "MarkedSent": "while alll stereo cameras back in the day we’re designed around kodachrome -----> film !!! , this limits them today in many ways, since asa 10 -----> film !!!  is a distant memory.", "sortedWord": "film", "Identifyer": null, "identifyer": 34858, "year": "2021"}, {"autor": "Sailronin", "date": "2021-11-10 18:43:00", "content": " MoPop detail. One of my favorite buildings to photograph in Seattle is the Museum of Popular Culture. Designed by Frank Gehry and Paul Allen this began as the Jimi Hendrix Museum and then expanded to cover all Rock and Roll and finally Popular Culture. The Seattle Monorail tracks run right through the building as seen here near the entrance. Leica MP with 90mm Summicron on Tri-X souped in HC110B --img--  Edited November 10 by Sailronin", "link": "https://www.l-camera-forum.com/topic/326399-seattle-museum-of-popular-culture/?tab=comments#comment-4310878", "origin": "L-forum", "suborigin": "326399-seattle-museum-of-popular-culture", "result": false, "Selector": "designed", "selectorShort": "design", "MarkedSent": "designed by frank gehry and paul allen this began as the jimi hendrix museum and then expanded to cover all rock and -----> roll !!!  and finally popular culture.", "sortedWord": "roll", "Identifyer": null, "identifyer": 54999, "year": "2021"}], "name": "Leicasortedout2021design"}