{"interestingcomments": [{"autor": "menos I M6", "date": "2013-11-15 01:28:00", "content": "Thanks Arvid! The site looks great, no need to be modest and I am looking forward, experimenting with the tool. It would be very helpful, to share some short tutorials about how to use the tool to convert files for people who usually do not dive deep into computers. How would I achieve to create a droplet for batch processing DNG files with the use of Apple script or Automator?", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/?tab=comments#comment-2465885", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "i achieve to create", "selectorShort": "create", "MarkedSent": "thanks arvid! the site looks great, no need to be modest and i am looking forward, experimenting with the tool. it would be very helpful, to share some short tutorials about how to use the tool to convert files for people who usually do not dive deep into computers. how would -----> i !!!  -----> achieve !!!  -----> to !!!  -----> create !!!  a droplet for batch processing dng files with the use of apple script or automator?", "sortedWord": "None", "Identifyer": null, "identifyer": 41511, "year": "2013"}, {"autor": "bla", "date": "2013-11-15 08:48:00", "content": "Hello Dirk, How would I achieve to create a droplet for batch processing DNG files with the use of Apple script or Automator? I am not familiar with Apple but on my system the following works: # global variable definitions global TheApp, Params # TheApp should point to the m8raw2dng executable on setTheApp() set TheApp to \"/Applications/m8raw2dng\" end setTheApp # Params are the Parameters you want to hand over to the script on setParams() set Params to \" -v -r -b -p -o /Users/YourName/Pictures\" end setParams # From here on leave it be on open filelist setTheApp() setParams() repeat with i in filelist tell application \"Terminal\" activate set filecount to 1 set filename to do shell script ¬ \"perl -e \\\"print quotemeta ('\" & POSIX path of i & \"');\\\"\" if (count of windows) is 0 then do script TheApp & \" -i \" & filename & \" \" & Params else do script TheApp & \" -i \" & filename & \" \" & Params in window 1 end if end tell end repeat end open set filecount to 0 if filecount < 1 then setTheApp() setParams() tell application \"Terminal\" do script TheApp end tell end if Just paste to AppleScript and save as application. You have to change the TheApp path and the Params according to your needs. The droplet is now available on the site for download and I posted a more detailed explanation. You can either put it into a folder containing RAW files and run it from there with double click or you can drag RAW files of your choice onto the icon. Is that working for you? Greetings, Arvid Edited November 15, 2013 by bla Forgot to explain :)", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/?tab=comments#comment-2466026", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "i achieve to create", "selectorShort": "create", "MarkedSent": "hello dirk, how would -----> i !!!  -----> achieve !!!  -----> to !!!  -----> create !!!  a droplet for batch processing dng files with the use of apple script or automator? i am not familiar with apple but on my system the following works: # global variable definitions global theapp, params # theapp should point to the m8raw2dng executable on settheapp() set theapp to \"/applications/m8raw2dng\" end settheapp # params are the parameters you want to hand over to the script on setparams() set params to \" -v -r -b -p -o /users/yourname/pictures\" end setparams # from here on leave it be on open filelist settheapp() setparams() repeat with i in filelist tell application \"terminal\" activate set filecount to 1 set filename to do shell script ¬ \"perl -e \\\"print quotemeta ('\" & posix path of i & \"');\\\"\" if (count of windows) is 0 then do script theapp & \" -i \" & filename & \" \" & params else do script theapp & \" -i \" & filename & \" \" & params in window 1 end if end tell end repeat end open set filecount to 0 if filecount < 1 then settheapp() setparams() tell application \"terminal\" do script theapp end tell end if just paste to applescript and save as application. you have to change the theapp path and the params according to your needs. the droplet is now available on the site for download and i posted a more detailed explanation. you can either put it into a folder containing raw files and run it from there with double click or you can drag raw files of your choice onto the icon. is that working for you? greetings, arvid edited november 15, 2013 by bla forgot to explain :)", "sortedWord": "None", "Identifyer": null, "identifyer": 41513, "year": "2013"}, {"autor": "bla", "date": "2013-11-15 10:18:00", "content": "Just downloaded the Windows version. After a reset to look in folder 102LEICA instead of 100LEICA, the program converted the images as advertised in Windows 7. And the DNG files opens nicely in Adobe CS6. All good! --img--  Hi Erik, nice to hear! Of course the 100LEICA was just an example. One has to take whatever folder the RAW files are stored. I created a batch file for windows easing the use of the tool and I will upload it right now. You might want to try it. Greetings, Arvid", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/?tab=comments#comment-2466072", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "just downloaded the windows version. after a reset to look in folder 102leica instead of 100leica, the program converted the images as advertised in windows 7. and the dng files opens nicely in adobe cs6. all good! --img--  hi erik, nice to hear! of course the 100leica was just an example. one has to take whatever folder the raw files are stored. -----> i !!!  -----> created !!!  a batch file for windows easing the use of the tool and -----> i !!!  will upload it right now. you might want to try it. greetings, arvid", "sortedWord": "None", "Identifyer": null, "identifyer": 41515, "year": "2013"}, {"autor": "bla", "date": "2013-11-18 06:35:00", "content": "Hello and thanks for your comments, I will not quote all of your posts but try to address the issues generally. I'll create a parameter for the model in exif so everyone can decide for themselves. I just noticed when using LR5 it gives you one additional color profile to choose from, namely embedded. I can see no other drawbacks, but I can change this. Dead pixels, hot pixels can and will be fixed so I advise you to not delete the RAW+JPG pairs yet. --img--  As of now there have not been any surprising issues for me that I wasn't aware of. I was mainly focusing on the color cast but seems like some sort of pixel fixing is on your wishlist. I have two main issues here: 1.) anyone got an idea on how to acquire a test image where the defects nicely and reliably show? 2.) I do not like the idea of having to create a GUI driven pixel fixer because that'd be a whole project of its own, especially as I'm supporting Windows, Mac & Linux. SO i guess it'll be something like \"open the DNG in a viewer, look for coordinates of defect pixels and put them in a file named like your m8 serial or something similar. Cool thing would be you wouldn't have to send the camera to Solms if a new defect appears... But as I said I couldn't take a photo yet where it really shows so advice is needed. I am surprised that you are happy with ISO results as I exclusively shoot at 160. I have to write the article to explain things... Last I want to mention that Brian at leicaplace.com has done some similar tests and was also quite content. I invite you to post images where an improvement is seen as there are many sceptics that have to see proofs rather than testing it for themselves... Especially since the acquisition of an image is a little more complicated. Btw does the longer write time bother you? last: keep the bia file please for now. it's the black image acquisition and is taken for shutter speeds longer than 1/15s or so. I don't use it yet. If you want to explore the content, rename the bia to raw and run it through the converter (using the same jpg) Have fun and share the information! Arvid", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/2/?tab=comments#comment-2468077", "origin": "L-forum", "suborigin": "216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng", "result": true, "Selector": "i'll create", "selectorShort": "create", "MarkedSent": "hello and thanks for your comments, i will not quote all of your posts but try to address the issues generally. -----> i !!! -----> 'll !!!  -----> create !!!  a parameter for the model in exif so everyone can decide for themselves. i just noticed when using lr5 it gives you one additional color profile to choose from, namely embedded. i can see no other drawbacks, but i can change this. dead pixels, hot pixels can and will be fixed so i advise you to not delete the raw+jpg pairs yet. --img--  as of now there have not been any surprising issues for me that i wasn't aware of. i was mainly focusing on the color cast but seems like some sort of pixel fixing is on your wishlist. i have two main issues here: 1.) anyone got an idea on how to acquire a test image where the defects nicely and reliably show? 2.) i do not like the idea of having to create a gui driven pixel fixer because that'd be a whole project of its own, especially as i'm supporting windows, mac & linux. so i guess it'll be something like \"open the dng in a viewer, look for coordinates of defect pixels and put them in a file named like your m8 serial or something similar. cool thing would be you wouldn't have to send the camera to solms if a new defect appears... but as i said i couldn't take a photo yet where it really shows so advice is needed. i am surprised that you are happy with iso results as i exclusively shoot at 160. i have to write the article to explain things... last i want to mention that brian at leicaplace.com has done some similar tests and was also quite content. i invite you to post images where an improvement is seen as there are many sceptics that have to see proofs rather than testing it for themselves... especially since the acquisition of an image is a little more complicated. btw does the longer write time bother you? last: keep the bia file please for now. it's the black image acquisition and is taken for shutter speeds longer than 1/15s or so. i don't use it yet. if you want to explore the content, rename the bia to raw and run it through the converter (using the same jpg) have fun and share the information! arvid", "sortedWord": "None", "Identifyer": null, "identifyer": 41545, "year": "2013"}, {"autor": "Michael Hiles", "date": "2013-11-17 19:27:00", "content": "I have occasionally used Ilford Lab Direct to have silver gelatin prints made from scanned negatives. The prints were identical to what I created on my screen. If you want a silver print - this works very well. It also allows for larger prints than I (and most people) want or can make in a home darkroom.", "link": "https://www.l-camera-forum.com/topic/215835-a-suitable-enlarger/?tab=comments#comment-2467818", "origin": "L-forum", "suborigin": "215835-a-suitable-enlarger", "result": true, "Selector": "i created", "selectorShort": "create", "MarkedSent": "i have occasionally used ilford lab direct to have silver gelatin prints made from scanned negatives. the prints were identical to what -----> i !!!  -----> created !!!  on my screen. if you want a silver print - this works very well. it also allows for larger prints than i (and most people) want or can make in a home darkroom.", "sortedWord": "None", "Identifyer": null, "identifyer": 107326, "year": "2013"}, {"autor": "Michael Hiles", "date": "2013-06-26 12:33:00", "content": "Many thanks Leonardo, Between Photoshop Elements and SIlver Efex Pro I can create a good file that should (I hope) print well without intervention. And Ilford's printing prices are quite good.", "link": "https://www.l-camera-forum.com/topic/207412-ilford-lab-direct/?tab=comments#comment-2359012", "origin": "L-forum", "suborigin": "207412-ilford-lab-direct", "result": true, "Selector": "i can create", "selectorShort": "create", "MarkedSent": "many thanks leonardo, between photoshop elements and silver efex pro -----> i !!!  -----> can !!!  -----> create !!!  a good file that should (-----> i !!!  hope) print well without intervention. and ilford's printing prices are quite good.", "sortedWord": "None", "Identifyer": null, "identifyer": 107369, "year": "2013"}, {"autor": "stunsworth", "date": "2013-04-16 09:33:00", "content": " I trust we've all got some excellent photos to select a winner from! What happens next is that you should send the images to the following email address - mail - at - steveunsworth.co.uk That's all one string, with ' - at - ' replaced with @ Photos should be of the size that's allowed in the forum - i.e. up to 1024 pixels on the longest side, and up to around 300k in size. If possible please remove any exif data from the photo you submit. Please also include the following details... Name Forum Name Camera Used Lens/Focal Length Used Film/ISO used Photo's Title - this is optional. You have until Sunday the 12th of May to submit them. I realise this is a long time, but I'm on holiday at the beginning of May. If I receive them all before I go on holiday I'll try to create the gallery used for judging before I go away. All the photos will be put in an online gallery, in a random order. Once that's been done the photos will be available for people to select their 1st, 2nd and 3rd choices. I'll add up all the points. and declare the winner.", "link": "https://www.l-camera-forum.com/topic/202746-second-seaside-challenge-what-happens-next/?tab=comments#comment-2300213", "origin": "L-forum", "suborigin": "202746-second-seaside-challenge-what-happens-next", "result": true, "Selector": "i'll try to create", "selectorShort": "create", "MarkedSent": " i trust we've all got some excellent photos to select a winner from! what happens next is that you should send the images to the following email address - mail - at - steveunsworth.co.uk that's all one string, with ' - at - ' replaced with @ photos should be of the size that's allowed in the forum - i.e. up to 1024 pixels on the longest side, and up to around 300k in size. if possible please remove any exif data from the photo you submit. please also include the following details... name forum name camera used lens/focal length used film/iso used photo's title - this is optional. you have until sunday the 12th of may to submit them. i realise this is a long time, but i'm on holiday at the beginning of may. if -----> i !!!  receive them all before -----> i !!!  go on holiday -----> i !!! -----> 'll !!!  -----> try !!!  -----> to !!!  -----> create !!!  the gallery used for judging before -----> i !!!  go away. all the photos will be put in an online gallery, in a random order. once that's been done the photos will be available for people to select their 1st, 2nd and 3rd choices. i'll add up all the points. and declare the winner.", "sortedWord": "None", "Identifyer": null, "identifyer": 136524, "year": "2013"}, {"autor": "markrune", "date": "2013-02-09 19:38:00", "content": "I have created a Flikr set with some of my photos Ipswich Leica Meet 2013 but a few More shots from today Hobbo with Leica --img--  In Chains --img--  Looking Down --img--  Photo Sniper --img--  Edited February 9, 2013 by markrune", "link": "https://www.l-camera-forum.com/topic/197192-meeting-in-ipswich-february-2013/page/3/?tab=comments#comment-2238281", "origin": "L-forum", "suborigin": "197192-meeting-in-ipswich-february-2013", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> have !!!  -----> created !!!  a flikr set with some of my photos ipswich leica meet 2013 but a few more shots from today hobbo with leica --img--  in chains --img--  looking down --img--  photo sniper --img--  edited february 9, 2013 by markrune", "sortedWord": "None", "Identifyer": null, "identifyer": 136619, "year": "2013"}, {"autor": "pragmatist", "date": "2013-02-09 20:05:00", "content": " I have created a Flikr set with some of my photos Ipswich Leica Meet 2013 If anyone can tell me how to insert into posts I would be grateful - Mark Hi Mark, In flickr you need to select your image and then click the share button above your image and copy the bc code. Go back to your forum thread and click and paste your bc code into the iimage tab, it's a square shaped box above your text, the forum help topics will point it out if you struggle to find it. Voila, your image will appear. You can preview just to be super sure before posting.", "link": "https://www.l-camera-forum.com/topic/197192-meeting-in-ipswich-february-2013/page/3/?tab=comments#comment-2238301", "origin": "L-forum", "suborigin": "197192-meeting-in-ipswich-february-2013", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": " -----> i !!!  -----> have !!!  -----> created !!!  a flikr set with some of my photos ipswich leica meet 2013 if anyone can tell me how to insert into posts -----> i !!!  would be grateful - mark hi mark, in flickr you need to select your image and then click the share button above your image and copy the bc code. go back to your forum thread and click and paste your bc code into the iimage tab, it's a square shaped box above your text, the forum help topics will point it out if you struggle to find it. voila, your image will appear. you can preview just to be super sure before posting.", "sortedWord": "None", "Identifyer": null, "identifyer": 136620, "year": "2013"}, {"autor": "valerio", "date": "2013-02-09 21:19:00", "content": "I have created a Flikr set with some of my photos Ipswich Leica Meet 2013 but a few More shots from today [...] Nice shots Mark! Valerio", "link": "https://www.l-camera-forum.com/topic/197192-meeting-in-ipswich-february-2013/page/3/?tab=comments#comment-2238376", "origin": "L-forum", "suborigin": "197192-meeting-in-ipswich-february-2013", "result": true, "Selector": "i have created", "selectorShort": "create", "MarkedSent": "-----> i !!!  -----> have !!!  -----> created !!!  a flikr set with some of my photos ipswich leica meet 2013 but a few more shots from today [...] nice shots mark! valerio", "sortedWord": "None", "Identifyer": null, "identifyer": 136623, "year": "2013"}], "name": "Leicasortedout2013create"}