{"interestingcomments": [{"autor": "jaapv", "date": "2010-04-24 22:52:00", "content": "No - clearly it isn't, and clearly you don't understand it either! The midpoint of focus is automatically set as the thread is a constant pitch on the lens. Bending the arm would move the roller, yes, but has nothing whatsoever to do with a routine rangefinder adjustment. No disrespect but there is a tremendous amount of work detailled in this thread - enough so that one could successfully adjust one's own rangefinder (as has been successfully done by 4 people I know of following the thread plus myself and carsten originally) Feel free to add to the knowledge base by backing up your claims with some graphs or other information but otherwise just leave it - it isn't helping at all and just makes you sound daft to the people who actually do understand how it works. Sorry, mate, you obviously don't know what you're talking about. A little knowledge is a dangerous thing....I suggest you read the official Leica M service books. You'll find the special \"bending tool\" there as well. Or even look at image #22 in Gunther Osterloh's book, where you can just make out the specific waist for bending purposes. Alternatively you could talk to any qualified Leica service technician. I'm sure he will be able to enhance your understanding. In a small way you are right, the bending is the setting that is rarely off in cameras that leave the factory and is the least likely to go out of adjustment. It is bad engineering too, imo, by the way.I'm happy for those that are satisfied by the results they had with this DIY, but I am concerned about unsuspecting readers following your example, completely throwing their rangefinder out of whack and voiding their guaranty in the process. Basically rangefinder adjustment is NOT an amateur job and best left to professionals. Edited April 24, 2010 by jaapv", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/5/?tab=comments#comment-1304646", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "no - clearly it isn't, and clearly you don't understand it either! the midpoint of focus is automatically set as the thread is a constant pitch on the lens. bending the arm would move the roller, yes, but has nothing whatsoever to do with a routine rangefinder adjustment. no disrespect but there is a tremendous amount of work detailled in this thread - enough so that one could successfully adjust one's own rangefinder (as has been successfully done by 4 people i know of following the thread plus myself and carsten originally) feel free to add to the knowledge base by backing up your claims with some graphs or other information but otherwise just leave it - it isn't helping at all and just makes you sound daft to the people who actually do understand how it works. sorry, mate, you obviously don't know what you're talking about. a little knowledge is a dangerous thing....i suggest you read the official leica m service books. you'll find the special \"bending tool\" there as well. or even look at image #22 in gunther osterloh's book, where you can just make out the specific waist for bending purposes. alternatively you could talk to any qualified leica service technician. i'm sure he will be able to enhance your understanding. in a small way you are right, the bending is the setting that is rarely off in cameras that leave the factory and is the least likely to go out of adjustment. it is bad engineering too, imo, by the way.i'm happy for those that are satisfied by the results they had with this -----> diy !!! , but i am concerned about unsuspecting readers following your example, completely throwing their rangefinder out of whack and voiding their guaranty in the process. basically rangefinder adjustment is not an amateur job and best left to professionals. edited april 24, 2010 by jaapv", "sortedWord": "None", "Identifyer": null, "identifyer": 30728, "year": "2010"}, {"autor": "giordano", "date": "2010-04-25 15:08:00", "content": "WRONG - It's the adjustment tool to allow you to hold the arm easier.<snip>WRONG - No bending here mate. <snip> That in fact you've misunderstood and you understand now that there are only 2 adjustments - length of arm and eccentric roller cam position, and that you confess to making up the third adjustment solely to make yourself look dead clever. According to the only factory manual I have (easily found on the internet), the thing is a bending tool and its purpose is to adjust the rangefinder by bending the arm. All that Jaap got wrong is precisely what this adjustment is for. In order for all lenses to couple accurately with the rangefinder, the axis of the roller cam must be precisely parallel with the axis of the shaft at the other end of the arm. If it isn't, there are two possible sources of inaccuracy, though I don't know which is more important. One is that as the arm rotates, the angle the roller presents to the rangefinder cam on the lens will change; the other is that the coupling will be different depending on the vertical position at which each lens's rangefinder cam contacts the roller. If the roller is exactly parallel with the shaft at the other end, both those factors are irrelevant. The official use of the bending tool is in conjunction with a special 3-position gauge that mimics a lens focused at 10m distance whose cam contacts the roller at top, centre and bottom of the roller's width. If the rangefinder image remains stationary as the gauge is moved between its three positions, this adjustment is correct. If it moves, the bending tool must be used. Clearly this is (a) unlikely to go out of adjustment in normal use and (--img--  not something one can adjust without a special gauge, so it's outside the scope of DIY rangefinder adjustment. I have no idea whether or not the bending tool is also useful when adjusting the arm length and roller cam. My source is the official Repair Training Program manual for \"Camera Set, Still Picture KS-15(4)\", a US military version of the M2 with M4 rapid loading takeup spool. The arm on my M8 looks exactly the same as the one in the diagrams in this manual. FWIW there are a total of five adjustment points in this part of the rangefinder, although only the two Julian has explored are likely to be needed in ordinary DIY work.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/5/?tab=comments#comment-1305260", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "wrong - it's the adjustment tool to allow you to hold the arm easier.<snip>wrong - no bending here mate. <snip> that in fact you've misunderstood and you understand now that there are only 2 adjustments - length of arm and eccentric roller cam position, and that you confess to making up the third adjustment solely to make yourself look dead clever. according to the only factory manual i have (easily found on the internet), the thing is a bending tool and its purpose is to adjust the rangefinder by bending the arm. all that jaap got wrong is precisely what this adjustment is for. in order for all lenses to couple accurately with the rangefinder, the axis of the roller cam must be precisely parallel with the axis of the shaft at the other end of the arm. if it isn't, there are two possible sources of inaccuracy, though i don't know which is more important. one is that as the arm rotates, the angle the roller presents to the rangefinder cam on the lens will change; the other is that the coupling will be different depending on the vertical position at which each lens's rangefinder cam contacts the roller. if the roller is exactly parallel with the shaft at the other end, both those factors are irrelevant. the official use of the bending tool is in conjunction with a special 3-position gauge that mimics a lens focused at 10m distance whose cam contacts the roller at top, centre and bottom of the roller's width. if the rangefinder image remains stationary as the gauge is moved between its three positions, this adjustment is correct. if it moves, the bending tool must be used. clearly this is (a) unlikely to go out of adjustment in normal use and (--img--  not something one can adjust without a special gauge, so it's outside the scope of -----> diy !!!  rangefinder adjustment. i have no idea whether or not the bending tool is also useful when adjusting the arm length and roller cam. my source is the official repair training program manual for \"camera set, still picture ks-15(4)\", a us military version of the m2 with m4 rapid loading takeup spool. the arm on my m8 looks exactly the same as the one in the diagrams in this manual. fwiw there are a total of five adjustment points in this part of the rangefinder, although only the two julian has explored are likely to be needed in ordinary diy work.", "sortedWord": "None", "Identifyer": null, "identifyer": 30735, "year": "2010"}, {"autor": "adli", "date": "2010-04-25 15:36:00", "content": "According to the only factory manual I have (easily found on the internet), the thing is a bending tool and its purpose is to adjust the rangefinder by bending the arm. All that Jaap got wrong is precisely what this adjustment is for. ..... My source is the official Repair Training Program manual for \"Camera Set, Still Picture KS-15(4)\", a US military version of the M2 with M4 rapid loading takeup spool. The arm on my M8 looks exactly the same as the one in the diagrams in this manual. FWIW there are a total of five adjustment points in this part of the rangefinder, although only the two Julian has explored are likely to be needed in ordinary DIY work. Talking about this manual: http://www.pentax-manuals.com/manuals/service/leica_m2_service.pdf", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/5/?tab=comments#comment-1305285", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "according to the only factory manual i have (easily found on the internet), the thing is a bending tool and its purpose is to adjust the rangefinder by bending the arm. all that jaap got wrong is precisely what this adjustment is for. ..... my source is the official repair training program manual for \"camera set, still picture ks-15(4)\", a us military version of the m2 with m4 rapid loading takeup spool. the arm on my m8 looks exactly the same as the one in the diagrams in this manual. fwiw there are a total of five adjustment points in this part of the rangefinder, although only the two julian has explored are likely to be needed in ordinary -----> diy !!!  work. talking about this manual: http://www.pentax-manuals.com/manuals/service/leica_m2_service.pdf", "sortedWord": "None", "Identifyer": null, "identifyer": 30737, "year": "2010"}, {"autor": "Julian Thompson", "date": "2010-04-26 07:46:00", "content": "Jaap. Please accept my apology. You are right and I was wrong. There is a bending tool - you are quite right. This does not alter the procedure for DIY adjustment - you don't bend anything to adjust the mid focus - actually bending that arm would only be necessary if for some reason the roller was not perpendicular to the lens - ie a manufacturing defect - it's a perpendicular adjustment of the roller, not a focussing one in the sense that we've been discussing here. So the instructions must be revised - you need to check to make sure the roller is exactly perpendicular to the lens mount before you begin. I have checked both my M's and the roller is exactly perpendicular.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/5/?tab=comments#comment-1305903", "origin": "L-forum", "suborigin": "118043-m9-coincidence-at-infinity", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "jaap. please accept my apology. you are right and i was wrong. there is a bending tool - you are quite right. this does not alter the procedure for -----> diy !!!  adjustment - you don't bend anything to adjust the mid focus - actually bending that arm would only be necessary if for some reason the roller was not perpendicular to the lens - ie a manufacturing defect - it's a perpendicular adjustment of the roller, not a focussing one in the sense that we've been discussing here. so the instructions must be revised - you need to check to make sure the roller is exactly perpendicular to the lens mount before you begin. i have checked both my m's and the roller is exactly perpendicular.", "sortedWord": "None", "Identifyer": null, "identifyer": 30743, "year": "2010"}, {"autor": "jaapv", "date": "2010-05-10 15:23:00", "content": "Just slightly moisten the blob of glue, it varies where Leica puts it. If you take it to a qualified repairman, he will do this whilst you wait. It is basically not worth it doing this as DIY. The tool will be far more expensive that the adjustment.", "link": "https://www.l-camera-forum.com/topic/120623-vertical-alignment-how-easy-to-do-it-yourself-with-tool/?tab=comments#comment-1319779", "origin": "L-forum", "suborigin": "120623-vertical-alignment-how-easy-to-do-it-yourself-with-tool", "result": true, "Selector": "diy", "selectorShort": "diy", "MarkedSent": "just slightly moisten the blob of glue, it varies where leica puts it. if you take it to a qualified repairman, he will do this whilst you wait. it is basically not worth it doing this as -----> diy !!! . the tool will be far more expensive that the adjustment.", "sortedWord": "None", "Identifyer": null, "identifyer": 44233, "year": "2010"}], "name": "Leicasortedout2010diy"}