{"interestingcomments": [{"Unnamed: 0": 206071, "autor": "darylgo", "date": 1600907040000, "content": "6 minutes ago, MyronLin said: Sunrising Elmar-M 1:3.8/24 ASPH Great shot with difficult lighting. What location is this?", "link": "https://www.l-camera-forum.com/topic/314837-m-10-r-image-thread/page/9/?tab=comments#comment-4051179", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "6 minutes ago, myronlin said: sunrising elmar-m 1:3.8/24 asph great shot with difficult lighting. what -----> location !!!  is this?", "sortedWord": "None", "identifyer": 99580, "year": "2020"}, {"Unnamed: 0": 206072, "autor": "MyronLin", "date": 1600956120000, "content": " 13 hours ago, darylgo said: Great shot with difficult lighting. What location is this? The spot is in Mt. Hehuan in Taiwan.", "link": "https://www.l-camera-forum.com/topic/314837-m-10-r-image-thread/page/10/?tab=comments#comment-4051423", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " 13 hours ago, darylgo said: great shot with difficult lighting. what -----> location !!!  is this? the spot is in mt. hehuan in taiwan.", "sortedWord": "None", "identifyer": 99581, "year": "2020"}, {"Unnamed: 0": 339354, "autor": "adan", "date": 1578160920000, "content": "10 hours ago, Travis Hill said: is it supposed to stay in or out? It should stay OUT (the roller almost sticking out of the camera front), under pressure from an internal camera spring. The spring is what forces the roller to maintain contact with the lens' moving focus cam. In theory, that spring itself can fail - but gummed-up lubricants in the mechanism are far, far more likely to cause a jam or sticking than a broken spring. ****Uh-oh!**** In examining my own M10 to confirm exactly how the lever works - I just noticed that the tip of the RF arm is catching or rubbing intermittently on the lens mount ring as the spring forces it forward. The screw and brass washer on the top of the roller-cam axle (above the arm itself) just barely clear the mount even when normal, but mine has/had even less clearance. --img--  Mostly it is just a brief contact that the spring overrides, but a couple of times it stuck hard for a moment (this would also cause the RF image to stop moving part-way through the normal range). I cleared this problem by applying a little downward pressure on the arm with a tiny screw-driver tip - but I don't recommend that as a procedure. There comes a point where uninformed or sloppy DIY work on the Leica RF just becomes a can of tangled worms that only Leica can untangle. I just happen to be a lucky risk-taker. Like the gospel song says, \"The fingerbone's connected to the - handbone; the handbone's connected to the - wristbone; the wristbone's connected to the - arm bone.....\" This is a word of warning for those of us who have tried to adjust our own RF for infinity focus - be really careful not to apply ANY upward pressure on the roller and arm when inserting or turning the 2mm hex (Allen) wrench!! You can bend or introduce enough play in the arm's vertical location to cause such sticking. No doubt I made this mistake at some point. Edited January 4, 2020 by adan", "link": "https://www.l-camera-forum.com/topic/293403-m10-sticky-rangefinder-coupling/?tab=comments#comment-3885009", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "10 hours ago, travis hill said: is it supposed to stay in or out? it should stay out (the roller almost sticking out of the camera front), under pressure from an internal camera spring. the spring is what forces the roller to maintain contact with the lens' moving focus cam. in theory, that spring itself can fail - but gummed-up lubricants in the mechanism are far, far more likely to cause a jam or sticking than a broken spring. ****uh-oh!**** in examining my own m10 to confirm exactly how the lever works - i just noticed that the tip of the rf arm is catching or rubbing intermittently on the lens mount ring as the spring forces it forward. the screw and brass washer on the top of the roller-cam axle (above the arm itself) just barely clear the mount even when normal, but mine has/had even less clearance. --img--  mostly it is just a brief contact that the spring overrides, but a couple of times it stuck hard for a moment (this would also cause the rf image to stop moving part-way through the normal range). i cleared this problem by applying a little downward pressure on the arm with a tiny screw-driver tip - but i don't recommend that as a procedure. there comes a point where uninformed or sloppy diy work on the leica rf just becomes a can of tangled worms that only leica can untangle. i just happen to be a lucky risk-taker. like the gospel song says, \"the fingerbone's connected to the - handbone; the handbone's connected to the - wristbone; the wristbone's connected to the - arm bone.....\" this is a word of warning for those of us who have tried to adjust our own rf for infinity focus - be really careful not to apply any upward pressure on the roller and arm when inserting or turning the 2mm hex (allen) wrench!! you can bend or introduce enough play in the arm's vertical -----> location !!!  to cause such sticking. no doubt i made this mistake at some point. edited january 4, 2020 by adan", "sortedWord": "None", "identifyer": 416, "year": "2020"}, {"Unnamed: 0": 339515, "autor": "Rob L", "date": 1603028760000, "content": "Mine are very nice. Yes the edges are a bit sharper. My first Leicas were two M6s bought new in the mid-90s and I can recall having to pick through several to find one that had the cover installation done well. Many had noticeable gaps where the cover butted the rear door or top plate and many more had the cover bunched up in the same locations from being too long.", "link": "https://www.l-camera-forum.com/topic/314296-m10-r-workmanship/?tab=comments#comment-4064655", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "mine are very nice. yes the edges are a bit sharper. my first leicas were two m6s bought new in the mid-90s and i can recall having to pick through several to find one that had the cover installation done well. many had noticeable gaps where the cover butted the rear door or top plate and many more had the cover bunched up in the same -----> locations !!!  from being too long.", "sortedWord": "None", "identifyer": 578, "year": "2020"}, {"Unnamed: 0": 341641, "autor": "chasdfg", "date": 1586695320000, "content": "On 3/1/2020 at 7:26 PM, Marckyokay said: Well, sorry for reviving and old threat but I thought this could be used as a direct follow up... I had a similar scratch (although much tinier than the threat starter) and remembered this, so I used a soft white eraser to rub it away and viola, the scratch really became much less visible. After going outside in the sun, to my shock, I realized I seemed to have polished the surface and the black chrome now looks really dirty/unevenly polished ... I would have never thought a soft eraser could do this... and I can’t seem to be able to clean it / rub it away. Fingers, alcohol wipe (getting rare because of corona) wet tissue... Any idea how I can clean the black chrome surface or an M10-P to get rid of this unwanted polish shine cause by an eraser? I offer no solution but just wanted to add that I did the same as you. My watch made a mark on the top plate of my M10 mono and I used a damp cloth, alcohol swabs and eraser and all it did was leave an uneven mark right smack where your Leica script is. Using oil-based moisturiser and more alcohol swabs didn't work to remove the new marks. I suspect they are all caused by the eraser. My strap lug areas are also marked, but that comes naturally with use. I can't un-see the top-plate marks though. It's only visible at some angles, but it's there, and at a location which rarely gets worn (so i suspect i will be left with this eyesore whilst the other parts of the body naturally \"brass\" and wear down). The way this finish picks up particles is ridiculous. If eraser can \"taint\" the finish of the camera, it's downright silly paint to use. It picks substances up and leaves it there. I very much prefer black paint - it doesn't leave simple marks so easily and wears in the right places unless you wish to Kravitz it artificially. My M240 took a while to mark despite being black paint, but when it started it started doing so with ease. I have yet to use WD40 (the only thing else I haven't tried), but I am sceptical it works. I can't imagine the top coat of the first-first layer of the paint to have been removed by the eraser but rather the particles from the eraser adhered to the top layer of the paint. This is why I suspect a substance that can \"dislodge\" the particles off the first layer may work.", "link": "https://www.l-camera-forum.com/topic/277169-m10-wear/page/3/?tab=comments#comment-3952145", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on 3/1/2020 at 7:26 pm, marckyokay said: well, sorry for reviving and old threat but i thought this could be used as a direct follow up... i had a similar scratch (although much tinier than the threat starter) and remembered this, so i used a soft white eraser to rub it away and viola, the scratch really became much less visible. after going outside in the sun, to my shock, i realized i seemed to have polished the surface and the black chrome now looks really dirty/unevenly polished ... i would have never thought a soft eraser could do this... and i can’t seem to be able to clean it / rub it away. fingers, alcohol wipe (getting rare because of corona) wet tissue... any idea how i can clean the black chrome surface or an m10-p to get rid of this unwanted polish shine cause by an eraser? i offer no solution but just wanted to add that i did the same as you. my watch made a mark on the top plate of my m10 mono and i used a damp cloth, alcohol swabs and eraser and all it did was leave an uneven mark right smack where your leica script is. using oil-based moisturiser and more alcohol swabs didn't work to remove the new marks. i suspect they are all caused by the eraser. my strap lug areas are also marked, but that comes naturally with use. i can't un-see the top-plate marks though. it's only visible at some angles, but it's there, and at a -----> location !!!  which rarely gets worn (so i suspect i will be left with this eyesore whilst the other parts of the body naturally \"brass\" and wear down). the way this finish picks up particles is ridiculous. if eraser can \"taint\" the finish of the camera, it's downright silly paint to use. it picks substances up and leaves it there. i very much prefer black paint - it doesn't leave simple marks so easily and wears in the right places unless you wish to kravitz it artificially. my m240 took a while to mark despite being black paint, but when it started it started doing so with ease. i have yet to use wd40 (the only thing else i haven't tried), but i am sceptical it works. i can't imagine the top coat of the first-first layer of the paint to have been removed by the eraser but rather the particles from the eraser adhered to the top layer of the paint. this is why i suspect a substance that can \"dislodge\" the particles off the first layer may work.", "sortedWord": "None", "identifyer": 2711, "year": "2020"}, {"Unnamed: 0": 341642, "autor": "Marckyokay", "date": 1586698440000, "content": " 43 minutes ago, chasdfg said: I offer no solution but just wanted to add that I did the same as you. My watch made a mark on the top plate of my M10 mono and I used a damp cloth, alcohol swabs and eraser and all it did was leave an uneven mark right smack where your Leica script is. Using oil-based moisturiser and more alcohol swabs didn't work to remove the new marks. I suspect they are all caused by the eraser. My strap lug areas are also marked, but that comes naturally with use. I can't un-see the top-plate marks though. It's only visible at some angles, but it's there, and at a location which rarely gets worn (so i suspect i will be left with this eyesore whilst the other parts of the body naturally \"brass\" and wear down). The way this finish picks up particles is ridiculous. If eraser can \"taint\" the finish of the camera, it's downright silly paint to use. It picks substances up and leaves it there. I very much prefer black paint - it doesn't leave simple marks so easily and wears in the right places unless you wish to Kravitz it artificially. My M240 took a while to mark despite being black paint, but when it started it started doing so with ease. I have yet to use WD40 (the only thing else I haven't tried), but I am sceptical it works. I can't imagine the top coat of the first-first layer of the paint to have been removed by the eraser but rather the particles from the eraser adhered to the top layer of the paint. This is why I suspect a substance that can \"dislodge\" the particles off the first layer may work. I feel you and am definitely with you here... It is ridiculous how easily the chrom finish of the M10-P, M10-D, M10-M wears... Natural wear around the edges that are touched frequently (even the strap lug area) \"polish\" beautifully. But it is much too easy to mark the camera with this finish... I loved the original standard black M10 finish for it's metallic looking, slightly more shiny chrom. This super matte M10-P finish is just too fragile and ... \"too matte\" for me. After causing this dilemma, I would be glad for every normal mark and scratch and polish that happens \"in action\", but can't unsee the mess that I caused by myself. It's a bitter taste and I totally understand your feelings. As I was told by Kanto Camera in Kawasaki, this matte finish is rather \"rough\" in it's structure and a soft eraser with tiny polishing particles, as most erasers have, is enough to polish down the finish. I'm afraid there is nothing we can do about it except letting Leica exchange the top plate. Which I'm going to do after my first dent or mishap in action will occur. I stopped babying the camera and will use it like my old film M and when the first accident happens and I mark it badly, I probably will exchange the top plate to get rid of this user-error I caused (or maybe I won't...). If Leica will open their customer service anytime soon again... I wanted to send them a lens and they kindly asked me not to since they are overrun by work and only working in a very small team in Wetzlar due to the Corona Crisis...", "link": "https://www.l-camera-forum.com/topic/277169-m10-wear/page/4/?tab=comments#comment-3952181", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " 43 minutes ago, chasdfg said: i offer no solution but just wanted to add that i did the same as you. my watch made a mark on the top plate of my m10 mono and i used a damp cloth, alcohol swabs and eraser and all it did was leave an uneven mark right smack where your leica script is. using oil-based moisturiser and more alcohol swabs didn't work to remove the new marks. i suspect they are all caused by the eraser. my strap lug areas are also marked, but that comes naturally with use. i can't un-see the top-plate marks though. it's only visible at some angles, but it's there, and at a -----> location !!!  which rarely gets worn (so i suspect i will be left with this eyesore whilst the other parts of the body naturally \"brass\" and wear down). the way this finish picks up particles is ridiculous. if eraser can \"taint\" the finish of the camera, it's downright silly paint to use. it picks substances up and leaves it there. i very much prefer black paint - it doesn't leave simple marks so easily and wears in the right places unless you wish to kravitz it artificially. my m240 took a while to mark despite being black paint, but when it started it started doing so with ease. i have yet to use wd40 (the only thing else i haven't tried), but i am sceptical it works. i can't imagine the top coat of the first-first layer of the paint to have been removed by the eraser but rather the particles from the eraser adhered to the top layer of the paint. this is why i suspect a substance that can \"dislodge\" the particles off the first layer may work. i feel you and am definitely with you here... it is ridiculous how easily the chrom finish of the m10-p, m10-d, m10-m wears... natural wear around the edges that are touched frequently (even the strap lug area) \"polish\" beautifully. but it is much too easy to mark the camera with this finish... i loved the original standard black m10 finish for it's metallic looking, slightly more shiny chrom. this super matte m10-p finish is just too fragile and ... \"too matte\" for me. after causing this dilemma, i would be glad for every normal mark and scratch and polish that happens \"in action\", but can't unsee the mess that i caused by myself. it's a bitter taste and i totally understand your feelings. as i was told by kanto camera in kawasaki, this matte finish is rather \"rough\" in it's structure and a soft eraser with tiny polishing particles, as most erasers have, is enough to polish down the finish. i'm afraid there is nothing we can do about it except letting leica exchange the top plate. which i'm going to do after my first dent or mishap in action will occur. i stopped babying the camera and will use it like my old film m and when the first accident happens and i mark it badly, i probably will exchange the top plate to get rid of this user-error i caused (or maybe i won't...). if leica will open their customer service anytime soon again... i wanted to send them a lens and they kindly asked me not to since they are overrun by work and only working in a very small team in wetzlar due to the corona crisis...", "sortedWord": "None", "identifyer": 2712, "year": "2020"}, {"Unnamed: 0": 341669, "autor": "erniethemilk", "date": 1593180960000, "content": "I’ve been watching this thread with interest having bought a used M10-P last autumn. I have found mine is wearing through very, very slightly in certain places but nothing serious - in truth I’m not that precious about gear anyway and the M10-P will be with me for a long, long time. For some reason the area I am finding the most wear is on the edge of the viewfinder which is starting to go to a very slightly bronze, almost copper colour. It’s only really evident in sunlight/daylight - it just seems a very strange place for such wear given its location. I also have the official thumb grip which seems to be wearing a very similar colour too.", "link": "https://www.l-camera-forum.com/topic/277169-m10-wear/page/5/?tab=comments#comment-3999663", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i’ve been watching this thread with interest having bought a used m10-p last autumn. i have found mine is wearing through very, very slightly in certain places but nothing serious - in truth i’m not that precious about gear anyway and the m10-p will be with me for a long, long time. for some reason the area i am finding the most wear is on the edge of the viewfinder which is starting to go to a very slightly bronze, almost copper colour. it’s only really evident in sunlight/daylight - it just seems a very strange place for such wear given its -----> location !!! . i also have the official thumb grip which seems to be wearing a very similar colour too.", "sortedWord": "None", "identifyer": 2739, "year": "2020"}, {"Unnamed: 0": 341932, "autor": "LocalHero1953", "date": 1585072080000, "content": "Fogg flute (cream canvas), b-minor (green canvas) and b-major (grey canvas), all with cognac leather, all with custom features (mainly a grab handle on top). They're happy to do the custom changes, but billing in the UK is through Robert White. F-Stop Loka back pack with small insert, which is my airline cabin bag and hiking pack. Lowepro Pro Runner for out-and-out urban bulk transport of location portraiture kit (SL + 24-90, flash x2, lighting stands x2, brollies x2). Cotton backdrop and stand supports in a separate canvas holdall, and I hope my back will last till I get there. Crumpler Haven Small, for CL and single lens, for throwing in my work messenger bag. Despite the quantity, these bags are all used fairly equally for my CL and SL kits. Previous bags: - Ona Brixton in leather: style over substance - too heavy, limited capacity, dubious strap attachments, cheap thin leather over padding. - Domke FX5B in waxed canvas: great bag but lost out in style stakes to the Fogg b-minor, which is just as practical. (We need an active bag thread in these grim times of pestilence, fear and death).", "link": "https://www.l-camera-forum.com/topic/307354-camera-bag-again-and-again/page/3/?tab=comments#comment-3938267", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fogg flute (cream canvas), b-minor (green canvas) and b-major (grey canvas), all with cognac leather, all with custom features (mainly a grab handle on top). they're happy to do the custom changes, but billing in the uk is through robert white. f-stop loka back pack with small insert, which is my airline cabin bag and hiking pack. lowepro pro runner for out-and-out urban bulk transport of -----> location !!!  portraiture kit (sl + 24-90, flash x2, lighting stands x2, brollies x2). cotton backdrop and stand supports in a separate canvas holdall, and i hope my back will last till i get there. crumpler haven small, for cl and single lens, for throwing in my work messenger bag. despite the quantity, these bags are all used fairly equally for my cl and sl kits. previous bags: - ona brixton in leather: style over substance - too heavy, limited capacity, dubious strap attachments, cheap thin leather over padding. - domke fx5b in waxed canvas: great bag but lost out in style stakes to the fogg b-minor, which is just as practical. (we need an active bag thread in these grim times of pestilence, fear and death).", "sortedWord": "None", "identifyer": 3002, "year": "2020"}, {"Unnamed: 0": 345515, "autor": "ysm", "date": 1595266440000, "content": "On 9/1/2019 at 11:33 AM, AndreasG said: Let me share my experience with the Visoflex 020 and a M10-D with you. I bought the Visoflex around 3 weeks ago. Everything works well, display, focussing, proximity switch, indication of the key parameters - except the GPS function. The satellite symbol appears within a few seconds, telling that the link got established, but with the small \"x\" - no data transfer. First I thought, maybe out of satellite range for a short while, but I never could get any GPS data, at various locations. I contacted the Leica service Wetzlar by email, but their reply was only to follow the instruction on p. 5 of the manual - keep the antenna upright and do not shield it. To be honest, I expected a qualified advice. A few day later I visited the shop where I had bought the Visoflex ( a well known dealer in Düsseldorf). They took plenty of time, but unfortunately no M10 or a Visoflex were available for a comparison. But the told that next day an expert from Leica would come and they would discuss this case. I left without any expectation. Surprisingly, two days later the shop sent me an email, informing me that the Leica guy had admitted that this GPS issue with the M10-D/Visoflex has been known already and would be solved with the new firmware version 2.7.5.0 to be released September 4, 2019. So, I wait now... Has this issue been fixed? For what I know, my M10-D also shows an 'x' on the satellite symbol in Visoflex. Both products were bought in 2020.", "link": "https://www.l-camera-forum.com/topic/297307-visoflex-issues-with-leica-m10/page/2/?tab=comments#comment-4012333", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "on 9/1/2019 at 11:33 am, andreasg said: let me share my experience with the visoflex 020 and a m10-d with you. i bought the visoflex around 3 weeks ago. everything works well, display, focussing, proximity switch, indication of the key parameters - except the gps function. the satellite symbol appears within a few seconds, telling that the link got established, but with the small \"x\" - no data transfer. first i thought, maybe out of satellite range for a short while, but i never could get any gps data, at various -----> locations !!! . i contacted the leica service wetzlar by email, but their reply was only to follow the instruction on p. 5 of the manual - keep the antenna upright and do not shield it. to be honest, i expected a qualified advice. a few day later i visited the shop where i had bought the visoflex ( a well known dealer in düsseldorf). they took plenty of time, but unfortunately no m10 or a visoflex were available for a comparison. but the told that next day an expert from leica would come and they would discuss this case. i left without any expectation. surprisingly, two days later the shop sent me an email, informing me that the leica guy had admitted that this gps issue with the m10-d/visoflex has been known already and would be solved with the new firmware version 2.7.5.0 to be released september 4, 2019. so, i wait now... has this issue been fixed? for what i know, my m10-d also shows an 'x' on the satellite symbol in visoflex. both products were bought in 2020.", "sortedWord": "None", "identifyer": 6604, "year": "2020"}, {"Unnamed: 0": 347917, "autor": "Jeff S", "date": 1603929600000, "content": "4 minutes ago, Steven said: If you could only keep one of the three, which one would it be and why ? I own three because they complement each other well for different shooting circumstances and experiences, including weather conditions, focal lengths, locations and subject matter, workflow preferences, and more. IQ is superb with all. Otherwise I wouldn’t have bought them. GAS not a factor. Jeff", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/7/?tab=comments#comment-4070091", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "4 minutes ago, steven said: if you could only keep one of the three, which one would it be and why ? i own three because they complement each other well for different shooting circumstances and experiences, including weather conditions, focal lengths, -----> locations !!!  and subject matter, workflow preferences, and more. iq is superb with all. otherwise i wouldn’t have bought them. gas not a factor. jeff", "sortedWord": "None", "identifyer": 9016, "year": "2020"}, {"Unnamed: 0": 347918, "autor": "Tom1234", "date": 1603932300000, "content": "50 minutes ago, Steven said: If you could only keep one of the three, which one would it be and why ? 38 minutes ago, Jeff S said: I own three because they complement each other well for different shooting circumstances and experiences, including weather conditions, focal lengths, locations and subject matter, workflow preferences, and more. IQ is superb with all. Otherwise I wouldn’t have bought them. GAS not a factor. Jeff I detect 24 meg aesthetic love… as the m10 can not be abandoned to the used market. Not GAS (gear acquisition syndrome). The oldest camera a person can not let go of… is it not loved? I can not bring myself to sell my M7's so I must love film and this is true… actions reveal inner motives.", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/7/?tab=comments#comment-4070101", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "50 minutes ago, steven said: if you could only keep one of the three, which one would it be and why ? 38 minutes ago, jeff s said: i own three because they complement each other well for different shooting circumstances and experiences, including weather conditions, focal lengths, -----> locations !!!  and subject matter, workflow preferences, and more. iq is superb with all. otherwise i wouldn’t have bought them. gas not a factor. jeff i detect 24 meg aesthetic love… as the m10 can not be abandoned to the used market. not gas (gear acquisition syndrome). the oldest camera a person can not let go of… is it not loved? i can not bring myself to sell my m7's so i must love film and this is true… actions reveal inner motives.", "sortedWord": "None", "identifyer": 9017, "year": "2020"}, {"Unnamed: 0": 347922, "autor": "Steven", "date": 1603957080000, "content": "7 hours ago, Jeff S said: I own three because they complement each other well for different shooting circumstances and experiences, including weather conditions, focal lengths, locations and subject matter, workflow preferences, and more. IQ is superb with all. Otherwise I wouldn’t have bought them. GAS not a factor. Jeff That wasn’t my question but fine. I understand by the now that you don’t like to play along ....", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/7/?tab=comments#comment-4070167", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "7 hours ago, jeff s said: i own three because they complement each other well for different shooting circumstances and experiences, including weather conditions, focal lengths, -----> locations !!!  and subject matter, workflow preferences, and more. iq is superb with all. otherwise i wouldn’t have bought them. gas not a factor. jeff that wasn’t my question but fine. i understand by the now that you don’t like to play along ....", "sortedWord": "None", "identifyer": 9021, "year": "2020"}, {"Unnamed: 0": 347958, "autor": "Raymondl", "date": 1604009280000, "content": "Thanks @Steven for posting these, looks like you live at an amazing location (great for “test” photos). I’ll have a closer look on my computer later. But back to the question about the aesthetics.. 24 vs 40 from the same manufacturer (to avoid the “color science debates” between different companies) just wanted to know how this could be qualified ? Understand this is a Leica community I thought it would be good to keep it within Leica ?", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/9/?tab=comments#comment-4070578", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "thanks @steven for posting these, looks like you live at an amazing -----> location !!!  (great for “test” photos). i’ll have a closer look on my computer later. but back to the question about the aesthetics.. 24 vs 40 from the same manufacturer (to avoid the “color science debates” between different companies) just wanted to know how this could be qualified ? understand this is a leica community i thought it would be good to keep it within leica ?", "sortedWord": "None", "identifyer": 9057, "year": "2020"}, {"Unnamed: 0": 348103, "autor": "Jeff S", "date": 1604247000000, "content": "I have lots of wall space, but don’t crowd displays. As noted, rotating displays can be good exercise to merge themes, change locations and not tire of same presentation. I have and enjoy a number of cameras and lenses, but I don’t take them out all together. Jeff", "link": "https://www.l-camera-forum.com/topic/314500-24meg-verses-40meg-aesthetic/page/16/?tab=comments#comment-4072156", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i have lots of wall space, but don’t crowd displays. as noted, rotating displays can be good exercise to merge themes, change -----> locations !!!  and not tire of same presentation. i have and enjoy a number of cameras and lenses, but i don’t take them out all together. jeff", "sortedWord": "None", "identifyer": 9202, "year": "2020"}, {"Unnamed: 0": 354945, "autor": "Good To Be Retired", "date": 1605282960000, "content": "11 hours ago, theumbrellacorp said: Am I being a bit paranoid about the condition of the camera because of the sensor, Just one person's opinion, but I would say yes. On the other hand, if you were able to demand all that extra free service from the Leica Store and actually get it, you have my congratulations. Kinda makes you wonder about their markup though Having said that, I personally purchased from Leica Miami an M240 that arrived with the rangefinder out of adjustment. Following the excellent procedure detailed on this forum I adjusted it myself with no issues. Unless you intent to leave the camera to your children in your will, you probably won't need another CLA as long as you own it. Or maybe you will. Such things however depend entirely on your useage, location, owner care, whether you're a professional, and other factors. But it's certainly not something to spend any time worrying about. You really, seriously, will reap benefits from learning to clean the sensor yourself though. Edited November 13, 2020 by Good To Be Retired", "link": "https://www.l-camera-forum.com/topic/315072-leica-cla-experience-for-mp-240/?tab=comments#comment-4079540", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "11 hours ago, theumbrellacorp said: am i being a bit paranoid about the condition of the camera because of the sensor, just one person's opinion, but i would say yes. on the other hand, if you were able to demand all that extra free service from the leica store and actually get it, you have my congratulations. kinda makes you wonder about their markup though having said that, i personally purchased from leica miami an m240 that arrived with the rangefinder out of adjustment. following the excellent procedure detailed on this forum i adjusted it myself with no issues. unless you intent to leave the camera to your children in your will, you probably won't need another cla as long as you own it. or maybe you will. such things however depend entirely on your useage, -----> location !!! , owner care, whether you're a professional, and other factors. but it's certainly not something to spend any time worrying about. you really, seriously, will reap benefits from learning to clean the sensor yourself though. edited november 13, 2020 by good to be retired", "sortedWord": "None", "identifyer": 16108, "year": "2020"}, {"Unnamed: 0": 354953, "autor": "lawman", "date": 1606254540000, "content": "On 11/13/2020 at 7:56 AM, Good To Be Retired said: Just one person's opinion, but I would say yes. On the other hand, if you were able to demand all that extra free service from the Leica Store and actually get it, you have my congratulations. Kinda makes you wonder about their markup though Having said that, I personally purchased from Leica Miami an M240 that arrived with the rangefinder out of adjustment. Following the excellent procedure detailed on this forum I adjusted it myself with no issues. Unless you intent to leave the camera to your children in your will, you probably won't need another CLA as long as you own it. Or maybe you will. Such things however depend entirely on your useage, location, owner care, whether you're a professional, and other factors. But it's certainly not something to spend any time worrying about. You really, seriously, will reap benefits from learning to clean the sensor yourself though. I have just encountered a back focus issue on all of my lenses with my M246. Would you please refer me to the \"excellent procedure detailed on this forum\" as I would dearly like to make this adjustment myself as well. I have a full set of metric small allen wrenches and am ready to go - thanks", "link": "https://www.l-camera-forum.com/topic/315072-leica-cla-experience-for-mp-240/?tab=comments#comment-4086559", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on 11/13/2020 at 7:56 am, good to be retired said: just one person's opinion, but i would say yes. on the other hand, if you were able to demand all that extra free service from the leica store and actually get it, you have my congratulations. kinda makes you wonder about their markup though having said that, i personally purchased from leica miami an m240 that arrived with the rangefinder out of adjustment. following the excellent procedure detailed on this forum i adjusted it myself with no issues. unless you intent to leave the camera to your children in your will, you probably won't need another cla as long as you own it. or maybe you will. such things however depend entirely on your useage, -----> location !!! , owner care, whether you're a professional, and other factors. but it's certainly not something to spend any time worrying about. you really, seriously, will reap benefits from learning to clean the sensor yourself though. i have just encountered a back focus issue on all of my lenses with my m246. would you please refer me to the \"excellent procedure detailed on this forum\" as i would dearly like to make this adjustment myself as well. i have a full set of metric small allen wrenches and am ready to go - thanks", "sortedWord": "None", "identifyer": 16116, "year": "2020"}, {"Unnamed: 0": 355279, "autor": "Jeff S", "date": 1602025260000, "content": "Just now, bcapphoto said: Yea - I'm in Canada and there's no where I can find where I can rent/try them 😪 I saw your profile location. No dealers? Not close to a US city? Maybe make some Canadian friend here on the forum. 🙂 Heff", "link": "https://www.l-camera-forum.com/topic/313992-is-the-m262-worth-1000-more-than-the-m240/?tab=comments#comment-4058523", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "just now, bcapphoto said: yea - i'm in canada and there's no where i can find where i can rent/try them 😪 i saw your profile -----> location !!! . no dealers? not close to a us city? maybe make some canadian friend here on the forum. 🙂 heff", "sortedWord": "None", "identifyer": 16443, "year": "2020"}, {"Unnamed: 0": 355281, "autor": "bcapphoto", "date": 1602025440000, "content": "3 minutes ago, Jeff S said: I saw your profile location. No dealers? Not close to a US city? Maybe make some Canadian friend here on the forum. 🙂 Heff Nah - none. Plus - COVID, so I can't get over the border, unfortunately.", "link": "https://www.l-camera-forum.com/topic/313992-is-the-m262-worth-1000-more-than-the-m240/?tab=comments#comment-4058525", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "3 minutes ago, jeff s said: i saw your profile -----> location !!! . no dealers? not close to a us city? maybe make some canadian friend here on the forum. 🙂 heff nah - none. plus - covid, so i can't get over the border, unfortunately.", "sortedWord": "None", "identifyer": 16445, "year": "2020"}, {"Unnamed: 0": 356217, "autor": "IanH", "date": 1586862480000, "content": "Hi all, Thank you all for the practical and supportive responses. The buyer dropped me a message (in the auction site) to provide a quote for a sensor clean by a reputable dealer/repair centre close to his location with the centre's contact details, if I wanted to check it out. The quote for the clean was less than $200 (AUD) - 130 USD approx - so happy to go ahead and cover the costs. The communications from the buyer have been positive and he has assisted with trying to resolve. I really did not want to start posting the camera hundreds of miles again and have to relist etc. So... to date it's going well and I really hope he enjoys the camera and the clean fixes the spots. I loved the idea of the M-D when I had an M6 when I kept getting dust on my scans, but because the M-D was mint I was reluctant to actually use it. I've purchased a user m2 to stick to my 35 'cron and am loving taking it out everywhere again. I've resolved to have my film professionally printed and scanned this time though- I don't have time or patience anymore to flatbed scan negs after the local chemist has managed to drag them across the floor when processing. @a.noctilux - thank you for the useful manual advice. @jaapv - loved the bird crapping on the car analogy - fantastic. This made me laugh in what was (and still could be) a stressful situation. Thanks all, look forward to contributing more to the forums. @jaapv", "link": "https://www.l-camera-forum.com/topic/308490-dust-spots-on-m262-sensor/?tab=comments#comment-3953588", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "hi all, thank you all for the practical and supportive responses. the buyer dropped me a message (in the auction site) to provide a quote for a sensor clean by a reputable dealer/repair centre close to his -----> location !!!  with the centre's contact details, if i wanted to check it out. the quote for the clean was less than $200 (aud) - 130 usd approx - so happy to go ahead and cover the costs. the communications from the buyer have been positive and he has assisted with trying to resolve. i really did not want to start posting the camera hundreds of miles again and have to relist etc. so... to date it's going well and i really hope he enjoys the camera and the clean fixes the spots. i loved the idea of the m-d when i had an m6 when i kept getting dust on my scans, but because the m-d was mint i was reluctant to actually use it. i've purchased a user m2 to stick to my 35 'cron and am loving taking it out everywhere again. i've resolved to have my film professionally printed and scanned this time though- i don't have time or patience anymore to flatbed scan negs after the local chemist has managed to drag them across the floor when processing. @a.noctilux - thank you for the useful manual advice. @jaapv - loved the bird crapping on the car analogy - fantastic. this made me laugh in what was (and still could be) a stressful situation. thanks all, look forward to contributing more to the forums. @jaapv", "sortedWord": "None", "identifyer": 17383, "year": "2020"}, {"Unnamed: 0": 356219, "autor": "Steve Ricoh", "date": 1587823440000, "content": "On 4/14/2020 at 12:08 PM, IanH said: Hi all, Thank you all for the practical and supportive responses. The buyer dropped me a message (in the auction site) to provide a quote for a sensor clean by a reputable dealer/repair centre close to his location with the centre's contact details, if I wanted to check it out. The quote for the clean was less than $200 (AUD) - 130 USD approx - so happy to go ahead and cover the costs. The communications from the buyer have been positive and he has assisted with trying to resolve. I really did not want to start posting the camera hundreds of miles again and have to relist etc. So... to date it's going well and I really hope he enjoys the camera and the clean fixes the spots. I loved the idea of the M-D when I had an M6 when I kept getting dust on my scans, but because the M-D was mint I was reluctant to actually use it. I've purchased a user m2 to stick to my 35 'cron and am loving taking it out everywhere again. I've resolved to have my film professionally printed and scanned this time though- I don't have time or patience anymore to flatbed scan negs after the local chemist has managed to drag them across the floor when processing. @a.noctilux - thank you for the useful manual advice. @jaapv - loved the bird crapping on the car analogy - fantastic. This made me laugh in what was (and still could be) a stressful situation. Thanks all, look forward to contributing more to the forums. @jaapv That sounds rather expensive for a sensor clean. In the U.K. it’s more like £30 or £40. As someone said before, sensor dust is a fact of life. Up ‘til now I’ve relied on a rocket blower for my M240, and post process the remaining offenders.", "link": "https://www.l-camera-forum.com/topic/308490-dust-spots-on-m262-sensor/?tab=comments#comment-3960774", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on 4/14/2020 at 12:08 pm, ianh said: hi all, thank you all for the practical and supportive responses. the buyer dropped me a message (in the auction site) to provide a quote for a sensor clean by a reputable dealer/repair centre close to his -----> location !!!  with the centre's contact details, if i wanted to check it out. the quote for the clean was less than $200 (aud) - 130 usd approx - so happy to go ahead and cover the costs. the communications from the buyer have been positive and he has assisted with trying to resolve. i really did not want to start posting the camera hundreds of miles again and have to relist etc. so... to date it's going well and i really hope he enjoys the camera and the clean fixes the spots. i loved the idea of the m-d when i had an m6 when i kept getting dust on my scans, but because the m-d was mint i was reluctant to actually use it. i've purchased a user m2 to stick to my 35 'cron and am loving taking it out everywhere again. i've resolved to have my film professionally printed and scanned this time though- i don't have time or patience anymore to flatbed scan negs after the local chemist has managed to drag them across the floor when processing. @a.noctilux - thank you for the useful manual advice. @jaapv - loved the bird crapping on the car analogy - fantastic. this made me laugh in what was (and still could be) a stressful situation. thanks all, look forward to contributing more to the forums. @jaapv that sounds rather expensive for a sensor clean. in the u.k. it’s more like £30 or £40. as someone said before, sensor dust is a fact of life. up ‘til now i’ve relied on a rocket blower for my m240, and post process the remaining offenders.", "sortedWord": "None", "identifyer": 17385, "year": "2020"}, {"Unnamed: 0": 356398, "autor": "Steve Ricoh", "date": 1580070420000, "content": "I think if it bothers you, and you can manage without the camera for a while, you should consider sending it to Leica service. I would recommend enclosing the SD card to allow them to examine the effect, whilst also interrogating the internal data log in one of the memory locations.", "link": "https://www.l-camera-forum.com/topic/305628-underexposure-and-black-frame-issue-of-m240/page/2/?tab=comments#comment-3900229", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i think if it bothers you, and you can manage without the camera for a while, you should consider sending it to leica service. i would recommend enclosing the sd card to allow them to examine the effect, whilst also interrogating the internal data log in one of the memory -----> locations !!! .", "sortedWord": "None", "identifyer": 17564, "year": "2020"}, {"Unnamed: 0": 356399, "autor": "clngood", "date": 1580097600000, "content": " 7 hours ago, Steve Ricoh said: I think if it bothers you, and you can manage without the camera for a while, you should consider sending it to Leica service. I would recommend enclosing the SD card to allow them to examine the effect, whilst also interrogating the internal data log in one of the memory locations. Thanks, will do. I think I have same issue with this guy Edited January 27, 2020 by clngood", "link": "https://www.l-camera-forum.com/topic/305628-underexposure-and-black-frame-issue-of-m240/page/2/?tab=comments#comment-3900451", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": " 7 hours ago, steve ricoh said: i think if it bothers you, and you can manage without the camera for a while, you should consider sending it to leica service. i would recommend enclosing the sd card to allow them to examine the effect, whilst also interrogating the internal data log in one of the memory -----> locations !!! . thanks, will do. i think i have same issue with this guy edited january 27, 2020 by clngood", "sortedWord": "None", "identifyer": 17565, "year": "2020"}, {"Unnamed: 0": 357200, "autor": "OR120", "date": 1580413920000, "content": "I'm going along with marchyman -- what he says. I have a ME typ240 (no 28mm) because I also have the Q. And what marchyman says regarding his M 262 - my ME 240 battery goes on forever. My Q goes through batteries quickly. In most cases - I use my Q when I know I won't have much time to shoot -- it's very fast with wonderful autofocus. I take the ME 240 out when I know I'll have a little more time with my subject/location. I prefer the feel of the ME 240 because it feels like the old M bodies I grew up with ---------- and again as marchyman says - I do enjoy the Q even more when I use manual focus (but the autofocus is fast). I really think they make a good pair. Just depends on your subjects and style of shooting. Just wanted to add -- like marchyman says -- my 35 is just about glued to my ME 240. Edited January 30, 2020 by OR120 sp", "link": "https://www.l-camera-forum.com/topic/305908-leica-m-typ-240-or-q/?tab=comments#comment-3902789", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i'm going along with marchyman -- what he says. i have a me typ240 (no 28mm) because i also have the q. and what marchyman says regarding his m 262 - my me 240 battery goes on forever. my q goes through batteries quickly. in most cases - i use my q when i know i won't have much time to shoot -- it's very fast with wonderful autofocus. i take the me 240 out when i know i'll have a little more time with my subject/-----> location !!! . i prefer the feel of the me 240 because it feels like the old m bodies i grew up with ---------- and again as marchyman says - i do enjoy the q even more when i use manual focus (but the autofocus is fast). i really think they make a good pair. just depends on your subjects and style of shooting. just wanted to add -- like marchyman says -- my 35 is just about glued to my me 240. edited january 30, 2020 by or120 sp", "sortedWord": "None", "identifyer": 18369, "year": "2020"}, {"Unnamed: 0": 362991, "autor": "Jeff S", "date": 1590421260000, "content": "Even without Covid, Leica marches to their own timing. Even then, supply levels can vary by location and source, and further complicated by wait lists, or not. Best to check with the source where you ordered to see if they have any insight, or at least to determine if there's a wait list and where you rank. Jeff", "link": "https://www.l-camera-forum.com/topic/309958-m10m-wetzlar-edition/?tab=comments#comment-3980348", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "even without covid, leica marches to their own timing. even then, supply levels can vary by -----> location !!!  and source, and further complicated by wait lists, or not. best to check with the source where you ordered to see if they have any insight, or at least to determine if there's a wait list and where you rank. jeff", "sortedWord": "None", "identifyer": 24237, "year": "2020"}, {"Unnamed: 0": 363569, "autor": "Bcaldwell", "date": 1606768320000, "content": "Thanks, I can certainly appreciate the value of a good monitor. But at the moment I don't have a permanent location and need a monitor that I intend to use for a few months at the most. My life is 1-3 months in a single location and then I move on. I literally live out of a suitcase that does not have room for me to bring my own monitor. It's only the current conditions that are keeping me in one place and I'm taking advantage of the time to make some headway in photo editing. So I need the best of the worst, so to speak. When I put down roots somewhere, my needs will be different and I'll opt for something where price is a little less of an object. I don't mind paying for quality, but not for something where I will only have limited use. I don't expect exceptional quality for a low price, but I would like something better than the 13\" screen of my MacBook. Edited November 30, 2020 by Bcaldwell", "link": "https://www.l-camera-forum.com/topic/315636-monitor-choice-for-m10-m/?tab=comments#comment-4089943", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "thanks, i can certainly appreciate the value of a good monitor. but at the moment i don't have a permanent -----> location !!!  and need a monitor that i intend to use for a few months at the most. my life is 1-3 months in a single location and then i move on. i literally live out of a suitcase that does not have room for me to bring my own monitor. it's only the current conditions that are keeping me in one place and i'm taking advantage of the time to make some headway in photo editing. so i need the best of the worst, so to speak. when i put down roots somewhere, my needs will be different and i'll opt for something where price is a little less of an object. i don't mind paying for quality, but not for something where i will only have limited use. i don't expect exceptional quality for a low price, but i would like something better than the 13\" screen of my macbook. edited november 30, 2020 by bcaldwell", "sortedWord": "None", "identifyer": 24822, "year": "2020"}, {"Unnamed: 0": 363606, "autor": "BrianS", "date": 1603289640000, "content": "That much for just remapping the bad pixel!!!!! One of my Winter projects will be to make my code \"just\" interpolate bad lines and just fix them in the DNG file. Will make it read in or ask for the bad pixel location.", "link": "https://www.l-camera-forum.com/topic/313395-m9-monochrom-vertical-line-at-high-iso/?tab=comments#comment-4066222", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "that much for just remapping the bad pixel!!!!! one of my winter projects will be to make my code \"just\" interpolate bad lines and just fix them in the dng file. will make it read in or ask for the bad pixel -----> location !!! .", "sortedWord": "None", "identifyer": 24859, "year": "2020"}, {"Unnamed: 0": 363608, "autor": "jonnyboy", "date": 1603350960000, "content": "17 hours ago, BrianS said: That much for just remapping the bad pixel!!!!! One of my Winter projects will be to make my code \"just\" interpolate bad lines and just fix them in the DNG file. Will make it read in or ask for the bad pixel location. This would be a great solutions as many users reported this type of issue with M's.", "link": "https://www.l-camera-forum.com/topic/313395-m9-monochrom-vertical-line-at-high-iso/?tab=comments#comment-4066578", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "17 hours ago, brians said: that much for just remapping the bad pixel!!!!! one of my winter projects will be to make my code \"just\" interpolate bad lines and just fix them in the dng file. will make it read in or ask for the bad pixel -----> location !!! . this would be a great solutions as many users reported this type of issue with m's.", "sortedWord": "None", "identifyer": 24861, "year": "2020"}, {"Unnamed: 0": 363610, "autor": "BrianS", "date": 1605733920000, "content": "Brought my cars in for service- always get some good code written at the Car Shop. I should consider myself a breaking even- the cost to have the car serviced was about the same as sending the camera to have the bad line remapped. And- servicing the car only took a few hours, sending the Camera away would be weeks. I modified my program to read the bad column(s) in from a file, and made adding the Gamma curve optional. I also found images where the bad column had \"hot\" pixels, good pixels, and \"Cold\" pixels. Which just meant taking \"Absolute values\" for the threshold test when deciding to correct a pixel or not. ANYWAY: when looking at the \"bad\" column on my camera, the structure is retained- just the level is above or below the neighbors. Rather than just average over the column all the time, my code computes a local offset and applies it when the levels of the bad column is too far above or below the two neighbors. A running average of 5 pixels is used to compute the local offset. The code at present generates a new file, leaves the original intact. It works with DNG files from the M Monochrom, and will not work with those emitted by Photoshop. Turns out that saved DNG files are different from what the camera generates. The same code will optionally add a Gamma curve, it asks for \"curve\" when starting up. a \"0\"- Gamma is skipped and a new file is generated starting with a \"C\" (Corrected). Give a curve from 1-8, get a file starting with \"G\" (Gamma). The program either works on one file at a time, or processes all the files in a directory. Runs on XP through to WIN10. Also runs on PharLap extended DOS, but different compiler options for that. This is a Windows console program. I did try an algorithm to identify the bad columns automatically. One of the test images: Fabric in a Hat lines up perfectly with the Columns of the image. Broke the algorithm. SO- back to determining bad columns using Photoshop to get the number, and just have the list read in at runtime. If anyone has a M Monochrom with a similar problem, I could look at a DNG file and see if this code corrects the problem. I can make up the file with the bad locations (trivial) and send the code to try out. I will not be doing a GUI- at least for the foreseeable future- I did this code to get familiar with the new compiler for a work project. I have 100K lines or so to convert to it...and get paid doing it. I love Fortran. Scaled down image, still shows the dark line. 100% crop of the left edge. --img--  --img--  --img--  Edited November 18, 2020 by BrianS", "link": "https://www.l-camera-forum.com/topic/313395-m9-monochrom-vertical-line-at-high-iso/?tab=comments#comment-4082831", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "brought my cars in for service- always get some good code written at the car shop. i should consider myself a breaking even- the cost to have the car serviced was about the same as sending the camera to have the bad line remapped. and- servicing the car only took a few hours, sending the camera away would be weeks. i modified my program to read the bad column(s) in from a file, and made adding the gamma curve optional. i also found images where the bad column had \"hot\" pixels, good pixels, and \"cold\" pixels. which just meant taking \"absolute values\" for the threshold test when deciding to correct a pixel or not. anyway: when looking at the \"bad\" column on my camera, the structure is retained- just the level is above or below the neighbors. rather than just average over the column all the time, my code computes a local offset and applies it when the levels of the bad column is too far above or below the two neighbors. a running average of 5 pixels is used to compute the local offset. the code at present generates a new file, leaves the original intact. it works with dng files from the m monochrom, and will not work with those emitted by photoshop. turns out that saved dng files are different from what the camera generates. the same code will optionally add a gamma curve, it asks for \"curve\" when starting up. a \"0\"- gamma is skipped and a new file is generated starting with a \"c\" (corrected). give a curve from 1-8, get a file starting with \"g\" (gamma). the program either works on one file at a time, or processes all the files in a directory. runs on xp through to win10. also runs on pharlap extended dos, but different compiler options for that. this is a windows console program. i did try an algorithm to identify the bad columns automatically. one of the test images: fabric in a hat lines up perfectly with the columns of the image. broke the algorithm. so- back to determining bad columns using photoshop to get the number, and just have the list read in at runtime. if anyone has a m monochrom with a similar problem, i could look at a dng file and see if this code corrects the problem. i can make up the file with the bad -----> locations !!!  (trivial) and send the code to try out. i will not be doing a gui- at least for the foreseeable future- i did this code to get familiar with the new compiler for a work project. i have 100k lines or so to convert to it...and get paid doing it. i love fortran. scaled down image, still shows the dark line. 100% crop of the left edge. --img--  --img--  --img--  edited november 18, 2020 by brians", "sortedWord": "None", "identifyer": 24863, "year": "2020"}, {"Unnamed: 0": 363979, "autor": "Ken Abrahams", "date": 1600420680000, "content": "I am happy to say that moving forward with the \"brave new world\" is an exciting prospect. It's like getting old, we tend to take less risks, get stuck in routines and remember the good old days until you decide to do something for the first time and learn something new. I love the rendering of the M Monochrom and I still use it today. I was talking to a photographer the other day how the Leica Monochrom's can uniquely render blurs and out of focus areas. I love using slower shutter speeds to achieve motion and then amplify the grain with the MM1. The M10M can do it too although I wish it had I.S. (like the SL2) so that everything else but the moving subject was perfectly sharp. Its a bit of a talking point however that I spend money on the Monochrom to get the best quality blurry images but that's what I learned to do achieve with the MM1. The M10M is a new beast and perhaps requires a different approach in the exploration of how it fits into anyones style of work and the scheme of the brave new world or not? The whole photographic landscape is changing anyway. I scroll though hundreds of images every week because they do not grab my eye or is it because I have become jaded and overexposed by social media's constant desensitising process to imagery we once were totally amazed by? Mediocre images abound and some of those are because we settle into our patterns of shooting subjects available on daily walks. Certainly pre Covid times there were at least shots from Saint Tropez, Africa and other exotic travel locations and those images were very good. Over and out", "link": "https://www.l-camera-forum.com/topic/313364-leica-monochrom-ccd-who%E2%80%99s-selling-why/page/2/?tab=comments#comment-4048004", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i am happy to say that moving forward with the \"brave new world\" is an exciting prospect. it's like getting old, we tend to take less risks, get stuck in routines and remember the good old days until you decide to do something for the first time and learn something new. i love the rendering of the m monochrom and i still use it today. i was talking to a photographer the other day how the leica monochrom's can uniquely render blurs and out of focus areas. i love using slower shutter speeds to achieve motion and then amplify the grain with the mm1. the m10m can do it too although i wish it had i.s. (like the sl2) so that everything else but the moving subject was perfectly sharp. its a bit of a talking point however that i spend money on the monochrom to get the best quality blurry images but that's what i learned to do achieve with the mm1. the m10m is a new beast and perhaps requires a different approach in the exploration of how it fits into anyones style of work and the scheme of the brave new world or not? the whole photographic landscape is changing anyway. i scroll though hundreds of images every week because they do not grab my eye or is it because i have become jaded and overexposed by social media's constant desensitising process to imagery we once were totally amazed by? mediocre images abound and some of those are because we settle into our patterns of shooting subjects available on daily walks. certainly pre covid times there were at least shots from saint tropez, africa and other exotic travel -----> locations !!!  and those images were very good. over and out", "sortedWord": "None", "identifyer": 25234, "year": "2020"}, {"Unnamed: 0": 363987, "autor": "BrianS", "date": 1600692060000, "content": "1 hour ago, AceVentura1986 said: Wow, that’s great. I don’t have any coding experience, tho, and more than likely by the time this happens in the future I’ll will have forgotten this thread. LOL. Thankyou. \"on my list of fun coding projects\"- I'll make the program more flexible by reading in a simple text file that gives the location of the faults, and have it apply corrections. Of course it is free, and I like to share Source Code and executables.", "link": "https://www.l-camera-forum.com/topic/313364-leica-monochrom-ccd-who%E2%80%99s-selling-why/page/2/?tab=comments#comment-4049778", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "1 hour ago, aceventura1986 said: wow, that’s great. i don’t have any coding experience, tho, and more than likely by the time this happens in the future i’ll will have forgotten this thread. lol. thankyou. \"on my list of fun coding projects\"- i'll make the program more flexible by reading in a simple text file that gives the -----> location !!!  of the faults, and have it apply corrections. of course it is free, and i like to share source code and executables.", "sortedWord": "None", "identifyer": 25242, "year": "2020"}, {"Unnamed: 0": 363997, "autor": "AceVentura1986", "date": 1600734960000, "content": "11 hours ago, BrianS said: Thankyou. \"on my list of fun coding projects\"- I'll make the program more flexible by reading in a simple text file that gives the location of the faults, and have it apply corrections. Of course it is free, and I like to share Source Code and executables. Well, if you think this is something you’d like to share I’ll PM you w my email.", "link": "https://www.l-camera-forum.com/topic/313364-leica-monochrom-ccd-who%E2%80%99s-selling-why/page/3/?tab=comments#comment-4050141", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "11 hours ago, brians said: thankyou. \"on my list of fun coding projects\"- i'll make the program more flexible by reading in a simple text file that gives the -----> location !!!  of the faults, and have it apply corrections. of course it is free, and i like to share source code and executables. well, if you think this is something you’d like to share i’ll pm you w my email.", "sortedWord": "None", "identifyer": 25252, "year": "2020"}, {"Unnamed: 0": 364273, "autor": "digger1914", "date": 1598570940000, "content": "I think there may be issues, as there will be data in the M10 that is not present in the M10M. I am thinking of items like White Balance settings. I would assume the camera looks for specific settings in specific location in the file. Enjoy your new toy when it arrives!", "link": "https://www.l-camera-forum.com/topic/312687-user-profiles-m10-m10-monochrom/?tab=comments#comment-4034751", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i think there may be issues, as there will be data in the m10 that is not present in the m10m. i am thinking of items like white balance settings. i would assume the camera looks for specific settings in specific -----> location !!!  in the file. enjoy your new toy when it arrives!", "sortedWord": "None", "identifyer": 25528, "year": "2020"}, {"Unnamed: 0": 364704, "autor": "LeicaR10", "date": 1594336860000, "content": "Dancook, I was in the same place with the two M10 cameras and S system. (I also tried the excellent SL system but my clients didn't like the way the photographs rendered in a too perfect way as I was often told) But after reviewing my many photographs taken with the three cameras, I came to the conclusion each has its niche and usefulness in photography. My clients who purchase my photographs agree depending on their need and requirements. I found the M10-M renders a incredibly smooth tonal range that I do not have the time nor interest to achieve with the M10-P via conversions. The S3 and system are in a league unto its own. It renders in a cinematic way, smooth color hues and in detail that my clients require. I have on order the M10-R that will arrive shortly and that will replace the M10-P. In my business and genre of landscape photography I came to the conclusion that I need M cameras for times when I must hike to very remote, hazardous locations and need to limit weight. The M cameras fill this requirement. The S3 and system is superb and my clients vote with their wallets. Depending on your genre of photography and requirements for camera gear, you might well find you don't need the Hasselblad if the results prove outstanding with the M10-M and say a M10-P or R. Last, I believe there is no cure for GAS...I have been to GAS rehab many times only to relapse like so many...so I just enjoy creating photographs with excellent Leica gear. Hope this helps. r/ Mark Edited July 9, 2020 by LeicaR10 Edit", "link": "https://www.l-camera-forum.com/topic/310345-both-m10-monochrom-and-m10p/page/2/?tab=comments#comment-4006559", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "dancook, i was in the same place with the two m10 cameras and s system. (i also tried the excellent sl system but my clients didn't like the way the photographs rendered in a too perfect way as i was often told) but after reviewing my many photographs taken with the three cameras, i came to the conclusion each has its niche and usefulness in photography. my clients who purchase my photographs agree depending on their need and requirements. i found the m10-m renders a incredibly smooth tonal range that i do not have the time nor interest to achieve with the m10-p via conversions. the s3 and system are in a league unto its own. it renders in a cinematic way, smooth color hues and in detail that my clients require. i have on order the m10-r that will arrive shortly and that will replace the m10-p. in my business and genre of landscape photography i came to the conclusion that i need m cameras for times when i must hike to very remote, hazardous -----> locations !!!  and need to limit weight. the m cameras fill this requirement. the s3 and system is superb and my clients vote with their wallets. depending on your genre of photography and requirements for camera gear, you might well find you don't need the hasselblad if the results prove outstanding with the m10-m and say a m10-p or r. last, i believe there is no cure for gas...i have been to gas rehab many times only to relapse like so many...so i just enjoy creating photographs with excellent leica gear. hope this helps. r/ mark edited july 9, 2020 by leicar10 edit", "sortedWord": "None", "identifyer": 25964, "year": "2020"}, {"Unnamed: 0": 365687, "autor": "bayernfan", "date": 1584689340000, "content": "48 minutes ago, John Black said: If money is a non-issue, I vote for the M10M. If somebody wasn't sure about Monochrom and just wanted to test the waters, the M-246 is a much easier pill to swallow. I'm not going to say anything bad about the M-246. I used it for years and took 1000s of images with it. Learned so much with it. Still learning. I love my M10M - which is good because we probably won't see a M11M until 2024 or 2025 John, I see you are also a North-Texan. Many of the locations on your website look familiar to me. I was shooting in Whitewright a few days ago! Perhaps we could get together in the near future, discuss small towns and cameras. -Alex Edited March 20, 2020 by bayernfan", "link": "https://www.l-camera-forum.com/topic/307090-m-246-vs-m10-m/page/2/?tab=comments#comment-3935049", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "48 minutes ago, john black said: if money is a non-issue, i vote for the m10m. if somebody wasn't sure about monochrom and just wanted to test the waters, the m-246 is a much easier pill to swallow. i'm not going to say anything bad about the m-246. i used it for years and took 1000s of images with it. learned so much with it. still learning. i love my m10m - which is good because we probably won't see a m11m until 2024 or 2025 john, i see you are also a north-texan. many of the -----> locations !!!  on your website look familiar to me. i was shooting in whitewright a few days ago! perhaps we could get together in the near future, discuss small towns and cameras. -alex edited march 20, 2020 by bayernfan", "sortedWord": "None", "identifyer": 26951, "year": "2020"}, {"Unnamed: 0": 365699, "autor": "michaellanda", "date": 1583428740000, "content": "19 minutes ago, Jeff S said: If it’s not, and if you bought it from them, get a new one. Jeff The problem is that I purchased the camera from the DC location. Let’s hope the NY store can resolve the ‘issue’", "link": "https://www.l-camera-forum.com/topic/307132-leica-m10-monochrom-rf-focusing/?tab=comments#comment-3925278", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "19 minutes ago, jeff s said: if it’s not, and if you bought it from them, get a new one. jeff the problem is that i purchased the camera from the dc -----> location !!! . let’s hope the ny store can resolve the ‘issue’", "sortedWord": "None", "identifyer": 26963, "year": "2020"}, {"Unnamed: 0": 365702, "autor": "Jeff S", "date": 1583430120000, "content": "21 minutes ago, michaellanda said: The problem is that I purchased the camera from the DC location. Let’s hope the NY store can resolve the ‘issue’ If they diagnose a problem that requires service, you can still call Leica DC to discuss an exchange. Jeff", "link": "https://www.l-camera-forum.com/topic/307132-leica-m10-monochrom-rf-focusing/?tab=comments#comment-3925294", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "21 minutes ago, michaellanda said: the problem is that i purchased the camera from the dc -----> location !!! . let’s hope the ny store can resolve the ‘issue’ if they diagnose a problem that requires service, you can still call leica dc to discuss an exchange. jeff", "sortedWord": "None", "identifyer": 26966, "year": "2020"}, {"Unnamed: 0": 365710, "autor": "michaellanda", "date": 1583504940000, "content": "33 minutes ago, dkmoore said: My recommendation, if possible, is to swing over to Leica USA in Allendale and they will correct any issues in 15 minutes. I recommend this since you purchased from Leica DC. If there is an issue, Leica SOHO will have to send your camera to Allendale and it will get in the general queue, which may take a few weeks rather than minutes. Call ahead before you go. I do not have a vehicle to get to the NJ store. I have also heard very bad things about that location and how long items take to get returned. I’ll stop by the SOHO store first as it’s only 15 minutes from me and see what they have to say.", "link": "https://www.l-camera-forum.com/topic/307132-leica-m10-monochrom-rf-focusing/page/2/?tab=comments#comment-3925887", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "33 minutes ago, dkmoore said: my recommendation, if possible, is to swing over to leica usa in allendale and they will correct any issues in 15 minutes. i recommend this since you purchased from leica dc. if there is an issue, leica soho will have to send your camera to allendale and it will get in the general queue, which may take a few weeks rather than minutes. call ahead before you go. i do not have a vehicle to get to the nj store. i have also heard very bad things about that -----> location !!!  and how long items take to get returned. i’ll stop by the soho store first as it’s only 15 minutes from me and see what they have to say.", "sortedWord": "None", "identifyer": 26974, "year": "2020"}, {"Unnamed: 0": 366549, "autor": "DandA", "date": 1580482380000, "content": " Hi All, I encountered a strange problem. I have the original NIk filters installed in Photoshop on my Windows 10 CPU. I can open any Tiff or jpeg file from any camera (except one) in any of the Nik programs from within Photoshop. Yet when I open a MM1 monochrome image in Photoshop (a Tiff or jpeg.... when I go to the filters drop down menu in Photoshop, the Nik selection is grayed out and not available. In addition, if I for example open both a Tiff or jpeg from any other camera in Photoshop along with opening a Tiff or jpeg from the MM1, if I highlight the file from any other camera, the Nik filter selection is available but if I highlight the MM1 Tiff or jpeg, it's grayed out. I can also access the usual Nik filter selections on the right side of the Photoshop window where a Nik filter selection is located and when I try selecting any Nik program/filter with a MM1 file from this location (instead of Photoshops filter drop down selection), it simple says Nik selection is not available. I even tried some MM1 files shot years ago that opened with Nik previously but even those don't any longer. Other than that, Nik filters seems to work perfectly with every other Tiff and jpeg from every other camera file. I have learned that the original Nik filters now available from DxO can be used as a stand alone and I haven't yet downloaded and tried this but can't see why the Nik filters in Photoshop don't work with my MM1 files \"only\". Any ideas of what this issue is would be greatly appreciated. Thanks. Dave Edited January 31, 2020 by DandA", "link": "https://www.l-camera-forum.com/topic/305946-mm1-files-no-longer-open-in-nik-filters/?tab=comments#comment-3903251", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " hi all, i encountered a strange problem. i have the original nik filters installed in photoshop on my windows 10 cpu. i can open any tiff or jpeg file from any camera (except one) in any of the nik programs from within photoshop. yet when i open a mm1 monochrome image in photoshop (a tiff or jpeg.... when i go to the filters drop down menu in photoshop, the nik selection is grayed out and not available. in addition, if i for example open both a tiff or jpeg from any other camera in photoshop along with opening a tiff or jpeg from the mm1, if i highlight the file from any other camera, the nik filter selection is available but if i highlight the mm1 tiff or jpeg, it's grayed out. i can also access the usual nik filter selections on the right side of the photoshop window where a nik filter selection is located and when i try selecting any nik program/filter with a mm1 file from this -----> location !!!  (instead of photoshops filter drop down selection), it simple says nik selection is not available. i even tried some mm1 files shot years ago that opened with nik previously but even those don't any longer. other than that, nik filters seems to work perfectly with every other tiff and jpeg from every other camera file. i have learned that the original nik filters now available from dxo can be used as a stand alone and i haven't yet downloaded and tried this but can't see why the nik filters in photoshop don't work with my mm1 files \"only\". any ideas of what this issue is would be greatly appreciated. thanks. dave edited january 31, 2020 by danda", "sortedWord": "None", "identifyer": 27820, "year": "2020"}, {"Unnamed: 0": 368914, "autor": "Einst_Stein", "date": 1600036380000, "content": "That 0.2mm light path means the sensor location is off by about 0.1mm too close to the lens, assuming the glass refractive index is 1.6 and the air is 1.0. This implies when you focus a relatively close object it will be projected to the image plain supposed to be for infinite (and infinite will always be out of focus). This does not count the light dispersion effect due to the glass thickness. The light dispersion effect can not be fixed by the shim. The focus error will make the following object to be projected like the inifinite. 1: focal length 16mm: Objects beyond ~2.5m can not be focused. 2: focal length 25mm: Objects beyond ~6.2m. 3: focal length 28mm: object beyond ~8m 4: focal length 35mm: ~13m 5: focal length 50mm: ~25m 6: focal length 90mm: ~80m I guess this issue is almost irrelevant given the M RF accuracy.", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/4/?tab=comments#comment-4045430", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "that 0.2mm light path means the sensor -----> location !!!  is off by about 0.1mm too close to the lens, assuming the glass refractive index is 1.6 and the air is 1.0. this implies when you focus a relatively close object it will be projected to the image plain supposed to be for infinite (and infinite will always be out of focus). this does not count the light dispersion effect due to the glass thickness. the light dispersion effect can not be fixed by the shim. the focus error will make the following object to be projected like the inifinite. 1: focal length 16mm: objects beyond ~2.5m can not be focused. 2: focal length 25mm: objects beyond ~6.2m. 3: focal length 28mm: object beyond ~8m 4: focal length 35mm: ~13m 5: focal length 50mm: ~25m 6: focal length 90mm: ~80m i guess this issue is almost irrelevant given the m rf accuracy.", "sortedWord": "None", "identifyer": 30210, "year": "2020"}, {"Unnamed: 0": 368916, "autor": "dllewellyn", "date": 1600039980000, "content": "59 minutes ago, Einst_Stein said: That 0.2mm light path means the sensor location is off by about 0.1mm too close to the lens, assuming the glass refractive index is 1.6 and the air is 1.0. This implies when you focus a relatively close object it will be projected to the image plain supposed to be for infinite (and infinite will always be out of focus). This does not count the light dispersion effect due to the glass thickness. The light dispersion effect can not be fixed by the shim. The focus error will make the following object to be projected like the inifinite. 1: focal length 16mm: Objects beyond ~2.5m can not be focused. 2: focal length 25mm: Objects beyond ~6.2m. 3: focal length 28mm: object beyond ~8m 4: focal length 35mm: ~13m 5: focal length 50mm: ~25m 6: focal length 90mm: ~80m I guess this issue is almost irrelevant given the M RF accuracy.", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/4/?tab=comments#comment-4045447", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "59 minutes ago, einst_stein said: that 0.2mm light path means the sensor -----> location !!!  is off by about 0.1mm too close to the lens, assuming the glass refractive index is 1.6 and the air is 1.0. this implies when you focus a relatively close object it will be projected to the image plain supposed to be for infinite (and infinite will always be out of focus). this does not count the light dispersion effect due to the glass thickness. the light dispersion effect can not be fixed by the shim. the focus error will make the following object to be projected like the inifinite. 1: focal length 16mm: objects beyond ~2.5m can not be focused. 2: focal length 25mm: objects beyond ~6.2m. 3: focal length 28mm: object beyond ~8m 4: focal length 35mm: ~13m 5: focal length 50mm: ~25m 6: focal length 90mm: ~80m i guess this issue is almost irrelevant given the m rf accuracy.", "sortedWord": "None", "identifyer": 30212, "year": "2020"}, {"Unnamed: 0": 368926, "autor": "kristyansen", "date": 1600119900000, "content": "vor 22 Stunden schrieb Einst_Stein: That 0.2mm light path means the sensor location is off by about 0.1mm too close to the lens, assuming the glass refractive index is 1.6 and the air is 1.0. This implies when you focus a relatively close object it will be projected to the image plain supposed to be for infinite (and infinite will always be out of focus). This does not count the light dispersion effect due to the glass thickness. The light dispersion effect can not be fixed by the shim. The focus error will make the following object to be projected like the inifinite. 1: focal length 16mm: Objects beyond ~2.5m can not be focused. 2: focal length 25mm: Objects beyond ~6.2m. 3: focal length 28mm: object beyond ~8m 4: focal length 35mm: ~13m 5: focal length 50mm: ~25m 6: focal length 90mm: ~80m I guess this issue is almost irrelevant given the M RF accuracy. Dear all, My M9 experiences sensor corrosion now (announced to me by Leica today as I sent it for cleaning; I had the camera checked by Leica several times even during the free replacement period, and despite hard spots on the sensor it was several times confirmed by Leica that no corrosion existed, and I hoped it would be like this forever...). Either way I love the old sensor, which I think has a different color signature than the new sensor so I may consider such intervention. At the same time, in the future I intend to acquire a Leica Tri-Elmar 16-18-21, which of course I hope to have a high focus accuracy even at relatively close distances but which may go beyond 2.5m as per the lens focusing scale, and also I expect to have clarity edge-to-edge. For larger focus distances I see no issue. Two questions: 1. What could be done to also ensure focus accuracy for super wide angle: glass change to 0.8 instead of 0.6? (I need no IR capability.) 2. How could such a service be offered also in Europe? I expect quite high time / cost / administrative / tax complications by sending my M9 to the US and back. Thank you, Cris", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/5/?tab=comments#comment-4046017", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "vor 22 stunden schrieb einst_stein: that 0.2mm light path means the sensor -----> location !!!  is off by about 0.1mm too close to the lens, assuming the glass refractive index is 1.6 and the air is 1.0. this implies when you focus a relatively close object it will be projected to the image plain supposed to be for infinite (and infinite will always be out of focus). this does not count the light dispersion effect due to the glass thickness. the light dispersion effect can not be fixed by the shim. the focus error will make the following object to be projected like the inifinite. 1: focal length 16mm: objects beyond ~2.5m can not be focused. 2: focal length 25mm: objects beyond ~6.2m. 3: focal length 28mm: object beyond ~8m 4: focal length 35mm: ~13m 5: focal length 50mm: ~25m 6: focal length 90mm: ~80m i guess this issue is almost irrelevant given the m rf accuracy. dear all, my m9 experiences sensor corrosion now (announced to me by leica today as i sent it for cleaning; i had the camera checked by leica several times even during the free replacement period, and despite hard spots on the sensor it was several times confirmed by leica that no corrosion existed, and i hoped it would be like this forever...). either way i love the old sensor, which i think has a different color signature than the new sensor so i may consider such intervention. at the same time, in the future i intend to acquire a leica tri-elmar 16-18-21, which of course i hope to have a high focus accuracy even at relatively close distances but which may go beyond 2.5m as per the lens focusing scale, and also i expect to have clarity edge-to-edge. for larger focus distances i see no issue. two questions: 1. what could be done to also ensure focus accuracy for super wide angle: glass change to 0.8 instead of 0.6? (i need no ir capability.) 2. how could such a service be offered also in europe? i expect quite high time / cost / administrative / tax complications by sending my m9 to the us and back. thank you, cris", "sortedWord": "None", "identifyer": 30222, "year": "2020"}, {"Unnamed: 0": 368996, "autor": "martinot", "date": 1600733700000, "content": "Situation: Not me (I was working as a project manager, and not allowed into the facility it takes place in), but I know co workers working in a big data center in one of the mountain rooms for a big global manufacturing company. Some equipment in one of the server racks catches fire and starts to smoke badly. One of them runs for one of the fire extinguishers at the closet location. He has two choices; either a CO2 based one or powder based one. He is extremely stressed and do not think too much, and grabs the powder based fire extinguisher. Bad idea. We lost several rows with racks of computers, SAN and other network equipment for many, many millions of dollars. Edited September 22, 2020 by martinot", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/8/?tab=comments#comment-4050134", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "situation: not me (i was working as a project manager, and not allowed into the facility it takes place in), but i know co workers working in a big data center in one of the mountain rooms for a big global manufacturing company. some equipment in one of the server racks catches fire and starts to smoke badly. one of them runs for one of the fire extinguishers at the closet -----> location !!! . he has two choices; either a co2 based one or powder based one. he is extremely stressed and do not think too much, and grabs the powder based fire extinguisher. bad idea. we lost several rows with racks of computers, san and other network equipment for many, many millions of dollars. edited september 22, 2020 by martinot", "sortedWord": "None", "identifyer": 30292, "year": "2020"}, {"Unnamed: 0": 369020, "autor": "Raymondl", "date": 1602675480000, "content": "[14-10-2020] I have added additional images to the existing albums today as the lighting conditions were more optimal . [14-10-2020] Tests @ ISO 640 As part of my “rolling review” I have started testing the camera in “low light” conditions - typically at F2 1/125 @ ISO640 (exposed ~ - 1 EV) I started noticing some of the well documented “bad pixel column” appearing in my photos. It appears that there were several different fixes that Leica did.. they included but not limited to: -Firmware update to remap the bad pixel (I.e send Leica a DNG, they then send through an “personalised” firmware fix) -Sensor replacement -[Some users] It might go away with time -[Some users] Reset + long exposures will make it go away Looking at my previous files shot with my M9 (prior to the fix) I couldn’t see this digital artefact appearing at all ISO's. NOW I don’t know whether this was caused by the procedure, but one thing I do know is.... this has been happening for a very very long time ..Leica M8 ...and other camera manufacturers (once it reaches a “max value” it will start appearing). I want to avoid any speculations or debates but I wanted to outline what “worked” for me. Communication: -14-10-20 I have contacted Kolari Vision to inform them of my findings (attached picture). But I am suspecting it has nothing to do with their procedure. Observations: -it appears at all ISO’s it’s just more difficult to find the \"column\" when I was shooting during the day -it’s more visible when shooting at ISO 640 especially in the shadows Solution: Pixel fixer - “Solution” (that worked for me) Q. What is it ? -Windows tool called “pixel fixer” (free) -This tool has the capability of going through all your M9 DNG’s at a folder level to remove the hot strip (“bad pixel column”) -Additionally there are other options on what you want to do with the original file (I’ll get to that in abit” Q. How do you set it up? -As the exact location of the “column” will vary, you will need to setup a “baseline file” -This \"baseline file\" is then used by \"pixel fixer\" to determine where exactly is the column (coordinates in pixels) is located -To setup a baseline photo we want a “black” image so that the column is visible. This will make it easier for the software the find the coordinates. I just shot with your lens cap on + ISO 640 (job done) -Upon selecting the pixels, you will then need to go to settings in the “pixel fixer” [top tip] make sure each of the pixels (4) has “vertical” selected (I forgot to select this initially, that’s why it wasn’t “working”) Outcome: pixel fixer now knows exactly where the “column” is for your specific camera Q. What does it mean for my workflow Abit more annoying for me... My setup: -I use a Mac -I store my photos on my NAS -I use LR My Workflow Stage 1 - Import - filter & edit in LR process (no change) -Import files from SD card to LR [DD-MM_M9] -filter and edit (as per norm) Stage 2 - [NEW] When you are ready to export In LR -Goal: we are ready to “export the images”, we now need to use “pixel fixed” to “remove” these columns. -Steps: -open “pixel fixer” [windows] select “folder”, go to the folder where the photos are stored -I like to select “delete” the original files to “recycling bin” once the “fixed” DNG files have been exported -hit Run and wait till it’s completed -Outcome: All your DNG file name and metadata will remain the same but it will have the “fix”, the original DNG files they had the “column defect” will now appear in your recycling bin (safety net - just in case). Stage 3 - Export process (no change) -In LR I just hit export... as all the file names are the same the exported files will look fine (I.e without the “column defect”) -End. --img-- ", "link": "https://www.l-camera-forum.com/topic/313260-sensor-corrosion-analysis-and-fix-merged/page/9/?tab=comments#comment-4062555", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "[14-10-2020] i have added additional images to the existing albums today as the lighting conditions were more optimal . [14-10-2020] tests @ iso 640 as part of my “rolling review” i have started testing the camera in “low light” conditions - typically at f2 1/125 @ iso640 (exposed ~ - 1 ev) i started noticing some of the well documented “bad pixel column” appearing in my photos. it appears that there were several different fixes that leica did.. they included but not limited to: -firmware update to remap the bad pixel (i.e send leica a dng, they then send through an “personalised” firmware fix) -sensor replacement -[some users] it might go away with time -[some users] reset + long exposures will make it go away looking at my previous files shot with my m9 (prior to the fix) i couldn’t see this digital artefact appearing at all iso's. now i don’t know whether this was caused by the procedure, but one thing i do know is.... this has been happening for a very very long time ..leica m8 ...and other camera manufacturers (once it reaches a “max value” it will start appearing). i want to avoid any speculations or debates but i wanted to outline what “worked” for me. communication: -14-10-20 i have contacted kolari vision to inform them of my findings (attached picture). but i am suspecting it has nothing to do with their procedure. observations: -it appears at all iso’s it’s just more difficult to find the \"column\" when i was shooting during the day -it’s more visible when shooting at iso 640 especially in the shadows solution: pixel fixer - “solution” (that worked for me) q. what is it ? -windows tool called “pixel fixer” (free) -this tool has the capability of going through all your m9 dng’s at a folder level to remove the hot strip (“bad pixel column”) -additionally there are other options on what you want to do with the original file (i’ll get to that in abit” q. how do you set it up? -as the exact -----> location !!!  of the “column” will vary, you will need to setup a “baseline file” -this \"baseline file\" is then used by \"pixel fixer\" to determine where exactly is the column (coordinates in pixels) is located -to setup a baseline photo we want a “black” image so that the column is visible. this will make it easier for the software the find the coordinates. i just shot with your lens cap on + iso 640 (job done) -upon selecting the pixels, you will then need to go to settings in the “pixel fixer” [top tip] make sure each of the pixels (4) has “vertical” selected (i forgot to select this initially, that’s why it wasn’t “working”) outcome: pixel fixer now knows exactly where the “column” is for your specific camera q. what does it mean for my workflow abit more annoying for me... my setup: -i use a mac -i store my photos on my nas -i use lr my workflow stage 1 - import - filter & edit in lr process (no change) -import files from sd card to lr [dd-mm_m9] -filter and edit (as per norm) stage 2 - [new] when you are ready to export in lr -goal: we are ready to “export the images”, we now need to use “pixel fixed” to “remove” these columns. -steps: -open “pixel fixer” [windows] select “folder”, go to the folder where the photos are stored -i like to select “delete” the original files to “recycling bin” once the “fixed” dng files have been exported -hit run and wait till it’s completed -outcome: all your dng file name and metadata will remain the same but it will have the “fix”, the original dng files they had the “column defect” will now appear in your recycling bin (safety net - just in case). stage 3 - export process (no change) -in lr i just hit export... as all the file names are the same the exported files will look fine (i.e without the “column defect”) -end. --img-- ", "sortedWord": "None", "identifyer": 30316, "year": "2020"}, {"Unnamed: 0": 370773, "autor": "Boojay", "date": 1606936440000, "content": "11 minutes ago, dummilux said: Sure, emails from Leica are official communication. So, that means: There are still sensors available but in limited quantities. Ask them to see if they still are in stock. No luck involved. As I said above, maybe depends on your location, given that I've seen it reported before that Jersey still had them, but this side of the pond, Officical Communication to me from Leica, having asked twice, is No sensors available. So lucky for you, unlucky for me!", "link": "https://www.l-camera-forum.com/topic/315682-my-sensor-has-worms/?tab=comments#comment-4091037", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "11 minutes ago, dummilux said: sure, emails from leica are official communication. so, that means: there are still sensors available but in limited quantities. ask them to see if they still are in stock. no luck involved. as i said above, maybe depends on your -----> location !!! , given that i've seen it reported before that jersey still had them, but this side of the pond, officical communication to me from leica, having asked twice, is no sensors available. so lucky for you, unlucky for me!", "sortedWord": "None", "identifyer": 32073, "year": "2020"}, {"Unnamed: 0": 370775, "autor": "Denys", "date": 1606942560000, "content": "1 hour ago, Boojay said: As I said above, maybe depends on your location, given that I've seen it reported before that Jersey still had them, but this side of the pond, Officical Communication to me from Leica, having asked twice, is No sensors available. So lucky for you, unlucky for me! Maybe not unlucky - ‘what’s meant to be’! Your upgrade? M10-R?", "link": "https://www.l-camera-forum.com/topic/315682-my-sensor-has-worms/?tab=comments#comment-4091090", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "1 hour ago, boojay said: as i said above, maybe depends on your -----> location !!! , given that i've seen it reported before that jersey still had them, but this side of the pond, officical communication to me from leica, having asked twice, is no sensors available. so lucky for you, unlucky for me! maybe not unlucky - ‘what’s meant to be’! your upgrade? m10-r?", "sortedWord": "None", "identifyer": 32075, "year": "2020"}, {"Unnamed: 0": 371739, "autor": "Jeff S", "date": 1597516260000, "content": "1 hour ago, pedaes said: How much do you pay for such a Policy? I have never seen this option for cover in the UK - but I guess the old adage is you can insure for anything, at a price. Not very expensive (in US) as a separate rider to my premium home policy. Terms vary greatly by policy, location and individual circumstances. Companies like Chubb and AIG offer plans with full replacement value, no deductible, worldwide. I insure collectibles as well as camera gear. Jeff", "link": "https://www.l-camera-forum.com/topic/312348-what-should-i-do-with-my-m9-now/?tab=comments#comment-4027647", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "1 hour ago, pedaes said: how much do you pay for such a policy? i have never seen this option for cover in the uk - but i guess the old adage is you can insure for anything, at a price. not very expensive (in us) as a separate rider to my premium home policy. terms vary greatly by policy, -----> location !!!  and individual circumstances. companies like chubb and aig offer plans with full replacement value, no deductible, worldwide. i insure collectibles as well as camera gear. jeff", "sortedWord": "None", "identifyer": 33040, "year": "2020"}, {"Unnamed: 0": 371740, "autor": "pedaes", "date": 1597518480000, "content": "31 minutes ago, Jeff S said: Not very expensive (in US) as a separate rider to my premium home policy. Terms vary greatly by policy, location and individual circumstances. Companies like Chubb and AIG offer plans with full replacement value, no deductible, worldwide. I insure collectibles as well as camera gear. Jeff I also have all my cameras and lenses insured through the home policy by stipulated value as much cheaper than 'specialist' cover. It covers loss and accidental damage, but not a failure like a corroded sensor. You have quite a policy there.", "link": "https://www.l-camera-forum.com/topic/312348-what-should-i-do-with-my-m9-now/?tab=comments#comment-4027666", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "31 minutes ago, jeff s said: not very expensive (in us) as a separate rider to my premium home policy. terms vary greatly by policy, -----> location !!!  and individual circumstances. companies like chubb and aig offer plans with full replacement value, no deductible, worldwide. i insure collectibles as well as camera gear. jeff i also have all my cameras and lenses insured through the home policy by stipulated value as much cheaper than 'specialist' cover. it covers loss and accidental damage, but not a failure like a corroded sensor. you have quite a policy there.", "sortedWord": "None", "identifyer": 33041, "year": "2020"}, {"Unnamed: 0": 372650, "autor": "Einst_Stein", "date": 1591047900000, "content": "On 5/16/2020 at 4:41 AM, oekoek said: Sensor is clean, no scratches 😀 many thanks Congratulation! Though you have settled the problem, I still want to share my experience, hoping it can help someone else. What I learned the most important thing in wet cleaning is \"NEVER USE TOO MUCH\" cleaning liquid. The key is, the sensor starting edge should be 70-90% dried when the wiper reaches the end edge. It's not necessary high concentration, though it helps. I've used from 70% to 90%. They all work fine. I assume you already know, before applying the wet clean, dry clean first. I found a gentle brush with an static electrical charged brush works best. This stiff will suck the dirt on the surface to the brush, you then take out them off the camera cavity. Some people do it by blowing the air to the sensor, but I have been warned by a local store not top do that. It simply relocates the dust to somewhere else in the camera, but may come to the undesired location.", "link": "https://www.l-camera-forum.com/topic/308963-did-i-scratch-my-sensor-while-cleaning/?tab=comments#comment-3984819", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on 5/16/2020 at 4:41 am, oekoek said: sensor is clean, no scratches 😀 many thanks congratulation! though you have settled the problem, i still want to share my experience, hoping it can help someone else. what i learned the most important thing in wet cleaning is \"never use too much\" cleaning liquid. the key is, the sensor starting edge should be 70-90% dried when the wiper reaches the end edge. it's not necessary high concentration, though it helps. i've used from 70% to 90%. they all work fine. i assume you already know, before applying the wet clean, dry clean first. i found a gentle brush with an static electrical charged brush works best. this stiff will suck the dirt on the surface to the brush, you then take out them off the camera cavity. some people do it by blowing the air to the sensor, but i have been warned by a local store not top do that. it simply relocates the dust to somewhere else in the camera, but may come to the undesired -----> location !!! .", "sortedWord": "None", "identifyer": 33954, "year": "2020"}, {"Unnamed: 0": 372651, "autor": "oekoek", "date": 1591115040000, "content": " 18 hours ago, Einst_Stein said: Congratulation! Though you have settled the problem, I still want to share my experience, hoping it can help someone else. What I learned the most important thing in wet cleaning is \"NEVER USE TOO MUCH\" cleaning liquid. The key is, the sensor starting edge should be 70-90% dried when the wiper reaches the end edge. It's not necessary high concentration, though it helps. I've used from 70% to 90%. They all work fine. I assume you already know, before applying the wet clean, dry clean first. I found a gentle brush with an static electrical charged brush works best. This stiff will suck the dirt on the surface to the brush, you then take out them off the camera cavity. Some people do it by blowing the air to the sensor, but I have been warned by a local store not top do that. It simply relocates the dust to somewhere else in the camera, but may come to the undesired location. Yes, thank you, I found it quite hard to get the proper (small) amount of liquid on the swap, that took some practice, like Ko.Fe. already said, you have to be patient. For dry cleaning I use the Giotto rocket blower and Visible dust Artic butterfly. I heard/read some different opinions about the use of rocket blowers for sensor, I hold the camera sensor faced downwards and blow the air gently on the sensor, sometimes about 30cm above the nozzle of my vacuum cleaner (on lowest power). Hopefully it will be dry cleaning for a while from now on, I didn't like the wet cleaning at all. The sensors of my ME(220) and MM1 seem to be very attractive to dust, but dust spots are also easy to remove in post processing.", "link": "https://www.l-camera-forum.com/topic/308963-did-i-scratch-my-sensor-while-cleaning/?tab=comments#comment-3985323", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " 18 hours ago, einst_stein said: congratulation! though you have settled the problem, i still want to share my experience, hoping it can help someone else. what i learned the most important thing in wet cleaning is \"never use too much\" cleaning liquid. the key is, the sensor starting edge should be 70-90% dried when the wiper reaches the end edge. it's not necessary high concentration, though it helps. i've used from 70% to 90%. they all work fine. i assume you already know, before applying the wet clean, dry clean first. i found a gentle brush with an static electrical charged brush works best. this stiff will suck the dirt on the surface to the brush, you then take out them off the camera cavity. some people do it by blowing the air to the sensor, but i have been warned by a local store not top do that. it simply relocates the dust to somewhere else in the camera, but may come to the undesired -----> location !!! . yes, thank you, i found it quite hard to get the proper (small) amount of liquid on the swap, that took some practice, like ko.fe. already said, you have to be patient. for dry cleaning i use the giotto rocket blower and visible dust artic butterfly. i heard/read some different opinions about the use of rocket blowers for sensor, i hold the camera sensor faced downwards and blow the air gently on the sensor, sometimes about 30cm above the nozzle of my vacuum cleaner (on lowest power). hopefully it will be dry cleaning for a while from now on, i didn't like the wet cleaning at all. the sensors of my me(220) and mm1 seem to be very attractive to dust, but dust spots are also easy to remove in post processing.", "sortedWord": "None", "identifyer": 33955, "year": "2020"}, {"Unnamed: 0": 372911, "autor": "jaapv", "date": 1587027000000, "content": "46 minutes ago, auceps said: The Summicron C was designed for the rangefinder of the Leica CL (made by Minolta). There is no second helicoid to transform the moving of the lens to the requirements of the Leica-M rangefinder. In former times Leitz gave an advice for this. It was made by Leitz Wetzlar. Minolta brought out a second version to go with the CLE. It had different coatings. The warning was about less precision when focusing, not about systematic misfocus. However, even when it was new, this lens was found to focus perfectly on any M camera. It still does, I use mine regularly. There is one thing to watch: The optical cell is fixed in the barrel by a simple screw-in ring and has no location notch. Those rings are prone to work loose and although it is dead easy to reassemble, it may be that somebody made a mistake putting it together or tried to \"adjust\" the lens by shimming or made a composite out of two lenses - the cell and the mount were matched by Leica when building the lens. Have it checked out by a repair person. It is well worth it - these are lovely lenses.", "link": "https://www.l-camera-forum.com/topic/308597-problem-leitz-wetzlar-40mm-f2-on-m9/?tab=comments#comment-3954750", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "46 minutes ago, auceps said: the summicron c was designed for the rangefinder of the leica cl (made by minolta). there is no second helicoid to transform the moving of the lens to the requirements of the leica-m rangefinder. in former times leitz gave an advice for this. it was made by leitz wetzlar. minolta brought out a second version to go with the cle. it had different coatings. the warning was about less precision when focusing, not about systematic misfocus. however, even when it was new, this lens was found to focus perfectly on any m camera. it still does, i use mine regularly. there is one thing to watch: the optical cell is fixed in the barrel by a simple screw-in ring and has no -----> location !!!  notch. those rings are prone to work loose and although it is dead easy to reassemble, it may be that somebody made a mistake putting it together or tried to \"adjust\" the lens by shimming or made a composite out of two lenses - the cell and the mount were matched by leica when building the lens. have it checked out by a repair person. it is well worth it - these are lovely lenses.", "sortedWord": "None", "identifyer": 34215, "year": "2020"}, {"Unnamed: 0": 380253, "autor": "tommonego@gmail.com", "date": 1594908480000, "content": "Finally got this figured out, tough to get to and had to go back to my DOS brain to figure it out. This is the site I got from another photo site. https://m8raw2dng.de/ It didn't give as far as I could determine options for the parameters, except color (-b). The droplet, batch file, needs exact locations, being command line interface. I put the app in its own folder under C:\\Windows\\Program files and set the droplet accordingly. My one problem was I called the folder m8RAWtoDNG and kept putting the paths as C:_______\\m8RAW2DNG\\m8RAW4DNG which of course wouln't work, once that was corrected everything worked fine. I haven't upped the ISO past 640, but the results at 640 were great, much better than standard 640 DNG. The only frustration I am having is the when the camera goes to sleep you lose the JPeg fine & Raw setting, I set the sleep time to 10 minutes which should help.", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/7/?tab=comments#comment-4009742", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "finally got this figured out, tough to get to and had to go back to my dos brain to figure it out. this is the site i got from another photo site. https://m8raw2dng.de/ it didn't give as far as i could determine options for the parameters, except color (-b). the droplet, batch file, needs exact -----> locations !!! , being command line interface. i put the app in its own folder under c:\\windows\\program files and set the droplet accordingly. my one problem was i called the folder m8rawtodng and kept putting the paths as c:_______\\m8raw2dng\\m8raw4dng which of course wouln't work, once that was corrected everything worked fine. i haven't upped the iso past 640, but the results at 640 were great, much better than standard 640 dng. the only frustration i am having is the when the camera goes to sleep you lose the jpeg fine & raw setting, i set the sleep time to 10 minutes which should help.", "sortedWord": "None", "identifyer": 41641, "year": "2020"}, {"Unnamed: 0": 380914, "autor": "Jeff S", "date": 1587174000000, "content": "4 minutes ago, rivi1969 said: I never thought about that. So the frame lines are not adjusted to the conversion factor of 1.33x? A 35mm lens will bring 35mm frame lines regardless of the 46.5mm actual field of view? The field of view IS adjusted to reflect the smaller, cropped sensor. One needn’t do any calculation; just view the scene. The frame lines correspond to the focal length used; the focal length of the lens remains constant, on any format. The resultant pic is the same as one taken with the same lens (from the same location) on ‘full frame’ like other digital M’s, but cropped in post. So, a 28mm lens, but with roughly the field of view from a 35mm lens, despite using the 28mm frame lines. Jeff", "link": "https://www.l-camera-forum.com/topic/308646-just-got-my-m8-confused-about-frame-lines/?tab=comments#comment-3955814", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "4 minutes ago, rivi1969 said: i never thought about that. so the frame lines are not adjusted to the conversion factor of 1.33x? a 35mm lens will bring 35mm frame lines regardless of the 46.5mm actual field of view? the field of view is adjusted to reflect the smaller, cropped sensor. one needn’t do any calculation; just view the scene. the frame lines correspond to the focal length used; the focal length of the lens remains constant, on any format. the resultant pic is the same as one taken with the same lens (from the same -----> location !!! ) on ‘full frame’ like other digital m’s, but cropped in post. so, a 28mm lens, but with roughly the field of view from a 35mm lens, despite using the 28mm frame lines. jeff", "sortedWord": "None", "identifyer": 42304, "year": "2020"}, {"Unnamed: 0": 381071, "autor": "Merv-O", "date": 1584794520000, "content": "21 minutes ago, farnz said: The M8 is also relevant today and underpinned by my still using it today. The M8.2 is an excellent camera although it can't offer 1/8000th shutter speed, which has come in very handy on occasion. Apart from 2 metre parallax frame lines the only other differences as far as I recall are cosmetic. Pete. Actually, there are several differences that many thought made the M8.2 the real M9 and were improvements. For example: 1. As you stated the viewfinder was altered to 2 meters (from the earlier film M's) and this could be retrofitted on original M8's. 2. The Shutter was made more durable and quiet by a shorter throw design. This in turn, reduced the maximum speed to 1/4000. But it also created a menu-selectable option to delay the motorized shutter causing the muffled click found on future M digital cameras 3. The exposure compensation settings can be made by holding the shutter release button half-way and making the corrections with the rear dial--saves time and is efficient. 4. The (in)famous S setting or 'snapshot' mode with 6-bit lenses. I find it very useful in fast paced locations, particularly in using 35mm lenses and wider or for taking repeat pictures and not wanting to or having time to re-set; the camera does a great job most of the time in these conditions to let me be free to shoot without over thinking/changing the settings. 5. the sapphire or guerrilla glass on the rear LCD made it more durable and for some reason, M8.2's are less prone to the coffee stain anomaly which plagues some M8's. These were not insignificant changes, though the bottom line is, it's the CCD 10.3 APS-h sensor that is the winner on both models....it is also why after selling my original 8, I bought a low shuttered (less than 1000 clicks) in museum condition almost 2 years ago and enjoy it immensely.", "link": "https://www.l-camera-forum.com/topic/297521-buy-an-m8-in-2019/page/2/?tab=comments#comment-3935863", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "21 minutes ago, farnz said: the m8 is also relevant today and underpinned by my still using it today. the m8.2 is an excellent camera although it can't offer 1/8000th shutter speed, which has come in very handy on occasion. apart from 2 metre parallax frame lines the only other differences as far as i recall are cosmetic. pete. actually, there are several differences that many thought made the m8.2 the real m9 and were improvements. for example: 1. as you stated the viewfinder was altered to 2 meters (from the earlier film m's) and this could be retrofitted on original m8's. 2. the shutter was made more durable and quiet by a shorter throw design. this in turn, reduced the maximum speed to 1/4000. but it also created a menu-selectable option to delay the motorized shutter causing the muffled click found on future m digital cameras 3. the exposure compensation settings can be made by holding the shutter release button half-way and making the corrections with the rear dial--saves time and is efficient. 4. the (in)famous s setting or 'snapshot' mode with 6-bit lenses. i find it very useful in fast paced -----> locations !!! , particularly in using 35mm lenses and wider or for taking repeat pictures and not wanting to or having time to re-set; the camera does a great job most of the time in these conditions to let me be free to shoot without over thinking/changing the settings. 5. the sapphire or guerrilla glass on the rear lcd made it more durable and for some reason, m8.2's are less prone to the coffee stain anomaly which plagues some m8's. these were not insignificant changes, though the bottom line is, it's the ccd 10.3 aps-h sensor that is the winner on both models....it is also why after selling my original 8, i bought a low shuttered (less than 1000 clicks) in museum condition almost 2 years ago and enjoy it immensely.", "sortedWord": "None", "identifyer": 42461, "year": "2020"}, {"Unnamed: 0": 393345, "autor": "Tom R", "date": 1607345520000, "content": "I'm sure everyone is different. For my workflow, I prefer digital for \"sketch\" work and for leisurely topics, e.g., holidays, family-related themes, ... . Fast turnaround and lower processing costs. For \"work\", I use the digital camera when I have a particular theme/project in mind and have the opportunity to visit the location/subject at my leisure. In this setting, the digital camera makes it easier to try different ideas and obtain quick, inexpensive feedback. Armed with that information, I then choose either film (if I want the final image to appear like a film image), or reshoot with a digital camera--in this instance, it is often true that the original \"sketch\" is sufficient. Of course, life is ever-changing and it's often the case that one has to work with the tool in-hand at the time. Because I prefer to carry a 35mm film camera with a 35 or 28mm lens, that translates into more film than digital images in my workflow.", "link": "https://www.l-camera-forum.com/topic/315812-shooting-both-film-and-digital/?tab=comments#comment-4093893", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i'm sure everyone is different. for my workflow, i prefer digital for \"sketch\" work and for leisurely topics, e.g., holidays, family-related themes, ... . fast turnaround and lower processing costs. for \"work\", i use the digital camera when i have a particular theme/project in mind and have the opportunity to visit the -----> location !!! /subject at my leisure. in this setting, the digital camera makes it easier to try different ideas and obtain quick, inexpensive feedback. armed with that information, i then choose either film (if i want the final image to appear like a film image), or reshoot with a digital camera--in this instance, it is often true that the original \"sketch\" is sufficient. of course, life is ever-changing and it's often the case that one has to work with the tool in-hand at the time. because i prefer to carry a 35mm film camera with a 35 or 28mm lens, that translates into more film than digital images in my workflow.", "sortedWord": "None", "identifyer": 5809, "year": "2020"}, {"Unnamed: 0": 394325, "autor": "mnutzer", "date": 1606018260000, "content": "vor einer Stunde schrieb Torontoamateur: Who has used the Leicavit on the M-A and what did you think of it? Did you use it much? What was it really good for ? What kind of shooting? I am thinking of getting both the M-A and a Leicavit. I presently have a M4-P and M6. Perhaps a Leicavit makes sense if you need a series of photos that have to be shot one after the other faster than you could manage with the film lever of your mechanical Leicas. Or if you think you want to choose the best photo from a quickly shot series afterwards. But these days no 'frenzied reporter' uses analog Leicas anymore. And your subject should not move away from the location, because in addition to operating the Leicavit's transport lever, I have never seen anyone who would have readjusted the distance at the same time. A nice addition is the tripod connection, which is located more in the middle of the Leicavit's base plate and possibly offers a little more stability with heavier lenses. Only - mounted on a tripod, the Leicavit's quick-action lever can no longer be operated ...😎 My guess: Today there are more useful camera equipments for quick image sequences, therefore most Leicavits should be lying around completely unused since years in the collectors' showcases.", "link": "https://www.l-camera-forum.com/topic/314546-leicavit/?tab=comments#comment-4084853", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "vor einer stunde schrieb torontoamateur: who has used the leicavit on the m-a and what did you think of it? did you use it much? what was it really good for ? what kind of shooting? i am thinking of getting both the m-a and a leicavit. i presently have a m4-p and m6. perhaps a leicavit makes sense if you need a series of photos that have to be shot one after the other faster than you could manage with the film lever of your mechanical leicas. or if you think you want to choose the best photo from a quickly shot series afterwards. but these days no 'frenzied reporter' uses analog leicas anymore. and your subject should not move away from the -----> location !!! , because in addition to operating the leicavit's transport lever, i have never seen anyone who would have readjusted the distance at the same time. a nice addition is the tripod connection, which is located more in the middle of the leicavit's base plate and possibly offers a little more stability with heavier lenses. only - mounted on a tripod, the leicavit's quick-action lever can no longer be operated ...😎 my guess: today there are more useful camera equipments for quick image sequences, therefore most leicavits should be lying around completely unused since years in the collectors' showcases.", "sortedWord": "None", "identifyer": 6790, "year": "2020"}, {"Unnamed: 0": 404103, "autor": "Archiver", "date": 1581123780000, "content": "Tin Cheung has three locations, in iSquare shopping mall on Nathan Road, in Man Yee Arcade in Central, and in Sim City, Shantung Street Mong Kok. They used to be in the K11 Art Mall back in 2013. David Chan's place in Champagne Court in Tsim Sha Tsui is legendary, although I've never bought there. There are a few camera shops in there with a lot of cool gear. --img--  --img--  Edited February 8, 2020 by Archiver", "link": "https://www.l-camera-forum.com/topic/304858-buying-leica-in-hong-kong/?tab=comments#comment-3908376", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "tin cheung has three -----> locations !!! , in isquare shopping mall on nathan road, in man yee arcade in central, and in sim city, shantung street mong kok. they used to be in the k11 art mall back in 2013. david chan's place in champagne court in tsim sha tsui is legendary, although i've never bought there. there are a few camera shops in there with a lot of cool gear. --img--  --img--  edited february 8, 2020 by archiver", "sortedWord": "None", "identifyer": 16863, "year": "2020"}, {"Unnamed: 0": 404106, "autor": "insideline", "date": 1582660080000, "content": "On 2/7/2020 at 6:03 PM, Archiver said: Tin Cheung has three locations, in iSquare shopping mall on Nathan Road, in Man Yee Arcade in Central, and in Sim City, Shantung Street Mong Kok. They used to be in the K11 Art Mall back in 2013. David Chan's place in Champagne Court in Tsim Sha Tsui is legendary, although I've never bought there. There are a few camera shops in there with a lot of cool gear. --img--  --img--  I do quite a bit of business with Danny Ho at All Good Friend Camera in Hong Kong, Kowloon in the same area as these shops and he is incredibly responsive, very fast to ship and always seems to have great prices on both new and used Leica equipment.", "link": "https://www.l-camera-forum.com/topic/304858-buying-leica-in-hong-kong/?tab=comments#comment-3919705", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "on 2/7/2020 at 6:03 pm, archiver said: tin cheung has three -----> locations !!! , in isquare shopping mall on nathan road, in man yee arcade in central, and in sim city, shantung street mong kok. they used to be in the k11 art mall back in 2013. david chan's place in champagne court in tsim sha tsui is legendary, although i've never bought there. there are a few camera shops in there with a lot of cool gear. --img--  --img--  i do quite a bit of business with danny ho at all good friend camera in hong kong, kowloon in the same area as these shops and he is incredibly responsive, very fast to ship and always seems to have great prices on both new and used leica equipment.", "sortedWord": "None", "identifyer": 16866, "year": "2020"}, {"Unnamed: 0": 416082, "autor": "albireo_double", "date": 1579555320000, "content": "On 1/4/2020 at 12:39 AM, caissa said: What I don't understand: The company priolite offers a perfect flash system for Leica (transmitter and everything since more than a year). They are not cheap, but cheaper than profoto for example. Still hardly anybody buys them. I have tried it and they work perfectly (robust and easy to setup). (But I use flash rarely, so I did not buy any flash system. This is probably typical for many Leica users). Rather people keep on complaining and asking for the impossible (a change in strategy). Even if all this happens, a solution along that road will come earliest in a few years. So I simply think people have no real problem. The solution is there, but hardly anybody uses it. Just this endless list of complaints. Ridiculous. If you have a real problem, open a self-help group and together buy one priolite set and test it in depth. Then you will know in a few days if it offers what you need or if you have to wait another year or two for something else. If you can afford one of the new noctiluxes, then the priolite set is just a fraction of this. (The priolite system actually works with almost any camera brand, so even if you go away from Leica, there is no danger to be stranded with unusabe stuff. Unlike the Leica flashes, that nobody but Leica can use). I was surprised when they announced that they will offer a Leica transmitter (about 2 years ago), because it was only for a small potential user group. And now I have the impression, it was maybe a bad decision (I wonder how many (or probably few) transmitters for Leica they sold in the last two years). When I tried to order Priolite some time ago, the battery strobe I tried to order was out of stock. May have been a coincidence but it made me change my mind. Furthermore, buying strobes is not necessarily a one-off decision - you are more likely buying into a system, depending on your needs and use. Priolite use the Bowens bayonet which is of course quite wide-spread, despite Bowens going bankrupt a year or two ago. But if you look at the Profoto system, you get a lot of interesting strobes and modifiers for all sorts of uses, both new, second hand or in rental shops. Work in a studio, with assistants? Rent or buy a power pack (D4 Air can be bought very reasonably second hand on eBay). Or get a couple of D2 monoblocks with great power and speed. Have a location shoot planned, without assistants, or your shoot is of the \"run and gun\" variety? Pack a couple of B10s (or A1s) with some umbrellas and lightweight OCF modifiers (the B10s are smaller than many lenses, still providing 250ws of power). Want to use a big pro ring flash? No problem (got mine from eBay for approx. 400 Eur). So, in the end, while the Priolite is a nice system that can work with a lot of Bowens-type modifiers, it is the big brands (Profoto, Elinchrom, Broncolor) that provide much wider system options for the avid strobe user. Meanwhile, Godox provide the cheaper solutions with the fastest developing feature sets and innovations (the AD200 mini strobes for example are rightly very popular). Markus Klinko has been a big advocate of Godox; I find his occasional write-ups on various blog sites quite useful. I have talked to Leica, Profoto and Elinchrom regarding support - everybody just says \"we are constantly improving our products but we cannot say if and when, blah, blah, blah\". I have suggested here and to Leica several times to adopt the Nikon protocol (like Hasselblad has done) given that their hotshoe is physically the same. I have given up hope. It is almost like some sort of subversion at Leica: we don't care that there is a Profoto and Elinchrom system trigger for every other camera system out there (even Pentax nowadays...). Buy a Leica S with a bunch of CS lenses if you want to sync your strobes at fast shutters speeds. And one more thing to set the record straight here: Some users have mentioned in this thread that trigger X or Y works fine with their Leica. In each case, these are the \"dumb\" radio triggers that will work with nearly every camera out there. There is no reason to advertise that \"my Elinchrom Skyport Plus / Profoto Air Sync or Connect works fine with my Leica SL and I don't complain\". Of course it works - at any speed up to the camera's max sync speed (more or less). So no problem if you shoot in a darkened studio or anywhere with relatively low ambient light level. These \"dumb\" triggers work like that with every camera ever produced that has a standard hotshoe. Even with cameras that have no hotshoe at all, just an X sync contact, if you connect the short cable provided with the trigger. What we are talking about is being able to sync at shorter sync speeds, beyond the camera's max sync speed, i.e. HS or HSS mode, depending on the strobe manufacturer. The purpose is to manage ambient exposure on location, outside of a darkened studio, without having to stop the lens down a lot or without using ND filters. Leica S users with CS lenses, or Leica Q users, can of course sync at much faster speeds (1/1000s and 1/2000s, respectively) with even with the \"dumb\" triggers - this is a feature of the leaf shutters used in their lenses. But with cameras with focal plane shutters (like the SL) this is possible only with dedicated, \"intelligent\" air triggers, that communicate with the camera body and switch into the HS/HSS mode automatically, whenever the shutter speed set exceeds the camera's max sync speed. In the ideal world, we would also be able to use TTL - which may be useful to some and not so useful to others. In the Profoto system, these are called Air-TTL triggers, in the Elinchrom world, they are the Transmitter Pro triggers, and for Broncolor, they are the RFS 2.2 triggers. This is what we are asking Leica and the strobe guys to offer us. Edited January 20, 2020 by albireo_double", "link": "https://www.l-camera-forum.com/topic/303662-leica-sl2-and-flash/page/3/?tab=comments#comment-3895808", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on 1/4/2020 at 12:39 am, caissa said: what i don't understand: the company priolite offers a perfect flash system for leica (transmitter and everything since more than a year). they are not cheap, but cheaper than profoto for example. still hardly anybody buys them. i have tried it and they work perfectly (robust and easy to setup). (but i use flash rarely, so i did not buy any flash system. this is probably typical for many leica users). rather people keep on complaining and asking for the impossible (a change in strategy). even if all this happens, a solution along that road will come earliest in a few years. so i simply think people have no real problem. the solution is there, but hardly anybody uses it. just this endless list of complaints. ridiculous. if you have a real problem, open a self-help group and together buy one priolite set and test it in depth. then you will know in a few days if it offers what you need or if you have to wait another year or two for something else. if you can afford one of the new noctiluxes, then the priolite set is just a fraction of this. (the priolite system actually works with almost any camera brand, so even if you go away from leica, there is no danger to be stranded with unusabe stuff. unlike the leica flashes, that nobody but leica can use). i was surprised when they announced that they will offer a leica transmitter (about 2 years ago), because it was only for a small potential user group. and now i have the impression, it was maybe a bad decision (i wonder how many (or probably few) transmitters for leica they sold in the last two years). when i tried to order priolite some time ago, the battery strobe i tried to order was out of stock. may have been a coincidence but it made me change my mind. furthermore, buying strobes is not necessarily a one-off decision - you are more likely buying into a system, depending on your needs and use. priolite use the bowens bayonet which is of course quite wide-spread, despite bowens going bankrupt a year or two ago. but if you look at the profoto system, you get a lot of interesting strobes and modifiers for all sorts of uses, both new, second hand or in rental shops. work in a studio, with assistants? rent or buy a power pack (d4 air can be bought very reasonably second hand on ebay). or get a couple of d2 monoblocks with great power and speed. have a -----> location !!!  shoot planned, without assistants, or your shoot is of the \"run and gun\" variety? pack a couple of b10s (or a1s) with some umbrellas and lightweight ocf modifiers (the b10s are smaller than many lenses, still providing 250ws of power). want to use a big pro ring flash? no problem (got mine from ebay for approx. 400 eur). so, in the end, while the priolite is a nice system that can work with a lot of bowens-type modifiers, it is the big brands (profoto, elinchrom, broncolor) that provide much wider system options for the avid strobe user. meanwhile, godox provide the cheaper solutions with the fastest developing feature sets and innovations (the ad200 mini strobes for example are rightly very popular). markus klinko has been a big advocate of godox; i find his occasional write-ups on various blog sites quite useful. i have talked to leica, profoto and elinchrom regarding support - everybody just says \"we are constantly improving our products but we cannot say if and when, blah, blah, blah\". i have suggested here and to leica several times to adopt the nikon protocol (like hasselblad has done) given that their hotshoe is physically the same. i have given up hope. it is almost like some sort of subversion at leica: we don't care that there is a profoto and elinchrom system trigger for every other camera system out there (even pentax nowadays...). buy a leica s with a bunch of cs lenses if you want to sync your strobes at fast shutters speeds. and one more thing to set the record straight here: some users have mentioned in this thread that trigger x or y works fine with their leica. in each case, these are the \"dumb\" radio triggers that will work with nearly every camera out there. there is no reason to advertise that \"my elinchrom skyport plus / profoto air sync or connect works fine with my leica sl and i don't complain\". of course it works - at any speed up to the camera's max sync speed (more or less). so no problem if you shoot in a darkened studio or anywhere with relatively low ambient light level. these \"dumb\" triggers work like that with every camera ever produced that has a standard hotshoe. even with cameras that have no hotshoe at all, just an x sync contact, if you connect the short cable provided with the trigger. what we are talking about is being able to sync at shorter sync speeds, beyond the camera's max sync speed, i.e. hs or hss mode, depending on the strobe manufacturer. the purpose is to manage ambient exposure on location, outside of a darkened studio, without having to stop the lens down a lot or without using nd filters. leica s users with cs lenses, or leica q users, can of course sync at much faster speeds (1/1000s and 1/2000s, respectively) with even with the \"dumb\" triggers - this is a feature of the leaf shutters used in their lenses. but with cameras with focal plane shutters (like the sl) this is possible only with dedicated, \"intelligent\" air triggers, that communicate with the camera body and switch into the hs/hss mode automatically, whenever the shutter speed set exceeds the camera's max sync speed. in the ideal world, we would also be able to use ttl - which may be useful to some and not so useful to others. in the profoto system, these are called air-ttl triggers, in the elinchrom world, they are the transmitter pro triggers, and for broncolor, they are the rfs 2.2 triggers. this is what we are asking leica and the strobe guys to offer us. edited january 20, 2020 by albireo_double", "sortedWord": "None", "identifyer": 29025, "year": "2020"}, {"Unnamed: 0": 416085, "autor": "fotonutzz", "date": 1580379660000, "content": "On 12/9/2019 at 9:58 AM, nryn said: I just finished a 4-day shoot for a book with an SL2, SF C1 and 3 flashes: an SF 60 and two MG-10s. I have wanted for some time to get away from bringing my huge strobes everywhere. A few notes: The MG-10s are excellent flashes and work well with the SF C1 and SL2. As reported in this thread and elsewhere, the SL2 has some hiccups when using with a flash: I couldn't get the flashes to fire consistently in A or S modes, nor could I figure out the conditions under which they either would or would not fire. It wasn't sync speed, TTL vs. M, or anything like that. It just seemed random, both in my testing before the shoot and whenever I tried to use A or S during the shoot. It wasn't a big deal--I usually expose manually when using flash anyway. But it's strange and I suspect it's a bug. HSS only works in TTL. I don't find TTL on the SL2 very good. Shooting from the same location, same exposure, same ambient light--I got exposures all over the place. Like with exposure mode on the camera, I went to manual on the flashes as well. The SF C1 is a nice piece of kit. I've used a number of remote triggers such as this, which allow you to control individual flash output independently, and I found this controller intuitive and slick. I like that it is low-profile and well-made. The SF 60 is OK; I ended up using it occasionally as a bounce flash to remove shadows and relied on the MG-10s for primary flash (to counter some strong sunlight from windows). Pretty happy with the results and extremely happy with the portability of this lighting kit. I don't think the Einsteins will come out of the drawer very often anymore. Do you hv problems with the SF60? My SF64 fires off intermittently. When the camera \"feels\" that there is sufficient light, the flash will not fire at all. This rules out fill-in flash during the daytime when I’m outdoors. The only recourse is to set the camera to M and the flash will fire. Setting it to P, A or S, it acts like a compact camera and won’t fire the flash when there’s sufficient light....very frustrating. Hope Leica will hv a firmware update to fix this bug fast!", "link": "https://www.l-camera-forum.com/topic/303662-leica-sl2-and-flash/page/3/?tab=comments#comment-3902460", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "on 12/9/2019 at 9:58 am, nryn said: i just finished a 4-day shoot for a book with an sl2, sf c1 and 3 flashes: an sf 60 and two mg-10s. i have wanted for some time to get away from bringing my huge strobes everywhere. a few notes: the mg-10s are excellent flashes and work well with the sf c1 and sl2. as reported in this thread and elsewhere, the sl2 has some hiccups when using with a flash: i couldn't get the flashes to fire consistently in a or s modes, nor could i figure out the conditions under which they either would or would not fire. it wasn't sync speed, ttl vs. m, or anything like that. it just seemed random, both in my testing before the shoot and whenever i tried to use a or s during the shoot. it wasn't a big deal--i usually expose manually when using flash anyway. but it's strange and i suspect it's a bug. hss only works in ttl. i don't find ttl on the sl2 very good. shooting from the same -----> location !!! , same exposure, same ambient light--i got exposures all over the place. like with exposure mode on the camera, i went to manual on the flashes as well. the sf c1 is a nice piece of kit. i've used a number of remote triggers such as this, which allow you to control individual flash output independently, and i found this controller intuitive and slick. i like that it is low-profile and well-made. the sf 60 is ok; i ended up using it occasionally as a bounce flash to remove shadows and relied on the mg-10s for primary flash (to counter some strong sunlight from windows). pretty happy with the results and extremely happy with the portability of this lighting kit. i don't think the einsteins will come out of the drawer very often anymore. do you hv problems with the sf60? my sf64 fires off intermittently. when the camera \"feels\" that there is sufficient light, the flash will not fire at all. this rules out fill-in flash during the daytime when i’m outdoors. the only recourse is to set the camera to m and the flash will fire. setting it to p, a or s, it acts like a compact camera and won’t fire the flash when there’s sufficient light....very frustrating. hope leica will hv a firmware update to fix this bug fast!", "sortedWord": "None", "identifyer": 29028, "year": "2020"}, {"Unnamed: 0": 416647, "autor": "douglas ball", "date": 1578333480000, "content": "I have used the GPS on my SL on two occasions where it really proved to be useful.This was in Patagonia, in Chile and in Morocco and the Sahara. It worked beautifully. I doubt if there would have been any cell service in either location. Luckily I kept my SL and it will travel with my S1R as a backup. This makes a great combination IMO.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/2/?tab=comments#comment-3886265", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i have used the gps on my sl on two occasions where it really proved to be useful.this was in patagonia, in chile and in morocco and the sahara. it worked beautifully. i doubt if there would have been any cell service in either -----> location !!! . luckily i kept my sl and it will travel with my s1r as a backup. this makes a great combination imo.", "sortedWord": "None", "identifyer": 29648, "year": "2020"}, {"Unnamed: 0": 416648, "autor": "SrMi", "date": 1578334380000, "content": "13 minutes ago, douglas ball said: I have used the GPS on my SL on two occasions where it really proved to be useful.This was in Patagonia, in Chile and in Morocco and the Sahara. It worked beautifully. I doubt if there would have been any cell service in either location. Luckily I kept my SL and it will travel with my S1R as a backup. This makes a great combination IMO. With most phones you do not need cell service to collect GPS data.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/2/?tab=comments#comment-3886278", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "13 minutes ago, douglas ball said: i have used the gps on my sl on two occasions where it really proved to be useful.this was in patagonia, in chile and in morocco and the sahara. it worked beautifully. i doubt if there would have been any cell service in either -----> location !!! . luckily i kept my sl and it will travel with my s1r as a backup. this makes a great combination imo. with most phones you do not need cell service to collect gps data.", "sortedWord": "None", "identifyer": 29649, "year": "2020"}, {"Unnamed: 0": 416682, "autor": "Manicouagan1", "date": 1599434520000, "content": "It is apparent from the difficulties using FOTO's and a very similar experience with Nikon's SnapBridge that linking cell phones to cameras for navigation and location taging of photos is hard to do. Realize that to make the system work three radio frequency receivers have to maintain a signal lock: 1) the GPS receiver in the cell phone, 2) the bluetooth or WiFi receiver in the camera and 3) the bluetooth or WiiFi receiver in the Cell phone. Each of these receivers has to sort out the signal given the usual complications temporary interruptions due to physical barriers between the transmitter and the receiver as well as of multi-path effects not to mention inherent noise present in any signal. Power limitations in the camera and cell phone require time out functions to preserve battery life. Apparently these time outs interrupt the continuity of communication in such a way that the complete signal path can't be readily restored. In theory all these limitations would seem to be possible to overcome, but performance of FOTO's and SnapBridge suggest that converting theory to practice was beyond the state of the art when the SL2 system design was locked down. The technical limitations were apparently not understood until the testing phase. By then I suspect that there was hope that the software team could solve the loss of connection problem with changes in the FOTO's application in the cell phone, camera or both.. Obviously they did not. But with software there is always hope of a solution in another version if management will pay for it.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/4/?tab=comments#comment-4041324", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "it is apparent from the difficulties using foto's and a very similar experience with nikon's snapbridge that linking cell phones to cameras for navigation and -----> location !!!  taging of photos is hard to do. realize that to make the system work three radio frequency receivers have to maintain a signal lock: 1) the gps receiver in the cell phone, 2) the bluetooth or wifi receiver in the camera and 3) the bluetooth or wiifi receiver in the cell phone. each of these receivers has to sort out the signal given the usual complications temporary interruptions due to physical barriers between the transmitter and the receiver as well as of multi-path effects not to mention inherent noise present in any signal. power limitations in the camera and cell phone require time out functions to preserve battery life. apparently these time outs interrupt the continuity of communication in such a way that the complete signal path can't be readily restored. in theory all these limitations would seem to be possible to overcome, but performance of foto's and snapbridge suggest that converting theory to practice was beyond the state of the art when the sl2 system design was locked down. the technical limitations were apparently not understood until the testing phase. by then i suspect that there was hope that the software team could solve the loss of connection problem with changes in the foto's application in the cell phone, camera or both.. obviously they did not. but with software there is always hope of a solution in another version if management will pay for it.", "sortedWord": "None", "identifyer": 29683, "year": "2020"}, {"Unnamed: 0": 416683, "autor": "SrMi", "date": 1599436680000, "content": "35 minutes ago, Manicouagan1 said: It is apparent from the difficulties using FOTO's and a very similar experience with Nikon's SnapBridge that linking cell phones to cameras for navigation and location taging of photos is hard to do. Realize that to make the system work three radio frequency receivers have to maintain a signal lock: 1) the GPS receiver in the cell phone, 2) the bluetooth or WiFi receiver in the camera and 3) the bluetooth or WiiFi receiver in the Cell phone. Each of these receivers has to sort out the signal given the usual complications temporary interruptions due to physical barriers between the transmitter and the receiver as well as of multi-path effects not to mention inherent noise present in any signal. Power limitations in the camera and cell phone require time out functions to preserve battery life. Apparently these time outs interrupt the continuity of communication in such a way that the complete signal path can't be readily restored. In theory all these limitations would seem to be possible to overcome, but performance of FOTO's and SnapBridge suggest that converting theory to practice was beyond the state of the art when the SL2 system design was locked down. The technical limitations were apparently not understood until the testing phase. By then I suspect that there was hope that the software team could solve the loss of connection problem with changes in the FOTO's application in the cell phone, camera or both.. Obviously they did not. But with software there is always hope of a solution in another version if management will pay for it. Nikon's SnapBridge works pretty well for me.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/4/?tab=comments#comment-4041335", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "35 minutes ago, manicouagan1 said: it is apparent from the difficulties using foto's and a very similar experience with nikon's snapbridge that linking cell phones to cameras for navigation and -----> location !!!  taging of photos is hard to do. realize that to make the system work three radio frequency receivers have to maintain a signal lock: 1) the gps receiver in the cell phone, 2) the bluetooth or wifi receiver in the camera and 3) the bluetooth or wiifi receiver in the cell phone. each of these receivers has to sort out the signal given the usual complications temporary interruptions due to physical barriers between the transmitter and the receiver as well as of multi-path effects not to mention inherent noise present in any signal. power limitations in the camera and cell phone require time out functions to preserve battery life. apparently these time outs interrupt the continuity of communication in such a way that the complete signal path can't be readily restored. in theory all these limitations would seem to be possible to overcome, but performance of foto's and snapbridge suggest that converting theory to practice was beyond the state of the art when the sl2 system design was locked down. the technical limitations were apparently not understood until the testing phase. by then i suspect that there was hope that the software team could solve the loss of connection problem with changes in the foto's application in the cell phone, camera or both.. obviously they did not. but with software there is always hope of a solution in another version if management will pay for it. nikon's snapbridge works pretty well for me.", "sortedWord": "None", "identifyer": 29684, "year": "2020"}, {"Unnamed: 0": 417341, "autor": "michali", "date": 1605182880000, "content": " 42 minutes ago, NicholasT said: +1 Just to expand on the excellent advice in this and prior posts... The more time one spends observing the subject ahead of time studying their behavior, flight patters, lighting, background improves the chances of getting the shot. Also there is no substitute for perseverance and willingness to invest the time just to get the single shot one is visualizing in minds eye. By way of example the attached owl in flight images were taken with painstaking planning, a lot of patient waiting, repeated visits to shooting location, not to mention many failed attempts. The last photo in the series involved a total of 3 visits to burrowing owl location over 3 week period (3 hour drive round trip). The shutter speed selection of 1/1250 was no accident as I was trying to get the owl's eyes in focus and yet get a sense of movement in the wings. Excellent images Nicholas! Which lens & settings?", "link": "https://www.l-camera-forum.com/topic/314410-best-setting-for-sl2-shooting-bird-in-flight/page/2/?tab=comments#comment-4078852", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " 42 minutes ago, nicholast said: +1 just to expand on the excellent advice in this and prior posts... the more time one spends observing the subject ahead of time studying their behavior, flight patters, lighting, background improves the chances of getting the shot. also there is no substitute for perseverance and willingness to invest the time just to get the single shot one is visualizing in minds eye. by way of example the attached owl in flight images were taken with painstaking planning, a lot of patient waiting, repeated visits to shooting -----> location !!! , not to mention many failed attempts. the last photo in the series involved a total of 3 visits to burrowing owl location over 3 week period (3 hour drive round trip). the shutter speed selection of 1/1250 was no accident as i was trying to get the owl's eyes in focus and yet get a sense of movement in the wings. excellent images nicholas! which lens & settings?", "sortedWord": "None", "identifyer": 30345, "year": "2020"}, {"Unnamed: 0": 417349, "autor": "sillbeers15", "date": 1606224780000, "content": "There are limitations in reach from the 90-280mm. However the sharpness & contrast of the lens is nothing less than outstanding. To overcome the reach, there are alternatives to hauling a 500mm or longer lens. Below is an example of the SL2's autofocus set at AF-C tracking on a 12cm Stork Billed Kingfisher flying towards me. I've deliberately chosen a lower than usual shutter speed of 1/1250 sec with f4 to show motion blur on the bird's wing tips. I found the location of scene ideal for the BIF on an earlier visit which I shot the bird stationary on a tree. The bird takes a path no further than 3 meters from my position accross me above water. I also found the sun's position from the left of the shot ideal. After returning back to the scene failed 4 times. I finally managed to capture what I wanted on the 5th visit. During the shoot, another hobbist photographer came over to chat. He showed me his out of focus shot of the kingfisher in flight and asked me what camera I was using. He mumbled that he could get a focused BIF if only he was using my camera make and not his Nikon D850. I casually laughed hearing the comment as I am sure his camera settings were not optimised. It sounds all too often hearing comments in this forum by some members saying the SL / SL2 is useless for BIF and only Canon & Nikon can do the job. Iam happy with my SL2 & 90-280mm combination until a worthy Sigma L mount lens with longer focal comes available. Besides I expect the SL2 & S1/R camera's AF firmware to improve over time. --img-- stork billed kingfisher-1010052-6 by sillbeers15", "link": "https://www.l-camera-forum.com/topic/314410-best-setting-for-sl2-shooting-bird-in-flight/page/2/?tab=comments#comment-4086309", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "there are limitations in reach from the 90-280mm. however the sharpness & contrast of the lens is nothing less than outstanding. to overcome the reach, there are alternatives to hauling a 500mm or longer lens. below is an example of the sl2's autofocus set at af-c tracking on a 12cm stork billed kingfisher flying towards me. i've deliberately chosen a lower than usual shutter speed of 1/1250 sec with f4 to show motion blur on the bird's wing tips. i found the -----> location !!!  of scene ideal for the bif on an earlier visit which i shot the bird stationary on a tree. the bird takes a path no further than 3 meters from my position accross me above water. i also found the sun's position from the left of the shot ideal. after returning back to the scene failed 4 times. i finally managed to capture what i wanted on the 5th visit. during the shoot, another hobbist photographer came over to chat. he showed me his out of focus shot of the kingfisher in flight and asked me what camera i was using. he mumbled that he could get a focused bif if only he was using my camera make and not his nikon d850. i casually laughed hearing the comment as i am sure his camera settings were not optimised. it sounds all too often hearing comments in this forum by some members saying the sl / sl2 is useless for bif and only canon & nikon can do the job. iam happy with my sl2 & 90-280mm combination until a worthy sigma l mount lens with longer focal comes available. besides i expect the sl2 & s1/r camera's af firmware to improve over time. --img-- stork billed kingfisher-1010052-6 by sillbeers15", "sortedWord": "None", "identifyer": 30353, "year": "2020"}, {"Unnamed: 0": 418042, "autor": "meerec", "date": 1596235740000, "content": "6 hours ago, Photoworks said: yes, Fotos iPad App with 50$ year. but it is not as good as Camerange2. quite buggy, non responsive, slow and does not download any previews automatically . Ofter problems reconnections in a day require restart app or restart iPad Someone’s totally negative here, and unnecessarily so. It’s actually free, the paid version doesn’t add a lot of value and isn’t required in most cases. It’s very stable for me with SL2 and in addition to all use cases mentioned by the OP, it allows for location data be added to EXIF automatically. Yes the app has quirks, I was first to point them out and bitch about long time ago but one can live with them.", "link": "https://www.l-camera-forum.com/topic/311859-sl2-tethering-to-ipad-pro/?tab=comments#comment-4019173", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "6 hours ago, photoworks said: yes, fotos ipad app with 50$ year. but it is not as good as camerange2. quite buggy, non responsive, slow and does not download any previews automatically . ofter problems reconnections in a day require restart app or restart ipad someone’s totally negative here, and unnecessarily so. it’s actually free, the paid version doesn’t add a lot of value and isn’t required in most cases. it’s very stable for me with sl2 and in addition to all use cases mentioned by the op, it allows for -----> location !!!  data be added to exif automatically. yes the app has quirks, i was first to point them out and bitch about long time ago but one can live with them.", "sortedWord": "None", "identifyer": 31048, "year": "2020"}, {"Unnamed: 0": 418043, "autor": "Photoworks", "date": 1596289800000, "content": "14 hours ago, meerec said: Someone’s totally negative here, and unnecessarily so. It’s actually free, the paid version doesn’t add a lot of value and isn’t required in most cases. It’s very stable for me with SL2 and in addition to all use cases mentioned by the OP, it allows for location data be added to EXIF automatically. Yes the app has quirks, I was first to point them out and bitch about long time ago but one can live with them. you must be using a different app, maybe the iPhone version? the FOTOS for iPad has only 7 days trail and then subscription . From someone that uses the app all day on some shoot, I am negative because many time it does not work like it should. there is no alternative. I would complain less if the call it BETA", "link": "https://www.l-camera-forum.com/topic/311859-sl2-tethering-to-ipad-pro/?tab=comments#comment-4019432", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "14 hours ago, meerec said: someone’s totally negative here, and unnecessarily so. it’s actually free, the paid version doesn’t add a lot of value and isn’t required in most cases. it’s very stable for me with sl2 and in addition to all use cases mentioned by the op, it allows for -----> location !!!  data be added to exif automatically. yes the app has quirks, i was first to point them out and bitch about long time ago but one can live with them. you must be using a different app, maybe the iphone version? the fotos for ipad has only 7 days trail and then subscription . from someone that uses the app all day on some shoot, i am negative because many time it does not work like it should. there is no alternative. i would complain less if the call it beta", "sortedWord": "None", "identifyer": 31049, "year": "2020"}, {"Unnamed: 0": 419073, "autor": "scott kirkpatrick", "date": 1592677380000, "content": "8 hours ago, rfunnell said: Just wondering whether it may be time to try the Leica Fotos (paid app) ? Anyone have feedback on their experiences. I don't think there are any happy users of the paid version. The free version does some simple things pretty well (quick check of your pictures, remote triggering with liveview and basic controls accessible). Connecting to the camera is a little tricky but getting better and more stable. Geo-location is highly buggy. 6 hours ago, Realphotos said: Sorry to hear so many problems..... Tried the multi shot with the 24-90 Then tried it with the S adaptor and an S30 lens. The results are extraordinary. To top it off the iPhone app now works very smoothly and very quickly. Yes, such a problematic new firmware that a dozen of us have loaded up and gotten nice results by nightfall. (It came out at 3 pm CE time, 4 pm for me).", "link": "https://www.l-camera-forum.com/topic/310699-leica-sl2-firmware-20-187-mp-multishot-mode/page/4/?tab=comments#comment-3996454", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "8 hours ago, rfunnell said: just wondering whether it may be time to try the leica fotos (paid app) ? anyone have feedback on their experiences. i don't think there are any happy users of the paid version. the free version does some simple things pretty well (quick check of your pictures, remote triggering with liveview and basic controls accessible). connecting to the camera is a little tricky but getting better and more stable. geo------> location !!!  is highly buggy. 6 hours ago, realphotos said: sorry to hear so many problems..... tried the multi shot with the 24-90 then tried it with the s adaptor and an s30 lens. the results are extraordinary. to top it off the iphone app now works very smoothly and very quickly. yes, such a problematic new firmware that a dozen of us have loaded up and gotten nice results by nightfall. (it came out at 3 pm ce time, 4 pm for me).", "sortedWord": "None", "identifyer": 32083, "year": "2020"}, {"Unnamed: 0": 419127, "autor": "scott kirkpatrick", "date": 1592839620000, "content": "Ideally, multishot eliminates Moire. The shots are taken in groups of four, so that each pixel location now gets one red, one blue and two green filtered shots and there is no error from the Bayer color mosaic. They do that twice, with the second set of four shots taken at the center of the original grid of pixels. Now you have 2X the original number of pixels, and each has complete color information, just like a Foveon chip, but these 2X pixels are not placed on the right grid. The tricky part is turning all this nice Moire-free information back into a \"virtual\" set of 4X as many pixels as you started with, but color artifacts should not happen. The motion artifact elimination probably messes up this nice symmetry, in order to move things differently based on when they happened, and each color happened at a slightly different time. Edited June 22, 2020 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/310699-leica-sl2-firmware-20-187-mp-multishot-mode/page/7/?tab=comments#comment-3997504", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "ideally, multishot eliminates moire. the shots are taken in groups of four, so that each pixel -----> location !!!  now gets one red, one blue and two green filtered shots and there is no error from the bayer color mosaic. they do that twice, with the second set of four shots taken at the center of the original grid of pixels. now you have 2x the original number of pixels, and each has complete color information, just like a foveon chip, but these 2x pixels are not placed on the right grid. the tricky part is turning all this nice moire-free information back into a \"virtual\" set of 4x as many pixels as you started with, but color artifacts should not happen. the motion artifact elimination probably messes up this nice symmetry, in order to move things differently based on when they happened, and each color happened at a slightly different time. edited june 22, 2020 by scott kirkpatrick", "sortedWord": "None", "identifyer": 32137, "year": "2020"}, {"Unnamed: 0": 419481, "autor": "sebas_", "date": 1589617140000, "content": "GPS over Bluetooth has been enabled with the last app update. You have to press the three dots in the app next to the camera and then choose GPS always (beta). In the iPhone Setting you have Switch the Location data permission to always as well. so far it’s working on my SL2 Edited May 16, 2020 by sebas_", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/?tab=comments#comment-3974367", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "gps over bluetooth has been enabled with the last app update. you have to press the three dots in the app next to the camera and then choose gps always (beta). in the iphone setting you have switch the -----> location !!!  data permission to always as well. so far it’s working on my sl2 edited may 16, 2020 by sebas_", "sortedWord": "None", "identifyer": 32493, "year": "2020"}, {"Unnamed: 0": 419487, "autor": "scott kirkpatrick", "date": 1589646480000, "content": "Yes, I got it to show the GPS icon and put a location in SL2's file without making a wifi connection, too. Now to see if it is the right location. This was using the iOS version and an iPad Pro (large one). Also the iOS version handles camera settings properly. It accepted the basic settings that were on the camera (but changed my AF from spot to field). When I disconnected, the camera was in the state that I had moved it into. I did have to reset profile to my previous profile as Fotos puts profile into default. But Fotos did not change the letter I apply to each fie so that I will know which camera is being used. Previous versions went back to L100... numbering. Hurray! Warning, I don't think the Android version gets all of this right. They aren't the same. Nope. The Android version sets the SL2 into P mode and the AF in iAF (faces and bodies). If you change things in Remote to something that you want to use, the changes stick. Also, Fotos Remote doesn't change your exposure comp setting or the first letter of the file names. So that's a partial improvement for the Android version. Edited May 17, 2020 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/?tab=comments#comment-3974639", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "yes, i got it to show the gps icon and put a -----> location !!!  in sl2's file without making a wifi connection, too. now to see if it is the right location. this was using the ios version and an ipad pro (large one). also the ios version handles camera settings properly. it accepted the basic settings that were on the camera (but changed my af from spot to field). when i disconnected, the camera was in the state that i had moved it into. i did have to reset profile to my previous profile as fotos puts profile into default. but fotos did not change the letter i apply to each fie so that i will know which camera is being used. previous versions went back to l100... numbering. hurray! warning, i don't think the android version gets all of this right. they aren't the same. nope. the android version sets the sl2 into p mode and the af in iaf (faces and bodies). if you change things in remote to something that you want to use, the changes stick. also, fotos remote doesn't change your exposure comp setting or the first letter of the file names. so that's a partial improvement for the android version. edited may 17, 2020 by scott kirkpatrick", "sortedWord": "None", "identifyer": 32499, "year": "2020"}, {"Unnamed: 0": 419488, "autor": "Jared", "date": 1589654940000, "content": "10 hours ago, sebas_ said: GPS over Bluetooth has been enabled with the last app update. You have to press the three dots in the app next to the camera and then choose GPS always (beta). In the iPhone Setting you have Switch the Location data permission to always as well. so far it’s working on my SL2 I stand corrected! Thanks for pointing this out. I will play with it. Sounds like what I was looking for originally.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/?tab=comments#comment-3974739", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "10 hours ago, sebas_ said: gps over bluetooth has been enabled with the last app update. you have to press the three dots in the app next to the camera and then choose gps always (beta). in the iphone setting you have switch the -----> location !!!  data permission to always as well. so far it’s working on my sl2 i stand corrected! thanks for pointing this out. i will play with it. sounds like what i was looking for originally.", "sortedWord": "None", "identifyer": 32500, "year": "2020"}, {"Unnamed: 0": 419491, "autor": "scott kirkpatrick", "date": 1589723640000, "content": "Also, the location that Fotos saves is only accurate to a few ten-thousandths of a degree of latitude or longitude. That sounds pretty good, but most phones can do about one tenth of that. 0.0001 degree is 11 meters in latitude or longitude at the equator. My phones are typically good to about one meter when outdoors. You can check this on any map program by blowing things up to show buildings, curbs, etc. When I did this experiment with my S1R it generally reflected the phone's accuracy. So far my location errors are random and up to 20 m. I'll try this experiment again with a new Android phone and see if the data is any more accurate. EDIT: I just looked in the DNG file to see how the Geo information is stored. It is written in degrees, and minutes, with an accuracy of .01 minute. That's 1/6000 of a degree, so instead of 11 m accuracy, this means that the smallest difference that can be recorded is about 18 meters. C'mon, Leica, you can do better than that! I think most phones can deliver .001 minute accuracy. And I have found my Panasonic S1R saves its data good to 2-3 meters accuracy. EDIT2: I made a mistake, see below a few posts down. Edited May 17, 2020 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/?tab=comments#comment-3975191", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "also, the -----> location !!!  that fotos saves is only accurate to a few ten-thousandths of a degree of latitude or longitude. that sounds pretty good, but most phones can do about one tenth of that. 0.0001 degree is 11 meters in latitude or longitude at the equator. my phones are typically good to about one meter when outdoors. you can check this on any map program by blowing things up to show buildings, curbs, etc. when i did this experiment with my s1r it generally reflected the phone's accuracy. so far my location errors are random and up to 20 m. i'll try this experiment again with a new android phone and see if the data is any more accurate. edit: i just looked in the dng file to see how the geo information is stored. it is written in degrees, and minutes, with an accuracy of .01 minute. that's 1/6000 of a degree, so instead of 11 m accuracy, this means that the smallest difference that can be recorded is about 18 meters. c'mon, leica, you can do better than that! i think most phones can deliver .001 minute accuracy. and i have found my panasonic s1r saves its data good to 2-3 meters accuracy. edit2: i made a mistake, see below a few posts down. edited may 17, 2020 by scott kirkpatrick", "sortedWord": "None", "identifyer": 32503, "year": "2020"}, {"Unnamed: 0": 419492, "autor": "scott kirkpatrick", "date": 1589724720000, "content": "If you are having trouble connecting and delete the camera and reinstall it again in Fotos (a common practice), you will have to make the connection complete over wifi to get the camera listed in Fotos. Then and only then, you can set location logging to be always on (beta). And after that the camera can wake up, see the phone, show you the gps icon and start logging locations for each picture, using only Bluetooth. Edited May 17, 2020 by scott kirkpatrick", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/?tab=comments#comment-3975202", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "if you are having trouble connecting and delete the camera and reinstall it again in fotos (a common practice), you will have to make the connection complete over wifi to get the camera listed in fotos. then and only then, you can set -----> location !!!  logging to be always on (beta). and after that the camera can wake up, see the phone, show you the gps icon and start logging locations for each picture, using only bluetooth. edited may 17, 2020 by scott kirkpatrick", "sortedWord": "None", "identifyer": 32504, "year": "2020"}, {"Unnamed: 0": 419494, "autor": "msh58", "date": 1589740260000, "content": "vor 4 Stunden schrieb scott kirkpatrick: Also, the location that Fotos saves is only accurate to a few ten-thousandths of a degree of latitude or longitude. That sounds pretty good, but most phones can do about one tenth of that. 0.0001 degree is 11 meters in latitude or longitude at the equator. My phones are typically good to about one meter when outdoors. You can check this on any map program by blowing things up to show buildings, curbs, etc. When I did this experiment with my S1R it generally reflected the phone's accuracy. So far my location errors are random and up to 20 m. I'll try this experiment again with a new Android phone and see if the data is any more accurate. EDIT: I just looked in the DNG file to see how the Geo information is stored. It is written in degrees, and minutes, with an accuracy of .01 minute. That's 1/6000 of a degree, so instead of 11 m accuracy, this means that the smallest difference that can be recorded is about 18 meters. C'mon, Leica, you can do better than that! I think most phones can deliver .001 minute accuracy. And I have found my Panasonic S1R saves its data good to 2-3 meters accuracy. Is this correct? At least for me Lightroom and Mac Preview shows the Leica SL GPS locations at accuracy of 0.01 arc seconds, which is 1/360000 of a degree and corresponds to about 0.3 m on the equator. This, of course, does not directly tell anything about the accuracy of the GPS of the camera.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/?tab=comments#comment-3975342", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "vor 4 stunden schrieb scott kirkpatrick: also, the -----> location !!!  that fotos saves is only accurate to a few ten-thousandths of a degree of latitude or longitude. that sounds pretty good, but most phones can do about one tenth of that. 0.0001 degree is 11 meters in latitude or longitude at the equator. my phones are typically good to about one meter when outdoors. you can check this on any map program by blowing things up to show buildings, curbs, etc. when i did this experiment with my s1r it generally reflected the phone's accuracy. so far my location errors are random and up to 20 m. i'll try this experiment again with a new android phone and see if the data is any more accurate. edit: i just looked in the dng file to see how the geo information is stored. it is written in degrees, and minutes, with an accuracy of .01 minute. that's 1/6000 of a degree, so instead of 11 m accuracy, this means that the smallest difference that can be recorded is about 18 meters. c'mon, leica, you can do better than that! i think most phones can deliver .001 minute accuracy. and i have found my panasonic s1r saves its data good to 2-3 meters accuracy. is this correct? at least for me lightroom and mac preview shows the leica sl gps locations at accuracy of 0.01 arc seconds, which is 1/360000 of a degree and corresponds to about 0.3 m on the equator. this, of course, does not directly tell anything about the accuracy of the gps of the camera.", "sortedWord": "None", "identifyer": 32506, "year": "2020"}, {"Unnamed: 0": 419497, "autor": "Photoworks", "date": 1589758680000, "content": " I went on a bike ride today with my SL2, I found out that is you have a app running to track path the Leica Fotos app is not be able to share the GPS location with SL2 over BT. It work fine as soon I have terminated the other app.. sounds like a downside.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/page/2/?tab=comments#comment-3975520", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " i went on a bike ride today with my sl2, i found out that is you have a app running to track path the leica fotos app is not be able to share the gps -----> location !!!  with sl2 over bt. it work fine as soon i have terminated the other app.. sounds like a downside.", "sortedWord": "None", "identifyer": 32509, "year": "2020"}, {"Unnamed: 0": 419498, "autor": "davidmknoble", "date": 1589822700000, "content": "I have to say, this is one of the reasons I have debated going from the SL to the SL2. The other is that I would have to sell my second battery hand grip, really right stuff bracket and the remote shutter release - and then rebuy them all for the new SL2. I could deal somewhat with the rebuying of accessories, although I don't want to spend that money on this system. However, I shoot in many locations where I don't necessarily have my phone with me, or locations where charging a phone is difficult or very time consuming (solar). So, I do not want to waste phone battery for GPS images. One solution might be to put a GPS into the battery grip as a second alternative. Then, at least, there is a choice. This was what the M240 and M246 used the multi-function handgrip for and the M10's have the EVF. Requiring software on a running phone seems like a backwards solution. I was glad to see the S system was upgraded with the same body and form factor. As all the other S cameras, the focusing screens and the tripod mounts (and batteries) have not changed. There was one change for the battery grip and remote shutter release, but not bad for over 10 years. I will probably stay with the SL original...", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/page/2/?tab=comments#comment-3975989", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i have to say, this is one of the reasons i have debated going from the sl to the sl2. the other is that i would have to sell my second battery hand grip, really right stuff bracket and the remote shutter release - and then rebuy them all for the new sl2. i could deal somewhat with the rebuying of accessories, although i don't want to spend that money on this system. however, i shoot in many -----> locations !!!  where i don't necessarily have my phone with me, or -----> locations !!!  where charging a phone is difficult or very time consuming (solar). so, i do not want to waste phone battery for gps images. one solution might be to put a gps into the battery grip as a second alternative. then, at least, there is a choice. this was what the m240 and m246 used the multi-function handgrip for and the m10's have the evf. requiring software on a running phone seems like a backwards solution. i was glad to see the s system was upgraded with the same body and form factor. as all the other s cameras, the focusing screens and the tripod mounts (and batteries) have not changed. there was one change for the battery grip and remote shutter release, but not bad for over 10 years. i will probably stay with the sl original...", "sortedWord": "None", "identifyer": 32510, "year": "2020"}, {"Unnamed: 0": 419502, "autor": "BernardC", "date": 1589899740000, "content": "5 hours ago, spassig123 said: I don’t have a smartphone yet. Would it be possible in future to use an external small device on flash connectior if a manufacturer design it? Pentax, Canon, and Hasselblad have offered similar devices, and you will find a few DIY instructions on the Web. However, you can probably use Leica's solution with any Android or iOS device that has GPS, without a network connection. That list should include most iPads, many Android tablets, old smartphones, etc. You just need to make sure that you have a compatible OS version (Android 6 and up, not sure about iOS), and that the device uses a GPS chip to find its location.", "link": "https://www.l-camera-forum.com/topic/309594-geo-tagging-enabled/page/2/?tab=comments#comment-3976500", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "5 hours ago, spassig123 said: i don’t have a smartphone yet. would it be possible in future to use an external small device on flash connectior if a manufacturer design it? pentax, canon, and hasselblad have offered similar devices, and you will find a few diy instructions on the web. however, you can probably use leica's solution with any android or ios device that has gps, without a network connection. that list should include most ipads, many android tablets, old smartphones, etc. you just need to make sure that you have a compatible os version (android 6 and up, not sure about ios), and that the device uses a gps chip to find its -----> location !!! .", "sortedWord": "None", "identifyer": 32514, "year": "2020"}, {"Unnamed: 0": 422842, "autor": "Luca", "date": 1582226880000, "content": "APO SL50mm f2 @f2 with Leica SL2 at Venice Carnival. A perfect environment for this monster lens 🙂 Sorry cannot show file, even if it was below limit. It says : No locations to display. The content may not have been saved yet or may have been deleted. ??? How can I delete file and post and then retry ? thanks Edited February 20, 2020 by Luca missinig file", "link": "https://www.l-camera-forum.com/topic/305622-leica-apo-summicron-sl2035mm-average-performer/page/11/?tab=comments#comment-3916524", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "apo sl50mm f2 @f2 with leica sl2 at venice carnival. a perfect environment for this monster lens 🙂 sorry cannot show file, even if it was below limit. it says : no -----> locations !!!  to display. the content may not have been saved yet or may have been deleted. ??? how can i delete file and post and then retry ? thanks edited february 20, 2020 by luca missinig file", "sortedWord": "None", "identifyer": 35890, "year": "2020"}, {"Unnamed: 0": 425941, "autor": "Marac", "date": 1596963540000, "content": "Just an update. It would seem that my UV(0) filter may of affected the image, I removed it when I got home (I always use a filter on lenses that are lent to me for review or test). I run a few more snaps around the garden and the lens performed a lot better. My conclusion is this, at max 400mm wide open at f6.3 1/640th and close to infinity the lens (or my copy) is not of acceptable IQ (focus/sharpness/whatever) At closer distance the lens performs to an acceptable level even at 400mm and wide open at f6.3 I have no idea if the UV filter was responsible or even if the heat played a part at the nature reserve. I took some shots of a group of Swans that were chilling by the hide and those shots are very good (400mm f6.3) 1/160th At home I shot closer around the garden, even at 1/80th and the shots are acceptable. I remain confused about it and will try to evaluate it again in the next few days with UV removed. If anyone can offer any kind of advice or explanation I would surely appreciate it. There is certainly a lot of room for human error as I seldom shoot super tele-zooms. photo taken at 400mm, f6.3, 1/160th, Panasonic S1R. --img--  This was taken at the same location but a lot further away 400mm, f6.3, 1/640th, Leica CL --img--  Edited August 9, 2020 by Marac", "link": "https://www.l-camera-forum.com/topic/311664-clsigma-100-400-ois/page/2/?tab=comments#comment-4023945", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "just an update. it would seem that my uv(0) filter may of affected the image, i removed it when i got home (i always use a filter on lenses that are lent to me for review or test). i run a few more snaps around the garden and the lens performed a lot better. my conclusion is this, at max 400mm wide open at f6.3 1/640th and close to infinity the lens (or my copy) is not of acceptable iq (focus/sharpness/whatever) at closer distance the lens performs to an acceptable level even at 400mm and wide open at f6.3 i have no idea if the uv filter was responsible or even if the heat played a part at the nature reserve. i took some shots of a group of swans that were chilling by the hide and those shots are very good (400mm f6.3) 1/160th at home i shot closer around the garden, even at 1/80th and the shots are acceptable. i remain confused about it and will try to evaluate it again in the next few days with uv removed. if anyone can offer any kind of advice or explanation i would surely appreciate it. there is certainly a lot of room for human error as i seldom shoot super tele-zooms. photo taken at 400mm, f6.3, 1/160th, panasonic s1r. --img--  this was taken at the same -----> location !!!  but a lot further away 400mm, f6.3, 1/640th, leica cl --img--  edited august 9, 2020 by marac", "sortedWord": "None", "identifyer": 39037, "year": "2020"}, {"Unnamed: 0": 429650, "autor": "jaapv", "date": 1596475680000, "content": " On 7/28/2020 at 8:30 PM, nicci78 said: Video is imperative. I use it everyday. One reason why I sold M10 for the CL. By the way, adding video is free. Another reason to keep video : the video market is growing fast, when the still market is shrinking/sinking even faster. That’s why every camera manufacturers are turning to video. Even the still only one, such as Nikon or Fujifilm. Olympus missed the memo and let Panasonic take all m4/3 video customers for himself. Without strong video capabilities, Leica could be out of business in a few years. And they knew it, and make sure that SL2 and Q2 are as strong as possible in the video department. People want hybrid cameras instead of two separate devices. And camera manufacturers should be worried when most of the time, iPhones (not Android photo) can output better videos than what their big sensors cameras can. It depends on the use of the camera; for a travel (short clips, comments on location) and reportage (talking heads) camera it is essential, for other uses less so. A clear plus for mirrorless. Woops - the original intention of the M cameras was travel and reportage... We don't want to be like Dr. Paul Wolff who carried both a Cine camera and his iiif Barnack...", "link": "https://www.l-camera-forum.com/topic/311632-hoping-that-cl2-mini-sl2/page/6/?tab=comments#comment-4020842", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " on 7/28/2020 at 8:30 pm, nicci78 said: video is imperative. i use it everyday. one reason why i sold m10 for the cl. by the way, adding video is free. another reason to keep video : the video market is growing fast, when the still market is shrinking/sinking even faster. that’s why every camera manufacturers are turning to video. even the still only one, such as nikon or fujifilm. olympus missed the memo and let panasonic take all m4/3 video customers for himself. without strong video capabilities, leica could be out of business in a few years. and they knew it, and make sure that sl2 and q2 are as strong as possible in the video department. people want hybrid cameras instead of two separate devices. and camera manufacturers should be worried when most of the time, iphones (not android photo) can output better videos than what their big sensors cameras can. it depends on the use of the camera; for a travel (short clips, comments on -----> location !!! ) and reportage (talking heads) camera it is essential, for other uses less so. a clear plus for mirrorless. woops - the original intention of the m cameras was travel and reportage... we don't want to be like dr. paul wolff who carried both a cine camera and his iiif barnack...", "sortedWord": "None", "identifyer": 42769, "year": "2020"}, {"Unnamed: 0": 430984, "autor": "Joe S", "date": 1603347660000, "content": "I searched around again and stumbled of this older posting which lists a lot of approved lens including the Elmar-M 50mm. I don't have a camera yet to examine the fit personally. SL2 issues with Leica M to L adapter By NRKstudio, November 23, 2019 in Leica SL System anickpick absent-minded professor Premium Member 348 posts Location: Switzerland Report post #13 Posted November 24, 2019 (edited) Both mentioned lenses can be found on the approved list. I guess Leica is just lazy updating the list (The M-Adapter T was released in 2014). Some newer lenses are listed on the bottom of the list, some are still missing (28 Summaron, 75 Noctilux) but they do work perfectly fine too. Approved list provided by Leica Switzerland: Super - Elmar - M 1 : 3,8/18 mm ASPH.Summilux - M 1 : 1,4/21 mm ASPH.Elmarit - M 1 : 2,8/21 mm Elmarit - M 1 : 2,8/21 mm ASPH.Super - Elmar - M 1 : 3,4/21 mm ASPH. Summilux - M 1 : 1,4/24 mm ASPH.Elmarit - M 1 : 2,8/24 mm ASPH.Elmar - M 1 : 3,8/24 mm ASPH.Summicron - M 1 : 2/28 mm ASPH.Elmarit - M 1 : 2,8/28 mm LeitzElmarit - M 1 : 2,8/28 mmElmarit - M 1 : 2,8/28 mm ASPH.Summilux - M 1 : 1,4/35 mmSummilux - M 1 : 1,4/35 mm ASPH. (bis 2010)Summilux - M 1 : 1,4/35 mm ASPH. (ab 2010)Summicron - M 1 : 2/35 mm Summicron - M 1 : 2/35 mm ASPH.Summarit - M 1 : 2,5/35 mmNoctilux - M 1 : 0,95/50 mm ASPH.Noctilux - M 1 : 1/50 mmNoctilux - M 1 : 1,2/50 mmSummilux - M 1 : 1,4/50 mmSummilux - M 1 : 1,4/50 mm ASPH.Summicron - M 1 : 2/50 mm LeitzSummicron - M 1 : 2/50 mmAPO - Summicron - M 1 : 2/50 mm ASPH.Summarit - M 1 : 2,5/50 mmElmar - M 1 : 2,8/50 mmSummilux - M 1 : 1,4/75 mmAPO - Summicron - M 1 : 2/75 mm ASPH.Summarit - M 1 : 2,5/75 mmSummicron - M 1 : 2/90 mm LeitzAPO - Summicron - M 1 : 2/90 mm ASPH. Summarit - M 1 : 2,5/90 mmTele - Elmarit - M 1 : 2,8/90 mmElmarit - M 1 : 2,8/90 mm Macro - Elmar - M 1 : 4/90 mmMacro - Adapter - M mit Macro - Elmar - M 1 : 4/90 mmElmarit - M 1 : 2,8/135 mmAPO - Telyt - M 1 : 3,4/135 mmTele - Elmar - M 1 : 4/135 mmTri - Elmar - M 1 : 4/16–18–21 mm ASPH.Tri - Elmar - M 1 : 4/28–35–50 mm ASPH.Summilux - M 1 : 1,4/28 mm ASPH.Summarit - M 1 : 2,4/35 mm ASPH.Summarit - M 1 : 2,4/50 mmSummarit - M 1 : 2,4/75 mmSummarit - M 1 : 2,4/90 mm Edited November 24, 2019 by anickpick", "link": "https://www.l-camera-forum.com/topic/314406-collapsible-lenses-on-cl/?tab=comments#comment-4066557", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i searched around again and stumbled of this older posting which lists a lot of approved lens including the elmar-m 50mm. i don't have a camera yet to examine the fit personally. sl2 issues with leica m to l adapter by nrkstudio, november 23, 2019 in leica sl system anickpick absent-minded professor premium member 348 posts -----> location !!! : switzerland report post #13 posted november 24, 2019 (edited) both mentioned lenses can be found on the approved list. i guess leica is just lazy updating the list (the m-adapter t was released in 2014). some newer lenses are listed on the bottom of the list, some are still missing (28 summaron, 75 noctilux) but they do work perfectly fine too. approved list provided by leica switzerland: super - elmar - m 1 : 3,8/18 mm asph.summilux - m 1 : 1,4/21 mm asph.elmarit - m 1 : 2,8/21 mm elmarit - m 1 : 2,8/21 mm asph.super - elmar - m 1 : 3,4/21 mm asph. summilux - m 1 : 1,4/24 mm asph.elmarit - m 1 : 2,8/24 mm asph.elmar - m 1 : 3,8/24 mm asph.summicron - m 1 : 2/28 mm asph.elmarit - m 1 : 2,8/28 mm leitzelmarit - m 1 : 2,8/28 mmelmarit - m 1 : 2,8/28 mm asph.summilux - m 1 : 1,4/35 mmsummilux - m 1 : 1,4/35 mm asph. (bis 2010)summilux - m 1 : 1,4/35 mm asph. (ab 2010)summicron - m 1 : 2/35 mm summicron - m 1 : 2/35 mm asph.summarit - m 1 : 2,5/35 mmnoctilux - m 1 : 0,95/50 mm asph.noctilux - m 1 : 1/50 mmnoctilux - m 1 : 1,2/50 mmsummilux - m 1 : 1,4/50 mmsummilux - m 1 : 1,4/50 mm asph.summicron - m 1 : 2/50 mm leitzsummicron - m 1 : 2/50 mmapo - summicron - m 1 : 2/50 mm asph.summarit - m 1 : 2,5/50 mmelmar - m 1 : 2,8/50 mmsummilux - m 1 : 1,4/75 mmapo - summicron - m 1 : 2/75 mm asph.summarit - m 1 : 2,5/75 mmsummicron - m 1 : 2/90 mm leitzapo - summicron - m 1 : 2/90 mm asph. summarit - m 1 : 2,5/90 mmtele - elmarit - m 1 : 2,8/90 mmelmarit - m 1 : 2,8/90 mm macro - elmar - m 1 : 4/90 mmmacro - adapter - m mit macro - elmar - m 1 : 4/90 mmelmarit - m 1 : 2,8/135 mmapo - telyt - m 1 : 3,4/135 mmtele - elmar - m 1 : 4/135 mmtri - elmar - m 1 : 4/16–18–21 mm asph.tri - elmar - m 1 : 4/28–35–50 mm asph.summilux - m 1 : 1,4/28 mm asph.summarit - m 1 : 2,4/35 mm asph.summarit - m 1 : 2,4/50 mmsummarit - m 1 : 2,4/75 mmsummarit - m 1 : 2,4/90 mm edited november 24, 2019 by anickpick", "sortedWord": "None", "identifyer": 44134, "year": "2020"}, {"Unnamed: 0": 431219, "autor": "PDP", "date": 1601470500000, "content": "The lens comes in a very nice black wooden box with no further information except how to produce the famous bubble pictures (in my case written in Chinese...). I chose the version with M-mount to be more flexible (I have the M/L-adapter), but anyhow M-metering is not possible; for CL no issue. Build quality seems quite OK, interesting that there are no stops for aperture just continuous move. The lens is (simply) made using 3 lenses, but the new producer seems investing in coating at least. Lens produced in Bad Kreuznach, Germany (some should know thais location from other great lens-brands). My DNG files are sharp but lacking contrast (compared to Leica), but no issue with LR. Sharpness increases if not wide open. For these bubbles you need short distance to subject, direct light in the back and aperture wide open. I made a portrait of my little girl too, and yes this lens works well for portrait. A special lens for special things. But I love the kind of painting, and I love again the EVF of my CL to see what will be on the sensor.", "link": "https://www.l-camera-forum.com/topic/313773-trioplan-on-cl/?tab=comments#comment-4054796", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "the lens comes in a very nice black wooden box with no further information except how to produce the famous bubble pictures (in my case written in chinese...). i chose the version with m-mount to be more flexible (i have the m/l-adapter), but anyhow m-metering is not possible; for cl no issue. build quality seems quite ok, interesting that there are no stops for aperture just continuous move. the lens is (simply) made using 3 lenses, but the new producer seems investing in coating at least. lens produced in bad kreuznach, germany (some should know thais -----> location !!!  from other great lens-brands). my dng files are sharp but lacking contrast (compared to leica), but no issue with lr. sharpness increases if not wide open. for these bubbles you need short distance to subject, direct light in the back and aperture wide open. i made a portrait of my little girl too, and yes this lens works well for portrait. a special lens for special things. but i love the kind of painting, and i love again the evf of my cl to see what will be on the sensor.", "sortedWord": "None", "identifyer": 44372, "year": "2020"}, {"Unnamed: 0": 431509, "autor": "Marac", "date": 1586522940000, "content": "I love the CL, the longest I have ever owned a camera, many favourites but this shot of my Wife in the Lake District is with my favourite combi. Leica CL / Leica TL 35mm Summilux, my favourite time of year & a splendid location. --img-- ", "link": "https://www.l-camera-forum.com/topic/306896-post-your-favourite-cl-shot/page/3/?tab=comments#comment-3950829", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "i love the cl, the longest i have ever owned a camera, many favourites but this shot of my wife in the lake district is with my favourite combi. leica cl / leica tl 35mm summilux, my favourite time of year & a splendid -----> location !!! . --img-- ", "sortedWord": "None", "identifyer": 44670, "year": "2020"}, {"Unnamed: 0": 431624, "autor": "ramarren", "date": 1599494100000, "content": " 3 minutes ago, jaapv said: That's true, I limit myself when just out of the house etc, but when one or (many) more overnights are involved I do carry more. When traveling, I carry up to three lenses. I'll carry a second camera if I have a specific goal in mind and I want to work on it with a camera that is completely different from my usual carry ... For instance, if I'm carrying the CL and two lenses for my usual shooting, I might carry a Polaroid SX-70 or a Fuji GS645S Wide 60 for some specific photographic ideas. And of course, what I have in mind for those alternative cameras influences what lenses I pick for the CL. Et cetera. Traveling is not the same as going out for a pointed photo session, where I might have several different pointed intents for a particular shoot at a particular and sometime infrequently visited location. That's why I have a car with a big trunk for such occasions... LOL! G", "link": "https://www.l-camera-forum.com/topic/312931-leica-cl-and-leica-q-using-one-more-than-the-other/page/2/?tab=comments#comment-4041659", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": " 3 minutes ago, jaapv said: that's true, i limit myself when just out of the house etc, but when one or (many) more overnights are involved i do carry more. when traveling, i carry up to three lenses. i'll carry a second camera if i have a specific goal in mind and i want to work on it with a camera that is completely different from my usual carry ... for instance, if i'm carrying the cl and two lenses for my usual shooting, i might carry a polaroid sx-70 or a fuji gs645s wide 60 for some specific photographic ideas. and of course, what i have in mind for those alternative cameras influences what lenses i pick for the cl. et cetera. traveling is not the same as going out for a pointed photo session, where i might have several different pointed intents for a particular shoot at a particular and sometime infrequently visited -----> location !!! . that's why i have a car with a big trunk for such occasions... lol! g", "sortedWord": "None", "identifyer": 44785, "year": "2020"}, {"Unnamed: 0": 431682, "autor": "ramarren", "date": 1598216160000, "content": "In addition to Scott's comment, I have to add that I find geolocation of my photographs to be of virtually zero relevant value. If I want to track where I made various photos, I snap a picture with my iPhone at the location and can then use the time stamp from that to find all the photos made at that time (and thus location), and copy/paste the GPS coordinates to them in a few seconds. that does the job as reliably and accurately as I need, and proves quite convenient. G", "link": "https://www.l-camera-forum.com/topic/312548-gps/?tab=comments#comment-4032227", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "in addition to scott's comment, i have to add that i find geolocation of my photographs to be of virtually zero relevant value. if i want to track where i made various photos, i snap a picture with my iphone at the -----> location !!!  and can then use the time stamp from that to find all the photos made at that time (and thus -----> location !!! ), and copy/paste the gps coordinates to them in a few seconds. that does the job as reliably and accurately as i need, and proves quite convenient. g", "sortedWord": "None", "identifyer": 44843, "year": "2020"}, {"Unnamed: 0": 431685, "autor": "dadu007", "date": 1598238900000, "content": "It's not helpful when you say something along the lines of \"GPS isn't relevant to me, I wouldn't use it, and so it doesn't matter.\" It is relevant to many users, especially for those cataloguing geotagged photos in certain databases, where you can then search for photos in a radius around a certain location. The CL doesn't have the GPS hardware built in to it (like the SL does, thus its plastic \"hump\"). I think people (like me) are searching for an elegant way of geotagging photos taken with the CL. I've seen mention of the GPS4Cam app, but that app is not available in Apple's App store in the US. Today I discovered \"GPS4Camera\" (different name) in the US Apple app store, and have been messing with it all day. It's built by a lone developer in the US, and I've been emailing with him back and forth all day...mainly because he left out some crucial instructions, LOL. As I understand it, the app should work this way: You start the GPS tracking in the app. Tap the \"Sync\" button in the app; you'll then see a QR code. Take a picture of that QR code with your camera (i.e., Leica CL) You can lock your phone and put it in your pocket. The app is still recording GPS coordinates as you walk. Take pictures on your walk At the end of the walk, stop the GPS tracking in the app. Export either a .gpx or .kml data file from the app. Dump one of those files (the .gpx OR .kml file), plus all your photos (including the photo of the QR code) from the walk into one folder Run his qrfinder.exe in the folder (this on Mac OS only, PC not supported)... ...what is supposed to happen (I think) is that qrfinder will extract the time from the QR code, sync the timestamped GPS coordinates (the app records them at short intervals) to your photo capture times, and then use Exiftool to push the corresponding gps coordinates in to the exif metadata of the photos. I could not get this to work today, but if it ever does work as designed, it would be an acceptable solution for me (and others, I suspect). BTW, I had a Pentax DSLR that had built-in GPS, and it worked flawlessly and accurately. I wish the same for the CL2. Edited August 24, 2020 by dadu007", "link": "https://www.l-camera-forum.com/topic/312548-gps/?tab=comments#comment-4032316", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "it's not helpful when you say something along the lines of \"gps isn't relevant to me, i wouldn't use it, and so it doesn't matter.\" it is relevant to many users, especially for those cataloguing geotagged photos in certain databases, where you can then search for photos in a radius around a certain -----> location !!! . the cl doesn't have the gps hardware built in to it (like the sl does, thus its plastic \"hump\"). i think people (like me) are searching for an elegant way of geotagging photos taken with the cl. i've seen mention of the gps4cam app, but that app is not available in apple's app store in the us. today i discovered \"gps4camera\" (different name) in the us apple app store, and have been messing with it all day. it's built by a lone developer in the us, and i've been emailing with him back and forth all day...mainly because he left out some crucial instructions, lol. as i understand it, the app should work this way: you start the gps tracking in the app. tap the \"sync\" button in the app; you'll then see a qr code. take a picture of that qr code with your camera (i.e., leica cl) you can lock your phone and put it in your pocket. the app is still recording gps coordinates as you walk. take pictures on your walk at the end of the walk, stop the gps tracking in the app. export either a .gpx or .kml data file from the app. dump one of those files (the .gpx or .kml file), plus all your photos (including the photo of the qr code) from the walk into one folder run his qrfinder.exe in the folder (this on mac os only, pc not supported)... ...what is supposed to happen (i think) is that qrfinder will extract the time from the qr code, sync the timestamped gps coordinates (the app records them at short intervals) to your photo capture times, and then use exiftool to push the corresponding gps coordinates in to the exif metadata of the photos. i could not get this to work today, but if it ever does work as designed, it would be an acceptable solution for me (and others, i suspect). btw, i had a pentax dslr that had built-in gps, and it worked flawlessly and accurately. i wish the same for the cl2. edited august 24, 2020 by dadu007", "sortedWord": "None", "identifyer": 44846, "year": "2020"}, {"Unnamed: 0": 431687, "autor": "pop", "date": 1598248620000, "content": "The app to look for really is \"GPS4CAM\" (http://blog.gps4cam.com). The correct operation is outlined on their very homepage: start tracking with the app, take your trip and shoot your photographs, at the end of the trip tell the app that you're done and photograph the QR code which is then shown with every camera you've taken with you, upload the pictures to your PC (including, of course, the picture(s) with the QR code), run the GPS4CAM app on your PC (Win or Mac). It's the only product I know which properly handles the different time of day clocks of your devices. However, you can also get by with tracking your path with just about any of the many GPS tracking apps available for your phone or with a dedicated GPS device. You can transfer the location data to your photos with a simple GPS app such as GPSPRUNE or just let your image processing software do that if it can.", "link": "https://www.l-camera-forum.com/topic/312548-gps/?tab=comments#comment-4032338", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "the app to look for really is \"gps4cam\" (http://blog.gps4cam.com). the correct operation is outlined on their very homepage: start tracking with the app, take your trip and shoot your photographs, at the end of the trip tell the app that you're done and photograph the qr code which is then shown with every camera you've taken with you, upload the pictures to your pc (including, of course, the picture(s) with the qr code), run the gps4cam app on your pc (win or mac). it's the only product i know which properly handles the different time of day clocks of your devices. however, you can also get by with tracking your path with just about any of the many gps tracking apps available for your phone or with a dedicated gps device. you can transfer the -----> location !!!  data to your photos with a simple gps app such as gpsprune or just let your image processing software do that if it can.", "sortedWord": "None", "identifyer": 44848, "year": "2020"}, {"Unnamed: 0": 431699, "autor": "thighslapper", "date": 1598561880000, "content": "For someone that does landscape photography GPS location of the images is really useful. Not having the memory of an elephant and the anal catalogue organisational tendencies of some out there, I frequently struggle to recall precisely where I took photos from ..... and often if you return the precise spot needs locating to within a few metres to get the same view. I've been in woodland recently and found a great location for some autumn or mist shots .... but I would really struggle to find my way back to the exact area. I have a track recorded on my iphone but that doesn't tell me where I took the photos. Any painless way to tag photos like on the original SL would be really helpful.", "link": "https://www.l-camera-forum.com/topic/312548-gps/page/2/?tab=comments#comment-4034678", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "for someone that does landscape photography gps -----> location !!!  of the images is really useful. not having the memory of an elephant and the anal catalogue organisational tendencies of some out there, i frequently struggle to recall precisely where i took photos from ..... and often if you return the precise spot needs locating to within a few metres to get the same view. i've been in woodland recently and found a great location for some autumn or mist shots .... but i would really struggle to find my way back to the exact area. i have a track recorded on my iphone but that doesn't tell me where i took the photos. any painless way to tag photos like on the original sl would be really helpful.", "sortedWord": "None", "identifyer": 44860, "year": "2020"}, {"Unnamed: 0": 431700, "autor": "AZach", "date": 1598594340000, "content": "8 hours ago, thighslapper said: For someone that does landscape photography GPS location of the images is really useful. .. Any painless way to tag photos like on the original SL would be really helpful +1", "link": "https://www.l-camera-forum.com/topic/312548-gps/page/2/?tab=comments#comment-4034834", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "8 hours ago, thighslapper said: for someone that does landscape photography gps -----> location !!!  of the images is really useful. .. any painless way to tag photos like on the original sl would be really helpful +1", "sortedWord": "None", "identifyer": 44861, "year": "2020"}, {"Unnamed: 0": 431701, "autor": "ramarren", "date": 1598648400000, "content": "23 hours ago, thighslapper said: For someone that does landscape photography GPS location of the images is really useful. Not having the memory of an elephant and the anal catalogue organisational tendencies of some out there, I frequently struggle to recall precisely where I took photos from ..... and often if you return the precise spot needs locating to within a few metres to get the same view. I've been in woodland recently and found a great location for some autumn or mist shots .... but I would really struggle to find my way back to the exact area. I have a track recorded on my iphone but that doesn't tell me where I took the photos. Any painless way to tag photos like on the original SL would be really helpful. I do location hunting snaps with the iPhone or the Light L16, both of which automatically embed GPS data for that kind of use. Both are lightweight, pocketable, and allow me to scout without need for carrying heavier equipment. The phone in particular is always in my pocket anyway so it's no burden to carry it.", "link": "https://www.l-camera-forum.com/topic/312548-gps/page/2/?tab=comments#comment-4035310", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "23 hours ago, thighslapper said: for someone that does landscape photography gps -----> location !!!  of the images is really useful. not having the memory of an elephant and the anal catalogue organisational tendencies of some out there, i frequently struggle to recall precisely where i took photos from ..... and often if you return the precise spot needs locating to within a few metres to get the same view. i've been in woodland recently and found a great location for some autumn or mist shots .... but i would really struggle to find my way back to the exact area. i have a track recorded on my iphone but that doesn't tell me where i took the photos. any painless way to tag photos like on the original sl would be really helpful. i do location hunting snaps with the iphone or the light l16, both of which automatically embed gps data for that kind of use. both are lightweight, pocketable, and allow me to scout without need for carrying heavier equipment. the phone in particular is always in my pocket anyway so it's no burden to carry it.", "sortedWord": "None", "identifyer": 44862, "year": "2020"}, {"Unnamed: 0": 432916, "autor": "pipatree", "date": 1579432200000, "content": "fp + Summilux-M 35mm F1.4 V2 (Location: Pacific Rim Beach in Taitung, Taiwan) --img-- ", "link": "https://www.l-camera-forum.com/topic/303132-images-with-sigma-l-mount-cameras/page/3/?tab=comments#comment-3894613", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fp + summilux-m 35mm f1.4 v2 (-----> location !!! : pacific rim beach in taitung, taiwan) --img-- ", "sortedWord": "None", "identifyer": 46082, "year": "2020"}, {"Unnamed: 0": 432917, "autor": "pipatree", "date": 1579782900000, "content": "fp + Summilux-M 35mm F1.4 V2 (Location: Roof of temple in Taiwan) --img-- ", "link": "https://www.l-camera-forum.com/topic/303132-images-with-sigma-l-mount-cameras/page/3/?tab=comments#comment-3897627", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "fp + summilux-m 35mm f1.4 v2 (-----> location !!! : roof of temple in taiwan) --img-- ", "sortedWord": "None", "identifyer": 46083, "year": "2020"}, {"Unnamed: 0": 443911, "autor": "anuncastshadow", "date": 1608523980000, "content": "31 minutes ago, nwphil said: so sorry to hear that.... Now, I think it's time we all come together and maybe figure a way to establish some sort of test so the Q2M users can figure their sensors. Is there a specific setting - in the shots, that helped reveal the dead pixel? @anuncastshadow what about in your case? would you mind to share too? Thanks @nwphil I am not an expert with technical experiments, but I can mention that my first experience with the camera was taking miscellaneous photos around the apartment, familiarizing myself with macro mode, autofocus behaviors, et cetera. Upon zooming in to 100-200% levels in Lightroom to observe the resolution (pixel peeping I suppose) I noticed that some images exhibited the white dots, and others did not. Upon further review, I noticed that they occurred regardless of aperture or shutter speed, and that they definitely occurred in any exposure using ISO 800 and above. After noticing the issue, and in an attempt to most clearly illustrate the issue with Leica, I took two images with the camera in Manual mode, Macro mode disabled, and the lens cap attached and manual focus set to nearest distance. One exposure was 1/60 @ f/1.7 ISO 800, and another 1/250 @ f/8 ISO 250,000. Both images, when viewed in Lightroom, appeared identical in terms of the intensity of the white dots, and their location. To me, this meant that aperture and shutter speed was not important in producing these artifacts, but confirmed that the ISO does. Subsequent exposures, regardless of aperture, shutter speed, or focusing distance produces these dots. Once the ISO is adjusted to 400 or lower, they are absolutely invisible. I am still waiting to hear back from Leica, and with COVID forcing most of their employees to work in a limited capacity, I am unsure when I may receive a response. However, I am inclined to return the unit, despite the shop that sold me the unit seeming to have a preference to wait for Leica to produce a mapping of my sensor to resolve the issue. He (the shop owner) clarified that his statement earlier about the issue being observed on M cameras was mistaken, as this does not appear to be the \"hot pixel line\" problem he has seen on digital M cameras in the past. I am a bit skeptical about the pixel mapping process (though I am familiar with it, and have heard of it being performed for other digital camera manufacturers in the past) only because it's usually used to resolve or map maybe a handful of pixels, not the 21 I can count on my sensor. I should also clarify that using the term \"hot pixel\" to describe my issue may be inaccurate, as hot pixels usually occur when the sensor is quite literally \"hot\", for instance during extremely long exposures. The shop owner also indicated he did not believe them to be \"dead pixels\" but I suppose I am not sure what else they would be. Anyway, I hope this information is helpful, and again, I will provide the update I hear from Leica when it arrives, but I most likely will pursue a replacement rather than proceed with a pixel mapping attempt if it is indeed offered. Edited December 21, 2020 by anuncastshadow", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/?tab=comments#comment-4102868", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "31 minutes ago, nwphil said: so sorry to hear that.... now, i think it's time we all come together and maybe figure a way to establish some sort of test so the q2m users can figure their sensors. is there a specific setting - in the shots, that helped reveal the dead pixel? @anuncastshadow what about in your case? would you mind to share too? thanks @nwphil i am not an expert with technical experiments, but i can mention that my first experience with the camera was taking miscellaneous photos around the apartment, familiarizing myself with macro mode, autofocus behaviors, et cetera. upon zooming in to 100-200% levels in lightroom to observe the resolution (pixel peeping i suppose) i noticed that some images exhibited the white dots, and others did not. upon further review, i noticed that they occurred regardless of aperture or shutter speed, and that they definitely occurred in any exposure using iso 800 and above. after noticing the issue, and in an attempt to most clearly illustrate the issue with leica, i took two images with the camera in manual mode, macro mode disabled, and the lens cap attached and manual focus set to nearest distance. one exposure was 1/60 @ f/1.7 iso 800, and another 1/250 @ f/8 iso 250,000. both images, when viewed in lightroom, appeared identical in terms of the intensity of the white dots, and their -----> location !!! . to me, this meant that aperture and shutter speed was not important in producing these artifacts, but confirmed that the iso does. subsequent exposures, regardless of aperture, shutter speed, or focusing distance produces these dots. once the iso is adjusted to 400 or lower, they are absolutely invisible. i am still waiting to hear back from leica, and with covid forcing most of their employees to work in a limited capacity, i am unsure when i may receive a response. however, i am inclined to return the unit, despite the shop that sold me the unit seeming to have a preference to wait for leica to produce a mapping of my sensor to resolve the issue. he (the shop owner) clarified that his statement earlier about the issue being observed on m cameras was mistaken, as this does not appear to be the \"hot pixel line\" problem he has seen on digital m cameras in the past. i am a bit skeptical about the pixel mapping process (though i am familiar with it, and have heard of it being performed for other digital camera manufacturers in the past) only because it's usually used to resolve or map maybe a handful of pixels, not the 21 i can count on my sensor. i should also clarify that using the term \"hot pixel\" to describe my issue may be inaccurate, as hot pixels usually occur when the sensor is quite literally \"hot\", for instance during extremely long exposures. the shop owner also indicated he did not believe them to be \"dead pixels\" but i suppose i am not sure what else they would be. anyway, i hope this information is helpful, and again, i will provide the update i hear from leica when it arrives, but i most likely will pursue a replacement rather than proceed with a pixel mapping attempt if it is indeed offered. edited december 21, 2020 by anuncastshadow", "sortedWord": "None", "identifyer": 7296, "year": "2020"}, {"Unnamed: 0": 443951, "autor": "nwphil", "date": 1608697080000, "content": "21 minutes ago, SrMi said: You can look for stuck pixels by taking pictures with the lens cap on and varying the ISO (e.g., with 1/15, f/4). If you open those images in LrC and use dust visualization, the location of stuck pixels will be visible. I have provided Bill with data for various Leica cameras, including Q2 and Q2M. He reported several stuck pixels both on Q2 and Q2M. They do not bother me in Q2 as they apparently get eliminated automatically by Adobe software. Those who use C1: just noticed that Q2M's stuck pixels can be easily eliminated by using Noise Reduction -> Single Pixel -> 2. Thanks SrMi Bill gave me the results on my sensor and he says there are no signs of defective pixels ( txt file) - so, what are these white spots then? ( i just realize that two of the screenshots are hard to see - if anyone needs/wants full sized ones, I can send you the googledrive sharelink) --img--  --img--  --img--  --img--  Q1000453_1_bvz.txt Edited December 23, 2020 by nwphil", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/3/?tab=comments#comment-4104243", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "21 minutes ago, srmi said: you can look for stuck pixels by taking pictures with the lens cap on and varying the iso (e.g., with 1/15, f/4). if you open those images in lrc and use dust visualization, the -----> location !!!  of stuck pixels will be visible. i have provided bill with data for various leica cameras, including q2 and q2m. he reported several stuck pixels both on q2 and q2m. they do not bother me in q2 as they apparently get eliminated automatically by adobe software. those who use c1: just noticed that q2m's stuck pixels can be easily eliminated by using noise reduction -> single pixel -> 2. thanks srmi bill gave me the results on my sensor and he says there are no signs of defective pixels ( txt file) - so, what are these white spots then? ( i just realize that two of the screenshots are hard to see - if anyone needs/wants full sized ones, i can send you the googledrive sharelink) --img--  --img--  --img--  --img--  q1000453_1_bvz.txt edited december 23, 2020 by nwphil", "sortedWord": "None", "identifyer": 7336, "year": "2020"}, {"Unnamed: 0": 443968, "autor": "SrMi", "date": 1609176540000, "content": "11 hours ago, Leica28 said: I have also sent two emails to Leica with no response. Perhaps it’s the unfortunate timing of the Christmas/New Year holidays. Regardless, I now have a paperweight. I feel my camera is handicapped in shooting at higher ISO’s. If Leica can’t repair/replace it very quickly, I’ll just sell it for parts and get on with life using my Q2. Obviously there are members here who own Q2M’s that have no stuck pixel problem. That leads me to think it is a sensor mfg defect rather than a software issue. My stuck pixels only appeared when anuncastshadow started this thread 😉. I hope it is not a design issue. I would love to see one Q2M DNG file that was shot with the lens cap on and with ISO 800 that does not have stuck pixels (message me if you need a dropbox location). Warning: once you know about stuck pixels, they will start to bother you :(.", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/4/?tab=comments#comment-4107407", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "11 hours ago, leica28 said: i have also sent two emails to leica with no response. perhaps it’s the unfortunate timing of the christmas/new year holidays. regardless, i now have a paperweight. i feel my camera is handicapped in shooting at higher iso’s. if leica can’t repair/replace it very quickly, i’ll just sell it for parts and get on with life using my q2. obviously there are members here who own q2m’s that have no stuck pixel problem. that leads me to think it is a sensor mfg defect rather than a software issue. my stuck pixels only appeared when anuncastshadow started this thread 😉. i hope it is not a design issue. i would love to see one q2m dng file that was shot with the lens cap on and with iso 800 that does not have stuck pixels (message me if you need a dropbox -----> location !!! ). warning: once you know about stuck pixels, they will start to bother you :(.", "sortedWord": "None", "identifyer": 7353, "year": "2020"}, {"Unnamed: 0": 443970, "autor": "nwphil", "date": 1609178340000, "content": "18 minutes ago, SrMi said: My stuck pixels only appeared when anuncastshadow started this thread 😉. I hope it is not a design issue. I would love to see one Q2M DNG file that was shot with the lens cap on and with ISO 800 that does not have stuck pixels (message me if you need a dropbox location). Warning: once you know about stuck pixels, they will start to bother you :(. not sure if qualifies under design issue, but LeicaRepair tech told me that the Q2M automatically remaps pixels via its own system, but does not know how long that takes. He also asks to contact him again, if after a week of shooting the issue still is present. I took \"cap-on\" test shots at #408, per exiff ( last week). After a week of playing around and extended weekend shooting, last image is #696 , plus a couple movies too. Later I will try again a few cap-on shots at same settings as before. Maybe there is something in this - iow, a shutter count before and after ( with after -after a somewhat substantial amount of shots, although the tech did not specify how many actuations one can/should have after one week of shooting) can be an useful piece of info to be added", "link": "https://www.l-camera-forum.com/topic/316242-q2-monochrom-stuck-bright-white-pixels/page/4/?tab=comments#comment-4107433", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "18 minutes ago, srmi said: my stuck pixels only appeared when anuncastshadow started this thread 😉. i hope it is not a design issue. i would love to see one q2m dng file that was shot with the lens cap on and with iso 800 that does not have stuck pixels (message me if you need a dropbox -----> location !!! ). warning: once you know about stuck pixels, they will start to bother you :(. not sure if qualifies under design issue, but leicarepair tech told me that the q2m automatically remaps pixels via its own system, but does not know how long that takes. he also asks to contact him again, if after a week of shooting the issue still is present. i took \"cap-on\" test shots at #408, per exiff ( last week). after a week of playing around and extended weekend shooting, last image is #696 , plus a couple movies too. later i will try again a few cap-on shots at same settings as before. maybe there is something in this - iow, a shutter count before and after ( with after -after a somewhat substantial amount of shots, although the tech did not specify how many actuations one can/should have after one week of shooting) can be an useful piece of info to be added", "sortedWord": "None", "identifyer": 7355, "year": "2020"}, {"Unnamed: 0": 446851, "autor": "lykaman", "date": 1600114140000, "content": "If everything else is Ok. Probably time for a CLA @ a Leica Repair/Servicing Center, relevant to your location.. L", "link": "https://www.l-camera-forum.com/topic/313343-leica-x-type-113-focus-ring-hard-and-squeaky/?tab=comments#comment-4045955", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "if everything else is ok. probably time for a cla @ a leica repair/servicing center, relevant to your -----> location !!! .. l", "sortedWord": "None", "identifyer": 10320, "year": "2020"}, {"Unnamed: 0": 452619, "autor": "lykaman", "date": 1589417400000, "content": "It must be your location.. Downloaded with no issues (USA) --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/309491-is-there-any-app-running-on-current-ios-1341-to-connect-to-c112-camera/?tab=comments#comment-3972939", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "it must be your -----> location !!! .. downloaded with no issues (usa) --img-- --img-- ", "sortedWord": "None", "identifyer": 16221, "year": "2020"}], "name": "locationL-Forum2020"}