{"interestingcomments": [{"Unnamed: 0": 374189, "autor": "Bo_Lorentzen", "date": 1254198540000, "content": "swamiji, those images ARE lovely. RobSteve, location portraiture with a Noct is a artform, well done. AlexC, nice, I love the scattered mixed flowers. wonderful images. Interesting conversation here I would say. because we are in the M9 forum I assume everybody here are comfortable with the price of these lenses, new or old, (and we can probably all agree the new is ridiculously expensive for a piece of glass in brass barrel. yes we wanted it we could probably all pick it up to play with.) This conversation seems less polarized than most I have seen, probably because of the entry ticket for most of the people interested in the M9, I gotta say i appreciate that we can talk quietly about lenses in several price brackets without having to demand that the one I can afford is the best and only worth using. Personally I tend to agree with swamiji, I love how the 1.0 renders, I also agree it is NOT as perfect as the new 0.95.... but for me that is the charm, wonderful old fashioned huge chunks of slightly imperfect glass... ahh, nature is not perfect, neither is lenses, they just render differently, each perfect in one or another way, and each perfect for some users taste.. (im too cheap to pick it up and have instead been making do with the nokton 1.1 which so far have been blowing me away also because its not quite perfect.. oh and its pretty darn cheap also.)", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/2/?tab=comments#comment-1054018", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "swamiji, those images are lovely. robsteve, -----> location !!!  portraiture with a noct is a artform, well done. alexc, nice, i love the scattered mixed flowers. wonderful images. interesting conversation here i would say. because we are in the m9 forum i assume everybody here are comfortable with the price of these lenses, new or old, (and we can probably all agree the new is ridiculously expensive for a piece of glass in brass barrel. yes we wanted it we could probably all pick it up to play with.) this conversation seems less polarized than most i have seen, probably because of the entry ticket for most of the people interested in the m9, i gotta say i appreciate that we can talk quietly about lenses in several price brackets without having to demand that the one i can afford is the best and only worth using. personally i tend to agree with swamiji, i love how the 1.0 renders, i also agree it is not as perfect as the new 0.95.... but for me that is the charm, wonderful old fashioned huge chunks of slightly imperfect glass... ahh, nature is not perfect, neither is lenses, they just render differently, each perfect in one or another way, and each perfect for some users taste.. (im too cheap to pick it up and have instead been making do with the nokton 1.1 which so far have been blowing me away also because its not quite perfect.. oh and its pretty darn cheap also.)", "sortedWord": "None", "identifyer": 35495, "year": "2009"}, {"Unnamed: 0": 385908, "autor": "adan", "date": 1260989760000, "content": "Important note: In digital, you really only have the equivalent of a single ISO, in the film sense. The base ISO (which is 160 for the M8/M9). When you shoot at higher ISOs, you are already \"pushing\" that \"film\" 1,2,3 or 4 stops, just as one could shoot Fuji 160 film at 640 or 2500 and then push by overdeveloping. So the instant you move the ISO off 160 - you are already \"underexposing.\" I.E. it is not the same as just loading ISO 2500 film in the first place. Underexpose at 2500 by 1-2 stops and you are shooting at 5000 or 10,000 ISO. Anyway - to get to your questions: 1) horizontal banding in underexposed high-ISO digital images will never be \"gone for good\". Eventually, you can make any camera band, if you feed the sensor so little light that the background noise starts to dominate. Things will likely improve over the decades - but I'll guarantee you that I'll be able to make a Nikon D900s band at ISO 2,000,000 in 10 years or so. --img--  2) Is the M9 banding ever so slightly less obvious than the M8's at ISO 2500. Yes, slightly. Not much. 3) As to the vertical stripe - there are several \"instances\" of this. One, that is consistent in only showing up at ISO 2500 and on the right side, and in many M9s, has been diagnosed as a read error and will likely be one of the fixes in the next firmware edition. Other more randomly located vertical lines that show up at several (or all) ISOs seem to be specific sensor bugs and (I think) require sensor replacement. I think yours may be the second type, by location - but wait for the FW upgrade to see. You may avoid unnecessary M9 surgery. 4) There does seem to be some differences in what shows up in jpegs vs. dngs. I've seen hot single pixels (usually red, sometimes blue) that are very obvious in jpegs but invisible in the corresponding dng (shot as dng + jpeg).", "link": "https://www.l-camera-forum.com/topic/106851-m8m9-high-iso-banding-questions/?tab=comments#comment-1153490", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "important note: in digital, you really only have the equivalent of a single iso, in the film sense. the base iso (which is 160 for the m8/m9). when you shoot at higher isos, you are already \"pushing\" that \"film\" 1,2,3 or 4 stops, just as one could shoot fuji 160 film at 640 or 2500 and then push by overdeveloping. so the instant you move the iso off 160 - you are already \"underexposing.\" i.e. it is not the same as just loading iso 2500 film in the first place. underexpose at 2500 by 1-2 stops and you are shooting at 5000 or 10,000 iso. anyway - to get to your questions: 1) horizontal banding in underexposed high-iso digital images will never be \"gone for good\". eventually, you can make any camera band, if you feed the sensor so little light that the background noise starts to dominate. things will likely improve over the decades - but i'll guarantee you that i'll be able to make a nikon d900s band at iso 2,000,000 in 10 years or so. --img--  2) is the m9 banding ever so slightly less obvious than the m8's at iso 2500. yes, slightly. not much. 3) as to the vertical stripe - there are several \"instances\" of this. one, that is consistent in only showing up at iso 2500 and on the right side, and in many m9s, has been diagnosed as a read error and will likely be one of the fixes in the next firmware edition. other more randomly located vertical lines that show up at several (or all) isos seem to be specific sensor bugs and (i think) require sensor replacement. i think yours may be the second type, by -----> location !!!  - but wait for the fw upgrade to see. you may avoid unnecessary m9 surgery. 4) there does seem to be some differences in what shows up in jpegs vs. dngs. i've seen hot single pixels (usually red, sometimes blue) that are very obvious in jpegs but invisible in the corresponding dng (shot as dng + jpeg).", "sortedWord": "None", "identifyer": 47314, "year": "2009"}], "name": "locationL-Forum2009"}