{"interestingcomments": [{"Unnamed: 0": 373121, "autor": "pico", "date": 1426861800000, "content": "There is a shoulder strap available for Pelican cases. I'm not joking. It is very handy when carrying a lot to location, or hotel, etc..", "link": "https://www.l-camera-forum.com/topic/241035-anyone-uses-pelican-1200-for-their-leica-m9-family/page/2/?tab=comments#comment-2783949", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "there is a shoulder strap available for pelican cases. i'm not joking. it is very handy when carrying a lot to -----> location !!! , or hotel, etc..", "sortedWord": "None", "identifyer": 34425, "year": "2015"}, {"Unnamed: 0": 380226, "autor": "Nr90", "date": 1426600440000, "content": "Let's use m8raw2dngv12beta_mac and m8raw2dng-droplet. m8raw2dngv12beta_mac should give you a folder with three files: lensdb.ini sensdb.ini m8raw2dng What I did was create a folder in my users directory named: m8raw2dng. Copy the files from the m8raw2dngv12beta_mac folder into the newly created m8raw2dng folder. Now we must tell the droplet where to find the m8raw2dng executable. 1. Open the main.scpt in the droplet as described above 2. Go to line 6. This says: set TheApp to \"/Applications/m8raw2dng\" This tells the droplet that the m8raw2dng executable is in /Applications We put in the current user's directory so we change the line to: set TheApp to \"~/m8raw2dng/m8raw2dng\" (keep the tab in front of the line) (on unix systems the ~ is the path to the current user's home directory) 3. Save the file Next we must set the parameters. The most important being the output location (where to put the newly created DNG files). 1. Go to your Pictures folder 2. Create a folder called: m8raw (A different name is possible, if so change the following to reflect your folder's name) 3. Open the main.scpt in the droplet as before 4. Go to line 11. It says: set Params to \" -v -r -b -p -l -o /Users/YourName/Pictures\" This tells the droplet with which parameters it should run the m8raw2dng. For a full description go to: M8raw2dng – Tool to convert Leica M8 RAW files to DNG The most important one is the -o It sets the output directory. Change the line to: set Params to \" -v -r -b -p -l -o ~/Pictures/m8raw\" (change the path if you chose a different location / name) 5. Save the file Now your droplet is ready to be used. Drag a folder of RAW and JPG files on top of the droplet and it should output the resulting DNG files in your ~/Pictures/m8raw folder. You will probably find the resulting DNG files are magenta coloured and uneven. We can fix this later", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/6/?tab=comments#comment-2782212", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "let's use m8raw2dngv12beta_mac and m8raw2dng-droplet. m8raw2dngv12beta_mac should give you a folder with three files: lensdb.ini sensdb.ini m8raw2dng what i did was create a folder in my users directory named: m8raw2dng. copy the files from the m8raw2dngv12beta_mac folder into the newly created m8raw2dng folder. now we must tell the droplet where to find the m8raw2dng executable. 1. open the main.scpt in the droplet as described above 2. go to line 6. this says: set theapp to \"/applications/m8raw2dng\" this tells the droplet that the m8raw2dng executable is in /applications we put in the current user's directory so we change the line to: set theapp to \"~/m8raw2dng/m8raw2dng\" (keep the tab in front of the line) (on unix systems the ~ is the path to the current user's home directory) 3. save the file next we must set the parameters. the most important being the output -----> location !!!  (where to put the newly created dng files). 1. go to your pictures folder 2. create a folder called: m8raw (a different name is possible, if so change the following to reflect your folder's name) 3. open the main.scpt in the droplet as before 4. go to line 11. it says: set params to \" -v -r -b -p -l -o /users/yourname/pictures\" this tells the droplet with which parameters it should run the m8raw2dng. for a full description go to: m8raw2dng – tool to convert leica m8 raw files to dng the most important one is the -o it sets the output directory. change the line to: set params to \" -v -r -b -p -l -o ~/pictures/m8raw\" (change the path if you chose a different location / name) 5. save the file now your droplet is ready to be used. drag a folder of raw and jpg files on top of the droplet and it should output the resulting dng files in your ~/pictures/m8raw folder. you will probably find the resulting dng files are magenta coloured and uneven. we can fix this later", "sortedWord": "None", "identifyer": 41614, "year": "2015"}, {"Unnamed: 0": 385832, "autor": "rivi1969", "date": 1429928880000, "content": "Thank you Lenshacker, I will try the second option, when I download http://m8raw2dng.de/ on my Mac it only opens a text message who says: # m8raw2dng v1.10 # ################### Program converts Leica M8 RAW+JPEG pairs to DNG. Usage: m8raw2dng.exe -switch1 value1 -switch2 value2 ... Supported switches (values) [default value]: -i input: (folder or file) [location of m8raw2dng.exe] -o output: (folder) [input folder] -v verbose -r refresh: existing DNG files will be overwritten -b blacklevel estimation -p preview image 320x240 in DNG -c embed M9 color matrix -l load lens exif from lensdb.ini Help, feature suggestions & bug reports => m8raw2dng.de © 2013 Arvid Kuehl logout [Proceso completado] I will try the second process to see if I get lucky. Thank again! R", "link": "https://www.l-camera-forum.com/topic/244196-m8-living-with-a-vertical-line-does-it-gets-worst/?tab=comments#comment-2804436", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "thank you lenshacker, i will try the second option, when i download http://m8raw2dng.de/ on my mac it only opens a text message who says: # m8raw2dng v1.10 # ################### program converts leica m8 raw+jpeg pairs to dng. usage: m8raw2dng.exe -switch1 value1 -switch2 value2 ... supported switches (values) [default value]: -i input: (folder or file) [-----> location !!!  of m8raw2dng.exe] -o output: (folder) [input folder] -v verbose -r refresh: existing dng files will be overwritten -b blacklevel estimation -p preview image 320x240 in dng -c embed m9 color matrix -l load lens exif from lensdb.ini help, feature suggestions & bug reports => m8raw2dng.de © 2013 arvid kuehl logout [proceso completado] i will try the second process to see if i get lucky. thank again! r", "sortedWord": "None", "identifyer": 47237, "year": "2015"}, {"Unnamed: 0": 449362, "autor": "rbaron", "date": 1448070900000, "content": "Gary, thanks, but I've been to that location and it offers instructions for the camera but not for the EVF; I've got the hard copy for the camera so don't need the download. I guess with the GPS you just turn it on and hope. I found the display and even without a manual I think it is showing no connection to a satellite. Do you know: if you do make a connection where does it show the location....in the exif and you need to view it on a computer? It's not really that important I agree but it is the principle of the thing. --Bob", "link": "https://www.l-camera-forum.com/topic/253369-how-to-use-visoflex-020-evf-on-x-113/?tab=comments#comment-2933402", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "gary, thanks, but i've been to that -----> location !!!  and it offers instructions for the camera but not for the evf; i've got the hard copy for the camera so don't need the download. i guess with the gps you just turn it on and hope. i found the display and even without a manual i think it is showing no connection to a satellite. do you know: if you do make a connection where does it show the location....in the exif and you need to view it on a computer? it's not really that important i agree but it is the principle of the thing. --bob", "sortedWord": "None", "identifyer": 12852, "year": "2015"}, {"Unnamed: 0": 449485, "autor": "TMorita", "date": 1445658360000, "content": "I like your travel photos All taken on a RX10 ? Thanks! I use a bunch of different cameras. They're not really travel photos; they're mostly locations within an hour's drive from me. I'm currently unemployed, so trying to spend my time productively by practicing photography whenever possible. Here are some recent batches with the Leica X Vario: https://www.facebook.com/toshiyasu.morita.1/posts/10156282608825347?pnref=story https://www.facebook.com/toshiyasu.morita.1/posts/10156274251550347?pnref=story https://www.facebook.com/photo.php?fbid=10156264545575347&set=a.10152132005265347.918281.756295346&type=3 https://www.facebook.com/photo.php?fbid=10155937446645347&set=a.10152132005265347.918281.756295346&type=3 https://www.facebook.com/photo.php?fbid=10155925103240347&set=a.10152132005265347.918281.756295346&type=3 RX100 model 1: https://www.facebook.com/toshiyasu.morita.1/posts/10156270071705347 https://www.facebook.com/toshiyasu.morita.1/posts/10156266840625347 https://www.facebook.com/toshiyasu.morita.1/posts/10156197040395347 https://www.facebook.com/toshiyasu.morita.1/posts/10156137226325347 RX10 model 1: https://www.facebook.com/toshiyasu.morita.1/posts/10156110963875347 https://www.facebook.com/toshiyasu.morita.1/posts/10156092330960347 https://www.facebook.com/toshiyasu.morita.1/posts/10156064356740347 https://www.facebook.com/toshiyasu.morita.1/posts/10156013471215347 RX1 model 1: https://www.facebook.com/photo.php?fbid=10156212217270347&set=a.10152132005265347.918281.756295346&type=3&theater I tend to rotate cameras to keep things fresh and interesting. Toshi", "link": "https://www.l-camera-forum.com/topic/251580-pocket-size-perfection/?tab=comments#comment-2912318", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "locations", "selectorShort": "location", "MarkedSent": "i like your travel photos all taken on a rx10 ? thanks! i use a bunch of different cameras. they're not really travel photos; they're mostly -----> locations !!!  within an hour's drive from me. i'm currently unemployed, so trying to spend my time productively by practicing photography whenever possible. here are some recent batches with the leica x vario: https://www.facebook.com/toshiyasu.morita.1/posts/10156282608825347?pnref=story https://www.facebook.com/toshiyasu.morita.1/posts/10156274251550347?pnref=story https://www.facebook.com/photo.php?fbid=10156264545575347&set=a.10152132005265347.918281.756295346&type=3 https://www.facebook.com/photo.php?fbid=10155937446645347&set=a.10152132005265347.918281.756295346&type=3 https://www.facebook.com/photo.php?fbid=10155925103240347&set=a.10152132005265347.918281.756295346&type=3 rx100 model 1: https://www.facebook.com/toshiyasu.morita.1/posts/10156270071705347 https://www.facebook.com/toshiyasu.morita.1/posts/10156266840625347 https://www.facebook.com/toshiyasu.morita.1/posts/10156197040395347 https://www.facebook.com/toshiyasu.morita.1/posts/10156137226325347 rx10 model 1: https://www.facebook.com/toshiyasu.morita.1/posts/10156110963875347 https://www.facebook.com/toshiyasu.morita.1/posts/10156092330960347 https://www.facebook.com/toshiyasu.morita.1/posts/10156064356740347 https://www.facebook.com/toshiyasu.morita.1/posts/10156013471215347 rx1 model 1: https://www.facebook.com/photo.php?fbid=10156212217270347&set=a.10152132005265347.918281.756295346&type=3&theater i tend to rotate cameras to keep things fresh and interesting. toshi", "sortedWord": "None", "identifyer": 12976, "year": "2015"}, {"Unnamed: 0": 449930, "autor": "enboe", "date": 1437925440000, "content": "A different experience, my X1, purchased new from a Leica dealer in July 2010, had the battery retention clip fail. I dropped it off at the local Leica Gallerie, and much to my surprise, it showed up about a month later repaired free of charge. This is the second time I have received a free repair, an M6TTL/LHSA with a shutter fault being the other, well past the warranty period. I believe, but have no direct proof, that they take condition, repair history for the type of failure, and purchase location into consideration in determining if they provide an out-of-warranty repair for no cost. My X1 looked factory fresh upon submission to repair. Eric", "link": "https://www.l-camera-forum.com/topic/178967-pop-up-flash-repair-not-happy/?tab=comments#comment-2860855", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "a different experience, my x1, purchased new from a leica dealer in july 2010, had the battery retention clip fail. i dropped it off at the local leica gallerie, and much to my surprise, it showed up about a month later repaired free of charge. this is the second time i have received a free repair, an m6ttl/lhsa with a shutter fault being the other, well past the warranty period. i believe, but have no direct proof, that they take condition, repair history for the type of failure, and purchase -----> location !!!  into consideration in determining if they provide an out-of-warranty repair for no cost. my x1 looked factory fresh upon submission to repair. eric", "sortedWord": "None", "identifyer": 13421, "year": "2015"}, {"Unnamed: 0": 451414, "autor": "Bernd1959", "date": 1444295100000, "content": "\"Stormy Weather\" The D as Panorama-Camera. 180° View Angle Location: The Beach from Ètretat/France. Regards Bernd Germany --img-- ", "link": "https://www.l-camera-forum.com/topic/249357-post-your-type-109-images-here/page/2/?tab=comments#comment-2901252", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "location", "selectorShort": "location", "MarkedSent": "\"stormy weather\" the d as panorama-camera. 180° view angle -----> location !!! : the beach from ètretat/france. regards bernd germany --img-- ", "sortedWord": "None", "identifyer": 14935, "year": "2015"}], "name": "locationL-Forum2015"}