{"interestingcomments": [{"Unnamed: 0": 445319, "autor": "euston", "date": 1377376260000, "content": "So you can use LR5? My old iMac survived upgrade to Snow Leopard but I haven't ventured further. Yes, that's right. I had been putting off upgrading the OS of my iMac as Snow Leopard was working well. I had also been putting off moving from Photoshop and ACR to Lightroom. So I bit the bullet and did both and both moves went very smoothly. I've had zero problems with Mountain Lion and I'm getting to grips with Lightroom with the help of Julieanne Kost's excellent video tutorials at Getting Started with Adobe Photoshop Lightroom 5 | Adobe TV The processing tools are basically the same but I had never got on too well with the file management system until I watched Ms Kost's videos. If your iMac is capable of upgrading to Mountain Lion, there's no reason not to as far as I can see.", "link": "https://www.l-camera-forum.com/topic/206939-leica-x-vario-photos/page/6/?tab=comments#comment-2404594", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "file management", "selectorShort": "management", "MarkedSent": "so you can use lr5? my old imac survived upgrade to snow leopard but i haven't ventured further. yes, that's right. i had been putting off upgrading the os of my imac as snow leopard was working well. i had also been putting off moving from photoshop and acr to lightroom. so i bit the bullet and did both and both moves went very smoothly. i've had zero problems with mountain lion and i'm getting to grips with lightroom with the help of julieanne kost's excellent video tutorials at getting started with adobe photoshop lightroom 5 | adobe tv the processing tools are basically the same but i had never got on too well with the -----> file !!!  -----> management !!!  system until i watched ms kost's videos. if your imac is capable of upgrading to mountain lion, there's no reason not to as far as i can see.", "sortedWord": "None", "identifyer": 8719, "year": "2013"}], "name": "managementL-Forum2013"}