{"interestingcomments": [{"Unnamed: 0": 448894, "autor": "TMorita", "date": 1449468780000, "content": "I would buy an updated XV. My wish list (in order of priority) would be: o Updated sensor, preferably another Sony. o In-body image stabilization. If my XV had this, I'd use it a lot more. o Built-in EVF. The XV is hard to use in bright sunlight because the screen isn't very bright. o Decent grip. Few of my pet software peeves with the current XV I wish they would fix: o Can't disable aperture preview o Only a single focus point size. My other cameras have multiple focus point sizes, which is nice. o Shutter speed settings are only full EV stops. Would prefer 1/3 EV stops. o No focus peaking. o When focus assist is used, it always zooms on the center, which is mostly useless for me. It should zoom on the focus point if it's in single focus point mode. o No zebras for clipping in live view o Photo review will not use full screen for portrait orientation shots Edited December 7, 2015 by TMorita", "link": "https://www.l-camera-forum.com/topic/253974-xv-its-getting-old/?tab=comments#comment-2944224", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "i would buy an updated xv. my wish list (in order of priority) would be: o updated sensor, preferably another sony. o in-body image stabilization. if my xv had this, i'd use it a lot more. o built-in evf. the xv is hard to use in bright sunlight because the screen isn't very bright. o decent grip. few of my pet software peeves with the current xv i wish they would fix: o can't disable aperture preview o only a single focus point size. my other cameras have multiple focus point sizes, which is nice. o shutter speed settings are only full ev stops. would prefer 1/3 ev stops. o no focus peaking. o when focus assist is used, it always zooms on the center, which is mostly useless for me. it should zoom on the focus point if it's in single focus point mode. o no zebras for clipping in live view o photo review will not use full screen for portrait -----> orientation !!!  shots edited december 7, 2015 by tmorita", "sortedWord": "None", "identifyer": 12382, "year": "2015"}], "name": "orientationL-Forum2015"}