{"interestingcomments": [{"Unnamed: 0": 376338, "autor": "wparsonsgisnet", "date": 1254945060000, "content": "Hi Mike. I use the Metz off-camera cord. In the numbering scheme know only to the Metzmen, this is called an SCA 3008A cord. It has a sensor that sits in the hot shoe and that part has the 3502 adapter as its base. The other end of the cord goes in the bottom of the Metz flash, where the 3502 adapter used to go. My only complaint is that the rather-stiff, coiled cord isn't very long. I would really appreciate another foot of stretch. Everything works like a dream (with no ttl on the M8, of course). Regards, P.S.. I also have the Nikon cord that Sean refers to above. It doesn't sport the sensor on the hot shoe that the Metz cord does. If you use the Nikon cord, you need to pay attention to the orientation of the sensor in the flash unit.", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/?tab=comments#comment-1066159", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "hi mike. i use the metz off-camera cord. in the numbering scheme know only to the metzmen, this is called an sca 3008a cord. it has a sensor that sits in the hot shoe and that part has the 3502 adapter as its base. the other end of the cord goes in the bottom of the metz flash, where the 3502 adapter used to go. my only complaint is that the rather-stiff, coiled cord isn't very long. i would really appreciate another foot of stretch. everything works like a dream (with no ttl on the m8, of course). regards, p.s.. i also have the nikon cord that sean refers to above. it doesn't sport the sensor on the hot shoe that the metz cord does. if you use the nikon cord, you need to pay attention to the -----> orientation !!!  of the sensor in the flash unit.", "sortedWord": "None", "identifyer": 37648, "year": "2009"}, {"Unnamed: 0": 376340, "autor": "sean_reid", "date": 1254945240000, "content": "P.S.. I also have the Nikon cord that Sean refers to above. It doesn't sport the sensor on the hot shoe that the Metz cord does. If you use the Nikon cord, you need to pay attention to the orientation of the sensor in the flash unit. Unless...of course, you're using the SF58. Thanks for that info. about the Metz off-camera. Cheers, Sean", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/?tab=comments#comment-1066165", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "p.s.. i also have the nikon cord that sean refers to above. it doesn't sport the sensor on the hot shoe that the metz cord does. if you use the nikon cord, you need to pay attention to the -----> orientation !!!  of the sensor in the flash unit. unless...of course, you're using the sf58. thanks for that info. about the metz off-camera. cheers, sean", "sortedWord": "None", "identifyer": 37650, "year": "2009"}], "name": "orientationL-Forum2009"}