{"interestingcomments": [{"Unnamed: 0": 353594, "autor": "Jeff S", "date": 1458439800000, "content": "Thanks....I think!...not sure if I should feel good or bad...or maybe if I could see even better....or worse? Oh my. Not sure if this is related, but I do find it easier to focus with the camera in landscape rather than portrait orientation. Jeff Edited March 20, 2016 by Jeff S", "link": "https://www.l-camera-forum.com/topic/258125-leica-dioptre/page/4/?tab=comments#comment-3010729", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "thanks....i think!...not sure if i should feel good or bad...or maybe if i could see even better....or worse? oh my. not sure if this is related, but i do find it easier to focus with the camera in landscape rather than portrait -----> orientation !!! . jeff edited march 20, 2016 by jeff s", "sortedWord": "None", "identifyer": 14747, "year": "2016"}, {"Unnamed: 0": 353595, "autor": "Rick", "date": 1458440580000, "content": "Yep, that is because when in portrait you are trying to line up horizontal lines which are less sharp for you. When you shoot in portrait you can feel the frustration of your Leica presbyopic brethren... in both orientation for the rest of us. --img--  So, when dissected, your original statement wasn't quite correct. You do have trouble with the RF. Just half the trouble compared to the rest of us. Or, maybe more accurately, 10-20% of the time (when you shoot portrait). It's all explainable with optics! Rick", "link": "https://www.l-camera-forum.com/topic/258125-leica-dioptre/page/4/?tab=comments#comment-3010732", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "yep, that is because when in portrait you are trying to line up horizontal lines which are less sharp for you. when you shoot in portrait you can feel the frustration of your leica presbyopic brethren... in both -----> orientation !!!  for the rest of us. --img--  so, when dissected, your original statement wasn't quite correct. you do have trouble with the rf. just half the trouble compared to the rest of us. or, maybe more accurately, 10-20% of the time (when you shoot portrait). it's all explainable with optics! rick", "sortedWord": "None", "identifyer": 14748, "year": "2016"}, {"Unnamed: 0": 353596, "autor": "Jeff S", "date": 1458441900000, "content": "What's the charge, doc? Seriously, though, thanks.....that's more than anyone else has ever explained to me (not that I asked them). At least I now know why I prefer horizontal orientation (insert joke here). Maybe you should review/re-write any VF related FAQs. I won't be so quick to dismiss the numbers side of things...though I'd like to think there's still some mystery involved! There of course remains individual variation in preferences and comfort level with various 'solutions'...e.g., use of glasses (and different types like single vs progressives) vs contacts vs diopters....and considering other factors like my own sensitivity to light (use of sunglasses), etc. For now I still prefer the RF to most DSLR screens when used in MF mode. SLR screens were better....but I guess so were my younger eyes. Jeff", "link": "https://www.l-camera-forum.com/topic/258125-leica-dioptre/page/4/?tab=comments#comment-3010737", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "what's the charge, doc? seriously, though, thanks.....that's more than anyone else has ever explained to me (not that i asked them). at least i now know why i prefer horizontal -----> orientation !!!  (insert joke here). maybe you should review/re-write any vf related faqs. i won't be so quick to dismiss the numbers side of things...though i'd like to think there's still some mystery involved! there of course remains individual variation in preferences and comfort level with various 'solutions'...e.g., use of glasses (and different types like single vs progressives) vs contacts vs diopters....and considering other factors like my own sensitivity to light (use of sunglasses), etc. for now i still prefer the rf to most dslr screens when used in mf mode. slr screens were better....but i guess so were my younger eyes. jeff", "sortedWord": "None", "identifyer": 14749, "year": "2016"}, {"Unnamed: 0": 361544, "autor": "pechelman", "date": 1461766140000, "content": "I was able to review my 2 blackframe files yesterday. The first is definitely a black frame. The exif showed 1/60s, f9, iso320. The shots taken on either side of the blackframe, literally a couple of seconds before and after, came out fine, both 1/350, f4, iso320. The second blackframe I am no longer certain about. I think I may have accidentally tripped the shutter when it was inside my camera bag. The reasoning here is that I can see a small light leak from one edge of the frame and that the frame is showing up in a vertical orientation in lightroom, indicating the accelerometer picked that up as well. That's the orientation my camera is stored. That exif was 1s / ISO10000. Dont remember the calculated fstop.", "link": "https://www.l-camera-forum.com/topic/259371-m246-captures-blank-images/?tab=comments#comment-3034470", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "i was able to review my 2 blackframe files yesterday. the first is definitely a black frame. the exif showed 1/60s, f9, iso320. the shots taken on either side of the blackframe, literally a couple of seconds before and after, came out fine, both 1/350, f4, iso320. the second blackframe i am no longer certain about. i think i may have accidentally tripped the shutter when it was inside my camera bag. the reasoning here is that i can see a small light leak from one edge of the frame and that the frame is showing up in a vertical -----> orientation !!!  in lightroom, indicating the accelerometer picked that up as well. that's the orientation my camera is stored. that exif was 1s / iso10000. dont remember the calculated fstop.", "sortedWord": "None", "identifyer": 22785, "year": "2016"}, {"Unnamed: 0": 448548, "autor": "TMorita", "date": 1473583020000, "content": " One thing that's bugged me about the X Vario is it doesn't have a level gauge. I was always having to straighten trees and horizons in postprocessing. A few months ago I was watching a Youtube video and I noticed the guy was using a bubble level which clipped into his camera's hotshoe. So after searching around a bit, I finally found the one he was using - it's the Insignia 2-axis bubble level. http://www.bestbuy.com/site/insignia-2-axis-bubble-level/8156216.p?id=1219314436604&skuId=8156216 The nice thing about this one is it works in both landscape and portrait orientations. Highly recommended - saves hassle in post trying to straighten photos. Toshi", "link": "https://www.l-camera-forum.com/topic/264389-tip-hotshoe-bubble-level/?tab=comments#comment-3110243", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientations", "selectorShort": "orientation", "MarkedSent": " one thing that's bugged me about the x vario is it doesn't have a level gauge. i was always having to straighten trees and horizons in postprocessing. a few months ago i was watching a youtube video and i noticed the guy was using a bubble level which clipped into his camera's hotshoe. so after searching around a bit, i finally found the one he was using - it's the insignia 2-axis bubble level. http://www.bestbuy.com/site/insignia-2-axis-bubble-level/8156216.p?id=1219314436604&skuid=8156216 the nice thing about this one is it works in both landscape and portrait -----> orientations !!! . highly recommended - saves hassle in post trying to straighten photos. toshi", "sortedWord": "None", "identifyer": 12034, "year": "2016"}], "name": "orientationL-Forum2016"}