{"interestingcomments": [{"Unnamed: 0": 363245, "autor": "perfect1964", "date": 1608645660000, "content": "1 minute ago, BrianS said: The CCD used in the M Monochrome is in two halves, the error only occurs in one of them. For that reason- most likely a calibration error due to light shining in on the pixels used for the calibration. Hi thank you for responding. Is the CCD divided in half in the normal landscape orientation? Hence the top half in the portrait orientation of the photo which is where the sun was.", "link": "https://www.l-camera-forum.com/topic/316268-monochrom-ccd-shooting-into-low-sun-failure/?tab=comments#comment-4103747", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "1 minute ago, brians said: the ccd used in the m monochrome is in two halves, the error only occurs in one of them. for that reason- most likely a calibration error due to light shining in on the pixels used for the calibration. hi thank you for responding. is the ccd divided in half in the normal landscape -----> orientation !!! ? hence the top half in the portrait orientation of the photo which is where the sun was.", "sortedWord": "None", "identifyer": 24491, "year": "2020"}, {"Unnamed: 0": 363246, "autor": "BrianS", "date": 1608649980000, "content": "1 hour ago, perfect1964 said: Hi thank you for responding. Is the CCD divided in half in the normal landscape orientation? Hence the top half in the portrait orientation of the photo which is where the sun was. Your photo illustrates the two CCD's used for the final product. Two (~) 18mm by 24mm CCD's used to make the 24x36 final product.", "link": "https://www.l-camera-forum.com/topic/316268-monochrom-ccd-shooting-into-low-sun-failure/?tab=comments#comment-4103794", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "1 hour ago, perfect1964 said: hi thank you for responding. is the ccd divided in half in the normal landscape -----> orientation !!! ? hence the top half in the portrait orientation of the photo which is where the sun was. your photo illustrates the two ccd's used for the final product. two (~) 18mm by 24mm ccd's used to make the 24x36 final product.", "sortedWord": "None", "identifyer": 24492, "year": "2020"}, {"Unnamed: 0": 367126, "autor": "Jeff S", "date": 1579137720000, "content": "25 minutes ago, fotografr said: Who could possibly think a black screw head looks better than the red dot so many of us have loved over many decades? Maybe those who paid a premium for the M9-P, and other variants. 🙂 Much discussion here about at least getting the groove orientation vertical/consistent. Jeff", "link": "https://www.l-camera-forum.com/topic/304973-do-we-finally-have-a-new-monochrome-yes-i-think-so/page/6/?tab=comments#comment-3892145", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "25 minutes ago, fotografr said: who could possibly think a black screw head looks better than the red dot so many of us have loved over many decades? maybe those who paid a premium for the m9-p, and other variants. 🙂 much discussion here about at least getting the groove -----> orientation !!!  vertical/consistent. jeff", "sortedWord": "None", "identifyer": 28398, "year": "2020"}, {"Unnamed: 0": 370810, "autor": "kristyansen", "date": 1603888500000, "content": "Building on the great insights, introducing a variation of the initial thoughts that still go through my head. 1. Great masters in photography have gotten great pictures with low ISO, Color and B/W for a long time. Classical style will live forever. => So I know at some point in time I will have a MM(1?) together with my M9. Still... 2. For traveling I think one single camera may be the choice. Also I shoot people and family, in movement, and not landscapes. 3. Family likes color (B/W nice to have). 4. For family, often the low usable ISO of the M9 was an issue - smiling 1 second longer was tough, or closer aperture for larger depth of field was not doable in lower light. 5. I do shoot in low light too - I am generally used to exploiting to the max lower M9 ISOs - still I had situations where I would have liked the ISO 2500 of the M9 to be usable in color. 6. Last anecdote: I recently I shot a baptism with M9 and slightly dampened SF-24D flash (with permission; also the kid loved it). Went well - still slightly higher ISO would have made flash a lot less or totally unnecessary. => A color single body with slightly higher usable ISO may be the next step. => For a more reasonable price I am considering now either an M240 or M-P 240 (i.e. with screen). I liked it a lot more than I thought when I tested it (even the size. Color-wise, the reds ran a bit wild). But I have not tested the really low light capabilities. Unsure if the larger buffer of the P is worth it. And future-orientation is a question too - will it be serviceable long enough? Any thoughts and experience appreciated.", "link": "https://www.l-camera-forum.com/topic/314134-leica-m9-leica-mm1-or-single-m10-body/?tab=comments#comment-4069726", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "building on the great insights, introducing a variation of the initial thoughts that still go through my head. 1. great masters in photography have gotten great pictures with low iso, color and b/w for a long time. classical style will live forever. => so i know at some point in time i will have a mm(1?) together with my m9. still... 2. for traveling i think one single camera may be the choice. also i shoot people and family, in movement, and not landscapes. 3. family likes color (b/w nice to have). 4. for family, often the low usable iso of the m9 was an issue - smiling 1 second longer was tough, or closer aperture for larger depth of field was not doable in lower light. 5. i do shoot in low light too - i am generally used to exploiting to the max lower m9 isos - still i had situations where i would have liked the iso 2500 of the m9 to be usable in color. 6. last anecdote: i recently i shot a baptism with m9 and slightly dampened sf-24d flash (with permission; also the kid loved it). went well - still slightly higher iso would have made flash a lot less or totally unnecessary. => a color single body with slightly higher usable iso may be the next step. => for a more reasonable price i am considering now either an m240 or m-p 240 (i.e. with screen). i liked it a lot more than i thought when i tested it (even the size. color-wise, the reds ran a bit wild). but i have not tested the really low light capabilities. unsure if the larger buffer of the p is worth it. and future------> orientation !!!  is a question too - will it be serviceable long enough? any thoughts and experience appreciated.", "sortedWord": "None", "identifyer": 32110, "year": "2020"}, {"Unnamed: 0": 370824, "autor": "Edgar1920", "date": 1604263440000, "content": "Am 28.10.2020 um 13:35 schrieb kristyansen: Building on the great insights, introducing a variation of the initial thoughts that still go through my head. 1. Great masters in photography have gotten great pictures with low ISO, Color and B/W for a long time. Classical style will live forever. => So I know at some point in time I will have a MM(1?) together with my M9. Still... 2. For traveling I think one single camera may be the choice. Also I shoot people and family, in movement, and not landscapes. 3. Family likes color (B/W nice to have). 4. For family, often the low usable ISO of the M9 was an issue - smiling 1 second longer was tough, or closer aperture for larger depth of field was not doable in lower light. 5. I do shoot in low light too - I am generally used to exploiting to the max lower M9 ISOs - still I had situations where I would have liked the ISO 2500 of the M9 to be usable in color. 6. Last anecdote: I recently I shot a baptism with M9 and slightly dampened SF-24D flash (with permission; also the kid loved it). Went well - still slightly higher ISO would have made flash a lot less or totally unnecessary. => A color single body with slightly higher usable ISO may be the next step. => For a more reasonable price I am considering now either an M240 or M-P 240 (i.e. with screen). I liked it a lot more than I thought when I tested it (even the size. Color-wise, the reds ran a bit wild). But I have not tested the really low light capabilities. Unsure if the larger buffer of the P is worth it. And future-orientation is a question too - will it be serviceable long enough? Any thoughts and experience appreciated. Dear Kristyansen I can very well understand your thoughts and I have done the step beyond your scenario described. After purchasing my M9 years ago I had a good occasion to buy a MM1, at that time especially for higher ISO capabilities and the fascination of BW workflow. In between the MM1 inspired me to shoot more BW film. And this in the last years I had to take her out consciously. And it was a pleasure each time again. But more and more focussing on BW film workflow (which film type, which exposure, which developer) my MM1 became more and more neglected. On the other hand I shoot often in family events like weddings etc (okay now in COVID times not) and often struggle a bit with the acceptable ISO capabilities for my taste. So during more than a year I grew my decision to upgrade to a M10 or M10-R model. That finally happened one month ago with a good deal on a used M10 that cost me 1000€ more than the price I got for my MM1 that I have sold before. And for me it was the totally right decision. The M10 just feels like two evolution steps farther than the M9: everything a little better but nothing missing. Unfortunately I had no occasion until now to try it on family events and this will probably be the situation until next spring. But my first trials show me that 2 steps ISO higher will deliver at least equal picture quality. So instead of using f/1.4@1/30s I can take pictures with f/2@1/60s and get better focused and less blurred pictures. On the other hand I only use film (and even only one sort from now on: Kodak Double-X from 100-1600 ISO) when “really” shoot BW. I think for BW capabilities the M10 will deliver excellent quality, too as eben does my M9. And real-life difference to MM1 can be only found in 1:1 comparisons. Just the thing that is not really missing if you don’t have but that might become enchanting if you have it. I hope my post does help you in one or another way. Best regards. Frank", "link": "https://www.l-camera-forum.com/topic/314134-leica-m9-leica-mm1-or-single-m10-body/page/2/?tab=comments#comment-4072342", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "am 28.10.2020 um 13:35 schrieb kristyansen: building on the great insights, introducing a variation of the initial thoughts that still go through my head. 1. great masters in photography have gotten great pictures with low iso, color and b/w for a long time. classical style will live forever. => so i know at some point in time i will have a mm(1?) together with my m9. still... 2. for traveling i think one single camera may be the choice. also i shoot people and family, in movement, and not landscapes. 3. family likes color (b/w nice to have). 4. for family, often the low usable iso of the m9 was an issue - smiling 1 second longer was tough, or closer aperture for larger depth of field was not doable in lower light. 5. i do shoot in low light too - i am generally used to exploiting to the max lower m9 isos - still i had situations where i would have liked the iso 2500 of the m9 to be usable in color. 6. last anecdote: i recently i shot a baptism with m9 and slightly dampened sf-24d flash (with permission; also the kid loved it). went well - still slightly higher iso would have made flash a lot less or totally unnecessary. => a color single body with slightly higher usable iso may be the next step. => for a more reasonable price i am considering now either an m240 or m-p 240 (i.e. with screen). i liked it a lot more than i thought when i tested it (even the size. color-wise, the reds ran a bit wild). but i have not tested the really low light capabilities. unsure if the larger buffer of the p is worth it. and future------> orientation !!!  is a question too - will it be serviceable long enough? any thoughts and experience appreciated. dear kristyansen i can very well understand your thoughts and i have done the step beyond your scenario described. after purchasing my m9 years ago i had a good occasion to buy a mm1, at that time especially for higher iso capabilities and the fascination of bw workflow. in between the mm1 inspired me to shoot more bw film. and this in the last years i had to take her out consciously. and it was a pleasure each time again. but more and more focussing on bw film workflow (which film type, which exposure, which developer) my mm1 became more and more neglected. on the other hand i shoot often in family events like weddings etc (okay now in covid times not) and often struggle a bit with the acceptable iso capabilities for my taste. so during more than a year i grew my decision to upgrade to a m10 or m10-r model. that finally happened one month ago with a good deal on a used m10 that cost me 1000€ more than the price i got for my mm1 that i have sold before. and for me it was the totally right decision. the m10 just feels like two evolution steps farther than the m9: everything a little better but nothing missing. unfortunately i had no occasion until now to try it on family events and this will probably be the situation until next spring. but my first trials show me that 2 steps iso higher will deliver at least equal picture quality. so instead of using f/1.4@1/30s i can take pictures with f/2@1/60s and get better focused and less blurred pictures. on the other hand i only use film (and even only one sort from now on: kodak double-x from 100-1600 iso) when “really” shoot bw. i think for bw capabilities the m10 will deliver excellent quality, too as eben does my m9. and real-life difference to mm1 can be only found in 1:1 comparisons. just the thing that is not really missing if you don’t have but that might become enchanting if you have it. i hope my post does help you in one or another way. best regards. frank", "sortedWord": "None", "identifyer": 32124, "year": "2020"}, {"Unnamed: 0": 372807, "autor": "farnz", "date": 1588720620000, "content": " The M3 with its 0.91 viewfinder is very well set up for both eyes focussing and I often do so. It's particularly useful for candid portraiture because I find that having the left eye open when shooting tends to put the subject more at ease because you can maintain eye contact with them and they are less conscious of the camera and often act more naturally. I'm naturally a left-eye shooter but trained myself to shoot with my right eye when I started wearing spectacles. It was much easier than I'd expected. Now quite often I'll shoot right-eye in landscape orientation and left-eye in portrait orientation because it saves having my trigger-hand over my head, which attracts attention. Pete.", "link": "https://www.l-camera-forum.com/topic/309136-both-eyes-open/?tab=comments#comment-3967728", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": " the m3 with its 0.91 viewfinder is very well set up for both eyes focussing and i often do so. it's particularly useful for candid portraiture because i find that having the left eye open when shooting tends to put the subject more at ease because you can maintain eye contact with them and they are less conscious of the camera and often act more naturally. i'm naturally a left-eye shooter but trained myself to shoot with my right eye when i started wearing spectacles. it was much easier than i'd expected. now quite often i'll shoot right-eye in landscape -----> orientation !!!  and left-eye in portrait -----> orientation !!!  because it saves having my trigger-hand over my head, which attracts attention. pete.", "sortedWord": "None", "identifyer": 34111, "year": "2020"}, {"Unnamed: 0": 373078, "autor": "pippy", "date": 1584212640000, "content": "Leica's POOTR polarising filter has a P engraved & painted on the front edge. From memory when the P is either at the 12 o'clock / 6 o'clock it is working at its most efficient when the camera is being used in 'landscape' orientation and, it follows, 3 o'clock / 9 o'clock for 'portrait' stuff. Obviously making a similar indexing mark on any other brand filter would work in a similar fashion. It doesn't give you all the story, of course, because different angles of sun / subject / viewpoint cannot be taken into consideration but, depending on what you tend to shoot, it might be a useful marker. Works for 99% of my polarising needs. Philip.", "link": "https://www.l-camera-forum.com/topic/307436-polariser-on-rangefinder/?tab=comments#comment-3931324", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "leica's pootr polarising filter has a p engraved & painted on the front edge. from memory when the p is either at the 12 o'clock / 6 o'clock it is working at its most efficient when the camera is being used in 'landscape' -----> orientation !!!  and, it follows, 3 o'clock / 9 o'clock for 'portrait' stuff. obviously making a similar indexing mark on any other brand filter would work in a similar fashion. it doesn't give you all the story, of course, because different angles of sun / subject / viewpoint cannot be taken into consideration but, depending on what you tend to shoot, it might be a useful marker. works for 99% of my polarising needs. philip.", "sortedWord": "None", "identifyer": 34382, "year": "2020"}, {"Unnamed: 0": 393873, "autor": "105012", "date": 1608985380000, "content": "Take a look at the rangefinder mirror (the small one to the right of the body in use orientation), it might be something on that or possibly damage to it.", "link": "https://www.l-camera-forum.com/topic/285365-buying-m2/page/4/?tab=comments#comment-4106020", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "take a look at the rangefinder mirror (the small one to the right of the body in use -----> orientation !!! ), it might be something on that or possibly damage to it.", "sortedWord": "None", "identifyer": 6337, "year": "2020"}, {"Unnamed: 0": 394339, "autor": "TomB_tx", "date": 1605485400000, "content": "The spool is not synchronized with the sprocket, but has a friction clutch to slip and keep slight tension on the film as the diameter of the film wound on the spool increases with each frame taken up. So the spool may be at any orientation. Remember the spool actually turns back towards the sprocket (counter-clockwise from the bottom view) to wrap farther around the sprocket. It doesn't matter which slot of the spool takes the film leader. I've been loading my M6 since 1985 (and M4 since 1968), and just use the slot closest to the sprocket.", "link": "https://www.l-camera-forum.com/topic/315153-m6-loading/?tab=comments#comment-4081023", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "the spool is not synchronized with the sprocket, but has a friction clutch to slip and keep slight tension on the film as the diameter of the film wound on the spool increases with each frame taken up. so the spool may be at any -----> orientation !!! . remember the spool actually turns back towards the sprocket (counter-clockwise from the bottom view) to wrap farther around the sprocket. it doesn't matter which slot of the spool takes the film leader. i've been loading my m6 since 1985 (and m4 since 1968), and just use the slot closest to the sprocket.", "sortedWord": "None", "identifyer": 6804, "year": "2020"}, {"Unnamed: 0": 394341, "autor": "lmans", "date": 1605533340000, "content": "13 hours ago, TomB_tx said: The spool is not synchronized with the sprocket, but has a friction clutch to slip and keep slight tension on the film as the diameter of the film wound on the spool increases with each frame taken up. So the spool may be at any orientation. Remember the spool actually turns back towards the sprocket (counter-clockwise from the bottom view) to wrap farther around the sprocket. It doesn't matter which slot of the spool takes the film leader. I've been loading my M6 since 1985 (and M4 since 1968), and just use the slot closest to the sprocket. Interesting....I was not aware of that. So if I load my film like I did the last two days (wasn't doing this in the past), and the film is not catching in the spool, what do I do? The film is on the sprockets but just not catching into the spool. So when I advance the film lever, the film itself doesn't advance. I have to manually adjust the film to make it into the spool, if that makes sense? jim", "link": "https://www.l-camera-forum.com/topic/315153-m6-loading/?tab=comments#comment-4081243", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "13 hours ago, tomb_tx said: the spool is not synchronized with the sprocket, but has a friction clutch to slip and keep slight tension on the film as the diameter of the film wound on the spool increases with each frame taken up. so the spool may be at any -----> orientation !!! . remember the spool actually turns back towards the sprocket (counter-clockwise from the bottom view) to wrap farther around the sprocket. it doesn't matter which slot of the spool takes the film leader. i've been loading my m6 since 1985 (and m4 since 1968), and just use the slot closest to the sprocket. interesting....i was not aware of that. so if i load my film like i did the last two days (wasn't doing this in the past), and the film is not catching in the spool, what do i do? the film is on the sprockets but just not catching into the spool. so when i advance the film lever, the film itself doesn't advance. i have to manually adjust the film to make it into the spool, if that makes sense? jim", "sortedWord": "None", "identifyer": 6806, "year": "2020"}, {"Unnamed: 0": 402123, "autor": "adan", "date": 1591629780000, "content": " Yes, Pippy. I wondered if there was a \"northern European\" standard at work here. I remember my Flanders & Swann from the age of 6. \"Ah, summer; summer is here again. Missed it last year - I was in the bathroom.\" - introduction to A Song of the Weather _____________ Meanwhile, yes, a measured 13-stop brightness range is quite common here in Colorado: Stark blue skies with often not one cloud (for fill reflections) to be seen, horizon to horizon. Visibility significantly >50 miles, air about 80% the density of sea level = less scattering. I haven't needed a polarizer in 28 years - with a 21 in vertical orientation, the sky goes nearly black at the top of the frame if I hold detail in a white T-shirt (even with a Mandler 21). Edited June 8, 2020 by adan", "link": "https://www.l-camera-forum.com/topic/310164-show-me-your-favorite-lenses/page/6/?tab=comments#comment-3989831", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": " yes, pippy. i wondered if there was a \"northern european\" standard at work here. i remember my flanders & swann from the age of 6. \"ah, summer; summer is here again. missed it last year - i was in the bathroom.\" - introduction to a song of the weather _____________ meanwhile, yes, a measured 13-stop brightness range is quite common here in colorado: stark blue skies with often not one cloud (for fill reflections) to be seen, horizon to horizon. visibility significantly >50 miles, air about 80% the density of sea level = less scattering. i haven't needed a polarizer in 28 years - with a 21 in vertical -----> orientation !!! , the sky goes nearly black at the top of the frame if i hold detail in a white t-shirt (even with a mandler 21). edited june 8, 2020 by adan", "sortedWord": "None", "identifyer": 14858, "year": "2020"}, {"Unnamed: 0": 432246, "autor": "AdHox", "date": 1594642680000, "content": "I never venture outside without polarised sunglasses, and rarely without a hat or cap of some variety. That’s been the situation since my 20s. So I’ll admit to being in my 50s and almost a senior, but I reject the proposition that headwear is limited to the old. The sunglasses come off when looking through the viewfinder because my view of the world from behind polarised lenses is not what the sensor is seeing (unless I attach a PL filter to the lens). With or without polarisation can be a massive difference, and that’s the case whether using OVF, EVF, or the screen on the back. The hat sometimes comes off if it gets in the way, especially shooting in portrait orientation. OVF and EVF each have pros and cons. The screen on the back just has cons.", "link": "https://www.l-camera-forum.com/topic/311267-this-time-of-year-when-i-hate-all-mirrorless/?tab=comments#comment-4008151", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "i never venture outside without polarised sunglasses, and rarely without a hat or cap of some variety. that’s been the situation since my 20s. so i’ll admit to being in my 50s and almost a senior, but i reject the proposition that headwear is limited to the old. the sunglasses come off when looking through the viewfinder because my view of the world from behind polarised lenses is not what the sensor is seeing (unless i attach a pl filter to the lens). with or without polarisation can be a massive difference, and that’s the case whether using ovf, evf, or the screen on the back. the hat sometimes comes off if it gets in the way, especially shooting in portrait -----> orientation !!! . ovf and evf each have pros and cons. the screen on the back just has cons.", "sortedWord": "None", "identifyer": 45407, "year": "2020"}, {"Unnamed: 0": 444440, "autor": "hdmesa", "date": 1609377360000, "content": "On 12/3/2020 at 12:58 PM, Anders Vinberg said: No, the sun star is there, that’s normal, but the vertical and horizontal grid pattern is not. Sure, it may be some effect from the sensor structure, but that’s not good. I have not seen that on anything from a phone to a 100 mp medium format. Unfortunately the grid pattern sensor reflections happen with a lot of modern mirrorless cameras, including the GFX line with GF lenses. I've seen them on every mirrorless system I've used – X100V, GFX 50S/R, Canon RP/R/Ra/R6/R5, and Leica Q (don't remember seeing them on the SL, though). Depending on the lens (seems easier to conjure with wide angles), f-stop (f/16+) and the angle/intensity of the sun, it can be anywhere from mild to severe enough to completely ruin a shot. But I have to say it doesn't look nearly as bad on a monochrome sensor as it does on a color sensor. If you want to see the grid pattern on another system, take a look at the DPR sample images from their review of the Fujifilm GF 30 lens – it's pretty jarring in one of the shots. If you haven't seen this pattern yet, you're either still using a DSLR or haven't encountered the right situation. Usually when I get this pattern, I open the lens back up to at least f/8 or change my orientation/composition until the pattern goes away. Edited December 31, 2020 by hdmesa", "link": "https://www.l-camera-forum.com/topic/314986-leica-q2-monochrom/page/11/?tab=comments#comment-4109176", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "on 12/3/2020 at 12:58 pm, anders vinberg said: no, the sun star is there, that’s normal, but the vertical and horizontal grid pattern is not. sure, it may be some effect from the sensor structure, but that’s not good. i have not seen that on anything from a phone to a 100 mp medium format. unfortunately the grid pattern sensor reflections happen with a lot of modern mirrorless cameras, including the gfx line with gf lenses. i've seen them on every mirrorless system i've used – x100v, gfx 50s/r, canon rp/r/ra/r6/r5, and leica q (don't remember seeing them on the sl, though). depending on the lens (seems easier to conjure with wide angles), f-stop (f/16+) and the angle/intensity of the sun, it can be anywhere from mild to severe enough to completely ruin a shot. but i have to say it doesn't look nearly as bad on a monochrome sensor as it does on a color sensor. if you want to see the grid pattern on another system, take a look at the dpr sample images from their review of the fujifilm gf 30 lens – it's pretty jarring in one of the shots. if you haven't seen this pattern yet, you're either still using a dslr or haven't encountered the right situation. usually when i get this pattern, i open the lens back up to at least f/8 or change my -----> orientation !!! /composition until the pattern goes away. edited december 31, 2020 by hdmesa", "sortedWord": "None", "identifyer": 7826, "year": "2020"}, {"Unnamed: 0": 444442, "autor": "RoySmith", "date": 1609419120000, "content": "11 hours ago, hdmesa said: If you want to see the grid pattern on another system, take a look at the DPR sample images from their review of the Fujifilm GF 30 lens – it's pretty jarring in one of the shots. If you haven't seen this pattern yet, you're either still using a DSLR or haven't encountered the right situation. Usually when I get this pattern, I open the lens back up to at least f/8 or change my orientation/composition until the pattern goes away. Why would a mirrorless camera be more susceptible to this artifact than a DSLR? It’s still light transmitting through a lens to a digital sensor?", "link": "https://www.l-camera-forum.com/topic/314986-leica-q2-monochrom/page/11/?tab=comments#comment-4109376", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "orientation", "selectorShort": "orientation", "MarkedSent": "11 hours ago, hdmesa said: if you want to see the grid pattern on another system, take a look at the dpr sample images from their review of the fujifilm gf 30 lens – it's pretty jarring in one of the shots. if you haven't seen this pattern yet, you're either still using a dslr or haven't encountered the right situation. usually when i get this pattern, i open the lens back up to at least f/8 or change my -----> orientation !!! /composition until the pattern goes away. why would a mirrorless camera be more susceptible to this artifact than a dslr? it’s still light transmitting through a lens to a digital sensor?", "sortedWord": "None", "identifyer": 7828, "year": "2020"}], "name": "orientationL-Forum2020"}