{"interestingcomments": [{"Unnamed: 0": 432705, "autor": "ron777", "date": 1554248760000, "content": "At my age, IBIS is a must. In fact, I'd purchased the a7rIII for the sole purpose of taking advantage of its IBIS. However, Sony's implementation of IBIS is not as effective as the competition. I had great hopes for Leica's OIS, but while the 24-90mm produces great images, and I have no intention of ever selling it—never say never—its OIS is not that impressive. Enter the Panasonic S1R, and while I've yet to receive my copy, all reports, as well as your own, seem to indicate that its IBIS is quite good. After suffering through Sony's menu system, once I'd set its buttons to my liking there has been little menu diving. I am hopeful that the S1R will prove similar. While I agree that Leica's lean menu implementation and simplistic button approach is appreciated by many, it has its limitations as well. For example—and there are others—I would like to be able to display the SL's histogram and grid at the same time, but that's not possible, and no amount of unanswered emails to Leica has resulted in a software fix, as I assume that this is a coding issue. It would also be nice if there were the ability to alter EVF brightness but, short of fiddling with exposure compensation that is not possible. These, IMO, could all be menu options. The excuse floating around the Internet goes like this, \"Leica is a small company with limited resources...\" No argument there, and it is the very reason that if the S1R performs to expectations, I will likely sell my SL, save the anticipated four or more thousand dollars that it would undoubtedly cost for the SL2 over the S1r and call it a day. As for \"M\" lens compatibility, I own four Summicrons (28mm, 35mm, 50mm, 90mm) that were used with various film bearing Leica's and later with an M8 and M9, neither of which can I effectively focus these days. Anyway, those focal lengths are all covered by the 24-90 Zoom, and the image quality from the zoom is, in my estimation, pretty close to if not better in some instances than the corresponding primes. Sure, there is a weight and size advantage to the primes, but put them all in your bag and their combined weight doesn't feel a whole lot different than the single zoom, and there is no need to find a place to change lenses, or fiddle with manual focus if you're recording an image on the fly. It's been said that the M's will outlast the motor driven zooms, and that's probably true, as some of my primes are roughly 20 years old and look and work like new, but the real questions is, will I outlast my zooms? As for the Panasonic's My Menu and Q Menu, my guess is that many of your observations will be ameliorated by future firmware updates as dictated by user feedback. And if not, we humans become accustomed to most minor inconveniences, although we older dogs take a little more time. Edited April 3, 2019 by ron777", "link": "https://www.l-camera-forum.com/topic/305981-images-from-panasonic-cameras-merged/page/8/?tab=comments#comment-3714578", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "find a place", "selectorShort": "place", "MarkedSent": "at my age, ibis is a must. in fact, i'd purchased the a7riii for the sole purpose of taking advantage of its ibis. however, sony's implementation of ibis is not as effective as the competition. i had great hopes for leica's ois, but while the 24-90mm produces great images, and i have no intention of ever selling it—never say never—its ois is not that impressive. enter the panasonic s1r, and while i've yet to receive my copy, all reports, as well as your own, seem to indicate that its ibis is quite good. after suffering through sony's menu system, once i'd set its buttons to my liking there has been little menu diving. i am hopeful that the s1r will prove similar. while i agree that leica's lean menu implementation and simplistic button approach is appreciated by many, it has its limitations as well. for example—and there are others—i would like to be able to display the sl's histogram and grid at the same time, but that's not possible, and no amount of unanswered emails to leica has resulted in a software fix, as i assume that this is a coding issue. it would also be nice if there were the ability to alter evf brightness but, short of fiddling with exposure compensation that is not possible. these, imo, could all be menu options. the excuse floating around the internet goes like this, \"leica is a small company with limited resources...\" no argument there, and it is the very reason that if the s1r performs to expectations, i will likely sell my sl, save the anticipated four or more thousand dollars that it would undoubtedly cost for the sl2 over the s1r and call it a day. as for \"m\" lens compatibility, i own four summicrons (28mm, 35mm, 50mm, 90mm) that were used with various film bearing leica's and later with an m8 and m9, neither of which can i effectively focus these days. anyway, those focal lengths are all covered by the 24-90 zoom, and the image quality from the zoom is, in my estimation, pretty close to if not better in some instances than the corresponding primes. sure, there is -----> a !!!  weight and size advantage to the primes, but put them all in your bag and their combined weight doesn't feel -----> a !!!  whole lot different than the single zoom, and there is no need to -----> find !!!  -----> a !!!  -----> place !!!  to change lenses, or fiddle with manual focus if you're recording an image on the fly. it's been said that the m's will outlast the motor driven zooms, and that's probably true, as some of my primes are roughly 20 years old and look and work like new, but the real questions is, will i outlast my zooms? as for the panasonic's my menu and q menu, my guess is that many of your observations will be ameliorated by future firmware updates as dictated by user feedback. and if not, we humans become accustomed to most minor inconveniences, although we older dogs take a little more time. edited april 3, 2019 by ron777", "sortedWord": "None", "identifyer": 45869, "year": "2019"}, {"Unnamed: 0": 437722, "autor": "FlashGordonPhotography", "date": 1554759060000, "content": "I have yet to receive my S1R. When I do it will be a compliment to my SL's not a replacement. The SL is my favourite \"big\" camera. I often print big (a1 or larger) so the resolution is useful for me. I will pair my S1R with the wonderful Leica optics and the specialist Canon lenses I have (T/S and macro) via the Novoflex adaptor. I may even look at a 60-600 Sigma later on when the Sigma adaptor becomes available. I would like to upgrade to an SL2 when it comes out however I don't think Leica will make it without mandatory LENR and so I won't be a purchaser if it has that. The S1R will spend much of its life on a tripod so I don't care about high ISO's and will appreciate the flippy screen. OTOH I'm looking forward to shooting the 50SL with IBIS.. To be able to utilise my T/S lenses on a high res sensor I have been using Sony bodies and I have many FE lenses now. All of them will go when the S1R arrives. Love the files. Hate the cameras. I will build a small kit around my Nikon Z7 for travelling light, plus my RX1RII (unless Leica surprise with a 50mm Q2) and keep my X1D for when things get serious ( ). Apart from the SL bodies I will likely divest myself of anything under 40MP, although selling my M10 and CL will be difficult. Where the lower resolution is sufficient I have not found a place in my shooting envelope where the SL isn't enough camera. Gordon", "link": "https://www.l-camera-forum.com/topic/296004-s1-vs-s1r-vs-sl/?tab=comments#comment-3718502", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "found a place", "selectorShort": "place", "MarkedSent": "i have yet to receive my s1r. when i do it will be a compliment to my sl's not a replacement. the sl is my favourite \"big\" camera. i often print big (a1 or larger) so the resolution is useful for me. i will pair my s1r with the wonderful leica optics and the specialist canon lenses i have (t/s and macro) via the novoflex adaptor. i may even look at a 60-600 sigma later on when the sigma adaptor becomes available. i would like to upgrade to an sl2 when it comes out however i don't think leica will make it without mandatory lenr and so i won't be a purchaser if it has that. the s1r will spend much of its life on a tripod so i don't care about high iso's and will appreciate the flippy screen. otoh i'm looking forward to shooting the 50sl with ibis.. to be able to utilise my t/s lenses on a high res sensor i have been using sony bodies and i have many fe lenses now. all of them will go when the s1r arrives. love the files. hate the cameras. i will build a small kit around my nikon z7 for travelling light, plus my rx1rii (unless leica surprise with a 50mm q2) and keep my x1d for when things get serious ( ). apart from the sl bodies i will likely divest myself of anything under 40mp, although selling my m10 and cl will be difficult. where the lower resolution is sufficient i have not -----> found !!!  -----> a !!!  -----> place !!!  in my shooting envelope where the sl isn't enough camera. gordon", "sortedWord": "None", "identifyer": 50963, "year": "2019"}], "name": "placeL-Forum2019"}