{"interestingcomments": [{"Unnamed: 0": 356021, "autor": "Guest WPalank", "date": 1281925980000, "content": "Question: My \"Memory Metering Lock\" does not seem to be functioning on my M while in Aperture Priority Mode (\"A\"). In other words, I meter for one portion of the scene (center weighted), depress the shutter to position 2 (slightly depressed activating the red LED display within the viewfinder), continue holding the shutter and recompose the frame. The red LED indicates the shutter speed is changing as I recompose whereas it should remain fixed. Does my camera need to be fixed? Chances are your Shutter Advance is set to \"Soft\". MML only works in \"Standard\" or \"Discrete\".", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/2/?tab=comments#comment-2464071", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question: my \"memory metering lock\" does not seem to be functioning on my m while in aperture priority mode (\"a\"). in other words, i meter for one portion of the scene (center weighted), depress the shutter to -----> position !!!  2 (slightly depressed activating the red led display within the viewfinder), continue holding the shutter and recompose the frame. the red led indicates the shutter speed is changing as i recompose whereas it should remain fixed. does my camera need to be fixed? chances are your shutter advance is set to \"soft\". mml only works in \"standard\" or \"discrete\".", "sortedWord": "None", "identifyer": 17187, "year": "2010"}, {"Unnamed: 0": 356027, "autor": "jaapv", "date": 1291365300000, "content": "Question: I want to use an old flash, but I am afraid that the trigger voltage may damage my camera. What is the maximum for a digital M ? Answer: This is the official position by leica: The M9 is capable of triggering flash devices using high voltage.It is possible to use flash devices with a voltage up to 600 Volts. But it is important that the positive terminal is on the middle contact of the hot shoe and the ground terminal is on the mounting bar. Mit freundlichen Gruessen / kind regards Stefan Staudt Leica Camera AG Informationsservice Software Support Gewerbepark 8 / D-35606 Solms / Germany", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/2/?tab=comments#comment-2464077", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question: i want to use an old flash, but i am afraid that the trigger voltage may damage my camera. what is the maximum for a digital m ? answer: this is the official -----> position !!!  by leica: the m9 is capable of triggering flash devices using high voltage.it is possible to use flash devices with a voltage up to 600 volts. but it is important that the positive terminal is on the middle contact of the hot shoe and the ground terminal is on the mounting bar. mit freundlichen gruessen / kind regards stefan staudt leica camera ag informationsservice software support gewerbepark 8 / d-35606 solms / germany", "sortedWord": "None", "identifyer": 17193, "year": "2010"}, {"Unnamed: 0": 369377, "autor": "Julian Thompson", "date": 1271191860000, "content": "I forgot to say. Before you start take a quick photo of the position of the cam, roughly, as it is now, so that if you want to get back to starting point you can reference roughly where it is now. This sounds an odd thing to do but when you get the cam adjustment loose you may knock it a lot by accident and it's helpful to know roughly where to put it before doing some test shots.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/2/?tab=comments#comment-1293094", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i forgot to say. before you start take a quick photo of the -----> position !!!  of the cam, roughly, as it is now, so that if you want to get back to starting point you can reference roughly where it is now. this sounds an odd thing to do but when you get the cam adjustment loose you may knock it a lot by accident and it's helpful to know roughly where to put it before doing some test shots.", "sortedWord": "None", "identifyer": 30673, "year": "2010"}, {"Unnamed: 0": 369399, "autor": "marknorton", "date": 1271236080000, "content": "Good info from Julian, thank you. That screw is certainly difficult to get at. In the M8, there's a plastic plug in the base of the lens throat which allows you to get at the screw with a long screwdriver through the bottom of the camera with the plastic base plate removed. Not so the M9 which is more awkward. As Julian says, the two lever arm adjustments do interact and there's some evidence that lenses with a steeply raked focussing cam such as the 18mm Super-Wide Elmar can cause problems with some cameras, possibly if the adjustment is at the limit. It's a pity that Leica could not devise a mechanism where the \"gain\" (lever arm length) and \"offset\" (roller position) were not completely independent of each other.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/3/?tab=comments#comment-1293583", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "good info from julian, thank you. that screw is certainly difficult to get at. in the m8, there's a plastic plug in the base of the lens throat which allows you to get at the screw with a long screwdriver through the bottom of the camera with the plastic base plate removed. not so the m9 which is more awkward. as julian says, the two lever arm adjustments do interact and there's some evidence that lenses with a steeply raked focussing cam such as the 18mm super-wide elmar can cause problems with some cameras, possibly if the adjustment is at the limit. it's a pity that leica could not devise a mechanism where the \"gain\" (lever arm length) and \"offset\" (roller -----> position !!! ) were not completely independent of each other.", "sortedWord": "None", "identifyer": 30695, "year": "2010"}, {"Unnamed: 0": 369410, "autor": "marknorton", "date": 1271331180000, "content": "Julian, have you had any problems with the locking screw upsetting the cam position when you tighten it? I find that even with a washer, the cam tends to move when I tighten it.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/4/?tab=comments#comment-1294830", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "julian, have you had any problems with the locking screw upsetting the cam -----> position !!!  when you tighten it? i find that even with a washer, the cam tends to move when i tighten it.", "sortedWord": "None", "identifyer": 30706, "year": "2010"}, {"Unnamed: 0": 369433, "autor": "menos I M6", "date": 1272153960000, "content": "The Jaap has spoken ;-) So guys, that this discussion doesn't go out into an ugly knife fight two small comments: Jaap is correct in one point, there is a special service tool, fitting into the small hole in the roller arm for adjustment of the arm's angle. And for clarification - no, the arm is not physically bent, nor is it a \"bending tool\" of any sort, but instead a tool, to fine adjust the arm's position with a better leverage and to have a secure fix on the arm, when putting any momentum on either adjustment screw (as the people, who have set the RF by themselves - myself included - have experienced, does any screw adjustment without counter working the screw momentum result in other settings getting \"off\") Second comment: Julian, thanks a lot for the great thread and the collected information here, making function and adjustment of the RF sufficiently transparent for the people, who actually care about doing some work by themselves. RF adjustment really is a servicing like sensor cleaning, changing a tire or repairing a leak in the roof. Of course will qualified personnel do the job better than you! But do you call up the specialist, every time, you have a flat tire or a speck on the sensor of your digital camera? It costs one bump of the camera to get the darn thing out of alignment. It can cost up to many months for Leica, to realign that error prone thing again - a regular user of the camera system, who is qualified with good hands, a brain and some technical common sense simply has to learn and understand the RF adjustment. Oh and I don't participate in knife fights - no arguments for me ;-)", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/5/?tab=comments#comment-1304676", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the jaap has spoken ;-) so guys, that this discussion doesn't go out into an ugly knife fight two small comments: jaap is correct in one point, there is a special service tool, fitting into the small hole in the roller arm for adjustment of the arm's angle. and for clarification - no, the arm is not physically bent, nor is it a \"bending tool\" of any sort, but instead a tool, to fine adjust the arm's -----> position !!!  with a better leverage and to have a secure fix on the arm, when putting any momentum on either adjustment screw (as the people, who have set the rf by themselves - myself included - have experienced, does any screw adjustment without counter working the screw momentum result in other settings getting \"off\") second comment: julian, thanks a lot for the great thread and the collected information here, making function and adjustment of the rf sufficiently transparent for the people, who actually care about doing some work by themselves. rf adjustment really is a servicing like sensor cleaning, changing a tire or repairing a leak in the roof. of course will qualified personnel do the job better than you! but do you call up the specialist, every time, you have a flat tire or a speck on the sensor of your digital camera? it costs one bump of the camera to get the darn thing out of alignment. it can cost up to many months for leica, to realign that error prone thing again - a regular user of the camera system, who is qualified with good hands, a brain and some technical common sense simply has to learn and understand the rf adjustment. oh and i don't participate in knife fights - no arguments for me ;-)", "sortedWord": "None", "identifyer": 30729, "year": "2010"}, {"Unnamed: 0": 369434, "autor": "Julian Thompson", "date": 1272178680000, "content": "This is beyond funny Jaap, and just shows how you will push a position rather than saying 'ah I see, sorry guys I was wrong' So it turns out that the service tool is used to lock into the hole in the arm and effect an adjustment of the arm length as described by me. What an excellent tool. You don't NEED it of course, but it would be lovely to have it. So, in my case I spend many tens of hours deducing how it all works, gradually, even publishing my errors along the way and getting help wherever I can and then, safe in the knowledge that I understand it I made some posts backing everything up with evidence. You, on the other hand see a PHOTOGRAPH YOU CAN JUST MAKE OUT and then attempt to advise with the following: There are three points of adjustment in that arm WRONG That hole takes a bending tool, to bend the arm WRONG - It's the adjustment tool to allow you to hold the arm easier. and bend for intermediate. WRONG - You tell me I'm misadvising - this is the funniest thing I've read for a while! You'll find the special \"bending tool\" there as well. WRONG - No bending here mate. And my own, very special favourite Jaap is this: In a small way you are right, the bending is the setting that is rarely off in cameras that leave the factory and is the least likely to go out of adjustment So, there is no bending tool and yet you KNOW that this adjustment is rarely off, and is not likely to go out of adjustment. Just how on the Lord's earth can you know that, since this is an adjustment that you have made up in your own mind. Quite simply you have fabricated the whole bending thing because you've seen the adjustment tool that has now been correctly identified and you've decided to try and have the last word on it by making up the idea that bending your camera arm would affect your close focus. The only thing that trying to bend that arm would affect would be your warranty, mate, when it snaps straight off ! It's unbelievable Jaap. So if you really are: concerned about unsuspecting readers following your example, completely throwing their rangefinder out of whack and voiding their guaranty in the process. Then you'll obviously want to set the record straight and admit straight out that you've been talking unsubstantiated nonsense and that nobody, ever, should want to try and bend their camera. That in fact you've misunderstood and you understand now that there are only 2 adjustments - length of arm and eccentric roller cam position, and that you confess to making up the third adjustment solely to make yourself look dead clever. Adjusting the rangefinder is no more dangerous or difficult than adjusting a derailleur gear set on a bike - you either understand what the screws do or you don't - there is no middle ground. And the adjustment is self checking - it either works and is in focus on your photographs or it's not - Like the gears - they either change smoothly and have the right end points, and don't jump between gears or they don't. Saying that an unsuspecting owner could put 'everything' out of whack is only like messing up the screws on the gear set. You just tweak them back in once you understand it - no biggie. Or maybe you know of a secret bending tool that you use to do the gears on your bike as well eh? Honestly I don't mean to sound harsh but the scale of the nonsense here Jaap is absolutely incredible and you need to deal with it. Edited April 25, 2010 by Julian Thompson", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/5/?tab=comments#comment-1304813", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "this is beyond funny jaap, and just shows how you will push a -----> position !!!  rather than saying 'ah i see, sorry guys i was wrong' so it turns out that the service tool is used to lock into the hole in the arm and effect an adjustment of the arm length as described by me. what an excellent tool. you don't need it of course, but it would be lovely to have it. so, in my case i spend many tens of hours deducing how it all works, gradually, even publishing my errors along the way and getting help wherever i can and then, safe in the knowledge that i understand it i made some posts backing everything up with evidence. you, on the other hand see a photograph you can just make out and then attempt to advise with the following: there are three points of adjustment in that arm wrong that hole takes a bending tool, to bend the arm wrong - it's the adjustment tool to allow you to hold the arm easier. and bend for intermediate. wrong - you tell me i'm misadvising - this is the funniest thing i've read for a while! you'll find the special \"bending tool\" there as well. wrong - no bending here mate. and my own, very special favourite jaap is this: in a small way you are right, the bending is the setting that is rarely off in cameras that leave the factory and is the least likely to go out of adjustment so, there is no bending tool and yet you know that this adjustment is rarely off, and is not likely to go out of adjustment. just how on the lord's earth can you know that, since this is an adjustment that you have made up in your own mind. quite simply you have fabricated the whole bending thing because you've seen the adjustment tool that has now been correctly identified and you've decided to try and have the last word on it by making up the idea that bending your camera arm would affect your close focus. the only thing that trying to bend that arm would affect would be your warranty, mate, when it snaps straight off ! it's unbelievable jaap. so if you really are: concerned about unsuspecting readers following your example, completely throwing their rangefinder out of whack and voiding their guaranty in the process. then you'll obviously want to set the record straight and admit straight out that you've been talking unsubstantiated nonsense and that nobody, ever, should want to try and bend their camera. that in fact you've misunderstood and you understand now that there are only 2 adjustments - length of arm and eccentric roller cam position, and that you confess to making up the third adjustment solely to make yourself look dead clever. adjusting the rangefinder is no more dangerous or difficult than adjusting a derailleur gear set on a bike - you either understand what the screws do or you don't - there is no middle ground. and the adjustment is self checking - it either works and is in focus on your photographs or it's not - like the gears - they either change smoothly and have the right end points, and don't jump between gears or they don't. saying that an unsuspecting owner could put 'everything' out of whack is only like messing up the screws on the gear set. you just tweak them back in once you understand it - no biggie. or maybe you know of a secret bending tool that you use to do the gears on your bike as well eh? honestly i don't mean to sound harsh but the scale of the nonsense here jaap is absolutely incredible and you need to deal with it. edited april 25, 2010 by julian thompson", "sortedWord": "None", "identifyer": 30730, "year": "2010"}, {"Unnamed: 0": 369439, "autor": "giordano", "date": 1272208080000, "content": "WRONG - It's the adjustment tool to allow you to hold the arm easier.<snip>WRONG - No bending here mate. <snip> That in fact you've misunderstood and you understand now that there are only 2 adjustments - length of arm and eccentric roller cam position, and that you confess to making up the third adjustment solely to make yourself look dead clever. According to the only factory manual I have (easily found on the internet), the thing is a bending tool and its purpose is to adjust the rangefinder by bending the arm. All that Jaap got wrong is precisely what this adjustment is for. In order for all lenses to couple accurately with the rangefinder, the axis of the roller cam must be precisely parallel with the axis of the shaft at the other end of the arm. If it isn't, there are two possible sources of inaccuracy, though I don't know which is more important. One is that as the arm rotates, the angle the roller presents to the rangefinder cam on the lens will change; the other is that the coupling will be different depending on the vertical position at which each lens's rangefinder cam contacts the roller. If the roller is exactly parallel with the shaft at the other end, both those factors are irrelevant. The official use of the bending tool is in conjunction with a special 3-position gauge that mimics a lens focused at 10m distance whose cam contacts the roller at top, centre and bottom of the roller's width. If the rangefinder image remains stationary as the gauge is moved between its three positions, this adjustment is correct. If it moves, the bending tool must be used. Clearly this is (a) unlikely to go out of adjustment in normal use and (--img--  not something one can adjust without a special gauge, so it's outside the scope of DIY rangefinder adjustment. I have no idea whether or not the bending tool is also useful when adjusting the arm length and roller cam. My source is the official Repair Training Program manual for \"Camera Set, Still Picture KS-15(4)\", a US military version of the M2 with M4 rapid loading takeup spool. The arm on my M8 looks exactly the same as the one in the diagrams in this manual. FWIW there are a total of five adjustment points in this part of the rangefinder, although only the two Julian has explored are likely to be needed in ordinary DIY work.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/5/?tab=comments#comment-1305260", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "wrong - it's the adjustment tool to allow you to hold the arm easier.<snip>wrong - no bending here mate. <snip> that in fact you've misunderstood and you understand now that there are only 2 adjustments - length of arm and eccentric roller cam -----> position !!! , and that you confess to making up the third adjustment solely to make yourself look dead clever. according to the only factory manual i have (easily found on the internet), the thing is a bending tool and its purpose is to adjust the rangefinder by bending the arm. all that jaap got wrong is precisely what this adjustment is for. in order for all lenses to couple accurately with the rangefinder, the axis of the roller cam must be precisely parallel with the axis of the shaft at the other end of the arm. if it isn't, there are two possible sources of inaccuracy, though i don't know which is more important. one is that as the arm rotates, the angle the roller presents to the rangefinder cam on the lens will change; the other is that the coupling will be different depending on the vertical position at which each lens's rangefinder cam contacts the roller. if the roller is exactly parallel with the shaft at the other end, both those factors are irrelevant. the official use of the bending tool is in conjunction with a special 3-position gauge that mimics a lens focused at 10m distance whose cam contacts the roller at top, centre and bottom of the roller's width. if the rangefinder image remains stationary as the gauge is moved between its three positions, this adjustment is correct. if it moves, the bending tool must be used. clearly this is (a) unlikely to go out of adjustment in normal use and (--img--  not something one can adjust without a special gauge, so it's outside the scope of diy rangefinder adjustment. i have no idea whether or not the bending tool is also useful when adjusting the arm length and roller cam. my source is the official repair training program manual for \"camera set, still picture ks-15(4)\", a us military version of the m2 with m4 rapid loading takeup spool. the arm on my m8 looks exactly the same as the one in the diagrams in this manual. fwiw there are a total of five adjustment points in this part of the rangefinder, although only the two julian has explored are likely to be needed in ordinary diy work.", "sortedWord": "None", "identifyer": 30735, "year": "2010"}, {"Unnamed: 0": 369450, "autor": "Guest mc_k", "date": 1272304320000, "content": "...In order for all lenses to couple accurately with the rangefinder, the axis of the roller cam must be precisely parallel with the axis of the shaft at the other end of the arm. If it isn't, there are two possible sources of inaccuracy, though I don't know which is more important. One is that as the arm rotates, the angle the roller presents to the rangefinder cam on the lens will change; the other is that the coupling will be different depending on the vertical position at which each lens's rangefinder cam contacts the roller. If the roller is exactly parallel with the shaft at the other end, both those factors are irrelevant. ... glad to know this ... I bought a 90/2.8 (last version) and the roller would slip off half way to infinity, on a couple of cameras. I noticed the cam diameter is about 35mm; on most of my lenses it's about 31mm. I sent the lens back, but maybe should have had both cameras checked.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/6/?tab=comments#comment-1306423", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "...in order for all lenses to couple accurately with the rangefinder, the axis of the roller cam must be precisely parallel with the axis of the shaft at the other end of the arm. if it isn't, there are two possible sources of inaccuracy, though i don't know which is more important. one is that as the arm rotates, the angle the roller presents to the rangefinder cam on the lens will change; the other is that the coupling will be different depending on the vertical -----> position !!!  at which each lens's rangefinder cam contacts the roller. if the roller is exactly parallel with the shaft at the other end, both those factors are irrelevant. ... glad to know this ... i bought a 90/2.8 (last version) and the roller would slip off half way to infinity, on a couple of cameras. i noticed the cam diameter is about 35mm; on most of my lenses it's about 31mm. i sent the lens back, but maybe should have had both cameras checked.", "sortedWord": "None", "identifyer": 30747, "year": "2010"}, {"Unnamed: 0": 385638, "autor": "photolandscape", "date": 1274565180000, "content": "I want to replace my red dot with a black one. Got the dot from Don @ DAG Camera Repair. Had some difficulty getting the red dot off, finally was able to do it after applying a few seconds of hot air from a hair dryer on the red dot, then rotating the dot back and forth and finally it snapped the adhesive. Now for the next problem. As I began to install the black dot, I peeled off the backing on the adhesive, and as I tried to position the dot, it went on crooked. Anyone got a suggestion on how to get it off without destroying so I can reinstall it so it's straight? Thanks.", "link": "https://www.l-camera-forum.com/topic/58946-how-to-remove-red-dot/page/2/?tab=comments#comment-1331866", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i want to replace my red dot with a black one. got the dot from don @ dag camera repair. had some difficulty getting the red dot off, finally was able to do it after applying a few seconds of hot air from a hair dryer on the red dot, then rotating the dot back and forth and finally it snapped the adhesive. now for the next problem. as i began to install the black dot, i peeled off the backing on the adhesive, and as i tried to -----> position !!!  the dot, it went on crooked. anyone got a suggestion on how to get it off without destroying so i can reinstall it so it's straight? thanks.", "sortedWord": "None", "identifyer": 47043, "year": "2010"}, {"Unnamed: 0": 385640, "autor": "photolandscape", "date": 1274568420000, "content": "Wiggle with your thumb, then get two toothpicks, apply them to the Leica lettering and wiggle until it slides off. Thanks Jaap. I just found two solid wooden matchsticks, put on up against the Leica type pushing clockwise, and the other matchstick opposite it pushing counterclockwise. I pushed and it moved easily--I went about 30 degrees beyond the correct position, and watched the adhesive pull it back into perfect position. Looks good.", "link": "https://www.l-camera-forum.com/topic/58946-how-to-remove-red-dot/page/2/?tab=comments#comment-1331907", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "wiggle with your thumb, then get two toothpicks, apply them to the leica lettering and wiggle until it slides off. thanks jaap. i just found two solid wooden matchsticks, put on up against the leica type pushing clockwise, and the other matchstick opposite it pushing counterclockwise. i pushed and it moved easily--i went about 30 degrees beyond the correct -----> position !!! , and watched the adhesive pull it back into perfect -----> position !!! . looks good.", "sortedWord": "None", "identifyer": 47045, "year": "2010"}, {"Unnamed: 0": 450699, "autor": "grober", "date": 1269266400000, "content": "I too shoot 95% of my shots without any flash. In fact, I made very sure an X1 user could absolutely disable its tiny, whimpy flash for most shooting before I placed an order for this impish but fascinating camera. (One absolutely denies the flash's firing by simply not deploying it from its recessed, stored position.) When I did use flash, I routinely used it in a studio setting where I was able to deploy a radio trigger on my M6, M7 or M8 cameras with one or more remote flashes obediently answering the radio signal from the camera. I chose not to use an optical slave because when others are also flashing away (i. e. weddings) I could not guarantee the timing of my remote flashes. A radio trigger was THE answer for me. When I can carve out some time I plan to insert my trusty radio trigger on the X1, select \"studio\" on the camera's flash menu and take some test shots. If this doesn't work satisfactorily, I determine the correct exposure with my flash meter and manually set the ISO, shutter speed and f-stop on the camera. The variety or brand of available electronic flash is of little concern to me (in the studio): if I can force it to a full manual firing position and can have a custom cable made to connect my radio receiver to it, I'm good to go. BTW: I have sold all my other M-gear; the X1 is my only remaining Leica. Thanks for alerting me to the \"Metz possibility.\" I had not know about this particular Metz unit before I read your post. -g Edited March 22, 2010 by grober", "link": "https://www.l-camera-forum.com/topic/115672-which-external-flash-for-the-x1/?tab=comments#comment-1268964", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i too shoot 95% of my shots without any flash. in fact, i made very sure an x1 user could absolutely disable its tiny, whimpy flash for most shooting before i placed an order for this impish but fascinating camera. (one absolutely denies the flash's firing by simply not deploying it from its recessed, stored -----> position !!! .) when i did use flash, i routinely used it in a studio setting where i was able to deploy a radio trigger on my m6, m7 or m8 cameras with one or more remote flashes obediently answering the radio signal from the camera. i chose not to use an optical slave because when others are also flashing away (i. e. weddings) i could not guarantee the timing of my remote flashes. a radio trigger was the answer for me. when i can carve out some time i plan to insert my trusty radio trigger on the x1, select \"studio\" on the camera's flash menu and take some test shots. if this doesn't work satisfactorily, i determine the correct exposure with my flash meter and manually set the iso, shutter speed and f-stop on the camera. the variety or brand of available electronic flash is of little concern to me (in the studio): if i can force it to a full manual firing position and can have a custom cable made to connect my radio receiver to it, i'm good to go. btw: i have sold all my other m-gear; the x1 is my only remaining leica. thanks for alerting me to the \"metz possibility.\" i had not know about this particular metz unit before i read your post. -g edited march 22, 2010 by grober", "sortedWord": "None", "identifyer": 14192, "year": "2010"}], "name": "positionL-Forum2010"}