{"interestingcomments": [{"Unnamed: 0": 356043, "autor": "jaapv", "date": 1302194160000, "content": "Question: Sometimes the rangefinder patch seems to lose the \"overlay\" and I can't focus without it. I realize I need to be looking straight through the finder for best results, not at an angle, but even adjusting my eye position doesn't bring it back. Does this indicate the need for a camera adjustment, or some other type of \"operator adjustment?\" Answer: You're covering the rangefinder window on the front of the camera with your finger.", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/3/?tab=comments#comment-2464096", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "question: sometimes the rangefinder patch seems to lose the \"overlay\" and i can't focus without it. i realize i need to be looking straight through the finder for best results, not at an angle, but even adjusting my eye -----> position !!!  doesn't bring it back. does this indicate the need for a camera adjustment, or some other type of \"operator adjustment?\" answer: you're covering the rangefinder window on the front of the camera with your finger.", "sortedWord": "None", "identifyer": 17209, "year": "2011"}, {"Unnamed: 0": 369485, "autor": "luuca", "date": 1303416960000, "content": "Can you still turn the slotted adjustment washer (under the screw) where the 2 halves of the arm are joined? If so, then the screw is not fully seated even though you can't turn it. That would indicate the screw is binding in the threads. If the washer is secured and you can displace the cam follower wheel 0.5mm vertically, then what you are experiencing is normal play. If the washer is secure, and the arm is very loose and wiggly (2-3mm of play for example) then the rangefinder shaft (the one that runs up through the top and operates the rangefinder mechanism) might be loose or damaged. That can happen if, when one loosens or tightens the locking screw, one applies too much force vertically against the cam follower arm. In light of English not being your first language, I hope my technical explanation isn't more confusing than helpful, and I apologize if it is less than clear. All I can suggest further is that if you have the possibility, check another Leica M body (all of the rangefinder mechanics are the same in terms of the arm) and see if yours is indeed abnormal. Maybe it isn't, and you can rest easy. If you do determine you have a problem, then you know you need to have it looked at by a pro. SOLVED!! it seems the screw has only one starting point to properly tighten the pivot. I probably loosen too much the first time and then I missed the exact position to begin to turn the screw. now everything is firm! many thanks to all of you!", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/7/?tab=comments#comment-1652286", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "can you still turn the slotted adjustment washer (under the screw) where the 2 halves of the arm are joined? if so, then the screw is not fully seated even though you can't turn it. that would indicate the screw is binding in the threads. if the washer is secured and you can displace the cam follower wheel 0.5mm vertically, then what you are experiencing is normal play. if the washer is secure, and the arm is very loose and wiggly (2-3mm of play for example) then the rangefinder shaft (the one that runs up through the top and operates the rangefinder mechanism) might be loose or damaged. that can happen if, when one loosens or tightens the locking screw, one applies too much force vertically against the cam follower arm. in light of english not being your first language, i hope my technical explanation isn't more confusing than helpful, and i apologize if it is less than clear. all i can suggest further is that if you have the possibility, check another leica m body (all of the rangefinder mechanics are the same in terms of the arm) and see if yours is indeed abnormal. maybe it isn't, and you can rest easy. if you do determine you have a problem, then you know you need to have it looked at by a pro. solved!! it seems the screw has only one starting point to properly tighten the pivot. i probably loosen too much the first time and then i missed the exact -----> position !!!  to begin to turn the screw. now everything is firm! many thanks to all of you!", "sortedWord": "None", "identifyer": 30782, "year": "2011"}, {"Unnamed: 0": 369491, "autor": "Lindolfi", "date": 1313353860000, "content": "I wish they had a marking on the top of the camera (similar to what Fuji do on the X100) that marks where the sensor plane is. Much easier to measure the distance than to refocus repeatedly. You can make the mark yourself: the flange-focal distance of the Leica M is 27.8 mm. Measure from the flange (the mount ring on the body for the lens) backward: Place a straight piece of steel over the flange pointing up and measure a distance of 27.8 mm with callipers to over the top plate. Put a small piece of white tape on the top plate to mark the position. Edited August 14, 2011 by Lindolfi", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/8/?tab=comments#comment-1765562", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i wish they had a marking on the top of the camera (similar to what fuji do on the x100) that marks where the sensor plane is. much easier to measure the distance than to refocus repeatedly. you can make the mark yourself: the flange-focal distance of the leica m is 27.8 mm. measure from the flange (the mount ring on the body for the lens) backward: place a straight piece of steel over the flange pointing up and measure a distance of 27.8 mm with callipers to over the top plate. put a small piece of white tape on the top plate to mark the -----> position !!! . edited august 14, 2011 by lindolfi", "sortedWord": "None", "identifyer": 30788, "year": "2011"}, {"Unnamed: 0": 377781, "autor": "Jamie Roberts", "date": 1294114380000, "content": "{snipped} The settings I am changing are... (starting with TT1 and TT5 in default config) C1 v's C2 - both TT1 and TT5 both set to same channel (C1=1, C2=2) - either should work. Modeling light control - on v's off - I don't think this should matter, but who knows? Speedlight Flash Control - Normal v's Trigger only High Speed Flash - checked v's unchecked Basic Trigger v's TTL mode {snipped} Hi Geoff, First, make sure both units are set to standard channel TX1 / RX1 (or whatever you like) in the C1 or C2 position. You can't use the TTL channels with good results, IIRC. Next, turn \"high speed flash\" off. Once that's done, turn on the TT1 and the TT5 to the same channel. You should be able to trigger the TT5 with the TT5 by using the \"test\" button. Once you have the flash actually firing from the TT1, then attach it to the M9 and follow the sequence above. Good luck!", "link": "https://www.l-camera-forum.com/topic/139289-pocket-wizard-tt1-and-tt5-on-m9/?tab=comments#comment-1547441", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "{snipped} the settings i am changing are... (starting with tt1 and tt5 in default config) c1 v's c2 - both tt1 and tt5 both set to same channel (c1=1, c2=2) - either should work. modeling light control - on v's off - i don't think this should matter, but who knows? speedlight flash control - normal v's trigger only high speed flash - checked v's unchecked basic trigger v's ttl mode {snipped} hi geoff, first, make sure both units are set to standard channel tx1 / rx1 (or whatever you like) in the c1 or c2 -----> position !!! . you can't use the ttl channels with good results, iirc. next, turn \"high speed flash\" off. once that's done, turn on the tt1 and the tt5 to the same channel. you should be able to trigger the tt5 with the tt5 by using the \"test\" button. once you have the flash actually firing from the tt1, then attach it to the m9 and follow the sequence above. good luck!", "sortedWord": "None", "identifyer": 39094, "year": "2011"}, {"Unnamed: 0": 380816, "autor": "roydonian", "date": 1317132840000, "content": "Hi, just bought a new Summicron 50 mm (latest version, built in hood) however when i try and mount it on my M8.2 it will not \"click\" when i mount it. It is as if the locking groove on the lens is too thin for the springed \"lock\" on the M8. Has anyone else had a similar problem? I have this problem on my M8.2. It looks like the company may have had a batch of springed locking catches that were a bit too wide. My experience has been that if the locking catch does not spring into place, the lens will not produce sharp imagery. I can't understand why this is - the bayonet lugs are engaged, so the lens is snugly on the mount, and whether or not the catch engages has no effect on the lens' rotational position, so the rangefinder cam should be operating correctly. Last year I bought a 90mm f2.8 Elmarit, and the dealer had several in stock. Two would not latch properly, and produced poor imagery; the third did and produced fine images. Earlier, I'd found that a newly-purchased 35mm Summilux did not 'click' into place on the camera, and the image quality was dire. But when I tried it again at the weekend, the latch engaged correctly (albeit without an audible click), and the images were first-class. I can only suppose that a slightly over-sized catch has worn down slightly in use. I thought Leica stuff was \"exact\". An old Leica employee who dated back to the Leitz era once told me that \"They don't make them with the precision that they used to\". Many Leica enthusiasts will disagree with that statement, however. Best regards, Doug", "link": "https://www.l-camera-forum.com/topic/162552-help-summicron-50mm-will-not-mount-on-m8/?tab=comments#comment-1803883", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi, just bought a new summicron 50 mm (latest version, built in hood) however when i try and mount it on my m8.2 it will not \"click\" when i mount it. it is as if the locking groove on the lens is too thin for the springed \"lock\" on the m8. has anyone else had a similar problem? i have this problem on my m8.2. it looks like the company may have had a batch of springed locking catches that were a bit too wide. my experience has been that if the locking catch does not spring into place, the lens will not produce sharp imagery. i can't understand why this is - the bayonet lugs are engaged, so the lens is snugly on the mount, and whether or not the catch engages has no effect on the lens' rotational -----> position !!! , so the rangefinder cam should be operating correctly. last year i bought a 90mm f2.8 elmarit, and the dealer had several in stock. two would not latch properly, and produced poor imagery; the third did and produced fine images. earlier, i'd found that a newly-purchased 35mm summilux did not 'click' into place on the camera, and the image quality was dire. but when i tried it again at the weekend, the latch engaged correctly (albeit without an audible click), and the images were first-class. i can only suppose that a slightly over-sized catch has worn down slightly in use. i thought leica stuff was \"exact\". an old leica employee who dated back to the leitz era once told me that \"they don't make them with the precision that they used to\". many leica enthusiasts will disagree with that statement, however. best regards, doug", "sortedWord": "None", "identifyer": 42205, "year": "2011"}, {"Unnamed: 0": 385673, "autor": "cidereye", "date": 1324634820000, "content": "Ken Rockwell ceased to be a reference for me when he changes his mind like the wind in the desert. An example was near \"volatile\" opinions is about the camera X100. Ni case. Enjoy your M8 --img--  Not to mention all the hate he dished up towards the Fuji X10 before it was even launched, now he has one he loves it! --img--  Ken does write some really informative reviews though and his Nikon & Leica M mount lens reviews are mostly all worth a good read when considering a new purchase but to my knowledge he has never even tried out an M8 so he is not exactly in the best position to criticise it is he?", "link": "https://www.l-camera-forum.com/topic/168978-did-ken-rockwell-a-m8-hater/?tab=comments#comment-1878557", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "ken rockwell ceased to be a reference for me when he changes his mind like the wind in the desert. an example was near \"volatile\" opinions is about the camera x100. ni case. enjoy your m8 --img--  not to mention all the hate he dished up towards the fuji x10 before it was even launched, now he has one he loves it! --img--  ken does write some really informative reviews though and his nikon & leica m mount lens reviews are mostly all worth a good read when considering a new purchase but to my knowledge he has never even tried out an m8 so he is not exactly in the best -----> position !!!  to criticise it is he?", "sortedWord": "None", "identifyer": 47078, "year": "2011"}, {"Unnamed: 0": 446399, "autor": "ezc203", "date": 1293969720000, "content": "hi,here are some of my fav. x1 picts:) Lambda - Some lovely photos you have posted here. The one with the flying pigeon is my favorite. Great timing and composition. The critical position of the pigeon really takes the picture to the next level. Love it. Pete - Look forward to seeing your pictures!", "link": "https://www.l-camera-forum.com/topic/127054-leica-x1-photos/page/14/?tab=comments#comment-1545887", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi,here are some of my fav. x1 picts:) lambda - some lovely photos you have posted here. the one with the flying pigeon is my favorite. great timing and composition. the critical -----> position !!!  of the pigeon really takes the picture to the next level. love it. pete - look forward to seeing your pictures!", "sortedWord": "None", "identifyer": 9840, "year": "2011"}, {"Unnamed: 0": 446944, "autor": "ChiILX1", "date": 1302406560000, "content": " Like most Leica X1 owners, I was excited for the firmware update released on March 29th mainly for the predicted autofocus improvements. However, 2.0 brought other features less discussed. I glossed over three of these features when I first read the improvement list, namely the depth of field indicator, the manual focus position-save, and the one minute auto power-down. But after playing with these together, my experience and utilization of the X1 has completely transformed. I'm posting this to share how, and why these three features combine to turn the X1 into the perfect street photography tool. I live in Chicago's loop. I ride my bicycle every day to the bus or the train station to get to Hyde Park's university campus. On nice days I go along the lakefront the whole way on my bicycle. In any one of those situations, it's a street photographer's dream, and I always have my X1 out and ready to go. With the new depth of field indicator, X1 users can see the in-focus area of a picture they would take based on the current aperture set on the top dial. The APS-C sensor has a significantly wider DOF (depth of field) than a full-frame camera. In fact, at F16, DOF is from 4 feet to infinity. This is amazingly versatile since that range covers 99% of street photography situations. Even in the close quarters of the bus or train 4 feet is an easy distance to either create or just find yourself having for the photo. Sure the camera had the same depth of field present before. But without the indicator, the only way of knowing it's limits would have been to do a series of tests. Think about this for a moment- a small sensor compact couldn't have produced most of the bokehlicious photos the X1 can produce, have the same low light capability, or render shallow depth of field when wanted for subject isolation, all positive characteristics of a larger sensor. But with a larger sensor than the X1, such as the M9, it's much harder to have such a deep DOF at 35mm angle of view- you'd have to have f stop 32 on your lens. In other words, the X1 has fantastic depth of field versatility. The 1 minute auto power off allows me to have my X1 around my shoulder in the continuous shot mode, but powered off to save battery. This means that a simple press of the shutter turns it on, much quicker than turning the lever, and also there is no chance of accidentally putting it in self-timer mode (when you are in great haste to capture a shot you see) or having to look down at the switch to ensure you put it in the right mode. Also, with the MF position saving, the lens is now focused at the same position when you turn on the camera too. So it's always in that 4ft to infinity focus range. Things we are all familiar with, such as the top dial for aperture, make this simply awesome. On even a cloudy day, with auto ISO and shutter speed, I can confidently put my X1 on F16 with a simple turn of the dial and have instant photo capability. It has renewed my love for the significant changes you can quickly make on the X1 with all the simplistic controls. Forget AF speed! We now have IMMEDIATE / INTERMINABLE focus for street photography. With your camera auto-powered down, press the shutter, and with a second press you have an instantaneous in-focus photo. The only thing that could make it quicker is if in 2.01 (;-) they remove the useless \"auto power off cancel\" message, which has you wait a second to capture. But I've found that if I press the shutter when I grab the camera from my hip (to turn it on) the message is gone by the time I have framed the shot in my viewfinder and press the shutter to take the shot- especially from the hip. Being in a big city almost all the time, I can't stress enough how perfect this camera is now for street photography. The combination of the simplistic controls, unsurpassed IQ, portability / stowability, DOF versatility, MF position save, and 1 minute power save (among other things) make this camera one of the best heavyweight street shooters in a small package. Thank you Leica for an excellent firmware update. Here are some shots I've been able to capture with the combination of these features. I'll post other good ones when I take them in the exact situation I describe (quick composition aided by the combination of these three features). All of these I took while I was in a hurry to class on my bike, saw the scene and even though I was running late, managed to take something I really like. --img-- --img-- --img-- --img--  Edited April 10, 2011 by ChiILX1", "link": "https://www.l-camera-forum.com/topic/148703-the-x1-now-an-amazing-street-photography-machine/?tab=comments#comment-1641219", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " like most leica x1 owners, i was excited for the firmware update released on march 29th mainly for the predicted autofocus improvements. however, 2.0 brought other features less discussed. i glossed over three of these features when i first read the improvement list, namely the depth of field indicator, the manual focus -----> position !!! -save, and the one minute auto power-down. but after playing with these together, my experience and utilization of the x1 has completely transformed. i'm posting this to share how, and why these three features combine to turn the x1 into the perfect street photography tool. i live in chicago's loop. i ride my bicycle every day to the bus or the train station to get to hyde park's university campus. on nice days i go along the lakefront the whole way on my bicycle. in any one of those situations, it's a street photographer's dream, and i always have my x1 out and ready to go. with the new depth of field indicator, x1 users can see the in-focus area of a picture they would take based on the current aperture set on the top dial. the aps-c sensor has a significantly wider dof (depth of field) than a full-frame camera. in fact, at f16, dof is from 4 feet to infinity. this is amazingly versatile since that range covers 99% of street photography situations. even in the close quarters of the bus or train 4 feet is an easy distance to either create or just find yourself having for the photo. sure the camera had the same depth of field present before. but without the indicator, the only way of knowing it's limits would have been to do a series of tests. think about this for a moment- a small sensor compact couldn't have produced most of the bokehlicious photos the x1 can produce, have the same low light capability, or render shallow depth of field when wanted for subject isolation, all positive characteristics of a larger sensor. but with a larger sensor than the x1, such as the m9, it's much harder to have such a deep dof at 35mm angle of view- you'd have to have f stop 32 on your lens. in other words, the x1 has fantastic depth of field versatility. the 1 minute auto power off allows me to have my x1 around my shoulder in the continuous shot mode, but powered off to save battery. this means that a simple press of the shutter turns it on, much quicker than turning the lever, and also there is no chance of accidentally putting it in self-timer mode (when you are in great haste to capture a shot you see) or having to look down at the switch to ensure you put it in the right mode. also, with the mf position saving, the lens is now focused at the same position when you turn on the camera too. so it's always in that 4ft to infinity focus range. things we are all familiar with, such as the top dial for aperture, make this simply awesome. on even a cloudy day, with auto iso and shutter speed, i can confidently put my x1 on f16 with a simple turn of the dial and have instant photo capability. it has renewed my love for the significant changes you can quickly make on the x1 with all the simplistic controls. forget af speed! we now have immediate / interminable focus for street photography. with your camera auto-powered down, press the shutter, and with a second press you have an instantaneous in-focus photo. the only thing that could make it quicker is if in 2.01 (;-) they remove the useless \"auto power off cancel\" message, which has you wait a second to capture. but i've found that if i press the shutter when i grab the camera from my hip (to turn it on) the message is gone by the time i have framed the shot in my viewfinder and press the shutter to take the shot- especially from the hip. being in a big city almost all the time, i can't stress enough how perfect this camera is now for street photography. the combination of the simplistic controls, unsurpassed iq, portability / stowability, dof versatility, mf position save, and 1 minute power save (among other things) make this camera one of the best heavyweight street shooters in a small package. thank you leica for an excellent firmware update. here are some shots i've been able to capture with the combination of these features. i'll post other good ones when i take them in the exact situation i describe (quick composition aided by the combination of these three features). all of these i took while i was in a hurry to class on my bike, saw the scene and even though i was running late, managed to take something i really like. --img-- --img-- --img-- --img--  edited april 10, 2011 by chiilx1", "sortedWord": "None", "identifyer": 10413, "year": "2011"}, {"Unnamed: 0": 448169, "autor": "wda", "date": 1315911120000, "content": " I got a chance to try the Leica X1 viewfinder recently in New York and compare it to the Voigtlander one I own: I was very disappointed in the Leica viewfinder....., and functionally the bright lines are dimmer and less consistent and uniform. When I say less consistent and uniform I mean that the left side of the frame lines could be bright, and the right side could completely disappear. ...... I think this perception has much to do with where you position your eye relative to the eyepiece. This variation can happen with many suspended reflected frames.", "link": "https://www.l-camera-forum.com/topic/112325-voigtlander-or-leica-viewfinder/page/8/?tab=comments#comment-1791998", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " i got a chance to try the leica x1 viewfinder recently in new york and compare it to the voigtlander one i own: i was very disappointed in the leica viewfinder....., and functionally the bright lines are dimmer and less consistent and uniform. when i say less consistent and uniform i mean that the left side of the frame lines could be bright, and the right side could completely disappear. ...... i think this perception has much to do with where you -----> position !!!  your eye relative to the eyepiece. this variation can happen with many suspended reflected frames.", "sortedWord": "None", "identifyer": 11653, "year": "2011"}], "name": "positionL-Forum2011"}