{"interestingcomments": [{"Unnamed: 0": 351282, "autor": "setuporg", "date": 1544335080000, "content": "Having shot a thousand and a half shots with the M60 and 6 lenses, I now find myself in a paradoxical position where it's hard to justify getting the M10-D when having an M-D/M60 and the M10, as I do. The M60 or M-D satisfies all the true screen-less urges, while the M10 has all the newer features. The M10-D impedes some of them, such as using non-coded lenses and changing setting just becomes torturous as the wifi takes 30 seconds to come up. So it would make sense to get if you have no screen-less Leicas, but if you do, use those for screen-less shooting, truly so, and use the M10 for low-ISO, non-coded lenses, etc. Really, @a.noctilux, I'm afraid there's no reason to have an M-D, M10 (or M10-P), and the M10-D, except for relegating the M-D to the collectible/nostalgic shelf whence you walk it from once a year or so. This is what my Fuji X-Pro2/X100F and Pentax K-3II/ K-1 are doing right now, waiting for a rare walk/niche use (moving targets, once small RAW-shooting single-lens camera travel, etc.). With the M60 I could justify the rarity for non-use and get the M10-D but I just feel M60 is so much true fun I'll have to cancel my BH Photo order for the M10-D placed just before I'd stumbled upon the M60. Sure shots come out blurry or a bit overexposed once in a while just like film used to do years ago and it's totally fun part of the experience. Even the noise at ISO 3200 or higher is a part of the experience, like the film grain. It's hard to imagine having that or M-D and the M10 ever needing the M10-D. Perhaps indeed the most reasonable strategy is waiting for the replacement for M10 itself, and then for its -D, such as the M11-D. Edited December 9, 2018 by setuporg", "link": "https://www.l-camera-forum.com/topic/290828-long-live-the-m-d/page/2/?tab=comments#comment-3644196", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "having shot a thousand and a half shots with the m60 and 6 lenses, i now find myself in a paradoxical -----> position !!!  where it's hard to justify getting the m10-d when having an m-d/m60 and the m10, as i do. the m60 or m-d satisfies all the true screen-less urges, while the m10 has all the newer features. the m10-d impedes some of them, such as using non-coded lenses and changing setting just becomes torturous as the wifi takes 30 seconds to come up. so it would make sense to get if you have no screen-less leicas, but if you do, use those for screen-less shooting, truly so, and use the m10 for low-iso, non-coded lenses, etc. really, @a.noctilux, i'm afraid there's no reason to have an m-d, m10 (or m10-p), and the m10-d, except for relegating the m-d to the collectible/nostalgic shelf whence you walk it from once a year or so. this is what my fuji x-pro2/x100f and pentax k-3ii/ k-1 are doing right now, waiting for a rare walk/niche use (moving targets, once small raw-shooting single-lens camera travel, etc.). with the m60 i could justify the rarity for non-use and get the m10-d but i just feel m60 is so much true fun i'll have to cancel my bh photo order for the m10-d placed just before i'd stumbled upon the m60. sure shots come out blurry or a bit overexposed once in a while just like film used to do years ago and it's totally fun part of the experience. even the noise at iso 3200 or higher is a part of the experience, like the film grain. it's hard to imagine having that or m-d and the m10 ever needing the m10-d. perhaps indeed the most reasonable strategy is waiting for the replacement for m10 itself, and then for its -d, such as the m11-d. edited december 9, 2018 by setuporg", "sortedWord": "None", "identifyer": 12421, "year": "2018"}, {"Unnamed: 0": 353446, "autor": "a.noctilux", "date": 1520337000000, "content": "Hello James. Welcome here. M-D (type 262) is usable as modern digital M as other M. It has all (almost minus LCD screen ! ) other digital M features (no LV of course). In the viewfinder when ON, the battery remain in percent shows up then the meter LED, shutter speed or arrow/dot (depend on shutter speed position), as on other digital M, etc. You can download instruction manual here: http://us.leica-camera.com/Service-Support/Support/Downloads?category=&subcategory=131376&type=93705&language=all", "link": "https://www.l-camera-forum.com/topic/262069-i-love-my-m-d-262/page/4/?tab=comments#comment-3475044", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hello james. welcome here. m-d (type 262) is usable as modern digital m as other m. it has all (almost minus lcd screen ! ) other digital m features (no lv of course). in the viewfinder when on, the battery remain in percent shows up then the meter led, shutter speed or arrow/dot (depend on shutter speed -----> position !!! ), as on other digital m, etc. you can download instruction manual here: http://us.leica-camera.com/service-support/support/downloads?category=&subcategory=131376&type=93705&language=all", "sortedWord": "None", "identifyer": 14597, "year": "2018"}, {"Unnamed: 0": 353657, "autor": "jaapv", "date": 1545180060000, "content": "And should astigmatism be troublesome for focusing portrait position, there is Walter Leica. http://walterleica.com He is able to calculate from a prescription, BTW. No connection, just a tip.", "link": "https://www.l-camera-forum.com/topic/258125-leica-dioptre/page/7/?tab=comments#comment-3649643", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "and should astigmatism be troublesome for focusing portrait -----> position !!! , there is walter leica. http://walterleica.com he is able to calculate from a prescription, btw. no connection, just a tip.", "sortedWord": "None", "identifyer": 14810, "year": "2018"}, {"Unnamed: 0": 363673, "autor": "yizhilelexia", "date": 1526318460000, "content": " My m262 had the same problem, it randomly started the self timer when it's set to S mode. I sent it to the service center. They tested it but nothing weird happened, so instead of replacing the switch button they just cleaned it and sent it back to me. But the self timer issue still exist sometimes. I dicided to take off the top cover and deal with it myself. Here is what i found and how i fix it. Take the switch button off, you will find there are two blades as marked in red circles in picture 1. When the gear of the switch pushed both of them in, then the camera while be in single shot mode, see attached image 2. Only blade 2 is pushed in, then the camera while be in C mode, see attached image 3. Only blade 1 is pushed in, then the camera while be in self timer mode, see attached image 4. The gear is too thin, sometimes when the swicth was in S position, it can't reach and push the second blade in, see attached image 5. Then instead of single shot mode, the camera was in self timer mode. So it's pretty easy to fixt it. You can put something under the gear (0.5mm thick would be fine) to make it a little thicker, or in my case i just bend the gear a little to make the right of it raise a little bit. Now my camera works perfectly. Hope my experience helps. --img-- --img-- --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/274900-am-i-a-idiot-self-timer-issue/?tab=comments#comment-3518629", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " my m262 had the same problem, it randomly started the self timer when it's set to s mode. i sent it to the service center. they tested it but nothing weird happened, so instead of replacing the switch button they just cleaned it and sent it back to me. but the self timer issue still exist sometimes. i dicided to take off the top cover and deal with it myself. here is what i found and how i fix it. take the switch button off, you will find there are two blades as marked in red circles in picture 1. when the gear of the switch pushed both of them in, then the camera while be in single shot mode, see attached image 2. only blade 2 is pushed in, then the camera while be in c mode, see attached image 3. only blade 1 is pushed in, then the camera while be in self timer mode, see attached image 4. the gear is too thin, sometimes when the swicth was in s -----> position !!! , it can't reach and push the second blade in, see attached image 5. then instead of single shot mode, the camera was in self timer mode. so it's pretty easy to fixt it. you can put something under the gear (0.5mm thick would be fine) to make it a little thicker, or in my case i just bend the gear a little to make the right of it raise a little bit. now my camera works perfectly. hope my experience helps. --img-- --img-- --img-- --img-- --img-- ", "sortedWord": "None", "identifyer": 24926, "year": "2018"}, {"Unnamed: 0": 365194, "autor": "Michael Geschlecht", "date": 1541612040000, "content": "Hello Dennis, The Linhof is not better or worse than the Leitz/Leica. It is simply heavier. If you cannot make up your mind about whether to have a 25/10 or a 50/20: Why not get 1 of each. The 50/20 is sometimes easier to work with when you are using a camera/tripod in a more or less fixed position. Like inside in a formal or informal studio where you might set up your camera/lens & your subject & then stand next to the camera while taking a picture. Like in portrait photography. While a 25/10 is sometimes more convenient when a person is out & about. I also use a Kodak #1 which is a 5 cm/2 in cable release that is a combination of \"B\" (Shutter stays open as long as you push the plunger in.) & \"T\" (Shutter opens on 1st push. Shutter closes on 2nd push.). Best Regards, Michael Edited November 7, 2018 by Michael Geschlecht", "link": "https://www.l-camera-forum.com/topic/291241-best-cable-release/?tab=comments#comment-3627283", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hello dennis, the linhof is not better or worse than the leitz/leica. it is simply heavier. if you cannot make up your mind about whether to have a 25/10 or a 50/20: why not get 1 of each. the 50/20 is sometimes easier to work with when you are using a camera/tripod in a more or less fixed -----> position !!! . like inside in a formal or informal studio where you might set up your camera/lens & your subject & then stand next to the camera while taking a picture. like in portrait photography. while a 25/10 is sometimes more convenient when a person is out & about. i also use a kodak #1 which is a 5 cm/2 in cable release that is a combination of \"b\" (shutter stays open as long as you push the plunger in.) & \"t\" (shutter opens on 1st push. shutter closes on 2nd push.). best regards, michael edited november 7, 2018 by michael geschlecht", "sortedWord": "None", "identifyer": 26455, "year": "2018"}, {"Unnamed: 0": 365195, "autor": "kuad82001", "date": 1541634660000, "content": " 6 hours ago, Michael Geschlecht said: Hello Dennis, The Linhof is not better or worse than the Leitz/Leica. It is simply heavier. If you cannot make up your mind about whether to have a 25/10 or a 50/20: Why not get 1 of each. The 50/20 is sometimes easier to work with when you are using a camera/tripod in a more or less fixed position. Like inside in a formal or informal studio where you might set up your camera/lens & your subject & then stand next to the camera while taking a picture. Like in portrait photography. While a 25/10 is sometimes more convenient when a person is out & about. I also use a Kodak #1 which is a 5 cm/2 in cable release that is a combination of \"B\" (Shutter stays open as long as you push the plunger in.) & \"T\" (Shutter opens on 1st push. Shutter closes on 2nd push.). Best Regards, Michael Thank you I use when I am doing night photography", "link": "https://www.l-camera-forum.com/topic/291241-best-cable-release/?tab=comments#comment-3627441", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " 6 hours ago, michael geschlecht said: hello dennis, the linhof is not better or worse than the leitz/leica. it is simply heavier. if you cannot make up your mind about whether to have a 25/10 or a 50/20: why not get 1 of each. the 50/20 is sometimes easier to work with when you are using a camera/tripod in a more or less fixed -----> position !!! . like inside in a formal or informal studio where you might set up your camera/lens & your subject & then stand next to the camera while taking a picture. like in portrait photography. while a 25/10 is sometimes more convenient when a person is out & about. i also use a kodak #1 which is a 5 cm/2 in cable release that is a combination of \"b\" (shutter stays open as long as you push the plunger in.) & \"t\" (shutter opens on 1st push. shutter closes on 2nd push.). best regards, michael thank you i use when i am doing night photography", "sortedWord": "None", "identifyer": 26456, "year": "2018"}, {"Unnamed: 0": 366275, "autor": "DirkR440", "date": 1519642140000, "content": "a picture that I took yesterday in Ho Chi Minh City. I arrived a bit late at my position, so it was already getting dark. But with the 6 stop ND filter on the Tri-Elmar I still managed to get one picture: --img-- Ho Chi Minh City by Dirk Raffel, auf Flickr", "link": "https://www.l-camera-forum.com/topic/281818-long-exposures-with-the-mm1-60-240-sec/page/2/?tab=comments#comment-3469153", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "a picture that i took yesterday in ho chi minh city. i arrived a bit late at my -----> position !!! , so it was already getting dark. but with the 6 stop nd filter on the tri-elmar i still managed to get one picture: --img-- ho chi minh city by dirk raffel, auf flickr", "sortedWord": "None", "identifyer": 27540, "year": "2018"}, {"Unnamed: 0": 367786, "autor": "Belle123", "date": 1540737900000, "content": "The lever thing. My opinion is it is a plus. Just consider, the position of the lever and where the shutter button and timing dial was designed on all prior 35mm film cameras. Was all about ergonomics around film use. Now, here comes digital, and they got rid of part of that equation and we end up with a slippery camera design! Really, they could come up with a totally different kind of body for digital that would give us a more natural grip. But, they stick with the film type of body design. Oh well.", "link": "https://www.l-camera-forum.com/topic/290822-m-10-d-monochrome-please/page/2/?tab=comments#comment-3621259", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the lever thing. my opinion is it is a plus. just consider, the -----> position !!!  of the lever and where the shutter button and timing dial was designed on all prior 35mm film cameras. was all about ergonomics around film use. now, here comes digital, and they got rid of part of that equation and we end up with a slippery camera design! really, they could come up with a totally different kind of body for digital that would give us a more natural grip. but, they stick with the film type of body design. oh well.", "sortedWord": "None", "identifyer": 29060, "year": "2018"}, {"Unnamed: 0": 374657, "autor": "Rus", "date": 1516050780000, "content": " I've been in the same position, and have opted to keep the M9 and be happy with it. My reasons being: If a camera was deemed more than good enough, even excellent, for \"professional\" use in the past, then chances are it is still good enough, even excellent, for even the most \"professional\" of all photographers now, unless the essence of photography itself has changed so drastically that only the latest and most technically advanced camera will satisfy its needs, which (I'm glad) is not the case. What have really been changing all the time along the advances in technology are simply the habits and skill sets of photographers. But these are often more flexible than people are willing to admit. It is far more rewarding to develop and use one's skills to make the most out of any given camera than to expect a camera to make up for whatever skill that one is yet to acquire. Edited January 15, 2018 by Rus", "link": "https://www.l-camera-forum.com/topic/280886-upgrading-from-the-m9/?tab=comments#comment-3440912", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " i've been in the same -----> position !!! , and have opted to keep the m9 and be happy with it. my reasons being: if a camera was deemed more than good enough, even excellent, for \"professional\" use in the past, then chances are it is still good enough, even excellent, for even the most \"professional\" of all photographers now, unless the essence of photography itself has changed so drastically that only the latest and most technically advanced camera will satisfy its needs, which (i'm glad) is not the case. what have really been changing all the time along the advances in technology are simply the habits and skill sets of photographers. but these are often more flexible than people are willing to admit. it is far more rewarding to develop and use one's skills to make the most out of any given camera than to expect a camera to make up for whatever skill that one is yet to acquire. edited january 15, 2018 by rus", "sortedWord": "None", "identifyer": 35963, "year": "2018"}, {"Unnamed: 0": 374777, "autor": "silverchrome", "date": 1542205800000, "content": "21 hours ago, lomo2me said: Thanks for the feedback. I’m within a timeframe to get the M8 back and return the q without penalty. I’m thinking I’ll stick with the 8 for now and do some more research. With that being said I’d be looking for some feedback on whether to go with the 9 to retain the feeling of the ccd sensor or 245 for more modern. I have an M9 and an M240, (actually, I have an M8.2 as well) and I like them both but, currently, I enjoy the M9 more. The images from the M9 seem sharper than the M240 and the camera itself is smaller, lighter and just feels more basic in its operation than the M240: the M9 feels more like a film M. The M240 is much more refined and even looks modern when compared to the M9 so it reminds me of a modern mirrorless camera. However, the M240's higher ISO ability and better reliability means I usually take the M240 with me when I travel. If I were in your position, I'd probably go with the M240. It's a newer, more reliable, more versatile, has better battery life and is also cheaper than the M9.", "link": "https://www.l-camera-forum.com/topic/291411-m9-or-q/?tab=comments#comment-3631021", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "21 hours ago, lomo2me said: thanks for the feedback. i’m within a timeframe to get the m8 back and return the q without penalty. i’m thinking i’ll stick with the 8 for now and do some more research. with that being said i’d be looking for some feedback on whether to go with the 9 to retain the feeling of the ccd sensor or 245 for more modern. i have an m9 and an m240, (actually, i have an m8.2 as well) and i like them both but, currently, i enjoy the m9 more. the images from the m9 seem sharper than the m240 and the camera itself is smaller, lighter and just feels more basic in its operation than the m240: the m9 feels more like a film m. the m240 is much more refined and even looks modern when compared to the m9 so it reminds me of a modern mirrorless camera. however, the m240's higher iso ability and better reliability means i usually take the m240 with me when i travel. if i were in your -----> position !!! , i'd probably go with the m240. it's a newer, more reliable, more versatile, has better battery life and is also cheaper than the m9.", "sortedWord": "None", "identifyer": 36083, "year": "2018"}, {"Unnamed: 0": 375785, "autor": "stray cat", "date": 1528278960000, "content": " Option 27, pay for the repair as a gift to your sister and brother-in-law. If you're playing with Leica, you likely can afford to spend $1K on your family, just this one time. Eric Thanks Eric, that would be a nice thing to do but I am not in a position to do that either. If I spend $1k on my family, there are many, many things that will come before cameras. I heard back from Leica. They said that \"unless sensor corrosion was verified by Leica or one of its subsidiaries by August 31st 2017, the repair is chargeable\" - this directive to Customer Care worldwide was to be applied \"without exception\". Their \"customer friendly solution\" is \"only charging a part of the material cost of the new image sensor (825 Euros + VAT)\". Otherwise there is a table of \"upgrade\" options to other cameras. I forgot to mention here, though I did mention in my email to Leica, that my brother-in-law Tim's M9-P was the second Leica he'd bought brand new, and the first, an M8, had problems of its own - so he actually acquired the M9-P by a similar upgrade due to his first Leica being a lemon (at my recommendation). So his experience with Leica has been very poor indeed. I've passed their response on to Tim and await his response. Thank you all for your kindness in responding to my request for advice. Unfortunately, it would seem that Leica is not as generous or compassionate as we hoped.", "link": "https://www.l-camera-forum.com/topic/285199-question-about-m9-p-strategy/?tab=comments#comment-3532615", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " option 27, pay for the repair as a gift to your sister and brother-in-law. if you're playing with leica, you likely can afford to spend $1k on your family, just this one time. eric thanks eric, that would be a nice thing to do but i am not in a -----> position !!!  to do that either. if i spend $1k on my family, there are many, many things that will come before cameras. i heard back from leica. they said that \"unless sensor corrosion was verified by leica or one of its subsidiaries by august 31st 2017, the repair is chargeable\" - this directive to customer care worldwide was to be applied \"without exception\". their \"customer friendly solution\" is \"only charging a part of the material cost of the new image sensor (825 euros + vat)\". otherwise there is a table of \"upgrade\" options to other cameras. i forgot to mention here, though i did mention in my email to leica, that my brother-in-law tim's m9-p was the second leica he'd bought brand new, and the first, an m8, had problems of its own - so he actually acquired the m9-p by a similar upgrade due to his first leica being a lemon (at my recommendation). so his experience with leica has been very poor indeed. i've passed their response on to tim and await his response. thank you all for your kindness in responding to my request for advice. unfortunately, it would seem that leica is not as generous or compassionate as we hoped.", "sortedWord": "None", "identifyer": 37093, "year": "2018"}, {"Unnamed: 0": 375800, "autor": "jaapv", "date": 1528464300000, "content": "I think that my rather non-Leica-friendly position on this issue is well known, so don't flame me for a few counter-arguments. This was not a general recall, but a company policy. A general notification is not legally required in that case. Nor is it clear that the camera of a user who is happily snapping away without noticing a problem is \"unfit for purpose\". Devil's advocate --img-- .", "link": "https://www.l-camera-forum.com/topic/285199-question-about-m9-p-strategy/page/2/?tab=comments#comment-3533897", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think that my rather non-leica-friendly -----> position !!!  on this issue is well known, so don't flame me for a few counter-arguments. this was not a general recall, but a company policy. a general notification is not legally required in that case. nor is it clear that the camera of a user who is happily snapping away without noticing a problem is \"unfit for purpose\". devil's advocate --img-- .", "sortedWord": "None", "identifyer": 37108, "year": "2018"}, {"Unnamed: 0": 375804, "autor": "Gobert", "date": 1528534020000, "content": "I think that my rather non-Leica-friendly position on this issue is well known, so don't flame me for a few counter-arguments. This was not a general recall, but a company policy. A general notification is not legally required in that case. Nor is it clear that the camera of a user who is happily snapping away without noticing a problem is \"unfit for purpose\". Devil's advocate --img-- . A recall is something completely different. That’s directed by the autorities in case of f/e a possible dangerous situation. In case of a camera, I cannot imagine what that would be. As said, we are dealing now with regular warranty provisions, which might differ from country to country. Even in the Netherlands, where we have warranty during “expected lifetime”, a contribution from the consumer is by jurisprudenz accepted in case the expected lifetime will be extensively extended because of the repair.", "link": "https://www.l-camera-forum.com/topic/285199-question-about-m9-p-strategy/page/2/?tab=comments#comment-3534372", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think that my rather non-leica-friendly -----> position !!!  on this issue is well known, so don't flame me for a few counter-arguments. this was not a general recall, but a company policy. a general notification is not legally required in that case. nor is it clear that the camera of a user who is happily snapping away without noticing a problem is \"unfit for purpose\". devil's advocate --img-- . a recall is something completely different. that’s directed by the autorities in case of f/e a possible dangerous situation. in case of a camera, i cannot imagine what that would be. as said, we are dealing now with regular warranty provisions, which might differ from country to country. even in the netherlands, where we have warranty during “expected lifetime”, a contribution from the consumer is by jurisprudenz accepted in case the expected lifetime will be extensively extended because of the repair.", "sortedWord": "None", "identifyer": 37112, "year": "2018"}, {"Unnamed: 0": 375813, "autor": "MarkP", "date": 1528539960000, "content": "Jaap, with respect, I completely disagree with your position on this. Leica fitted a component subsequently found to be at significant risk of failure. My Monochrom v1 was giving me no problems. I knew that Leica had placed a 'statute of limitation' on free sensor replacement so I sent the camera in for it to be checked. 'Subclinical' corrosion was identified and a new sensor fitted under warranty. If I'd waited until it was obvious on my files then I would have had to pay for myself. Leica should have emailed all registered owners, advised them of the problem, and offered owners to have the sensor inspected by a registered service department. Edited June 9, 2018 by MarkP", "link": "https://www.l-camera-forum.com/topic/285199-question-about-m9-p-strategy/page/2/?tab=comments#comment-3534401", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "jaap, with respect, i completely disagree with your -----> position !!!  on this. leica fitted a component subsequently found to be at significant risk of failure. my monochrom v1 was giving me no problems. i knew that leica had placed a 'statute of limitation' on free sensor replacement so i sent the camera in for it to be checked. 'subclinical' corrosion was identified and a new sensor fitted under warranty. if i'd waited until it was obvious on my files then i would have had to pay for myself. leica should have emailed all registered owners, advised them of the problem, and offered owners to have the sensor inspected by a registered service department. edited june 9, 2018 by markp", "sortedWord": "None", "identifyer": 37121, "year": "2018"}, {"Unnamed: 0": 376140, "autor": "chris_livsey", "date": 1527339300000, "content": "Hi all I’m looking at buying a M9 but don’t want to get stung with a dodgy sensor so looking for advice, eg how do you know if it’s a second gen sensor or how much of a ticking time bomb is the original type sensor. Any information would be very appreciated. Geoff The \"new\" sensor was announced in June 2015 and around October that year they began fitting them. The new sensor required updated firmware which was the early \"tell tale\", there have been updates since to firmware which now works on both Mk1 and Mk2 so that ID marker has gone, new firmware adjusts for either sensor. It is possible to look at the hidden data in the service menu of the M9 AT YOUR OWN RISK (if you alter settings you can be in trouble with functions if you only look and then close no issues)Power on Delete -> up (2x) -> down (4x) -> left (3x) -> right (3x) -> Info Cleared by turning the camera off. Scroll down the display and under Hardware IDs you should see something like: CCD ID 15, CCD Board 2, Control BRD 2, M16CID 0. (my bold) The CCD ID of new sensors is 15 and 16 (thought to be the year but not proven) 5 and 8 and 11 are old sensors, the MM has a different code. All anecdotal and unconfirmed by Leica but owners have dates returned and data accessed, this despite the sometimes vague Leica paperwork which often does not clearly state what was done. Of course a phone call to Leica with the serial number will allow them to disclose the camera repair history. ​Note some sellers state \"new sensor fitted\" but they mean the damaged original Mk1 sensor was indeed replaced but until the Mk2 was introduced Leica replaced with just another Mk1 sensor which was prone to the same fault and indeed many have had the sensor replaced twice. Leica said that some M9 sensors could be affected, not that all would be, and never confirmed the conditions that could cause the deterioration. It is entirely possible that an M9 with an original sensor may never develop the problem but IMHO a purchase of am M9 with MK1 sensor should have the replacement cost factored into the price. Note also a camera returned from Leica with a MK2 sensor will also have been thoroughly checked over and meet all specs. Given the number of M9 cameras sold and despite the waiting lists only a fraction of the bodies have had sensors replaced so you can speculate this is because they don't have the problem and never will have, not yet developed the problem but probably will develop it, or have it already but the owners don't notice, or do and clone out the affected areas if only minor. I know that's no help but that is the position. Buying from a reputable dealer with a known service history to the camera with paperwork to authenticate should you wish to re-sell is the sensible way forward. __________________ Edited May 26, 2018 by chris_livsey", "link": "https://www.l-camera-forum.com/topic/284958-buying-a-leica-m9/?tab=comments#comment-3525641", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi all i’m looking at buying a m9 but don’t want to get stung with a dodgy sensor so looking for advice, eg how do you know if it’s a second gen sensor or how much of a ticking time bomb is the original type sensor. any information would be very appreciated. geoff the \"new\" sensor was announced in june 2015 and around october that year they began fitting them. the new sensor required updated firmware which was the early \"tell tale\", there have been updates since to firmware which now works on both mk1 and mk2 so that id marker has gone, new firmware adjusts for either sensor. it is possible to look at the hidden data in the service menu of the m9 at your own risk (if you alter settings you can be in trouble with functions if you only look and then close no issues)power on delete -> up (2x) -> down (4x) -> left (3x) -> right (3x) -> info cleared by turning the camera off. scroll down the display and under hardware ids you should see something like: ccd id 15, ccd board 2, control brd 2, m16cid 0. (my bold) the ccd id of new sensors is 15 and 16 (thought to be the year but not proven) 5 and 8 and 11 are old sensors, the mm has a different code. all anecdotal and unconfirmed by leica but owners have dates returned and data accessed, this despite the sometimes vague leica paperwork which often does not clearly state what was done. of course a phone call to leica with the serial number will allow them to disclose the camera repair history. ​note some sellers state \"new sensor fitted\" but they mean the damaged original mk1 sensor was indeed replaced but until the mk2 was introduced leica replaced with just another mk1 sensor which was prone to the same fault and indeed many have had the sensor replaced twice. leica said that some m9 sensors could be affected, not that all would be, and never confirmed the conditions that could cause the deterioration. it is entirely possible that an m9 with an original sensor may never develop the problem but imho a purchase of am m9 with mk1 sensor should have the replacement cost factored into the price. note also a camera returned from leica with a mk2 sensor will also have been thoroughly checked over and meet all specs. given the number of m9 cameras sold and despite the waiting lists only a fraction of the bodies have had sensors replaced so you can speculate this is because they don't have the problem and never will have, not yet developed the problem but probably will develop it, or have it already but the owners don't notice, or do and clone out the affected areas if only minor. i know that's no help but that is the -----> position !!! . buying from a reputable dealer with a known service history to the camera with paperwork to authenticate should you wish to re-sell is the sensible way forward. __________________ edited may 26, 2018 by chris_livsey", "sortedWord": "None", "identifyer": 37449, "year": "2018"}, {"Unnamed: 0": 376297, "autor": "Jeff S", "date": 1526768940000, "content": "I use the M9 as a companion camera to my M8. It works very well for me. Switching the lenses around gives me new perspectives due to the 1.33 crop.No, same perspective unless you change your camera position; otherwise just a cropped field of view, which you can also obtain through PP. Jeff Edited May 19, 2018 by Jeff S", "link": "https://www.l-camera-forum.com/topic/284570-a-m9me-as-a-travel-companion-to-my-m10/?tab=comments#comment-3521704", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i use the m9 as a companion camera to my m8. it works very well for me. switching the lenses around gives me new perspectives due to the 1.33 crop.no, same perspective unless you change your camera -----> position !!! ; otherwise just a cropped field of view, which you can also obtain through pp. jeff edited may 19, 2018 by jeff s", "sortedWord": "None", "identifyer": 37606, "year": "2018"}, {"Unnamed: 0": 377076, "autor": "Luke_Miller", "date": 1521032340000, "content": "Just bought an M10 to be surprised that my dealer refused to take my otherwise mint M9-P in part exchange, saying that they would not consider selling them in their used stock due to sensor issues. Is this the corrosion issue or are there other problems lurking? I think it is the sensor issue. My dealer won't accept a M9, MM, M-E body without documentation from Leica that the sensor has been replaced. I've always believed that the worst position to be in with one of the models that experience sensor corrosion is to have one of the many cameras that didn't experience the problem. Leica won't perform the (once) free replacement and dealers don't want it. Even though there is data to show that many (most?) did not experience corrosion the internet \"wisdom\" seems to be that all will eventually. So any buyer of these models will factor the cost of sensor replacement into the purchase price. Edited March 14, 2018 by Luke_Miller", "link": "https://www.l-camera-forum.com/topic/253418-problem-with-new-sensor-and-firmware-v-1204/page/3/?tab=comments#comment-3480582", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "just bought an m10 to be surprised that my dealer refused to take my otherwise mint m9-p in part exchange, saying that they would not consider selling them in their used stock due to sensor issues. is this the corrosion issue or are there other problems lurking? i think it is the sensor issue. my dealer won't accept a m9, mm, m-e body without documentation from leica that the sensor has been replaced. i've always believed that the worst -----> position !!!  to be in with one of the models that experience sensor corrosion is to have one of the many cameras that didn't experience the problem. leica won't perform the (once) free replacement and dealers don't want it. even though there is data to show that many (most?) did not experience corrosion the internet \"wisdom\" seems to be that all will eventually. so any buyer of these models will factor the cost of sensor replacement into the purchase price. edited march 14, 2018 by luke_miller", "sortedWord": "None", "identifyer": 38388, "year": "2018"}, {"Unnamed: 0": 377428, "autor": "farnz", "date": 1516926360000, "content": "Perhaps your M9 is set to 'Snapshot' mode that removes a lot of options to make the camera as point-and-shoot for those who prefer it that way. I don't have my M9 anymore so I regret that I'm not in much of a position to help. I vaguely (though possibly wrongly) recall that Snapshot shows up by pressing the \"Set\" button as one of the \"user\" modes. I hope others will correct me if I've inadvertently misled you. Pete.", "link": "https://www.l-camera-forum.com/topic/281212-problems-with-m9-after-sensor-replacement/?tab=comments#comment-3447983", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "perhaps your m9 is set to 'snapshot' mode that removes a lot of options to make the camera as point-and-shoot for those who prefer it that way. i don't have my m9 anymore so i regret that i'm not in much of a -----> position !!!  to help. i vaguely (though possibly wrongly) recall that snapshot shows up by pressing the \"set\" button as one of the \"user\" modes. i hope others will correct me if i've inadvertently misled you. pete.", "sortedWord": "None", "identifyer": 38740, "year": "2018"}, {"Unnamed: 0": 382683, "autor": "poli", "date": 1524341040000, "content": " Hi all, Took the m8 this morning for some pictures of tulips. On almost all pics rhere is a strange horizontal line. Looks like some deadpixel to me, however the position of the line changes per picture (and on some pics i have two lines) last week i was using the camera without any problem. Anybody have a clue? --img-- ", "link": "https://www.l-camera-forum.com/topic/283901-leica-m8-funny-line-on-pics/?tab=comments#comment-3504359", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " hi all, took the m8 this morning for some pictures of tulips. on almost all pics rhere is a strange horizontal line. looks like some deadpixel to me, however the -----> position !!!  of the line changes per picture (and on some pics i have two lines) last week i was using the camera without any problem. anybody have a clue? --img-- ", "sortedWord": "None", "identifyer": 44082, "year": "2018"}, {"Unnamed: 0": 382686, "autor": "chris_livsey", "date": 1524390840000, "content": "If the line numbers and position vary it is not a pixel level problem. It could be a read out issue on the sensor, in the circuit board involved in writing to the card or the SD card itself as pointed out above. Full battery, new format (in camera) of the card and see, change card and see, if no spare cards re-format in a computer with one of the \"deep format\" programs (is the card old, they don't live forever) send files to Leica for opinion showing the line(s) in different places (to exclude pixel level and need for sensor re-mapping). My M8 is back from Leica with two circuit boards replaced, not that issue but perhaps an indication that over time board failure is possible. FYI the ban on lead in solder in the EU was at 1st July 2006, lead-free tin as a final finish on a board can spontaneously sprout single crystal hair-like growths the so called “tin whiskers\" over time. These growths are electrically conductive, can grow in years, and can easily bridge between contacts, they can touch each other to cause electrical problems. The M8 was early in that introduction cycle and may suffer over proportionally from the issue as later mitigations were developed, just speculation Edited April 22, 2018 by chris_livsey", "link": "https://www.l-camera-forum.com/topic/283901-leica-m8-funny-line-on-pics/?tab=comments#comment-3504563", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "if the line numbers and -----> position !!!  vary it is not a pixel level problem. it could be a read out issue on the sensor, in the circuit board involved in writing to the card or the sd card itself as pointed out above. full battery, new format (in camera) of the card and see, change card and see, if no spare cards re-format in a computer with one of the \"deep format\" programs (is the card old, they don't live forever) send files to leica for opinion showing the line(s) in different places (to exclude pixel level and need for sensor re-mapping). my m8 is back from leica with two circuit boards replaced, not that issue but perhaps an indication that over time board failure is possible. fyi the ban on lead in solder in the eu was at 1st july 2006, lead-free tin as a final finish on a board can spontaneously sprout single crystal hair-like growths the so called “tin whiskers\" over time. these growths are electrically conductive, can grow in years, and can easily bridge between contacts, they can touch each other to cause electrical problems. the m8 was early in that introduction cycle and may suffer over proportionally from the issue as later mitigations were developed, just speculation edited april 22, 2018 by chris_livsey", "sortedWord": "None", "identifyer": 44085, "year": "2018"}, {"Unnamed: 0": 382852, "autor": "Gavbo", "date": 1520044320000, "content": "Got my repair quote today, the good news is that the parts including sensor is free. The bad news is that they would like 4hrs labour at 149 EUR per hour plus TAX - total bill 709.24 EUR to fix. Thank you for sending the above mentioned camera. During our test we have noticed a discoloration of the LCD screen. This can´t be repaired anymore due to missing spare parts. We also noticed that there are not only vertical lines visible, but also a dual output fault. This requires the exchange of the sensor incl. the attached printed circuit. Here we only charge the labour costs, the sensor as spare part will be free of charge. Work include Incoming inspection Correct pixel / column error image Replace sensor Adjust sensor position Perform software adjustment Adjust the E-blade Clean the E-knife total vote Final cleaning / control The structure of the new leather lining deviates slightly from the previous one, which unfortunately is no longer available. With the commissioning of the repair you also give us Your agreement to use the new version of the leather lining.", "link": "https://www.l-camera-forum.com/topic/280761-pixel-remap-cost/?tab=comments#comment-3472731", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "got my repair quote today, the good news is that the parts including sensor is free. the bad news is that they would like 4hrs labour at 149 eur per hour plus tax - total bill 709.24 eur to fix. thank you for sending the above mentioned camera. during our test we have noticed a discoloration of the lcd screen. this can´t be repaired anymore due to missing spare parts. we also noticed that there are not only vertical lines visible, but also a dual output fault. this requires the exchange of the sensor incl. the attached printed circuit. here we only charge the labour costs, the sensor as spare part will be free of charge. work include incoming inspection correct pixel / column error image replace sensor adjust sensor -----> position !!!  perform software adjustment adjust the e-blade clean the e-knife total vote final cleaning / control the structure of the new leather lining deviates slightly from the previous one, which unfortunately is no longer available. with the commissioning of the repair you also give us your agreement to use the new version of the leather lining.", "sortedWord": "None", "identifyer": 44251, "year": "2018"}, {"Unnamed: 0": 386316, "autor": "TomB_tx", "date": 1525525920000, "content": "Grab shot taken on a hike while crossing one bridge when it started to rain. Looked towards the next bridge and saw this as the shell was coming into position. M5, Nokton 50 1.5 ltm. Cropped to about a 90mm FOV. Ektar, commercial process and scan. --img--  Edited May 5, 2018 by TomB_tx", "link": "https://www.l-camera-forum.com/topic/284086-leica-m-film-photos-feel-free-to-share-yours/page/2/?tab=comments#comment-3513276", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "grab shot taken on a hike while crossing one bridge when it started to rain. looked towards the next bridge and saw this as the shell was coming into -----> position !!! . m5, nokton 50 1.5 ltm. cropped to about a 90mm fov. ektar, commercial process and scan. --img--  edited may 5, 2018 by tomb_tx", "sortedWord": "None", "identifyer": 47722, "year": "2018"}, {"Unnamed: 0": 386317, "autor": "RayD28", "date": 1525529160000, "content": " Grab shot taken on a hike while crossing one bridge when it started to rain. Looked towards the next bridge and saw this as the shell was coming into position. M5, Nokton 50 1.5 ltm. Cropped to about a 90mm FOV. Ektar, commercial process and scan. What resolution was the scanned file from the processor and was it a jpg or tiff?", "link": "https://www.l-camera-forum.com/topic/284086-leica-m-film-photos-feel-free-to-share-yours/page/3/?tab=comments#comment-3513299", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " grab shot taken on a hike while crossing one bridge when it started to rain. looked towards the next bridge and saw this as the shell was coming into -----> position !!! . m5, nokton 50 1.5 ltm. cropped to about a 90mm fov. ektar, commercial process and scan. what resolution was the scanned file from the processor and was it a jpg or tiff?", "sortedWord": "None", "identifyer": 47723, "year": "2018"}, {"Unnamed: 0": 387829, "autor": "paulsydaus", "date": 1522670640000, "content": "The ISO dial position is used by the cameras light meter only to advise you of correct exposure in the viewfinder. It has no other function on the MP (unlike the M7 which has an A mode). It also acts as a reminder of what film is loaded. In fact, on the M-A which has no light meter, this is its only purpose. If you are using an external meter or Sunny 16 etc. and have otherwise memorised or written down what film is loaded, it doesn’t perform any function. Best to get into the habit of setting it when loading film though, otherwise you may end up with under or over exposed film... If you want to deliberately push film during development, say by one stop, you would set the dial to double the actual film speed... I'm still breaking in my new MP and want to understand the ISO dial on the back. First, I'm having a hard time in changing/turning it. I don't want to force anything. I'm assuming that I just place my finger or thumb on the star wheel and turn? However, it doesn't want to do that very easily. Do I push and turn? Secondly, what is this changing internally? Being on the back and not on the top seems a bit odd to me. Thanks, Sent from my iPhone using Tapatalk Edited April 2, 2018 by paulsydaus", "link": "https://www.l-camera-forum.com/topic/258735-changing-iso-dial-on-mp/page/2/?tab=comments#comment-3492663", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the iso dial -----> position !!!  is used by the cameras light meter only to advise you of correct exposure in the viewfinder. it has no other function on the mp (unlike the m7 which has an a mode). it also acts as a reminder of what film is loaded. in fact, on the m-a which has no light meter, this is its only purpose. if you are using an external meter or sunny 16 etc. and have otherwise memorised or written down what film is loaded, it doesn’t perform any function. best to get into the habit of setting it when loading film though, otherwise you may end up with under or over exposed film... if you want to deliberately push film during development, say by one stop, you would set the dial to double the actual film speed... i'm still breaking in my new mp and want to understand the iso dial on the back. first, i'm having a hard time in changing/turning it. i don't want to force anything. i'm assuming that i just place my finger or thumb on the star wheel and turn? however, it doesn't want to do that very easily. do i push and turn? secondly, what is this changing internally? being on the back and not on the top seems a bit odd to me. thanks, sent from my iphone using tapatalk edited april 2, 2018 by paulsydaus", "sortedWord": "None", "identifyer": 278, "year": "2018"}, {"Unnamed: 0": 393448, "autor": "gregdear007", "date": 1528403760000, "content": "Hi, I would like to add one thing to also try which no one seems to mention anywhere on any searches of M6/M6 TTL meter issues. The meter requires the shutter to be in a cocked position and sometimes if wound too hard the meter will not work! That certainly was the case with my M6 and it was driving me crazy until it dawned on me and taking up the slack in the rewind crank and presto it worked! I can turn the meter \"on\" and \"off\" by applying a little pressure either to the wind on lever or the rewind crank. I am not certain if this is standard with all M6s, and perhaps someone would like to try with theirs, however it is something definitely worth checking before sending away as it \"fixed\" my issue.", "link": "https://www.l-camera-forum.com/topic/270500-help-no-one-can-fix-my-leica-m6-ttl-light-meter-not-even-leica/?tab=comments#comment-3533522", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi, i would like to add one thing to also try which no one seems to mention anywhere on any searches of m6/m6 ttl meter issues. the meter requires the shutter to be in a cocked -----> position !!!  and sometimes if wound too hard the meter will not work! that certainly was the case with my m6 and it was driving me crazy until it dawned on me and taking up the slack in the rewind crank and presto it worked! i can turn the meter \"on\" and \"off\" by applying a little pressure either to the wind on lever or the rewind crank. i am not certain if this is standard with all m6s, and perhaps someone would like to try with theirs, however it is something definitely worth checking before sending away as it \"fixed\" my issue.", "sortedWord": "None", "identifyer": 5912, "year": "2018"}, {"Unnamed: 0": 393449, "autor": "wlaidlaw", "date": 1529872500000, "content": " Hi, I would like to add one thing to also try which no one seems to mention anywhere on any searches of M6/M6 TTL meter issues. The meter requires the shutter to be in a cocked position and sometimes if wound too hard the meter will not work! That certainly was the case with my M6 and it was driving me crazy until it dawned on me and taking up the slack in the rewind crank and presto it worked! I can turn the meter \"on\" and \"off\" by applying a little pressure either to the wind on lever or the rewind crank. I am not certain if this is standard with all M6s, and perhaps someone would like to try with theirs, however it is something definitely worth checking before sending away as it \"fixed\" my issue. My CL is behaving a bit like this but I think it may be the MR-9 PX625 battery replacer. As well as fiddling around with the rewind crank and wind on crank, pressing the battery check button sometimes is bringing it to life. Also it was all rebuilt 18 months ago with particular emphasis on the metering by a very reputable Leica repairer, who found a number of dry solder joints, so rewired it all. I have had problems in the past with these regulated mercury battery replacers behaving erratically. Wilson", "link": "https://www.l-camera-forum.com/topic/270500-help-no-one-can-fix-my-leica-m6-ttl-light-meter-not-even-leica/page/2/?tab=comments#comment-3543105", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " hi, i would like to add one thing to also try which no one seems to mention anywhere on any searches of m6/m6 ttl meter issues. the meter requires the shutter to be in a cocked -----> position !!!  and sometimes if wound too hard the meter will not work! that certainly was the case with my m6 and it was driving me crazy until it dawned on me and taking up the slack in the rewind crank and presto it worked! i can turn the meter \"on\" and \"off\" by applying a little pressure either to the wind on lever or the rewind crank. i am not certain if this is standard with all m6s, and perhaps someone would like to try with theirs, however it is something definitely worth checking before sending away as it \"fixed\" my issue. my cl is behaving a bit like this but i think it may be the mr-9 px625 battery replacer. as well as fiddling around with the rewind crank and wind on crank, pressing the battery check button sometimes is bringing it to life. also it was all rebuilt 18 months ago with particular emphasis on the metering by a very reputable leica repairer, who found a number of dry solder joints, so rewired it all. i have had problems in the past with these regulated mercury battery replacers behaving erratically. wilson", "sortedWord": "None", "identifyer": 5913, "year": "2018"}, {"Unnamed: 0": 395083, "autor": "wizard", "date": 1543592940000, "content": "Am 5.11.2018 um 03:06 schrieb adan: If there is a screw-head on your 50mm lens mount right where the coding goes (there normally is), ... Adan, if I am not mistaken the Summicron 50 IV is a still current lens (the one with the sliding lens hood). So if there is a screw at one of the coding positions, how does Leica manage to factory code this lens? By using a mount with one screw less than usual? Cheers, Andy", "link": "https://www.l-camera-forum.com/topic/185433-m-lens-codes/page/7/?tab=comments#comment-3639769", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "am 5.11.2018 um 03:06 schrieb adan: if there is a screw-head on your 50mm lens mount right where the coding goes (there normally is), ... adan, if i am not mistaken the summicron 50 iv is a still current lens (the one with the sliding lens hood). so if there is a screw at one of the coding -----> positions !!! , how does leica manage to factory code this lens? by using a mount with one screw less than usual? cheers, andy", "sortedWord": "None", "identifyer": 7552, "year": "2018"}, {"Unnamed: 0": 395087, "autor": "adan", "date": 1543595640000, "content": "45 minutes ago, wizard said: Adan, if I am not mistaken the Summicron 50 IV is a still current lens (the one with the sliding lens hood). So if there is a screw at one of the coding positions, how does Leica manage to factory code this lens? By using a mount with one screw less than usual? Cheers, Andy Yes - to convert older lenses. E.G. my 1982 21mm pre-ASPH converted to 6-bit now uses five of the the original six screws. Although that would also apply to an (early) 2006 75 or 50 Summicron as well. Lenses made since 6-bit codes were introduced have a different pattern of six screws, to allow the gap for the 6-bit code. E.G. my ~2010 35mm Summarit. Presumably a 50 Summicron made since 2007 has six screws in the new pattern. Edited November 30, 2018 by adan", "link": "https://www.l-camera-forum.com/topic/185433-m-lens-codes/page/7/?tab=comments#comment-3639791", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "45 minutes ago, wizard said: adan, if i am not mistaken the summicron 50 iv is a still current lens (the one with the sliding lens hood). so if there is a screw at one of the coding -----> positions !!! , how does leica manage to factory code this lens? by using a mount with one screw less than usual? cheers, andy yes - to convert older lenses. e.g. my 1982 21mm pre-asph converted to 6-bit now uses five of the the original six screws. although that would also apply to an (early) 2006 75 or 50 summicron as well. lenses made since 6-bit codes were introduced have a different pattern of six screws, to allow the gap for the 6-bit code. e.g. my ~2010 35mm summarit. presumably a 50 summicron made since 2007 has six screws in the new pattern. edited november 30, 2018 by adan", "sortedWord": "None", "identifyer": 7556, "year": "2018"}, {"Unnamed: 0": 403536, "autor": "mikeamosau", "date": 1524078060000, "content": "Mike, you might enjoy searching this site for the 75mm Summilux competitor - Leica's latest 75mm Noctilux. The Noctilux is not just a tiny bit faster but is a new Karbe design with stunning OOF. His genius in this lens is evident. Now with that said, the price difference is more than daunting and while I can afford the 75mm Noctilux, count me as one to stay with the Summilux - nobody I photograph for cares for the difference. Others will contribute other alternatives. I would but I have no experience with those lenses. Oh! What is a reasonable price today for the Summilux 75mm? Thank you so much for your comment and thoughts. I have defiantly taken a look at the 75mm Noctilux - it really does look like an incredible lens. I am in the position to be able to purchase the new Noctilux, but, there are a number of things that push me towards the Summilux. Weight is a consideration, that new lens is very heavy, but more importantly for me, I already have a number of newer Karbe designed lenses, so its more a matter of pairing that with something that offers a different look. As for the price, the one I am looking at is $3700 USD and is the pull out hood version. Thanks again! Mike", "link": "https://www.l-camera-forum.com/topic/283778-75mm-summilux-your-experience-and-thoughts/?tab=comments#comment-3502678", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mike, you might enjoy searching this site for the 75mm summilux competitor - leica's latest 75mm noctilux. the noctilux is not just a tiny bit faster but is a new karbe design with stunning oof. his genius in this lens is evident. now with that said, the price difference is more than daunting and while i can afford the 75mm noctilux, count me as one to stay with the summilux - nobody i photograph for cares for the difference. others will contribute other alternatives. i would but i have no experience with those lenses. oh! what is a reasonable price today for the summilux 75mm? thank you so much for your comment and thoughts. i have defiantly taken a look at the 75mm noctilux - it really does look like an incredible lens. i am in the -----> position !!!  to be able to purchase the new noctilux, but, there are a number of things that push me towards the summilux. weight is a consideration, that new lens is very heavy, but more importantly for me, i already have a number of newer karbe designed lenses, so its more a matter of pairing that with something that offers a different look. as for the price, the one i am looking at is $3700 usd and is the pull out hood version. thanks again! mike", "sortedWord": "None", "identifyer": 16289, "year": "2018"}, {"Unnamed: 0": 405903, "autor": "UliWer", "date": 1517910240000, "content": "... that little mechanical wonder ... Unfortunately the Elmar-M has the worst mechanics of all collapsible lenses Leica made. Unlike all others there is no definite position to fix the extracted shaft. So it will happen that you can only see the aperture scale when you look from below, if you don't fix it in the right position. When I first had it, I thought mine was misadjusted by some imcompetent repairer - until I learned that all Elmar-Ms were like this. The mount also is not strong enough to prevent it getting wobbly - something which won't happen to other collapsible Leica lenses. It was first introduced with the M6J in the mount it originally got when it was first built with M-bayonet. I havn't used such a version, though if this built equals the quality of the original M-Version it would be much preferable. I am also not sure whether the M6J-version has a straight-line mount - the lens head not turning around when you focus it. This would be a big progress compared to the original version. So since Leica started to \"reissue\" some old lens-designs, a 50mm Elmar (preferably 1:3.5 with modern glass) with the old but straight-line mount of the bayonet-Elmar would be more appealing than what they have \"reissued\" so far.", "link": "https://www.l-camera-forum.com/topic/281581-50mm-28-elmar-m/?tab=comments#comment-3456209", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "... that little mechanical wonder ... unfortunately the elmar-m has the worst mechanics of all collapsible lenses leica made. unlike all others there is no definite -----> position !!!  to fix the extracted shaft. so it will happen that you can only see the aperture scale when you look from below, if you don't fix it in the right position. when i first had it, i thought mine was misadjusted by some imcompetent repairer - until i learned that all elmar-ms were like this. the mount also is not strong enough to prevent it getting wobbly - something which won't happen to other collapsible leica lenses. it was first introduced with the m6j in the mount it originally got when it was first built with m-bayonet. i havn't used such a version, though if this built equals the quality of the original m-version it would be much preferable. i am also not sure whether the m6j-version has a straight-line mount - the lens head not turning around when you focus it. this would be a big progress compared to the original version. so since leica started to \"reissue\" some old lens-designs, a 50mm elmar (preferably 1:3.5 with modern glass) with the old but straight-line mount of the bayonet-elmar would be more appealing than what they have \"reissued\" so far.", "sortedWord": "None", "identifyer": 18676, "year": "2018"}, {"Unnamed: 0": 405910, "autor": "UliWer", "date": 1517932620000, "content": "I don't see significant differences re build quality between my 50/2.8 v1 (11112), v2 (11831) and M6J version (11824). ... Has the M6J-version just one defined position where to fix it when it is extracted like the \"old\" versions?", "link": "https://www.l-camera-forum.com/topic/281581-50mm-28-elmar-m/?tab=comments#comment-3456441", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i don't see significant differences re build quality between my 50/2.8 v1 (11112), v2 (11831) and m6j version (11824). ... has the m6j-version just one defined -----> position !!!  where to fix it when it is extracted like the \"old\" versions?", "sortedWord": "None", "identifyer": 18683, "year": "2018"}, {"Unnamed: 0": 405911, "autor": "epand56", "date": 1517934060000, "content": "Great lens, the level of a Summicron at one third of the price or less. Maybe even sharper. The only weakness, at least on mine, is you can't lock it in collapsed position. Anyway it's a pleasure to use this little marvel. Got it years ago and is among the never-sell lenses. --img-- ", "link": "https://www.l-camera-forum.com/topic/281581-50mm-28-elmar-m/?tab=comments#comment-3456459", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "great lens, the level of a summicron at one third of the price or less. maybe even sharper. the only weakness, at least on mine, is you can't lock it in collapsed -----> position !!! . anyway it's a pleasure to use this little marvel. got it years ago and is among the never-sell lenses. --img-- ", "sortedWord": "None", "identifyer": 18684, "year": "2018"}, {"Unnamed: 0": 405915, "autor": "lct", "date": 1517941500000, "content": "Has the M6J-version just one defined position where to fix it when it is extracted like the \"old\" versions? Would you mind to elaborate about this defined position? I don't have them with me but i don't recall having noticed a special engraving on either version. Collapsing or extending those lenses have never been a problem for me though.", "link": "https://www.l-camera-forum.com/topic/281581-50mm-28-elmar-m/?tab=comments#comment-3456540", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "has the m6j-version just one defined -----> position !!!  where to fix it when it is extracted like the \"old\" versions? would you mind to elaborate about this defined position? i don't have them with me but i don't recall having noticed a special engraving on either version. collapsing or extending those lenses have never been a problem for me though.", "sortedWord": "None", "identifyer": 18688, "year": "2018"}, {"Unnamed: 0": 405919, "autor": "g2van", "date": 1517945940000, "content": "I have this lens the black version - love it - wonderful, small, light, sharp. Yes in the beginning, it takes time to get used to how to pull it out properly but like everything else it's a short learning curve. I have heard that one should never mount the lens when it is in its collapsed position because when you extend it in camera, it may damage the mount / rf alignment - anyone can confirm this?", "link": "https://www.l-camera-forum.com/topic/281581-50mm-28-elmar-m/page/2/?tab=comments#comment-3456592", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i have this lens the black version - love it - wonderful, small, light, sharp. yes in the beginning, it takes time to get used to how to pull it out properly but like everything else it's a short learning curve. i have heard that one should never mount the lens when it is in its collapsed -----> position !!!  because when you extend it in camera, it may damage the mount / rf alignment - anyone can confirm this?", "sortedWord": "None", "identifyer": 18692, "year": "2018"}, {"Unnamed: 0": 405931, "autor": "jaapv", "date": 1517964720000, "content": "I have this lens the black version - love it - wonderful, small, light, sharp. Yes in the beginning, it takes time to get used to how to pull it out properly but like everything else it's a short learning curve. I have heard that one should never mount the lens when it is in its collapsed position because when you extend it in camera, it may damage the mount / rf alignment - anyone can confirm this? That is what is said, notably by Leica. However, I never managed to do so.", "link": "https://www.l-camera-forum.com/topic/281581-50mm-28-elmar-m/page/2/?tab=comments#comment-3456737", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i have this lens the black version - love it - wonderful, small, light, sharp. yes in the beginning, it takes time to get used to how to pull it out properly but like everything else it's a short learning curve. i have heard that one should never mount the lens when it is in its collapsed -----> position !!!  because when you extend it in camera, it may damage the mount / rf alignment - anyone can confirm this? that is what is said, notably by leica. however, i never managed to do so.", "sortedWord": "None", "identifyer": 18704, "year": "2018"}, {"Unnamed: 0": 409525, "autor": "Gregm61", "date": 1516743060000, "content": " As more of a wide shooter my three lens outfit, be it for travel or every day carry, is the 35-75 and 21mm Super Elmar. I have three 75's, the CV Heliar Classic, Summicron and f2.4 Summarit. If I were in a position where I would have to sell two and keep only one, I would hold on to the f2.4 Summarit. Edited January 23, 2018 by Gregm61", "link": "https://www.l-camera-forum.com/topic/281143-75mm/?tab=comments#comment-3446748", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " as more of a wide shooter my three lens outfit, be it for travel or every day carry, is the 35-75 and 21mm super elmar. i have three 75's, the cv heliar classic, summicron and f2.4 summarit. if i were in a -----> position !!!  where i would have to sell two and keep only one, i would hold on to the f2.4 summarit. edited january 23, 2018 by gregm61", "sortedWord": "None", "identifyer": 22349, "year": "2018"}, {"Unnamed: 0": 411220, "autor": "Jean-Michel", "date": 1534951860000, "content": "I have both the 50 'Rigid' (purchased new with an M4 in 1968) and a current 50 Summicron. I no longer use the 'Rigid' since I have the newer lens, but there is really nothing wrong with the older model which served me well for all those years. As of the test shot, the OP does need to refine his technique. A tripod is definitely must; a proper target, properly positioned is also needed. An fairly easily built target can be downloaded from the following site: http://squit.co.uk/photo/focuschart.html Since I do use a tripod for some of my work, I purchased replacement baseplates from RRS for my M9 and M-P", "link": "https://www.l-camera-forum.com/topic/287700-summicron-50mm-f2-type-5-sharpness/?tab=comments#comment-3577085", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "i have both the 50 'rigid' (purchased new with an m4 in 1968) and a current 50 summicron. i no longer use the 'rigid' since i have the newer lens, but there is really nothing wrong with the older model which served me well for all those years. as of the test shot, the op does need to refine his technique. a tripod is definitely must; a proper target, properly -----> positioned !!!  is also needed. an fairly easily built target can be downloaded from the following site: http://squit.co.uk/photo/focuschart.html since i do use a tripod for some of my work, i purchased replacement baseplates from rrs for my m9 and m-p", "sortedWord": "None", "identifyer": 24062, "year": "2018"}, {"Unnamed: 0": 415954, "autor": "Jeff S", "date": 1526603100000, "content": ".... errrr ..... that does beg the question why you are on the forum and using Leica gear at all....... taking the argument to it's logical conclusion you should be using a cheap ancient 8mpx digital and some crappy old tamron lenses. --img--  attributing 'character' to deficient lens design is a matter of semi delusional semantics. It's a bit like playing 78's on a wind up gramophone because you think modern Hi-Fi has ruined music ...... --img-- Last I checked, many on the forum were jazzed about the reintroduction of lenses called Summaron, Thambar and the like. Character, perhaps. But that aside, I think extreme scenarios miss the more moderate positions. Oftentimes there are ‘sweet spots’ in technology for some people. Car analogies often fail, but for me, the 911 was more fun when it was smaller and less powerful. Now the Cayman has filled the void. Markets often demand that things get bigger and faster and more whatever..... but one needn’t be a Luddite to think more is not better. Yes, I sometimes still listen to vinyl and drive older cars. But while I’ve moved on to more modern variations, there’s a level beyond which I not only don’t need, but don’t want. I moved to digital photography primarily to get out of the darkroom and to add color to my printing repertoire. But I will never need a 200 MP camera , Leica or otherwise. Or lenses that have corresponding resolution. I have used the M for 35+ years in large part because of the size, controls, , viewing and focusing, and the lenses, of which the latter have been good enough for a long time. But Leica doesn’t make much money on folks like me. Although if they made the SL system smaller and more portable, with some slower and narrower range zooms, I’d add a bit to their sales. Unlike Gordon, I’d rather have a system that while great, I’m more likely to carry, than to prioritize optical perfection. Jeff Edited May 18, 2018 by Jeff S", "link": "https://www.l-camera-forum.com/topic/284624-otus-vs-sl-primes/?tab=comments#comment-3520626", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": ".... errrr ..... that does beg the question why you are on the forum and using leica gear at all....... taking the argument to it's logical conclusion you should be using a cheap ancient 8mpx digital and some crappy old tamron lenses. --img--  attributing 'character' to deficient lens design is a matter of semi delusional semantics. it's a bit like playing 78's on a wind up gramophone because you think modern hi-fi has ruined music ...... --img-- last i checked, many on the forum were jazzed about the reintroduction of lenses called summaron, thambar and the like. character, perhaps. but that aside, i think extreme scenarios miss the more moderate -----> positions !!! . oftentimes there are ‘sweet spots’ in technology for some people. car analogies often fail, but for me, the 911 was more fun when it was smaller and less powerful. now the cayman has filled the void. markets often demand that things get bigger and faster and more whatever..... but one needn’t be a luddite to think more is not better. yes, i sometimes still listen to vinyl and drive older cars. but while i’ve moved on to more modern variations, there’s a level beyond which i not only don’t need, but don’t want. i moved to digital photography primarily to get out of the darkroom and to add color to my printing repertoire. but i will never need a 200 mp camera , leica or otherwise. or lenses that have corresponding resolution. i have used the m for 35+ years in large part because of the size, controls, , viewing and focusing, and the lenses, of which the latter have been good enough for a long time. but leica doesn’t make much money on folks like me. although if they made the sl system smaller and more portable, with some slower and narrower range zooms, i’d add a bit to their sales. unlike gordon, i’d rather have a system that while great, i’m more likely to carry, than to prioritize optical perfection. jeff edited may 18, 2018 by jeff s", "sortedWord": "None", "identifyer": 28896, "year": "2018"}, {"Unnamed: 0": 416350, "autor": "dkCambridgeshire", "date": 1531828560000, "content": "Last year I acquired a manual focus Canon FD 500/4.5 L lens and successfully used it via an original Canon Camera Co. FD to EOS adapter (1.26x extension factor) on both my SL and T cameras … using EOS to M and M to T adapters. The 500/4.5 L lens plus Canon FD to EOS adapter, plus Novoflex EOS to SL adapter wouldn't work … that combination resulted in no live view image. Last September I decided to send the FD 500/4.5 L lens to a well known technician for conversion to EOS mount … which makes it EOS camera compatible but still requires manual focus . Long story short the conversion took until the end of March (over 6 months) to be completed to my satisfaction with endless excuses for delays … and required return for adjustment because initially was returned with the rotatable click-stopped 'L' shaped tripod support at 30º to the image plane … rendering it unusable regardless of the tripod support's 'clicked' position . Also, another FD lens sent for conversion (FD 300/4 L ) was returned because the EOS 'chip' (electronic contacts) fell off the first time the lens was coupled to the EOS to SL adapter. I was so disappointed with the conversions I did not use the lens until recently when discovered that it would not work in Aperture priority with EOS extension tubes or EOS extenders … but have now discovered it will work with tubes and extenders and the Novoflex EOS to SL adapter, provided the camera is used in Manual exposure mode ... whereby the lens' aperture ring &/or the camera's shutter speed are adjusted to ZERO the exposure scale … no problem for anyone used to using e.g. a Leica M6 . Thus now have another 'long lens' option for the SL but have not used it 'in anger' yet for specific subjects … will likely try the combination at a local nature reserve soon and post some pics of both the camera / lens / adapters and resultant images. Once again … al this messing about to obtain a decent long focus lens for e.g. wildlife photography would not be necessary if Leica Camera AG could / would provide SL users with a lens longer than 280mm . I had thought of using e.g. the 560 Telyt R plus R APO extenders but find the regular button operated trombone focus mount is too inefficient to achieve accurate 'fine focus'. The Novoflex 'follow focus' mount with built-in bellows is much better hence I'm using same for insect photography coupled to a 400mm Noflexar T (3 element achromat) and Noflexar 600mm (2 element achromat). Some may suggest using e.g. a Canon EOS L lens - but the Novoflex EOS to SL adapter is fairly useless for AF … so might as well use a manual focus lens at considerably less cost. One day an announcement will likely be made about an SL 560mm lens … but it will have been a far too long time coming … a bit like the Messiah --img--  dunk Edited July 17, 2018 by dkCambridgeshire", "link": "https://www.l-camera-forum.com/topic/275370-vintage-lenses-on-the-sl/page/4/?tab=comments#comment-3557336", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "last year i acquired a manual focus canon fd 500/4.5 l lens and successfully used it via an original canon camera co. fd to eos adapter (1.26x extension factor) on both my sl and t cameras … using eos to m and m to t adapters. the 500/4.5 l lens plus canon fd to eos adapter, plus novoflex eos to sl adapter wouldn't work … that combination resulted in no live view image. last september i decided to send the fd 500/4.5 l lens to a well known technician for conversion to eos mount … which makes it eos camera compatible but still requires manual focus . long story short the conversion took until the end of march (over 6 months) to be completed to my satisfaction with endless excuses for delays … and required return for adjustment because initially was returned with the rotatable click-stopped 'l' shaped tripod support at 30º to the image plane … rendering it unusable regardless of the tripod support's 'clicked' -----> position !!!  . also, another fd lens sent for conversion (fd 300/4 l ) was returned because the eos 'chip' (electronic contacts) fell off the first time the lens was coupled to the eos to sl adapter. i was so disappointed with the conversions i did not use the lens until recently when discovered that it would not work in aperture priority with eos extension tubes or eos extenders … but have now discovered it will work with tubes and extenders and the novoflex eos to sl adapter, provided the camera is used in manual exposure mode ... whereby the lens' aperture ring &/or the camera's shutter speed are adjusted to zero the exposure scale … no problem for anyone used to using e.g. a leica m6 . thus now have another 'long lens' option for the sl but have not used it 'in anger' yet for specific subjects … will likely try the combination at a local nature reserve soon and post some pics of both the camera / lens / adapters and resultant images. once again … al this messing about to obtain a decent long focus lens for e.g. wildlife photography would not be necessary if leica camera ag could / would provide sl users with a lens longer than 280mm . i had thought of using e.g. the 560 telyt r plus r apo extenders but find the regular button operated trombone focus mount is too inefficient to achieve accurate 'fine focus'. the novoflex 'follow focus' mount with built-in bellows is much better hence i'm using same for insect photography coupled to a 400mm noflexar t (3 element achromat) and noflexar 600mm (2 element achromat). some may suggest using e.g. a canon eos l lens - but the novoflex eos to sl adapter is fairly useless for af … so might as well use a manual focus lens at considerably less cost. one day an announcement will likely be made about an sl 560mm lens … but it will have been a far too long time coming … a bit like the messiah --img--  dunk edited july 17, 2018 by dkcambridgeshire", "sortedWord": "None", "identifyer": 29294, "year": "2018"}, {"Unnamed: 0": 419237, "autor": "FMB", "date": 1535020800000, "content": "I'm very disappointed, as a customer, about the disdainful position adopted by Leitz and Nissin both hinting at the the real possibility of respective firmwares able to link the use of Nissin flashes with the Leica SF C1. Both also saying to the other that must be the one on charge of solve the problem. Both forgetting that many of the buyers of C1 were expecting not only that possibility, but also to use the C1 as a trigger for other flashes even thought in manual mode. Both trying to hidden the reality that the flash Leica SF 60 is a modified Nissin i60 with the agreement and the complicity of Nissin. Both ignoring but beneficed by the fact that this circumstance has been and will be a very good argument for selling their products. I think that both, Leica and Nissin, must end up with the divorce of their firmwares by mean of a simple agreement of softwares at least in a basic mutual recognition...", "link": "https://www.l-camera-forum.com/topic/287530-can-the-sf-c1-control-the-nissin-i60a-for-others-systems/?tab=comments#comment-3577561", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i'm very disappointed, as a customer, about the disdainful -----> position !!!  adopted by leitz and nissin both hinting at the the real possibility of respective firmwares able to link the use of nissin flashes with the leica sf c1. both also saying to the other that must be the one on charge of solve the problem. both forgetting that many of the buyers of c1 were expecting not only that possibility, but also to use the c1 as a trigger for other flashes even thought in manual mode. both trying to hidden the reality that the flash leica sf 60 is a modified nissin i60 with the agreement and the complicity of nissin. both ignoring but beneficed by the fact that this circumstance has been and will be a very good argument for selling their products. i think that both, leica and nissin, must end up with the divorce of their firmwares by mean of a simple agreement of softwares at least in a basic mutual recognition...", "sortedWord": "None", "identifyer": 32247, "year": "2018"}, {"Unnamed: 0": 425337, "autor": "wlaidlaw", "date": 1521382020000, "content": "The only downside of the Summaron 35/2.8 if it is an LTM one like mine, is the only LTM to M adapters I have found, that work either on the M240 series cameras or the active M adapter L, are the expensive Rayqual ones. I have a bunch of other adapters ranging from original Leica, through Voigtlander to Chinese no-name ones, with wrongly positioned coding pits. The only adapters which consistently don't cause the \"no lens detected\" message are the Rayqual black anodised ones with a white painted slot onto which you can mark coding lines with a Pentel Sharpie. Otherwise a great lens. Mine mostly sits on my IIIg with a SBLOO viewfinder. Wilson", "link": "https://www.l-camera-forum.com/topic/282141-vintage-lenses-on-aps-c/page/4/?tab=comments#comment-3482883", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "the only downside of the summaron 35/2.8 if it is an ltm one like mine, is the only ltm to m adapters i have found, that work either on the m240 series cameras or the active m adapter l, are the expensive rayqual ones. i have a bunch of other adapters ranging from original leica, through voigtlander to chinese no-name ones, with wrongly -----> positioned !!!  coding pits. the only adapters which consistently don't cause the \"no lens detected\" message are the rayqual black anodised ones with a white painted slot onto which you can mark coding lines with a pentel sharpie. otherwise a great lens. mine mostly sits on my iiig with a sbloo viewfinder. wilson", "sortedWord": "None", "identifyer": 38428, "year": "2018"}, {"Unnamed: 0": 426768, "autor": "wlaidlaw", "date": 1521361380000, "content": "I bought an old stock but unused Metz 36-C2 basic flash for use on my various late Barnack Leicas (IIf, Ig and IIIg), M4 and film CL. This is one of the few new flashes that still offers hot shoe (for the CL) or PC cable connection (the rest). It is not exactly a quality product with a rather floppy tilt and pan head but it does the job. Strangely the Metz 36-AF5 I bought to use with my Micro 4/3rd cameras, is far better made. The 36-C2 has both Manual, High, Medium and Low Power Automatic, thyristor controlled modes, has a manual zoom tilt and pan head and is reasonably powerful. It cost me £28. I usually use it with the Sto-Fen diffusor shown, as the tilt head tends to flop down to the straight ahead position. It worked fine on the digital CL before I got the SF40, with the CL in Manual exposure mode. I set sync speed to 1/60. Photo taken with CL and SF40. Wilson --img--  Edited March 18, 2018 by wlaidlaw", "link": "https://www.l-camera-forum.com/topic/282700-recommended-flash-unit-for-cl/page/2/?tab=comments#comment-3482699", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i bought an old stock but unused metz 36-c2 basic flash for use on my various late barnack leicas (iif, ig and iiig), m4 and film cl. this is one of the few new flashes that still offers hot shoe (for the cl) or pc cable connection (the rest). it is not exactly a quality product with a rather floppy tilt and pan head but it does the job. strangely the metz 36-af5 i bought to use with my micro 4/3rd cameras, is far better made. the 36-c2 has both manual, high, medium and low power automatic, thyristor controlled modes, has a manual zoom tilt and pan head and is reasonably powerful. it cost me £28. i usually use it with the sto-fen diffusor shown, as the tilt head tends to flop down to the straight ahead -----> position !!! . it worked fine on the digital cl before i got the sf40, with the cl in manual exposure mode. i set sync speed to 1/60. photo taken with cl and sf40. wilson --img--  edited march 18, 2018 by wlaidlaw", "sortedWord": "None", "identifyer": 39868, "year": "2018"}, {"Unnamed: 0": 427902, "autor": "Lonescapes", "date": 1517289600000, "content": "As a rule of thumb I favor a 50 if I'm primarily planning to shoot stills. The added flexibility of shallower DOF, and the generally better optical quality/lack of distortion of same-class 50s outweigh the inconvenience of having to back up into the corner to get more in the frame. If I plan on using the lens or the camera it tends to sit on as a hybrid device (photo and video), I'll usually use 35 as my standard. It's harder to get the video you want while you're worrying about positioning yourself to get everything in the frame. Neither of these focal lengths are ideal, in my opinion. Anyone who has shot a 43mm Pentax lens or has shot a fast 28mm prime on an APS-C sensor can tell you about the magic of shooting at the focal length that matches the diagonal size of the sensor.", "link": "https://www.l-camera-forum.com/topic/281303-23-tl-vs-35-tl-best-prime-to-start-with/?tab=comments#comment-3450866", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "as a rule of thumb i favor a 50 if i'm primarily planning to shoot stills. the added flexibility of shallower dof, and the generally better optical quality/lack of distortion of same-class 50s outweigh the inconvenience of having to back up into the corner to get more in the frame. if i plan on using the lens or the camera it tends to sit on as a hybrid device (photo and video), i'll usually use 35 as my standard. it's harder to get the video you want while you're worrying about -----> positioning !!!  yourself to get everything in the frame. neither of these focal lengths are ideal, in my opinion. anyone who has shot a 43mm pentax lens or has shot a fast 28mm prime on an aps-c sensor can tell you about the magic of shooting at the focal length that matches the diagonal size of the sensor.", "sortedWord": "None", "identifyer": 41012, "year": "2018"}, {"Unnamed: 0": 437872, "autor": "jaapv", "date": 1536854640000, "content": "Not impossible, though. The cooperation between Leica and Panasonic is tight and formalized in contracts. It may well be that Leica will sell more lenses this way. The margins on lenses are probably higher than on cameras. If Panasonic positions the camera between SL and CL pricewise there may well be a mutually profitable situation. i.e.: CL -> simplified SL -> Top-end SL2.", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/?tab=comments#comment-3592535", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "not impossible, though. the cooperation between leica and panasonic is tight and formalized in contracts. it may well be that leica will sell more lenses this way. the margins on lenses are probably higher than on cameras. if panasonic -----> positions !!!  the camera between sl and cl pricewise there may well be a mutually profitable situation. i.e.: cl -> simplified sl -> top-end sl2.", "sortedWord": "None", "identifyer": 51113, "year": "2018"}, {"Unnamed: 0": 437874, "autor": "mmradman", "date": 1536855780000, "content": "Not impossible, though. The cooperation between Leica and Panasonic is tight and formalized in contracts. It may well be that Leica will sell more lenses this way. The margins on lenses are probably higher than on cameras. If Panasonic positions the camera between SL and CL pricewise there may well be a mutually profitable situation. i.e.: CL -> simplified SL -> Top-end SL2. That would be very sensible cooperative approach, utilising strength of each business fully. Some clear opportunities here... 1. For a typical user savings realised by buying Panasonic instead of Leica badge SL2 can be used to Buy Leica L lenses. 2. Panasonic probably have bigger market exposure than Leica hence bigger potential for Leica to sell lenses. 3. Even future Panasonic made lenses could be branded as Leica as is the case with many MTF lenses. In a separate thread we were discussing reliability, there is an implicit consensus that SL system have much higher reliability than either M or S systems, so who is to say that Panasonic dint have their very positive involvement already.", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/?tab=comments#comment-3592547", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "not impossible, though. the cooperation between leica and panasonic is tight and formalized in contracts. it may well be that leica will sell more lenses this way. the margins on lenses are probably higher than on cameras. if panasonic -----> positions !!!  the camera between sl and cl pricewise there may well be a mutually profitable situation. i.e.: cl -> simplified sl -> top-end sl2. that would be very sensible cooperative approach, utilising strength of each business fully. some clear opportunities here... 1. for a typical user savings realised by buying panasonic instead of leica badge sl2 can be used to buy leica l lenses. 2. panasonic probably have bigger market exposure than leica hence bigger potential for leica to sell lenses. 3. even future panasonic made lenses could be branded as leica as is the case with many mtf lenses. in a separate thread we were discussing reliability, there is an implicit consensus that sl system have much higher reliability than either m or s systems, so who is to say that panasonic dint have their very positive involvement already.", "sortedWord": "None", "identifyer": 51115, "year": "2018"}, {"Unnamed: 0": 437972, "autor": "frame-it", "date": 1537544940000, "content": "unless in this new camera, the sensor position has been modified But then the math for flange distance still doesn't work. Edited September 21, 2018 by frame-it", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/6/?tab=comments#comment-3597094", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "unless in this new camera, the sensor -----> position !!!  has been modified but then the math for flange distance still doesn't work. edited september 21, 2018 by frame-it", "sortedWord": "None", "identifyer": 51213, "year": "2018"}, {"Unnamed: 0": 437973, "autor": "LD_50", "date": 1537545960000, "content": "unless in this new camera, the sensor position has been modified If the sensor position (assuming you’re referring to flange distance) is modified, it’s no longer L mount. The existing L lenses would not work without adapter.", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/6/?tab=comments#comment-3597106", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "unless in this new camera, the sensor -----> position !!!  has been modified if the sensor -----> position !!!  (assuming you’re referring to flange distance) is modified, it’s no longer l mount. the existing l lenses would not work without adapter.", "sortedWord": "None", "identifyer": 51214, "year": "2018"}, {"Unnamed: 0": 437974, "autor": "frame-it", "date": 1537546620000, "content": "you're right...but if its got IBIS on the sensor it might be different If the sensor position (assuming you’re referring to flange distance) is modified, it’s no longer L mount. The existing L lenses would not work without adapter.", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/6/?tab=comments#comment-3597109", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "you're right...but if its got ibis on the sensor it might be different if the sensor -----> position !!!  (assuming you’re referring to flange distance) is modified, it’s no longer l mount. the existing l lenses would not work without adapter.", "sortedWord": "None", "identifyer": 51215, "year": "2018"}, {"Unnamed: 0": 437991, "autor": "bags27", "date": 1537561500000, "content": "I'm somewhat in the same position, though I have the Z6 on pre-order. My struggle with the Panasonic is based on their current cameras where I really don't like the form factor and which is likely going to be replicated in their next ones. The Nikons are much better: better to hold, more dials than simple digital settlings, just a simpler interface. Nikon is far from the Leica that way, but way ahead, IMO, of any other digital camera (except the 1/2 sensor Fujis, whose form factor is nice, but not the interface). So, I'm hoping that all this craziness results in Leica producing more quickly a more current SL2. Edited September 21, 2018 by bags27", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/7/?tab=comments#comment-3597246", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i'm somewhat in the same -----> position !!! , though i have the z6 on pre-order. my struggle with the panasonic is based on their current cameras where i really don't like the form factor and which is likely going to be replicated in their next ones. the nikons are much better: better to hold, more dials than simple digital settlings, just a simpler interface. nikon is far from the leica that way, but way ahead, imo, of any other digital camera (except the 1/2 sensor fujis, whose form factor is nice, but not the interface). so, i'm hoping that all this craziness results in leica producing more quickly a more current sl2. edited september 21, 2018 by bags27", "sortedWord": "None", "identifyer": 51232, "year": "2018"}, {"Unnamed: 0": 438001, "autor": "IkarusJohn", "date": 1537574820000, "content": "I think you’re both right, but arguing over differences in expression. It is not incompatible to either position that the SL was designed from top to bottom by Leica. My understanding is that the camera was designed by a different team to the M system team from the ground up. They have used Panasonic and other technical skills, but to Leica’s design, both in what is specified and the user interface. This has meant that, taken as a whole, the camera is Leica through and through - that is not incompatible with using Panasonic or anyone else’s tech; nor does it mean that if you scratch the surface, the SL is a Panasonic. Reading through this thread, I can’t help but feel that this whole discussion is based on little more than a rumour that is analysed, seasoned with huge amounts of wishful thinking and then taken galloping down a fork and over the horizon. Past experience has been that while these good ideas and extrapolations look great, they will result in disapointment when an announcement is finally made. The June release of the M10-P is a case in point - even Leica Rumours, who many attribute more credibility to than is really deserves, was quite wrong on this release and others in the past. I’m breathing through my nose (other than for a new M-D), as I think Leica does have the ability to surprise, but I’d rather wait to be surprised than over speculate and be disappointed. The SL was developed in secret from the time the M(240) was released, and that was a lovely surprise; none of the “improvements” to that camera interest me in the least. I will watch with interest, but will only look at replacing what I have when it dies - I trust Leica to produce a camera with a similar attention to the whole user experience, compatible with my current lenses. Cheers John Edited September 22, 2018 by IkarusJohn", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/7/?tab=comments#comment-3597333", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think you’re both right, but arguing over differences in expression. it is not incompatible to either -----> position !!!  that the sl was designed from top to bottom by leica. my understanding is that the camera was designed by a different team to the m system team from the ground up. they have used panasonic and other technical skills, but to leica’s design, both in what is specified and the user interface. this has meant that, taken as a whole, the camera is leica through and through - that is not incompatible with using panasonic or anyone else’s tech; nor does it mean that if you scratch the surface, the sl is a panasonic. reading through this thread, i can’t help but feel that this whole discussion is based on little more than a rumour that is analysed, seasoned with huge amounts of wishful thinking and then taken galloping down a fork and over the horizon. past experience has been that while these good ideas and extrapolations look great, they will result in disapointment when an announcement is finally made. the june release of the m10-p is a case in point - even leica rumours, who many attribute more credibility to than is really deserves, was quite wrong on this release and others in the past. i’m breathing through my nose (other than for a new m-d), as i think leica does have the ability to surprise, but i’d rather wait to be surprised than over speculate and be disappointed. the sl was developed in secret from the time the m(240) was released, and that was a lovely surprise; none of the “improvements” to that camera interest me in the least. i will watch with interest, but will only look at replacing what i have when it dies - i trust leica to produce a camera with a similar attention to the whole user experience, compatible with my current lenses. cheers john edited september 22, 2018 by ikarusjohn", "sortedWord": "None", "identifyer": 51242, "year": "2018"}, {"Unnamed: 0": 438433, "autor": "Einst_Stein", "date": 1538239140000, "content": "For Panasonic, build L4/3 is almost piece of cake. Only to modify the mount of the existing M4/3 stuffs. The business value will be tremendous if it is aligned with its L mount FF and L mount HF. M4/3 was introduced with the promiss of smaller size and mirrorless features, but it has been exceeded by the Mirrorless HF and FF. It is facing the up hill battle to compete with Fujifilm and Sony, and soon after the Canon and Nikon mirrorless. Turning to the integrated L family can foundemantally changing its strategic position.", "link": "https://www.l-camera-forum.com/topic/289992-leica-panasonic-sigma-alliance-limited-to-ff-only/?tab=comments#comment-3602861", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "for panasonic, build l4/3 is almost piece of cake. only to modify the mount of the existing m4/3 stuffs. the business value will be tremendous if it is aligned with its l mount ff and l mount hf. m4/3 was introduced with the promiss of smaller size and mirrorless features, but it has been exceeded by the mirrorless hf and ff. it is facing the up hill battle to compete with fujifilm and sony, and soon after the canon and nikon mirrorless. turning to the integrated l family can foundemantally changing its strategic -----> position !!! .", "sortedWord": "None", "identifyer": 51675, "year": "2018"}, {"Unnamed: 0": 442680, "autor": "AlexNOR", "date": 1525087200000, "content": "Dougg, The video feature is never really completely off. The way it works is linked to the Mode Lock Photo/Video setting and the display mode (you toggle between these by pressing the SET button). Mode Lock Photo/Video Off: Press the video record button in any display mode to start recording video. Mode Lock Photo/Video On: Video recording is only possible when the camera is in the video display mode. But when in video display mode the shutter button will also trigger video recording. The video display mode is the one where the frame is slightly smaller and all the settings are positioned on the outside. Hope this helps.", "link": "https://www.l-camera-forum.com/topic/283948-what-are-your-default-settings-on-your-q/?tab=comments#comment-3509570", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "dougg, the video feature is never really completely off. the way it works is linked to the mode lock photo/video setting and the display mode (you toggle between these by pressing the set button). mode lock photo/video off: press the video record button in any display mode to start recording video. mode lock photo/video on: video recording is only possible when the camera is in the video display mode. but when in video display mode the shutter button will also trigger video recording. the video display mode is the one where the frame is slightly smaller and all the settings are -----> positioned !!!  on the outside. hope this helps.", "sortedWord": "None", "identifyer": 6058, "year": "2018"}, {"Unnamed: 0": 442930, "autor": "Leica Guy", "date": 1544452140000, "content": " Well bummer. I have no 3/4 push position on my camera. Its either half way down or it causes the shutter to trip when I push a little harder. You may very well be right and need to send / take it in to Leica. New? Under warranty? I’d try manually focusing then back to auto just to cycle everything in the lens. At this point I’m at a loss to help. Good luck. Its a big disappointment that your camera came this way. Honest, most of the Q users have very positive things to say about the canera. I might try reloading the latest 3.0 firmware. I’m not sure how to do that, but I’d download the firmware and go through the standard upgrade process Good luck. Dan Edited December 10, 2018 by Infiniumguy", "link": "https://www.l-camera-forum.com/topic/292183-af-not-locking-properly/?tab=comments#comment-3645024", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " well bummer. i have no 3/4 push -----> position !!!  on my camera. its either half way down or it causes the shutter to trip when i push a little harder. you may very well be right and need to send / take it in to leica. new? under warranty? i’d try manually focusing then back to auto just to cycle everything in the lens. at this point i’m at a loss to help. good luck. its a big disappointment that your camera came this way. honest, most of the q users have very positive things to say about the canera. i might try reloading the latest 3.0 firmware. i’m not sure how to do that, but i’d download the firmware and go through the standard upgrade process good luck. dan edited december 10, 2018 by infiniumguy", "sortedWord": "None", "identifyer": 6308, "year": "2018"}, {"Unnamed: 0": 442931, "autor": "sweh", "date": 1544452500000, "content": "vor 2 Minuten schrieb Infiniumguy: Well bummer. I have no 3/4 push position on my camera. Its either half way down or it causes the shutter to trip when I push a little harder. You may very well be right and need to send / take it in to Leica. New? Under warranty? I’d try manually focusing then back to auto just to cycle everything in the lens. At this point I’m at a loss to help. Good luck. Its a big disappointment that your camera came this way. Honest, most of the Q users have very positive things to say about the canera. Good luck. Dan You saved my day! Shifting the camera to manual focus and then back to AF solved the problem. The focus now is locked until the camera takes the picture. Thanks a lot for that hint! The camera is absolutely new, brought it last friday, produced end november. I really could not imagine a real issue with the camera.", "link": "https://www.l-camera-forum.com/topic/292183-af-not-locking-properly/?tab=comments#comment-3645029", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "vor 2 minuten schrieb infiniumguy: well bummer. i have no 3/4 push -----> position !!!  on my camera. its either half way down or it causes the shutter to trip when i push a little harder. you may very well be right and need to send / take it in to leica. new? under warranty? i’d try manually focusing then back to auto just to cycle everything in the lens. at this point i’m at a loss to help. good luck. its a big disappointment that your camera came this way. honest, most of the q users have very positive things to say about the canera. good luck. dan you saved my day! shifting the camera to manual focus and then back to af solved the problem. the focus now is locked until the camera takes the picture. thanks a lot for that hint! the camera is absolutely new, brought it last friday, produced end november. i really could not imagine a real issue with the camera.", "sortedWord": "None", "identifyer": 6309, "year": "2018"}, {"Unnamed: 0": 442935, "autor": "Leica Guy", "date": 1545839400000, "content": "4 hours ago, Benchjto said: Same issue on my Q-P. AF is not locked on half press. AF is set to AFs, aperture priority, AF mode \"1 point\"... Did you try manual focus then back to the auto focus position on the lens? That’s my first guess. Is it in macro mode?", "link": "https://www.l-camera-forum.com/topic/292183-af-not-locking-properly/?tab=comments#comment-3653280", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "4 hours ago, benchjto said: same issue on my q-p. af is not locked on half press. af is set to afs, aperture priority, af mode \"1 point\"... did you try manual focus then back to the auto focus -----> position !!!  on the lens? that’s my first guess. is it in macro mode?", "sortedWord": "None", "identifyer": 6313, "year": "2018"}, {"Unnamed: 0": 445032, "autor": "Bart van Hofwegen", "date": 1516218720000, "content": "Hi Krusty, first of all thank you for the effort of writing Leica. What amazes me is that you received a reply. What, unfortunately, does not amaze me at all is the reply itself. They describe a behavior without mentioning the exact values for ISO, Aperture and Shutter speed and how they interact but simply say this behavior is \"so gewünscht\". The latter raises a question on my part: \"so gewünscht\", by whom? Not me, and I cannot really imagine anyone who would want to have the way it is right now. I have a lot of camera's on which I use auto ISO, but not the Q. It is not completely useless in general I guess, but utterly useless for me. As a result, I hardly use the Q in low light situations where I want to be sure shutter speed does not drop below a certain limit that is already low. What use is the OIS if you cannot have this? What is the use of 1/60 when setting a high ISO limit and lower when setting a lower ISO ??? This puzzles me the most... what the **** is the rationale behind this? Like I said I own many camera's, they all have their quirks and misses, but this is more than that, it is a failure. On my list of idiotic issues with firmware, this has a very high position. There is no excuse. On my list of reasons not to recommend the Q to certain types of shooters, this holds a high position also. But: I will now also write them myself, and maybe other readers who agree with you and me should do that too. I do not believe we will get what we want, but at least then we tried. I will post any answers I get here. Again, thanks for the effort!", "link": "https://www.l-camera-forum.com/topic/266969-leica-q-auto-iso-question/?tab=comments#comment-3442354", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi krusty, first of all thank you for the effort of writing leica. what amazes me is that you received a reply. what, unfortunately, does not amaze me at all is the reply itself. they describe a behavior without mentioning the exact values for iso, aperture and shutter speed and how they interact but simply say this behavior is \"so gewünscht\". the latter raises a question on my part: \"so gewünscht\", by whom? not me, and i cannot really imagine anyone who would want to have the way it is right now. i have a lot of camera's on which i use auto iso, but not the q. it is not completely useless in general i guess, but utterly useless for me. as a result, i hardly use the q in low light situations where i want to be sure shutter speed does not drop below a certain limit that is already low. what use is the ois if you cannot have this? what is the use of 1/60 when setting a high iso limit and lower when setting a lower iso ??? this puzzles me the most... what the **** is the rationale behind this? like i said i own many camera's, they all have their quirks and misses, but this is more than that, it is a failure. on my list of idiotic issues with firmware, this has a very high -----> position !!! . there is no excuse. on my list of reasons not to recommend the q to certain types of shooters, this holds a high position also. but: i will now also write them myself, and maybe other readers who agree with you and me should do that too. i do not believe we will get what we want, but at least then we tried. i will post any answers i get here. again, thanks for the effort!", "sortedWord": "None", "identifyer": 8432, "year": "2018"}, {"Unnamed: 0": 447493, "autor": "wda", "date": 1545584700000, "content": "Hugh, Hi, I agree it is more challenging using the X Vario indoors. My approach is rather different because flash is my last choice when faced with low light. First, explore the higher ISO settings to determine the the highest ISO that you find satisfactory. Set that number as your higher number when using Auto-ISO. If you can access noise-reduction software, you will possibly find you can go even higher. Next, maximise your use of the wider angle lens zoom settings. The widest angle will give you the fastest aperture, which helps in low light. The next step is to consider a small compact lightweight table tripod, such as the excellent Manfrotto Pixie or Pixie Evo. Use of such devices opens up a whole new world of indoor low light possibilities. (You do not need high ISOs when using a tripod, so set a low ISO for maximum quality) Discover the advantages of using delayed action to minimize shake when making an exposure using a tripod. If flash is essential, consider using the built-in flash purely as a trigger for remote flashes carefully positioned in or near your indoor scene. In that way you extend their coverage. I am sure other members will offer more relevant advice regarding flash unit compatibility. Once you have found a solution, try to conceal the fact that you have used flash. The ideal is to preserve the realism of available light, albeit augmented with flash illumination. I hope this helps you. Edited December 23, 2018 by wda", "link": "https://www.l-camera-forum.com/topic/292537-external-flash-on-x-vario/?tab=comments#comment-3652054", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "hugh, hi, i agree it is more challenging using the x vario indoors. my approach is rather different because flash is my last choice when faced with low light. first, explore the higher iso settings to determine the the highest iso that you find satisfactory. set that number as your higher number when using auto-iso. if you can access noise-reduction software, you will possibly find you can go even higher. next, maximise your use of the wider angle lens zoom settings. the widest angle will give you the fastest aperture, which helps in low light. the next step is to consider a small compact lightweight table tripod, such as the excellent manfrotto pixie or pixie evo. use of such devices opens up a whole new world of indoor low light possibilities. (you do not need high isos when using a tripod, so set a low iso for maximum quality) discover the advantages of using delayed action to minimize shake when making an exposure using a tripod. if flash is essential, consider using the built-in flash purely as a trigger for remote flashes carefully -----> positioned !!!  in or near your indoor scene. in that way you extend their coverage. i am sure other members will offer more relevant advice regarding flash unit compatibility. once you have found a solution, try to conceal the fact that you have used flash. the ideal is to preserve the realism of available light, albeit augmented with flash illumination. i hope this helps you. edited december 23, 2018 by wda", "sortedWord": "None", "identifyer": 10969, "year": "2018"}, {"Unnamed: 0": 447703, "autor": "Trivette", "date": 1536125760000, "content": "The classic position for the left hand (in manual film cameras) is under the lens, where it can support the lens as well as operate the lens controls. This is also appropriate for the X Vario. There is then no need for additional support for the right hand. I use a hand grip for additional stability, not support. In addition, you will look more like a professional than a tourist with a point-and-shoot. (Just kidding. --img--  ) Edited September 5, 2018 by Trivette", "link": "https://www.l-camera-forum.com/topic/288282-x-vario-thumb-grip-suggestions/?tab=comments#comment-3586570", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the classic -----> position !!!  for the left hand (in manual film cameras) is under the lens, where it can support the lens as well as operate the lens controls. this is also appropriate for the x vario. there is then no need for additional support for the right hand. i use a hand grip for additional stability, not support. in addition, you will look more like a professional than a tourist with a point-and-shoot. (just kidding. --img--  ) edited september 5, 2018 by trivette", "sortedWord": "None", "identifyer": 11182, "year": "2018"}, {"Unnamed: 0": 447704, "autor": "JonVdG", "date": 1536163500000, "content": "Thanks for your reply. I apologize for not being more specific in my original post. I've been a freelance photojournalist and part-time photography instructor for about 15 years, so I'm comfortable with my shooting position. For me, it's about carrying the camera in a ready position, not inside a bag or attached to a strap. My particular type of work (and shooting style) benefits from being able to handhold the camera as much as possible. With my M8, I've found the Thumbs Up grip to be invaluable. Supposedly the Match Technical grip for the X2 might fit the XV so maybe I'll give that a try. Still wondering if anyone has tried any other third party thumb grips that work for this camera - thanks.", "link": "https://www.l-camera-forum.com/topic/288282-x-vario-thumb-grip-suggestions/?tab=comments#comment-3586944", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks for your reply. i apologize for not being more specific in my original post. i've been a freelance photojournalist and part-time photography instructor for about 15 years, so i'm comfortable with my shooting -----> position !!! . for me, it's about carrying the camera in a ready position, not inside a bag or attached to a strap. my particular type of work (and shooting style) benefits from being able to handhold the camera as much as possible. with my m8, i've found the thumbs up grip to be invaluable. supposedly the match technical grip for the x2 might fit the xv so maybe i'll give that a try. still wondering if anyone has tried any other third party thumb grips that work for this camera - thanks.", "sortedWord": "None", "identifyer": 11183, "year": "2018"}, {"Unnamed: 0": 447718, "autor": "euston", "date": 1527674280000, "content": "If you want enough background blur to make the subject stand out, there’s no question that the X Vario can help you achieve that. On the other hand, if your idea of bokeh is a background blurred to unrecognisable oblivion, you may prefer a camera with a much wider maximum aperture. The quality of background blur is a matter of personal taste but the X Vario is capable of producing more than enough acceptable blur to isolate the subject, especially if you use the 70mm lens setting with the lens wide open, get as close to your subject as possible and position your subject as far from the background as possible. One of the advantages of the excellent X Vario lens is that it can be used wide open to good effect. I don’t often do portraits but I’m attaching a botanical photo that I took to illustrate the background blur produced by the X Vario. Welcome to the forum and may the light be with you! --img-- ", "link": "https://www.l-camera-forum.com/topic/285061-bokeh-on-x-vario/?tab=comments#comment-3528218", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "if you want enough background blur to make the subject stand out, there’s no question that the x vario can help you achieve that. on the other hand, if your idea of bokeh is a background blurred to unrecognisable oblivion, you may prefer a camera with a much wider maximum aperture. the quality of background blur is a matter of personal taste but the x vario is capable of producing more than enough acceptable blur to isolate the subject, especially if you use the 70mm lens setting with the lens wide open, get as close to your subject as possible and -----> position !!!  your subject as far from the background as possible. one of the advantages of the excellent x vario lens is that it can be used wide open to good effect. i don’t often do portraits but i’m attaching a botanical photo that i took to illustrate the background blur produced by the x vario. welcome to the forum and may the light be with you! --img-- ", "sortedWord": "None", "identifyer": 11197, "year": "2018"}, {"Unnamed: 0": 452305, "autor": "war", "date": 1536683400000, "content": "Mendenhall Glacier, Alaska Here's a shot with the kit lens at 14mm (28) of Nugget Falls from the same position as the shot above. --img-- ", "link": "https://www.l-camera-forum.com/topic/286971-digilux-3-images/?tab=comments#comment-3591330", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "mendenhall glacier, alaska here's a shot with the kit lens at 14mm (28) of nugget falls from the same -----> position !!!  as the shot above. --img-- ", "sortedWord": "None", "identifyer": 15877, "year": "2018"}], "name": "positionL-Forum2018"}