{"interestingcomments": [{"Unnamed: 0": 352919, "autor": "luigi bertolotti", "date": 1408804980000, "content": "Either the M240 is devaluing fast or the M-P is overpriced...or both...--img--  Surely they have thought a lot on where setting the price of the M-P : should be priced au pair with the M, recent buyers had grumbled, and the M would become definitely obsolete (which is not... As for me, should I buy now, maybe I'd end still on a M). Imho, the price they have decided takes in consideration also the NEXT camera... They want to verify how the market does accept this increased price, to decide how to position the price of the \"new M\" to be introduced in 1 year or so from now. Edited August 23, 2014 by luigi bertolotti", "link": "https://www.l-camera-forum.com/topic/232629-the-new-leica-m-p-discreet-faster-harder/page/8/?tab=comments#comment-2655318", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "either the m240 is devaluing fast or the m-p is overpriced...or both...--img--  surely they have thought a lot on where setting the price of the m-p : should be priced au pair with the m, recent buyers had grumbled, and the m would become definitely obsolete (which is not... as for me, should i buy now, maybe i'd end still on a m). imho, the price they have decided takes in consideration also the next camera... they want to verify how the market does accept this increased price, to decide how to -----> position !!!  the price of the \"new m\" to be introduced in 1 year or so from now. edited august 23, 2014 by luigi bertolotti", "sortedWord": "None", "identifyer": 14063, "year": "2014"}, {"Unnamed: 0": 352925, "autor": "wattsy", "date": 1408806660000, "content": "Imho, the price they have decided takes in consideration also the NEXT camera... They want to verify how the market does accept this increased price, to decide how to position the price of the \"new M\" to be introduced in 1 year or so from now. Yes, that might well be the case. I remember when the M8.2 was released it was priced (in the UK) at £3,950, a full £1000 more than the RRP of the M8 (which was available at a \"street\" price of around £2,500 at that point). That helped set a marker for the release of the M9 only a year later at £4,950 or thereabouts. Maybe Leica have looked at how well the Monochrom has been selling at £6k+ and wondered whether they have been underpricing the M240?--img-- ", "link": "https://www.l-camera-forum.com/topic/232629-the-new-leica-m-p-discreet-faster-harder/page/8/?tab=comments#comment-2655344", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "imho, the price they have decided takes in consideration also the next camera... they want to verify how the market does accept this increased price, to decide how to -----> position !!!  the price of the \"new m\" to be introduced in 1 year or so from now. yes, that might well be the case. i remember when the m8.2 was released it was priced (in the uk) at £3,950, a full £1000 more than the rrp of the m8 (which was available at a \"street\" price of around £2,500 at that point). that helped set a marker for the release of the m9 only a year later at £4,950 or thereabouts. maybe leica have looked at how well the monochrom has been selling at £6k+ and wondered whether they have been underpricing the m240?--img-- ", "sortedWord": "None", "identifyer": 14069, "year": "2014"}, {"Unnamed: 0": 352930, "autor": "J12", "date": 1408810680000, "content": "I hope you'll let us know if you find a digital rangefinder camera that's technologically on a par with Leica? If not then I wish you enjoyment and satisfaction with your dSLR, mirrorless, compact, or whatever else you choose.--img--  Pete. As you know full well before writing that witty retort, there is no other game in town. But does that mean we should remain silent as customers? Customer feedback is useful even if it seems harsh. Especially for companies producing a highly priced, niche product that occupies a precarious position in the market place. Now I’m off to shoot with my dSLR, mirrorless, compact, smartphone, tablet --img-- ", "link": "https://www.l-camera-forum.com/topic/232629-the-new-leica-m-p-discreet-faster-harder/page/9/?tab=comments#comment-2655386", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i hope you'll let us know if you find a digital rangefinder camera that's technologically on a par with leica? if not then i wish you enjoyment and satisfaction with your dslr, mirrorless, compact, or whatever else you choose.--img--  pete. as you know full well before writing that witty retort, there is no other game in town. but does that mean we should remain silent as customers? customer feedback is useful even if it seems harsh. especially for companies producing a highly priced, niche product that occupies a precarious -----> position !!!  in the market place. now i’m off to shoot with my dslr, mirrorless, compact, smartphone, tablet --img-- ", "sortedWord": "None", "identifyer": 14074, "year": "2014"}, {"Unnamed: 0": 352936, "autor": "jaapv", "date": 1408813320000, "content": "As you know full well before writing that witty retort, there is no other game in town. But does that mean we should remain silent as customers? Customer feedback is useful even if it seems harsh. Especially for companies producing a highly priced, niche product that occupies a precarious position in the market place. Now I’m off to shoot with my dSLR, mirrorless, compact, smartphone, tablet --img--  The only thing that really helps for customers is not-buying. As that appears not to be happening complaining in forums is not really effective, I would say.", "link": "https://www.l-camera-forum.com/topic/232629-the-new-leica-m-p-discreet-faster-harder/page/9/?tab=comments#comment-2655422", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "as you know full well before writing that witty retort, there is no other game in town. but does that mean we should remain silent as customers? customer feedback is useful even if it seems harsh. especially for companies producing a highly priced, niche product that occupies a precarious -----> position !!!  in the market place. now i’m off to shoot with my dslr, mirrorless, compact, smartphone, tablet --img--  the only thing that really helps for customers is not-buying. as that appears not to be happening complaining in forums is not really effective, i would say.", "sortedWord": "None", "identifyer": 14080, "year": "2014"}, {"Unnamed: 0": 353016, "autor": "efreed2754", "date": 1409090700000, "content": "Thanks for posting Josh. Believe our forum members understand you will position most equipment in a positive light and thus take these types of reviews with a grain of salt just like auto, audio, camera magazines. Hey, I'd love to see the day someone's review puts it by the forum members!!! As for the preview lever, there are some who believe having it challenges their manhood. As I have stated, there are times it is useful, especially when I am shooting a classical concert and want to be sure one shot includes the entire orchestra from left to right. It could be a 50, 35 or even 24 is needed and don't want it too large to avoid excessive cropping. Please post again after donning some armor. Ed", "link": "https://www.l-camera-forum.com/topic/232629-the-new-leica-m-p-discreet-faster-harder/page/13/?tab=comments#comment-2657608", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks for posting josh. believe our forum members understand you will -----> position !!!  most equipment in a positive light and thus take these types of reviews with a grain of salt just like auto, audio, camera magazines. hey, i'd love to see the day someone's review puts it by the forum members!!! as for the preview lever, there are some who believe having it challenges their manhood. as i have stated, there are times it is useful, especially when i am shooting a classical concert and want to be sure one shot includes the entire orchestra from left to right. it could be a 50, 35 or even 24 is needed and don't want it too large to avoid excessive cropping. please post again after donning some armor. ed", "sortedWord": "None", "identifyer": 14160, "year": "2014"}, {"Unnamed: 0": 356248, "autor": "marknorton", "date": 1398273000000, "content": "I would have thought it's an absolute no-brainer for Leica to re-troduce the OUFRO because it has real use on the M Typ 240 but then I've long given up trying to understand Leica's thought processes. It is definitely the case that not every M lens can be mounted upside down on the macro adapter because the plunger which relays the focussing cam position to the camera through the adapter fouls with the focussing mount on some lenses.", "link": "https://www.l-camera-forum.com/topic/215604-90mm-macro-adapter-on-m240/?tab=comments#comment-2573676", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i would have thought it's an absolute no-brainer for leica to re-troduce the oufro because it has real use on the m typ 240 but then i've long given up trying to understand leica's thought processes. it is definitely the case that not every m lens can be mounted upside down on the macro adapter because the plunger which relays the focussing cam -----> position !!!  to the camera through the adapter fouls with the focussing mount on some lenses.", "sortedWord": "None", "identifyer": 17414, "year": "2014"}, {"Unnamed: 0": 356249, "autor": "luigi bertolotti", "date": 1398588240000, "content": "I would have thought it's an absolute no-brainer for Leica to re-troduce the OUFRO because it has real use on the M Typ 240 but then I've long given up trying to understand Leica's thought processes. It is definitely the case that not every M lens can be mounted upside down on the macro adapter because the plunger which relays the focussing cam position to the camera through the adapter fouls with the focussing mount on some lenses. I think that, being OUFRO a simple spacer, they have taken into account that any 3rd party can make one (and I got a good Chinese OUFRO, infact) ; I would be no surprised if someone (Novoflex or Chinese) will make an \"extendible OUFRO\" with helicoid... something like the old OTZFO, but with M bayonet at both sides.... it would result very useful.", "link": "https://www.l-camera-forum.com/topic/215604-90mm-macro-adapter-on-m240/?tab=comments#comment-2577033", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i would have thought it's an absolute no-brainer for leica to re-troduce the oufro because it has real use on the m typ 240 but then i've long given up trying to understand leica's thought processes. it is definitely the case that not every m lens can be mounted upside down on the macro adapter because the plunger which relays the focussing cam -----> position !!!  to the camera through the adapter fouls with the focussing mount on some lenses. i think that, being oufro a simple spacer, they have taken into account that any 3rd party can make one (and i got a good chinese oufro, infact) ; i would be no surprised if someone (novoflex or chinese) will make an \"extendible oufro\" with helicoid... something like the old otzfo, but with m bayonet at both sides.... it would result very useful.", "sortedWord": "None", "identifyer": 17415, "year": "2014"}, {"Unnamed: 0": 372263, "autor": "earleygallery", "date": 1399021380000, "content": " Hi, I found his message on this forum on the matter; \"As promised yesterday by JJ, please let me state our position about the serviceability of the M8 and M8.2 Display. First of all, we are very sorry, that some of you encountered issues with your cameras. It remains our aim to find the very best solutions to satisfy you. Please let me give you some more information and details on the display issue. The cameras with a display problem stay operational, image quality and the main functions are not affected. The effect only occurs on a single production lot of displays, both built into M8 and M8.2. The serial number of the camera doesn’t give information about the lot of the display. The lot in question was pulled out of service stock as soon as we have recognized the issue. Meanwhile the manufacturer of the LCD displays had stopped production, in general these parts have a very short life cycle and Leica did not have a possibility for additional production. As the display and the rest of the electronics are linked very much together, it was not possible to create a repair solution up to our quality requirements. The display of the M9/M9-P is a different display and is sourced from another manufacturer and is therefore not affected. For the M9 as for all our products, we are taking measures that we are able to service the camera for a period of at least ten years after production will stop. In the case that (especially electronic-) parts are no longer available, we will offer an upgrade program. As you know, we have quite a history of being able to service our products for a period much longer than that! The upgrade program will work with both a M9 or M9-P, with a slightly different premium. Please contact your local Leica Customer Care for details should you have concerns with your M8/ M8.2 display. Best regards from Solms, Stefan Daniel, Director Product Management\"", "link": "https://www.l-camera-forum.com/topic/226275-m9-longevity/page/2/?tab=comments#comment-2581322", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " hi, i found his message on this forum on the matter; \"as promised yesterday by jj, please let me state our -----> position !!!  about the serviceability of the m8 and m8.2 display. first of all, we are very sorry, that some of you encountered issues with your cameras. it remains our aim to find the very best solutions to satisfy you. please let me give you some more information and details on the display issue. the cameras with a display problem stay operational, image quality and the main functions are not affected. the effect only occurs on a single production lot of displays, both built into m8 and m8.2. the serial number of the camera doesn’t give information about the lot of the display. the lot in question was pulled out of service stock as soon as we have recognized the issue. meanwhile the manufacturer of the lcd displays had stopped production, in general these parts have a very short life cycle and leica did not have a possibility for additional production. as the display and the rest of the electronics are linked very much together, it was not possible to create a repair solution up to our quality requirements. the display of the m9/m9-p is a different display and is sourced from another manufacturer and is therefore not affected. for the m9 as for all our products, we are taking measures that we are able to service the camera for a period of at least ten years after production will stop. in the case that (especially electronic-) parts are no longer available, we will offer an upgrade program. as you know, we have quite a history of being able to service our products for a period much longer than that! the upgrade program will work with both a m9 or m9-p, with a slightly different premium. please contact your local leica customer care for details should you have concerns with your m8/ m8.2 display. best regards from solms, stefan daniel, director product management\"", "sortedWord": "None", "identifyer": 33565, "year": "2014"}, {"Unnamed: 0": 374133, "autor": "250swb", "date": 1409468580000, "content": "If light gets in it also depends on the lens design and focus of the lens. Because light creeps in around the cutout for the focusing cam in the lens flange the position and design of the rear barrel section of the lens can either fill the gap, or open it up at certain focus points. So while the weight of the lens may make a difference focusing close or to infinity may also make a difference. And some lenses have a fatter rear end than others, and this also helps act as a baffle. But ever since this thread started I've had a hair band in my camera bag and it has never let me down, and because it is only used for long exposures anyway the extra second or two fitting it makes no difference at all to the job. Steve", "link": "https://www.l-camera-forum.com/topic/212964-monochrom-long-exposure-issue/page/3/?tab=comments#comment-2660638", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "if light gets in it also depends on the lens design and focus of the lens. because light creeps in around the cutout for the focusing cam in the lens flange the -----> position !!!  and design of the rear barrel section of the lens can either fill the gap, or open it up at certain focus points. so while the weight of the lens may make a difference focusing close or to infinity may also make a difference. and some lenses have a fatter rear end than others, and this also helps act as a baffle. but ever since this thread started i've had a hair band in my camera bag and it has never let me down, and because it is only used for long exposures anyway the extra second or two fitting it makes no difference at all to the job. steve", "sortedWord": "None", "identifyer": 35439, "year": "2014"}, {"Unnamed: 0": 376880, "autor": "wattsy", "date": 1416824760000, "content": "The issue is whether the corrosion, or delamination, problem is a design fault or a quality control fault: in either case the policy stated in post #137 is inadequate and inappropriate. Also, a problem that can affect all M9-type cameras should not be addressed by Leica Camera AG in the middle of a thread on one photo forum, but in some form of communication to the owners of the cameras, as there could be a strong case for a recall, depending on the legal situation on this matter. Yes, I agree. Dropping in on the middle of an old (though ongoing) thread isn't the way to explain the problem and the new policy, though I guess doing it quietly like this lessens the chance of the inevitable shitstorm that is only now gaining traction. As far as a general recall goes, I'm not sure Leica is in a position to handle it. It seems they are already struggling to handle the current policy of replacing sensors on a case by case basis.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/11/?tab=comments#comment-2713271", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the issue is whether the corrosion, or delamination, problem is a design fault or a quality control fault: in either case the policy stated in post #137 is inadequate and inappropriate. also, a problem that can affect all m9-type cameras should not be addressed by leica camera ag in the middle of a thread on one photo forum, but in some form of communication to the owners of the cameras, as there could be a strong case for a recall, depending on the legal situation on this matter. yes, i agree. dropping in on the middle of an old (though ongoing) thread isn't the way to explain the problem and the new policy, though i guess doing it quietly like this lessens the chance of the inevitable shitstorm that is only now gaining traction. as far as a general recall goes, i'm not sure leica is in a -----> position !!!  to handle it. it seems they are already struggling to handle the current policy of replacing sensors on a case by case basis.", "sortedWord": "None", "identifyer": 38191, "year": "2014"}, {"Unnamed: 0": 376882, "autor": "Ario Arioldi", "date": 1416825300000, "content": " As far as a general recall goes, I'm not sure Leica is in a position to handle it. It seems they are already struggling to handle the current policy of replacing sensors on a case by case basis. And in any case a general recall does not make any sense if a corrosion-free solution is not available, as it seems be the case.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/12/?tab=comments#comment-2713276", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " as far as a general recall goes, i'm not sure leica is in a -----> position !!!  to handle it. it seems they are already struggling to handle the current policy of replacing sensors on a case by case basis. and in any case a general recall does not make any sense if a corrosion-free solution is not available, as it seems be the case.", "sortedWord": "None", "identifyer": 38193, "year": "2014"}, {"Unnamed: 0": 376917, "autor": "geotrupede", "date": 1416864660000, "content": "M8 stain policy offered an upgrade route (I well remember that as I have an M8 with stain). M8 stain was however not a deadly defect as the camera could still operate. Simply the preview was not as nice as it should have been. We were offered the M9 route. (Irony...) Regarding the M9 issue, I would quite welcome the possibility to move to M240 at a 'small' price, even if my M9P is not that old. The unacceptable proposition is to offer a sensor replacement when we all know (do we?) that is going to fail. This does not sound honest. Either Leica has completely lost any trace of history and ethos or perhaps the problem is not so certain and spread as we are thinking. About humidity, having read the Schott specification (see my earlier posts with links to the various PDFs), seems to me more an issue of other chemicals (not necessarily water, but acid and alkaline solutions). Please have a read before you buy a cabinet to store your cameras alongside that box of cohiba.... I mentioned earlier that the glass used should have a protective coating. If the coating is there there should not be a problem. This sounds like a gross design error. If the coating is very thin and can be wiped by friction during wet cleaning, this could be a problem which could not be foreseen at day 1. Since all cameras are cleaned (come cleaned from factory) the issue could simply start at the origin without anybody noticing. Maybe Leica only recently realised this. Perhaps the cameras are all dry cleaned now? Anyway, taking the same position from other posters, it is rather disappointing that we find out of this (is this true after all?) issue from a random post on a web site. We paid true and good money to be part of the Leica family. We are most likely registered with their database and they have addresses. Emails, etc. We should not be here guessing what the issue is and whether there will be an issue. I demand to receive direct clarification of this. Official. Personal. Direct. Clear. Hope Leica does the right thing and write each of us an email with a full detailed summary of this bizarre incident. And hopefully all of this is just internet gossip. I truly hope so... G", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/13/?tab=comments#comment-2713727", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "m8 stain policy offered an upgrade route (i well remember that as i have an m8 with stain). m8 stain was however not a deadly defect as the camera could still operate. simply the preview was not as nice as it should have been. we were offered the m9 route. (irony...) regarding the m9 issue, i would quite welcome the possibility to move to m240 at a 'small' price, even if my m9p is not that old. the unacceptable proposition is to offer a sensor replacement when we all know (do we?) that is going to fail. this does not sound honest. either leica has completely lost any trace of history and ethos or perhaps the problem is not so certain and spread as we are thinking. about humidity, having read the schott specification (see my earlier posts with links to the various pdfs), seems to me more an issue of other chemicals (not necessarily water, but acid and alkaline solutions). please have a read before you buy a cabinet to store your cameras alongside that box of cohiba.... i mentioned earlier that the glass used should have a protective coating. if the coating is there there should not be a problem. this sounds like a gross design error. if the coating is very thin and can be wiped by friction during wet cleaning, this could be a problem which could not be foreseen at day 1. since all cameras are cleaned (come cleaned from factory) the issue could simply start at the origin without anybody noticing. maybe leica only recently realised this. perhaps the cameras are all dry cleaned now? anyway, taking the same -----> position !!!  from other posters, it is rather disappointing that we find out of this (is this true after all?) issue from a random post on a web site. we paid true and good money to be part of the leica family. we are most likely registered with their database and they have addresses. emails, etc. we should not be here guessing what the issue is and whether there will be an issue. i demand to receive direct clarification of this. official. personal. direct. clear. hope leica does the right thing and write each of us an email with a full detailed summary of this bizarre incident. and hopefully all of this is just internet gossip. i truly hope so... g", "sortedWord": "None", "identifyer": 38228, "year": "2014"}, {"Unnamed: 0": 383353, "autor": "oliveoil", "date": 1403241720000, "content": " Ok. everything ready, but I need to know the angled face relative position of the plastic block respect to the framelines plane. thanks for your help", "link": "https://www.l-camera-forum.com/topic/66999-anatomy-of-the-leica-m8-framelines/page/4/?tab=comments#comment-2614424", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " ok. everything ready, but i need to know the angled face relative -----> position !!!  of the plastic block respect to the framelines plane. thanks for your help", "sortedWord": "None", "identifyer": 44753, "year": "2014"}, {"Unnamed: 0": 383354, "autor": "Shootist", "date": 1403260380000, "content": "Ok. everything ready, but I need to know the angled face relative position of the plastic block respect to the framelines plane. thanks for your help Ah you might of noticed that you haven't gotten any responses to the 3 posts you have made on this subject. I think, and or would guess, the reason for that is no one Fools with the Leica M rangefinder unless they have prior knowledge of exactly hows it works, the proper order and placement of the parts and the special tools and or equipment to work on it. Maybe you should contact a qualified Leica M rangefinder repair person whether that is at Leica or 3rd party. I would suspect that when you are done doing whatever you are doing the RF won't work properly. Best of luck to you.", "link": "https://www.l-camera-forum.com/topic/66999-anatomy-of-the-leica-m8-framelines/page/4/?tab=comments#comment-2614536", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "ok. everything ready, but i need to know the angled face relative -----> position !!!  of the plastic block respect to the framelines plane. thanks for your help ah you might of noticed that you haven't gotten any responses to the 3 posts you have made on this subject. i think, and or would guess, the reason for that is no one fools with the leica m rangefinder unless they have prior knowledge of exactly hows it works, the proper order and placement of the parts and the special tools and or equipment to work on it. maybe you should contact a qualified leica m rangefinder repair person whether that is at leica or 3rd party. i would suspect that when you are done doing whatever you are doing the rf won't work properly. best of luck to you.", "sortedWord": "None", "identifyer": 44754, "year": "2014"}, {"Unnamed: 0": 389401, "autor": "erl", "date": 1408236360000, "content": "I find rewinding my MP to be easier & quicker than my M7 as the little handle often slips out of my grasp and then whizzes around in the wrong direction, necessitating more winding to make up lost ground. Only you know which works better for you, but try positioning the forefinger of the non-winding hand gently against the knob that the winder folds into. If your hand does slip off the winder, the forefinger will work as a brake.", "link": "https://www.l-camera-forum.com/topic/231554-knob-or-lever-rewind/page/3/?tab=comments#comment-2650868", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "i find rewinding my mp to be easier & quicker than my m7 as the little handle often slips out of my grasp and then whizzes around in the wrong direction, necessitating more winding to make up lost ground. only you know which works better for you, but try -----> positioning !!!  the forefinger of the non-winding hand gently against the knob that the winder folds into. if your hand does slip off the winder, the forefinger will work as a brake.", "sortedWord": "None", "identifyer": 1856, "year": "2014"}, {"Unnamed: 0": 389700, "autor": "jmr237", "date": 1410917940000, "content": " This is surprising--apparently the new M-A does not have a passport warranty. According to B&H, this is what you get with a new M-A: Limited 3-Year Warranty While this is what you get with a new MP: 5-Year Limited Warranty 3-Year Passport Warranty Seems strange. Given the M-A's price point--only $245 less than an MP--you would think it counts as a full-fledged product that gets the passport warranty. And without the electronics of the meter, one would assume it has even fewer things that can go wrong and require warranty repair. I am excited about this camera, but I don't understand Leica's pricing and warranty choice. Either position the M-A as a simplified and economical alternative the MP, or make it an ultra-niche item that is more expensive than the MP. Putting it at $4,750 without a passport warranty strikes me as a confusing middle ground.", "link": "https://www.l-camera-forum.com/topic/234045-passport-warranty-and-product-position-of-the-m-a/?tab=comments#comment-2671635", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " this is surprising--apparently the new m-a does not have a passport warranty. according to b&h, this is what you get with a new m-a: limited 3-year warranty while this is what you get with a new mp: 5-year limited warranty 3-year passport warranty seems strange. given the m-a's price point--only $245 less than an mp--you would think it counts as a full-fledged product that gets the passport warranty. and without the electronics of the meter, one would assume it has even fewer things that can go wrong and require warranty repair. i am excited about this camera, but i don't understand leica's pricing and warranty choice. either -----> position !!!  the m-a as a simplified and economical alternative the mp, or make it an ultra-niche item that is more expensive than the mp. putting it at $4,750 without a passport warranty strikes me as a confusing middle ground.", "sortedWord": "None", "identifyer": 2155, "year": "2014"}, {"Unnamed: 0": 398380, "autor": "DTM", "date": 1416580800000, "content": "I traveled through Israel with 35 and 55mm lenses. Found myself using the 35 about 95% of the time. I also has a small high quality pocket camera, Sony RX100M2, that has a zoom lens that would reach out for that far away shot. Today I am shooting with a 50 mm APO and am selling my long range FF zoom lenses. With one lens you learn how to position yourself for the picture and not rely on the zooms to do it for you. It takes more thought and effort but to me that is what photography is all about. On future travels I will carry the 50mm Leica and the Sony. You can't get much lighter and compact than that and still get all the shots you want.", "link": "https://www.l-camera-forum.com/topic/237368-travel-lens-suggestions/?tab=comments#comment-2711389", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i traveled through israel with 35 and 55mm lenses. found myself using the 35 about 95% of the time. i also has a small high quality pocket camera, sony rx100m2, that has a zoom lens that would reach out for that far away shot. today i am shooting with a 50 mm apo and am selling my long range ff zoom lenses. with one lens you learn how to -----> position !!!  yourself for the picture and not rely on the zooms to do it for you. it takes more thought and effort but to me that is what photography is all about. on future travels i will carry the 50mm leica and the sony. you can't get much lighter and compact than that and still get all the shots you want.", "sortedWord": "None", "identifyer": 11021, "year": "2014"}, {"Unnamed: 0": 412682, "autor": "platypus", "date": 1392949260000, "content": "It arrived this morning! No humans around today for test portraits so this is the very first shot taken.....horse's teeth, spoonbill and platypus skulls at f1.4. Externally the lens is in what appears to be pristine condition. There is one tiny bit of grot visible inside which will probably not affect image quality, but we shall see. Everything is firm but not too much so, and it is lovely to focus, a lot easier than the Nocti 0.95. Continuing with that comparison it also feels appreciably lighter on the camera, lighter than I had expected. The lens hood is also a big improvement on the one on my (late) Nocti 0.95 which always seemed slightly inadequate, was sort of floppy and never wanted to stay in the \"out\" position. Obviously, for the price it was going to be a Canadian version, the serial # indicates 1982. So far so good, I think I am going to enjoy this lens very much. --img-- ", "link": "https://www.l-camera-forum.com/topic/173284-75-summilux/page/12/?tab=comments#comment-2536235", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "it arrived this morning! no humans around today for test portraits so this is the very first shot taken.....horse's teeth, spoonbill and platypus skulls at f1.4. externally the lens is in what appears to be pristine condition. there is one tiny bit of grot visible inside which will probably not affect image quality, but we shall see. everything is firm but not too much so, and it is lovely to focus, a lot easier than the nocti 0.95. continuing with that comparison it also feels appreciably lighter on the camera, lighter than i had expected. the lens hood is also a big improvement on the one on my (late) nocti 0.95 which always seemed slightly inadequate, was sort of floppy and never wanted to stay in the \"out\" -----> position !!! . obviously, for the price it was going to be a canadian version, the serial # indicates 1982. so far so good, i think i am going to enjoy this lens very much. --img-- ", "sortedWord": "None", "identifyer": 25532, "year": "2014"}, {"Unnamed: 0": 445490, "autor": "euston", "date": 1394957520000, "content": "An interesting exercise! I thought I could see a clear difference between the full size shots, one handling the colours and highlights more to my liking than the other. Then I looked at the crops and the position with respect to detail and acuity is reversed. Overall, I prefer the second shot (on the right as you look at the screen) - the greater contrast is more to my taste and it has more of a 3D quality - but which is which camera, I couldn’t say. I reckon that with different processing the shots could be made to match each other virtually exactly.", "link": "https://www.l-camera-forum.com/topic/206939-leica-x-vario-photos/page/14/?tab=comments#comment-2550636", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "an interesting exercise! i thought i could see a clear difference between the full size shots, one handling the colours and highlights more to my liking than the other. then i looked at the crops and the -----> position !!!  with respect to detail and acuity is reversed. overall, i prefer the second shot (on the right as you look at the screen) - the greater contrast is more to my taste and it has more of a 3d quality - but which is which camera, i couldn’t say. i reckon that with different processing the shots could be made to match each other virtually exactly.", "sortedWord": "None", "identifyer": 8896, "year": "2014"}, {"Unnamed: 0": 450429, "autor": "Carduelis", "date": 1410180480000, "content": "@ allamande, thanks for the post. Pity you did not connect with the XV. Many of the points raised are valid. In particular, point # 1 where you mention that the DNG files are overexposed - this has been my observation too. Yet I have not seen a single other user mention this. I therefore wonder if this is the normal situation with all XV's, or do only some XV's like yours and mine exhibit this? Would other XV users please share your experience on this issue? I do not find overexposure a problem on the X Vario because I always by default tend to shoot at -0.3 as I do on every camera I use. I think it is a straight forward work around on a camera that tends to overexpose. I do agree on point 4 on the position of the white wheel which I sometimes catch and activate the functionality associated with it when it is not required. I think the image quality is much better when imported into Lightroom than it appears from the camera. The quality appears to be similar to my Ricoh GXR with A12 mount, though images appear much sharper from the Ricoh's camera display; the Ricoh is much more responsive than the X Vario though it does not handle noise as well.", "link": "https://www.l-camera-forum.com/topic/233557-why-im-returning-the-x-vario/?tab=comments#comment-2666014", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "@ allamande, thanks for the post. pity you did not connect with the xv. many of the points raised are valid. in particular, point # 1 where you mention that the dng files are overexposed - this has been my observation too. yet i have not seen a single other user mention this. i therefore wonder if this is the normal situation with all xv's, or do only some xv's like yours and mine exhibit this? would other xv users please share your experience on this issue? i do not find overexposure a problem on the x vario because i always by default tend to shoot at -0.3 as i do on every camera i use. i think it is a straight forward work around on a camera that tends to overexpose. i do agree on point 4 on the -----> position !!!  of the white wheel which i sometimes catch and activate the functionality associated with it when it is not required. i think the image quality is much better when imported into lightroom than it appears from the camera. the quality appears to be similar to my ricoh gxr with a12 mount, though images appear much sharper from the ricoh's camera display; the ricoh is much more responsive than the x vario though it does not handle noise as well.", "sortedWord": "None", "identifyer": 13922, "year": "2014"}], "name": "positionL-Forum2014"}