{"interestingcomments": [{"Unnamed: 0": 376331, "autor": "fishblimp", "date": 1254939240000, "content": "do you have the Leica branded SF58 flash or a Metz flash (if so, which model)? I'm hoping to trade/sell my SF24d and to get an alternate flash (SF58 or one of the Metz's that work) so that I can use a Lightsphere. The SF24 only points forward and so the ability to use a Lightsphere is only possible if using an off-camera method that allows the SF24 to be positioned upward.", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/?tab=comments#comment-1066069", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "do you have the leica branded sf58 flash or a metz flash (if so, which model)? i'm hoping to trade/sell my sf24d and to get an alternate flash (sf58 or one of the metz's that work) so that i can use a lightsphere. the sf24 only points forward and so the ability to use a lightsphere is only possible if using an off-camera method that allows the sf24 to be -----> positioned !!!  upward.", "sortedWord": "None", "identifyer": 37641, "year": "2009"}, {"Unnamed: 0": 376404, "autor": "rbaron", "date": 1255130700000, "content": "can anyone comment on the SF58 diffuser (the integrated one that's an optional add-on)? I prefer my flash to be soft so I'm considering either a Gary Fong LightSphere or a homemade piece of frosted plastic (why? cuz it's able to fold up into my bag easily). But I just wondered if the integrated diffuser does the same thing that a LightSphere would? I don't think it does. I have the Fong thing and I have an SF58. I haven't performed an exact comparison test but I don't see how it could throw the same light. I do have a problem using the Fong device on my SF58. The SF58 does not like the weight of the Fong device and will not stand up straight with it on. The SF58 will not 'lock' in an upright position like my Canon flash (580EX, I think) will; it droops. --img--  --Bob", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/4/?tab=comments#comment-1068937", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "can anyone comment on the sf58 diffuser (the integrated one that's an optional add-on)? i prefer my flash to be soft so i'm considering either a gary fong lightsphere or a homemade piece of frosted plastic (why? cuz it's able to fold up into my bag easily). but i just wondered if the integrated diffuser does the same thing that a lightsphere would? i don't think it does. i have the fong thing and i have an sf58. i haven't performed an exact comparison test but i don't see how it could throw the same light. i do have a problem using the fong device on my sf58. the sf58 does not like the weight of the fong device and will not stand up straight with it on. the sf58 will not 'lock' in an upright -----> position !!!  like my canon flash (580ex, i think) will; it droops. --img--  --bob", "sortedWord": "None", "identifyer": 37714, "year": "2009"}], "name": "positionL-Forum2009"}