{"interestingcomments": [{"Unnamed: 0": 344621, "autor": "Fgcm", "date": 1575638460000, "content": " On 12/4/2019 at 12:43 PM, Daedalus2000 said: Are there any instructions on how to do that for the M10? Remove the red dot rotating it with two wooden toothpick, put a small drop of acetone on the screw to soften the glue. Wait one minute, then rotate the screw with a allen key while looking into the viewfinder. The perfect vertical alignment is very apparent, because the contrast peaks up to the maximum. Attach a piece of two sided tape on the back of the red dot and place it into its position. Easier to do than to write.", "link": "https://www.l-camera-forum.com/topic/302810-vertical-diy-rangefinder-adjustment/?tab=comments#comment-3868408", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " on 12/4/2019 at 12:43 pm, daedalus2000 said: are there any instructions on how to do that for the m10? remove the red dot rotating it with two wooden toothpick, put a small drop of acetone on the screw to soften the glue. wait one minute, then rotate the screw with a allen key while looking into the viewfinder. the perfect vertical alignment is very apparent, because the contrast peaks up to the maximum. attach a piece of two sided tape on the back of the red dot and place it into its -----> position !!! . easier to do than to write.", "sortedWord": "None", "identifyer": 5704, "year": "2019"}, {"Unnamed: 0": 344622, "autor": "Daedalus2000", "date": 1575642540000, "content": "1 hour ago, Fgcm said: Remove the red dot rotating it with two wooden toothpick, put a small drop of acetone on the screw to soften the glue. Wait one minute, then rotate the screw with a allen key while looking into the viewfinder. The perfect vertical alignment is very apparent, because the contrast peaks up to the maximum. Attach a piece of two sided tape on the back of the red dot and place it into its position. Easier to do than to write. Thank you, I will try it", "link": "https://www.l-camera-forum.com/topic/302810-vertical-diy-rangefinder-adjustment/?tab=comments#comment-3868450", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "1 hour ago, fgcm said: remove the red dot rotating it with two wooden toothpick, put a small drop of acetone on the screw to soften the glue. wait one minute, then rotate the screw with a allen key while looking into the viewfinder. the perfect vertical alignment is very apparent, because the contrast peaks up to the maximum. attach a piece of two sided tape on the back of the red dot and place it into its -----> position !!! . easier to do than to write. thank you, i will try it", "sortedWord": "None", "identifyer": 5705, "year": "2019"}, {"Unnamed: 0": 344627, "autor": "Fgcm", "date": 1575796380000, "content": "11 hours ago, Daedalus2000 said: Another thing that worried me is that in this web page http://leica.nemeng.com/034b.shtml it says \"DO NOT PUSH AGAINST THE RANGEFINDER ARM\". He is referring to older cameras which had common screws, to be adjusted with a common screwdriver. If you push, you bend the arm. With an Allen key, any damage is very unlikely and a perfect adjustment is easier, because the key is longer and stays in position. of course, while adjusting, the arm rotate slightly, but this is not a problem at all.", "link": "https://www.l-camera-forum.com/topic/302810-vertical-diy-rangefinder-adjustment/?tab=comments#comment-3869490", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "11 hours ago, daedalus2000 said: another thing that worried me is that in this web page http://leica.nemeng.com/034b.shtml it says \"do not push against the rangefinder arm\". he is referring to older cameras which had common screws, to be adjusted with a common screwdriver. if you push, you bend the arm. with an allen key, any damage is very unlikely and a perfect adjustment is easier, because the key is longer and stays in -----> position !!! . of course, while adjusting, the arm rotate slightly, but this is not a problem at all.", "sortedWord": "None", "identifyer": 5710, "year": "2019"}, {"Unnamed: 0": 344670, "autor": "pedaes", "date": 1562689860000, "content": "You can use the Menu until you get used to the dial. You can also leave the dial in the 'up' position if you change ISO frequently. It is good to have options!", "link": "https://www.l-camera-forum.com/topic/299099-m10-iso-dial-very-difficult-to-raise/?tab=comments#comment-3774726", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "you can use the menu until you get used to the dial. you can also leave the dial in the 'up' -----> position !!!  if you change iso frequently. it is good to have options!", "sortedWord": "None", "identifyer": 5755, "year": "2019"}, {"Unnamed: 0": 344684, "autor": "250swb", "date": 1562914500000, "content": "Leica users are forever looking for special techniques and solutions for achieving simple things. I wouldn't say it was forever thus, but just getting on and doing a job seems to have been replaced with either a Facebook debate or forum discussion on 'the best way' to do it. To give practical help I'd suggest employing a sound psychological principle which in this case would be to stand on your head at the same time as pulling or pushing on the knob. This will effectively make the actual pulling/pushing part seem easy and when you hopefully return to a normal upright position you'll wonder what all the fuss was about.", "link": "https://www.l-camera-forum.com/topic/299099-m10-iso-dial-very-difficult-to-raise/?tab=comments#comment-3776630", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "leica users are forever looking for special techniques and solutions for achieving simple things. i wouldn't say it was forever thus, but just getting on and doing a job seems to have been replaced with either a facebook debate or forum discussion on 'the best way' to do it. to give practical help i'd suggest employing a sound psychological principle which in this case would be to stand on your head at the same time as pulling or pushing on the knob. this will effectively make the actual pulling/pushing part seem easy and when you hopefully return to a normal upright -----> position !!!  you'll wonder what all the fuss was about.", "sortedWord": "None", "identifyer": 5769, "year": "2019"}, {"Unnamed: 0": 344702, "autor": "dlaugh", "date": 1564007340000, "content": "FYI I went to the Leica SF store today. The salesperson there confirmed my dial is unusually hard to raise and brought out another M10 to show me, and it was indeed a fair bit easier to raise. He also showed me a different way to position my fingers to raise the dial that seemed to work a bit better. Basically instead of pushing upwards from bottom he came at it from the top, pinching the dial in between two fingers and sort of lifting upwards. After some tries, that worked reasonably well for me, though jamming my thumbnail under the dial and popping it up still works best for me. To get it fixed I’d need to send it in for repairs and I I’ve got working well enough that I don’t think I will got that route.", "link": "https://www.l-camera-forum.com/topic/299099-m10-iso-dial-very-difficult-to-raise/page/2/?tab=comments#comment-3784718", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "fyi i went to the leica sf store today. the salesperson there confirmed my dial is unusually hard to raise and brought out another m10 to show me, and it was indeed a fair bit easier to raise. he also showed me a different way to -----> position !!!  my fingers to raise the dial that seemed to work a bit better. basically instead of pushing upwards from bottom he came at it from the top, pinching the dial in between two fingers and sort of lifting upwards. after some tries, that worked reasonably well for me, though jamming my thumbnail under the dial and popping it up still works best for me. to get it fixed i’d need to send it in for repairs and i i’ve got working well enough that i don’t think i will got that route.", "sortedWord": "None", "identifyer": 5787, "year": "2019"}, {"Unnamed: 0": 346970, "autor": "budjames", "date": 1564139640000, "content": "7 hours ago, Chaemono said: How’s the sound, Bud? OMG. Soooo quiet and that's with the camera up in my face as I use it. I have a second M10. I used to think that the M10 was quiet. Now my M10 is \"loud\". I might send it in for conversion later this year. The new touch screen with electronic level is nice too. I can change the metering position by just touching the screen in live view mode instead of having to use the 4-way controller. I do miss the Leica red dot though. Here are a few photos. Regards, Bud James Please check out my fine art and travel photography at www.budjames.photography or on Instagram at www.instagram.com/budjamesphoto. --img--  --img--  --img--  --img--  Edited July 26, 2019 by budjames", "link": "https://www.l-camera-forum.com/topic/297610-leica-m10-to-m10-p-conversion/page/5/?tab=comments#comment-3785426", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "7 hours ago, chaemono said: how’s the sound, bud? omg. soooo quiet and that's with the camera up in my face as i use it. i have a second m10. i used to think that the m10 was quiet. now my m10 is \"loud\". i might send it in for conversion later this year. the new touch screen with electronic level is nice too. i can change the metering -----> position !!!  by just touching the screen in live view mode instead of having to use the 4-way controller. i do miss the leica red dot though. here are a few photos. regards, bud james please check out my fine art and travel photography at www.budjames.photography or on instagram at www.instagram.com/budjamesphoto. --img--  --img--  --img--  --img--  edited july 26, 2019 by budjames", "sortedWord": "None", "identifyer": 8065, "year": "2019"}, {"Unnamed: 0": 349441, "autor": "petermullett", "date": 1566234540000, "content": "On 8/16/2019 at 7:53 PM, FrozenInTime said: This was not such a bad idea, though I would have added a few more shutter speed marks : https://uk.leica-camera.com/Photography/Leica-M/Leica-M-Special-Editions/Stealthhttps://uk.leica-camera.com/Photography/Leica-M/Leica-M-Special-Editions/Stealth --img--  The only thing I like about this is the highly visible green \"A\" on the shutter dial. I wish that all M's were marked in the same fashion instead of the near invisible Red \"A\"..........On all of my M's I've fixed a white tape arrow on the \"A\" position to make it more instantly apparent......and yes I know about the indent.", "link": "https://www.l-camera-forum.com/topic/300302-how-to-remove-white-lettering-on-m10-d/page/2/?tab=comments#comment-3801372", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on 8/16/2019 at 7:53 pm, frozenintime said: this was not such a bad idea, though i would have added a few more shutter speed marks : https://uk.leica-camera.com/photography/leica-m/leica-m-special-editions/stealthhttps://uk.leica-camera.com/photography/leica-m/leica-m-special-editions/stealth --img--  the only thing i like about this is the highly visible green \"a\" on the shutter dial. i wish that all m's were marked in the same fashion instead of the near invisible red \"a\"..........on all of my m's i've fixed a white tape arrow on the \"a\" -----> position !!!  to make it more instantly apparent......and yes i know about the indent.", "sortedWord": "None", "identifyer": 10544, "year": "2019"}, {"Unnamed: 0": 353454, "autor": "littlelio", "date": 1553835780000, "content": "17 hours ago, Et7 said: Hi thorsten and everyone, Thank you for sharing these info. Given all of your expertise on lecias, I’m curious if you think the M10-d (as in its image quality and Color rendition) is a lot better than the m-d. I’m asking this because I’m considering whether it is better to purchase the M10-d instead of the m-d even though it’s pricier. From the little that I do know, the M10-d (or M10 for that matter) - due to it having a different maestro (I) processor as opposed to the maestro I - might have more accurate Color rendition? As for the sensor, I believe the are both using the same Cmos one with minor difference in pixel count? I also know that the M10-d’s iso is a lot better and the viewfinder is larger and clearer too but I think I can do without those for a lower cost. Thank you in advance! I was in the exact same position as you months ago. Just a reminder, that you need to consider other differences between M-D and M10-D besides IQ. For example, due to the lack of menu system (M10-D has menu system, which is in the Fotos app), you can not set up lens information, which means uncoded lenses can not be recognized, which means, the in-camera processing is disabled for those lenses, which may be a big deal for wide-angled (equal or wider than 35mm) lenses. Also, M-D can only output NEF raw file but M10-D can output JPG. And M10-D can be attached with EVF for critical focusing. However, with the help of wi-fi SD card, you can still transfer images from M-D to your mobile device, however, how to view/edit the raw files can be an issue... If you can deal with these differences, then why not save those money to buy a good Leica lens?😀", "link": "https://www.l-camera-forum.com/topic/262069-i-love-my-m-d-262/page/5/?tab=comments#comment-3711616", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "17 hours ago, et7 said: hi thorsten and everyone, thank you for sharing these info. given all of your expertise on lecias, i’m curious if you think the m10-d (as in its image quality and color rendition) is a lot better than the m-d. i’m asking this because i’m considering whether it is better to purchase the m10-d instead of the m-d even though it’s pricier. from the little that i do know, the m10-d (or m10 for that matter) - due to it having a different maestro (i) processor as opposed to the maestro i - might have more accurate color rendition? as for the sensor, i believe the are both using the same cmos one with minor difference in pixel count? i also know that the m10-d’s iso is a lot better and the viewfinder is larger and clearer too but i think i can do without those for a lower cost. thank you in advance! i was in the exact same -----> position !!!  as you months ago. just a reminder, that you need to consider other differences between m-d and m10-d besides iq. for example, due to the lack of menu system (m10-d has menu system, which is in the fotos app), you can not set up lens information, which means uncoded lenses can not be recognized, which means, the in-camera processing is disabled for those lenses, which may be a big deal for wide-angled (equal or wider than 35mm) lenses. also, m-d can only output nef raw file but m10-d can output jpg. and m10-d can be attached with evf for critical focusing. however, with the help of wi-fi sd card, you can still transfer images from m-d to your mobile device, however, how to view/edit the raw files can be an issue... if you can deal with these differences, then why not save those money to buy a good leica lens?😀", "sortedWord": "None", "identifyer": 14605, "year": "2019"}, {"Unnamed: 0": 357190, "autor": "nilca", "date": 1574910720000, "content": "1 hour ago, MrQ said: Would you know if the multifunction grip version 14496 works with the M-E typ 240? Thank you. No, unfortunately it does not. The GPS is not in the M-E 240 Menu and does not put position in your pictures. Also, the USB Menu item is not present in the M-E240, so no reliable downloads via USB nor control via Image Shuttle.", "link": "https://www.l-camera-forum.com/topic/298623-new-leica-m-e-type-240/page/11/?tab=comments#comment-3863341", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "1 hour ago, mrq said: would you know if the multifunction grip version 14496 works with the m-e typ 240? thank you. no, unfortunately it does not. the gps is not in the m-e 240 menu and does not put -----> position !!!  in your pictures. also, the usb menu item is not present in the m-e240, so no reliable downloads via usb nor control via image shuttle.", "sortedWord": "None", "identifyer": 18359, "year": "2019"}, {"Unnamed: 0": 357191, "autor": "MrQ", "date": 1574915280000, "content": "1 hour ago, nilca said: No, unfortunately it does not. The GPS is not in the M-E 240 Menu and does not put position in your pictures. Also, the USB Menu item is not present in the M-E240, so no reliable downloads via USB nor control via Image Shuttle. Happy Thanksgiving and thank you for responding. Just to confirm, the grip I was referencing was model number 14496 which does not have a built-in connector unlike the 14495 version. I was curious as to whether the 14496 would \"fit\" the M-E typ 240 body, sorry for not being more clear in my original question. Best regards.", "link": "https://www.l-camera-forum.com/topic/298623-new-leica-m-e-type-240/page/11/?tab=comments#comment-3863363", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "1 hour ago, nilca said: no, unfortunately it does not. the gps is not in the m-e 240 menu and does not put -----> position !!!  in your pictures. also, the usb menu item is not present in the m-e240, so no reliable downloads via usb nor control via image shuttle. happy thanksgiving and thank you for responding. just to confirm, the grip i was referencing was model number 14496 which does not have a built-in connector unlike the 14495 version. i was curious as to whether the 14496 would \"fit\" the m-e typ 240 body, sorry for not being more clear in my original question. best regards.", "sortedWord": "None", "identifyer": 18360, "year": "2019"}, {"Unnamed: 0": 357238, "autor": "titan3025", "date": 1554193140000, "content": "For me as an M-D owner the M10-D's biggest advantages (if you really need it) is the better sensor (better ISO performance in low light) and the option to use EVFs. From an ergonomics perspective I like the M-D more than the M10-D and I think putting EV correction on the back panel is useless whereas the ISO dial on the original M-D was in a perfect position. I can understand that it was cheaper for Leica to leave the ISO dial on the M10-D where it is for the M10 but ISO is more essential for M-D shooters than EV correction and so I wish they had a dedicated design for the M10-D and not go the cheaper route to just remove the back screen. Having said all this I personally will stay with the original M-D. EVFs only real benefit is if you want to shoot with Nocitlux lenses or bad eye sight.", "link": "https://www.l-camera-forum.com/topic/293293-leica-m-d-or-m10-d/page/2/?tab=comments#comment-3714084", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "for me as an m-d owner the m10-d's biggest advantages (if you really need it) is the better sensor (better iso performance in low light) and the option to use evfs. from an ergonomics perspective i like the m-d more than the m10-d and i think putting ev correction on the back panel is useless whereas the iso dial on the original m-d was in a perfect -----> position !!! . i can understand that it was cheaper for leica to leave the iso dial on the m10-d where it is for the m10 but iso is more essential for m-d shooters than ev correction and so i wish they had a dedicated design for the m10-d and not go the cheaper route to just remove the back screen. having said all this i personally will stay with the original m-d. evfs only real benefit is if you want to shoot with nocitlux lenses or bad eye sight.", "sortedWord": "None", "identifyer": 18407, "year": "2019"}, {"Unnamed: 0": 357875, "autor": "lct", "date": 1572302640000, "content": "Firmware update 2.0.6.0 improvements according to MacFilos (link) : • Optimisation to prevent the camera controls from becoming unresponsive after a series of continuous burst photos fills the buffer. • The selected user profile will be displayed even when exposure compensation has been adjusted. Exposure compensation is no longer saved to the user profile. • Memory cards with a capacity up to 512 GB are supported. • The default file format settings upon camera reset have been changed from “JPG“ to “DNG+JPG“. • The time-out period for the last GPS position, when no GPS signal is received, has been extended to 2.5 hours (GPS is not available with the M 262). • It is now possible to display DNG files from the Leica M Monochrom (Typ 246) in all zoom steps, also with the M/M-P (Typ 240 and 262). • When using SD-cards that are too slow for movie recording, a message appears in the viewfinder display. Edited October 28, 2019 by lct", "link": "https://www.l-camera-forum.com/topic/302808-new-firmware-206/page/2/?tab=comments#comment-3843837", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "firmware update 2.0.6.0 improvements according to macfilos (link) : • optimisation to prevent the camera controls from becoming unresponsive after a series of continuous burst photos fills the buffer. • the selected user profile will be displayed even when exposure compensation has been adjusted. exposure compensation is no longer saved to the user profile. • memory cards with a capacity up to 512 gb are supported. • the default file format settings upon camera reset have been changed from “jpg“ to “dng+jpg“. • the time-out period for the last gps -----> position !!! , when no gps signal is received, has been extended to 2.5 hours (gps is not available with the m 262). • it is now possible to display dng files from the leica m monochrom (typ 246) in all zoom steps, also with the m/m-p (typ 240 and 262). • when using sd-cards that are too slow for movie recording, a message appears in the viewfinder display. edited october 28, 2019 by lct", "sortedWord": "None", "identifyer": 19052, "year": "2019"}, {"Unnamed: 0": 357876, "autor": "Exodies", "date": 1572327840000, "content": "Happy to have the GPS change. Would like the option to keep the last position until the GPS is switched off. I’m always closer to my last known position than to nowhere (coordinates 0,0,0).", "link": "https://www.l-camera-forum.com/topic/302808-new-firmware-206/page/2/?tab=comments#comment-3843948", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "happy to have the gps change. would like the option to keep the last -----> position !!!  until the gps is switched off. i’m always closer to my last known position than to nowhere (coordinates 0,0,0).", "sortedWord": "None", "identifyer": 19053, "year": "2019"}, {"Unnamed: 0": 357879, "autor": "fotomas", "date": 1572474540000, "content": "Am 28. Oktober 2019 um 23:44 schrieb lct: Firmware update 2.0.6.0 improvements according to MacFilos (link) : • The time-out period for the last GPS position, when no GPS signal is received, has been extended to 2.5 hours (GPS is not available with the M 262). They made it even worse. :( What should this be good for? If there is no signal I prefer to have no position saved then a completly wrong one. Afterwords it is impossible to tell what position is wrong and which is valid. A few FW versions before this was set to 10 minutes, but unfortunately was set back again to one hour on the next on. Now 2.5 h. You can be hundreds of miles away in 2.5 h. Would be OK if I could choose the value, but so I have to stay with my old firmware again.", "link": "https://www.l-camera-forum.com/topic/302808-new-firmware-206/page/2/?tab=comments#comment-3844946", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "am 28. oktober 2019 um 23:44 schrieb lct: firmware update 2.0.6.0 improvements according to macfilos (link) : • the time-out period for the last gps -----> position !!! , when no gps signal is received, has been extended to 2.5 hours (gps is not available with the m 262). they made it even worse. :( what should this be good for? if there is no signal i prefer to have no position saved then a completly wrong one. afterwords it is impossible to tell what position is wrong and which is valid. a few fw versions before this was set to 10 minutes, but unfortunately was set back again to one hour on the next on. now 2.5 h. you can be hundreds of miles away in 2.5 h. would be ok if i could choose the value, but so i have to stay with my old firmware again.", "sortedWord": "None", "identifyer": 19056, "year": "2019"}, {"Unnamed: 0": 357887, "autor": "terrycym", "date": 1572968940000, "content": "On 10/29/2019 at 5:44 AM, Exodies said: Happy to have the GPS change. Would like the option to keep the last position until the GPS is switched off. I’m always closer to my last known position than to nowhere (coordinates 0,0,0). Nowhere is not (0,0,0). It's off the west coast of Africa on the Equator Really annoyed that they didn't fix this - if GPS hasn't been set then the EXIF should contain <Null> for GPS data like every other camera manufacturer manages to do.", "link": "https://www.l-camera-forum.com/topic/302808-new-firmware-206/page/3/?tab=comments#comment-3848292", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on 10/29/2019 at 5:44 am, exodies said: happy to have the gps change. would like the option to keep the last -----> position !!!  until the gps is switched off. i’m always closer to my last known position than to nowhere (coordinates 0,0,0). nowhere is not (0,0,0). it's off the west coast of africa on the equator really annoyed that they didn't fix this - if gps hasn't been set then the exif should contain <null> for gps data like every other camera manufacturer manages to do.", "sortedWord": "None", "identifyer": 19064, "year": "2019"}, {"Unnamed: 0": 357949, "autor": "andybarton", "date": 1572358500000, "content": "I have finally had the chance to take the camera to Stephens for a clean. I did end up taking the camera to the US on holiday and did take about 1,000 shots with it over the two weeks. Now, I have to thank Ben for the hard work he had to put into sorting it out. The dirt and smudge on the sensor are not noticeable in most circumstances as I was lucky with their position on the sensor, but they did take a lot of getting off. As an aside, sensor cleans are f.o.c. at official Leica Stores now (at least in the UK).", "link": "https://www.l-camera-forum.com/topic/302152-looks-like-i-need-to-get-a-wet-cleaning-kit/page/2/?tab=comments#comment-3844144", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i have finally had the chance to take the camera to stephens for a clean. i did end up taking the camera to the us on holiday and did take about 1,000 shots with it over the two weeks. now, i have to thank ben for the hard work he had to put into sorting it out. the dirt and smudge on the sensor are not noticeable in most circumstances as i was lucky with their -----> position !!!  on the sensor, but they did take a lot of getting off. as an aside, sensor cleans are f.o.c. at official leica stores now (at least in the uk).", "sortedWord": "None", "identifyer": 19126, "year": "2019"}, {"Unnamed: 0": 358111, "autor": "Notaniceboy", "date": 1568398200000, "content": " Hi! I can see clearly some fungus attach to the glass near the eye piece. Right now I need to send the camera for repair due to lens reales button not working, being permanently in press position but Im kind of worry Leica won take my camera because of fungus. Has anyone send a body with fungus to be CLA before? I would love to get rid of the fungus also. Sorry about my broken English. Gus", "link": "https://www.l-camera-forum.com/topic/301581-is-this-fungus-dirt-or-scratches-merged/?tab=comments#comment-3819532", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " hi! i can see clearly some fungus attach to the glass near the eye piece. right now i need to send the camera for repair due to lens reales button not working, being permanently in press -----> position !!!  but im kind of worry leica won take my camera because of fungus. has anyone send a body with fungus to be cla before? i would love to get rid of the fungus also. sorry about my broken english. gus", "sortedWord": "None", "identifyer": 19289, "year": "2019"}, {"Unnamed: 0": 358354, "autor": "Guest", "date": 1556161080000, "content": "Have been using two MP bodies since 2005/06. Once, one of them needed factory calibration. That happened after using a DR Summicron and repeatedly switching between close and far focus positions, a process that involved some force, at least on my copy of the DR Summicron.", "link": "https://www.l-camera-forum.com/topic/296565-how-often-do-you-need-rangefinder-calibration/?tab=comments#comment-3728919", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "have been using two mp bodies since 2005/06. once, one of them needed factory calibration. that happened after using a dr summicron and repeatedly switching between close and far focus -----> positions !!! , a process that involved some force, at least on my copy of the dr summicron.", "sortedWord": "None", "identifyer": 19533, "year": "2019"}, {"Unnamed: 0": 358403, "autor": "jhluxton", "date": 1563877560000, "content": "Back in 2016 after wanting an M outfit for many years I found myself in a position to afford one. Given my budget at the time it was either going to be a new M262 or a used M240. I rationalised at the time that i didn't need live view or the movie function and bought the lower specified M262. Now here is the opportunity to obtain a M240 at a relatively low price - a price quite a bit lower than I paid for the M262. Am I cross? - No! I have seized the opportunity and ordered an ME240 - as I imagine others will have done. Sometimes it can be a bit infuriating when prices appear to come down after one has made a significant investment - but it happens everywhere. Back in 1982 I bought an Acorn BBC Model B computer. Cost £399 for processing unit and keyboard -disk drive, monitors and printers all extra! Today, whilst Acorn computers are no longer with us, one can buy a fairly well specified laptop for £399. It happens everywhere these days! If I was Neil Duncan I would shut up and go and order an ME240! 😃 John Edited July 23, 2019 by jhluxton", "link": "https://www.l-camera-forum.com/topic/299490-neil-a-duncan/page/2/?tab=comments#comment-3783727", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "back in 2016 after wanting an m outfit for many years i found myself in a -----> position !!!  to afford one. given my budget at the time it was either going to be a new m262 or a used m240. i rationalised at the time that i didn't need live view or the movie function and bought the lower specified m262. now here is the opportunity to obtain a m240 at a relatively low price - a price quite a bit lower than i paid for the m262. am i cross? - no! i have seized the opportunity and ordered an me240 - as i imagine others will have done. sometimes it can be a bit infuriating when prices appear to come down after one has made a significant investment - but it happens everywhere. back in 1982 i bought an acorn bbc model b computer. cost £399 for processing unit and keyboard -disk drive, monitors and printers all extra! today, whilst acorn computers are no longer with us, one can buy a fairly well specified laptop for £399. it happens everywhere these days! if i was neil duncan i would shut up and go and order an me240! 😃 john edited july 23, 2019 by jhluxton", "sortedWord": "None", "identifyer": 19582, "year": "2019"}, {"Unnamed: 0": 358422, "autor": "dugby", "date": 1566136680000, "content": "I can see purpose of the twin ropes. In the photo, there appears to be a black tube that coincides to the neck position, which would assist in spreading the load on one’s neck.", "link": "https://www.l-camera-forum.com/topic/300347-double-camera-strap/?tab=comments#comment-3800504", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i can see purpose of the twin ropes. in the photo, there appears to be a black tube that coincides to the neck -----> position !!! , which would assist in spreading the load on one’s neck.", "sortedWord": "None", "identifyer": 19601, "year": "2019"}, {"Unnamed: 0": 358638, "autor": "LocalHero1953", "date": 1563952260000, "content": "As a photographer, I've never used continuous mode except by accident, when it startled the life out of me. As a third party, I'm with Jaap - it's the most irritating sound one hears from another photographer. When photographing people I try to minimise my virtual 'footprint': plan the shot, get the camera ready, get into position, quickly compose/focus/expose, press the shutter and away. It's not for stealth reasons, but to be less intrusive/irritating and get more natural behaviour from my subjects. It makes them more accepting of me as a photographer when I don't irritate them. Edited July 24, 2019 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/298705-single-shutter-mode-vs-continuous/?tab=comments#comment-3784342", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "as a photographer, i've never used continuous mode except by accident, when it startled the life out of me. as a third party, i'm with jaap - it's the most irritating sound one hears from another photographer. when photographing people i try to minimise my virtual 'footprint': plan the shot, get the camera ready, get into -----> position !!! , quickly compose/focus/expose, press the shutter and away. it's not for stealth reasons, but to be less intrusive/irritating and get more natural behaviour from my subjects. it makes them more accepting of me as a photographer when i don't irritate them. edited july 24, 2019 by localhero1953", "sortedWord": "None", "identifyer": 19817, "year": "2019"}, {"Unnamed: 0": 358815, "autor": "_Michael", "date": 1546541520000, "content": " <edited> I will first add that I really appreciate seeing some light-hearted and less than serious responses to this thread. My opinion here will be one from the eyes and thoughts of a fairly new Leica shooter, but not a novice photographer. I've resisted posting a response because my initial reaction was not a real positive one. While I think the question may have been posted with the best of intentions, to me it simply reeks of the elitism often associated with Leica. I'm going to apologize right here and now for what I suspect could come across as somewhat aggressive and possibly mean. This is not meant to be a personal attack. We need more encouragement and collaboration in this world don't we? Why does there have to be an assumed level of knowledge? Did the great masters through the decades start with something else to hone their craft? (maybe?) In another response it was suggested that one might not \"get the most out of\" the gear without some knowledge. I actually find it a bit refreshing that a complete novice shooter would desire to buy this very basically equipped gear to learn on. Why shouldn't they learn via the basic, core essentials of what photography is? Learn the craft and not rely on the computer between your eye and the world to make decisions for you. That approach is SO easy to do in this world of instant gratification and life at 144 characters. The first person mentioned; See my previous comment. Once again, why does it matter and why should there be any qualification gate? This will touch on a far different subject but some people will simply buy what they perceive to be \"the best\". They want to be part of the elite. The special. The cool-kids. Etc. Leica has a well deserved reputation for being among the best in the world. The legacy, the storied photographers who use the gear and timeless results all lead to that place of indeed being something special. But again, who cares? Sure, that gear may never be used but does it matter? Let them purchase all they want and celebrate it. If Leica sales slip away what will be left? For the second person; Again, what does it matter? Why assume they aren't using the gear because it’s a big lens? Maybe there is a problem with the camera. Maybe the battery is dead. Maybe they didn't see anything that excited them enough to create an image. Maybe they fell and hurt their shoulder and it's physically painful to even lift it. I offer those examples of things I have experienced personally. I can also tell you I've walked around an entire day, or dayS even without shooting a single frame. I've done it with small gear, and I've done it with large pro-body Canon gear and big lenses. I apologize for what some might call a rant, but let's offer a position of openness and community rather than one of elitism and you-aren't-good-enough or skilled enough attitudes. We are all constantly learning (or should be) and we should welcome any and all who want to come along for the ride. Be it with the Rolleiflex twin-lens, the 110 instamatic, the latest Sony/Canon/Nikon/Fuji or the much desired Leica it should not matter one bit. Let's support and encourage the arts. And maybe, just maybe we can reduce the elitism perception while still maintaining the desire and mystic of the amazing Leica solutions. I jumped in and find it to be incredibly refreshing, and desires for more still exist but are much more easily satiated by knowing I don't really need it. (but bring on the M10 and 'll take it ) Everyone who has asked me about the M has been encouraged to get one for the simplicity as I hand it to them to feel the substance. I cannot stress enough how this is not meant to be a personal attack or criticism but one simply using your points as originally posted. Maybe, just maybe I've provided a viewpoint for thought...or one for laughter and scorn. Thanks for reading this far. Michael Edited January 4, 2019 by erl Edited at request of Michael", "link": "https://www.l-camera-forum.com/topic/292641-do-you-assume-a-certain-level-of-knowledge-of-a-leica-shooter/page/3/?tab=comments#comment-3657920", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " <edited> i will first add that i really appreciate seeing some light-hearted and less than serious responses to this thread. my opinion here will be one from the eyes and thoughts of a fairly new leica shooter, but not a novice photographer. i've resisted posting a response because my initial reaction was not a real positive one. while i think the question may have been posted with the best of intentions, to me it simply reeks of the elitism often associated with leica. i'm going to apologize right here and now for what i suspect could come across as somewhat aggressive and possibly mean. this is not meant to be a personal attack. we need more encouragement and collaboration in this world don't we? why does there have to be an assumed level of knowledge? did the great masters through the decades start with something else to hone their craft? (maybe?) in another response it was suggested that one might not \"get the most out of\" the gear without some knowledge. i actually find it a bit refreshing that a complete novice shooter would desire to buy this very basically equipped gear to learn on. why shouldn't they learn via the basic, core essentials of what photography is? learn the craft and not rely on the computer between your eye and the world to make decisions for you. that approach is so easy to do in this world of instant gratification and life at 144 characters. the first person mentioned; see my previous comment. once again, why does it matter and why should there be any qualification gate? this will touch on a far different subject but some people will simply buy what they perceive to be \"the best\". they want to be part of the elite. the special. the cool-kids. etc. leica has a well deserved reputation for being among the best in the world. the legacy, the storied photographers who use the gear and timeless results all lead to that place of indeed being something special. but again, who cares? sure, that gear may never be used but does it matter? let them purchase all they want and celebrate it. if leica sales slip away what will be left? for the second person; again, what does it matter? why assume they aren't using the gear because it’s a big lens? maybe there is a problem with the camera. maybe the battery is dead. maybe they didn't see anything that excited them enough to create an image. maybe they fell and hurt their shoulder and it's physically painful to even lift it. i offer those examples of things i have experienced personally. i can also tell you i've walked around an entire day, or days even without shooting a single frame. i've done it with small gear, and i've done it with large pro-body canon gear and big lenses. i apologize for what some might call a rant, but let's offer a -----> position !!!  of openness and community rather than one of elitism and you-aren't-good-enough or skilled enough attitudes. we are all constantly learning (or should be) and we should welcome any and all who want to come along for the ride. be it with the rolleiflex twin-lens, the 110 instamatic, the latest sony/canon/nikon/fuji or the much desired leica it should not matter one bit. let's support and encourage the arts. and maybe, just maybe we can reduce the elitism perception while still maintaining the desire and mystic of the amazing leica solutions. i jumped in and find it to be incredibly refreshing, and desires for more still exist but are much more easily satiated by knowing i don't really need it. (but bring on the m10 and 'll take it ) everyone who has asked me about the m has been encouraged to get one for the simplicity as i hand it to them to feel the substance. i cannot stress enough how this is not meant to be a personal attack or criticism but one simply using your points as originally posted. maybe, just maybe i've provided a viewpoint for thought...or one for laughter and scorn. thanks for reading this far. michael edited january 4, 2019 by erl edited at request of michael", "sortedWord": "None", "identifyer": 19996, "year": "2019"}, {"Unnamed: 0": 358891, "autor": "marchyman", "date": 1562265180000, "content": "Turning the camera off/on will have no effect on the mechanical linkage that makes up the rangefinder. It will effect the frame lines. I'd agree with jaapv's \"finger in front of the window\" as a more likely cause. A finger on your right hand positioned just below the speed dial will cause the focus rectangle to disappear.", "link": "https://www.l-camera-forum.com/topic/240602-leica-digital-focusing-issues/page/2/?tab=comments#comment-3771720", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "turning the camera off/on will have no effect on the mechanical linkage that makes up the rangefinder. it will effect the frame lines. i'd agree with jaapv's \"finger in front of the window\" as a more likely cause. a finger on your right hand -----> positioned !!!  just below the speed dial will cause the focus rectangle to disappear.", "sortedWord": "None", "identifyer": 20072, "year": "2019"}, {"Unnamed: 0": 359433, "autor": "M9reno", "date": 1547031720000, "content": "2 minutes ago, jaapv said: Leica didn't blame it on the users. There was one panicked (by one employee, probably) mail, which was officially retracted within the week. The email seemed to speak for Leica at the time, and was retracted (just in the sense that it was swept under the rug, and replaced by a repair or exchange programme) after the kicking and screaming in this forum got too loud to ignore. It was a bad experience which I’d like to do my best to avoid in the future, and leaving cleaning to Leica helps me in that. Having said that, I can see how my position might not work for other users, especially those who use their digital Leicas much more than I do mine.", "link": "https://www.l-camera-forum.com/topic/293060-lost-my-sensor-cleaning-virginity-today/page/2/?tab=comments#comment-3661394", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "2 minutes ago, jaapv said: leica didn't blame it on the users. there was one panicked (by one employee, probably) mail, which was officially retracted within the week. the email seemed to speak for leica at the time, and was retracted (just in the sense that it was swept under the rug, and replaced by a repair or exchange programme) after the kicking and screaming in this forum got too loud to ignore. it was a bad experience which i’d like to do my best to avoid in the future, and leaving cleaning to leica helps me in that. having said that, i can see how my -----> position !!!  might not work for other users, especially those who use their digital leicas much more than i do mine.", "sortedWord": "None", "identifyer": 20615, "year": "2019"}, {"Unnamed: 0": 359435, "autor": "jaapv", "date": 1547032560000, "content": "Just now, M9reno said: The email seemed to speak for Leica at the time, and was retracted (just in the sense that it was swept under the rug, and replaced by a repair or exchange programme) after the kicking and screaming in this forum got too loud to ignore. It was a bad experience which I’d like to do my best to avoid in the future, and leaving cleaning to Leica helps me in that. Having said that, I can see how my position might not work for other users, especially those who use their digital Leicas much more than I do mine. Well, it IS a bit overdone for me to fly into London a few times a year for a five-minute chore...", "link": "https://www.l-camera-forum.com/topic/293060-lost-my-sensor-cleaning-virginity-today/page/2/?tab=comments#comment-3661399", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "just now, m9reno said: the email seemed to speak for leica at the time, and was retracted (just in the sense that it was swept under the rug, and replaced by a repair or exchange programme) after the kicking and screaming in this forum got too loud to ignore. it was a bad experience which i’d like to do my best to avoid in the future, and leaving cleaning to leica helps me in that. having said that, i can see how my -----> position !!!  might not work for other users, especially those who use their digital leicas much more than i do mine. well, it is a bit overdone for me to fly into london a few times a year for a five-minute chore...", "sortedWord": "None", "identifyer": 20617, "year": "2019"}, {"Unnamed: 0": 359597, "autor": "Einst_Stein", "date": 1549157280000, "content": "I bought Leica caps from ebay, 10 pieces in a batch for $4.95, free shipping. It did take some time to ship (about 2~3 weeks). The caps have very good quality, totally different from something I got a couple years ago. I glue them together with the double-side foam tape, then wrap with the electric tape around. I also have the open-end covered by the Leica body cap to prevent dust into the cap, but feel it is not necessary. About the N-way turret, it is only an early idea. The biggest problem is the size and the weight when more than one lenses are on it. I also think it needs a movable part on the lens joint to position the two lenses in parallel instead of a pizza angle. The movable part may be used as part of the tilt to give it more justification. Edited February 3, 2019 by Einst_Stein", "link": "https://www.l-camera-forum.com/topic/293896-using-double-rear-cap-to-speed-up-changing-lens/?tab=comments#comment-3676864", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i bought leica caps from ebay, 10 pieces in a batch for $4.95, free shipping. it did take some time to ship (about 2~3 weeks). the caps have very good quality, totally different from something i got a couple years ago. i glue them together with the double-side foam tape, then wrap with the electric tape around. i also have the open-end covered by the leica body cap to prevent dust into the cap, but feel it is not necessary. about the n-way turret, it is only an early idea. the biggest problem is the size and the weight when more than one lenses are on it. i also think it needs a movable part on the lens joint to -----> position !!!  the two lenses in parallel instead of a pizza angle. the movable part may be used as part of the tilt to give it more justification. edited february 3, 2019 by einst_stein", "sortedWord": "None", "identifyer": 20779, "year": "2019"}, {"Unnamed: 0": 366315, "autor": "BryanRoberts", "date": 1552738380000, "content": "On 2/26/2018 at 11:49 AM, DirkR440 said: a picture that I took yesterday in Ho Chi Minh City. I arrived a bit late at my position, so it was already getting dark. But with the 6 stop ND filter on the Tri-Elmar I still managed to get one picture: --img-- Ho Chi Minh City by Dirk Raffel, auf Flickr OMGG I love the feeling of being on the other side watching the landscape and those lights!", "link": "https://www.l-camera-forum.com/topic/281818-long-exposures-with-the-mm1-60-240-sec/page/4/?tab=comments#comment-3703524", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on 2/26/2018 at 11:49 am, dirkr440 said: a picture that i took yesterday in ho chi minh city. i arrived a bit late at my -----> position !!! , so it was already getting dark. but with the 6 stop nd filter on the tri-elmar i still managed to get one picture: --img-- ho chi minh city by dirk raffel, auf flickr omgg i love the feeling of being on the other side watching the landscape and those lights!", "sortedWord": "None", "identifyer": 27584, "year": "2019"}, {"Unnamed: 0": 367607, "autor": "fotografr", "date": 1566219900000, "content": "I agree with 99% of what Adan writes in his posts on this forum. I don't completely agree about composition being limited by the camera one is using. I worked for a couple of years with the X-Pan and there were numerous times I ended up chopping off the sides of images to get rid of unwanted details. In my opinion, and in my practice, cropping is initially done in my head, not the camera. If I can't get the composition I want with the camera and lens combination I have, or because I can't quickly enough get to a more advantageous position, I have no problem with cropping in post. The cropped version of Colin's image is vastly superior to the uncropped version. Perhaps it wouldn't hold up for large printing, but it certainly does for internet viewing. Edited August 19, 2019 by fotografr", "link": "https://www.l-camera-forum.com/topic/298268-thoughts-on-cropping/page/2/?tab=comments#comment-3801195", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i agree with 99% of what adan writes in his posts on this forum. i don't completely agree about composition being limited by the camera one is using. i worked for a couple of years with the x-pan and there were numerous times i ended up chopping off the sides of images to get rid of unwanted details. in my opinion, and in my practice, cropping is initially done in my head, not the camera. if i can't get the composition i want with the camera and lens combination i have, or because i can't quickly enough get to a more advantageous -----> position !!! , i have no problem with cropping in post. the cropped version of colin's image is vastly superior to the uncropped version. perhaps it wouldn't hold up for large printing, but it certainly does for internet viewing. edited august 19, 2019 by fotografr", "sortedWord": "None", "identifyer": 28881, "year": "2019"}, {"Unnamed: 0": 368081, "autor": "Jeff S", "date": 1552579260000, "content": "I would push hard (directly or through my dealer) for free replacement given prior issue and likelihood that some others in your position have received such (and the fact that the fault is theirs, not yours). Worst case, maybe you can get the cost down (did they provide an estimate?). Squeaky wheel... Jeff Edited March 14, 2019 by Jeff S", "link": "https://www.l-camera-forum.com/topic/295078-not-corrosion-again-i-hope/?tab=comments#comment-3702350", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i would push hard (directly or through my dealer) for free replacement given prior issue and likelihood that some others in your -----> position !!!  have received such (and the fact that the fault is theirs, not yours). worst case, maybe you can get the cost down (did they provide an estimate?). squeaky wheel... jeff edited march 14, 2019 by jeff s", "sortedWord": "None", "identifyer": 29355, "year": "2019"}, {"Unnamed: 0": 368082, "autor": "Magnus_L_Andersson", "date": 1552589220000, "content": "2 hours ago, Jeff S said: I would push hard (directly or through my dealer) for free replacement given prior issue and likelihood that some others in your position have received such (and the fact that the fault is theirs, not yours). Worst case, maybe you can get the cost down (did they provide an estimate?). Squeaky wheel... Jeff They just let me know the official pricing I have seen in this forum, but told they would give an estimate after evaluating the camera. However, I’m very surprised if there is one official and one unofficial price list since there is a huge difference between €1500 and zero for replacement. Obviously there is always different pricing for nobodies and celebs, but different ones for nobodies sounds not like any good deal for them - assuming 2 bodies (M9M and MA) and 3 LUX lenses last 7 years count as good enough for special treatment. The one here who got it for free may have had a newer camera than mine from the first ‘12 batch. It puzzles me as much why the 10-D was not an option, when it’s pricing is as 10-P and their margins probably similar.", "link": "https://www.l-camera-forum.com/topic/295078-not-corrosion-again-i-hope/?tab=comments#comment-3702478", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "2 hours ago, jeff s said: i would push hard (directly or through my dealer) for free replacement given prior issue and likelihood that some others in your -----> position !!!  have received such (and the fact that the fault is theirs, not yours). worst case, maybe you can get the cost down (did they provide an estimate?). squeaky wheel... jeff they just let me know the official pricing i have seen in this forum, but told they would give an estimate after evaluating the camera. however, i’m very surprised if there is one official and one unofficial price list since there is a huge difference between €1500 and zero for replacement. obviously there is always different pricing for nobodies and celebs, but different ones for nobodies sounds not like any good deal for them - assuming 2 bodies (m9m and ma) and 3 lux lenses last 7 years count as good enough for special treatment. the one here who got it for free may have had a newer camera than mine from the first ‘12 batch. it puzzles me as much why the 10-d was not an option, when it’s pricing is as 10-p and their margins probably similar.", "sortedWord": "None", "identifyer": 29356, "year": "2019"}, {"Unnamed: 0": 369251, "autor": "escimo", "date": 1574525400000, "content": " Am 28.7.2019 um 16:30 schrieb pedaes: I think somewhere on the Forum there is advice on how you can interogate the camera to find which sensor by a code number. Hope someone can remember where to help you guys. Link or some more hints to the thread? It should be easy to get the IDs out of the firmware. https://www.l-camera-forum.com/topic/256823-m9-nach-sensortausch-plötzliches-abschalten-einschalten-nicht-mehr-möglich/?tab=comments#comment-2988868 Am 28.7.2019 um 15:53 schrieb ianman: Unless they were replaced in very late 2015, they are probably not the revised sensors. The sensor in my M9 was replaced between Aug, 25 2015 and Sep, 29 2015. Two shoots, taken with my M9 in Jan, 2019 - repeat - 2019. Added red marker to focus on the \"findings\" --img--  --img--  Could this only be dust? - I have to take a closer look onto the sensor and after that compare the results with the shots made to proof a problem exist back in 2015, just before the M9 was sent in to Leica CS/CC. https://www.l-camera-forum.com/topic/230270-umfrage-wer-hat-in-seiner-m9-me-mm-oder-m240-einen-ausgetauschten-sensor/page/117/?tab=comments#comment-2882852 I'm confused about pro/contra from the statements given here about the problem was never fixed, only recessed by changing the hole unit by affected ones. I'd have to look on other shoots on the same position to decide if it's time to send it in again, after near five years in the wild. Cheers, escimo Edited November 23, 2019 by escimo", "link": "https://www.l-camera-forum.com/topic/293305-leica-m9-corrosion-with-new-sensor/page/5/?tab=comments#comment-3860280", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " am 28.7.2019 um 16:30 schrieb pedaes: i think somewhere on the forum there is advice on how you can interogate the camera to find which sensor by a code number. hope someone can remember where to help you guys. link or some more hints to the thread? it should be easy to get the ids out of the firmware. https://www.l-camera-forum.com/topic/256823-m9-nach-sensortausch-plötzliches-abschalten-einschalten-nicht-mehr-möglich/?tab=comments#comment-2988868 am 28.7.2019 um 15:53 schrieb ianman: unless they were replaced in very late 2015, they are probably not the revised sensors. the sensor in my m9 was replaced between aug, 25 2015 and sep, 29 2015. two shoots, taken with my m9 in jan, 2019 - repeat - 2019. added red marker to focus on the \"findings\" --img--  --img--  could this only be dust? - i have to take a closer look onto the sensor and after that compare the results with the shots made to proof a problem exist back in 2015, just before the m9 was sent in to leica cs/cc. https://www.l-camera-forum.com/topic/230270-umfrage-wer-hat-in-seiner-m9-me-mm-oder-m240-einen-ausgetauschten-sensor/page/117/?tab=comments#comment-2882852 i'm confused about pro/contra from the statements given here about the problem was never fixed, only recessed by changing the hole unit by affected ones. i'd have to look on other shoots on the same -----> position !!!  to decide if it's time to send it in again, after near five years in the wild. cheers, escimo edited november 23, 2019 by escimo", "sortedWord": "None", "identifyer": 30547, "year": "2019"}, {"Unnamed: 0": 369252, "autor": "pedaes", "date": 1574526000000, "content": "8 minutes ago, escimo said: Link or some more hints to the thread? It should be easy to get the IDs out of the firmware. https://www.l-camera-forum.com/topic/256823-m9-nach-sensortausch-plötzliches-abschalten-einschalten-nicht-mehr-möglich/?tab=comments#comment-2988868 The sensor in my M9 was replaced between Aug, 25 2015 and Sep, 29 2015. Two shoots, taken with my M9 in Jan, 2019 - repeat - 2019. Added red marker to focus on the \"findings\" --img--  --img--  Could this only be dust? - I have to take a closer look onto the sensor and after that compare the results with the shots made to proof a problem exist back in 2015, just before the M9 was sent in to Leica CS/CC. https://www.l-camera-forum.com/topic/230270-umfrage-wer-hat-in-seiner-m9-me-mm-oder-m240-einen-ausgetauschten-sensor/page/117/?tab=comments#comment-2882852 I'm confused about pro/contra from the statements given here about the problem was never fixed, only recessed by changing the hole unit by affected ones. I'd have to look on other shoots on the same position to decide if it's time to send it in again, after near five years in the wild. Cheers, escimo I would think dust. I would certainly start there.", "link": "https://www.l-camera-forum.com/topic/293305-leica-m9-corrosion-with-new-sensor/page/5/?tab=comments#comment-3860285", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "8 minutes ago, escimo said: link or some more hints to the thread? it should be easy to get the ids out of the firmware. https://www.l-camera-forum.com/topic/256823-m9-nach-sensortausch-plötzliches-abschalten-einschalten-nicht-mehr-möglich/?tab=comments#comment-2988868 the sensor in my m9 was replaced between aug, 25 2015 and sep, 29 2015. two shoots, taken with my m9 in jan, 2019 - repeat - 2019. added red marker to focus on the \"findings\" --img--  --img--  could this only be dust? - i have to take a closer look onto the sensor and after that compare the results with the shots made to proof a problem exist back in 2015, just before the m9 was sent in to leica cs/cc. https://www.l-camera-forum.com/topic/230270-umfrage-wer-hat-in-seiner-m9-me-mm-oder-m240-einen-ausgetauschten-sensor/page/117/?tab=comments#comment-2882852 i'm confused about pro/contra from the statements given here about the problem was never fixed, only recessed by changing the hole unit by affected ones. i'd have to look on other shoots on the same -----> position !!!  to decide if it's time to send it in again, after near five years in the wild. cheers, escimo i would think dust. i would certainly start there.", "sortedWord": "None", "identifyer": 30548, "year": "2019"}, {"Unnamed: 0": 369253, "autor": "Ko.Fe.", "date": 1574528160000, "content": "22 minutes ago, escimo said: Link or some more hints to the thread? It should be easy to get the IDs out of the firmware. https://www.l-camera-forum.com/topic/256823-m9-nach-sensortausch-plötzliches-abschalten-einschalten-nicht-mehr-möglich/?tab=comments#comment-2988868 The sensor in my M9 was replaced between Aug, 25 2015 and Sep, 29 2015. Two shoots, taken with my M9 in Jan, 2019 - repeat - 2019. Added red marker to focus on the \"findings\" --img--  --img--  Could this only be dust? - I have to take a closer look onto the sensor and after that compare the results with the shots made to proof a problem exist back in 2015, just before the M9 was sent in to Leica CS/CC. https://www.l-camera-forum.com/topic/230270-umfrage-wer-hat-in-seiner-m9-me-mm-oder-m240-einen-ausgetauschten-sensor/page/117/?tab=comments#comment-2882852 I'm confused about pro/contra from the statements given here about the problem was never fixed, only recessed by changing the hole unit by affected ones. I'd have to look on other shoots on the same position to decide if it's time to send it in again, after near five years in the wild. Cheers, escimo Here we go again... Have you done your search before posting? It was covered many times. In 2015 Leica was using same \"corrosive\" sensors as replacement. My M-E was made in 2015, it \"corroded\" in 2017. Only recently they figured out what was going on, kept free sensor change for couple of years and more recently cowardly changed it for the price of FF digital camera. I agree with repair person what Leica Camera AG needs some multi-millions dollars lesson to learn how to run customer service. But it is not going to happen. Leica is niche product. No any other camera makers have boutique stores. Repair person brought auto industry as example. But forgot what apples aren't oranges. If something goes wrong with Chevyota then class action might happen. It is mass products. Yet, I'm not aware of class actions against Audi which makes crappy engines for decades now. Why? Maybe because car owners don't want it. It will have less prestige after class action. It feels better to have \"legendary German quality\" even if Audi engines are not German made anymore.", "link": "https://www.l-camera-forum.com/topic/293305-leica-m9-corrosion-with-new-sensor/page/5/?tab=comments#comment-3860303", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "22 minutes ago, escimo said: link or some more hints to the thread? it should be easy to get the ids out of the firmware. https://www.l-camera-forum.com/topic/256823-m9-nach-sensortausch-plötzliches-abschalten-einschalten-nicht-mehr-möglich/?tab=comments#comment-2988868 the sensor in my m9 was replaced between aug, 25 2015 and sep, 29 2015. two shoots, taken with my m9 in jan, 2019 - repeat - 2019. added red marker to focus on the \"findings\" --img--  --img--  could this only be dust? - i have to take a closer look onto the sensor and after that compare the results with the shots made to proof a problem exist back in 2015, just before the m9 was sent in to leica cs/cc. https://www.l-camera-forum.com/topic/230270-umfrage-wer-hat-in-seiner-m9-me-mm-oder-m240-einen-ausgetauschten-sensor/page/117/?tab=comments#comment-2882852 i'm confused about pro/contra from the statements given here about the problem was never fixed, only recessed by changing the hole unit by affected ones. i'd have to look on other shoots on the same -----> position !!!  to decide if it's time to send it in again, after near five years in the wild. cheers, escimo here we go again... have you done your search before posting? it was covered many times. in 2015 leica was using same \"corrosive\" sensors as replacement. my m-e was made in 2015, it \"corroded\" in 2017. only recently they figured out what was going on, kept free sensor change for couple of years and more recently cowardly changed it for the price of ff digital camera. i agree with repair person what leica camera ag needs some multi-millions dollars lesson to learn how to run customer service. but it is not going to happen. leica is niche product. no any other camera makers have boutique stores. repair person brought auto industry as example. but forgot what apples aren't oranges. if something goes wrong with chevyota then class action might happen. it is mass products. yet, i'm not aware of class actions against audi which makes crappy engines for decades now. why? maybe because car owners don't want it. it will have less prestige after class action. it feels better to have \"legendary german quality\" even if audi engines are not german made anymore.", "sortedWord": "None", "identifyer": 30549, "year": "2019"}, {"Unnamed: 0": 373561, "autor": "dave.gt", "date": 1559345640000, "content": "On 5/18/2019 at 11:37 AM, DandA said: You had asked if the M9 is still good for today? I just checked the M9's expiration date and unfortunately it expired a few days ago, so by that criteria, unfortunately it's no longer good. Of course like some food products, people often ignore expiration dates and continue to use and enjoy the product and live another day to tell about it. I'm one of those people and if the output of a RAW file (at lower ISO's) is the primary concern and objective, the M9 succeeds tremendously, providing unique, wonderful images. I certainly cherish mind when used to it's strengths. Dave (D&A) Ah, Dave, I always enjoy your humor! According to some, maybe the photos from the M9 will soon expire, too?🙄 I think this generation (or maybe all of the contemporary generations is a better term) is spoiled. In fact, David Yarrow opened his TED talk on Yourube with that exact statement. It is a good video, highly recommended. While the world was turning in 2008, and literally, new generations of Leica cameras came on the scene by 2016, I was living months at the time in hospitals and never picked up a camera to use it as intended, only as a filler for my pillow (a Bilingham Pro Hadley). So I missed the M9 generation. No problem, I could not have afforded one anyway. Now that mint M9 cameras are available with new sensors, the prices may be closer to what I can get from selling my current Nikon gear. In other words, I may actually be in a position to buy one. I just hope if I do, that my images, on the computer or in print, don't fade and disappear after a certain date as the M10 becomes old junk and tossed aside for the M11.😉", "link": "https://www.l-camera-forum.com/topic/293608-is-the-leica-m9p-sitll-good-for-today/page/2/?tab=comments#comment-3751230", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on 5/18/2019 at 11:37 am, danda said: you had asked if the m9 is still good for today? i just checked the m9's expiration date and unfortunately it expired a few days ago, so by that criteria, unfortunately it's no longer good. of course like some food products, people often ignore expiration dates and continue to use and enjoy the product and live another day to tell about it. i'm one of those people and if the output of a raw file (at lower iso's) is the primary concern and objective, the m9 succeeds tremendously, providing unique, wonderful images. i certainly cherish mind when used to it's strengths. dave (d&a) ah, dave, i always enjoy your humor! according to some, maybe the photos from the m9 will soon expire, too?🙄 i think this generation (or maybe all of the contemporary generations is a better term) is spoiled. in fact, david yarrow opened his ted talk on yourube with that exact statement. it is a good video, highly recommended. while the world was turning in 2008, and literally, new generations of leica cameras came on the scene by 2016, i was living months at the time in hospitals and never picked up a camera to use it as intended, only as a filler for my pillow (a bilingham pro hadley). so i missed the m9 generation. no problem, i could not have afforded one anyway. now that mint m9 cameras are available with new sensors, the prices may be closer to what i can get from selling my current nikon gear. in other words, i may actually be in a -----> position !!!  to buy one. i just hope if i do, that my images, on the computer or in print, don't fade and disappear after a certain date as the m10 becomes old junk and tossed aside for the m11.😉", "sortedWord": "None", "identifyer": 34866, "year": "2019"}, {"Unnamed: 0": 373938, "autor": "antigallican", "date": 1560415200000, "content": "I think the position is that in the early days they swapped the sensors like for like, then later the swapped them for non corroding sensors. My own experience bears this out. The sensor on my M9 was changed before I owned it, then when I had some work done on the camera (not sensor related) they swapped it again in 2016. There was nothing wrong with my sensor so I can only presume they changed it to the newest batch as a precaution. I wasn’t charged.", "link": "https://www.l-camera-forum.com/topic/298262-ccd-sensor/?tab=comments#comment-3758740", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i think the -----> position !!!  is that in the early days they swapped the sensors like for like, then later the swapped them for non corroding sensors. my own experience bears this out. the sensor on my m9 was changed before i owned it, then when i had some work done on the camera (not sensor related) they swapped it again in 2016. there was nothing wrong with my sensor so i can only presume they changed it to the newest batch as a precaution. i wasn’t charged.", "sortedWord": "None", "identifyer": 35244, "year": "2019"}, {"Unnamed: 0": 373941, "autor": "otto.f", "date": 1561055160000, "content": "On 6/13/2019 at 10:40 AM, antigallican said: I think the position is that in the early days they swapped the sensors like for like, then later the swapped them for non corroding sensors. My own experience bears this out. The sensor on my M9 was changed before I owned it, then when I had some work done on the camera (not sensor related) they swapped it again in 2016. There was nothing wrong with my sensor so I can only presume they changed it to the newest batch as a precaution. I wasn’t charged. About the same here", "link": "https://www.l-camera-forum.com/topic/298262-ccd-sensor/?tab=comments#comment-3763346", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on 6/13/2019 at 10:40 am, antigallican said: i think the -----> position !!!  is that in the early days they swapped the sensors like for like, then later the swapped them for non corroding sensors. my own experience bears this out. the sensor on my m9 was changed before i owned it, then when i had some work done on the camera (not sensor related) they swapped it again in 2016. there was nothing wrong with my sensor so i can only presume they changed it to the newest batch as a precaution. i wasn’t charged. about the same here", "sortedWord": "None", "identifyer": 35247, "year": "2019"}, {"Unnamed: 0": 374749, "autor": "Naampje", "date": 1547373660000, "content": "Thanks Jaap, positioning the dots was more what I meant to ask.", "link": "https://www.l-camera-forum.com/topic/292497-summilux-28mm-on-leica-m9-not-supported/page/2/?tab=comments#comment-3663675", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "thanks jaap, -----> positioning !!!  the dots was more what i meant to ask.", "sortedWord": "None", "identifyer": 36055, "year": "2019"}, {"Unnamed: 0": 374750, "autor": "lct", "date": 1547406420000, "content": "9 hours ago, Naampje said: [...] positioning the dots was more what I meant to ask. My 7artisans 35/2 was sold with drilled pits already, which doesn't seem the case for the 28/1.4 i have no experience with. I don't know if the 28/1.4's flange has a recessed part for DIY coding either. It is not necessary per se but the dots may last longer this way. For positioning the dots, i use a Match Technical coding kit personally but it is now discontinued. Doesn't work with all lenses but worth a try if you can find one. Otherwise a DIY template can be found on the web together with instructions (links below). I have no experience with it though. http://www.bophoto.com/M8/2009-01-23-M-codeing.jpghttp://bophoto.typepad.com/bophoto/2009/01/m8-coder-simple-manual-handcoding-of-m-lenses.html", "link": "https://www.l-camera-forum.com/topic/292497-summilux-28mm-on-leica-m9-not-supported/page/2/?tab=comments#comment-3663965", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "9 hours ago, naampje said: [...] -----> positioning !!!  the dots was more what i meant to ask. my 7artisans 35/2 was sold with drilled pits already, which doesn't seem the case for the 28/1.4 i have no experience with. i don't know if the 28/1.4's flange has a recessed part for diy coding either. it is not necessary per se but the dots may last longer this way. for positioning the dots, i use a match technical coding kit personally but it is now discontinued. doesn't work with all lenses but worth a try if you can find one. otherwise a diy template can be found on the web together with instructions (links below). i have no experience with it though. http://www.bophoto.com/m8/2009-01-23-m-codeing.jpghttp://bophoto.typepad.com/bophoto/2009/01/m8-coder-simple-manual-handcoding-of-m-lenses.html", "sortedWord": "None", "identifyer": 36056, "year": "2019"}, {"Unnamed: 0": 374751, "autor": "DandA", "date": 1547419200000, "content": "3 hours ago, lct said: My 7artisans 35/2 was sold with drilled pits already, which doesn't seem the case for the 28/1.4 i have no experience with. I don't know if the 28/1.4's flange has a recessed part for DIY coding either. It is not necessary per se but the dots may last longer this way. For positioning the dots, i use a Match Technical coding kit personally but it is now discontinued. Doesn't work with all lenses but worth a try if you can find one. Otherwise a DIY template can be found on the web together with instructions (links below). I have no experience with it though. http://www.bophoto.com/M8/2009-01-23-M-codeing.jpghttp://bophoto.typepad.com/bophoto/2009/01/m8-coder-simple-manual-handcoding-of-m-lenses.html The 7artisans 28mm f1.4 at this juncture, does not have any coding pits nor a recessed part for the DIY coding not to rub off. Why no pits is a mystery but even more so, why no receesed part/ring surrounding the lens mount. Either one would have been helpful and with their having such with their 35mm f2, I don't see why this changed. The self calibration of front/back focusing with this lens is both easy and a wonderful idea nd wish all rangefinder lenses would incorporate this feature. The lens deserves the accolades it has received, especially at its price point. Dave (D&A)", "link": "https://www.l-camera-forum.com/topic/292497-summilux-28mm-on-leica-m9-not-supported/page/2/?tab=comments#comment-3664104", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioning", "selectorShort": "position", "MarkedSent": "3 hours ago, lct said: my 7artisans 35/2 was sold with drilled pits already, which doesn't seem the case for the 28/1.4 i have no experience with. i don't know if the 28/1.4's flange has a recessed part for diy coding either. it is not necessary per se but the dots may last longer this way. for -----> positioning !!!  the dots, i use a match technical coding kit personally but it is now discontinued. doesn't work with all lenses but worth a try if you can find one. otherwise a diy template can be found on the web together with instructions (links below). i have no experience with it though. http://www.bophoto.com/m8/2009-01-23-m-codeing.jpghttp://bophoto.typepad.com/bophoto/2009/01/m8-coder-simple-manual-handcoding-of-m-lenses.html the 7artisans 28mm f1.4 at this juncture, does not have any coding pits nor a recessed part for the diy coding not to rub off. why no pits is a mystery but even more so, why no receesed part/ring surrounding the lens mount. either one would have been helpful and with their having such with their 35mm f2, i don't see why this changed. the self calibration of front/back focusing with this lens is both easy and a wonderful idea nd wish all rangefinder lenses would incorporate this feature. the lens deserves the accolades it has received, especially at its price point. dave (d&a)", "sortedWord": "None", "identifyer": 36057, "year": "2019"}, {"Unnamed: 0": 380944, "autor": "MoonMind", "date": 1555881720000, "content": "Since we're talking about R lenses, I'd say a Sony A7 II is probably the best choice; same resolution as the SL, but much cheaper. I keep my own A7 II around for adapting lenses to; it offers quite a lot for comparatively little money. You get the benefit of a built-in EVF over any M body - something only the SL can match. It's possible that the SL is optimised for the use of R lenses in some arcane way, but that's hard to prove, and considering the way the SL lenses are built, I'd doubt it. The A7 II does work really well with SLR lenses (and btw., getting a A7 III for that purpose is probably not worth it, so you can save some money if it's only for the purpose of adapting). Nothing against LV on the M (240) or M10 - both work well in that respect. But they're definitely not made to be used at arm's length ... and using bigger lenses in that kind of position isn't comfortable at all. Anyhow, if you can, try things out before you buy - it's worth knowing what you get. In the long run, a M or M10 might still be the better bet, especially if you also own M glass. M.", "link": "https://www.l-camera-forum.com/topic/295613-m8-or-m9-0r-other/?tab=comments#comment-3726956", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "since we're talking about r lenses, i'd say a sony a7 ii is probably the best choice; same resolution as the sl, but much cheaper. i keep my own a7 ii around for adapting lenses to; it offers quite a lot for comparatively little money. you get the benefit of a built-in evf over any m body - something only the sl can match. it's possible that the sl is optimised for the use of r lenses in some arcane way, but that's hard to prove, and considering the way the sl lenses are built, i'd doubt it. the a7 ii does work really well with slr lenses (and btw., getting a a7 iii for that purpose is probably not worth it, so you can save some money if it's only for the purpose of adapting). nothing against lv on the m (240) or m10 - both work well in that respect. but they're definitely not made to be used at arm's length ... and using bigger lenses in that kind of -----> position !!!  isn't comfortable at all. anyhow, if you can, try things out before you buy - it's worth knowing what you get. in the long run, a m or m10 might still be the better bet, especially if you also own m glass. m.", "sortedWord": "None", "identifyer": 42334, "year": "2019"}, {"Unnamed: 0": 381592, "autor": "tobey bilek", "date": 1576728120000, "content": "If you keep screwing around, you may get lucky. Get the proper Novoflex adapter. Wide angles do not foreshorten. ALL LENSES used from the SAME POSITION will be exactly the same if you crop the wide to longer focals.", "link": "https://www.l-camera-forum.com/topic/302775-m8-sa-34-21mm-r-lei-f-r-to-ltm-adaptor-and-too-short/?tab=comments#comment-3875813", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "if you keep screwing around, you may get lucky. get the proper novoflex adapter. wide angles do not foreshorten. all lenses used from the same -----> position !!!  will be exactly the same if you crop the wide to longer focals.", "sortedWord": "None", "identifyer": 42985, "year": "2019"}, {"Unnamed: 0": 381623, "autor": "tommonego@gmail.com", "date": 1571407020000, "content": "I could try Precision Camera, I also could check with Leica US, it is only an email. Youxin Ye is the go to guy here for mechanical M bodies and lenses may check with him too. I think it may be working itself out, it probably had the Voigtlander 40 on it its whole life and the frame lever never moved, flexing it a few times seem to have freed it up. I took my 90 on and off a few times seemed to move the last time, I put the 25 back on it and the frame line lever moved to a different position with extra wide frame lines in the viewfinder. May have worked it in to shape.", "link": "https://www.l-camera-forum.com/topic/302509-mechanical-repairs-on-an-m8/?tab=comments#comment-3838189", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i could try precision camera, i also could check with leica us, it is only an email. youxin ye is the go to guy here for mechanical m bodies and lenses may check with him too. i think it may be working itself out, it probably had the voigtlander 40 on it its whole life and the frame lever never moved, flexing it a few times seem to have freed it up. i took my 90 on and off a few times seemed to move the last time, i put the 25 back on it and the frame line lever moved to a different -----> position !!!  with extra wide frame lines in the viewfinder. may have worked it in to shape.", "sortedWord": "None", "identifyer": 43016, "year": "2019"}, {"Unnamed: 0": 381624, "autor": "jimbn", "date": 1571695200000, "content": " On 10/17/2019 at 9:14 PM, tommonego@gmail.com said: Bought an M8 about a month ago, really like the camera, it came with a 40 f1.4 Voigtlander. I have been using a 35 Summilux and a 25mm Canon with it, so haven't had to see the frame line any different than with wides. I put a 90 on it and lo and behold still had the wide frame lines. Started to move the frame change lever and it barely moved. After a few moves it seemed to loosen up, but still stays on the wide frame lines. Any ideas on who to send it to? I have been using YYE for my M3 but he doesn't do digital. Thanks I recognize the problem. Last month I bought a very nice M8.2. The frame change lever hardly moved and was in the 24-35 mm position. Apparently only used with a 35mm. With cautious pressure without forcing, movement started and now it works with all focal lenses. But not as buttery as with my M8 and M9-P. The M8 second-hand in 2013 received a new shutter and a complete overhaul shortly after the purchase at Leica-repair (€ 400). When traveling, two cameras, the Q2 and the M8 with 90mm, are sufficient. The IR sensitivity remains the special charm of the M8 / 8.2, but that is another thread.", "link": "https://www.l-camera-forum.com/topic/302509-mechanical-repairs-on-an-m8/?tab=comments#comment-3840049", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " on 10/17/2019 at 9:14 pm, tommonego@gmail.com said: bought an m8 about a month ago, really like the camera, it came with a 40 f1.4 voigtlander. i have been using a 35 summilux and a 25mm canon with it, so haven't had to see the frame line any different than with wides. i put a 90 on it and lo and behold still had the wide frame lines. started to move the frame change lever and it barely moved. after a few moves it seemed to loosen up, but still stays on the wide frame lines. any ideas on who to send it to? i have been using yye for my m3 but he doesn't do digital. thanks i recognize the problem. last month i bought a very nice m8.2. the frame change lever hardly moved and was in the 24-35 mm -----> position !!! . apparently only used with a 35mm. with cautious pressure without forcing, movement started and now it works with all focal lenses. but not as buttery as with my m8 and m9-p. the m8 second-hand in 2013 received a new shutter and a complete overhaul shortly after the purchase at leica-repair (€ 400). when traveling, two cameras, the q2 and the m8 with 90mm, are sufficient. the ir sensitivity remains the special charm of the m8 / 8.2, but that is another thread.", "sortedWord": "None", "identifyer": 43017, "year": "2019"}, {"Unnamed: 0": 381695, "autor": "peterm1_Leica", "date": 1569290040000, "content": "Thanks for your response. It's appreciated. I did not state the following in my original post as I did not wish to over complicate it. But since you ask....... I have had the rangefinder corrected as, at one stage, it was quite significantly back focusing with any lens I threw at it. I confirmed this by doing exactly as you suggest by shooting a wooden rule, marked with a distance scale in front of and behind the marked focus point which itself was a measured distance from the plane of the sensor. So I knew exactly how much and in which direction the focus error was. It is now, after correction, much better. I presently use various lenses as I am in the fortunate position of having been able to build up a small collection of \"using\" lenses over many years. If I find any are obviously \"off\" in their focus I cease using that lens with the M8 and instead use it with a mirrorless camera. Or I have the lens adjusted if it is clear that this is where the problem lays. BTW when I had the camera's rangefinder adjusted professionally I provided my Summicron 50mm f2 ver 3 to the technician who did the work so that lens at least was properly calibrated. The lenses I more commonly use with the M8 are: Voigtlander lenses - 35mm f1.2 ver 1; 50mm f1.1; 75mm f1.8 and some other Leica glass: Summicron 90mm f2, Tele Elmarit 90mm f2.8 and ELmarit 90mm f2.8. I accept that shooting with any lens wide open may account for some softness in images for obvious reasons. But with respect, that is not really my point - my point is more to ask if others agree that images from the M8 seem more amenable to sharpening than images that come from other system's cameras that have an AA filter (which is what I suspect may be the reason). I am also interested to see if people have found this applies even when the original DNG seems a little unsharp straight from the camera. Edited September 24, 2019 by peterm1_Leica", "link": "https://www.l-camera-forum.com/topic/301833-m8-image-sharpness/?tab=comments#comment-3825121", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks for your response. it's appreciated. i did not state the following in my original post as i did not wish to over complicate it. but since you ask....... i have had the rangefinder corrected as, at one stage, it was quite significantly back focusing with any lens i threw at it. i confirmed this by doing exactly as you suggest by shooting a wooden rule, marked with a distance scale in front of and behind the marked focus point which itself was a measured distance from the plane of the sensor. so i knew exactly how much and in which direction the focus error was. it is now, after correction, much better. i presently use various lenses as i am in the fortunate -----> position !!!  of having been able to build up a small collection of \"using\" lenses over many years. if i find any are obviously \"off\" in their focus i cease using that lens with the m8 and instead use it with a mirrorless camera. or i have the lens adjusted if it is clear that this is where the problem lays. btw when i had the camera's rangefinder adjusted professionally i provided my summicron 50mm f2 ver 3 to the technician who did the work so that lens at least was properly calibrated. the lenses i more commonly use with the m8 are: voigtlander lenses - 35mm f1.2 ver 1; 50mm f1.1; 75mm f1.8 and some other leica glass: summicron 90mm f2, tele elmarit 90mm f2.8 and elmarit 90mm f2.8. i accept that shooting with any lens wide open may account for some softness in images for obvious reasons. but with respect, that is not really my point - my point is more to ask if others agree that images from the m8 seem more amenable to sharpening than images that come from other system's cameras that have an aa filter (which is what i suspect may be the reason). i am also interested to see if people have found this applies even when the original dng seems a little unsharp straight from the camera. edited september 24, 2019 by peterm1_leica", "sortedWord": "None", "identifyer": 43088, "year": "2019"}, {"Unnamed: 0": 381698, "autor": "jaapv", "date": 1569361740000, "content": "20 hours ago, peterm1_Leica said: Thanks for your response. It's appreciated. I did not state the following in my original post as I did not wish to over complicate it. But since you ask....... I have had the rangefinder corrected as, at one stage, it was quite significantly back focusing with any lens I threw at it. I confirmed this by doing exactly as you suggest by shooting a wooden rule, marked with a distance scale in front of and behind the marked focus point which itself was a measured distance from the plane of the sensor. So I knew exactly how much and in which direction the focus error was. It is now, after correction, much better. I presently use various lenses as I am in the fortunate position of having been able to build up a small collection of \"using\" lenses over many years. If I find any are obviously \"off\" in their focus I cease using that lens with the M8 and instead use it with a mirrorless camera. Or I have the lens adjusted if it is clear that this is where the problem lays. BTW when I had the camera's rangefinder adjusted professionally I provided my Summicron 50mm f2 ver 3 to the technician who did the work so that lens at least was properly calibrated. The lenses I more commonly use with the M8 are: Voigtlander lenses - 35mm f1.2 ver 1; 50mm f1.1; 75mm f1.8 and some other Leica glass: Summicron 90mm f2, Tele Elmarit 90mm f2.8 and ELmarit 90mm f2.8. I accept that shooting with any lens wide open may account for some softness in images for obvious reasons. But with respect, that is not really my point - my point is more to ask if others agree that images from the M8 seem more amenable to sharpening than images that come from other system's cameras that have an AA filter (which is what I suspect may be the reason). I am also interested to see if people have found this applies even when the original DNG seems a little unsharp straight from the camera. It depends entirely on your sharpening technique. There is a long post on it in the M FAQ. A book to read (old, but not obsolete ) is Fraser and Schewe: Real World Image Sharpening. That is just one method, there are a host of others. I have settled on capture sharpening in ACR, creative sharpening by the sharpening brush, and output sharpening by a number of ways, either on a layer and high-pass filter, using one of the Topaz plugins, Focus Magic plugin, or the Photoshop options. It all depends on the subject matter and subject frequency, the type of blur I want to sharpen, residual image noise and whether it is for print -and print size- or web. Just slamming a single sharpening pass over your image will never work optimally. Guilty of doing so from time to time, M'lud", "link": "https://www.l-camera-forum.com/topic/301833-m8-image-sharpness/?tab=comments#comment-3825570", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "20 hours ago, peterm1_leica said: thanks for your response. it's appreciated. i did not state the following in my original post as i did not wish to over complicate it. but since you ask....... i have had the rangefinder corrected as, at one stage, it was quite significantly back focusing with any lens i threw at it. i confirmed this by doing exactly as you suggest by shooting a wooden rule, marked with a distance scale in front of and behind the marked focus point which itself was a measured distance from the plane of the sensor. so i knew exactly how much and in which direction the focus error was. it is now, after correction, much better. i presently use various lenses as i am in the fortunate -----> position !!!  of having been able to build up a small collection of \"using\" lenses over many years. if i find any are obviously \"off\" in their focus i cease using that lens with the m8 and instead use it with a mirrorless camera. or i have the lens adjusted if it is clear that this is where the problem lays. btw when i had the camera's rangefinder adjusted professionally i provided my summicron 50mm f2 ver 3 to the technician who did the work so that lens at least was properly calibrated. the lenses i more commonly use with the m8 are: voigtlander lenses - 35mm f1.2 ver 1; 50mm f1.1; 75mm f1.8 and some other leica glass: summicron 90mm f2, tele elmarit 90mm f2.8 and elmarit 90mm f2.8. i accept that shooting with any lens wide open may account for some softness in images for obvious reasons. but with respect, that is not really my point - my point is more to ask if others agree that images from the m8 seem more amenable to sharpening than images that come from other system's cameras that have an aa filter (which is what i suspect may be the reason). i am also interested to see if people have found this applies even when the original dng seems a little unsharp straight from the camera. it depends entirely on your sharpening technique. there is a long post on it in the m faq. a book to read (old, but not obsolete ) is fraser and schewe: real world image sharpening. that is just one method, there are a host of others. i have settled on capture sharpening in acr, creative sharpening by the sharpening brush, and output sharpening by a number of ways, either on a layer and high-pass filter, using one of the topaz plugins, focus magic plugin, or the photoshop options. it all depends on the subject matter and subject frequency, the type of blur i want to sharpen, residual image noise and whether it is for print -and print size- or web. just slamming a single sharpening pass over your image will never work optimally. guilty of doing so from time to time, m'lud", "sortedWord": "None", "identifyer": 43091, "year": "2019"}, {"Unnamed: 0": 381948, "autor": "pico", "date": 1549400160000, "content": "I have terrible eyesight that cannot be corrected to 20-20, and I use nothing but rangefinder or viewfinder cameras, from M2, IIIg, m4 to m10 which all have entirely inadequate viewfinders but excellent rangefinders. Optical multipliers only dim the view, narrow field of view and make things slow for me. So for the past several years I use the rangefinder to focus then quickly change eye position to use an optional shoe-mounted optical finder, usually from Voightlander. If that seems like a fuss, well it isn't really. Edited February 5, 2019 by pico", "link": "https://www.l-camera-forum.com/topic/294035-the-glasses-when-using-leicas-m/?tab=comments#comment-3678973", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i have terrible eyesight that cannot be corrected to 20-20, and i use nothing but rangefinder or viewfinder cameras, from m2, iiig, m4 to m10 which all have entirely inadequate viewfinders but excellent rangefinders. optical multipliers only dim the view, narrow field of view and make things slow for me. so for the past several years i use the rangefinder to focus then quickly change eye -----> position !!!  to use an optional shoe-mounted optical finder, usually from voightlander. if that seems like a fuss, well it isn't really. edited february 5, 2019 by pico", "sortedWord": "None", "identifyer": 43343, "year": "2019"}, {"Unnamed: 0": 381950, "autor": "mnutzer", "date": 1549405380000, "content": "vor 1 Stunde schrieb Dopaco: ... Surely you have already noticed this old Leica advertising poster?--img--  It shows the correct position of glasses when photographing with a Screw Mount Leica, namely away from the eyes up to the forehead. I was only satisfied with Screw Mount Leicas as long as I could wear contact lenses.", "link": "https://www.l-camera-forum.com/topic/294035-the-glasses-when-using-leicas-m/?tab=comments#comment-3679023", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "vor 1 stunde schrieb dopaco: ... surely you have already noticed this old leica advertising poster?--img--  it shows the correct -----> position !!!  of glasses when photographing with a screw mount leica, namely away from the eyes up to the forehead. i was only satisfied with screw mount leicas as long as i could wear contact lenses.", "sortedWord": "None", "identifyer": 43345, "year": "2019"}, {"Unnamed: 0": 382040, "autor": "-teo-", "date": 1549453500000, "content": " Today my M8 lost rangefinder coupling with Summarit-M 35/2.5. Double image is visible, but it won't move when turning the lens focusing ring. Frame lines are visible. First I checked RF window, it was clean and not blocked. Then I removed the lens and checked RF coupling arm. The arm is sticky, I can move it by finger, but it's not coming back to home position. What to do? Should I send my camera to Leica service?", "link": "https://www.l-camera-forum.com/topic/294044-m8-lost-rf-coupling-what-to-do/?tab=comments#comment-3679238", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " today my m8 lost rangefinder coupling with summarit-m 35/2.5. double image is visible, but it won't move when turning the lens focusing ring. frame lines are visible. first i checked rf window, it was clean and not blocked. then i removed the lens and checked rf coupling arm. the arm is sticky, i can move it by finger, but it's not coming back to home -----> position !!! . what to do? should i send my camera to leica service?", "sortedWord": "None", "identifyer": 43438, "year": "2019"}, {"Unnamed: 0": 390280, "autor": "Edgar1920", "date": 1550874060000, "content": "Hi guys One evidence of irregular film transport is if the cuts between the frames do not have the same position related to the perforation. If the camera works properly the cut is always in the middle between two holes. I develop an cut my films at home and never had to cut across a hole, regardless if the film was taken with a M body (1955-2011) or one of my Leica III bodies (1934). As far as I know the position between two frames is already defined like this since Barnack’s first prototype and has never been changed. The reason is that it is easier to handle the film strips if they are not cut across the hole. I do not know the exact perforation pitch (Kodak’s price list for bulk film indicates the perforation) but it should be something that the frame advance will be around 39mm. Btw: when I developed my first roll after using my 21mm Super-Angulon for the first time I was surprised of the reduced spacing. And as I changed lenses several times the spacing between two frames was irregular. Exactly as a.noctilux wrote. But as the cuts were always between tho holes I realized that the film advance mechanism is still working fine. Best regards. Frank", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/?tab=comments#comment-3689138", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi guys one evidence of irregular film transport is if the cuts between the frames do not have the same -----> position !!!  related to the perforation. if the camera works properly the cut is always in the middle between two holes. i develop an cut my films at home and never had to cut across a hole, regardless if the film was taken with a m body (1955-2011) or one of my leica iii bodies (1934). as far as i know the position between two frames is already defined like this since barnack’s first prototype and has never been changed. the reason is that it is easier to handle the film strips if they are not cut across the hole. i do not know the exact perforation pitch (kodak’s price list for bulk film indicates the perforation) but it should be something that the frame advance will be around 39mm. btw: when i developed my first roll after using my 21mm super-angulon for the first time i was surprised of the reduced spacing. and as i changed lenses several times the spacing between two frames was irregular. exactly as a.noctilux wrote. but as the cuts were always between tho holes i realized that the film advance mechanism is still working fine. best regards. frank", "sortedWord": "None", "identifyer": 2736, "year": "2019"}, {"Unnamed: 0": 390282, "autor": "Paul Robinson", "date": 1550915340000, "content": "11 hours ago, Edgar1920 said: Hi guys One evidence of irregular film transport is if the cuts between the frames do not have the same position related to the perforation. If the camera works properly the cut is always in the middle between two holes. I develop an cut my films at home and never had to cut across a hole, regardless if the film was taken with a M body (1955-2011) or one of my Leica III bodies (1934). As far as I know the position between two frames is already defined like this since Barnack’s first prototype and has never been changed. The reason is that it is easier to handle the film strips if they are not cut across the hole. I do not know the exact perforation pitch (Kodak’s price list for bulk film indicates the perforation) but it should be something that the frame advance will be around 39mm. Btw: when I developed my first roll after using my 21mm Super-Angulon for the first time I was surprised of the reduced spacing. And as I changed lenses several times the spacing between two frames was irregular. Exactly as a.noctilux wrote. But as the cuts were always between tho holes I realized that the film advance mechanism is still working fine. Best regards. Frank Thanks Frank, great point and will now check my negatives to see if the spacings coincide with the holes. Interesting to note the sos Jung’s can change dependant in the lens choice. As I use almost exclusively a 35mm this has never come up. But I may want to add another wide-angle in the future. Kind regards, Paul", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/?tab=comments#comment-3689319", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "11 hours ago, edgar1920 said: hi guys one evidence of irregular film transport is if the cuts between the frames do not have the same -----> position !!!  related to the perforation. if the camera works properly the cut is always in the middle between two holes. i develop an cut my films at home and never had to cut across a hole, regardless if the film was taken with a m body (1955-2011) or one of my leica iii bodies (1934). as far as i know the position between two frames is already defined like this since barnack’s first prototype and has never been changed. the reason is that it is easier to handle the film strips if they are not cut across the hole. i do not know the exact perforation pitch (kodak’s price list for bulk film indicates the perforation) but it should be something that the frame advance will be around 39mm. btw: when i developed my first roll after using my 21mm super-angulon for the first time i was surprised of the reduced spacing. and as i changed lenses several times the spacing between two frames was irregular. exactly as a.noctilux wrote. but as the cuts were always between tho holes i realized that the film advance mechanism is still working fine. best regards. frank thanks frank, great point and will now check my negatives to see if the spacings coincide with the holes. interesting to note the sos jung’s can change dependant in the lens choice. as i use almost exclusively a 35mm this has never come up. but i may want to add another wide-angle in the future. kind regards, paul", "sortedWord": "None", "identifyer": 2738, "year": "2019"}, {"Unnamed: 0": 390298, "autor": "harmen", "date": 1552632960000, "content": "Hi Paul, As I was changing film, I had another look at how it advances. Most importantly, you want to see that the sprockets that advance the film return to the exact same position after every advance: --img--  I also noticed that with every advance the three prongs onto which the film winds will return to just past the previous position. In the photo below, there was always one prong in the upper left position where my new film is pointing, but a slight counter clockwise change became clear after some 20 or 30 'shots'. --img--  You would be able to see if this is the case with your camera, even without film in it. All the best!", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/2/?tab=comments#comment-3702716", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hi paul, as i was changing film, i had another look at how it advances. most importantly, you want to see that the sprockets that advance the film return to the exact same -----> position !!!  after every advance: --img--  i also noticed that with every advance the three prongs onto which the film winds will return to just past the previous -----> position !!! . in the photo below, there was always one prong in the upper left position where my new film is pointing, but a slight counter clockwise change became clear after some 20 or 30 'shots'. --img--  you would be able to see if this is the case with your camera, even without film in it. all the best!", "sortedWord": "None", "identifyer": 2754, "year": "2019"}, {"Unnamed: 0": 390299, "autor": "Paul Robinson", "date": 1552745520000, "content": "On 3/15/2019 at 6:56 AM, harmen said: Hi Paul, As I was changing film, I had another look at how it advances. Most importantly, you want to see that the sprockets that advance the film return to the exact same position after every advance: --img--  I also noticed that with every advance the three prongs onto which the film winds will return to just past the previous position. In the photo below, there was always one prong in the upper left position where my new film is pointing, but a slight counter clockwise change became clear after some 20 or 30 'shots'. --img--  You would be able to see if this is the case with your camera, even without film in it. All the best! Hi Harmen, Thank you again for your added detail on your M-A. I had already checked on my replacement M-A that the film sprocket was advancing the same on each frame and it always comes back to the same position as seen in your first image. I also checked the film spool when winding on to advance the film and they appear to come back to the same position. However, they are not positioned the same way as your M-A. On my camera the prongs are positioned at 12 ‘o’ clock, 4 ‘o’clock and 8 ‘o’clock! Not sure if there is any significance in that as long as they come back to the same position every time. Regards, Paul", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/2/?tab=comments#comment-3703586", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on 3/15/2019 at 6:56 am, harmen said: hi paul, as i was changing film, i had another look at how it advances. most importantly, you want to see that the sprockets that advance the film return to the exact same -----> position !!!  after every advance: --img--  i also noticed that with every advance the three prongs onto which the film winds will return to just past the previous -----> position !!! . in the photo below, there was always one prong in the upper left position where my new film is pointing, but a slight counter clockwise change became clear after some 20 or 30 'shots'. --img--  you would be able to see if this is the case with your camera, even without film in it. all the best! hi harmen, thank you again for your added detail on your m-a. i had already checked on my replacement m-a that the film sprocket was advancing the same on each frame and it always comes back to the same position as seen in your first image. i also checked the film spool when winding on to advance the film and they appear to come back to the same position. however, they are not positioned the same way as your m-a. on my camera the prongs are positioned at 12 ‘o’ clock, 4 ‘o’clock and 8 ‘o’clock! not sure if there is any significance in that as long as they come back to the same position every time. regards, paul", "sortedWord": "None", "identifyer": 2755, "year": "2019"}, {"Unnamed: 0": 390300, "autor": "a.noctilux", "date": 1552747920000, "content": "32 minutes ago, Paul Robinson said: Hi Harmen, Thank you again for your added detail on your M-A. I had already checked on my replacement M-A that the film sprocket was advancing the same on each frame and it always comes back to the same position as seen in your first image. I also checked the film spool when winding on to advance the film and they appear to come back to the same position. However, they are not positioned the same way as your M-A. On my camera the prongs are positioned at 12 ‘o’ clock, 4 ‘o’clock and 8 ‘o’clock! Not sure if there is any significance in that as long as they come back to the same position every time. Regards, Paul Hello, Nothing wrong with what you call \"film spool\" ( second image ) that can take every possible position = try to turn it, you will see that it turns around with ease. Not the same as \"film sprocket\" (first image) which must stop always at same position (on mine at the middle) and this can not be turned ( even not a bit moving it) with one's digit.", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/2/?tab=comments#comment-3703618", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "32 minutes ago, paul robinson said: hi harmen, thank you again for your added detail on your m-a. i had already checked on my replacement m-a that the film sprocket was advancing the same on each frame and it always comes back to the same -----> position !!!  as seen in your first image. i also checked the film spool when winding on to advance the film and they appear to come back to the same position. however, they are not positioned the same way as your m-a. on my camera the prongs are positioned at 12 ‘o’ clock, 4 ‘o’clock and 8 ‘o’clock! not sure if there is any significance in that as long as they come back to the same position every time. regards, paul hello, nothing wrong with what you call \"film spool\" ( second image ) that can take every possible position = try to turn it, you will see that it turns around with ease. not the same as \"film sprocket\" (first image) which must stop always at same position (on mine at the middle) and this can not be turned ( even not a bit moving it) with one's digit.", "sortedWord": "None", "identifyer": 2756, "year": "2019"}, {"Unnamed: 0": 390302, "autor": "Paul Robinson", "date": 1552748340000, "content": "3 minutes ago, a.noctilux said: Hello, Nothing wrong with what you call \"film spool\" ( second image ) that can take every possible position = try to turn it, you will see that it turns around with ease. Not the same as \"film sprocket\" (first image) which must stop always at same position (on mine at the middle) and this can not be turned ( even not a bit moving it) with one's digit. Thanks a.noctilux, the film sprocket (as image 1 from Harmen) has a little movement it is positioned centrally and cannot be turned to the ‘next’ position. Paul", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/2/?tab=comments#comment-3703625", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "3 minutes ago, a.noctilux said: hello, nothing wrong with what you call \"film spool\" ( second image ) that can take every possible -----> position !!!  = try to turn it, you will see that it turns around with ease. not the same as \"film sprocket\" (first image) which must stop always at same position (on mine at the middle) and this can not be turned ( even not a bit moving it) with one's digit. thanks a.noctilux, the film sprocket (as image 1 from harmen) has a little movement it is positioned centrally and cannot be turned to the ‘next’ position. paul", "sortedWord": "None", "identifyer": 2758, "year": "2019"}, {"Unnamed: 0": 390303, "autor": "semi-ambivalent", "date": 1552748460000, "content": "49 minutes ago, Paul Robinson said: Hi Harmen, Thank you again for your added detail on your M-A. I had already checked on my replacement M-A that the film sprocket was advancing the same on each frame and it always comes back to the same position as seen in your first image. I also checked the film spool when winding on to advance the film and they appear to come back to the same position. However, they are not positioned the same way as your M-A. On my camera the prongs are positioned at 12 ‘o’ clock, 4 ‘o’clock and 8 ‘o’clock! Not sure if there is any significance in that as long as they come back to the same position every time. Regards, Paul As a thought experiment, the sprocket would always need to rotate X amount since it must pull the film eight perforations worth for every frame. This might be exactly one full rotation if the diameter of the sprocket is sized to do so but it is not necessary. It just needs to advance the film the same amount each time. The sprocket could be connected to a further interior gear or cam that does the actual \"measuring\" of the film's linear advance. The take-up spool does not need to do that. In fact it cannot since the effective diameter of the take-up spool changes as one wraps more film around it. Since each additional rotation of the spool has a different, increasing, circumference I don't see how it could be used to \"measure\" film advance with any consistency. One of them is clutched? In my Nikon Fs I would insert the tongue into the spool and advance the spool with my thumb to ensure it was secure and then draw the cassette across the gate to its nest on the left, with the rewind crank. That the take-up spool was clutched was easy to feel when doing this. Leica's shutter might not be so different since I believe Nikon copied Leica for the shutter in the S. I think my M-A has variable spacings. It certainly has narrower spacings than my M3. I don't care since it's not going into transparency mounts at the Kodak K-14 lab. Good luck figuring this out! Edit: With the post commit I see A. Noctilux beat me to this. And he's right too; I just tested this on my M-A. The spool turns easily, both directions. Edited March 16, 2019 by semi-ambivalent", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/2/?tab=comments#comment-3703627", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "49 minutes ago, paul robinson said: hi harmen, thank you again for your added detail on your m-a. i had already checked on my replacement m-a that the film sprocket was advancing the same on each frame and it always comes back to the same -----> position !!!  as seen in your first image. i also checked the film spool when winding on to advance the film and they appear to come back to the same position. however, they are not positioned the same way as your m-a. on my camera the prongs are positioned at 12 ‘o’ clock, 4 ‘o’clock and 8 ‘o’clock! not sure if there is any significance in that as long as they come back to the same position every time. regards, paul as a thought experiment, the sprocket would always need to rotate x amount since it must pull the film eight perforations worth for every frame. this might be exactly one full rotation if the diameter of the sprocket is sized to do so but it is not necessary. it just needs to advance the film the same amount each time. the sprocket could be connected to a further interior gear or cam that does the actual \"measuring\" of the film's linear advance. the take-up spool does not need to do that. in fact it cannot since the effective diameter of the take-up spool changes as one wraps more film around it. since each additional rotation of the spool has a different, increasing, circumference i don't see how it could be used to \"measure\" film advance with any consistency. one of them is clutched? in my nikon fs i would insert the tongue into the spool and advance the spool with my thumb to ensure it was secure and then draw the cassette across the gate to its nest on the left, with the rewind crank. that the take-up spool was clutched was easy to feel when doing this. leica's shutter might not be so different since i believe nikon copied leica for the shutter in the s. i think my m-a has variable spacings. it certainly has narrower spacings than my m3. i don't care since it's not going into transparency mounts at the kodak k-14 lab. good luck figuring this out! edit: with the post commit i see a. noctilux beat me to this. and he's right too; i just tested this on my m-a. the spool turns easily, both directions. edited march 16, 2019 by semi-ambivalent", "sortedWord": "None", "identifyer": 2759, "year": "2019"}, {"Unnamed: 0": 390304, "autor": "TomB_tx", "date": 1552750200000, "content": "As noted, the takeup spool must always be “clutched” and allowed to slip in a 35 mm camera. It is the sprocket that must pull the film through, and the spool just applies enough pull to keep the film wound on it. Notice the sprocket teeth are tapered to allow easy entry into the film holes. This could vary the position of the film slightly if the film varies in height as it passes over the sprocket. As the sprocket moves the film along the teeth effectively rise up through the holes and then back down. Perhaps the surface finish on the teeth are a bit rougher on the M-A than older cameras so the film catches a bit and rides higher at times. If the takeup spool slips too easily and doesn’t keep enough tension, it could also allow this. The guides on the camera back near the pressure plate are before the sprocket, so only the spool tension keeps the film down as it leaves the sprocket (in the reverse bend). I think there’s more room for variation than you might expect for a simple mechanism.", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/2/?tab=comments#comment-3703638", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "as noted, the takeup spool must always be “clutched” and allowed to slip in a 35 mm camera. it is the sprocket that must pull the film through, and the spool just applies enough pull to keep the film wound on it. notice the sprocket teeth are tapered to allow easy entry into the film holes. this could vary the -----> position !!!  of the film slightly if the film varies in height as it passes over the sprocket. as the sprocket moves the film along the teeth effectively rise up through the holes and then back down. perhaps the surface finish on the teeth are a bit rougher on the m-a than older cameras so the film catches a bit and rides higher at times. if the takeup spool slips too easily and doesn’t keep enough tension, it could also allow this. the guides on the camera back near the pressure plate are before the sprocket, so only the spool tension keeps the film down as it leaves the sprocket (in the reverse bend). i think there’s more room for variation than you might expect for a simple mechanism.", "sortedWord": "None", "identifyer": 2760, "year": "2019"}, {"Unnamed: 0": 390306, "autor": "Paul Robinson", "date": 1552752000000, "content": "16 minutes ago, TomB_tx said: As noted, the takeup spool must always be “clutched” and allowed to slip in a 35 mm camera. It is the sprocket that must pull the film through, and the spool just applies enough pull to keep the film wound on it. Notice the sprocket teeth are tapered to allow easy entry into the film holes. This could vary the position of the film slightly if the film varies in height as it passes over the sprocket. As the sprocket moves the film along the teeth effectively rise up through the holes and then back down. Perhaps the surface finish on the teeth are a bit rougher on the M-A than older cameras so the film catches a bit and rides higher at times. If the takeup spool slips too easily and doesn’t keep enough tension, it could also allow this. The guides on the camera back near the pressure plate are before the sprocket, so only the spool tension keeps the film down as it leaves the sprocket (in the reverse bend). I think there’s more room for variation than you might expect for a simple mechanism. Thanks TomB_tx, After reading your posting I had another look at the sprocket teeth on my M-A and they feel smooth too touch without any noticeable irregularities on the surface. It will be interesting to compare them with my M7 when I finish a roll of film. I would have expected some variation in an older camera where the sprockets may become worn over time. But in a new camera I would have thought there would be consistency even with a simple operating mechanism, like I get with my M7. But I appreciate your comments as I have little or no knowledge other than the basics on the inner workings of a camera. Paul", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/2/?tab=comments#comment-3703656", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "16 minutes ago, tomb_tx said: as noted, the takeup spool must always be “clutched” and allowed to slip in a 35 mm camera. it is the sprocket that must pull the film through, and the spool just applies enough pull to keep the film wound on it. notice the sprocket teeth are tapered to allow easy entry into the film holes. this could vary the -----> position !!!  of the film slightly if the film varies in height as it passes over the sprocket. as the sprocket moves the film along the teeth effectively rise up through the holes and then back down. perhaps the surface finish on the teeth are a bit rougher on the m-a than older cameras so the film catches a bit and rides higher at times. if the takeup spool slips too easily and doesn’t keep enough tension, it could also allow this. the guides on the camera back near the pressure plate are before the sprocket, so only the spool tension keeps the film down as it leaves the sprocket (in the reverse bend). i think there’s more room for variation than you might expect for a simple mechanism. thanks tomb_tx, after reading your posting i had another look at the sprocket teeth on my m-a and they feel smooth too touch without any noticeable irregularities on the surface. it will be interesting to compare them with my m7 when i finish a roll of film. i would have expected some variation in an older camera where the sprockets may become worn over time. but in a new camera i would have thought there would be consistency even with a simple operating mechanism, like i get with my m7. but i appreciate your comments as i have little or no knowledge other than the basics on the inner workings of a camera. paul", "sortedWord": "None", "identifyer": 2762, "year": "2019"}, {"Unnamed: 0": 390314, "autor": "delta100", "date": 1552824600000, "content": "Forgive me, this might sound stupid. The Leica handbook says when loading 1) Advance the film by one frame using the quick wind lever and release the shutter. 2) Then tension the film by turning the rewind knob in the direction of red arrow. The film is properly wound if the rewind knob turns in the opposite direction to the arrow when the quick wind lever is operated again. Also the rewind release lever R must be in the vertical position. If still a problem return to Leica Germany!", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/3/?tab=comments#comment-3704186", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "forgive me, this might sound stupid. the leica handbook says when loading 1) advance the film by one frame using the quick wind lever and release the shutter. 2) then tension the film by turning the rewind knob in the direction of red arrow. the film is properly wound if the rewind knob turns in the opposite direction to the arrow when the quick wind lever is operated again. also the rewind release lever r must be in the vertical -----> position !!! . if still a problem return to leica germany!", "sortedWord": "None", "identifyer": 2770, "year": "2019"}, {"Unnamed: 0": 390323, "autor": "Paul Robinson", "date": 1552848840000, "content": "6 hours ago, MP2 said: Forgive me, this might sound stupid. The Leica handbook says when loading 1) Advance the film by one frame using the quick wind lever and release the shutter. 2) Then tension the film by turning the rewind knob in the direction of red arrow. The film is properly wound if the rewind knob turns in the opposite direction to the arrow when the quick wind lever is operated again. Also the rewind release lever R must be in the vertical position. If still a problem return to Leica Germany! Hi MP2, Thanks. I have followed the instruction manual and use the M-A in the same way as my M7. I prefer the M-A rewind knob to the M7 and especially to give the film some tension. But that’s just a minor preference on my part. Paul", "link": "https://www.l-camera-forum.com/topic/294513-leica-m-a-problem/page/3/?tab=comments#comment-3704484", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "6 hours ago, mp2 said: forgive me, this might sound stupid. the leica handbook says when loading 1) advance the film by one frame using the quick wind lever and release the shutter. 2) then tension the film by turning the rewind knob in the direction of red arrow. the film is properly wound if the rewind knob turns in the opposite direction to the arrow when the quick wind lever is operated again. also the rewind release lever r must be in the vertical -----> position !!! . if still a problem return to leica germany! hi mp2, thanks. i have followed the instruction manual and use the m-a in the same way as my m7. i prefer the m-a rewind knob to the m7 and especially to give the film some tension. but that’s just a minor preference on my part. paul", "sortedWord": "None", "identifyer": 2779, "year": "2019"}, {"Unnamed: 0": 399873, "autor": "evikne", "date": 1568633460000, "content": "1 hour ago, P_Wijk said: Pictures from this summer vacation. always a question whom to focus at when more than one person in the photo. any tips? If you position yourself so that the distance between you and both subjects is equal (think of an isosceles triangle), you can get both subjects in focus at the same time (it surely needs some practice at f/0.95). But if any of them move (children rarely stand still very long), you must be aware and constantly reposition yourself. If you photograph two persons from an oblique angle, it usually looks most natural when you focus on the nearest person. But in a row of several people, it won't look unnatural to focus on a person somewhere in the middle. Just choose the one that is most important.", "link": "https://www.l-camera-forum.com/topic/297666-show-us-your-noctilux-wide-open-shots/page/14/?tab=comments#comment-3821011", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "1 hour ago, p_wijk said: pictures from this summer vacation. always a question whom to focus at when more than one person in the photo. any tips? if you -----> position !!!  yourself so that the distance between you and both subjects is equal (think of an isosceles triangle), you can get both subjects in focus at the same time (it surely needs some practice at f/0.95). but if any of them move (children rarely stand still very long), you must be aware and constantly reposition yourself. if you photograph two persons from an oblique angle, it usually looks most natural when you focus on the nearest person. but in a row of several people, it won't look unnatural to focus on a person somewhere in the middle. just choose the one that is most important.", "sortedWord": "None", "identifyer": 12583, "year": "2019"}, {"Unnamed: 0": 400292, "autor": "TomB_tx", "date": 1561637820000, "content": "If you have an M10 (or other digital M with live view) the adjustment is fast and easy, and doesn't really need a graduated focus chart. You just need an object with clear detail around a point on which to focus. Mount the camera on a tripod, ideally about 2 meters from the target, and focus the rangefinder exactly on the target. (In this example I used a closer distance so the indicator marks I made would be easier to see.) Then use a sharp (0.5mm) pencil to mark on the lens distance scale where the RF shows it is in focus: --img--  Then, without moving the camera or target, switch to Live View and use magnified focus to get the sharpest focus on the same target point. This will likely be a bit different than the RF if the lens hasn't been adjusted yet. Mark this point on the lens also: --img--  The distance between the two marks is the amount the focus cam needs to move so that the RF indicated focus matches the true image focus. In this case, the lens cam needs to move clockwise so the RF will focus at the same point as the image. To adjust, the lens helical must stay fixed while you move the focus cam, so it is easiest to do with the lens against the infinity stop. Remove the lens, set it to the stop, and mark the cam where it aligns with the edge of the bayonet tab. Then make another mark the same distance apart as the marks made on the distance scale, and in the same direction - so here the second mark is left of the mark at the stop: --img--  Now slightly loosen the two screws that lock the focus cam in place: --img--  Then, holding the helical against the infinity stop, rotate the focus cam until the \"RF\" mark aligns with the edge of the bayonet tab: --img--  Snug up the two screws with the cam in this position and verify that it is aligned when the focus is at the infinity stop. Then re-check the difference between the RF and Live View focus, and repeat if necessary. This should adjust for all distances IF the focus cam on the lens is accurately ground. On my sample the cam slope is slightly off, so the focus drifts a bit as you focus at different distances. That's why Leica no longer uses a steeply sloped focus cam on their lenses. Edited June 27, 2019 by TomB_tx", "link": "https://www.l-camera-forum.com/topic/283856-first-7artisans-35mm-f2-lens-review/page/7/?tab=comments#comment-3767239", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "if you have an m10 (or other digital m with live view) the adjustment is fast and easy, and doesn't really need a graduated focus chart. you just need an object with clear detail around a point on which to focus. mount the camera on a tripod, ideally about 2 meters from the target, and focus the rangefinder exactly on the target. (in this example i used a closer distance so the indicator marks i made would be easier to see.) then use a sharp (0.5mm) pencil to mark on the lens distance scale where the rf shows it is in focus: --img--  then, without moving the camera or target, switch to live view and use magnified focus to get the sharpest focus on the same target point. this will likely be a bit different than the rf if the lens hasn't been adjusted yet. mark this point on the lens also: --img--  the distance between the two marks is the amount the focus cam needs to move so that the rf indicated focus matches the true image focus. in this case, the lens cam needs to move clockwise so the rf will focus at the same point as the image. to adjust, the lens helical must stay fixed while you move the focus cam, so it is easiest to do with the lens against the infinity stop. remove the lens, set it to the stop, and mark the cam where it aligns with the edge of the bayonet tab. then make another mark the same distance apart as the marks made on the distance scale, and in the same direction - so here the second mark is left of the mark at the stop: --img--  now slightly loosen the two screws that lock the focus cam in place: --img--  then, holding the helical against the infinity stop, rotate the focus cam until the \"rf\" mark aligns with the edge of the bayonet tab: --img--  snug up the two screws with the cam in this -----> position !!!  and verify that it is aligned when the focus is at the infinity stop. then re-check the difference between the rf and live view focus, and repeat if necessary. this should adjust for all distances if the focus cam on the lens is accurately ground. on my sample the cam slope is slightly off, so the focus drifts a bit as you focus at different distances. that's why leica no longer uses a steeply sloped focus cam on their lenses. edited june 27, 2019 by tomb_tx", "sortedWord": "None", "identifyer": 13014, "year": "2019"}, {"Unnamed: 0": 400294, "autor": "Guest", "date": 1561644720000, "content": "58 minutes ago, TomB_tx said: If you have an M10 (or other digital M with live view) the adjustment is fast and easy, and doesn't really need a graduated focus chart. You just need an object with clear detail around a point on which to focus. Mount the camera on a tripod, ideally about 2 meters from the target, and focus the rangefinder exactly on the target. (In this example I used a closer distance so the indicator marks I made would be easier to see.) Then use a sharp (0.5mm) pencil to mark on the lens distance scale where the RF shows it is in focus: --img--  Then, without moving the camera or target, switch to Live View and use magnified focus to get the sharpest focus on the same target point. This will likely be a bit different than the RF if the lens hasn't been adjusted yet. Mark this point on the lens also: --img--  The distance between the two marks is the amount the focus cam needs to move so that the RF indicated focus matches the true image focus. In this case, the lens cam needs to move clockwise so the RF will focus at the same point as the image. To adjust, the lens helical must stay fixed while you move the focus cam, so it is easiest to do with the lens against the infinity stop. Remove the lens, set it to the stop, and mark the cam where it aligns with the edge of the bayonet tab. Then make another mark the same distance apart as the marks made on the distance scale, and in the same direction - so here the second mark is left of the mark at the stop: --img--  Now slightly loosen the two screws that lock the focus cam in place: --img--  Then, holding the helical against the infinity stop, rotate the focus cam until the \"RF\" mark aligns with the edge of the bayonet tab: --img--  Snug up the two screws with the cam in this position and verify that it is aligned when the focus is at the infinity stop. Then re-check the difference between the RF and Live View focus, and repeat if necessary. This should adjust for all distances IF the focus cam on the lens is accurately ground. On my sample the cam slope is slightly off, so the focus drifts a bit as you focus at different distances. That's why Leica no longer uses a steeply sloped focus cam on their lenses. THANK YOU VERY MUCH! I really appreciate this detailed instruction. I followed it, and adjust the lens accordingly. The lens now focuses correctly at infinity, and about 2 meters from the lens. Will need to test this on an M10, or a roll of film.", "link": "https://www.l-camera-forum.com/topic/283856-first-7artisans-35mm-f2-lens-review/page/7/?tab=comments#comment-3767304", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "58 minutes ago, tomb_tx said: if you have an m10 (or other digital m with live view) the adjustment is fast and easy, and doesn't really need a graduated focus chart. you just need an object with clear detail around a point on which to focus. mount the camera on a tripod, ideally about 2 meters from the target, and focus the rangefinder exactly on the target. (in this example i used a closer distance so the indicator marks i made would be easier to see.) then use a sharp (0.5mm) pencil to mark on the lens distance scale where the rf shows it is in focus: --img--  then, without moving the camera or target, switch to live view and use magnified focus to get the sharpest focus on the same target point. this will likely be a bit different than the rf if the lens hasn't been adjusted yet. mark this point on the lens also: --img--  the distance between the two marks is the amount the focus cam needs to move so that the rf indicated focus matches the true image focus. in this case, the lens cam needs to move clockwise so the rf will focus at the same point as the image. to adjust, the lens helical must stay fixed while you move the focus cam, so it is easiest to do with the lens against the infinity stop. remove the lens, set it to the stop, and mark the cam where it aligns with the edge of the bayonet tab. then make another mark the same distance apart as the marks made on the distance scale, and in the same direction - so here the second mark is left of the mark at the stop: --img--  now slightly loosen the two screws that lock the focus cam in place: --img--  then, holding the helical against the infinity stop, rotate the focus cam until the \"rf\" mark aligns with the edge of the bayonet tab: --img--  snug up the two screws with the cam in this -----> position !!!  and verify that it is aligned when the focus is at the infinity stop. then re-check the difference between the rf and live view focus, and repeat if necessary. this should adjust for all distances if the focus cam on the lens is accurately ground. on my sample the cam slope is slightly off, so the focus drifts a bit as you focus at different distances. that's why leica no longer uses a steeply sloped focus cam on their lenses. thank you very much! i really appreciate this detailed instruction. i followed it, and adjust the lens accordingly. the lens now focuses correctly at infinity, and about 2 meters from the lens. will need to test this on an m10, or a roll of film.", "sortedWord": "None", "identifyer": 13016, "year": "2019"}, {"Unnamed: 0": 400298, "autor": "deathontheshore", "date": 1566911520000, "content": "Am 27.6.2019 um 14:17 schrieb TomB_tx: If you have an M10 (or other digital M with live view) the adjustment is fast and easy, and doesn't really need a graduated focus chart. You just need an object with clear detail around a point on which to focus. Mount the camera on a tripod, ideally about 2 meters from the target, and focus the rangefinder exactly on the target. (In this example I used a closer distance so the indicator marks I made would be easier to see.) Then use a sharp (0.5mm) pencil to mark on the lens distance scale where the RF shows it is in focus: --img--  Then, without moving the camera or target, switch to Live View and use magnified focus to get the sharpest focus on the same target point. This will likely be a bit different than the RF if the lens hasn't been adjusted yet. Mark this point on the lens also: --img--  The distance between the two marks is the amount the focus cam needs to move so that the RF indicated focus matches the true image focus. In this case, the lens cam needs to move clockwise so the RF will focus at the same point as the image. To adjust, the lens helical must stay fixed while you move the focus cam, so it is easiest to do with the lens against the infinity stop. Remove the lens, set it to the stop, and mark the cam where it aligns with the edge of the bayonet tab. Then make another mark the same distance apart as the marks made on the distance scale, and in the same direction - so here the second mark is left of the mark at the stop: --img--  Now slightly loosen the two screws that lock the focus cam in place: --img--  Then, holding the helical against the infinity stop, rotate the focus cam until the \"RF\" mark aligns with the edge of the bayonet tab: --img--  Snug up the two screws with the cam in this position and verify that it is aligned when the focus is at the infinity stop. Then re-check the difference between the RF and Live View focus, and repeat if necessary. This should adjust for all distances IF the focus cam on the lens is accurately ground. On my sample the cam slope is slightly off, so the focus drifts a bit as you focus at different distances. That's why Leica no longer uses a steeply sloped focus cam on their lenses. Hi, this is my first post here. I am struggling with focus adjustment. I thought, I could adapt the lens on a mirrorless camera (Fujifilm X-T2) and use 7artisans adjustment tips. But when I rotate the focus cam nothing seems to happen, focus is still shifted. I rotated the focus cam clockwise until it can't be rotated any more. Does this only work with a digital M? Thank you", "link": "https://www.l-camera-forum.com/topic/283856-first-7artisans-35mm-f2-lens-review/page/7/?tab=comments#comment-3807183", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "am 27.6.2019 um 14:17 schrieb tomb_tx: if you have an m10 (or other digital m with live view) the adjustment is fast and easy, and doesn't really need a graduated focus chart. you just need an object with clear detail around a point on which to focus. mount the camera on a tripod, ideally about 2 meters from the target, and focus the rangefinder exactly on the target. (in this example i used a closer distance so the indicator marks i made would be easier to see.) then use a sharp (0.5mm) pencil to mark on the lens distance scale where the rf shows it is in focus: --img--  then, without moving the camera or target, switch to live view and use magnified focus to get the sharpest focus on the same target point. this will likely be a bit different than the rf if the lens hasn't been adjusted yet. mark this point on the lens also: --img--  the distance between the two marks is the amount the focus cam needs to move so that the rf indicated focus matches the true image focus. in this case, the lens cam needs to move clockwise so the rf will focus at the same point as the image. to adjust, the lens helical must stay fixed while you move the focus cam, so it is easiest to do with the lens against the infinity stop. remove the lens, set it to the stop, and mark the cam where it aligns with the edge of the bayonet tab. then make another mark the same distance apart as the marks made on the distance scale, and in the same direction - so here the second mark is left of the mark at the stop: --img--  now slightly loosen the two screws that lock the focus cam in place: --img--  then, holding the helical against the infinity stop, rotate the focus cam until the \"rf\" mark aligns with the edge of the bayonet tab: --img--  snug up the two screws with the cam in this -----> position !!!  and verify that it is aligned when the focus is at the infinity stop. then re-check the difference between the rf and live view focus, and repeat if necessary. this should adjust for all distances if the focus cam on the lens is accurately ground. on my sample the cam slope is slightly off, so the focus drifts a bit as you focus at different distances. that's why leica no longer uses a steeply sloped focus cam on their lenses. hi, this is my first post here. i am struggling with focus adjustment. i thought, i could adapt the lens on a mirrorless camera (fujifilm x-t2) and use 7artisans adjustment tips. but when i rotate the focus cam nothing seems to happen, focus is still shifted. i rotated the focus cam clockwise until it can't be rotated any more. does this only work with a digital m? thank you", "sortedWord": "None", "identifyer": 13020, "year": "2019"}, {"Unnamed: 0": 408092, "autor": "105012", "date": 1549267260000, "content": "I have a couple of these, mine are not open-ended in the middle. They are quite large and they require the lenses to be in one particular rotational position in order to engage. I painted a red dot to signify the position to save time. In the end, I designed my own much smaller ones that accept the lens in any rotation and 3D printed them.", "link": "https://www.l-camera-forum.com/topic/293969-optech-double-lens-mount-cap/?tab=comments#comment-3677759", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i have a couple of these, mine are not open-ended in the middle. they are quite large and they require the lenses to be in one particular rotational -----> position !!!  in order to engage. i painted a red dot to signify the position to save time. in the end, i designed my own much smaller ones that accept the lens in any rotation and 3d printed them.", "sortedWord": "None", "identifyer": 20882, "year": "2019"}, {"Unnamed: 0": 414643, "autor": "jaapv", "date": 1573057560000, "content": "Yes, the private reserves in South Africa do specialize in close-up viewing with well-habituated animals. The advantage is that you are practically guaranteed the sightings. National Parks and reserves, especially the lesser-frequented ones, are far more wild and require more bushcraft and longer lenses. You are right that a zoom lens is preferable to a fixed focal length as changing the position for framing is nearly impossible. Either that or use two bodies.", "link": "https://www.l-camera-forum.com/topic/303064-telephoto-for-safari-panasonic-70-200-w-2x-vs-leica-90-280/page/4/?tab=comments#comment-3849192", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "yes, the private reserves in south africa do specialize in close-up viewing with well-habituated animals. the advantage is that you are practically guaranteed the sightings. national parks and reserves, especially the lesser-frequented ones, are far more wild and require more bushcraft and longer lenses. you are right that a zoom lens is preferable to a fixed focal length as changing the -----> position !!!  for framing is nearly impossible. either that or use two bodies.", "sortedWord": "None", "identifyer": 27579, "year": "2019"}, {"Unnamed: 0": 420366, "autor": "Chaemono", "date": 1570956900000, "content": "vor 31 Minuten schrieb helged: Based on the circularity of the oof highlights, as well as slightly stronger oof, the top is SL-Lux. I think... Here is a translation on the bokeh assessment of the Les Numériques review linked above: “Bokeh Positioned by Panasonic as a lens dedicated to portraiture, [...] we were waiting for the turn of Lumix S Pro 50mm F1.4. We discovered some surprise in the famous bokeh. Indeed, Panasonic has chosen to take a distinct approach that will certainly not please everyone. For our part, we welcome the initiative to think outside the box by distinguishing itself from a path marked by classicism. Indeed, the background blur is unique. The boundaries between contrasting areas or contours are split by visually creating a kind of vibration. The effect was confirmed to us by the engineers who told us that this was indeed one of the elements that went into the equation of the creation of this bokeh which can be described as atypical. Panasonic representatives also told us that this corollary was also only visible in the laboratory and not in real-life shooting conditions. This is not the case... If our hand photographed in front of our stage is an extreme example to illustrate our point, we must recreate the presence of this phenomenon in real life — that is, when we do not try to generate it. That said, the \"vibration\" remains clearly visible at full size and on specific areas — such as on the contour of a shoulder. With a loaded background like that of branches and leaves, the effect is also observable there. The effect on the bokeh is equally visible, resulting in an original background blur. The result has divided our testers, divided between followers of a very diffuse classical rendering and those who appreciate the singularity thus generated.” Helge, what you describe as “the circularity of the oof highlights” is the ‘famous vibrating bokeh” of this Panasonic lens, not an attempt by Leica to emulate the 50 Noctilux in an f1.4 SL lens. 😁", "link": "https://www.l-camera-forum.com/topic/299136-panasonic-50-s-pro-vs-leica-50-sl/?tab=comments#comment-3835113", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": "vor 31 minuten schrieb helged: based on the circularity of the oof highlights, as well as slightly stronger oof, the top is sl-lux. i think... here is a translation on the bokeh assessment of the les numériques review linked above: “bokeh -----> positioned !!!  by panasonic as a lens dedicated to portraiture, [...] we were waiting for the turn of lumix s pro 50mm f1.4. we discovered some surprise in the famous bokeh. indeed, panasonic has chosen to take a distinct approach that will certainly not please everyone. for our part, we welcome the initiative to think outside the box by distinguishing itself from a path marked by classicism. indeed, the background blur is unique. the boundaries between contrasting areas or contours are split by visually creating a kind of vibration. the effect was confirmed to us by the engineers who told us that this was indeed one of the elements that went into the equation of the creation of this bokeh which can be described as atypical. panasonic representatives also told us that this corollary was also only visible in the laboratory and not in real-life shooting conditions. this is not the case... if our hand photographed in front of our stage is an extreme example to illustrate our point, we must recreate the presence of this phenomenon in real life — that is, when we do not try to generate it. that said, the \"vibration\" remains clearly visible at full size and on specific areas — such as on the contour of a shoulder. with a loaded background like that of branches and leaves, the effect is also observable there. the effect on the bokeh is equally visible, resulting in an original background blur. the result has divided our testers, divided between followers of a very diffuse classical rendering and those who appreciate the singularity thus generated.” helge, what you describe as “the circularity of the oof highlights” is the ‘famous vibrating bokeh” of this panasonic lens, not an attempt by leica to emulate the 50 noctilux in an f1.4 sl lens. 😁", "sortedWord": "None", "identifyer": 33383, "year": "2019"}, {"Unnamed: 0": 432208, "autor": "Dave in Wales", "date": 1556946600000, "content": "On 4/30/2019 at 3:58 PM, jaapv said: I was about to give an identical answer. There is no reason why being mounted on the camera should make a difference to the zoom mechanism, which is mechanical and not connected to the mount. Go easy with me, I'm still a newbie really Is this strictly true? In 'P' and 'A' modes the shutter speed is connected to the zoom position and increases or decreases in accordance with the zoom length, there's clever", "link": "https://www.l-camera-forum.com/topic/296763-just-got-a-tl-55-135-is-it-normal-to-have-noise/page/2/?tab=comments#comment-3734281", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on 4/30/2019 at 3:58 pm, jaapv said: i was about to give an identical answer. there is no reason why being mounted on the camera should make a difference to the zoom mechanism, which is mechanical and not connected to the mount. go easy with me, i'm still a newbie really is this strictly true? in 'p' and 'a' modes the shutter speed is connected to the zoom -----> position !!!  and increases or decreases in accordance with the zoom length, there's clever", "sortedWord": "None", "identifyer": 45369, "year": "2019"}, {"Unnamed: 0": 432577, "autor": "scott kirkpatrick", "date": 1552890360000, "content": "I've messed about a bit with Olympus multi-shot hi-res. In the vision and image science literature, this is called super-resolution. Imagine that you can displace the sensor by one pixel spacing in the x (horizontal) and then y (vertical) directions, then go back a step in x and finally back a step in y, taking a picture each time. Then in each pixel position you now have two G, one R and one B pixels' worth of data. It's as if you were just shifting the Bayer filter, leaving the pixels where they started. That's how Hasselblad has done this for some time. Now there is no loss of resolution due to the de-mosaicing of the Bayer filters. For the next four shots of eight total, first displace the sensor by half a pixel spacing in both the x and y directions, and repeat the four step process. This gives four more pixels' worth of data overlapping the previous four, as if you had pixels with a spacing 1/(sqrt(2)) of the original spacing, but they are \"smeared\" pixels that overlap each other. Finally some signal processing tricks (usually something that would be patented, since there are lots of ways to do this) assigns all the information to the larger pseudo-array of smaller virtual pixels that make up the hi-res JPEG output. It sounds like a lot of work, but fast algorithms exist for making JPEGs out of Bayer data, and these tricks just use them in a different way.", "link": "https://www.l-camera-forum.com/topic/305981-images-from-panasonic-cameras-merged/page/2/?tab=comments#comment-3704782", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i've messed about a bit with olympus multi-shot hi-res. in the vision and image science literature, this is called super-resolution. imagine that you can displace the sensor by one pixel spacing in the x (horizontal) and then y (vertical) directions, then go back a step in x and finally back a step in y, taking a picture each time. then in each pixel -----> position !!!  you now have two g, one r and one b pixels' worth of data. it's as if you were just shifting the bayer filter, leaving the pixels where they started. that's how hasselblad has done this for some time. now there is no loss of resolution due to the de-mosaicing of the bayer filters. for the next four shots of eight total, first displace the sensor by half a pixel spacing in both the x and y directions, and repeat the four step process. this gives four more pixels' worth of data overlapping the previous four, as if you had pixels with a spacing 1/(sqrt(2)) of the original spacing, but they are \"smeared\" pixels that overlap each other. finally some signal processing tricks (usually something that would be patented, since there are lots of ways to do this) assigns all the information to the larger pseudo-array of smaller virtual pixels that make up the hi-res jpeg output. it sounds like a lot of work, but fast algorithms exist for making jpegs out of bayer data, and these tricks just use them in a different way.", "sortedWord": "None", "identifyer": 45738, "year": "2019"}, {"Unnamed: 0": 432665, "autor": "mmradman", "date": 1553766480000, "content": "1 hour ago, LocalHero1953 said: A testament to the lens, sensor and probably IBIS (and your steady hand?) - remarkable! No doubt more Mp plus IBIS means more quality image providing one can utilise it correctly, pretty much same for any sensor resolution really. It will be interesting to hear reaction of the 24Mp good enough brigade, we heard it all here before how Leica's 24Mp is/was on par with 40Mp+ competitors in that department. Really? My position is that I am OK with 24Mp as is but double that (ball park) plus add IBIS and it has my full attention. Due to size and lenses i use and wish to use I will probably swap SL for Z7, never used L lenses.", "link": "https://www.l-camera-forum.com/topic/305981-images-from-panasonic-cameras-merged/page/6/?tab=comments#comment-3711092", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "1 hour ago, localhero1953 said: a testament to the lens, sensor and probably ibis (and your steady hand?) - remarkable! no doubt more mp plus ibis means more quality image providing one can utilise it correctly, pretty much same for any sensor resolution really. it will be interesting to hear reaction of the 24mp good enough brigade, we heard it all here before how leica's 24mp is/was on par with 40mp+ competitors in that department. really? my -----> position !!!  is that i am ok with 24mp as is but double that (ball park) plus add ibis and it has my full attention. due to size and lenses i use and wish to use i will probably swap sl for z7, never used l lenses.", "sortedWord": "None", "identifyer": 45826, "year": "2019"}, {"Unnamed: 0": 432666, "autor": "LocalHero1953", "date": 1553772000000, "content": "1 hour ago, mmradman said: No doubt more Mp plus IBIS means more quality image providing one can utilise it correctly, pretty much same for any sensor resolution really. It will be interesting to hear reaction of the 24Mp good enough brigade, we heard it all here before how Leica's 24Mp is/was on par with 40Mp+ competitors in that department. Really? My position is that I am OK with 24Mp as is but double that (ball park) plus add IBIS and it has my full attention. Due to size and lenses i use and wish to use I will probably swap SL for Z7, never used L lenses. Well, I am actually one of the \"24mp is good enough and 47mp is too big\" brigade. I won't go through the reasons again (I have posted them before), but in the context of my comment above, the detail available with that lens, sensor and those megapixels is impressive, but I am unlikely ever to crop to that degree for anything other than utilitarian reasons. So this ability to crop and use those pixels is of no value to me. YMMV, and I hope you recognise the same in return.", "link": "https://www.l-camera-forum.com/topic/305981-images-from-panasonic-cameras-merged/page/6/?tab=comments#comment-3711131", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "1 hour ago, mmradman said: no doubt more mp plus ibis means more quality image providing one can utilise it correctly, pretty much same for any sensor resolution really. it will be interesting to hear reaction of the 24mp good enough brigade, we heard it all here before how leica's 24mp is/was on par with 40mp+ competitors in that department. really? my -----> position !!!  is that i am ok with 24mp as is but double that (ball park) plus add ibis and it has my full attention. due to size and lenses i use and wish to use i will probably swap sl for z7, never used l lenses. well, i am actually one of the \"24mp is good enough and 47mp is too big\" brigade. i won't go through the reasons again (i have posted them before), but in the context of my comment above, the detail available with that lens, sensor and those megapixels is impressive, but i am unlikely ever to crop to that degree for anything other than utilitarian reasons. so this ability to crop and use those pixels is of no value to me. ymmv, and i hope you recognise the same in return.", "sortedWord": "None", "identifyer": 45827, "year": "2019"}, {"Unnamed: 0": 432742, "autor": "thighslapper", "date": 1554477900000, "content": "Some more info from playing around in the last few days ....... The Novoflex AF adapter (Nikon version) allows aperture changes but not AF. It reports in the exif 'Nikon lens adapter for SL' and the focal length of the sigma 135/1.8 as 138mm but no lens name/details. It advises 'change to MF' and works very well with the focus peaking on the S1R. This is at least better than the CL where it just produces a black screen. The function of 'Focus Bracketing' is rather obscure ..... you can select step distance between +1 and +10 but doesn't really indicate what the step size is ..... and the number of images taken ..... plus whether they start at the closest focus position and then move further, or whether alternately beyond and before the point of focus. It all takes a fair bit of trial and error to see how it pans out in practice ..... focussing 1/3 of the way into a scene with 3 images and +10 set at 24mm seems to produce 3 images focussed as close as possible, at the focus point and at infinity (with the second setting option). Done with a single button press it's very handy ..... as long as you have found out the settings suitable for the focal length and aperture you are using ..... There is also the option of white balance and aperture bracketing ..... although I can't really see any point of the former (using RAW) and not a lot of use for the latter.", "link": "https://www.l-camera-forum.com/topic/305981-images-from-panasonic-cameras-merged/page/10/?tab=comments#comment-3716347", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "some more info from playing around in the last few days ....... the novoflex af adapter (nikon version) allows aperture changes but not af. it reports in the exif 'nikon lens adapter for sl' and the focal length of the sigma 135/1.8 as 138mm but no lens name/details. it advises 'change to mf' and works very well with the focus peaking on the s1r. this is at least better than the cl where it just produces a black screen. the function of 'focus bracketing' is rather obscure ..... you can select step distance between +1 and +10 but doesn't really indicate what the step size is ..... and the number of images taken ..... plus whether they start at the closest focus -----> position !!!  and then move further, or whether alternately beyond and before the point of focus. it all takes a fair bit of trial and error to see how it pans out in practice ..... focussing 1/3 of the way into a scene with 3 images and +10 set at 24mm seems to produce 3 images focussed as close as possible, at the focus point and at infinity (with the second setting option). done with a single button press it's very handy ..... as long as you have found out the settings suitable for the focal length and aperture you are using ..... there is also the option of white balance and aperture bracketing ..... although i can't really see any point of the former (using raw) and not a lot of use for the latter.", "sortedWord": "None", "identifyer": 45906, "year": "2019"}, {"Unnamed: 0": 432743, "autor": "helged", "date": 1554480540000, "content": "42 minutes ago, thighslapper said: Some more info from playing around in the last few days ....... The Novoflex AF adapter (Nikon version) allows aperture changes but not AF. ﻿It reports in the exif 'Nikon lens adapter for SL' and the focal length of the sigma 135/1.8 as 138mm but no lens name/details. It advises 'change to MF' and works very well with the focus peaking on the S1R. This is at least better than the CL where it just produces a black screen. The function of 'Focus Bracketing' is rather obscure ..... you can select step distance between +1 and +10 but doesn't really indicate what the step size is ..... and the number of images taken ..... plus whether they start at the closest focus position and then move further, or whether alternately beyond and before the point of focus. It all takes a fair bit of trial and error to see how it pans out in practice ..... focussing 1/3 of the way into a scene with 3 images and +10 set at 24mm seems to produce 3 images focussed as close as possible, at the focus point and at infinity (with the second setting option). Done with a single button press it's very handy ..... as long as you have found out the settings suitable for the focal length and aperture you are using ..... There is also the option of white balance and aperture bracketing ..... although I can't really see any point of the former (using RAW) and not a lot of use for the latter. The Novoflex adapter is, in this respect, more 'advanced' than Leica's S-to-L adapter: \"The Leica S to SL adapter doesn't allow AF nor aperture settings, the camera doesn't preclude use and the usual work around of manual focus does work, I didn't test the aperture work around of stop-down removal from an S body.\" From", "link": "https://www.l-camera-forum.com/topic/305981-images-from-panasonic-cameras-merged/page/10/?tab=comments#comment-3716377", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "42 minutes ago, thighslapper said: some more info from playing around in the last few days ....... the novoflex af adapter (nikon version) allows aperture changes but not af. ﻿it reports in the exif 'nikon lens adapter for sl' and the focal length of the sigma 135/1.8 as 138mm but no lens name/details. it advises 'change to mf' and works very well with the focus peaking on the s1r. this is at least better than the cl where it just produces a black screen. the function of 'focus bracketing' is rather obscure ..... you can select step distance between +1 and +10 but doesn't really indicate what the step size is ..... and the number of images taken ..... plus whether they start at the closest focus -----> position !!!  and then move further, or whether alternately beyond and before the point of focus. it all takes a fair bit of trial and error to see how it pans out in practice ..... focussing 1/3 of the way into a scene with 3 images and +10 set at 24mm seems to produce 3 images focussed as close as possible, at the focus point and at infinity (with the second setting option). done with a single button press it's very handy ..... as long as you have found out the settings suitable for the focal length and aperture you are using ..... there is also the option of white balance and aperture bracketing ..... although i can't really see any point of the former (using raw) and not a lot of use for the latter. the novoflex adapter is, in this respect, more 'advanced' than leica's s-to-l adapter: \"the leica s to sl adapter doesn't allow af nor aperture settings, the camera doesn't preclude use and the usual work around of manual focus does work, i didn't test the aperture work around of stop-down removal from an s body.\" from", "sortedWord": "None", "identifyer": 45907, "year": "2019"}, {"Unnamed: 0": 432888, "autor": "helged", "date": 1574277240000, "content": " Anyone in the position to compare Sigma PF with Panasonic S1 wrt noise at high ISO (say 1600-6400), plus AFs and AFc in good daylight?", "link": "https://www.l-camera-forum.com/topic/303132-images-with-sigma-l-mount-cameras/page/2/?tab=comments#comment-3858344", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " anyone in the -----> position !!!  to compare sigma pf with panasonic s1 wrt noise at high iso (say 1600-6400), plus afs and afc in good daylight?", "sortedWord": "None", "identifyer": 46053, "year": "2019"}, {"Unnamed: 0": 434664, "autor": "farnz", "date": 1551380580000, "content": "1 hour ago, caissa said: With the high res mode of the Panasonic S cameras (187 MP) I see no need for small MF anymore ... Am I right in thinking that the S1R's 187 MP is interpolated from pixel-shifting operations rather than 187 million separate photodiodes? If so, artefacts will inevitably be created in the split seconds between the pixel-shift pulses where objects move and change position relative to the particular pixels. Also, presumably, the software selects and if necessary corrects for what it believes to be the appropriate value of any discrete pixels in any of the 4(?) temporary rasters. This being the case, then the inter-aliasing artefacts are likely to be visible at some magnification and will render a less precise image at those points than a bona fide medium format image won't they? I understand your point but I'm not quite ready to write off the inherent benefits of medium format images just yet. Pete.", "link": "https://www.l-camera-forum.com/topic/293871-is-the-s1s1r-a-good-backup-camera-for-sl/page/4/?tab=comments#comment-3692884", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "1 hour ago, caissa said: with the high res mode of the panasonic s cameras (187 mp) i see no need for small mf anymore ... am i right in thinking that the s1r's 187 mp is interpolated from pixel-shifting operations rather than 187 million separate photodiodes? if so, artefacts will inevitably be created in the split seconds between the pixel-shift pulses where objects move and change -----> position !!!  relative to the particular pixels. also, presumably, the software selects and if necessary corrects for what it believes to be the appropriate value of any discrete pixels in any of the 4(?) temporary rasters. this being the case, then the inter-aliasing artefacts are likely to be visible at some magnification and will render a less precise image at those points than a bona fide medium format image won't they? i understand your point but i'm not quite ready to write off the inherent benefits of medium format images just yet. pete.", "sortedWord": "None", "identifyer": 47893, "year": "2019"}, {"Unnamed: 0": 434672, "autor": "thighslapper", "date": 1551528480000, "content": "On 2/28/2019 at 7:03 PM, farnz said: Am I right in thinking that the S1R's 187 MP is interpolated from pixel-shifting operations rather than 187 million separate photodiodes? If so, artefacts will inevitably be created in the split seconds between the pixel-shift pulses where objects move and change position relative to the particular pixels. Also, presumably, the software selects and if necessary corrects for what it believes to be the appropriate value of any discrete pixels in any of the 4(?) temporary rasters. This being the case, then the inter-aliasing artefacts are likely to be visible at some magnification and will render a less precise image at those points than a bona fide medium format image won't they? I understand your point but I'm not quite ready to write off the inherent benefits of medium format images just yet. Pete. The actual resulting images from this technology do not show the startling increase in resolution that anyone reading the blurb would expect.......", "link": "https://www.l-camera-forum.com/topic/293871-is-the-s1s1r-a-good-backup-camera-for-sl/page/4/?tab=comments#comment-3693983", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on 2/28/2019 at 7:03 pm, farnz said: am i right in thinking that the s1r's 187 mp is interpolated from pixel-shifting operations rather than 187 million separate photodiodes? if so, artefacts will inevitably be created in the split seconds between the pixel-shift pulses where objects move and change -----> position !!!  relative to the particular pixels. also, presumably, the software selects and if necessary corrects for what it believes to be the appropriate value of any discrete pixels in any of the 4(?) temporary rasters. this being the case, then the inter-aliasing artefacts are likely to be visible at some magnification and will render a less precise image at those points than a bona fide medium format image won't they? i understand your point but i'm not quite ready to write off the inherent benefits of medium format images just yet. pete. the actual resulting images from this technology do not show the startling increase in resolution that anyone reading the blurb would expect.......", "sortedWord": "None", "identifyer": 47901, "year": "2019"}, {"Unnamed: 0": 435039, "autor": "BernardC", "date": 1557238320000, "content": "4 hours ago, thighslapper said: I have no problem with photographers who like the rendering of older lenses ...... but they have to accept that they are inferior optical designs and that they are effectively using undesirable optical properties for artistic expression. I have no problem with that. If an undesirable optical property makes a subject's skin look smoother, or if it flares in a pleasing way, then I am all-in. It doesn't work with all images, but when it does, it's magical. I know I am not alone. Ultra-expensive motion picture lenses often come in \"classic\" and \"modern\" varieties. It's easier, faster, and cheaper to \"bake-in\" a look when shooting, compared to trying to achieve the same look later. That's especially true of lens flares that change a lot with slight changes in camera position.", "link": "https://www.l-camera-forum.com/topic/296416-lumix-s-pro-5014-vs-50-summilux-sl-image-thread/page/3/?tab=comments#comment-3736252", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "4 hours ago, thighslapper said: i have no problem with photographers who like the rendering of older lenses ...... but they have to accept that they are inferior optical designs and that they are effectively using undesirable optical properties for artistic expression. i have no problem with that. if an undesirable optical property makes a subject's skin look smoother, or if it flares in a pleasing way, then i am all-in. it doesn't work with all images, but when it does, it's magical. i know i am not alone. ultra-expensive motion picture lenses often come in \"classic\" and \"modern\" varieties. it's easier, faster, and cheaper to \"bake-in\" a look when shooting, compared to trying to achieve the same look later. that's especially true of lens flares that change a lot with slight changes in camera -----> position !!! .", "sortedWord": "None", "identifyer": 48268, "year": "2019"}, {"Unnamed: 0": 435041, "autor": "hiepphotog", "date": 1557362700000, "content": "On 5/7/2019 at 8:12 AM, BernardC said: I have no problem with that. If an undesirable optical property makes a subject's skin look smoother, or if it flares in a pleasing way, then I am all-in. It doesn't work with all images, but when it does, it's magical. I know I am not alone. Ultra-expensive motion picture lenses often come in \"classic\" and \"modern\" varieties. It's easier, faster, and cheaper to \"bake-in\" a look when shooting, compared to trying to achieve the same look later. That's especially true of lens flares that change a lot with slight changes in camera position. I say few can maintain two sets of lenses with the \"modern\" varieties and the \"classic\" for that occasional magical requirement. If if anyone has done enough PP knows that if you want a certain look in post using one particular lens, it's only the first time that you need to spend a lot of hours to figure it out. The process should be quick for the next picture, especially if you know how to automate the process. I reduce my lens set to the essentials with no duplicates so that I can focus on shooting instead of wondering whether I should bring the Lux 50 ASPH instead of the non-ASPH... Of course that's just me.", "link": "https://www.l-camera-forum.com/topic/296416-lumix-s-pro-5014-vs-50-summilux-sl-image-thread/page/3/?tab=comments#comment-3737296", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on 5/7/2019 at 8:12 am, bernardc said: i have no problem with that. if an undesirable optical property makes a subject's skin look smoother, or if it flares in a pleasing way, then i am all-in. it doesn't work with all images, but when it does, it's magical. i know i am not alone. ultra-expensive motion picture lenses often come in \"classic\" and \"modern\" varieties. it's easier, faster, and cheaper to \"bake-in\" a look when shooting, compared to trying to achieve the same look later. that's especially true of lens flares that change a lot with slight changes in camera -----> position !!! . i say few can maintain two sets of lenses with the \"modern\" varieties and the \"classic\" for that occasional magical requirement. if if anyone has done enough pp knows that if you want a certain look in post using one particular lens, it's only the first time that you need to spend a lot of hours to figure it out. the process should be quick for the next picture, especially if you know how to automate the process. i reduce my lens set to the essentials with no duplicates so that i can focus on shooting instead of wondering whether i should bring the lux 50 asph instead of the non-asph... of course that's just me.", "sortedWord": "None", "identifyer": 48270, "year": "2019"}, {"Unnamed: 0": 435503, "autor": "LocalHero1953", "date": 1572114480000, "content": "Thanks, @Athornton. Are you also in a position to answer this question?", "link": "https://www.l-camera-forum.com/topic/299161-sigma-fp-%E2%80%93-worlds-smallest-lightest-mirrorless-full-frame-camera/page/6/?tab=comments#comment-3842695", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "thanks, @athornton. are you also in a -----> position !!!  to answer this question?", "sortedWord": "None", "identifyer": 48735, "year": "2019"}, {"Unnamed: 0": 436261, "autor": "Robert E", "date": 1564752780000, "content": "I was just out shooting in a small town public square yesterday, with my Leica SL and the Lumix Pro 70-200mm zoom. The AF on this lens with the SL is lighting fast and accurate. Doing near 200% crops of the images verified that. The color rendition is true to form and still retains the Leica IQ from the SL sensor. Holding the zoom with the left hand by the mount places your thumb in the correct position to rotate the zoom ring effortlessly without removing your eye from the EVF. This is truly the lens Leica should have made. 😉", "link": "https://www.l-camera-forum.com/topic/296219-does-the-ois-on-new-panasonic-pro-lenses-work-with-the-leica-sl/page/2/?tab=comments#comment-3789808", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "i was just out shooting in a small town public square yesterday, with my leica sl and the lumix pro 70-200mm zoom. the af on this lens with the sl is lighting fast and accurate. doing near 200% crops of the images verified that. the color rendition is true to form and still retains the leica iq from the sl sensor. holding the zoom with the left hand by the mount places your thumb in the correct -----> position !!!  to rotate the zoom ring effortlessly without removing your eye from the evf. this is truly the lens leica should have made. 😉", "sortedWord": "None", "identifyer": 49496, "year": "2019"}, {"Unnamed: 0": 436262, "autor": "vanhulsenbeek", "date": 1564756560000, "content": "1 hour ago, Robert E said: I was just out shooting in a small town public square yesterday, with my Leica SL and the Lumix Pro 70-200mm zoom. The AF on this lens with the SL is lighting fast and accurate. Doing near 200% crops of the images verified that. The color rendition is true to form and still retains the Leica IQ from the SL sensor. Holding the zoom with the left hand by the mount places your thumb in the correct position to rotate the zoom ring effortlessly without removing your eye from the EVF. This is truly the lens Leica should have made. 😉 Same experience with the Lumix 24-105. Fast AF, color and handling as if SL and lens grew up together.", "link": "https://www.l-camera-forum.com/topic/296219-does-the-ois-on-new-panasonic-pro-lenses-work-with-the-leica-sl/page/2/?tab=comments#comment-3789863", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "1 hour ago, robert e said: i was just out shooting in a small town public square yesterday, with my leica sl and the lumix pro 70-200mm zoom. the af on this lens with the sl is lighting fast and accurate. doing near 200% crops of the images verified that. the color rendition is true to form and still retains the leica iq from the sl sensor. holding the zoom with the left hand by the mount places your thumb in the correct -----> position !!!  to rotate the zoom ring effortlessly without removing your eye from the evf. this is truly the lens leica should have made. 😉 same experience with the lumix 24-105. fast af, color and handling as if sl and lens grew up together.", "sortedWord": "None", "identifyer": 49497, "year": "2019"}, {"Unnamed: 0": 436575, "autor": "Jared", "date": 1570315080000, "content": "You may have trouble getting answers to your question for a couple reasons. First, there aren’t all that many people in a position to compare the two cameras in question. Second, it’s not at all clear what you mean by “sharper”. At what viewing distance? With what screen size? With sharpening optimized for that particular screen resolution and viewing distance? What lens? With the S1R down-samples to the same pixel count as the S1 or left at native resolution? In general, I’d be shocked if whatever smoothing is applied to the S1R were so aggressive as to completely remove the additional contrast available with the higher pixel count. That would just be silly. But once you get above 20 megapixels or so it becomes really challenging to actually capture all the resolution a camera is truly capable of. For example, my SL with the 35mm Summicron SL lens shot at f/2 will routinely out-resolve my Hasselblad X1D II with a 45mm XCD lens at f/3.2 when shot at close focus. But that’s at close focus. And it still doesn’t have the dynamic range of the X1D. Still, that lens (among the best Leica makes for 135 format) can, at close focus, more than make up for what the SL gives up in megapixels. What lens would you use for your comparison? What aperture? Diffraction will become the dominant factor in resolution at a lower f-stop on the S1R than on the S1. Would you be comparing at f/8? F/5.6? F/2? Personally, I am quite happy with 24 megapixels for everything I do as long as I don’t have to crop much. The main advantage I see in the higher pixel count of the S1R (or my Q2, for that matter, which likely has the same sensor) is additional flexibility in cropping. Even with the Hasselblad, I enjoy the camera’s output more because of the dynamic range improvements and because the camera manages to hold color saturation in very fine detail much better than the SL rather than because of any additional resolution. Some people need every megapixel they can get. I don’t. They don’t really help me in my photography any more. Cropping is really about it.", "link": "https://www.l-camera-forum.com/topic/302140-does-the-s1-produce-sharper-images-than-the-s1r/?tab=comments#comment-3831619", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "you may have trouble getting answers to your question for a couple reasons. first, there aren’t all that many people in a -----> position !!!  to compare the two cameras in question. second, it’s not at all clear what you mean by “sharper”. at what viewing distance? with what screen size? with sharpening optimized for that particular screen resolution and viewing distance? what lens? with the s1r down-samples to the same pixel count as the s1 or left at native resolution? in general, i’d be shocked if whatever smoothing is applied to the s1r were so aggressive as to completely remove the additional contrast available with the higher pixel count. that would just be silly. but once you get above 20 megapixels or so it becomes really challenging to actually capture all the resolution a camera is truly capable of. for example, my sl with the 35mm summicron sl lens shot at f/2 will routinely out-resolve my hasselblad x1d ii with a 45mm xcd lens at f/3.2 when shot at close focus. but that’s at close focus. and it still doesn’t have the dynamic range of the x1d. still, that lens (among the best leica makes for 135 format) can, at close focus, more than make up for what the sl gives up in megapixels. what lens would you use for your comparison? what aperture? diffraction will become the dominant factor in resolution at a lower f-stop on the s1r than on the s1. would you be comparing at f/8? f/5.6? f/2? personally, i am quite happy with 24 megapixels for everything i do as long as i don’t have to crop much. the main advantage i see in the higher pixel count of the s1r (or my q2, for that matter, which likely has the same sensor) is additional flexibility in cropping. even with the hasselblad, i enjoy the camera’s output more because of the dynamic range improvements and because the camera manages to hold color saturation in very fine detail much better than the sl rather than because of any additional resolution. some people need every megapixel they can get. i don’t. they don’t really help me in my photography any more. cropping is really about it.", "sortedWord": "None", "identifyer": 49810, "year": "2019"}, {"Unnamed: 0": 436605, "autor": "tom.w.bn", "date": 1571041800000, "content": "Am 12.10.2019 um 17:03 schrieb scott kirkpatrick: I But I had only used about 20-30% of the battery's capacity in the hour with 40+ shots taken. Thanks for your experiment. For my taste this is still a lot of energy consumption. I use a workaround for years now: when I'm out and need GPS Data I document the position with a photo taken with my phone. This image is stored togehter with all the other photos from my \"real\" camera in the image catalogue. That is good enough for me.", "link": "https://www.l-camera-forum.com/topic/302346-comparing-panasonics-lumix-synch-to-leicas-fotos/?tab=comments#comment-3835612", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "am 12.10.2019 um 17:03 schrieb scott kirkpatrick: i but i had only used about 20-30% of the battery's capacity in the hour with 40+ shots taken. thanks for your experiment. for my taste this is still a lot of energy consumption. i use a workaround for years now: when i'm out and need gps data i document the -----> position !!!  with a photo taken with my phone. this image is stored togehter with all the other photos from my \"real\" camera in the image catalogue. that is good enough for me.", "sortedWord": "None", "identifyer": 49840, "year": "2019"}, {"Unnamed: 0": 436628, "autor": "PeterGA", "date": 1549246680000, "content": " He has quickly positioned himself as a serious 'influencer' on youtube and is one I enjoy watching - it helps that he can actually make a decent shot - that means a lot to me as the #1 filter I 'parse' when reading what people write in forums or Vlog on the net. I mean every site is crowded out by chest puffers who cant shoot but know the finer points of what screw was used to hold a lenshood in place and where it might have been sourced. To his credit he doesn't 'push' anyone to buy anything and has good and bad things to say ( quite rightly) about most cameras and lenses he reviews. In this way he is 'fair' - I think it is also interesting to note that whilst he uses Sony and Panasonic for his Vlogiing - he is probably the only Youtuber who has shelled out his hard earned on a Leica TL - now switching to a CL - I agree with him the CL may well be fairly described as the new M. Leica has chosen wisely in giving him time and access to the Leica gear- as he is a person who acknowledges the 'cost' but doesn't make it the 'deal breaker' most other tin hats on YouTube make of the issue. his interview with the head of CL product on youtube is very worthwhile watching as was his review of the SL and his interview with the head of Marketing. I just wish sometimes he would speak less when interviewing and listen just a tad more- however he has shown that he can get company people to speak something most youtuber types can't. Certainly a cut above the Tony Northrop types and their shrill blandness.", "link": "https://www.l-camera-forum.com/topic/293864-reviews-of-the-s1r-and-s1/?tab=comments#comment-3677705", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positioned", "selectorShort": "position", "MarkedSent": " he has quickly -----> positioned !!!  himself as a serious 'influencer' on youtube and is one i enjoy watching - it helps that he can actually make a decent shot - that means a lot to me as the #1 filter i 'parse' when reading what people write in forums or vlog on the net. i mean every site is crowded out by chest puffers who cant shoot but know the finer points of what screw was used to hold a lenshood in place and where it might have been sourced. to his credit he doesn't 'push' anyone to buy anything and has good and bad things to say ( quite rightly) about most cameras and lenses he reviews. in this way he is 'fair' - i think it is also interesting to note that whilst he uses sony and panasonic for his vlogiing - he is probably the only youtuber who has shelled out his hard earned on a leica tl - now switching to a cl - i agree with him the cl may well be fairly described as the new m. leica has chosen wisely in giving him time and access to the leica gear- as he is a person who acknowledges the 'cost' but doesn't make it the 'deal breaker' most other tin hats on youtube make of the issue. his interview with the head of cl product on youtube is very worthwhile watching as was his review of the sl and his interview with the head of marketing. i just wish sometimes he would speak less when interviewing and listen just a tad more- however he has shown that he can get company people to speak something most youtuber types can't. certainly a cut above the tony northrop types and their shrill blandness.", "sortedWord": "None", "identifyer": 49863, "year": "2019"}, {"Unnamed: 0": 436932, "autor": "ron777", "date": 1563316920000, "content": "5 hours ago, ImmerDraussen said: Maybe some of my comments have been misleading: Whole ISO range for me means 100 to 1600 ASA. I should have been more precise. With noise I mean that elements that have no texture (blue sky) have some kind of grainy structure. This is visible also at low ISO and becomes worse the higher the ISO setting are. The SL is better here (I believe). It possible to remove it in LR, but it always reduces the textures of those things that have a texture and the pictures look more like plastic. My reference for is the 645Z which seems to be completely inert for this at low ISO and is very moderate at 1600. For me picture taken with this camera look most natural. Andreas How are you viewing your images? I have taken several hundred images with the S1R where a blue sky occupies a dominant position. I do not use LR but, rather, Capture one Pro 12. Most of these images had been acquired with an ISO of between 200 and 800 and only those that employed a circular polarizer were taken with an ISO close to the 1600 range. Viewed at 100% on a 27\" calibrated Mac monitor via C1, there is no visible noise. Perhaps LR is a factor? I'd have to agree with thigh slapper. For myself, the S1R is a fantastic camera and I have no misgivings about having sold my SL. My crystal ball is out for repair, but regardless the eventual SL2's offerings, I cannot imagine that it will fulfill my needs any more so than the S1R. And if it turns out to be an S1R clone, the red dot will not sway me. Edited July 16, 2019 by ron777", "link": "https://www.l-camera-forum.com/topic/299320-a-two-weeks-trip-to-the-alps-with-sl-and-s1r/?tab=comments#comment-3779780", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "5 hours ago, immerdraussen said: maybe some of my comments have been misleading: whole iso range for me means 100 to 1600 asa. i should have been more precise. with noise i mean that elements that have no texture (blue sky) have some kind of grainy structure. this is visible also at low iso and becomes worse the higher the iso setting are. the sl is better here (i believe). it possible to remove it in lr, but it always reduces the textures of those things that have a texture and the pictures look more like plastic. my reference for is the 645z which seems to be completely inert for this at low iso and is very moderate at 1600. for me picture taken with this camera look most natural. andreas how are you viewing your images? i have taken several hundred images with the s1r where a blue sky occupies a dominant -----> position !!! . i do not use lr but, rather, capture one pro 12. most of these images had been acquired with an iso of between 200 and 800 and only those that employed a circular polarizer were taken with an iso close to the 1600 range. viewed at 100% on a 27\" calibrated mac monitor via c1, there is no visible noise. perhaps lr is a factor? i'd have to agree with thigh slapper. for myself, the s1r is a fantastic camera and i have no misgivings about having sold my sl. my crystal ball is out for repair, but regardless the eventual sl2's offerings, i cannot imagine that it will fulfill my needs any more so than the s1r. and if it turns out to be an s1r clone, the red dot will not sway me. edited july 16, 2019 by ron777", "sortedWord": "None", "identifyer": 50167, "year": "2019"}, {"Unnamed: 0": 437278, "autor": "Michael Geschlecht", "date": 1557781440000, "content": "Hello Greg, Welcome to the Forum, For many years I used a full size tripod with a ball head for all kinds of things when I was in the field.. A ball head, or 1 of its derivatives, is the most practical tripod HEAD in the field. In a studio or for some sort of still life situation you might use some other type of tripod head. I came across a Leitz medium sized, large ball head (Leitz large ball heads have varied in size over the years.) which was & still is in pretty much new condition even though it is probably over 60 years old & has been used extensively. These ball heads are built to last pretty much forever if you respect them when you use them. And they hold well with a LIGHTLY tightened turn of the handle. Even with a 135mm F4, Tele-Elmar & the camera turned to a vertical position & the camera baseplate attached to the ball head. Just remember that like with a full sized tripod: To adjust the ball so that the center of gravity of the camera/lens combination (Not the lens alone.) is over the longest leg. I decided to & did build my own tabletop tripod which would be similar to a Leitz tabletop tripod. But it is cosmetically challenged. I added soft, non-marking slippers (Important) & a cable release (Kodak #1). I found that this combination more & more replaced a full sized tripod for some of the same reasons that Leicas & cameras like them replaced Speed Graphics: A small tabletop tripod can't do everything that a full sized tripod can but the more that you use it, the more ways you find to use it. And it is easier to have with you & it is easier to use. So much so that I don't even take a full sized tripod to much of anywhere with me anymore. Not even much for still life's anymore. You can use a small solid table tripod, with soft, non-marking slippers, with a large ball head & a cable release: Against a wall (Even a white painted wall when it has soft, non-marking slippers.). Or inside (Or above.) a door frame. Against a rock. Or a tree. Or on a car with the engine turned off. And: Even on the top of a table. It quickly collapses & comes apart to fit into an actual pocket. And the more you use it:The more ways you find to use it. Best Regards, Michael Edited May 13, 2019 by Michael Geschlecht", "link": "https://www.l-camera-forum.com/topic/297192-travel-tripod/?tab=comments#comment-3740144", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "hello greg, welcome to the forum, for many years i used a full size tripod with a ball head for all kinds of things when i was in the field.. a ball head, or 1 of its derivatives, is the most practical tripod head in the field. in a studio or for some sort of still life situation you might use some other type of tripod head. i came across a leitz medium sized, large ball head (leitz large ball heads have varied in size over the years.) which was & still is in pretty much new condition even though it is probably over 60 years old & has been used extensively. these ball heads are built to last pretty much forever if you respect them when you use them. and they hold well with a lightly tightened turn of the handle. even with a 135mm f4, tele-elmar & the camera turned to a vertical -----> position !!!  & the camera baseplate attached to the ball head. just remember that like with a full sized tripod: to adjust the ball so that the center of gravity of the camera/lens combination (not the lens alone.) is over the longest leg. i decided to & did build my own tabletop tripod which would be similar to a leitz tabletop tripod. but it is cosmetically challenged. i added soft, non-marking slippers (important) & a cable release (kodak #1). i found that this combination more & more replaced a full sized tripod for some of the same reasons that leicas & cameras like them replaced speed graphics: a small tabletop tripod can't do everything that a full sized tripod can but the more that you use it, the more ways you find to use it. and it is easier to have with you & it is easier to use. so much so that i don't even take a full sized tripod to much of anywhere with me anymore. not even much for still life's anymore. you can use a small solid table tripod, with soft, non-marking slippers, with a large ball head & a cable release: against a wall (even a white painted wall when it has soft, non-marking slippers.). or inside (or above.) a door frame. against a rock. or a tree. or on a car with the engine turned off. and: even on the top of a table. it quickly collapses & comes apart to fit into an actual pocket. and the more you use it:the more ways you find to use it. best regards, michael edited may 13, 2019 by michael geschlecht", "sortedWord": "None", "identifyer": 50515, "year": "2019"}, {"Unnamed: 0": 437280, "autor": "Greg Haag", "date": 1557786000000, "content": "1 hour ago, Michael Geschlecht said: Hello Greg, Welcome to the Forum, For many years I used a full size tripod with a ball head for all kinds of things when I was in the field.. A ball head, or 1 of its derivatives, is the most practical tripod HEAD in the field. In a studio or for some sort of still life situation you might use some other type of tripod head. I came across a Leitz medium sized, large ball head (Leitz large ball heads have varied in size over the years.) which was & still is in pretty much new condition even though it is probably over 60 years old & has been used extensively. These ball heads are built to last pretty much forever if you respect them when you use them. And they hold well with a LIGHTLY tightened turn of the handle. Even with a 135mm F4, Tele-Elmar & the camera turned to a vertical position & the camera baseplate attached to the ball head. Just remember that like with a full sized tripod: To adjust the ball so that the center of gravity of the camera/lens combination (Not the lens alone.) is over the longest leg. I decided to & did build my own tabletop tripod which would be similar to a Leitz tabletop tripod. But it is cosmetically challenged. I added soft, non-marking slippers (Important) & a cable release (Kodak #1). I found that this combination more & more replaced a full sized tripod for some of the same reasons that Leicas & cameras like them replaced Speed Graphics: A small tabletop tripod can't do everything that a full sized tripod can but the more that you use it, the more ways you find to use it. And it is easier to have with you & it is easier to use. So much so that I don't even take a full sized tripod to much of anywhere with me anymore. Not even much for still life's anymore. You can use a small solid table tripod, with soft, non-marking slippers, with a large ball head & a cable release: Against a wall (Even a white painted wall when it has soft, non-marking slippers.). Or inside (Or above.) a door frame. Against a rock. Or a tree. Or on a car with the engine turned off. And: Even on the top of a table. It quickly collapses & comes apart to fit into an actual pocket. And the more you use it:The more ways you find to use it. Best Regards, Michael Thank you for the welcome and your insights Michael, I will take a look at those!", "link": "https://www.l-camera-forum.com/topic/297192-travel-tripod/?tab=comments#comment-3740173", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "1 hour ago, michael geschlecht said: hello greg, welcome to the forum, for many years i used a full size tripod with a ball head for all kinds of things when i was in the field.. a ball head, or 1 of its derivatives, is the most practical tripod head in the field. in a studio or for some sort of still life situation you might use some other type of tripod head. i came across a leitz medium sized, large ball head (leitz large ball heads have varied in size over the years.) which was & still is in pretty much new condition even though it is probably over 60 years old & has been used extensively. these ball heads are built to last pretty much forever if you respect them when you use them. and they hold well with a lightly tightened turn of the handle. even with a 135mm f4, tele-elmar & the camera turned to a vertical -----> position !!!  & the camera baseplate attached to the ball head. just remember that like with a full sized tripod: to adjust the ball so that the center of gravity of the camera/lens combination (not the lens alone.) is over the longest leg. i decided to & did build my own tabletop tripod which would be similar to a leitz tabletop tripod. but it is cosmetically challenged. i added soft, non-marking slippers (important) & a cable release (kodak #1). i found that this combination more & more replaced a full sized tripod for some of the same reasons that leicas & cameras like them replaced speed graphics: a small tabletop tripod can't do everything that a full sized tripod can but the more that you use it, the more ways you find to use it. and it is easier to have with you & it is easier to use. so much so that i don't even take a full sized tripod to much of anywhere with me anymore. not even much for still life's anymore. you can use a small solid table tripod, with soft, non-marking slippers, with a large ball head & a cable release: against a wall (even a white painted wall when it has soft, non-marking slippers.). or inside (or above.) a door frame. against a rock. or a tree. or on a car with the engine turned off. and: even on the top of a table. it quickly collapses & comes apart to fit into an actual pocket. and the more you use it:the more ways you find to use it. best regards, michael thank you for the welcome and your insights michael, i will take a look at those!", "sortedWord": "None", "identifyer": 50517, "year": "2019"}, {"Unnamed: 0": 437474, "autor": "Stuart Richardson", "date": 1555967100000, "content": "I have not had a chance to test it compared to anything else, but in my very simple test, it looked great. I think that the resolution will depend most on the quality of the lens and the stability of the platform. I do not see any reason to doubt their claim that it is 96 megapixels, since it is literally shifting the sensor into 8 different positions (which would mean 192 possible megapixels of data) and then rendering that into one large 96mp file.", "link": "https://www.l-camera-forum.com/topic/296373-does-high-resolution-mode-work-with-manual-focus-lens/?tab=comments#comment-3727529", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "i have not had a chance to test it compared to anything else, but in my very simple test, it looked great. i think that the resolution will depend most on the quality of the lens and the stability of the platform. i do not see any reason to doubt their claim that it is 96 megapixels, since it is literally shifting the sensor into 8 different -----> positions !!!  (which would mean 192 possible megapixels of data) and then rendering that into one large 96mp file.", "sortedWord": "None", "identifyer": 50714, "year": "2019"}, {"Unnamed: 0": 437731, "autor": "tom0511", "date": 1555257840000, "content": " vor 7 Stunden schrieb FlashGordonPhotography: Well, I've had my camera for two days. I'm very pleased. Spectacular EVF. Lovely shutter sound and you can turn off LENR. It also seems all my SL lenses focus faster with this processor. The level of detail with the SL lenses is epic. This week I'll do some tests against my Z7, A7R3 and X1D. Things look good so far. Gordon I am interested about your conclusions. I must say that even though I really like the size of the Nikon Z and the f 1.8 lenses I did change my mind and will probably stay with SL Leica/Pana (allready own many SL lenses and even though its all on the heavy side I really am used to the look). In a moment of GAS I added a S1r+24-105 2 days ago. Even though my first impression some days before I wanst too impressed by the body size, I now feel more compfortable with it. Specially with the bigger lenses and handles quite well. Its loaded with functions but I like that most buttons are clearly labled - and most buttons are in an intuitive position. The AF seems really more advanced than that of the SL, and I agree the shutter is nice damped. There is one small thing: I find the wheels could be a little stiffer. My first impression about the IQ is that color and tonality is \"nice\" and pretty \"neutral\" what I do like.", "link": "https://www.l-camera-forum.com/topic/296004-s1-vs-s1r-vs-sl/page/2/?tab=comments#comment-3722291", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " vor 7 stunden schrieb flashgordonphotography: well, i've had my camera for two days. i'm very pleased. spectacular evf. lovely shutter sound and you can turn off lenr. it also seems all my sl lenses focus faster with this processor. the level of detail with the sl lenses is epic. this week i'll do some tests against my z7, a7r3 and x1d. things look good so far. gordon i am interested about your conclusions. i must say that even though i really like the size of the nikon z and the f 1.8 lenses i did change my mind and will probably stay with sl leica/pana (allready own many sl lenses and even though its all on the heavy side i really am used to the look). in a moment of gas i added a s1r+24-105 2 days ago. even though my first impression some days before i wanst too impressed by the body size, i now feel more compfortable with it. specially with the bigger lenses and handles quite well. its loaded with functions but i like that most buttons are clearly labled - and most buttons are in an intuitive -----> position !!! . the af seems really more advanced than that of the sl, and i agree the shutter is nice damped. there is one small thing: i find the wheels could be a little stiffer. my first impression about the iq is that color and tonality is \"nice\" and pretty \"neutral\" what i do like.", "sortedWord": "None", "identifyer": 50972, "year": "2019"}, {"Unnamed: 0": 439083, "autor": "dancook", "date": 1556724960000, "content": "1 hour ago, FHPdoc said: Dan, Just for fun: How about doing a 75mm-equivalent crop on the first photo in your gallery series, zeroing in on the globe? Would love to see how clear the resolution is of you taking the shot! Thanks so much in advance! A different image, but one where I focused on the globe from about the same position and it wasn't as close to edge of frame Wouldn't say it's 75mm crop, and it's obviously not from the centre - but it's a 1547 x 1547 crop --img-- L1080445 by Daniel Cook, on Flickr Edited May 1, 2019 by dancook", "link": "https://www.l-camera-forum.com/topic/303026-leica-q2-images-post-them-here/page/16/?tab=comments#comment-3732600", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "1 hour ago, fhpdoc said: dan, just for fun: how about doing a 75mm-equivalent crop on the first photo in your gallery series, zeroing in on the globe? would love to see how clear the resolution is of you taking the shot! thanks so much in advance! a different image, but one where i focused on the globe from about the same -----> position !!!  and it wasn't as close to edge of frame wouldn't say it's 75mm crop, and it's obviously not from the centre - but it's a 1547 x 1547 crop --img-- l1080445 by daniel cook, on flickr edited may 1, 2019 by dancook", "sortedWord": "None", "identifyer": 52374, "year": "2019"}, {"Unnamed: 0": 441703, "autor": "tnturnerx1", "date": 1552943760000, "content": "14 hours ago, jaapv said: Peak Design straps use the same metal-free design as the wrist leash. I use them for all my cameras. Both Leica a-la-carte straps and Leicatime straps use leather camera protectors to prevent the rings to come into contact with the camera. The Peak Design straps have the same metal-free design at the CAMERA end, and it's a good design. The metal I refer to is the metal on the strap itself, which when placed in a camera bag along with the camera, could scratch the camera if the metal clasps are not someone placed in a position to keep it away from the camera body.", "link": "https://www.l-camera-forum.com/topic/295309-avoiding-strap-ring-scratches/?tab=comments#comment-3705306", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "14 hours ago, jaapv said: peak design straps use the same metal-free design as the wrist leash. i use them for all my cameras. both leica a-la-carte straps and leicatime straps use leather camera protectors to prevent the rings to come into contact with the camera. the peak design straps have the same metal-free design at the camera end, and it's a good design. the metal i refer to is the metal on the strap itself, which when placed in a camera bag along with the camera, could scratch the camera if the metal clasps are not someone placed in a -----> position !!!  to keep it away from the camera body.", "sortedWord": "None", "identifyer": 5052, "year": "2019"}, {"Unnamed: 0": 441704, "autor": "kyriacos", "date": 1552944840000, "content": "21 minutes ago, tnturnerx1 said: The Peak Design straps have the same metal-free design at the CAMERA end, and it's a good design. The metal I refer to is the metal on the strap itself, which when placed in a camera bag along with the camera, could scratch the camera if the metal clasps are not someone placed in a position to keep it away from the camera body. I like their adjustable strap but it makes me wonder why they just didn't coat the metal with some rubber. At least that would prevent scratches. Getting that close to my M240 (which i no longer own) was a no-go. Just an accident waiting to happen in my opinion 😅. Have you looked at the Artisan & Artist adjustable strap (the ACAM-25ER seems pretty slim)? They have another size i think. It's similar, made of nylon but it's metal-free. Thinking about that for my Q2 personally. Maybe that helps me figure out what length of strap i prefer finally heh. Edited March 18, 2019 by kyriacos", "link": "https://www.l-camera-forum.com/topic/295309-avoiding-strap-ring-scratches/?tab=comments#comment-3705326", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "21 minutes ago, tnturnerx1 said: the peak design straps have the same metal-free design at the camera end, and it's a good design. the metal i refer to is the metal on the strap itself, which when placed in a camera bag along with the camera, could scratch the camera if the metal clasps are not someone placed in a -----> position !!!  to keep it away from the camera body. i like their adjustable strap but it makes me wonder why they just didn't coat the metal with some rubber. at least that would prevent scratches. getting that close to my m240 (which i no longer own) was a no-go. just an accident waiting to happen in my opinion 😅. have you looked at the artisan & artist adjustable strap (the acam-25er seems pretty slim)? they have another size i think. it's similar, made of nylon but it's metal-free. thinking about that for my q2 personally. maybe that helps me figure out what length of strap i prefer finally heh. edited march 18, 2019 by kyriacos", "sortedWord": "None", "identifyer": 5053, "year": "2019"}, {"Unnamed: 0": 441707, "autor": "marchyman", "date": 1553030340000, "content": "On 3/18/2019 at 2:16 PM, tnturnerx1 said: The Peak Design straps have the same metal-free design at the CAMERA end, and it's a good design. The metal I refer to is the metal on the strap itself, which when placed in a camera bag along with the camera, could scratch the camera if the metal clasps are not someone placed in a position to keep it away from the camera body. The PD Leash does not use the metal adjustment buckle that their strap (the Slide) does. I use the Cuff with my Q and the Leash with my M. Edit: I've got the original versions of both. I understand there has been a re-design. Edited March 19, 2019 by marchyman", "link": "https://www.l-camera-forum.com/topic/295309-avoiding-strap-ring-scratches/?tab=comments#comment-3705921", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "on 3/18/2019 at 2:16 pm, tnturnerx1 said: the peak design straps have the same metal-free design at the camera end, and it's a good design. the metal i refer to is the metal on the strap itself, which when placed in a camera bag along with the camera, could scratch the camera if the metal clasps are not someone placed in a -----> position !!!  to keep it away from the camera body. the pd leash does not use the metal adjustment buckle that their strap (the slide) does. i use the cuff with my q and the leash with my m. edit: i've got the original versions of both. i understand there has been a re-design. edited march 19, 2019 by marchyman", "sortedWord": "None", "identifyer": 5056, "year": "2019"}, {"Unnamed: 0": 442947, "autor": "zampelis", "date": 1555600440000, "content": "5 hours ago, Jaclo said: You're photographs are what got me interested in the Q but having seen what you have gone through is disturbing. This issue the EVF issues, bad on/off switch on QP, floating focus on CL, very slow repairs, etc, I would thing at these prices you could at least expect very fast repairs but, maybe Leica is to focused on watches these days?? Thank you so much for your kind words Jaclo. Well some times I just think that all these are just first world problems! But then they can get pretty annoying Here is a video demonstrating the problem: https://www.youtube.com/watch?v=d99Ag6_1Xho&feature=youtu.be In this video from 00:00 - 00:20 you can see how the button works when in the “bad” placement. I focus on the keyboard by half pressing it, I turn the camera with the button half pressed on my laptop screen and then I press fully the button. At that point the camera should instantly take a shot of the blurry screen. Instead of that it tries again to focus on the screen and some times it doesn’t even take a photo when it can’t focus. Then from 00:20 - 00:42 I rotate the button to the “good” placement (you can see the marks on the shutter button that I added after lots of try and error in order to be able to identify it easily). Now it works as expected. The focus locks on the keyboard when half pressed and when fully pressed on the screen, it takes a photo of it even when it is blurry without trying to focus, as the focus has been properly locked. Then from 00:42 till the end of the video I place it again in a “bad” position and it looses the focus lock again.. Edited April 18, 2019 by zampelis", "link": "https://www.l-camera-forum.com/topic/292183-af-not-locking-properly/page/2/?tab=comments#comment-3724810", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "5 hours ago, jaclo said: you're photographs are what got me interested in the q but having seen what you have gone through is disturbing. this issue the evf issues, bad on/off switch on qp, floating focus on cl, very slow repairs, etc, i would thing at these prices you could at least expect very fast repairs but, maybe leica is to focused on watches these days?? thank you so much for your kind words jaclo. well some times i just think that all these are just first world problems! but then they can get pretty annoying here is a video demonstrating the problem: https://www.youtube.com/watch?v=d99ag6_1xho&feature=youtu.be in this video from 00:00 - 00:20 you can see how the button works when in the “bad” placement. i focus on the keyboard by half pressing it, i turn the camera with the button half pressed on my laptop screen and then i press fully the button. at that point the camera should instantly take a shot of the blurry screen. instead of that it tries again to focus on the screen and some times it doesn’t even take a photo when it can’t focus. then from 00:20 - 00:42 i rotate the button to the “good” placement (you can see the marks on the shutter button that i added after lots of try and error in order to be able to identify it easily). now it works as expected. the focus locks on the keyboard when half pressed and when fully pressed on the screen, it takes a photo of it even when it is blurry without trying to focus, as the focus has been properly locked. then from 00:42 till the end of the video i place it again in a “bad” -----> position !!!  and it looses the focus lock again.. edited april 18, 2019 by zampelis", "sortedWord": "None", "identifyer": 6325, "year": "2019"}, {"Unnamed: 0": 447321, "autor": "GunZenBomZ", "date": 1556542020000, "content": " Hello everyone, I've just brought a 2018 X-U camera. And the gentleman I got it from kindly allowed me some wonderful gifts with it. These images are hosted on the ducati forums uk, where I am a member. --img--  /applications/core/interface/js/spacer.png\"> --img--  /applications/core/interface/js/spacer.png\"> --img--  /applications/core/interface/js/spacer.png\"> --img--  /applications/core/interface/js/spacer.png\"> However I'm genuinely over the moon about my first proper adventure camera. Leica X-U My two fold question is what memory card maximum speed/spec can this camera handle? And what is the actual official spec of a Leica viewfinder for this model? Patrick aka GunZenBomZ Edited April 29, 2019 by GunZenBomZ text not in correct position", "link": "https://www.l-camera-forum.com/topic/296725-leica-x-u-memory-card-details/?tab=comments#comment-3731417", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": " hello everyone, i've just brought a 2018 x-u camera. and the gentleman i got it from kindly allowed me some wonderful gifts with it. these images are hosted on the ducati forums uk, where i am a member. --img--  /applications/core/interface/js/spacer.png\"> --img--  /applications/core/interface/js/spacer.png\"> --img--  /applications/core/interface/js/spacer.png\"> --img--  /applications/core/interface/js/spacer.png\"> however i'm genuinely over the moon about my first proper adventure camera. leica x-u my two fold question is what memory card maximum speed/spec can this camera handle? and what is the actual official spec of a leica viewfinder for this model? patrick aka gunzenbomz edited april 29, 2019 by gunzenbomz text not in correct -----> position !!! ", "sortedWord": "None", "identifyer": 10795, "year": "2019"}, {"Unnamed: 0": 447387, "autor": "pgk", "date": 1553070840000, "content": "The Nikonos lenses are all such that they sit in the camera in their correct position when 'sprung' into place - unlike virtually any other mount whatsoever. So its not a simple conversion task of a mount adapter (if you get hold of the rear section of the lens behind the 'O' ring you will find that it will pullout against spring pressure - this allows it to be accurately positioned inside the camera. The sealing 'O' ring probably allows too much leeway for accurate positioning otherwise). Some lenses have been converted to Leica but this involves removal of the entire optics and remounting them in a new mount. FWIW a Nikonos close-up lens might be usable on the Ewa Marine bag with ingenuity and would mean that the X1 could be used as normal with the close-up lens being placed in front of it underwater. The Nikonos close-up lenses were a quality purpose made underwater lens (a 'flooded' lens requiring water in front and behind) and are very cheap now. I'd guess that a simple ring would allow them to be fitted looking at dunk's photo of the front of the Ewa - I think that this would be a good solution myself even though it means using a Nikon part! Lastly, the Nikonos 35mm lens is the same as in the 1950s but if you want one in Leica fit, a late Nikonos lens is coated so this would be the one to convert.", "link": "https://www.l-camera-forum.com/topic/295055-leica-x1-underwater-housing/page/2/?tab=comments#comment-3706114", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "the nikonos lenses are all such that they sit in the camera in their correct -----> position !!!  when 'sprung' into place - unlike virtually any other mount whatsoever. so its not a simple conversion task of a mount adapter (if you get hold of the rear section of the lens behind the 'o' ring you will find that it will pullout against spring pressure - this allows it to be accurately positioned inside the camera. the sealing 'o' ring probably allows too much leeway for accurate positioning otherwise). some lenses have been converted to leica but this involves removal of the entire optics and remounting them in a new mount. fwiw a nikonos close-up lens might be usable on the ewa marine bag with ingenuity and would mean that the x1 could be used as normal with the close-up lens being placed in front of it underwater. the nikonos close-up lenses were a quality purpose made underwater lens (a 'flooded' lens requiring water in front and behind) and are very cheap now. i'd guess that a simple ring would allow them to be fitted looking at dunk's photo of the front of the ewa - i think that this would be a good solution myself even though it means using a nikon part! lastly, the nikonos 35mm lens is the same as in the 1950s but if you want one in leica fit, a late nikonos lens is coated so this would be the one to convert.", "sortedWord": "None", "identifyer": 10861, "year": "2019"}, {"Unnamed: 0": 447390, "autor": "Michael Geschlecht", "date": 1553103420000, "content": "9 hours ago, pgk said: The Nikonos lenses are all such that they sit in the camera in their correct position when 'sprung' into place - unlike virtually any other mount whatsoever. So its not a simple conversion task of a mount adapter (if you get hold of the rear section of the lens behind the 'O' ring you will find that it will pullout against spring pressure - this allows it to be accurately positioned inside the camera. The sealing 'O' ring probably allows too much leeway for accurate positioning otherwise). Some lenses have been converted to Leica but this involves removal of the entire optics and remounting them in a new mount. FWIW a Nikonos close-up lens might be usable on the Ewa Marine bag with ingenuity and would mean that the X1 could be used as normal with the close-up lens being placed in front of it underwater. The Nikonos close-up lenses were a quality purpose made underwater lens (a 'flooded' lens requiring water in front and behind) and are very cheap now. I'd guess that a simple ring would allow them to be fitted looking at dunk's photo of the front of the Ewa - I think that this would be a good solution myself even though it means using a Nikon part! Lastly, the Nikonos 35mm lens is the same as in the 1950s but if you want one in Leica fit, a late Nikonos lens is coated so this would be the one to convert. Hello Paul, Other cameras might be more convenient for closeups than a Nikonos but in & out of the water, including 1/2 in & 1/2 out, at the same regular distances that you would use any other 35mm lens out of the water on a nice day, or in a snowstorm, or in a muddy or/& a dusty place, or in a rainstorm: A Nikonos is easy to use & very convenient. By the way, A 1968 Nikkor 35mm, F2.5 lens, which is coated, produces images on par with a 35mm, F2 Summicron, Version I (Also a design from the 1950's.) when used at medium apertures. It is essentially the same Double Gauss optical formula as a 35mm, F2.8 Summaron produced at the same time period. Best Regards, Michael Edited March 20, 2019 by Michael Geschlecht", "link": "https://www.l-camera-forum.com/topic/295055-leica-x1-underwater-housing/page/2/?tab=comments#comment-3706411", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "position", "selectorShort": "position", "MarkedSent": "9 hours ago, pgk said: the nikonos lenses are all such that they sit in the camera in their correct -----> position !!!  when 'sprung' into place - unlike virtually any other mount whatsoever. so its not a simple conversion task of a mount adapter (if you get hold of the rear section of the lens behind the 'o' ring you will find that it will pullout against spring pressure - this allows it to be accurately positioned inside the camera. the sealing 'o' ring probably allows too much leeway for accurate positioning otherwise). some lenses have been converted to leica but this involves removal of the entire optics and remounting them in a new mount. fwiw a nikonos close-up lens might be usable on the ewa marine bag with ingenuity and would mean that the x1 could be used as normal with the close-up lens being placed in front of it underwater. the nikonos close-up lenses were a quality purpose made underwater lens (a 'flooded' lens requiring water in front and behind) and are very cheap now. i'd guess that a simple ring would allow them to be fitted looking at dunk's photo of the front of the ewa - i think that this would be a good solution myself even though it means using a nikon part! lastly, the nikonos 35mm lens is the same as in the 1950s but if you want one in leica fit, a late nikonos lens is coated so this would be the one to convert. hello paul, other cameras might be more convenient for closeups than a nikonos but in & out of the water, including 1/2 in & 1/2 out, at the same regular distances that you would use any other 35mm lens out of the water on a nice day, or in a snowstorm, or in a muddy or/& a dusty place, or in a rainstorm: a nikonos is easy to use & very convenient. by the way, a 1968 nikkor 35mm, f2.5 lens, which is coated, produces images on par with a 35mm, f2 summicron, version i (also a design from the 1950's.) when used at medium apertures. it is essentially the same double gauss optical formula as a 35mm, f2.8 summaron produced at the same time period. best regards, michael edited march 20, 2019 by michael geschlecht", "sortedWord": "None", "identifyer": 10864, "year": "2019"}, {"Unnamed: 0": 452178, "autor": "wda", "date": 1563568620000, "content": "10 hours ago, jcraf said: Hi David Yes, it is. I think it's a wonderful piece of kit. Like many here, I have other Leica kit to choose from, but I think for travel the VLux is hard to beat. I wandered around London in the heat last week with my SL and 24-90. And I was knackered at the end of it. Now, I'm sure the results might have been better than the VLux (in hands other than mine anyhow), but in my amateur hands I think the VLux would have done as good a job in reality. And although one could not call the VLux cheap, I'd sooner drop or lose it than I would any of my M kit or the SL! Regards John Thank you John. A wise choice. The excellent pictures shown in this thread demonstrate how versatile the camera can be with some highly impressive close-ups. Much depends on the expected destiny of our individual photography. Certainly for amateur (that is non-professional) photography, the V-Lux is more than capable of returning extremely good results. I bought mine mainly to help me identify birds in the garden, particularly migrants who often spend no more than an hour or so per year while in transit. But I have been inspired by the excellent results you and others attain on a regular basis. The V-Lux is a little on the bulky side, but saves significantly on weight; is well-made and highly capable in some challenging situations. Only today, in pouring rain I noticed a bird on the lawn apparently in distress. I grabbed the V-Lux and shot through heavily rain-impaired double-glazed windows only to discover that a pigeon seemed to be having a shower in yoga positions. The picture is of low quality and not in this league to be shown. But it served my purpose of solving a mystery in nature without even leaving the house.. Edited July 19, 2019 by wda", "link": "https://www.l-camera-forum.com/topic/246032-please-post-v-lux-114-pictures-here/page/10/?tab=comments#comment-3781654", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": "10 hours ago, jcraf said: hi david yes, it is. i think it's a wonderful piece of kit. like many here, i have other leica kit to choose from, but i think for travel the vlux is hard to beat. i wandered around london in the heat last week with my sl and 24-90. and i was knackered at the end of it. now, i'm sure the results might have been better than the vlux (in hands other than mine anyhow), but in my amateur hands i think the vlux would have done as good a job in reality. and although one could not call the vlux cheap, i'd sooner drop or lose it than i would any of my m kit or the sl! regards john thank you john. a wise choice. the excellent pictures shown in this thread demonstrate how versatile the camera can be with some highly impressive close-ups. much depends on the expected destiny of our individual photography. certainly for amateur (that is non-professional) photography, the v-lux is more than capable of returning extremely good results. i bought mine mainly to help me identify birds in the garden, particularly migrants who often spend no more than an hour or so per year while in transit. but i have been inspired by the excellent results you and others attain on a regular basis. the v-lux is a little on the bulky side, but saves significantly on weight; is well-made and highly capable in some challenging situations. only today, in pouring rain i noticed a bird on the lawn apparently in distress. i grabbed the v-lux and shot through heavily rain-impaired double-glazed windows only to discover that a pigeon seemed to be having a shower in yoga -----> positions !!! . the picture is of low quality and not in this league to be shown. but it served my purpose of solving a mystery in nature without even leaving the house.. edited july 19, 2019 by wda", "sortedWord": "None", "identifyer": 15732, "year": "2019"}, {"Unnamed: 0": 452717, "autor": "colonel", "date": 1547033460000, "content": " I'll do a more in-depth analysis later (just help to steam up this sub-forum a bit ) but just penning some initial thoughts here Plus: Switch on zoom has improved the speed Well made, lovely package Lens doesn't wobble when extended D-Lux 7 has new dust resistant lens system (over 109) Despite crowing about EVF, pretty good generally if not up to Sony standards Lens unexpectedly sharp wide open (f1/7) in centre and pretty much on zoom (f2.8). (24-27mm f1.7 / 28mm-f2.0 / 29-31mm f2.1 / 32-39mm f2.2-2.4 / 40-51mm f2.5-2.8 / 51mm~ f2.8 Lens zoom can be set step zoom mode for familiar zoom positions Front control ring cool - can be used for step zoom Panasonic has speeded up focus JPG engine much improved, both colours and dealing with noise reduction on higher ISOs. One can almost think of using them now ISO 1600 perfectly usable at picture level, e.g. Handheld building nightscapes at 1600 look good High ISO noise control not bad, grain is more filmlike and NR better then before under JPG. Avoids the \"digital\" type noise I used to get from the Olympus system All functions benefit from faster processor, e.g. face recognition Not a fan of touch screens (except on TL) but touch focus is quite useful Needs development: In camera zoom still slow (for street shooting you have to use switch on zoom, no time to change FL) Lens returns to 24mm on off/on (doesn't remember zoom position - is there a setting for this ?) Still don't like plastic switch gear. On/off switch and others should be metal not plastic Why does Leica rename raw files to RWL !!! Adobe Lightroom 6.14 doesn't recognise raw files - have to pay Adobe subscription now Aperture dial wobbles slightly. I would prefer stiff and tight In conclusion a terrific camera. Yes not the quality of my A7Rii or M240 but in good light its 90% there and no one will notice, and in low light its 60% there and good enough for whole pictures if not at the pixel level. Some improvements in next version to controls and EVF and its pretty much as good as it gets for a pocket zoom. On the subject of ISO my other camera is an M7. Used to ISO 400 max and the noise it generates, I can honestly say that this pocket zoom camera eclipses film by some. Not an important criteria to many but when you train yourself to use wide open and max ISO 400 its a real breeze to use this thing (after many years of protest I now almost exclusively use Auto-ISO). Other rivals for pocket ? Not much really. Main one is RX100VA. A great camera but because of size more suitable for point and shoot, D-Lux 7 puts the fun and manual control on tap. All the other options, like 5100, GX9, Pen-F, X-E3, add significant size and bulk even if pancake prime used Good enough for main camera ? sure. Significantly better then latest phone cameras ? surprisingly not that much for close product photos or kids videos - not many flies on my XR. But for optical zoom, DOF control (yes, surprisingly a large amount to play with), sharpness and distance and creative control, still no comparison. Finally I still like the design more over the Panasonic, which is why I bought it really. Looking at the previous generation, 70% of the difference in price is maintained second hand if that's important to you .... Edited January 9, 2019 by colonel", "link": "https://www.l-camera-forum.com/topic/293099-first-impressions-d-lux-7/?tab=comments#comment-3661407", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "positions", "selectorShort": "position", "MarkedSent": " i'll do a more in-depth analysis later (just help to steam up this sub-forum a bit ) but just penning some initial thoughts here plus: switch on zoom has improved the speed well made, lovely package lens doesn't wobble when extended d-lux 7 has new dust resistant lens system (over 109) despite crowing about evf, pretty good generally if not up to sony standards lens unexpectedly sharp wide open (f1/7) in centre and pretty much on zoom (f2.8). (24-27mm f1.7 / 28mm-f2.0 / 29-31mm f2.1 / 32-39mm f2.2-2.4 / 40-51mm f2.5-2.8 / 51mm~ f2.8 lens zoom can be set step zoom mode for familiar zoom -----> positions !!!  front control ring cool - can be used for step zoom panasonic has speeded up focus jpg engine much improved, both colours and dealing with noise reduction on higher isos. one can almost think of using them now iso 1600 perfectly usable at picture level, e.g. handheld building nightscapes at 1600 look good high iso noise control not bad, grain is more filmlike and nr better then before under jpg. avoids the \"digital\" type noise i used to get from the olympus system all functions benefit from faster processor, e.g. face recognition not a fan of touch screens (except on tl) but touch focus is quite useful needs development: in camera zoom still slow (for street shooting you have to use switch on zoom, no time to change fl) lens returns to 24mm on off/on (doesn't remember zoom position - is there a setting for this ?) still don't like plastic switch gear. on/off switch and others should be metal not plastic why does leica rename raw files to rwl !!! adobe lightroom 6.14 doesn't recognise raw files - have to pay adobe subscription now aperture dial wobbles slightly. i would prefer stiff and tight in conclusion a terrific camera. yes not the quality of my a7rii or m240 but in good light its 90% there and no one will notice, and in low light its 60% there and good enough for whole pictures if not at the pixel level. some improvements in next version to controls and evf and its pretty much as good as it gets for a pocket zoom. on the subject of iso my other camera is an m7. used to iso 400 max and the noise it generates, i can honestly say that this pocket zoom camera eclipses film by some. not an important criteria to many but when you train yourself to use wide open and max iso 400 its a real breeze to use this thing (after many years of protest i now almost exclusively use auto-iso). other rivals for pocket ? not much really. main one is rx100va. a great camera but because of size more suitable for point and shoot, d-lux 7 puts the fun and manual control on tap. all the other options, like 5100, gx9, pen-f, x-e3, add significant size and bulk even if pancake prime used good enough for main camera ? sure. significantly better then latest phone cameras ? surprisingly not that much for close product photos or kids videos - not many flies on my xr. but for optical zoom, dof control (yes, surprisingly a large amount to play with), sharpness and distance and creative control, still no comparison. finally i still like the design more over the panasonic, which is why i bought it really. looking at the previous generation, 70% of the difference in price is maintained second hand if that's important to you .... edited january 9, 2019 by colonel", "sortedWord": "None", "identifyer": 16320, "year": "2019"}], "name": "positionL-Forum2019"}