{"interestingcomments": [{"Unnamed: 0": 353000, "autor": "CheshireCat", "date": 1409005020000, "content": "Electronic first curtain shutter to allow complex metering mode without delay (A7) User selectable frame lines (X-Pro 1) Single frame line option (X-Pro 1) Suggested shutter speed in viewfinder (Zeiss Ikon ZM for gods' sake) Current ISO & aperture guess in viewfinder (every other camera ever forever) Ability to re-assign digital buttons (Fuji cameras) Built in sensor cleaning (Almost every other digital camera) (restricted by my rules outlined above) Hybrid viewfinder (X-Pro 1 - may be patented) (restricted by my rules outlined above) Wireless connectivity - app to grab photos, control camera. (A7) +1 and add to that: Customizable \"Favorite\" menu containing only functions I use. Bring up my 'Favorite\" menu with the SET key. Current items int the SET menu should be moved into a section of the standard MENU. Ability to move Live View spot around the frame. Customizable Focus Peaking tolerance. A decent, high resolution viewfinder that does not lag. Quick, interactive user interface. Especially during image review. Use decent processors. Yes, I am going to pay $100 more for a decent CPU. H.264 video instead of 20 years old blocky horrible MJPEG. You do it right or don't do it at all. It is interesting to note that most of the above are just software improvements. Leica has a software problem that has to be solved as soon as possible.", "link": "https://www.l-camera-forum.com/topic/232629-the-new-leica-m-p-discreet-faster-harder/page/12/?tab=comments#comment-2656968", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "electronic first curtain shutter to allow complex metering mode without delay (a7) user selectable frame lines (x-pro 1) single frame line option (x-pro 1) suggested shutter speed in viewfinder (zeiss ikon zm for gods' sake) current iso & aperture guess in viewfinder (every other camera ever forever) ability to re-assign digital buttons (fuji cameras) built in sensor cleaning (almost every other digital camera) (restricted by my rules outlined above) hybrid viewfinder (x-pro 1 - may be patented) (restricted by my rules outlined above) wireless connectivity - app to grab photos, control camera. (a7) +1 and add to that: customizable \"favorite\" menu containing only functions i use. bring up my 'favorite\" menu with the set key. current items int the set menu should be moved into a section of the standard menu. ability to move live view -----> spot !!!  around the frame. customizable focus peaking tolerance. a decent, high resolution viewfinder that does not lag. quick, interactive user interface. especially during image review. use decent processors. yes, i am going to pay $100 more for a decent cpu. h.264 video instead of 20 years old blocky horrible mjpeg. you do it right or don't do it at all. it is interesting to note that most of the above are just software improvements. leica has a software problem that has to be solved as soon as possible.", "sortedWord": "None", "identifyer": 14144, "year": "2014"}, {"Unnamed: 0": 353018, "autor": "farnz", "date": 1409095080000, "content": "… I suppose my comment about the frame line lever was meant more for dramatic effect then detailed historical accuracy. I apologize if anyone or their cameras was offended! My M2 said it wasn't at all offended, Josh, and neither was I.--img--  I mentioned it to assist because if others spotted the discrepancy they might wonder whether something else is incorrect, which could affect engagement with your piece. Pete.", "link": "https://www.l-camera-forum.com/topic/232629-the-new-leica-m-p-discreet-faster-harder/page/13/?tab=comments#comment-2657654", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "… i suppose my comment about the frame line lever was meant more for dramatic effect then detailed historical accuracy. i apologize if anyone or their cameras was offended! my m2 said it wasn't at all offended, josh, and neither was i.--img--  i mentioned it to assist because if others -----> spotted !!!  the discrepancy they might wonder whether something else is incorrect, which could affect engagement with your piece. pete.", "sortedWord": "None", "identifyer": 14162, "year": "2014"}, {"Unnamed: 0": 357276, "autor": "Overgaard", "date": 1400855940000, "content": "I was wondering you used Advanced Mode for light metering and/or spot meter or matrix. I have no experience with those as I use the Classic and Center Weighted all the time (which is the same light metering method as in the M9 and MM). But I did have an issue with my M240 where it shot half frames as the first frame from time to time after wake-up, and over-exposed (and a few underexposed frames). What made it distinguished was the different shutter sound. I sent the camera in and expected it to be the EVF-2 viewfinder electronics. They changed the shutter, and that made complete sense although the weird behavior of the EVF-2 (going white, making colored stripes and going out) had me suspect that was it. Everything was solved with the change of the shutter. I would contact Customer Service in Solms for most cases as they are the authority. Then they can redirect to another repair service if needed, or handle it there. They are currently very overworked (because of the events and all) but normally they will answer emails within a day or two.", "link": "https://www.l-camera-forum.com/topic/223075-under-exposure-issue-with-liveviewevf/page/2/?tab=comments#comment-2595609", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i was wondering you used advanced mode for light metering and/or -----> spot !!!  meter or matrix. i have no experience with those as i use the classic and center weighted all the time (which is the same light metering method as in the m9 and mm). but i did have an issue with my m240 where it shot half frames as the first frame from time to time after wake-up, and over-exposed (and a few underexposed frames). what made it distinguished was the different shutter sound. i sent the camera in and expected it to be the evf-2 viewfinder electronics. they changed the shutter, and that made complete sense although the weird behavior of the evf-2 (going white, making colored stripes and going out) had me suspect that was it. everything was solved with the change of the shutter. i would contact customer service in solms for most cases as they are the authority. then they can redirect to another repair service if needed, or handle it there. they are currently very overworked (because of the events and all) but normally they will answer emails within a day or two.", "sortedWord": "None", "identifyer": 18445, "year": "2014"}, {"Unnamed: 0": 360642, "autor": "Lenshacker", "date": 1418596920000, "content": "First \"live\" shot with the above lens, also with the Walz Orange filter. Wide-open, --img-- Signal Hill --img-- Signal Hill We've been going to this playground since my daughter was 3months old. I've had practice, this is also at F1.5. Waited for her face to come into the area I pre-focused on. --img-- Signal Hill Focus wide-open is spot-on. At F4, plenty of contrast. --img-- Signal Hill Edited December 14, 2014 by Lenshacker", "link": "https://www.l-camera-forum.com/topic/193239-old-lenses-on-the-monochrom-post-examples-here/page/15/?tab=comments#comment-2728449", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "first \"live\" shot with the above lens, also with the walz orange filter. wide-open, --img-- signal hill --img-- signal hill we've been going to this playground since my daughter was 3months old. i've had practice, this is also at f1.5. waited for her face to come into the area i pre-focused on. --img-- signal hill focus wide-open is -----> spot !!! -on. at f4, plenty of contrast. --img-- signal hill edited december 14, 2014 by lenshacker", "sortedWord": "None", "identifyer": 21860, "year": "2014"}, {"Unnamed: 0": 369547, "autor": "JHAG", "date": 1411840500000, "content": "Julian-- That's totally brilliant! I don't know how I missed this before. If you're ever near Toronto, the beer's on me --img--  Thanks again! Brilliant, but I wouldn't dare to do it on my M240. So as it's heavily frontfocussing it will be back to Solms with lenses. A bit discouraging Leica did not find a way to set this spot on. Of my 7 lenses, 5 are frontfocussing.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/10/?tab=comments#comment-2679354", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "julian-- that's totally brilliant! i don't know how i missed this before. if you're ever near toronto, the beer's on me --img--  thanks again! brilliant, but i wouldn't dare to do it on my m240. so as it's heavily frontfocussing it will be back to solms with lenses. a bit discouraging leica did not find a way to set this -----> spot !!!  on. of my 7 lenses, 5 are frontfocussing.", "sortedWord": "None", "identifyer": 30844, "year": "2014"}, {"Unnamed: 0": 369548, "autor": "FlashGordonPhotography", "date": 1411849080000, "content": " I've done infinity and vertical on my M240. The 12 week round trip from Oz was too much for me. Total time was about 5 minutes each and they've been spot on ever since. I have not adjusted the length of the arm on my 240 and would send that one off personally. It looks more secured than the M9, to me. Gordon", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/11/?tab=comments#comment-2679414", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " i've done infinity and vertical on my m240. the 12 week round trip from oz was too much for me. total time was about 5 minutes each and they've been -----> spot !!!  on ever since. i have not adjusted the length of the arm on my 240 and would send that one off personally. it looks more secured than the m9, to me. gordon", "sortedWord": "None", "identifyer": 30845, "year": "2014"}, {"Unnamed: 0": 369550, "autor": "JHAG", "date": 1411853520000, "content": "I've done infinity and vertical on my M240. The 12 week round trip from Oz was too much for me. Total time was about 5 minutes each and they've been spot on ever since. I have not adjusted the length of the arm on my 240 and would send that one off personally. It looks more secured than the M9, to me. Gordon On mine, infinity is spot on but I don't care as I never shoot infinity. What I need is sharpness close-up (like Jamie's first post pics). If you adjust infinity and vertical, you don't have sharpness up close.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/11/?tab=comments#comment-2679445", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i've done infinity and vertical on my m240. the 12 week round trip from oz was too much for me. total time was about 5 minutes each and they've been -----> spot !!!  on ever since. i have not adjusted the length of the arm on my 240 and would send that one off personally. it looks more secured than the m9, to me. gordon on mine, infinity is spot on but i don't care as i never shoot infinity. what i need is sharpness close-up (like jamie's first post pics). if you adjust infinity and vertical, you don't have sharpness up close.", "sortedWord": "None", "identifyer": 30847, "year": "2014"}, {"Unnamed: 0": 370139, "autor": "jaapv", "date": 1415950140000, "content": "Can someone tell me the approximate cost of a sensor cleaning and how to arrange for service? Google for sensor cleaning services in your area. Or if you live near a Leica dealer, walk in. They may do it on the spot. Or, as Erl said! And most of us do, just clean your sensor. You will find a protocol in the FAQ at the top of this forum. I would never pay 200$ for a ten-minute job. Edited December 22, 2014 by jaapv", "link": "https://www.l-camera-forum.com/topic/235074-leica-customer-service-read-what-happened-to-my-m9/page/3/?tab=comments#comment-2706223", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can someone tell me the approximate cost of a sensor cleaning and how to arrange for service? google for sensor cleaning services in your area. or if you live near a leica dealer, walk in. they may do it on the -----> spot !!! . or, as erl said! and most of us do, just clean your sensor. you will find a protocol in the faq at the top of this forum. i would never pay 200$ for a ten-minute job. edited december 22, 2014 by jaapv", "sortedWord": "None", "identifyer": 31439, "year": "2014"}, {"Unnamed: 0": 370141, "autor": "Jeff Daniels", "date": 1419241800000, "content": "Leica Customer Service in London has been unremarkable in past years but is certainly first grade now. My Noctilux was recently knocked off a table and into a champagne bucket during a recent shoot and was, I thought, ruined. I immediately rushed it to Leica London who, in turn, immediately sent it to Leica Germany where it was completely dismantled it and, effectively, rebuilt. They even corrected a 'niggle' I had with the lens (a 'loose' aperture ring). The lens came back fast and is as good as new. The cost? A couple of hundred euros. I was both astonished and delighted. On another occasion recently I noticed that the red dome marker on one of my lenses was missing. Leica London replaced it instantly without charge. I have carefully checked my M9 sensor as I don't suffer from the tell-tale white spots and, so far, and it seems free of any visual signs of corrosion. Only time will tell. However, I am reassured by the stance that Leica is taking and I have no doubt that I will be well looked after if the fault does develop. My view is that mistakes happen. Such is life. However, it is what people and companies do about those mistakes that set them apart. And Leica is setting itself apart by showing that they stand by their products and their customers. You can't argue with that. Other companies could learn a lot from their example.", "link": "https://www.l-camera-forum.com/topic/235074-leica-customer-service-read-what-happened-to-my-m9/page/3/?tab=comments#comment-2733008", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "leica customer service in london has been unremarkable in past years but is certainly first grade now. my noctilux was recently knocked off a table and into a champagne bucket during a recent shoot and was, i thought, ruined. i immediately rushed it to leica london who, in turn, immediately sent it to leica germany where it was completely dismantled it and, effectively, rebuilt. they even corrected a 'niggle' i had with the lens (a 'loose' aperture ring). the lens came back fast and is as good as new. the cost? a couple of hundred euros. i was both astonished and delighted. on another occasion recently i noticed that the red dome marker on one of my lenses was missing. leica london replaced it instantly without charge. i have carefully checked my m9 sensor as i don't suffer from the tell-tale white -----> spots !!!  and, so far, and it seems free of any visual signs of corrosion. only time will tell. however, i am reassured by the stance that leica is taking and i have no doubt that i will be well looked after if the fault does develop. my view is that mistakes happen. such is life. however, it is what people and companies do about those mistakes that set them apart. and leica is setting itself apart by showing that they stand by their products and their customers. you can't argue with that. other companies could learn a lot from their example.", "sortedWord": "None", "identifyer": 31441, "year": "2014"}, {"Unnamed: 0": 372259, "autor": "Jean-Michel", "date": 1398958620000, "content": "The price of new, advanced, technology is a shorter usability time. My M9, purchased in 2011, will become unusable much sooner than any of my M3, M4 or M6 that will work fine as long as film remains available -- you can develop the film in polluted harbour water, see: Environment : Looking for Inexpensive Photo Processing? Try Lake Ontario : The waterway is so full of polluting chemicals it actually can develop photographs. At least, that's what one local photographer says. And he has the black and whites to prove. It will be fairly easy to hear Gramophone records decades from now but not so CD's or iTunes tracks, but today I listen to CD's not gramophones. Similarly, I do not use my eminently usable film M's and only carry my M9. The sensor had to be replaced last year after it developed some spots, so now I expect that it will work flawlessly for a number of years yet. My other digital bodies were replaced quite quickly: I replaced my original Canon 5d for a 5d2 within one year; and replaced my spouse's Canon G10 with a Lumix GH2 also within 18 months. As my M9 ages I plan to purchase another body, probably the new M or its successor. Jean-Michel", "link": "https://www.l-camera-forum.com/topic/226275-m9-longevity/?tab=comments#comment-2580785", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "the price of new, advanced, technology is a shorter usability time. my m9, purchased in 2011, will become unusable much sooner than any of my m3, m4 or m6 that will work fine as long as film remains available -- you can develop the film in polluted harbour water, see: environment : looking for inexpensive photo processing? try lake ontario : the waterway is so full of polluting chemicals it actually can develop photographs. at least, that's what one local photographer says. and he has the black and whites to prove. it will be fairly easy to hear gramophone records decades from now but not so cd's or itunes tracks, but today i listen to cd's not gramophones. similarly, i do not use my eminently usable film m's and only carry my m9. the sensor had to be replaced last year after it developed some -----> spots !!! , so now i expect that it will work flawlessly for a number of years yet. my other digital bodies were replaced quite quickly: i replaced my original canon 5d for a 5d2 within one year; and replaced my spouse's canon g10 with a lumix gh2 also within 18 months. as my m9 ages i plan to purchase another body, probably the new m or its successor. jean-michel", "sortedWord": "None", "identifyer": 33561, "year": "2014"}, {"Unnamed: 0": 376745, "autor": "pico", "date": 1390217940000, "content": "I think you do not need to worry. My white spot could have been seen on every picture at every aperture always at the same position. That what you describe sounds more like dust Dust shows up as black, or very dark.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/5/?tab=comments#comment-2513827", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i think you do not need to worry. my white -----> spot !!!  could have been seen on every picture at every aperture always at the same position. that what you describe sounds more like dust dust shows up as black, or very dark.", "sortedWord": "None", "identifyer": 38056, "year": "2014"}, {"Unnamed: 0": 376764, "autor": "wlaidlaw", "date": 1390950060000, "content": "I had these white spots appear under the cover glass after using my M9 in very humid conditions. Leica replaced the sensor FOC. Wilson", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/6/?tab=comments#comment-2520795", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i had these white -----> spots !!!  appear under the cover glass after using my m9 in very humid conditions. leica replaced the sensor foc. wilson", "sortedWord": "None", "identifyer": 38075, "year": "2014"}, {"Unnamed: 0": 376776, "autor": "ChristoforosGiatzakis", "date": 1391078280000, "content": "These spots appeared on my M9 after wet cleaning the sensor.... I contacted Leica representative here in Greece and Solms with files attached. I got the following answer “camera seems to have a sensor board problem”. They recommended I should send it at the end of February because they are moving.... No answer about cost etc.. camera is out of warranty. Any ideas of what this may be? --img-- ", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/6/?tab=comments#comment-2521789", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "these -----> spots !!!  appeared on my m9 after wet cleaning the sensor.... i contacted leica representative here in greece and solms with files attached. i got the following answer “camera seems to have a sensor board problem”. they recommended i should send it at the end of february because they are moving.... no answer about cost etc.. camera is out of warranty. any ideas of what this may be? --img-- ", "sortedWord": "None", "identifyer": 38087, "year": "2014"}, {"Unnamed: 0": 376786, "autor": "ErickPRO", "date": 1414123080000, "content": "Anyone could post the first digits of what serial numbers were affected? I noticed spots on an M9 I was about to buy and it started with 3837XXX and my 39XXXXX has dead pixels with a blue thin line.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/7/?tab=comments#comment-2694088", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "anyone could post the first digits of what serial numbers were affected? i noticed -----> spots !!!  on an m9 i was about to buy and it started with 3837xxx and my 39xxxxx has dead pixels with a blue thin line.", "sortedWord": "None", "identifyer": 38097, "year": "2014"}, {"Unnamed: 0": 376787, "autor": "wlaidlaw", "date": 1414132680000, "content": "Anyone could post the first digits of what serial numbers were affected? I noticed spots on an M9 I was about to buy and it started with 3837XXX and my 39XXXXX has dead pixels with a blue thin line. My M9, which was one of the earlier ones to show white spots, had its sensor replaced in 2010. It is serial number 3809869 (I am not coy/paranoid about showing whole serial numbers). Wilson", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/7/?tab=comments#comment-2694118", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "anyone could post the first digits of what serial numbers were affected? i noticed -----> spots !!!  on an m9 i was about to buy and it started with 3837xxx and my 39xxxxx has dead pixels with a blue thin line. my m9, which was one of the earlier ones to show white spots, had its sensor replaced in 2010. it is serial number 3809869 (i am not coy/paranoid about showing whole serial numbers). wilson", "sortedWord": "None", "identifyer": 38098, "year": "2014"}, {"Unnamed: 0": 376788, "autor": "sblutter", "date": 1414401360000, "content": " I get dust spots too, but 99% of them are invisible in pictures - other than of blank walls. The 1% that can be seen are quickly fixed in PS or LR when viewed at 100% No one viewing my 17 x 22 and larger prints has ever been jarred by even one speck To me, this is equal to worrying your very expensive manual watch is off by 2 seconds a week. Not a worthwhile concern (unless of course the sensor is really damaged / defective)", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/7/?tab=comments#comment-2695816", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " i get dust -----> spots !!!  too, but 99% of them are invisible in pictures - other than of blank walls. the 1% that can be seen are quickly fixed in ps or lr when viewed at 100% no one viewing my 17 x 22 and larger prints has ever been jarred by even one speck to me, this is equal to worrying your very expensive manual watch is off by 2 seconds a week. not a worthwhile concern (unless of course the sensor is really damaged / defective)", "sortedWord": "None", "identifyer": 38099, "year": "2014"}, {"Unnamed: 0": 376789, "autor": "wlaidlaw", "date": 1414403700000, "content": "I get dust spots too, but 99% of them are invisible in pictures - other than of blank walls. The 1% that can be seen are quickly fixed in PS or LR when viewed at 100% No one viewing my 17 x 22 and larger prints has ever been jarred by even one speck To me, this is equal to worrying your very expensive manual watch is off by 2 seconds a week. Not a worthwhile concern (unless of course the sensor is really damaged / defective) The white spots are a different order of magnitude from dust spots and with them, the M9 is in effect, unusable. The white spots lie between the coverglass and sensor and are not cleanable. Wilson", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/7/?tab=comments#comment-2695824", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i get dust -----> spots !!!  too, but 99% of them are invisible in pictures - other than of blank walls. the 1% that can be seen are quickly fixed in ps or lr when viewed at 100% no one viewing my 17 x 22 and larger prints has ever been jarred by even one speck to me, this is equal to worrying your very expensive manual watch is off by 2 seconds a week. not a worthwhile concern (unless of course the sensor is really damaged / defective) the white spots are a different order of magnitude from dust spots and with them, the m9 is in effect, unusable. the white spots lie between the coverglass and sensor and are not cleanable. wilson", "sortedWord": "None", "identifyer": 38100, "year": "2014"}, {"Unnamed: 0": 376790, "autor": "photokalia", "date": 1414501620000, "content": "I think I have the white spot problem too --img--  And it's pretty bad. At first I thought it was dust, but dry and wet cleaning have done nothing to help the situation. I'm glad I found this thread. I'm sending my camera into Leica to get it checked out. It's out of warranty though, so I hope they don't make me pay for a new sensor... --img-- L1014321 by photokalia, on Flickr Edited October 28, 2014 by photokalia insert photo", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/7/?tab=comments#comment-2696400", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i think i have the white -----> spot !!!  problem too --img--  and it's pretty bad. at first i thought it was dust, but dry and wet cleaning have done nothing to help the situation. i'm glad i found this thread. i'm sending my camera into leica to get it checked out. it's out of warranty though, so i hope they don't make me pay for a new sensor... --img-- l1014321 by photokalia, on flickr edited october 28, 2014 by photokalia insert photo", "sortedWord": "None", "identifyer": 38101, "year": "2014"}, {"Unnamed: 0": 376796, "autor": "ericborgstrom", "date": 1416229020000, "content": "My M9 from March 2010 was left with Leica customer service in Wetzlar a month ago as they, not I, found sensor defects (spots). I was offered a free sensor exchange. After an email from me last Friday they kindly informed me to allow eight weeks for this generously offered exchange. –Eric", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/7/?tab=comments#comment-2708245", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "my m9 from march 2010 was left with leica customer service in wetzlar a month ago as they, not i, found sensor defects (-----> spots !!! ). i was offered a free sensor exchange. after an email from me last friday they kindly informed me to allow eight weeks for this generously offered exchange. –eric", "sortedWord": "None", "identifyer": 38107, "year": "2014"}, {"Unnamed: 0": 376803, "autor": "wlaidlaw", "date": 1416548460000, "content": "Based on this thread, we feel the need to clarifying a couple of things about the sensor marks issue you have been experiencing. The issue is linked with corrosion effects on the cover glass of the CCD sensor in Leica M9, M9-P, M Monochrom and M-E cameras. They manifest themselves as marks on images captured at smaller apertures (f/5.6-22). The new Leica M (Type 240) with the CMOS sensor is not affected by this problem. We are truly sorry for the inconvenience encountered and we have set up the following scheme for servicing the sensors of the products affected. Please be aware that a contact-free cleaning of the sensor is essential in preventing the issue. • Customer care will perform sensor cleaning free of charge by prior arrangement. • In the case of damage as a result of corrosion, the sensor will be replaced free of charge up to three years following the date of purchase. Leica Camera AG will cover the full costs of replacement, amounting to 1,800 euros plus applicable VAT. This does not apply to sensors damaged by scratching or breakage of the sensor glass. • In the fourth and fifth year following the date of purchase, sensors damaged by the corrosion effects described will be replaced for a fixed charge of 600 euros plus applicable VAT. Leica Camera AG will cover the remaining costs of 1,200 euros. • In the sixth and seventh year following the date of purchase, sensor replacement will be offered at a fixed charge of 1,200 euros plus applicable VAT. Leica Camera AG will cover the remaining costs of 600 euros. • For the eighth and more years following the date of purchase, sensor replacement will be offered at a fixed charge of 1,500 euros plus applicable VAT. Leica Camera AG will cover the remaining costs of 300 euros. • The prices stated apply for direct shipment of the camera to Leica Customer Care in Wetzlar or the Customer Care department of a national distributor. Additional costs may arise when the camera is sent to Leica through a dealer. • Mandatory warranty conditions will apply after customers have taken advantage of the extended goodwill arrangement. • As longer waiting times may otherwise occur, the camera should only be sent to Customer Care after prior arrangement. • We will continue watching this thread so you are welcome to react here. ^JJ with Leica-camera In my view and from my long experience with cleaning M8, M9 and M240 cameras, non-contact cleaning just does not begin work for cleaning sensors. Canned air cleaners, apart from squirting a dangerous and highly inflammable mix of propane and butane into the camera, only blow the dust around into the shutter mechanism and the electronics of the camera and do not remove it. The so-called Rocket type bulb blowers, which I do use, are only minimally effective. They also do not begin to remove the greasy spots, which are often to be found adhering to the sensor cover glass. If you are saying that contact cleaning methods invalidate the implied 6 year EU warranty, you are in effect saying that all interchangeable lens Leica digital cameras are now unusable in the long term. If this is really the case, you make a very good reason for a refund of the purchase price of all digital M Leica cameras and all the lenses bought to fit them. I am amazed that anyone has seen fit to thank you for your post and are not like me, up in arms. I am totally astounded by the position Leica is taking on this. It is certainly not to the benefit of customers. Wet cleaning of sensors is the industry standard for removing smears, condensation and grease spots on interchangeable lens digital cameras. It strikes me that this is a backside covering approach by Leica because the costs of warranty replacement of inadequately sealed/incorrectly made sensors or cover glasses are starting to mount up. I hope you realise that I am extremely unhappy about this, as a loyal Leica customer of now close to 50 years and as an owner of 10 Leica cameras and dozens of lenses. Wilson", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/8/?tab=comments#comment-2711066", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "based on this thread, we feel the need to clarifying a couple of things about the sensor marks issue you have been experiencing. the issue is linked with corrosion effects on the cover glass of the ccd sensor in leica m9, m9-p, m monochrom and m-e cameras. they manifest themselves as marks on images captured at smaller apertures (f/5.6-22). the new leica m (type 240) with the cmos sensor is not affected by this problem. we are truly sorry for the inconvenience encountered and we have set up the following scheme for servicing the sensors of the products affected. please be aware that a contact-free cleaning of the sensor is essential in preventing the issue. • customer care will perform sensor cleaning free of charge by prior arrangement. • in the case of damage as a result of corrosion, the sensor will be replaced free of charge up to three years following the date of purchase. leica camera ag will cover the full costs of replacement, amounting to 1,800 euros plus applicable vat. this does not apply to sensors damaged by scratching or breakage of the sensor glass. • in the fourth and fifth year following the date of purchase, sensors damaged by the corrosion effects described will be replaced for a fixed charge of 600 euros plus applicable vat. leica camera ag will cover the remaining costs of 1,200 euros. • in the sixth and seventh year following the date of purchase, sensor replacement will be offered at a fixed charge of 1,200 euros plus applicable vat. leica camera ag will cover the remaining costs of 600 euros. • for the eighth and more years following the date of purchase, sensor replacement will be offered at a fixed charge of 1,500 euros plus applicable vat. leica camera ag will cover the remaining costs of 300 euros. • the prices stated apply for direct shipment of the camera to leica customer care in wetzlar or the customer care department of a national distributor. additional costs may arise when the camera is sent to leica through a dealer. • mandatory warranty conditions will apply after customers have taken advantage of the extended goodwill arrangement. • as longer waiting times may otherwise occur, the camera should only be sent to customer care after prior arrangement. • we will continue watching this thread so you are welcome to react here. ^jj with leica-camera in my view and from my long experience with cleaning m8, m9 and m240 cameras, non-contact cleaning just does not begin work for cleaning sensors. canned air cleaners, apart from squirting a dangerous and highly inflammable mix of propane and butane into the camera, only blow the dust around into the shutter mechanism and the electronics of the camera and do not remove it. the so-called rocket type bulb blowers, which i do use, are only minimally effective. they also do not begin to remove the greasy -----> spots !!! , which are often to be found adhering to the sensor cover glass. if you are saying that contact cleaning methods invalidate the implied 6 year eu warranty, you are in effect saying that all interchangeable lens leica digital cameras are now unusable in the long term. if this is really the case, you make a very good reason for a refund of the purchase price of all digital m leica cameras and all the lenses bought to fit them. i am amazed that anyone has seen fit to thank you for your post and are not like me, up in arms. i am totally astounded by the position leica is taking on this. it is certainly not to the benefit of customers. wet cleaning of sensors is the industry standard for removing smears, condensation and grease spots on interchangeable lens digital cameras. it strikes me that this is a backside covering approach by leica because the costs of warranty replacement of inadequately sealed/incorrectly made sensors or cover glasses are starting to mount up. i hope you realise that i am extremely unhappy about this, as a loyal leica customer of now close to 50 years and as an owner of 10 leica cameras and dozens of lenses. wilson", "sortedWord": "None", "identifyer": 38114, "year": "2014"}, {"Unnamed: 0": 376807, "autor": "jaapv", "date": 1416565980000, "content": "In my view and from my long experience with cleaning M8, M9 and M240 cameras, non-contact cleaning just does not begin work for cleaning sensors. Canned air cleaners, apart from squirting a dangerous and highly inflammable mix of propane and butane into the camera, only blow the dust around into the shutter mechanism and the electronics of the camera and do not remove it. The so-called Rocket type bulb blowers, which I do use, are only minimally effective. They also do not begin to remove the greasy spots, which are often to be found adhering to the sensor cover glass. If you are saying that contact cleaning methods invalidate the implied 6 year EU warranty, you are in effect saying that all interchangeable lens Leica digital cameras are now unusable in the long term. If this is really the case, you make a very good reason for a refund of the purchase price of all digital M Leica cameras and all the lenses bought to fit them. I am amazed that anyone has seen fit to thank you for your post and are not like me, up in arms. I am totally astounded by the position Leica is taking on this. It is certainly not to the benefit of customers. Wet cleaning of sensors is the industry standard for removing smears, condensation and grease spots on interchangeable lens digital cameras. It strikes me that this is a backside covering approach by Leica because the costs of warranty replacement of inadequately sealed/incorrectly made sensors or cover glasses are starting to mount up. I hope you realise that I am extremely unhappy about this, as a loyal Leica customer of now close to 50 years and as an owner of 10 Leica cameras and dozens of lenses. Wilson I do not know where you read that contact-cleaning invalidates the warranty. I only read that Leica advises not to do so. (They might have added unless you know what you are doing, but I suspect that was deemed to be too vague) Please be aware that a contact-free cleaning of the sensor is essential in preventing the issue. That reads as an advice, not a condition, especially as it clashes with advice given on their own site. --img-- --img--  With thanks to Digiuser for the screenshot Edited November 21, 2014 by jaapv", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/8/?tab=comments#comment-2711227", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "in my view and from my long experience with cleaning m8, m9 and m240 cameras, non-contact cleaning just does not begin work for cleaning sensors. canned air cleaners, apart from squirting a dangerous and highly inflammable mix of propane and butane into the camera, only blow the dust around into the shutter mechanism and the electronics of the camera and do not remove it. the so-called rocket type bulb blowers, which i do use, are only minimally effective. they also do not begin to remove the greasy -----> spots !!! , which are often to be found adhering to the sensor cover glass. if you are saying that contact cleaning methods invalidate the implied 6 year eu warranty, you are in effect saying that all interchangeable lens leica digital cameras are now unusable in the long term. if this is really the case, you make a very good reason for a refund of the purchase price of all digital m leica cameras and all the lenses bought to fit them. i am amazed that anyone has seen fit to thank you for your post and are not like me, up in arms. i am totally astounded by the position leica is taking on this. it is certainly not to the benefit of customers. wet cleaning of sensors is the industry standard for removing smears, condensation and grease spots on interchangeable lens digital cameras. it strikes me that this is a backside covering approach by leica because the costs of warranty replacement of inadequately sealed/incorrectly made sensors or cover glasses are starting to mount up. i hope you realise that i am extremely unhappy about this, as a loyal leica customer of now close to 50 years and as an owner of 10 leica cameras and dozens of lenses. wilson i do not know where you read that contact-cleaning invalidates the warranty. i only read that leica advises not to do so. (they might have added unless you know what you are doing, but i suspect that was deemed to be too vague) please be aware that a contact-free cleaning of the sensor is essential in preventing the issue. that reads as an advice, not a condition, especially as it clashes with advice given on their own site. --img-- --img--  with thanks to digiuser for the screenshot edited november 21, 2014 by jaapv", "sortedWord": "None", "identifyer": 38118, "year": "2014"}, {"Unnamed: 0": 376812, "autor": "pico", "date": 1416606900000, "content": "I have been quiet about the sensor corrosion issue, or whatever it is, but now that JJ(Leica) has made a statement then the issue is open. I have never cleaned my M9 sensor due to lack of confidence regarding methods and of the sensor itself. I'm going to back off plans to get the 240 or an S until I learn more. Instead of cleaning I wrote scripts and Photoshop actions to automatically spot any (however infrequent) good images I make. In an odd way, the dust and blemish pattern in my DNG images are like a finger-print, so to speak, showing them to be mine. Strange, unimportant, but a rationalization I can live with. I will continue to use the M9 until the condition is intolerable and then either put it away or give it to someone. Selling the M9 is for me a dishonest means to get out from under it. Edited November 21, 2014 by pico", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/8/?tab=comments#comment-2711707", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have been quiet about the sensor corrosion issue, or whatever it is, but now that jj(leica) has made a statement then the issue is open. i have never cleaned my m9 sensor due to lack of confidence regarding methods and of the sensor itself. i'm going to back off plans to get the 240 or an s until i learn more. instead of cleaning i wrote scripts and photoshop actions to automatically -----> spot !!!  any (however infrequent) good images i make. in an odd way, the dust and blemish pattern in my dng images are like a finger-print, so to speak, showing them to be mine. strange, unimportant, but a rationalization i can live with. i will continue to use the m9 until the condition is intolerable and then either put it away or give it to someone. selling the m9 is for me a dishonest means to get out from under it. edited november 21, 2014 by pico", "sortedWord": "None", "identifyer": 38123, "year": "2014"}, {"Unnamed: 0": 376822, "autor": "wlaidlaw", "date": 1416692940000, "content": " The poor soul who announced this .... They packed his worldly goods into a spotted handkerchief, tied to a stick over his shoulder and sent him out into the wide world. --img--  Wilson --img-- ", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/9/?tab=comments#comment-2712312", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": " the poor soul who announced this .... they packed his worldly goods into a -----> spotted !!!  handkerchief, tied to a stick over his shoulder and sent him out into the wide world. --img--  wilson --img-- ", "sortedWord": "None", "identifyer": 38133, "year": "2014"}, {"Unnamed: 0": 376836, "autor": "edwardkaraa", "date": 1416736080000, "content": "I am very sure this wet cleaning issue is total BS. I bought my camera new and it started to show the delamination spots just a few weeks later. They might have been there since the beginning but I probably didn't bother to look for them in a new camera. Many people I know had delaminating sensor coatings even though they never cleaned their sensors. By the time the MM came out, many people who bought them where already aware of the M9 problem. I confess to have cleaned mine, but not before I saw many spots, that I thought were dried oil, but turned out to be bubbles in the coatings that no cleaning can remove. I believe that delamination will happen whether you wet clean or not. It's just a matter of time, and probably some humidity.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/9/?tab=comments#comment-2712554", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i am very sure this wet cleaning issue is total bs. i bought my camera new and it started to show the delamination -----> spots !!!  just a few weeks later. they might have been there since the beginning but i probably didn't bother to look for them in a new camera. many people i know had delaminating sensor coatings even though they never cleaned their sensors. by the time the mm came out, many people who bought them where already aware of the m9 problem. i confess to have cleaned mine, but not before i saw many spots, that i thought were dried oil, but turned out to be bubbles in the coatings that no cleaning can remove. i believe that delamination will happen whether you wet clean or not. it's just a matter of time, and probably some humidity.", "sortedWord": "None", "identifyer": 38147, "year": "2014"}, {"Unnamed: 0": 376853, "autor": "photokalia", "date": 1416748860000, "content": "I am very sure this wet cleaning issue is total BS. I bought my camera new and it started to show the delamination spots just a few weeks later. They might have been there since the beginning but I probably didn't bother to look for them in a new camera. Many people I know had delaminating sensor coatings even though they never cleaned their sensors. By the time the MM came out, many people who bought them where already aware of the M9 problem. I confess to have cleaned mine, but not before I saw many spots, that I thought were dried oil, but turned out to be bubbles in the coatings that no cleaning can remove. I believe that delamination will happen whether you wet clean or not. It's just a matter of time, and probably some humidity. I second this. I never did any kind of sensor cleaning on my M9, dry or wet. When the spots started appearing, I tried dry cleaning at first, and gave up when it didn't help. The delamination steadily got worse, and I turned to wet cleaning as a last resort. Still didn't help, so finally I had no choice but to bring it down to Leica.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/10/?tab=comments#comment-2712664", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i am very sure this wet cleaning issue is total bs. i bought my camera new and it started to show the delamination -----> spots !!!  just a few weeks later. they might have been there since the beginning but i probably didn't bother to look for them in a new camera. many people i know had delaminating sensor coatings even though they never cleaned their sensors. by the time the mm came out, many people who bought them where already aware of the m9 problem. i confess to have cleaned mine, but not before i saw many spots, that i thought were dried oil, but turned out to be bubbles in the coatings that no cleaning can remove. i believe that delamination will happen whether you wet clean or not. it's just a matter of time, and probably some humidity. i second this. i never did any kind of sensor cleaning on my m9, dry or wet. when the spots started appearing, i tried dry cleaning at first, and gave up when it didn't help. the delamination steadily got worse, and i turned to wet cleaning as a last resort. still didn't help, so finally i had no choice but to bring it down to leica.", "sortedWord": "None", "identifyer": 38164, "year": "2014"}, {"Unnamed: 0": 376865, "autor": "Nowhereman", "date": 1416796980000, "content": "Someone pointed me to post #137 on page 7 — I would not otherwise have read a thread with the title \"Strange white spots on M9 sensor?\" When I did read that post, my reaction was, \"is this guy \"demadit\" really from Leica and is this is really an official statement on policy by Leica on the delimitation issue of the M9/M-E/MM\"? Maybe some of you know for a fact that \"demedit\" is a Leica executive, but my immediate reaction was that this could be a spoof or a prank. Over the weekend, I wrote the following e-mail to Andrea Frankl, Jakon Eberhard and Birgitta Mielke, i.e., the Leica staff whose e-mail address I had: Not sure to whom to send this e-mail. On the Leica Users Forum(LUF) there is a posting that is written as if it comes from Leica Camera AG and is the Company’s policy. The posting in question deals with \"corrosion effects on the cover glass of the CCD sensor in Leica M9, M9-P, M Monochrom and M-E cameras” and states, \"Please be aware that a contact-free cleaning of the sensor is essential in preventing the issue”. You can see the posting here: http://www.l-camera-forum.com/leica-forum/leica-m9-forum/307974-strange-white-spots-m9-sensor-7.html#post2825494 As you can read in subsequent comments by LUF members, these statements could have a serious negative effect on the sale of Leica digital cameras. Someone has copied the posting to the Range Finder Forum (RFF), where it also has elicited very negative reactions: http://www.rangefinderforum.com/forums/showthread.php?t=145845 The poster uses the LUF forum name of “demadit” and signs himself as “JJ with Leica-camera”. In another LUF post he signs himself as \"JJ Viau, Leica Camera AG, responsible for internet marketing” I find it strange that Leica Camera should communicate policy on such a matter in this haphazard manner, rather than in an official Company statement or press release. Therefore, I wonder whether the above posting is really from someone at Leica, and find it hard to believe that a serious company would communicate in such an unprofessional manner on a major issue. If the post is fraudulent or does not represent the policy of Leica Camera, the Company should state so in the two threads on LUF and RFF. It would also be good to state Leica Camera policy on reading and on posting to camera forums. Having now read the postings here that were written after I sent my e-mail, I can only say that I continue to find it mind boggling that Leica Camera AG is handling this matter in this way, assuming that \"demadit\" indeed is a Leica staff member and that this indeed is intended by the Company to be an official statement. If all this is real, it looks like 'amateur hour\". Incidentally, my M9-P sensor had delimitation about a year after purchase. Somewhat uneasy for the prospects for my M-M.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/11/?tab=comments#comment-2713128", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "someone pointed me to post #137 on page 7 — i would not otherwise have read a thread with the title \"strange white -----> spots !!!  on m9 sensor?\" when i did read that post, my reaction was, \"is this guy \"demadit\" really from leica and is this is really an official statement on policy by leica on the delimitation issue of the m9/m-e/mm\"? maybe some of you know for a fact that \"demedit\" is a leica executive, but my immediate reaction was that this could be a spoof or a prank. over the weekend, i wrote the following e-mail to andrea frankl, jakon eberhard and birgitta mielke, i.e., the leica staff whose e-mail address i had: not sure to whom to send this e-mail. on the leica users forum(luf) there is a posting that is written as if it comes from leica camera ag and is the company’s policy. the posting in question deals with \"corrosion effects on the cover glass of the ccd sensor in leica m9, m9-p, m monochrom and m-e cameras” and states, \"please be aware that a contact-free cleaning of the sensor is essential in preventing the issue”. you can see the posting here: http://www.l-camera-forum.com/leica-forum/leica-m9-forum/307974-strange-white-spots-m9-sensor-7.html#post2825494 as you can read in subsequent comments by luf members, these statements could have a serious negative effect on the sale of leica digital cameras. someone has copied the posting to the range finder forum (rff), where it also has elicited very negative reactions: http://www.rangefinderforum.com/forums/showthread.php?t=145845 the poster uses the luf forum name of “demadit” and signs himself as “jj with leica-camera”. in another luf post he signs himself as \"jj viau, leica camera ag, responsible for internet marketing” i find it strange that leica camera should communicate policy on such a matter in this haphazard manner, rather than in an official company statement or press release. therefore, i wonder whether the above posting is really from someone at leica, and find it hard to believe that a serious company would communicate in such an unprofessional manner on a major issue. if the post is fraudulent or does not represent the policy of leica camera, the company should state so in the two threads on luf and rff. it would also be good to state leica camera policy on reading and on posting to camera forums. having now read the postings here that were written after i sent my e-mail, i can only say that i continue to find it mind boggling that leica camera ag is handling this matter in this way, assuming that \"demadit\" indeed is a leica staff member and that this indeed is intended by the company to be an official statement. if all this is real, it looks like 'amateur hour\". incidentally, my m9-p sensor had delimitation about a year after purchase. somewhat uneasy for the prospects for my m-m.", "sortedWord": "None", "identifyer": 38176, "year": "2014"}, {"Unnamed: 0": 376868, "autor": "Steve Ash", "date": 1416809520000, "content": " Someone pointed me to post #137 on page 7 — I would not otherwise have read a thread with the title \"Strange white spots on M9 sensor?\" When I did read that post, my reaction was, \"is this guy \"demadit\" really from Leica and is this is really an official statement on policy by Leica on the delimitation issue of the M9/M-E/MM\"? Maybe some of you know for a fact that \"demedit\" is a Leica executive, but my immediate reaction was that this could be a spoof or a prank. Over the weekend, I wrote the following e-mail to Andrea Frankl, Jakon Eberhard and Birgitta Mielke, i.e., the Leica staff whose e-mail address I had:Having now read the postings here that were written after I sent my e-mail, I can only say that I continue to find it mind boggling that Leica Camera AG is handling this matter in this way, assuming that \"demadit\" indeed is a Leica staff member and that this indeed is intended by the Company to be an official statement. If all this is real, it looks like 'amateur hour\". Most of us are happy to see Leica staff commenting on this forum. This does not make it into an official company statement. The only amateurish issue I see is your unreflected, emotional reply.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/11/?tab=comments#comment-2713172", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " someone pointed me to post #137 on page 7 — i would not otherwise have read a thread with the title \"strange white -----> spots !!!  on m9 sensor?\" when i did read that post, my reaction was, \"is this guy \"demadit\" really from leica and is this is really an official statement on policy by leica on the delimitation issue of the m9/m-e/mm\"? maybe some of you know for a fact that \"demedit\" is a leica executive, but my immediate reaction was that this could be a spoof or a prank. over the weekend, i wrote the following e-mail to andrea frankl, jakon eberhard and birgitta mielke, i.e., the leica staff whose e-mail address i had:having now read the postings here that were written after i sent my e-mail, i can only say that i continue to find it mind boggling that leica camera ag is handling this matter in this way, assuming that \"demadit\" indeed is a leica staff member and that this indeed is intended by the company to be an official statement. if all this is real, it looks like 'amateur hour\". most of us are happy to see leica staff commenting on this forum. this does not make it into an official company statement. the only amateurish issue i see is your unreflected, emotional reply.", "sortedWord": "None", "identifyer": 38179, "year": "2014"}, {"Unnamed: 0": 376870, "autor": "jaapv", "date": 1416812460000, "content": "Someone pointed me to post #137 on page 7 — I would not otherwise have read a thread with the title \"Strange white spots on M9 sensor?\" When I did read that post, my reaction was, \"is this guy \"demadit\" really from Leica and is this is really an official statement on policy by Leica on the delimitation issue of the M9/M-E/MM\"? Maybe some of you know for a fact that \"demedit\" is a Leica executive, but my immediate reaction was that this could be a spoof or a prank. Over the weekend, I wrote the following e-mail to Andrea Frankl, Jakon Eberhard and Birgitta Mielke, i.e., the Leica staff whose e-mail address I had:Having now read the postings here that were written after I sent my e-mail, I can only say that I continue to find it mind boggling that Leica Camera AG is handling this matter in this way, assuming that \"demadit\" indeed is a Leica staff member and that this indeed is intended by the Company to be an official statement. If all this is real, it looks like 'amateur hour\". Incidentally, my M9-P sensor had delimitation about a year after purchase. Somewhat uneasy for the prospects for my M-M. I can assure you that Mr Viau is a ranking Leica official and has the authority to speak for Leica.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/11/?tab=comments#comment-2713184", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "someone pointed me to post #137 on page 7 — i would not otherwise have read a thread with the title \"strange white -----> spots !!!  on m9 sensor?\" when i did read that post, my reaction was, \"is this guy \"demadit\" really from leica and is this is really an official statement on policy by leica on the delimitation issue of the m9/m-e/mm\"? maybe some of you know for a fact that \"demedit\" is a leica executive, but my immediate reaction was that this could be a spoof or a prank. over the weekend, i wrote the following e-mail to andrea frankl, jakon eberhard and birgitta mielke, i.e., the leica staff whose e-mail address i had:having now read the postings here that were written after i sent my e-mail, i can only say that i continue to find it mind boggling that leica camera ag is handling this matter in this way, assuming that \"demadit\" indeed is a leica staff member and that this indeed is intended by the company to be an official statement. if all this is real, it looks like 'amateur hour\". incidentally, my m9-p sensor had delimitation about a year after purchase. somewhat uneasy for the prospects for my m-m. i can assure you that mr viau is a ranking leica official and has the authority to speak for leica.", "sortedWord": "None", "identifyer": 38181, "year": "2014"}, {"Unnamed: 0": 376875, "autor": "wattsy", "date": 1416821400000, "content": "Actually the main time consuming issue with film is 'dust on the sensor' Not necessarily but, in any case, dust spotting a scan is far less time consuming than waiting 3 months to get your M9 (or, in my case, Monochrom) camera back from Germany. This \"corrosion\" business is a real blow for both customers and Leica and I'm not sure the current policy of replacing defective sensors (very slowly) with the same sensor is the way to address it. What a mess it looks like turning out to be.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/11/?tab=comments#comment-2713246", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "actually the main time consuming issue with film is 'dust on the sensor' not necessarily but, in any case, dust -----> spotting !!!  a scan is far less time consuming than waiting 3 months to get your m9 (or, in my case, monochrom) camera back from germany. this \"corrosion\" business is a real blow for both customers and leica and i'm not sure the current policy of replacing defective sensors (very slowly) with the same sensor is the way to address it. what a mess it looks like turning out to be.", "sortedWord": "None", "identifyer": 38186, "year": "2014"}, {"Unnamed: 0": 376878, "autor": "jaapv", "date": 1416823380000, "content": "Not necessarily but, in any case, dust spotting a scan is far less time consuming than waiting 3 months to get your M9 (or, in my case, Monochrom) camera back from Germany. This \"corrosion\" business is a real blow for both customers and Leica and I'm not sure the current policy of replacing defective sensors (very slowly) with the same sensor is the way to address it. What a mess it looks like turning out to be. A rock and a hard place, it seems. They wanted to bring out a full-frame rangefinder and the only suitable coverglass is sensitive to humidity - and now the boomerang is returning in the form of delamination on a large number of cameras. To be charitable, the maker of the glass is touting it for camera sensors... My problem is that the customer is expected to pay part of the price for an unfortunate design decision.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/11/?tab=comments#comment-2713259", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "not necessarily but, in any case, dust -----> spotting !!!  a scan is far less time consuming than waiting 3 months to get your m9 (or, in my case, monochrom) camera back from germany. this \"corrosion\" business is a real blow for both customers and leica and i'm not sure the current policy of replacing defective sensors (very slowly) with the same sensor is the way to address it. what a mess it looks like turning out to be. a rock and a hard place, it seems. they wanted to bring out a full-frame rangefinder and the only suitable coverglass is sensitive to humidity - and now the boomerang is returning in the form of delamination on a large number of cameras. to be charitable, the maker of the glass is touting it for camera sensors... my problem is that the customer is expected to pay part of the price for an unfortunate design decision.", "sortedWord": "None", "identifyer": 38189, "year": "2014"}, {"Unnamed: 0": 376895, "autor": "edwardkaraa", "date": 1416836880000, "content": "I keep all my photographic gear in a dry cabinet at below 45% RH. So I'm afraid that wouldn't help to prevent the corrosion. Remember this is not fungus we're talking about, it's a chemical reaction. It needs humidity to start, but once started, it might not need humidity anymore, or it may be accumulative. My M9 had only 5-10 spots after a couple of months of use. By the time I sent it to repair after exactly 1 year from purchase date, it had over 100 spots. So I don't think my dry cabinet did anything to delay or stop the reaction.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/12/?tab=comments#comment-2713378", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i keep all my photographic gear in a dry cabinet at below 45% rh. so i'm afraid that wouldn't help to prevent the corrosion. remember this is not fungus we're talking about, it's a chemical reaction. it needs humidity to start, but once started, it might not need humidity anymore, or it may be accumulative. my m9 had only 5-10 -----> spots !!!  after a couple of months of use. by the time i sent it to repair after exactly 1 year from purchase date, it had over 100 spots. so i don't think my dry cabinet did anything to delay or stop the reaction.", "sortedWord": "None", "identifyer": 38206, "year": "2014"}, {"Unnamed: 0": 376898, "autor": "edwardkaraa", "date": 1416839040000, "content": "Did you wet cleaned it? Yes I did wet clean it with sensor swabs but only after 6 months of ownership. By that time I had around 50 spots, and they were unmovable. I thought they were welded dust, and started to participate to this thread to find out what it was (see the first few pages). Then I decided to give it a professional clean up at the Leica dealer where I bought it, and after a quick inspection they told me I had a delaminating sensor. Edited November 24, 2014 by edwardkaraa", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/12/?tab=comments#comment-2713415", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "did you wet cleaned it? yes i did wet clean it with sensor swabs but only after 6 months of ownership. by that time i had around 50 -----> spots !!! , and they were unmovable. i thought they were welded dust, and started to participate to this thread to find out what it was (see the first few pages). then i decided to give it a professional clean up at the leica dealer where i bought it, and after a quick inspection they told me i had a delaminating sensor. edited november 24, 2014 by edwardkaraa", "sortedWord": "None", "identifyer": 38209, "year": "2014"}, {"Unnamed: 0": 376899, "autor": "M-Mount", "date": 1416839460000, "content": "Yes I did wet clean it with sensor swabs but only after 6 months of ownership. By that time I had around 50 spots, and they were unmovable. I thought they were welded dust, and even started a thread on this forum to see why the damned spots didn't go away. Then I decided to give it a professional clean up at the Leica dealer where I bought it, and after a quick inspection they told me I had a delaminating sensor. That doesn't sound good. Had your new sensor got again some spots?", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/12/?tab=comments#comment-2713423", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "yes i did wet clean it with sensor swabs but only after 6 months of ownership. by that time i had around 50 -----> spots !!! , and they were unmovable. i thought they were welded dust, and even started a thread on this forum to see why the damned spots didn't go away. then i decided to give it a professional clean up at the leica dealer where i bought it, and after a quick inspection they told me i had a delaminating sensor. that doesn't sound good. had your new sensor got again some spots?", "sortedWord": "None", "identifyer": 38210, "year": "2014"}, {"Unnamed: 0": 376901, "autor": "edwardkaraa", "date": 1416840180000, "content": "That doesn't sound good. Had your new sensor got again some spots? I hope not! I sold it to an impatient buyer just one day after I received it.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/12/?tab=comments#comment-2713434", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "that doesn't sound good. had your new sensor got again some -----> spots !!! ? i hope not! i sold it to an impatient buyer just one day after i received it.", "sortedWord": "None", "identifyer": 38212, "year": "2014"}, {"Unnamed: 0": 376903, "autor": "jaapv", "date": 1416844860000, "content": "Well, this makes me less than happy. In the spirit of this discussion I put my M9 and MM under the microscope and - off to Wetzlar, both of them. On the MM it looked like a little scratch- but it was a straight line of bubbles, the M9 is dotted in miniscule spots which don't yet show up on the images... The MM is no problem, being from 2012, but the M9 dates back to September 2009.....--img-- :mad: So my advice to all owners is - inspect your sensor properly, preferably under a microscope if you have access, even if nothing shows up on the image....Time is ticking now, with the new policy. Edited November 24, 2014 by jaapv", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/13/?tab=comments#comment-2713475", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "well, this makes me less than happy. in the spirit of this discussion i put my m9 and mm under the microscope and - off to wetzlar, both of them. on the mm it looked like a little scratch- but it was a straight line of bubbles, the m9 is dotted in miniscule -----> spots !!!  which don't yet show up on the images... the mm is no problem, being from 2012, but the m9 dates back to september 2009.....--img-- :mad: so my advice to all owners is - inspect your sensor properly, preferably under a microscope if you have access, even if nothing shows up on the image....time is ticking now, with the new policy. edited november 24, 2014 by jaapv", "sortedWord": "None", "identifyer": 38214, "year": "2014"}, {"Unnamed: 0": 376908, "autor": "M9reno", "date": 1416848340000, "content": " Jaap: Please keep us updated, and very best of luck. As far as my 2011 M9, I'm sticking my head in the sand on this one. I could go out now and start shooting skies at f/16, and check for problems. Most likely I would just find dirt, which absent wet-cleaning I will likely not be able to get rid of anyway, so why bother. In fact, I think I might take Leica's (RIDICULOUS) advice and start making a habit of never shooting at medium or small apertures. If/when delamination happens, I will refuse to pay 600, 1200, or 1500 Euros for a replacement sensor, so I may spot-remove as long as I can on Photoshop, or simply retire the M9 at that point... In the spirit of this discussion, having for a long time vacillated on getting a Jobo CPP3+lift, I have ten minutes ago placed an order with Firstcall in the UK. Perhaps a bit impulsive, but I doubt I will regret it. For the past several years I have used Leica film cameras for b/w, and the M9 for colour. Now I'm phasing back into film all the way, and cutting out the labs altogether. Anyway, there goes a big chunk of the cash that would have been sunk on further Leica digital, whether a Monochrom, or a Typ 240, or whatever. Yesterday the M8, today the M9, tomorrow...what? I have just lost trust. I love photography and Leica, but the modern company have really put me off for good this time. Edited November 24, 2014 by M9reno", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/13/?tab=comments#comment-2713513", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " jaap: please keep us updated, and very best of luck. as far as my 2011 m9, i'm sticking my head in the sand on this one. i could go out now and start shooting skies at f/16, and check for problems. most likely i would just find dirt, which absent wet-cleaning i will likely not be able to get rid of anyway, so why bother. in fact, i think i might take leica's (ridiculous) advice and start making a habit of never shooting at medium or small apertures. if/when delamination happens, i will refuse to pay 600, 1200, or 1500 euros for a replacement sensor, so i may -----> spot !!! -remove as long as i can on photoshop, or simply retire the m9 at that point... in the spirit of this discussion, having for a long time vacillated on getting a jobo cpp3+lift, i have ten minutes ago placed an order with firstcall in the uk. perhaps a bit impulsive, but i doubt i will regret it. for the past several years i have used leica film cameras for b/w, and the m9 for colour. now i'm phasing back into film all the way, and cutting out the labs altogether. anyway, there goes a big chunk of the cash that would have been sunk on further leica digital, whether a monochrom, or a typ 240, or whatever. yesterday the m8, today the m9, tomorrow...what? i have just lost trust. i love photography and leica, but the modern company have really put me off for good this time. edited november 24, 2014 by m9reno", "sortedWord": "None", "identifyer": 38219, "year": "2014"}, {"Unnamed: 0": 376909, "autor": "k-hawinkler", "date": 1416848700000, "content": "My son and I yesterday cleaned the sensor of my M9 that I bought in Decemcer of 2009. We had to use all the known methods, blower, brush, lollipop, wet cleaning. But it's now cleaner than it ever was. His eyes are good enough that he could see unaided the dust spots. Not having a microscope the sensor and the images it produces look fine to the naked eye or through a loupe. So I will continue to use my M9 and hope my so far good fortune continues and the M9 doesn't develop lepracy here in the typically dry air in New Mexico. In the winter humidity indoors is as low as 15%. Hopefully Leica sees the wisdom to come clean on this issue, make official statements, and announce an appropriate policy based on actuually addressing the issue and not prolonging it unnecessarily. That's what is requied in order to restore for me confidence in their future products. For my Leica R lenses I will get one of these new Sony 5-axis IBIS cameras when they become available in 2015. I hope Sony's IBIS works as well as Olympus'. The latter seems like magic. I hope my M9 can be maintained in the future if that should become necessary. Though I am looking foward to a future M camera that isn't afflicted by any of the current problems of their M8, M9, or even M240 product lines. However, I will only buy a future Leica camera if Leica improves their policies and practicies.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/13/?tab=comments#comment-2713515", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "my son and i yesterday cleaned the sensor of my m9 that i bought in decemcer of 2009. we had to use all the known methods, blower, brush, lollipop, wet cleaning. but it's now cleaner than it ever was. his eyes are good enough that he could see unaided the dust -----> spots !!! . not having a microscope the sensor and the images it produces look fine to the naked eye or through a loupe. so i will continue to use my m9 and hope my so far good fortune continues and the m9 doesn't develop lepracy here in the typically dry air in new mexico. in the winter humidity indoors is as low as 15%. hopefully leica sees the wisdom to come clean on this issue, make official statements, and announce an appropriate policy based on actuually addressing the issue and not prolonging it unnecessarily. that's what is requied in order to restore for me confidence in their future products. for my leica r lenses i will get one of these new sony 5-axis ibis cameras when they become available in 2015. i hope sony's ibis works as well as olympus'. the latter seems like magic. i hope my m9 can be maintained in the future if that should become necessary. though i am looking foward to a future m camera that isn't afflicted by any of the current problems of their m8, m9, or even m240 product lines. however, i will only buy a future leica camera if leica improves their policies and practicies.", "sortedWord": "None", "identifyer": 38220, "year": "2014"}, {"Unnamed: 0": 376921, "autor": "jaapv", "date": 1416913140000, "content": "According to information I received today by Leica CS, only a limited number of cameras are affected, in a small percentage. The Internet magnifying glass appears to be in full swing. I URGE EVERYBODY TO USE COMMON SENSE. IF YOU HAVE SPOTS ON YOUR SENSOR THAT APPEAR TO BE UNREMOVEABLE , INSPECT THE SENSOR VERY CAREFULLY USING PROPER VIEWING TOOLS, OR EVEN BETTER, HAVE YOUR SENSOR CLEANED BY A LEICA DEALER. HE CAN ADVISE YOU WHETHER FURTHER ACTION IS REQUIRED. IF EVERYBODY STARTS SENDING EVERY DUSTY SENSOR TO WETZLAR, CS WILL BE OVERWHELMED WITHIN DAYS. THIS WILL RESULT IN LONG AND UNNECESSARY WAITING TIMES FOR THE FEW THAT WILL NEED A REPAIR. Edited November 25, 2014 by jaapv", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/13/?tab=comments#comment-2713977", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "according to information i received today by leica cs, only a limited number of cameras are affected, in a small percentage. the internet magnifying glass appears to be in full swing. i urge everybody to use common sense. if you have -----> spots !!!  on your sensor that appear to be unremoveable , inspect the sensor very carefully using proper viewing tools, or even better, have your sensor cleaned by a leica dealer. he can advise you whether further action is required. if everybody starts sending every dusty sensor to wetzlar, cs will be overwhelmed within days. this will result in long and unnecessary waiting times for the few that will need a repair. edited november 25, 2014 by jaapv", "sortedWord": "None", "identifyer": 38232, "year": "2014"}, {"Unnamed: 0": 376925, "autor": "Fotofanatiker", "date": 1416914520000, "content": "I went to the local Leica service centre here in Singapore last Friday to get my sensor cleaned as I had a number of spots I wasn't able to remove with my blower and the Pentax sticks... I have never done a wet cleaning of my sensor. Result: the sensor needs to be replaced, the \"dots\" are corrosion, the friendly service guy said. As my M9 is from 2010, I have to pay 1000SGD/600€... --img--  According to him, humidity might be the reason here, I have been living in Dubai and Shanghai before, but bought a dry cabinet in the first week after arriving in Singapore 3 months ago. Might have been too late. A crop of an image taken last week looks like this: the spots which (to my eye) looked like oil are in fact the evil ones, it seems. --img-- ", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/14/?tab=comments#comment-2713993", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i went to the local leica service centre here in singapore last friday to get my sensor cleaned as i had a number of -----> spots !!!  i wasn't able to remove with my blower and the pentax sticks... i have never done a wet cleaning of my sensor. result: the sensor needs to be replaced, the \"dots\" are corrosion, the friendly service guy said. as my m9 is from 2010, i have to pay 1000sgd/600€... --img--  according to him, humidity might be the reason here, i have been living in dubai and shanghai before, but bought a dry cabinet in the first week after arriving in singapore 3 months ago. might have been too late. a crop of an image taken last week looks like this: the spots which (to my eye) looked like oil are in fact the evil ones, it seems. --img-- ", "sortedWord": "None", "identifyer": 38236, "year": "2014"}, {"Unnamed: 0": 376926, "autor": "wlaidlaw", "date": 1416914580000, "content": "It's right on Schott's cut sheets for the glass. S8612 is the wunderkind ultra thin, ultra effective one - and as noted above is exactly what makes up the M9's absorption filter. See what its sheet says about coatings: http://www.howardglass.com/pdf/s_8612_datasheet.pdf All of these near IR glasses have humidity warnings, S8612's is the most severe. Also, you can see that all three are not humidity resistant in the counter distinction below. NIR cutoff filters for image sensors and night vision systems | SCHOTT North America The usual workarounds are coating and laminating to other glass. Call Bob Cairns. He'll tell you all about it. Dante Humidity killed my M9 sensor. I was caught out in a torrential downpour in the last remaining piece of tropical rain forest in Barbados (Welchman Hall Gully) for an hour, with my M9 wrapped up in a plastic trash bag to \"keep it dry\". Within a day, the dreaded white spots appeared. I have not used it in a high humidity environment since the sensor was replaced and now that I use the M240 as my main camera, the M9 is used as an indoor technical and copying camera only, so hopefully it might last better in this use. As others have said, I am now waiting for the next disaster with the M240. Not a great track record on digital M's. First the M8 IR and filters problem, second the irreplaceable M8 LCD screen and graphics card, now the M9/M-E/MM sensor - what next? Wilson", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/14/?tab=comments#comment-2713994", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "it's right on schott's cut sheets for the glass. s8612 is the wunderkind ultra thin, ultra effective one - and as noted above is exactly what makes up the m9's absorption filter. see what its sheet says about coatings: http://www.howardglass.com/pdf/s_8612_datasheet.pdf all of these near ir glasses have humidity warnings, s8612's is the most severe. also, you can see that all three are not humidity resistant in the counter distinction below. nir cutoff filters for image sensors and night vision systems | schott north america the usual workarounds are coating and laminating to other glass. call bob cairns. he'll tell you all about it. dante humidity killed my m9 sensor. i was caught out in a torrential downpour in the last remaining piece of tropical rain forest in barbados (welchman hall gully) for an hour, with my m9 wrapped up in a plastic trash bag to \"keep it dry\". within a day, the dreaded white -----> spots !!!  appeared. i have not used it in a high humidity environment since the sensor was replaced and now that i use the m240 as my main camera, the m9 is used as an indoor technical and copying camera only, so hopefully it might last better in this use. as others have said, i am now waiting for the next disaster with the m240. not a great track record on digital m's. first the m8 ir and filters problem, second the irreplaceable m8 lcd screen and graphics card, now the m9/m-e/mm sensor - what next? wilson", "sortedWord": "None", "identifyer": 38237, "year": "2014"}, {"Unnamed: 0": 376967, "autor": "edwardkaraa", "date": 1416993780000, "content": "It is true that not all M9s travel to Southeast Asia. But all M9s DO need contact cleaning of their sensors, usually by wet cleaning, which has been widely endorsed in this forum, as Leica has doubtless known from day one. The humidity-corrosion issue (at least as it has so far been reported) is therefore a universal one. Totally agreed. And the main issue is not dust but oil splatter from the new shutter. In my experience this is unavoidable for the first 1000 shots or so. How would you clean oil spots without a solvent? And how about oil drops themselves? Wouldn't they cause problems by just being there on the glass surface?", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/16/?tab=comments#comment-2714682", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "it is true that not all m9s travel to southeast asia. but all m9s do need contact cleaning of their sensors, usually by wet cleaning, which has been widely endorsed in this forum, as leica has doubtless known from day one. the humidity-corrosion issue (at least as it has so far been reported) is therefore a universal one. totally agreed. and the main issue is not dust but oil splatter from the new shutter. in my experience this is unavoidable for the first 1000 shots or so. how would you clean oil -----> spots !!!  without a solvent? and how about oil drops themselves? wouldn't they cause problems by just being there on the glass surface?", "sortedWord": "None", "identifyer": 38278, "year": "2014"}, {"Unnamed: 0": 386197, "autor": "wlaidlaw", "date": 1405150380000, "content": "Just spotted this thread. My tuppence worth on the Elmar-M 50/2.8. I bought a new one in 2007. The build quality was appalling. There were no detents to speak of on the loose and wobbly aperture ring and the lens cell could still wobble when extended and locked. I had had some pretty dire experience with Leica service in the previous 24 months, so had no confidence in their ability to cure these faults (they are far better now). I therefore did a deal with the selling dealer and bought a Zeiss ZM Planar instead, which I still have and is my “go to” lens for technical stuff when a 50mm is called for, due to its extreme sharpness and very flat field. When I want a very small lens (almost as small as a collapsed Elmar), I use a 40mm/f2 Summicron-C. There are various people who can improve the performance of these tiny lenses by very careful rebuilding (Malcolm Taylor, Don Goldberg, Will van Manen) to modern standards and I can say from experience, that it draws beautifully on the M8, with an EFOV of 52mm. The slope of the RF cam may need checking on some early versions. Wilson", "link": "https://www.l-camera-forum.com/topic/226757-thinking-of-buying-an-m8/page/4/?tab=comments#comment-2628904", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "just -----> spotted !!!  this thread. my tuppence worth on the elmar-m 50/2.8. i bought a new one in 2007. the build quality was appalling. there were no detents to speak of on the loose and wobbly aperture ring and the lens cell could still wobble when extended and locked. i had had some pretty dire experience with leica service in the previous 24 months, so had no confidence in their ability to cure these faults (they are far better now). i therefore did a deal with the selling dealer and bought a zeiss zm planar instead, which i still have and is my “go to” lens for technical stuff when a 50mm is called for, due to its extreme sharpness and very flat field. when i want a very small lens (almost as small as a collapsed elmar), i use a 40mm/f2 summicron-c. there are various people who can improve the performance of these tiny lenses by very careful rebuilding (malcolm taylor, don goldberg, will van manen) to modern standards and i can say from experience, that it draws beautifully on the m8, with an efov of 52mm. the slope of the rf cam may need checking on some early versions. wilson", "sortedWord": "None", "identifyer": 47603, "year": "2014"}, {"Unnamed: 0": 386199, "autor": "jaapv", "date": 1405415100000, "content": "Just spotted this thread. My tuppence worth on the Elmar-M 50/2.8. I bought a new one in 2007. The build quality was appalling. There were no detents to speak of on the loose and wobbly aperture ring and the lens cell could still wobble when extended and locked. I had had some pretty dire experience with Leica service in the previous 24 months, so had no confidence in their ability to cure these faults (they are far better now). I therefore did a deal with the selling dealer and bought a Zeiss ZM Planar instead, which I still have and is my “go to” lens for technical stuff when a 50mm is called for, due to its extreme sharpness and very flat field. When I want a very small lens (almost as small as a collapsed Elmar), I use a 40mm/f2 Summicron-C. There are various people who can improve the performance of these tiny lenses by very careful rebuilding (Malcolm Taylor, Don Goldberg, Will van Manen) to modern standards and I can say from experience, that it draws beautifully on the M8, with an EFOV of 52mm. The slope of the RF cam may need checking on some early versions. Wilson I had my Elmar-M ( 2007 as well) overhauled by Leica CS about a year ago and it has improved the lens beyond recognition.--img-- ", "link": "https://www.l-camera-forum.com/topic/226757-thinking-of-buying-an-m8/page/4/?tab=comments#comment-2630847", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "just -----> spotted !!!  this thread. my tuppence worth on the elmar-m 50/2.8. i bought a new one in 2007. the build quality was appalling. there were no detents to speak of on the loose and wobbly aperture ring and the lens cell could still wobble when extended and locked. i had had some pretty dire experience with leica service in the previous 24 months, so had no confidence in their ability to cure these faults (they are far better now). i therefore did a deal with the selling dealer and bought a zeiss zm planar instead, which i still have and is my “go to” lens for technical stuff when a 50mm is called for, due to its extreme sharpness and very flat field. when i want a very small lens (almost as small as a collapsed elmar), i use a 40mm/f2 summicron-c. there are various people who can improve the performance of these tiny lenses by very careful rebuilding (malcolm taylor, don goldberg, will van manen) to modern standards and i can say from experience, that it draws beautifully on the m8, with an efov of 52mm. the slope of the rf cam may need checking on some early versions. wilson i had my elmar-m ( 2007 as well) overhauled by leica cs about a year ago and it has improved the lens beyond recognition.--img-- ", "sortedWord": "None", "identifyer": 47605, "year": "2014"}, {"Unnamed: 0": 398422, "autor": "Rick", "date": 1418508180000, "content": "My choices for travel is based on what works for me. I don't have a lens-set based mainly on trying to carry a good spaced out group of focal lengths. Or, which are optically the fastest or most corrected lenses in each focal length. My choices are based on how I want to create a scene through a particular lens, mostly based on the focal lengths I like to work with and \"see\" in. To a lesser degree other particular lens characteristics play a role in why I like a lens. But, mostly I want lenses that allow me to approach a scene with the thought of completely controlling and manipulating the way the viewer is going to see and experience the image. I am more the active \"deliberate moment\" photographer working everything in my control, as apposed to the passive photographer waiting for the decisive moment to happen along through my viewfinder. Everyone has to actively decide how they are going to use every lens they bring along in their own travel kit themselves. These are my travel choices. WATE - I just love to see in the wide 16mm. Not because I want more in the scene as much as I like the near-far perspective the wides create. 21mm seems more normal in comparison to me, but is mostly useful to me when 16 needs cropping. The WATE allows me to see and create the placement of the camera (perspective) and use the zoom from 16-21 to crop the picture, I see in 16mm. Just how I approach the complex ultra-wide view. 28 Summicron - All around way I like to compose and create layered scenes with interest. Also, can be used to exaggerate perspective. f4.0 is normal for me and I tend to go to f16 more than I would f2.0 50 Summilux - Just all around best 50mm lens ever made. Tend to shoot at f4.0 and the transition to OOF is sooo smooth. Will stop down, but I'm not a bokeh fan for near shots as they always tend to just look like everything is out of focus, to me. Mid range shots are nice wide open, though. Great travel night lens with 1.4 available and creating background OOF lights. 90 Macro Elmar - Recognized as having the best optics of the 90mm Leica lenses at near for portraiture, for example. Top quality for distance landscape. Insanely compact and gives macro if you need. I'd never consider carrying the 90 APO or even the other large 90mm lenses for travel. Shot mostly in daylight I don't find a need for f2.0. Best long travel 90mm lens in my opinion. Not used enough by me, though. (I have the 35mm 1.4 FLE and it is a superior image quality choice, but it can be very normal and without drama and interest, for me. Harder to work into interesting perspectives, for me. Bigger and heavier than the excellent 28 Summicron the 35 FLE is too close to the 50mm and 28mm with nothing unique enough to garner a spot in the travel kit. And, I dislike the background bokeh of specular highlights.) Rick Edited December 13, 2014 by RickLeica", "link": "https://www.l-camera-forum.com/topic/237368-travel-lens-suggestions/page/3/?tab=comments#comment-2727834", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my choices for travel is based on what works for me. i don't have a lens-set based mainly on trying to carry a good spaced out group of focal lengths. or, which are optically the fastest or most corrected lenses in each focal length. my choices are based on how i want to create a scene through a particular lens, mostly based on the focal lengths i like to work with and \"see\" in. to a lesser degree other particular lens characteristics play a role in why i like a lens. but, mostly i want lenses that allow me to approach a scene with the thought of completely controlling and manipulating the way the viewer is going to see and experience the image. i am more the active \"deliberate moment\" photographer working everything in my control, as apposed to the passive photographer waiting for the decisive moment to happen along through my viewfinder. everyone has to actively decide how they are going to use every lens they bring along in their own travel kit themselves. these are my travel choices. wate - i just love to see in the wide 16mm. not because i want more in the scene as much as i like the near-far perspective the wides create. 21mm seems more normal in comparison to me, but is mostly useful to me when 16 needs cropping. the wate allows me to see and create the placement of the camera (perspective) and use the zoom from 16-21 to crop the picture, i see in 16mm. just how i approach the complex ultra-wide view. 28 summicron - all around way i like to compose and create layered scenes with interest. also, can be used to exaggerate perspective. f4.0 is normal for me and i tend to go to f16 more than i would f2.0 50 summilux - just all around best 50mm lens ever made. tend to shoot at f4.0 and the transition to oof is sooo smooth. will stop down, but i'm not a bokeh fan for near shots as they always tend to just look like everything is out of focus, to me. mid range shots are nice wide open, though. great travel night lens with 1.4 available and creating background oof lights. 90 macro elmar - recognized as having the best optics of the 90mm leica lenses at near for portraiture, for example. top quality for distance landscape. insanely compact and gives macro if you need. i'd never consider carrying the 90 apo or even the other large 90mm lenses for travel. shot mostly in daylight i don't find a need for f2.0. best long travel 90mm lens in my opinion. not used enough by me, though. (i have the 35mm 1.4 fle and it is a superior image quality choice, but it can be very normal and without drama and interest, for me. harder to work into interesting perspectives, for me. bigger and heavier than the excellent 28 summicron the 35 fle is too close to the 50mm and 28mm with nothing unique enough to garner a -----> spot !!!  in the travel kit. and, i dislike the background bokeh of specular highlights.) rick edited december 13, 2014 by rickleica", "sortedWord": "None", "identifyer": 11063, "year": "2014"}, {"Unnamed: 0": 405153, "autor": "CheshireCat", "date": 1405253040000, "content": "For example in the following thread people couldn't tell a Noctilux from an Elmar: http://www.l-camera-forum.com/leica-forum/leica-m-lenses/337980-50-do-you-prefer.html This is because the lens character (i.e. signature aberrations) almost disappears at small apertures. Not all people in this forum are lens experts, so they could not spot the wide open Elmar by means of the cat's eye bokeh. But they could appreciate the difference in rendering, which is all that matters. Again, one buys a Noctilux to shoot it wide open. The fact it works great also stopped down means we don't need to carry another 50 in the bag.", "link": "https://www.l-camera-forum.com/topic/228818-the-noctilux-f1-is-still-magical/page/3/?tab=comments#comment-2629578", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "for example in the following thread people couldn't tell a noctilux from an elmar: http://www.l-camera-forum.com/leica-forum/leica-m-lenses/337980-50-do-you-prefer.html this is because the lens character (i.e. signature aberrations) almost disappears at small apertures. not all people in this forum are lens experts, so they could not -----> spot !!!  the wide open elmar by means of the cat's eye bokeh. but they could appreciate the difference in rendering, which is all that matters. again, one buys a noctilux to shoot it wide open. the fact it works great also stopped down means we don't need to carry another 50 in the bag.", "sortedWord": "None", "identifyer": 17916, "year": "2014"}, {"Unnamed: 0": 412686, "autor": "MarkP", "date": 1393019280000, "content": " Camera Clinic checked the focus which is spot on, and I got the lens back yesterday. Will send it back when they have the coded flange. Hand coded 'till then. Went out to use it again yesterday. Glorious lens. --img--  ~100% crop --img--  Edited February 21, 2014 by MarkP", "link": "https://www.l-camera-forum.com/topic/173284-75-summilux/page/12/?tab=comments#comment-2536766", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " camera clinic checked the focus which is -----> spot !!!  on, and i got the lens back yesterday. will send it back when they have the coded flange. hand coded 'till then. went out to use it again yesterday. glorious lens. --img--  ~100% crop --img--  edited february 21, 2014 by markp", "sortedWord": "None", "identifyer": 25536, "year": "2014"}, {"Unnamed: 0": 412747, "autor": "menos I M6", "date": 1400727000000, "content": "This is the eye 100% from the shot I previously published. honestly this sharpness is crazy to any standard for such a luminous lens. NOTE: this 75mm Summilux-M is \"Made in Germany\" and came with 6-bit out of box --img--  75Lux is 130gr heavier than 75apocron but most of its weight is in the front and without a grip this lens on any M camera feels really uncomfortable; i guess thats the price to pay for Mandler's masterpiece --img--  This is a rumour possibly created by collector owners of German made copies. The late Canadian and German copies are indeed optical identical. I have a late Canadian copy, which has been to Wetzlar a few weeks ago for a complete rebuild including coding and fine calibration to match my also provided Noctilux and 135 APO Telyt. The 75 Summilux is spot on now from wide open on several digital bodies, which have been calibrated independently (M9 calibrated in Wetzlar together with 75/1.4, M8.2 + MM calibrated by myself with reference of 50/1 v4 earlier). Whatever copy anybody has nowadays, which does not work 100% to the best samples of this lens can be brought up to spec by Leica Wetzlar. Optical elements will be re-aligned if necessary, focal length will be fine adjusted towards the given focus mount calibration or the other way around if deemed more reasonable (adjustment of focal length is often easier in the scope of leeway the optical assembly provides instead of re-machining or part exchanging the focus mount assembly). The same as with Noctilux, 135/3.4 and 21/24mm Summilux, which are the most critical lenses in the system due to the mechanical RF design - if something is off with a certain lens, a trip to Wetzlar will definitely fix it. Congrats on your copy, German or not it looks great and I really like your portrait shown earlier!", "link": "https://www.l-camera-forum.com/topic/173284-75-summilux/page/15/?tab=comments#comment-2594567", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "this is the eye 100% from the shot i previously published. honestly this sharpness is crazy to any standard for such a luminous lens. note: this 75mm summilux-m is \"made in germany\" and came with 6-bit out of box --img--  75lux is 130gr heavier than 75apocron but most of its weight is in the front and without a grip this lens on any m camera feels really uncomfortable; i guess thats the price to pay for mandler's masterpiece --img--  this is a rumour possibly created by collector owners of german made copies. the late canadian and german copies are indeed optical identical. i have a late canadian copy, which has been to wetzlar a few weeks ago for a complete rebuild including coding and fine calibration to match my also provided noctilux and 135 apo telyt. the 75 summilux is -----> spot !!!  on now from wide open on several digital bodies, which have been calibrated independently (m9 calibrated in wetzlar together with 75/1.4, m8.2 + mm calibrated by myself with reference of 50/1 v4 earlier). whatever copy anybody has nowadays, which does not work 100% to the best samples of this lens can be brought up to spec by leica wetzlar. optical elements will be re-aligned if necessary, focal length will be fine adjusted towards the given focus mount calibration or the other way around if deemed more reasonable (adjustment of focal length is often easier in the scope of leeway the optical assembly provides instead of re-machining or part exchanging the focus mount assembly). the same as with noctilux, 135/3.4 and 21/24mm summilux, which are the most critical lenses in the system due to the mechanical rf design - if something is off with a certain lens, a trip to wetzlar will definitely fix it. congrats on your copy, german or not it looks great and i really like your portrait shown earlier!", "sortedWord": "None", "identifyer": 25597, "year": "2014"}, {"Unnamed: 0": 412749, "autor": "bephoto", "date": 1400737980000, "content": "how much is the cost of recalibration? I have a 35mm pre-asph chrome which is kinda off - back focus on M240 but spot on on M7 dunno what to do. I can't send my camera then I have to do everything with a 5ton hasselblad for months i guess. how long it takes?", "link": "https://www.l-camera-forum.com/topic/173284-75-summilux/page/15/?tab=comments#comment-2594609", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how much is the cost of recalibration? i have a 35mm pre-asph chrome which is kinda off - back focus on m240 but -----> spot !!!  on on m7 dunno what to do. i can't send my camera then i have to do everything with a 5ton hasselblad for months i guess. how long it takes?", "sortedWord": "None", "identifyer": 25599, "year": "2014"}, {"Unnamed: 0": 412753, "autor": "MarkP", "date": 1400826180000, "content": "how much is the cost of recalibration? I have a 35mm pre-asph chrome which is kinda off - back focus on M240 but spot on on M7 dunno what to do. I can't send my camera then I have to do everything with a 5ton hasselblad for months i guess. how long it takes? Get it 6-bit coded - calibration cost included.", "link": "https://www.l-camera-forum.com/topic/173284-75-summilux/page/15/?tab=comments#comment-2595333", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "how much is the cost of recalibration? i have a 35mm pre-asph chrome which is kinda off - back focus on m240 but -----> spot !!!  on on m7 dunno what to do. i can't send my camera then i have to do everything with a 5ton hasselblad for months i guess. how long it takes? get it 6-bit coded - calibration cost included.", "sortedWord": "None", "identifyer": 25603, "year": "2014"}, {"Unnamed: 0": 423325, "autor": "Steve P", "date": 1399984560000, "content": "Okay - I'm in [ATTACH]434192[/ATTACH] Captions Please Josephine thought her luck was in when Giles invited her for a spot of 'rough and tumble in the dunes'. Now she wishes she'd left her clothes on!", "link": "https://www.l-camera-forum.com/topic/314859-ttltl2-image-thread/page/2/?tab=comments#comment-2589467", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "okay - i'm in [attach]434192[/attach] captions please josephine thought her luck was in when giles invited her for a -----> spot !!!  of 'rough and tumble in the dunes'. now she wishes she'd left her clothes on!", "sortedWord": "None", "identifyer": 36377, "year": "2014"}, {"Unnamed: 0": 423326, "autor": "jonoslack", "date": 1400001480000, "content": "[ATTACH]434192[/ATTACH] Josephine thought her luck was in when Giles invited her for a spot of 'rough and tumble in the dunes'. Now she wishes she'd left her clothes on! Thank you Steve. That's perfect! Edited May 13, 2014 by jonoslack", "link": "https://www.l-camera-forum.com/topic/314859-ttltl2-image-thread/page/2/?tab=comments#comment-2589638", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "[attach]434192[/attach] josephine thought her luck was in when giles invited her for a -----> spot !!!  of 'rough and tumble in the dunes'. now she wishes she'd left her clothes on! thank you steve. that's perfect! edited may 13, 2014 by jonoslack", "sortedWord": "None", "identifyer": 36378, "year": "2014"}, {"Unnamed: 0": 423403, "autor": "!Nomad64", "date": 1402344720000, "content": "John, thanks for sharing your thoughts and files. I took the liberty to download and examine them. In the jpeg file the CA on the boy's leg is visible but quite unnoticeable as it blends with the pants color. But the same CA in the same color is visible either in the poles at the right behind the flag and in the arch holding the Ola Vista sign. As a Linux user I grind DNGs in RAWTherapee which has no camera dedicated profile, so it's easy for me to spot shortcomings if any as they're not covered by the software. No matter applying distortion correction or not, there's a faint trace of CA in the boy's leg. Only this time is more visible as the fringing is purple/magenta and not blue as in the jpeg. I also see CA in the poles at the right and in the top of the flag pole. In both places fringing is green on the right and magenta on the left, God only knows why. In RAWTherapee intensity of CA depends much on applied color presets. Those which pump the color to give more pop tend to exacerbate the problem. Regrettably enough (for me) RAWTherapee filters to defringe and to remove CA apparently can nothing against the fringing I usually find in T's DNGs. Strangely enough, the same correction filters are very effective on the DNG files produced by my X2 which shares the same sensor of the T. Finally, what seems odd to me is the amount of details that went lost in the jpeg you shared, especially considering that I'm no good at all at PP. Here are two 100% crops. One is from my jpeg originating from your DNG, the other's yours as available in Dropbox. Was this straight ooc? Cheers, Bruno --img-- --img--  Edited June 9, 2014 by !Nomad64", "link": "https://www.l-camera-forum.com/topic/314859-ttltl2-image-thread/page/6/?tab=comments#comment-2607474", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "john, thanks for sharing your thoughts and files. i took the liberty to download and examine them. in the jpeg file the ca on the boy's leg is visible but quite unnoticeable as it blends with the pants color. but the same ca in the same color is visible either in the poles at the right behind the flag and in the arch holding the ola vista sign. as a linux user i grind dngs in rawtherapee which has no camera dedicated profile, so it's easy for me to -----> spot !!!  shortcomings if any as they're not covered by the software. no matter applying distortion correction or not, there's a faint trace of ca in the boy's leg. only this time is more visible as the fringing is purple/magenta and not blue as in the jpeg. i also see ca in the poles at the right and in the top of the flag pole. in both places fringing is green on the right and magenta on the left, god only knows why. in rawtherapee intensity of ca depends much on applied color presets. those which pump the color to give more pop tend to exacerbate the problem. regrettably enough (for me) rawtherapee filters to defringe and to remove ca apparently can nothing against the fringing i usually find in t's dngs. strangely enough, the same correction filters are very effective on the dng files produced by my x2 which shares the same sensor of the t. finally, what seems odd to me is the amount of details that went lost in the jpeg you shared, especially considering that i'm no good at all at pp. here are two 100% crops. one is from my jpeg originating from your dng, the other's yours as available in dropbox. was this straight ooc? cheers, bruno --img-- --img--  edited june 9, 2014 by !nomad64", "sortedWord": "None", "identifyer": 36455, "year": "2014"}, {"Unnamed: 0": 423589, "autor": "dkCambridgeshire", "date": 1416658980000, "content": "… continuation … --img--  ISO 3200 --img--  ISO 6400 --img--  ISO 12500 Conclusion … the T's high ISO capability is excellent ... probably better in monochrome than in colour … max ISO 12500 is usable but better results at up to ISO 3200. The project I have in mind will use the camera's built-in flash … but with a filter on the flash … hence need to use high ISO. The Viso 'T' enables fairly easy focus in low light because it has a 'sweet spot' where the focused image seems to 'jump' with a shimmering moiré effect. Both Jono Slack and Mike Evans remark on this 'in focus shimmer' effect in their T reviews. Best wishes dunk Edited November 22, 2014 by dkpeterborough typo", "link": "https://www.l-camera-forum.com/topic/314859-ttltl2-image-thread/page/16/?tab=comments#comment-2711963", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "… continuation … --img--  iso 3200 --img--  iso 6400 --img--  iso 12500 conclusion … the t's high iso capability is excellent ... probably better in monochrome than in colour … max iso 12500 is usable but better results at up to iso 3200. the project i have in mind will use the camera's built-in flash … but with a filter on the flash … hence need to use high iso. the viso 't' enables fairly easy focus in low light because it has a 'sweet -----> spot !!! ' where the focused image seems to 'jump' with a shimmering moiré effect. both jono slack and mike evans remark on this 'in focus shimmer' effect in their t reviews. best wishes dunk edited november 22, 2014 by dkpeterborough typo", "sortedWord": "None", "identifyer": 36642, "year": "2014"}, {"Unnamed: 0": 445434, "autor": "thighslapper", "date": 1393155480000, "content": "Very attractive photos, the first two especially. To my eye the exposure of the Limassol and Nicosia scenes is perfect. The colours sing but without losing that wonderful natural look. Nicely done! Yes ...... I am increasingly impressed with this camera ..... the sharpness and detail in the images is astonishing and WB and exposure are almost always spot on. I'm ashamed to say I pick the XV up every time I go out and the M and MM are currently sulking in the safe .....--img-- ", "link": "https://www.l-camera-forum.com/topic/206939-leica-x-vario-photos/page/12/?tab=comments#comment-2537624", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "very attractive photos, the first two especially. to my eye the exposure of the limassol and nicosia scenes is perfect. the colours sing but without losing that wonderful natural look. nicely done! yes ...... i am increasingly impressed with this camera ..... the sharpness and detail in the images is astonishing and wb and exposure are almost always -----> spot !!!  on. i'm ashamed to say i pick the xv up every time i go out and the m and mm are currently sulking in the safe .....--img-- ", "sortedWord": "None", "identifyer": 8839, "year": "2014"}, {"Unnamed: 0": 445475, "autor": "thighslapper", "date": 1394405340000, "content": "A spot of damp in the kitchen....... --img-- ", "link": "https://www.l-camera-forum.com/topic/206939-leica-x-vario-photos/page/14/?tab=comments#comment-2546557", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a -----> spot !!!  of damp in the kitchen....... --img-- ", "sortedWord": "None", "identifyer": 8881, "year": "2014"}, {"Unnamed: 0": 445477, "autor": "XVarior", "date": 1394487060000, "content": "A spot of damp in the kitchen....... That's amazing! And there are people out there still questioning the XV capabilities. Thanks for sharing .", "link": "https://www.l-camera-forum.com/topic/206939-leica-x-vario-photos/page/14/?tab=comments#comment-2547186", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a -----> spot !!!  of damp in the kitchen....... that's amazing! and there are people out there still questioning the xv capabilities. thanks for sharing .", "sortedWord": "None", "identifyer": 8883, "year": "2014"}, {"Unnamed: 0": 445487, "autor": "thighslapper", "date": 1394921700000, "content": "Tried some HDR today ...... and a bit of rather non-scientific comparison with the M ........ lens FL slightly different so cropped to same size .... see if you can spot the difference ..... a good bit less than expected .....--img-- --img-- --img--  Edited March 15, 2014 by thighslapper", "link": "https://www.l-camera-forum.com/topic/206939-leica-x-vario-photos/page/14/?tab=comments#comment-2550458", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "tried some hdr today ...... and a bit of rather non-scientific comparison with the m ........ lens fl slightly different so cropped to same size .... see if you can -----> spot !!!  the difference ..... a good bit less than expected .....--img-- --img-- --img--  edited march 15, 2014 by thighslapper", "sortedWord": "None", "identifyer": 8893, "year": "2014"}, {"Unnamed: 0": 445628, "autor": "Volbeat", "date": 1399564500000, "content": "Hi, Just picked up a used X2 over Easter and took it to Edinburgh Zoo at the weekend for it's first workout. I'm delighted with the results. --img-- well spotted by --img-- Flamingos by --img-- Posing Penguins by --img-- You can see his stripes but you know he's clean by", "link": "https://www.l-camera-forum.com/topic/181346-leica-x2-images/page/5/?tab=comments#comment-2586042", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "hi, just picked up a used x2 over easter and took it to edinburgh zoo at the weekend for it's first workout. i'm delighted with the results. --img-- well -----> spotted !!!  by --img-- flamingos by --img-- posing penguins by --img-- you can see his stripes but you know he's clean by", "sortedWord": "None", "identifyer": 9037, "year": "2014"}, {"Unnamed: 0": 450357, "autor": "thighslapper", "date": 1403453820000, "content": "Sorry to hear about your problems...... There was along and at times acrimonious thread about this that ran for months ........ Some folk seem to have had persistent AF issues ...... but most have found no real difference between the XV and similar AF cameras .... with some problems in low light at high ISO's which can be avoided by careful focus point choice ...... I note that with a tripod you are stuck entirely with what the camera is pointing at ...... and if that has low vertical contrast the camera will have problems ..... The main Leica specific 'bug' appears to be the camera thinking and indicating it has focus .... when it hasn't ....... and most users have never had this happen which does make you wonder if it is camera specific ....... I've taken many hundreds if indoor shots .... often in very dim churches and almost all the shots are spot on ....... and when it was almost completely dark I just set the distance manually on the lens ...... with the modest maximum apertures and smaller sensor on the XV you have plenty of DOF .....", "link": "https://www.l-camera-forum.com/topic/229315-x-vario-af-unreliability/?tab=comments#comment-2615877", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sorry to hear about your problems...... there was along and at times acrimonious thread about this that ran for months ........ some folk seem to have had persistent af issues ...... but most have found no real difference between the xv and similar af cameras .... with some problems in low light at high iso's which can be avoided by careful focus point choice ...... i note that with a tripod you are stuck entirely with what the camera is pointing at ...... and if that has low vertical contrast the camera will have problems ..... the main leica specific 'bug' appears to be the camera thinking and indicating it has focus .... when it hasn't ....... and most users have never had this happen which does make you wonder if it is camera specific ....... i've taken many hundreds if indoor shots .... often in very dim churches and almost all the shots are -----> spot !!!  on ....... and when it was almost completely dark i just set the distance manually on the lens ...... with the modest maximum apertures and smaller sensor on the xv you have plenty of dof .....", "sortedWord": "None", "identifyer": 13850, "year": "2014"}, {"Unnamed: 0": 450369, "autor": "tom0511", "date": 1403785020000, "content": "My X-Vario focuses ok in most cases but sometimes it focuses on the background. I believe it could have to do with the size of real AF-point eventually being bigger? than the indicated area? Of course the AF is pretty slow. For example the EM1 is night and days better. If I hear abot your percentage of misfocused images I would say that there must be something wrong with your camera. Which AF-setting do you use? auto or single or spot?", "link": "https://www.l-camera-forum.com/topic/229315-x-vario-af-unreliability/?tab=comments#comment-2618338", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my x-vario focuses ok in most cases but sometimes it focuses on the background. i believe it could have to do with the size of real af-point eventually being bigger? than the indicated area? of course the af is pretty slow. for example the em1 is night and days better. if i hear abot your percentage of misfocused images i would say that there must be something wrong with your camera. which af-setting do you use? auto or single or -----> spot !!! ?", "sortedWord": "None", "identifyer": 13862, "year": "2014"}, {"Unnamed: 0": 450440, "autor": "thighslapper", "date": 1410380280000, "content": "Nice to see you are giving it a bit more of a go ........ even if you let it go eventually ..... The main problem is getting your head round the fact that it is neither a point and shoot that you can leave on 'auto everything' ....... nor a miniature zoom M9 ....... I too only ever use Centre-weighted or Spot metering...... set on -0.3 ev by default .... am prepared to override by dialling in more compensation or going to manual ..... and only ever download the DNG's to LR. A fair few images 'look' overexposed ...... but if you check the histograms they usually seem to be spot on and give the widest DR possible for the subject .... which is what you would want for the greatest leeway in processing ....... With any images that I don't initially like I press AUTO on the Tone panel ..... which results in a hideous image ...... and then roll back the exposure by about -1 on the slider .... and the results are instantly M9 like ......--img--  Nearly always works wonders. Mixed content images and particularly macro shots are nearly always perfect OOC. The XV has it's little quirks but I have found the DNG output excellent and easily up to M9 standard ..... and the images on the XV part of forum are of a uniformly higher standard than the M8/9/240/T counterparts ..... and I post on them all so I can't be accused of being biased ! Edited September 10, 2014 by thighslapper", "link": "https://www.l-camera-forum.com/topic/233557-why-im-returning-the-x-vario/?tab=comments#comment-2667544", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "nice to see you are giving it a bit more of a go ........ even if you let it go eventually ..... the main problem is getting your head round the fact that it is neither a point and shoot that you can leave on 'auto everything' ....... nor a miniature zoom m9 ....... i too only ever use centre-weighted or -----> spot !!!  metering...... set on -0.3 ev by default .... am prepared to override by dialling in more compensation or going to manual ..... and only ever download the dng's to lr. a fair few images 'look' overexposed ...... but if you check the histograms they usually seem to be spot on and give the widest dr possible for the subject .... which is what you would want for the greatest leeway in processing ....... with any images that i don't initially like i press auto on the tone panel ..... which results in a hideous image ...... and then roll back the exposure by about -1 on the slider .... and the results are instantly m9 like ......--img--  nearly always works wonders. mixed content images and particularly macro shots are nearly always perfect ooc. the xv has it's little quirks but i have found the dng output excellent and easily up to m9 standard ..... and the images on the xv part of forum are of a uniformly higher standard than the m8/9/240/t counterparts ..... and i post on them all so i can't be accused of being biased ! edited september 10, 2014 by thighslapper", "sortedWord": "None", "identifyer": 13933, "year": "2014"}, {"Unnamed: 0": 450718, "autor": "AndreasB", "date": 1416139800000, "content": "Hi all, this is heavily discussed in the German forum: …. Does not look good for our X113... -TK As i am from Germany, i´m not a native english speaker. But I try to do my best: I owned both X1 and X2 and I was very satisfied with the pictures. Now I own the X for a couple of days and don´t see any worse difference to X1/2. Only improvements in every case. That the full size sensor of RX1 is better than many other cameras is no secret. But if I look to the comparison and see that even the LX100 and LX7 look sharper or equal then I feel that there is something wrong with the X results. Its the same good old APSC Sensor and the lens have to be better at f5,6 than the zoom lenses of the LX100 and the LX7. So I had to ask myself some questions: Is dprwview independent, what the finance basic? Are requirements for tests the same? Could it be possible that pictures were interchanged? What were the basic presets of the cameras? Which autofocus preset was used (Spot or 11-field)? Is it a scientific like comparison and is it under a quality management? Was the X and firmware from latest production or from pilot production? Is it ok to take a standard Raw-development workflow for every camera? There are many possibilities to influence the results with that. It would be great to see in that comparison also ooc-jpeg and not jpeg from the Raw development. So you see that the results don´t have to be compareable. There are too many possibilities for mistakes. And think about the existing good reviews of Ming Thein and for picture quality also from Steve Huff. But won´t think about if the result is correct… Andreas www.bikedoll.de Edited November 16, 2014 by bikedoll", "link": "https://www.l-camera-forum.com/topic/237130-dpreview-studio-shot-comparison-x113/?tab=comments#comment-2707483", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi all, this is heavily discussed in the german forum: …. does not look good for our x113... -tk as i am from germany, i´m not a native english speaker. but i try to do my best: i owned both x1 and x2 and i was very satisfied with the pictures. now i own the x for a couple of days and don´t see any worse difference to x1/2. only improvements in every case. that the full size sensor of rx1 is better than many other cameras is no secret. but if i look to the comparison and see that even the lx100 and lx7 look sharper or equal then i feel that there is something wrong with the x results. its the same good old apsc sensor and the lens have to be better at f5,6 than the zoom lenses of the lx100 and the lx7. so i had to ask myself some questions: is dprwview independent, what the finance basic? are requirements for tests the same? could it be possible that pictures were interchanged? what were the basic presets of the cameras? which autofocus preset was used (-----> spot !!!  or 11-field)? is it a scientific like comparison and is it under a quality management? was the x and firmware from latest production or from pilot production? is it ok to take a standard raw-development workflow for every camera? there are many possibilities to influence the results with that. it would be great to see in that comparison also ooc-jpeg and not jpeg from the raw development. so you see that the results don´t have to be compareable. there are too many possibilities for mistakes. and think about the existing good reviews of ming thein and for picture quality also from steve huff. but won´t think about if the result is correct… andreas www.bikedoll.de edited november 16, 2014 by bikedoll", "sortedWord": "None", "identifyer": 14211, "year": "2014"}, {"Unnamed: 0": 450775, "autor": "Guest", "date": 1416580620000, "content": "Just spotted this thread, and happen to have bought a Leica C for Frau Capucho as her posh point 'n' shoot. Been occasionally using it for \"macro\" shots of wrist watches (my other obsession) and it's proven itself to be a remarkable little piece of technology. Your shot of the M2 (it is an M2 right?) is a great example of what that sweet little camera can do with its good glass even in front of a tiny sensor. Shall post some watch examples later, but meanwhile keep the faith. Ric", "link": "https://www.l-camera-forum.com/topic/237139-leica-c-images-post-them-here/?tab=comments#comment-2711386", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "just -----> spotted !!!  this thread, and happen to have bought a leica c for frau capucho as her posh point 'n' shoot. been occasionally using it for \"macro\" shots of wrist watches (my other obsession) and it's proven itself to be a remarkable little piece of technology. your shot of the m2 (it is an m2 right?) is a great example of what that sweet little camera can do with its good glass even in front of a tiny sensor. shall post some watch examples later, but meanwhile keep the faith. ric", "sortedWord": "None", "identifyer": 14268, "year": "2014"}], "name": "spotL-Forum2014"}