{"interestingcomments": [{"Unnamed: 0": 369503, "autor": "maddogdogdog", "date": 1332827040000, "content": "Thanks for the information, everyone. I decided to get many hands on adjusting it myself (to correct my M9's front focusing at close distances (around 7cm in front of the intended focus spot!)). However, when I try to get the screwdriver onto the screw that holds the cam, I find myself unable to loosen it. The problem is, as I try to turn the screw (anti clockwise), I can see that the screw is not moving while the things underneath it (I can see that there is a tiny piece of metal strip touching the \"joint\") moves as I try to loosen it. So in the end, I can see something turned but it is just not the screw. Am I doing it correctly? Should anything besides the screw move? Thanks!!!", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/8/?tab=comments#comment-1965327", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thanks for the information, everyone. i decided to get many hands on adjusting it myself (to correct my m9's front focusing at close distances (around 7cm in front of the intended focus -----> spot !!! !)). however, when i try to get the screwdriver onto the screw that holds the cam, i find myself unable to loosen it. the problem is, as i try to turn the screw (anti clockwise), i can see that the screw is not moving while the things underneath it (i can see that there is a tiny piece of metal strip touching the \"joint\") moves as i try to loosen it. so in the end, i can see something turned but it is just not the screw. am i doing it correctly? should anything besides the screw move? thanks!!!", "sortedWord": "None", "identifyer": 30800, "year": "2012"}, {"Unnamed: 0": 369506, "autor": "torre", "date": 1334997600000, "content": "I tried it with my heart beating a bit faster than ordinary but, yes, it works. It was a very frustrating process. Making the infinity focus correct was easy but then my lenses front focused badly, just like Julian said. After three hours of loosening and fastening the little screw (and rechecking infinity) everything actually worked. Infinity spot on and close focus perfect. I did the job with a 90 elmarit and 50 summicron. Figured the rangefinder was to blame since both lenses showed the same behaviour. Next time I guess it will be a pretty straightforward process. Thanks for all the inputs that gave me confidence to try it.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/8/?tab=comments#comment-1989587", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i tried it with my heart beating a bit faster than ordinary but, yes, it works. it was a very frustrating process. making the infinity focus correct was easy but then my lenses front focused badly, just like julian said. after three hours of loosening and fastening the little screw (and rechecking infinity) everything actually worked. infinity -----> spot !!!  on and close focus perfect. i did the job with a 90 elmarit and 50 summicron. figured the rangefinder was to blame since both lenses showed the same behaviour. next time i guess it will be a pretty straightforward process. thanks for all the inputs that gave me confidence to try it.", "sortedWord": "None", "identifyer": 30803, "year": "2012"}, {"Unnamed: 0": 369507, "autor": "bab", "date": 1336263660000, "content": "I tried it with my heart beating a bit faster than ordinary but, yes, it works. It was a very frustrating process. Making the infinity focus correct was easy but then my lenses front focused badly, just like Julian said. After three hours of loosening and fastening the little screw (and rechecking infinity) everything actually worked. Infinity spot on and close focus perfect. I did the job with a 90 elmarit and 50 summicron. Figured the rangefinder was to blame since both lenses showed the same behaviour. Next time I guess it will be a pretty straightforward process.Thanks for all the inputs that gave me confidence to try it. I'm glad you figured it out mines at the fix it shop in NJ and been there two weeks looks like the little screw you turned for three hours is taking them two weeks. As it is scheduled for a return flight back to me next week and of course it a brand new lens 50 lux that did not focus to infinity i\"m thinking of putting it on my M9 to check it. My was off at a 10ft range by atleast 6\"-8\" front focus. I tried you method on my M8 and the same three hours got it to work. FRUSTRATING!", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/8/?tab=comments#comment-2002198", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i tried it with my heart beating a bit faster than ordinary but, yes, it works. it was a very frustrating process. making the infinity focus correct was easy but then my lenses front focused badly, just like julian said. after three hours of loosening and fastening the little screw (and rechecking infinity) everything actually worked. infinity -----> spot !!!  on and close focus perfect. i did the job with a 90 elmarit and 50 summicron. figured the rangefinder was to blame since both lenses showed the same behaviour. next time i guess it will be a pretty straightforward process.thanks for all the inputs that gave me confidence to try it. i'm glad you figured it out mines at the fix it shop in nj and been there two weeks looks like the little screw you turned for three hours is taking them two weeks. as it is scheduled for a return flight back to me next week and of course it a brand new lens 50 lux that did not focus to infinity i\"m thinking of putting it on my m9 to check it. my was off at a 10ft range by atleast 6\"-8\" front focus. i tried you method on my m8 and the same three hours got it to work. frustrating!", "sortedWord": "None", "identifyer": 30804, "year": "2012"}, {"Unnamed: 0": 369519, "autor": "bocaburger", "date": 1344262500000, "content": "Get a dozen Leica lenses and try getting them all to work perfectly with an M9 ...... it is almost impossible and if you don't want to go mad you will have to make some practical compromises.... I should probably schedule a trip to Atlantic City or start playing the Lotto, because it would seem my luck is phenomenal --img--  I have, well let's just say more than a dozen, Leica and CV lenses and have only needed to have two of them adjusted, a 50/2 and 135/4 (the latter I had to mill down the optical housing myself because it came back from service as bad as it left). The rest are spot-on. These are all older pre-digital pre-ASPH lenses BTW. Honestly, given how long Leica takes to produce a small batch of lenses, how much they charge, and how vociferously they toot their own horn about quality, IMHO it's nothing short of disgusting that so many modern lenses need to be recalibrated. It would seem to me that any lens manufactured in at least the last 6 years should have been up to digital standards. Edited August 6, 2012 by bocaburger", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/9/?tab=comments#comment-2080726", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "get a dozen leica lenses and try getting them all to work perfectly with an m9 ...... it is almost impossible and if you don't want to go mad you will have to make some practical compromises.... i should probably schedule a trip to atlantic city or start playing the lotto, because it would seem my luck is phenomenal --img--  i have, well let's just say more than a dozen, leica and cv lenses and have only needed to have two of them adjusted, a 50/2 and 135/4 (the latter i had to mill down the optical housing myself because it came back from service as bad as it left). the rest are -----> spot !!! -on. these are all older pre-digital pre-asph lenses btw. honestly, given how long leica takes to produce a small batch of lenses, how much they charge, and how vociferously they toot their own horn about quality, imho it's nothing short of disgusting that so many modern lenses need to be recalibrated. it would seem to me that any lens manufactured in at least the last 6 years should have been up to digital standards. edited august 6, 2012 by bocaburger", "sortedWord": "None", "identifyer": 30816, "year": "2012"}, {"Unnamed: 0": 371498, "autor": "Jaybob", "date": 1351367340000, "content": "Sorry, but if it's that dark, I reach in the bag and use a D3 set on 3200, switching between the 50 and 85 1.4 or the 105 f2. That gets me to a wide open 125th or a 160th or a 200th with fixable noise later. There's a limit as to what's hypothetical and fun, and paid jobs providing usable frames to clients are neither. A 30th, to me, will yeild far too many \"not quites\". Just my opinion, the M9 is the wrong tool for that job, at least at the beginning. After getting what the check writers need written to the card on the D3, I would switch to the M9 and look for lulls in the movement (or exploit the movement) and finish the job as a photographer. Does the 75 1.4 come with this deal, cause I need one of those... ETTR specifies expose for highlights and don't blow them out. That's what I'd do regardless of camera or ISO. If anything in my histogram is hot, that's a faster shutter speed I can use. Then I'd find the lighting director and ask him what his qualifications were and expose him for the fraud he or she really is. That seems REALLY dark for spot lit (or even just LIT) performers. Edited October 27, 2012 by Jaybob", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/13/?tab=comments#comment-2152397", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sorry, but if it's that dark, i reach in the bag and use a d3 set on 3200, switching between the 50 and 85 1.4 or the 105 f2. that gets me to a wide open 125th or a 160th or a 200th with fixable noise later. there's a limit as to what's hypothetical and fun, and paid jobs providing usable frames to clients are neither. a 30th, to me, will yeild far too many \"not quites\". just my opinion, the m9 is the wrong tool for that job, at least at the beginning. after getting what the check writers need written to the card on the d3, i would switch to the m9 and look for lulls in the movement (or exploit the movement) and finish the job as a photographer. does the 75 1.4 come with this deal, cause i need one of those... ettr specifies expose for highlights and don't blow them out. that's what i'd do regardless of camera or iso. if anything in my histogram is hot, that's a faster shutter speed i can use. then i'd find the lighting director and ask him what his qualifications were and expose him for the fraud he or she really is. that seems really dark for -----> spot !!!  lit (or even just lit) performers. edited october 27, 2012 by jaybob", "sortedWord": "None", "identifyer": 32799, "year": "2012"}, {"Unnamed: 0": 377851, "autor": "ho_co", "date": 1330971720000, "content": "Bert--Very nicely done! A request: Consider trying the same thing with a wide-angle or ultra-wide as well, just as a comparison. In the M8 introduction, my class was told that the camera \"becomes more center-weighted average\" with longer focal lengths, and \"becomes more like a spot meter\" with shorter focal lengths. Just curious whether the M9 shares this tendency to any great degree. It's good to see someone with your technical accuracy taking on the meter pattern! --img--  Edited March 5, 2012 by ho_co", "link": "https://www.l-camera-forum.com/topic/174190-m9-metering-pattern/?tab=comments#comment-1945292", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "bert--very nicely done! a request: consider trying the same thing with a wide-angle or ultra-wide as well, just as a comparison. in the m8 introduction, my class was told that the camera \"becomes more center-weighted average\" with longer focal lengths, and \"becomes more like a -----> spot !!!  meter\" with shorter focal lengths. just curious whether the m9 shares this tendency to any great degree. it's good to see someone with your technical accuracy taking on the meter pattern! --img--  edited march 5, 2012 by ho_co", "sortedWord": "None", "identifyer": 39164, "year": "2012"}, {"Unnamed: 0": 377853, "autor": "Lindolfi", "date": 1330985640000, "content": "In the M8 introduction, my class was told that the camera \"becomes more center-weighted average\" with longer focal lengths, and \"becomes more like a spot meter\" with shorter focal lengths. Just curious whether the M9 shares this tendency to any great degree. That is not the case in the M9: I've tested a 21/2.8 at f/5.6 and it produced a similar result as with the 90/4 at f/8. So that's nice: you only have to visualize one area during measuring, independent of focal length. It is obvious that in absolute measurement angle, the longer focal length covers a smaller angle in the outside world than a wide angle lens. So if you want to use your M9 as a 5 degree spotmeter, mount a 135mm lens and nothing shorter. Edited March 5, 2012 by Lindolfi", "link": "https://www.l-camera-forum.com/topic/174190-m9-metering-pattern/?tab=comments#comment-1945490", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "in the m8 introduction, my class was told that the camera \"becomes more center-weighted average\" with longer focal lengths, and \"becomes more like a -----> spot !!!  meter\" with shorter focal lengths. just curious whether the m9 shares this tendency to any great degree. that is not the case in the m9: i've tested a 21/2.8 at f/5.6 and it produced a similar result as with the 90/4 at f/8. so that's nice: you only have to visualize one area during measuring, independent of focal length. it is obvious that in absolute measurement angle, the longer focal length covers a smaller angle in the outside world than a wide angle lens. so if you want to use your m9 as a 5 degree spotmeter, mount a 135mm lens and nothing shorter. edited march 5, 2012 by lindolfi", "sortedWord": "None", "identifyer": 39166, "year": "2012"}, {"Unnamed: 0": 377854, "autor": "ho_co", "date": 1331001360000, "content": "Sounds as if Stefan Daniel was right when he said the M9's metering pattern was similar to that of the M6! Sounds like a noticeable improvement from the M8 as well. The M8 introduction class specified that the spot effect was stronger with wide angles, and reduced with longer focal lengths: just the opposite of your description with the M9. (Speaking of metering pattern, not lens field of view.) Thanks for your graphic effort, Bert. --img--  Seems to me that a chart like yours would be helpful either in the M9 manual or in the M9 FAQ here on the forum. Edited March 6, 2012 by ho_co", "link": "https://www.l-camera-forum.com/topic/174190-m9-metering-pattern/?tab=comments#comment-1945605", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sounds as if stefan daniel was right when he said the m9's metering pattern was similar to that of the m6! sounds like a noticeable improvement from the m8 as well. the m8 introduction class specified that the -----> spot !!!  effect was stronger with wide angles, and reduced with longer focal lengths: just the opposite of your description with the m9. (speaking of metering pattern, not lens field of view.) thanks for your graphic effort, bert. --img--  seems to me that a chart like yours would be helpful either in the m9 manual or in the m9 faq here on the forum. edited march 6, 2012 by ho_co", "sortedWord": "None", "identifyer": 39167, "year": "2012"}, {"Unnamed: 0": 377857, "autor": "lars_bergquist", "date": 1331020500000, "content": "A request: Consider trying the same thing with a wide-angle or ultra-wide as well, just as a comparison. In the M8 introduction, my class was told that the camera \"becomes more center-weighted average\" with longer focal lengths, and \"becomes more like a spot meter\" with shorter focal lengths. Just curious whether the M9 shares this tendency to any great degree. People – even people who should know better – automatically think SLR though this is not applicable to any M camera. A M, like any well-regulated English household, has an Upstairs and a Downstairs, and only the most formal connections between them. And metering is done in the Servants' Quarters. In his Leica M Compendium, Handbook of the Leica M system (Hove, 1994) Jonathan Eastland, who surely knows better when he stops to think, declares (p. 130) that \"The diameter of the measuring field is equal to 2/3 of the short side of the bright-line frame in use. – This is a useful piece of information because in practice it means that the photographer can accurately measure very small areas of the object to be photographed using the preselector lever. – For example, when using wide-angle lenses, the measuring field of the meter appears larger. [ ... ] By flicking the preselector lever to bring up the 90mm bright-line frame, particular areas of the scene can be measured and interpolated.\" So the otherwise estimable Mr Eastland thinks that by changing the frames upstairs, he can change the metering angle downstairs, without changing lenses! Good try. And I do suspect that this kind of thinking lies behind the statement that metering angles are different relative to the picture angle with wide and long lenses. Mr Eastland I presume cut his teeth on SLR cameras with TTL metering (he mentions Nikon). Today's amateur photographers, and future pros, cut their teeth on cell phones, holding their humonguous DSLR cameras with long zooms in front of them on outstretched arms. I wonder what other strange behaviours this will lead to. Anyone who launches a DSLR that you can make phone calls from, has a winner. LB", "link": "https://www.l-camera-forum.com/topic/174190-m9-metering-pattern/?tab=comments#comment-1945690", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a request: consider trying the same thing with a wide-angle or ultra-wide as well, just as a comparison. in the m8 introduction, my class was told that the camera \"becomes more center-weighted average\" with longer focal lengths, and \"becomes more like a -----> spot !!!  meter\" with shorter focal lengths. just curious whether the m9 shares this tendency to any great degree. people – even people who should know better – automatically think slr though this is not applicable to any m camera. a m, like any well-regulated english household, has an upstairs and a downstairs, and only the most formal connections between them. and metering is done in the servants' quarters. in his leica m compendium, handbook of the leica m system (hove, 1994) jonathan eastland, who surely knows better when he stops to think, declares (p. 130) that \"the diameter of the measuring field is equal to 2/3 of the short side of the bright-line frame in use. – this is a useful piece of information because in practice it means that the photographer can accurately measure very small areas of the object to be photographed using the preselector lever. – for example, when using wide-angle lenses, the measuring field of the meter appears larger. [ ... ] by flicking the preselector lever to bring up the 90mm bright-line frame, particular areas of the scene can be measured and interpolated.\" so the otherwise estimable mr eastland thinks that by changing the frames upstairs, he can change the metering angle downstairs, without changing lenses! good try. and i do suspect that this kind of thinking lies behind the statement that metering angles are different relative to the picture angle with wide and long lenses. mr eastland i presume cut his teeth on slr cameras with ttl metering (he mentions nikon). today's amateur photographers, and future pros, cut their teeth on cell phones, holding their humonguous dslr cameras with long zooms in front of them on outstretched arms. i wonder what other strange behaviours this will lead to. anyone who launches a dslr that you can make phone calls from, has a winner. lb", "sortedWord": "None", "identifyer": 39170, "year": "2012"}, {"Unnamed: 0": 377860, "autor": "Pix_N", "date": 1331252340000, "content": "Correct me if i'm wrong, or if i missed something, but i think there is a misunderstanding of Eastland assertion. He says \"With a wide angle mounted\", typically a 35 mm, you can preview the most active metering area for this lens by flicking the lever to show the 90 mm frame. With any other lens, the metering area will vary in the same proportion : 2/3 of the height of the frame : so approximately for a 50 mm that would give an equivalent of a 135, and for a 28 something like a 50 mm frame. But without touching any lever it's easy to imagine a center active metering spot of the correct size in the wiewfinder according to the lens mounted. Anyhow you made a great job Indolfi", "link": "https://www.l-camera-forum.com/topic/174190-m9-metering-pattern/?tab=comments#comment-1948494", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "correct me if i'm wrong, or if i missed something, but i think there is a misunderstanding of eastland assertion. he says \"with a wide angle mounted\", typically a 35 mm, you can preview the most active metering area for this lens by flicking the lever to show the 90 mm frame. with any other lens, the metering area will vary in the same proportion : 2/3 of the height of the frame : so approximately for a 50 mm that would give an equivalent of a 135, and for a 28 something like a 50 mm frame. but without touching any lever it's easy to imagine a center active metering -----> spot !!!  of the correct size in the wiewfinder according to the lens mounted. anyhow you made a great job indolfi", "sortedWord": "None", "identifyer": 39173, "year": "2012"}, {"Unnamed: 0": 377861, "autor": "jaapv", "date": 1331253000000, "content": "Correct me if i'm wrong, or if i missed something, but i think there is a misunderstanding of Eastland assertion.He says \"With a wide angle mounted\", typically a 35 mm, you can preview the most active metering area for this lens by flicking the lever to show the 90 mm frame. With any other lens, the metering area will vary in the same proportion : 2/3 of the height of the frame : so approximately for a 50 mm that would give an equivalent of a 135, and for a 28 something like a 50 mm frame. But without touching any lever it's easy to imagine a center active metering spot of the correct size in the wiewfinder according to the lens mounted. Anyhow you made a great job Indolfi See post #9", "link": "https://www.l-camera-forum.com/topic/174190-m9-metering-pattern/?tab=comments#comment-1948498", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "correct me if i'm wrong, or if i missed something, but i think there is a misunderstanding of eastland assertion.he says \"with a wide angle mounted\", typically a 35 mm, you can preview the most active metering area for this lens by flicking the lever to show the 90 mm frame. with any other lens, the metering area will vary in the same proportion : 2/3 of the height of the frame : so approximately for a 50 mm that would give an equivalent of a 135, and for a 28 something like a 50 mm frame. but without touching any lever it's easy to imagine a center active metering -----> spot !!!  of the correct size in the wiewfinder according to the lens mounted. anyhow you made a great job indolfi see post #9", "sortedWord": "None", "identifyer": 39174, "year": "2012"}, {"Unnamed: 0": 385080, "autor": "jaques", "date": 1346254320000, "content": "Firstly thankyou Mr Daniels for responding to this issue. I would like to add one point if I may: even if the LCD's were in stock for the next decade: the current cost of having them replaced is almost nonviable. As a resident of the Oceania I feel our access to Leica service is less certain than in Europe and the USA, and that the cost of service including transportation can be very high. I would take this opportunity to note that I personally would feel more secure about future Leica purchases if I felt assured that the service I would get in the case of failure or damage would be Worlds Best. For me this definitely includes cost effectiveness of repair. Replacing a simple part like an LCD screen should not cost $800 Euro. If cameras are not repaired because the cost of repair is unjustifiable given the (low) market value of the camera: this situation itself puts further downward pressure on the product value. If lower service/repair charges require a new repair facility in the Asia region I would be very happy to hear that. Why not open one in Australia? --img--  For me the Leica advertising concerning reliability and long product life was an important factor in making my M9 purchases. Even with service support over the next decade- it seems that within a few years after release- the cost of repairing damage to these cameras at current pricing would outweigh the commercial viability of repairing them. I believe there may be many other Leica M digital owners like myself, for whom the camera purchase was a very significant financial decision. If repairs are unavailable or un-economical such Leica owners may be priced out of the brand. Such buyers may not have factored and may not be able to afford the ongoing running costs of owning Leica gear... I fear I may be one of them. here is a scenario: I am student I own an M8 which I saved hard for. I have had it 3 months... My first Leica! I am in love. My dog knocks it off a table! The 1965 Summicron is undamaged- just another nick on the chrome BUT the LCD is smashed. I only have 1000 dollars to spare currently: a) I contact Leica for a repair. It cannot be repaired. I am offered a new m9 for $3500. This is impossible for me. Rent must be paid after all.. I sell the broken m8 my Leica lens- and buy a Fuji . --img--  I contact Leica and they offer to repair the camera for $800 Euro (and my local authorised service agent adds another $300 AUD onto that amount). Faced with an 1100 + Euro repair quote I sadly but rationally decide to sell the camera and lens and Buy a Nikon. c) I contact Leica and they offer to repair the LCD for 300 USD (total cost) with a warranty on the LCD- or $550 with a full CLA and 12 month limited warranty for the camera. I am overjoyed and lock the dog outside from now on. Years later I buy an M12... and give the still working trusty, true 'enduring in value' Leica M8 to my daughter. Her first Leica! I know in this scenario replacement of the LCD is seemingly impossible... Call it a 2009 M9 in 2014 if needs be... In scenarios a, and b, my experience in owning Leica has been akin to that expensive and painful lesson of \"buying a Lemon\" car. Whatever the market demographic all Leica users will respond very warmly to enhanced service and affordable repairs. Nothing can buy goodwill like a good experience getting a broken product fixed- and this can be magnified tenfold if the price of the repair is actually lower than feared.... People generally have amazing goodwill dealing with product failures if they are sorted out efficiently and as painlessly as possible... Conversely even a one really bad service experiences can ruin a lifetime of support for a brand. In the case of Leica I think I could go as far as saying that their are people who would almost die for the company- that is how strong their attachment is. They would defend Solms with pitchforks if necessary: such is the love of the historical Brand and all its wonderful history. It would be a shame if the legend of 'Leica Service' were to become just that: a legend... My local camera repairman trained and worked at Leica in the microscope department. Years before that and as a child he vividly remembers visiting Solms in the late 1950's with his father. They were treated to a tour of the factory and his fathers M3 was serviced on the spot: for free of course. Some 50 years later he relates the story to me: almost with a tear in his eye, as he cleaned my M9 CMOS sensor- and vintage 50 summilux with the inestimable aid of his Leitz Stereo-Microscope... The 'Leica' magic has not worn off yet... thankyou for you time- Edited August 29, 2012 by jaques", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/3/?tab=comments#comment-2099162", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "firstly thankyou mr daniels for responding to this issue. i would like to add one point if i may: even if the lcd's were in stock for the next decade: the current cost of having them replaced is almost nonviable. as a resident of the oceania i feel our access to leica service is less certain than in europe and the usa, and that the cost of service including transportation can be very high. i would take this opportunity to note that i personally would feel more secure about future leica purchases if i felt assured that the service i would get in the case of failure or damage would be worlds best. for me this definitely includes cost effectiveness of repair. replacing a simple part like an lcd screen should not cost $800 euro. if cameras are not repaired because the cost of repair is unjustifiable given the (low) market value of the camera: this situation itself puts further downward pressure on the product value. if lower service/repair charges require a new repair facility in the asia region i would be very happy to hear that. why not open one in australia? --img--  for me the leica advertising concerning reliability and long product life was an important factor in making my m9 purchases. even with service support over the next decade- it seems that within a few years after release- the cost of repairing damage to these cameras at current pricing would outweigh the commercial viability of repairing them. i believe there may be many other leica m digital owners like myself, for whom the camera purchase was a very significant financial decision. if repairs are unavailable or un-economical such leica owners may be priced out of the brand. such buyers may not have factored and may not be able to afford the ongoing running costs of owning leica gear... i fear i may be one of them. here is a scenario: i am student i own an m8 which i saved hard for. i have had it 3 months... my first leica! i am in love. my dog knocks it off a table! the 1965 summicron is undamaged- just another nick on the chrome but the lcd is smashed. i only have 1000 dollars to spare currently: a) i contact leica for a repair. it cannot be repaired. i am offered a new m9 for $3500. this is impossible for me. rent must be paid after all.. i sell the broken m8 my leica lens- and buy a fuji . --img--  i contact leica and they offer to repair the camera for $800 euro (and my local authorised service agent adds another $300 aud onto that amount). faced with an 1100 + euro repair quote i sadly but rationally decide to sell the camera and lens and buy a nikon. c) i contact leica and they offer to repair the lcd for 300 usd (total cost) with a warranty on the lcd- or $550 with a full cla and 12 month limited warranty for the camera. i am overjoyed and lock the dog outside from now on. years later i buy an m12... and give the still working trusty, true 'enduring in value' leica m8 to my daughter. her first leica! i know in this scenario replacement of the lcd is seemingly impossible... call it a 2009 m9 in 2014 if needs be... in scenarios a, and b, my experience in owning leica has been akin to that expensive and painful lesson of \"buying a lemon\" car. whatever the market demographic all leica users will respond very warmly to enhanced service and affordable repairs. nothing can buy goodwill like a good experience getting a broken product fixed- and this can be magnified tenfold if the price of the repair is actually lower than feared.... people generally have amazing goodwill dealing with product failures if they are sorted out efficiently and as painlessly as possible... conversely even a one really bad service experiences can ruin a lifetime of support for a brand. in the case of leica i think i could go as far as saying that their are people who would almost die for the company- that is how strong their attachment is. they would defend solms with pitchforks if necessary: such is the love of the historical brand and all its wonderful history. it would be a shame if the legend of 'leica service' were to become just that: a legend... my local camera repairman trained and worked at leica in the microscope department. years before that and as a child he vividly remembers visiting solms in the late 1950's with his father. they were treated to a tour of the factory and his fathers m3 was serviced on the -----> spot !!! : for free of course. some 50 years later he relates the story to me: almost with a tear in his eye, as he cleaned my m9 cmos sensor- and vintage 50 summilux with the inestimable aid of his leitz stereo-microscope... the 'leica' magic has not worn off yet... thankyou for you time- edited august 29, 2012 by jaques", "sortedWord": "None", "identifyer": 46484, "year": "2012"}, {"Unnamed: 0": 385179, "autor": "marknorton", "date": 1346567400000, "content": "To be clear, if you have the sapphire glass, it's the same old LCD, they are separate components. My cameras are all early M8s, two upgraded to M8U and these are working fine. As I understand it, there was a bad batch of LCDs - and Pete my testing suggestion would not have spotted a problem due to water and dust ingress, I have to admit - which made it into cameras and the spare parts stock and by the time this was discovered, it was too late, the display was out of production.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/8/?tab=comments#comment-2102593", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "to be clear, if you have the sapphire glass, it's the same old lcd, they are separate components. my cameras are all early m8s, two upgraded to m8u and these are working fine. as i understand it, there was a bad batch of lcds - and pete my testing suggestion would not have -----> spotted !!!  a problem due to water and dust ingress, i have to admit - which made it into cameras and the spare parts stock and by the time this was discovered, it was too late, the display was out of production.", "sortedWord": "None", "identifyer": 46583, "year": "2012"}, {"Unnamed: 0": 385220, "autor": "marknorton", "date": 1346882280000, "content": "If we accept that the supply of new LCDs has indeed dried up, the obvious source of supply for replacement screens is, as suggested, the existing pool of M8 cameras. I agree that Leica should buy up secondhand M8s as a source of parts. M8 owners in need of service will get used parts in their cameras warranted for, say, 3 months, but would pay proportionately less, or nothing. M8 cameras will continue to be serviceable, M8 prices will be supported and Leica's reputation will be intact even if somewhat tarnished. Instead of which, they are trying to force users to upgrade at prices which are still higher than production costs so the cost to Leica is negligible. The real cost is borne by the retailers who forego profit they might otherwise have made by selling an M9 to an upgrading M8 user. Overall, I think M8 users have every right to feel short-changed by Leica who have betrayed - again - the trust placed on them by their customers. It's also right for Leica to be put on the spot and made to commit to spare parts availability for an acceptable period.", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/10/?tab=comments#comment-2106088", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "if we accept that the supply of new lcds has indeed dried up, the obvious source of supply for replacement screens is, as suggested, the existing pool of m8 cameras. i agree that leica should buy up secondhand m8s as a source of parts. m8 owners in need of service will get used parts in their cameras warranted for, say, 3 months, but would pay proportionately less, or nothing. m8 cameras will continue to be serviceable, m8 prices will be supported and leica's reputation will be intact even if somewhat tarnished. instead of which, they are trying to force users to upgrade at prices which are still higher than production costs so the cost to leica is negligible. the real cost is borne by the retailers who forego profit they might otherwise have made by selling an m9 to an upgrading m8 user. overall, i think m8 users have every right to feel short-changed by leica who have betrayed - again - the trust placed on them by their customers. it's also right for leica to be put on the -----> spot !!!  and made to commit to spare parts availability for an acceptable period.", "sortedWord": "None", "identifyer": 46624, "year": "2012"}, {"Unnamed: 0": 385226, "autor": "Peter H", "date": 1346931360000, "content": "....................It's also right for Leica to be put on the spot and made to commit to spare parts availability for an acceptable period. Presumably the only way they can guarantee the availability of parts that they don't manufacture themselves is to buy two (at least) of everything at the time each camera is made. Because obviously no one can guarantee the survival of any supplier. Would the resultant cost/price increase in the cameras be acceptable, or would the whole idea be too uncommercial to work?", "link": "https://www.l-camera-forum.com/topic/186718-serviceability-m8-m82-displays/page/10/?tab=comments#comment-2106410", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "....................it's also right for leica to be put on the -----> spot !!!  and made to commit to spare parts availability for an acceptable period. presumably the only way they can guarantee the availability of parts that they don't manufacture themselves is to buy two (at least) of everything at the time each camera is made. because obviously no one can guarantee the survival of any supplier. would the resultant cost/price increase in the cameras be acceptable, or would the whole idea be too uncommercial to work?", "sortedWord": "None", "identifyer": 46630, "year": "2012"}, {"Unnamed: 0": 394678, "autor": "COOP666", "date": 1346891340000, "content": "A few more, same lens. My 35mm seems to be the one I use the most - it's the sweet spot, not too wide, not too long. Leica M9, f2/35mm Summicron lens, 2nd version. --img-- L1000462.jpg by COOP666, on Flickr --img-- L1000058.jpg by COOP666, on Flickr --img-- L1000243.jpg by COOP666, on Flickr --img-- L1000214.JPG by COOP666, on Flickr", "link": "https://www.l-camera-forum.com/topic/268173-the-view-through-older-glass/page/3/?tab=comments#comment-2106139", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a few more, same lens. my 35mm seems to be the one i use the most - it's the sweet -----> spot !!! , not too wide, not too long. leica m9, f2/35mm summicron lens, 2nd version. --img-- l1000462.jpg by coop666, on flickr --img-- l1000058.jpg by coop666, on flickr --img-- l1000243.jpg by coop666, on flickr --img-- l1000214.jpg by coop666, on flickr", "sortedWord": "None", "identifyer": 7145, "year": "2012"}, {"Unnamed: 0": 406996, "autor": "farnz", "date": 1351595100000, "content": "Ahh....... Haworth .....vey nice. Well spotted, Des.--img--  Pete.", "link": "https://www.l-camera-forum.com/topic/190811-the-king-of-bokeh-killed-by-its-father/page/2/?tab=comments#comment-2154324", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "ahh....... haworth .....vey nice. well -----> spotted !!! , des.--img--  pete.", "sortedWord": "None", "identifyer": 19782, "year": "2012"}, {"Unnamed: 0": 412487, "autor": "IkarusJohn", "date": 1330032960000, "content": "Sorry to prolong this, but I have a question for Olaf. In the third of the links you provided, there is a series of pictures of some poppies taken against a black screen, with light coming through the window diagonally from the left. The window is not in the frame, but the glare is causing flare. Am I right that the flare complained of is the pale spot which appears in the middle of the background? Also, there seems to be little or no flare at f/2, and the pale spot increases in size and density as the lens is stopped down through F/4, 8 & 16? Does flare get worse as you stop down? I take it such a set up would not produce flare with the Summilux. Cheers John", "link": "https://www.l-camera-forum.com/topic/173284-75-summilux/page/2/?tab=comments#comment-1935623", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "sorry to prolong this, but i have a question for olaf. in the third of the links you provided, there is a series of pictures of some poppies taken against a black screen, with light coming through the window diagonally from the left. the window is not in the frame, but the glare is causing flare. am i right that the flare complained of is the pale -----> spot !!!  which appears in the middle of the background? also, there seems to be little or no flare at f/2, and the pale spot increases in size and density as the lens is stopped down through f/4, 8 & 16? does flare get worse as you stop down? i take it such a set up would not produce flare with the summilux. cheers john", "sortedWord": "None", "identifyer": 25337, "year": "2012"}, {"Unnamed: 0": 412488, "autor": "01af", "date": 1330034520000, "content": "Am I right that the flare complained of is the pale spot which appears in the middle of the background? Yes, you are. Also, there seems to be little or no flare at f/2, and the pale spot increases in size and density as the lens is stopped down through f/4, f/8 & f/16? Yes, that's right. This particular central spot will appear at close range only, the limit below which it appears is longer at smaller apertures, and it's more pronounced at smaller apertures. Does flare get worse as you stop down? Yes, it does.", "link": "https://www.l-camera-forum.com/topic/173284-75-summilux/page/2/?tab=comments#comment-1935661", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "am i right that the flare complained of is the pale -----> spot !!!  which appears in the middle of the background? yes, you are. also, there seems to be little or no flare at f/2, and the pale spot increases in size and density as the lens is stopped down through f/4, f/8 & f/16? yes, that's right. this particular central spot will appear at close range only, the limit below which it appears is longer at smaller apertures, and it's more pronounced at smaller apertures. does flare get worse as you stop down? yes, it does.", "sortedWord": "None", "identifyer": 25338, "year": "2012"}, {"Unnamed: 0": 445570, "autor": "threeputt", "date": 1346646000000, "content": "Straight out of camera JPGs, first weekend to really get a chance to shoot it. Lake Jackson on the FL/AL state line. All standard settings except the last and it's high contrast B&W. The spot on the first photo is not a sensor problem, it's just a mosquito that was apparently tired of feeding on me! First time uploading photos on this forum, I hope they look alright and are within the resolution restraints. @spylaw4 - I tried to figure out spacing the photos, but in the preview they are simply links and are listed in a separate area from my text and I cannot get a cursor there so I can add a space. Thanks for looking! Jeff --img-- --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/181346-leica-x2-images/page/2/?tab=comments#comment-2103368", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "straight out of camera jpgs, first weekend to really get a chance to shoot it. lake jackson on the fl/al state line. all standard settings except the last and it's high contrast b&w. the -----> spot !!!  on the first photo is not a sensor problem, it's just a mosquito that was apparently tired of feeding on me! first time uploading photos on this forum, i hope they look alright and are within the resolution restraints. @spylaw4 - i tried to figure out spacing the photos, but in the preview they are simply links and are listed in a separate area from my text and i cannot get a cursor there so i can add a space. thanks for looking! jeff --img-- --img-- --img-- --img-- ", "sortedWord": "None", "identifyer": 8977, "year": "2012"}], "name": "spotL-Forum2012"}