{"interestingcomments": [{"Unnamed: 0": 383512, "autor": "haroldp", "date": 1214415360000, "content": "A 28-35-50 Tri Elmar would be ideal, as you would not have to change lenses and could cover tables, formaal, and most candid opportunities. The max f4 is not an issue if you use flash, and for most formals, tables, or candids you want siome depth of field. A second body is a must even for the most reliable equipment, which M8 is not, ( I have had no problems with mine, but would never be on a paid assignment with less than total redundancy no matter what I was using). Mounting a 75 or 90 as long as you had the second body could not hurt, a 90 summicron would enable some available light candids. The best ( and only ) integrated flash that is usable ( for minimum power ) is the Metz 54-4. To use it in TTL, the following is needed. Firmware 1201 - otherwise both white bal. and sync reliability are spotty. IR filters - otherwise exposure is usually wrong. Use flash in GNC mode, it then is a pre-flash ttl like nikon or canon. only nimh batteries, or preferably one of metz battery packs for recycle speed. a larger metz flash is even better but looks silly on an m8 the need for powerful flash is to overload the horrific white balance of typical wedding halls which often mix tungsten and flourescent in multiple spots and will look often unprofessional no matter what you do in post-processing. In short, use the same techique that you would use with any equipment. I hope this is useful ... Harold", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/?tab=comments#comment-589746", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "a 28-35-50 tri elmar would be ideal, as you would not have to change lenses and could cover tables, formaal, and most candid opportunities. the max f4 is not an issue if you use flash, and for most formals, tables, or candids you want siome depth of field. a second body is a must even for the most reliable equipment, which m8 is not, ( i have had no problems with mine, but would never be on a paid assignment with less than total redundancy no matter what i was using). mounting a 75 or 90 as long as you had the second body could not hurt, a 90 summicron would enable some available light candids. the best ( and only ) integrated flash that is usable ( for minimum power ) is the metz 54-4. to use it in ttl, the following is needed. firmware 1201 - otherwise both white bal. and sync reliability are spotty. ir filters - otherwise exposure is usually wrong. use flash in gnc mode, it then is a pre-flash ttl like nikon or canon. only nimh batteries, or preferably one of metz battery packs for recycle speed. a larger metz flash is even better but looks silly on an m8 the need for powerful flash is to overload the horrific white balance of typical wedding halls which often mix tungsten and flourescent in multiple -----> spots !!!  and will look often unprofessional no matter what you do in post-processing. in short, use the same techique that you would use with any equipment. i hope this is useful ... harold", "sortedWord": "None", "identifyer": 44912, "year": "2008"}, {"Unnamed: 0": 383662, "autor": "Rolo", "date": 1215678540000, "content": "And if you'll forgive me, on this digital thread, here's another from the same day, Fuji 400. The tonality is quite different from what I capture digitally today. Am I making sense here? I can bend a digital file as good as the next man, but this is untouched and all the pics from the sequence are perfect matches - very little post work needed. It was here that I learned to hand hold an M for 1/15 sec whilst holding breath and praying atthe same time.--img--  I shot a wedding in the same church a month ago with a DSLR and probably from the very same spot and probably at an iso that spoiled the image. Must compare the files. Rolo as dear friend Jamie said : With the M bodies, when you nail the focus the focus is indeed nailed --img-- ", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/8/?tab=comments#comment-600812", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "and if you'll forgive me, on this digital thread, here's another from the same day, fuji 400. the tonality is quite different from what i capture digitally today. am i making sense here? i can bend a digital file as good as the next man, but this is untouched and all the pics from the sequence are perfect matches - very little post work needed. it was here that i learned to hand hold an m for 1/15 sec whilst holding breath and praying atthe same time.--img--  i shot a wedding in the same church a month ago with a dslr and probably from the very same -----> spot !!!  and probably at an iso that spoiled the image. must compare the files. rolo as dear friend jamie said : with the m bodies, when you nail the focus the focus is indeed nailed --img-- ", "sortedWord": "None", "identifyer": 45063, "year": "2008"}, {"Unnamed: 0": 383667, "autor": "Vieri", "date": 1215704160000, "content": "Thanks, will not be shown in the Hall of Fame, but one that always brings a smile. Had to scramble on hands and knees to dig the negs out to take a look. It was shot on Fuji Superia 400 and actually on a Leica M3 and probably a 50mm Summicron. In a way I'm glad you asked because I have a discarded sample album that I come across from time to time and the tonality of the bride's preparation shots always stop me and I think WOW, wonder what film I used for that. Here's a sample and on screen it looks nowhere near as good as in print; in fact I'd be disappointed with a screen view today, but the prints !!* The film I'm referring to is Fuji Superia 800. Because I only had one camera body, plus a Mam 7 backup, I changed over after the first film to Superia 400. Ended up with Superia because it was my first wedding (of my 'Professional career'), was unpaid and I was invited to shoot only 5 hours before the ceremony. Next day, I bought a Nikon D70 which made life so much easier, but the end result was not as good. Sorry about the bio --img--  .... here's the 800 iso scan. Rolo And if you'll forgive me, on this digital thread, here's another from the same day, Fuji 400. The tonality is quite different from what I capture digitally today. Am I making sense here? I can bend a digital file as good as the next man, but this is untouched and all the pics from the sequence are perfect matches - very little post work needed. It was here that I learned to hand hold an M for 1/15 sec whilst holding breath and praying atthe same time.--img--  I shot a wedding in the same church a month ago with a DSLR and probably from the very same spot and probably at an iso that spoiled the image. Must compare the files. Rolo as dear friend Jamie said : With the M bodies, when you nail the focus the focus is indeed nailed Rolo, thank you very much for the information and for the bio which I enjoyed reading very much. I do agree with your points re: film vs digital and post, once you nailed it on film there isn't much you gotta do in PP; digital is a different beast altogether, more convenient most times when you are in a hurry and when you got your workflow down, but still film's character is IMHO unmatched in the end. This, of course, doesn't mean I don't use digital for my pro work, I do and love the time saving & convenience especially for color work; for my personal stuff is all film, and for BW digital doesn't come close - still, of course, IMHO. --img-- ", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/9/?tab=comments#comment-601119", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thanks, will not be shown in the hall of fame, but one that always brings a smile. had to scramble on hands and knees to dig the negs out to take a look. it was shot on fuji superia 400 and actually on a leica m3 and probably a 50mm summicron. in a way i'm glad you asked because i have a discarded sample album that i come across from time to time and the tonality of the bride's preparation shots always stop me and i think wow, wonder what film i used for that. here's a sample and on screen it looks nowhere near as good as in print; in fact i'd be disappointed with a screen view today, but the prints !!* the film i'm referring to is fuji superia 800. because i only had one camera body, plus a mam 7 backup, i changed over after the first film to superia 400. ended up with superia because it was my first wedding (of my 'professional career'), was unpaid and i was invited to shoot only 5 hours before the ceremony. next day, i bought a nikon d70 which made life so much easier, but the end result was not as good. sorry about the bio --img--  .... here's the 800 iso scan. rolo and if you'll forgive me, on this digital thread, here's another from the same day, fuji 400. the tonality is quite different from what i capture digitally today. am i making sense here? i can bend a digital file as good as the next man, but this is untouched and all the pics from the sequence are perfect matches - very little post work needed. it was here that i learned to hand hold an m for 1/15 sec whilst holding breath and praying atthe same time.--img--  i shot a wedding in the same church a month ago with a dslr and probably from the very same -----> spot !!!  and probably at an iso that spoiled the image. must compare the files. rolo as dear friend jamie said : with the m bodies, when you nail the focus the focus is indeed nailed rolo, thank you very much for the information and for the bio which i enjoyed reading very much. i do agree with your points re: film vs digital and post, once you nailed it on film there isn't much you gotta do in pp; digital is a different beast altogether, more convenient most times when you are in a hurry and when you got your workflow down, but still film's character is imho unmatched in the end. this, of course, doesn't mean i don't use digital for my pro work, i do and love the time saving & convenience especially for color work; for my personal stuff is all film, and for bw digital doesn't come close - still, of course, imho. --img-- ", "sortedWord": "None", "identifyer": 45068, "year": "2008"}, {"Unnamed: 0": 383668, "autor": "Rolo", "date": 1215708240000, "content": "This might interest someone. --img--  ) Two weddings same spot. Digital - 24-70L @ 28mm, wide open @ f2.8, iso 1250, 1/50s, -0.33 stops, ambient light. Leica MP, 35mm Lux Asph, Superia, iso 400, 1/30s (?), ambient light. Very little processing of either. On screen the digital image wins technically, but what about the aesthetics? No prize for guessing which is which. Can anybody post similar with the M8 + film or DSLR for interest? Rolo --img-- ", "link": "https://www.l-camera-forum.com/topic/56314-m8-pro-wedding-photography/page/9/?tab=comments#comment-601184", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "this might interest someone. --img--  ) two weddings same -----> spot !!! . digital - 24-70l @ 28mm, wide open @ f2.8, iso 1250, 1/50s, -0.33 stops, ambient light. leica mp, 35mm lux asph, superia, iso 400, 1/30s (?), ambient light. very little processing of either. on screen the digital image wins technically, but what about the aesthetics? no prize for guessing which is which. can anybody post similar with the m8 + film or dslr for interest? rolo --img-- ", "sortedWord": "None", "identifyer": 45069, "year": "2008"}, {"Unnamed: 0": 384181, "autor": "chris_tribble", "date": 1209056100000, "content": "Mark - sounds spot on. Let's hope the engineers are reading! Thanks again...", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/16/?tab=comments#comment-544495", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "mark - sounds -----> spot !!!  on. let's hope the engineers are reading! thanks again...", "sortedWord": "None", "identifyer": 45583, "year": "2008"}, {"Unnamed: 0": 408257, "autor": "Bilco10", "date": 1220296980000, "content": " Summilux 35/1.4 pre-aspherical - makes me smile every time I use it! That lens might not be cutting edge, but there's just something about it...! --img--  Spot-on. When I carry one lens, this is it.", "link": "https://www.l-camera-forum.com/topic/55623-which-are-your-most-exciting-m-lenses/page/7/?tab=comments#comment-642010", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " summilux 35/1.4 pre-aspherical - makes me smile every time i use it! that lens might not be cutting edge, but there's just something about it...! --img--  -----> spot !!! -on. when i carry one lens, this is it.", "sortedWord": "None", "identifyer": 21050, "year": "2008"}, {"Unnamed: 0": 408268, "autor": "stunsworth", "date": 1221686640000, "content": "Leica can't exchange the mount for a coded one because this late 35mm pre-asph Summilux has the helical thread cut right into the one-piece block of brass that the mount is machined into. Beautiful and unique lens, but I prefer not to deal with uncoded lenses. My experience has been that coding has no, or very marginal effect on this lens - or to put it another way, I can't see any difference between the lens coded or uncoded. I coded my lens manually, but the marks wore off very quickly. For the last 6 months or more I haven't bothered to code it and the images look fine. Of course you lose the focal length from the Exif information, but since this is my only uncoded lens it's easy to spot which shots were taken with it as the focal length is blank.", "link": "https://www.l-camera-forum.com/topic/55623-which-are-your-most-exciting-m-lenses/page/7/?tab=comments#comment-656819", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "leica can't exchange the mount for a coded one because this late 35mm pre-asph summilux has the helical thread cut right into the one-piece block of brass that the mount is machined into. beautiful and unique lens, but i prefer not to deal with uncoded lenses. my experience has been that coding has no, or very marginal effect on this lens - or to put it another way, i can't see any difference between the lens coded or uncoded. i coded my lens manually, but the marks wore off very quickly. for the last 6 months or more i haven't bothered to code it and the images look fine. of course you lose the focal length from the exif information, but since this is my only uncoded lens it's easy to -----> spot !!!  which shots were taken with it as the focal length is blank.", "sortedWord": "None", "identifyer": 21061, "year": "2008"}, {"Unnamed: 0": 408269, "autor": "nzav", "date": 1222090920000, "content": "My experience has been that coding has no, or very marginal effect on this lens - or to put it another way, I can't see any difference between the lens coded or uncoded. I coded my lens manually, but the marks wore off very quickly. For the last 6 months or more I haven't bothered to code it and the images look fine. Of course you lose the focal length from the Exif information, but since this is my only uncoded lens it's easy to spot which shots were taken with it as the focal length is blank. Steve, Thanks for the input. I have absolutely no qualms about the image quality of this Summilux; as many have found, it is unique and not found in any of the versions that followed it. If shooting were my hobby there would be less need for the coding, but jumping through the extra color correction hoops is not something I need for my workflow. There is no doubt that I can equal the color quality of current 35mm Summiluxes, but photography is my business, and every minute I spend doing something I should not have to do is not a good thing. I rely heavily on my EXIF metadata in several applications and the lens focal length omission is a nuisance. I realize for others this may not matter as much as it does in my case, but it is a feature I rely on professionally with all of my digital cameras.", "link": "https://www.l-camera-forum.com/topic/55623-which-are-your-most-exciting-m-lenses/page/7/?tab=comments#comment-661717", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my experience has been that coding has no, or very marginal effect on this lens - or to put it another way, i can't see any difference between the lens coded or uncoded. i coded my lens manually, but the marks wore off very quickly. for the last 6 months or more i haven't bothered to code it and the images look fine. of course you lose the focal length from the exif information, but since this is my only uncoded lens it's easy to -----> spot !!!  which shots were taken with it as the focal length is blank. steve, thanks for the input. i have absolutely no qualms about the image quality of this summilux; as many have found, it is unique and not found in any of the versions that followed it. if shooting were my hobby there would be less need for the coding, but jumping through the extra color correction hoops is not something i need for my workflow. there is no doubt that i can equal the color quality of current 35mm summiluxes, but photography is my business, and every minute i spend doing something i should not have to do is not a good thing. i rely heavily on my exif metadata in several applications and the lens focal length omission is a nuisance. i realize for others this may not matter as much as it does in my case, but it is a feature i rely on professionally with all of my digital cameras.", "sortedWord": "None", "identifyer": 21062, "year": "2008"}, {"Unnamed: 0": 451946, "autor": "Overgaard", "date": 1226911560000, "content": "Bernd, That's a nice shot and perspective. I find that ISO-noise is only a problem if there's too little light. As the sensor is native 100 ISO that's what it can see. With less light, the higher ISO-settings has to figure out what's in the dark spots, hence the noise. I've done lots of 200 ISO shots (often by error ;-) in daylight that looks great.", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/14/?tab=comments#comment-718398", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "bernd, that's a nice shot and perspective. i find that iso-noise is only a problem if there's too little light. as the sensor is native 100 iso that's what it can see. with less light, the higher iso-settings has to figure out what's in the dark -----> spots !!! , hence the noise. i've done lots of 200 iso shots (often by error ;-) in daylight that looks great.", "sortedWord": "None", "identifyer": 15492, "year": "2008"}, {"Unnamed: 0": 451948, "autor": "John Thawley", "date": 1226924760000, "content": "Bernd, That's a nice shot and perspective. I find that ISO-noise is only a problem if there's too little light. As the sensor is native 100 ISO that's what it can see. With less light, the higher ISO-settings has to figure out what's in the dark spots, hence the noise. I've done lots of 200 ISO shots (often by error ;-) in daylight that looks great. I think that is a situation that is \"global\" to many cameras. When I would shoot night racing I would try to \"sneak\" up on the higher ISO settings in-as-much as I did not want to \"go there.\" As a result, I'd be shooting slightly under exposed. I would blame the resulting noise on high ISO. Lately, though, I realized I needed to just go for it, set the ISO high and go for it... and expose the image properly. Suprisingly, my images now have less noise at 1600 than they used to at 800 ISO. And, I see the benefits at all high ISOs when I make sure there is enough \"headroom\" to expose the image properly. Once you get into the high ISO you've got to be sure and have a solid exposure. The minute you try to save it in post processing, you'll simply amplify the noise exponentially. I find 400 ISO on the Digilux 2 very workable in RAW. JT", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/14/?tab=comments#comment-718596", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "bernd, that's a nice shot and perspective. i find that iso-noise is only a problem if there's too little light. as the sensor is native 100 iso that's what it can see. with less light, the higher iso-settings has to figure out what's in the dark -----> spots !!! , hence the noise. i've done lots of 200 iso shots (often by error ;-) in daylight that looks great. i think that is a situation that is \"global\" to many cameras. when i would shoot night racing i would try to \"sneak\" up on the higher iso settings in-as-much as i did not want to \"go there.\" as a result, i'd be shooting slightly under exposed. i would blame the resulting noise on high iso. lately, though, i realized i needed to just go for it, set the iso high and go for it... and expose the image properly. suprisingly, my images now have less noise at 1600 than they used to at 800 iso. and, i see the benefits at all high isos when i make sure there is enough \"headroom\" to expose the image properly. once you get into the high iso you've got to be sure and have a solid exposure. the minute you try to save it in post processing, you'll simply amplify the noise exponentially. i find 400 iso on the digilux 2 very workable in raw. jt", "sortedWord": "None", "identifyer": 15494, "year": "2008"}], "name": "spotL-Forum2008"}