{"interestingcomments": [{"Unnamed: 0": 351756, "autor": "fussgangerfoto", "date": 1423873440000, "content": "My M fell accidentally on a carpeted floor and as a result, I noticed a shift in the vertical alignment of the view finder. No other damage nor scratch. Today is Friday, the 13th… My four-week-old M240 took a tumble, in a heavily padded bag, about 8 ft. onto a cement floor. After my heart started beating again, I checked it out and it was without a scratch and it seemed to function OK (I turned it on and snapped a couple of live-view pictures to verify the shutter and electronics were OK). So I sighed and went to work and realized I had never checked the viewfinder. Sure enough, after agonizing about it all day, I came home and checked the rangefinder only to find it horribly out of vertical alignment. The horizontal appears to be spot-on, verified with focus peaking, but the vertical is off. Is there any way for a detail-oriented, do-it-yourselfer to make this adjustment? I have disassembled and repaired iPhones and mechanical watches, so I am compelled to ask. I just can't part with the camera for weeks upon weeks. Edited February 14, 2015 by fussgangerfoto", "link": "https://www.l-camera-forum.com/topic/221267-m-240-rangefinder-vertical-adjustment/?tab=comments#comment-2764287", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my m fell accidentally on a carpeted floor and as a result, i noticed a shift in the vertical alignment of the view finder. no other damage nor scratch. today is friday, the 13th… my four-week-old m240 took a tumble, in a heavily padded bag, about 8 ft. onto a cement floor. after my heart started beating again, i checked it out and it was without a scratch and it seemed to function ok (i turned it on and snapped a couple of live-view pictures to verify the shutter and electronics were ok). so i sighed and went to work and realized i had never checked the viewfinder. sure enough, after agonizing about it all day, i came home and checked the rangefinder only to find it horribly out of vertical alignment. the horizontal appears to be -----> spot !!! -on, verified with focus peaking, but the vertical is off. is there any way for a detail-oriented, do-it-yourselfer to make this adjustment? i have disassembled and repaired iphones and mechanical watches, so i am compelled to ask. i just can't part with the camera for weeks upon weeks. edited february 14, 2015 by fussgangerfoto", "sortedWord": "None", "identifyer": 12895, "year": "2015"}, {"Unnamed: 0": 351763, "autor": "epand56", "date": 1424171580000, "content": "At the time i had this problem with my M8, i did a try on aligning it by myself, but the results didn't match my expectations. I had then to send the camera to Solms and when back, two weeks later, anything was spot on. Unless you're very skilled in this kind of tricks, I suggest you to send the camera for adjustment.", "link": "https://www.l-camera-forum.com/topic/221267-m-240-rangefinder-vertical-adjustment/?tab=comments#comment-2766104", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "at the time i had this problem with my m8, i did a try on aligning it by myself, but the results didn't match my expectations. i had then to send the camera to solms and when back, two weeks later, anything was -----> spot !!!  on. unless you're very skilled in this kind of tricks, i suggest you to send the camera for adjustment.", "sortedWord": "None", "identifyer": 12902, "year": "2015"}, {"Unnamed: 0": 351764, "autor": "A Sfeir", "date": 1424206020000, "content": "At the time i had this problem with my M8, i did a try on aligning it by myself, but the results didn't match my expectations. I had then to send the camera to Solms and when back, two weeks later, anything was spot on. Unless you're very skilled in this kind of tricks, I suggest you to send the camera for adjustment. I believe the new mechanism where the cam is attached to the hex screw is easier to adjust than in previous Ms", "link": "https://www.l-camera-forum.com/topic/221267-m-240-rangefinder-vertical-adjustment/?tab=comments#comment-2766379", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "at the time i had this problem with my m8, i did a try on aligning it by myself, but the results didn't match my expectations. i had then to send the camera to solms and when back, two weeks later, anything was -----> spot !!!  on. unless you're very skilled in this kind of tricks, i suggest you to send the camera for adjustment. i believe the new mechanism where the cam is attached to the hex screw is easier to adjust than in previous ms", "sortedWord": "None", "identifyer": 12903, "year": "2015"}, {"Unnamed: 0": 355943, "autor": "pico", "date": 1424021280000, "content": "No need to warm…just careful 'wiggle'. ...while chanting, \"out damn spot!\" Unless your dog is named Spot.", "link": "https://www.l-camera-forum.com/topic/241063-how-to-replace-red-dot-logo/?tab=comments#comment-2765082", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "no need to warm…just careful 'wiggle'. ...while chanting, \"out damn -----> spot !!! !\" unless your dog is named -----> spot !!! .", "sortedWord": "None", "identifyer": 17109, "year": "2015"}, {"Unnamed: 0": 358872, "autor": "jaapv", "date": 1422858000000, "content": "If one lens front focuses and one back focuses chances are that both lenses are off and the camera spot on. This is not uncommon for lenses that still have the wide tolerances used for film. Just have them calibrated. The story that this needs to be done once a year is blathering nonsense. How could Steve know? He never keeps any camera for more than a few months. If a system is calibrated properly it will stay that way for many years, barring accidents. From my original M 8 from 2006 to my current M240 and MM I never had one that went off focus spontaneously.", "link": "https://www.l-camera-forum.com/topic/240602-leica-digital-focusing-issues/?tab=comments#comment-2757633", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "if one lens front focuses and one back focuses chances are that both lenses are off and the camera -----> spot !!!  on. this is not uncommon for lenses that still have the wide tolerances used for film. just have them calibrated. the story that this needs to be done once a year is blathering nonsense. how could steve know? he never keeps any camera for more than a few months. if a system is calibrated properly it will stay that way for many years, barring accidents. from my original m 8 from 2006 to my current m240 and mm i never had one that went off focus spontaneously.", "sortedWord": "None", "identifyer": 20053, "year": "2015"}, {"Unnamed: 0": 358882, "autor": "epand56", "date": 1426080360000, "content": "Tyler, it is not true you have to calibrate with each lens. I had the same problem when bought my M 240. More or less, all my lenses were off. I think it is mostly due to mishandling by courriers delivering cameras to the shops. The 90mm was the lens much off. I took my camera and the 90 to the Leica shop and when I got them back in three weeks, the camera was spot on at any aperture with all my lenses and also the infinite was perfectly aligned in the RF. I had to do the same with my M8 at the time I bought it and since 2006 it is still perfectly aligned. Edited March 11, 2015 by epand56", "link": "https://www.l-camera-forum.com/topic/240602-leica-digital-focusing-issues/?tab=comments#comment-2778768", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "tyler, it is not true you have to calibrate with each lens. i had the same problem when bought my m 240. more or less, all my lenses were off. i think it is mostly due to mishandling by courriers delivering cameras to the shops. the 90mm was the lens much off. i took my camera and the 90 to the leica shop and when i got them back in three weeks, the camera was -----> spot !!!  on at any aperture with all my lenses and also the infinite was perfectly aligned in the rf. i had to do the same with my m8 at the time i bought it and since 2006 it is still perfectly aligned. edited march 11, 2015 by epand56", "sortedWord": "None", "identifyer": 20063, "year": "2015"}, {"Unnamed: 0": 360071, "autor": "LeicaPassion", "date": 1451271120000, "content": "Hi Swifty, Thanks. The M246 files at ISO 3200 are impressive. I'm using the MM1. In the 1st image, the overall composition, mood, and detail in the curtain and the piano are spot on. Have fun with the greyhounds.", "link": "https://www.l-camera-forum.com/topic/280481-m246-image-thread/page/2/?tab=comments#comment-2957085", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi swifty, thanks. the m246 files at iso 3200 are impressive. i'm using the mm1. in the 1st image, the overall composition, mood, and detail in the curtain and the piano are -----> spot !!!  on. have fun with the greyhounds.", "sortedWord": "None", "identifyer": 21278, "year": "2015"}, {"Unnamed: 0": 365358, "autor": "asiafish", "date": 1447441920000, "content": "No sensors, even the old ones. So last year I sent in my M Monochrom for spots on the sensor, and it was returned to me supposedly repaired (cleaning of sensor, not replacement). It was better, but the exact same spot returned in the same place in just a few months, and back it went again to Leica New Jersey this past July, with a promise of sensor replacement by September 30. Needless to say, September 30 has come and gone, and now I'm told there will be no new sensors for the Monochrom until January 2016. More than a year to fix a defective sensor is just m,much longer than I am willing to wait, and since I don't want or care about any of the improvements in the new model, I shouldn't have to pay for an upgrade. I spoke to Leica New Jersey this morning and the person who had been helping me (Roxanna Lynch) said she will talk to management about the situation and should have an answer next week. If that answer isn't a replacement sensor or a replacement camera, I will then write a letter to HQ in Germany and demand either repair or replacement from them. This is beyond frustrating.", "link": "https://www.l-camera-forum.com/topic/250545-original-monochrom-corrosion-issues/?tab=comments#comment-2927917", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "no sensors, even the old ones. so last year i sent in my m monochrom for -----> spots !!!  on the sensor, and it was returned to me supposedly repaired (cleaning of sensor, not replacement). it was better, but the exact same spot returned in the same place in just a few months, and back it went again to leica new jersey this past july, with a promise of sensor replacement by september 30. needless to say, september 30 has come and gone, and now i'm told there will be no new sensors for the monochrom until january 2016. more than a year to fix a defective sensor is just m,much longer than i am willing to wait, and since i don't want or care about any of the improvements in the new model, i shouldn't have to pay for an upgrade. i spoke to leica new jersey this morning and the person who had been helping me (roxanna lynch) said she will talk to management about the situation and should have an answer next week. if that answer isn't a replacement sensor or a replacement camera, i will then write a letter to hq in germany and demand either repair or replacement from them. this is beyond frustrating.", "sortedWord": "None", "identifyer": 26619, "year": "2015"}, {"Unnamed: 0": 369557, "autor": "emre1969", "date": 1442575620000, "content": "Hi, I am using M9 since last 5 years. When I originally bought M9 , 35 summicron, 50 summilux lenses was not dead spot on, as I can understand now they have infinity focus issue but kind of acceptable. Afterwards I bought 90 mm summarit and focus was extremely bad. I brought my camera and lenses to Solms, they tried their best but as I can understand now they also tune lenses at their tolerance levels in a way that all of them kind of acceptable but none of them spot on.... Corrosion occurred at the sensor and sent my camera to repair. When I got it back I noticed that my 50 and 90 mm lenses are deadly sharp (as I had never seen it before) while 35 mm has issues. I believe my problem was previous tweaking of 35 mm at Solms. As unfortunately it is not easy for me to travel Solms every now and then and sending camera and receiving back to Turkey is not a very easy process I wonder whether there is a solution to tune the 35 mm summicron by myself.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/11/?tab=comments#comment-2890217", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi, i am using m9 since last 5 years. when i originally bought m9 , 35 summicron, 50 summilux lenses was not dead -----> spot !!!  on, as i can understand now they have infinity focus issue but kind of acceptable. afterwards i bought 90 mm summarit and focus was extremely bad. i brought my camera and lenses to solms, they tried their best but as i can understand now they also tune lenses at their tolerance levels in a way that all of them kind of acceptable but none of them spot on.... corrosion occurred at the sensor and sent my camera to repair. when i got it back i noticed that my 50 and 90 mm lenses are deadly sharp (as i had never seen it before) while 35 mm has issues. i believe my problem was previous tweaking of 35 mm at solms. as unfortunately it is not easy for me to travel solms every now and then and sending camera and receiving back to turkey is not a very easy process i wonder whether there is a solution to tune the 35 mm summicron by myself.", "sortedWord": "None", "identifyer": 30854, "year": "2015"}, {"Unnamed: 0": 369559, "autor": "alex7075", "date": 1443721920000, "content": "Can some please help me with the midrange calibration? I adjust the roller and the length of the arm. At 0.7m-1.5m focus is spot on, altough at >5m, but between I have frontfocus. I checked booth lenses on my M9 where all is ok, so I dont think that I have a problem with my lenses. Any suggestions? First of all, thanks to all those who helped understanding how this complex mechanism works. <script src=\"safari-extension://com.ebay.safari.myebaymanager-QYHMMGCMJR/2e5b823e/background/helpers/prefilterHelper.js\" type=\"text/javascript\"> </script> Having followed Julian's drawings, I am in a similar situation as rapids41: infinity OK, 1 meter OK, in-between backfocus. My suspicion is that if you increase the focus throw and turn the cam let's say CCW to fix infinity and 1 meter, well you could obtain the same result by doing the opposite, i.e. decrease the focus throw and turning the cam CW; the difference would be in the middle distances. So, the two different combinations would be equivalent for infinity and 1 meter, but affect middle distances. Does it make sense? Oh, the lens is a Noctilux f/1.0 and it works perfectly on my second M camera.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/11/?tab=comments#comment-2897464", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can some please help me with the midrange calibration? i adjust the roller and the length of the arm. at 0.7m-1.5m focus is -----> spot !!!  on, altough at >5m, but between i have frontfocus. i checked booth lenses on my m9 where all is ok, so i dont think that i have a problem with my lenses. any suggestions? first of all, thanks to all those who helped understanding how this complex mechanism works. <script src=\"safari-extension://com.ebay.safari.myebaymanager-qyhmmgcmjr/2e5b823e/background/helpers/prefilterhelper.js\" type=\"text/javascript\"> </script> having followed julian's drawings, i am in a similar situation as rapids41: infinity ok, 1 meter ok, in-between backfocus. my suspicion is that if you increase the focus throw and turn the cam let's say ccw to fix infinity and 1 meter, well you could obtain the same result by doing the opposite, i.e. decrease the focus throw and turning the cam cw; the difference would be in the middle distances. so, the two different combinations would be equivalent for infinity and 1 meter, but affect middle distances. does it make sense? oh, the lens is a noctilux f/1.0 and it works perfectly on my second m camera.", "sortedWord": "None", "identifyer": 30856, "year": "2015"}, {"Unnamed: 0": 369562, "autor": "alex7075", "date": 1443890940000, "content": "Final report: it takes time (three hours), but it works. I started with a Noctilux back-focusing only at middle distances and other lenses front-focusing. By tweaking the gain adjustment (and a little the infinite cam) all of them are now spot on at all distances. So thanks to all of you, this thread saved my gear a third trip to Wetzlar after two unsuccessful ones and many weeks away!", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/11/?tab=comments#comment-2898393", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "final report: it takes time (three hours), but it works. i started with a noctilux back-focusing only at middle distances and other lenses front-focusing. by tweaking the gain adjustment (and a little the infinite cam) all of them are now -----> spot !!!  on at all distances. so thanks to all of you, this thread saved my gear a third trip to wetzlar after two unsuccessful ones and many weeks away!", "sortedWord": "None", "identifyer": 30859, "year": "2015"}, {"Unnamed: 0": 369563, "autor": "rapids41", "date": 1444057860000, "content": "Can you please explain how you have done it? If near distance is spot on and infinity also, how do you start to correct middle distance?", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/11/?tab=comments#comment-2899452", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can you please explain how you have done it? if near distance is -----> spot !!!  on and infinity also, how do you start to correct middle distance?", "sortedWord": "None", "identifyer": 30860, "year": "2015"}, {"Unnamed: 0": 375669, "autor": "mca", "date": 1439460600000, "content": "Mine has some minor corrosion spots on one corner and they are not visible in the pictures, only when stopped down to f/16 which I rarely shoot. The only thing visible for me is on certain higher ISOs there is a vertical white line more or less a third from the left. It doesn't seem to happen on lower ISOs but I have to make some more tests. From what I understand this is usually a sign of a dead pixel. So with these 2 issues I am thinking if I should send my camera in right away and get a new 'old sensor' or if I wait until Leica is fitting the new revised sensors? Any opinions? I know I can send it in now and in the future they will replace it again if issues arise but that would mean 2 periods of time without my beloved M9 instead of just 1.", "link": "https://www.l-camera-forum.com/topic/247062-ccd-sensor-new-leica-information-about-the-state-of-development/page/3/?tab=comments#comment-2870893", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "mine has some minor corrosion -----> spots !!!  on one corner and they are not visible in the pictures, only when stopped down to f/16 which i rarely shoot. the only thing visible for me is on certain higher isos there is a vertical white line more or less a third from the left. it doesn't seem to happen on lower isos but i have to make some more tests. from what i understand this is usually a sign of a dead pixel. so with these 2 issues i am thinking if i should send my camera in right away and get a new 'old sensor' or if i wait until leica is fitting the new revised sensors? any opinions? i know i can send it in now and in the future they will replace it again if issues arise but that would mean 2 periods of time without my beloved m9 instead of just 1.", "sortedWord": "None", "identifyer": 36977, "year": "2015"}, {"Unnamed: 0": 375676, "autor": "asiafish", "date": 1441083300000, "content": "Procedure for M9 sensor evaluation-replacement? I realize I am very late following this topic, but could experienced M9 users tell me the process to follow, to have an M9 (my son's, in Berlin) sensor evaluated and hopefully replaced by Leica? In June 2015, staff at the Berlin Leica store told him to bring in his M9 for a quick check by their staff, when they would decide if his sensor problem qualified for the replacement program, and if so they would send it to the factory to join the wait list for a new sensor. When he brought in his M9, the same people told him their store had nothing to to with the process, and he was responsible to take-send his camera to the factory to be evaluated, and possibly serviced. What is the official and proper procedure to follow? Your advice is appreciated.. Does it have spots? Best way to check is to put a standard or wide lens on it, stop down to the smallest aperture and shoot a picture of a clear sky. If there are no spots, then the sensor is not corroded. If there are spots, look closely for a white edge around them. If there are white edges, it MIGHT BE corrosion, and he should send it to Leica. My M-E had a corroded sensor from new, and I should have it back in about a month with a new sensor. My almost 3-year-old M Monochrom had what appeared as corrosion, but it was just an oil stain. Leica cleaned it, the stain returned in the same place a few months later and it is back, being checked again. Leica's initial inspection revealed it was another (the same?) oil stain and they are again cleaning rather than replacing the sensor. We shall see.", "link": "https://www.l-camera-forum.com/topic/247062-ccd-sensor-new-leica-information-about-the-state-of-development/page/4/?tab=comments#comment-2880221", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "procedure for m9 sensor evaluation-replacement? i realize i am very late following this topic, but could experienced m9 users tell me the process to follow, to have an m9 (my son's, in berlin) sensor evaluated and hopefully replaced by leica? in june 2015, staff at the berlin leica store told him to bring in his m9 for a quick check by their staff, when they would decide if his sensor problem qualified for the replacement program, and if so they would send it to the factory to join the wait list for a new sensor. when he brought in his m9, the same people told him their store had nothing to to with the process, and he was responsible to take-send his camera to the factory to be evaluated, and possibly serviced. what is the official and proper procedure to follow? your advice is appreciated.. does it have -----> spots !!! ? best way to check is to put a standard or wide lens on it, stop down to the smallest aperture and shoot a picture of a clear sky. if there are no spots, then the sensor is not corroded. if there are spots, look closely for a white edge around them. if there are white edges, it might be corrosion, and he should send it to leica. my m-e had a corroded sensor from new, and i should have it back in about a month with a new sensor. my almost 3-year-old m monochrom had what appeared as corrosion, but it was just an oil stain. leica cleaned it, the stain returned in the same place a few months later and it is back, being checked again. leica's initial inspection revealed it was another (the same?) oil stain and they are again cleaning rather than replacing the sensor. we shall see.", "sortedWord": "None", "identifyer": 36984, "year": "2015"}, {"Unnamed: 0": 375682, "autor": "ThePioneer", "date": 1442854080000, "content": "Does it have spots? Best way to check is to put a standard or wide lens on it, stop down to the smallest aperture and shoot a picture of a clear sky. If there are no spots, then the sensor is not corroded. If there are spots, look closely for a white edge around them. If there are white edges, it MIGHT BE corrosion, and he should send it to Leica. My M-E had a corroded sensor from new, and I should have it back in about a month with a new sensor. My almost 3-year-old M Monochrom had what appeared as corrosion, but it was just an oil stain. Leica cleaned it, the stain returned in the same place a few months later and it is back, being checked again. Leica's initial inspection revealed it was another (the same?) oil stain and they are again cleaning rather than replacing the sensor. We shall see. I have had to clean a couple of oil stains off my MM sensor as well. No corrosion though. My M9 remains clean with the obvious exception of the normal grunge that accumulates throughout the year.", "link": "https://www.l-camera-forum.com/topic/247062-ccd-sensor-new-leica-information-about-the-state-of-development/page/4/?tab=comments#comment-2891811", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "does it have -----> spots !!! ? best way to check is to put a standard or wide lens on it, stop down to the smallest aperture and shoot a picture of a clear sky. if there are no spots, then the sensor is not corroded. if there are spots, look closely for a white edge around them. if there are white edges, it might be corrosion, and he should send it to leica. my m-e had a corroded sensor from new, and i should have it back in about a month with a new sensor. my almost 3-year-old m monochrom had what appeared as corrosion, but it was just an oil stain. leica cleaned it, the stain returned in the same place a few months later and it is back, being checked again. leica's initial inspection revealed it was another (the same?) oil stain and they are again cleaning rather than replacing the sensor. we shall see. i have had to clean a couple of oil stains off my mm sensor as well. no corrosion though. my m9 remains clean with the obvious exception of the normal grunge that accumulates throughout the year.", "sortedWord": "None", "identifyer": 36990, "year": "2015"}, {"Unnamed: 0": 378002, "autor": "batmobile", "date": 1422441000000, "content": "Its a nice idea and certainly everyone having what they want would be great, but I cannot remotely see it happening. CCD is dying out in the evolution of sensors and this is for the reasons already mentioned. Economics will prevent resurrection, because Leica would be foolish to syphon of R&D funds that could be put into other products with a larger market, even if that product is the only FF M they make. I love my Monochrom, but not because of its CCD. Does it have something special, especially at base ISO? Maybe. Does it matter much in the grand scheme of things? No. We will have to wait for the M240 Monochrom for the comparisons to begin again! As for colour and look, I personally find the Sony sensors in the A7 and A7R rather nice. Colour is spot on, colour depth tremendous and there is IMHO much more to be gained with the additional DR and other merits than would be gained by tiny subjective improvements in base performance and colour on a CCD. The problem is not CMOS. The problem is the quality of the images produced by it in the case of each camera release. IMHO, the Sony sensors show what can be done. As for the OP's assertion that most photos are taken at base ISO, I do not think this is true for a lot of people. In one of the last portfolios I produced, the most used ISO was 800... A CCD would have fallen apart (unless it was the Monochrom).", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/2/?tab=comments#comment-2754387", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "its a nice idea and certainly everyone having what they want would be great, but i cannot remotely see it happening. ccd is dying out in the evolution of sensors and this is for the reasons already mentioned. economics will prevent resurrection, because leica would be foolish to syphon of r&d funds that could be put into other products with a larger market, even if that product is the only ff m they make. i love my monochrom, but not because of its ccd. does it have something special, especially at base iso? maybe. does it matter much in the grand scheme of things? no. we will have to wait for the m240 monochrom for the comparisons to begin again! as for colour and look, i personally find the sony sensors in the a7 and a7r rather nice. colour is -----> spot !!!  on, colour depth tremendous and there is imho much more to be gained with the additional dr and other merits than would be gained by tiny subjective improvements in base performance and colour on a ccd. the problem is not cmos. the problem is the quality of the images produced by it in the case of each camera release. imho, the sony sensors show what can be done. as for the op's assertion that most photos are taken at base iso, i do not think this is true for a lot of people. in one of the last portfolios i produced, the most used iso was 800... a ccd would have fallen apart (unless it was the monochrom).", "sortedWord": "None", "identifyer": 39318, "year": "2015"}, {"Unnamed: 0": 378010, "autor": "01af", "date": 1422455160000, "content": "Have you ever considered that perhaps your eyes are \"just not skilled enough\" to appreciate the nuances between the two outputs? As a matter of fact, I have. And I hereby repeat my request for you to provide us with an example where said \"nuances\" exist, so we can evaluate our eyes' skills and compare them to yours. Many people, including non-photographers, perceive a difference. So do I. But I don't perceive any differences which are actually rooted in sensor technology. I just perceive differences between cameras' outputs—which can be eliminated through appropriate processing. So in the end, there is nothing to be found in images from CCD sensors which cannot be had in images from CMOS sensors just as well. No intrinsic advantage in CCD sensors ... but a lot of intrinsic disadvantages (no live view, poor high-ISO performance, etc.). Some will say, well, the additional effort required for CMOS images to make them look like CCD images is a point in favour of CCD. But in my opinion, that's a foolish point of view because the effort required can be made as small as applying a custom profile, script, or action. Just a mouseclick or two. And I'm not only referring to the final outputs, but also to the behaviour of the files under post processing. At this point, you're losing me. What is \"behaviour of files under post-processing\" supposed to mean? Flexibility? Resilience? Malleableness? Effort required to come up with the desired final result? In all these points, I am seeing the advantages on the CMOS side of things ... or at the very least, no disadvantages. Then again, like you, I hope I haven't stepped on anybody's \"toes\". I'm afraid I stepped on yours. My apologies, I didn't mean to offend you ... much less as I always adored your photographs. Still I disagree with your opinion about the alleged virtues of the CCD sensor technology—and particularly after your open-letter campaign it is important to me to raise my voice in order to make it clear that not everybody agrees with you and your 400 friends. Let's have a little quiz. I show you two pictures (umm, magnified crops from pictures, actually), taken with the very same lens on a Leica M9 and a Leica M (Typ 240), and you tell me which you like better, and why. Here's the full frame, with a red frame indicating the crop: --img--  Here's the crop from the picture above: --img--  And finally, the crop from another capture of the same picture, taken from the same point of view with the same lens on the other camera: --img--  Both crops have been processed individually with Adobe Camera Raw. Remember, the question is not, \"What picture was taken with which camera?\" It also is not, \"How many differences can you spot?\" ... there are many minor differences, but that's not the point. The question is, \"Which do you like better?\" or alternatively, \"Which do you think will give the nicer print?\" (assuming we want to print big size).", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/3/?tab=comments#comment-2754476", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "have you ever considered that perhaps your eyes are \"just not skilled enough\" to appreciate the nuances between the two outputs? as a matter of fact, i have. and i hereby repeat my request for you to provide us with an example where said \"nuances\" exist, so we can evaluate our eyes' skills and compare them to yours. many people, including non-photographers, perceive a difference. so do i. but i don't perceive any differences which are actually rooted in sensor technology. i just perceive differences between cameras' outputs—which can be eliminated through appropriate processing. so in the end, there is nothing to be found in images from ccd sensors which cannot be had in images from cmos sensors just as well. no intrinsic advantage in ccd sensors ... but a lot of intrinsic disadvantages (no live view, poor high-iso performance, etc.). some will say, well, the additional effort required for cmos images to make them look like ccd images is a point in favour of ccd. but in my opinion, that's a foolish point of view because the effort required can be made as small as applying a custom profile, script, or action. just a mouseclick or two. and i'm not only referring to the final outputs, but also to the behaviour of the files under post processing. at this point, you're losing me. what is \"behaviour of files under post-processing\" supposed to mean? flexibility? resilience? malleableness? effort required to come up with the desired final result? in all these points, i am seeing the advantages on the cmos side of things ... or at the very least, no disadvantages. then again, like you, i hope i haven't stepped on anybody's \"toes\". i'm afraid i stepped on yours. my apologies, i didn't mean to offend you ... much less as i always adored your photographs. still i disagree with your opinion about the alleged virtues of the ccd sensor technology—and particularly after your open-letter campaign it is important to me to raise my voice in order to make it clear that not everybody agrees with you and your 400 friends. let's have a little quiz. i show you two pictures (umm, magnified crops from pictures, actually), taken with the very same lens on a leica m9 and a leica m (typ 240), and you tell me which you like better, and why. here's the full frame, with a red frame indicating the crop: --img--  here's the crop from the picture above: --img--  and finally, the crop from another capture of the same picture, taken from the same point of view with the same lens on the other camera: --img--  both crops have been processed individually with adobe camera raw. remember, the question is not, \"what picture was taken with which camera?\" it also is not, \"how many differences can you -----> spot !!! ?\" ... there are many minor differences, but that's not the point. the question is, \"which do you like better?\" or alternatively, \"which do you think will give the nicer print?\" (assuming we want to print big size).", "sortedWord": "None", "identifyer": 39326, "year": "2015"}, {"Unnamed: 0": 378269, "autor": "Lenshacker", "date": 1424342940000, "content": "You are straying from the main point of this thread, where the OP seems to indite the CMOS sensor while ignoring everything else in the image processing chain including the CFA and the in-camera image processing. Now you are straying into the issue of the differences in the thickness of the sensor IR glass. Rick The difference in IR response is a function of the sensor and of the IR filter over it. We have established that. You can read some of the links posted. The OP has stated that he wants to uncover the potential of the M240, he is on his third one. The IR sensitivity may be the root of his problem. Banding may also be a problem. Peter: Unless you have dumped your current M240, 1) Take a picture of an IR remote control (for a TV) with the M9 and M240 without using IR blocking filters. 2) With the M240: set it to ISO6400 and take an existing light photo with the camera on Manual Exposure. Have a scene with a lot of shadows and some bright spots. You are looking for banding issues. Then set the camera to Base ISO without changing the settings. Push the underexposed image to the point where it matches the ISO6400 shots. We are trying to determine if there is underlying banding in the Base ISO shots, or if they are an artifact of High-ISO. This has to do with where the banding is introduced within the Sensor.", "link": "https://www.l-camera-forum.com/topic/240288-400-leica-photographers-agree-we-love-ccd/page/16/?tab=comments#comment-2767217", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "you are straying from the main point of this thread, where the op seems to indite the cmos sensor while ignoring everything else in the image processing chain including the cfa and the in-camera image processing. now you are straying into the issue of the differences in the thickness of the sensor ir glass. rick the difference in ir response is a function of the sensor and of the ir filter over it. we have established that. you can read some of the links posted. the op has stated that he wants to uncover the potential of the m240, he is on his third one. the ir sensitivity may be the root of his problem. banding may also be a problem. peter: unless you have dumped your current m240, 1) take a picture of an ir remote control (for a tv) with the m9 and m240 without using ir blocking filters. 2) with the m240: set it to iso6400 and take an existing light photo with the camera on manual exposure. have a scene with a lot of shadows and some bright -----> spots !!! . you are looking for banding issues. then set the camera to base iso without changing the settings. push the underexposed image to the point where it matches the iso6400 shots. we are trying to determine if there is underlying banding in the base iso shots, or if they are an artifact of high-iso. this has to do with where the banding is introduced within the sensor.", "sortedWord": "None", "identifyer": 39585, "year": "2015"}, {"Unnamed: 0": 384947, "autor": "Lenshacker", "date": 1422889440000, "content": "Does negative exposure compensation work in Manual exposure mode, with a manually selected ISO? I've never tried that! That's what I was doing yesterday- had to convince myself that it was working. I got the reading in Auto mode, then manually selected the indicated shutter speed and \"got the dot\". Moved the shutter speed up from that spot.", "link": "https://www.l-camera-forum.com/topic/240074-m8-hideous-unusable-high-iso-performance-thread/page/3/?tab=comments#comment-2757911", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "does negative exposure compensation work in manual exposure mode, with a manually selected iso? i've never tried that! that's what i was doing yesterday- had to convince myself that it was working. i got the reading in auto mode, then manually selected the indicated shutter speed and \"got the dot\". moved the shutter speed up from that -----> spot !!! .", "sortedWord": "None", "identifyer": 46351, "year": "2015"}, {"Unnamed: 0": 384948, "autor": "T44ISKN", "date": 1422901020000, "content": "That's what I was doing yesterday- had to convince myself that it was working. I got the reading in Auto mode, then manually selected the indicated shutter speed and \"got the dot\". Moved the shutter speed up from that spot. I've just re-read the entire thread and think I get it finally! Can't wait to get home this evening and give it a try. I'll post my results. Bear with me!", "link": "https://www.l-camera-forum.com/topic/240074-m8-hideous-unusable-high-iso-performance-thread/page/3/?tab=comments#comment-2758019", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "that's what i was doing yesterday- had to convince myself that it was working. i got the reading in auto mode, then manually selected the indicated shutter speed and \"got the dot\". moved the shutter speed up from that -----> spot !!! . i've just re-read the entire thread and think i get it finally! can't wait to get home this evening and give it a try. i'll post my results. bear with me!", "sortedWord": "None", "identifyer": 46352, "year": "2015"}, {"Unnamed: 0": 386017, "autor": "jaapv", "date": 1450280280000, "content": "No not from the same point using different lenses ! I mean the \"same scene\" = same framing to see that perspective's difference in the two finished photos (M8+35, M9 + 50 ). So that is the point, different relationship between near and far subjects in the same framing photos with different focal lenghts. As soon as you start walking the perspective changes, irrespective of the lens or crop factor. You can use the focal length to equalize the angle of view If you stay on the same spot the angle of view changes with the focal length and crop factor but not the perspective. You might notice a difference in DOF, as the smaller sensor will give a deeper DOF with the same angle of view.", "link": "https://www.l-camera-forum.com/topic/254430-crop-factor-and-a-feeling-of-difference/?tab=comments#comment-2950012", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "no not from the same point using different lenses ! i mean the \"same scene\" = same framing to see that perspective's difference in the two finished photos (m8+35, m9 + 50 ). so that is the point, different relationship between near and far subjects in the same framing photos with different focal lenghts. as soon as you start walking the perspective changes, irrespective of the lens or crop factor. you can use the focal length to equalize the angle of view if you stay on the same -----> spot !!!  the angle of view changes with the focal length and crop factor but not the perspective. you might notice a difference in dof, as the smaller sensor will give a deeper dof with the same angle of view.", "sortedWord": "None", "identifyer": 47423, "year": "2015"}, {"Unnamed: 0": 386086, "autor": "gbealnz", "date": 1443344220000, "content": "I've just looked at your shot, and personally, I'd forget it, just use the camera. YES, you can see them, and now you have seen them you'll always see them, but heck, on 99% of your everyday shots I'd suspect you may not. Plus fixing it is a simple click with the clone tool. I often have to with pixels like this on astro shots. MANY more of them than the two you have. I'd be waiting for something major to rear it's head (touch wood it doesn't) before I spent the sort of money you will likely spend. If and when that happens, get these two pesky spots sorted at the same time. Agreed though, Camera Clinic is excellent, I had my X1 flash fixed by them, awesome service. Gary Edited September 27, 2015 by gbealnz", "link": "https://www.l-camera-forum.com/topic/250477-where-to-get-deadhot-pixels-fixed-in-australia/?tab=comments#comment-2894904", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i've just looked at your shot, and personally, i'd forget it, just use the camera. yes, you can see them, and now you have seen them you'll always see them, but heck, on 99% of your everyday shots i'd suspect you may not. plus fixing it is a simple click with the clone tool. i often have to with pixels like this on astro shots. many more of them than the two you have. i'd be waiting for something major to rear it's head (touch wood it doesn't) before i spent the sort of money you will likely spend. if and when that happens, get these two pesky -----> spots !!!  sorted at the same time. agreed though, camera clinic is excellent, i had my x1 flash fixed by them, awesome service. gary edited september 27, 2015 by gbealnz", "sortedWord": "None", "identifyer": 47492, "year": "2015"}, {"Unnamed: 0": 386233, "autor": "david strachan", "date": 1447102980000, "content": "I use a Rocolax UV-IR on my Canon 35mm f2 which has a 40mm filter thread. Works fine. And the threads take a lens hood as well. Take them off at night, not needed anyway, because they cause some pretty wild flare spots. cheers Dave S Edited November 9, 2015 by david strachan", "link": "https://www.l-camera-forum.com/topic/252836-40mm-uv-ir-cut-filter/?tab=comments#comment-2924833", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i use a rocolax uv-ir on my canon 35mm f2 which has a 40mm filter thread. works fine. and the threads take a lens hood as well. take them off at night, not needed anyway, because they cause some pretty wild flare -----> spots !!! . cheers dave s edited november 9, 2015 by david strachan", "sortedWord": "None", "identifyer": 47639, "year": "2015"}, {"Unnamed: 0": 386234, "autor": "bideford", "date": 1447106400000, "content": "I use a Rocolax UV-IR on my Canon 35mm f2 which has a 40mm filter thread. Works fine. And the threads take a lens hood as well. Take them off at night, not needed anyway, because they cause some pretty wild flare spots. cheers Dave S Ordered one - thanks!", "link": "https://www.l-camera-forum.com/topic/252836-40mm-uv-ir-cut-filter/?tab=comments#comment-2924885", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i use a rocolax uv-ir on my canon 35mm f2 which has a 40mm filter thread. works fine. and the threads take a lens hood as well. take them off at night, not needed anyway, because they cause some pretty wild flare -----> spots !!! . cheers dave s ordered one - thanks!", "sortedWord": "None", "identifyer": 47640, "year": "2015"}, {"Unnamed: 0": 404304, "autor": "michaelwj", "date": 1424821020000, "content": " I think we may agree, but are using different words to explain the same thing. I find it tricky to explain in forum posts sometimes without talking in person, drawing diagrams and the like. So I can't agree with you as light 'spillage' would affect the shadows as well as mid-tones and highlights and would reduce overall contrast (which it does on earlier designs and to a slight extent on some Mandler designs). Of course it can. As you say, \"- in practice always less than 100% due to some, albeit small, degree of flare.\" So a large degree of flare would reduce it more than a small amount. Although what you call flare, I generalised to \"spillage\" to include other aberrations. But as you say, there's no such thing as a free lunch, and allowing flare to reduce contrast to extend the dynamic range that can be captured isn't a viability I'm afraid (if it was lens designers would design such lenses and use software to readjust the contrast after....). Of course it is. A lens that reproduced the contrast in a scene perfectly would render a scene with 15 stops of DR as 15 stops, and therefore clip one or both ends. A lens with reduced contrast (by whatever means) would render the scene with less contrast. It is the same principle as pre-exposing film to bring up the shadows while the highlights remain in check. They did design such lenses, such as the rigid summicron, which had higher sharpness and lower contrast than the lens that replaced it. Contrast can only be increased after the fact however, a clipped highlight or shadow is clipped. But then the no free lunch thing comes to bite you and people want more contrast, better flare suppression, and so on. So I'm still interested in an explanation regarding the smoothness of tonality from Mandler lenses. My explanation is that the Mandler lenses are at the sweet spot of lens design, with just enough correction but not too much. They are not clinical, but not \"glowing\", they are in my opinion the goldilocks lenses. Cheers, Michael", "link": "https://www.l-camera-forum.com/topic/45272-in-praise-of-the-mandler-lenses/page/6/?tab=comments#comment-2770288", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " i think we may agree, but are using different words to explain the same thing. i find it tricky to explain in forum posts sometimes without talking in person, drawing diagrams and the like. so i can't agree with you as light 'spillage' would affect the shadows as well as mid-tones and highlights and would reduce overall contrast (which it does on earlier designs and to a slight extent on some mandler designs). of course it can. as you say, \"- in practice always less than 100% due to some, albeit small, degree of flare.\" so a large degree of flare would reduce it more than a small amount. although what you call flare, i generalised to \"spillage\" to include other aberrations. but as you say, there's no such thing as a free lunch, and allowing flare to reduce contrast to extend the dynamic range that can be captured isn't a viability i'm afraid (if it was lens designers would design such lenses and use software to readjust the contrast after....). of course it is. a lens that reproduced the contrast in a scene perfectly would render a scene with 15 stops of dr as 15 stops, and therefore clip one or both ends. a lens with reduced contrast (by whatever means) would render the scene with less contrast. it is the same principle as pre-exposing film to bring up the shadows while the highlights remain in check. they did design such lenses, such as the rigid summicron, which had higher sharpness and lower contrast than the lens that replaced it. contrast can only be increased after the fact however, a clipped highlight or shadow is clipped. but then the no free lunch thing comes to bite you and people want more contrast, better flare suppression, and so on. so i'm still interested in an explanation regarding the smoothness of tonality from mandler lenses. my explanation is that the mandler lenses are at the sweet -----> spot !!!  of lens design, with just enough correction but not too much. they are not clinical, but not \"glowing\", they are in my opinion the goldilocks lenses. cheers, michael", "sortedWord": "None", "identifyer": 17064, "year": "2015"}, {"Unnamed: 0": 404307, "autor": "pgk", "date": 1424866680000, "content": "My explanation is that the Mandler lenses are at the sweet spot of lens design, with just enough correction but not too much. They are not clinical, but not \"glowing\", they are in my opinion the goldilocks lenses. I'm starting to wonder if Mandler designed lenses do occupy, as you say, a 'sweet spot of lens design'. Their pre-aspheric design, small size and other physical characteristics/attributes might just produce a subtle difference in image which has not been repeated. At mid-apertures my Mandler designed lenses, and others that I have used, show a subtlety of tonality which I am not sure that I have seen from many other lenses. I first really noticed this on a large (A2) print of the Menai Suspension Bridge in warm late afternoon light (the file is with Getty or I'd post it!) from an 80/1.4 shot at f/8~11ish on a Canon 1Ds. The fine detail was beautifully clear but not harsh in any way, simply smooth tonal transitions in fine detailed areas - quite different to files from the Canon 85/1.2 which whilst stunningly sharp wide open (it was always tricky to achieve absolute focus with) had acceptable, but nothing more, performance at mid apertures. My 90/2.8 Elmarit-M shows similar, though not quite as smooth, detail as the 80/1.4, as did both 35s (f/1.4 and f/2v.4) along with the pre-aspheric 50mm v.2 Summilux . I suppose the bottom line is that Mandler was a superb lens designer who worked in he right place at the right time and who appreciated more than simply the mathematics of lens design from what I have read about him.", "link": "https://www.l-camera-forum.com/topic/45272-in-praise-of-the-mandler-lenses/page/6/?tab=comments#comment-2770535", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my explanation is that the mandler lenses are at the sweet -----> spot !!!  of lens design, with just enough correction but not too much. they are not clinical, but not \"glowing\", they are in my opinion the goldilocks lenses. i'm starting to wonder if mandler designed lenses do occupy, as you say, a 'sweet spot of lens design'. their pre-aspheric design, small size and other physical characteristics/attributes might just produce a subtle difference in image which has not been repeated. at mid-apertures my mandler designed lenses, and others that i have used, show a subtlety of tonality which i am not sure that i have seen from many other lenses. i first really noticed this on a large (a2) print of the menai suspension bridge in warm late afternoon light (the file is with getty or i'd post it!) from an 80/1.4 shot at f/8~11ish on a canon 1ds. the fine detail was beautifully clear but not harsh in any way, simply smooth tonal transitions in fine detailed areas - quite different to files from the canon 85/1.2 which whilst stunningly sharp wide open (it was always tricky to achieve absolute focus with) had acceptable, but nothing more, performance at mid apertures. my 90/2.8 elmarit-m shows similar, though not quite as smooth, detail as the 80/1.4, as did both 35s (f/1.4 and f/2v.4) along with the pre-aspheric 50mm v.2 summilux . i suppose the bottom line is that mandler was a superb lens designer who worked in he right place at the right time and who appreciated more than simply the mathematics of lens design from what i have read about him.", "sortedWord": "None", "identifyer": 17067, "year": "2015"}, {"Unnamed: 0": 413206, "autor": "thighslapper", "date": 1447715280000, "content": "This is almost a 100% crop ....... I really cannot fault this camera .... AF accuracy is almost 100% to date, exposure is usually spot on and WB seems fine Reds need slight tweaking in LR as there is no profile. Customisation is great and the control layout excellent once you get your own setup to suit your preferences. --img-- ", "link": "https://www.l-camera-forum.com/topic/253192-leica-sl-image-thread-post-your-examples-here/?tab=comments#comment-2930146", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "this is almost a 100% crop ....... i really cannot fault this camera .... af accuracy is almost 100% to date, exposure is usually -----> spot !!!  on and wb seems fine reds need slight tweaking in lr as there is no profile. customisation is great and the control layout excellent once you get your own setup to suit your preferences. --img-- ", "sortedWord": "None", "identifyer": 26074, "year": "2015"}, {"Unnamed: 0": 413253, "autor": "rfunnell", "date": 1447972440000, "content": "One of the first photos with my new Leica SL had to be of Chester he was my model for the day. In this photo he can be seen 'giving me the look'. I note on previewing this that the reduction of the image to 500K certainly flattens the image compared to how it looks on the retina display in it's full resolution. Photo taken with Leica 50mm (Apo-Summicron-M 1:2/50 ASPH) Certainly very happy with the new camera and how nice it is to use. One small problem noted however in the EVF there is what appears to be a dust spot which doesn't show up on the images not quite sure what this is about yet anyone else have any experience with this ? --img-- ", "link": "https://www.l-camera-forum.com/topic/253192-leica-sl-image-thread-post-your-examples-here/page/4/?tab=comments#comment-2932446", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "one of the first photos with my new leica sl had to be of chester he was my model for the day. in this photo he can be seen 'giving me the look'. i note on previewing this that the reduction of the image to 500k certainly flattens the image compared to how it looks on the retina display in it's full resolution. photo taken with leica 50mm (apo-summicron-m 1:2/50 asph) certainly very happy with the new camera and how nice it is to use. one small problem noted however in the evf there is what appears to be a dust -----> spot !!!  which doesn't show up on the images not quite sure what this is about yet anyone else have any experience with this ? --img-- ", "sortedWord": "None", "identifyer": 26129, "year": "2015"}, {"Unnamed: 0": 413266, "autor": "thighslapper", "date": 1448230920000, "content": "Very happy with the skin tones on the SL ......... if WB is ok then skin looks fine ...... even in mixed lighting. --img--  In fact ....... this one isn't right ..... had to desaturate red a bit to get the skin right .... but in all the others it is spot on ..... Edited November 22, 2015 by thighslapper", "link": "https://www.l-camera-forum.com/topic/253192-leica-sl-image-thread-post-your-examples-here/page/5/?tab=comments#comment-2934863", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "very happy with the skin tones on the sl ......... if wb is ok then skin looks fine ...... even in mixed lighting. --img--  in fact ....... this one isn't right ..... had to desaturate red a bit to get the skin right .... but in all the others it is -----> spot !!!  on ..... edited november 22, 2015 by thighslapper", "sortedWord": "None", "identifyer": 26148, "year": "2015"}, {"Unnamed: 0": 413269, "autor": "digitalfx", "date": 1448235600000, "content": "Very happy with the skin tones on the SL ......... if WB is ok then skin looks fine ...... even in mixed lighting. --img-- L1200497-2.jpg In fact ....... this one isn't right ..... had to desaturate red a bit to get the skin right .... but in all the others it is spot on ..... very nice, which lens?", "link": "https://www.l-camera-forum.com/topic/253192-leica-sl-image-thread-post-your-examples-here/page/5/?tab=comments#comment-2934904", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "very happy with the skin tones on the sl ......... if wb is ok then skin looks fine ...... even in mixed lighting. --img-- l1200497-2.jpg in fact ....... this one isn't right ..... had to desaturate red a bit to get the skin right .... but in all the others it is -----> spot !!!  on ..... very nice, which lens?", "sortedWord": "None", "identifyer": 26151, "year": "2015"}, {"Unnamed: 0": 413283, "autor": "thighslapper", "date": 1448371500000, "content": "Anything done in post processing? The color and image quality is outstanding. just WB taken from the pearls on the necklace .... a few zits spotted out (only noticeable on the full size image) and sharpen/de-noise ........ oh and a bit of clarity added to the eyes to be honest the original at this size with just WB correction looks almost identical.", "link": "https://www.l-camera-forum.com/topic/253192-leica-sl-image-thread-post-your-examples-here/page/6/?tab=comments#comment-2935995", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "anything done in post processing? the color and image quality is outstanding. just wb taken from the pearls on the necklace .... a few zits -----> spotted !!!  out (only noticeable on the full size image) and sharpen/de-noise ........ oh and a bit of clarity added to the eyes to be honest the original at this size with just wb correction looks almost identical.", "sortedWord": "None", "identifyer": 26165, "year": "2015"}, {"Unnamed: 0": 413301, "autor": "Peter H", "date": 1448478600000, "content": "I see it on my MacBook Pro... but didn't notice until it was pointed out... I just saw a nice picture --img--  Yes, they are nice pictures. I wasn't t looking for faults or pixel-peeping, but they were clear enough to stand out, just. And once you spot something like that it becomes hard to ignore it. It sort of draws your eyes to it. Edited November 25, 2015 by Peter H", "link": "https://www.l-camera-forum.com/topic/253192-leica-sl-image-thread-post-your-examples-here/page/7/?tab=comments#comment-2936798", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i see it on my macbook pro... but didn't notice until it was pointed out... i just saw a nice picture --img--  yes, they are nice pictures. i wasn't t looking for faults or pixel-peeping, but they were clear enough to stand out, just. and once you -----> spot !!!  something like that it becomes hard to ignore it. it sort of draws your eyes to it. edited november 25, 2015 by peter h", "sortedWord": "None", "identifyer": 26183, "year": "2015"}, {"Unnamed: 0": 413316, "autor": "ramarren", "date": 1448548020000, "content": "I see it on my MacBook Pro... but didn't notice until it was pointed out... I just saw a nice picture --img--  Yes, they are nice pictures. I wasn't t looking for faults or pixel-peeping, but they were clear enough to stand out, just. And once you spot something like that it becomes hard to ignore it. It sort of draws your eyes to it. You are right... once it was pointed out, it was all I could see... Yes, once you focus my eyes with words that lead their expectations, I see banding ... I see it now on almost everything, including the white background of the window. --img--  The mind and the eye are tricky things; the one can overwhelm the other pretty easily. Perhaps I'm not looking for flaws critically enough most of the time ... I'm looking to see the photographs, not the dust spots or the bands or the other flaws. My assumption is that photos I see on the net are heavily de-rezzed, downsized representations of the original image; many kinds of flaws can arise from that process.", "link": "https://www.l-camera-forum.com/topic/253192-leica-sl-image-thread-post-your-examples-here/page/8/?tab=comments#comment-2937300", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i see it on my macbook pro... but didn't notice until it was pointed out... i just saw a nice picture --img--  yes, they are nice pictures. i wasn't t looking for faults or pixel-peeping, but they were clear enough to stand out, just. and once you -----> spot !!!  something like that it becomes hard to ignore it. it sort of draws your eyes to it. you are right... once it was pointed out, it was all i could see... yes, once you focus my eyes with words that lead their expectations, i see banding ... i see it now on almost everything, including the white background of the window. --img--  the mind and the eye are tricky things; the one can overwhelm the other pretty easily. perhaps i'm not looking for flaws critically enough most of the time ... i'm looking to see the photographs, not the dust spots or the bands or the other flaws. my assumption is that photos i see on the net are heavily de-rezzed, downsized representations of the original image; many kinds of flaws can arise from that process.", "sortedWord": "None", "identifyer": 26198, "year": "2015"}, {"Unnamed: 0": 413318, "autor": "Peter H", "date": 1448551440000, "content": "Yes, once you focus my eyes with words that lead their expectations, I see banding ... I see it now on almost everything, including the white background of the window. --img--  The mind and the eye are tricky things; the one can overwhelm the other pretty easily. Perhaps I'm not looking for flaws critically enough most of the time ... I'm looking to see the photographs, not the dust spots or the bands or the other flaws. My assumption is that photos I see on the net are heavily de-rezzed, downsized representations of the original image; many kinds of flaws can arise from that process. Well, this is making me sound as though I'm looking for faults. In photography, I strongly believe that the quality of the photograph consists 99% in the creative imagination of the photographer, and that a iPhone or Brownie is as capable of producing a brilliant, stunning, moving photo as anything, given the inspiration in the first place. In fact I complain regularly about the over-emphasis on gear as opposed to photography in this whole forum, and I still feel the same way. But when we're specifically looking at threads from a brand new camera and we're interested in how it performs (otherwise why the specific thread?), and when something is visible in the photos which shouldn't be there, (not on the background screen, by the way, and not in most photos) it's worth asking whether the new camera is the cause, even though it is in all probability not the cause.", "link": "https://www.l-camera-forum.com/topic/253192-leica-sl-image-thread-post-your-examples-here/page/8/?tab=comments#comment-2937340", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "yes, once you focus my eyes with words that lead their expectations, i see banding ... i see it now on almost everything, including the white background of the window. --img--  the mind and the eye are tricky things; the one can overwhelm the other pretty easily. perhaps i'm not looking for flaws critically enough most of the time ... i'm looking to see the photographs, not the dust -----> spots !!!  or the bands or the other flaws. my assumption is that photos i see on the net are heavily de-rezzed, downsized representations of the original image; many kinds of flaws can arise from that process. well, this is making me sound as though i'm looking for faults. in photography, i strongly believe that the quality of the photograph consists 99% in the creative imagination of the photographer, and that a iphone or brownie is as capable of producing a brilliant, stunning, moving photo as anything, given the inspiration in the first place. in fact i complain regularly about the over-emphasis on gear as opposed to photography in this whole forum, and i still feel the same way. but when we're specifically looking at threads from a brand new camera and we're interested in how it performs (otherwise why the specific thread?), and when something is visible in the photos which shouldn't be there, (not on the background screen, by the way, and not in most photos) it's worth asking whether the new camera is the cause, even though it is in all probability not the cause.", "sortedWord": "None", "identifyer": 26200, "year": "2015"}, {"Unnamed: 0": 413319, "autor": "ramarren", "date": 1448555160000, "content": "Well, this is making me sound as though I'm looking for faults. In photography, I strongly believe that the quality of the photograph consists 99% in the creative imagination of the photographer, and that a iPhone or Brownie is as capable of producing a brilliant, stunning, moving photo as anything, given the inspiration in the first place. In fact I complain regularly about the over-emphasis on gear as opposed to photography in this whole forum, and I still feel the same way. But when we're specifically looking at threads from a brand new camera and we're interested in how it performs (otherwise why the specific thread?), and when something is visible in the photos which shouldn't be there, (not on the background screen, by the way, and not in most photos) it's worth asking whether the new camera is the cause, even though it is in all probability not the cause. You seem to want to take my statements personally, as if I'm trying to find fault with you or someone else. Please don't assume that; I'm not. For me, posting examples and viewing examples posted by others isn't a matter of trying to determine a camera's performance or ascertain its flaws. I participate to see how others are using the camera, discovering how it works, or seeing what different lenses they use on it—an opportunity to ask how they feel the lens performs if I have one or am interested in obtaining one. When I make a statement like: Perhaps I'm not looking for flaws critically enough most of the time ... I'm looking to see the photographs, not the dust spots or the bands or the other flaws. My assumption is that photos I see on the net are heavily de-rezzed, downsized representations of the original image; many kinds of flaws can arise from that process. I'm questioning my perceptions and assumptions, not yours, in the hope of obtaining input into whether I'm looking at things in an appropriate way. I've only very rarely found that posted photos on-line give me much insight into the performance of a camera, or useful information about its potential flaws, unless the posted photo illustrates a point or a question being referred to in accompanying text very clearly.", "link": "https://www.l-camera-forum.com/topic/253192-leica-sl-image-thread-post-your-examples-here/page/8/?tab=comments#comment-2937387", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "well, this is making me sound as though i'm looking for faults. in photography, i strongly believe that the quality of the photograph consists 99% in the creative imagination of the photographer, and that a iphone or brownie is as capable of producing a brilliant, stunning, moving photo as anything, given the inspiration in the first place. in fact i complain regularly about the over-emphasis on gear as opposed to photography in this whole forum, and i still feel the same way. but when we're specifically looking at threads from a brand new camera and we're interested in how it performs (otherwise why the specific thread?), and when something is visible in the photos which shouldn't be there, (not on the background screen, by the way, and not in most photos) it's worth asking whether the new camera is the cause, even though it is in all probability not the cause. you seem to want to take my statements personally, as if i'm trying to find fault with you or someone else. please don't assume that; i'm not. for me, posting examples and viewing examples posted by others isn't a matter of trying to determine a camera's performance or ascertain its flaws. i participate to see how others are using the camera, discovering how it works, or seeing what different lenses they use on it—an opportunity to ask how they feel the lens performs if i have one or am interested in obtaining one. when i make a statement like: perhaps i'm not looking for flaws critically enough most of the time ... i'm looking to see the photographs, not the dust -----> spots !!!  or the bands or the other flaws. my assumption is that photos i see on the net are heavily de-rezzed, downsized representations of the original image; many kinds of flaws can arise from that process. i'm questioning my perceptions and assumptions, not yours, in the hope of obtaining input into whether i'm looking at things in an appropriate way. i've only very rarely found that posted photos on-line give me much insight into the performance of a camera, or useful information about its potential flaws, unless the posted photo illustrates a point or a question being referred to in accompanying text very clearly.", "sortedWord": "None", "identifyer": 26201, "year": "2015"}, {"Unnamed: 0": 415229, "autor": "trond", "date": 1448350500000, "content": " Dear Leica Forum friends! As far as I can find out, unlike the M and S cameras, the SL does not have the possibility of specifying the folder name on the SD card. This is a pity, as it is a useful feature that I have used on the M P 240. But what is worse, and quite unorthodox, is that the SL increments the folder number every time the SD card is formatted in the camera, at least my SL does so. Meaning that if you have a shoot and have just imported your images, and the last one i L1000367, and you format the card in the SL, the next image becomes L1010368. If you then format again, the next image will be L1020369. I am surprised why this behavior was not spotted by the beta reviewers, and if it was, why Leica did not correct this strange numbering scheme in the first \"production\" fimware? Anyone else seen this or is it just my camera? Is there a setting to avoid this? Resetting the numbering, sets the first image number to L1000001, which is not a good idea either. Best regards Trond Edited November 24, 2015 by trond", "link": "https://www.l-camera-forum.com/topic/253547-sl-image-numbering/?tab=comments#comment-2935810", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": " dear leica forum friends! as far as i can find out, unlike the m and s cameras, the sl does not have the possibility of specifying the folder name on the sd card. this is a pity, as it is a useful feature that i have used on the m p 240. but what is worse, and quite unorthodox, is that the sl increments the folder number every time the sd card is formatted in the camera, at least my sl does so. meaning that if you have a shoot and have just imported your images, and the last one i l1000367, and you format the card in the sl, the next image becomes l1010368. if you then format again, the next image will be l1020369. i am surprised why this behavior was not -----> spotted !!!  by the beta reviewers, and if it was, why leica did not correct this strange numbering scheme in the first \"production\" fimware? anyone else seen this or is it just my camera? is there a setting to avoid this? resetting the numbering, sets the first image number to l1000001, which is not a good idea either. best regards trond edited november 24, 2015 by trond", "sortedWord": "None", "identifyer": 28166, "year": "2015"}, {"Unnamed: 0": 439212, "autor": "Photon42", "date": 1435125420000, "content": "Here's another close-up for sharpness. The gentleman of the press was originally framed at 35mm, but the crop is removed to show the extent of the close-up. Leica lettering clearly legible. ISO 100, F/1.7 1/250 OIS on. Do I spot a film Nikon (FM/E style) hanging from his neck?", "link": "https://www.l-camera-forum.com/topic/269530-leica-q-the-image-thread/page/6/?tab=comments#comment-2841365", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "here's another close-up for sharpness. the gentleman of the press was originally framed at 35mm, but the crop is removed to show the extent of the close-up. leica lettering clearly legible. iso 100, f/1.7 1/250 ois on. do i -----> spot !!!  a film nikon (fm/e style) hanging from his neck?", "sortedWord": "None", "identifyer": 52509, "year": "2015"}, {"Unnamed: 0": 439233, "autor": "algrove", "date": 1435345620000, "content": " First try-Macro, hand held, manual focus, spot --img--  Edited June 26, 2015 by algrove", "link": "https://www.l-camera-forum.com/topic/269530-leica-q-the-image-thread/page/8/?tab=comments#comment-2842919", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " first try-macro, hand held, manual focus, -----> spot !!!  --img--  edited june 26, 2015 by algrove", "sortedWord": "None", "identifyer": 52532, "year": "2015"}, {"Unnamed: 0": 439235, "autor": "sls", "date": 1435365360000, "content": "I was listening to some music and thought I'd test the ISO performance as my audio as it is in low light or complete darkness. It is lit directly from above with three small spot lights, no other light sources, the shadow line is quite clear and there is little reflected light. The auto setting was ISO 1250 f/1.7 1/60 I then reset to ISO 12500 f/5.0 1/60 I pulled out the shadows by +66 (in Lightroom 6) on both images I'm reasonably impressed, but the last image with noise reduction loses all the detail in the shadows. The original image: --img--  Crop of original at ISO 1250 --img--  Reset to ISO 12500 --img--  Reset to ISO 12500 with Noise reduction luminance set to 75 --img--  Edited June 27, 2015 by sls", "link": "https://www.l-camera-forum.com/topic/269530-leica-q-the-image-thread/page/8/?tab=comments#comment-2843038", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i was listening to some music and thought i'd test the iso performance as my audio as it is in low light or complete darkness. it is lit directly from above with three small -----> spot !!!  lights, no other light sources, the shadow line is quite clear and there is little reflected light. the auto setting was iso 1250 f/1.7 1/60 i then reset to iso 12500 f/5.0 1/60 i pulled out the shadows by +66 (in lightroom 6) on both images i'm reasonably impressed, but the last image with noise reduction loses all the detail in the shadows. the original image: --img--  crop of original at iso 1250 --img--  reset to iso 12500 --img--  reset to iso 12500 with noise reduction luminance set to 75 --img--  edited june 27, 2015 by sls", "sortedWord": "None", "identifyer": 52534, "year": "2015"}, {"Unnamed: 0": 439351, "autor": "piran", "date": 1436981880000, "content": " Blomst, cropped 2403x1602 Almost 3D! Curious to know... did you spot AF target the really tiny tops of the stamens or manually focus same or its the best out of a whole bunch of attempts? Any EXIF data and/or lighting arrangement? The answer I'm really hoping for is that the Q's spot AF target acquisition focussing system is really this good:-)", "link": "https://www.l-camera-forum.com/topic/269530-leica-q-the-image-thread/page/14/?tab=comments#comment-2854783", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " blomst, cropped 2403x1602 almost 3d! curious to know... did you -----> spot !!!  af target the really tiny tops of the stamens or manually focus same or its the best out of a whole bunch of attempts? any exif data and/or lighting arrangement? the answer i'm really hoping for is that the q's spot af target acquisition focussing system is really this good:-)", "sortedWord": "None", "identifyer": 52658, "year": "2015"}, {"Unnamed: 0": 439352, "autor": "BJN", "date": 1436985000000, "content": "Almost 3D! Curious to know... did you spot AF target the really tiny tops of the stamens or manually focus same or its the best out of a whole bunch of attempts? Any EXIF data and/or lighting arrangement? The answer I'm really hoping for is that the Q's spot AF target acquisition focussing system is really this good:-) Autofocus using spot 1/200 sec. f/2,8 (macro) I focussed on the tips and it \"just works\" I took another shot at the the base of the tips and that focussed ok as well. Only used 2 frames", "link": "https://www.l-camera-forum.com/topic/269530-leica-q-the-image-thread/page/14/?tab=comments#comment-2854829", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "almost 3d! curious to know... did you -----> spot !!!  af target the really tiny tops of the stamens or manually focus same or its the best out of a whole bunch of attempts? any exif data and/or lighting arrangement? the answer i'm really hoping for is that the q's spot af target acquisition focussing system is really this good:-) autofocus using spot 1/200 sec. f/2,8 (macro) i focussed on the tips and it \"just works\" i took another shot at the the base of the tips and that focussed ok as well. only used 2 frames", "sortedWord": "None", "identifyer": 52659, "year": "2015"}, {"Unnamed: 0": 439392, "autor": "barjohn", "date": 1437441600000, "content": "Living at the beach makes it my street so here is a street shot from today with subject walking toward me and me walking toward subject. AF was very quick and spot on! --img-- ", "link": "https://www.l-camera-forum.com/topic/269530-leica-q-the-image-thread/page/16/?tab=comments#comment-2858032", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "living at the beach makes it my street so here is a street shot from today with subject walking toward me and me walking toward subject. af was very quick and -----> spot !!!  on! --img-- ", "sortedWord": "None", "identifyer": 52707, "year": "2015"}, {"Unnamed: 0": 439394, "autor": "vikasmg", "date": 1437464520000, "content": "Living at the beach makes it my street so here is a street shot from today with subject walking toward me and me walking toward subject. AF was very quick and spot on! I assume you were walking forward a lot faster than the subject so that's quite an amazing shot :-|", "link": "https://www.l-camera-forum.com/topic/269530-leica-q-the-image-thread/page/16/?tab=comments#comment-2858141", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "living at the beach makes it my street so here is a street shot from today with subject walking toward me and me walking toward subject. af was very quick and -----> spot !!!  on! i assume you were walking forward a lot faster than the subject so that's quite an amazing shot :-|", "sortedWord": "None", "identifyer": 52709, "year": "2015"}, {"Unnamed: 0": 442178, "autor": "piran", "date": 1442242920000, "content": "Yes, the white spots look like what 'grows' after a heavy push particularly with a high ISO original frame but 1600 is NOT high! I can put your DNG file through what I use here (SilkyPIX and Capture One) if that is of any help to you? I don't use LR.", "link": "https://www.l-camera-forum.com/topic/250077-white-pixels-issue/?tab=comments#comment-2887824", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "yes, the white -----> spots !!!  look like what 'grows' after a heavy push particularly with a high iso original frame but 1600 is not high! i can put your dng file through what i use here (silkypix and capture one) if that is of any help to you? i don't use lr.", "sortedWord": "None", "identifyer": 5529, "year": "2015"}, {"Unnamed: 0": 442181, "autor": "wda", "date": 1442243940000, "content": "I don't have a Q but I do believe the spots and other noise stem from post-processing a possibly under-exposed shot. Return to LR and select Develop module > Lightroom General Presets >Zeroed.Now look at the Histogram in LR and assess whether exposure is accurate or not. Be careful with shadow adjustments. Explore how far you can go before white spots appear. If your exposure was good, then maybe there is another cause unrelated to processing. If it was not good, try noise reduction in the Develop module.", "link": "https://www.l-camera-forum.com/topic/250077-white-pixels-issue/?tab=comments#comment-2887835", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i don't have a q but i do believe the -----> spots !!!  and other noise stem from post-processing a possibly under-exposed shot. return to lr and select develop module > lightroom general presets >zeroed.now look at the histogram in lr and assess whether exposure is accurate or not. be careful with shadow adjustments. explore how far you can go before white spots appear. if your exposure was good, then maybe there is another cause unrelated to processing. if it was not good, try noise reduction in the develop module.", "sortedWord": "None", "identifyer": 5532, "year": "2015"}, {"Unnamed: 0": 449266, "autor": "goatsby", "date": 1436014200000, "content": "Yeah, the RAW files can be pretty unexciting, but where you will see the X2 shine is in the latitude of the files. The highlights and shadows will hold more data than the DLUX, and most other parameters can be changed without degrading the image. Give it some time and get used to the camera, the X series takes a little getting used to before finding the sweet spot.", "link": "https://www.l-camera-forum.com/topic/247298-x2image-quality/?tab=comments#comment-2847429", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "yeah, the raw files can be pretty unexciting, but where you will see the x2 shine is in the latitude of the files. the highlights and shadows will hold more data than the dlux, and most other parameters can be changed without degrading the image. give it some time and get used to the camera, the x series takes a little getting used to before finding the sweet -----> spot !!! .", "sortedWord": "None", "identifyer": 12756, "year": "2015"}, {"Unnamed: 0": 449280, "autor": "Trivette", "date": 1442102760000, "content": "I wonder if there could be focus problems. I don't trust 11 point and always use 1 point, spot, or manual. Also, my X2 has some extra mass with a lens tube, hood, handgrip, and EVF; so it's a little easier to keep steady when hand holding. The few blurry shots I get are entirely my fault. Sometimes I'm almost blown away by the apparent sharpness. It compares favorably with the ultra sharp Summicron 50/2 with film on an M2 or M6.", "link": "https://www.l-camera-forum.com/topic/247298-x2image-quality/?tab=comments#comment-2887083", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i wonder if there could be focus problems. i don't trust 11 point and always use 1 point, -----> spot !!! , or manual. also, my x2 has some extra mass with a lens tube, hood, handgrip, and evf; so it's a little easier to keep steady when hand holding. the few blurry shots i get are entirely my fault. sometimes i'm almost blown away by the apparent sharpness. it compares favorably with the ultra sharp summicron 50/2 with film on an m2 or m6.", "sortedWord": "None", "identifyer": 12770, "year": "2015"}, {"Unnamed: 0": 449337, "autor": "flyalf", "date": 1447522200000, "content": "Many thanks for you kind feedback. Yes, all Roma and Amalfi shots were taken with the X1, most with a OVF attached. @ramarren: Thanks. I lust for a X113. The MF implementation looks spot on. I could wish for even higher resolution crammed into a X1/X2 body --img--  . But the X113 is a very desirable camera. Please also see from my hometown; http://www.l-camera-forum.com/topic/253045-blue-is-the-new-white/", "link": "https://www.l-camera-forum.com/topic/245627-can-the-x1-replace-my-m-as-travel-camera-for-street-people/?tab=comments#comment-2928398", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "many thanks for you kind feedback. yes, all roma and amalfi shots were taken with the x1, most with a ovf attached. @ramarren: thanks. i lust for a x113. the mf implementation looks -----> spot !!!  on. i could wish for even higher resolution crammed into a x1/x2 body --img--  . but the x113 is a very desirable camera. please also see from my hometown; http://www.l-camera-forum.com/topic/253045-blue-is-the-new-white/", "sortedWord": "None", "identifyer": 12827, "year": "2015"}, {"Unnamed: 0": 449466, "autor": "ReturningToFilm", "date": 1446071340000, "content": "Thanks everyone. I'm on holiday this week, once back I need to get an X in my hands to see how it feels and probably also feel a Q and also a Fuji xe2 with the fujinon 23 f1.4 lens to get a comparison....really looks like the X is in prime spot at the moment.", "link": "https://www.l-camera-forum.com/topic/252171-thoughts-on-x-typ113-as-digital-alternative-to-m4/?tab=comments#comment-2915946", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thanks everyone. i'm on holiday this week, once back i need to get an x in my hands to see how it feels and probably also feel a q and also a fuji xe2 with the fujinon 23 f1.4 lens to get a comparison....really looks like the x is in prime -----> spot !!!  at the moment.", "sortedWord": "None", "identifyer": 12957, "year": "2015"}, {"Unnamed: 0": 449467, "autor": "asiafish", "date": 1446071880000, "content": "Thanks everyone. I'm on holiday this week, once back I need to get an X in my hands to see how it feels and probably also feel a Q and also a Fuji xe2 with the fujinon 23 f1.4 lens to get a comparison....really looks like the X is in prime spot at the moment. I'd rather own the Q, but at that price (or even at retail) its hard to justify it over the X.", "link": "https://www.l-camera-forum.com/topic/252171-thoughts-on-x-typ113-as-digital-alternative-to-m4/?tab=comments#comment-2915956", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thanks everyone. i'm on holiday this week, once back i need to get an x in my hands to see how it feels and probably also feel a q and also a fuji xe2 with the fujinon 23 f1.4 lens to get a comparison....really looks like the x is in prime -----> spot !!!  at the moment. i'd rather own the q, but at that price (or even at retail) its hard to justify it over the x.", "sortedWord": "None", "identifyer": 12958, "year": "2015"}, {"Unnamed: 0": 449489, "autor": "TMorita", "date": 1445775840000, "content": "Agree the X1/2/E is a lot smaller than the Typ 113. There's a lot to be said for having a compact take anywhere camera. I find the D-Lux 5 is handy -- but APS sensor does make a difference to IQ. Main question perhaps is what lens do you use most? Would f/2.8 be fast enough? Do you really need a zoom? Toshi, that's a wild coast! Whereabouts? They're various spots on the Northern California coast. All between Monterey and Pacifica, inclusive. Toshi", "link": "https://www.l-camera-forum.com/topic/251580-pocket-size-perfection/?tab=comments#comment-2913239", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "agree the x1/2/e is a lot smaller than the typ 113. there's a lot to be said for having a compact take anywhere camera. i find the d-lux 5 is handy -- but aps sensor does make a difference to iq. main question perhaps is what lens do you use most? would f/2.8 be fast enough? do you really need a zoom? toshi, that's a wild coast! whereabouts? they're various -----> spots !!!  on the northern california coast. all between monterey and pacifica, inclusive. toshi", "sortedWord": "None", "identifyer": 12980, "year": "2015"}, {"Unnamed: 0": 450053, "autor": "Don Morley", "date": 1427451660000, "content": " Other manufacturers' products have also been introduced with faults which should have been sorted pre-launch e.g. Nikon's D600 and D750. I recently listened at length to a professional press photographer who was unhappy with his D750's flare problem. dunk Yes that is true, but by model numbers rare and they have or are sorting things quickly, whereas it has almost become the norm for Leica to launch with what turn out to be quickly spotted problems that then take FAR too long for the company to do anything about. Don", "link": "https://www.l-camera-forum.com/topic/236646-is-leica-discontinuing-the-x-vario/page/3/?tab=comments#comment-2787902", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": " other manufacturers' products have also been introduced with faults which should have been sorted pre-launch e.g. nikon's d600 and d750. i recently listened at length to a professional press photographer who was unhappy with his d750's flare problem. dunk yes that is true, but by model numbers rare and they have or are sorting things quickly, whereas it has almost become the norm for leica to launch with what turn out to be quickly -----> spotted !!!  problems that then take far too long for the company to do anything about. don", "sortedWord": "None", "identifyer": 13544, "year": "2015"}, {"Unnamed: 0": 450054, "autor": "dkCambridgeshire", "date": 1427452800000, "content": "Yes that is true, but by model numbers rare and they have or are sorting things quickly, whereas it has almost become the norm for Leica to launch with what turn out to be quickly spotted problems that then take FAR too long for the company to do anything about. Don Yes that's true … but Leica does not have the resources and economies of scale to remedy problems as quickly as Nikon and Canon. Hopefully the situation will improve now that the new factory is operational. dunk", "link": "https://www.l-camera-forum.com/topic/236646-is-leica-discontinuing-the-x-vario/page/3/?tab=comments#comment-2787908", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "yes that is true, but by model numbers rare and they have or are sorting things quickly, whereas it has almost become the norm for leica to launch with what turn out to be quickly -----> spotted !!!  problems that then take far too long for the company to do anything about. don yes that's true … but leica does not have the resources and economies of scale to remedy problems as quickly as nikon and canon. hopefully the situation will improve now that the new factory is operational. dunk", "sortedWord": "None", "identifyer": 13545, "year": "2015"}, {"Unnamed: 0": 450210, "autor": "2wk", "date": 1426446000000, "content": "I would say x1 too. I think 12mp is the sweet spot for that sensor. Plus the design of the camera body is much nicer without the hot shoe hump.", "link": "https://www.l-camera-forum.com/topic/242281-should-i-buy-an-x1-or-2/?tab=comments#comment-2781263", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i would say x1 too. i think 12mp is the sweet -----> spot !!!  for that sensor. plus the design of the camera body is much nicer without the hot shoe hump.", "sortedWord": "None", "identifyer": 13703, "year": "2015"}, {"Unnamed: 0": 450228, "autor": "bernie.lcf", "date": 1429533840000, "content": "The optical X2 viewfinder is excellent. The X2 originally cost £1450 in the UK but now can be bought new for just under £1000. The VF costs about £200 Using the optical finder you can switch off the screen if you wish. Brightline Viewfinder 36mm for Leica X1 and X2, Ref. 18707 280,- (Pound Sterling) I should like to ask is there anyone on the forum who has changed from a Fuji X100 to a Leica ( that is to say an X1 or 2.) Whilst the X100 is a first class camera I have never really liked it. Far too many variables to adjust. I fancy the idea of the add on optical viewfinder and forgetting all the electronic variations. In other words mimicking a film camera! Am I right or is it a silly thought! Yes, I have been there: X100, X100s, X-Pro1, X-E1 and X-T1 I once had a Leica M8.2 and sold it in preparation of upgrading to the M9. However, this was during the time when Leica had a 6 months or so delivery time and I gave up waiting and got distracted by a series of Japanese cameras including the Fujis. Should not have sold that M8.2 because it must have taken me 4 or so years to make a roundtrip back to the M8.2. The Fujis (X-Trans or not) are not bad cameras, but the 23mm Fujinon f2.0 lens is easily beaten by the X1/X2 Elmarit 24/2.8. There are three generations of X100 cameras and Fuji has never changed the lens except for introducing 1/3 aperture clicks on the latest X100t model. The major weak spot of the Fujinon is close up performance wide open where it will show a (IMHO) rubbish image which Fuji people call \"dreamy character\". The X1 and X2 cameras are well suited for use with an optical viewfinder because the screen can be configured to stay off and there is a green LED that will be visible in the corner of our eye (while looking through the optical viewfinder) and that will signal AF lock on. Obviously, you'd either shoot hyperfocal or use the 11 point AF/face detection... although it is not too difficult to guess where the 1 spot AF area is in the optical viewfinder. I suggest buying the Leica Brightline viewfinder because it is better than most of the other third party viewfinders (much better than the Olympus VF1, better than the Voigtländer viewfinders). People have argued back and forth between the Leica X1 and the X100 back in their times. I will agree that the X100 hybrid viewfinder is a nice piece of technology, bet let's take a more detailed look at this: what exactly do you need to see in your viewfinder while composing with a fixed focal length camera like the Leica X1/X2? - aperture will be on the Leica's dedicated wheel - shutter speed is nice, but auto ISO will eliminate the need to see this - battery, image no., etc.- not while I am composing The only thing I'd probably miss is the EV value if I used it often (which I don't). Everything else is either a distraction or only required because there is a feature behind it (DR enhancement, etc.).", "link": "https://www.l-camera-forum.com/topic/242281-should-i-buy-an-x1-or-2/page/2/?tab=comments#comment-2801611", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the optical x2 viewfinder is excellent. the x2 originally cost £1450 in the uk but now can be bought new for just under £1000. the vf costs about £200 using the optical finder you can switch off the screen if you wish. brightline viewfinder 36mm for leica x1 and x2, ref. 18707 280,- (pound sterling) i should like to ask is there anyone on the forum who has changed from a fuji x100 to a leica ( that is to say an x1 or 2.) whilst the x100 is a first class camera i have never really liked it. far too many variables to adjust. i fancy the idea of the add on optical viewfinder and forgetting all the electronic variations. in other words mimicking a film camera! am i right or is it a silly thought! yes, i have been there: x100, x100s, x-pro1, x-e1 and x-t1 i once had a leica m8.2 and sold it in preparation of upgrading to the m9. however, this was during the time when leica had a 6 months or so delivery time and i gave up waiting and got distracted by a series of japanese cameras including the fujis. should not have sold that m8.2 because it must have taken me 4 or so years to make a roundtrip back to the m8.2. the fujis (x-trans or not) are not bad cameras, but the 23mm fujinon f2.0 lens is easily beaten by the x1/x2 elmarit 24/2.8. there are three generations of x100 cameras and fuji has never changed the lens except for introducing 1/3 aperture clicks on the latest x100t model. the major weak -----> spot !!!  of the fujinon is close up performance wide open where it will show a (imho) rubbish image which fuji people call \"dreamy character\". the x1 and x2 cameras are well suited for use with an optical viewfinder because the screen can be configured to stay off and there is a green led that will be visible in the corner of our eye (while looking through the optical viewfinder) and that will signal af lock on. obviously, you'd either shoot hyperfocal or use the 11 point af/face detection... although it is not too difficult to guess where the 1 spot af area is in the optical viewfinder. i suggest buying the leica brightline viewfinder because it is better than most of the other third party viewfinders (much better than the olympus vf1, better than the voigtländer viewfinders). people have argued back and forth between the leica x1 and the x100 back in their times. i will agree that the x100 hybrid viewfinder is a nice piece of technology, bet let's take a more detailed look at this: what exactly do you need to see in your viewfinder while composing with a fixed focal length camera like the leica x1/x2? - aperture will be on the leica's dedicated wheel - shutter speed is nice, but auto iso will eliminate the need to see this - battery, image no., etc.- not while i am composing the only thing i'd probably miss is the ev value if i used it often (which i don't). everything else is either a distraction or only required because there is a feature behind it (dr enhancement, etc.).", "sortedWord": "None", "identifyer": 13721, "year": "2015"}, {"Unnamed: 0": 450265, "autor": "jlindstrom", "date": 1429338000000, "content": "I'm sure the D-Lux doesn't have image quality issues per se, I just disagreed with it bettering the XV's. The XV evf is definitely antique, but it does it's job quite well and in practise it doesn't cause any grief from quality of view point. The lack of eyelevel sensor is at times annoying, but one gets used to it quite fast. Also when shooting it doesn't bother at all, since you use it always anyway and thus no constant changing. The lack of firmware updates doesn't really concern me, as the camera is already so good. Some things naturally could be updated, but I seriously doubt they could do anything more to AF as that's more likely just limited by hardware and most of the time works just fine in 1-spot mode, which is what I always use on any camera anyway. The auto-iso view could be nice, but it's definitely one of those 'nice to have' things. I've just set my auto-iso limits I can live with and for the rest I don't care. So yeah, there are things/issues but in practise those dissapear as the camera is intuitive to use, has excellent image quality and just doesn't get in the way of your shooting. //Juha", "link": "https://www.l-camera-forum.com/topic/243735-x-vario-or-d-lux-109/?tab=comments#comment-2800188", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i'm sure the d-lux doesn't have image quality issues per se, i just disagreed with it bettering the xv's. the xv evf is definitely antique, but it does it's job quite well and in practise it doesn't cause any grief from quality of view point. the lack of eyelevel sensor is at times annoying, but one gets used to it quite fast. also when shooting it doesn't bother at all, since you use it always anyway and thus no constant changing. the lack of firmware updates doesn't really concern me, as the camera is already so good. some things naturally could be updated, but i seriously doubt they could do anything more to af as that's more likely just limited by hardware and most of the time works just fine in 1------> spot !!!  mode, which is what i always use on any camera anyway. the auto-iso view could be nice, but it's definitely one of those 'nice to have' things. i've just set my auto-iso limits i can live with and for the rest i don't care. so yeah, there are things/issues but in practise those dissapear as the camera is intuitive to use, has excellent image quality and just doesn't get in the way of your shooting. //juha", "sortedWord": "None", "identifyer": 13758, "year": "2015"}, {"Unnamed: 0": 450390, "autor": "Don Morley", "date": 1428788820000, "content": "Maybe I have been lucky but although my X-Vario also misses focus occasionally 99.95% of the time it gets it right, and single spot focussing seems to work best, but if I ever have any doubt I switch over to manual which really does work superbly and is almost as fast to use and get right as the rangefinder on my M240's. All in all this is rapidly becoming my all time favorit camera. Don --img-- ", "link": "https://www.l-camera-forum.com/topic/229315-x-vario-af-unreliability/page/2/?tab=comments#comment-2796396", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "maybe i have been lucky but although my x-vario also misses focus occasionally 99.95% of the time it gets it right, and single -----> spot !!!  focussing seems to work best, but if i ever have any doubt i switch over to manual which really does work superbly and is almost as fast to use and get right as the rangefinder on my m240's. all in all this is rapidly becoming my all time favorit camera. don --img-- ", "sortedWord": "None", "identifyer": 13883, "year": "2015"}, {"Unnamed: 0": 450391, "autor": "asiafish", "date": 1428891240000, "content": "Maybe I have been lucky but although my X-Vario also misses focus occasionally 99.95% of the time it gets it right, and single spot focussing seems to work best, but if I ever have any doubt I switch over to manual which really does work superbly and is almost as fast to use and get right as the rangefinder on my M240's. All in all this is rapidly becoming my all time favorit camera. Don --img--  Me too. I own the X Vario and also the X (typ 113) and just sold my Nikon Df and lenses to fund an M-E to use alongside my M Monochrom and M5. Five Leicas, and while the cheapest of the digitals, the X Vario is the one that leaves the house with me on most days.", "link": "https://www.l-camera-forum.com/topic/229315-x-vario-af-unreliability/page/2/?tab=comments#comment-2797112", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "maybe i have been lucky but although my x-vario also misses focus occasionally 99.95% of the time it gets it right, and single -----> spot !!!  focussing seems to work best, but if i ever have any doubt i switch over to manual which really does work superbly and is almost as fast to use and get right as the rangefinder on my m240's. all in all this is rapidly becoming my all time favorit camera. don --img--  me too. i own the x vario and also the x (typ 113) and just sold my nikon df and lenses to fund an m-e to use alongside my m monochrom and m5. five leicas, and while the cheapest of the digitals, the x vario is the one that leaves the house with me on most days.", "sortedWord": "None", "identifyer": 13884, "year": "2015"}, {"Unnamed: 0": 450392, "autor": "dunos", "date": 1429042380000, "content": "My X Vario misses focus from time to time as described in various threads on the forum. It is annoying when it happens because I presume I got the shot but after downloading it I realise I didn't. I mostly chalk this up to the difference between my old DSLR which was spot on when it came to auto focus, vs the kind of tech that the XV uses. It isn't the most annoying thing about the camera (I would like the camera not to auto-off or auto-snooze) but it is annoying when it happens (Under 5% of the time)", "link": "https://www.l-camera-forum.com/topic/229315-x-vario-af-unreliability/page/2/?tab=comments#comment-2798114", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my x vario misses focus from time to time as described in various threads on the forum. it is annoying when it happens because i presume i got the shot but after downloading it i realise i didn't. i mostly chalk this up to the difference between my old dslr which was -----> spot !!!  on when it came to auto focus, vs the kind of tech that the xv uses. it isn't the most annoying thing about the camera (i would like the camera not to auto-off or auto-snooze) but it is annoying when it happens (under 5% of the time)", "sortedWord": "None", "identifyer": 13885, "year": "2015"}, {"Unnamed: 0": 450524, "autor": "TK!", "date": 1424026320000, "content": "Yes, that's probably the whole story. After a quarter with the X whenever I get my X2 into the hands I think \"Wow, it's so small and lightweight\". Maybe the autofocus of the X is a little bit faster than the one from the X2 (Autofoucs \"spot\" never worked with my kids with the X2, with the X I get some good results). And of course you can do video with the X. And you can focus down to 20cm. But that's all the difference except the faster lens. Would be nice to find some comparison of image quality in the net. The sensor is the same but maybe the very huge lense procudes more crisp? At least I do not see any differences in the pics from X and X2. Even my images from the X1 are of the same very very good quality (The X1 has a very slow autofocus and an older sensor.) Any opinions concerning image quality of the Xes...? - TK", "link": "https://www.l-camera-forum.com/topic/241097-leica-x/?tab=comments#comment-2765129", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "yes, that's probably the whole story. after a quarter with the x whenever i get my x2 into the hands i think \"wow, it's so small and lightweight\". maybe the autofocus of the x is a little bit faster than the one from the x2 (autofoucs \"-----> spot !!! \" never worked with my kids with the x2, with the x i get some good results). and of course you can do video with the x. and you can focus down to 20cm. but that's all the difference except the faster lens. would be nice to find some comparison of image quality in the net. the sensor is the same but maybe the very huge lense procudes more crisp? at least i do not see any differences in the pics from x and x2. even my images from the x1 are of the same very very good quality (the x1 has a very slow autofocus and an older sensor.) any opinions concerning image quality of the xes...? - tk", "sortedWord": "None", "identifyer": 14017, "year": "2015"}, {"Unnamed: 0": 450892, "autor": "Keith (M)", "date": 1447847220000, "content": "Thank you, Richard. I would have preferred it if the balloons had been at a somewhat lower altitude but by the time I had spotted them and dashed to the river bank, they had climbed quite rapidly. Ce la vie and all that!", "link": "https://www.l-camera-forum.com/topic/237139-leica-c-images-post-them-here/page/7/?tab=comments#comment-2931182", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "thank you, richard. i would have preferred it if the balloons had been at a somewhat lower altitude but by the time i had -----> spotted !!!  them and dashed to the river bank, they had climbed quite rapidly. ce la vie and all that!", "sortedWord": "None", "identifyer": 14387, "year": "2015"}], "name": "spotL-Forum2015"}