{"interestingcomments": [{"Unnamed: 0": 369462, "autor": "jaapv", "date": 1295433720000, "content": "Ok. I just spoke to Mr. Jakob of Leica. Simple adjustment only costs under 100 Euro, normally 65 plus VAT. The price of 800 Euro would be a completely new viewfinder/rangefinder. Of course, as you have damaged the mechanism already, it might be a few Euros more, but not excessively so. If the camera is sent in for something else it will be done for free normally. I also did a quick spot check on a number of the recommended repair services here on the forum. All of those I called will do a RF adjustment on the M8/9 at prices quoted between 25 and 50 Euro approx. Edited January 19, 2011 by jaapv", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/6/?tab=comments#comment-1562825", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "ok. i just spoke to mr. jakob of leica. simple adjustment only costs under 100 euro, normally 65 plus vat. the price of 800 euro would be a completely new viewfinder/rangefinder. of course, as you have damaged the mechanism already, it might be a few euros more, but not excessively so. if the camera is sent in for something else it will be done for free normally. i also did a quick -----> spot !!!  check on a number of the recommended repair services here on the forum. all of those i called will do a rf adjustment on the m8/9 at prices quoted between 25 and 50 euro approx. edited january 19, 2011 by jaapv", "sortedWord": "None", "identifyer": 30759, "year": "2011"}, {"Unnamed: 0": 369466, "autor": "Jeff Laitila", "date": 1303288380000, "content": "I was having consistent back focus issues on my M9, and after reading this I tried the hex wrench adjustment and it worked like a charm. Just a slight adjustment, a check for infinity focus, and then slight more of adjustment and now focus is spot on now It's like I just got a whole new camera and set of lenses. Thank you so much for sharing this information! --img-- ", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/6/?tab=comments#comment-1650724", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i was having consistent back focus issues on my m9, and after reading this i tried the hex wrench adjustment and it worked like a charm. just a slight adjustment, a check for infinity focus, and then slight more of adjustment and now focus is -----> spot !!!  on now it's like i just got a whole new camera and set of lenses. thank you so much for sharing this information! --img-- ", "sortedWord": "None", "identifyer": 30763, "year": "2011"}, {"Unnamed: 0": 369468, "autor": "bab", "date": 1303328280000, "content": " This would be interesting if one knew for sure that the lens was not at fault as previously mentioned. I am hesitating to buy another lens without also buying another body because it is difficult to have one body and several lenses focusing spot on unless your using them on a daily basis. Having the ability to memorize the subtle corrections at varying focal distances. I find an underlying humor in the fact that Leica glass has so much hoopla on its bitter sharpness and yet the camera cant always find that bitter sharpness looking through the rangefinder or the fault maybe the user. If I were to use the camera system to make a living I would have several bodies and a single piece of glass dialed in for each body! Is there a way to focus the camera as accurately in a vertical position as in the horizontal. I seem to never be able to focus when my camera is in the vertical position/", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/7/?tab=comments#comment-1651293", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " this would be interesting if one knew for sure that the lens was not at fault as previously mentioned. i am hesitating to buy another lens without also buying another body because it is difficult to have one body and several lenses focusing -----> spot !!!  on unless your using them on a daily basis. having the ability to memorize the subtle corrections at varying focal distances. i find an underlying humor in the fact that leica glass has so much hoopla on its bitter sharpness and yet the camera cant always find that bitter sharpness looking through the rangefinder or the fault maybe the user. if i were to use the camera system to make a living i would have several bodies and a single piece of glass dialed in for each body! is there a way to focus the camera as accurately in a vertical position as in the horizontal. i seem to never be able to focus when my camera is in the vertical position/", "sortedWord": "None", "identifyer": 30765, "year": "2011"}, {"Unnamed: 0": 369469, "autor": "luuca", "date": 1303329120000, "content": "ok, I've done it. and now I'm in trouble --img--  the setting of the RF was simple thanks to this thread and now the focus is spot on with my summilux 50 from infinity to 1 m. the problem is that now the arm of the RF is not tighten, even if I tight as much as I can the screw \"A\" (see the pic of Julian Thompson http://www.l-camera-forum.com/leica-forum/attachments/leica-m9-forum/197740d1271168348-m9-coincidence-infinity-diagram.jpg)... it still have half a millimeter that let the arm move up and down the cause is not the position of the cam, because I tried to change it without any differences it seems the screw \"A\" is too long to tighten! what can it be? nothing that can avoid me to use the camera, but it's annoying... I'm sure before the arm was perfectly fixed Edited April 20, 2011 by luuca", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/7/?tab=comments#comment-1651303", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "ok, i've done it. and now i'm in trouble --img--  the setting of the rf was simple thanks to this thread and now the focus is -----> spot !!!  on with my summilux 50 from infinity to 1 m. the problem is that now the arm of the rf is not tighten, even if i tight as much as i can the screw \"a\" (see the pic of julian thompson http://www.l-camera-forum.com/leica-forum/attachments/leica-m9-forum/197740d1271168348-m9-coincidence-infinity-diagram.jpg)... it still have half a millimeter that let the arm move up and down the cause is not the position of the cam, because i tried to change it without any differences it seems the screw \"a\" is too long to tighten! what can it be? nothing that can avoid me to use the camera, but it's annoying... i'm sure before the arm was perfectly fixed edited april 20, 2011 by luuca", "sortedWord": "None", "identifyer": 30766, "year": "2011"}, {"Unnamed: 0": 369475, "autor": "bocaburger", "date": 1303336860000, "content": "ok, I've done it. and now I'm in trouble --img--  the setting of the RF was simple thanks to this thread and now the focus is spot on with my summilux 50 from infinity to 1 m. the problem is that now the arm of the RF is not tighten, even if I tight as much as I can the screw \"A\" (see the pic of Julian Thompson http://www.l-camera-forum.com/leica-forum/attachments/leica-m9-forum/197740d1271168348-m9-coincidence-infinity-diagram.jpg)... it still have half a millimeter that let the arm move up and down the cause is not the position of the cam, because I tried to change it without any differences it seems the screw \"A\" is too long to tighten! what can it be? nothing that can avoid me to use the camera, but it's annoying... I'm sure before the arm was perfectly fixed How much did you loosen the screw in the first place? All it needs is a 1/2 turn at most. If you backed it out too far you might have it cross-threaded now, which would account for why it would feel tight but stop well shy of locking the mechanism. Given the necessity of approaching with a driver on an angle, it's possible to do that. I don't have any M cameras here in my office so I can't take a look and see if there are other possibilities. You could try backing the screw out and re-tightening, being sure it's going on straight.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/7/?tab=comments#comment-1651427", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "ok, i've done it. and now i'm in trouble --img--  the setting of the rf was simple thanks to this thread and now the focus is -----> spot !!!  on with my summilux 50 from infinity to 1 m. the problem is that now the arm of the rf is not tighten, even if i tight as much as i can the screw \"a\" (see the pic of julian thompson http://www.l-camera-forum.com/leica-forum/attachments/leica-m9-forum/197740d1271168348-m9-coincidence-infinity-diagram.jpg)... it still have half a millimeter that let the arm move up and down the cause is not the position of the cam, because i tried to change it without any differences it seems the screw \"a\" is too long to tighten! what can it be? nothing that can avoid me to use the camera, but it's annoying... i'm sure before the arm was perfectly fixed how much did you loosen the screw in the first place? all it needs is a 1/2 turn at most. if you backed it out too far you might have it cross-threaded now, which would account for why it would feel tight but stop well shy of locking the mechanism. given the necessity of approaching with a driver on an angle, it's possible to do that. i don't have any m cameras here in my office so i can't take a look and see if there are other possibilities. you could try backing the screw out and re-tightening, being sure it's going on straight.", "sortedWord": "None", "identifyer": 30772, "year": "2011"}, {"Unnamed: 0": 369489, "autor": "kea_arty", "date": 1312561020000, "content": "It is really important. If the infinity is off then you can't truly evaluate focus elsewhere because the infinity is the 'reference' point. From this point the length of the roller cam arm itself determines how much the rangefinder patch moves as the lens rotates. In my experience of 5 digital M's (2 x M8.2 and 2 x M8 and 1 x M9) I have never had a camera with a spot on infinity/roller arm length combination from the factory, and have learned how to adjust them myself rather than send them back. If you don't want to touch it yourself then you'll have to bite the bullet and send it back to Leica for adjustment. Sorry its not better news! Totally agree with you. I will try to do it.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/8/?tab=comments#comment-1757550", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "it is really important. if the infinity is off then you can't truly evaluate focus elsewhere because the infinity is the 'reference' point. from this point the length of the roller cam arm itself determines how much the rangefinder patch moves as the lens rotates. in my experience of 5 digital m's (2 x m8.2 and 2 x m8 and 1 x m9) i have never had a camera with a -----> spot !!!  on infinity/roller arm length combination from the factory, and have learned how to adjust them myself rather than send them back. if you don't want to touch it yourself then you'll have to bite the bullet and send it back to leica for adjustment. sorry its not better news! totally agree with you. i will try to do it.", "sortedWord": "None", "identifyer": 30786, "year": "2011"}, {"Unnamed: 0": 369494, "autor": "bocaburger", "date": 1313419680000, "content": " Only do something if you notice a focussing problem in your photographs. If not, just forget about this. +1! I would check nearest-distance accuracy, and if it's ok, leave well enough alone. If near-distance is spot-on, it means the entire rangefinder is set up based on an infinity misadjustment, and adjusting just the infinity (2mm allen key) to get the images to coincide will throw the close setting (and everything in between) off.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/8/?tab=comments#comment-1766236", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " only do something if you notice a focussing problem in your photographs. if not, just forget about this. +1! i would check nearest-distance accuracy, and if it's ok, leave well enough alone. if near-distance is -----> spot !!! -on, it means the entire rangefinder is set up based on an infinity misadjustment, and adjusting just the infinity (2mm allen key) to get the images to coincide will throw the close setting (and everything in between) off.", "sortedWord": "None", "identifyer": 30791, "year": "2011"}, {"Unnamed: 0": 369495, "autor": "bbbonthemoon", "date": 1313494620000, "content": "+1! I would check nearest-distance accuracy, and if it's ok, leave well enough alone. If near-distance is spot-on, it means the entire rangefinder is set up based on an infinity misadjustment, and adjusting just the infinity (2mm allen key) to get the images to coincide will throw the close setting (and everything in between) off. hmm, Accoring to Julian Thompson posts at the beginning of the thread, close distance focus is usually OK when the infinity is off. Mid-range and the infinity itself is affected.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/8/?tab=comments#comment-1767139", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "+1! i would check nearest-distance accuracy, and if it's ok, leave well enough alone. if near-distance is -----> spot !!! -on, it means the entire rangefinder is set up based on an infinity misadjustment, and adjusting just the infinity (2mm allen key) to get the images to coincide will throw the close setting (and everything in between) off. hmm, accoring to julian thompson posts at the beginning of the thread, close distance focus is usually ok when the infinity is off. mid-range and the infinity itself is affected.", "sortedWord": "None", "identifyer": 30792, "year": "2011"}, {"Unnamed: 0": 369499, "autor": "SoarFM", "date": 1314993000000, "content": "Thank you Julien!! Just sat down with my M9-P that was of at infinity and the lenses where front-focusing. Took me about 1 hour, but now it's 99%. Have a 50 summilux on order so will wait and see how that looks ;o) If that one is off I might send in the kit anyway. But great to know how to make the rough adjustment yourself. Again thank you! +1 to Julian Focusing with my 50 Summicron was giving me fits with its backfocus. Never felt there was a problem with my M6, but then again, lots easier to get the immediate feedback when working digital. The 35 and 28 were less of a problem due to their shorter focal lengths. But I cycled them through my testing just to make sure it wasn't a faulty lens. I was dreading packing everything up and sending them off for service. I read through this thread multiple times, decided I could do this and promised myself I would stop if it didn't go as advertised, this is a skill well worth having. All went well, and I'm making adjustments that have gotten me almost to perfect. One more session it should be spot on. As an additional note, the slot on the screw was placed differently than shown on Julian's, a more favorable placement obviating the need to grind down the screwdriver.", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/8/?tab=comments#comment-1782952", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thank you julien!! just sat down with my m9-p that was of at infinity and the lenses where front-focusing. took me about 1 hour, but now it's 99%. have a 50 summilux on order so will wait and see how that looks ;o) if that one is off i might send in the kit anyway. but great to know how to make the rough adjustment yourself. again thank you! +1 to julian focusing with my 50 summicron was giving me fits with its backfocus. never felt there was a problem with my m6, but then again, lots easier to get the immediate feedback when working digital. the 35 and 28 were less of a problem due to their shorter focal lengths. but i cycled them through my testing just to make sure it wasn't a faulty lens. i was dreading packing everything up and sending them off for service. i read through this thread multiple times, decided i could do this and promised myself i would stop if it didn't go as advertised, this is a skill well worth having. all went well, and i'm making adjustments that have gotten me almost to perfect. one more session it should be -----> spot !!!  on. as an additional note, the slot on the screw was placed differently than shown on julian's, a more favorable placement obviating the need to grind down the screwdriver.", "sortedWord": "None", "identifyer": 30796, "year": "2011"}, {"Unnamed: 0": 371103, "autor": "250swb", "date": 1303763520000, "content": "But this is the M9 forum isn't it???? Yes, Leica spotted a way to screw things up with the M9, but even the M8 would benefit from being able to discharge a battery without rendering the camera unusable while doing so. Steve", "link": "https://www.l-camera-forum.com/topic/148213-non-leica-m9-battery-test/page/4/?tab=comments#comment-1655619", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "but this is the m9 forum isn't it???? yes, leica -----> spotted !!!  a way to screw things up with the m9, but even the m8 would benefit from being able to discharge a battery without rendering the camera unusable while doing so. steve", "sortedWord": "None", "identifyer": 32403, "year": "2011"}, {"Unnamed: 0": 371311, "autor": "BerndReini", "date": 1314545940000, "content": "You can generally do whatever you want. In film days, people would expose in a way that would give them the best negative for printing. Overexposing a negative to make it denser was really not something that real master photographers recommended. If you spot meter and get exactly the exposure you want to create the intended mood for the scene, it is better than to expose to the right - even though that might give you better SN ratio and luminous shadows. If you don't want those luminous shadows, it is better to get your mid-tones exactly where you want them to be. I usually want as much range as I can get out of a scene, so I do tend to expose to the right a lot, but that this has to be done with caution. Nothing worse than digital sunburn, I.e. When skin starts to be overexposed and takes on all kinds of funky colors, or even burns out to an ugly torn off white triangle. With negative, that gradual roll-off looks nice. It is unfortunately an area where digital still suffers. When it's gone, it's gone, and the image is lost. So expose to the right, yes, but be careful with it.", "link": "https://www.l-camera-forum.com/topic/159297-expose-to-the-right-ettr-or-underexpose/page/4/?tab=comments#comment-1777835", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "you can generally do whatever you want. in film days, people would expose in a way that would give them the best negative for printing. overexposing a negative to make it denser was really not something that real master photographers recommended. if you -----> spot !!!  meter and get exactly the exposure you want to create the intended mood for the scene, it is better than to expose to the right - even though that might give you better sn ratio and luminous shadows. if you don't want those luminous shadows, it is better to get your mid-tones exactly where you want them to be. i usually want as much range as i can get out of a scene, so i do tend to expose to the right a lot, but that this has to be done with caution. nothing worse than digital sunburn, i.e. when skin starts to be overexposed and takes on all kinds of funky colors, or even burns out to an ugly torn off white triangle. with negative, that gradual roll-off looks nice. it is unfortunately an area where digital still suffers. when it's gone, it's gone, and the image is lost. so expose to the right, yes, but be careful with it.", "sortedWord": "None", "identifyer": 32612, "year": "2011"}, {"Unnamed: 0": 376054, "autor": "andalus", "date": 1310664480000, "content": "Yes, I just shot an e mail to Solms to reserve a spot to have my M9 upgraded. I really want that clearer sapphire screen. I think it's worth the cost and warranty extension. Adds value to camera.", "link": "https://www.l-camera-forum.com/topic/155215-upgrade-m9-to-m9p-merged-thread/page/5/?tab=comments#comment-1734285", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "yes, i just shot an e mail to solms to reserve a -----> spot !!!  to have my m9 upgraded. i really want that clearer sapphire screen. i think it's worth the cost and warranty extension. adds value to camera.", "sortedWord": "None", "identifyer": 37362, "year": "2011"}, {"Unnamed: 0": 376057, "autor": "Peter H", "date": 1310672700000, "content": "Yes, I just shot an e mail to Solms to reserve a spot to have my M9 upgraded. I really want that clearer sapphire screen. I think it's worth the cost and warranty extension. Adds value to camera. You can be pretty certain it will add less value to your camera than the cost to you of the upgrade. Doesn't mean its bad value, but you will lose money on the deal (unless you need expensive repairs under the extended part of the warranty, but that calculation applies to all all kinds of insurance).", "link": "https://www.l-camera-forum.com/topic/155215-upgrade-m9-to-m9p-merged-thread/page/5/?tab=comments#comment-1734423", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "yes, i just shot an e mail to solms to reserve a -----> spot !!!  to have my m9 upgraded. i really want that clearer sapphire screen. i think it's worth the cost and warranty extension. adds value to camera. you can be pretty certain it will add less value to your camera than the cost to you of the upgrade. doesn't mean its bad value, but you will lose money on the deal (unless you need expensive repairs under the extended part of the warranty, but that calculation applies to all all kinds of insurance).", "sortedWord": "None", "identifyer": 37365, "year": "2011"}, {"Unnamed: 0": 376475, "autor": "menos I M6", "date": 1296968940000, "content": "… Maybe the designers did not make it a priority to make a short gap because they were designers, not photographers. Only a photographer would know how a perceptible pre-flash would ruin a shot. Let's face it, some genius designer came up with the utterly worthless red eye reduction! So here's my conclusion. If you need to shoot people photos with the M9 and flash on the camera and don't want to have them blinking, don't use TTL with the M9. Other techniques (off camera) and methods (auto mode) seem to work better. I'm just trying to put this out there so that when the next person finds this thread while trying to decide whether to buy this flash, and what it is capable of will have the information. I am not a guy who spends a lot of time reading or posting on forums, I just go when I need information. The TTL is not working for me. Whether it works for you depends on your expectations and the way you work. Mike Mike, I don't think, somebody let the intern design the Leica variant of TTL flashes or the cameras circuitry, to communicate. We are talking about Metz, a company, which does flash for quite a time and Leica, a renowned lens, camera and fashion maker, not Sony. The way, I see the lack in the Leica flashes, compared to Canon and Nikon products is just this: flash is an afterthought in development for the Leica M. Not the majority of Leica M users uses flash, if TTL flash at all. Flash has no priority. For Canon and Nikon, flash is essential. The pro cameras, which are sold to big extends to professional users as journalists, sports shooters and alike need the best performance out of strobes - there is a strong market need AND A RACE between the two companies, to improve their already market leading performance. Why should Leica pair with Metz and compete with the performance of Canon and Nikon with flash? It is not Leica's main market. That time was in the 50's. And even back then, the M was not the big rig, to shoot with bulbs (it could be done, and some did), but it's reason of being was small size, but excellent quality on the negative paired with simple operation. The people, who might want to use TTL flash opposed to manual or Auto flash want a quick shot, be it out of convenience or out of quick changing lighting conditions. It is like it is and the SF58 is the best solution, if one needs TTL on a Leica (the only others being a set of Metz items or the SF24D). I use Nikon and love the simple fully automated and spot on Nikon metering and TTL flash, when I want it (again: convenience for me) or the excellent ergonomics, when needed in manual modes (product shots). I bought the SF58, to expand the poor low light performance of the M8.2 sensor, to use lower ISO in very dark scenes. It does the job - sort of (still learning/ fighting).", "link": "https://www.l-camera-forum.com/topic/99414-reidreview-review-of-leica-sf58-flash-unit/page/8/?tab=comments#comment-1579602", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "… maybe the designers did not make it a priority to make a short gap because they were designers, not photographers. only a photographer would know how a perceptible pre-flash would ruin a shot. let's face it, some genius designer came up with the utterly worthless red eye reduction! so here's my conclusion. if you need to shoot people photos with the m9 and flash on the camera and don't want to have them blinking, don't use ttl with the m9. other techniques (off camera) and methods (auto mode) seem to work better. i'm just trying to put this out there so that when the next person finds this thread while trying to decide whether to buy this flash, and what it is capable of will have the information. i am not a guy who spends a lot of time reading or posting on forums, i just go when i need information. the ttl is not working for me. whether it works for you depends on your expectations and the way you work. mike mike, i don't think, somebody let the intern design the leica variant of ttl flashes or the cameras circuitry, to communicate. we are talking about metz, a company, which does flash for quite a time and leica, a renowned lens, camera and fashion maker, not sony. the way, i see the lack in the leica flashes, compared to canon and nikon products is just this: flash is an afterthought in development for the leica m. not the majority of leica m users uses flash, if ttl flash at all. flash has no priority. for canon and nikon, flash is essential. the pro cameras, which are sold to big extends to professional users as journalists, sports shooters and alike need the best performance out of strobes - there is a strong market need and a race between the two companies, to improve their already market leading performance. why should leica pair with metz and compete with the performance of canon and nikon with flash? it is not leica's main market. that time was in the 50's. and even back then, the m was not the big rig, to shoot with bulbs (it could be done, and some did), but it's reason of being was small size, but excellent quality on the negative paired with simple operation. the people, who might want to use ttl flash opposed to manual or auto flash want a quick shot, be it out of convenience or out of quick changing lighting conditions. it is like it is and the sf58 is the best solution, if one needs ttl on a leica (the only others being a set of metz items or the sf24d). i use nikon and love the simple fully automated and -----> spot !!!  on nikon metering and ttl flash, when i want it (again: convenience for me) or the excellent ergonomics, when needed in manual modes (product shots). i bought the sf58, to expand the poor low light performance of the m8.2 sensor, to use lower iso in very dark scenes. it does the job - sort of (still learning/ fighting).", "sortedWord": "None", "identifyer": 37785, "year": "2011"}, {"Unnamed: 0": 377353, "autor": "brill64", "date": 1307033760000, "content": "i'd love a 35 v.1 steel rim..older than me, i'd add. one day perhaps.. for now my 35cron asph hits a pretty sweet spot on both my m6 & m9..pretty small and hard to beat.", "link": "https://www.l-camera-forum.com/topic/112548-which-35mm-lens-is-the-best-for-m/page/3/?tab=comments#comment-1690301", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i'd love a 35 v.1 steel rim..older than me, i'd add. one day perhaps.. for now my 35cron asph hits a pretty sweet -----> spot !!!  on both my m6 & m9..pretty small and hard to beat.", "sortedWord": "None", "identifyer": 38665, "year": "2011"}, {"Unnamed: 0": 377358, "autor": "dachs", "date": 1307049540000, "content": "My chum has a recent f2 35mm, I lashed out for the 1.4. Erwin Puts (Leica Lens Compendium) says there's a different 'fingerprints' to each, but by f2,8 from memory, they are equal. We ourselves can't tell the difference (yet we can tell the difference between the excellent Tri Elmar at 28mm at f4 and the latest 28mm 'prime' at f4,0, so we are quite critical) My eyes are lousy and my hands not steady, so the extra speed of the 1,4 'lux is indeed a help in evening street shots or even landscapes in my usual torrential holiday weather. I try and stick to one slide film (Provia 100, so I sometimes need speed). Both the 35mm's have superb bokeh (sorry), the 1,4 needs its hood which blocks a lot of view, can be annoying. I think Leica were right to do the 2,5 which (heresay) is brilliant at it's price point, and smaller. All highly subjective, but if I had to sell up everything then the MP and the 1,4 35mm summilux would be the last to go, you can 'do photography' with these kit; it's a love affair On Zeiss; 1/3rd stops is nice but having handled their stuff literally side by side with Leica's, sorry, the build quality while plainly more than adequate, isn't the same feel. Their pro movie lenses though are something else, wow! I have always had a soft spot for Zeiss lens design and construct quality, more than once they led the World, its just that they (not alone in this) have sub-let to Japan some of their range and I think one can tell by the feel. Not at all that our friends at Solms are by any means infallible, but...... Very long story short back to the poster; if budget restrains and if hands are young and steady the newer 2,5 is fine. If you have more dough and you like me hate living with regret, the F2 35mm. If nothing but the best, most, widest, fastest classic design short of the Nocti must be yours at any price, the asph 1,4 'lux. Call me smug, then, as I got mine five years ago it has nigh on doubled in price.", "link": "https://www.l-camera-forum.com/topic/112548-which-35mm-lens-is-the-best-for-m/page/3/?tab=comments#comment-1690547", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my chum has a recent f2 35mm, i lashed out for the 1.4. erwin puts (leica lens compendium) says there's a different 'fingerprints' to each, but by f2,8 from memory, they are equal. we ourselves can't tell the difference (yet we can tell the difference between the excellent tri elmar at 28mm at f4 and the latest 28mm 'prime' at f4,0, so we are quite critical) my eyes are lousy and my hands not steady, so the extra speed of the 1,4 'lux is indeed a help in evening street shots or even landscapes in my usual torrential holiday weather. i try and stick to one slide film (provia 100, so i sometimes need speed). both the 35mm's have superb bokeh (sorry), the 1,4 needs its hood which blocks a lot of view, can be annoying. i think leica were right to do the 2,5 which (heresay) is brilliant at it's price point, and smaller. all highly subjective, but if i had to sell up everything then the mp and the 1,4 35mm summilux would be the last to go, you can 'do photography' with these kit; it's a love affair on zeiss; 1/3rd stops is nice but having handled their stuff literally side by side with leica's, sorry, the build quality while plainly more than adequate, isn't the same feel. their pro movie lenses though are something else, wow! i have always had a soft -----> spot !!!  for zeiss lens design and construct quality, more than once they led the world, its just that they (not alone in this) have sub-let to japan some of their range and i think one can tell by the feel. not at all that our friends at solms are by any means infallible, but...... very long story short back to the poster; if budget restrains and if hands are young and steady the newer 2,5 is fine. if you have more dough and you like me hate living with regret, the f2 35mm. if nothing but the best, most, widest, fastest classic design short of the nocti must be yours at any price, the asph 1,4 'lux. call me smug, then, as i got mine five years ago it has nigh on doubled in price.", "sortedWord": "None", "identifyer": 38670, "year": "2011"}, {"Unnamed: 0": 377717, "autor": "denoir", "date": 1318698120000, "content": "IMO, the sweet spot of a Leica M is 35mm. It uses up most of the viewfinder real estate while still giving you a bit of margin at the edges. In addition to that missing focus with a 35mm using a rangefinder is almost impossible while you have to be a bit more careful when using a 50mm. Apart from that I also think 35mm is a more universal focal length as you can do both wide angle (diagonals, elements in the foreground) and normal/tele (direct, planar) compositions while you are more limited to the latter with a 50mm. But as others have pointed out, it will ultimately depend on the type of photography you usually do.", "link": "https://www.l-camera-forum.com/topic/163481-50mm-vs-35mm/page/3/?tab=comments#comment-1817864", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "imo, the sweet -----> spot !!!  of a leica m is 35mm. it uses up most of the viewfinder real estate while still giving you a bit of margin at the edges. in addition to that missing focus with a 35mm using a rangefinder is almost impossible while you have to be a bit more careful when using a 50mm. apart from that i also think 35mm is a more universal focal length as you can do both wide angle (diagonals, elements in the foreground) and normal/tele (direct, planar) compositions while you are more limited to the latter with a 50mm. but as others have pointed out, it will ultimately depend on the type of photography you usually do.", "sortedWord": "None", "identifyer": 39030, "year": "2011"}, {"Unnamed: 0": 377718, "autor": "algrove", "date": 1318727280000, "content": "IMO, the sweet spot of a Leica M is 35mm. It uses up most of the viewfinder real estate while still giving you a bit of margin at the edges. In addition to that missing focus with a 35mm using a rangefinder is almost impossible while you have to be a bit more careful when using a 50mm. Apart from that I also think 35mm is a more universal focal length as you can do both wide angle (diagonals, elements in the foreground) and normal/tele (direct, planar) compositions while you are more limited to the latter with a 50mm. But as others have pointed out, it will ultimately depend on the type of photography you usually do. +1", "link": "https://www.l-camera-forum.com/topic/163481-50mm-vs-35mm/page/3/?tab=comments#comment-1818067", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "imo, the sweet -----> spot !!!  of a leica m is 35mm. it uses up most of the viewfinder real estate while still giving you a bit of margin at the edges. in addition to that missing focus with a 35mm using a rangefinder is almost impossible while you have to be a bit more careful when using a 50mm. apart from that i also think 35mm is a more universal focal length as you can do both wide angle (diagonals, elements in the foreground) and normal/tele (direct, planar) compositions while you are more limited to the latter with a 50mm. but as others have pointed out, it will ultimately depend on the type of photography you usually do. +1", "sortedWord": "None", "identifyer": 39031, "year": "2011"}, {"Unnamed: 0": 380584, "autor": "jamesk8752", "date": 1301713560000, "content": " I just picked up a used but immaculate black M8 from a friend who doesn't keep his older cameras (he switched to an M9 immediately after it was released). As a collector, I wanted to add it to my M body collection. No \"coffee stains\" on the LCD, no lines or green blobs in the images, RF alignment is spot on, seems to operate perfectly, and I like having the 1/8000 shutter speed available. The serial number is 31022xx. I'm curious as to when it was made. From what I can gather through forum searches, this body is a very early one, possibly from the first batch produced. My friend said that it was one of the first ones sold in this area, and that he sent it back to Solms for service not long after he bought it (possibly as part of a recall). I suspect that it has a new sensor. Any ideas as to when it was made, and is it from the first batch? Thanks in advance... Regards, Jim", "link": "https://www.l-camera-forum.com/topic/147918-m8-serial-number/?tab=comments#comment-1633169", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " i just picked up a used but immaculate black m8 from a friend who doesn't keep his older cameras (he switched to an m9 immediately after it was released). as a collector, i wanted to add it to my m body collection. no \"coffee stains\" on the lcd, no lines or green blobs in the images, rf alignment is -----> spot !!!  on, seems to operate perfectly, and i like having the 1/8000 shutter speed available. the serial number is 31022xx. i'm curious as to when it was made. from what i can gather through forum searches, this body is a very early one, possibly from the first batch produced. my friend said that it was one of the first ones sold in this area, and that he sent it back to solms for service not long after he bought it (possibly as part of a recall). i suspect that it has a new sensor. any ideas as to when it was made, and is it from the first batch? thanks in advance... regards, jim", "sortedWord": "None", "identifyer": 41972, "year": "2011"}, {"Unnamed: 0": 380589, "autor": "cbretteville", "date": 1301818200000, "content": "Mine is 3107xxx and was delivered to me March 6th 2007. Based on that and the earliest spotted serial number I'd say your M8 was made in 2006. Carl", "link": "https://www.l-camera-forum.com/topic/147918-m8-serial-number/?tab=comments#comment-1634031", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "mine is 3107xxx and was delivered to me march 6th 2007. based on that and the earliest -----> spotted !!!  serial number i'd say your m8 was made in 2006. carl", "sortedWord": "None", "identifyer": 41977, "year": "2011"}, {"Unnamed: 0": 381286, "autor": "menos I M6", "date": 1315803660000, "content": "Nice!I like to wear .. How do you get? Another thing, The Hektor need focus adjustments? To get the wear, use it ;-) I used the M8.2 now for more than a year almost daily, since adding a M9 too a little less, but there are no reservation regarding shooting the M8.2 next to the M9 except for a preference towards the M9 in low light. I had to collimate the Hektor to be spot on on the M8.2 and M9 (as well as the film bodies). It was easy to do, as I had the lens completely disassembled anyway, when I cleaned and relubed it. Love that lens ;-) My sample seems somewhat special, as it in fact focusses down to 1m ! I am still trying to find out more details about this (factory conversion or did leave some Hektors with close focus ability?", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/2/?tab=comments#comment-1790990", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "nice!i like to wear .. how do you get? another thing, the hektor need focus adjustments? to get the wear, use it ;-) i used the m8.2 now for more than a year almost daily, since adding a m9 too a little less, but there are no reservation regarding shooting the m8.2 next to the m9 except for a preference towards the m9 in low light. i had to collimate the hektor to be -----> spot !!!  on on the m8.2 and m9 (as well as the film bodies). it was easy to do, as i had the lens completely disassembled anyway, when i cleaned and relubed it. love that lens ;-) my sample seems somewhat special, as it in fact focusses down to 1m ! i am still trying to find out more details about this (factory conversion or did leave some hektors with close focus ability?", "sortedWord": "None", "identifyer": 42677, "year": "2011"}, {"Unnamed: 0": 381322, "autor": "menos I M6", "date": 1320801960000, "content": "seen a few of these black M8`s with all the edges worn back to brass, do you use this cleaner that you have used on the dots, also on the edges, then polish it up? Ps. i want! Haha - no, no cleaner can do that. This is a Leica M8.2 - a later version of the M8, which is finished by Leica in a black lacquer, that wears with regular use. I do have the camera in daily use now for about 1 1/2 years. When I bought it, it had already very slight brassing on the on/off switch, the tip of the RF window and some brassing on the base plate. This behavior of the M8.2 makes it actually a more desirable camera to me, than my M9, which I know, will be sold in an eye blink, should a better sensor come around one day. My M8.2 will stay! The black M9 has a different paint process (powder coating), which doesn't wear the same. I have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. As interesting this might be, one can instantly spot a \"user aged\" from any \"sanded\" body by how the edges are worn. I dislike the idea of filing and sanding an expensive tool, to make it look more used.", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/4/?tab=comments#comment-1838745", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "seen a few of these black m8`s with all the edges worn back to brass, do you use this cleaner that you have used on the dots, also on the edges, then polish it up? ps. i want! haha - no, no cleaner can do that. this is a leica m8.2 - a later version of the m8, which is finished by leica in a black lacquer, that wears with regular use. i do have the camera in daily use now for about 1 1/2 years. when i bought it, it had already very slight brassing on the on/off switch, the tip of the rf window and some brassing on the base plate. this behavior of the m8.2 makes it actually a more desirable camera to me, than my m9, which i know, will be sold in an eye blink, should a better sensor come around one day. my m8.2 will stay! the black m9 has a different paint process (powder coating), which doesn't wear the same. i have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. as interesting this might be, one can instantly -----> spot !!!  a \"user aged\" from any \"sanded\" body by how the edges are worn. i dislike the idea of filing and sanding an expensive tool, to make it look more used.", "sortedWord": "None", "identifyer": 42713, "year": "2011"}, {"Unnamed: 0": 381323, "autor": "smdavey", "date": 1320838140000, "content": "Haha - no, no cleaner can do that.This is a Leica M8.2 - a later version of the M8, which is finished by Leica in a black lacquer, that wears with regular use. I do have the camera in daily use now for about 1 1/2 years. When I bought it, it had already very slight brassing on the on/off switch, the tip of the RF window and some brassing on the base plate. This behavior of the M8.2 makes it actually a more desirable camera to me, than my M9, which I know, will be sold in an eye blink, should a better sensor come around one day. My M8.2 will stay! The black M9 has a different paint process (powder coating), which doesn't wear the same. I have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. As interesting this might be, one can instantly spot a \"user aged\" from any \"sanded\" body by how the edges are worn. I dislike the idea of filing and sanding an expensive tool, to make it look more used. thanks for the info) yeah the M8 is (price wise) moving closer to the hands of myself now. so i am guessing the M8.2 is the one to look out for.", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/4/?tab=comments#comment-1838955", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "haha - no, no cleaner can do that.this is a leica m8.2 - a later version of the m8, which is finished by leica in a black lacquer, that wears with regular use. i do have the camera in daily use now for about 1 1/2 years. when i bought it, it had already very slight brassing on the on/off switch, the tip of the rf window and some brassing on the base plate. this behavior of the m8.2 makes it actually a more desirable camera to me, than my m9, which i know, will be sold in an eye blink, should a better sensor come around one day. my m8.2 will stay! the black m9 has a different paint process (powder coating), which doesn't wear the same. i have seen cameras, that have been treated with car polish, to get a similar \"shine\" and sandpaper, to wear edges. as interesting this might be, one can instantly -----> spot !!!  a \"user aged\" from any \"sanded\" body by how the edges are worn. i dislike the idea of filing and sanding an expensive tool, to make it look more used. thanks for the info) yeah the m8 is (price wise) moving closer to the hands of myself now. so i am guessing the m8.2 is the one to look out for.", "sortedWord": "None", "identifyer": 42714, "year": "2011"}, {"Unnamed: 0": 382806, "autor": "rcerick", "date": 1296757920000, "content": "Just wanted to follow up. I ended up ordering a new 50mm f/1.1 Nokton from the second batch, which supposedly corrected the back-focus issue on the digital M's. All I can say is that the lens I received is spot-on at f/1.1 on my M8.2. Awesome lens! Cheers. -Norm dNorm - can you provide the serial number of your new / replacement Nokton 50mm 1.1 (and that of the original, if you have it)? I just ordered a new Nokton 50mm 1.1 and would love to know if indeed a later batch (that hopefully includes mine) has fixed or addressed the focus shift problems reported. Rich", "link": "https://www.l-camera-forum.com/topic/107823-nokton-50mm-f11-backfocus/page/3/?tab=comments#comment-1577623", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "just wanted to follow up. i ended up ordering a new 50mm f/1.1 nokton from the second batch, which supposedly corrected the back-focus issue on the digital m's. all i can say is that the lens i received is -----> spot !!! -on at f/1.1 on my m8.2. awesome lens! cheers. -norm dnorm - can you provide the serial number of your new / replacement nokton 50mm 1.1 (and that of the original, if you have it)? i just ordered a new nokton 50mm 1.1 and would love to know if indeed a later batch (that hopefully includes mine) has fixed or addressed the focus shift problems reported. rich", "sortedWord": "None", "identifyer": 44205, "year": "2011"}, {"Unnamed: 0": 448171, "autor": "superlunes", "date": 1321292160000, "content": "I even think Leica might buy it's OVF from VC .... they say \"made in Japan\" and are visibly/optically not any brighter than the VC ones. One argument which I contemplated was the \"tightness of specs\" or whatever you might call it, that the Leica would be more specked towards the X1 in terms of centering and such ... This is clearly not the case, unlike with the Oly OVF which I sent back immediately. I sent the Leica OVF back as well (in Germany there is a 30 day exchange period where one can ship anything back and get full refund) after having tried the VC \"round\" OVF which I think is perfect and not all that expensive. I have had a marking engraved on the exact center of the OVF, use single spot-AF and this works fine. Best of all the VC is about 140€ cheaper than the Leica, and I think, but this is subjective, looks better on the X1 Hello.... I work with the X1 - and love it. without VF in bright light it is almost imposible. I will now buy a secon X1 body and wanted to try the VC viewfinder. I have the Leica VF as well but I missed a center point. So your solution is great. can you give me some more details of how you made it ? than you so much Luca", "link": "https://www.l-camera-forum.com/topic/112325-voigtlander-or-leica-viewfinder/page/8/?tab=comments#comment-1843722", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i even think leica might buy it's ovf from vc .... they say \"made in japan\" and are visibly/optically not any brighter than the vc ones. one argument which i contemplated was the \"tightness of specs\" or whatever you might call it, that the leica would be more specked towards the x1 in terms of centering and such ... this is clearly not the case, unlike with the oly ovf which i sent back immediately. i sent the leica ovf back as well (in germany there is a 30 day exchange period where one can ship anything back and get full refund) after having tried the vc \"round\" ovf which i think is perfect and not all that expensive. i have had a marking engraved on the exact center of the ovf, use single -----> spot !!! -af and this works fine. best of all the vc is about 140€ cheaper than the leica, and i think, but this is subjective, looks better on the x1 hello.... i work with the x1 - and love it. without vf in bright light it is almost imposible. i will now buy a secon x1 body and wanted to try the vc viewfinder. i have the leica vf as well but i missed a center point. so your solution is great. can you give me some more details of how you made it ? than you so much luca", "sortedWord": "None", "identifyer": 11655, "year": "2011"}], "name": "spotL-Forum2011"}