{"interestingcomments": [{"Unnamed: 0": 340545, "autor": "NDTPHOTOGRAPHY", "date": 1545335940000, "content": "In the end this is so subjective I don't believe there is any single \"right\" answer, only what works for the individual. Though I love the 35 lux ASPH FLE I seem to gravitate to my 50 LUX ASPH. The 50 is ever so slightly more intimate than the 35, also I wear eyeglasses and find it easier to see the frame lines - and thus am able spot \"incoming\" subjects. For what it's worth, I own the Tri-Elmar 16-18-21, the Super Elmar 21, the 35Lux ASPH and 3 of the 50s - Lux, APO Cron and Noctilux. But my every day carry remains the 50 Lux. In any case happy holidays to all.", "link": "https://www.l-camera-forum.com/topic/281217-what-are-the-must-have-2-lenses-with-the-m10/page/7/?tab=comments#comment-3650396", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "in the end this is so subjective i don't believe there is any single \"right\" answer, only what works for the individual. though i love the 35 lux asph fle i seem to gravitate to my 50 lux asph. the 50 is ever so slightly more intimate than the 35, also i wear eyeglasses and find it easier to see the frame lines - and thus am able -----> spot !!!  \"incoming\" subjects. for what it's worth, i own the tri-elmar 16-18-21, the super elmar 21, the 35lux asph and 3 of the 50s - lux, apo cron and noctilux. but my every day carry remains the 50 lux. in any case happy holidays to all.", "sortedWord": "None", "identifyer": 1614, "year": "2018"}, {"Unnamed: 0": 342498, "autor": "budjames", "date": 1530605880000, "content": "Only thing on my wish list is more MPs. I print large, and find 24mp to be very limiting for a 300dpi printer output. I can only imagine how good my 50 APO would be on a higher MP body for large prints. That lens (by itself) has certainly bumped up image quality from my M240 markedly, and the 50 APO lens for me has been worth every penny of cost, but for landscapes (and subjects with fine detail) the main weak spot for me of this \"system\" is low megapixel count. I've tried the Nikon D800, and even with a flapping DSLR mirror, there was no problem at all with getting pin sharp images off that 36mp sensor. I'd guess this would be even easier off a lower vibration rangefinder. If not an M with higher megapixel count, i would really hope that such resolution progress is made in the auto-focused SL or S ranges. I am recent Leica user with the purchase of my first Leica, the M10 in Nov. 2017. I'm still getting the hang of the system and manual focusing. For the past 4+ years, I have been a Fuji user. I do all of my printing on Epson inkjet printers. My current printer is the Epson P800 which handles paper up to 17\" wide. I have 16x20 prints from cropped images created with the Fuji X100S (16 mp files) and the image quality and sharpness is remarkable. I cannot tell the difference from prints made with this little camera and those hanging next to it made from my old Canon 5D Mk III system. If anyone here is serious about image quality and making prints larger than 20x30 inches, they should be using medium format gear. For my needs the M10 24mp files are more than adequate. The prints that I have made so far are amazing. Larger prints really show off the sharpness and micro-contrast of the Leica M prime lenses. I'm hooked. If you want the equivalent of buying a higher megapixel camera and you are a Lightroom user, I suggest that you try out Capture One Pro 11. I switched to Capture One Pro about 3 years ago because Lightroom didn't do such a great job with Fuji X trans sensor RAW files. Switching to Capture One Pro at that time was an immediate improvement in image quality and processing workflow speed. The last couple releases of Capture One Pro, now at version 11, have greatly improved layers and the DAM capabilities of the program. Good enough for my needs at least. Regards, Bud James Please check out my fine art and travel photography at www.budjames.photography or on Instagram at www.instagram.com/budjamesphoto. Edited July 3, 2018 by budjames", "link": "https://www.l-camera-forum.com/topic/268919-m-11-will-be-around-in-less-than-4-years-the-speculations-and-facts/page/15/?tab=comments#comment-3548677", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "only thing on my wish list is more mps. i print large, and find 24mp to be very limiting for a 300dpi printer output. i can only imagine how good my 50 apo would be on a higher mp body for large prints. that lens (by itself) has certainly bumped up image quality from my m240 markedly, and the 50 apo lens for me has been worth every penny of cost, but for landscapes (and subjects with fine detail) the main weak -----> spot !!!  for me of this \"system\" is low megapixel count. i've tried the nikon d800, and even with a flapping dslr mirror, there was no problem at all with getting pin sharp images off that 36mp sensor. i'd guess this would be even easier off a lower vibration rangefinder. if not an m with higher megapixel count, i would really hope that such resolution progress is made in the auto-focused sl or s ranges. i am recent leica user with the purchase of my first leica, the m10 in nov. 2017. i'm still getting the hang of the system and manual focusing. for the past 4+ years, i have been a fuji user. i do all of my printing on epson inkjet printers. my current printer is the epson p800 which handles paper up to 17\" wide. i have 16x20 prints from cropped images created with the fuji x100s (16 mp files) and the image quality and sharpness is remarkable. i cannot tell the difference from prints made with this little camera and those hanging next to it made from my old canon 5d mk iii system. if anyone here is serious about image quality and making prints larger than 20x30 inches, they should be using medium format gear. for my needs the m10 24mp files are more than adequate. the prints that i have made so far are amazing. larger prints really show off the sharpness and micro-contrast of the leica m prime lenses. i'm hooked. if you want the equivalent of buying a higher megapixel camera and you are a lightroom user, i suggest that you try out capture one pro 11. i switched to capture one pro about 3 years ago because lightroom didn't do such a great job with fuji x trans sensor raw files. switching to capture one pro at that time was an immediate improvement in image quality and processing workflow speed. the last couple releases of capture one pro, now at version 11, have greatly improved layers and the dam capabilities of the program. good enough for my needs at least. regards, bud james please check out my fine art and travel photography at www.budjames.photography or on instagram at www.instagram.com/budjamesphoto. edited july 3, 2018 by budjames", "sortedWord": "None", "identifyer": 3569, "year": "2018"}, {"Unnamed: 0": 351275, "autor": "ramarren", "date": 1541003040000, "content": "On 10/29/2018 at 6:43 PM, IkarusJohn said: The nice thing, I guess is having the same generation of cameras - M10-P, M10-D & M10-M - so the controls are largely the same, chargers and batteries the same etc. One of the frustrating things for me is if I go away, each camera has a different battery and charger - SL & spare battery, TL & spare battery (charge in camera), Monochrom & 3 spare batteries and M10-D & spare. Each charger is different. PLEASE Leica, at least provide for in camera USB charging ... If you're carrying all three cameras when you go away, you're carrying at least 300% of the equipment I carry when I'm traveling. I usually carry one camera and two or three lenses, often just two. With the M-D, because of its very large battery capacity, I carry two batteries. With the CL, because the batteries are pretty inexpensive from third party suppliers, I carry four batteries: they're smaller and lighter too. On travel, all of the chargers I use (Nitecore units) are USB powered, so I minimize on power supplies and cabling with a single 2.1A dual-port USB charger. Although the M10-D and M-D controls are somewhat different, all the important ones that I use most are in the same spots so I don't think I'd have any real difficulties switching between them. I don't change EV comp all that often, and it's not super convenient on either. I don't change ISO all that often, so the odd location on the M10-D won't really affect me much. Aperture, shutter speed, and shutter release are all in the predictable locations, and I usually just turn the camera on with a two minute sleep time out so that will be the same regardless.", "link": "https://www.l-camera-forum.com/topic/290828-long-live-the-m-d/page/2/?tab=comments#comment-3623157", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "on 10/29/2018 at 6:43 pm, ikarusjohn said: the nice thing, i guess is having the same generation of cameras - m10-p, m10-d & m10-m - so the controls are largely the same, chargers and batteries the same etc. one of the frustrating things for me is if i go away, each camera has a different battery and charger - sl & spare battery, tl & spare battery (charge in camera), monochrom & 3 spare batteries and m10-d & spare. each charger is different. please leica, at least provide for in camera usb charging ... if you're carrying all three cameras when you go away, you're carrying at least 300% of the equipment i carry when i'm traveling. i usually carry one camera and two or three lenses, often just two. with the m-d, because of its very large battery capacity, i carry two batteries. with the cl, because the batteries are pretty inexpensive from third party suppliers, i carry four batteries: they're smaller and lighter too. on travel, all of the chargers i use (nitecore units) are usb powered, so i minimize on power supplies and cabling with a single 2.1a dual-port usb charger. although the m10-d and m-d controls are somewhat different, all the important ones that i use most are in the same -----> spots !!!  so i don't think i'd have any real difficulties switching between them. i don't change ev comp all that often, and it's not super convenient on either. i don't change iso all that often, so the odd location on the m10-d won't really affect me much. aperture, shutter speed, and shutter release are all in the predictable locations, and i usually just turn the camera on with a two minute sleep time out so that will be the same regardless.", "sortedWord": "None", "identifyer": 12414, "year": "2018"}, {"Unnamed: 0": 353656, "autor": "Jean-Michel", "date": 1545153240000, "content": "2 hours ago, jaeger said: just curious, what is your reading prescription indicate? Hi, I don’t have my prescription at hand; my eyeglasses are multifocal and even have a prism in them. I don’t think that it matters to know the prescription value in order to calculate the diopter needed for the finder, unless you know exactly the value at the spot in you eyeglasses that you use to look through the finder. So, your optician is your friend in this case, it only takes a few minutes of trial and error with their diopter set and you camera to find the correct diopter.", "link": "https://www.l-camera-forum.com/topic/258125-leica-dioptre/page/7/?tab=comments#comment-3649438", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "2 hours ago, jaeger said: just curious, what is your reading prescription indicate? hi, i don’t have my prescription at hand; my eyeglasses are multifocal and even have a prism in them. i don’t think that it matters to know the prescription value in order to calculate the diopter needed for the finder, unless you know exactly the value at the -----> spot !!!  in you eyeglasses that you use to look through the finder. so, your optician is your friend in this case, it only takes a few minutes of trial and error with their diopter set and you camera to find the correct diopter.", "sortedWord": "None", "identifyer": 14809, "year": "2018"}, {"Unnamed: 0": 357507, "autor": "Peter Kilmister", "date": 1536704100000, "content": " A microfibre cloth is really all you need. Use one recommended for polishing glass and make sure it is very high quality and clean. Don't be too anal about the cleanliness of your camera. A speck of dust on the outside won't affect your photos. Dirt or dust inside the camera is another matter. The sensor is sensitive to dust. A rocket blower is a cheap and helpful tool to dislodge dust. Despite jaapv's opinion I use a vacuum cleaner nozzle covered in muslin. The vacuum cleaner is outside of the room and only the long nozzle is in the room. It works every time I get a dust spot. Jaapv is right to point out that having the vacuum cleaner in the same room would cause dust to swirl where you don't want it. Also, when changing lenses please make sure you keep the camera body pointing downwards. I don't recommend spit and polish which was an old fashioned remedy.", "link": "https://www.l-camera-forum.com/topic/231959-cleaning-camara-exterior/page/4/?tab=comments#comment-3591544", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " a microfibre cloth is really all you need. use one recommended for polishing glass and make sure it is very high quality and clean. don't be too anal about the cleanliness of your camera. a speck of dust on the outside won't affect your photos. dirt or dust inside the camera is another matter. the sensor is sensitive to dust. a rocket blower is a cheap and helpful tool to dislodge dust. despite jaapv's opinion i use a vacuum cleaner nozzle covered in muslin. the vacuum cleaner is outside of the room and only the long nozzle is in the room. it works every time i get a dust -----> spot !!! . jaapv is right to point out that having the vacuum cleaner in the same room would cause dust to swirl where you don't want it. also, when changing lenses please make sure you keep the camera body pointing downwards. i don't recommend spit and polish which was an old fashioned remedy.", "sortedWord": "None", "identifyer": 18677, "year": "2018"}, {"Unnamed: 0": 357508, "autor": "kuad82001", "date": 1536706800000, "content": "A microfibre cloth is really all you need. Use one recommended for polishing glass and make sure it is very high quality and clean. Don't be too anal about the cleanliness of your camera. A speck of dust on the outside won't affect your photos. Dirt or dust inside the camera is another matter. The sensor is sensitive to dust. A rocket blower is a cheap and helpful tool to dislodge dust. Despite jaapv's opinion I use a vacuum cleaner nozzle covered in muslin. The vacuum cleaner is outside of the room and only the long nozzle is in the room. It works every time I get a dust spot. Jaapv is right to point out that having the vacuum cleaner in the same room would cause dust to swirl where you don't want it. Also, when changing lenses please make sure you keep the camera body pointing downwards. I don't recommend spit and polish which was an old fashioned remedy. LOL! I know exterior dust/dirt does not affect the images; just wanted to keep it clean. Thanks for the reply/suggestion", "link": "https://www.l-camera-forum.com/topic/231959-cleaning-camara-exterior/page/4/?tab=comments#comment-3591558", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a microfibre cloth is really all you need. use one recommended for polishing glass and make sure it is very high quality and clean. don't be too anal about the cleanliness of your camera. a speck of dust on the outside won't affect your photos. dirt or dust inside the camera is another matter. the sensor is sensitive to dust. a rocket blower is a cheap and helpful tool to dislodge dust. despite jaapv's opinion i use a vacuum cleaner nozzle covered in muslin. the vacuum cleaner is outside of the room and only the long nozzle is in the room. it works every time i get a dust -----> spot !!! . jaapv is right to point out that having the vacuum cleaner in the same room would cause dust to swirl where you don't want it. also, when changing lenses please make sure you keep the camera body pointing downwards. i don't recommend spit and polish which was an old fashioned remedy. lol! i know exterior dust/dirt does not affect the images; just wanted to keep it clean. thanks for the reply/suggestion", "sortedWord": "None", "identifyer": 18678, "year": "2018"}, {"Unnamed: 0": 358578, "autor": "tjh1023", "date": 1524569640000, "content": "--img--  This also creates a bulls eye type spot on any images with a dark spot thick lighter area then a darker ring.", "link": "https://www.l-camera-forum.com/topic/283961-m240-sensor-corrosion/?tab=comments#comment-3505897", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "--img--  this also creates a bulls eye type -----> spot !!!  on any images with a dark -----> spot !!!  thick lighter area then a darker ring.", "sortedWord": "None", "identifyer": 19757, "year": "2018"}, {"Unnamed: 0": 358582, "autor": "tjh1023", "date": 1524583740000, "content": "This also creates a bulls eye type spot on any images with a dark spot thick lighter area then a darker ring.", "link": "https://www.l-camera-forum.com/topic/283961-m240-sensor-corrosion/?tab=comments#comment-3506050", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "this also creates a bulls eye type -----> spot !!!  on any images with a dark -----> spot !!!  thick lighter area then a darker ring.", "sortedWord": "None", "identifyer": 19761, "year": "2018"}, {"Unnamed: 0": 358589, "autor": "Jean-Michel", "date": 1524591480000, "content": "Perhaps a silly question, but have you cleaned the sensor, it looks somewhat dirty? Could the spot be some gunk on it?", "link": "https://www.l-camera-forum.com/topic/283961-m240-sensor-corrosion/?tab=comments#comment-3506139", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "perhaps a silly question, but have you cleaned the sensor, it looks somewhat dirty? could the -----> spot !!!  be some gunk on it?", "sortedWord": "None", "identifyer": 19768, "year": "2018"}, {"Unnamed: 0": 358590, "autor": "tjh1023", "date": 1524592920000, "content": "Me also. It hasn’t been used hard or abused. I haven’t cleaned it I did the dust detection and it showed a lot of dust. I looked at the sensor and saw the spot the looked at a photo, and live view also and it showed. I hope it’s just some crud of some sort that can be cleaned. This is my first real Leica, and every time I pick up this M I get goosebumps. I absolutely love it. Edited April 24, 2018 by tjh1023", "link": "https://www.l-camera-forum.com/topic/283961-m240-sensor-corrosion/?tab=comments#comment-3506154", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "me also. it hasn’t been used hard or abused. i haven’t cleaned it i did the dust detection and it showed a lot of dust. i looked at the sensor and saw the -----> spot !!!  the looked at a photo, and live view also and it showed. i hope it’s just some crud of some sort that can be cleaned. this is my first real leica, and every time i pick up this m i get goosebumps. i absolutely love it. edited april 24, 2018 by tjh1023", "sortedWord": "None", "identifyer": 19769, "year": "2018"}, {"Unnamed: 0": 358592, "autor": "Jean-Michel", "date": 1524595920000, "content": "Me also. It hasn’t been used hard or abused. I haven’t cleaned it I did the dust detection and it showed a lot of dust. I looked at the sensor and saw the spot the looked at a photo, and live view also and it showed. I hope it’s just some crud of some sort that can be cleaned. This is my first real Leica, and every time I pick up this M I get goosebumps. I absolutely love it. Hi again, It may very well just gunk on the sensor. If you are close to your Leica dealer take the camera there and see if they can take care of it. If the matter is sticky, it may be better to let someone familiar with cleaning sensors to do that, but it does not have to be a Leica specialist, any competent camera technician can do this quite easily Your camera will occasionally accumulate dust on the sensor. It is a relatively easy task to get rid of it. Search this site, or google, for advice on cleaning camera sensors. I personally use the Visibledust Arctic Butterfly brush, their lighted sensor loupe, and mostly simply a bulb blower. Always just start with the bulb blower, it is usually sufficient. Edited April 24, 2018 by Jean-Michel", "link": "https://www.l-camera-forum.com/topic/283961-m240-sensor-corrosion/?tab=comments#comment-3506181", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "me also. it hasn’t been used hard or abused. i haven’t cleaned it i did the dust detection and it showed a lot of dust. i looked at the sensor and saw the -----> spot !!!  the looked at a photo, and live view also and it showed. i hope it’s just some crud of some sort that can be cleaned. this is my first real leica, and every time i pick up this m i get goosebumps. i absolutely love it. hi again, it may very well just gunk on the sensor. if you are close to your leica dealer take the camera there and see if they can take care of it. if the matter is sticky, it may be better to let someone familiar with cleaning sensors to do that, but it does not have to be a leica specialist, any competent camera technician can do this quite easily your camera will occasionally accumulate dust on the sensor. it is a relatively easy task to get rid of it. search this site, or google, for advice on cleaning camera sensors. i personally use the visibledust arctic butterfly brush, their lighted sensor loupe, and mostly simply a bulb blower. always just start with the bulb blower, it is usually sufficient. edited april 24, 2018 by jean-michel", "sortedWord": "None", "identifyer": 19771, "year": "2018"}, {"Unnamed: 0": 358598, "autor": "tjh1023", "date": 1524696960000, "content": "Bill said the most common ways the crud gets in is build up around the lens mount on the camera and gets sucked when you change the lens. He said it creates a tiny vacuum when pulled off the body. The spot he believes was some dust that had oil on it possibly from an aperture blade. He offered to look at the lens but the only one I had with me was a Voigtlander, which obviously he they can’t touch ,I had left the 50 cron at home. If I happen to be in the area again I will bring the cron and have them clean it also. Edited April 25, 2018 by tjh1023", "link": "https://www.l-camera-forum.com/topic/283961-m240-sensor-corrosion/page/2/?tab=comments#comment-3507001", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "bill said the most common ways the crud gets in is build up around the lens mount on the camera and gets sucked when you change the lens. he said it creates a tiny vacuum when pulled off the body. the -----> spot !!!  he believes was some dust that had oil on it possibly from an aperture blade. he offered to look at the lens but the only one i had with me was a voigtlander, which obviously he they can’t touch ,i had left the 50 cron at home. if i happen to be in the area again i will bring the cron and have them clean it also. edited april 25, 2018 by tjh1023", "sortedWord": "None", "identifyer": 19777, "year": "2018"}, {"Unnamed: 0": 358599, "autor": "jmahto", "date": 1524826620000, "content": "OK Here it goes, Leica Camera service center in Allendale, NJ Is awesome. The Tech Bill came out and talk to me about the camera, took it back and 25 minutes later I had it back. Bill said the sensor was filthy thats all, he confirmed the camera is essentially new and is in beautiful shape. He took time to talk to me about the correct way to clean the camera and how the dust gets in and how to avoid it. They were so personal and helpful they set the bar high for anything else. --img--  I am glad it worked out ok. But I can't understand how such big dirt spot didn't show up in the very first picture you took. Whenever I get a new equipment, I look at it more critically during familiarization phase. In any case, enjoy your camera. --img-- ", "link": "https://www.l-camera-forum.com/topic/283961-m240-sensor-corrosion/page/2/?tab=comments#comment-3507817", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "ok here it goes, leica camera service center in allendale, nj is awesome. the tech bill came out and talk to me about the camera, took it back and 25 minutes later i had it back. bill said the sensor was filthy thats all, he confirmed the camera is essentially new and is in beautiful shape. he took time to talk to me about the correct way to clean the camera and how the dust gets in and how to avoid it. they were so personal and helpful they set the bar high for anything else. --img--  i am glad it worked out ok. but i can't understand how such big dirt -----> spot !!!  didn't show up in the very first picture you took. whenever i get a new equipment, i look at it more critically during familiarization phase. in any case, enjoy your camera. --img-- ", "sortedWord": "None", "identifyer": 19778, "year": "2018"}, {"Unnamed: 0": 366271, "autor": "colint544", "date": 1519250880000, "content": "The Clydeside Distillery? The very one - spot on.", "link": "https://www.l-camera-forum.com/topic/281818-long-exposures-with-the-mm1-60-240-sec/page/2/?tab=comments#comment-3466345", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the clydeside distillery? the very one - -----> spot !!!  on.", "sortedWord": "None", "identifyer": 27536, "year": "2018"}, {"Unnamed: 0": 367720, "autor": "colint544", "date": 1518520260000, "content": " I've heard quite a few say that and wonder whether to go for a MM1 instead. Do you try to shoot at specific ISO's to achieve a certain look? I've been trying to find raws to play with but can't find many. I have no experience of the M246, but I've been shooting with an MM1 for more than five years. I've never really hit the limits of the camera. I've been shooting digital cameras since 2001 (Nikon D1), and had got used to my digital camera being quickly superseded by something much better. The M Monochrom mk1 is the first digital camera where I've felt that not to be the case. If you do go for the MM1, my recommendations are: 1) Never go above 3200 ISO 2) Always shoot DNG files and save as TIFFs 3) 1600 ISO is the sweet spot for some grit and grain. Looks very filmic to my eyes 4) Get some good quality ND filters to really get the most out of the camera 5) Use the histogram on the LCD screen - I've found it to be accurate, reliable, and easy to use. Be prepared to underexpose by quite a bit 6) If you haven't already, learn how to use layers in Photoshop (or the equivalent in Lightroom) Once you learn to work with the quirks of the MM1, rather than against them, the camera will reward you with prints of such depth, luscious, subtle tones, and luminous blacks that you'll feel you can reach into them and touch the subject. And you can print as big as you like. It's a lot like shooting film. What look like limitations turn out to be strengths. I've found it a very satisfying camera to try to learn to master. https://www.instagram.com/colintempleton/ Edited February 13, 2018 by colint544", "link": "https://www.l-camera-forum.com/topic/281741-m10m-will-have-what/?tab=comments#comment-3460625", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " i've heard quite a few say that and wonder whether to go for a mm1 instead. do you try to shoot at specific iso's to achieve a certain look? i've been trying to find raws to play with but can't find many. i have no experience of the m246, but i've been shooting with an mm1 for more than five years. i've never really hit the limits of the camera. i've been shooting digital cameras since 2001 (nikon d1), and had got used to my digital camera being quickly superseded by something much better. the m monochrom mk1 is the first digital camera where i've felt that not to be the case. if you do go for the mm1, my recommendations are: 1) never go above 3200 iso 2) always shoot dng files and save as tiffs 3) 1600 iso is the sweet -----> spot !!!  for some grit and grain. looks very filmic to my eyes 4) get some good quality nd filters to really get the most out of the camera 5) use the histogram on the lcd screen - i've found it to be accurate, reliable, and easy to use. be prepared to underexpose by quite a bit 6) if you haven't already, learn how to use layers in photoshop (or the equivalent in lightroom) once you learn to work with the quirks of the mm1, rather than against them, the camera will reward you with prints of such depth, luscious, subtle tones, and luminous blacks that you'll feel you can reach into them and touch the subject. and you can print as big as you like. it's a lot like shooting film. what look like limitations turn out to be strengths. i've found it a very satisfying camera to try to learn to master. https://www.instagram.com/colintempleton/ edited february 13, 2018 by colint544", "sortedWord": "None", "identifyer": 28994, "year": "2018"}, {"Unnamed: 0": 367721, "autor": "mmx_2", "date": 1518521940000, "content": "Owning an MM2 (recently sold) I can add to above (my changes in bold): 1) Never go above 8000ISO 2) Always shoot DNG files and save as TIFFs 3) 6400ISO is the sweet spot for some grit and grain. Looks very filmic to my eyes 4) Get some good quality ND filters to really get the most out of the camera 5) Use the histogram on the LCD screen - I've found it to be accurate, reliable, and easy to use. Be prepared to underexpose by quite a bit 6) If you haven't already, learn how to use layers in Photoshop (or the equivalent in Lightroom) Never owning an MM1 (but tried quite a few times) I can only say the MM1 files have more \"black\" and the MM2 files more \"grey\" out of the box. So in the end it's a matter of taste and it can be addressed in post processing. I bought the MM2 because I wanted a common plattform with my M240 (battery, grip, EVF) but I think that 3200ISO that you get from MM1 is enough for most people --img-- . The M10 will propably boost \"maximum useable ISO\" to at least 20000 with a sweet \"film like\" sweet spot at around 16000, plus of course smaller body and better EVF. Most bang for the buck, MM1 without any doubt! Resolution wise they all have \"more than you need\". Edited February 13, 2018 by mmx_2", "link": "https://www.l-camera-forum.com/topic/281741-m10m-will-have-what/?tab=comments#comment-3460642", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "owning an mm2 (recently sold) i can add to above (my changes in bold): 1) never go above 8000iso 2) always shoot dng files and save as tiffs 3) 6400iso is the sweet -----> spot !!!  for some grit and grain. looks very filmic to my eyes 4) get some good quality nd filters to really get the most out of the camera 5) use the histogram on the lcd screen - i've found it to be accurate, reliable, and easy to use. be prepared to underexpose by quite a bit 6) if you haven't already, learn how to use layers in photoshop (or the equivalent in lightroom) never owning an mm1 (but tried quite a few times) i can only say the mm1 files have more \"black\" and the mm2 files more \"grey\" out of the box. so in the end it's a matter of taste and it can be addressed in post processing. i bought the mm2 because i wanted a common plattform with my m240 (battery, grip, evf) but i think that 3200iso that you get from mm1 is enough for most people --img-- . the m10 will propably boost \"maximum useable iso\" to at least 20000 with a sweet \"film like\" sweet spot at around 16000, plus of course smaller body and better evf. most bang for the buck, mm1 without any doubt! resolution wise they all have \"more than you need\". edited february 13, 2018 by mmx_2", "sortedWord": "None", "identifyer": 28995, "year": "2018"}, {"Unnamed: 0": 368022, "autor": "david strachan", "date": 1530332880000, "content": "I don't do the blower much...just do an f22 test periodically. Then a wet clean if it looks too spotty...with my M8's and M-P. But i shoot for speed-focus. So usually pretty well open (1 or 2 aperture stop down probably) lens. Just depends, i rarely go smaller than f5.6or f8, and diffraction drop-off. And it really depends on one's lens, whether it is a problem. And if you print. But it all depends...every image is different. Try a pinhole image...you'll be horrified how filthy a sensor can be. Easy to get neurotic though...makes little difference... considering dust spotting in the darkroom, of prints after printing. ...", "link": "https://www.l-camera-forum.com/topic/286077-how-often-do-you-blow-out-sensor-dust/?tab=comments#comment-3546588", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "i don't do the blower much...just do an f22 test periodically. then a wet clean if it looks too spotty...with my m8's and m-p. but i shoot for speed-focus. so usually pretty well open (1 or 2 aperture stop down probably) lens. just depends, i rarely go smaller than f5.6or f8, and diffraction drop-off. and it really depends on one's lens, whether it is a problem. and if you print. but it all depends...every image is different. try a pinhole image...you'll be horrified how filthy a sensor can be. easy to get neurotic though...makes little difference... considering dust -----> spotting !!!  in the darkroom, of prints after printing. ...", "sortedWord": "None", "identifyer": 29296, "year": "2018"}, {"Unnamed: 0": 368026, "autor": "kuad82001", "date": 1530460140000, "content": "I don't do the blower much...just do an f22 test periodically. Then a wet clean if it looks too spotty...with my M8's and M-P. But i shoot for speed-focus. So usually pretty well open (1 or 2 aperture stop down probably) lens. Just depends, i rarely go smaller than f5.6or f8, and diffraction drop-off. And it really depends on one's lens, whether it is a problem. And if you print. But it all depends...every image is different. Try a pinhole image...you'll be horrified how filthy a sensor can be. Easy to get neurotic though...makes little difference... considering dust spotting in the darkroom, of prints after printing. ... So how do you clean it when it gets dirty?", "link": "https://www.l-camera-forum.com/topic/286077-how-often-do-you-blow-out-sensor-dust/?tab=comments#comment-3547406", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "i don't do the blower much...just do an f22 test periodically. then a wet clean if it looks too spotty...with my m8's and m-p. but i shoot for speed-focus. so usually pretty well open (1 or 2 aperture stop down probably) lens. just depends, i rarely go smaller than f5.6or f8, and diffraction drop-off. and it really depends on one's lens, whether it is a problem. and if you print. but it all depends...every image is different. try a pinhole image...you'll be horrified how filthy a sensor can be. easy to get neurotic though...makes little difference... considering dust -----> spotting !!!  in the darkroom, of prints after printing. ... so how do you clean it when it gets dirty?", "sortedWord": "None", "identifyer": 29300, "year": "2018"}, {"Unnamed: 0": 368027, "autor": "kuad82001", "date": 1530460680000, "content": "I see like 1-3 spots a few weeks after blowing out the sensor with a Rocket Blower Edited July 1, 2018 by kuad82001", "link": "https://www.l-camera-forum.com/topic/286077-how-often-do-you-blow-out-sensor-dust/?tab=comments#comment-3547411", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i see like 1-3 -----> spots !!!  a few weeks after blowing out the sensor with a rocket blower edited july 1, 2018 by kuad82001", "sortedWord": "None", "identifyer": 29301, "year": "2018"}, {"Unnamed: 0": 368028, "autor": "Raid Amin", "date": 1530460980000, "content": "I see like 1-3 spots a few weeks after blowing out the sensor with a Rocket Blower Return to these 1-3 spots; flip over the camera upside-down to have blown dust fall away from camera by gravity; use Rocket blower. Mount lens after cleaning its rear mount; Edited July 1, 2018 by Raid Amin", "link": "https://www.l-camera-forum.com/topic/286077-how-often-do-you-blow-out-sensor-dust/?tab=comments#comment-3547413", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i see like 1-3 -----> spots !!!  a few weeks after blowing out the sensor with a rocket blower return to these 1-3 -----> spots !!! ; flip over the camera upside-down to have blown dust fall away from camera by gravity; use rocket blower. mount lens after cleaning its rear mount; edited july 1, 2018 by raid amin", "sortedWord": "None", "identifyer": 29302, "year": "2018"}, {"Unnamed: 0": 368038, "autor": "Herr Barnack", "date": 1530549300000, "content": " I clean my sensor only when dust spots (AKA sky turds) become bothersome and too time consuming during post processing. I have learned to do it myself and save the $50 USD that the camera store charges for sensor cleaning. I received my M-P 240 on 4-2-15 and have so far made 31,756 images. I have damp cleaned my sensor four times. I haven't kept track of how much I have used the rocket blower bulb, but I would say probably 2-3 times that were separate from the four damp cleanings.", "link": "https://www.l-camera-forum.com/topic/286077-how-often-do-you-blow-out-sensor-dust/page/2/?tab=comments#comment-3548252", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " i clean my sensor only when dust -----> spots !!!  (aka sky turds) become bothersome and too time consuming during post processing. i have learned to do it myself and save the $50 usd that the camera store charges for sensor cleaning. i received my m-p 240 on 4-2-15 and have so far made 31,756 images. i have damp cleaned my sensor four times. i haven't kept track of how much i have used the rocket blower bulb, but i would say probably 2-3 times that were separate from the four damp cleanings.", "sortedWord": "None", "identifyer": 29312, "year": "2018"}, {"Unnamed: 0": 368040, "autor": "pico", "date": 1530570780000, "content": "I clean my sensor only when dust spots (AKA sky turds) Sky turds! I love it. Thanks.", "link": "https://www.l-camera-forum.com/topic/286077-how-often-do-you-blow-out-sensor-dust/page/2/?tab=comments#comment-3548466", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i clean my sensor only when dust -----> spots !!!  (aka sky turds) sky turds! i love it. thanks.", "sortedWord": "None", "identifyer": 29314, "year": "2018"}, {"Unnamed: 0": 372207, "autor": "otto.f", "date": 1535283000000, "content": "I think it could well be corrosion, but then all over the whole sensor. Corrosion starts with these figures like worms. But since you didn’t use it, you haven’t seen it in a long time and the corrosion has gone over the whole sensor. But still, it’s a little strange that there seems to be no spot on the sensor where the pattern is not present. I’m curious whether it gets worse if you shoot at f16 Edited August 26, 2018 by otto.f", "link": "https://www.l-camera-forum.com/topic/287886-my-leica-m9-seems-to-have-a-serious-problem/?tab=comments#comment-3579718", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i think it could well be corrosion, but then all over the whole sensor. corrosion starts with these figures like worms. but since you didn’t use it, you haven’t seen it in a long time and the corrosion has gone over the whole sensor. but still, it’s a little strange that there seems to be no -----> spot !!!  on the sensor where the pattern is not present. i’m curious whether it gets worse if you shoot at f16 edited august 26, 2018 by otto.f", "sortedWord": "None", "identifyer": 33509, "year": "2018"}, {"Unnamed: 0": 372224, "autor": "pico", "date": 1535749020000, "content": " Could the sensor corrosion version of the M9 be a collectors item someday? Good question. We are approaching concept art with that. I have a peculiar justification for not having my M9 sensors replaced. The idea started when I had one of the screwed-up early Bronicas - a small light leak in a corner showing a distinct crescent. So my M9 photos today have a unique signature of corrosion spots. That's my excuse and I'm sticking to it. --img--  Also, regardless of expense I cannot stand the notion of giving up my cameras to Leica for months. I'm too old and pessimistic to abide by such. Can I get a contract that is nullified if I die before the cameras are delivered? Edited August 31, 2018 by pico", "link": "https://www.l-camera-forum.com/topic/287886-my-leica-m9-seems-to-have-a-serious-problem/page/2/?tab=comments#comment-3583615", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " could the sensor corrosion version of the m9 be a collectors item someday? good question. we are approaching concept art with that. i have a peculiar justification for not having my m9 sensors replaced. the idea started when i had one of the screwed-up early bronicas - a small light leak in a corner showing a distinct crescent. so my m9 photos today have a unique signature of corrosion -----> spots !!! . that's my excuse and i'm sticking to it. --img--  also, regardless of expense i cannot stand the notion of giving up my cameras to leica for months. i'm too old and pessimistic to abide by such. can i get a contract that is nullified if i die before the cameras are delivered? edited august 31, 2018 by pico", "sortedWord": "None", "identifyer": 33526, "year": "2018"}, {"Unnamed: 0": 373418, "autor": "pico", "date": 1541438640000, "content": "I have two M9s. One has original sensor with a few corrosion spots. I have no intention to have it replaced. I have a Photoshop action that fixes them in a heartbeat. Besides, they are a unique pattern, something like a natural watermark.", "link": "https://www.l-camera-forum.com/topic/291189-how-many-m9s-out-there-on-original-sensor/?tab=comments#comment-3626005", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i have two m9s. one has original sensor with a few corrosion -----> spots !!! . i have no intention to have it replaced. i have a photoshop action that fixes them in a heartbeat. besides, they are a unique pattern, something like a natural watermark.", "sortedWord": "None", "identifyer": 34722, "year": "2018"}, {"Unnamed: 0": 373419, "autor": "darylgo", "date": 1541448060000, "content": "My M9 was like pico's with a few spots, sent in almost two years ago and traded, the M9 is missed. My S2 has also developed sensor corrosion, barely visible. Leica is not so forthcoming with replacement, I understand they charge $3-4k. The price exceeds the value of the camera in $$$, and it's usefulness for me.", "link": "https://www.l-camera-forum.com/topic/291189-how-many-m9s-out-there-on-original-sensor/?tab=comments#comment-3626116", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "my m9 was like pico's with a few -----> spots !!! , sent in almost two years ago and traded, the m9 is missed. my s2 has also developed sensor corrosion, barely visible. leica is not so forthcoming with replacement, i understand they charge $3-4k. the price exceeds the value of the camera in $$$, and it's usefulness for me.", "sortedWord": "None", "identifyer": 34723, "year": "2018"}, {"Unnamed: 0": 373426, "autor": "Jon Pop", "date": 1542716640000, "content": "I purchased my M9 new in late 2011; still have the original sensor...it may have a few spots here and there but nothing to worry about thus far.", "link": "https://www.l-camera-forum.com/topic/291189-how-many-m9s-out-there-on-original-sensor/?tab=comments#comment-3634138", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i purchased my m9 new in late 2011; still have the original sensor...it may have a few -----> spots !!!  here and there but nothing to worry about thus far.", "sortedWord": "None", "identifyer": 34730, "year": "2018"}, {"Unnamed: 0": 374850, "autor": "schattenundlicht", "date": 1545345720000, "content": "Corrosion = circular, oval, or polygonal figures surrounded by bright halo Dust/ dirt = spots w/o halo Both can be compared in the right hand part of this picture taken with my M9 before going to Wetzlar in 2017: --img--  Edited December 20, 2018 by schattenundlicht", "link": "https://www.l-camera-forum.com/topic/292300-forged-repair-certificate-for-m9/page/2/?tab=comments#comment-3650475", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "corrosion = circular, oval, or polygonal figures surrounded by bright halo dust/ dirt = -----> spots !!!  w/o halo both can be compared in the right hand part of this picture taken with my m9 before going to wetzlar in 2017: --img--  edited december 20, 2018 by schattenundlicht", "sortedWord": "None", "identifyer": 36156, "year": "2018"}, {"Unnamed: 0": 374853, "autor": "Ko.Fe.", "date": 1546269120000, "content": "10 hours ago, hemlock said: corrosion on my MM1 was like this too. It is common one. Just as Jaap has described, something like lines of aligned bubbles. I was watching how mine was progressing. One tiny bit and then more and more. Not cleanable as regular spots from fresh shutter oil spills and dust. Edited December 31, 2018 by Ko.Fe.", "link": "https://www.l-camera-forum.com/topic/292300-forged-repair-certificate-for-m9/page/3/?tab=comments#comment-3655965", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "10 hours ago, hemlock said: corrosion on my mm1 was like this too. it is common one. just as jaap has described, something like lines of aligned bubbles. i was watching how mine was progressing. one tiny bit and then more and more. not cleanable as regular -----> spots !!!  from fresh shutter oil spills and dust. edited december 31, 2018 by ko.fe.", "sortedWord": "None", "identifyer": 36159, "year": "2018"}, {"Unnamed: 0": 374874, "autor": "antigallican", "date": 1544881140000, "content": "You need to be taking pictures of the sky really to spot dust or corrosion. Dust isn’t a problem but obviously corrosion is.", "link": "https://www.l-camera-forum.com/topic/292314-checking-for-sensor-information-me/?tab=comments#comment-3647854", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "you need to be taking pictures of the sky really to -----> spot !!!  dust or corrosion. dust isn’t a problem but obviously corrosion is.", "sortedWord": "None", "identifyer": 36180, "year": "2018"}, {"Unnamed: 0": 374914, "autor": "Lost Londonder", "date": 1543689720000, "content": "On 11/23/2018 at 3:49 PM, antigallican said: Sorry to hear this. Good luck - you never know. On 11/23/2018 at 3:52 PM, andybarton said: Hopefully, the camera was insured, but it's preferable that you get it back in one piece. On 11/23/2018 at 5:21 PM, sanyasi said: Sorry about your bad luck, but don't beat yourself up. Last year, I let down my guard in the Paris Metro and got pickpocketed for the first time. Fortunately, they only took the 150 Euros, and then threw the wallet on the ground, so all the important stuff was there. Stuff happens. On 11/23/2018 at 8:58 PM, Deliberate1 said: Frightening experience. Any security cameras in the area that may have caught the meeting? You walked away. All that matters. David Thanks all for your replies - sorry I never responded sooner! Stuff happens indeed, and that's definitely true David - walked away. No cameras on the spot I don't think. But...I have been reunited with my Leica! 😄 It was traded into a CeX second hand electronics store, around a mile from where the incident occurred! I asked them to check the serial, and it was a match - police recovered the camera for me...so that was a rather positive outcome! But the whole experience has sharpened me up a little, I mean stuff can catch you by surprise, but I like to think I'm a little more cautious now (in a good way!). The matter's with the police now anyway, fingers crossed they might be able to track down the crooks! Edited December 1, 2018 by Lost Londonder Minor addition.", "link": "https://www.l-camera-forum.com/topic/291708-leica-m9-snatched-from-my-hands-serial-3835140/?tab=comments#comment-3640352", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "on 11/23/2018 at 3:49 pm, antigallican said: sorry to hear this. good luck - you never know. on 11/23/2018 at 3:52 pm, andybarton said: hopefully, the camera was insured, but it's preferable that you get it back in one piece. on 11/23/2018 at 5:21 pm, sanyasi said: sorry about your bad luck, but don't beat yourself up. last year, i let down my guard in the paris metro and got pickpocketed for the first time. fortunately, they only took the 150 euros, and then threw the wallet on the ground, so all the important stuff was there. stuff happens. on 11/23/2018 at 8:58 pm, deliberate1 said: frightening experience. any security cameras in the area that may have caught the meeting? you walked away. all that matters. david thanks all for your replies - sorry i never responded sooner! stuff happens indeed, and that's definitely true david - walked away. no cameras on the -----> spot !!!  i don't think. but...i have been reunited with my leica! 😄 it was traded into a cex second hand electronics store, around a mile from where the incident occurred! i asked them to check the serial, and it was a match - police recovered the camera for me...so that was a rather positive outcome! but the whole experience has sharpened me up a little, i mean stuff can catch you by surprise, but i like to think i'm a little more cautious now (in a good way!). the matter's with the police now anyway, fingers crossed they might be able to track down the crooks! edited december 1, 2018 by lost londonder minor addition.", "sortedWord": "None", "identifyer": 36220, "year": "2018"}, {"Unnamed: 0": 374915, "autor": "Topsy", "date": 1543690380000, "content": " 9 minutes ago, Lost Londonder said: Thanks all for your replies - sorry I never responded sooner! Stuff happens indeed, and that's definitely true David - walked away. No cameras on the spot I don't think. But...I have been reunited with my Leica! 😄 It was traded into a CeX second hand electronics store, around a mile from where the incident occurred! I asked them to check the serial, and it was a match - police recovered the camera for me...so that was a rather positive outcome! But the whole experience has sharpened me up a little, I mean stuff can catch you by surprise, but I like to think I'm a little more cautious now (in a good way!). The matter's with the police now anyway, fingers crossed they might be able to track down the crooks! That's great news. Let's hope they catch the scumbags as well.", "link": "https://www.l-camera-forum.com/topic/291708-leica-m9-snatched-from-my-hands-serial-3835140/?tab=comments#comment-3640362", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " 9 minutes ago, lost londonder said: thanks all for your replies - sorry i never responded sooner! stuff happens indeed, and that's definitely true david - walked away. no cameras on the -----> spot !!!  i don't think. but...i have been reunited with my leica! 😄 it was traded into a cex second hand electronics store, around a mile from where the incident occurred! i asked them to check the serial, and it was a match - police recovered the camera for me...so that was a rather positive outcome! but the whole experience has sharpened me up a little, i mean stuff can catch you by surprise, but i like to think i'm a little more cautious now (in a good way!). the matter's with the police now anyway, fingers crossed they might be able to track down the crooks! that's great news. let's hope they catch the scumbags as well.", "sortedWord": "None", "identifyer": 36221, "year": "2018"}, {"Unnamed: 0": 374916, "autor": "Deliberate1", "date": 1543703220000, "content": "3 hours ago, Lost Londonder said: Thanks all for your replies - sorry I never responded sooner! Stuff happens indeed, and that's definitely true David - walked away. No cameras on the spot I don't think. But...I have been reunited with my Leica! 😄 It was traded into a CeX second hand electronics store, around a mile from where the incident occurred! I asked them to check the serial, and it was a match - police recovered the camera for me...so that was a rather positive outcome! But the whole experience has sharpened me up a little, I mean stuff can catch you by surprise, but I like to think I'm a little more cautious now (in a good way!). The matter's with the police now anyway, fingers crossed they might be able to track down the crooks! Good for you! I guess it would be too much to hope that the scoundrel might have taken a selfie and left the card in the body.... Best, David", "link": "https://www.l-camera-forum.com/topic/291708-leica-m9-snatched-from-my-hands-serial-3835140/?tab=comments#comment-3640480", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "3 hours ago, lost londonder said: thanks all for your replies - sorry i never responded sooner! stuff happens indeed, and that's definitely true david - walked away. no cameras on the -----> spot !!!  i don't think. but...i have been reunited with my leica! 😄 it was traded into a cex second hand electronics store, around a mile from where the incident occurred! i asked them to check the serial, and it was a match - police recovered the camera for me...so that was a rather positive outcome! but the whole experience has sharpened me up a little, i mean stuff can catch you by surprise, but i like to think i'm a little more cautious now (in a good way!). the matter's with the police now anyway, fingers crossed they might be able to track down the crooks! good for you! i guess it would be too much to hope that the scoundrel might have taken a selfie and left the card in the body.... best, david", "sortedWord": "None", "identifyer": 36222, "year": "2018"}, {"Unnamed: 0": 375022, "autor": "Ronazle", "date": 1524265500000, "content": "Today I got my M-9 back. There were no charges, new leather applied, etc, etc. Possibly the RF is a little more spot on but time will clarify that. Mine was sent in one day before the D/L - after sitting in NJ waiting for the hardware from Germany, it was forwarded to Germany. I received several erroneous emails about it in the last few weeks; they seemed to originate in Germany. In any event, it seems to be working well, some screens (e.g., ISO) are different and there are a number of previously unlisted lenses to choose from in \"manual\" position. Hopefully, no more heartache unless it is self-inflicted. Hallelujah, Regards, Ron PS. The DNG/JPG option is intact. Edited April 20, 2018 by Ronazle", "link": "https://www.l-camera-forum.com/topic/278477-current-sensor-replacement-times/page/5/?tab=comments#comment-3503963", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "today i got my m-9 back. there were no charges, new leather applied, etc, etc. possibly the rf is a little more -----> spot !!!  on but time will clarify that. mine was sent in one day before the d/l - after sitting in nj waiting for the hardware from germany, it was forwarded to germany. i received several erroneous emails about it in the last few weeks; they seemed to originate in germany. in any event, it seems to be working well, some screens (e.g., iso) are different and there are a number of previously unlisted lenses to choose from in \"manual\" position. hopefully, no more heartache unless it is self-inflicted. hallelujah, regards, ron ps. the dng/jpg option is intact. edited april 20, 2018 by ronazle", "sortedWord": "None", "identifyer": 36329, "year": "2018"}, {"Unnamed: 0": 375066, "autor": "Keith chen", "date": 1540909620000, "content": " Hi all, Just got my first Leica from Leica Miami. It is a used M9 with recently replaced CCD (i believe this is the post 2015 new design, which is not prone to corrosion). As I received the camera, noticed that there are sensor dusts, no surprise there. Used rocket blower, which moved the dusts around instead of removing them... After some research, I decided to give the Eyelead gel stick a try. I see that there are two versions, the original blue one and the orange one for Sony/Leica. I talked to a tech person from the Leica Miami store, and he recommended the blue one. He was pretty confident that the blue one works well on M9, and wouldn't cause problem like leaving residual on the sensor. He also mentioned that the blue one is what the Miami store and Leical Germany use. Because Leica Miami doesn't carry the orange one and it is out of stock at photographylife, I decided to go with the blue one and i will receive it in a couple days. Before I actually stick the thing on the sensor, just want to get everyone's opinion on how to properly use it. Based on what I've read, stick it on the sensor gently, don't pull up but try to wobble it to unstick, and don't drag on the sensor either. Is this right? I have seen a older post from jaapv that he had good experience with the blue one for Leica. I am wondering if anything changed recently so that one has use the orange one instead? The notice from photographylife makes me worry as it states that newer Leica sensor, including the m9 new design i assume, is not safe with the blue one... Also, about corrosion - after using the blower, while most dusts moved around, there is one stayed at the same spot (circled in black in the attach picture, 200% zoom). Looks like a dust to me but the small 'white halo' around it makes me worry a bit. The one sitting in the green circle is a new dust after using the blower. Anything suggestion is appreciated. Thanks in advance! --img-- ", "link": "https://www.l-camera-forum.com/topic/291018-sensor-cleaning-and-corrosion-need-advice-on-m9-with-eyelead-blue/?tab=comments#comment-3622596", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " hi all, just got my first leica from leica miami. it is a used m9 with recently replaced ccd (i believe this is the post 2015 new design, which is not prone to corrosion). as i received the camera, noticed that there are sensor dusts, no surprise there. used rocket blower, which moved the dusts around instead of removing them... after some research, i decided to give the eyelead gel stick a try. i see that there are two versions, the original blue one and the orange one for sony/leica. i talked to a tech person from the leica miami store, and he recommended the blue one. he was pretty confident that the blue one works well on m9, and wouldn't cause problem like leaving residual on the sensor. he also mentioned that the blue one is what the miami store and leical germany use. because leica miami doesn't carry the orange one and it is out of stock at photographylife, i decided to go with the blue one and i will receive it in a couple days. before i actually stick the thing on the sensor, just want to get everyone's opinion on how to properly use it. based on what i've read, stick it on the sensor gently, don't pull up but try to wobble it to unstick, and don't drag on the sensor either. is this right? i have seen a older post from jaapv that he had good experience with the blue one for leica. i am wondering if anything changed recently so that one has use the orange one instead? the notice from photographylife makes me worry as it states that newer leica sensor, including the m9 new design i assume, is not safe with the blue one... also, about corrosion - after using the blower, while most dusts moved around, there is one stayed at the same -----> spot !!!  (circled in black in the attach picture, 200% zoom). looks like a dust to me but the small 'white halo' around it makes me worry a bit. the one sitting in the green circle is a new dust after using the blower. anything suggestion is appreciated. thanks in advance! --img-- ", "sortedWord": "None", "identifyer": 36373, "year": "2018"}, {"Unnamed: 0": 375072, "autor": "Jean-Michel", "date": 1541007000000, "content": " No diagnosis from me, but, if I may, I suggest that the spot is either an oily deposit or, because of the halo, a corrosion spot. I would return the camera to the dealer and let them diagnose/fix. I am surprised that the dealer would have sent you the camera with \"bonus\" dust on the sensor! For cleaning any of my sensors I use a blower and if needed an Arctic Butterfly brush; I check the sensor with their illuminated loupe.", "link": "https://www.l-camera-forum.com/topic/291018-sensor-cleaning-and-corrosion-need-advice-on-m9-with-eyelead-blue/?tab=comments#comment-3623188", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " no diagnosis from me, but, if i may, i suggest that the -----> spot !!!  is either an oily deposit or, because of the halo, a corrosion -----> spot !!! . i would return the camera to the dealer and let them diagnose/fix. i am surprised that the dealer would have sent you the camera with \"bonus\" dust on the sensor! for cleaning any of my sensors i use a blower and if needed an arctic butterfly brush; i check the sensor with their illuminated loupe.", "sortedWord": "None", "identifyer": 36379, "year": "2018"}, {"Unnamed: 0": 375085, "autor": "Ray Vonn", "date": 1541063100000, "content": "I've got a spot on my M-E which was sent to Germany which I'm 99% sure is dust. Tiny though and fixed with a click in PP. Doesn't prevent the magic.", "link": "https://www.l-camera-forum.com/topic/289727-any-m9-new-sensor-issue-after-replacement/?tab=comments#comment-3623462", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i've got a -----> spot !!!  on my m-e which was sent to germany which i'm 99% sure is dust. tiny though and fixed with a click in pp. doesn't prevent the magic.", "sortedWord": "None", "identifyer": 36392, "year": "2018"}, {"Unnamed: 0": 375087, "autor": "pico", "date": 1542153000000, "content": "My two M9 cameras have corrosion spots and I cope.. Rather than sending the cameras into dark months at Leica making them unavailable to me I have automated post-processing that fixes the spots in a second. Consider the same. Edited November 13, 2018 by pico", "link": "https://www.l-camera-forum.com/topic/289727-any-m9-new-sensor-issue-after-replacement/?tab=comments#comment-3630769", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "my two m9 cameras have corrosion -----> spots !!!  and i cope.. rather than sending the cameras into dark months at leica making them unavailable to me i have automated post-processing that fixes the -----> spots !!!  in a second. consider the same. edited november 13, 2018 by pico", "sortedWord": "None", "identifyer": 36394, "year": "2018"}, {"Unnamed: 0": 375089, "autor": "tobey bilek", "date": 1541802240000, "content": " First snow happened today in Chicago and lots of opportunities presented as trees still have colored leaves. I did a few pics and while chimping, a fuzzy spot appeared appeared in the center of the hardened glass. I wiped it with my finger and it skirted right over. Now I thought it is on the inside and this is an expensive problem. At home I tried the Zeiss eyeglass cleaner, Walmart or Sams, and off it came. What a relief. Source of spot is my big nose and using the camera with my dominant left eye. Solution will be to clean more often a the nose grease gets difficult to remove over time. The Zeiss is really good lens cleaner if you have to resort to liquids. I have even used it on a Nikon sensor that was really filthy on a used D3.", "link": "https://www.l-camera-forum.com/topic/291323-m9p-screen-smudge/?tab=comments#comment-3628484", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " first snow happened today in chicago and lots of opportunities presented as trees still have colored leaves. i did a few pics and while chimping, a fuzzy -----> spot !!!  appeared appeared in the center of the hardened glass. i wiped it with my finger and it skirted right over. now i thought it is on the inside and this is an expensive problem. at home i tried the zeiss eyeglass cleaner, walmart or sams, and off it came. what a relief. source of spot is my big nose and using the camera with my dominant left eye. solution will be to clean more often a the nose grease gets difficult to remove over time. the zeiss is really good lens cleaner if you have to resort to liquids. i have even used it on a nikon sensor that was really filthy on a used d3.", "sortedWord": "None", "identifyer": 36396, "year": "2018"}, {"Unnamed: 0": 375131, "autor": "Ko.Fe.", "date": 1517372820000, "content": "Today I went to Leica dealer with my M-E. For obvious reason... Not from one I got it new in 2016, while on visiting motherland, but more advanced, local Leica dealer. As result... all I have Leica made for now is beaten M4-2 with two Leica lenses. Well... and useless on this film M Leica flash. So, I was looking at what else Leica made for first time. Leica X-U and X... slim cameras. big lenses. So is Q. And then this new a-la Barnack CL... Yea... Fatty M240 with tiny wheel... I didn't spot M10... Anyway now after seeing all of those, I like M-E even more. --img-- ", "link": "https://www.l-camera-forum.com/topic/273549-i-still-love-my-m9-m-e/page/2/?tab=comments#comment-3451578", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "today i went to leica dealer with my m-e. for obvious reason... not from one i got it new in 2016, while on visiting motherland, but more advanced, local leica dealer. as result... all i have leica made for now is beaten m4-2 with two leica lenses. well... and useless on this film m leica flash. so, i was looking at what else leica made for first time. leica x-u and x... slim cameras. big lenses. so is q. and then this new a-la barnack cl... yea... fatty m240 with tiny wheel... i didn't -----> spot !!!  m10... anyway now after seeing all of those, i like m-e even more. --img-- ", "sortedWord": "None", "identifyer": 36438, "year": "2018"}, {"Unnamed: 0": 375143, "autor": "Ko.Fe.", "date": 1526397480000, "content": "Interesting. I walked to get my M-E with new sensor and spotted young photog with Pro2. ...They made it looks like RF, but no cigar... BWT, Leica seems to reset shutter count on my M-E after sensor replacement. At least it started to write frames from number one again.", "link": "https://www.l-camera-forum.com/topic/273549-i-still-love-my-m9-m-e/page/3/?tab=comments#comment-3519134", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "interesting. i walked to get my m-e with new sensor and -----> spotted !!!  young photog with pro2. ...they made it looks like rf, but no cigar... bwt, leica seems to reset shutter count on my m-e after sensor replacement. at least it started to write frames from number one again.", "sortedWord": "None", "identifyer": 36450, "year": "2018"}, {"Unnamed: 0": 375756, "autor": "pico", "date": 1533157320000, "content": "Just how severe is the corrosion people find with the M9? I wonder if it is serious enough to worry. I have two M9s, and I cope easily with the issue. I am no longer a pro, so there are no anal born-yesterday editors pestering me over minutiae. In addition the spots are always in the same place on the image so an elementary Photoshop action obviates them in a moment. Finally, and silly I know, those blips of corrosion serve as a unique watermark. --img--  Edited August 1, 2018 by pico", "link": "https://www.l-camera-forum.com/topic/247062-ccd-sensor-new-leica-information-about-the-state-of-development/page/8/?tab=comments#comment-3565315", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "just how severe is the corrosion people find with the m9? i wonder if it is serious enough to worry. i have two m9s, and i cope easily with the issue. i am no longer a pro, so there are no anal born-yesterday editors pestering me over minutiae. in addition the -----> spots !!!  are always in the same place on the image so an elementary photoshop action obviates them in a moment. finally, and silly i know, those blips of corrosion serve as a unique watermark. --img--  edited august 1, 2018 by pico", "sortedWord": "None", "identifyer": 37064, "year": "2018"}, {"Unnamed: 0": 375757, "autor": "Guest tofu_man", "date": 1533179760000, "content": "Just how severe is the corrosion people find with the M9? I wonder if it is serious enough to worry. I have two M9s, and I cope easily with the issue. I am no longer a pro, so there are no anal born-yesterday editors pestering me over minutiae. In addition the spots are always in the same place on the image so an elementary Photoshop action obviates them in a moment. Finally, and silly I know, those blips of corrosion serve as a unique watermark. --img--  Good question. Unless it was really bad, I would live with it rather than pay for a replacement. The corrosion 'blobs' on my sensor were easily dealt with, and not always noticeable to me as my sensor was extremely dusty anyway. At first, I thought the blobs were spots of tear gas residue when I was taking pics on the Palestine side of the Israeli separation wall during summer 2014. The blobs show just left of top centre & towards lower centre in top photo. --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/247062-ccd-sensor-new-leica-information-about-the-state-of-development/page/8/?tab=comments#comment-3565404", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "just how severe is the corrosion people find with the m9? i wonder if it is serious enough to worry. i have two m9s, and i cope easily with the issue. i am no longer a pro, so there are no anal born-yesterday editors pestering me over minutiae. in addition the -----> spots !!!  are always in the same place on the image so an elementary photoshop action obviates them in a moment. finally, and silly i know, those blips of corrosion serve as a unique watermark. --img--  good question. unless it was really bad, i would live with it rather than pay for a replacement. the corrosion 'blobs' on my sensor were easily dealt with, and not always noticeable to me as my sensor was extremely dusty anyway. at first, i thought the blobs were spots of tear gas residue when i was taking pics on the palestine side of the israeli separation wall during summer 2014. the blobs show just left of top centre & towards lower centre in top photo. --img-- --img-- --img-- ", "sortedWord": "None", "identifyer": 37065, "year": "2018"}, {"Unnamed: 0": 375759, "autor": "silverchrome", "date": 1533454680000, "content": " Just how severe is the corrosion people find with the M9? I wonder if it is serious enough to worry. I have two M9s, and I cope easily with the issue. I am no longer a pro, so there are no anal born-yesterday editors pestering me over minutiae. In addition the spots are always in the same place on the image so an elementary Photoshop action obviates them in a moment. Finally, and silly I know, those blips of corrosion serve as a unique watermark. --img--  Mine wasn't that bad but I sent it off anyway because there is no telling what Leica will do in the future given their track record on this matter. My concern was that Leica would bump up the price for the replacement or cancel the \"service\" altogether once limitation periods (in respect of sales of goods law) expired. Assuming nothing else goes wrong with the camera, we should have a camera that is usable for many years to come. However, not replacing the sensor could mean that the corrosion becomes so bad that it renders the camera a brick. With M9 prices around the £2k mark, I can still justify spending half its value on a repair. I'm not sure I could do that if value of the M9 were around the £1k mark.", "link": "https://www.l-camera-forum.com/topic/247062-ccd-sensor-new-leica-information-about-the-state-of-development/page/8/?tab=comments#comment-3566976", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " just how severe is the corrosion people find with the m9? i wonder if it is serious enough to worry. i have two m9s, and i cope easily with the issue. i am no longer a pro, so there are no anal born-yesterday editors pestering me over minutiae. in addition the -----> spots !!!  are always in the same place on the image so an elementary photoshop action obviates them in a moment. finally, and silly i know, those blips of corrosion serve as a unique watermark. --img--  mine wasn't that bad but i sent it off anyway because there is no telling what leica will do in the future given their track record on this matter. my concern was that leica would bump up the price for the replacement or cancel the \"service\" altogether once limitation periods (in respect of sales of goods law) expired. assuming nothing else goes wrong with the camera, we should have a camera that is usable for many years to come. however, not replacing the sensor could mean that the corrosion becomes so bad that it renders the camera a brick. with m9 prices around the £2k mark, i can still justify spending half its value on a repair. i'm not sure i could do that if value of the m9 were around the £1k mark.", "sortedWord": "None", "identifyer": 37067, "year": "2018"}, {"Unnamed: 0": 375760, "autor": "JohannB", "date": 1533458460000, "content": "Thank you for the replies. I initially thought it is just dust spots but it started to get worse. It only got really noticeable towards the end of 2017 and that is when I notified Leica. As it is currently, it will be possible to manage in post processing but my concern is if it get worse. Quoted sensor replacement cost is around £1000. Johann", "link": "https://www.l-camera-forum.com/topic/247062-ccd-sensor-new-leica-information-about-the-state-of-development/page/8/?tab=comments#comment-3567002", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "thank you for the replies. i initially thought it is just dust -----> spots !!!  but it started to get worse. it only got really noticeable towards the end of 2017 and that is when i notified leica. as it is currently, it will be possible to manage in post processing but my concern is if it get worse. quoted sensor replacement cost is around £1000. johann", "sortedWord": "None", "identifyer": 37068, "year": "2018"}, {"Unnamed: 0": 375761, "autor": "JSU", "date": 1533506880000, "content": "Just how severe is the corrosion people find with the M9? I wonder if it is serious enough to worry. I have two M9s, and I cope easily with the issue. I am no longer a pro, so there are no anal born-yesterday editors pestering me over minutiae. In addition the spots are always in the same place on the image so an elementary Photoshop action obviates them in a moment. Finally, and silly I know, those blips of corrosion serve as a unique watermark. --img--  Just how severe, I'll let you judge. These files were the last made with each of my M9-P bodies as I was preparing them in April to send to New Jersey. Sensor replacement was right at 3 months. The sensors had previously been replaced in each body. --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/247062-ccd-sensor-new-leica-information-about-the-state-of-development/page/8/?tab=comments#comment-3567373", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "just how severe is the corrosion people find with the m9? i wonder if it is serious enough to worry. i have two m9s, and i cope easily with the issue. i am no longer a pro, so there are no anal born-yesterday editors pestering me over minutiae. in addition the -----> spots !!!  are always in the same place on the image so an elementary photoshop action obviates them in a moment. finally, and silly i know, those blips of corrosion serve as a unique watermark. --img--  just how severe, i'll let you judge. these files were the last made with each of my m9-p bodies as i was preparing them in april to send to new jersey. sensor replacement was right at 3 months. the sensors had previously been replaced in each body. --img-- --img-- ", "sortedWord": "None", "identifyer": 37069, "year": "2018"}, {"Unnamed: 0": 375762, "autor": "JohannB", "date": 1533583980000, "content": "Oh my. It looks like it does get progressively worse over time. Mine is just a couple of spots at the moment. Johann", "link": "https://www.l-camera-forum.com/topic/247062-ccd-sensor-new-leica-information-about-the-state-of-development/page/8/?tab=comments#comment-3567962", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "oh my. it looks like it does get progressively worse over time. mine is just a couple of -----> spots !!!  at the moment. johann", "sortedWord": "None", "identifyer": 37070, "year": "2018"}, {"Unnamed: 0": 375797, "autor": "ianman", "date": 1528457400000, "content": "By the way he checked back through all his emails and, like Mark, never received any notification from Leica about the free sensor replacement scheme terminating. I don't think anyone ever got any sort of direct notification from Leica, be it an acknowledgement of the issue, the repair program, nothing. I certainly did not. And in fact, when I sent in some images showing the issue I had, the answer from CC was that the spots are no more than dust. Luckily, I didn't give in and they finally accepted my M9 suffered from sensor corrosion. In this instance, I think this is very poor \"support\".", "link": "https://www.l-camera-forum.com/topic/285199-question-about-m9-p-strategy/?tab=comments#comment-3533828", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "by the way he checked back through all his emails and, like mark, never received any notification from leica about the free sensor replacement scheme terminating. i don't think anyone ever got any sort of direct notification from leica, be it an acknowledgement of the issue, the repair program, nothing. i certainly did not. and in fact, when i sent in some images showing the issue i had, the answer from cc was that the -----> spots !!!  are no more than dust. luckily, i didn't give in and they finally accepted my m9 suffered from sensor corrosion. in this instance, i think this is very poor \"support\".", "sortedWord": "None", "identifyer": 37105, "year": "2018"}, {"Unnamed: 0": 375887, "autor": "earleygallery", "date": 1531486440000, "content": " Thanks, does the Skopar still allow for a shallow DOF? also how does it compare to the \"cheap in leica terms\" Summarit 2.4? Shallow DOF isn't going to be a big feature in a wide angle lens but yes of course wide open the DOF will be relatively shallow (it also depends on relationship to you, the main subject and the background). There's a tendency on this forum to consider anything 'cheap' as inferior (although they're not cheap compared to most other camera brands). I can assure you that from my experience the Skopar if a very fine lens and I'd challenge you to spot the difference between the Skopar and Summarit viewing normal photos in normal size prints or on screen. I shot my side by side with a Summicron and couldn't tell them apart.", "link": "https://www.l-camera-forum.com/topic/286525-m9-first-35mm-lens-advise/page/2/?tab=comments#comment-3555118", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " thanks, does the skopar still allow for a shallow dof? also how does it compare to the \"cheap in leica terms\" summarit 2.4? shallow dof isn't going to be a big feature in a wide angle lens but yes of course wide open the dof will be relatively shallow (it also depends on relationship to you, the main subject and the background). there's a tendency on this forum to consider anything 'cheap' as inferior (although they're not cheap compared to most other camera brands). i can assure you that from my experience the skopar if a very fine lens and i'd challenge you to -----> spot !!!  the difference between the skopar and summarit viewing normal photos in normal size prints or on screen. i shot my side by side with a summicron and couldn't tell them apart.", "sortedWord": "None", "identifyer": 37195, "year": "2018"}, {"Unnamed: 0": 375889, "autor": "Ko.Fe.", "date": 1531488420000, "content": "Shallow DOF isn't going to be a big feature in a wide angle lens but yes of course wide open the DOF will be relatively shallow (it also depends on relationship to you, the main subject and the background). There's a tendency on this forum to consider anything 'cheap' as inferior (although they're not cheap compared to most other camera brands). I can assure you that from my experience the Skopar if a very fine lens and I'd challenge you to spot the difference between the Skopar and Summarit viewing normal photos in normal size prints or on screen. I shot my side by side with a Summicron and couldn't tell them apart. This is why I purchased Color Skopar three times. First time it was huge update from Jupiter-12 lack of ergonomics. But once I started to print in the darkroom, negatives taken with with lens were missing something. I changed from LTM camera to M and updated to PII Skopar. Same optical formula, but flare. Same flat prints. I updated it to Ultron 35 1.7 and it was superior to Skopar on darkroom prints. But Ultron's is no tab lens. I purchased Summarit 35 2.5 and by very first print I knew it is superior to Skopar lens. Difference is huge to my eyes. Yet, I bought third Skopar, original P and I think it is best build version among all three. I used it on M8, but every time I used Summarit images were better. Skopar is fine, small, nothing bad lens. But comparing it to Summarit is bad joke --img-- . But I can't say anything about Cron, don't need it with Summarit. This is why it is called Color Skopar. It is fine on color film. Digital pictures are OK, but they lack of something. I don't know how to put it, but basically Scopar is flat in rendering. But with Summarit I quickly became addicted to see images at 1:1. On M9 it gives incredible resolution and something else, which Skopar hasn't. Similar to what I see on darkroom prints. It is how edges are drawn. Summarit does it with micro contrast or details. Skopar draws it more primitive way.", "link": "https://www.l-camera-forum.com/topic/286525-m9-first-35mm-lens-advise/page/2/?tab=comments#comment-3555143", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "shallow dof isn't going to be a big feature in a wide angle lens but yes of course wide open the dof will be relatively shallow (it also depends on relationship to you, the main subject and the background). there's a tendency on this forum to consider anything 'cheap' as inferior (although they're not cheap compared to most other camera brands). i can assure you that from my experience the skopar if a very fine lens and i'd challenge you to -----> spot !!!  the difference between the skopar and summarit viewing normal photos in normal size prints or on screen. i shot my side by side with a summicron and couldn't tell them apart. this is why i purchased color skopar three times. first time it was huge update from jupiter-12 lack of ergonomics. but once i started to print in the darkroom, negatives taken with with lens were missing something. i changed from ltm camera to m and updated to pii skopar. same optical formula, but flare. same flat prints. i updated it to ultron 35 1.7 and it was superior to skopar on darkroom prints. but ultron's is no tab lens. i purchased summarit 35 2.5 and by very first print i knew it is superior to skopar lens. difference is huge to my eyes. yet, i bought third skopar, original p and i think it is best build version among all three. i used it on m8, but every time i used summarit images were better. skopar is fine, small, nothing bad lens. but comparing it to summarit is bad joke --img-- . but i can't say anything about cron, don't need it with summarit. this is why it is called color skopar. it is fine on color film. digital pictures are ok, but they lack of something. i don't know how to put it, but basically scopar is flat in rendering. but with summarit i quickly became addicted to see images at 1:1. on m9 it gives incredible resolution and something else, which skopar hasn't. similar to what i see on darkroom prints. it is how edges are drawn. summarit does it with micro contrast or details. skopar draws it more primitive way.", "sortedWord": "None", "identifyer": 37197, "year": "2018"}, {"Unnamed: 0": 375909, "autor": "TomB_tx", "date": 1530723960000, "content": "Still a good plan. I bought my M9 as a retirement gift in 2010, and use it just like a film Leica with lenses I bought in 1969. After 7 years I heard about the sensor corrosion issue, and checking closely found a couple of tiny spots that looked like the issue, so I sent it to Leica to evaluate. It took a few months, but came back like new, with the new corrosion resistant sensor at no charge (policy has changed now). Now I also have an M10 (and a Sony A7 for my old SLR lenses), but the M9 still gives stunning images, if you keep the ISO set to the low end (say 1250 max). Clearly look for one that has the upgraded sensor to avoid future problems. (Leica also replaced sensors with the old style before the new one was ready, so just \"replaced sensor\" may not mean the new style.) The M9 is at its best with 35 & 50 lenses, and I use 35 on it more, while on film used 50 more. The Zeiss ZM 35 f2.0 Biogon is a good match to the M9, and mine is sharper than my (older) Summicron. Likewise the Zeiss 50 f2 ZM Planar is pretty equal to the current 50 Summicron, but a bargain price. The M9 can benefit from faster lenses because of the ISO limitation, and I've actually enjoyed and gotten great images from the Voigtlander 35 f1.4 Nokton, which is very small, styled like the original 35 Summilux from the 1960s. The Nokton has barrel distortion and focus shifts to the rear as it is stopped down, but is nice to use on the M9, especially in dim light where the focus shift isn't an issue. It's also about the cheapest 35. The Voigtlander 50 Nokton 1.5 (Asph) is a fine performing fast 50, (and lower cost) but the very narrow focus ring takes some getting used to. I've been using it more on my M9. Image quality is quite close to Leica or Zeiss, and construction quality is very good. For Leica lenses I now prefer the Summarit f2.5 lenses in 35 & 50 for their small size, great handling, and good flare resistance. I used them on my M10 most of the time, as the M10 high ISO means I don't need fast lenses for it.", "link": "https://www.l-camera-forum.com/topic/286261-buying-advise-for-a-used-m9/?tab=comments#comment-3549520", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "still a good plan. i bought my m9 as a retirement gift in 2010, and use it just like a film leica with lenses i bought in 1969. after 7 years i heard about the sensor corrosion issue, and checking closely found a couple of tiny -----> spots !!!  that looked like the issue, so i sent it to leica to evaluate. it took a few months, but came back like new, with the new corrosion resistant sensor at no charge (policy has changed now). now i also have an m10 (and a sony a7 for my old slr lenses), but the m9 still gives stunning images, if you keep the iso set to the low end (say 1250 max). clearly look for one that has the upgraded sensor to avoid future problems. (leica also replaced sensors with the old style before the new one was ready, so just \"replaced sensor\" may not mean the new style.) the m9 is at its best with 35 & 50 lenses, and i use 35 on it more, while on film used 50 more. the zeiss zm 35 f2.0 biogon is a good match to the m9, and mine is sharper than my (older) summicron. likewise the zeiss 50 f2 zm planar is pretty equal to the current 50 summicron, but a bargain price. the m9 can benefit from faster lenses because of the iso limitation, and i've actually enjoyed and gotten great images from the voigtlander 35 f1.4 nokton, which is very small, styled like the original 35 summilux from the 1960s. the nokton has barrel distortion and focus shifts to the rear as it is stopped down, but is nice to use on the m9, especially in dim light where the focus shift isn't an issue. it's also about the cheapest 35. the voigtlander 50 nokton 1.5 (asph) is a fine performing fast 50, (and lower cost) but the very narrow focus ring takes some getting used to. i've been using it more on my m9. image quality is quite close to leica or zeiss, and construction quality is very good. for leica lenses i now prefer the summarit f2.5 lenses in 35 & 50 for their small size, great handling, and good flare resistance. i used them on my m10 most of the time, as the m10 high iso means i don't need fast lenses for it.", "sortedWord": "None", "identifyer": 37217, "year": "2018"}, {"Unnamed: 0": 376285, "autor": "Robert M Poole", "date": 1526294700000, "content": "My concern would be the weight of traveling with two Leicas with lenses to gain not a massive difference in focal length. The M9 is a fantastic camera, issues with it are 'poor' high ISO capabilities. The sweet spot seems to be ISO 160. I tend to shoot at low iso then under expose and pull back shadow detail in lightroom which usually gives a less noisy image. The buffer is also an issue if you shoot 6/7 images on quick succession it tends to lock up the camera for a short time which is irritating. Advantages: CCD sensor is amazing, will you be post processing the m10 images to match the M9? Simplicity, no video, no bells and whistles. Not a lot to set up just go out and shoot. Difference between m9 and ME is the colour, lack of USB port (never used this anyway) lack of frame line lever (very rarely used this)", "link": "https://www.l-camera-forum.com/topic/284570-a-m9me-as-a-travel-companion-to-my-m10/?tab=comments#comment-3518345", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my concern would be the weight of traveling with two leicas with lenses to gain not a massive difference in focal length. the m9 is a fantastic camera, issues with it are 'poor' high iso capabilities. the sweet -----> spot !!!  seems to be iso 160. i tend to shoot at low iso then under expose and pull back shadow detail in lightroom which usually gives a less noisy image. the buffer is also an issue if you shoot 6/7 images on quick succession it tends to lock up the camera for a short time which is irritating. advantages: ccd sensor is amazing, will you be post processing the m10 images to match the m9? simplicity, no video, no bells and whistles. not a lot to set up just go out and shoot. difference between m9 and me is the colour, lack of usb port (never used this anyway) lack of frame line lever (very rarely used this)", "sortedWord": "None", "identifyer": 37594, "year": "2018"}, {"Unnamed: 0": 376659, "autor": "Sspector15", "date": 1524166380000, "content": "My M9 had a shutter failure (locked up) in April 2015. I sent it to NJ for repair and they also replaced the sensor; this was May 2015 and it took a couple of weeks. My Monochrome went in for its second sensor in February; the M9 went back for a second one this month. BOTH CAMERAS OUT AT THE SAME TIME!!! AACK. I thought I may have caused the corrosion during an attempt at wet cleaning, but the crystalline spots were there on images from last November. This time, I was looking at $925 for the replacement and an indeterminate service date (like 6-9 months). The 9 months is just too long to wait, so I've opted for the upgrade to a 262 (and I'll be patient awaiting the Monochrome's return--irreplaceable). I hope I made the right choice. I tried going back to film for a few rolls on my M6.... embarrassing, I'm afraid. It's like going back to playing guitar -- lot's of relearning.", "link": "https://www.l-camera-forum.com/topic/282738-m9-long-term/page/5/?tab=comments#comment-3503277", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "my m9 had a shutter failure (locked up) in april 2015. i sent it to nj for repair and they also replaced the sensor; this was may 2015 and it took a couple of weeks. my monochrome went in for its second sensor in february; the m9 went back for a second one this month. both cameras out at the same time!!! aack. i thought i may have caused the corrosion during an attempt at wet cleaning, but the crystalline -----> spots !!!  were there on images from last november. this time, i was looking at $925 for the replacement and an indeterminate service date (like 6-9 months). the 9 months is just too long to wait, so i've opted for the upgrade to a 262 (and i'll be patient awaiting the monochrome's return--irreplaceable). i hope i made the right choice. i tried going back to film for a few rolls on my m6.... embarrassing, i'm afraid. it's like going back to playing guitar -- lot's of relearning.", "sortedWord": "None", "identifyer": 37970, "year": "2018"}, {"Unnamed: 0": 376661, "autor": "JSU", "date": 1524884640000, "content": "My M9 had a shutter failure (locked up) in April 2015. I sent it to NJ for repair and they also replaced the sensor; this was May 2015 and it took a couple of weeks. My Monochrome went in for its second sensor in February; the M9 went back for a second one this month. BOTH CAMERAS OUT AT THE SAME TIME!!! AACK. I thought I may have caused the corrosion during an attempt at wet cleaning, but the crystalline spots were there on images from last November. This time, I was looking at $925 for the replacement and an indeterminate service date (like 6-9 months). The 9 months is just too long to wait, so I've opted for the upgrade to a 262 (and I'll be patient awaiting the Monochrome's return--irreplaceable). I hope I made the right choice. I tried going back to film for a few rolls on my M6.... embarrassing, I'm afraid. It's like going back to playing guitar -- lot's of relearning. I was quoted, and have written checks for, $960 per body for replacing sensors in both my M9-P bodies and return shipping. Only time will tell. My M6 Classic bodies still get a few rolls of Tri-X each per year, not quite the 20 rolls per week (average) I shot for decades before my daily newspaper went digital and the Leicas went to a shelf at home. I long for the days of sending in my M3, M2 & M4 bodies for a clean & check and seeing on the repair docs: \"returned to original Leitz tolerances and specifications.\" I never sent in my M6 bodies, I just used them from the day they came out of the box. Leica does not give me that level of confidence now. Maybe again, someday, only time will tell. It will take a while, a long while.", "link": "https://www.l-camera-forum.com/topic/282738-m9-long-term/page/5/?tab=comments#comment-3508234", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "my m9 had a shutter failure (locked up) in april 2015. i sent it to nj for repair and they also replaced the sensor; this was may 2015 and it took a couple of weeks. my monochrome went in for its second sensor in february; the m9 went back for a second one this month. both cameras out at the same time!!! aack. i thought i may have caused the corrosion during an attempt at wet cleaning, but the crystalline -----> spots !!!  were there on images from last november. this time, i was looking at $925 for the replacement and an indeterminate service date (like 6-9 months). the 9 months is just too long to wait, so i've opted for the upgrade to a 262 (and i'll be patient awaiting the monochrome's return--irreplaceable). i hope i made the right choice. i tried going back to film for a few rolls on my m6.... embarrassing, i'm afraid. it's like going back to playing guitar -- lot's of relearning. i was quoted, and have written checks for, $960 per body for replacing sensors in both my m9-p bodies and return shipping. only time will tell. my m6 classic bodies still get a few rolls of tri-x each per year, not quite the 20 rolls per week (average) i shot for decades before my daily newspaper went digital and the leicas went to a shelf at home. i long for the days of sending in my m3, m2 & m4 bodies for a clean & check and seeing on the repair docs: \"returned to original leitz tolerances and specifications.\" i never sent in my m6 bodies, i just used them from the day they came out of the box. leica does not give me that level of confidence now. maybe again, someday, only time will tell. it will take a while, a long while.", "sortedWord": "None", "identifyer": 37972, "year": "2018"}, {"Unnamed: 0": 377006, "autor": "Rus", "date": 1523024580000, "content": "I’m not sure when the sensor was replaced. I’ll have to ask the seller. One thing that comes to mind is that from what I’ve read on this forum, most M9’s (but not all) that were sent to Leica for sensor replacement came back fully refurbished cosmetically. Since this M9 has bronzing and scruffing, it is possible that either the sensor was replaced some time ago, or Leica did not refurbish it cosmetically. I’ll ask the seller about this. I'm not so sure about the good-will refurbishment. My M9 came back without no refurbishment. I sent it to Leica Wetzlar in March 2016 for circuit board problems. It came back with the new corrosion-free sensor and new firmware, but with all the familiar brassing. That said, when a couple of years prior to that I sent in my M9 for shutter problems, it did come back with apparently a new LCD and button/dial panel assembly. You may also get an indication of the sensor type by going into the hardware info menu. Do the button dance and see how it is as per this very useful thread: https://www.l-camera-forum.com/topic/272556-determining-new-sensor-m9/ Of course, the only way to be sure is to ask Leica directly. I did send them an email about the sensor type after I got it back, as I spotted the new firmware and saw nothing in the service log besides a vague phrase: adjust sensor. Edited April 6, 2018 by Rus", "link": "https://www.l-camera-forum.com/topic/283415-m9-buying-advice/?tab=comments#comment-3495307", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "i’m not sure when the sensor was replaced. i’ll have to ask the seller. one thing that comes to mind is that from what i’ve read on this forum, most m9’s (but not all) that were sent to leica for sensor replacement came back fully refurbished cosmetically. since this m9 has bronzing and scruffing, it is possible that either the sensor was replaced some time ago, or leica did not refurbish it cosmetically. i’ll ask the seller about this. i'm not so sure about the good-will refurbishment. my m9 came back without no refurbishment. i sent it to leica wetzlar in march 2016 for circuit board problems. it came back with the new corrosion-free sensor and new firmware, but with all the familiar brassing. that said, when a couple of years prior to that i sent in my m9 for shutter problems, it did come back with apparently a new lcd and button/dial panel assembly. you may also get an indication of the sensor type by going into the hardware info menu. do the button dance and see how it is as per this very useful thread: https://www.l-camera-forum.com/topic/272556-determining-new-sensor-m9/ of course, the only way to be sure is to ask leica directly. i did send them an email about the sensor type after i got it back, as i -----> spotted !!!  the new firmware and saw nothing in the service log besides a vague phrase: adjust sensor. edited april 6, 2018 by rus", "sortedWord": "None", "identifyer": 38317, "year": "2018"}, {"Unnamed: 0": 377404, "autor": "pico", "date": 1518136200000, "content": "That small lonely speck is the dreaded corrosion invader! The halo around the spot is the giveaway. It is just one spot and if no other show up it is easy enough to correct. In my case the number of spots grew - on the original sensor and then on the first replacement. All ok now. He is right that the little corrosion spot(s) are easy to correct. If you have Photoshop (probably other software, too) you can make an action that clones it away because corrosion spots are always in the same location. You are doing very well. Enjoy! Edited February 9, 2018 by pico", "link": "https://www.l-camera-forum.com/topic/279688-m9-sensor-cleaning-report/?tab=comments#comment-3458075", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "that small lonely speck is the dreaded corrosion invader! the halo around the -----> spot !!!  is the giveaway. it is just one spot and if no other show up it is easy enough to correct. in my case the number of spots grew - on the original sensor and then on the first replacement. all ok now. he is right that the little corrosion spot(s) are easy to correct. if you have photoshop (probably other software, too) you can make an action that clones it away because corrosion spots are always in the same location. you are doing very well. enjoy! edited february 9, 2018 by pico", "sortedWord": "None", "identifyer": 38716, "year": "2018"}, {"Unnamed: 0": 380330, "autor": "lct", "date": 1522176240000, "content": "In a nutshell: - Summicron 28/2 v1 or v2. Superb lens but expensive. - Elmarit-M 28/2.8 asph v1. Excellent lens. Perfect match with the M8. No experience with v2. - M-Rokkor 28/2.8. Very good lens, even smaller than the Elmarit asph above, but the bayonet must be modified or replaced to trigger 28mm framelines and some copies have white spots on the black coating of the innards of the lens. - Zeiss 28/2.8. Very good lens i've been told but l have no experience with it. - Voigtlander 28/1.9. Very good lens i've been told but l have no experience with it. - Voigtlander 28/2. Very good lens but too much focus shift on rangefinders. Cannot recommend it for this reason.", "link": "https://www.l-camera-forum.com/topic/283155-28-mm-lens-suggestions/?tab=comments#comment-3489004", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "in a nutshell: - summicron 28/2 v1 or v2. superb lens but expensive. - elmarit-m 28/2.8 asph v1. excellent lens. perfect match with the m8. no experience with v2. - m-rokkor 28/2.8. very good lens, even smaller than the elmarit asph above, but the bayonet must be modified or replaced to trigger 28mm framelines and some copies have white -----> spots !!!  on the black coating of the innards of the lens. - zeiss 28/2.8. very good lens i've been told but l have no experience with it. - voigtlander 28/1.9. very good lens i've been told but l have no experience with it. - voigtlander 28/2. very good lens but too much focus shift on rangefinders. cannot recommend it for this reason.", "sortedWord": "None", "identifyer": 41718, "year": "2018"}, {"Unnamed: 0": 380357, "autor": "jaapv", "date": 1544436120000, "content": "3 hours ago, kknox55@gmail.com said: I have an M8.2. I have a few 6 bit coded lens they all show the lens info. Today i put on the camera for first time a Zeiss 28 Zm. Shot a few pics then looked at the info. The camera photo info showed 28mm. The other two M8 cameras I have owned and sold never showed the info on non coded lens. Strange is this normal? It might have a screw in just the right spot.", "link": "https://www.l-camera-forum.com/topic/292182-my-m82-recognizes-lens-wout-coded-lens/?tab=comments#comment-3644912", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "3 hours ago, kknox55@gmail.com said: i have an m8.2. i have a few 6 bit coded lens they all show the lens info. today i put on the camera for first time a zeiss 28 zm. shot a few pics then looked at the info. the camera photo info showed 28mm. the other two m8 cameras i have owned and sold never showed the info on non coded lens. strange is this normal? it might have a screw in just the right -----> spot !!! .", "sortedWord": "None", "identifyer": 41745, "year": "2018"}, {"Unnamed: 0": 380416, "autor": "david strachan", "date": 1542680160000, "content": "Good one Trivette. One of the bonuses is the camera uses the central \"sweet spot\" of the lens...no corner smears, no CA, no colour edges, just a great image which prints very well. I still use mine a lot (have two) even though i also enjoy my M-P typ 240. ...", "link": "https://www.l-camera-forum.com/topic/291458-m8-should-i/?tab=comments#comment-3633958", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "good one trivette. one of the bonuses is the camera uses the central \"sweet -----> spot !!! \" of the lens...no corner smears, no ca, no colour edges, just a great image which prints very well. i still use mine a lot (have two) even though i also enjoy my m-p typ 240. ...", "sortedWord": "None", "identifyer": 41804, "year": "2018"}, {"Unnamed: 0": 380417, "autor": "Trivette", "date": 1542683520000, "content": "1 hour ago, david strachan said: Good one Trivette. One of the bonuses is the camera uses the central \"sweet spot\" of the lens...no corner smears, no CA, no colour edges, just a great image which prints very well. I still use mine a lot (have two) even though i also enjoy my M-P typ 240. ... Thanks David. Being restricted to the sweet spot of the lens by the sensor (1.33 crop factor) doesn't bother me at all. Of course, 35mm film lenses weren't originally designed for a digital sensor anyhow. I'm using Zeiss Biogon 35mm and 28mm lenses, and an Elmar 50/2.8. (My Summicron 50/2 was badly damaged by virus during years of neglect.) Off topic suggestion: Any photographer living in a warm, humid environment should consider getting an electronic dry box. A relatively small outlay for the box could potentially save thousands of dollars. Edited November 20, 2018 by Trivette", "link": "https://www.l-camera-forum.com/topic/291458-m8-should-i/?tab=comments#comment-3633974", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "1 hour ago, david strachan said: good one trivette. one of the bonuses is the camera uses the central \"sweet -----> spot !!! \" of the lens...no corner smears, no ca, no colour edges, just a great image which prints very well. i still use mine a lot (have two) even though i also enjoy my m-p typ 240. ... thanks david. being restricted to the sweet spot of the lens by the sensor (1.33 crop factor) doesn't bother me at all. of course, 35mm film lenses weren't originally designed for a digital sensor anyhow. i'm using zeiss biogon 35mm and 28mm lenses, and an elmar 50/2.8. (my summicron 50/2 was badly damaged by virus during years of neglect.) off topic suggestion: any photographer living in a warm, humid environment should consider getting an electronic dry box. a relatively small outlay for the box could potentially save thousands of dollars. edited november 20, 2018 by trivette", "sortedWord": "None", "identifyer": 41805, "year": "2018"}, {"Unnamed: 0": 382196, "autor": "Raid Amin", "date": 1543087860000, "content": " My M8 had some hot spots or pixels that crated a thin line on one side of each image. It cost me $500 to get the repair package at Leica NJ. These are my first results with the repaired M8 and the Version 1 35mm Summicron. I used LR5 to transfer the DNG files to jpg, and no pp has been yet used with any of these images. I need to straighten out the horizon in some of the images. smugnug link: https://raid.smugmug.com/M835Cron2018/ --img--  --img--  --img--  --img--  --img--  I have a one year warranty on the work done to the M8. I like using older lenses for beach images with white sand and light green water. The not-so-high contrast lenses work nicely there. Edited November 24, 2018 by Raid Amin", "link": "https://www.l-camera-forum.com/topic/291744-my-m8-got-repaired-by-leica/?tab=comments#comment-3636496", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " my m8 had some hot -----> spots !!!  or pixels that crated a thin line on one side of each image. it cost me $500 to get the repair package at leica nj. these are my first results with the repaired m8 and the version 1 35mm summicron. i used lr5 to transfer the dng files to jpg, and no pp has been yet used with any of these images. i need to straighten out the horizon in some of the images. smugnug link: https://raid.smugmug.com/m835cron2018/ --img--  --img--  --img--  --img--  --img--  i have a one year warranty on the work done to the m8. i like using older lenses for beach images with white sand and light green water. the not-so-high contrast lenses work nicely there. edited november 24, 2018 by raid amin", "sortedWord": "None", "identifyer": 43594, "year": "2018"}, {"Unnamed: 0": 382319, "autor": "jaapv", "date": 1538417640000, "content": "I am quite puzzled by the expression \"take my lenses\". Why shouldn't the M8 not do so? In fact, they will perform better than on full frame as you will be using the sweet spot. The size of the sensor does not change anything on the lens, it just crops the image you record. It is not a small sensor, it is the closest to full frame you can get. You use your lenses like before, and for convenience you calculate the angle of view as follows . 28=35, 35=50 Not quite exact, but close enough. Why should you use a non-Leica lens if you have got perfectly good ones Leica ones that you are happy with? For the record: Both Zeiss and Voigtländer make good lenses too. Designed for full-frame as well as Leica, BTW. And... Buy an M9. You will have the same sensor as the M8, only larger and with fewer IR problems. The B&W will look virtually the same. The only caveat - the original M9 sensor had corrosion problems. Leica has replaced those recently by corrosion-free ones. get a camera with a new corrosion-free sensor. that means buying from a trusted dealer.", "link": "https://www.l-camera-forum.com/topic/286634-some-question-for-m8/page/2/?tab=comments#comment-3604294", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i am quite puzzled by the expression \"take my lenses\". why shouldn't the m8 not do so? in fact, they will perform better than on full frame as you will be using the sweet -----> spot !!! . the size of the sensor does not change anything on the lens, it just crops the image you record. it is not a small sensor, it is the closest to full frame you can get. you use your lenses like before, and for convenience you calculate the angle of view as follows . 28=35, 35=50 not quite exact, but close enough. why should you use a non-leica lens if you have got perfectly good ones leica ones that you are happy with? for the record: both zeiss and voigtländer make good lenses too. designed for full-frame as well as leica, btw. and... buy an m9. you will have the same sensor as the m8, only larger and with fewer ir problems. the b&w will look virtually the same. the only caveat - the original m9 sensor had corrosion problems. leica has replaced those recently by corrosion-free ones. get a camera with a new corrosion-free sensor. that means buying from a trusted dealer.", "sortedWord": "None", "identifyer": 43718, "year": "2018"}, {"Unnamed: 0": 382320, "autor": "LyleBright", "date": 1538420340000, "content": "\"I am quite puzzled by the expression \"take my lenses\". Why shouldn't the M8 not do so? In fact, they will perform better than on full frame as you will be using the sweet spot.\" I began using an Olympus PEN M43 body some years back. I bought adaptors to use my Leica lenses on this camera (and another adaptor for my Nikon lenses). They all worked, although the camera did what the M8 would do. Used a portion, but not all, the lens was providing. Thus (as you know) a 28mm became a 55mm-60mm and so on and so forth. I lost the feeling and the charm of shooting my 35mm Leica lens on the M4-P. Might have been *irrational* but there you have it. So, when you said that the M9, with the larger sensor, would function the same as with the M4-P (35x24 mm sensor), I used the phrase 'take my lenses' as they were manufactured to be used. \"In fact, they will perform better than on full frame as you will be using the sweet spot.\" You bring up an interesting point though. I wonder if this is some part of the reason M8 shooters rave about their images? Because they are working (more) in that sweet spot? -- Lyle", "link": "https://www.l-camera-forum.com/topic/286634-some-question-for-m8/page/2/?tab=comments#comment-3604320", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "\"i am quite puzzled by the expression \"take my lenses\". why shouldn't the m8 not do so? in fact, they will perform better than on full frame as you will be using the sweet -----> spot !!! .\" i began using an olympus pen m43 body some years back. i bought adaptors to use my leica lenses on this camera (and another adaptor for my nikon lenses). they all worked, although the camera did what the m8 would do. used a portion, but not all, the lens was providing. thus (as you know) a 28mm became a 55mm-60mm and so on and so forth. i lost the feeling and the charm of shooting my 35mm leica lens on the m4-p. might have been *irrational* but there you have it. so, when you said that the m9, with the larger sensor, would function the same as with the m4-p (35x24 mm sensor), i used the phrase 'take my lenses' as they were manufactured to be used. \"in fact, they will perform better than on full frame as you will be using the sweet -----> spot !!! .\" you bring up an interesting point though. i wonder if this is some part of the reason m8 shooters rave about their images? because they are working (more) in that sweet spot? -- lyle", "sortedWord": "None", "identifyer": 43719, "year": "2018"}, {"Unnamed: 0": 382373, "autor": "yasha", "date": 1536484860000, "content": "I'm having exactly the same problem with my M8, just got a week ago from eBay and after taking the first picture I saw that line almost in the sea spot as yours", "link": "https://www.l-camera-forum.com/topic/288281-my-m8-seems-to-require-repair-take-a-look/page/3/?tab=comments#comment-3589907", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i'm having exactly the same problem with my m8, just got a week ago from ebay and after taking the first picture i saw that line almost in the sea -----> spot !!!  as yours", "sortedWord": "None", "identifyer": 43772, "year": "2018"}, {"Unnamed: 0": 382384, "autor": "JMF", "date": 1536841980000, "content": "If Leica's repair estimate will be too high for me, I will start learning how to use pixel fixer, and I do have Windows 10. Oh well. For a while before sending my M8 for remapping, I was using the Spot healing brush tool from Photopshop CS6 to clean up the dead pixel line on my affected pictures.", "link": "https://www.l-camera-forum.com/topic/288281-my-m8-seems-to-require-repair-take-a-look/page/3/?tab=comments#comment-3592407", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "if leica's repair estimate will be too high for me, i will start learning how to use pixel fixer, and i do have windows 10. oh well. for a while before sending my m8 for remapping, i was using the -----> spot !!!  healing brush tool from photopshop cs6 to clean up the dead pixel line on my affected pictures.", "sortedWord": "None", "identifyer": 43783, "year": "2018"}, {"Unnamed: 0": 382433, "autor": "farnz", "date": 1527275340000, "content": " I've been shooting infra-red handheld with my M8 for about 10 years and my favourite lens, which has no IR hot-spot, is the 21/2.8 Kobalux (which is also sold under the Avenon brand). Before that I used the Voigtlander 35/1.2 Nokton v1 and there was no obvious hot-spot on that. (Wide open it understandably vignettes a lot, which might be mistaken as a hot-spot at such a wide aperture but it's not.) I used the Voigtlander 15/4.5 Ultra-wide Heliar v1 (LTM) for a while and it had no hot-spot but it became awkward to attach the IR filter owing to no filter thread and a fixed semi-hood. The 35/3.5 Summaron has a reputation for having no IR hot-spot but I can't confirm since I haven't used it. Pete.", "link": "https://www.l-camera-forum.com/topic/98926-lenses-for-infrared-photography-with-m8/?tab=comments#comment-3525253", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " i've been shooting infra-red handheld with my m8 for about 10 years and my favourite lens, which has no ir hot------> spot !!! , is the 21/2.8 kobalux (which is also sold under the avenon brand). before that i used the voigtlander 35/1.2 nokton v1 and there was no obvious hot-spot on that. (wide open it understandably vignettes a lot, which might be mistaken as a hot-spot at such a wide aperture but it's not.) i used the voigtlander 15/4.5 ultra-wide heliar v1 (ltm) for a while and it had no hot-spot but it became awkward to attach the ir filter owing to no filter thread and a fixed semi-hood. the 35/3.5 summaron has a reputation for having no ir hot-spot but i can't confirm since i haven't used it. pete.", "sortedWord": "None", "identifyer": 43832, "year": "2018"}, {"Unnamed: 0": 382434, "autor": "jaapv", "date": 1527275820000, "content": "Summarit 5 cm/1.5 has no hot spot either. APO lenses should exhibit less focus shift.", "link": "https://www.l-camera-forum.com/topic/98926-lenses-for-infrared-photography-with-m8/?tab=comments#comment-3525257", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "summarit 5 cm/1.5 has no hot -----> spot !!!  either. apo lenses should exhibit less focus shift.", "sortedWord": "None", "identifyer": 43833, "year": "2018"}, {"Unnamed: 0": 382437, "autor": "enboe", "date": 1527430080000, "content": "I use the 28/2.8/ASPH-I and the vintage Leica E39 IR filter and have good luck, no hot spots.", "link": "https://www.l-camera-forum.com/topic/98926-lenses-for-infrared-photography-with-m8/?tab=comments#comment-3526113", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i use the 28/2.8/asph-i and the vintage leica e39 ir filter and have good luck, no hot -----> spots !!! .", "sortedWord": "None", "identifyer": 43836, "year": "2018"}, {"Unnamed: 0": 382440, "autor": "Rune", "date": 1527687360000, "content": "Hi! So far I have tried and used a 28mm Elmarit-M ASPH (mkI) and a 50mm Summilux from 1971 with a Ø43mm original Leica filter, probably something like a R72 (+ a StepDown ring with the 28mm..), and a 21mm Elmarit-M ASPH and a 90mm Summicron (pre-ASPH) with a cheap eBay Ø55mm 950nm filter, and I have not detected any hot-spots as I can find with any of these lenses.. I haven't looked at very many photos yet, so if I see it in the future I will correct myself... --img--  Best regards, Rune --img-- ", "link": "https://www.l-camera-forum.com/topic/98926-lenses-for-infrared-photography-with-m8/?tab=comments#comment-3528341", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "hi! so far i have tried and used a 28mm elmarit-m asph (mki) and a 50mm summilux from 1971 with a ø43mm original leica filter, probably something like a r72 (+ a stepdown ring with the 28mm..), and a 21mm elmarit-m asph and a 90mm summicron (pre-asph) with a cheap ebay ø55mm 950nm filter, and i have not detected any hot------> spots !!!  as i can find with any of these lenses.. i haven't looked at very many photos yet, so if i see it in the future i will correct myself... --img--  best regards, rune --img-- ", "sortedWord": "None", "identifyer": 43839, "year": "2018"}, {"Unnamed: 0": 382679, "autor": "rivi1969", "date": 1524543420000, "content": " Good evening, Last week I took some pictures of the bright sky with no clouds with my M8 and I discover a lot of dirt spots on the files. I have the liquid and brush to clean my Sony A7 so I wonder if it is safe to perform the operation myself or if the CCD sensor requires a different product or procedure. I don't want to send my camera six months to Leica for that. Thank you in advance, Ricardo --img-- ", "link": "https://www.l-camera-forum.com/topic/283962-m8-sensor-cleaning-advice/?tab=comments#comment-3505677", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " good evening, last week i took some pictures of the bright sky with no clouds with my m8 and i discover a lot of dirt -----> spots !!!  on the files. i have the liquid and brush to clean my sony a7 so i wonder if it is safe to perform the operation myself or if the ccd sensor requires a different product or procedure. i don't want to send my camera six months to leica for that. thank you in advance, ricardo --img-- ", "sortedWord": "None", "identifyer": 44078, "year": "2018"}, {"Unnamed: 0": 382680, "autor": "romanus53", "date": 1524544320000, "content": "looks quiet normal to me, use a dust-blower, no canned air. Most of the spots will go, new will come, I use Capture 1 for the rest. Don't worry, enjoy your M8!", "link": "https://www.l-camera-forum.com/topic/283962-m8-sensor-cleaning-advice/?tab=comments#comment-3505678", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "looks quiet normal to me, use a dust-blower, no canned air. most of the -----> spots !!!  will go, new will come, i use capture 1 for the rest. don't worry, enjoy your m8!", "sortedWord": "None", "identifyer": 44079, "year": "2018"}, {"Unnamed: 0": 382741, "autor": "lct", "date": 1521503640000, "content": "Welcome to the forum --img-- Your pic is too small i suspect as i don't see any white spot.", "link": "https://www.l-camera-forum.com/topic/282881-ccd-exchange/?tab=comments#comment-3483917", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "welcome to the forum --img-- your pic is too small i suspect as i don't see any white -----> spot !!! .", "sortedWord": "None", "identifyer": 44140, "year": "2018"}, {"Unnamed: 0": 382748, "autor": "chris_livsey", "date": 1521799620000, "content": "I can see dots in vertical lines leading down from the green light in the middle. Pete. Pete If you open the shot as posted and push the sliders you will see, and partially visible as posted, a second line to the right of descending dots. these look like a loop chain to control the light/fan and are not a result of flare/reflections. The fan blades become discernible when pushed BTW, hardly seen as posted. If you really push the sliders the noise pattern becomes very visible over the image and could be mistaken for \"the dark parts have a lot of white spots\" as posted the dark is quite clean. Edited March 23, 2018 by chris_livsey", "link": "https://www.l-camera-forum.com/topic/282881-ccd-exchange/?tab=comments#comment-3486032", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i can see dots in vertical lines leading down from the green light in the middle. pete. pete if you open the shot as posted and push the sliders you will see, and partially visible as posted, a second line to the right of descending dots. these look like a loop chain to control the light/fan and are not a result of flare/reflections. the fan blades become discernible when pushed btw, hardly seen as posted. if you really push the sliders the noise pattern becomes very visible over the image and could be mistaken for \"the dark parts have a lot of white -----> spots !!! \" as posted the dark is quite clean. edited march 23, 2018 by chris_livsey", "sortedWord": "None", "identifyer": 44147, "year": "2018"}, {"Unnamed: 0": 382749, "autor": "farnz", "date": 1521800580000, "content": "Pete If you open the shot as posted and push the sliders you will see, and partially visible as posted, a second line to the right of descending dots. these look like a loop chain to control the light/fan and are not a result of flare/reflections. The fan blades become discernible when pushed BTW, hardly seen as posted. If you really push the sliders the noise pattern becomes very visible over the image and could be mistaken for \"the dark parts have a lot of white spots\" as posted the dark is quite clean. Thanks, Chris, I've only viewed the picture on screen and wondered whether there might be a pull-chain somewhere. Pete.", "link": "https://www.l-camera-forum.com/topic/282881-ccd-exchange/?tab=comments#comment-3486045", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "pete if you open the shot as posted and push the sliders you will see, and partially visible as posted, a second line to the right of descending dots. these look like a loop chain to control the light/fan and are not a result of flare/reflections. the fan blades become discernible when pushed btw, hardly seen as posted. if you really push the sliders the noise pattern becomes very visible over the image and could be mistaken for \"the dark parts have a lot of white -----> spots !!! \" as posted the dark is quite clean. thanks, chris, i've only viewed the picture on screen and wondered whether there might be a pull-chain somewhere. pete.", "sortedWord": "None", "identifyer": 44148, "year": "2018"}, {"Unnamed: 0": 382759, "autor": "david strachan", "date": 1521516300000, "content": "The gel sticks leave ring artifacts, in my experience. I wanted them to work...but no. Liquid and good sticks, is, in my opinion, the best way to go. Once a year, and use a blower sometimes. But i very rarely shoot above f5.6. A careful scrute in LR will reveal spots worth cloning...just part of the digital photography world really.. ... Edited March 20, 2018 by david strachan", "link": "https://www.l-camera-forum.com/topic/121661-m8-sensor-cleaning/?tab=comments#comment-3483955", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "the gel sticks leave ring artifacts, in my experience. i wanted them to work...but no. liquid and good sticks, is, in my opinion, the best way to go. once a year, and use a blower sometimes. but i very rarely shoot above f5.6. a careful scrute in lr will reveal -----> spots !!!  worth cloning...just part of the digital photography world really.. ... edited march 20, 2018 by david strachan", "sortedWord": "None", "identifyer": 44158, "year": "2018"}, {"Unnamed: 0": 382807, "autor": "PCPix", "date": 1520854980000, "content": " Bought an unused Nokton 50/1.1 for 600 Euro a few days ago and tested it beforehand. Found backfocus with a constant amount of turn of the focus ring to focus correctly, so I trusted I would be able to correct that. As suggested earlier in this thread that the cam could be polished is wrong when the lens backfocusses! The cam is too short, not too long. So, in very small steps I compressed the cam of the lens by tapping on it with a small hammer, using a flat headed pin (diameter 3 mm) exactly in the middle where it (when mounted) rests agains the rangefinder wheel of the camera. The other side of the cam was supported well with a steel flat object. This compression makes the cam a bit longer (just a few hundredth of a mm) and now the lens focusses exact throughout the range of focussing, from 1 meter to infinity. It took me about half an hour to correct it. It is not necessary to take the lens apart. There is enough room for the pin to reach the cam from the inside when the lens is set to infinity. The outside of the cam is supported by the steel flat object. the lens is supported with a bean bag for instance. So perhaps worthwhile for those who feel they have an overpriced paperweight. --img--  But beware: you need only light hammer taps to get the effect needed. If you did too much, you can file it off with a very fine diamond-powdered file, but when you take your time, that is not needed. Tap not quite at the edge of the cam, you want the edge to remain smooth, just about 2 or 3 mm away from the edge with the pin lightly resting on it. Here an example of how well it focusses, taken at f/1.1, focussed on the lips (square crop at full height taken with the M9, no post-processing): click (I dremel coded the lens as a Noctilux 1.0) The lens certainly is worth being corrected, because it is very sharp indeed. Ok - I know this is a very old post, however I have just made this adjustment using a 25mm socket as the 'anvil' (which exactly matched the radius of the focus cam) and a wide blade screwdriver as the 'punch' and with the lens suitably supported so all impact goes only into the focus cam/tab - with some very gentle tapping it brought the back focus forward to precise focus on my M10. Very happy with the results coming off the lens now and absolutely bang on all the way through the focus range. BTW this lens was my only lens that was off, Summilux 35mm FLE, Summicron 75mm, Elamrit 90mm all spot on, so no suspicion of the body being out.", "link": "https://www.l-camera-forum.com/topic/107823-nokton-50mm-f11-backfocus/page/3/?tab=comments#comment-3479250", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " bought an unused nokton 50/1.1 for 600 euro a few days ago and tested it beforehand. found backfocus with a constant amount of turn of the focus ring to focus correctly, so i trusted i would be able to correct that. as suggested earlier in this thread that the cam could be polished is wrong when the lens backfocusses! the cam is too short, not too long. so, in very small steps i compressed the cam of the lens by tapping on it with a small hammer, using a flat headed pin (diameter 3 mm) exactly in the middle where it (when mounted) rests agains the rangefinder wheel of the camera. the other side of the cam was supported well with a steel flat object. this compression makes the cam a bit longer (just a few hundredth of a mm) and now the lens focusses exact throughout the range of focussing, from 1 meter to infinity. it took me about half an hour to correct it. it is not necessary to take the lens apart. there is enough room for the pin to reach the cam from the inside when the lens is set to infinity. the outside of the cam is supported by the steel flat object. the lens is supported with a bean bag for instance. so perhaps worthwhile for those who feel they have an overpriced paperweight. --img--  but beware: you need only light hammer taps to get the effect needed. if you did too much, you can file it off with a very fine diamond-powdered file, but when you take your time, that is not needed. tap not quite at the edge of the cam, you want the edge to remain smooth, just about 2 or 3 mm away from the edge with the pin lightly resting on it. here an example of how well it focusses, taken at f/1.1, focussed on the lips (square crop at full height taken with the m9, no post-processing): click (i dremel coded the lens as a noctilux 1.0) the lens certainly is worth being corrected, because it is very sharp indeed. ok - i know this is a very old post, however i have just made this adjustment using a 25mm socket as the 'anvil' (which exactly matched the radius of the focus cam) and a wide blade screwdriver as the 'punch' and with the lens suitably supported so all impact goes only into the focus cam/tab - with some very gentle tapping it brought the back focus forward to precise focus on my m10. very happy with the results coming off the lens now and absolutely bang on all the way through the focus range. btw this lens was my only lens that was off, summilux 35mm fle, summicron 75mm, elamrit 90mm all -----> spot !!!  on, so no suspicion of the body being out.", "sortedWord": "None", "identifyer": 44206, "year": "2018"}, {"Unnamed: 0": 393809, "autor": "Ko.Fe.", "date": 1528431360000, "content": "M2 is just like any used film camera. You buy it in unknown condition or you buy it in known condition. Known is then camera has recent service records and/or was in regular use prior to sale. What to look for was asked under google watch for over decade now. I checked, it is still valid option: https://www.google.ca/search?q=buying+used+film+Leica+guide&oq=buying+used+film+Leica+guide&aqs=chrome..69i57.29023j0j7&sourceid=chrome&ie=UTF-8 CD white, milky cover is good alternative for ground glass. Any clear, flat plastic with one matte surface will, if it is not too thick to slide it into M film channel. And it doesn't need to cover all frame. You are only checking tiny spot in the middle.", "link": "https://www.l-camera-forum.com/topic/285365-buying-m2/?tab=comments#comment-3533663", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "m2 is just like any used film camera. you buy it in unknown condition or you buy it in known condition. known is then camera has recent service records and/or was in regular use prior to sale. what to look for was asked under google watch for over decade now. i checked, it is still valid option: https://www.google.ca/search?q=buying+used+film+leica+guide&oq=buying+used+film+leica+guide&aqs=chrome..69i57.29023j0j7&sourceid=chrome&ie=utf-8 cd white, milky cover is good alternative for ground glass. any clear, flat plastic with one matte surface will, if it is not too thick to slide it into m film channel. and it doesn't need to cover all frame. you are only checking tiny -----> spot !!!  in the middle.", "sortedWord": "None", "identifyer": 6273, "year": "2018"}, {"Unnamed: 0": 395075, "autor": "adan", "date": 1541383560000, "content": "If there is a screw-head on your 50mm lens mount right where the coding goes (there normally is), it can reflect light differently than the smooth mount itself, and \"read' as a black spot, thereby confusing the camera's coding sensor. Especially if it has any grime trapped in the depression. That screw head usually falls in the same position as the single black dot for a 90mm Tele-Elmarit* - i.e. 000100. So if you add the code for a 50 v.4/5 on top of that - 100001, then the sensor sees 100(1)01. Which is a 90mm Elmarit last version. But since you are also bringing up 50mm framelines with your lens, instead of the 90mm frame, that results in a contradiction, and the camera gives up and reports \"no such lens - no lens recognized.\" Sometimes, filling in the screw head \"sinkhole\" with white paint can \"blank\" it out and make it read as a 0, allowing correct coding. ____________________ * which is nice if you have an uncoded 90TE with a dirty screw - the camera may recognize it \"accidentally\" just because of the dirt.", "link": "https://www.l-camera-forum.com/topic/185433-m-lens-codes/page/7/?tab=comments#comment-3625680", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "if there is a screw-head on your 50mm lens mount right where the coding goes (there normally is), it can reflect light differently than the smooth mount itself, and \"read' as a black -----> spot !!! , thereby confusing the camera's coding sensor. especially if it has any grime trapped in the depression. that screw head usually falls in the same position as the single black dot for a 90mm tele-elmarit* - i.e. 000100. so if you add the code for a 50 v.4/5 on top of that - 100001, then the sensor sees 100(1)01. which is a 90mm elmarit last version. but since you are also bringing up 50mm framelines with your lens, instead of the 90mm frame, that results in a contradiction, and the camera gives up and reports \"no such lens - no lens recognized.\" sometimes, filling in the screw head \"sinkhole\" with white paint can \"blank\" it out and make it read as a 0, allowing correct coding. ____________________ * which is nice if you have an uncoded 90te with a dirty screw - the camera may recognize it \"accidentally\" just because of the dirt.", "sortedWord": "None", "identifyer": 7544, "year": "2018"}, {"Unnamed: 0": 398468, "autor": "CharlesL", "date": 1535587140000, "content": "On M240 at f/4. The lighting person kept the spots on the instruments. --img-- ", "link": "https://www.l-camera-forum.com/topic/288041-35mm-14-summilux-pre-asph/?tab=comments#comment-3582381", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "on m240 at f/4. the lighting person kept the -----> spots !!!  on the instruments. --img-- ", "sortedWord": "None", "identifyer": 11114, "year": "2018"}, {"Unnamed: 0": 398476, "autor": "g2van", "date": 1535654340000, "content": "I've had the Summicron V3 twice and each time I loved it and each time I regret selling it!! It's so small and easy to use and, for me, a perfect balance between modern super sharp and the older too much softness/low contrast/glow. Having said that, I did sell the V3 to buy the Lux pre-asph. I wondered and pondered if the glow would be too much for me. TBH I haven't come to love the Lux pre-asph that much yet - I believe it's because I haven't worked hard enough to get the best out of it. Wide open, I believe you have to get exposure spot on because highlights blow out way too easily. In even lighting, it's much easier to make it shine and appreciate its beautiful glow. The other thing is that while the lens is tiny, I need to have the hood on in order to put a filter. I don't want to shoot without a protective filter because my copy is pristine. Other than at f1.4, yes, at f2 onwards it's very similar to the cron v3 for street shooting. So in that sense I agree with the comment that the Lux pre-asph is 2 lenses in one, unless shooting in harsh lighting. Attaching this shot I took when testing the pre-asph the first time and for me, this image is what the character is all about - quite distinct glow and lovely bokeh. Shot wide open, of course. --img-- ", "link": "https://www.l-camera-forum.com/topic/288041-35mm-14-summilux-pre-asph/?tab=comments#comment-3582867", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i've had the summicron v3 twice and each time i loved it and each time i regret selling it!! it's so small and easy to use and, for me, a perfect balance between modern super sharp and the older too much softness/low contrast/glow. having said that, i did sell the v3 to buy the lux pre-asph. i wondered and pondered if the glow would be too much for me. tbh i haven't come to love the lux pre-asph that much yet - i believe it's because i haven't worked hard enough to get the best out of it. wide open, i believe you have to get exposure -----> spot !!!  on because highlights blow out way too easily. in even lighting, it's much easier to make it shine and appreciate its beautiful glow. the other thing is that while the lens is tiny, i need to have the hood on in order to put a filter. i don't want to shoot without a protective filter because my copy is pristine. other than at f1.4, yes, at f2 onwards it's very similar to the cron v3 for street shooting. so in that sense i agree with the comment that the lux pre-asph is 2 lenses in one, unless shooting in harsh lighting. attaching this shot i took when testing the pre-asph the first time and for me, this image is what the character is all about - quite distinct glow and lovely bokeh. shot wide open, of course. --img-- ", "sortedWord": "None", "identifyer": 11122, "year": "2018"}, {"Unnamed: 0": 398478, "autor": "Letin", "date": 1535695140000, "content": "I've had the Summicron V3 twice and each time I loved it and each time I regret selling it!! It's so small and easy to use and, for me, a perfect balance between modern super sharp and the older too much softness/low contrast/glow. Having said that, I did sell the V3 to buy the Lux pre-asph. I wondered and pondered if the glow would be too much for me. TBH I haven't come to love the Lux pre-asph that much yet - I believe it's because I haven't worked hard enough to get the best out of it. Wide open, I believe you have to get exposure spot on because highlights blow out way too easily. In even lighting, it's much easier to make it shine and appreciate its beautiful glow. The other thing is that while the lens is tiny, I need to have the hood on in order to put a filter. I don't want to shoot without a protective filter because my copy is pristine. Other than at f1.4, yes, at f2 onwards it's very similar to the cron v3 for street shooting. So in that sense I agree with the comment that the Lux pre-asph is 2 lenses in one, unless shooting in harsh lighting. Attaching this shot I took when testing the pre-asph the first time and for me, this image is what the character is all about - quite distinct glow and lovely bokeh. Shot wide open, of course. Thanks for speaking from experience and it seems like the lux pre-asph require some taming and fine skills to get the result you want. Getting the exposure right at f/1.4 might be a little more forgiving on films. You're lucky you found a good copy, can I ask how much you paid for it when you got it? they range from $2000 - $2900usd last time I checked. So glad to see your comment since you've owned the Summicron V3 in the past.", "link": "https://www.l-camera-forum.com/topic/288041-35mm-14-summilux-pre-asph/?tab=comments#comment-3583143", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i've had the summicron v3 twice and each time i loved it and each time i regret selling it!! it's so small and easy to use and, for me, a perfect balance between modern super sharp and the older too much softness/low contrast/glow. having said that, i did sell the v3 to buy the lux pre-asph. i wondered and pondered if the glow would be too much for me. tbh i haven't come to love the lux pre-asph that much yet - i believe it's because i haven't worked hard enough to get the best out of it. wide open, i believe you have to get exposure -----> spot !!!  on because highlights blow out way too easily. in even lighting, it's much easier to make it shine and appreciate its beautiful glow. the other thing is that while the lens is tiny, i need to have the hood on in order to put a filter. i don't want to shoot without a protective filter because my copy is pristine. other than at f1.4, yes, at f2 onwards it's very similar to the cron v3 for street shooting. so in that sense i agree with the comment that the lux pre-asph is 2 lenses in one, unless shooting in harsh lighting. attaching this shot i took when testing the pre-asph the first time and for me, this image is what the character is all about - quite distinct glow and lovely bokeh. shot wide open, of course. thanks for speaking from experience and it seems like the lux pre-asph require some taming and fine skills to get the result you want. getting the exposure right at f/1.4 might be a little more forgiving on films. you're lucky you found a good copy, can i ask how much you paid for it when you got it? they range from $2000 - $2900usd last time i checked. so glad to see your comment since you've owned the summicron v3 in the past.", "sortedWord": "None", "identifyer": 11124, "year": "2018"}, {"Unnamed: 0": 399586, "autor": "LocalHero1953", "date": 1517611140000, "content": "I've just bought a (new) Thambar! Red Dot also had a couple of originals in good condition, which made an interesting comparison. I'd taken my SL along (that's what I expect to use it on, mostly), and the new version was considerably clearer for focusing than either of the oldies, probably because of modern glass and coatings. The focusing movement on both the oldies was a bit stiff, while the aperture rings were loosish (my Hektor 7.3cm is the same). Since I'm buying it to use, not as a collection piece, I have gone with the new one which has a modern easy focus movement and slightly restrained aperture ring. It's well balanced on the SL, though I miss the large hood on the zooms that allows you to put the body and lens down level on a table. You have to be a bit more cautious with the thinner Thambar. Pictures to follow, so far mostly from around London and the early evening lights (lots of ugly bubble bokeh!), without the spot filter. I intend to use it mainly for portraits.", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/14/?tab=comments#comment-3453909", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i've just bought a (new) thambar! red dot also had a couple of originals in good condition, which made an interesting comparison. i'd taken my sl along (that's what i expect to use it on, mostly), and the new version was considerably clearer for focusing than either of the oldies, probably because of modern glass and coatings. the focusing movement on both the oldies was a bit stiff, while the aperture rings were loosish (my hektor 7.3cm is the same). since i'm buying it to use, not as a collection piece, i have gone with the new one which has a modern easy focus movement and slightly restrained aperture ring. it's well balanced on the sl, though i miss the large hood on the zooms that allows you to put the body and lens down level on a table. you have to be a bit more cautious with the thinner thambar. pictures to follow, so far mostly from around london and the early evening lights (lots of ugly bubble bokeh!), without the -----> spot !!!  filter. i intend to use it mainly for portraits.", "sortedWord": "None", "identifyer": 12266, "year": "2018"}, {"Unnamed: 0": 399587, "autor": "LocalHero1953", "date": 1517652600000, "content": "First portrait. Thambar on the SL, wide open, no spot filter, ISO400, 1/80s. Monica Alcazar Duarte winner of the Bar Tur Photobook award for her book 'The New Colonists', taken at the book launch at The Photographers' Gallery last night. I only had a moment so I carelessly carefully placed her under a harsh overhead fluoresecent light. I show both colour and the SilverEfex conversion (high key preset). --img-- --img--  Edited February 3, 2018 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/14/?tab=comments#comment-3454101", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "first portrait. thambar on the sl, wide open, no -----> spot !!!  filter, iso400, 1/80s. monica alcazar duarte winner of the bar tur photobook award for her book 'the new colonists', taken at the book launch at the photographers' gallery last night. i only had a moment so i carelessly carefully placed her under a harsh overhead fluoresecent light. i show both colour and the silverefex conversion (high key preset). --img-- --img--  edited february 3, 2018 by localhero1953", "sortedWord": "None", "identifyer": 12267, "year": "2018"}, {"Unnamed: 0": 399588, "autor": "LocalHero1953", "date": 1517654940000, "content": "Thambar on SL, all wide open, no spot filter. London Embankment. A typical shot with small light sources or specular highlights in the frame, producing this ugly bubble bokeh. IMO to be avoided at all costs unless you like Candy Crush Saga or are trying to entertain your grandchildren. In shots with a 'normal' lens, I am often distracted by light sources and highlights in the background; this lens will leave me in no doubt about the errors of my ways. --img--  London South Bank. Once one forgets about camera club sharpness, the impressionistic effect may work. --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/14/?tab=comments#comment-3454127", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thambar on sl, all wide open, no -----> spot !!!  filter. london embankment. a typical shot with small light sources or specular highlights in the frame, producing this ugly bubble bokeh. imo to be avoided at all costs unless you like candy crush saga or are trying to entertain your grandchildren. in shots with a 'normal' lens, i am often distracted by light sources and highlights in the background; this lens will leave me in no doubt about the errors of my ways. --img--  london south bank. once one forgets about camera club sharpness, the impressionistic effect may work. --img-- ", "sortedWord": "None", "identifyer": 12268, "year": "2018"}, {"Unnamed: 0": 399589, "autor": "LocalHero1953", "date": 1517655120000, "content": "Thambar on SL, wide open, no spot filter. London Eye. I guess one can put up with bubble bokeh as long as it forms part of the composition. But a little bit goes a long way. --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/14/?tab=comments#comment-3454130", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thambar on sl, wide open, no -----> spot !!!  filter. london eye. i guess one can put up with bubble bokeh as long as it forms part of the composition. but a little bit goes a long way. --img--  --img-- ", "sortedWord": "None", "identifyer": 12269, "year": "2018"}, {"Unnamed: 0": 399590, "autor": "LocalHero1953", "date": 1517655240000, "content": "Thambar on SL, wide open, no spot filter London Golden Jubilee Bridge --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/14/?tab=comments#comment-3454132", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thambar on sl, wide open, no -----> spot !!!  filter london golden jubilee bridge --img--  --img-- ", "sortedWord": "None", "identifyer": 12270, "year": "2018"}, {"Unnamed: 0": 399591, "autor": "LocalHero1953", "date": 1517655300000, "content": "Thambar on SL, wide open, no spot filter. London South Bank, channelling my inner Brassai. --img--  --img--  Edited February 3, 2018 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/14/?tab=comments#comment-3454134", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thambar on sl, wide open, no -----> spot !!!  filter. london south bank, channelling my inner brassai. --img--  --img--  edited february 3, 2018 by localhero1953", "sortedWord": "None", "identifyer": 12271, "year": "2018"}, {"Unnamed: 0": 399592, "autor": "LocalHero1953", "date": 1517655480000, "content": "Thambar on SL, wide open, no spot filter Last ones. London South Bank, looking across to Somerset House --img--  And a quick snap from 'The New Colonists' book launch last night. --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/14/?tab=comments#comment-3454136", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thambar on sl, wide open, no -----> spot !!!  filter last ones. london south bank, looking across to somerset house --img--  and a quick snap from 'the new colonists' book launch last night. --img-- ", "sortedWord": "None", "identifyer": 12272, "year": "2018"}, {"Unnamed: 0": 399601, "autor": "LocalHero1953", "date": 1517689200000, "content": " I'm not a great one for lens tests, preferring to learn how they perform by using them. With the Thambar though, I feel I need to set some ground rules for myself. I have tested the lens on the SL, CL and M240, at a range of stops and with/without the spot filter. I chose a still life because my wife can't sit still in the same pose for that length of time. It is lit with a flash bounced off a brolly above left, at about 60 degrees from the camera. SL and CL shots at ISO100, M240 at ISO200. SL and CL at 1/200s, M240 at 1/180s. All with manual flash, so there is some variation between shots which I have not tried to adjust. The focus point is roughly on the base of the tines on the whisk, towards the handle. All files posted without post processing other than importing as dng to Lightroom - no NR, minimal sharpening. This first one is to show that the Thambar can behave like a perfectly respectable lens when it wants to. SL, f/11, no filter --img--  Edited February 3, 2018 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/15/?tab=comments#comment-3454507", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " i'm not a great one for lens tests, preferring to learn how they perform by using them. with the thambar though, i feel i need to set some ground rules for myself. i have tested the lens on the sl, cl and m240, at a range of stops and with/without the -----> spot !!!  filter. i chose a still life because my wife can't sit still in the same pose for that length of time. it is lit with a flash bounced off a brolly above left, at about 60 degrees from the camera. sl and cl shots at iso100, m240 at iso200. sl and cl at 1/200s, m240 at 1/180s. all with manual flash, so there is some variation between shots which i have not tried to adjust. the focus point is roughly on the base of the tines on the whisk, towards the handle. all files posted without post processing other than importing as dng to lightroom - no nr, minimal sharpening. this first one is to show that the thambar can behave like a perfectly respectable lens when it wants to. sl, f/11, no filter --img--  edited february 3, 2018 by localhero1953", "sortedWord": "None", "identifyer": 12281, "year": "2018"}, {"Unnamed: 0": 399602, "autor": "LocalHero1953", "date": 1517689500000, "content": "Two shots with the SL at f5.6. This is the largest aperture before it starts behaving like a Thambar. With the spot filter, anything smaller gets a fuzzy black central blob. Without filter: --img--  With filter --img--  Edited February 3, 2018 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/15/?tab=comments#comment-3454510", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "two shots with the sl at f5.6. this is the largest aperture before it starts behaving like a thambar. with the -----> spot !!!  filter, anything smaller gets a fuzzy black central blob. without filter: --img--  with filter --img--  edited february 3, 2018 by localhero1953", "sortedWord": "None", "identifyer": 12282, "year": "2018"}, {"Unnamed: 0": 399604, "autor": "LocalHero1953", "date": 1517690100000, "content": "Conclusion (based on what I see on my monitor, which is not necessarily visible here): The amount of flare/haze/glow is similar between shots with and without the spot filter. The spot filter though, acts to reduce visible detail: see the wooden nutcracker and the handle of the knife at f/5.6, even allowing for different scene brightness. I'll post similar pairs for the CL and M240.", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/15/?tab=comments#comment-3454513", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "conclusion (based on what i see on my monitor, which is not necessarily visible here): the amount of flare/haze/glow is similar between shots with and without the -----> spot !!!  filter. the spot filter though, acts to reduce visible detail: see the wooden nutcracker and the handle of the knife at f/5.6, even allowing for different scene brightness. i'll post similar pairs for the cl and m240.", "sortedWord": "None", "identifyer": 12284, "year": "2018"}, {"Unnamed: 0": 399618, "autor": "wattsy", "date": 1517733120000, "content": "London Embankment. A typical shot with small light sources or specular highlights in the frame, producing this ugly bubble bokeh. IMO to be avoided at all costs unless you like Candy Crush Saga or are trying to entertain your grandchildren. In shots with a 'normal' lens, I am often distracted by light sources and highlights in the background; this lens will leave me in no doubt about the errors of my ways. --img-- untitled 02-02-18 -21.jpg London South Bank. Once one forgets about camera club sharpness, the impressionistic effect may work. --img-- untitled 02-02-18 -25.jpg I don't dislike the \"Candy Crush\" look quite as much as I think I should. I still have this idea that there is a sweet spot somewhere (maybe stopped down a little and without the filter) where this lens will do interesting things but I can't bring myself to spend £5000 to disabuse myself of that notion.", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/16/?tab=comments#comment-3454774", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "london embankment. a typical shot with small light sources or specular highlights in the frame, producing this ugly bubble bokeh. imo to be avoided at all costs unless you like candy crush saga or are trying to entertain your grandchildren. in shots with a 'normal' lens, i am often distracted by light sources and highlights in the background; this lens will leave me in no doubt about the errors of my ways. --img-- untitled 02-02-18 -21.jpg london south bank. once one forgets about camera club sharpness, the impressionistic effect may work. --img-- untitled 02-02-18 -25.jpg i don't dislike the \"candy crush\" look quite as much as i think i should. i still have this idea that there is a sweet -----> spot !!!  somewhere (maybe stopped down a little and without the filter) where this lens will do interesting things but i can't bring myself to spend £5000 to disabuse myself of that notion.", "sortedWord": "None", "identifyer": 12298, "year": "2018"}, {"Unnamed: 0": 399619, "autor": "LocalHero1953", "date": 1517750580000, "content": "My wife consented to be my model for a sequence of portrait shots in natural light. She is seated close to a large window; the light is overcast but the sun kept breaking through, although it was more or less similar throughout this set. Her serious look is because she was watching for the sun over my shoulder. All shot on the SL at ISO 400, A mode, centre-weighted exposure, auto WB. Focus is on the eyes, using focus magnification. I did a full sequence at all apertures with and without the spot filter, but I'm only posting here at f5.6 and f2.2. The only edits are a slight adjustment of WB and cropping to 5x4 aspect ratio. f5.6, no spot filter --img--  f5.6, with spot filter --img--  Edited February 4, 2018 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/16/?tab=comments#comment-3454888", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my wife consented to be my model for a sequence of portrait shots in natural light. she is seated close to a large window; the light is overcast but the sun kept breaking through, although it was more or less similar throughout this set. her serious look is because she was watching for the sun over my shoulder. all shot on the sl at iso 400, a mode, centre-weighted exposure, auto wb. focus is on the eyes, using focus magnification. i did a full sequence at all apertures with and without the -----> spot !!!  filter, but i'm only posting here at f5.6 and f2.2. the only edits are a slight adjustment of wb and cropping to 5x4 aspect ratio. f5.6, no spot filter --img--  f5.6, with spot filter --img--  edited february 4, 2018 by localhero1953", "sortedWord": "None", "identifyer": 12299, "year": "2018"}, {"Unnamed: 0": 399620, "autor": "LocalHero1953", "date": 1517750700000, "content": "And the same again at f2.2 f2.2, no spot filter --img--  f2.2, with spot filter --img-- ", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/16/?tab=comments#comment-3454891", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "and the same again at f2.2 f2.2, no -----> spot !!!  filter --img--  f2.2, with -----> spot !!!  filter --img-- ", "sortedWord": "None", "identifyer": 12300, "year": "2018"}, {"Unnamed: 0": 399621, "autor": "LocalHero1953", "date": 1517751480000, "content": " Conclusions. 1. I would have to be fairly desperate to want to use the Thambar wide open with the spot filter for portraits. You lose most detail and gain maximum fog. 2. This is a versatile lens. Stopped down below f4, without (and to a lesser extent with) the spot filter, it is a perfectly respectable portrait lens, a bit low in contrast, without the eye-watering sharpness of the Apo-Summicron-M 90 (and probably the SL version). As you open it up without the spot filter you start to get the 'dreaminess' - a bit glowing (or foggy if you prefer!), but still with detail where you want it. 3. Manual focus through the EVF wide open with the spot filter is difficult - even with focus magnification it can be difficult to see when you have it. 4. So far, the Thambar is behaving as I expected of a lens with spherical aberrations towards its edges: if you only use the middle bit (stopped down, no spot) then you get a nice sharp image. If you only use the outer bit (wide open, spot filter), you get a foggy, blurred image without detail. In between (cropping the outer parts with the aperture, and the inner parts with the spot filter) you get different and interesting combinations of glow/fog and detail. I shall do some further tests with flash, if she'll let me. TBH, she's as curious about this lens as I am. Edited February 4, 2018 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/16/?tab=comments#comment-3454901", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " conclusions. 1. i would have to be fairly desperate to want to use the thambar wide open with the -----> spot !!!  filter for portraits. you lose most detail and gain maximum fog. 2. this is a versatile lens. stopped down below f4, without (and to a lesser extent with) the spot filter, it is a perfectly respectable portrait lens, a bit low in contrast, without the eye-watering sharpness of the apo-summicron-m 90 (and probably the sl version). as you open it up without the spot filter you start to get the 'dreaminess' - a bit glowing (or foggy if you prefer!), but still with detail where you want it. 3. manual focus through the evf wide open with the spot filter is difficult - even with focus magnification it can be difficult to see when you have it. 4. so far, the thambar is behaving as i expected of a lens with spherical aberrations towards its edges: if you only use the middle bit (stopped down, no spot) then you get a nice sharp image. if you only use the outer bit (wide open, spot filter), you get a foggy, blurred image without detail. in between (cropping the outer parts with the aperture, and the inner parts with the spot filter) you get different and interesting combinations of glow/fog and detail. i shall do some further tests with flash, if she'll let me. tbh, she's as curious about this lens as i am. edited february 4, 2018 by localhero1953", "sortedWord": "None", "identifyer": 12301, "year": "2018"}, {"Unnamed: 0": 399622, "autor": "wattsy", "date": 1517754120000, "content": "I'm getting the impression, Paul, that the spot filter is something perhaps best left in the box. Sent from my iPhone using Tapatalk", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/16/?tab=comments#comment-3454929", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i'm getting the impression, paul, that the -----> spot !!!  filter is something perhaps best left in the box. sent from my iphone using tapatalk", "sortedWord": "None", "identifyer": 12302, "year": "2018"}, {"Unnamed: 0": 399623, "autor": "LocalHero1953", "date": 1517754900000, "content": "I'm getting the impression, Paul, that the spot filter is something perhaps best left in the box. Sent from my iPhone using Tapatalk I might do that, but it might also have a value in some cases. Portraiture is why I bought the lens, and those I have taken have avoided light sources and specular highlights in the frame. Such highlights might be where the spot has its own particular effect - which might be unattractive in a portrait (unless a useful part of the composition) but acceptable elsewhere. Edited February 4, 2018 by LocalHero1953", "link": "https://www.l-camera-forum.com/topic/279589-thambar-crazy/page/16/?tab=comments#comment-3454942", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i'm getting the impression, paul, that the -----> spot !!!  filter is something perhaps best left in the box. sent from my iphone using tapatalk i might do that, but it might also have a value in some cases. portraiture is why i bought the lens, and those i have taken have avoided light sources and specular highlights in the frame. such highlights might be where the spot has its own particular effect - which might be unattractive in a portrait (unless a useful part of the composition) but acceptable elsewhere. edited february 4, 2018 by localhero1953", "sortedWord": "None", "identifyer": 12303, "year": "2018"}, {"Unnamed: 0": 400221, "autor": "mikemgb", "date": 1529602860000, "content": "My 35mm arrived today. My initial impressions are good, although my lens has a tight spot at about 1m, I'm going to use it for a while to see if it either loosens up or doesn't really bother me. The lens comes with a focus chart and instruction on how to calibrate it. I ignored the instructions and just adjusted it until the RF patch lined up perfectly at infinity, a test will show me if that was the right thing to do. I love the size and weight of the lens, after living with a DR Summicron this lens weighs nothing! Edited June 21, 2018 by mikemgb", "link": "https://www.l-camera-forum.com/topic/283856-first-7artisans-35mm-f2-lens-review/page/3/?tab=comments#comment-3541420", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "my 35mm arrived today. my initial impressions are good, although my lens has a tight -----> spot !!!  at about 1m, i'm going to use it for a while to see if it either loosens up or doesn't really bother me. the lens comes with a focus chart and instruction on how to calibrate it. i ignored the instructions and just adjusted it until the rf patch lined up perfectly at infinity, a test will show me if that was the right thing to do. i love the size and weight of the lens, after living with a dr summicron this lens weighs nothing! edited june 21, 2018 by mikemgb", "sortedWord": "None", "identifyer": 12943, "year": "2018"}, {"Unnamed: 0": 400222, "autor": "Ecar", "date": 1529604300000, "content": " Yes, adjusting for infinity should give you accurate focus across the range, although there will always be a hint of focus shift (it's a Sonnar-based optical formula after all). While the 50/1.1 was essentially spot on upon arrival, the 35/2 was way off. The good news is that it took me less than 15 min to adjust with the screwdriver provided. Focus is very smooth and almost Leica-like on my copy, with no rough spots, but the aperture ring is slightly wobbly and clunky. Time will tell if it ends up falling apart... I have only managed to take a few shots with it so far, so no opinion on IQ yet.", "link": "https://www.l-camera-forum.com/topic/283856-first-7artisans-35mm-f2-lens-review/page/4/?tab=comments#comment-3541424", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " yes, adjusting for infinity should give you accurate focus across the range, although there will always be a hint of focus shift (it's a sonnar-based optical formula after all). while the 50/1.1 was essentially -----> spot !!!  on upon arrival, the 35/2 was way off. the good news is that it took me less than 15 min to adjust with the screwdriver provided. focus is very smooth and almost leica-like on my copy, with no rough spots, but the aperture ring is slightly wobbly and clunky. time will tell if it ends up falling apart... i have only managed to take a few shots with it so far, so no opinion on iq yet.", "sortedWord": "None", "identifyer": 12944, "year": "2018"}, {"Unnamed: 0": 400235, "autor": "mikemgb", "date": 1530187440000, "content": "I did an adjustment for infinity focus today and confirmed that the thick bronze cam does indeed adjust infinity focus and now it's accurate. I also noticed that after adjusting it my focusing action was very tight from .7m to about 1.5m and I was concerned that I had done something wrong but after a tiny (and I do mean tiny) adjustment of the set screws it is at least back to how it felt from the box, if not slightly smoother. Here's a quick snap as I was leaving work. I liked the light coming in and hitting my car --img--  Taken on my M10. --img-- The Garage. by Abram Goglanian, on Flickr Thank you for posting this, my lens had the same tight spot, I just loosened the set screws a tiny amount and it is now gone.", "link": "https://www.l-camera-forum.com/topic/283856-first-7artisans-35mm-f2-lens-review/page/4/?tab=comments#comment-3545440", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i did an adjustment for infinity focus today and confirmed that the thick bronze cam does indeed adjust infinity focus and now it's accurate. i also noticed that after adjusting it my focusing action was very tight from .7m to about 1.5m and i was concerned that i had done something wrong but after a tiny (and i do mean tiny) adjustment of the set screws it is at least back to how it felt from the box, if not slightly smoother. here's a quick snap as i was leaving work. i liked the light coming in and hitting my car --img--  taken on my m10. --img-- the garage. by abram goglanian, on flickr thank you for posting this, my lens had the same tight -----> spot !!! , i just loosened the set screws a tiny amount and it is now gone.", "sortedWord": "None", "identifyer": 12957, "year": "2018"}, {"Unnamed: 0": 400265, "autor": "chema", "date": 1533373200000, "content": "I’ve seen, depending on the metering pattern, this kind of thing before on lenses with significant vignetting since, for the first few stops, you are reducing the light to the outer area of the image less by stopping down than you are reducing the light to the center. The fact that it becomes more linear from the middle stops on, where you should be out of the range with vignetting seems to support this. I’d re-run this and check the actual exposure only in the center of the fame, then see what you get. Thank you, I have redone the test with an M6 (metering more spot) with the same result. I have observed, looking at the lens from behind, that by moving the ring of diaphragms from f2 onwards, I do not start to see the diaphragm blades until I reach the midpoint between 2 and 2.8. So I imagine that the diaphragm ring is not fixed in its place, it should be a little more delayed, so that when it now suggests 2.5 should be on the f2. Knowing the problem, I do not care. Within a time, I will try to adjust it. Best regards chema", "link": "https://www.l-camera-forum.com/topic/283856-first-7artisans-35mm-f2-lens-review/page/6/?tab=comments#comment-3566533", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i’ve seen, depending on the metering pattern, this kind of thing before on lenses with significant vignetting since, for the first few stops, you are reducing the light to the outer area of the image less by stopping down than you are reducing the light to the center. the fact that it becomes more linear from the middle stops on, where you should be out of the range with vignetting seems to support this. i’d re-run this and check the actual exposure only in the center of the fame, then see what you get. thank you, i have redone the test with an m6 (metering more -----> spot !!! ) with the same result. i have observed, looking at the lens from behind, that by moving the ring of diaphragms from f2 onwards, i do not start to see the diaphragm blades until i reach the midpoint between 2 and 2.8. so i imagine that the diaphragm ring is not fixed in its place, it should be a little more delayed, so that when it now suggests 2.5 should be on the f2. knowing the problem, i do not care. within a time, i will try to adjust it. best regards chema", "sortedWord": "None", "identifyer": 12987, "year": "2018"}, {"Unnamed: 0": 409562, "autor": "jaapv", "date": 1516236780000, "content": "Hello Pico, Another thought: Does your 35mm F3.5 Summaron have its red index dot for attaching the lens to the camera at (or near) F16 or at F22.? If the red index dot is at F22 then that lens needs the add on \"goggles\" in order to focus properly. Best Regards, Michael The flat spot with locking pin on the top of the mount is a better indicator.", "link": "https://www.l-camera-forum.com/topic/267809-critique-35mm-summaron-f35/page/2/?tab=comments#comment-3442541", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hello pico, another thought: does your 35mm f3.5 summaron have its red index dot for attaching the lens to the camera at (or near) f16 or at f22.? if the red index dot is at f22 then that lens needs the add on \"goggles\" in order to focus properly. best regards, michael the flat -----> spot !!!  with locking pin on the top of the mount is a better indicator.", "sortedWord": "None", "identifyer": 22386, "year": "2018"}, {"Unnamed: 0": 415953, "autor": "jplomley", "date": 1526601300000, "content": "I guess Grumpy Old Fart is indeed spot-on accurate. And a Premium Member nonetheless. Nice.", "link": "https://www.l-camera-forum.com/topic/284624-otus-vs-sl-primes/?tab=comments#comment-3520610", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i guess grumpy old fart is indeed -----> spot !!! -on accurate. and a premium member nonetheless. nice.", "sortedWord": "None", "identifyer": 28895, "year": "2018"}, {"Unnamed: 0": 415978, "autor": "hiepphotog", "date": 1526831700000, "content": "They render a bit differently so it really comes down to what look one prefers, the \"Leica Look\" or the \"Zeiss Look.\" --img--  The Otus is bit sharper in the corners wide open but the Summilux-SL is acceptably sharp there. In the center, they are about equally sharp, maybe a slight edge for the Otus. The Otus is optimized for sharpness, the Summilux-SL for depth rendering, not the same as as 3D-Pop, a horrible word. To my eyes, the Summilux-SL beats the Otus by a mile in terms of depth rendering. Where the Otus really shines is in low light situations on a sensor like the one in the α7R II/III due to a combination of extremely high sharpness, and high pixel count, high DR, excellent low light performance of FF BSI sensors (not rocket science for companies like TowerJazz to make for the SL2, I think). By the way, I find that the Sigma Art holds up really well in terms of resolution and OOF treatment agains the other two. For accuracy, one has to focus the Sigma Art manually, though. Still, it's incredible value for money. I didn’t check thoroughly for CA/PF but the Otus showed a bit more wide open. It could be that the Summilux-SL is software corrected in this respect. Removing the opcodes doesn’t make a difference here, but the corrections could be baked into the raw. The ‘optical’ performance of the Summilux-SL is so impressive, I actually don’t care. Also, the corner to corner comparisons between the Zeiss and the Leica were done with the opcode distortion corrections applied to the Summilux-SL. It showed no visible loss of resolution to my eyes. The loss of resolution in the extreme corners wide open is ‘more visible’ when the lens profile in LR is applied to the Otus than comparing the extreme corners of the Summilux-SL with and without the opcodes. Leica did a terrific job there with the software corrections IMO. 55 Otus + SL vs. 50 Summilux-SL + SL (OOF areas affected by the Otus not being on its native mount) https://www.smugmug.com/gallery/n-GGCRrg/ 55 Otus + 5 DS R vs. 50 Summilux-SL + SL https://www.smugmug.com/gallery/n-9J3jzS/ And here in some shots the Otus on the α7R III (Angel with candle, for example) https://www.smugmug.com/gallery/n-Jfdr66/ Thank you for the great comparison. It's such an eye opener for me. I have done lens test/comparison before, but often time, it's not as easy to spot the difference as yours. Maybe the Leica is just that good! Paul, As far as I am concerned the SL body is fantastic. It is a little bit heavier than Sony, Hasselblad X1D and Fuji X-H1 but not that much. Ergonomically IMO the grip can be improved and following the rounded comments from Kaufman I suspect that is what will happen as well once the SL2 comes along. I fail to understand though why Leica in addition to heavy zooms and heavy reference lenses cannot at the same time release smaller and lighter primes as well. After all most of Leica's reputation is based upon delivering the highest optical quality in a small package. Why only apply that to the TL/CL and not to the SL? It doesn't make sense to me. As you have noticed the Hasselblad X1D is making huge inroads. Why? Because Hasselblad packs a larger higher resolution sensor in a smaller package with lighter and cheaper lenses, still maintaining fantastic image quality. We are now 6 lenses in to the SL-system and the average weight is 1,077g. Sorry, simply too much... Thanks, Joris. It will take time Joris. Clearly, they didn't go for another Summilux release but switched to a set of APO Cron. The Elmarit/Elmar will follow. I feel the SL mirrorless system is the most flexible system Leica has right now. If you want to go extremely small, you need to adapt the M-mount lenses at the moment. But the option is there. If you want unequal performance in the 135 format, you have the native SL lenses. SL system is still at its infancy, but from where I am looking at it, you already have much more flexibility than Sony/Olympus/Fuji/Panasonic had back then. And I'm shooting mainly with Sony but I'm keeping a keen eye on the SL development. The Cron set seems to be what I want to get at a later date. I'm puzzled however by the decision of normalizing the size of the lenses. Clearly the system is not meant for video only, and doing this would greatly limit the flexibility down the road for a wider or longer focal length.", "link": "https://www.l-camera-forum.com/topic/284624-otus-vs-sl-primes/page/3/?tab=comments#comment-3522059", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "they render a bit differently so it really comes down to what look one prefers, the \"leica look\" or the \"zeiss look.\" --img--  the otus is bit sharper in the corners wide open but the summilux-sl is acceptably sharp there. in the center, they are about equally sharp, maybe a slight edge for the otus. the otus is optimized for sharpness, the summilux-sl for depth rendering, not the same as as 3d-pop, a horrible word. to my eyes, the summilux-sl beats the otus by a mile in terms of depth rendering. where the otus really shines is in low light situations on a sensor like the one in the α7r ii/iii due to a combination of extremely high sharpness, and high pixel count, high dr, excellent low light performance of ff bsi sensors (not rocket science for companies like towerjazz to make for the sl2, i think). by the way, i find that the sigma art holds up really well in terms of resolution and oof treatment agains the other two. for accuracy, one has to focus the sigma art manually, though. still, it's incredible value for money. i didn’t check thoroughly for ca/pf but the otus showed a bit more wide open. it could be that the summilux-sl is software corrected in this respect. removing the opcodes doesn’t make a difference here, but the corrections could be baked into the raw. the ‘optical’ performance of the summilux-sl is so impressive, i actually don’t care. also, the corner to corner comparisons between the zeiss and the leica were done with the opcode distortion corrections applied to the summilux-sl. it showed no visible loss of resolution to my eyes. the loss of resolution in the extreme corners wide open is ‘more visible’ when the lens profile in lr is applied to the otus than comparing the extreme corners of the summilux-sl with and without the opcodes. leica did a terrific job there with the software corrections imo. 55 otus + sl vs. 50 summilux-sl + sl (oof areas affected by the otus not being on its native mount) https://www.smugmug.com/gallery/n-ggcrrg/ 55 otus + 5 ds r vs. 50 summilux-sl + sl https://www.smugmug.com/gallery/n-9j3jzs/ and here in some shots the otus on the α7r iii (angel with candle, for example) https://www.smugmug.com/gallery/n-jfdr66/ thank you for the great comparison. it's such an eye opener for me. i have done lens test/comparison before, but often time, it's not as easy to -----> spot !!!  the difference as yours. maybe the leica is just that good! paul, as far as i am concerned the sl body is fantastic. it is a little bit heavier than sony, hasselblad x1d and fuji x-h1 but not that much. ergonomically imo the grip can be improved and following the rounded comments from kaufman i suspect that is what will happen as well once the sl2 comes along. i fail to understand though why leica in addition to heavy zooms and heavy reference lenses cannot at the same time release smaller and lighter primes as well. after all most of leica's reputation is based upon delivering the highest optical quality in a small package. why only apply that to the tl/cl and not to the sl? it doesn't make sense to me. as you have noticed the hasselblad x1d is making huge inroads. why? because hasselblad packs a larger higher resolution sensor in a smaller package with lighter and cheaper lenses, still maintaining fantastic image quality. we are now 6 lenses in to the sl-system and the average weight is 1,077g. sorry, simply too much... thanks, joris. it will take time joris. clearly, they didn't go for another summilux release but switched to a set of apo cron. the elmarit/elmar will follow. i feel the sl mirrorless system is the most flexible system leica has right now. if you want to go extremely small, you need to adapt the m-mount lenses at the moment. but the option is there. if you want unequal performance in the 135 format, you have the native sl lenses. sl system is still at its infancy, but from where i am looking at it, you already have much more flexibility than sony/olympus/fuji/panasonic had back then. and i'm shooting mainly with sony but i'm keeping a keen eye on the sl development. the cron set seems to be what i want to get at a later date. i'm puzzled however by the decision of normalizing the size of the lenses. clearly the system is not meant for video only, and doing this would greatly limit the flexibility down the road for a wider or longer focal length.", "sortedWord": "None", "identifyer": 28920, "year": "2018"}, {"Unnamed: 0": 416336, "autor": "dkCambridgeshire", "date": 1529150640000, "content": "Another visit to the pond yesterday: Late afternoon there were no mating/ovipositing damselflies - but there were several Four-Spotted Chaser dragonflies flying - which invariably fly back to the same bankside perch every few minutes. Thus set up the SL and Novoflex 'Follow Focus' with Noflexar T 400mm 3 element achromat lens head, coupled to a Leitz R 2x APO extender, approx 2.5 metres in front of a Teasel stem 'perch' … and waited patiently for the insect to return and settle. --img--  The set-up is not as heavy as it looks - it's just a three element achromat with a long tube. Using the 2x extender, the 800mm lens enables a long 'close focus' lens to subject distance. Close focus achieved via the mount's built-in bellows extension. The light was not so good - cloudy / hazy Sun, late afternoon - but the SL works well at ISO 3200 enabling 1/160sec @ effective f16. Manual focus is via the spring loaded squeeze trigger which alters the length of the tube. Alternatively, focus can be achieved by lengthening/shortening the bellows extension. --img--  Male Four-Spotted Chaser … Swaddywell Nature Reserve near Peterborough UK. --img--  When dismantled the follow focus lens and SL camera fits into a medium size Billingham bag. The Novoflex 'LEA-R' ring bayonets onto the rear of the bellows enabling use of the Leitz R 2x APO extender; the Novoflex LET LR adapter couples the lens to the SL. During the 1960s and 1970s, prior to common use of e.g. Nikon telephoto lenses. Novoflex follow focus achromat lenses were standard kit for many sports and wildlife photographers. Some forum members may recall Victor Blackman's double page spread Amateur Photographer magazine weekly article; he often mentioned how press photographers hired Novoflex long focus lenses for covering cricket matches … 400mm, 600mm and 640mm lens heads being sufficient to capture centre pitch action. If you can manage manual focus, the' Novoflex Follow Focus' could be a worthy budget price 'long lens' solution for the SL. dunk Edited June 16, 2018 by dkCambridgeshire", "link": "https://www.l-camera-forum.com/topic/275370-vintage-lenses-on-the-sl/page/3/?tab=comments#comment-3538420", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "another visit to the pond yesterday: late afternoon there were no mating/ovipositing damselflies - but there were several four------> spotted !!!  chaser dragonflies flying - which invariably fly back to the same bankside perch every few minutes. thus set up the sl and novoflex 'follow focus' with noflexar t 400mm 3 element achromat lens head, coupled to a leitz r 2x apo extender, approx 2.5 metres in front of a teasel stem 'perch' … and waited patiently for the insect to return and settle. --img--  the set-up is not as heavy as it looks - it's just a three element achromat with a long tube. using the 2x extender, the 800mm lens enables a long 'close focus' lens to subject distance. close focus achieved via the mount's built-in bellows extension. the light was not so good - cloudy / hazy sun, late afternoon - but the sl works well at iso 3200 enabling 1/160sec @ effective f16. manual focus is via the spring loaded squeeze trigger which alters the length of the tube. alternatively, focus can be achieved by lengthening/shortening the bellows extension. --img--  male four-spotted chaser … swaddywell nature reserve near peterborough uk. --img--  when dismantled the follow focus lens and sl camera fits into a medium size billingham bag. the novoflex 'lea-r' ring bayonets onto the rear of the bellows enabling use of the leitz r 2x apo extender; the novoflex let lr adapter couples the lens to the sl. during the 1960s and 1970s, prior to common use of e.g. nikon telephoto lenses. novoflex follow focus achromat lenses were standard kit for many sports and wildlife photographers. some forum members may recall victor blackman's double page spread amateur photographer magazine weekly article; he often mentioned how press photographers hired novoflex long focus lenses for covering cricket matches … 400mm, 600mm and 640mm lens heads being sufficient to capture centre pitch action. if you can manage manual focus, the' novoflex follow focus' could be a worthy budget price 'long lens' solution for the sl. dunk edited june 16, 2018 by dkcambridgeshire", "sortedWord": "None", "identifyer": 29280, "year": "2018"}, {"Unnamed: 0": 423809, "autor": "Learner", "date": 1534083060000, "content": "Just spotted this headline: Leica Unveils the Elpro 52 for Shooting Macro with Existing M/TL Lenses https://petapixel.com/2018/08/10/leica-unveils-the-elpro-52-for-shooting-macro-with-existing-m-tl-lenses/ Your thoughts? Does this add-on help to produce macros or close-ups?? I see that \"Leica Elpro 52\" is a thread on this website under \"Leica M Lenses\" According to the download via this link the only TL lenses whereon the Elpro 52 is at home are the 23 and 18–56... Perhaps I misunderstand. http://uk.leica-camera.com/Service-Support/Support/Downloads?category=&subcategory=151348&type=&language=all Edited August 12, 2018 by Learner", "link": "https://www.l-camera-forum.com/topic/285208-cl-and-tl-the-macro-image-thread/page/3/?tab=comments#comment-3571115", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "just -----> spotted !!!  this headline: leica unveils the elpro 52 for shooting macro with existing m/tl lenses https://petapixel.com/2018/08/10/leica-unveils-the-elpro-52-for-shooting-macro-with-existing-m-tl-lenses/ your thoughts? does this add-on help to produce macros or close-ups?? i see that \"leica elpro 52\" is a thread on this website under \"leica m lenses\" according to the download via this link the only tl lenses whereon the elpro 52 is at home are the 23 and 18–56... perhaps i misunderstand. http://uk.leica-camera.com/service-support/support/downloads?category=&subcategory=151348&type=&language=all edited august 12, 2018 by learner", "sortedWord": "None", "identifyer": 36866, "year": "2018"}, {"Unnamed: 0": 423810, "autor": "dkCambridgeshire", "date": 1534083780000, "content": " Just spotted this headline: Leica Unveils the Elpro 52 for Shooting Macro with Existing M/TL Lenses https://petapixel.com/2018/08/10/leica-unveils-the-elpro-52-for-shooting-macro-with-existing-m-tl-lenses/ Your thoughts? Does this add-on help to produce macros or close-ups?? Is this piece of news worthy of its own thread on the forum? https://www.l-camera-forum.com/topic/287391-leica-elpro-e52-close-up-lens/ dunk", "link": "https://www.l-camera-forum.com/topic/285208-cl-and-tl-the-macro-image-thread/page/4/?tab=comments#comment-3571122", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": " just -----> spotted !!!  this headline: leica unveils the elpro 52 for shooting macro with existing m/tl lenses https://petapixel.com/2018/08/10/leica-unveils-the-elpro-52-for-shooting-macro-with-existing-m-tl-lenses/ your thoughts? does this add-on help to produce macros or close-ups?? is this piece of news worthy of its own thread on the forum? https://www.l-camera-forum.com/topic/287391-leica-elpro-e52-close-up-lens/ dunk", "sortedWord": "None", "identifyer": 36867, "year": "2018"}, {"Unnamed: 0": 423818, "autor": "leonasj", "date": 1534996500000, "content": "Just spotted this headline: Leica Unveils the Elpro 52 for Shooting Macro with Existing M/TL Lenses https://petapixel.com/2018/08/10/leica-unveils-the-elpro-52-for-shooting-macro-with-existing-m-tl-lenses/ Your thoughts? Does this add-on help to produce macros or close-ups?? I see that \"Leica Elpro 52\" is a thread on this website under \"Leica M Lenses\" According to the download via this link the only TL lenses whereon the Elpro 52 is at home are the 23 and 18–56... Perhaps I misunderstand. http://uk.leica-camera.com/Service-Support/Support/Downloads?category=&subcategory=151348&type=&language=all wast money,,,,nikon 3T 4T best Edited August 23, 2018 by leonasj", "link": "https://www.l-camera-forum.com/topic/285208-cl-and-tl-the-macro-image-thread/page/4/?tab=comments#comment-3577396", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "just -----> spotted !!!  this headline: leica unveils the elpro 52 for shooting macro with existing m/tl lenses https://petapixel.com/2018/08/10/leica-unveils-the-elpro-52-for-shooting-macro-with-existing-m-tl-lenses/ your thoughts? does this add-on help to produce macros or close-ups?? i see that \"leica elpro 52\" is a thread on this website under \"leica m lenses\" according to the download via this link the only tl lenses whereon the elpro 52 is at home are the 23 and 18–56... perhaps i misunderstand. http://uk.leica-camera.com/service-support/support/downloads?category=&subcategory=151348&type=&language=all wast money,,,,nikon 3t 4t best edited august 23, 2018 by leonasj", "sortedWord": "None", "identifyer": 36875, "year": "2018"}, {"Unnamed: 0": 427904, "autor": "Photon42", "date": 1517295840000, "content": "I think the 23 is a lens one should own with the CL. It is the sweet spot between size, large aperture and image quality. Having said that, I am about to trade my M Summicron 35 for the Lux-TL 35 ... Too many convincing photos here from Rob and others [emoji51]", "link": "https://www.l-camera-forum.com/topic/281303-23-tl-vs-35-tl-best-prime-to-start-with/?tab=comments#comment-3450907", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i think the 23 is a lens one should own with the cl. it is the sweet -----> spot !!!  between size, large aperture and image quality. having said that, i am about to trade my m summicron 35 for the lux-tl 35 ... too many convincing photos here from rob and others [emoji51]", "sortedWord": "None", "identifyer": 41014, "year": "2018"}, {"Unnamed: 0": 429966, "autor": "Marac", "date": 1528358460000, "content": "So here it is all done. I collected the camera and we headed to Great Yarmouth for a relaxing time (birthday today, 56), so the shots are basically snaps. The AF works fine, no hot spots on 11-23 or 18-56 or 23 or 35 lux. delighted with the quality and service from ACS. £250 +VAT, with a turn around time of approx 2 weeks. --img-- ", "link": "https://www.l-camera-forum.com/topic/284219-leica-t-for-infrared/?tab=comments#comment-3533172", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "so here it is all done. i collected the camera and we headed to great yarmouth for a relaxing time (birthday today, 56), so the shots are basically snaps. the af works fine, no hot -----> spots !!!  on 11-23 or 18-56 or 23 or 35 lux. delighted with the quality and service from acs. £250 +vat, with a turn around time of approx 2 weeks. --img-- ", "sortedWord": "None", "identifyer": 43091, "year": "2018"}, {"Unnamed: 0": 436996, "autor": "FrozenInTime", "date": 1538064720000, "content": "Some small lenses for SL would be nice - seems like just more large fast SL lenses. Some small wide TL would especially hit the spot nicely where adapted M cannot go. Interesting in the group photo with Sigma, Leica , Panasonic ; Dr Kaufmann‘s SL has a M lens mounted on it. https://goo.gl/images/NL2ZMY", "link": "https://www.l-camera-forum.com/topic/289836-and-sigmas-roadmap/?tab=comments#comment-3601429", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "some small lenses for sl would be nice - seems like just more large fast sl lenses. some small wide tl would especially hit the -----> spot !!!  nicely where adapted m cannot go. interesting in the group photo with sigma, leica , panasonic ; dr kaufmann‘s sl has a m lens mounted on it. https://goo.gl/images/nl2zmy", "sortedWord": "None", "identifyer": 50232, "year": "2018"}, {"Unnamed: 0": 436997, "autor": "mmradman", "date": 1538066100000, "content": "Some small lenses for SL would be nice - seems like just more large fast SL lenses. Some small wide TL would especially hit the spot nicely where adapted M cannot go. Interesting in the group photo with Sigma, Leica , Panasonic ; Dr Kaufmann‘s SL has a M lens mounted on it. https://goo.gl/images/NL2ZMY Gentleman likes carrying small pistol and leaves bazookas to others.", "link": "https://www.l-camera-forum.com/topic/289836-and-sigmas-roadmap/?tab=comments#comment-3601445", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "some small lenses for sl would be nice - seems like just more large fast sl lenses. some small wide tl would especially hit the -----> spot !!!  nicely where adapted m cannot go. interesting in the group photo with sigma, leica , panasonic ; dr kaufmann‘s sl has a m lens mounted on it. https://goo.gl/images/nl2zmy gentleman likes carrying small pistol and leaves bazookas to others.", "sortedWord": "None", "identifyer": 50233, "year": "2018"}, {"Unnamed: 0": 439503, "autor": "Leica Guy", "date": 1517425200000, "content": "This morning I was up early to witness and photograph the Super Blue Blood Moon using the Leica Q and a Swarovski spotting scope. It was great fun and a real challenge. I used the Leica Spotting scope adapter connected to my Swarovski 20-60X ATS 80 spotting scope. The Q attached nicely and when the adapter is tightened down has no tendency to fall off. I attached the scope and Q combo to a Star Adventurer Star Tracker device which does a great job keeping the moon centered in the viewfinder. Focusing is the most difficult part. I first focused the scope then used auto-focus for as long as I had a bright portion of the moon. Once it was in full eclipse, I had to manually focus and it was a real challenge. There were some clouds and haze this morning or I think the photos would have been a bit sharper. I tried ISO's from 100-800 and settled back on 100 since the star tracker kept the image from blurring. I mostly used f/6.3 although later I tried opening the lens a bit more to drop the shutter speeds. I bracketed every photo and generally was 0.5 sec. all the way up to 30 sec. The full eclipse is very, very dim. Again, the star tracker facilitates using longer exposures and not having blur. I processed all the images in Adobe LR to set exposure and sharpness. I used a gradient in places to bring up the exposure when a portion of the moon was just too dark, but other parts were \"bright\". I've included a photo of the whole setup. --img-- --img-- --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/279496-leica-q-digiscoping-thread/?tab=comments#comment-3452147", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotting", "selectorShort": "spot", "MarkedSent": "this morning i was up early to witness and photograph the super blue blood moon using the leica q and a swarovski -----> spotting !!!  scope. it was great fun and a real challenge. i used the leica spotting scope adapter connected to my swarovski 20-60x ats 80 spotting scope. the q attached nicely and when the adapter is tightened down has no tendency to fall off. i attached the scope and q combo to a star adventurer star tracker device which does a great job keeping the moon centered in the viewfinder. focusing is the most difficult part. i first focused the scope then used auto-focus for as long as i had a bright portion of the moon. once it was in full eclipse, i had to manually focus and it was a real challenge. there were some clouds and haze this morning or i think the photos would have been a bit sharper. i tried iso's from 100-800 and settled back on 100 since the star tracker kept the image from blurring. i mostly used f/6.3 although later i tried opening the lens a bit more to drop the shutter speeds. i bracketed every photo and generally was 0.5 sec. all the way up to 30 sec. the full eclipse is very, very dim. again, the star tracker facilitates using longer exposures and not having blur. i processed all the images in adobe lr to set exposure and sharpness. i used a gradient in places to bring up the exposure when a portion of the moon was just too dark, but other parts were \"bright\". i've included a photo of the whole setup. --img-- --img-- --img-- --img-- --img-- ", "sortedWord": "None", "identifyer": 52819, "year": "2018"}, {"Unnamed: 0": 447332, "autor": "euston", "date": 1518078780000, "content": "A good read, Adam! Your shooting tips are spot on. And you’re right about the usefulness of manual focus. I think of it as a manual focus camera with AF capability rather than the other way round. The lens is its most notable feature, I think. It’s at least on a par with the outstanding TL zooms. I wonder if they share any design DNA?", "link": "https://www.l-camera-forum.com/topic/281541-new-leica-x-vario-review/?tab=comments#comment-3457526", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "a good read, adam! your shooting tips are -----> spot !!!  on. and you’re right about the usefulness of manual focus. i think of it as a manual focus camera with af capability rather than the other way round. the lens is its most notable feature, i think. it’s at least on a par with the outstanding tl zooms. i wonder if they share any design dna?", "sortedWord": "None", "identifyer": 10806, "year": "2018"}, {"Unnamed: 0": 447339, "autor": "HuntingSand", "date": 1518651720000, "content": "Thank you all for your kind words, I am glad you have enjoyed the review. I hope others who may have passed up the camera previously find the article and give the X Vario a try! Thanks for the review. I concur with most of what you say. Couple of things, though: To be able to give the X-Vario \"a try\" these days as you say, there needs to be some sort of supply. There really isn't. In the US, Tamarkin, Popflash, Leica Miami, Leica SF, Ken Hansen etc., they don't have any (or maybe the odd one sample?). EBay may be your friend, but then you need to calculate your risk. Either the production run wasn't very large, or people actually hold on to them, I am not sure. Re the shooting envelope, with some decent technique, it is possible to go way lower than /125 of a second. I have shots (good ones, too, I think), which were done at /30 or even /15. Re the upper ISO limits, I agree that you may want to keep things below a certain number, but with DXO Prime NR for example, 6.400 or even 12.500 are just fine, b/w wise. Have a look at #35/36 here: http://hahn.zenfolio.com/xv , these were done in LR5.3 for example. Peter Karb should read Peter Karbe. Karbe's second point in that interview is actually very interesting: he says they wanted to achieve \"Constant imaging quality from the minimum focusing distance to infinity.\" I would add that they achieved that at all f-stops, too, which is truly amazing (before diffraction sets in, that is). I am a fan of the EVF, especially titled vertically. It's like my old Hassy with the chimney viewfinder, the eye is able to really concentrate and take in the subject without any contamination from the immediate environment. \"image quality is more than sufficient for most\" is a big statement, I would not dare speak for \"most\", myself. People's needs are just very different, and while the Vario-Elmar lens may - optically speaking - be the best zoom lens bolted onto any all-in-one camera, it is also of course the slowest (focal length 50 at f5.1 !!) The implementation of MF is brilliant in my view. Just turn the barrel, check the magnifying pane, and away you go. Simple and solid, even in low light. I agree about the addition of a grip or a case to hold the darn thing. Before the firmware update, it wasn't possible to disable the multi-controller/menu wheel, which always got bumped by the palm of one's hand and put the camera into a different mode altogether. I always apply some sharpening to the files, the DNG's take it very well. Shooting JUST JPGs is actually for the first time possible on a digital Leica (IMHO). They come out quite nicely, and are reasonably malleable in post. B/W JPGs, in-camera, with contrast set to High and sharpness set to Medium high, yields excellent results (combined with spot or center weighted metering). I never trusted the JPGs on my M9/M240, or even the X2. I wonder how many people use the XV as a street photography tool. It works, not very well because the AF, accurate as it may be (green light verification be damned on occasion), is not really snappy; but again, with some practice, the XV is capable to produce excellent results in terms of urban documentation, if so inclined. These are my two cents... Thanks again for drawing attention to the X-Vario. A V.2 would have been most welcome, but that's not going to happen.", "link": "https://www.l-camera-forum.com/topic/281541-new-leica-x-vario-review/?tab=comments#comment-3461741", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thank you all for your kind words, i am glad you have enjoyed the review. i hope others who may have passed up the camera previously find the article and give the x vario a try! thanks for the review. i concur with most of what you say. couple of things, though: to be able to give the x-vario \"a try\" these days as you say, there needs to be some sort of supply. there really isn't. in the us, tamarkin, popflash, leica miami, leica sf, ken hansen etc., they don't have any (or maybe the odd one sample?). ebay may be your friend, but then you need to calculate your risk. either the production run wasn't very large, or people actually hold on to them, i am not sure. re the shooting envelope, with some decent technique, it is possible to go way lower than /125 of a second. i have shots (good ones, too, i think), which were done at /30 or even /15. re the upper iso limits, i agree that you may want to keep things below a certain number, but with dxo prime nr for example, 6.400 or even 12.500 are just fine, b/w wise. have a look at #35/36 here: http://hahn.zenfolio.com/xv , these were done in lr5.3 for example. peter karb should read peter karbe. karbe's second point in that interview is actually very interesting: he says they wanted to achieve \"constant imaging quality from the minimum focusing distance to infinity.\" i would add that they achieved that at all f-stops, too, which is truly amazing (before diffraction sets in, that is). i am a fan of the evf, especially titled vertically. it's like my old hassy with the chimney viewfinder, the eye is able to really concentrate and take in the subject without any contamination from the immediate environment. \"image quality is more than sufficient for most\" is a big statement, i would not dare speak for \"most\", myself. people's needs are just very different, and while the vario-elmar lens may - optically speaking - be the best zoom lens bolted onto any all-in-one camera, it is also of course the slowest (focal length 50 at f5.1 !!) the implementation of mf is brilliant in my view. just turn the barrel, check the magnifying pane, and away you go. simple and solid, even in low light. i agree about the addition of a grip or a case to hold the darn thing. before the firmware update, it wasn't possible to disable the multi-controller/menu wheel, which always got bumped by the palm of one's hand and put the camera into a different mode altogether. i always apply some sharpening to the files, the dng's take it very well. shooting just jpgs is actually for the first time possible on a digital leica (imho). they come out quite nicely, and are reasonably malleable in post. b/w jpgs, in-camera, with contrast set to high and sharpness set to medium high, yields excellent results (combined with -----> spot !!!  or center weighted metering). i never trusted the jpgs on my m9/m240, or even the x2. i wonder how many people use the xv as a street photography tool. it works, not very well because the af, accurate as it may be (green light verification be damned on occasion), is not really snappy; but again, with some practice, the xv is capable to produce excellent results in terms of urban documentation, if so inclined. these are my two cents... thanks again for drawing attention to the x-vario. a v.2 would have been most welcome, but that's not going to happen.", "sortedWord": "None", "identifyer": 10813, "year": "2018"}, {"Unnamed: 0": 447340, "autor": "goatsby", "date": 1518656580000, "content": "Some great thoughts and insights, thank you! I am so happy to see other users of the XV comment on this as it is always good to hear other's point of view. We all get to learn something new on how to approach this camera, or maybe find out something we did not know before (for me, such as using the DXO program to get a little more latitude out of the ISO). Thanks for the review. I concur with most of what you say. Couple of things, though:To be able to give the X-Vario \"a try\" these days as you say, there needs to be some sort of supply. There really isn't. In the US, Tamarkin, Popflash, Leica Miami, Leica SF, Ken Hansen etc., they don't have any (or maybe the odd one sample?). EBay may be your friend, but then you need to calculate your risk. Either the production run wasn't very large, or people actually hold on to them, I am not sure.Re the shooting envelope, with some decent technique, it is possible to go way lower than /125 of a second. I have shots (good ones, too, I think), which were done at /30 or even /15.Re the upper ISO limits, I agree that you may want to keep things below a certain number, but with DXO Prime NR for example, 6.400 or even 12.500 are just fine, b/w wise. Have a look at #35/36 here: http://hahn.zenfolio.com/xv , these were done in LR5.3 for example.Peter Karb should read Peter Karbe. Karbe's second point in that interview is actually very interesting: he says they wanted to achieve \"Constant imaging quality from the minimum focusing distance to infinity.\" I would add that they achieved that at all f-stops, too, which is truly amazing (before diffraction sets in, that is). I am a fan of the EVF, especially titled vertically. It's like my old Hassy with the chimney viewfinder, the eye is able to really concentrate and take in the subject without any contamination from the immediate environment.\"image quality is more than sufficient for most\" is a big statement, I would not dare speak for \"most\", myself. People's needs are just very different, and while the Vario-Elmar lens may - optically speaking - be the best zoom lens bolted onto any all-in-one camera, it is also of course the slowest (focal length 50 at f5.1 !!)The implementation of MF is brilliant in my view. Just turn the barrel, check the magnifying pane, and away you go. Simple and solid, even in low light.I agree about the addition of a grip or a case to hold the darn thing. Before the firmware update, it wasn't possible to disable the multi-controller/menu wheel, which always got bumped by the palm of one's hand and put the camera into a different mode altogether.I always apply some sharpening to the files, the DNG's take it very well.Shooting JUST JPGs is actually for the first time possible on a digital Leica (IMHO). They come out quite nicely, and are reasonably malleable in post. B/W JPGs, in-camera, with contrast set to High and sharpness set to Medium high, yields excellent results (combined with spot or center weighted metering). I never trusted the JPGs on my M9/M240, or even the X2. I wonder how many people use the XV as a street photography tool. It works, not very well because the AF, accurate as it may be (green light verification be damned on occasion), is not really snappy; but again, with some practice, the XV is capable to produce excellent results in terms of urban documentation, if so inclined.These are my two cents...Thanks again for drawing attention to the X-Vario. A V.2 would have been most welcome, but that's not going to happen.", "link": "https://www.l-camera-forum.com/topic/281541-new-leica-x-vario-review/?tab=comments#comment-3461758", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "some great thoughts and insights, thank you! i am so happy to see other users of the xv comment on this as it is always good to hear other's point of view. we all get to learn something new on how to approach this camera, or maybe find out something we did not know before (for me, such as using the dxo program to get a little more latitude out of the iso). thanks for the review. i concur with most of what you say. couple of things, though:to be able to give the x-vario \"a try\" these days as you say, there needs to be some sort of supply. there really isn't. in the us, tamarkin, popflash, leica miami, leica sf, ken hansen etc., they don't have any (or maybe the odd one sample?). ebay may be your friend, but then you need to calculate your risk. either the production run wasn't very large, or people actually hold on to them, i am not sure.re the shooting envelope, with some decent technique, it is possible to go way lower than /125 of a second. i have shots (good ones, too, i think), which were done at /30 or even /15.re the upper iso limits, i agree that you may want to keep things below a certain number, but with dxo prime nr for example, 6.400 or even 12.500 are just fine, b/w wise. have a look at #35/36 here: http://hahn.zenfolio.com/xv , these were done in lr5.3 for example.peter karb should read peter karbe. karbe's second point in that interview is actually very interesting: he says they wanted to achieve \"constant imaging quality from the minimum focusing distance to infinity.\" i would add that they achieved that at all f-stops, too, which is truly amazing (before diffraction sets in, that is). i am a fan of the evf, especially titled vertically. it's like my old hassy with the chimney viewfinder, the eye is able to really concentrate and take in the subject without any contamination from the immediate environment.\"image quality is more than sufficient for most\" is a big statement, i would not dare speak for \"most\", myself. people's needs are just very different, and while the vario-elmar lens may - optically speaking - be the best zoom lens bolted onto any all-in-one camera, it is also of course the slowest (focal length 50 at f5.1 !!)the implementation of mf is brilliant in my view. just turn the barrel, check the magnifying pane, and away you go. simple and solid, even in low light.i agree about the addition of a grip or a case to hold the darn thing. before the firmware update, it wasn't possible to disable the multi-controller/menu wheel, which always got bumped by the palm of one's hand and put the camera into a different mode altogether.i always apply some sharpening to the files, the dng's take it very well.shooting just jpgs is actually for the first time possible on a digital leica (imho). they come out quite nicely, and are reasonably malleable in post. b/w jpgs, in-camera, with contrast set to high and sharpness set to medium high, yields excellent results (combined with -----> spot !!!  or center weighted metering). i never trusted the jpgs on my m9/m240, or even the x2. i wonder how many people use the xv as a street photography tool. it works, not very well because the af, accurate as it may be (green light verification be damned on occasion), is not really snappy; but again, with some practice, the xv is capable to produce excellent results in terms of urban documentation, if so inclined.these are my two cents...thanks again for drawing attention to the x-vario. a v.2 would have been most welcome, but that's not going to happen.", "sortedWord": "None", "identifyer": 10814, "year": "2018"}, {"Unnamed: 0": 447526, "autor": "Calum7", "date": 1541335860000, "content": "I bought an X1 earlier this year and I love it. There is a firmware update that speeds the focus up a little, but I mainly shoot landscapes so I'm not too hampered with slow focusing. I like to use the manual focus, at f8 to f16, which can be a good way of shooting faster. I find the auto focus accurate. Image quality is great and it is a very simple camera to use, I carry mine everywhere. What I would look for in buying one is dust on the sensor, I have two spots that show up at f11 which I edit out with Lightroom. I will eventually send it in for a service. I hope this helps! Edited November 4, 2018 by Calum7", "link": "https://www.l-camera-forum.com/topic/291158-my-first-leica/?tab=comments#comment-3625227", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i bought an x1 earlier this year and i love it. there is a firmware update that speeds the focus up a little, but i mainly shoot landscapes so i'm not too hampered with slow focusing. i like to use the manual focus, at f8 to f16, which can be a good way of shooting faster. i find the auto focus accurate. image quality is great and it is a very simple camera to use, i carry mine everywhere. what i would look for in buying one is dust on the sensor, i have two -----> spots !!!  that show up at f11 which i edit out with lightroom. i will eventually send it in for a service. i hope this helps! edited november 4, 2018 by calum7", "sortedWord": "None", "identifyer": 11002, "year": "2018"}, {"Unnamed: 0": 447527, "autor": "Keith1974", "date": 1541336400000, "content": "9 minutes ago, Calum7 said: I bought an X1 earlier this year and I love it. There is a firmware update that speeds the focus up a little, but I mainly shoot landscapes so I'm not too hampered with slow focusing. I like to use the manual focus, at f8 to f16, which can be a good way of shooting faster. I find the auto focus accurate. Image quality is great and it is a very simple camera to use, I carry mine everywhere. What I would look for in buying one is dust on the sensor, I have two spots that show up at f11 which I edit out with Lightroom. I will eventually send it in for a service. I hope this helps! Calum that's really helpful thank you", "link": "https://www.l-camera-forum.com/topic/291158-my-first-leica/?tab=comments#comment-3625231", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "9 minutes ago, calum7 said: i bought an x1 earlier this year and i love it. there is a firmware update that speeds the focus up a little, but i mainly shoot landscapes so i'm not too hampered with slow focusing. i like to use the manual focus, at f8 to f16, which can be a good way of shooting faster. i find the auto focus accurate. image quality is great and it is a very simple camera to use, i carry mine everywhere. what i would look for in buying one is dust on the sensor, i have two -----> spots !!!  that show up at f11 which i edit out with lightroom. i will eventually send it in for a service. i hope this helps! calum that's really helpful thank you", "sortedWord": "None", "identifyer": 11003, "year": "2018"}, {"Unnamed: 0": 447534, "autor": "glmm2001", "date": 1545507180000, "content": "I got a very good deal a couple weeks ago (EUR 359 including shipping, all the original paperwork, strap, original charger and a couple Pantona batteries) and jumped straight in. This is my first digital Leica (I own a M5) and so far I’m very happy with it. It’s VERY light and compact. I used if for the first time in my younger daughter kindergarten open day and got good shots using zone focusing and aperture priority. While the camera is not a speed demon, it doesn’t feel as terribly slow as most reviews imply. Spot AF works reasonably fast and works even inlow light conditions. Writing times are a bit slow and it takes some 11s to write after firing a burst in JPEG FINE - DNG mode but it isn’t as crippling as I would have expected. Image quality is very good and the DNG files, while overexposed, are very versatile and any program will open them straight away, even phone apps. Edited December 22, 2018 by glmm2001", "link": "https://www.l-camera-forum.com/topic/291158-my-first-leica/?tab=comments#comment-3651552", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i got a very good deal a couple weeks ago (eur 359 including shipping, all the original paperwork, strap, original charger and a couple pantona batteries) and jumped straight in. this is my first digital leica (i own a m5) and so far i’m very happy with it. it’s very light and compact. i used if for the first time in my younger daughter kindergarten open day and got good shots using zone focusing and aperture priority. while the camera is not a speed demon, it doesn’t feel as terribly slow as most reviews imply. -----> spot !!!  af works reasonably fast and works even inlow light conditions. writing times are a bit slow and it takes some 11s to write after firing a burst in jpeg fine - dng mode but it isn’t as crippling as i would have expected. image quality is very good and the dng files, while overexposed, are very versatile and any program will open them straight away, even phone apps. edited december 22, 2018 by glmm2001", "sortedWord": "None", "identifyer": 11010, "year": "2018"}, {"Unnamed: 0": 447725, "autor": "goatsby", "date": 1530233580000, "content": "Which focus point are you using? 11 point, 1 point, spot, or face detection? Please let us know a little more what is happening and hopefully we can help you out.", "link": "https://www.l-camera-forum.com/topic/285761-misfocus-on-x-vario/?tab=comments#comment-3545815", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "which focus point are you using? 11 point, 1 point, -----> spot !!! , or face detection? please let us know a little more what is happening and hopefully we can help you out.", "sortedWord": "None", "identifyer": 11204, "year": "2018"}, {"Unnamed: 0": 447760, "autor": "goatsby", "date": 1518894720000, "content": " With the posting of my X Vario review, I have received many helpful comments and insights about the X Vario. One that caught my attention was about the focusing. I have always attributed soft images to operator error or a simple mis-focus, but after reading the comments and testing over the past week it seems that the issue may be more than that and a trip to Leica may be in order. Please see the attached photo; it is a crop of a photo taken of my daughter where the focus confirmation was green and locked, with spot focus on the left eye. There are other photos like this at varied distances that have been the same result. I have read a few old posts but did not see any conclusions from those that sent their cameras in to Leica. Can anyone comment on this or know if this is something that can be adjusted? Any thoughts would be helpful. Thanks! Adam --img-- ", "link": "https://www.l-camera-forum.com/topic/281928-x-vario-mis-focusing/?tab=comments#comment-3463546", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " with the posting of my x vario review, i have received many helpful comments and insights about the x vario. one that caught my attention was about the focusing. i have always attributed soft images to operator error or a simple mis-focus, but after reading the comments and testing over the past week it seems that the issue may be more than that and a trip to leica may be in order. please see the attached photo; it is a crop of a photo taken of my daughter where the focus confirmation was green and locked, with -----> spot !!!  focus on the left eye. there are other photos like this at varied distances that have been the same result. i have read a few old posts but did not see any conclusions from those that sent their cameras in to leica. can anyone comment on this or know if this is something that can be adjusted? any thoughts would be helpful. thanks! adam --img-- ", "sortedWord": "None", "identifyer": 11239, "year": "2018"}, {"Unnamed: 0": 447767, "autor": "DandA", "date": 1518966480000, "content": "Adam, May I make a few helpful comments and suggestions? After years of optically testing lenses and camera AF systems (due to specific and often demanding requirements of mine), I would not use a human, animal or any moving subject as a test target to determine a camera or lens's focusing accuracy. I would start with a series of say aluminum cans like soda or beer cans (don't drink the beer while testing or you are bound to have a lot of focusing anomalies --img--  ). Stagger them out in a straight line at a 45 degree angle with fairly close spacing of the cans. There are of course lens align tools to determine mis focusing to make things easier. for a camera or lens to misfocus, generally means it front or back focuses or the Af sensor in the given camera is too broad and doesn't always accurately pic of the precise spot you focused on. The Leica S often has had the exact same issue you have noticed in your XV. My comments are generalities to testing and beyond this initial test I described, it's then important to determine how precise the camera's sensor is in its coverage of the test target or does it more broadly cover a greater area. Often times the sensor is not aligned with the viewfinders green box's location. Leica has often found S cameras that were sent in for Af errors, well within spec and returned such cameras, only to have the user continue to have Af errors. It's apparent all of these Leica cameras are unlike the Nikon/Cannon type cameras we are used to, af wise and knowing the parameters to get proper focus, is the key to its success. As I mentioned in your thread of your review of the X Vario, I more often use the camera in af mode and have been pleasantly surprised regarding its accuracy. Then again there might be some variation from body to body. Hard to say. Dave", "link": "https://www.l-camera-forum.com/topic/281928-x-vario-mis-focusing/?tab=comments#comment-3464008", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "adam, may i make a few helpful comments and suggestions? after years of optically testing lenses and camera af systems (due to specific and often demanding requirements of mine), i would not use a human, animal or any moving subject as a test target to determine a camera or lens's focusing accuracy. i would start with a series of say aluminum cans like soda or beer cans (don't drink the beer while testing or you are bound to have a lot of focusing anomalies --img--  ). stagger them out in a straight line at a 45 degree angle with fairly close spacing of the cans. there are of course lens align tools to determine mis focusing to make things easier. for a camera or lens to misfocus, generally means it front or back focuses or the af sensor in the given camera is too broad and doesn't always accurately pic of the precise -----> spot !!!  you focused on. the leica s often has had the exact same issue you have noticed in your xv. my comments are generalities to testing and beyond this initial test i described, it's then important to determine how precise the camera's sensor is in its coverage of the test target or does it more broadly cover a greater area. often times the sensor is not aligned with the viewfinders green box's location. leica has often found s cameras that were sent in for af errors, well within spec and returned such cameras, only to have the user continue to have af errors. it's apparent all of these leica cameras are unlike the nikon/cannon type cameras we are used to, af wise and knowing the parameters to get proper focus, is the key to its success. as i mentioned in your thread of your review of the x vario, i more often use the camera in af mode and have been pleasantly surprised regarding its accuracy. then again there might be some variation from body to body. hard to say. dave", "sortedWord": "None", "identifyer": 11246, "year": "2018"}, {"Unnamed: 0": 447776, "autor": "goatsby", "date": 1524703740000, "content": "I have switched to using the spot focusing instead of one-point and have had much better focus accuracy. But, it does come at the cost of slower focusing and more missed focuses (not mis-focus, the red box ones) especially when the light gets dim. PS I did not wind up sending my camera to Leica as I didn’t want to be without it for a long time and switching focus modes seemed to help a good bit. Edited April 26, 2018 by goatsby", "link": "https://www.l-camera-forum.com/topic/281928-x-vario-mis-focusing/?tab=comments#comment-3507031", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have switched to using the -----> spot !!!  focusing instead of one-point and have had much better focus accuracy. but, it does come at the cost of slower focusing and more missed focuses (not mis-focus, the red box ones) especially when the light gets dim. ps i did not wind up sending my camera to leica as i didn’t want to be without it for a long time and switching focus modes seemed to help a good bit. edited april 26, 2018 by goatsby", "sortedWord": "None", "identifyer": 11255, "year": "2018"}, {"Unnamed: 0": 447778, "autor": "wda", "date": 1524726180000, "content": "I have switched to using the spot focusing instead of one-point and have had much better focus accuracy. But, it does come at the cost of slower focusing and more missed focuses (not mis-focus, the red box ones) especially when the light gets dim. PS I did not wind up sending my camera to Leica as I didn’t want to be without it for a long time and switching focus modes seemed to help a good bit. I understand your approach to achieving consistent focusing accuracy; mine, currently, is rather different. Mine is a more flexible technique. Spot focusing is essential for highlighting a face in a crowd, or specific florets within a cluster of emerging blossom buds. But it is a technique calling for considerable skill and time if striving for a consistently high success rate. When observing a sea of faces, I sometimes prefer to change focus mode (easy to do) and pick multi-zone. Often that will give good results, but not always. When that mode fails, I switch quickly to manual mode with zoom set on 70mm, resetting as necessary. But I cannot claim 100% success with MF on the XV, compared with the Q which has higher resolution viewfinder imaging or rangefinder solutions. As always, I need to hone my skills on a regular basis depending on the camera in hand. Despite old technology, my XV is frequently my camera of choice, particularly in the close-focus domain. Edited April 26, 2018 by wda", "link": "https://www.l-camera-forum.com/topic/281928-x-vario-mis-focusing/?tab=comments#comment-3507110", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have switched to using the -----> spot !!!  focusing instead of one-point and have had much better focus accuracy. but, it does come at the cost of slower focusing and more missed focuses (not mis-focus, the red box ones) especially when the light gets dim. ps i did not wind up sending my camera to leica as i didn’t want to be without it for a long time and switching focus modes seemed to help a good bit. i understand your approach to achieving consistent focusing accuracy; mine, currently, is rather different. mine is a more flexible technique. spot focusing is essential for highlighting a face in a crowd, or specific florets within a cluster of emerging blossom buds. but it is a technique calling for considerable skill and time if striving for a consistently high success rate. when observing a sea of faces, i sometimes prefer to change focus mode (easy to do) and pick multi-zone. often that will give good results, but not always. when that mode fails, i switch quickly to manual mode with zoom set on 70mm, resetting as necessary. but i cannot claim 100% success with mf on the xv, compared with the q which has higher resolution viewfinder imaging or rangefinder solutions. as always, i need to hone my skills on a regular basis depending on the camera in hand. despite old technology, my xv is frequently my camera of choice, particularly in the close-focus domain. edited april 26, 2018 by wda", "sortedWord": "None", "identifyer": 11257, "year": "2018"}, {"Unnamed: 0": 451603, "autor": "goatsby", "date": 1515889380000, "content": "Just starting to get into the where the sweet spots 109 are after a few weeks of shooting. Still hasn't knocked my X Vario off the block yet but it has been fun so far, time will tell --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/249357-post-your-type-109-images-here/page/12/?tab=comments#comment-3439457", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "just starting to get into the where the sweet -----> spots !!!  109 are after a few weeks of shooting. still hasn't knocked my x vario off the block yet but it has been fun so far, time will tell --img-- --img-- ", "sortedWord": "None", "identifyer": 15140, "year": "2018"}], "name": "spotL-Forum2018"}