{"interestingcomments": [{"Unnamed: 0": 353833, "autor": "farnz", "date": 1372705980000, "content": " This is a warning for anyone who considers attaching their (M) Bellows II to their M240: if you do, you will be unable to remove the Bellows II afterwards because the bellows's rear plate will prevent you from reaching the lens release button. I know because I did it last night without thinking and couldn't remove my Bellows II.--img--  The M240's lens release button has a metal collar and the bellows's rear plate fits so closely to it without touching it that I couldn't even insert a knife blade between the two (I tried). \"What did you do?\" I hear you ask. Well, I took the M240 and Bellows II combo to Red Dot Cameras, where I had bought the camera, prepared to be without my camera while it was returned to Solms for a 'Bellows-ectomy'. I showed Ivor, the co-proprietor, and he fixed it on the spot by removing a shroud from the bellows with a tiny screwdriver to remove two tiny screws and a set of circlip pliers to unscrew the shroud, which gave access to the lens release button. I asked Ivor how he knew how to remove the shroud to take the bellows off and he laughed heartily and said that he'd done the same thing himself and thought it needed to be sent back to Solms until he started taking the bellows apart and found how to fix it. My deepest thanks to Ivor from Red Dot Cameras for removing my bellows from my M240 so quickly and for having ... um ... 'done the research'!--img--  Pete. PS: if you want to attach your Bellows II to your M240 you can do it if you use a OUFRO (16469), which is the Visoflex extension ring to give 1:1 reproduction ratios with 35 and 50mm lenses, because this provides enough space to operate the lens release button. (I haven't checked the optical result only the mechanical one.) Edited July 1, 2013 by farnz", "link": "https://www.l-camera-forum.com/topic/208005-warning-m-typ-240-and-bellows-ii/?tab=comments#comment-2363399", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " this is a warning for anyone who considers attaching their (m) bellows ii to their m240: if you do, you will be unable to remove the bellows ii afterwards because the bellows's rear plate will prevent you from reaching the lens release button. i know because i did it last night without thinking and couldn't remove my bellows ii.--img--  the m240's lens release button has a metal collar and the bellows's rear plate fits so closely to it without touching it that i couldn't even insert a knife blade between the two (i tried). \"what did you do?\" i hear you ask. well, i took the m240 and bellows ii combo to red dot cameras, where i had bought the camera, prepared to be without my camera while it was returned to solms for a 'bellows-ectomy'. i showed ivor, the co-proprietor, and he fixed it on the -----> spot !!!  by removing a shroud from the bellows with a tiny screwdriver to remove two tiny screws and a set of circlip pliers to unscrew the shroud, which gave access to the lens release button. i asked ivor how he knew how to remove the shroud to take the bellows off and he laughed heartily and said that he'd done the same thing himself and thought it needed to be sent back to solms until he started taking the bellows apart and found how to fix it. my deepest thanks to ivor from red dot cameras for removing my bellows from my m240 so quickly and for having ... um ... 'done the research'!--img--  pete. ps: if you want to attach your bellows ii to your m240 you can do it if you use a oufro (16469), which is the visoflex extension ring to give 1:1 reproduction ratios with 35 and 50mm lenses, because this provides enough space to operate the lens release button. (i haven't checked the optical result only the mechanical one.) edited july 1, 2013 by farnz", "sortedWord": "None", "identifyer": 14986, "year": "2013"}, {"Unnamed: 0": 356084, "autor": "jaapv", "date": 1362880800000, "content": " Question: There are spots on my images, especially at small apertures. This is sensor dirt. All digital cameras with interchangeable lenses have this problem, but an M is particularly prone, because there is no mirror as extra barrier and the lack of an AA filter makes the dirt more visible. One should prevent dust from entering the camera as much as possible. There are a number of strategies. 1. Avoid changing lenses more than necessary. 2. Change lenses in as much of a dust-free environment as possible 3. Keep the rear end of the lens as clean as possible 4. Change the lens with the camera mouth facing downwards 5. (This may be a myth) Switch off the camera before changing lenses. But dust will come on the sensor anyway. The Leica M has a dust detection system that will help you locate the dust. Consult the manual to find the sensor cleaning item in the menu and use a FULLY charged battery. Before opening the shutter blow out the camera (using a bulb blower, not compressed air or your mouth!) to dislodge any loose dust. If the dust on the sensor is loose one can blow off the sensor using a good bulb blower, (Rocket Blower by Giotto for instance) with the camera mouth facing downwards. If that does not clear the problem there are sensor brushes like the Arctic Butterfly by Visible Dust that are quite effective or the little vacuum cleaner by Green Clean. At this stage the use of a Sensor Loupe can be very helpful. If spots on the sensor persist you are dealing with stuck dirt like pollen or oil spots and need to revert to wet cleaning. There are numerous threads on the subject. The Visible Dust products are highly recommended or the Green Clean wet-and-dry method. Use a proper solvent for grease if you think you are dealing with oil etc. (Visible Dust Smear Away or Dust-Aid Sensor Clean (my preference) Open the shutter for cleaning and blow it once again with a bulb blower or vacuum clean it, to remove any loose particles which might be dragged across the sensor and cause scratches. Although the M is full frame and there are size 1 sensor swabs on the market, I prefer using the swabs for 1.3 sensors (and APS-C swabs for the M8) Take a clean swab, put on three small drops of Sensor Cleaning Fluid and in two sweeps, top and bottow go to one side - do not over-press!!- and sweep back again, using the other side of the swab automatically. Or, using the wet-and-dry system, swab with the wet sponge and dry with a couple of sweeps with the dry swab. Don't let the fluid spill over the edge of the sensor too much - there are electronic connections there. That is all - close the shutter and test the camera by taking an unfocussed image of an evenly lit surface at the smallest aperture. In the unlikely case it is needed, repeat. There are other cleaning systems, like stamping the dust away, but my personal experience with those was not very good. Others, including Leica Customer Service seem to be quite happy using them, so it is clearly a matter of preference. Nevertheless with such systems wet cleaning will become unavoidable at a certain point. There are also sensor cleaning services or Leica Customer Service, but those are expensive and will keep the camera for a while. They may also not be readily available if one is travelling. Sensor cleaning is something any owner should be able to do himself. If you are fairly certain your spots are oil or grease, it may be wise to omit the step with the Arctic Butterfly, as it may become contaminated by the grease. In case that happens it can be cleaned with the special fluid provided.", "link": "https://www.l-camera-forum.com/topic/216580-leica-m8-m82-m9-m9p-mm-mtyp240-faqs-questions-with-answers/page/5/?tab=comments#comment-2464169", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " question: there are -----> spots !!!  on my images, especially at small apertures. this is sensor dirt. all digital cameras with interchangeable lenses have this problem, but an m is particularly prone, because there is no mirror as extra barrier and the lack of an aa filter makes the dirt more visible. one should prevent dust from entering the camera as much as possible. there are a number of strategies. 1. avoid changing lenses more than necessary. 2. change lenses in as much of a dust-free environment as possible 3. keep the rear end of the lens as clean as possible 4. change the lens with the camera mouth facing downwards 5. (this may be a myth) switch off the camera before changing lenses. but dust will come on the sensor anyway. the leica m has a dust detection system that will help you locate the dust. consult the manual to find the sensor cleaning item in the menu and use a fully charged battery. before opening the shutter blow out the camera (using a bulb blower, not compressed air or your mouth!) to dislodge any loose dust. if the dust on the sensor is loose one can blow off the sensor using a good bulb blower, (rocket blower by giotto for instance) with the camera mouth facing downwards. if that does not clear the problem there are sensor brushes like the arctic butterfly by visible dust that are quite effective or the little vacuum cleaner by green clean. at this stage the use of a sensor loupe can be very helpful. if spots on the sensor persist you are dealing with stuck dirt like pollen or oil spots and need to revert to wet cleaning. there are numerous threads on the subject. the visible dust products are highly recommended or the green clean wet-and-dry method. use a proper solvent for grease if you think you are dealing with oil etc. (visible dust smear away or dust-aid sensor clean (my preference) open the shutter for cleaning and blow it once again with a bulb blower or vacuum clean it, to remove any loose particles which might be dragged across the sensor and cause scratches. although the m is full frame and there are size 1 sensor swabs on the market, i prefer using the swabs for 1.3 sensors (and aps-c swabs for the m8) take a clean swab, put on three small drops of sensor cleaning fluid and in two sweeps, top and bottow go to one side - do not over-press!!- and sweep back again, using the other side of the swab automatically. or, using the wet-and-dry system, swab with the wet sponge and dry with a couple of sweeps with the dry swab. don't let the fluid spill over the edge of the sensor too much - there are electronic connections there. that is all - close the shutter and test the camera by taking an unfocussed image of an evenly lit surface at the smallest aperture. in the unlikely case it is needed, repeat. there are other cleaning systems, like stamping the dust away, but my personal experience with those was not very good. others, including leica customer service seem to be quite happy using them, so it is clearly a matter of preference. nevertheless with such systems wet cleaning will become unavoidable at a certain point. there are also sensor cleaning services or leica customer service, but those are expensive and will keep the camera for a while. they may also not be readily available if one is travelling. sensor cleaning is something any owner should be able to do himself. if you are fairly certain your spots are oil or grease, it may be wise to omit the step with the arctic butterfly, as it may become contaminated by the grease. in case that happens it can be cleaned with the special fluid provided.", "sortedWord": "None", "identifyer": 17250, "year": "2013"}, {"Unnamed: 0": 359668, "autor": "hansmezger", "date": 1382362440000, "content": "I believe some of the angst folks seem to have on this topic is that with the M, Leica removed a capability some found extremely useful in the M8, and M9. With these bodies one has full manual control by setting ISO, aperture, and shutter speed, using the dedicated control for each. But these bodies also permit the photographer to fix shutter speed (say at a value high enough to freeze subject or camera movement), select the aperture for desired DOF, and let the body calculate an ISO that produced proper exposure. This mode of operation is particularly useful in event shooting under changing lighting conditions where fully manual operation results in a lot of missed opportunities. Spot on! I really don't understand why it takes like forever for Leica to this... I have been using this feature on my Fuji and all I can say is that it made my life much more easier! Wish my 10k camera could do that... Btw.. For the ones who are against this update...I'd highly advise you to pay a visit to psychiatrist;)", "link": "https://www.l-camera-forum.com/topic/214618-behavior-of-m240-auto-iso/?tab=comments#comment-2447291", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i believe some of the angst folks seem to have on this topic is that with the m, leica removed a capability some found extremely useful in the m8, and m9. with these bodies one has full manual control by setting iso, aperture, and shutter speed, using the dedicated control for each. but these bodies also permit the photographer to fix shutter speed (say at a value high enough to freeze subject or camera movement), select the aperture for desired dof, and let the body calculate an iso that produced proper exposure. this mode of operation is particularly useful in event shooting under changing lighting conditions where fully manual operation results in a lot of missed opportunities. -----> spot !!!  on! i really don't understand why it takes like forever for leica to this... i have been using this feature on my fuji and all i can say is that it made my life much more easier! wish my 10k camera could do that... btw.. for the ones who are against this update...i'd highly advise you to pay a visit to psychiatrist;)", "sortedWord": "None", "identifyer": 20851, "year": "2013"}, {"Unnamed: 0": 369524, "autor": "FlashGordonPhotography", "date": 1362544140000, "content": "There's been a couple of threads on this lately. The best resource is on this forum. The first page has everything you need. http://www.l-camera-forum.com/leica-forum/leica-m9-forum/122176-m9-coincidence-infinity.html I suggest you find a focus chart online ans possibly invest in a magnifier for getting infinity absolutely perfect. Those two things made is much easier for me. Also don't contemplate doing this unless it's with a lens you are absolutely sure is spot on. If the lens you use is out you'll have all sorts of troubles. Gordon", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/9/?tab=comments#comment-2262275", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "there's been a couple of threads on this lately. the best resource is on this forum. the first page has everything you need. http://www.l-camera-forum.com/leica-forum/leica-m9-forum/122176-m9-coincidence-infinity.html i suggest you find a focus chart online ans possibly invest in a magnifier for getting infinity absolutely perfect. those two things made is much easier for me. also don't contemplate doing this unless it's with a lens you are absolutely sure is -----> spot !!!  on. if the lens you use is out you'll have all sorts of troubles. gordon", "sortedWord": "None", "identifyer": 30821, "year": "2013"}, {"Unnamed: 0": 369532, "autor": "rapids41", "date": 1382012100000, "content": "Can some please help me with the midrange calibration? I adjust the roller and the length of the arm. At 0.7m-1.5m focus is spot on, altough at >5m, but between I have frontfocus. I checked booth lenses on my M9 where all is ok, so I dont think that I have a problem with my lenses. Any suggestions?", "link": "https://www.l-camera-forum.com/topic/118043-m9-coincidence-at-infinity/page/10/?tab=comments#comment-2444061", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "can some please help me with the midrange calibration? i adjust the roller and the length of the arm. at 0.7m-1.5m focus is -----> spot !!!  on, altough at >5m, but between i have frontfocus. i checked booth lenses on my m9 where all is ok, so i dont think that i have a problem with my lenses. any suggestions?", "sortedWord": "None", "identifyer": 30829, "year": "2013"}, {"Unnamed: 0": 374634, "autor": "thighslapper", "date": 1370298180000, "content": "Thank you Jaapv, this should be doable. Btw. what's the designation of the special tool (for ebay search)?Many thanks to others who have tried to help me out. I have the Ebay sourced tool and have done it ..... it's very easy. If you have an eyepiece magnifier it helps ..... that way you can be 100% sure you are spot on.", "link": "https://www.l-camera-forum.com/topic/204292-vertical-alignment-mm/?tab=comments#comment-2338441", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thank you jaapv, this should be doable. btw. what's the designation of the special tool (for ebay search)?many thanks to others who have tried to help me out. i have the ebay sourced tool and have done it ..... it's very easy. if you have an eyepiece magnifier it helps ..... that way you can be 100% sure you are -----> spot !!!  on.", "sortedWord": "None", "identifyer": 35940, "year": "2013"}, {"Unnamed: 0": 374635, "autor": "dystorsion", "date": 1370300940000, "content": "I have the Ebay sourced tool and have done it ..... it's very easy. If you have an eyepiece magnifier it helps ..... that way you can be 100% sure you are spot on. Fantastic. Thanks for the follow-up.", "link": "https://www.l-camera-forum.com/topic/204292-vertical-alignment-mm/?tab=comments#comment-2338449", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have the ebay sourced tool and have done it ..... it's very easy. if you have an eyepiece magnifier it helps ..... that way you can be 100% sure you are -----> spot !!!  on. fantastic. thanks for the follow-up.", "sortedWord": "None", "identifyer": 35941, "year": "2013"}, {"Unnamed: 0": 376662, "autor": "Clong34", "date": 1384019640000, "content": " I have found strange white spots on my M9 sensor. It doesn't seem to be dust as dust spot and oil spots are black. I have cleaned the sensor with an Artic Butterfly and then wet cleaned it with a swab and isopropyl with no success besides the removal of dust and oil Under closer investigation I have found these same spots but not as well pronounced, on pictures that date back a year. Attached is a picture of the full frame and a 100% crop in the top left corner. Additional to this what seems to be a long scratch has also appeared. I have cleaned sensors before and have never managed to scratch or damage anything Could this be a delaminating sensor? --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2461664", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " i have found strange white -----> spots !!!  on my m9 sensor. it doesn't seem to be dust as dust spot and oil spots are black. i have cleaned the sensor with an artic butterfly and then wet cleaned it with a swab and isopropyl with no success besides the removal of dust and oil under closer investigation i have found these same spots but not as well pronounced, on pictures that date back a year. attached is a picture of the full frame and a 100% crop in the top left corner. additional to this what seems to be a long scratch has also appeared. i have cleaned sensors before and have never managed to scratch or damage anything could this be a delaminating sensor? --img-- --img-- ", "sortedWord": "None", "identifyer": 37973, "year": "2013"}, {"Unnamed: 0": 376666, "autor": "BA-photos", "date": 1384028160000, "content": "Thanks for your reply. I plan to send the camera to Solms come Monday and they can evaluate the sensor.. I can't get it clean anyways and if it can be cleaned then for once it can be done professionally by leica, even though I believe I may be waiting some time for it's return. I've just never seen anything like this before and was hoping someone else had a similar experience. I had similar issue with my M9. I initially thought it was dust as well but after unsuccessful sensor cleaning attempt and a close inspection, I realized that they were permanent spots on sensor. I sent the camera to Leica service center and they replaced the sensor for free. Camera was not under warranty. After I sent the camera to Leica, I found the following discussion that seems to be similar issue: The M9 and amazing customer service from Leica at the Solms factory by Lee Craker | STEVE HUFF PHOTOS", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2461769", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "thanks for your reply. i plan to send the camera to solms come monday and they can evaluate the sensor.. i can't get it clean anyways and if it can be cleaned then for once it can be done professionally by leica, even though i believe i may be waiting some time for it's return. i've just never seen anything like this before and was hoping someone else had a similar experience. i had similar issue with my m9. i initially thought it was dust as well but after unsuccessful sensor cleaning attempt and a close inspection, i realized that they were permanent -----> spots !!!  on sensor. i sent the camera to leica service center and they replaced the sensor for free. camera was not under warranty. after i sent the camera to leica, i found the following discussion that seems to be similar issue: the m9 and amazing customer service from leica at the solms factory by lee craker | steve huff photos", "sortedWord": "None", "identifyer": 37977, "year": "2013"}, {"Unnamed: 0": 376667, "autor": "Philjh", "date": 1384109940000, "content": "My M-E had similar problem only I had lines rather than spots. It's now in Solms having it's sensor changed. Apparently Leica was going to return the camera after a sensor clean then changed their minds. Only had camera since march so it's annoying, but I've got a loaner M9 from my dealer so can keep taking pics.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2462476", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "my m-e had similar problem only i had lines rather than -----> spots !!! . it's now in solms having it's sensor changed. apparently leica was going to return the camera after a sensor clean then changed their minds. only had camera since march so it's annoying, but i've got a loaner m9 from my dealer so can keep taking pics.", "sortedWord": "None", "identifyer": 37978, "year": "2013"}, {"Unnamed: 0": 376668, "autor": "albertospa", "date": 1384264860000, "content": " I also wanted to point out this problem on my M9.P. The spots you see on smooth surfaces with small apertures (about f 8). I sent an email with photos at Solms 4 days ago but I have no answer yet. What do you advise me to do? Thank you. --img-- ", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2463736", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": " i also wanted to point out this problem on my m9.p. the -----> spots !!!  you see on smooth surfaces with small apertures (about f 8). i sent an email with photos at solms 4 days ago but i have no answer yet. what do you advise me to do? thank you. --img-- ", "sortedWord": "None", "identifyer": 37979, "year": "2013"}, {"Unnamed: 0": 376669, "autor": "k-hawinkler", "date": 1384272480000, "content": "I also wanted to point out this problem on my M9.P. The spots you see on smooth surfaces with small apertures (about f 8). I sent an email with photos at Solms 4 days ago but I have no answer yet. What do you advise me to do? Thank you. Clean the sensor.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2463802", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i also wanted to point out this problem on my m9.p. the -----> spots !!!  you see on smooth surfaces with small apertures (about f 8). i sent an email with photos at solms 4 days ago but i have no answer yet. what do you advise me to do? thank you. clean the sensor.", "sortedWord": "None", "identifyer": 37980, "year": "2013"}, {"Unnamed: 0": 376670, "autor": "jip", "date": 1384272780000, "content": "I also wanted to point out this problem on my M9.P. The spots you see on smooth surfaces with small apertures (about f 8). I sent an email with photos at Solms 4 days ago but I have no answer yet. What do you advise me to do? Thank you. That is just dust on the sensor, clean the sensor. There are numerous threads on this forum about how to do it. Use the search box! --img-- ", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2463807", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i also wanted to point out this problem on my m9.p. the -----> spots !!!  you see on smooth surfaces with small apertures (about f 8). i sent an email with photos at solms 4 days ago but i have no answer yet. what do you advise me to do? thank you. that is just dust on the sensor, clean the sensor. there are numerous threads on this forum about how to do it. use the search box! --img-- ", "sortedWord": "None", "identifyer": 37981, "year": "2013"}, {"Unnamed: 0": 376671, "autor": "earleygallery", "date": 1384273320000, "content": "Dust or perhaps oil spots on that last image. Give the sensor a 'wet' clean.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2463814", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "dust or perhaps oil -----> spots !!!  on that last image. give the sensor a 'wet' clean.", "sortedWord": "None", "identifyer": 37982, "year": "2013"}, {"Unnamed: 0": 376672, "autor": "albertospa", "date": 1385112000000, "content": "All very good at giving advice. The sensor is not dirty! Those spots are located inside the sensor and therefore must be replaced. I wrote to Leica and got no answer.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2470995", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "all very good at giving advice. the sensor is not dirty! those -----> spots !!!  are located inside the sensor and therefore must be replaced. i wrote to leica and got no answer.", "sortedWord": "None", "identifyer": 37983, "year": "2013"}, {"Unnamed: 0": 376674, "autor": "edwardkaraa", "date": 1385133960000, "content": "I have the same spots on my sensor. They are impossible to remove, I tried several wet cleanings with no success. The spots are not even visible with a loupe so I suspect them to be something else. I sent photos to Leica and asked about the nature of this problem and how to clean the sensor. No reply yet but still hoping.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2471316", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i have the same -----> spots !!!  on my sensor. they are impossible to remove, i tried several wet cleanings with no success. the spots are not even visible with a loupe so i suspect them to be something else. i sent photos to leica and asked about the nature of this problem and how to clean the sensor. no reply yet but still hoping.", "sortedWord": "None", "identifyer": 37985, "year": "2013"}, {"Unnamed: 0": 376675, "autor": "earleygallery", "date": 1385137920000, "content": "All very good at giving advice. The sensor is not dirty! Those spots are located inside the sensor and therefore must be replaced. I wrote to Leica and got no answer. Errr, you asked for advice and people gave you their advice, based on the image you posted. If you already know that the camera has to go back to Leica why did you waste our time?", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2471374", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "all very good at giving advice. the sensor is not dirty! those -----> spots !!!  are located inside the sensor and therefore must be replaced. i wrote to leica and got no answer. errr, you asked for advice and people gave you their advice, based on the image you posted. if you already know that the camera has to go back to leica why did you waste our time?", "sortedWord": "None", "identifyer": 37986, "year": "2013"}, {"Unnamed: 0": 376676, "autor": "250swb", "date": 1385138580000, "content": "I have the same spots on my sensor. They are impossible to remove, I tried several wet cleanings with no success. The spots are not even visible with a loupe so I suspect them to be something else. I sent photos to Leica and asked about the nature of this problem and how to clean the sensor. No reply yet but still hoping. Not all cleaning fluids are the same. Try another brand, or one that specifically removes oil for example. Many people find they need two types, one to remove the dirt/oil, and then another to make the glass clear and free from smears. For instance I use Visible Dust 'Plus', and that cleans the sticky dust off, then Eclipse to remove the smears left behind by the 'Plus', but Eclipse doesn't work very well on its own. Steve", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2471384", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "i have the same -----> spots !!!  on my sensor. they are impossible to remove, i tried several wet cleanings with no success. the spots are not even visible with a loupe so i suspect them to be something else. i sent photos to leica and asked about the nature of this problem and how to clean the sensor. no reply yet but still hoping. not all cleaning fluids are the same. try another brand, or one that specifically removes oil for example. many people find they need two types, one to remove the dirt/oil, and then another to make the glass clear and free from smears. for instance i use visible dust 'plus', and that cleans the sticky dust off, then eclipse to remove the smears left behind by the 'plus', but eclipse doesn't work very well on its own. steve", "sortedWord": "None", "identifyer": 37987, "year": "2013"}, {"Unnamed: 0": 376679, "autor": "mastrantonio", "date": 1385295060000, "content": "ciao I have same spot on my M9 - august 2011 Leica shop in Roma- I ask how many time will take to have camera fixed back, I work with my M9. --img--  --img--  --img--  --img-- ", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2472621", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "ciao i have same -----> spot !!!  on my m9 - august 2011 leica shop in roma- i ask how many time will take to have camera fixed back, i work with my m9. --img--  --img--  --img--  --img-- ", "sortedWord": "None", "identifyer": 37990, "year": "2013"}, {"Unnamed: 0": 376680, "autor": "250swb", "date": 1385301600000, "content": "ciao I have same spot on my M9 - august 2011 Leica shop in Roma- I ask how many time will take to have camera fixed back, I work with my M9. You can clean the oil and dust spots off yourself in a few minutes. Plenty of advice already available in threads dedicated to cleaning. Steve", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/?tab=comments#comment-2472670", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "ciao i have same -----> spot !!!  on my m9 - august 2011 leica shop in roma- i ask how many time will take to have camera fixed back, i work with my m9. you can clean the oil and dust spots off yourself in a few minutes. plenty of advice already available in threads dedicated to cleaning. steve", "sortedWord": "None", "identifyer": 37991, "year": "2013"}, {"Unnamed: 0": 376683, "autor": "Willycruz", "date": 1385486220000, "content": "Unfortunately I too have a similar problem, so many dots, on the sensor. I've never cleaned the sensor. Each spot has a dot inside. Ten days ago I sent an email to Leica(customer service) with the file attached to ask what to do and a quote (the M9 is not under warranty anymore) but I have not received any reply. Today I decided that I will be posting the M9 to Solms. Hopefully everything goes well!--img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/2/?tab=comments#comment-2474444", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "unfortunately i too have a similar problem, so many dots, on the sensor. i've never cleaned the sensor. each -----> spot !!!  has a dot inside. ten days ago i sent an email to leica(customer service) with the file attached to ask what to do and a quote (the m9 is not under warranty anymore) but i have not received any reply. today i decided that i will be posting the m9 to solms. hopefully everything goes well!--img-- --img-- ", "sortedWord": "None", "identifyer": 37994, "year": "2013"}, {"Unnamed: 0": 376684, "autor": "250swb", "date": 1385538480000, "content": "These are white spots caused by damage under the surface, not to be mistaken with dark dust blobs (which you also have in abundance) . Hope it goes well at Solms for you. Steve Edited November 27, 2013 by 250swb", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/2/?tab=comments#comment-2474850", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "these are white -----> spots !!!  caused by damage under the surface, not to be mistaken with dark dust blobs (which you also have in abundance) . hope it goes well at solms for you. steve edited november 27, 2013 by 250swb", "sortedWord": "None", "identifyer": 37995, "year": "2013"}, {"Unnamed: 0": 376700, "autor": "edwardkaraa", "date": 1385915160000, "content": "Unfortunately my camera sensor seems to be in the precursor phase to complete delamination. It is showing exactly the same spots but still dark, which means the coating is still in place and did not detach completely. Some on this forum suggested it might be dried oil spots, so I have tried cleaning with Sensor Smear, isopropyl, methanol, to no avail. The spots remain exactly in the same place with no signs of smearing or reduction after cleaning. Note that my camera is still one year old and until these spots appeared I have never tried to clean the sensor. I emailed Leica asking about the nature of these spots over 2 weeks ago, and for the first time ever, they did not reply to my email. I believe Leica has a real problem here. A brand new MM and ME that belong to friends of mine have the exact same problem. I think Leica is just burying its head in the sand hoping the problem will go away.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/2/?tab=comments#comment-2477767", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "unfortunately my camera sensor seems to be in the precursor phase to complete delamination. it is showing exactly the same -----> spots !!!  but still dark, which means the coating is still in place and did not detach completely. some on this forum suggested it might be dried oil spots, so i have tried cleaning with sensor smear, isopropyl, methanol, to no avail. the spots remain exactly in the same place with no signs of smearing or reduction after cleaning. note that my camera is still one year old and until these spots appeared i have never tried to clean the sensor. i emailed leica asking about the nature of these spots over 2 weeks ago, and for the first time ever, they did not reply to my email. i believe leica has a real problem here. a brand new mm and me that belong to friends of mine have the exact same problem. i think leica is just burying its head in the sand hoping the problem will go away.", "sortedWord": "None", "identifyer": 38011, "year": "2013"}, {"Unnamed: 0": 376717, "autor": "MXpro1", "date": 1387270440000, "content": "Had my M9 for other service (lens adjustment) at Solms, they found out that the sensor is cracked (one little white spot as shown from you before). They did the lens service and replaced my sensor within a few days and I have my M9 back now. Sensor replacement was free of charge, camera is years out of warranty. Top service!!!", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/3/?tab=comments#comment-2488946", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "had my m9 for other service (lens adjustment) at solms, they found out that the sensor is cracked (one little white -----> spot !!!  as shown from you before). they did the lens service and replaced my sensor within a few days and i have my m9 back now. sensor replacement was free of charge, camera is years out of warranty. top service!!!", "sortedWord": "None", "identifyer": 38028, "year": "2013"}, {"Unnamed: 0": 376719, "autor": "albertospa", "date": 1387372500000, "content": "Had my M9 for other service (lens adjustment) at Solms, they found out that the sensor is cracked (one little white spot as shown from you before). They did the lens service and replaced my sensor within a few days and I have my M9 back now. Sensor replacement was free of charge, camera is years out of warranty. Top service!!! When did this happen?", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/3/?tab=comments#comment-2489864", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "had my m9 for other service (lens adjustment) at solms, they found out that the sensor is cracked (one little white -----> spot !!!  as shown from you before). they did the lens service and replaced my sensor within a few days and i have my m9 back now. sensor replacement was free of charge, camera is years out of warranty. top service!!! when did this happen?", "sortedWord": "None", "identifyer": 38030, "year": "2013"}, {"Unnamed: 0": 376731, "autor": "albertospa", "date": 1387471680000, "content": "Had my M9 for other service (lens adjustment) at Solms, they found out that the sensor is cracked (one little white spot as shown from you before). They did the lens service and replaced my sensor within a few days and I have my M9 back now. Sensor replacement was free of charge, camera is years out of warranty. Top service!!! This is bad news for the service Leica. All of us have their Leica stops for months in the lab and your camera is repaired in a few days. It is not a top service.", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/4/?tab=comments#comment-2490801", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "had my m9 for other service (lens adjustment) at solms, they found out that the sensor is cracked (one little white -----> spot !!!  as shown from you before). they did the lens service and replaced my sensor within a few days and i have my m9 back now. sensor replacement was free of charge, camera is years out of warranty. top service!!! this is bad news for the service leica. all of us have their leica stops for months in the lab and your camera is repaired in a few days. it is not a top service.", "sortedWord": "None", "identifyer": 38042, "year": "2013"}, {"Unnamed: 0": 376732, "autor": "nodrog", "date": 1387503960000, "content": "Very interesting to read everyone's experiences of customer service from Leica. However, no-one has mentioned the problem that, apparently, is delaying the return of my own M9 from Solms. When I realised I had the dreaded sensor cracks, I took my M9 back to the licensed reseller in Ginza, Tokyo, where I had bought it second-hand, and they sent it on to Germany. This was in mid-September. Currently, the updates I am getting from the shop indicate that, although the sensor has been replaced, the factory is now waiting on replacement leather for the body. As yet they have no definite date set for the camera's return. Am I right in thinking that they strip the body to install a sensor? The original leather was just starting to come away in one corner, near the LCD, but I hadn't worried about it. I was going to dab a spot of glue under there at some point if it got worse. Has anyone else heard about this problem of a lack of replacement leather? Peter", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/4/?tab=comments#comment-2491143", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "very interesting to read everyone's experiences of customer service from leica. however, no-one has mentioned the problem that, apparently, is delaying the return of my own m9 from solms. when i realised i had the dreaded sensor cracks, i took my m9 back to the licensed reseller in ginza, tokyo, where i had bought it second-hand, and they sent it on to germany. this was in mid-september. currently, the updates i am getting from the shop indicate that, although the sensor has been replaced, the factory is now waiting on replacement leather for the body. as yet they have no definite date set for the camera's return. am i right in thinking that they strip the body to install a sensor? the original leather was just starting to come away in one corner, near the lcd, but i hadn't worried about it. i was going to dab a -----> spot !!!  of glue under there at some point if it got worse. has anyone else heard about this problem of a lack of replacement leather? peter", "sortedWord": "None", "identifyer": 38043, "year": "2013"}, {"Unnamed: 0": 376737, "autor": "Hamad", "date": 1387771740000, "content": "After reading this. I have seen strong white spots two or three that appear sometimes on my images. It's like one in 1000 images normally on black objects. Could it be same? Any advice Thanks Sent from my iPhone using Tapatalk", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/4/?tab=comments#comment-2493215", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "after reading this. i have seen strong white -----> spots !!!  two or three that appear sometimes on my images. it's like one in 1000 images normally on black objects. could it be same? any advice thanks sent from my iphone using tapatalk", "sortedWord": "None", "identifyer": 38048, "year": "2013"}, {"Unnamed: 0": 376738, "autor": "MXpro1", "date": 1387809360000, "content": "After reading this. I have seen strong white spots two or three that appear sometimes on my images. It's like one in 1000 images normally on black objects. Could it be same? Any adviceThanks Sent from my iPhone using Tapatalk I think you do not need to worry. My white spot could have been seen on every picture at every aperture always at the same position. That what you describe sounds more like dust. Take a look at your photos and if the spots you see are not permanent and tend to be seen best from f8 upwards it might simply be a kind of dust. If they pass away when cleaning the sensor everything is fine, if not I would contact the dealer. Edited December 23, 2013 by MXpro1", "link": "https://www.l-camera-forum.com/topic/216349-strange-white-spots-on-m9-sensor/page/4/?tab=comments#comment-2493492", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "after reading this. i have seen strong white -----> spots !!!  two or three that appear sometimes on my images. it's like one in 1000 images normally on black objects. could it be same? any advicethanks sent from my iphone using tapatalk i think you do not need to worry. my white spot could have been seen on every picture at every aperture always at the same position. that what you describe sounds more like dust. take a look at your photos and if the spots you see are not permanent and tend to be seen best from f8 upwards it might simply be a kind of dust. if they pass away when cleaning the sensor everything is fine, if not i would contact the dealer. edited december 23, 2013 by mxpro1", "sortedWord": "None", "identifyer": 38049, "year": "2013"}, {"Unnamed: 0": 377815, "autor": "digitalfx", "date": 1371912540000, "content": "Danny's post is spot on...I use the EFV on every focal length, some less than others. But it adds tremendous value to the M system. There are times on any lens that the rangefinder is nearly impossible to focus, in these instances having the EVF is priceless. The combination of the amazing new rangefinder and the option of using an EVF in certain situations or with specific lenses (like my 100mm APM Macro R Lens) makes the M (Type 240) the finest M produced to date. BTW- get the Olympus...its exactly the same and half the cost.", "link": "https://www.l-camera-forum.com/topic/207326-evf-should-i-buy-one/?tab=comments#comment-2355843", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "danny's post is -----> spot !!!  on...i use the efv on every focal length, some less than others. but it adds tremendous value to the m system. there are times on any lens that the rangefinder is nearly impossible to focus, in these instances having the evf is priceless. the combination of the amazing new rangefinder and the option of using an evf in certain situations or with specific lenses (like my 100mm apm macro r lens) makes the m (type 240) the finest m produced to date. btw- get the olympus...its exactly the same and half the cost.", "sortedWord": "None", "identifyer": 39128, "year": "2013"}, {"Unnamed: 0": 381560, "autor": "JMF", "date": 1388518020000, "content": "On Christmas night I shot a muted sunset using both the M8 and M240. I liked how the M8 worked with the Elmarit 21 so much better. LFI used the M8 photo in their Master Shots. I really love the M240 but the M8 is still a wonderful, magical camera. I will keep it for as long as it will let me. Nice shot indeed on the LFI gallery ! Then I spotted a shot of mine in there too ! M8 + 35 summilux pre asph --img-- Praia do Forte PB 12 by aka careca2012, on Flickr Here another with a 21 Elmarit pre asph on M8: --img-- Praia do Forte PB 16 by aka careca2012, on Flickr Cheers Jean-Marc", "link": "https://www.l-camera-forum.com/topic/160294-still-loving-the-m8/page/16/?tab=comments#comment-2499015", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "on christmas night i shot a muted sunset using both the m8 and m240. i liked how the m8 worked with the elmarit 21 so much better. lfi used the m8 photo in their master shots. i really love the m240 but the m8 is still a wonderful, magical camera. i will keep it for as long as it will let me. nice shot indeed on the lfi gallery ! then i -----> spotted !!!  a shot of mine in there too ! m8 + 35 summilux pre asph --img-- praia do forte pb 12 by aka careca2012, on flickr here another with a 21 elmarit pre asph on m8: --img-- praia do forte pb 16 by aka careca2012, on flickr cheers jean-marc", "sortedWord": "None", "identifyer": 42953, "year": "2013"}, {"Unnamed: 0": 387557, "autor": "gsgary", "date": 1361307720000, "content": "...beautiful camera, gsgary - have both your M4-2 and M4-P been CLA'd recently? Only had M4-2 (User condition) for 4 months was advertised as beeing done bought from Red Dot, and dont think a roll of film has been through the M4-P untill this last weekend told it had been checked , shot 4 and all the negs look spot on bought from Mifsuds, i think i got it cheap for a limited edition only paid £699 boxed, certifitate, manual Edited February 19, 2013 by gsgary", "link": "https://www.l-camera-forum.com/topic/141350-i-love-my-m4/page/5/?tab=comments#comment-2247756", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "...beautiful camera, gsgary - have both your m4-2 and m4-p been cla'd recently? only had m4-2 (user condition) for 4 months was advertised as beeing done bought from red dot, and dont think a roll of film has been through the m4-p untill this last weekend told it had been checked , shot 4 and all the negs look -----> spot !!!  on bought from mifsuds, i think i got it cheap for a limited edition only paid £699 boxed, certifitate, manual edited february 19, 2013 by gsgary", "sortedWord": "None", "identifyer": 2, "year": "2013"}, {"Unnamed: 0": 387613, "autor": "philipus", "date": 1379787180000, "content": "While I was up in the Arctic, my M4 returned from Solms after repair and service following my recent bicycle crash. During the 4 weeks it took from me sending it in until it returned (quick in my book) I bought a 50 Summicron and hood of the same vintage as the camera, 1970, so now the set is complete. In addition to repairing the misaligned rangefinder Leica overhauled the shutter mechanism and verified that all times are spot on. It was a great camera before, but now it is really sublime to use. Cheers Philip --img-- ", "link": "https://www.l-camera-forum.com/topic/141350-i-love-my-m4/page/8/?tab=comments#comment-2425852", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "while i was up in the arctic, my m4 returned from solms after repair and service following my recent bicycle crash. during the 4 weeks it took from me sending it in until it returned (quick in my book) i bought a 50 summicron and hood of the same vintage as the camera, 1970, so now the set is complete. in addition to repairing the misaligned rangefinder leica overhauled the shutter mechanism and verified that all times are -----> spot !!!  on. it was a great camera before, but now it is really sublime to use. cheers philip --img-- ", "sortedWord": "None", "identifyer": 59, "year": "2013"}, {"Unnamed: 0": 445251, "autor": "euston", "date": 1372504800000, "content": "I’m posting this as an example of a JPEG straight from the camera with no further processing except resizing for this site and conversion to sRGB. On my screen the colour of this JPEG is spot-on. I think it’s impressive because these shades of pink are difficult to get right working with the raw file. I’m reasonably proficient at developing raw files in ACR but it took me some time to approach the colour accuracy of this JPEG. In fact, the camera made a better job of it than I did. I’d be interested to hear what other users think of the camera-processed JPEGs. It’s rather enjoyable to have an under-rated camera with hidden talents. Using it is a voyage of discovery. Alba rose Königin von Dänemark --img-- JPEG (Adobe RGB) 70mm (equivalent) 1/125 at f/8 ISO 100 Edited June 29, 2013 by euston", "link": "https://www.l-camera-forum.com/topic/206939-leica-x-vario-photos/page/2/?tab=comments#comment-2361345", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i’m posting this as an example of a jpeg straight from the camera with no further processing except resizing for this site and conversion to srgb. on my screen the colour of this jpeg is -----> spot !!! -on. i think it’s impressive because these shades of pink are difficult to get right working with the raw file. i’m reasonably proficient at developing raw files in acr but it took me some time to approach the colour accuracy of this jpeg. in fact, the camera made a better job of it than i did. i’d be interested to hear what other users think of the camera-processed jpegs. it’s rather enjoyable to have an under-rated camera with hidden talents. using it is a voyage of discovery. alba rose königin von dänemark --img-- jpeg (adobe rgb) 70mm (equivalent) 1/125 at f/8 iso 100 edited june 29, 2013 by euston", "sortedWord": "None", "identifyer": 8651, "year": "2013"}, {"Unnamed: 0": 445313, "autor": "wda", "date": 1375796220000, "content": "I’m posting this as an example of a JPEG straight from the camera with no further processing except resizing for this site and conversion to sRGB. On my screen the colour of this JPEG is spot-on. I think it’s impressive because these shades of pink are difficult to get right working with the raw file. I’m reasonably proficient at developing raw files in ACR but it took me some time to approach the colour accuracy of this JPEG. In fact, the camera made a better job of it than I did. I’d be interested to hear what other users think of the camera-processed JPEGs. It’s rather enjoyable to have an under-rated camera with hidden talents. Using it is a voyage of discovery. Alba rose Königin von Dänemark JPEG (Adobe RGB) 70mm (equivalent) 1/125 at f/8 ISO 100 Euston, regardless of which route you take, do you ever use a grey card, such as Pantone ColorChecker when in pursuit of accurate colour?", "link": "https://www.l-camera-forum.com/topic/206939-leica-x-vario-photos/page/5/?tab=comments#comment-2391574", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i’m posting this as an example of a jpeg straight from the camera with no further processing except resizing for this site and conversion to srgb. on my screen the colour of this jpeg is -----> spot !!! -on. i think it’s impressive because these shades of pink are difficult to get right working with the raw file. i’m reasonably proficient at developing raw files in acr but it took me some time to approach the colour accuracy of this jpeg. in fact, the camera made a better job of it than i did. i’d be interested to hear what other users think of the camera-processed jpegs. it’s rather enjoyable to have an under-rated camera with hidden talents. using it is a voyage of discovery. alba rose königin von dänemark jpeg (adobe rgb) 70mm (equivalent) 1/125 at f/8 iso 100 euston, regardless of which route you take, do you ever use a grey card, such as pantone colorchecker when in pursuit of accurate colour?", "sortedWord": "None", "identifyer": 8713, "year": "2013"}, {"Unnamed: 0": 445381, "autor": "Guytou", "date": 1388229900000, "content": "Thank you. Yes, it is about a very old passage in an interior court. There was little light and spot measurement of X Vario was effective. Here is another wholesale plan : --img-- ", "link": "https://www.l-camera-forum.com/topic/206939-leica-x-vario-photos/page/9/?tab=comments#comment-2496588", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "thank you. yes, it is about a very old passage in an interior court. there was little light and -----> spot !!!  measurement of x vario was effective. here is another wholesale plan : --img-- ", "sortedWord": "None", "identifyer": 8782, "year": "2013"}, {"Unnamed: 0": 447138, "autor": "dkCambridgeshire", "date": 1360396860000, "content": "Yes it's a 52mm to 49mm step down ring - and the Elpro VIb was glued into the 52mm side of the ring using a few tiny spots of epoxy resin - it's a bit fiddly as there is very little contact available. I also scraped the black anodised finish slightly to ensure metal to metal contact. If you use an Elpro 2 (dual 44mm and 55mm threads) instead of a VIb (Series VI, 44mm thread) you should be able to use a 55mm to 49mm step down ring. I used the VIb because I already had one and additionals were cheaper than the Elpro 2. Best wishes dunk", "link": "https://www.l-camera-forum.com/topic/179342-improving-the-x1-x2-macro-performance/?tab=comments#comment-2237717", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spots", "selectorShort": "spot", "MarkedSent": "yes it's a 52mm to 49mm step down ring - and the elpro vib was glued into the 52mm side of the ring using a few tiny -----> spots !!!  of epoxy resin - it's a bit fiddly as there is very little contact available. i also scraped the black anodised finish slightly to ensure metal to metal contact. if you use an elpro 2 (dual 44mm and 55mm threads) instead of a vib (series vi, 44mm thread) you should be able to use a 55mm to 49mm step down ring. i used the vib because i already had one and additionals were cheaper than the elpro 2. best wishes dunk", "sortedWord": "None", "identifyer": 10611, "year": "2013"}, {"Unnamed: 0": 449748, "autor": "barjohn", "date": 1381237740000, "content": "Returning to the topic of this thread, I sent the following email to Leica software two days ago and they have responded that it has been forwarded to the right department. I will inform all on their response when I receive one: Dear Software Team: The following are my observations of my perceived flaws with the current version 1.0 firmware: 1. Auto Focus is relatively slow, especially compared to Olympus EM-5, EM-1 and Panasonic GX-7. In bright daylight it can struggle to find focus and this appears to be caused by the lens stopping down prior to focusing rather than focusing wide open and then stopping down to shoot. 2. Auto Focus misses focus frequently enough to not be trusted, often selecting a higher contrast part of the image outside of the focus rectangle, even when spot focus is selected. Face detect frequently struggles to find and lock on faces and miss focuses. Every single mode, 1-Point, 11-Point, Spot and Face Detect have focusing errors. Low contrast subject appear to be especially challenging unless there is a high contrast vertical line in the focus area. 3. The absence of DOF information makes using zone focusing a challenge. Further the camera does not display on the LCD or EVF the selected focus distance. Displaying a combination of focus distance and depth of field for the selected aperture and focal length would be extremely valuable. 4. Start up time from power on is slow, but even worse is wake-up time from sleep. It can take much longer than the time it takes to do a 1/2 press and raise the camera to eye level for the camera to wake up and this results in many missed shots. 5. Auto ISO needs to have faster shutter speed options than 1/30sec. We should be able to select up to at least 1/250sec. Sometimes we have moving subjects that we don't want blurred. 6. We need a way to scroll (playback) through images while magnified. It is very irritating to have to negatively zoom the image in order to select the next image and then zoom it to try and compare focus. 7. The highest magnification level produces pixilated images that are of little use to determine focus accuracy. One should be able to go to the highest magnification and see a clean and sharp image. Other cameras are capable so there is no reason the X Vario shouldn't be able to do the same. 8. A faster way to change metering mode would be useful. Presently one has to go into the menu to change metering mode. Perhaps the down position on the silver disc could be used to select metering mode and then the dial under the thumb could select the desired mode or multiple presses of the down position. 9. Displaying, actual histogram that will appear in the captured image as opposed to a wide open histogram would be very useful. 10. Adding focus peaking with the ability to select the peaking color would be very useful as a MF aid. 11. Support for the Olympus VF-4, EVF. The current VF-2 EVF lacks resolution, contrast and color accuracy, it is only barely usable. It also can be difficult to switch between the EVF and LCD, sometimes taking multiple button pushes. While there are other irritations in the way the menu items are selected and the inconsistency between the Leica M menu and the X Vario menu are selected, that would be secondary to addressing the issues above. The largest area of complaint on the Leica forum is the auto focus speed and accuracy issues. If I could only have those issues addressed I would find the camera a camera to rave about despite its slow lens and noise at higher ISOs. The other items mentioned above would go a long way toward improving the camera and making it a true photographers instrument. Is there any chance that you are working to address any of these issues? Can we expect a firmware update in the near future that will address these issues? Could you provide any details on which issues Leica sees as priorities and when they might be made available? Finally, if you need a beta tester, I am available and would provide detailed feedback. Thank you, Sincerely, John", "link": "https://www.l-camera-forum.com/topic/213252-x-vario-firmware-suggestion-for-leica/?tab=comments#comment-2437321", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "returning to the topic of this thread, i sent the following email to leica software two days ago and they have responded that it has been forwarded to the right department. i will inform all on their response when i receive one: dear software team: the following are my observations of my perceived flaws with the current version 1.0 firmware: 1. auto focus is relatively slow, especially compared to olympus em-5, em-1 and panasonic gx-7. in bright daylight it can struggle to find focus and this appears to be caused by the lens stopping down prior to focusing rather than focusing wide open and then stopping down to shoot. 2. auto focus misses focus frequently enough to not be trusted, often selecting a higher contrast part of the image outside of the focus rectangle, even when -----> spot !!!  focus is selected. face detect frequently struggles to find and lock on faces and miss focuses. every single mode, 1-point, 11-point, spot and face detect have focusing errors. low contrast subject appear to be especially challenging unless there is a high contrast vertical line in the focus area. 3. the absence of dof information makes using zone focusing a challenge. further the camera does not display on the lcd or evf the selected focus distance. displaying a combination of focus distance and depth of field for the selected aperture and focal length would be extremely valuable. 4. start up time from power on is slow, but even worse is wake-up time from sleep. it can take much longer than the time it takes to do a 1/2 press and raise the camera to eye level for the camera to wake up and this results in many missed shots. 5. auto iso needs to have faster shutter speed options than 1/30sec. we should be able to select up to at least 1/250sec. sometimes we have moving subjects that we don't want blurred. 6. we need a way to scroll (playback) through images while magnified. it is very irritating to have to negatively zoom the image in order to select the next image and then zoom it to try and compare focus. 7. the highest magnification level produces pixilated images that are of little use to determine focus accuracy. one should be able to go to the highest magnification and see a clean and sharp image. other cameras are capable so there is no reason the x vario shouldn't be able to do the same. 8. a faster way to change metering mode would be useful. presently one has to go into the menu to change metering mode. perhaps the down position on the silver disc could be used to select metering mode and then the dial under the thumb could select the desired mode or multiple presses of the down position. 9. displaying, actual histogram that will appear in the captured image as opposed to a wide open histogram would be very useful. 10. adding focus peaking with the ability to select the peaking color would be very useful as a mf aid. 11. support for the olympus vf-4, evf. the current vf-2 evf lacks resolution, contrast and color accuracy, it is only barely usable. it also can be difficult to switch between the evf and lcd, sometimes taking multiple button pushes. while there are other irritations in the way the menu items are selected and the inconsistency between the leica m menu and the x vario menu are selected, that would be secondary to addressing the issues above. the largest area of complaint on the leica forum is the auto focus speed and accuracy issues. if i could only have those issues addressed i would find the camera a camera to rave about despite its slow lens and noise at higher isos. the other items mentioned above would go a long way toward improving the camera and making it a true photographers instrument. is there any chance that you are working to address any of these issues? can we expect a firmware update in the near future that will address these issues? could you provide any details on which issues leica sees as priorities and when they might be made available? finally, if you need a beta tester, i am available and would provide detailed feedback. thank you, sincerely, john", "sortedWord": "None", "identifyer": 13239, "year": "2013"}, {"Unnamed: 0": 449784, "autor": "barjohn", "date": 1377061440000, "content": "I have also experienced some erratic focusing issues where the camera said it was in focus with the green box but a later review of the image indicated it was not in focus. I haven't seen the white balance issue in normal shooting but I have experienced a very strange WB issue when I was shooting my grey wall. As I changed focal length it was fine until I shot at 70mm and suddenly the image was orange. Looking at the histogram showed three separate peaks one for red, one for green and one for blue spaced about 1/3 distance from each other. This was last night. Tonight I tried again only this time I was closer to the wall and it was more brightly lit as I was closer to the light source. At 70mm I got a normal grey rectangle; however, now at 50mm I got the strange orange display. If I pointed the camera at a different area and 1/2 pressed and then took it back to the original spot I would get closer to a grey rectangle but it would have a distinct orange cast. It is clearly some kind of WB issue that is throwing off the camera's algorithm but I haven't clearly identified the cause. I will conduct some more tests and post my results later. I have now produced an abnormal shot and a normal so you can see the difference. I find that when it occurs is unpredictable. Note the ISO changed due to the change in focal length changing the aperture. Shutter speed was held constant to 1/30th. --img-- --img--  Edited August 21, 2013 by barjohn", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/?tab=comments#comment-2402055", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have also experienced some erratic focusing issues where the camera said it was in focus with the green box but a later review of the image indicated it was not in focus. i haven't seen the white balance issue in normal shooting but i have experienced a very strange wb issue when i was shooting my grey wall. as i changed focal length it was fine until i shot at 70mm and suddenly the image was orange. looking at the histogram showed three separate peaks one for red, one for green and one for blue spaced about 1/3 distance from each other. this was last night. tonight i tried again only this time i was closer to the wall and it was more brightly lit as i was closer to the light source. at 70mm i got a normal grey rectangle; however, now at 50mm i got the strange orange display. if i pointed the camera at a different area and 1/2 pressed and then took it back to the original -----> spot !!!  i would get closer to a grey rectangle but it would have a distinct orange cast. it is clearly some kind of wb issue that is throwing off the camera's algorithm but i haven't clearly identified the cause. i will conduct some more tests and post my results later. i have now produced an abnormal shot and a normal so you can see the difference. i find that when it occurs is unpredictable. note the iso changed due to the change in focal length changing the aperture. shutter speed was held constant to 1/30th. --img-- --img--  edited august 21, 2013 by barjohn", "sortedWord": "None", "identifyer": 13275, "year": "2013"}, {"Unnamed: 0": 449792, "autor": "tom0511", "date": 1377098460000, "content": "And where is the \"hurrah a XV\" crowd from the other day now? The number of images where the AF was wrong with the X-Vario doesnt seem any worse than what I had with Nex, m4/3 and other mirrorless cams. Specially face recognition works fine but you cant be 100% sure. The point where the x-vario is better than many other mirror less is spot AF, because many other mirrorless do not offer to focus on such a small area. This would be my recommandation by the way - to not rely too much on face recognition and more in 1 point or spot AF. AWB...the AWB of my X-ario seems fine, however I allways shoot also raw and in case the AWB is wrong I just fix it in post (as I do with most other cameras) Auto is allways ago-works for many things but you cant rely 100% on it", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/?tab=comments#comment-2402403", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "and where is the \"hurrah a xv\" crowd from the other day now? the number of images where the af was wrong with the x-vario doesnt seem any worse than what i had with nex, m4/3 and other mirrorless cams. specially face recognition works fine but you cant be 100% sure. the point where the x-vario is better than many other mirror less is -----> spot !!!  af, because many other mirrorless do not offer to focus on such a small area. this would be my recommandation by the way - to not rely too much on face recognition and more in 1 point or spot af. awb...the awb of my x-ario seems fine, however i allways shoot also raw and in case the awb is wrong i just fix it in post (as i do with most other cameras) auto is allways ago-works for many things but you cant rely 100% on it", "sortedWord": "None", "identifyer": 13283, "year": "2013"}, {"Unnamed: 0": 449798, "autor": "wda", "date": 1377113880000, "content": "Purchased an X Vario on 15 July and after two \"outings\" determined that my camera needs to be sent to Leica to be repaired. I am experiencing erratic AWB and very inconsistent and soft focusing, and/or misfocusing. I own a an X1 so I'm use to poor focusing.... VETTRAN, I only possess an X1 so can only comment on your attribution of poor focusing on that camera. Mine is one of the first released by Leica and I have not been overly concerned by focusing problems. Using the OVF I take care to observe the green glowing LED, even when I am impatient to make the shot. Occasionally errors do occur, but usually due to operator or subject error. (Subject movement). You mention use of 1 Point focus. I also use this setting, not the Spot setting which is too sensitive for my techniques. Regarding your experiences with the XV camera, how accurate are your shots when using manual focusing?", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/?tab=comments#comment-2402561", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "purchased an x vario on 15 july and after two \"outings\" determined that my camera needs to be sent to leica to be repaired. i am experiencing erratic awb and very inconsistent and soft focusing, and/or misfocusing. i own a an x1 so i'm use to poor focusing.... vettran, i only possess an x1 so can only comment on your attribution of poor focusing on that camera. mine is one of the first released by leica and i have not been overly concerned by focusing problems. using the ovf i take care to observe the green glowing led, even when i am impatient to make the shot. occasionally errors do occur, but usually due to operator or subject error. (subject movement). you mention use of 1 point focus. i also use this setting, not the -----> spot !!!  setting which is too sensitive for my techniques. regarding your experiences with the xv camera, how accurate are your shots when using manual focusing?", "sortedWord": "None", "identifyer": 13289, "year": "2013"}, {"Unnamed: 0": 449801, "autor": "rsh", "date": 1377129900000, "content": "The XV has been a fine camera so far. If I want critical autofocus, I use the spot function. If I want critical White Balance, I set it manually. It is not a perfect camera, but no Leica I have ever owned has been perfect, even my beloved M5s.", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/?tab=comments#comment-2402728", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "the xv has been a fine camera so far. if i want critical autofocus, i use the -----> spot !!!  function. if i want critical white balance, i set it manually. it is not a perfect camera, but no leica i have ever owned has been perfect, even my beloved m5s.", "sortedWord": "None", "identifyer": 13292, "year": "2013"}, {"Unnamed: 0": 449803, "autor": "barjohn", "date": 1377139440000, "content": " I have just completed shooting 135 test shots (270 images) testing auto focus and white balance. With the camera tripod mounted and shooting all the way down to 1/4sec, only 1 image was slightly soft and one showed camera shake probably caused by me when I pressed the shutter release. Every other images as tack sharp. My test images were a test pattern, a head shot of my wife and a friend, another test image and a group of objects to test for 3-D focusing. I used every AF method from facial recognition to spot. They all focused equally well though some were faster than others. I tested at all 4 focal lengths to make sure it wasn't focal length related. The blank grey wall test using natural window light with the wall defocused at each focal length illustrated erratic WB behavior and that is evident in the test shots of the blank walls and the black & white test chart. On shooting the color images, the erratic WB behavior seems to disappear. I'm not sure why. WB was easily corrected by selecting auto in LR for both JPGs and DNGs. Lastly, I discovered that the files contain corrective information for both RAW and JPG that LR applies without telling you or allowing you to turn off if you choose. Loading the same files into Iridient Developer allows one to turn off lens correction for the XV profile and it becomes apparent that the lens suffers from moderate to very mild barrel distortion running from wide to tele. This was a surprising finding given the Peter Karbe interview and his statement about their design goals. At least that is what I am seeing. Looking at the shots of the test chart one can see that corner resolution is very good. The JPGs on my DropBox folder have the in camera settings for sharpness and contrast and they are Sharpness \"high\", saturation \"Standard\" and Contrast \"Medium High\". Image stabilization was set to \"ON\". The DNGs are as they came from the camera. The test shots can be viewed and down loaded from the following link Many files are still uploading and it may be a while before all of the files are available. The EXIF data should be intact with all of the information on each file. By the way when I tried some of the same shots hand held at 1/30 sec I had a few mis focused shots. I will explore this a little further as it makes me wonder if the image stabilization being \"ON\" is helping or hindering. I have shot many shots at even 1/15th hand held that were sharp and I don't use burst mode shooting. I am open to suggestions and tests besides the ones I have conducted so far but I am starting to conclude that the AF, while moderate in performance appears to be very accurate if the platform is stable enough. Edited August 22, 2013 by barjohn", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/page/2/?tab=comments#comment-2402774", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " i have just completed shooting 135 test shots (270 images) testing auto focus and white balance. with the camera tripod mounted and shooting all the way down to 1/4sec, only 1 image was slightly soft and one showed camera shake probably caused by me when i pressed the shutter release. every other images as tack sharp. my test images were a test pattern, a head shot of my wife and a friend, another test image and a group of objects to test for 3-d focusing. i used every af method from facial recognition to -----> spot !!! . they all focused equally well though some were faster than others. i tested at all 4 focal lengths to make sure it wasn't focal length related. the blank grey wall test using natural window light with the wall defocused at each focal length illustrated erratic wb behavior and that is evident in the test shots of the blank walls and the black & white test chart. on shooting the color images, the erratic wb behavior seems to disappear. i'm not sure why. wb was easily corrected by selecting auto in lr for both jpgs and dngs. lastly, i discovered that the files contain corrective information for both raw and jpg that lr applies without telling you or allowing you to turn off if you choose. loading the same files into iridient developer allows one to turn off lens correction for the xv profile and it becomes apparent that the lens suffers from moderate to very mild barrel distortion running from wide to tele. this was a surprising finding given the peter karbe interview and his statement about their design goals. at least that is what i am seeing. looking at the shots of the test chart one can see that corner resolution is very good. the jpgs on my dropbox folder have the in camera settings for sharpness and contrast and they are sharpness \"high\", saturation \"standard\" and contrast \"medium high\". image stabilization was set to \"on\". the dngs are as they came from the camera. the test shots can be viewed and down loaded from the following link many files are still uploading and it may be a while before all of the files are available. the exif data should be intact with all of the information on each file. by the way when i tried some of the same shots hand held at 1/30 sec i had a few mis focused shots. i will explore this a little further as it makes me wonder if the image stabilization being \"on\" is helping or hindering. i have shot many shots at even 1/15th hand held that were sharp and i don't use burst mode shooting. i am open to suggestions and tests besides the ones i have conducted so far but i am starting to conclude that the af, while moderate in performance appears to be very accurate if the platform is stable enough. edited august 22, 2013 by barjohn", "sortedWord": "None", "identifyer": 13294, "year": "2013"}, {"Unnamed: 0": 449807, "autor": "barjohn", "date": 1377145740000, "content": "Here are two shots at roughly 50mm hand held arms out at 1/15th f/5.0 spot focused. One with stabilization on and one with it off. Followed by a side-by-side comparison at 100%. --img-- --img-- --img--  Edited August 22, 2013 by barjohn", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/page/2/?tab=comments#comment-2402796", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "here are two shots at roughly 50mm hand held arms out at 1/15th f/5.0 -----> spot !!!  focused. one with stabilization on and one with it off. followed by a side-by-side comparison at 100%. --img-- --img-- --img--  edited august 22, 2013 by barjohn", "sortedWord": "None", "identifyer": 13298, "year": "2013"}, {"Unnamed: 0": 449826, "autor": "popeab", "date": 1377534120000, "content": "Hi, I had a few out of focus pics as well on my XV. Thought that it was caused by the man behind the camera.--img-- Yesterday I took a few pics of my children and indeed I found a few OOF pics that were taken within a few secs after each other. I was sure to have the green rectangle on the eyes of my child but there was a clear misfocus on at least 10% of the pics. Looking forward to find out if more users have this strange behaviour. Maybe Solms is already working on a FW upgrade. John I can confirm that! There are actually focussing errors, though (at least for me) not for 10% of all images. I'm sure I have ever seen a green rectangle and hear an acoustic signal. It seems that it has something to do with my exposure method, if I adjust the exposure to a picture important part or a part made ​​of nearly neutral gray with spot metering to improve the exposure result. Somehow the focus here is sometimes not afterwards. Update: I've proves my pics fraom last holidays on mount Etna and on Iceland. AWB is fine to all images, no problems! The percentage of non sharply focused pictures is actually low at around 1.5%. That might be my mistake rather than that of the camera. In some of the few blurry pictures on Iceland, it was also very windy at shutter speeds of 1/30 sec Thus, the error rate is below 1%. :-) Best regards Andreas Edited August 26, 2013 by popeab", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/page/3/?tab=comments#comment-2405901", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi, i had a few out of focus pics as well on my xv. thought that it was caused by the man behind the camera.--img-- yesterday i took a few pics of my children and indeed i found a few oof pics that were taken within a few secs after each other. i was sure to have the green rectangle on the eyes of my child but there was a clear misfocus on at least 10% of the pics. looking forward to find out if more users have this strange behaviour. maybe solms is already working on a fw upgrade. john i can confirm that! there are actually focussing errors, though (at least for me) not for 10% of all images. i'm sure i have ever seen a green rectangle and hear an acoustic signal. it seems that it has something to do with my exposure method, if i adjust the exposure to a picture important part or a part made ​​of nearly neutral gray with -----> spot !!!  metering to improve the exposure result. somehow the focus here is sometimes not afterwards. update: i've proves my pics fraom last holidays on mount etna and on iceland. awb is fine to all images, no problems! the percentage of non sharply focused pictures is actually low at around 1.5%. that might be my mistake rather than that of the camera. in some of the few blurry pictures on iceland, it was also very windy at shutter speeds of 1/30 sec thus, the error rate is below 1%. :-) best regards andreas edited august 26, 2013 by popeab", "sortedWord": "None", "identifyer": 13317, "year": "2013"}, {"Unnamed: 0": 449830, "autor": "barjohn", "date": 1377905820000, "content": "I did some real world testing today in ideal bright daylight conditions. Shutter speed was never less than 640, all at ISO 100. I varied between spot and 1-Point AF. Out of 32 shots 5 were out of focus. I am including 100% crop samples to illustrate what I am seeing. I could not identify the cause from this test. These were all shot hand held but in every case but one you can see that the camera did not select the right focus point. In one, I can't tell what the camera did as the entire image is out of focus. In every case the green focus box and beep confirmed focus. Unfortunately, the EXIF data does not capture the focus mode but in looking at the expanded EXIF I can't find any clue as to why it miss-focused. In the first image, the focus point was the palm trees in the center of the image. In each case, I have draw a rectangle to show where the camera was focused. --img-- --img-- --img-- --img-- --img-- --img-- --img-- ", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/page/3/?tab=comments#comment-2409431", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i did some real world testing today in ideal bright daylight conditions. shutter speed was never less than 640, all at iso 100. i varied between -----> spot !!!  and 1-point af. out of 32 shots 5 were out of focus. i am including 100% crop samples to illustrate what i am seeing. i could not identify the cause from this test. these were all shot hand held but in every case but one you can see that the camera did not select the right focus point. in one, i can't tell what the camera did as the entire image is out of focus. in every case the green focus box and beep confirmed focus. unfortunately, the exif data does not capture the focus mode but in looking at the expanded exif i can't find any clue as to why it miss-focused. in the first image, the focus point was the palm trees in the center of the image. in each case, i have draw a rectangle to show where the camera was focused. --img-- --img-- --img-- --img-- --img-- --img-- --img-- ", "sortedWord": "None", "identifyer": 13321, "year": "2013"}, {"Unnamed: 0": 449841, "autor": "waloszek", "date": 1378063200000, "content": "I believe that it would be of some help to know which focus mode was set and which distance the camera selected. I therefore inspected the manufacturer-specific fields in the Exif data with ExifTool (I did this for my Ricoh some time ago...). At the moment I can give away this information: Field 0x0404: Focus mode (1 = 1-point, 4 = 11-point, 5 = Spot, 6 = face recognition, 0 = MF) Field 0x040a: The first of the four two-byte fields seems to contain the distance setting; values start with 300 at 30cm and end with 65535 at infinity; there seems to be a jump in the values at around 4m - I need to investigate that further) Best regards, Gerd", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/page/3/?tab=comments#comment-2410855", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i believe that it would be of some help to know which focus mode was set and which distance the camera selected. i therefore inspected the manufacturer-specific fields in the exif data with exiftool (i did this for my ricoh some time ago...). at the moment i can give away this information: field 0x0404: focus mode (1 = 1-point, 4 = 11-point, 5 = -----> spot !!! , 6 = face recognition, 0 = mf) field 0x040a: the first of the four two-byte fields seems to contain the distance setting; values start with 300 at 30cm and end with 65535 at infinity; there seems to be a jump in the values at around 4m - i need to investigate that further) best regards, gerd", "sortedWord": "None", "identifyer": 13332, "year": "2013"}, {"Unnamed: 0": 449846, "autor": "barjohn", "date": 1378095540000, "content": "I have plans to run some more formal tests. I still see it produce out of focus images at unexpected times, like tonight when I was at a home shooting posed pictures and it kept missing focus for no apparent reason. If I hadn't been chimping I wouldn't have known it until it was too late. Among the theories are that the camera converts the color images to grey scale for AF and it the resulting contrast is weak it will fail to focus properly. The other theory had to do with whether the high contrast elements were vertical or horizontal. In testing AF on a 10% grey target the camera was able to achieve AF pretty consistently. I had to drop to 5% grey scale target to cause it to miss AF and then only in spot mode. I 1-Point it was able to find AF (though it took longer) in almost every case. I now want to test where the low contrast image is color image close to human flesh color and see it it does the same thing. I haven't had time and may not have time until I return from a business trip, but I will see what I can do.", "link": "https://www.l-camera-forum.com/topic/211136-issues-with-new-x-vario/page/4/?tab=comments#comment-2411108", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i have plans to run some more formal tests. i still see it produce out of focus images at unexpected times, like tonight when i was at a home shooting posed pictures and it kept missing focus for no apparent reason. if i hadn't been chimping i wouldn't have known it until it was too late. among the theories are that the camera converts the color images to grey scale for af and it the resulting contrast is weak it will fail to focus properly. the other theory had to do with whether the high contrast elements were vertical or horizontal. in testing af on a 10% grey target the camera was able to achieve af pretty consistently. i had to drop to 5% grey scale target to cause it to miss af and then only in -----> spot !!!  mode. i 1-point it was able to find af (though it took longer) in almost every case. i now want to test where the low contrast image is color image close to human flesh color and see it it does the same thing. i haven't had time and may not have time until i return from a business trip, but i will see what i can do.", "sortedWord": "None", "identifyer": 13337, "year": "2013"}], "name": "spotL-Forum2013"}