{"interestingcomments": [{"Unnamed: 0": 379559, "autor": "Guest Walt", "date": 1184368860000, "content": "In reply to Sean and others, if I had to choose between the M8 and GRD, I'd choose the M8 too, largely because of the more robust files and the changable lenses. And I agree with Sean that the sensor size makes these in some way different kinds of cameras. But there is also a lot of overlap of use and function, and in that overlap the Leica fares rather poorly. My real point is that Leica could have learned so much from the GRD and still had an M8 with the capabilities that are different from those of the GRD. And so to Gareth's question about what's \"clunky\" on the M8, which is to the point of what I think Leica could have learned from the GRD. Compare the following operations on the two cameras: shutter release, shot review, formating an SD card, exposure compensation, ISO change, physical controls, etc. (And all the \"bugs\" in the Leica, which the GRD seems completely free off.) The Leica looks very sluggish, awkward and buggy by comparison. I am leaving out the issues that are intrinsic to camera types: shutter noise level, auto focus, multiple metering patterns (or just a thoughtful pattern for the M8), etc. The point is that the M8 is a good and useful camera, but is totally lacking the originality and brilliance of the GRD. One thing Sean could help me on: How do I get a 28 mm (37 FOV) lens with image quality like that on the GRD to fit the M8? I'll bet you know the answer. I'm not as tactful as you are and I find the new 28/2.8 ASPH pretty awful (and the 28/2.0 better but too heavy). Walt P.S. Oh, and on the question about how the GRD is a \"rangefinder\" experience, this camera at maximum aperture (F2.4) and hyperfocal distance (selectable with two fast wheel spins) has DOF of something like four feet to infinity. Thus using an auxilliary finder (I am using the Voigtlander 28mm) is very much a rangefinder-like experience. Where focusing has to be more accurate, the spot autofocus is excellent and the Voigtlander finder can be used without removing the eye from it.", "link": "https://www.l-camera-forum.com/topic/28906-leica-m8-and-ricoh-gr-d/?tab=comments#comment-305320", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "in reply to sean and others, if i had to choose between the m8 and grd, i'd choose the m8 too, largely because of the more robust files and the changable lenses. and i agree with sean that the sensor size makes these in some way different kinds of cameras. but there is also a lot of overlap of use and function, and in that overlap the leica fares rather poorly. my real point is that leica could have learned so much from the grd and still had an m8 with the capabilities that are different from those of the grd. and so to gareth's question about what's \"clunky\" on the m8, which is to the point of what i think leica could have learned from the grd. compare the following operations on the two cameras: shutter release, shot review, formating an sd card, exposure compensation, iso change, physical controls, etc. (and all the \"bugs\" in the leica, which the grd seems completely free off.) the leica looks very sluggish, awkward and buggy by comparison. i am leaving out the issues that are intrinsic to camera types: shutter noise level, auto focus, multiple metering patterns (or just a thoughtful pattern for the m8), etc. the point is that the m8 is a good and useful camera, but is totally lacking the originality and brilliance of the grd. one thing sean could help me on: how do i get a 28 mm (37 fov) lens with image quality like that on the grd to fit the m8? i'll bet you know the answer. i'm not as tactful as you are and i find the new 28/2.8 asph pretty awful (and the 28/2.0 better but too heavy). walt p.s. oh, and on the question about how the grd is a \"rangefinder\" experience, this camera at maximum aperture (f2.4) and hyperfocal distance (selectable with two fast wheel spins) has dof of something like four feet to infinity. thus using an auxilliary finder (i am using the voigtlander 28mm) is very much a rangefinder-like experience. where focusing has to be more accurate, the -----> spot !!!  autofocus is excellent and the voigtlander finder can be used without removing the eye from it.", "sortedWord": "None", "identifyer": 40947, "year": "2007"}, {"Unnamed: 0": 379587, "autor": "SimonW", "date": 1184443920000, "content": " I have both a GRD and I have recently trialled an M8. I have just bought a 28 2,8 and should pick up a body next week. Firstly, I think that the GRD is outstanding as a travel camera and capable of some fantastic results. The Lens is exceptional and the AF and Metering excellent. However, a comparison of files shows dramatically different qualities in terms of detail and tone. The GR produces files which are sharp, but the colour is not as accurate, it blows highlights very easily and it suffers from the usual 'digital' flatness. The small add on viewfinder does help, but is not great. The GR produces files that will hold their own with anything up to 4/3 format. The M8 metering is amazingly good when you understand that it is not a multi matrix setup and use it more as a spot metering. The m8 files have more depth and shadow detail on them than any other digital files I have seen (although the 5D is pretty good). The m8 viewfinder is a joy to use and manual focusing with it seems to get more hits than my Eos 30D. Mostly, it is so simple to use. Chose your apperture, focus, shoot. I was using my Eos recently and suddenly couldn't work out which metering mode I was in and wondering why the white balance had gone awol and the focus hunting....... DSLR's offer way too many functions. My GRD is the best camera I have bought under £1000 and is a stayer, but it does not match a M8 except in better portability.", "link": "https://www.l-camera-forum.com/topic/28906-leica-m8-and-ricoh-gr-d/page/3/?tab=comments#comment-305905", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " i have both a grd and i have recently trialled an m8. i have just bought a 28 2,8 and should pick up a body next week. firstly, i think that the grd is outstanding as a travel camera and capable of some fantastic results. the lens is exceptional and the af and metering excellent. however, a comparison of files shows dramatically different qualities in terms of detail and tone. the gr produces files which are sharp, but the colour is not as accurate, it blows highlights very easily and it suffers from the usual 'digital' flatness. the small add on viewfinder does help, but is not great. the gr produces files that will hold their own with anything up to 4/3 format. the m8 metering is amazingly good when you understand that it is not a multi matrix setup and use it more as a -----> spot !!!  metering. the m8 files have more depth and shadow detail on them than any other digital files i have seen (although the 5d is pretty good). the m8 viewfinder is a joy to use and manual focusing with it seems to get more hits than my eos 30d. mostly, it is so simple to use. chose your apperture, focus, shoot. i was using my eos recently and suddenly couldn't work out which metering mode i was in and wondering why the white balance had gone awol and the focus hunting....... dslr's offer way too many functions. my grd is the best camera i have bought under £1000 and is a stayer, but it does not match a m8 except in better portability.", "sortedWord": "None", "identifyer": 40975, "year": "2007"}, {"Unnamed: 0": 380446, "autor": "Guest guy_mancuso", "date": 1191763620000, "content": "Guy, you've got somewhat more mileage on your machines than I have on mine; have you noticed any fall-off in splodges on the sensor? Implicit in my question is the assumption that shutter lubricant is the source, which of course may not be correct. If that is the case, do we have to wait for the shutter to seize for lack of lubrication for the splodges to go away? Sorry, rhetorical question. I don't think lubricant will ever dry up per say and what new owners are seeing is maybe some excess lubricant flying around. For me that has settled down and mostly dust now but i get a occasional grease spot but pollen and air quality will also have a effect on a dirty sensor. Were never going to get away with not cleaning it on occasion", "link": "https://www.l-camera-forum.com/topic/34953-determining-shutter-actuations-on-an-m8/page/2/?tab=comments#comment-371456", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "guy, you've got somewhat more mileage on your machines than i have on mine; have you noticed any fall-off in splodges on the sensor? implicit in my question is the assumption that shutter lubricant is the source, which of course may not be correct. if that is the case, do we have to wait for the shutter to seize for lack of lubrication for the splodges to go away? sorry, rhetorical question. i don't think lubricant will ever dry up per say and what new owners are seeing is maybe some excess lubricant flying around. for me that has settled down and mostly dust now but i get a occasional grease -----> spot !!!  but pollen and air quality will also have a effect on a dirty sensor. were never going to get away with not cleaning it on occasion", "sortedWord": "None", "identifyer": 41834, "year": "2007"}, {"Unnamed: 0": 383879, "autor": "marknorton", "date": 1176161280000, "content": "With the shutter removed, there’s not much left, especially once the shutter/motor wind controller is also removed. --img--  There is an additional circuit board, connected to the three sensors at the bottom of the lens throat and held in place by the aluminium bar. From there, a folded circuit board and a flex print to the M16C board and the “blue spot” sensor. This circuit then is the light metering circuit – the ambient sensor, the main light meter and the twin flash metering cells. Here’s a picture of the circuit board: --img--  The final surprises come when you remove the battery case. The front of the battery case and the lens throat are a single plastic moulding and underneath the battery case is the circuit for the lens coding detector. --img--  In this picture, the lens code sensor connects bottom right and there are six (black) transistors, presumably to amplify the signals from the photodiodes in the sensor. There is also a pair of tiny toggle switches which are activated by the frame selection lever. Clearly, repairing this part of the camera if it should fail is complex, involving as it does almost complete dismantling of the camera. --img--  In this case, the upper switch is activated. When the lever is in the centre position, neither switch is activated. In the lower position, the lower switch is activated. These switches are used to determine the selected focal length when the Normal Tri-Elmar is mounted on the camera. That’s it. I hope you’ve enjoyed this tour of the Anatomy of the Leica M8.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/?tab=comments#comment-224275", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "with the shutter removed, there’s not much left, especially once the shutter/motor wind controller is also removed. --img--  there is an additional circuit board, connected to the three sensors at the bottom of the lens throat and held in place by the aluminium bar. from there, a folded circuit board and a flex print to the m16c board and the “blue -----> spot !!! ” sensor. this circuit then is the light metering circuit – the ambient sensor, the main light meter and the twin flash metering cells. here’s a picture of the circuit board: --img--  the final surprises come when you remove the battery case. the front of the battery case and the lens throat are a single plastic moulding and underneath the battery case is the circuit for the lens coding detector. --img--  in this picture, the lens code sensor connects bottom right and there are six (black) transistors, presumably to amplify the signals from the photodiodes in the sensor. there is also a pair of tiny toggle switches which are activated by the frame selection lever. clearly, repairing this part of the camera if it should fail is complex, involving as it does almost complete dismantling of the camera. --img--  in this case, the upper switch is activated. when the lever is in the centre position, neither switch is activated. in the lower position, the lower switch is activated. these switches are used to determine the selected focal length when the normal tri-elmar is mounted on the camera. that’s it. i hope you’ve enjoyed this tour of the anatomy of the leica m8.", "sortedWord": "None", "identifyer": 45281, "year": "2007"}, {"Unnamed: 0": 384735, "autor": "Guest guy_mancuso", "date": 1196022180000, "content": "Just walked in the door but Scot you hit the nail on the head. They do look to have more saturation but at the same time seem to give a little more DR and diffuses out the specular highlights a touch more. Now color , contrast and saturation seem to be dead even among the Summairts they all have the same look to them. I have a lot of processing to do this week and posting , plus i just shot a bunch of casual shots early in the morning the last few days and they really do pop off the screen in terms of color, contrast and saturation plus there bloody sharp to boot. Frankly when you hit 5.6 with any of them there all pretty darn equal in many ways. The lenses get shipped back tomorrow but I think i have enough material here to see what they can do. The MTF charts and some of that stuff does not interest me to much but seeing how they can render a image does. So hopefully you are seeing what they are made of. Honestly my bet is anyone buying one will be pretty darn happy with it. But i don't see folks like me with a 50 lux and 90 cron selling them for these either. i see these as more a less expensive way to get into Leica glass if you can handle the slower speed of them and also more important fill gaps in the lineup for folks and travel. I may just get the 75mm even though I did not try it but it will fill the 75 lux spot on travel tha one is a big swing in weight. I will have the sharpness test up Monday for everyone and post that test on both sites as well. Hopefully folks will just get a nice picture of what they are and with Seans tests and impressions fills in that puzzle we always talk about. Never go by one test but several and folks impressions and that gives you a good idea what you are getting. But for the money it is a thumbs up so far", "link": "https://www.l-camera-forum.com/topic/38334-summarit-series-355090-ugly-test/page/4/?tab=comments#comment-411417", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "just walked in the door but scot you hit the nail on the head. they do look to have more saturation but at the same time seem to give a little more dr and diffuses out the specular highlights a touch more. now color , contrast and saturation seem to be dead even among the summairts they all have the same look to them. i have a lot of processing to do this week and posting , plus i just shot a bunch of casual shots early in the morning the last few days and they really do pop off the screen in terms of color, contrast and saturation plus there bloody sharp to boot. frankly when you hit 5.6 with any of them there all pretty darn equal in many ways. the lenses get shipped back tomorrow but i think i have enough material here to see what they can do. the mtf charts and some of that stuff does not interest me to much but seeing how they can render a image does. so hopefully you are seeing what they are made of. honestly my bet is anyone buying one will be pretty darn happy with it. but i don't see folks like me with a 50 lux and 90 cron selling them for these either. i see these as more a less expensive way to get into leica glass if you can handle the slower speed of them and also more important fill gaps in the lineup for folks and travel. i may just get the 75mm even though i did not try it but it will fill the 75 lux -----> spot !!!  on travel tha one is a big swing in weight. i will have the sharpness test up monday for everyone and post that test on both sites as well. hopefully folks will just get a nice picture of what they are and with seans tests and impressions fills in that puzzle we always talk about. never go by one test but several and folks impressions and that gives you a good idea what you are getting. but for the money it is a thumbs up so far", "sortedWord": "None", "identifyer": 46139, "year": "2007"}], "name": "spotL-Forum2007"}