{"interestingcomments": [{"Unnamed: 0": 374204, "autor": "marcusperkins", "date": 1254242880000, "content": "It is possible that just my copy or maybe just some suffer from focus shift. If I cant get consistent focus with a lens than it leads to worse images. Thats how I see it. Some things might be discussed on a very theoretical base, but precise focus is something which has a lot of influence on the result/the image. To talk with your words: if I get consistently better results with one golf club compared to another one than I just use the one I get the better results with. If I get good results with 4 golf clubs but only here and then with the fifth I assume it´s the club and not my game. Again, if you and others get good reliable results with the Noctilux on a digital M without any focus shift- great, I tried for about 1 year (including sending the lens to Solms) and finally gave up. Regards, Tom Tom, there is nothing wrong with your lens. All Noctilux 1's have focus shift when stopping down - it's just the way they are. However this is not necessarily noticeable to all when photographing three dimensional objects. In addition, you (or your subject) only have to breath in order to subtly change the focus, so it is unlikely you will nail it each time - depending of course on your level perfectionism. For the record, I found the rangefinder on both my MP and M8 to be very reliable and consistent, but I still regularly missed focus (from a perfectionist point of view). One way to get around the focus shift when stopping down is to focus, then adjust the focus ring a couple mm. Very easy to get a feel for it, and very reliable. If you want to check the true focus accuracy of your Noct 1 and camera, you have to mount it onto a tripod, and shoot an equally static subject. Testing focus by hand will undoubtably introduce small errors as you unconsciously wobble and sway around. The picture linked below is actually a little out of focus (in front by about 4-5cm). Most frames were spot on, but I liked that particular image and used it. Looked good in print too. Marcus Perkins Portfolio - Corporate Photographer and Documentary Photographer. Michelle Howard This one however was spot on: http://www.marcusperkins.co.uk/portfolio_pages/recent_work/recent_work_04.html Both pictures on the Noct 1 at F1 Edited September 29, 2009 by marcusperkins", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/3/?tab=comments#comment-1054740", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "it is possible that just my copy or maybe just some suffer from focus shift. if i cant get consistent focus with a lens than it leads to worse images. thats how i see it. some things might be discussed on a very theoretical base, but precise focus is something which has a lot of influence on the result/the image. to talk with your words: if i get consistently better results with one golf club compared to another one than i just use the one i get the better results with. if i get good results with 4 golf clubs but only here and then with the fifth i assume it´s the club and not my game. again, if you and others get good reliable results with the noctilux on a digital m without any focus shift- great, i tried for about 1 year (including sending the lens to solms) and finally gave up. regards, tom tom, there is nothing wrong with your lens. all noctilux 1's have focus shift when stopping down - it's just the way they are. however this is not necessarily noticeable to all when photographing three dimensional objects. in addition, you (or your subject) only have to breath in order to subtly change the focus, so it is unlikely you will nail it each time - depending of course on your level perfectionism. for the record, i found the rangefinder on both my mp and m8 to be very reliable and consistent, but i still regularly missed focus (from a perfectionist point of view). one way to get around the focus shift when stopping down is to focus, then adjust the focus ring a couple mm. very easy to get a feel for it, and very reliable. if you want to check the true focus accuracy of your noct 1 and camera, you have to mount it onto a tripod, and shoot an equally static subject. testing focus by hand will undoubtably introduce small errors as you unconsciously wobble and sway around. the picture linked below is actually a little out of focus (in front by about 4-5cm). most frames were -----> spot !!!  on, but i liked that particular image and used it. looked good in print too. marcus perkins portfolio - corporate photographer and documentary photographer. michelle howard this one however was spot on: http://www.marcusperkins.co.uk/portfolio_pages/recent_work/recent_work_04.html both pictures on the noct 1 at f1 edited september 29, 2009 by marcusperkins", "sortedWord": "None", "identifyer": 35510, "year": "2009"}, {"Unnamed: 0": 374205, "autor": "tom0511", "date": 1254245940000, "content": " Tom, there is nothing wrong with your lens. All Noctilux 1's have focus shift when stopping down - it's just the way they are. However this is not necessarily noticeable to all when photographing three dimensional objects. In addition, you (or your subject) only have to breath in order to subtly change the focus, so it is unlikely you will nail it each time - depending of course on your level perfectionism. For the record, I found the rangefinder on both my MP and M8 to be very reliable and consistent, but I still regularly missed focus (from a perfectionist point of view). One way to get around the focus shift when stopping down is to focus, then adjust the focus ring a couple mm. Very easy to get a feel for it, and very reliable. If you want to check the true focus accuracy of your Noct 1 and camera, you have to mount it onto a tripod, and shoot an equally static subject. Testing focus by hand will undoubtably introduce small errors as you unconsciously wobble and sway around. The picture linked below is actually a little out of focus (in front by about 4-5cm). Most frames were spot on, but I liked that particular image and used it. Looked good in print too. Marcus Perkins Portfolio - Corporate Photographer and Documentary Photographer. Michelle Howard This one however was spot on: Marcus Perkins Portfolio - Corporate Photographer and Documentary Photographer. Lymphatic Filariasis Both pictures on the Noct 1 at F1 Hi Markus, thank you for your answer. adjusting the focus ring a little bit more when shooting wide open is a method I also saw as one potential solution. And it kind of worked ok. in the end I just felt that I prefered the 50lux asph- I felt more safe to get what I would expect and therefore sold my Noctilux. Again-I didnt want to bash the Noctilux or any other lens - I just mentioned my experience and if others have different experience and are happy with the lens thats all what counts. From my experience in the 35asph lux, the Nocti and the 75lux do suffer from some focus shift (at least my samples) and I feel I can see it in real life images and therefore prefer other lenses.", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/3/?tab=comments#comment-1054802", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " tom, there is nothing wrong with your lens. all noctilux 1's have focus shift when stopping down - it's just the way they are. however this is not necessarily noticeable to all when photographing three dimensional objects. in addition, you (or your subject) only have to breath in order to subtly change the focus, so it is unlikely you will nail it each time - depending of course on your level perfectionism. for the record, i found the rangefinder on both my mp and m8 to be very reliable and consistent, but i still regularly missed focus (from a perfectionist point of view). one way to get around the focus shift when stopping down is to focus, then adjust the focus ring a couple mm. very easy to get a feel for it, and very reliable. if you want to check the true focus accuracy of your noct 1 and camera, you have to mount it onto a tripod, and shoot an equally static subject. testing focus by hand will undoubtably introduce small errors as you unconsciously wobble and sway around. the picture linked below is actually a little out of focus (in front by about 4-5cm). most frames were -----> spot !!!  on, but i liked that particular image and used it. looked good in print too. marcus perkins portfolio - corporate photographer and documentary photographer. michelle howard this one however was spot on: marcus perkins portfolio - corporate photographer and documentary photographer. lymphatic filariasis both pictures on the noct 1 at f1 hi markus, thank you for your answer. adjusting the focus ring a little bit more when shooting wide open is a method i also saw as one potential solution. and it kind of worked ok. in the end i just felt that i prefered the 50lux asph- i felt more safe to get what i would expect and therefore sold my noctilux. again-i didnt want to bash the noctilux or any other lens - i just mentioned my experience and if others have different experience and are happy with the lens thats all what counts. from my experience in the 35asph lux, the nocti and the 75lux do suffer from some focus shift (at least my samples) and i feel i can see it in real life images and therefore prefer other lenses.", "sortedWord": "None", "identifyer": 35511, "year": "2009"}, {"Unnamed: 0": 374214, "autor": "glenerrolrd", "date": 1254303720000, "content": "Roger, thanks for the help and suggestion. When I focus my 50 at f1.4 I can nail the focus. This leads me to the conclusion that it is not about my eyes or focusing capabilities but about lenses. Shooting several images of the same portrait works - but IMO it is more like if you shoot 5 images one will be focused in a way that the focus-shift problem of the lens is compensated by random. I like to have 3 or 4 out of 5 in focus, and not 1 (eventually). It was not thre ruler-test in the first place, there were unsharp eyes in the first place. Some people may even think its user error. Couple things I learned from a lot of testing and practice: 1. The 50 1.4 asph has such excellent contrast that many times we are looking at a small amount of front and back focusing ....and the image still looks razor sharp. Printed the image can look perfect so from a practical standpoint it spot on. 2. A portrait can be a difficult test because ....with the right light the eyes can look brilliant and yet the focus can be off a little. To really know if you nailed something you need some texture or a scale . Shoot a newspaper at a 45 degree angle . Spot on means the exact letter in the word. Almost forgot....be sure to be at ISO 160 and not 640 or you may not find any letter sharp with a noctilux at its closest focusing point. 3. Not sure what the point of shooting a portrait at 1M at F1.0 might be other than a demonstration of skill. Most of the MF portrait photographers struggle to get enough depth of field to make the portrait attractive. I find the f1.0 much more useful at 3-10M where I can still use it to isolate the subject from the background while rendering most of the face in focus. 4. The logic behind the short burst ..2-3 is that things change. The subject moves , the subject blinks , the photographer moves etc. If the subject is static you don t need bursts (and I am not speaking of continuous mode) but rather a thoughful series of captures. Only point is that this isn t for focus shift or photographer error as much as getting the moment.", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/3/?tab=comments#comment-1055634", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "roger, thanks for the help and suggestion. when i focus my 50 at f1.4 i can nail the focus. this leads me to the conclusion that it is not about my eyes or focusing capabilities but about lenses. shooting several images of the same portrait works - but imo it is more like if you shoot 5 images one will be focused in a way that the focus-shift problem of the lens is compensated by random. i like to have 3 or 4 out of 5 in focus, and not 1 (eventually). it was not thre ruler-test in the first place, there were unsharp eyes in the first place. some people may even think its user error. couple things i learned from a lot of testing and practice: 1. the 50 1.4 asph has such excellent contrast that many times we are looking at a small amount of front and back focusing ....and the image still looks razor sharp. printed the image can look perfect so from a practical standpoint it -----> spot !!!  on. 2. a portrait can be a difficult test because ....with the right light the eyes can look brilliant and yet the focus can be off a little. to really know if you nailed something you need some texture or a scale . shoot a newspaper at a 45 degree angle . spot on means the exact letter in the word. almost forgot....be sure to be at iso 160 and not 640 or you may not find any letter sharp with a noctilux at its closest focusing point. 3. not sure what the point of shooting a portrait at 1m at f1.0 might be other than a demonstration of skill. most of the mf portrait photographers struggle to get enough depth of field to make the portrait attractive. i find the f1.0 much more useful at 3-10m where i can still use it to isolate the subject from the background while rendering most of the face in focus. 4. the logic behind the short burst ..2-3 is that things change. the subject moves , the subject blinks , the photographer moves etc. if the subject is static you don t need bursts (and i am not speaking of continuous mode) but rather a thoughful series of captures. only point is that this isn t for focus shift or photographer error as much as getting the moment.", "sortedWord": "None", "identifyer": 35520, "year": "2009"}, {"Unnamed: 0": 374216, "autor": "tom0511", "date": 1254312600000, "content": "Couple things I learned from a lot of testing and practice: 1. The 50 1.4 asph has such excellent contrast that many times we are looking at a small amount of front and back focusing ....and the image still looks razor sharp. Printed the image can look perfect so from a practical standpoint it spot on. 2. A portrait can be a difficult test because ....with the right light the eyes can look brilliant and yet the focus can be off a little. To really know if you nailed something you need some texture or a scale . Shoot a newspaper at a 45 degree angle . Spot on means the exact letter in the word. Almost forgot....be sure to be at ISO 160 and not 640 or you may not find any letter sharp with a noctilux at its closest focusing point. 3. Not sure what the point of shooting a portrait at 1M at F1.0 might be other than a demonstration of skill. Most of the MF portrait photographers struggle to get enough depth of field to make the portrait attractive. I find the f1.0 much more useful at 3-10M where I can still use it to isolate the subject from the background while rendering most of the face in focus. 4. The logic behind the short burst ..2-3 is that things change. The subject moves , the subject blinks , the photographer moves etc. If the subject is static you don t need bursts (and I am not speaking of continuous mode) but rather a thoughful series of captures. Only point is that this isn t for focus shift or photographer error as much as getting the moment. Hi Roger, 1: as far as I see the result/image as sharp I dont even care if it is due to contrast or not. 2: However if I feel there is a focus problem I shoot either a rule or prefer to shoot a coin on a carpet at several distances, and I would usually repeat it a couple of times since there are allways few shots which include user error. 3: I do use the M8/M9 a lot for family stuff and here I do use the 50mm focal length quite often at shorter distances. If I would shoot a protrait in the 3-10m distance and wanted shallow DOF I would probably rather use a longer focal length than 50mm. Here is a sample and I believe it even was with the Nocti at f1.0. IMO Shallow DOF can work for such images: --img--  Another sample of short distance wide open portrait (with a Zeiss 110/2.0 on Medium Format-which should have as shallow DOF) --img--  4: yes, I agree there are often movements of the subject or the photographer to lead to unsharp images/wrong focus plane and a burst helps. A lens without focus problems does however help to increase the chance to get some good images in one burst. Its clear to me that shooting shallow DOF does allways include the risk to not nail focus. Edited September 30, 2009 by tom0511", "link": "https://www.l-camera-forum.com/topic/98348-new-and-old-noctilux/page/3/?tab=comments#comment-1055822", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "couple things i learned from a lot of testing and practice: 1. the 50 1.4 asph has such excellent contrast that many times we are looking at a small amount of front and back focusing ....and the image still looks razor sharp. printed the image can look perfect so from a practical standpoint it -----> spot !!!  on. 2. a portrait can be a difficult test because ....with the right light the eyes can look brilliant and yet the focus can be off a little. to really know if you nailed something you need some texture or a scale . shoot a newspaper at a 45 degree angle . spot on means the exact letter in the word. almost forgot....be sure to be at iso 160 and not 640 or you may not find any letter sharp with a noctilux at its closest focusing point. 3. not sure what the point of shooting a portrait at 1m at f1.0 might be other than a demonstration of skill. most of the mf portrait photographers struggle to get enough depth of field to make the portrait attractive. i find the f1.0 much more useful at 3-10m where i can still use it to isolate the subject from the background while rendering most of the face in focus. 4. the logic behind the short burst ..2-3 is that things change. the subject moves , the subject blinks , the photographer moves etc. if the subject is static you don t need bursts (and i am not speaking of continuous mode) but rather a thoughful series of captures. only point is that this isn t for focus shift or photographer error as much as getting the moment. hi roger, 1: as far as i see the result/image as sharp i dont even care if it is due to contrast or not. 2: however if i feel there is a focus problem i shoot either a rule or prefer to shoot a coin on a carpet at several distances, and i would usually repeat it a couple of times since there are allways few shots which include user error. 3: i do use the m8/m9 a lot for family stuff and here i do use the 50mm focal length quite often at shorter distances. if i would shoot a protrait in the 3-10m distance and wanted shallow dof i would probably rather use a longer focal length than 50mm. here is a sample and i believe it even was with the nocti at f1.0. imo shallow dof can work for such images: --img--  another sample of short distance wide open portrait (with a zeiss 110/2.0 on medium format-which should have as shallow dof) --img--  4: yes, i agree there are often movements of the subject or the photographer to lead to unsharp images/wrong focus plane and a burst helps. a lens without focus problems does however help to increase the chance to get some good images in one burst. its clear to me that shooting shallow dof does allways include the risk to not nail focus. edited september 30, 2009 by tom0511", "sortedWord": "None", "identifyer": 35522, "year": "2009"}, {"Unnamed: 0": 379379, "autor": "haroldp", "date": 1260394260000, "content": "For me, the moral / digital equivalent of my old view camera's, particularly for landscapes (composition is always king, but detail for landscapes is crown prince ) are tiled and stitched images. When carefully shot using a 3d pano rig ( I use Really Right Stuff stuff ), rotating around the nodal point of the lens etc. Stitching can be flawless, and the look of a 150-200 megapixel image in a large print (20 X 60 or so) is amazing, and sharp corner to corner because the 'sweet spot' of the lens is used across the frame. While folks had occasionally done this with film, it is infinitely easier with digital images, and using this technique along with properly matching focal length's, you 'sensor' can be as large as you want. Of course this only works with subjects that are not moving (like mountains). These images have much more impact in print, than electronically displayed. Regards ... Harold", "link": "https://www.l-camera-forum.com/topic/93255-do-you-print-your-photographs/page/4/?tab=comments#comment-1145588", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "for me, the moral / digital equivalent of my old view camera's, particularly for landscapes (composition is always king, but detail for landscapes is crown prince ) are tiled and stitched images. when carefully shot using a 3d pano rig ( i use really right stuff stuff ), rotating around the nodal point of the lens etc. stitching can be flawless, and the look of a 150-200 megapixel image in a large print (20 x 60 or so) is amazing, and sharp corner to corner because the 'sweet -----> spot !!! ' of the lens is used across the frame. while folks had occasionally done this with film, it is infinitely easier with digital images, and using this technique along with properly matching focal length's, you 'sensor' can be as large as you want. of course this only works with subjects that are not moving (like mountains). these images have much more impact in print, than electronically displayed. regards ... harold", "sortedWord": "None", "identifyer": 40766, "year": "2009"}, {"Unnamed: 0": 382427, "autor": "rhow", "date": 1254594780000, "content": " I experimented with IR photography using my Elmarit 28/2.8 on the M8. I realized that this lens appears to cause a significant hot spot under IR conditions, especially with apertures 8 and up. --img--  Can you please share your experience with other lenses on the M8 when using for IR photography? Thanks! Ralph", "link": "https://www.l-camera-forum.com/topic/98926-lenses-for-infrared-photography-with-m8/?tab=comments#comment-1060387", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": " i experimented with ir photography using my elmarit 28/2.8 on the m8. i realized that this lens appears to cause a significant hot -----> spot !!!  under ir conditions, especially with apertures 8 and up. --img--  can you please share your experience with other lenses on the m8 when using for ir photography? thanks! ralph", "sortedWord": "None", "identifyer": 43826, "year": "2009"}, {"Unnamed: 0": 382429, "autor": "offshore", "date": 1254770760000, "content": "I experimented with IR photography using my Elmarit 28/2.8 on the M8. I realized that this lens appears to cause a significant hot spot under IR conditions, especially with apertures 8 and up. --img--  Can you please share your experience with other lenses on the M8 when using for IR photography? Thanks! Ralph ASPH or pre ASPH? I have no hotspots with my pre ASPH and Hoya IR72 filter.", "link": "https://www.l-camera-forum.com/topic/98926-lenses-for-infrared-photography-with-m8/?tab=comments#comment-1063157", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i experimented with ir photography using my elmarit 28/2.8 on the m8. i realized that this lens appears to cause a significant hot -----> spot !!!  under ir conditions, especially with apertures 8 and up. --img--  can you please share your experience with other lenses on the m8 when using for ir photography? thanks! ralph asph or pre asph? i have no hotspots with my pre asph and hoya ir72 filter.", "sortedWord": "None", "identifyer": 43828, "year": "2009"}, {"Unnamed: 0": 382771, "autor": "Etruscello", "date": 1261930440000, "content": "I eventually did find a Nokton 50mm f1.1 that did not back-focus wide open, but the M8 or M9 rangefinder must be critically calibrated, and focus shift remains a problem; nevertheless, this is a lens worth having. For indoor use, it is always sharp and contrasty wide-open, with beautiful bokeh. Outdoors, if you shoot at f5.6 or greater, focus shift is compensated for by depth-of-field. (F2.8 is the sweet spot, at which I would compare this lens favorably to the Leica Lux 50mm ASPH, but does need focus-braketing at this aperture.) Tom P.", "link": "https://www.l-camera-forum.com/topic/107823-nokton-50mm-f11-backfocus/?tab=comments#comment-1165148", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i eventually did find a nokton 50mm f1.1 that did not back-focus wide open, but the m8 or m9 rangefinder must be critically calibrated, and focus shift remains a problem; nevertheless, this is a lens worth having. for indoor use, it is always sharp and contrasty wide-open, with beautiful bokeh. outdoors, if you shoot at f5.6 or greater, focus shift is compensated for by depth-of-field. (f2.8 is the sweet -----> spot !!! , at which i would compare this lens favorably to the leica lux 50mm asph, but does need focus-braketing at this aperture.) tom p.", "sortedWord": "None", "identifyer": 44170, "year": "2009"}, {"Unnamed: 0": 382778, "autor": "D&A", "date": 1261937700000, "content": "Hi, I do think its important to rule out the camera body itself (no matter how remote that possiblility might be)... since many have learned that it only takes a very slight miscalibration of an M8/M8.2 etc to throw focusing off with certain very fast lenses (like the 50mm f1.1's, 50mm f1.0's etc).....while other slightly slower lenses or lenses of different optical designs might focus just fine on same body. If the body is slightly ofI say with shooting a lens wide open at f1.1, it will continue to be off even when stopping down somewhat, until depth of feild hopefully will be large enough to compensate. Since there are various distances (apparently three) that Leica calibrates these bodies (close, mid-distance and infinity)..it's possible for one distance to be slightly off and another to be greater or less...although the various cams do seem to interact or have an effect on one another. Hence the infinity adjustment can alter or effect close and mid range focusing accuracy...thats for certain. There was a recent post on another forum where a person was experiencing back focus with a 50mm f1.0 and I also believe his 50mm f1.4 Lux, yet all his other lenses are spot on with both his M8.2 and M9. Again this is not a likely senario but one to quickly rule out. Yes, Stephen is very good about exchanging for another sample, espcially if a particular body's focusing has been ruled out as a possible cause in the case of a lens mis-focusing. Dave (D&A) Edited December 27, 2009 by D&A", "link": "https://www.l-camera-forum.com/topic/107823-nokton-50mm-f11-backfocus/?tab=comments#comment-1165293", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "hi, i do think its important to rule out the camera body itself (no matter how remote that possiblility might be)... since many have learned that it only takes a very slight miscalibration of an m8/m8.2 etc to throw focusing off with certain very fast lenses (like the 50mm f1.1's, 50mm f1.0's etc).....while other slightly slower lenses or lenses of different optical designs might focus just fine on same body. if the body is slightly ofi say with shooting a lens wide open at f1.1, it will continue to be off even when stopping down somewhat, until depth of feild hopefully will be large enough to compensate. since there are various distances (apparently three) that leica calibrates these bodies (close, mid-distance and infinity)..it's possible for one distance to be slightly off and another to be greater or less...although the various cams do seem to interact or have an effect on one another. hence the infinity adjustment can alter or effect close and mid range focusing accuracy...thats for certain. there was a recent post on another forum where a person was experiencing back focus with a 50mm f1.0 and i also believe his 50mm f1.4 lux, yet all his other lenses are -----> spot !!!  on with both his m8.2 and m9. again this is not a likely senario but one to quickly rule out. yes, stephen is very good about exchanging for another sample, espcially if a particular body's focusing has been ruled out as a possible cause in the case of a lens mis-focusing. dave (d&a) edited december 27, 2009 by d&a", "sortedWord": "None", "identifyer": 44177, "year": "2009"}, {"Unnamed: 0": 382791, "autor": "brill64", "date": 1262074140000, "content": "I looked at a second hand mint nocti f1 which when all my lenses are spot on, it back focused quite a lot. I bought it anyway and adjusted my rangefinder myself until it was spot-on and perfect focus at f1. but then my 90 macro-elmar was completely off the ball park that i couldn't use it at all. it was so out of focus that i sent it to leica for checking. they sent it back saying \"focus was more accurate than most 90's\". all my other lenses were still focusing without a problem so i sent my m8.2 in for adjustment and now the nocti only ever-so-slightly back-focuses and the 90/4 works a treat. perhaps your rangefinder needs adjustment?", "link": "https://www.l-camera-forum.com/topic/107823-nokton-50mm-f11-backfocus/page/2/?tab=comments#comment-1166992", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i looked at a second hand mint nocti f1 which when all my lenses are -----> spot !!!  on, it back focused quite a lot. i bought it anyway and adjusted my rangefinder myself until it was spot-on and perfect focus at f1. but then my 90 macro-elmar was completely off the ball park that i couldn't use it at all. it was so out of focus that i sent it to leica for checking. they sent it back saying \"focus was more accurate than most 90's\". all my other lenses were still focusing without a problem so i sent my m8.2 in for adjustment and now the nocti only ever-so-slightly back-focuses and the 90/4 works a treat. perhaps your rangefinder needs adjustment?", "sortedWord": "None", "identifyer": 44190, "year": "2009"}, {"Unnamed: 0": 451973, "autor": "audidudi", "date": 1231798260000, "content": "Even though I gave in last week and bought a Panasonic G1 from Henry's in Canada for $599 plus shipping, I continue to be impressed by the performance of my D2 and can't imagine parting with it any time soon. This was shot last Friday evening at sunset ... pulled into my driveway after a long day, spotted this scene in my nextdoor neighbor's yard, pulled my D2 out of the messenger bag where it lives these days, and snapped off a single shot. --img-- ", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/15/?tab=comments#comment-776199", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spotted", "selectorShort": "spot", "MarkedSent": "even though i gave in last week and bought a panasonic g1 from henry's in canada for $599 plus shipping, i continue to be impressed by the performance of my d2 and can't imagine parting with it any time soon. this was shot last friday evening at sunset ... pulled into my driveway after a long day, -----> spotted !!!  this scene in my nextdoor neighbor's yard, pulled my d2 out of the messenger bag where it lives these days, and snapped off a single shot. --img-- ", "sortedWord": "None", "identifyer": 15520, "year": "2009"}, {"Unnamed: 0": 451990, "autor": "andrewsolomon", "date": 1240974360000, "content": "I also have a 5D which I like a great deal and use for serious fine art shooting. I also have a D7 which is a fun camera to have for carrying in my pocket. The D2; however, remains my favorite! For its focal length, it is fine for much shooting-like the M Series. I learned on the M3 and went forward from that. The outstanding benefits of the D2 are: 1. The Digital Viewfinder! What a gift! When I was shooting in Death Valley, I could not see the taken image on my 5d because of the ambient light. I now use a Hoodman to take care of the problem; but the the D2; it was no problem. It was wonderful! I made a 12-foot pamorama of the sand dunes which is a killer: tack sharp, wonderful tones. It is also ideal fopr those of us who are visuall challenged and have to wear glasses. Adjust the diopter and you are ready to go and shoot with ease! 2. The grid option in the viewfinder makes keeping verticals accurate and panoramas [for post-work in Photoshop] easy to do properely. 3. Bounce Flash. What an easy way to capture a moment of compromised light and have the results come out looking natural and with ease! 4. The fine-focus option to use when using manual focus. I use this a lot of the time when I want to be certain the focus is spot on...and it works every time. I have made tack-sharp 20x24 prints with no compromise. The only drawback is the shutter lag. When I was shooting professional tennis and tried the D2, only by knowing the game well and anticipating the next move was I able to get a shot with the \"motor\" drive. I tried for some time to send my successful sports images from the Houston Astros baseball and the Mens National Clay Court Tennis Championships to Roger Horn of Leica USA to show him that despite the comment made to me by a Leica representative that \"Leica is not for sports\" that with care the D2 could do very credible work-work wich I subsequently had published, I might add but there was little positive response. This was a shame because the D2 can do a great deal of things very well. So yes, I think the D2 is a wonderful camera to have even with its few limitations and I would recommend it to anyone who wants a good, general camera. BTW It can use the Canon Speedlight in its hot shoe for a greater range of flash coverage as well! Andy Solomon Houston, Tx --img-- --img--  Edited April 29, 2009 by andrewsolomon Add an image", "link": "https://www.l-camera-forum.com/topic/20016-do-digilux-2-photos-have-distinctive-look/page/16/?tab=comments#comment-884480", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "spot", "selectorShort": "spot", "MarkedSent": "i also have a 5d which i like a great deal and use for serious fine art shooting. i also have a d7 which is a fun camera to have for carrying in my pocket. the d2; however, remains my favorite! for its focal length, it is fine for much shooting-like the m series. i learned on the m3 and went forward from that. the outstanding benefits of the d2 are: 1. the digital viewfinder! what a gift! when i was shooting in death valley, i could not see the taken image on my 5d because of the ambient light. i now use a hoodman to take care of the problem; but the the d2; it was no problem. it was wonderful! i made a 12-foot pamorama of the sand dunes which is a killer: tack sharp, wonderful tones. it is also ideal fopr those of us who are visuall challenged and have to wear glasses. adjust the diopter and you are ready to go and shoot with ease! 2. the grid option in the viewfinder makes keeping verticals accurate and panoramas [for post-work in photoshop] easy to do properely. 3. bounce flash. what an easy way to capture a moment of compromised light and have the results come out looking natural and with ease! 4. the fine-focus option to use when using manual focus. i use this a lot of the time when i want to be certain the focus is -----> spot !!!  on...and it works every time. i have made tack-sharp 20x24 prints with no compromise. the only drawback is the shutter lag. when i was shooting professional tennis and tried the d2, only by knowing the game well and anticipating the next move was i able to get a shot with the \"motor\" drive. i tried for some time to send my successful sports images from the houston astros baseball and the mens national clay court tennis championships to roger horn of leica usa to show him that despite the comment made to me by a leica representative that \"leica is not for sports\" that with care the d2 could do very credible work-work wich i subsequently had published, i might add but there was little positive response. this was a shame because the d2 can do a great deal of things very well. so yes, i think the d2 is a wonderful camera to have even with its few limitations and i would recommend it to anyone who wants a good, general camera. btw it can use the canon speedlight in its hot shoe for a greater range of flash coverage as well! andy solomon houston, tx --img-- --img--  edited april 29, 2009 by andrewsolomon add an image", "sortedWord": "None", "identifyer": 15537, "year": "2009"}], "name": "spotL-Forum2009"}