{"interestingcomments": [{"Unnamed: 0": 416618, "autor": "hotshew", "date": 1574581620000, "content": " I was disappointed to see Leica dropped the GPS function from the SL2 upon first reading specs at announcement time. It seems this is the trend as most people now own GPS-equipped smart phones -- but I would still prefer a dedicated module because, in my experience, they tend to be more reliable. I assumed the Leica would follow the trend of providing GPS tagging via a phone app, which they do, but AFAICT, the Leica Fotos app must be opened and connected to the camera (via Wi-Fi) in order to tag images with GPS coordinates. For my purposes, this renders GPS tagging on the SL2 virtually useless. I would love for somebody to tell me I've got it wrong and that the SL2 can stay connected to my phone via Bluetooth LE, such that GPS tagging occurs whenever my phone is nearby. If not, I certainly hope that they implement this functionally in an upcoming firmware and Fotos release.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/?tab=comments#comment-3860775", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": " i was disappointed to see leica dropped the gps function from the sl2 upon first reading specs at announcement time. it seems this is the trend as most people now own gps-equipped smart phones -- but i would still prefer a dedicated module because, in my experience, they tend to be more reliable. i assumed the leica would follow the trend of providing gps -----> tagging !!!  via a phone app, which they do, but afaict, the leica fotos app must be opened and connected to the camera (via wi-fi) in order to tag images with gps coordinates. for my purposes, this renders gps tagging on the sl2 virtually useless. i would love for somebody to tell me i've got it wrong and that the sl2 can stay connected to my phone via bluetooth le, such that gps tagging occurs whenever my phone is nearby. if not, i certainly hope that they implement this functionally in an upcoming firmware and fotos release.", "sortedWord": "None", "identifyer": 29619, "year": "2019"}, {"Unnamed: 0": 416619, "autor": "scott kirkpatrick", "date": 1574586540000, "content": "1 hour ago, hotshew said: I would love for somebody to tell me I've got it wrong and that the SL2 can stay connected to my phone via Bluetooth LE, such that GPS tagging occurs whenever my phone is nearby. ~That's how it works. Time, date, time zone and GPS information is provided over BlueTooth. I'm basing this on the S1R firmware and will have to check when the SL2 reaches me, but how else would you do it?", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/?tab=comments#comment-3860833", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "1 hour ago, hotshew said: i would love for somebody to tell me i've got it wrong and that the sl2 can stay connected to my phone via bluetooth le, such that gps -----> tagging !!!  occurs whenever my phone is nearby. ~that's how it works. time, date, time zone and gps information is provided over bluetooth. i'm basing this on the s1r firmware and will have to check when the sl2 reaches me, but how else would you do it?", "sortedWord": "None", "identifyer": 29620, "year": "2019"}, {"Unnamed: 0": 416620, "autor": "hotshew", "date": 1574618700000, "content": "I believe then that you'll be surprised to discover that's not how it works with the SL2. I also own the S1R and other systems that utilize one's smartphone for getting GPS tags (and other info) via a persistent Bluetooth LE connection. However, as stated, this does not appear to be the case with the SL2. After posting, I read Jono Slack's SL2 review, where he writes: Quote At the time of writing I’m using beta versions of Leica Fotos, but the connection to the Leica SL2 is straightforward and works very well. It also seems to be well remembered, so that all you need to do is to turn on the camera and open Fotos on your phone and reconnection is effective and simple. The Low Power Bluetooth option for tagging images with GPS information is not yet ready, but having used it with both Fuji and Panasonic with success I’m sure it’ll work well with the Leica SL2 (but I’ll still miss the inbuilt GPS of the SL). So this appears to confirm what I'm seeing. Hopefully Leica updates soon. -Roland. Edit: I forgot to add that how else you would do it is via Wi-Fi, while the app is open and connected to the camera, which is how SL2 is doing it. And even then, you need to capture the image using the app. Edited November 24, 2019 by hotshew", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/?tab=comments#comment-3861190", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "i believe then that you'll be surprised to discover that's not how it works with the sl2. i also own the s1r and other systems that utilize one's smartphone for getting gps tags (and other info) via a persistent bluetooth le connection. however, as stated, this does not appear to be the case with the sl2. after posting, i read jono slack's sl2 review, where he writes: quote at the time of writing i’m using beta versions of leica fotos, but the connection to the leica sl2 is straightforward and works very well. it also seems to be well remembered, so that all you need to do is to turn on the camera and open fotos on your phone and reconnection is effective and simple. the low power bluetooth option for -----> tagging !!!  images with gps information is not yet ready, but having used it with both fuji and panasonic with success i’m sure it’ll work well with the leica sl2 (but i’ll still miss the inbuilt gps of the sl). so this appears to confirm what i'm seeing. hopefully leica updates soon. -roland. edit: i forgot to add that how else you would do it is via wi-fi, while the app is open and connected to the camera, which is how sl2 is doing it. and even then, you need to capture the image using the app. edited november 24, 2019 by hotshew", "sortedWord": "None", "identifyer": 29621, "year": "2019"}, {"Unnamed: 0": 416623, "autor": "hotshew", "date": 1574629020000, "content": "Quote How can you tell whether Fotos 2.0, as just released, is using BTLE or WiFi for the GPS updates? The only way to know for sure would be to confirm w/ Leica or to sniff via a protocol analyzer. Regardless of technical implementation, the resultant use case is that GPS tagging requires Fotos to be open and connected to the camera. Since you're an S1R user, you won't see the message notifying you Fotos is using location service in the background, similar to Lumix Sync (or Fuji Remote, Nikon SnapBridge, etc.) -- assuming you're an iPhone user. If Fotos is using Bluetooth for GPS tagging, then it's a technical implementation that has no end-user benefit over Wi-Fi if the connection does not persist after the Wi-Fi connection is lost. Here is what the manual says: Quote The GPS (global positioning system) allows the pinpointing of a receiver anywhere in the world. The GPS function is activated automatically when a connection to the Leica FOTOS app is active and if the GPS function is active on the mobile device. The camera will then continuously receive the current GPS data (latitude and longitude, elevation above sea level) and writes this information into the Exif data of the images. ▸ Activate the GPS function on the mobile device▸ Activate Leica FOTOS and connect to the camera • This function is available only as long as the camera is on line with the Leica FOTOS app. Opening the Fotos app requires a Wi-Fi connection to be established to the phone -- the process takes about 20 seconds, and the user needs to give permission to connect via a join prompt each time the app is opened. Once connected, there's a blue LED that flashes on the back of the camera to indicate it's connected. The blue color could suggest a Bluetooth connection, but again, a Wi-Fi connection is required for Fotos to function. After the camera goes to sleep or is turned off, the Wi-Fi connection is lost and the user must re-establish a connection using the same process as before. This is fine for remote control scenarios, but as initially indicated, it renders GPS tagging virtually useless for my purposes. I stand corrected regarding one comment I made above. I read elsewhere that GPS tagging requires the image to be captured using the Fotos app. However, I decided to check for myself and discovered that GPS tagging works provided Fotos is connected to the camera (i.e., can press the shutter button on the camera to capture and tagging works). I haven't tested extensively but presume that tagging works when the blue LED is flashing.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/?tab=comments#comment-3861325", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "quote how can you tell whether fotos 2.0, as just released, is using btle or wifi for the gps updates? the only way to know for sure would be to confirm w/ leica or to sniff via a protocol analyzer. regardless of technical implementation, the resultant use case is that gps -----> tagging !!!  requires fotos to be open and connected to the camera. since you're an s1r user, you won't see the message notifying you fotos is using location service in the background, similar to lumix sync (or fuji remote, nikon snapbridge, etc.) -- assuming you're an iphone user. if fotos is using bluetooth for gps tagging, then it's a technical implementation that has no end-user benefit over wi-fi if the connection does not persist after the wi-fi connection is lost. here is what the manual says: quote the gps (global positioning system) allows the pinpointing of a receiver anywhere in the world. the gps function is activated automatically when a connection to the leica fotos app is active and if the gps function is active on the mobile device. the camera will then continuously receive the current gps data (latitude and longitude, elevation above sea level) and writes this information into the exif data of the images. ▸ activate the gps function on the mobile device▸ activate leica fotos and connect to the camera • this function is available only as long as the camera is on line with the leica fotos app. opening the fotos app requires a wi-fi connection to be established to the phone -- the process takes about 20 seconds, and the user needs to give permission to connect via a join prompt each time the app is opened. once connected, there's a blue led that flashes on the back of the camera to indicate it's connected. the blue color could suggest a bluetooth connection, but again, a wi-fi connection is required for fotos to function. after the camera goes to sleep or is turned off, the wi-fi connection is lost and the user must re-establish a connection using the same process as before. this is fine for remote control scenarios, but as initially indicated, it renders gps tagging virtually useless for my purposes. i stand corrected regarding one comment i made above. i read elsewhere that gps tagging requires the image to be captured using the fotos app. however, i decided to check for myself and discovered that gps tagging works provided fotos is connected to the camera (i.e., can press the shutter button on the camera to capture and tagging works). i haven't tested extensively but presume that tagging works when the blue led is flashing.", "sortedWord": "None", "identifyer": 29624, "year": "2019"}, {"Unnamed: 0": 416625, "autor": "BCMielke", "date": 1574631480000, "content": "39 minutes ago, hotshew said: The only way to know for sure would be to confirm w/ Leica or to sniff via a protocol analyzer. Regardless of technical implementation, the resultant use case is that GPS tagging requires Fotos to be open and connected to the camera. Since you're an S1R user, you won't see the message notifying you Fotos is using location service in the background, similar to Lumix Sync (or Fuji Remote, Nikon SnapBridge, etc.) -- assuming you're an iPhone user. If Fotos is using Bluetooth for GPS tagging, then it's a technical implementation that has no end-user benefit over Wi-Fi if the connection does not persist after the Wi-Fi connection is lost. Here is what the manual says: Opening the Fotos app requires a Wi-Fi connection to be established to the phone -- the process takes about 20 seconds, and the user needs to give permission to connect via a join prompt each time the app is opened. Once connected, there's a blue LED that flashes on the back of the camera to indicate it's connected. The blue color could suggest a Bluetooth connection, but again, a Wi-Fi connection is required for Fotos to function. After the camera goes to sleep or is turned off, the Wi-Fi connection is lost and the user must re-establish a connection using the same process as before. This is fine for remote control scenarios, but as initially indicated, it renders GPS tagging virtually useless for my purposes. I stand corrected regarding one comment I made above. I read elsewhere that GPS tagging requires the image to be captured using the Fotos app. However, I decided to check for myself and discovered that GPS tagging works provided Fotos is connected to the camera (i.e., can press the shutter button on the camera to capture and tagging works). I haven't tested extensively but presume that tagging works when the blue LED is flashing. I can confirm that it works this way as well. I was using my Q2, but from my understanding it should be the same. However, with it connected to the app you are not able to have access to the menus. I did some googling and didn't see much information on the Fotos app that says otherwise. If this is the GPS functionality it is very limited.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/?tab=comments#comment-3861353", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "39 minutes ago, hotshew said: the only way to know for sure would be to confirm w/ leica or to sniff via a protocol analyzer. regardless of technical implementation, the resultant use case is that gps -----> tagging !!!  requires fotos to be open and connected to the camera. since you're an s1r user, you won't see the message notifying you fotos is using location service in the background, similar to lumix sync (or fuji remote, nikon snapbridge, etc.) -- assuming you're an iphone user. if fotos is using bluetooth for gps tagging, then it's a technical implementation that has no end-user benefit over wi-fi if the connection does not persist after the wi-fi connection is lost. here is what the manual says: opening the fotos app requires a wi-fi connection to be established to the phone -- the process takes about 20 seconds, and the user needs to give permission to connect via a join prompt each time the app is opened. once connected, there's a blue led that flashes on the back of the camera to indicate it's connected. the blue color could suggest a bluetooth connection, but again, a wi-fi connection is required for fotos to function. after the camera goes to sleep or is turned off, the wi-fi connection is lost and the user must re-establish a connection using the same process as before. this is fine for remote control scenarios, but as initially indicated, it renders gps tagging virtually useless for my purposes. i stand corrected regarding one comment i made above. i read elsewhere that gps tagging requires the image to be captured using the fotos app. however, i decided to check for myself and discovered that gps tagging works provided fotos is connected to the camera (i.e., can press the shutter button on the camera to capture and tagging works). i haven't tested extensively but presume that tagging works when the blue led is flashing. i can confirm that it works this way as well. i was using my q2, but from my understanding it should be the same. however, with it connected to the app you are not able to have access to the menus. i did some googling and didn't see much information on the fotos app that says otherwise. if this is the gps functionality it is very limited.", "sortedWord": "None", "identifyer": 29626, "year": "2019"}, {"Unnamed: 0": 416627, "autor": "hotshew", "date": 1574640060000, "content": "I tried it out and here's what I'm seeing. If the user is interactive with Fotos (i.e., it stays open and in the foreground), then the connection to the camera persists and can continue to use the camera remotely. But after setting my phone down, the SL2 displays a connection lost error after about 2 to 3 minutes. I've also found reconnecting to the phone to be error prone (it took three attempts following re-connection errors on last try). YMMV, as this is based on my limited time with the camera. Unless Leica implements some changes, I'm going to resign myself to the SL2 being a GPS-less camera as nicci78 indicated. For GPS to be of value to me it needs to be on all the time and reliable, else I will find another solution for when I want GPS tagging (such as when traveling). Needing to stop, startup Fotos on my phone, and wait 20 seconds every time I want to capture an image isn't practical IMO. As indicated earlier, in general, I've found phone tethering solutions to be unreliable for geotagging (and maintaining connectivity in general). I was really happy to learn the SL had an integrated GPS module when I was first introduced to it, hoped the SL2 would carry it forward. Oh well. I'm super happy with the camera and have no regrets. I will keep my fingers crossed that Leica gives us updates that addresses this relatively minor shortcoming.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/?tab=comments#comment-3861432", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "i tried it out and here's what i'm seeing. if the user is interactive with fotos (i.e., it stays open and in the foreground), then the connection to the camera persists and can continue to use the camera remotely. but after setting my phone down, the sl2 displays a connection lost error after about 2 to 3 minutes. i've also found reconnecting to the phone to be error prone (it took three attempts following re-connection errors on last try). ymmv, as this is based on my limited time with the camera. unless leica implements some changes, i'm going to resign myself to the sl2 being a gps-less camera as nicci78 indicated. for gps to be of value to me it needs to be on all the time and reliable, else i will find another solution for when i want gps -----> tagging !!!  (such as when traveling). needing to stop, startup fotos on my phone, and wait 20 seconds every time i want to capture an image isn't practical imo. as indicated earlier, in general, i've found phone tethering solutions to be unreliable for geotagging (and maintaining connectivity in general). i was really happy to learn the sl had an integrated gps module when i was first introduced to it, hoped the sl2 would carry it forward. oh well. i'm super happy with the camera and have no regrets. i will keep my fingers crossed that leica gives us updates that addresses this relatively minor shortcoming.", "sortedWord": "None", "identifyer": 29628, "year": "2019"}, {"Unnamed: 0": 441817, "autor": "Leica Guy", "date": 1564277940000, "content": "It’s the FOTOS App. The last I read geo tagging will be part of an upcoming firmware update for the App.", "link": "https://www.l-camera-forum.com/topic/299680-geotagging-for-leica-q2/?tab=comments#comment-3786273", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "it’s the fotos app. the last i read geo -----> tagging !!!  will be part of an upcoming firmware update for the app.", "sortedWord": "None", "identifyer": 5166, "year": "2019"}, {"Unnamed: 0": 441818, "autor": "Jared", "date": 1564412460000, "content": "The current firmware in the Q2 allows Geotagging if and only if the shutter is released hub Fotos. Just having the satellite icon running won’t work. You need to actually use Fotos to take the picture. Hopefully, this will change with a future firmware release. The current functionality is darn near useless. Lots of other companies support tagging via an active Bluetooth connection to your cell phone, but so far not the case w/ Leica and the Q2. Perhaps in a few months or a year. Best bet as a substitute right now... Take a pic w/ your cell phone as well, then cut and paste to a batch of Q2 photos.", "link": "https://www.l-camera-forum.com/topic/299680-geotagging-for-leica-q2/?tab=comments#comment-3787239", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "the current firmware in the q2 allows geotagging if and only if the shutter is released hub fotos. just having the satellite icon running won’t work. you need to actually use fotos to take the picture. hopefully, this will change with a future firmware release. the current functionality is darn near useless. lots of other companies support -----> tagging !!!  via an active bluetooth connection to your cell phone, but so far not the case w/ leica and the q2. perhaps in a few months or a year. best bet as a substitute right now... take a pic w/ your cell phone as well, then cut and paste to a batch of q2 photos.", "sortedWord": "None", "identifyer": 5167, "year": "2019"}, {"Unnamed: 0": 452438, "autor": "drgek", "date": 1549580760000, "content": "On 2/6/2019 at 11:59 AM, Langballe said: Got my first Leica ever yesterday and I have the same issue as described here. The FOTOS app on my phone finds the camera over Bluetooth and they start pairing, but then the camera display for 1/2 a second says \"Connecting to WiFi\" and then \"Pairing failed\". Have no idea why it would look for Wi-Fi when I'm setting things up through Bluetooth. Have anyone experienced anything like it? It requires a WiFi connection to establish the Bluetooth pairing. At least on an iPhone, make sure you navigate back to the Fotos app while it says connecting to WiFi. The pairing should succeed. HOWEVER, this worthless update, while now allowing you to pair via Bluetooth, still does not support location tagging. After a couple of hours of assuming I must be doing something wrong, I emailed Leica for support who confirmed location tagging will not work at that an update should be expected in the \"near future.\" Absurd.", "link": "https://www.l-camera-forum.com/topic/291847-d-lux-7-bluetooth-connection/?tab=comments#comment-3680308", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": "on 2/6/2019 at 11:59 am, langballe said: got my first leica ever yesterday and i have the same issue as described here. the fotos app on my phone finds the camera over bluetooth and they start pairing, but then the camera display for 1/2 a second says \"connecting to wifi\" and then \"pairing failed\". have no idea why it would look for wi-fi when i'm setting things up through bluetooth. have anyone experienced anything like it? it requires a wifi connection to establish the bluetooth pairing. at least on an iphone, make sure you navigate back to the fotos app while it says connecting to wifi. the pairing should succeed. however, this worthless update, while now allowing you to pair via bluetooth, still does not support location -----> tagging !!! . after a couple of hours of assuming i must be doing something wrong, i emailed leica for support who confirmed location tagging will not work at that an update should be expected in the \"near future.\" absurd.", "sortedWord": "None", "identifyer": 16040, "year": "2019"}, {"Unnamed: 0": 452439, "autor": "Langballe", "date": 1549632780000, "content": " 14 hours ago, drgek said: It requires a WiFi connection to establish the Bluetooth pairing. At least on an iPhone, make sure you navigate back to the Fotos app while it says connecting to WiFi. The pairing should succeed. HOWEVER, this worthless update, while now allowing you to pair via Bluetooth, still does not support location tagging. After a couple of hours of assuming I must be doing something wrong, I emailed Leica for support who confirmed location tagging will not work at that an update should be expected in the \"near future.\" Absurd. Thanks @drgek. I'll give to a go. And agree - absurd that a brand like Leica would release something so buggy and confusing.", "link": "https://www.l-camera-forum.com/topic/291847-d-lux-7-bluetooth-connection/?tab=comments#comment-3680551", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagging", "selectorShort": "tagging", "MarkedSent": " 14 hours ago, drgek said: it requires a wifi connection to establish the bluetooth pairing. at least on an iphone, make sure you navigate back to the fotos app while it says connecting to wifi. the pairing should succeed. however, this worthless update, while now allowing you to pair via bluetooth, still does not support location -----> tagging !!! . after a couple of hours of assuming i must be doing something wrong, i emailed leica for support who confirmed location tagging will not work at that an update should be expected in the \"near future.\" absurd. thanks @drgek. i'll give to a go. and agree - absurd that a brand like leica would release something so buggy and confusing.", "sortedWord": "None", "identifyer": 16041, "year": "2019"}], "name": "taggingL-Forum2019"}