{"interestingcomments": [{"Unnamed: 0": 369849, "autor": "jsjxyz", "date": 1271435460000, "content": "75 mm lux is classic, read LFI noctilux issue, it stated that 75 lux has similar design is the same like 50 noct 1.0. The character is almost the same. 1.4 is helping very much for indoor club shoot too --img--  Flickr: jsjxyz's stuff tagged with 75lux", "link": "https://www.l-camera-forum.com/topic/118408-advice-needed-on-75-mm-lens/?tab=comments#comment-1296144", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "75 mm lux is classic, read lfi noctilux issue, it stated that 75 lux has similar design is the same like 50 noct 1.0. the character is almost the same. 1.4 is helping very much for indoor club shoot too --img--  flickr: jsjxyz's stuff -----> tagged !!!  with 75lux", "sortedWord": "None", "identifyer": 31148, "year": "2010"}, {"Unnamed: 0": 379780, "autor": "oronet commander", "date": 1275989160000, "content": "I've got an Elmarit 28 pre-ASPH, the last but one iteration, and I consider it the best lens I've ever had considering sharpness, flare resistance, nice colors and good contrast. It's almost glued to my M8. You can see some examples here: Flickr: oronet.commander's stuff tagged with elmarit By the way, I just hate its sunshade...", "link": "https://www.l-camera-forum.com/topic/122841-leica-elmarit-28-or-zeiss-28-biogon/?tab=comments#comment-1346333", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "i've got an elmarit 28 pre-asph, the last but one iteration, and i consider it the best lens i've ever had considering sharpness, flare resistance, nice colors and good contrast. it's almost glued to my m8. you can see some examples here: flickr: oronet.commander's stuff -----> tagged !!!  with elmarit by the way, i just hate its sunshade...", "sortedWord": "None", "identifyer": 41168, "year": "2010"}, {"Unnamed: 0": 379783, "autor": "jim_buchanan", "date": 1276174920000, "content": "I've got an Elmarit 28 pre-ASPH, the last but one iteration, and I consider it the best lens I've ever had considering sharpness, flare resistance, nice colors and good contrast. It's almost glued to my M8. You can see some examples here: Flickr: oronet.commander's stuff tagged with elmarit By the way, I just hate its sunshade... Yes, I have this one, also. Absolutely great lens. In addition to the original hood, I have the 35Lux hood for M8 use. Its a little smaller. Have to sell the lens, though. I will be putting it on B&S.", "link": "https://www.l-camera-forum.com/topic/122841-leica-elmarit-28-or-zeiss-28-biogon/?tab=comments#comment-1348458", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "i've got an elmarit 28 pre-asph, the last but one iteration, and i consider it the best lens i've ever had considering sharpness, flare resistance, nice colors and good contrast. it's almost glued to my m8. you can see some examples here: flickr: oronet.commander's stuff -----> tagged !!!  with elmarit by the way, i just hate its sunshade... yes, i have this one, also. absolutely great lens. in addition to the original hood, i have the 35lux hood for m8 use. its a little smaller. have to sell the lens, though. i will be putting it on b&s.", "sortedWord": "None", "identifyer": 41171, "year": "2010"}, {"Unnamed: 0": 380478, "autor": "cbretteville", "date": 1268304900000, "content": "My apologies if this is a little off-subject, but you have to be impressed at Leica's optimism regarding the maximum value allowed in the unique image id field. (A 128 bit number is pretty massive in my opinion.) --img--  Leica is only following the EXIF specification for this tag when they store the information in the files this way. Also, the number doesn't necessarily give you the correct number of actuation. It really is the unique image id for the camera. It has looked like it was the number of actuations since the introduction of the M8 as the number increments by one for each image captured. The same number is stored in a different format in the maker notes section which I really thought was the number of shutter actuations, but when my M8 came back after getting the shutter upgrade neither number was reset. So if the camera still has it's original shutter, it is an acurate indication of the number of actuations, if it has had a replacement fitted it isn't. Carl Edited March 11, 2010 by cbretteville", "link": "https://www.l-camera-forum.com/topic/34953-determining-shutter-actuations-on-an-m8/page/3/?tab=comments#comment-1255621", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "my apologies if this is a little off-subject, but you have to be impressed at leica's optimism regarding the maximum value allowed in the unique image id field. (a 128 bit number is pretty massive in my opinion.) --img--  leica is only following the exif specification for this -----> tag !!!  when they store the information in the files this way. also, the number doesn't necessarily give you the correct number of actuation. it really is the unique image id for the camera. it has looked like it was the number of actuations since the introduction of the m8 as the number increments by one for each image captured. the same number is stored in a different format in the maker notes section which i really thought was the number of shutter actuations, but when my m8 came back after getting the shutter upgrade neither number was reset. so if the camera still has it's original shutter, it is an acurate indication of the number of actuations, if it has had a replacement fitted it isn't. carl edited march 11, 2010 by cbretteville", "sortedWord": "None", "identifyer": 41866, "year": "2010"}], "name": "tagL-Forum2010"}