{"interestingcomments": [{"Unnamed: 0": 358792, "autor": "chasdfg", "date": 1545918660000, "content": "This is an interesting topic because I often feel the same way as the OP when I encounter such scenarios...but when I rationalise how I feel I always come to the conclusion I shouldn't have been so quick to judge. - Taking the first example: if I looked into a sony A7/A9 or leica SL EVF, or even a canon or nikon viewfinder (despite shooting nikon for many years before shifting to Leica), I can't confidently say I know what all the information in any of the EVFs/viewfinders means. Sure, sometimes shutter speeds should ring a bell, in that the same old numbers or 1/15, 30, 60, 125, etc come up. That is less excusable. In any case, it could well have been a well dressed man trying Leica in a store for the first time. I've gone into stores to try a Fuji GFX, bewildered by the buttons, knobs and functions. I'd like to think people wouldn't have judged me for being perplexed by the simple things. - As for looking at live view, I myself use livevew to compose using the built-in level, or to do more precise focusing when shooting up close, or when my eyes are tired and strained from looking through the viewfinder. For me it's another option to compose a picture. It's not the \"right way\" to use the M, but it's there. Speaking of seeing other people shoot Leicas, I love the feeling when I see someone else shooting a Leica when I travel, and when our eyes meet we nod to each other in acknowledgment. It has happened more than once and is coupled with a feeling of mutual respect or a silent understanding of some sort I cannot properly explain.. There are other situations where I see people with leicas, including plenty of \"influencers\" and those well dressed and sometimes fumbling, shooting Leica Q, SLs and Ms (though if money was no object, surely they should go for the S?). No silent, unspoken nods in agreement here. I think it is inescapable that the brand Leica is seen as a luxury brand, and if one can afford the most expensive bags, clothes and whatever else, they might well be able to afford the most expensive cameras, allegedly the \"best\" cameras because of the price tag. I've also observed that the \"laypeople\" who know of Leica and who spot me using one often say \"you must be a good photographer\", my reply being \"no i'm not, I just like shooting with it\" and that they should see my photos to judge me rather than judge me based on my gear. They often mention the prices of the lenses and how expensive the gear is and how much I've spent on my equipment, which I suppose is tied to the idea that money spent on the hobby is entwined with passion and/or also skill level (or the idea I am well-to-do, which I tend to distance myself from most). All this makes me feel like it discredits me as a \"photographer\" and elevates those who are less emotionally or financially vested in the brand to be deemed as \"photographers\" (financially in the sense they could afford it without contemplating for months whether to buy X or Y). It took me a long while to reach a level (in terms of ability and finance) where I felt appropriate to dip my toes into the world of Leica and longer to acquire the lenses I use today. I also know i judge begrudgingly on first sight because I know the depth of my passion, which itself only skims the surface of those who are even more emotionally vested in this brand and who can appreciate things far more than I can..and here we have people who appear to know nothing of this historical brand touting this great gear pretending to be \"cartier-bresson\". And when I don't share any silent understanding with the user, the lack of nods in agreement and subtle smiles act almost like confirmation of my judgmental thoughts..that they don't understand me and the brand like how me and the others do. Then I look at myself and think that in the world of wine, watches and cars, I know so very little, and when I eventually dip my toes there I'm likely to be fumbling too. Edited December 27, 2018 by chasdfg", "link": "https://www.l-camera-forum.com/topic/292641-do-you-assume-a-certain-level-of-knowledge-of-a-leica-shooter/page/2/?tab=comments#comment-3653802", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "this is an interesting topic because i often feel the same way as the op when i encounter such scenarios...but when i rationalise how i feel i always come to the conclusion i shouldn't have been so quick to judge. - taking the first example: if i looked into a sony a7/a9 or leica sl evf, or even a canon or nikon viewfinder (despite shooting nikon for many years before shifting to leica), i can't confidently say i know what all the information in any of the evfs/viewfinders means. sure, sometimes shutter speeds should ring a bell, in that the same old numbers or 1/15, 30, 60, 125, etc come up. that is less excusable. in any case, it could well have been a well dressed man trying leica in a store for the first time. i've gone into stores to try a fuji gfx, bewildered by the buttons, knobs and functions. i'd like to think people wouldn't have judged me for being perplexed by the simple things. - as for looking at live view, i myself use livevew to compose using the built-in level, or to do more precise focusing when shooting up close, or when my eyes are tired and strained from looking through the viewfinder. for me it's another option to compose a picture. it's not the \"right way\" to use the m, but it's there. speaking of seeing other people shoot leicas, i love the feeling when i see someone else shooting a leica when i travel, and when our eyes meet we nod to each other in acknowledgment. it has happened more than once and is coupled with a feeling of mutual respect or a silent understanding of some sort i cannot properly explain.. there are other situations where i see people with leicas, including plenty of \"influencers\" and those well dressed and sometimes fumbling, shooting leica q, sls and ms (though if money was no object, surely they should go for the s?). no silent, unspoken nods in agreement here. i think it is inescapable that the brand leica is seen as a luxury brand, and if one can afford the most expensive bags, clothes and whatever else, they might well be able to afford the most expensive cameras, allegedly the \"best\" cameras because of the price -----> tag !!! . i've also observed that the \"laypeople\" who know of leica and who spot me using one often say \"you must be a good photographer\", my reply being \"no i'm not, i just like shooting with it\" and that they should see my photos to judge me rather than judge me based on my gear. they often mention the prices of the lenses and how expensive the gear is and how much i've spent on my equipment, which i suppose is tied to the idea that money spent on the hobby is entwined with passion and/or also skill level (or the idea i am well-to-do, which i tend to distance myself from most). all this makes me feel like it discredits me as a \"photographer\" and elevates those who are less emotionally or financially vested in the brand to be deemed as \"photographers\" (financially in the sense they could afford it without contemplating for months whether to buy x or y). it took me a long while to reach a level (in terms of ability and finance) where i felt appropriate to dip my toes into the world of leica and longer to acquire the lenses i use today. i also know i judge begrudgingly on first sight because i know the depth of my passion, which itself only skims the surface of those who are even more emotionally vested in this brand and who can appreciate things far more than i can..and here we have people who appear to know nothing of this historical brand touting this great gear pretending to be \"cartier-bresson\". and when i don't share any silent understanding with the user, the lack of nods in agreement and subtle smiles act almost like confirmation of my judgmental thoughts..that they don't understand me and the brand like how me and the others do. then i look at myself and think that in the world of wine, watches and cars, i know so very little, and when i eventually dip my toes there i'm likely to be fumbling too. edited december 27, 2018 by chasdfg", "sortedWord": "None", "identifyer": 19973, "year": "2018"}, {"Unnamed: 0": 376144, "autor": "Photoskeptic", "date": 1529843400000, "content": " I've been in negotiations to buy an M9-P chrome, serial #3980325. This serial # doesn't seem to jive with known M9-P numbers. M9-P is stamped on the hotshoe and the sealed tag on the bottom plate also has M9-P on it. Is it genuine or an updated M9? Thanks for all replies, John", "link": "https://www.l-camera-forum.com/topic/285888-question-about-m9-p-for-sale/?tab=comments#comment-3542861", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " i've been in negotiations to buy an m9-p chrome, serial #3980325. this serial # doesn't seem to jive with known m9-p numbers. m9-p is stamped on the hotshoe and the sealed -----> tag !!!  on the bottom plate also has m9-p on it. is it genuine or an updated m9? thanks for all replies, john", "sortedWord": "None", "identifyer": 37453, "year": "2018"}, {"Unnamed: 0": 438051, "autor": "jonoslack", "date": 1537790100000, "content": "$4k sounds about right if we ballpark a SL2 at $7k with the same sensor, if we extrapolate from the D-Lux 109 vs. LX100 Hmm - you are assuming that the SL2 will just be a clone of the Panasonic S - even if the rumours are true I think this is extremely unlikely, It's one thing re-badging an LX100, quite another abandoning all your SL design and development department and using Panasonic (and losing the 'made in Germany' tag as well). I'd expect a body made in Portugal / Germany, a different interface, much simpler controls and a modified sensor (for M lenses) at the very least. . . . but what do I know? (in this case nothing or I couldn't pontificate!)", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/10/?tab=comments#comment-3598674", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "$4k sounds about right if we ballpark a sl2 at $7k with the same sensor, if we extrapolate from the d-lux 109 vs. lx100 hmm - you are assuming that the sl2 will just be a clone of the panasonic s - even if the rumours are true i think this is extremely unlikely, it's one thing re-badging an lx100, quite another abandoning all your sl design and development department and using panasonic (and losing the 'made in germany' -----> tag !!!  as well). i'd expect a body made in portugal / germany, a different interface, much simpler controls and a modified sensor (for m lenses) at the very least. . . . but what do i know? (in this case nothing or i couldn't pontificate!)", "sortedWord": "None", "identifyer": 51293, "year": "2018"}, {"Unnamed: 0": 438053, "autor": "frame-it", "date": 1537791240000, "content": "Hi Jono, nice to see you jump into this thread so hows the SL2 testing coming along --img--  Hmm - you are assuming that the SL2 will just be a clone of the Panasonic S - even if the rumours are true I think this is extremely unlikely, It's one thing re-badging an LX100, quite another abandoning all your SL design and development department and using Panasonic (and losing the 'made in Germany' tag as well). I'd expect a body made in Portugal / Germany, a different interface, much simpler controls and a modified sensor (for M lenses) at the very least. . . . but what do I know? (in this case nothing or I couldn't pontificate!)", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/10/?tab=comments#comment-3598683", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "hi jono, nice to see you jump into this thread so hows the sl2 testing coming along --img--  hmm - you are assuming that the sl2 will just be a clone of the panasonic s - even if the rumours are true i think this is extremely unlikely, it's one thing re-badging an lx100, quite another abandoning all your sl design and development department and using panasonic (and losing the 'made in germany' -----> tag !!!  as well). i'd expect a body made in portugal / germany, a different interface, much simpler controls and a modified sensor (for m lenses) at the very least. . . . but what do i know? (in this case nothing or i couldn't pontificate!)", "sortedWord": "None", "identifyer": 51295, "year": "2018"}, {"Unnamed: 0": 438455, "autor": "helged", "date": 1537986660000, "content": "A 600mm FF prime by Leica would be so ridiculously expensive that the market would be tiny. Canon and Nikon sell there’s at $12000+. I know exactly no one who owns the exotic telephotos from Canon and Nikon but have encountered many who rent them. I don’t see Leica having the market share to justify a healthy rental market so large expensive telephotos don’t seem like they would be economically viable from Leica. Yes, the Leica price tag for a 600mm f4 SL APO would likely be higher than high. But I would gladly put a long Sigma (or Panasonic) prime on an L-mount body - as long as the lens is optically good. Possibly not Leica SL-good (a la 50Lux-SL, 75 and 90Cron-SL), but still good.", "link": "https://www.l-camera-forum.com/topic/289855-so-what-l-mount-lenses-do-you-want-sigma-and-panasonic-to-make/?tab=comments#comment-3600721", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "a 600mm ff prime by leica would be so ridiculously expensive that the market would be tiny. canon and nikon sell there’s at $12000+. i know exactly no one who owns the exotic telephotos from canon and nikon but have encountered many who rent them. i don’t see leica having the market share to justify a healthy rental market so large expensive telephotos don’t seem like they would be economically viable from leica. yes, the leica price -----> tag !!!  for a 600mm f4 sl apo would likely be higher than high. but i would gladly put a long sigma (or panasonic) prime on an l-mount body - as long as the lens is optically good. possibly not leica sl-good (a la 50lux-sl, 75 and 90cron-sl), but still good.", "sortedWord": "None", "identifyer": 51697, "year": "2018"}], "name": "tagL-Forum2018"}