{"interestingcomments": [{"Unnamed: 0": 353139, "autor": "pico", "date": 1454887620000, "content": "Any thoughts on removing the label on the base plate....yea or neh ? Do not remove it! It only leads to greater wrongs such as removing mattress tags! --img--  Then next you might be reluctant to destroy cigarette tax stamps! Next, throwing away recyclable bottles with deposits. And it goes on and on! --img-- ", "link": "https://www.l-camera-forum.com/topic/256170-accelerated-brassing/page/3/?tab=comments#comment-2985092", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "any thoughts on removing the label on the base plate....yea or neh ? do not remove it! it only leads to greater wrongs such as removing mattress -----> tags !!! ! --img--  then next you might be reluctant to destroy cigarette tax stamps! next, throwing away recyclable bottles with deposits. and it goes on and on! --img-- ", "sortedWord": "None", "identifyer": 14283, "year": "2016"}, {"Unnamed: 0": 353141, "autor": "pico", "date": 1454888100000, "content": "\"Except by the consumer\" Yeah, I know but I think we should tighten up the law - bring in the feds, BUST the perps who remove the tags. Yeah, that's the ticket. The same with removing the Euro labels. Free the world from the tyranny of .... of ... WTF was I talking about?", "link": "https://www.l-camera-forum.com/topic/256170-accelerated-brassing/page/3/?tab=comments#comment-2985094", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "\"except by the consumer\" yeah, i know but i think we should tighten up the law - bring in the feds, bust the perps who remove the -----> tags !!! . yeah, that's the ticket. the same with removing the euro labels. free the world from the tyranny of .... of ... wtf was i talking about?", "sortedWord": "None", "identifyer": 14285, "year": "2016"}, {"Unnamed: 0": 353143, "autor": "jdlaing", "date": 1454896500000, "content": "Yeah, I know but I think we should tighten up the law - bring in the feds, BUST the perps who remove the tags. Yeah, that's the ticket. The same with removing the Euro labels. Free the world from the tyranny of .... of ... WTF was I talking about? We have police for everything now. Why not mattress police too?", "link": "https://www.l-camera-forum.com/topic/256170-accelerated-brassing/page/3/?tab=comments#comment-2985126", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "yeah, i know but i think we should tighten up the law - bring in the feds, bust the perps who remove the -----> tags !!! . yeah, that's the ticket. the same with removing the euro labels. free the world from the tyranny of .... of ... wtf was i talking about? we have police for everything now. why not mattress police too?", "sortedWord": "None", "identifyer": 14287, "year": "2016"}, {"Unnamed: 0": 353144, "autor": "menos I M6", "date": 1454910540000, "content": "Do not remove it! It only leads to greater wrongs such as removing mattress tags! --img--  Then next you might be reluctant to destroy cigarette tax stamps! Next, throwing away recyclable bottles with deposits. And it goes on and on! --img--  Wouldn't it be great if each digital Leica M would come with a 5x5 cm large textile tag sewn right under the right hand strap lug along the body? Over time it's fibers would fray, giving away a truly Kravitz'ed appearance, providing hour long conversation material during camera club meet-ups and on online forums. Leica could - for a handful of collectors - even issue a genuine silk tag special edition or Lenny could work on a \"distressed rag tag edition\", delivered in a roughed up potato sack, going along with white silk gloves and grease smeared special edition E40x0.35 filter thread 50mm Summilux ASPH to ensure the exclusivity of possible filters to be obtained down the road, securing an acceptable ROI for professional collectors who will bent over backwards in preserving the potato sack and special edition external smeared grease viscosity of the lens by means of a climate chamber. \"Oh you got some serious brassing on your Leica M11-PS.68EVFtype639.5goldLogoBlackChinaLaquer-MP74-2 there mate!\" \"Yeah, but it is nothing compared to the beautifully distressed staining you developed on your KravitzRagTagA'la'CarteSandBeltedDiorVuittonHermesLizzardNileCrocodileButtonUpDouchePokemon - tag - sweet staining there indeed!\" \"Oh yeah, I did that when I was street-shooting some sleeping homeless people on my photo trip to Cuba last summer and dunked it in puke at the hotel bar later.\" \"For real !?\" \"Yeah for real mate, you should try it … want to lick it?\"", "link": "https://www.l-camera-forum.com/topic/256170-accelerated-brassing/page/3/?tab=comments#comment-2985157", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "do not remove it! it only leads to greater wrongs such as removing mattress -----> tags !!! ! --img--  then next you might be reluctant to destroy cigarette tax stamps! next, throwing away recyclable bottles with deposits. and it goes on and on! --img--  wouldn't it be great if each digital leica m would come with a 5x5 cm large textile tag sewn right under the right hand strap lug along the body? over time it's fibers would fray, giving away a truly kravitz'ed appearance, providing hour long conversation material during camera club meet-ups and on online forums. leica could - for a handful of collectors - even issue a genuine silk tag special edition or lenny could work on a \"distressed rag tag edition\", delivered in a roughed up potato sack, going along with white silk gloves and grease smeared special edition e40x0.35 filter thread 50mm summilux asph to ensure the exclusivity of possible filters to be obtained down the road, securing an acceptable roi for professional collectors who will bent over backwards in preserving the potato sack and special edition external smeared grease viscosity of the lens by means of a climate chamber. \"oh you got some serious brassing on your leica m11-ps.68evftype639.5goldlogoblackchinalaquer-mp74-2 there mate!\" \"yeah, but it is nothing compared to the beautifully distressed staining you developed on your kravitzragtaga'la'cartesandbelteddiorvuittonhermeslizzardnilecrocodilebuttonupdouchepokemon - tag - sweet staining there indeed!\" \"oh yeah, i did that when i was street-shooting some sleeping homeless people on my photo trip to cuba last summer and dunked it in puke at the hotel bar later.\" \"for real !?\" \"yeah for real mate, you should try it … want to lick it?\"", "sortedWord": "None", "identifyer": 14288, "year": "2016"}, {"Unnamed: 0": 356639, "autor": "indergaard", "date": 1461701460000, "content": "I also think they should have just left it off. If you want to compensate exposure, just change the shutter speed. But then Leica would have had to actually make a new camera. Which this isn't. It's again just a re-hash of the M240, with less features, and probably a higher price tag.", "link": "https://www.l-camera-forum.com/topic/259865-the-leica-m-d-thread-merged/page/10/?tab=comments#comment-3034079", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i also think they should have just left it off. if you want to compensate exposure, just change the shutter speed. but then leica would have had to actually make a new camera. which this isn't. it's again just a re-hash of the m240, with less features, and probably a higher price -----> tag !!! .", "sortedWord": "None", "identifyer": 17806, "year": "2016"}, {"Unnamed: 0": 356714, "autor": "dunhoy", "date": 1461854400000, "content": "Can't take this camera seriously. They left the meter in it. and let's not forget about the price tag! Edited April 28, 2016 by dunhoy", "link": "https://www.l-camera-forum.com/topic/259865-the-leica-m-d-thread-merged/page/14/?tab=comments#comment-3035139", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "can't take this camera seriously. they left the meter in it. and let's not forget about the price -----> tag !!! ! edited april 28, 2016 by dunhoy", "sortedWord": "None", "identifyer": 17882, "year": "2016"}, {"Unnamed: 0": 398962, "autor": "keithlaban.co.uk", "date": 1475249220000, "content": "When posting using the image tag I'm achieving an external link to the image rather than the image appearing in the thread.", "link": "https://www.l-camera-forum.com/topic/253730-your-ultra-wide-angle-uwa-pictures-10mm-to-21mm/page/8/?tab=comments#comment-3121440", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "when posting using the image -----> tag !!!  i'm achieving an external link to the image rather than the image appearing in the thread.", "sortedWord": "None", "identifyer": 11615, "year": "2016"}], "name": "tagL-Forum2016"}