{"interestingcomments": [{"Unnamed: 0": 355828, "autor": "hoonetic", "date": 1557549120000, "content": " So, I recently bought a preowned m240 from a Leica store and realized there was a problem when I was charging the battery. The CHARGE LED would blink and after several hours both the CHARGE and 80% would be flashing at the same time. Tried it several times but the battery would not charge properly. I contacted the Leica store and told them what the issue was, so they decided to send me a replacement battery that was also used, but unfortunately, the issue still happens when I tried to charge the replacement. I'm planning on ordering one of the Nitecore USB chargers and maybe a new Leica charger to test the batteries. Has anyone heard of issues with Leica chargers for the m240s? Thanks! Edited May 11, 2019 by hoonetic added tags", "link": "https://www.l-camera-forum.com/topic/297139-charger-or-battery-problem/?tab=comments#comment-3738546", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": " so, i recently bought a preowned m240 from a leica store and realized there was a problem when i was charging the battery. the charge led would blink and after several hours both the charge and 80% would be flashing at the same time. tried it several times but the battery would not charge properly. i contacted the leica store and told them what the issue was, so they decided to send me a replacement battery that was also used, but unfortunately, the issue still happens when i tried to charge the replacement. i'm planning on ordering one of the nitecore usb chargers and maybe a new leica charger to test the batteries. has anyone heard of issues with leica chargers for the m240s? thanks! edited may 11, 2019 by hoonetic added -----> tags !!! ", "sortedWord": "None", "identifyer": 16994, "year": "2019"}, {"Unnamed: 0": 356983, "autor": "LUF Admin", "date": 1561367340000, "content": " Leica has announced today the Leica M-E (Type 240) – „Welcome to the family“. The Leica M-E will be available starting July 18th, the price tag is $ 3995 / £ 3,500 / 3,950 €. --img-- /applications/core/interface/js/spacer.png\"> --img-- /applications/core/interface/js/spacer.png\"> --img-- /applications/core/interface/js/spacer.png\"> Update 2019-06-25: Here is the English press release! Leica M-E: Entry level access to the M-System. Wetzlar, June 24, 2019. The Leica M-E makes starting out in the M-System easier than ever before. The latest model of the legendary camera family specifically addresses newcomers to the system and correspondingly comes at an extremely attractive price. As is the case with all other Leica M models, the M-E systematically reflects the Leica design philosophy of reduction to the essential photographic functions. This enables intuitive handling and, in consequence, allows its users to concentrate completely on what’s important – composing and making pictures. The Leica M-E (Typ 240) is characterized by its iconic design and the familiar high quality of its construction and finish. Its compact body is sealed against dust and water spray and features real leather trim. The top deck and the baseplate are finished in an anthracite-gray lacquer especially developed for the Leica M-E. As with other M-Cameras, photographers shooting with the new Leica M-E benefit from the extended system compatibility that is a distinctive feature of the M family – thanks to the M-Bayonet, it is fully compatible with almost every Leica M-Lens ever built. With a resolution of 24 MP, the CMOS sensor of the M-E offers a proven ideal balance between high resolution, for the reproduction of even the finest details, and a file size that supports smooth and trouble-free integration into the photographic workflow. Thanks to an ISO sensitivity range up to 6400, the M-E also delivers excellent pictures in low light. When shooting fast sequences, a 2 GB buffer memory guarantees the immediate readiness of the Leica M-E to capture every fleeting moment. The video recording function of the Leica M-E captures the inimitable look of Leica photography in moving pictures – in full-HD format (1920 x 1080 pixels) with a choice of 24, 25, or 30 frames per second. Photographic projects can therefore be enriched with professional video footage in Leica quality without the effort of having to switch cameras. The Leica M-E will be on sale from July 25, 2019. The camera is limited in quantity and will be available only as long as stocks last.", "link": "https://www.l-camera-forum.com/topic/298623-new-leica-m-e-type-240/?tab=comments#comment-3765324", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " leica has announced today the leica m-e (type 240) – „welcome to the family“. the leica m-e will be available starting july 18th, the price -----> tag !!!  is $ 3995 / £ 3,500 / 3,950 €. --img-- /applications/core/interface/js/spacer.png\"> --img-- /applications/core/interface/js/spacer.png\"> --img-- /applications/core/interface/js/spacer.png\"> update 2019-06-25: here is the english press release! leica m-e: entry level access to the m-system. wetzlar, june 24, 2019. the leica m-e makes starting out in the m-system easier than ever before. the latest model of the legendary camera family specifically addresses newcomers to the system and correspondingly comes at an extremely attractive price. as is the case with all other leica m models, the m-e systematically reflects the leica design philosophy of reduction to the essential photographic functions. this enables intuitive handling and, in consequence, allows its users to concentrate completely on what’s important – composing and making pictures. the leica m-e (typ 240) is characterized by its iconic design and the familiar high quality of its construction and finish. its compact body is sealed against dust and water spray and features real leather trim. the top deck and the baseplate are finished in an anthracite-gray lacquer especially developed for the leica m-e. as with other m-cameras, photographers shooting with the new leica m-e benefit from the extended system compatibility that is a distinctive feature of the m family – thanks to the m-bayonet, it is fully compatible with almost every leica m-lens ever built. with a resolution of 24 mp, the cmos sensor of the m-e offers a proven ideal balance between high resolution, for the reproduction of even the finest details, and a file size that supports smooth and trouble-free integration into the photographic workflow. thanks to an iso sensitivity range up to 6400, the m-e also delivers excellent pictures in low light. when shooting fast sequences, a 2 gb buffer memory guarantees the immediate readiness of the leica m-e to capture every fleeting moment. the video recording function of the leica m-e captures the inimitable look of leica photography in moving pictures – in full-hd format (1920 x 1080 pixels) with a choice of 24, 25, or 30 frames per second. photographic projects can therefore be enriched with professional video footage in leica quality without the effort of having to switch cameras. the leica m-e will be on sale from july 25, 2019. the camera is limited in quantity and will be available only as long as stocks last.", "sortedWord": "None", "identifyer": 18151, "year": "2019"}, {"Unnamed: 0": 356985, "autor": "a.noctilux", "date": 1561399080000, "content": "Yes, wise price tag must boost selling volume. I think this is indeed the cheapest NEW digital M since M8 (launched in France 4 500 € the former \"old\" M-E was 4 800 €). Edited June 24, 2019 by a.noctilux", "link": "https://www.l-camera-forum.com/topic/298623-new-leica-m-e-type-240/?tab=comments#comment-3765605", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "yes, wise price -----> tag !!!  must boost selling volume. i think this is indeed the cheapest new digital m since m8 (launched in france 4 500 € the former \"old\" m-e was 4 800 €). edited june 24, 2019 by a.noctilux", "sortedWord": "None", "identifyer": 18153, "year": "2019"}, {"Unnamed: 0": 357699, "autor": "josue", "date": 1575808920000, "content": " Guten Tag liebe Leica Freunde Ich habe eine m240 und hätte dazu gerne eine Bereitschaftstasche, da ich die Kamera gerne einfach so in meine Reisetasche werfe. Gibt es Dritthersteller für diese Bereitschaftstaschen oder muss das teure Original angeschafft werden? Danke viel mals Florian", "link": "https://www.l-camera-forum.com/topic/304237-bereitschaftstasche/?tab=comments#comment-3869578", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " guten -----> tag !!!  liebe leica freunde ich habe eine m240 und hätte dazu gerne eine bereitschaftstasche, da ich die kamera gerne einfach so in meine reisetasche werfe. gibt es dritthersteller für diese bereitschaftstaschen oder muss das teure original angeschafft werden? danke viel mals florian", "sortedWord": "None", "identifyer": 18870, "year": "2019"}, {"Unnamed: 0": 357888, "autor": "marchyman", "date": 1572984000000, "content": " 4 hours ago, terrycym said: Nowhere is not (0,0,0). It's off the west coast of Africa on the Equator Yup. Leica is the first (and only, so far) camera vendor I've run into that uses the \"GPSStatus\" tag to say if the GPS values are valid or not. If the status tag exists and has the value \"V\" (for void) the GPS data must be ignored. Some mapping applications do not have code to handle that tag and therefor process the 0/0 lat/lon as a location. Such apps assume that if GPS data is present it is valid.", "link": "https://www.l-camera-forum.com/topic/302808-new-firmware-206/page/3/?tab=comments#comment-3848470", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " 4 hours ago, terrycym said: nowhere is not (0,0,0). it's off the west coast of africa on the equator yup. leica is the first (and only, so far) camera vendor i've run into that uses the \"gpsstatus\" -----> tag !!!  to say if the gps values are valid or not. if the status tag exists and has the value \"v\" (for void) the gps data must be ignored. some mapping applications do not have code to handle that tag and therefor process the 0/0 lat/lon as a location. such apps assume that if gps data is present it is valid.", "sortedWord": "None", "identifyer": 19065, "year": "2019"}, {"Unnamed: 0": 373740, "autor": "Ko.Fe.", "date": 1565737260000, "content": "I don't like 50/75. They are too close, too cluttered. I don't see any need for 75 lens as well. 50 is already my tele and 90 is great for head and shoulders without arm and leg price tag. If I would use 75, then 50 frames been close by 75 would somewhat help, I think.", "link": "https://www.l-camera-forum.com/topic/219775-leica-75mm-framelines/page/2/?tab=comments#comment-3797178", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "i don't like 50/75. they are too close, too cluttered. i don't see any need for 75 lens as well. 50 is already my tele and 90 is great for head and shoulders without arm and leg price -----> tag !!! . if i would use 75, then 50 frames been close by 75 would somewhat help, i think.", "sortedWord": "None", "identifyer": 35046, "year": "2019"}, {"Unnamed: 0": 374278, "autor": "NZDavid", "date": 1553824080000, "content": "Lacklands was very helpful. Looks like the M10 is a good choice. Yes, all Leica price tags cause a sharp intake of breath, but it's a good offer. I think the problem with the previous delay with the X1 some years ago was probably the very slow international postal service. C19 around-the-world tea clipper sailing ships were faster!", "link": "https://www.l-camera-forum.com/topic/295550-replace-or-repair-m9-with-sensor-corrosion/?tab=comments#comment-3711581", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "lacklands was very helpful. looks like the m10 is a good choice. yes, all leica price -----> tags !!!  cause a sharp intake of breath, but it's a good offer. i think the problem with the previous delay with the x1 some years ago was probably the very slow international postal service. c19 around-the-world tea clipper sailing ships were faster!", "sortedWord": "None", "identifyer": 35584, "year": "2019"}, {"Unnamed: 0": 411641, "autor": "jaeger", "date": 1574637180000, "content": "6 hours ago, ocean2059 said: Are you happy with the performance of your 24 Lux on the Nikon Z7? A fast 24mm lux is always wonderful and no problem on a Z7. The EVF on Z7 make it much accurate to frame. An Interesting thing is, I use my eye glasses to frame when using my MP240 if you know what I mean. Because I only shoot raw, I don't see much IQ difference compare with a Nikon 24mm f/1.4 (Nikon seems brighter actually). https://www.nikonusa.com/en/nikon-products/product/camera-lenses/af-s-nikkor-24mm-f%2f1.4g-ed.html The Nikon uses real focusing so the length of the lens ain't change, Lux does. However, the size of a Lux is smaller (becoz manual focus) but 4x the price tag. You can read this to learn more. https://www.streetsilhouettes.com/home/2017/11/17/sensor-comparison-of-5-cameras They have another 24mm comparison but I can't find it. The background is Thai boxing", "link": "https://www.l-camera-forum.com/topic/302208-summilux-m-2814-vs-summilux-q-2817-which-do-you-like-better-and-why/?tab=comments#comment-3861411", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "6 hours ago, ocean2059 said: are you happy with the performance of your 24 lux on the nikon z7? a fast 24mm lux is always wonderful and no problem on a z7. the evf on z7 make it much accurate to frame. an interesting thing is, i use my eye glasses to frame when using my mp240 if you know what i mean. because i only shoot raw, i don't see much iq difference compare with a nikon 24mm f/1.4 (nikon seems brighter actually). https://www.nikonusa.com/en/nikon-products/product/camera-lenses/af-s-nikkor-24mm-f%2f1.4g-ed.html the nikon uses real focusing so the length of the lens ain't change, lux does. however, the size of a lux is smaller (becoz manual focus) but 4x the price -----> tag !!! . you can read this to learn more. https://www.streetsilhouettes.com/home/2017/11/17/sensor-comparison-of-5-cameras they have another 24mm comparison but i can't find it. the background is thai boxing", "sortedWord": "None", "identifyer": 24485, "year": "2019"}, {"Unnamed: 0": 411642, "autor": "ocean2059", "date": 1574640420000, "content": "49 minutes ago, jaeger said: A fast 24mm lux is always wonderful and no problem on a Z7. The EVF on Z7 make it much accurate to frame. An Interesting thing is, I use my eye glasses to frame when using my MP240 if you know what I mean. Because I only shoot raw, I don't see much IQ difference compare with a Nikon 24mm f/1.4 (Nikon seems brighter actually). https://www.nikonusa.com/en/nikon-products/product/camera-lenses/af-s-nikkor-24mm-f%2f1.4g-ed.html The Nikon uses real focusing so the length of the lens ain't change, Lux does. However, the size of a Lux is smaller (becoz manual focus) but 4x the price tag. You can read this to learn more. https://www.streetsilhouettes.com/home/2017/11/17/sensor-comparison-of-5-cameras They have another 24mm comparison but I can't find it. The background is Thai boxing Thank you very much. I was worried about the corner and edge smear of the 24/1.4 Lux at open f stop on other mirrorless bodies (other than Leica M and SL/SL2). I have the Nikon 24/1.4 G and its size is too big for the Z7 body.", "link": "https://www.l-camera-forum.com/topic/302208-summilux-m-2814-vs-summilux-q-2817-which-do-you-like-better-and-why/?tab=comments#comment-3861433", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "49 minutes ago, jaeger said: a fast 24mm lux is always wonderful and no problem on a z7. the evf on z7 make it much accurate to frame. an interesting thing is, i use my eye glasses to frame when using my mp240 if you know what i mean. because i only shoot raw, i don't see much iq difference compare with a nikon 24mm f/1.4 (nikon seems brighter actually). https://www.nikonusa.com/en/nikon-products/product/camera-lenses/af-s-nikkor-24mm-f%2f1.4g-ed.html the nikon uses real focusing so the length of the lens ain't change, lux does. however, the size of a lux is smaller (becoz manual focus) but 4x the price -----> tag !!! . you can read this to learn more. https://www.streetsilhouettes.com/home/2017/11/17/sensor-comparison-of-5-cameras they have another 24mm comparison but i can't find it. the background is thai boxing thank you very much. i was worried about the corner and edge smear of the 24/1.4 lux at open f stop on other mirrorless bodies (other than leica m and sl/sl2). i have the nikon 24/1.4 g and its size is too big for the z7 body.", "sortedWord": "None", "identifyer": 24486, "year": "2019"}, {"Unnamed: 0": 411648, "autor": "Phatcat", "date": 1576307880000, "content": "Diglloyd also didn’t think highly of the Q lens, not for the price anyway. The problem with the Q lens is high sharpness is limited to central 1/3 or so, declining steadily towards the outer zones. The style/rendition is beautiful he stated, but if you are a pixel peeper (which obviously he is, it’s how he makes money), then the performance is not worth the price tag, especially the Q is now up to 47M pixels. As for the Summilux, the problem was field curvature, which he said all Leica Summilux suffer this problem. It is not up to Otus quality in terms of absolute performance, but given the small size and speed, which meant Leica have to make compromises, it is a outstanding lens.", "link": "https://www.l-camera-forum.com/topic/302208-summilux-m-2814-vs-summilux-q-2817-which-do-you-like-better-and-why/page/2/?tab=comments#comment-3872908", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "diglloyd also didn’t think highly of the q lens, not for the price anyway. the problem with the q lens is high sharpness is limited to central 1/3 or so, declining steadily towards the outer zones. the style/rendition is beautiful he stated, but if you are a pixel peeper (which obviously he is, it’s how he makes money), then the performance is not worth the price -----> tag !!! , especially the q is now up to 47m pixels. as for the summilux, the problem was field curvature, which he said all leica summilux suffer this problem. it is not up to otus quality in terms of absolute performance, but given the small size and speed, which meant leica have to make compromises, it is a outstanding lens.", "sortedWord": "None", "identifyer": 24492, "year": "2019"}, {"Unnamed: 0": 411651, "autor": "Herr Barnack", "date": 1576363260000, "content": " 15 hours ago, Phatcat said: Diglloyd also didn’t think highly of the Q lens, not for the price anyway. The problem with the Q lens is high sharpness is limited to central 1/3 or so, declining steadily towards the outer zones. The style/rendition is beautiful he stated, but if you are a pixel peeper (which obviously he is, it’s how he makes money), then the performance is not worth the price tag, especially the Q is now up to 47M pixels. As for the Summilux, the problem was field curvature, which he said all Leica Summilux suffer this problem. It is not up to Otus quality in terms of absolute performance, but given the small size and speed, which meant Leica have to make compromises, it is a outstanding lens. That may be the case at f/1.7 with the Q2. Many M lenses are not 100% razor sharp at maximum aperture. At midrange apertures such as f/5.6 and f/8.0, sharpness extends into the corners and to the edges of the frame. This has been accepted by Leica users for decades as a necessary arrangement in order to maximize overall lens performance and image quality. Even with a whiff of softness in the outer regions of the frame at maximum aperture, I'll still take M lenses over any other lens maker's offerings. Regarding Diglloyd and other commentators, their opinions are nothing but opinions; they are not the immutable laws of the universe.", "link": "https://www.l-camera-forum.com/topic/302208-summilux-m-2814-vs-summilux-q-2817-which-do-you-like-better-and-why/page/2/?tab=comments#comment-3873332", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " 15 hours ago, phatcat said: diglloyd also didn’t think highly of the q lens, not for the price anyway. the problem with the q lens is high sharpness is limited to central 1/3 or so, declining steadily towards the outer zones. the style/rendition is beautiful he stated, but if you are a pixel peeper (which obviously he is, it’s how he makes money), then the performance is not worth the price -----> tag !!! , especially the q is now up to 47m pixels. as for the summilux, the problem was field curvature, which he said all leica summilux suffer this problem. it is not up to otus quality in terms of absolute performance, but given the small size and speed, which meant leica have to make compromises, it is a outstanding lens. that may be the case at f/1.7 with the q2. many m lenses are not 100% razor sharp at maximum aperture. at midrange apertures such as f/5.6 and f/8.0, sharpness extends into the corners and to the edges of the frame. this has been accepted by leica users for decades as a necessary arrangement in order to maximize overall lens performance and image quality. even with a whiff of softness in the outer regions of the frame at maximum aperture, i'll still take m lenses over any other lens maker's offerings. regarding diglloyd and other commentators, their opinions are nothing but opinions; they are not the immutable laws of the universe.", "sortedWord": "None", "identifyer": 24495, "year": "2019"}, {"Unnamed: 0": 416639, "autor": "Exodies", "date": 1574691300000, "content": "6 hours ago, scott kirkpatrick said: Can lightroom geotag with input from a good hikers' GPS, like the Garmin 60? There is no question about those working in the Far North or other outbacks. Have your Garmin GPS make a track log, Lightroom can read it and tag the photographs. A small gps will run for over eight hours on one battery; you don’t need to load a map in it. Other solutions are too inconvenient - phone battery can’t cope with it, camera internal gps’s take too long to find the satellites.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/2/?tab=comments#comment-3861735", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "6 hours ago, scott kirkpatrick said: can lightroom geotag with input from a good hikers' gps, like the garmin 60? there is no question about those working in the far north or other outbacks. have your garmin gps make a track log, lightroom can read it and -----> tag !!!  the photographs. a small gps will run for over eight hours on one battery; you don’t need to load a map in it. other solutions are too inconvenient - phone battery can’t cope with it, camera internal gps’s take too long to find the satellites.", "sortedWord": "None", "identifyer": 29640, "year": "2019"}, {"Unnamed: 0": 416640, "autor": "SrMi", "date": 1574704800000, "content": "3 hours ago, Exodies said: Have your Garmin GPS make a track log, Lightroom can read it and tag the photographs. A small gps will run for over eight hours on one battery; you don’t need to load a map in it. Other solutions are too inconvenient - phone battery can’t cope with it, camera internal gps’s take too long to find the satellites. Latest phone and GPS tracking software do not use that much battery, though it may vary by actual situation. Garmin GPS-s are great, but I dislike having to remember to charge and pick it up as well, while my phone is always ready.", "link": "https://www.l-camera-forum.com/topic/303771-sl2-and-gps-tagging/page/2/?tab=comments#comment-3861916", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "3 hours ago, exodies said: have your garmin gps make a track log, lightroom can read it and -----> tag !!!  the photographs. a small gps will run for over eight hours on one battery; you don’t need to load a map in it. other solutions are too inconvenient - phone battery can’t cope with it, camera internal gps’s take too long to find the satellites. latest phone and gps tracking software do not use that much battery, though it may vary by actual situation. garmin gps-s are great, but i dislike having to remember to charge and pick it up as well, while my phone is always ready.", "sortedWord": "None", "identifyer": 29641, "year": "2019"}, {"Unnamed: 0": 425061, "autor": "justbananas", "date": 1564761420000, "content": "Is there “enough” of a difference from the focal length of the tl35 to the sigma 45 to make it worth the price tag.. keeping in mind no adapter is needed and it appears autofocus works seems like a no brainer to me Edited August 2, 2019 by justbananas", "link": "https://www.l-camera-forum.com/topic/299846-sigma-45mm/?tab=comments#comment-3789936", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "is there “enough” of a difference from the focal length of the tl35 to the sigma 45 to make it worth the price -----> tag !!! .. keeping in mind no adapter is needed and it appears autofocus works seems like a no brainer to me edited august 2, 2019 by justbananas", "sortedWord": "None", "identifyer": 38148, "year": "2019"}, {"Unnamed: 0": 425062, "autor": "Marac", "date": 1564762740000, "content": "17 minutes ago, justbananas said: Is there “enough” of a difference from the focal length of the tl35 to the sigma 45 to make it worth the price tag.. keeping in mind no adapter is needed and it appears autofocus works seems like a no brainer to me My own personal feeling towards that question is that I believe there is enough difference between the 35 Lux and the 45 Sigma to warrant owning one, closer focus for a start. it is the difference between a 50mm and a 70mm lens in FF terms, I think a very nice travel prime kit would be the 23 Cron and this Sigma, you may want to put the 18 in there as it is so small. I'm taking a few more shots tonight and then my friends band is playing so that will test the low light performance. The lens has manual override with focus peeking so I'll be shooting like that in the dark..", "link": "https://www.l-camera-forum.com/topic/299846-sigma-45mm/?tab=comments#comment-3789951", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "17 minutes ago, justbananas said: is there “enough” of a difference from the focal length of the tl35 to the sigma 45 to make it worth the price -----> tag !!! .. keeping in mind no adapter is needed and it appears autofocus works seems like a no brainer to me my own personal feeling towards that question is that i believe there is enough difference between the 35 lux and the 45 sigma to warrant owning one, closer focus for a start. it is the difference between a 50mm and a 70mm lens in ff terms, i think a very nice travel prime kit would be the 23 cron and this sigma, you may want to put the 18 in there as it is so small. i'm taking a few more shots tonight and then my friends band is playing so that will test the low light performance. the lens has manual override with focus peeking so i'll be shooting like that in the dark..", "sortedWord": "None", "identifyer": 38149, "year": "2019"}, {"Unnamed: 0": 436604, "autor": "scott kirkpatrick", "date": 1570892580000, "content": " I did a little experiment today, posting the paragraph below in the Q2 forum, because the Q2, like the S1 and S1R and perhaps like the SL2, uses BlueTooth Low Energy to provide a continuous connection between your smart phone and the camera, with WiFi called into play when needed for remote viewing or review and upload of files. The Q2 folks are not happy with Fotos' performance at present. Synch does better: I'd like to hold Leica to a standard of getting Fotos controls to work as well as Panasonic's for the basic operations of time reference, GPS, remote trigger, and uploading images. Leica has the advantage of not having to do everything someone has ever told them was needed, only \"the essentials,\" so this ought to be a reasonable goal. I took my S1R out for an hour's walk this afternoon. Before leaving I started Synch on my(Android) phone, without initiating either remote operation or picture review, just getting the BT-LE connection going. I put the phone in a pocket once the display on the S1R showed BT and GPS alive. It never showed any WiFi, which was fine. All of my shots were accurately geo-tagged. One tradeoff that the Lumix made is that the display stayed on for the whole hour, so keeping the BT connection alive and the geodata fresh apparently prevents going into standby mode after two minutes. But I had only used about 20-30% of the battery's capacity in the hour with 40+ shots taken.", "link": "https://www.l-camera-forum.com/topic/302346-comparing-panasonics-lumix-synch-to-leicas-fotos/?tab=comments#comment-3834876", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": " i did a little experiment today, posting the paragraph below in the q2 forum, because the q2, like the s1 and s1r and perhaps like the sl2, uses bluetooth low energy to provide a continuous connection between your smart phone and the camera, with wifi called into play when needed for remote viewing or review and upload of files. the q2 folks are not happy with fotos' performance at present. synch does better: i'd like to hold leica to a standard of getting fotos controls to work as well as panasonic's for the basic operations of time reference, gps, remote trigger, and uploading images. leica has the advantage of not having to do everything someone has ever told them was needed, only \"the essentials,\" so this ought to be a reasonable goal. i took my s1r out for an hour's walk this afternoon. before leaving i started synch on my(android) phone, without initiating either remote operation or picture review, just getting the bt-le connection going. i put the phone in a pocket once the display on the s1r showed bt and gps alive. it never showed any wifi, which was fine. all of my shots were accurately geo------> tagged !!! . one tradeoff that the lumix made is that the display stayed on for the whole hour, so keeping the bt connection alive and the geodata fresh apparently prevents going into standby mode after two minutes. but i had only used about 20-30% of the battery's capacity in the hour with 40+ shots taken.", "sortedWord": "None", "identifyer": 49839, "year": "2019"}, {"Unnamed: 0": 436911, "autor": "scott kirkpatrick", "date": 1564500060000, "content": "If you do run the RW2 through Adobe's translator, look for a set of lines following the opcode tag WarpRectilinear. You will also find those in the DNG files that Leica produces, fairly far down...", "link": "https://www.l-camera-forum.com/topic/299596-s1r-and-16-35-sl-combo/?tab=comments#comment-3787924", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "if you do run the rw2 through adobe's translator, look for a set of lines following the opcode -----> tag !!!  warprectilinear. you will also find those in the dng files that leica produces, fairly far down...", "sortedWord": "None", "identifyer": 50146, "year": "2019"}, {"Unnamed: 0": 437426, "autor": "jrp", "date": 1552832280000, "content": "A couple of other observations: Unlike the SL, The S1R has no built-in GPS, although there may be some way of getting GPS tags onto your pics through the phone app The M lens data is not captured by the S1R, which means that you need to apply lens corrections manually, afterwards in Lightroom", "link": "https://www.l-camera-forum.com/topic/294926-panasonic-s1-s1r-available-next-week/page/5/?tab=comments#comment-3704262", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "a couple of other observations: unlike the sl, the s1r has no built-in gps, although there may be some way of getting gps -----> tags !!!  onto your pics through the phone app the m lens data is not captured by the s1r, which means that you need to apply lens corrections manually, afterwards in lightroom", "sortedWord": "None", "identifyer": 50666, "year": "2019"}, {"Unnamed: 0": 437693, "autor": "thighslapper", "date": 1555017540000, "content": "To be honest when you get to comparing lens performance in this price bracket and optical quality you are into hair splitting territory. The 24-90 throughout most of its range gives most primes a run for their money ....... as Leica deliberately keep the apertures fairly modest to preserve optical quality. From what I can gather from reviews the Panasonic Pro 50 is broadly comparable to the SL 50/1.4 ....... which is not surprising as it has a 'Leica certified' tag. At these levels of optical performance I don't think there is any discernible difference in normal usage so I'm not that bothered which is closest to perfection. That's why I buy Leica Edited April 12, 2019 by thighslapper", "link": "https://www.l-camera-forum.com/topic/296134-leica-24-90mm-vario-elmar-iq-vs-panasonic-s-pro-primes/?tab=comments#comment-3720578", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "to be honest when you get to comparing lens performance in this price bracket and optical quality you are into hair splitting territory. the 24-90 throughout most of its range gives most primes a run for their money ....... as leica deliberately keep the apertures fairly modest to preserve optical quality. from what i can gather from reviews the panasonic pro 50 is broadly comparable to the sl 50/1.4 ....... which is not surprising as it has a 'leica certified' -----> tag !!! . at these levels of optical performance i don't think there is any discernible difference in normal usage so i'm not that bothered which is closest to perfection. that's why i buy leica edited april 12, 2019 by thighslapper", "sortedWord": "None", "identifyer": 50934, "year": "2019"}, {"Unnamed: 0": 452548, "autor": "Merv-O", "date": 1548515280000, "content": "The D-Lux typ 109's primary difference is in linear resolution (12.7 v. 16.8mm pixels). However, new typ 109's (at B&H/Adorama, e.g.) are about $900 versus the $1,200 difference for the DL7. I chose the 109 because the $300 allowed me to purchase a case, a hood and UV filter effectively completing my kit for less than a new base DL7. The DX numbers for both are quite similar. Both max out at 25600 ISO, both have the 150 electronic extra telephoto and most importantly, the identical and excellent f1.7-2.8 sum micron Vario-Summilux lens. I see little difference between the 13mp and the 17 mp for most prints up to 11 x 14. I use my CL or M series for the large crops as the little Leica is a tag along for non-obtrusive events. I have \"snuck\" it in to concerts on occasion where cameras are disallowed (it is after all the size of a phone)....nice little kit.", "link": "https://www.l-camera-forum.com/topic/292365-can-someone-talk-me-out-of-buying-a-d-lux-7/?tab=comments#comment-3671930", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "the d-lux typ 109's primary difference is in linear resolution (12.7 v. 16.8mm pixels). however, new typ 109's (at b&h/adorama, e.g.) are about $900 versus the $1,200 difference for the dl7. i chose the 109 because the $300 allowed me to purchase a case, a hood and uv filter effectively completing my kit for less than a new base dl7. the dx numbers for both are quite similar. both max out at 25600 iso, both have the 150 electronic extra telephoto and most importantly, the identical and excellent f1.7-2.8 sum micron vario-summilux lens. i see little difference between the 13mp and the 17 mp for most prints up to 11 x 14. i use my cl or m series for the large crops as the little leica is a -----> tag !!!  along for non-obtrusive events. i have \"snuck\" it in to concerts on occasion where cameras are disallowed (it is after all the size of a phone)....nice little kit.", "sortedWord": "None", "identifyer": 16150, "year": "2019"}], "name": "tagL-Forum2019"}