{"interestingcomments": [{"Unnamed: 0": 358792, "autor": "chasdfg", "date": 1545918660000, "content": "This is an interesting topic because I often feel the same way as the OP when I encounter such scenarios...but when I rationalise how I feel I always come to the conclusion I shouldn't have been so quick to judge. - Taking the first example: if I looked into a sony A7/A9 or leica SL EVF, or even a canon or nikon viewfinder (despite shooting nikon for many years before shifting to Leica), I can't confidently say I know what all the information in any of the EVFs/viewfinders means. Sure, sometimes shutter speeds should ring a bell, in that the same old numbers or 1/15, 30, 60, 125, etc come up. That is less excusable. In any case, it could well have been a well dressed man trying Leica in a store for the first time. I've gone into stores to try a Fuji GFX, bewildered by the buttons, knobs and functions. I'd like to think people wouldn't have judged me for being perplexed by the simple things. - As for looking at live view, I myself use livevew to compose using the built-in level, or to do more precise focusing when shooting up close, or when my eyes are tired and strained from looking through the viewfinder. For me it's another option to compose a picture. It's not the \"right way\" to use the M, but it's there. Speaking of seeing other people shoot Leicas, I love the feeling when I see someone else shooting a Leica when I travel, and when our eyes meet we nod to each other in acknowledgment. It has happened more than once and is coupled with a feeling of mutual respect or a silent understanding of some sort I cannot properly explain.. There are other situations where I see people with leicas, including plenty of \"influencers\" and those well dressed and sometimes fumbling, shooting Leica Q, SLs and Ms (though if money was no object, surely they should go for the S?). No silent, unspoken nods in agreement here. I think it is inescapable that the brand Leica is seen as a luxury brand, and if one can afford the most expensive bags, clothes and whatever else, they might well be able to afford the most expensive cameras, allegedly the \"best\" cameras because of the price tag. I've also observed that the \"laypeople\" who know of Leica and who spot me using one often say \"you must be a good photographer\", my reply being \"no i'm not, I just like shooting with it\" and that they should see my photos to judge me rather than judge me based on my gear. They often mention the prices of the lenses and how expensive the gear is and how much I've spent on my equipment, which I suppose is tied to the idea that money spent on the hobby is entwined with passion and/or also skill level (or the idea I am well-to-do, which I tend to distance myself from most). All this makes me feel like it discredits me as a \"photographer\" and elevates those who are less emotionally or financially vested in the brand to be deemed as \"photographers\" (financially in the sense they could afford it without contemplating for months whether to buy X or Y). It took me a long while to reach a level (in terms of ability and finance) where I felt appropriate to dip my toes into the world of Leica and longer to acquire the lenses I use today. I also know i judge begrudgingly on first sight because I know the depth of my passion, which itself only skims the surface of those who are even more emotionally vested in this brand and who can appreciate things far more than I can..and here we have people who appear to know nothing of this historical brand touting this great gear pretending to be \"cartier-bresson\". And when I don't share any silent understanding with the user, the lack of nods in agreement and subtle smiles act almost like confirmation of my judgmental thoughts..that they don't understand me and the brand like how me and the others do. Then I look at myself and think that in the world of wine, watches and cars, I know so very little, and when I eventually dip my toes there I'm likely to be fumbling too. Edited December 27, 2018 by chasdfg", "link": "https://www.l-camera-forum.com/topic/292641-do-you-assume-a-certain-level-of-knowledge-of-a-leica-shooter/page/2/?tab=comments#comment-3653802", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "this is an interesting topic because i often feel the same way as the op when i encounter such scenarios...but when i rationalise how i feel i always come to the conclusion i shouldn't have been so quick to judge. - taking the first example: if i looked into a sony a7/a9 or leica sl evf, or even a canon or nikon viewfinder (despite shooting nikon for many years before shifting to leica), i can't confidently say i know what all the information in any of the evfs/viewfinders means. sure, sometimes shutter speeds should ring a bell, in that the same old numbers or 1/15, 30, 60, 125, etc come up. that is less excusable. in any case, it could well have been a well dressed man trying leica in a store for the first time. i've gone into stores to try a fuji gfx, bewildered by the buttons, knobs and functions. i'd like to think people wouldn't have judged me for being perplexed by the simple things. - as for looking at live view, i myself use livevew to compose using the built-in level, or to do more precise focusing when shooting up close, or when my eyes are tired and strained from looking through the viewfinder. for me it's another option to compose a picture. it's not the \"right way\" to use the m, but it's there. speaking of seeing other people shoot leicas, i love the feeling when i see someone else shooting a leica when i travel, and when our eyes meet we nod to each other in acknowledgment. it has happened more than once and is coupled with a feeling of mutual respect or a silent understanding of some sort i cannot properly explain.. there are other situations where i see people with leicas, including plenty of \"influencers\" and those well dressed and sometimes fumbling, shooting leica q, sls and ms (though if money was no object, surely they should go for the s?). no silent, unspoken nods in agreement here. i think it is inescapable that the brand leica is seen as a luxury brand, and if one can afford the most expensive bags, clothes and whatever else, they might well be able to afford the most expensive cameras, allegedly the \"best\" cameras because of the price -----> tag !!! . i've also observed that the \"laypeople\" who know of leica and who spot me using one often say \"you must be a good photographer\", my reply being \"no i'm not, i just like shooting with it\" and that they should see my photos to judge me rather than judge me based on my gear. they often mention the prices of the lenses and how expensive the gear is and how much i've spent on my equipment, which i suppose is tied to the idea that money spent on the hobby is entwined with passion and/or also skill level (or the idea i am well-to-do, which i tend to distance myself from most). all this makes me feel like it discredits me as a \"photographer\" and elevates those who are less emotionally or financially vested in the brand to be deemed as \"photographers\" (financially in the sense they could afford it without contemplating for months whether to buy x or y). it took me a long while to reach a level (in terms of ability and finance) where i felt appropriate to dip my toes into the world of leica and longer to acquire the lenses i use today. i also know i judge begrudgingly on first sight because i know the depth of my passion, which itself only skims the surface of those who are even more emotionally vested in this brand and who can appreciate things far more than i can..and here we have people who appear to know nothing of this historical brand touting this great gear pretending to be \"cartier-bresson\". and when i don't share any silent understanding with the user, the lack of nods in agreement and subtle smiles act almost like confirmation of my judgmental thoughts..that they don't understand me and the brand like how me and the others do. then i look at myself and think that in the world of wine, watches and cars, i know so very little, and when i eventually dip my toes there i'm likely to be fumbling too. edited december 27, 2018 by chasdfg", "sortedWord": "None", "identifyer": 19973, "doc": "b'x\\x9c\\xed]\\x07\\\\\\x13\\xc9\\xf7\\x07\\xcf\\xde={;9\\x1b6P\\xe4\\xf0\\xf0\\xee, \\x16,\\x80\\x14+\\xa7\\x84d\\x03\\x91\\x90\\xc4l\"b\\xaf\\'z\\xf6\\xae\\x88J*\\xcd\\x86\\x8a\\xf5T\\xec\\x87b?\\x95\\xb3\\xf7;\\x15\\xfb\\xd9\\xcb\\x7f\\x16\\x19\\xcb\\xd3\\xf91q\\xf7\\xbf\\xe8\\xfd~\\xf9|2\\xdf\\x9d\\xec&\\x93\\x99y\\xf3\\xde\\x9b7o\\xdeL\\xb4\\x0eb\\xb4\\xacB\\xad26sv1Kt:-\\x1b\\xe7\\xd1\\xce\\xbbs\\x97\\xae\\xdd||\\xfd2\\xedwf\\xda\\xef\\xca\\xb4\\xdfm\\xd1\\xa9#\\x18\\x15\\xbb\\xdb\\xce\\xbe\\xf7\\xfan\\x8d\\xe7N9t9\\xb5:\\xc4\\xfev\\xaf_\\x0b.\\x1a\\xab\\x0f\\x8f\\xbbpt\\x99\\xfd\\xeb|\\x01\\xbb\\xf7_\\xf6\\x00\\xf1K\\xff\\xe0\\xf69\\xa7\\x83\\xfa\\xf28\\xef\\xb9\\xfefe\\xd9\\xa0^M1><g\\xfe&\\xa5Y\\xa5\\xe9=s\\xef\\x7f\\xfd\\xe2\\xeb\\xc4\\xd3=\\xbd\\xd3\\xbb\\x1e\\x1a~\\xdb\\xb4\\xf3\\xf2@X\\x0e~\\xbd\\xca}\\xe1|\\xf0\\x89\\x07~}o\\xde\\xeb\\x85\\xf3\\xed\\xbb/\\x9f\\x19\\x177\\xe90\\xc4>\\xa0>K\\x08\\xf5\\xc1yX\\xce\\xf6\\x9es{T\\x9b*\\x8d\\xc6y\\xb3Cp\\xbb]\\x8a\\xb3s \\x06\\xe6\\xde\\xcfZ^pg\\xcc\\x9e\\xe8\\x993\\xf3h7XN\\xd8\\xab\\xea5\\xe3\\x8f\\xd4fq\\xfe\\x92a\\x05\\xb3*\\xc3\\xa7\\x1c\\xc4\\xe0\\xdc\\xfb\\xa9u\\xf7vLn=\\xf0\\xd8lB9/^\\xbd\\xff\\xc2\\x9f7\\xddv\\xf6i\\xed\\xef\\xd6-zS\\xef3\\xfd\\x8eM/\\xfc\\xe3\\r\\x88\\xa1\\xb9\\xf7k\\xc9\\xfbe7\\x0f\\xbdU\\xceJ(\\xe7+B}\\xf6\\x02\\xc2\\xa8U\\xeb\\x9c\\xa6\\xee\\xcc-\\x1d0nm\\xef5\\xf0\\xd5\\xfa\\xca\\x1e\\x98\\xdeN\\xd7k\\xd3\\xd4\\xe1\\xe1/\\xbf\\x91\\xe8\\x8d\\xd4?\\xb7|6\\\\\\xbf\\xb9\\xe8\\xd1 \\x9co\\xdb\\xc0nU\\x8b>\\xf2(\\x88=r\\xef_\\xdct\\xb9Y\\x87r\\xde\\x05\\xa6\\xdb\\xd8?\\xb0>\\xa5\\xaa\\x0e.\\x98}f\\xb9/DY\\xee\\xfd\\x05\\xcf\\x02\\x9a\\xf4\\xd5\\x8d\\x1b9\\x8dP\\xce\\x13B\\xfft\\x8a\\xfb\\xc5\\xef\\xe0\\xad\\x12\\x8e8?s!\\xebf\\x91\\x97\\x0e\\x83\\xc8\\x97\\xaeo\\xcd+\\x1b|~}\\xda\\x13\\x9c\\xf7\\x8a\\xed\\x17q\\xf8Pv\\x18D\\xa1\\xe9z\\xb2e\\\\\\xd9\\xde~\\xba\\xfe\\x10!]\\xa7\\xf0\\xa4\\xeb\\x8b\\xe9\\x86\\xfe\\xb5g}\\x1f\\x061(\\xf7>\\xa6\\xebM\\x84r^\\x11\\xca\\x81t\\xc0\\xb7\\x7fH\\xed\\x06\\xfbgFdq\\xd5\\x95\\xea\\xdf\\xdd\\x85\\x08\\xdbm\\x1d\\xa1\\x9c\\x97\\x94\\xed\\xb6\\xe7X\\xa9[\\x0bN\\xf6;\\x05\\x11\\xf3\\x83nY\\xcd\\x1d\\x1f\\xcei~\\x9f4~H\\xf4&4? \\xb6\\x1b\\xe0\\x07\\x8b\\xf7\\xf5\\xfd\\xbe^\\x91\\xe4\\xe6\\x10i\\xc7\\xe9#\\xcaq\\xeaT\"\\xc9\\xee\\xda\\xf6Gk \\n=~6\\xfeZqeT\\xa1\\'\\xa30&\\xed\\xbf\\xd7qB\\xdc\\x98\\xcd\\x98\\x0e\\x86v\\xadY\\xa5P\\xf7s\\xc5\\x97\\xdaH\\x07%\\x06\\xcfmQxc\\xd1\\xaa8\\xef\\xba5(\\xb2\\xcd\\xbd\\xec\\xb9\\x10%\\xb9\\xf7\\xe7\\x96h\\xb2\\xdcoV\\x89\\xa5\\xbf\\x11\\xca\\xc9\\xa6\\x1c?\\xfa\\xe4\\xa6mU=\\xbe\\xce\\x80\\xd8;\\xf7~#\\xa7~\\xa1\\x1eu\\xb2\\xee\\xcf#\\x94s\\x93D\\xd7\\tm\\xbc\\xfbu\\xcb\\xaa\\x8f\\xf3\\xff6\\xba\\xde9c\\xc2]\\xa7\\x1a\\xd5M\\xe37\\xb9\\x85\\x94\\x9ah\\xd8\\x81\\xf3\\x90\\xae\\x17\\x12\\xca\\xf9\\x9b\\x92\\xae7\\xfa\\xc7&\\xeeZc\\xbc\\x08\\xf1Km7Z\\xb9=\\xdfF\\xf9\\x03\\xdbM,}\\xa7\\xf6\\xc0\\x0b)\\xd9\\x1b\\xa3\\xeeA\\x14Z\\xdf\\x19?\\xf2~\\x9dFAVo\\x88B\\xb7\\xdb\\xf4\\'\\x0e\\xf6\\xa9-\\x17\\x7f\\x07\\xf1K\\x95\\xdb\\xbd\\\\\\x0bN\\x98\\xb1\\xffZ:D\\xa1\\xe56_z+H\\xaa\\x0f\\xa0\\xb7\\x8d\\xdf\\xf7\\xd8\\xd1w\\xff\\x89\\xa9\\x10\\xdf\\xcc\\xe7\\xe6\\xd6H[\\xb9\\xcc\\xf7\\xc2\\x1c\\x1b\\xe7\\x0b\\xdb3\\xfb\\x1e\\xaaW`\\xe1\\x1b:(k\\\\\\x91\\xbe\\xaeXp\\x8d\\xb5q\\xf3=\\x8b\\xefmQ\\x18c\\xbf\\xdc\\xfb\\x98\\xae\\x13m\\x1c?\\xc5\\xee%\\xec\\x1b\\xf8\\xa2L{\\x9c\\xff\\xfa\\xc0\\xc6\\x8bm\\x1e]\\xdd\\x07\\x11\\xd7\\xa7\\xdf\\xba\\xe8#\\xb5\\xb2\\xca\\xee\"\\xd5\\x87D\\x07\\x87:\\xf8+\\xef>\\x8dr\\xc7\\xf9\\xa6\\x8e\\xe9;\\xffn\\x9f\\xb6\\x0c#\\x9c\\x077\\xef=Sr\\xffx\\t\\xb7\\x1d\\x84r\\x9e\\x11\\xe8 \\xde\\xc3=\\xaa\\x9c\\xa4\\xd4R\\x9cW{\\xa5\\x84\\xa8\\xdd\\xb7N\\x80(4?(c\\xed\\xb6\\xbbTBJ\\nD\\xa8\\xefL\\xb5\\x91\\xae\\xa1\\xbeC\\xe2\\x07\\x98\\x0e\\x9a\\x1c\\x92u\\x9ct\\xcf\\xda\\xcd\\xd6\\xfe\\x81\\xf5Y4k\\xc7\\xf4+\\xa1\\x0b\\xb6A\\xc4\\xfc\\r\\xd3\\xc1v\\x1b\\xeb\\x03\\xe9\\xc0\\xb0=\\xa5\\xeb\\xcd\\xac\\x91+ J\\xc0}\\x92^u\\x9cPN\\x13\\xff!\\xf2\\xfe\\xfdb~\\xc6\\xf9\\xb5\\xab\\x16\\xce\\xa9dWd$DZ\\xfd\\x8dd\\xdf\\x81\\xed\\x96\\x1e\\xb7\\xf9\\xa7v\\xab\\x83\\xdbbT:{\\x8c\\xc9~\\xee\\xde\\x0f\\xb7\\xdb\\xf4\\x9b#\\xbb\\xb9{u\\xaeH\\x92\\x0b\\x8ds\\x11\\xd6\\xe7U\\xfd\\xbe\\x87\\xda\\x0e9q\\x08\\xe7\\xc5\\x9a\\x07\\x8fS\\xdc\\xd8\\x91\\xb8u\\x9e\\t\"I\\x8f\\xc7\\xfcl\\xb2\\xfd\\xfb\\xed\\x95\\x17]\\x1fq\\xfbz\\x8f\\xb4\\xd2\\xb0\\x92\\x10\\xa1\\\\ \\xe9\\xf1\\xb4\\xf3`\\xdc\\xcf\\x10i\\xe9\\x003\\xe4\\xbc\\xc6O\\xe9;\\xd32\\x8a?\\xdf\\x94\\x02\\x91\\xd6\\x8e\\xf4\\xb9\\xe9\\x89#\\xb2\\xbd\\x1fJ\\x0bN\\x1e\\x8b1#\\xe9\\x9f\\x1ac\\xcbH\\xcfa\\xba\\xfe\\xcb}\\xe8\\xda\\xf1\\xa1\\xeal\\xd2\\xbc\\xb1.\\xa1\\x1c\\xcf\\x15s\\xe3\\x8a\\x7f\\xd7\\xe7%\\xce?\\x8c\\xf0\\x08r\\xcb\\x18\\xe9\\x04Qh}\\xa7Q\\x97\\xb0\\x87\\xab\\xaf46C\\xa4\\x1d?$\\xfd\\x00\\xdaG\\xe7\\xd6<\\xdbk\\xeb_\\xc7\\xa7C\\x0c\\xc9\\xbd_\\xee\\x87\\x13\\xdb.\\x8du9\\x95\\x04\\xc6\\xcfH\\x90\\xcf\\x8b\\xae\\x8bE7\\x08\\xb8\\xd5\\xa9\\xef\\r\\x88\\xa4rps\\x8c\\x04\\xf5\\xcb\\xab\\x1cE\\xf9\\xb0=\\xf7\\x9d~\\xac\\rQ\\x9a{\\x1f\\xe3o\\x84rh\\xe5\\x8fG\\xe3V\\x7f\\x07\\x1c\\xeb2\\x1d\"\\xac\\xcf:B9$\\xfd\\x00\\xd6g\\xf3\\xe9\\x96\\x0b\\xa2:\\xff\\xed\\n\\x91v\\xbeM\\xa278\\xdf\\x0e\\xd6\\x94\\xd2\\xfa\\xa6\\xcfPA\\x84\\xf5\\t\\xe8\\xe2X\\xfb\\xe1\\x96d\\t\\xee\\xf716\\xf6\\xcf\\x86Y\\xb5\\xb2\\x83\\xfa\\xef\\xa9\\x01\\x91T\\x0e-?\\x80\\xe5\\x8c}>~\\xc9\\xecus^@\\x84\\xe5\\x90\\xe6\\xdb\\xcf)\\xfbgC\\xa5j\\xbfN\\xc9~^\\x07\\xa2\\x04\\xdc\\'\\xf1kR\\xff\\xdc\\xfej\\xf6\\x8aC\\xa5\\x87\\x1e\\xc5y\\xbet@\\x9c\\x97\\x00:\\x18\\xd0\\xfe\\xe4Fw\\x9f\\xf8;\\x10i\\xf5QZ\\xb9\\xc0\\x97\\xbf\\x91\\xe8\\x00\\xf2\\xb7\\xe5\\x8f\\xbe\\x9e:\\xdc\\xaei&D(\\xb7It\\xf0\\xb9\\x8d\\xd3b\\xfb\\xcb\\r\\x98\\xb5er2D\\xa8\\xef\\xd8:~\\xa0\\xbe3a\\xf6\\xcc\\xf2_\\x8d\\xd0H \\xd2\\xb6\\x1b\\xad\\xbe\\x93v8M\\x93YE\\xbe\\x02\"\\x1e?e\\xda\\xb0?\\x14\\xdb>(;/\\xbd\\x17\\x96\\xa3\\xba\\xb8|\\xd6\\xaec\\x1b\\xcf\\xe0\\xfc\\x90B\\xd1\\xb2,\\x8f\\x92\\x83 B}\\x87$\\xb7IvKH\\xd7c;6\\xdby~\\xf8\\xa8\\xc5\\x18G_nV2\\xc8\\xa9\\xc27P\\xbfN\\xb3\\x91\\x0e\\xa0~M\\xa2\\x83\\x90\\xdc\\xfb\\x98\\xbfa}\\x14\\xcam\"\\xbd\\x81\\xfe\\x19i\\x8e\\xbc|\\xa6\\xf0\\xf4\\xb3\\x10i\\xf5\\x1d\\x12\\xdf\\x81\\xed&\\xed\\xbd\\xc8\\xd7i\\xe2\\xe5_ \\xe6\\xa5\\xc7O\\xb0Q\\x8fO/R\\xb1QF\\xcc\\xe6\\xb1\\x18\\xb3\\xd2\\xaf\\xee\\xed\\xd6\\xdfx\\x00\\xda\\xe3\\xa1\\xdc\\xc6\\xe5\\xd0\\xda\\xe3M\\xf3\\xbf\\xddY>\\xaej\\x1cD\\xdav#\\xf1\\x1d\\xd8n\\xad\\x0e\\xacN*\\x17\\xb1\\xf1%F\\xefdY\\x81=K\\x0e\\xa9\\x85\\xa67\\xb1\\xec|\\xb4z\\x08\\xc9\\xfeFK\\xd7\\xb1\\xbb6\\r\\x99\\xb8\\xd5\\xdf\\r\"\\xe6;\\x15\\xff*8w\\xe9,\\xf7\\xda$\\xbe\\xf3\\x90PN!\\xb7=\\x17\\xe6\\x16f\\xf1\\xf4\\x86\\xb7~P\\x08\\xd4\\x0b\\x7f\\x0e\\xf5\\x03\\xb1\\xec\\x89\\xe7\\x86\\x14\\xfa\\xf5e\\xe3\\x8a\\xe9s\\x8e7r\\xec9\\xa2B0F\\xbe\\xf6\\xc4\\x04U\\xe4\\xa3F\\x9e\\x133p^,{\\xe2\\xdeFW%\\x9d\\x1b\\x1el\\x01Qh\\xfb[u\\xd7r\\xe7\\x12{\\xc5\\x0c\\x86\\x08\\xedU\\xb6\\xfa\\xd5@{\\x95X\\xf3\\xed\\x02QG\\x1an\\xda\\xa3\\x8b\\x80H\\xbb\\xbe@\\xe2\\xa3p}\\xc1\\xce\\xed\\xdbV\\xdbLa\\xdd!\\xe2\\xfa\\x14\\xf7_\\xf6\\xadv\\xc7&O\\x92\\xdd\\xa5\\x04\\xa1>\\xb0\\x7f\\xee^n\\xe1pap\\xe5\\x8d\\x10\\xb1>z\\xf6\\xd6\\x93_O\\x9f\\xda\\x15\\xe6p;\\xaaDX\\xeb\\xab\\xeb?U\\xef\\x15k\\x1dc\\xfaD\\xc5\\x8e\\xefG\\x95\\xee\\x06\\x11\\xeao$:(J(\\x07\\xf2Qi\\xea\\xa9YN[R\\x1aB\\x14Z.\\\\N\\x9cyam\\xf0\\xe04\\x88\\xd0\\xff\\xcdV\\xb9\\x00\\xcb\\xd9\\xb2!h\\xf7\\x85\\x0b]JB\\xfc\\xdc\\xd6\\xb3H|\\x14\\xd2A\\x9b\\xe0\\xaf\\x14\\x91\\xa66\\x0f \\x86\\xe4\\xde\\x87v\\x17Z\\xba\\xe6kw\\xf9T>\\xba\\xcb=\\xd4\\xbdo\\x8d\\xe3g1\\xc2y\\t\\xd4\\xdfh\\xe7\\xf5P\\x7f+\\xecVm\\xc3\\xde\\xe9\\xab_`\\xac7\\xecT\\x93n\\x1e\\xee\\'1\\x7f\\xc3~\\x90$\\xfe\\xf6\\x80P\\x8e2\\xb8\\xc0\\xf5\\xcam\\xae\\xad\\xc5y\\xbe\\xeb\\x0bw\\t\\xe5\\xc0\\xf5\\x85\\xa5\\xe75e\\x87e\\xa8\\x1bB\\x84\\xfa\\xb5\\x99PN\\xe1\\\\\\x84\\xeb\\x0bP\\xbf\\x16K\\xdf\\xf1t\\xf2\\xae7\\xf5\\xb1\\xac!DZ\\xb9M\\xd2w \\xbd)\\x02\\xd2n\\x8d\\xf9C\\xf1\\x04\"\\xe4\\xa3|\\xedU\\x7f\\xda[&\\x8d\\x91\\x9c\\n\\xc38Zy\\xda\\xf5\\xf0\\xb3\\xa0\\xed\\x90\\xaem\\xf5?\\x80t\\xcdw=\\x98hw\\x01\\xeb\\xc1!uk\\x05x\\xce|\\xa8\\x85(\\xb4\\xbe#\\x96\\x1d\\xa9{\\xa5\\xdf\\xb2\\x06\\xb6>!\\x87H\\xbb\\xfeC\\xeb\\x17\\xc0w\\xfc\\x90\\xec.p\\xfc\\xf0\\x95\\xdb$>\\n\\xc7\\xcf\\xa9\\xe5V\\xc9\\xc5\\xde\\xbf\\xff\\x04\\x11\\xda]\\xf8\\xcam\\xb1\\xe4)_\\xbf[\\xd28\\x85|\\xd4\\x7f\\xc16\\xe7?7\\xe8kC\\x14\\xda?\\xb1x\\x8d\\xcd\\xaaWG\\xa7\\x9f\\xc7\\xb82\\xf7\\x8b\\xb4\\xf2\\x94d\\xa7\\x80|G,\\xfb\\xa8\\xef\\xf8\\xd5\\x9ec\\x7f\\x9a\\xd2\\x17\"\\x16\\x84\\xc1\\x0e\\xe5\\xd7\\xdf\\x18v_\\x87\\xed\\x96\\xb8\\xdf\\xa7\\xe4a\\xdfI+V+v\\xfc:\\xd7J8/\\xd68\\xad\\xf0\\xdd\\xf8\\xcb\\xfd\\x0e\\x04>\\x84\\x08\\xeb\\x93\\x02\\xea\\x83\\xedU\\xa4q*t}Ht\\x00\\xebS\\xae[\\xe1o\\xe7\\xfd6\\xf62DX\\x9fY\\x84\\xfa<\\x15\\xa9>$\\x7f\\x7fX\\x1fsB\\x85\\xb8Bg2\\xb5\\x10\\xf3\\xaa\\x0f\\xa6\\xb7\\xc7\"\\xd5\\x87\\xe4\\x17\\r\\xeb3\\xba\\xdc\\xa9\\xe4\\x8d\\'\\xeb\\xf9Adr\\xef\\x8f\\x7fR}\\xfd\\x92\\xb9[\\xfe\\xb0\\xd5~\\xb0!\\xd2\\xc5\\xbe\\xd9\\xe3\\xa2\\xa7q>/\\xffD\\xac\\x1f\\x90\\xd6\\x17H\\xf6x\\xa8\\x1f\\\\\\x9a1\\xff\\xc1\\xc3\\x1e\\xe3\\xbf\\x81\\x88\\xe5\\xdc\\xe9\\xb1\\x03\\xadi\\xc5\\xbe\\xeb\\xbf\\x99\\xa7\\xfc\\xe1\\xab\\xc7_\\'\\x94\\x03\\xf5x\\x92<\\x85\\xf3\\xe0/e\\x1f\\xd8\\xc34U\\x8f\\xab\\xfb\\x9b\\x14\\x85\\x88\\xf5\\xf8\\xf0}I\\x19\\xf3X\\x9fj\\xb6\\xda\\xdf\\xa2\\x1e\\x87\\xdd\\xe9\\xef\\x1b\\xbb\\xedM\\xbb\\xfd2\\xf9a\\xe5\\xfd\\xaek \\n\\xed\\xff\\xc6\\x97\\x0eHr\\x01\\xd2\\x01_\\xfd\\r\\xdbw \\x1d\\xd0\\xda]\\xf8\\xea\\xd7\\x1f\\xf8#Utu\\xd2<\\x9a\\xac\\x81(\\xb4\\xdf\\xadX\\xf3S\\xc7*\\xd9%\\x0f\\x94\\xaf:\\x15\"_{\\xfc\\x861A\\x83]\\xeb\\xef\\x88\\xc1\\xf9t\\xc3\\x93+1:\\xbbp\\x88B\\xfb\\xf7\\x06;\\xbb\\x0f\\x88\\x99t\\xb05D\\xbe~\\x01p\\xfc|n\\xfe\\xbd\\xb6\\xf27\\xe8\\xdf\\xcbw~J\\xec\\x1f0?\\xe5\\xdb?\\xb4\\xf3\\x85\\xa0\\x88\\xde\\tYN\\x0bc1\\xeeH\\xa8\\xd6mQP\\xd6*,\\xb7q\\xbb\\xd9:/)Tbk\\x856.O&\\xe1\\xbc\\xd7\\x8b\\xa7\\xab\\x9cGWj\\x0c\\x91v?-\\xad\\xff\\xce\\xf9\\x85+5\\x01\\xb5\\xb7w\\xc6\\xb8\\xfcJ\\xf5\\xb3\\x8b.\\xef\\xf1\\x84\\xeb\\xa7$?\\xefW\\x84r\\xe0\\xfa)\\xed\\xba&\\xc9~@*Gh{<\\xedz\\xbdXv\\x17}1CE_\\xfb\\x13\\x0cD\\xa1\\xe5\\x02_?\\x07R\\xff\\x08m\\xa7\\xf8\\xdc\\xfc\\xa2\\x97\\xae=\\xd2\\xd5n\\xbd\\xdfP\\x88\\xb4\\xfdC\\xeb\\'\\xc4W\\xaf\\xbaG(\\x07\\xeaUB\\xed\\x03\\x83z\\x15\\\\?]\\xe3_\\xd5\\xa4\\xef5\\xa2!\\x96o8\\x8f\\xe5\\x0f^?\\xb5U\\xce\\xf9\\xdd)\\xbf\\xb3\\xe8\\xe4a\\xbbp\\xfe\\x9ft\\x9f):\\xcd\\xb4\\x1f16<x56\\xf6qE5\\xe4\\xd7\\xb6\\xca9\\xc8\\xaf\\xc5\\xf2\\x8b\\x9e\\xec\\x93v\\xf2\\xbe*f9F\\xc8\\x0f\\xf2\\xb2W\\x91\\xca\\x81\\xf6*\\xb1\\xf6\\xb1`y\\x03\\x11\\xce\\x83I~\\xeb$9\\'\\xb4\\x9d\\x9c\\xc4w \\xbf.\"1\\xf7Z\\xae\\x8du\\x86\\x18\\x92{_(\\xff^m\\xbbA\\x92u\\x8d\\xaa,\\x81\\x08\\xcb\\xe1\\xbb\\x1fC,\\xff\\xde\\xa3\\x86\\xab#tO\\xdcZ`\\x8c\\xe8*\\xfdy\\xeb\\x99[#\\xe18%\\xe9!$9\\x07\\xc7\\xa9\\xfb\\xe8\\xf0m\\xc75\\x96\\xbf \\xc2q:#\\x9f\\xe5\\x1c\\x89\\x0e\\xa0\\x9c\\xbb3]\\x13\\xbaa\\x8d\\xf51\\xc6\\xd8\\xf9\\xd7\\xf7\\xf4\\x1eQw%-?\\xa0\\xf5\\xe7\\x13\\x8b\\x0et\\x86\\x9d\\x95MG\\xebo\\xc3\\xe8\\xd6:p\\xef\\xabzg\\x1e\\xc2\\xfa\\x90\\xecb\\xb4\\xf5\\xf9\\xa3\\xe3i\\xc7\\xc9N\\xabjA\\x14\\xda\\x1e\\xdf\\xf0\\xe6\\xef\\xea\\x8d\\xf2M\\x171>\\x8e\\xd9\\xf6O\\x0b;\\x9f\\xa2B\\xd7\\x87\\xaf~p\\x9bPN~\\xe9\\x07U\\xf7\\x84%x\\xdd\\xfd9\\x16\\xe3\\xd9\\xd1\\xde\\xbb\\xbe\\xddP\\\\\"\\xf4:\\xed/\\xed\\xffXX\\xbd\\xc3\\xc8\\xe7\\x10\\x85^\\xa7\\x15K\\x9e\\x96<#\\xbd\\xd0\\xe8N\\xf3\\xeb\\x10\\x85\\xde\\x17Z\\xb2\\xf8\\xcc8\\x95$T\\x01\\x91v\\xbd\\x9ed\\xdf\\x81t\\x8d\\xfb\\x1d\\xe2\\xff\\xf6o\\xff\\xe7\\xfeiu\\xb0r\\x9fi\\x9a\\x86\\xf51\\xc2\\xfd\\xc1X\\x9e\\x92\\xfcwH\\xebYP\\x9e\\x8er\\xeb}`\\xfb\\xe9\\x98\\xe7\\x18I\\xfc\\xc0\\xd6y\\xfd7O\\xfa^<[\\xb3l\\x17\\x9c\\x17\\xcb\\x0f\\xbf\\xd8\\xb9\"7\\x8e\\x8e\\xac\\xd1\\x02#\\xb4\\x8ba{\\xc8\\\\\\x1b\\xfb\\xe7\\xee\\xbc\\x86\\xe1\\x8b+\\x1f\\\\\\x87\\xf3\\xe1q\\x13\\xfd[\\xb1\\x97\\xcab\\xbcl?cd\\xfc\\xfe\\x82W`\\xff\\x90\\xfc\\xd6\\xffm\\xfa\\x0e\\xed\\xbc\\xfe`\\xab\\x9f]\\n\\xd7[\\xb9\\x1f\\xa2\\xd0~\\x01n5k\\xceM\\x1a\\xb7\\xcb\\x05\\xe3\\xe6\\xad=\\xc6U\\xd9\\xe8_\\x9bV\\xaf\"\\xe9\\xd7B\\xcb\\xed;\\x84r\\x84\\xde__\\x1c\\xb4\\x1f~A:\\xe0\\x1b\\xc7\\xacX.\\xe6Eob\\xd9\\xab\\xfe\\xaa\\xebo\\xf8E\\xbe\\xf9\\x08F\\xb8\\xafZ\\xa8\\xfd%\\xf2\\xa2\\xabZ\\x95\\x9dt=\\x1e\\xa2\\xd0\\xf5\\xc9\\xaeZ\\xfdd\\xf1fS\\xb6A\\x14z\\xfc\\xa4\\x8e\\x9a\\xf6\\xac\\xf6\\xce\\xef\\xeaB\\xfc\\xdc\\xd6\\xb3H\\xfa\\x81\\xd0\\xfbK\\x88\\xfc\\r\\xe8\\xbd/\\xfaWm\\xb9\\x7f\\xad\\xfb7\\x10a9\\xb3l\\xa4\\x83\\xee=\\x9ae\\x06\\xa5\\xf7\\xc2\\xdb\\x01\\xec<B\\xea\\xadK\\x88\\x92\\xf5\\x87\\x08\\xf7/\\xd8\\xaa\\xf7\\xc2\\xfd\\x0bG\\xd7\\xf5\\xf0\\xd93\\x7f_\\x01\\x88\\xb4~\\x83\\xa4\\xfa@:\\xe0\\xbb?\\x8bV?\\xa8\\xda\\xe9+\\xaf\\xed\\xd7G\\xff\\tQh\\xfb\\xdb2\\xe6^\\xfa\\x931W/a\\x84\\xfd\\x83\\xf9\\x0eI\\x8f\\'\\xd9\\xc5\\x84\\x8eSB\\xdc7\\x05\\xe4\\xf6\\x92v\\x9d\\xaf\\xf7q\\xd6\\xff\\x84\\xb1\\xe7\\xecI\\x1d\\x07\\x0eO=A\\xbbnF\\x1a\\xa7P\\xdf\\xc9K\\xce\\xbd\\x98r<#\\xb3\\xba\\x9d\\xd6V;\\xc5\\x91e\\xce[gO\\xcc|\\xe3\\xb7\\x9e\\xd7:S^~5\\xb4\\xf4\\xb6\\x7f\\xea\\x15\\xa7\\x01\\xfev\\x87!\\xd2\\x8e\\x1f\\xda\\xfd\\xdb|\\xf9(\\xc9/M\\xe8}\\xfc$\\xbf4hw\\x11k\\xbemY\\xaa.5m\\xfb?5!\\xd2\\xfaq\\x91\\xfc\\xd2\\xe0|\\xee\\xb6\\xc33?\\xbb\\xfa\\xcfjB\\x14\\xdaO(\\xa0\\xe0\\xa1\\x00\\xff\\xe7A\\xf1\\x10\\x85\\xd6\\x0f\\xa6+\\x9a\\xdc\\xeb\\xbc/\\xa4\\x16\\xc6M\\xdeC\\xae\\\\\\xaaz+\\x05\\xf27[\\xed\\xd7\\x90\\xbf\\xf1\\x8d\\xa3IK\\x07\\xb4\\xfb\\xdeI\\xeb\\x18\\xa4q\\n\\xeb#\\x96?\\xdf\\xd6\\x80\\x12\\xad\\xa4\\xd1\\xc7/A\\xa4\\xf5\\xa7\\xa0\\xe5o|\\xf9\\x0e\\xc9\\x7fTh\\xbeC\\x1a\\xa7B\\xc7m\\xa5\\x8dO\\xbe\"9\\xbd\\xec\\x10\\xcf\\x06_A\\xc4zb\\'\\xbf\\x03u\\xf6JB\\xdd\\xd7\\xdbH\\xd7\\xdeC{\\x9e\\xd8V#\\xf5{\\x9c\\x9f\\x1cw2\\xf6\\x976\\xea\\xdb\\x18\\xbd\\xc7\\xaf\\xcc\\x1cg\\xb8\\xd3\\x88\\xd6\\xceG*\\x07\\xea;[^\\xcdm\\x12\\xa1\\x99\\xde\\x1e#\\xb4\\xbb\\xe4\\x15\\x1f\\xf6>\\xa1\\x7f\\xe0zp\\xf2O1\\xb7g\\xa7n\\xe9\\x0c\\x91\\xd6\\x0f\\x924~ \\x7f\\x13k}a\\xce\\xaf\\xcaRs\\xbcSU\\x18\\x9d;\\xad\\xee:\\xff\\xa7@7\\x18\\xf7\\xcb\\xd6\\xf5\\x05\\x18\\xf7+\\xd1\\xb5W\\x83\\xe1\\xc6\\x15J\\x88_\\xea|\\xbbu\\xb2WY\\xf3\\xea\\xcc\\xe7\\x10?7\\x7f\\x17\\xdau@\\xdax5|\\xe7\\xdb|\\xedUg\\x08\\xe5@{\\x15_\\xfb\\x0e\\xe6\\xa3y\\xd9\\xabh\\xed\\xd7\\xb6\\xce\\xe7\\xa0\\xfd\\x9a\\xaf?,\\x89\\x0e\\xa0?l\\xa5\\x17+\\x8d\\xf2\\xa6\\xcf/a\\xfc\\xff\\xf2[\\xcf\\xdew\\xa6\\xef\\xa3\\xc7Wd\\x10\\x85\\xf6\\x8b\\xde\\xf9{AMzdZ\\r\\x88\\xb4~\\x90\\xb4t-\\xd6|\\x81d?\\x80\\xf3\\x05[\\xfd\\x1c\\xf2k_h\\xe6\\xa5l\\xdf\\x9beN\\x8e\\x82(\\xf4\\xbeP\\xbe|\\x874o\\x84|G\\xa8q\\n\\xf9N~\\x8dS\\xb8\\x9ei\\xeb\\xba&\\x89\\xbf\\xc1uM\\xb1\\xf6\\x9f&%\\x8c\\n\\x1a\\xd1a\\xe0i\\x88\\x98\\x0eF\\xbe\\x1a\\xefh7\\xf4\\xb1\\x17\\x89\\x0eHv\\xd8l\\xd7\\xe7z\\x8f!\\xeef\\x9c\\x7fV\\xcfz\\x97]4\\xcc\\x1fb~\\x9d/C\\xe2o\\xb4\\xf6\\x9d\\xbc\\xda\\xad\\xaayU\\x89\\x85\\xe7;\\xee\\xb4\\xd5.\\xe6\\xafL\\xeb6m\\xfe\\xdf{p^,>\\x9a\\x97\\xfd\\x1a\\xf3\\xd1\\xad6\\xda\\x0f \\x1f\\x15K\\x7f\\xf3*\\xfe\\xc3\\xce\\xf0\\xfdO\\x8aB\\xfc\\xdc\\xf6\\xd7\\xffC(\\x07\\xce\\xb7\\xf9\\x9e\\x93B\\x8a\\x1f\\x02\\xe7?\\x9f\\x9b^E\\x9ag\\x91\\xfc\\xaf!\\xbf\\xb6kR\\xeb\\x9aw\\\\\\xf7\\x9a\\x10i\\xed.\\xa4q\\xba\\xfc\\xaf\\xb8\\xfasS\\x13\\x1e\\xe0<_yJ\\xa27(O\\xf7\\x845\\xcc\\xb0\\x9e\\xda\\x15\\x85\\xf1E\\xc6\\xad\\xca\\xa9\\x8e\\x7f\\xba\\xd0\\xda\\xc5\\xf0z0\\x94\\xa7p>\\'V\\xdc\\xa2\\xf5c4e\\xbb\\x9dx2\\n\\xa3\\xc7\\xb2s\\xab3BF\\x99\\x85\\x9e\\x9f\\xd6\\xb3\\x9f[\\xa6F@`Y\\x88B\\xcb\\x1f\\xbe~\\\\\\xb4\\xf6\\x1dl\\x0f\\x85\\x08\\xf9\\xb5\\xad\\xe7\\xb1@~=\\xe8\\xfa\\x81k\\xb1U\\xb3\\xa30\\xbe\\xd9o\\x04\\xeac\\xebz\\xa3\\xd0\\xfe\\xb0$=D\\xe8ug\\xa2\\xfc\\x01\\xeb\\xce\\xbb\\xd6\\xc68\\xee\\xfe!\\xc4\\x15\\xa2\\xd0\\xeb\\xc1b\\xc9\\xd3\\xe8\\xb0\\xc1\\xe1__\\xeat\\x1a\\xa2\\xd0\\xf2\\xf4\\xdfvN\\x17\\xe6g\\x10i\\xcf\\x9f#\\xe9\\xa3\\x90\\x0e<\\x94\\xe5\\x1e\\xf7\\x0f\\xab\\xfb\\x14\"\\xae\\xcf\\xa7\\xfa\\x05\\xd4\\x1fp\\xaem\\x05\\x17\\x87$\\x9c_\\xdeg\\xfe\\xe8M)\\xcf} \\xf2\\x95\\xa7\\x9f\\xba\\xfec\\xeb\\xbc\\x1e\\xca\\x05\\xb1\\xe6\\xf5|\\xf7k\\xfe\\xb7\\x8e\\x9f\\xce/\\x1f\\x7fsbU\\xad\\xe1\\x10i\\xc7\\x0fi=\\x0b\\x8e\\x1f\\xbe\\xf2\\x87\\xa4\\x8fB\\xf9\\xc3w\\x1d\\x83\\x14\\x9f/\\xbf\\xd6\\xcd\\xd4\\x0b\\x1f\\xc7\\xd5\\xadv\\xeb>D\\xbe\\xebf\\xd7\\x06\\xdc\\xbd\\xebusg\\x13\\x9c\\x17k\\xdd\\xacG\\xcb\\x8b+\\xed\\xec\\x87\\xf7\\x87HKo\\xa4\\xf1\\x03\\xe9\\xcd\\xe0\\x9cU\\xa0q\\xf1\\xdbg!\\xf2\\x1e?\\x99~!l\\xa9*)8\\x1fh\\xf2ST,\\xe3p\\x1e\"\\xed9\\x917(\\xc7\\x8fX\\xf1\\xbc\\'\\xb8V\\x1f\\xbf\\xae]Bg\\x88B\\xdb\\xc9i\\xe7\\x0b\\xb6\\xae\\xff\\xc0\\xf9\\x82Xq\\xf3&Ou)\\xbc\\xc3\\xeb\\xf7n\\x10i\\xd7\\xb3H\\xfd#\\xb4]\\xf9\\n\\xa1\\x1c\\xa1\\xed\\xca8\\x9f\\x97]\\xf9\\xaa~K\\xa9\\xa7\\x06\\xffr\\x18\\xe1\\xfe\\x12l\\xa7\\xb0\\xd5\\xfe\\x06\\xed\\x14O\\xb5\\xb7\\xee\\x9ei\\xd3\\xa7\\x02\\xc6@\\x17\\xcd\\xaa\\xaa%W\\x14\\x10z_5_\\xbf\\'\\x12\\x1d@\\xbf\\xa7\\x13\\x15nL\\x0cY\\x9c9\\x07\\xa2\\xd0\\xfc`K\\xec\\xc8#\\xcb\\x1aT}\\x05\\x11\\xea\\xa3\\xb6\\xda\\x0f\\xban\\x9as\\\\\\xb1.\\xba\\x16\\xce\\xf3\\x95\\xdb\\xc4\\xf8!@n\\xd3\\xc6\\xc9\\xb2u\\xbf\\x0c\\xa4\\xb7\\x0e~\\x1d\\x1678\\xd9\\xe8\\x12F\\xefK\\xcf\\xb7\\x9e\\x1b\\x9dt\\x0e\\xd2\\x1bI.\\x90\\xfc\\x13!\\xbd\\xa9\\xb4\\xa3L?\\x1dY\\xb2\\x0c\\xe2\\xe7v\\xbe\\x19\\xad\\x1eO;\\x0f\\xe6\\xeb\\x17 \\x96\\xfd\\xed\\xe5\\xc6\\xe9\\x05F\\xd4?g\\x82(\\xb4]\\xcc\\xf7\\xef\\x95\\xa1\\x87/xv\\x81(t\\xbb\\xf1\\xf5K\\xa3\\x1d\\xa7b\\xc5?\\x90\\xdflX\\xb0\\xa8&\\xfc*D\\xa1\\xfbg\\x91\\xfcf\\'_\\x97\\xc0\\xf2\\x10i\\xcfg\"\\xfa\\x11\\xe7\\x13]\\x87\\x85\\x9f\\xf4r\\xd8Z_\\x02Qh=\\xd1\\xb1~\\xbdZ\\xc5Z\\x9di\\x00\\xf1K=\\xdf\\x19\\x9e\\xc3\"\\xd4y,p\\x7f0\\xdfut\\xd2\\xf8\\x81\\xeb\\xe8\\xa3\\xfd;O\\xbf;\\x7f\\xfbR\\x88B\\x9f\\xc7\\xb2#9f\\xae\\xec\\xa0\\xab\\x1a\"\\xed\\xfa)\\xc9\\xce\\x07\\xed\\xf1\\xbf.\\x9a7\\xa9\\xe2\\xf0\\x8c!\\x10\\xb1~\\xfduL\\xdd\\xe7W\\xff\\x91\\x1f \\xe9\\xd7\\xd7(\\xc7\\x0fi\\xdd\\x0c\\xd3\\xdb\\x86m3\\x1a\\xbe\\x9a\\xe2\\xf4G|\\x1e\\xed\\x06\\x7f\\xf6\\x03\\xfd\\x8d\\xe0\\xa7J{\\xeeK\\xa3\\\\\\x84\\xf5\\x81~\\xaab\\xad\\xff<\\\\\\xfe[\\x84\\xec\\xd9F{\\x8c\\xaf\\\\*\\x1b\\xe6=\\xb9\\xbc\\x11\\xda)l\\xf5\\xaf\\x82v\\x8a\\xe0\\xc7\\xe6\\xd5\\xc3\\x07\\x0e\\xbe\\x08\\xf1K\\xb5\\xf3\\xd1\\xda\\xc9m\\xf5?\\x80v\\n\\xda\\xf59\\xbe\\xebY|\\xf5^Z\\x7f\\x7f\\xda\\xf59\\xbe\\xfb\\xe7\\xf8\\xdaGIz\\x15\\xb4\\x8ffU(\\xbclw\\xf2\\xb8i\\x18\\x03\\x9a\\xef\\x1f\\xdc\\xb2\\xef\\xd3\\xed\\xd0\\xeeOj7\\x92\\xbd\\x17\\xda\\xfdc\\x8b\\x96h\\xdd\\x85Y\\xb4\\x15\\xa2\\xd0\\xf6\\x10\\xb1\\xf4\\x1d\\xbe~\\\\\\xa4q\\n\\xfd\\xb8b\\xa7^\\xdcq\\xec\\xcc\\xce\\xd1\\x18\\x8bl\\xbe_\\xd0\\xa5\\x9e<Y\\xe8\\xf8Hb\\xf9W\\xf1\\x9d\\xd7\\xd3\\x9e\\x83[8\\xf6\\xdaj\\xf3\\xfa1\\x9d b>\\x8a\\xf5Q[\\xe7\\xdbEC\\xeb\\xedS\\x87\\xfc\\x8d\\xc3\\x08\\xe7[\\xdcV\\x8cP\\x9e\\xda\\xba>\\x97_\\xfb>\\xf8\\x9e\\xffC\\xab\\'vrxZ\\xca\\x14j\\x99\\r\\x11\\xb6\\x9b\\xad\\xe7\\xe0\\n}n\\x12\\xc9\\xee\\x0f\\xf95\\xdfuZR\\x9c\\xfaO\\x8dw\\x0b\\xcf\\x13\\x1f\\x96[.\\xa9\\x7f \\xbf~.]\\xe1\\xed\\xd2%`\\x07DX\\xceR\\xf0\\xbb\\xb8\\x1c\\xb1\\xfc\\x06It\\r\\xfbga\\xb7i\\xdb\\xf5\\xeenQ\\x10a}\\xe0\\xf9%#m\\xac\\x8fX\\xe3tF\\xa3\\xcb\\xb1\\xc1\\x93\\x02\\x97A$\\xd5\\xe7S\\xe7\\xdb|\\xcf\\x91&\\x9d\\x13\\t\\xcf\\x91v/\\x9f\\xa2\\x89Y<\\xf4\\x1aD\\xac\\xc7c\\xfd\\xc0J(\\x07\\xc7\\x91\\xc9\\x8b\\xef\\x94\\xbe3-\\xa3\\xf8\\xf3M)\\x10i\\xcb\\xa1\\x9d/t;\\x9b\\xb4\\xa1\\x84\\xa2\\xd0A\\x88\\xb4\\xe7D\\xd2\\x8e\\xd3\\x90\\xeb\\x9b\\x8aw\\xff{\\xe5D\\x8c\\xd0N\\x8e\\xf7\\xe9\\x91\\xd6i\\x8b\\x10\\xca\\xb9\\xba\\xd9\\xee\\\\HB\\x87\\x0e8?\\xa6\\xf6\\x8a\\xde\\xf7\\x066]\\x0bQh;R\\x87\\x89K\\xa3\\x97\\x95\\xe9|\\x1b\\xa2\\xd0\\xfbr\\xf8\\xf2\\x1d\\x92\\x1d\\t\\xf2\\x9d\\xeaG[\\xc5\\x9c\\x8d\\xeaw\\x0c\"\\xad<\\xa5\\xf5?\\x98\\x9b\\xdc\\xa1\\xcf\\x8e\\x1a\\xcd\\xafC\\xb4u\\x1d\\x10\\x96\\xb3\\'8\\xbb\\xd5\\x9d\\xe8\\xf9\\xbbq^\\xacs\\xeep<e\\x88B\\xc7O\\xfcR\\xe2\\x93\\x13\\xed\\x07\\xc0?\\xb1\\xd5\\xd4\\xc9\\xd3\\xe6\\x0f\\\\|\\x03\\xa2\\xd0\\xf3\\x92\\x0e\\xa1=\\xc7*\\xd9s\\x03!\\xd2\\xaeo\\x93\\xe6\\xc1p}\\x9b\\xefy\\xe2\\xc4x\\x83\\xe0<q\\xbe\\xeb\\xf5\\xa4y\\t\\xac\\x0f\\x89\\x8f\\xc2\\xf9\\x0f\\xc9\\xdeKkO\\xe4\\xbb^B\\xe2;B\\xeb\\xd7\\xb4\\xfe\\xca\\xc7#}\\x9c\\x98\\x9dL1\\x88B\\xdb-\\xa7\\x94H\\x1fW\\xba\\xff\\xe2\\n\\x18\\xb1\\x9f\\x10\\x1c?\\xb6\\xf2\\x1d8~\\xc4:\\xdf\\xd91t\\x84j\\xa05\\xea\\x02D\\xa1\\xed;\\x11\\xda\\xb5}\\xe6OY[\\x08\"\\xad\\x9c#\\xcd\\xe7\\x84\\xde_B\\xcbw\\x84\\xb2\\xf7\\xc2q\\n\\xed\\xbdy\\xc5\\xd5\\x15\\xca?^\\xac\\xfdL\\xb4~\\x1b\\xb6\\x9e_\\x0f\\xfd6R}\\xea\\xaeN\\xf8\\xfe\\\\o\\x88B\\xc7\\xdb\\xa0=g\\x954_ \\x9dk\\x95_qN\\x1b\\x96\\xb9\\xee\\xd6WU\\xcb\\r\\xa2\\xd0\\xe7.\\xd3\\xda)\\x96\\x83\\xf9\\xf6\\x18P\\xbf\\xbc\\xca\\x11\\xcbO\\xa8K\\xe7\\xa7\\xfd\\x1e^s9\\x8d\\x11\\xae\\xcb\\xe4\\x15\\xf7\\x98\\xe4\\x17\\x00\\xfd\\x84\\xf8\\xc69%\\xd1\\xb5\\xd0~B\\xb4~\\x1b\\xda\\x9e-\\xe5\\x9b]\\xef\\xbc\\x80(4\\xbd\\xd1\\xd25\\xdf\\xf3r\\xfem\\xfe\\xf1|\\xed!\\xb4\\xf3\\xd3^\\x9d\\xa5\\xfb\\xd4\\xd1-\\xefA\\xe4;?\\xfdQ\\xba\\xd6\\xbf\\xd0\\x8b\\xcce8\\xcf\\xd7o\\x83v~zc\\xf6\\xce\\xd3\\xe6\\x1d\\xe1\\xce\\x10i\\xcf\\x97)M(G\\xe8}\\xe2\\xb4\\xf1\\x0fN<t8\\\\1\\xbb\\xfaB\\x88X\\x7f\\x9b\\xd3\\xf0e\\xadBU\\xc6T\\xb7\\xd5\\xee?\\xe5xpT\\xe7\\xf3[\\xb0y\\xce\\xaeD\\xa7\\x9a/\\x1a\\x05\\xb54C\\x14Z\\x8f\\xff\\xadKG\\xdf\\xde\\x15u\\n\\x8c\\xe1NKk\\xc7\\xb6\\x0c\\x0b\\xa3]\\xdf&\\xe9\\x89\\xf9v~\\x89k\\xd1K\\x1bF8\\x16\\xc5(\\xd3\\xadth6\\x7f\\xdd\\xa9/\\xf5\\xfc\\x92\\xcd\\x1b\\xca\\xdaE\\x95\\x89)\\x0f\\x11\\xf3\\x83\\x8b\\xbd[t\\xf3\\xaa\\xb2\\xe9\\x96\\xad\\xf5\\xf9\\xe0\\x1c(\\x91\\xf6\\xe9\\x89eO\\xe4k\\xe7#\\xf1\\x03h\\xe7\\xdb^t\\xc9&\\xdf\\xda\\'\\x86C\\xa4\\xe5\\xa3D\\xfd@\\xe0\\xf3Oi\\xf9\\x01\\xd6\\x0b!\\xc2\\xf31H\\xf4v\\x8e@\\x07\\x90_\\xcf\\x0b;\\xd5\\xd0\\xa1\\xd7\\x8dJ\\x10\\x85\\x9e\\x97\\x88\\x15\\x0f\\x85V\\xce\\xf1=\\xf7\\xe5\\x7fr\\x8e\\xae\\x1cH\\x07\\x13b\\n\\x14\\xd2?\\xbd\\xff\\x18\\xe3\\x8cBAc\\xbc\\x1e\\xfd\\xf4\\xc1y\\x12_\\x8a\\x9c\\xbbSg\\xef\\xd9\\xee\\xf7\\x9fZ!\\xd2\\xf2\\x03\\xb1\\xe6\\xdb\\xb4\\xf1\\xc9\\xf9\\xfa#\\x91\\xe8\\x1a\\xfa#\\xf5~i?\\xa7w\\xd3\\xdfz`<\\xb5-\\xfd\\xa8\\xf2p;_Lo\\xcc\\xfaT\\xbf\\x1a7\\x7f\\xdbO\\xa27\\x12\\xbf\\x86t\\xcd\\xd7\\x1f\\x89D\\xd7\\xd0\\x1f\\x89\\x96\\xaeI\\xe7\\x15\\x90\\xe6\\xdb\\x90\\xae\\x0b\\x9c\\xe9wlz\\xe1\\x1fo@\\x84\\xf3\\x1f\\xd2|\\x9b\\x14O\\xe8\\x03\\xff^J\\xff7[\\xf7g\\xe5\\x97\\x1d\\xe9\\xf8\\xf9\\x8a\\xa6?\\x7f{1\\r\\xa2\\xe0v\\xa423\\x8a8zV{\\xf9\\x01\\x82rH\\xf3z\\xda\\xf3\\xaa\\xf9\\xda\\x95\\xf7\\x11\\xca\\x11\\xda\\xaeL\\x8a?*\\xf49\\xb8$:\\x80\\xfe\\xe47\\xbfku\\xbei\\xf54+D\\xa1\\xfd\\xc5:\\xfc\\x98T$\\xe4X\\xbf_0^\\x1cev\\x91\\xd5\\xe87Y\\xe8}\\xa1|\\xed\\xbde)\\xeb#\\xd68\\x15\\xcb\\x1f\\xf6\\xe7\\x13\\x97\\xfd\\x03\\xc6^UA\\xa4\\xf5w)E(\\'\\xbf\\xe2\\r\\x9a\\xef\\xc9\\xc6\\xb5\\r\\xcdt\\x83\\x88\\xc7iq\\xffe\\xdfjwl\\xf2\\xb4u\\xbd\\x04\\xd2A\\x81\\xa8#\\r7\\xed\\xd1E@\\x14\\xda\\xdf_,\\xffkZ\\xbb?\\xdf\\xf5F\\xbev\\n\\xa2\\xbd\\x17\\xd8)\\xc4\\xa2\\x83r{\\x96-}\\xdc*@\\x0e\\x916>\\x05m|$\\xb1\\xceU\\xe4{\\xce\\x10m\\xdc\"\\x92]\\x19\\x0b\\xdc`\\x87\\xf2\\xebo\\x0c\\xbb\\xaf\\xb3\\xb5>i\\xc5j\\xc5\\x8e_\\xe7Z\\t\\xe7\\xdb6\\xb0[\\xd5\\xa2\\x8f<\\n\\xa2\\xd0r\\xae\\xbak\\xb9s\\x89\\xbdb\\x06C\\xa4\\xdd\\x07F:o\\x17\\xd2\\x01_\\xb9@j\\xb7\\x0f\\xe4\\x82\\xe7\\x9d\\xb4\\xf4A\\x07\\x14\\x10\\xf9\\xda\\xfdG\\x98\\xe2\\xc6.x\\xdcV\\x8a\\xf3\\xec\\xe0i\\xda\\x11S\\x9c\\x18\\x88B\\xdb\\xfdi\\xedH\\xa4\\xfe\\xf9\\xdc\\xce\\x95\\xc7\\xf3D\\x88B\\xdb)\\xd4\\x13\\x07\\xdc\\xf2\\xe9\\xbf1\\x04\"\\xad_\\'\\xed\\xfa\\x9cX\\xfa\\x01_{\\x08\\x89\\xbfA{\\x88X\\xe7\\xb1\\xbcJ\\xca\\xea\\xdev\\xc8\\xb8E\\x10\\x85\\xf6W\\xa6=\\x07\\xd7\\xd68f\\xf0\\x1c\\\\\\xb1\\xf8\\x1b\\xc9\\x9f\\xafo\\xee\\xfd\\x19\\xdf\\x99*(\\xfc\\xeb:\\xd9\\x1a\\xcf.\\xbf\\xf6\\x9f\\x1eN\\xda&_\\xbd\\xa6\\xf0\\xa0\\x90\\xd2\\xf7\\xeb\\xa5\\x19|K\\x91\\xce\\xcb\\xb1\\x95\\xbf9d\\x847-\\x10_\\xb9\\x02\\xce\\x8b\\x15?^\\xac\\xf3\\xe7\\xc4:\\xc7\\xb3\\xf1\\x89\\xa0\\x13K\\xac\\xdfI!\\n\\xad\\x87\\x90\\xce\\xaf\\xa7\\x9d/\\x90\\xf4\\x90O\\x8do\\xc97\\xee\\xb1X\\xf1wh\\xfd\\xecl\\x9d\\xff\\xc4\\xd7\\x89L\\xef\\xd5\\xf9\\x8d\\x1b*o9G\\x1a\\xa7B\\xef\\x0b%\\x9e#\\x00\\xe6Y|\\xed.\\xff\\xad\\xfb$\\xf2\\x8a\\x17 \\xd49\\x91b\\xe9!i\\xc3\\x96\\xac>R7\\xbd\"\\xc6\\x01Ek\\x1cm_\\xfeX\\nm|KR\\xff@\\xbb\\xbfX\\xeb\\xa7\\x8bf\\xed\\x98~%t\\xc16\\x88\\xb4\\xf1\\xc9i\\xe7\\x0bb\\xcd\\xeb\\xd9\\xeb\\xed\\x8f\\x17\\xd6e\\x9c\\x80(\\xb4\\xfc\\xa1\\x8d\\x9bg\\xab}\\xe7S\\xfb\\x874~>\\xb7\\xfei92\\xe8f\\x85\\x08\\x8f\\xcd\\x18om\\xde\\xd5j\\xb1\\xfd@\\x0fh\\'\\xb75\\xde\\x06\\xb4\\x93oj\\xb1eH\\xcd\\xc5\\x1d| \\n-O\\xc5\\xe2;G\\xcbu\\xfe\\xa1y\\xa0\\x8b7\\xc4\\xcf\\xed\\x9c\\xbb\\x1d\\x84r\\xe0:\\x93Pr\\x0e\\xae3A9\\'\\x96]\\xec\\x80\\xe9\\xe8\\xaaY\\x15\\xbf\\xe9\\x00\\xf1K=G\\xe0\\xd1\\x8b\\xd1\\x0f\\x1eL\\xaa\\xbb\\x02#\\\\?\\xcd\\xcbo\\x83\\xd6\\x9fO,\\xbb\\xbfX\\xed\\x96Z:\\xa1\\xd1\\xa3\\'\\xbf\\xef\\xc0\\x18\\xf0He\\x7fw\\x1f\\xfb\\xb3\\xd0\\xfb\\x1b\\xc5\\x8as\\xba\\xd1?6q\\xd7\\x1a\\xe3E\\x88X\\xef\\x15\\xea\\x1ciZ\\x7f$\\x92_\\x1a\\xed~@\\xb1\\xe8\\x80\\x96_\\xf3\\xb5W\\xf1\\xdd\\xcfD:\\xd7\\n\\xee/\\x11\\xcb\\xefV,z\\x1b\\xe2^\\xa3F\\xb3\\x9d\\x7fV\\x83\\x08\\xe5\\x02\\x89\\xbf\\xd1\\xce\\xe7\\xc4\\xb2\\xbb\\xf0\\xf5\\xa7 \\xb5\\x1b\\xf4\\xa780j\\xc5\\xc5\\xfd\\x07\\x16\\xcc\\xc1\\xf8}\\xe1\\xa4\\xb3\\xa6\\xbd\\x93\\xbf\\x17:\\x1e\\xf1\\xbfM\\x7f\\xdb\\xbc\\xb8\\xe3\\xe8^\\xc5\\xab\\xd4\\x86(\\xb4\\xfe&\\x96\\x1f\\xe4\\xef]\\x1f\\x1b\\x1c\\xea\\x14\\t\\x85\\x88\\xdb\\r\\xfb\\xc7\\xdb\\x1a\\xe74\\xbf\\xec\\xca\\xcd\\xbe\\xad\\x95p\\xbd\\xc9\\xa8\\xbd\\x10i\\xfd\\x1cH\\xf2\\x14\\xeaob\\xed\\x074\\x9e\\xe8S\\xc3\\xa3|\\xc1\\xdf1\\xc6\\xdcJ\\xed8\\xaa\\xeb3\\x7f\\xda\\xfd\\x80\\xb4\\xf3,\\xb1\\xce\\x93\\x10Kn_i\\xef\\x12\\x9a\\xee\\xec\\xd1\\r\\xa2\\xd0\\xe3\\x94\\xaf=\\x91\\x14\\x17\\xe7S\\xe3\\xfc,\\'\\x94S\\x98P\\x0e\\xac\\x0f\\xad\\\\ \\xc5\\x17#\\xd1A~\\xc9\\x05\\xb1\\xe8\\xad\\x92\\x9bbI\\x8bb\\x8fvB\\x14\\x9a\\xde\\xc4\\xe2;\\xf2}\\x19\\xd5\\xcf\\xec\\xbe\\x13\\x83\\xf1|\\xdc\\x86\\xc6E\\xeb\\xc8\\xcf\\xd0\\xd2\\x01i\\xfd4\\xbf\\xce+`w\\xf5\\xb2\\x0e-S\\xe8\\x03\\x14:>E\\xb1\\x17F\\xe3\\xc0:F\\x16\\xa2\\xd0\\xfeb|\\xfdaI\\xfa(l\\xb7\\xc3>\\x17\\xaaE\\x1c\\xfa\\xe3\\x10D\\xa1\\xfd\\xaf\\xf7O\\xbd\\xe24\\xc0\\xdf\\xee0D\\xdax\\xf8$}T\\xe88s$:\\x80q\\xe6\\xf8\\x9e\\x8b@\\x1b\\xe7\\xf4s\\x93\\xa7\\xb6\\xda\\xaf\\x85\\x8e\\xbbO\\xab\\'b\\xbf\\x83\\xbc\\xfc\\x0fHz\"\\xa9\\x7f\\xa0\\xff\\x01\\xed\\xbeC\\x92\\xdf\\x13I\\xbf\\x86\\xf6\\x90\\xb5\\xab\\x16\\xce\\xa9dWd$DL\\xd7/\\xa6\\x1c\\xcf\\xc8\\xacn\\xa7\\xb5u\\xff\\xcf\\x91e\\xce[gO\\xcc\\\\\\x8b\\xf3|\\xd7\\xb3h\\xf9\\x0e\\xdf\\xfa\\x90\\xe8\\x00\\xd6\\xc7\\xb2T]j\\xda\\xf6\\x7fjB\\x84~v${\\x15\\xed9\\x02\\x9f\\xdb|\\x8ed\\x0f\\xf9\\xdc\\xe6s\\x95|\\xd8\\x9f\\xe4\\xcdKV\\x85H;\\x9f#\\xd9\\xc5h\\xcf\\xd3\\x13z\\x9d\\xf6J\\xf6\\xb3\\x9b\\xa3_YjB\\x14z\\x9f\\xeb\\x8b\\xfeU[\\xee_\\xeb\\xfe\\rD\\xbe\\xeb\\x80\\xdd{4\\xcb\\x0cJ\\xef\\x85\\xc3\\xad\\xda%\\xba\\xf6j0\\xdc\\xb8B\\tQ\\xe8\\xb8\\xfb\\xa4\\xfd\\xb4p\\xdf\\xa1\\xad\\xfa\\x1b\\xdcw\\xc87\\x0e \\xc9\\x1fI\\xe88\\x80[\\t\\xe5\\xc0\\xf5\\xb9\\xbb\\x97[8\\\\\\x18\\\\y#D\\xac\\x1f\\x9c\\xbd\\xf5\\xe4\\xd7\\xd3\\xa7v\\x859\\xdc\\x8e*\\x11\\xd6\\xfa\\xeaz\\x12]\\xc3\\xf5\\xb9\\x0f\\xe6\\xa7\\x8d\\xe7N9t9\\xb5:D\\\\a\\xac\\x87\\xd8\\xca\\x0f\\xf4\\x0fn\\x9fs:\\xa8/\\x8f\\xf3N\\x15&\\xf4\\x1b:\\xa5\\xeez\\x8c\\xe1\\x0e\\x89\\x95\\x9c\\xfaG\\x8e\\xc7\\xe3\\x07\\xcf\\x7fl]\\x9fS\\x06\\x17\\xb8^\\xb9\\xcd\\xb57r\\x81v\\x1d\\xdd\\xd6\\xfa\\xc0u\\xf4RU\\x07\\x17\\xcc>\\xb3\\xdc\\x17\"\\xad\\xdf\\x06-? \\xf9\\xd9\\xd1\\xda)h\\xe5\\xb6X\\xf1\\xdfF\\xa5\\xb6s\\x9c1r\\x87\\x1e\\xe3\\xee\\xc0;\\xa7\\xba\\x94\\x8b\\x98\\x06\\xe9\\x80\\xe4\\xdfK\\x9ag}*\\x1d\\xf0\\xf5\\xa7\\xe0\\x1b\\x8f\\x8b\\x96\\x8f\\x8a\\xe5\\xef/\\xd6~@Z\\x7f\\x7f\\xbe\\xf1\\xb8\\xbe\\x94\\xf31\\x88\\xe7\\xc2\\x81y\\xa3\\xc94\\xb9\\xe6\\xd6\\xbf\\xba\\xdf\\xc1\\xd8\\xa2\\x83\\xe6\\x82\\xfaD\\x9c7\\x1c?\\xa4\\xf9\\x1c\\xc9\\xbe\\x03\\xc7\\x0f\\xed9\\x1c\\xb6\\x8e\\x1fx\\x0e\\x87X\\xfb\\xe7H\\xe7g\\xf1\\x9d7\\xc2\\xf5\\xb9\\x87i\\xaa\\x1eW\\xf77)\\n\\x91\\xf6\\xdcXR}\\xe0\\xb9\\xb1\\xe7\\x1e\\xe9G\\x0f{8\\xc9\\x17\\xa2\\xd0q\\xc3\\xf9\\xdaCHt\\x00\\xe9\\xfa\\xe8\\x9fK\\xd7\\x9c~2\\xdb\\x01\"\\xac\\x0f\\xdfxO\\x05\\xcem\\x1f:\\xf5\\xec\\xd04\\x88\\xb4~\\x0e\\xa4y\\xa3\\xd0\\xe7U\\x93\\xda-\\xbf\\xec\\xe4|\\xe3\\'\\xd2\\xda\\xc9\\xc5\\xb2S\\xd0\\xee\\xd3\\xb3\\xd5\\x1e\\x0f\\xf5\\xb7\\x19\\x91\\x7f$\\xcf\\x1a\\x1a2\\x1dc\\x85\\x16~\\x05\\xealn\\x90\\x01\\xed\\xf1$\\xbes\\x9f\\xd0n\\xf9\\x15\\x17T,\\xfd\\xe0\\xd6\\xbe\\xaf\\xac\\x05\\x1fZ~\\xc5\\x08\\xf5\\x83/\\xed\\xfc,\\xbe\\xf6k\\x92\\x1d\\x16\\xda\\xafi\\xf9(_\\xff\\x1d\\xbe\\xfc\\x8d\\xa4\\xef\\xe4\\x17\\x7f\\xfbv`\\xd2\\x94\\x7f\\x9a\\xa4\\xa6A\\x14\\x9a\\xbf\\x89\\xb5\\xbf$\\xdd\\xf0\\xe4J\\x8c\\xce.\\x1cb~\\xc59%\\xf17\\xd29\\xab\\x90\\x8f\\xd2\\xceOm\\xd5G\\xe1\\xbe\\xa9\\xb3\\x1d\\x16\\x9fW\\xec\\x91x@\\x14z>W\\xfeD\\xfd\\x07\\xab\\xaf\\xc6\\x8f\\xc4xE6\\x7f\\xf3\\x82\\x9d\\xdeG\\x84\\xde\\xd7&\\xd6\\xf9%K\\x86\\xd5\\x7fp\\x99Q\\xc6b<\\xbdfU\\x8a\\xc9\\xbd\\xccA\\x12\\xbf\\xc6\\xfa\\xe7\\x04\\xfb\\xff\\\\\\x0e\\xe4\\xd7\\xd6&~\\x7f\\x1f_u\\xc9\\x1d\\xa2\\xd0\\xf6\\x10\\xb1\\xec\\xca\\xdf>s\\x8b{\\xb6\\xbb\\xcdX\\x88\\xb4q\\x82i\\xd71\\x0e\\x1c\\xaf\\xd5$3\\xf5\\xe7\\x85\\x10q\\x80\\x04\\x8cf\\x9et \\xd6\\xfa\\xa9\\xc2\\xb3\\xf6\\xe3j\\x15\\xe7\\x8c\\x81\\xc8\\xe4\\xde\\xf7\\x8c?4\\xae\\xc6\\xae\\xf0+\\xb6\\x9e\\x0f(\\xffe\\xabbZ\\xea\\x10\\xbc=\\x9b\\xb7]\\xf9OB9B\\xdb\\x95\\xf7\\x13\\xca\\x81ve\\xa1\\xec|\\xd0\\xae\\x0c\\xed|/\\xa75\\x1d\\xfdrj\\xfd\\x8a\\x18\\x95\\xce\\x1ec\\xb2\\x9f\\xbb\\xf7\\xc3t\\x8d\\xcf\\x1d\\xb3\\xd5\\xde\\xeb\\xb9bn\\\\\\xf1\\xef\\xfa\\xbc\\xc4yZ;\\xdf\\xec2\\x19\\x83v_.\\xfc\\xfd\\xa7\\xda\\xf9\\xc4\\xb2\\xbf-[\\xb2]y\\xa6I\\xf6j\\x88B\\xc7\\xdbXsy\\xdb\\xc34\\x97\\xc8\\xd2\\x10\\xa1\\xbeck\\\\P\\xa1\\xe7s\\xb4|t\\xaf\\xc7\\x9d\\xca\\x9dn\\x9b\\xcfB\\xa4]\\x9f#\\xf9\\xa1\\x08\\x1dw\\x85\\xa8W\\x01:\\xa0\\xf5\\xab\\xb1u\\xffO~\\xf9\\xd5\\xf0\\x9d/\\x90\\xe8\\xed\\x83s\\x04\\xc2\\xb6+\\xf7Oaz`t\\xf0\\xea\\xd8*\\xa5\\xf7\\x86\\xd6B\\x9f\\xf3-\\xd6\\xbe\\xa9\\xd1\\xad\\x93\\x0c\\xc3\\n\\x8cY\\nQh\\xff7\\xb1\\xf6\\x97\\xcc\\xab#/6\\xd12\\xa1.DZ\\x7f$Z\\xba\\xe6+\\xb7I\\xfa\\x01\\x94\\xdb\\xc1\\x8f\\xcd\\xab\\x87\\x0f\\x1c|\\x11\"\\xd6G\\xf3\\xda/C\\xab\\x8f\\x8a\\xe5\\xb7q\\xc8\\x9e\\xe9\\xda\\xe8Y\\xa7\\r\\x18\\xe1\\xba&\\x96\\xdb\\xa4\\xf9\\x1c\\x89\\x8fB\\xb9=\\xf3\\xc1\\xbeG\\xeec\\xbf\\xa9\\x07\\xf1K\\x8d\\x83~\\xfe\\xd4\\xc1C\\xae\\xfb\\xda\\x9e\\x83(\\xb4\\x7f\\x88h\\xfb\\x9d\\x8f\\x1f)\\xd6(\\xa5\\xfaL\\x8ci>\\x92_2\\xff4\\xf4\\x12z\\xff\\xe9\\xc3\\x08\\x8f \\xb7\\x8c\\x91N\\x10i\\xf9(\\xed>~\\xb1\\xecH\\xc7\\xcboI[P\\xc0T\\x19\\xa2\\xd0v\\xa4\\xff\\xc5\\xeb|\\xffEZ\\xd7\\x84\\xf2\\xe7/\\xfb\\x05\\x07\\x0f\\x1a\\x02k`\\xc4\\xfa5\\\\\\x9f\\xb35\\x1e\\n\\\\\\x9f\\x13\\x8b\\xef8u\\t\\xbe\\xe7:gU:\\xc4\\xcf\\xed\\xfc\\x05\\xda\\xf1C\\xbb\\x7f\\x9b/\\xdf\\x11K\\x9e\\xe2\\xb8\\xa6\\x10i\\xfd I\\xf5\\x81~\\x90C\\xd7_\\xad\\xe9\\xb4\\xa7\\xf5\\x02\\x88\\x90\\xef\\xa4\\xd8h\\x7f\\x13:>E\\x16\\xa1\\x1c\\xa1\\xe3\\xa0\\xe3<\\xb4S\\xc0\\xfe\\x11+>9m\\x1cg\\xbe\\xf1)\\xc4\\xa2\\xeb\\xbc\\xe2\\xe2\\xe4\\x15\\x07\\x90\\x96\\xae\\x83\\xb3\\xa2\\x02\\x9f-(\\xfe\\x0c\\xa2\\xd0\\xe73\\xf1\\xdd\\xd7Fk\\xf7\\x1f\\xa7\\xb8\\xb1#q\\xeb<\\x13D\\x92}\\x07\\x8f\\xd3\\xc9\\xb9yZ\\xfbN\\xb9g\\x936\\xaf_|{7D\\xa1\\xf5\\x10\\xda\\xf31\\xf8\\xda\\xe3\\xc5\\xa2k\\xdaqJ\\xb2\\xc7\\x93\\xd65\\xf3+\\x8e\\xcc\\xa8\\xf5\\xe5NK&\\x8cY\\x0eQh;\\x92X\\xfa\\xa8X\\xf3\\x1f\\xbe\\xfb\\x0e\\xffm\\xf1\\x02h\\xfd\\xc5z\\xf7(\\xee\\xd4\\xfa`\\xcfe\\x10\\xf9\\xaeoo\\xca\\xee>\\xf1A\\xb5\\x1f6\\xe0|\\xc1g\\xb7\\xb67I\\xb8\\xbb\\x01\\xa2\\xd0r\\xfb\\xe7\\xf8\\xc9Sv\\xd4\\xee\\x92\\x80qy\\xe8\\x8f\\x87V\\x15b\\x0f@\\x7fK\\x92\\xfeFZ\\x9f\\x83\\xfe\\x96b\\xf1\\x03\\xc3\\xec\\xdf\\xf6\\xc7\\x0c\\x9d:\\x1a\\xe2\\x97\\xca\\x0fh\\xfdTm\\x9d\\x9f\\xfe\\xdb\\xfdT\\x07\\xb4?\\xb9\\xd1\\xdd\\'\\xfe\\x0eD\\xa1\\xc7\\xcfm\\x87g~v\\xf5\\x9f\\xd5\\x84\\xf8\\xb9\\xf9\\xc3R\\xeb\\xf1<\\xfdGI\\xeb\\x18\\xf9\\xe5?J\\xda\\xff\\xc3\\x97\\xef\\xc0\\xfd?b\\xf9\\x8f\\x8aeG\\xe2\\xcb\\x0fh\\xf5^\\xb1\\xce\\xab\\xae}\\xd8\\xbd\\xf3-y_3D\\xda8\\xa7\\xa4\\xfd\\x9a\\xd0\\x8e\\xe4V\\xb3\\xe6\\xdc\\xa4q\\xbb\\\\0n\\xde\\xdac\\\\\\x95\\x8d\\xfe\\xd4\\xe7Q\\x92\\xe8\\x1a\\xdaw\\xbe\\xcb\\x1c2\\xe2\\xf6\\xcc\\x86\\xfd \\x8a\\xc5\\xdf0?\\xf0\\xec\\xb1\\xfc\\xe2\\xef\\xa3~\\xff\\x8aT\\x0e\\xc9~\\r\\xf9\\x1b)\\xde\\xed\\x97:\\xcf\\xa2\\xa5k[\\xf7\\x81A\\xba\\xfeu\\xd1\\xbcI\\x15\\x87g\\x0c\\x81Hk\\xaf\\xfa\\x83P\\x0e\\xb4W\\xf1\\xe5;\\xa4s\\xfb \\xdf\\x89\\xd0\\xae\\xed3\\x7f\\xca\\xdaB\\x10\\xf9\\xc6\\x0fY\\xfeW\\\\\\xfd\\xb9\\xa9\\t\\x0fp\\xde\\xe0\\x9cU\\xa0q\\xf1\\xdbg!\\xf2\\xa6\\x83L\\xbf\\x10\\xb6T\\x95\\x14\\x9c\\xc7\\xf1\\xf2 \\xf2\\xb5\\x8bA}\\xa7d\\xf1\\x99q*I\\xa8\\x02\\xa2\\xd0|G,=\\xb1\\xfcv\\xbbj\\x85\\x1e\\xc5\\x07A\\x14\\xda\\xae,\\xd6:F^v\\x17\\xa1\\xd61\\xda8_4D\\xb7*\\xbb\\x05\"\\xee\\x9f\\xbc\\xe6?$:\\xa8?\\xe0\\\\\\xdb\\n.\\x0eI8/\\xd6\\xfc\\x87\\xaf\\xfeF\\xe2\\x07P\\x7f\\x9bZ\\xe2\\x9b\\xae\\'\\x97\\xfb\\x7f\\x05Qh\\xbf4\\xbez\"\\xed\\xbe\\xd0\\x93\\xfb\\xed\\x7f\\x8cy\\xe9Y\\x1aci\\xe7j\\x7f4\\x97\\xf5\\xcc\\x82\\xfe\\xd7\\xb6\\xc6K\\x83\\xfe\\xd7b\\xf5\\xcf\\xf81v\\xae\\xda\\xb2\\x9eC!\\n\\xdd?\\xb4quI\\xe3\\x87\\xb6\\x7f\\x0e7\\xbfZ \\xcbuWI\\x8c\\xcbNn\\x8a1\\xfbZ3\\x84\\xee\\x1f\\xb1\\xf8\\x1b\\xed~3\\xbe\\xfcM\\xac\\xf3\\xc4\\xab\\xb8\\xa6\\xd6\\xedp\\xb8\\xec@\\x88\\xb4\\xf1\\xc5Ht\\r\\xe9@\\xacxB{7\\xc4\\xae\\xcc\\x98\\x97\\xe8\\x04\\x91\\xf6\\xfc9Z\\x7fX\\xbe\\xfb\\xcd\\xae\\x13\\xca\\x81\\xfb\\xcd\\xf8\\xae\\xd3\\xfeM(Gh\\xbd\\x17\\x1f\\xa0\\x99\\x97\\xde\\xbb\\xe7X\\xa9[\\x0bN\\xf6;\\x05\\x91\\xd6\\xcfN\\xac\\xf8H\\xa4\\xf1\\x03\\xe7?y\\xc5\\xaf\\x12\\xea\\xfc\\xed\\xb2\\xc6\\x15\\xe9\\xeb\\x8a\\x05\\xd7\\xf8\\xd4s\\xd4H\\xe3\\x07\\x9e\\xa3Vdg\\xfb\\xe7kv\\xb6\\xd3B\\xa4\\xdd\\xc7R\\x8eP\\x0e\\xe4o\\x97\\x13g^X\\x1b<8\\r\"_y\\n\\xe9@~\\xb3a\\xc1\\xa2\\x9a\\xf0\\xab\\x10\\x85\\x96\\xa7\\x8b\\xe47;\\xf9\\xba\\x04\\x96\\x87(\\xb4<\\x15+^\\xa7X\\xeb\\x183<b\\xba\\x0c,R\\xf2$\\xc4\\xcfm}\\x0e\\x07\\xa8\\x82\\xe5\\xc0\\xf59\\xb1\\xda-9\\xe8X\\xbd\\xbaC&\\x9e\\x84H{.BQB9\\xf9\\xb5\\xfe3\\xa5D\\xfa\\xb8\\xd2\\xfd\\x17W\\xc0\\x18h\\xf2ST,\\xe3p\\x1e\\xce\\xeb\\xf9\\xfa\\xfb\\x8be\\x8fw\\x0c\\x1d\\xa1\\x1ah\\x8d\\xba\\x00\\xf1K\\xf5\\xf7_\\x7f\\xda0\\xc1R\\xf6Vg\\x88B\\xf3\\xd1\\x93\\xc91\\x8b\\x82F\\x0e\\xb9\\x8c\\xb1E\\xaf\\xde\\xc7\\x86lkf\\x86t`\\xeb~@H\\x07\\xe3K\\x17\\xcf\\x8e.T\\xe5\\'\\x88B\\xfbq\\xe9wM)\\xd9\\xefL\\xffI\\x10?\\xb7s<i\\xfd\\x9e\\xee\\xb0\\xeb\\xd3^\\x1c|\\x9c\\x06Qh\\xba\\xfeR\\xfcPHz\\x08\\xf4C\\xc9h\\xbc\\xac\\xbesZ\\xf9\\xed\\x10\\x85\\x1e?}\\xce|;aR\\xd7\\xa7I\\x18;\\x96\\x8dqH*\\xd9v$-\\x1f\\xa5\\x1d?y\\xd9\\xe3\\xbf\\x8e\\xa9\\xfb\\xfc\\xea?\\xf2\\x03$y\\x8a\\x17\\xe4\\xf3\\xea\\x1f\\xbe\\xf1\\xfdi\\xe7\\x0b|\\xe39\\x90\\xe6\\x0b0\\x9e\\xc3\\xbfm\\xbe M\\xbeU\\xa4SA\\xffZ\\x10i\\xe7\\x0b\\xa4\\xb88\\xf9u\\xae\\xa2X\\xf2\\xf4s\\x8b\\xf7d\\xab<\\x85\\xfc\\x9a\\xaf\\xfc!\\xf9W\\xc1q\\xca\\xf7\\\\+Z\\xbe\\xc37\\xfe(\\x89\\xef\\xfc\\xdb\\xe9\\xed\\xf2\\xba+E\\xbc\\xeb\\x14\\xd9\\x85\\xb1\\x9e\\xfd\\xdc25\\x02\\x02\\xcb\\n\\xad\\xbf\\xd1\\xf2QR\\xdc\\x15\\xd2\\xfeF\\xc8G\\xf9\\xda\\xdfHqq\\xa0\\xfd\\xed\\xe8|\\x7fW\\'\\xbf1u!\\xda\\xba\\x1e\\x0c\\xedop=X,\\xbf\\x80\\x8c\\xa4\\x7fj\\x8c-#=\\x07Qh\\xfdZ^tU\\xab\\xb2\\x93\\xae\\xc7C\\x14ZO\\xa4\\x8d\\xe7m\\xab\\xde\\x0b\\xe3y\\xf3\\xe5\\x07\\xb4\\xe7\\x97\\x94<#\\xbd\\xd0\\xe8N\\xf3\\xeb\\x10a\\xff\\xd8z\\x9e\\x04\\xec\\x1f\\xbe\\xfa[I\\xd0~\\xf8s\\xa1\\xe3\\x98\\xe1\\x0e\\xc8\\xab\\x9c\\xff\\xed?}\\xffE=~\\xbaV\\xb8\\xb7G\\xe6\\xb5\\x1a\\xa2\\xd0\\xf3F\\xb1\\xfc\\xf0\\xc3gg\\r\\xb8\\xedw\\xf1\\x19F\\xd9\\xa9&CN>\\x1bS\\x83V\\xce\\x89u>-\\xb1\\xdd\\x00?pL:x%s\\xa9u\\r\\xc6\\x11?\\xb2\\x15\\x9eJG\\xde\\x17\\xba>|\\xfb\\x874\\xff\\x81\\xfd\\xf3\\xb9\\xed3\"\\xed\\x9f#\\xcd\\x7f \\x1fU{\\xa5\\x84\\xa8\\xdd\\xb7N\\x80(\\xf4ySq\\x95o\\x9c\\xfa\\xddi\\xcc8\\x88B\\xdb\\xab~\\xbd={C\\xaf\\xf8\\xd4\\t\\x10\\xa1=\\xc4V\\x7fKh\\x0f\\xe1Ko$9\\x07\\xe9\\x8d\\xef8%\\xcd\\x7f\\x84^?\\xfd\\xdc\\xce\\xdbm\\xf4\\xc7!\\xaf\\xa8\\xd0{\\xf6\\x10\\x85\\xa6\\xb7\\xbc\\xe2z\\xe4\\xa5\\xef\\x90\\xe2\\x05\\xc0q\\xfao\\x8b\\xeba\\xd7\\xa4\\xd65\\xef\\xb8\\xee5!\\xd2\\xf6\\x0fi\\x9c\\xe6\\xd7\\xbc\\xe4p\\xd26\\xf9\\xea5\\x85\\x07\\xe5u\\xee\\x18\\x89_\\xdf#\\xd4\\x07\\x9e;v\\xb6\\xa1\\xc4\\xf8M\\x9fI?C\\xfcR\\xe3\\xe2\\x88\\xe5\\xf7\\xd4\\xc9\\xe1i)S\\xa8e6D\\xa1\\xdb\\xcdm\\xe1\\xdd\\x92W\\xb3\\xc6&A\\xa4\\xa5k\\xda\\xf5\\x12\\xbe\\xf6\\x83S\\x84r\\xa0\\xfd duD\\x82\\xcf\\xa2\\xf4\\xbf1V\\xf3\\n\\xadn\\x8cu\\x1e\\r\\xe3\\x93\\xe75\\xdf\\x86\\xf6\\x83\\x0f\\xce\\x8d]\\xdb\\xd6o\\x96\\xdf\\x0f\\xd5!\\x86\\xe4\\xde\\xc7qd\\xf8\\xc6\\xa78\\xf8\\xfcq\\x83\\xcdKK\\xb5\\x86\\x88+\\x1c\\xecP~\\xfd\\x8da\\xf7u\\xbd\\x12\\x8e\\xa6^b\\x1dS\\xed)\\xcbI+V+v\\xfc:W\\xec\\xaed\\xb3~\\x00\\xcb!\\xd1\\x01\\xd4\\x0f&\\x7f\\xff\\xe4\\xaa\\xfb\\xf0Q\\xfb \\xd2\\xd6\\x87\\xc4Ga}\\xdcG\\x87o;\\xae\\xb1\\xfc\\x05Qh;l\\xf5y\\xcbW\\x0c\\x99\\xdb\\xa3\\x0eD8~l\\x8d{\\x0c\\xcb\\xb1\\xb0\\x1a\\x89\\x94aw}\\x15`\\xff\\xe1\\x0bu\\xc7\\xfb\\xf9w\\xc1\\xee\\xbd\\x87\\xec\\xc03\\xb97\\xde\\xff\\x01\\xae{\\xdf~\\xef\\xed7\\xf0\\xc7o~\\t\\x94\\x8b\\x9fz\\xf7\\x9bv\\xef|f\\xf7\\xeec\\x1f\\xf9\\x1b\\x1f\\xb9\\xff6\\xf7\\xa6R\\xef\\xfc\\xa2\\x9d\\xfd\\xc7\\xfe\\xe8\\xc7\\xf2\\x1f\\xf9\\xa7on\\xc0b\\xed\\xde\\xfd\\xc5wZ\\xedmK\\xda\\xc1\\x8f>,\\xc6\\x0e\\xde\\xb6{\\xe7\\x97\\xdf4\\xc8\\x87\\xd5|\\xdbQvo\\xab\\xfc\\xb1\\x7f\\xfd\\xd1\\x8fH\\xd5\\xc4\\xbfl\\xf7\\xb6\\xc4\\xf7\\xcb\\x86$\\x94\\xfb\\xd9\\x87\\x9f\\xda\\xc1:\\x11\\x0b\\xfd\\xc8w\\t\\xff\\x8e\\xf4\\x07\\xec\\xdf\\xf9\\xcb\\xa4^\\xfe\\x08\\xfd\\x92h\\x07t\\xce\\x9b;vV%\\xa3\\n\\xd3\\x85\\xb3;\\x0b\\x06 >meuZ\\x85*\\x8c=]\\xa0\\xdc\\xd2\\xf8\\xda\\x06GG\\x83\\xa3\\xcc\\xe0\\x18ipd\\x8d\\x8e\\x83\\x98\\xf8\\x06\\xf1\\r\\xe3\\x9b\\xc4;\\x99\\x9d\\xba\\xfa{\\xa2\\xd4\\x1f\\xa5\\xf1\\xce\\x06gg\\xa3\\xb3\\xb3s|S\\x93KS\\x177\\xa3Ks7S\\xf3f.\\xee\\x86\\xe6\\xdf\\x1b\\\\\\x9b\\x19Z4\\x8b\\xff!\\xbeMV]\\x0fV\\xc3Hu\\xad\\xfc\\x18\\xad|X \\xa3b\\x99V~\\x12V7\\xac\\x07\\xa3\\r\\xed\\xa0\\xd6F\\xa2\\x9cV\\xf7\\xf6)\\xad:\\x0c?\\xa5e\\xd8\\xf7\\x9fJh\\xe7\\xe1\\xef\\xe5\\xed\\xe3\\xd1\\xd5\\xd0\\xae\\x9d\\xa1\\x9dWV\\x8bv\\x12\\xf4\\x9c\\x87T:\\xac#\\xa3\\x921\\xdaV>\\x8c^7\\xccG\\x1f\\x19\\x8a\\xae\\x03Pm\\x86\\xa1BY\\xb5\\xaa\\x95\\xeb0\\xf4\\xbb\\xaa\\xc0h\\r\\xf7\\xabl\\x96\\xc7\\xa7}o\\x98?#W2\\x83[\\xf5f\\xd8\\xacFo~\\xe2#_sy\\xbf87\\xfag\\xdf-\\xe2u\\xed|\\xd4\\x916\\xd6\\xae\\xd1\\x9b\\xef\\xe5>\\xeb\\xa7\\xd4k\\t\\x7f\\xed?>\\x9b\\xd7\\xef\\x92\\xab\\xb1\\xe5\\xcd\\xa3\\xb9\\xb7\\x9b\\xbfw;\\xa5\\x9dZ5 \\'\\xd3.Rc\\xf2\\xf2\\x08lo\\xf0\\n\\xdc\\xe0\\xc5\\xc8\\x15*\\x85\\x8ei\\x85.\\xde>\\xee\\xa1\\xd5\\xbd\\xbd\\xe3\\xad\\x92\\xbdw\\'\\xc9\\x8b\\t\\xd329?\\x83/\\xfd\\xd4,\\xbe\\x0c\\xd0k\\x0c\\xed{\\x19:\\xf4LF\\x14\\xc4(\\xc2T\\\\\\xb3\\x9a:\\xf5\\xf6\\xeb\\x14\\xefm\\xf0\\xf61t\\xeel\\xec\\xdc\\xd9\\x1f\\xbd\\x03\\x0c]\\x03\\x0c\\xdd\\xbc\\xb2\\xdc\\xba\\xa9\\xd5\\xb2\\x9cB>Z\\xc3\\x8f\\x91e\\x07\\x85\\xea?\\x7f\\xcd\\xf5\\xa34O\\xff\\xb5\\x0fJsx\\xf35\\xc2\\x13F\\x9f\\x0e~\\x06\\x1f\\x1f\\xa3\\x8f\\x8f\\x1fz\\x07\\xa4\\xa0_\\x7f\\xdd\\xd6\\x12\\xad\\xecM\\xa6\\x9b^\\xa9K\\xc6\\x19_\\xad,\\xf9\\x9d\\xfe\\xcfj\\xf4q\\xc2Q\\xb3,\\xd7\\x82\\xefu\\xe5\\xfa\\xf7\\x1e\\xc57\\xbc\\x98\\xc8\\xe4w*\\xf5\\xe6\\x07\\x01\\xc5|\\xec\\x07\\xb3\\x9a\\xd8\\xd2\\x1a\\xeb\\xdf{\\xf8\\x9d\\xe2?~\\x03\\xb5\\x9a\\xd5\\xf75\\x0b1\\xfa\\xfaw4\\xfay\\x05Z\\xfc\\xda\\xfb\\x07\\xf8\\xfaX\\xfd\\xfc}\\xbd\\x82\\xda\\x05\\x1a\\xfd\\xfc\\xfdL\\xe8]7\\xc5O\\xad\\x94h\\x15\\xbah4\\xec\\xc2R\\xde\\xfd\\xe9\\x94w\\xff\\xeef?\\xbdJ\\xaa\\x0bP\\xc8\\x18\\xee\\xef\\x0c\\xcb\\xc9\\xe5\\xdc\\xf3\\xd4J#\\x887\\xbb\\xeb\\xd5\\xbawnz\\xab\\x14\\xe4o\\xbe\\x7f\\x93\\xfb\\xe6\\xf2\\xb7\\xd9v\\xea\\xc8\\xc8w\\xb2^\\x126\\xfc\\x9d,j=\\x85\\xc1\\xdf\\xd3\\xe8\\xef\\xe9\\x8f\\xde\\x01&\\x7f_\\xdf@\\x83\\xbf\\x9f1\\xa0w7C\\xa0\\xef:\\x02a\\xae\\'1\\xe9u\\x84N0\\x04u2\\xf4\\xf04\\xf6\\xf0\\xf4B\\xef\\x8e\\xe8\\xed\\x83\\xde~\\xe8\\xdd\\'\\xe5\\xdd\\xc7\\xdef:2\\xda\\xb7\\x19o\\x95<\\'\\xf3\\x9a,\\xd52cO\\xaf@CO?cO\\x7fOCHH\\xbc\\xc4 \\xf9\\xde ii\\x95\\x84*\\x94\\xa87L\\x92P%\\xb3\\\\\"\\x8dP\\xa9\\xa3\\x94\\x8c,,\\x92Q\\xe9\\x8c\\x12\\xa9\\xd2,\\x91\\xaa#5V\\x89t\\xa0^\\xa1e\\xd0\\':\\xb3D6H\\xaa\\xb4\\xa04R-\\xb3H\\xe4r\\xb5Vf\\x96\\x84\\xa1\\xe7\\x13%\\x1c{x\\xfdM\\xa52\\x11\\xbd\\x990F\\xa6\\x8c\\xb6H\\x94\\x91jVg\\x92(Y5\\xba\\x8e\\x92D\\xb3\\x06I\\xa4I\\x82\\xbeo\\x90\\xa8\\x8c\\x12\\x15\\xfa\\x19\\x95\\xac\\xa9Zk\\x95\\xa8\\xd4\\xbapF\\x8b>B_\\xd2h\\x18\\x89\\xd6\\x8c\\x00q\\x1e\\x94j\\x19\\xa9B\\xa2c\\x92\\xb9K\\xb5F\\xcb]\\x1b%Z\\xc6 A?\\x86~[\\xa7C_\\xd3\\x0f\\xb6\\xa2\\xb7F\\xc2\\xb2\\xc6PI\\x98\\t\\xbdY\\x94\\xb0\\x8c\\x99Kd\\x86P\\xc6\\x1a\\xcaH%z\\x961\\x852\\x8c\\xca\\x12\\xca\\xa0?\\xcf\\xa4\\x84\"\\xb6\\xa6\\x97\\x85!\\x8aVF\\x9bC\\x19\\x84\\xe8\\xb6R\\x89\\x12V\\x97\\x10\\xcaD)\\x94HJ$\\xe1\\x0bFf\\x0e\\xd5\\xa2\\xffk\\rE\\xfd\\x85\\x06\\x919T\\x8f>\\xcfIu\\xc6P\\xbd\\xce\\x82\\xde:\\xb5\\xca\\xfa\\x1a\\xd0\\x1f\\xd1G\\x1bB\\xa3\\rR\\x89E*\\x89d\\xb4\\x12\\xebk`\\x8dR\\x89\\xca\\x8c\\xdej\\x15\\xba\\xd2\\x9a\\xd0\\x9bE\\xb7\\xb4:\\x05\\xc3eX\\xc6 \\x95\\x9a\\xa59\\x8d/\\r\\x97\\xb02y\\x98Y\\xaaT\\xb3\\x8c\\x05\\xa5\\xa8\\x8d\\xac\\xaf\\x815\\xa1\\'P\\x06=\\x86\\xee%\\xe4\\xa0^%K\\x92\\xaaUR\\xa5\\x9eU\\xa8U\\xc9\\xe8R\\x8e\\xe8]\\xa5SF\\xa7\\xe4\\\\k#%:t\\x03}S5\\x80\\xbb\\xabc\"5J\\xd4\\x9a\\xcb\\xde^\\xa3&0K\\xd5z\\xa5\\xcc\\x82R\\x8d\\x92+\\x80\\x03\\x99E\\x86\\xee\\rb\\x12d\\x8c\\x94\\xe1\\xd8\\x80I\\x86\\xfa\\xdb\\xc2%\\xa8Ud\\x8cF\\x17n\\x951\\xac\\x06\\x89\\x14\\xa3\\x8c\\xd1\\x19e\\nM\\xa2L\\xc1JQ\\x9b)tIo\\xae\\xd8\\x04t\\xa9\\x93\\xa8\\xa4\\x8cA\\xa66\\xc9\\xd4\\xa1\\x03\\xcc2\\xae-\\xad9)#31\\x12i\\xb8\\x89{\\xd2\\xc2%\\x8c\\xcc\\xca(\\x99A\\xe8\\x1f&\\xe4\"kb\\x94,\\x93\\xccD\\xaa\\xb9\\x8a :\\x8bNdT\\xe8/\\xa2\\xbf\\xaf\\xb5\\xa2\\x9aF)T\\xe8\\xd9\\xd7(Kd\\x10\\xe9jr\\xa8\\x92\\xd1IM\\xcc F\\x95\\xc4%:=\\xf7E#3H\\x8e>\\x93\\xb3Vf\\xb0\\x04\\xd5\\x9dId\\x06K\\xf5,7\\x1a\\xd0\\x95\\x06\\rLT_\\x13\\xbaRZ\\xb9D\\x82\\xc4\\x00\\x13\\x8d>\\x88fX\\xa3\\x1cu\\x9b\\x9ca\\x94V.\\xe1\\xa8F\\xce(uV$R\\xb9\\xaa%\\xbfF\\x05W\\x88\\x195:\\xab3\\xcb\\xd5\\xe8\\x97\\x13rR\\xf4\\xb4\\x11\\xd1\\x9eI\\xaeUG\\x9a\\xe4\\xfa\\x01\\x8a\\x049\\xe2\\xab\\xdc\\x8f\\xa0\\x0b\\xc4fP\\xb5\\x12\\xf1\\x05k\\nC\\x03\\xc1\\x18&\\x1fl\\x08S\\x9b\\xc2\\xd4*\\x06%j\\x99\\x19\\r6\\x89\\xce\\x12\\xce\\x8d\\x13U\\xc2k`dFD+\\xa6p\\t\\xfa\\xcfh\\x1c1I\\xe1\\xa8\\xa1\\xd5Z\\x85T\\xa24\\x87\\xabCC\\xa3\\x8d\\xe1\\xea\\xa8x\\x85\\t\\xd1\\x83\\xc4\\xa0\\x90\\x1b\\x14*\\xab\\x82#\\x14\\x19\\x93\\xf8\\x1a\\xd1\\x1fHF\\x8d\\xc6J%\\x1a\\xae\\t\\x92\\x14*\\xb9R\\x8f\\xda\\x96\\xd1&\\xbf\\xbdd\\xb9ku.\\x19\\xa1k\\xd4\\xeah\\xa4p\\r\\x80\\xae\\x07p\\x89\\xda\\xa0`\\r\\xa8\\xfbP_3J\\xb9y\\x00\\x1a]\\x8c%\\'\\x95%q\\xc0\\xf5\\x86Di\\x1a\\xa0G\\\\\\x01q\\x9cP3\\x97\\xb0\\xdce\\x94I\\x89\\x98P\\xa2R\\x82\\xb8\\x96\\x1au\\x87Y\\xc9\\xa0\\x7fo\\xc9IY\\x94A\\x8c\\xd2\\x92\\x93\\xb2&%\"\\x16\\xf4\\xc9 FiR*\"\\xd0\\xc7(A\\xcc\\x06q3\\x9d\\x92A\\x1f\\rb\\xac\\\\2\\x88A\\xbf\\xa9V\\x85Y\\xb8\\x04\\x91\\xacR\\xad\\x8e\\xb0p\\t\\xa2+\\x0e\\xb8\\xff\\xadT\\x0fB\\xdf\\xd7\\x0f\\xd6k\\xa3\\xe3#M\\x91\\x92\\x08\\xc6\\xcc%\\xac1R\\xa2BYU4J\\xb4\\x11\\x86H\\xc6\\x14\\xc9\\xa0Q\\xcb%,\\xbadtV\\xae&\\xa8\\x15\\xcc\\x91\\x8a\\xb0p\\x9d9\\x12uN4\\x97\\xea\\xc2-9)z\\nq\\x18\\x13\\xc7\\xfe\\x0c\\x91(\\xa3G\\x84\\x1d\\x89jm\\x89\\xd4s\\xf4g\\x88\\x8c\\xb6DFsmdT9\\xea\\x8c*&\\xcc\\xacRD\\xa0\\xb1\\xa9\\xe2x\\xa3JmT\\xa9e&\\xf4f\\xd1\\x85\\xce\\xca1G\\x8eBT\\x9a\\xd7\\xcc\\xd7\\xacb\\xf5\\xa1\\x03\\x12sR\\x8e\\xe7YT9\\xb2\\xd9\\xfa\\x1ar\\xb2\\x1c\\x8bF\\xe3\\x0b\\xcd\\x00\\xac\\xa8\\x81\\x19-\\x1a\\xbb\\xb9(3\\xa8\\xe5f\\xb5\\\\\\xc7\\xa8\\x8cj%\\xca\\xa8L\\x88e0F\\x8e\\xba\\xd4*e\\xb4A\\xad\\xb1\\xa85\\\\\\xd5\\x0cj\\xad9\\x87+[rR\\xd6\\xa8\\xd6k\\xad\\\\q\\\\\\xb55\\x1c\\xc7\\xb1\\xbc\\xee*\\xab\\x86\\xd1\"\\x18\\x9c\\x98\\x8b\\x88%h\\xc2\\xd5:uJN\\x1a\\xa6\\x95h\\xd0\\xd7\\x97\\xbd\\x9ba-99\\xd6\\xaaQHuz-cA_S!Y\\xa4A\\x7f\\x19%\\x88#\\xe4p}\\xd4\\xe5\\x08\\x11C1!\\xd0p\\x9f\\xa1\\x7f-K\\xcaE\\x8eW!q \\xe5\\x1eB)\\x9b\\xc0\\x89\\x07F\\x8b\\x86\\xb6F\\xab3k\\xb8A\\x14?\\xd0\\x8cx\\x804\\xc2\\xa2\\x95pUH\\xd6J^\\xf3\\r\\xf4\\xcbo\\xaf\\x870f-\\xc7xP\\xaaDr\\x0f\\x95\\xa4\\x8c\\xb6\"\\xc2\\xe6\\xa6Of-\\xd7\\xbd&n\"\\x17\\xcf\\x9aX\\xc4\\xc0\\x8d\\xac$:\\x81\\x952*\\xa4\\xcb\\xa8\\x13\\xf1\\x05kd\\x19\\xc6\\x82\\xde\\x1cQ!P\\x99Y\\x8eV\\xcdl8\\x92T(U\\xc8u\\t9)\\xf7\\xa7\\xd9p\\xb5\\x9a\\xcb\\xa2\\x14e-\\xe8\\x021\\\\+\\x1b\\x8e\\xe4\\x06\\xa35\\xb3\\\\\\x89\\x16V\\xc1\\xb5\\x08\\x82\\x1c\\xd6\\xc4*\\x10\\xd1p\\x7f7\\xe9\\xcd\\x15kf#\\x14HV\\xa14\\x92\\xbb\\x8cd\\r\\xac\\xd2\\xc8*\\xd1\\xe7\\x91\\xe8\\xbb\\x96\\x9c\\x14}\\xa66\\xb1\\x9c\\xa0\\xe0\\x12\\xd4\\xc5\\x89\\x1c\\xea\\x14\\x91h\\x14!\\t\\x16\\x8d\\x12\\xd4T\\xa8\\xa6\\x92\\x88\\x84\\x9c4\\xe7\\xefi\\x18\\xc4\\xf0sR\\x96\\xcb\\xa8d9\\xa9\\xce\\xc4j\\xd4\\xe8a\\xc4V\\xd0\\xafs)\\x8b@\\x8b\\x18c\\xc2k\\xe0\\xbe\\xa4\\x0f\\xe5\\x86 \\x8b\\xa8\\xdd\\xca\\xea9\\x01\\xcee\\xb8\\xe7Q\\x82Z\\x15\\x81\\\\\\x82\\x88M\\x87d\\xb4\\x0e\\x8d3\\x8b.\\xa7H\\x13\\xd7\\x9d(\\xd1F\\x9a\\xb9\\x845\\xe9\\xc2\\xd1\\xf0C\\x89\\xce\\x88\\xba\\r]\\xa0\\xf6\\xe4\\xfa/\\xe72\\xda\\x9c3\\x18,9)\\x9b\\x93\\x89@\\x9f+\\xb8KNL\\xa2T\\x1f\\x16n}\\r\\xba\\x84\\\\d\\xd1\\x07Z\\xee\\xca\\x88\\xe4\\xac\\t\\xbdQy\\xa8\\x19\\xcc:\\xa4\\xdc\\xc8\\x0c:\\xb5Y\\xa7\\x96I\\xa2\\x8d:5\\xba\\xa9F\\xe3_\\xa7V\\xa3\\x0bu\\x04\\xfa\\x1c\\xd1(\\xba\\xd4\\xeb\\xac\\\\\\x92S\\xb2\\x16\\xb1Y\\xa5Q\\xa7\\x8dF\\x97\\xd1\\xe8\\x93$=7\\x9d\\xe4$\\x9bl\\xd9\\xdbKn\\xc4\\xeaU\\xa8\\xd1\"\\x18\\x95A\\xaf1r\\xda\\x07zk\\xcd9R\\xc04\\x88A\\xdf\\x1f\\x84\\xf8\\'\\xfa+\\x83\\x14LT\\x12\\x97 \\xd9\\x81\\xbe\\x9e\\xfc\\xf6\\x925F!\\xf6\\x17%\\xd1\\xa1\\x16\\xcdI\\x19\\xee\\x93hC\\x14c\\x8a\\xe2T\\x95(\\xd4H\\t\\\\\\x82\\xd8\\x9d\\x16\\xe5PKEq-eE)\\xd7d(\\xa7@\\xa4\\x8dR%c\\x8c\\nW\\x9b8\\xd1\\x88\\x12$\\xb0\\xb9\\x04\\xd5\\xc8\\x1c\\xa5\\xd6\"5&\\x8a#\\xc2\\xf8\\xc1\\xe6\\xc1\\xdc\\xc0\\x8e\\x8f6Es:\\x18\\x97\\xb0\\xc6h\\xb5\\x1e)&:v\\xc6(\\xb3\\\\\\x894\\xab\\x19\\xa3S\\x91\\xb0\\xe9\\xafWql[\\xd5\\xff\\xb5Iq{2BU\\xff0\\xd4\\xc8\\x1av\\xc6N\\xfb\\xe9\\xff\\x07@\\xb9\\x9c\\xa6'", "year": "2018"}, {"Unnamed: 0": 376144, "autor": "Photoskeptic", "date": 1529843400000, "content": " I've been in negotiations to buy an M9-P chrome, serial #3980325. This serial # doesn't seem to jive with known M9-P numbers. M9-P is stamped on the hotshoe and the sealed tag on the bottom plate also has M9-P on it. Is it genuine or an updated M9? Thanks for all replies, John", "link": "https://www.l-camera-forum.com/topic/285888-question-about-m9-p-for-sale/?tab=comments#comment-3542861", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": " i've been in negotiations to buy an m9-p chrome, serial #3980325. this serial # doesn't seem to jive with known m9-p numbers. m9-p is stamped on the hotshoe and the sealed -----> tag !!!  on the bottom plate also has m9-p on it. is it genuine or an updated m9? thanks for all replies, john", "sortedWord": "None", "identifyer": 37453, "doc": "b'x\\x9c\\xedX\\x0bX\\x14\\xd7\\x15^\\xd4h\\xd4\\x1aA-*H!j\\xa5Z\\x10\\x11\\xa1\\x9aJ\\x91\\x87 D\\x97\\x15\\x90G\\xa4\\xd0\\xd9\\x9dawqwf\\x98\\x99\\xe5a\\xb0\\xa4\\x9a\\xa8\\xb1j\\x11#\\xbe@\\xd9\\x9d}\\xa0,\\xd2\\xf0\\xa9\\x80\\x0fT\\xc4\\xc4\\xd4\\xa2T\\x9a\\x98-F\\x8cR\\xdb4(\\x15R\\x1f\\xf8 \\xb30\\x17\\xf16Sw\\x0b_\\xd2~\\xed|\\xdf\\xcc?\\xff\\x9c\\x999s\\xce=\\xf7\\x9c3\\xf7]S&F\\xd1J\\x02g\\xe7\\xcc\\xf65 \\x0cC\\xd1\\xc5\\xc1\\xa1\\x91Q\\xaf/]&\\x8e\\x9648\\xd478\\x9ckp\\xf8\\xc0\\xc8\\x10\\xab0\\x9c>7\\xe5S\\xa7\\x07\\xe1u\\x9d\\xaf)3a\\x94\\x8bz7j\\xf4;M\\xd1\\x11e\\xa9\\xfb\\x1cz\\xf9\\x10\\xd1\\xf3\\xdbP\\x1e\\x1d\\xa0\\xeb\\xe7\\xa1\\x0b\\xee\\xee-\\xe4\\xf4\\x82\\xdap\\x80\\xa7\\x16\\x87etWO\\x0cN\\xe5\\xe5W\\x7f\\x18\\xe4\\xe3qo\\xfd\\xc9r\\x01=\\x80w\\xf3\\x1b\\xb8~G\\\\\\xf3\\xb7\\xb6\\xa2\\xfb\\x99\\x80\\x1f\\x8e\\x99\\xac\\xd7$\\xfer\\xe6\\xb8\\x8b\\xc7n\\x04\\xdd\\xbfu\\x01\\xf0\\x04^\\xbe\\xfbQ\\xac\\xd7J\\xe6\\xed\\xbc\\x1d\\x02z\\xc0g\\xc3z$\\x7f\\x1f_\\xff\\xf2\\xe6\\xdcs\\x80\\xfbx\\x9e\\xa9\\xffb\\xf1\\xd1r\\x80\\xf7Z\\x0c?0\\xcfq\\xce\\x07z\\xe6&\\x15 \\x9d\\x9f\\x8c\\xf6_\\xda\\xb8\\xa6]_\\xdf\\x9a\\x01\\xeb\\x01\\x1b\\xacG\\x1b<?\\xcb\\t\\x19S\\x02\\xb8\\xac\\xb2y\\xbbw\\xady&\\x8c+\\x80_\\xd3Rn\\xcf\\x95\\xdeq:.`O7\\xb4\\x81\\xeb\\xf0\\xf8\\xb4\\xcdJ\\x9d\\xb0\\x999\\xb0\\x01\\xa0\\xd3\\xa2+\\x85\\x0fwv\\x85&\\xf3\\xf27\\x97\\xbaMziy\\xcb\\xa8*;\\xf5\\x8c\\xce.\\x0c\\x18~\\xec\\xe5\\xc9\\x80\\xe7?\\xf4p\\xa8\\\\\\xb0o\\x1e\\x8c)\\xbc\\xdc\\xab\\x11\\x8d\\xd8\\xd4aZf\\xef\\xf8\\xc0\\xf6\\xbc\\xfa\\xc8\\xbf\\xf8\\xd1\\x07A\\xeb`DyyJU\\xceew\\x8b\\xe3\\xb9\\xb3\\x02z\\x9e\\n\\xd8\\xd3\\x18\\x1e\\xa3\\xba\\xdb\\x955\\x1f\\xf0\\xc5\\xcb\\x0f\\x15\\x14\\x17o\\xfa\\x03\\x8co\\xf0\\xf2\\xdd7X\\xd75\\xc5\\x9f7\\xed\\x17\\xd03L\\xc0\\x9e\\xba\\x84\\xc2x\\x97\\xad\\xb2\\x1c\\xc0\\xaf\\xb7\\x93\\x9f\\x15\\xed\\r\\x7f\\x0c#\\x18\\x9f\\xca\\xe9\\xe7#\\xca~\\x96\\xf1\\xc7\\xd8\\xd7=\\xa7\\xde\\xab-Cl\\x9d?>\\xa7\\xafuM\\x9dWU\\x04\\xf8\\x91\\xf7\\xf7\\xecp\\x16\\x8d\\xc8\\x83\\x11\\xe1\\xe5O\\xb6|\\xf2\\xbb\\x06W\\x11u\\xd2\\xce\\xf1\\xb9\\\\>\\xfb\\xd4{\\xef6\\x1c\\x01<:ma\\xf0^\\xcb\\x83\\xd50\\xdaj\\x8f\\x90\\x1e\\xd8\\x9e\\xd6\\xd5[.]\\xab\\xd9\\xef\\n#\\xac\\xa7D\\xc0\\x9eG\\x02q\\x00\\xeb\\xa9qv\\xf9\\xf5\\x96\\xdb\\x8f\\xa7\\xc1\\x88@r!\\xbf\\t\\xcd\\x9f\\xf6\\xa1\\xefU4\\xbe\\xf2f\\x13\\xe0)\\x0b\\xdbOL:|r\\x07\\x8cq\\xbc\\xdcrhX\\xfd\\xc6\\x0fs\\n\\n\\xec\\x1c\\x1fy\\xb7\\xab\\x9b\\xf6\\xf2T\\x1a\\xf0a{\\x0e^\\xda\\xe0\\xb00\\x1bF\\x19/\\xcf^\\x91\\x83;\\x8e\\xd9Y\\xb4]@\\xcf\\x13\\x1b\\xf3\\x8e\\xa8\\xe6\\xa3\\xb6\\xecp/3\\x8c?\\xe7\\xc5\\xc9\\x1e\\xe3\\xab\\xbf\\xcc\\xedd\\x12K\\x9b*o\\xd2\\x9e\\x95\\xa0\\xdelp\\xf8\\xd7~;:\\xd2}\\xef;U~\\xce\\x80\\xeb\\xea\\xccK\\xdb,y\\x150\"\\x90\\\\h|:\\x04\\xf4x\\xc5\\xacNKM\\xd9\\x08>W\\xb4\\xec\\xc7\\x85[\\x1a[+]a\\xb45\\x1f\\x00\\x0e\\xbbI\\xf3U{\\x8b\\xf7%\\xcdx\\xc0\\xbf\\xeb8\\x80\\xe7\\x8fP\\xdd\\x06\\xe3\\xf5\\xa2\\xf9\\xb3\\xab\\xc4\\xbd\\xe9F\\xc3O\\'\\x034\\x96\\x10c~S\\xf7\\x0f7PO\\xc7=\\x19w\\xe0jB\\xe4\\x19\\xa1\\xba \\x94\\xdf\\x92\\xaf|%Y\\xd9\\xd6\\x91\\x08\\xb8#[q\\xa6jd\\xf2\\x94#\\xc5\\xbbBF\\x9d\\x0f\\x18\\x0e\\x10\\xd4\\x9f\\x1b\\xc7[\\xe7\\x84;E\\x0e9`\\xa7\\xdfFv\\x94^\\xc8x2v1\\xe0\\xaa\\xe6][\\x8b\\x17=\\xbd\\x0c#\\\\\\x7f\\xec\\xed\\x0f\\xe0\\xfa\\xf3m\\xd5S\\xd1\\x87\\xd1]\\xfb\\xaf\\x1d\\x1e\\x01#lO\\xdd\\x00\\xeb)N\\xbd\\xa5_xy\\x7f9\\x8c\\x83\\xdd\\xef\\xfc~\\xd7\\xe1\\x07\\tEy\\xd10\\xda:\\x7f\\x84\\xea6<\\x7f\\xfe_\\xb7m\\xd3\\x03\\xdb3j\\xca\\t\\xbc\\xbb)\\xff:\\xc0\\xdf\\xf2\\x0f\\xda\\xda\\x8f\\n\\xd5m\\xb8\\x1f\\x1dh]\\xb8oc]xQ\\x1c\\x00{^\\x14\\x07\\xf0\\xb4\\x84\\xed\\xf9O\\x8b\\x83Cv\\xe6k8\\x0eB\\xaa\\xdb&\\xa2\\x99\\x89>\\x00\\xe1\\xff,P\\x17\\n\\xed\\xb4\\x07\\xae\\x0bw\\x0f\\xb2]\\xb7+F\\x9d\\x07\\xb8\\xbe\\xe2\\xc9Y\\x17\\xff\\x8a\\xb9 \\xbf\\xfd\\xbb\\xffs/\\x8d>5!\\xc8\\xf7\\xe1&\\xc0\\x8f\\x07\\xd4\\xaev\\xdb\\x17.\\x86q\\xb0\\xf3[\\xc1\\x1e\\xda\\xdf\\x98\\xf6\\x8a\\x1cF[\\xfb\\x10!\\xbf\\xdd\\xd9\\xe9\\x98|\\xbd\\xfa\\xe8C\\xc0\\xff:\\xa4j\\x92c@]\\x1e\\x8cp\\x1c\\x08\\xcdS\\xa1\\xba\\x00\\xc7\\xc1\\xc7\\x11W=7{\\xbf\\xef\\x0ec\\x12/\\x9f\\xe5\\x9d\"\\r\\x9ef\\xe9\\xdci\\xa7\\xdf|J\\x83\"S\\x96Yf\\x0c\\x96\\xdf\\x04\\xd7) \\xbf\\r]\\x9f}\\xeb\\xf4\\xc5\\xe57\\x01\\x9aW\\x04F%.q\\xfb\\x14\\x8e7{\\xfb78\\xde\\x92\\xc7n\\x1b\\xe1\\x19\\xe2\\xf2\\xf4\\x9f\\x90\\x97\\x83\\xf1\\xd9#\\xa0\\xe7\\xb1\\x8d\\xe3\\xf3\\xdf\\x12\\xd7\\xb6\\x8e\\xcf\\xc7\\r9\\x7f\\xa6\\xc6\\xcd\\xae\\x85q\\xb0\\xfb\\xeb\\xed\\x7fZ\\xb3\\xd6\\xe9\\xd4J_\\x18m\\x9d?B\\xffY\\xf0\\xf8\\xb4\\xcd\\x0b\\xbc\\xee\\xe3z\\xd4\\x04c</\\x07}o\\xfe\\x00\\xfb\\xc4[\\x9a\\xda1]\\xba\\x18\\'\\x80`\\x1d\\x0e\\xc45\\xc8\\xd7B\\xf1\\xd6)`\\x0f\\x9c\\xaf\\xffW\\xfb*\\xa1u\\n[\\xe3\\xe0\\xdb\\x9a\\xa7\\x9e\\x93n\\x7f\\xef\\xe2\\xf8\\xc9[a\\x84\\xd7{\\xed]O\\xd4NS\\x9fI\\x8c\\xba\\x0e\\xdc2\\xe0\\xfe\\xadK@\\x0f\\xdc\\xbf\\xd9\\xda\\x87\\xbc\\xa8?\\x80\\xfb78\\xaem\\xf5\\x9b\\xd0\\xff\\xb6\\x90\\xdfj\\xd6\\xae\\xc8\\xf6\\x9bqv#\\xe0\\xe5%h\\xf3Ot\\xf3\\xc7\\xc2\\x08\\xe7\\xb7\\xadv\\xd6m8\\xbf\\x9d\\xb8\\xba`wV\\xd4\\x17~0\\x0ev\\xdd\\x1e\\xe8:\\xacP>\\x80\\xd7a\\xbf\\xff\\x91/\\xd9\\xd1\\xbc\\xbb\\x0e\\xe0\\x84\\x03g}\\xff\\x12\\xd3\\xe22\\xd8u\\xdb\\xd6\\xfc\\x06\\xf2(XgY\\xcbs[\\xebv\\xb84a\\x9d\\x8an\\xc9\\x80\\xd1\\xd6\\xf9\\xf3\\xd0\\xc6\\xf9\\x13;\\xab\\xbdt\\xc6n\\xafU\\x00\\x7f\\x14[\\x1a+\\x1a\\x92\\x94\\x0b\\xff\\xff\\xd8;\\x7f\\xe0\\xff\\x9f<\\x83\\xba\\xf5\\xb3\\xe1\\xf9\\xd7`\\x1c\\xec\\xfcv\\xb75\\xc0\\xe3\\xf3\\xec\\x89\\xc7`\\x1ch\\x7f\\r\\xebAiC\\xb1\\xb3\\x9b\\xd3\\x05\\x80\\xdd\\x07-\\xcb\\x17\\xad~\\xbb\\xc8\\xd6\\xff`\\xa1y\\n\\xfbm\\xa0\\xeb\\xd7B\\xf1\\x06\\xaf_\\'\\xcdT}\\x99Z\\xd9P\\x08\\xe3/x\\xb9\\xd3kWN\\xdf\\\\\\xe7\\xdbl\\x1e\\xe0z\\xbc\\x91&\\x11\\x19F\\xd7Gp\\xae\\xee\\xdd\\xac>\\xef9Z\\xcf\\xfb]\\xea\\xbb\\xa1o\\xb3^\\xe9{\\xaa\\xf7 2\\xa90\\\\\\xce(\\xe8\\xfaa\\xdc\\x1bE&\\x9a\\xa1\\x94\\xb8\\x9c\\xbe*\\xca-\\xd1zh\\xa7i\\xa7\\xb3\\x9e\\x99\\x98\\xd6K\\xeb\\xad\\x9dm\\xf2[0\\x7f\\x8e\\xdf\\\\\\x7fm\\x90ez0Mb2&P\\x82Qi\\xb9q\\x18Nc\\x81\\x12\\x84fr\\xe31J\\x1aNPj\\x8eQ\\x8c.4T\\x17\\x1af\\t\\x08E8q\\xb0L\\x96\\x1b\\x81\\xe1(F\\x05\\x8a1\\r\\x93+\\xd6\\xa8\\xa5\\xdcy,\\xa7,\\x97{\\x0bM\\xe0\\x81~\\xb9\\x12\\x8a\\xc0\\xe3rH\\xeee\\x14\\xcd?\\'&\\xd4v>7\\xab\\xef\\xb9o\\xb8\\xd7\\xf7\\xb9{\\xcd\\xa1\\x04\\x9e\\xdeCB\\xd5\\xa4>,8n\\xb1.,\\xae&\\x0cKS\\xe2J\\x06\\x0b\\xe4N\\x9e\\xdd\\x1eL1\\xcf$\\x918\\xfa\\x9c\\xe4`\\x18&\\xa70\\xee\\x9d\\x04\\xad_\\x92$Y\\xa2\\x8d\\xd4E\\x8auQQ\\x16\\xffe\\x04\\x81\\xf6\\xdc\\xfe\\x8d\\x1f\\xce\\xbb\\x8e\\xc2\\xe8g\\xae\\x0bW\\xe2\\x16\\x8f\\xbe\\xc7\\x04\\xee\\xd0\\x89\\xc5\\xacX,\\xe1\\xf6X3\\xf7\\xe6^\\x1b\\x10\\n-\\xe3\\xd5HT\\x1a\\xaa\\xac\\x9f\\xca\\xea\\xe7\\xd4\\x83/\\x0f\\xc3\\xd4&ILt\\xd8\\x8a\\xd08V\\x12#1K\\x08\\x15B)\\x99\\x1c\\xce\\xd5\\xf2C\\x12\\r.cz_L\\xa8\\xd5\\xfdh\\x18B+\\xfaQ\\xce\\x18\\xa5.&D\\x1f\\x13\\x1d\\x1d\\xa7\\x8b\\x8b\\xae\\x16\\x0c\\x87\\xf8\\x106>D\\xcc\\xed\\x12n\\x7f\\xc3\\xdc\\'\\x8c\\xc4\\xd3\\xd8\\xd4X\\t\\x8b\\xc8T\\x06DF\\xa8I#\\x82f\\xaa\\t\\x94ET*=\\xa2\\xa2\\t=\\xc21\\x1d\\x82\\xb3\\x08\\x8e\\x1a\\x10\\x92$h\\x16\\xd1d\\x9b\\xb8\\x9dDhZ\\'\\xc5\\xf4R\\x0c\\xc3\\x8dR\\x82a\\x085+\\xd5\\xe4\\xe8d2\\xa3LA\\x11j\\xac\\xd4\\xfa>B\\x83\\xa3z\\x197\\xd4,\\x8a\\x91\\xdc\\xce\\xe8PB\\x8f\\x12\\xd2t\\xee\\x80\\xd1l\\x1aA\\x99\\xe4\\x18\\xaeQ\\xe2\\x18\\xab@h\\xbd\\x02\\xc9\\xc4L\\n\\x82\\xa1\\x15\\x04\\xa6U\\xea8g+i\\x9d\\x92\\xd1\\xa7+31}:\\xa1\\xc0\\r\\xabp\"\\x0b\\xd7\\xa9\\x17\\xb0\\xb8\\'\\xc3\\xe2\\x98\\xbc\\x8c\\xdb\\tF\\x890J\\x027\\xf7;\\xa7Y\\x9c`Jq\\xb2\\xd7\\x1e\\x03Nk\\xa4\\xe9\\x07z\\x8e\\xd6\\x0f7\\xe2=cb\\xea\\x85\\x1ej\\xb5\\x93\\xc0u\\x04\\xa5%\\r\\xa4\\na0=i\\xfdL\\x92\\xc28n\\xf5\\xb8\\x89;S)1\\xda`\\xc5\\x1c=\\x8d!*\\xa3\\xf5\\x80\\xa1\\xdc9\\xa6\\xe6\\xce)%\\xa22\\xd0\\x0c\\xa2&M=G\\x0ce\\x19Dn`\\x14\\x08\\xbe\\xca\\xd8s\\xa4YF\\x81\\xe9\\x19\\x05g\\x15C\\x185$\\xca\\xe91\\xf5\\x02\\xaa\\xcfR2\\nC\\xb6\\xd5kz\\x19\\xc2\\xd0\\xdb\\xde2\\xa4\\xa9\\x109\\xbd\\xedW\\x95\\x9ckR5x\\x8f\\xe9\\xa9\\xbd9\\xa8\\xae\\x8cC<UN\\x11\\x1a\\x92\\xdeV\\xef\\x90\\xff5\\xeb\\xf7\\xdd\\x10'", "year": "2018"}, {"Unnamed: 0": 438051, "autor": "jonoslack", "date": 1537790100000, "content": "$4k sounds about right if we ballpark a SL2 at $7k with the same sensor, if we extrapolate from the D-Lux 109 vs. LX100 Hmm - you are assuming that the SL2 will just be a clone of the Panasonic S - even if the rumours are true I think this is extremely unlikely, It's one thing re-badging an LX100, quite another abandoning all your SL design and development department and using Panasonic (and losing the 'made in Germany' tag as well). I'd expect a body made in Portugal / Germany, a different interface, much simpler controls and a modified sensor (for M lenses) at the very least. . . . but what do I know? (in this case nothing or I couldn't pontificate!)", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/10/?tab=comments#comment-3598674", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "$4k sounds about right if we ballpark a sl2 at $7k with the same sensor, if we extrapolate from the d-lux 109 vs. lx100 hmm - you are assuming that the sl2 will just be a clone of the panasonic s - even if the rumours are true i think this is extremely unlikely, it's one thing re-badging an lx100, quite another abandoning all your sl design and development department and using panasonic (and losing the 'made in germany' -----> tag !!!  as well). i'd expect a body made in portugal / germany, a different interface, much simpler controls and a modified sensor (for m lenses) at the very least. . . . but what do i know? (in this case nothing or i couldn't pontificate!)", "sortedWord": "None", "identifyer": 51293, "doc": "b'x\\x9c\\xdd\\\\\\tT\\x13\\xd7\\x1a\\x06\\xb7*\\xd6\\x05wq\\xb7Z\\x9eV@\\\\(\\xf5\\x89\\xca\\xa2\\x16T\\x8c\\xa0\\xa8\\x15\\x81I2\\t\\x81d&\\xccLX,\\xd6\\xad\\xed\\xb1<\\xb5\\xa8OlUZ2\\x93\\xb0\\x08.\\xa5\\xef)J\\xc5\\xa2XDK\\xa5\\xd8\\xd6\\xc7s+h7\\x15\\x05mU\\xaa\\x967\\xc1\\\\\\x95\\xbf\\xbd\\xc7\\xc9K\\x8e}\\xe7\\xcd93\\xdf\\xfc\\xf9o\\xe6\\xcf\\xfd\\xb7{\\xff;\\x17\\xde\\xc9I$\\x19VCS\\xc2XOo3\\xc1q\\x0c\\x9b\\xe9\\x1f\\x18\\x1c2k\\xf6\\x9c\\xd0\\xb9\\xb2J\\xe7\\xb2J\\xe7c\\x95\\xce\\x9fest<I\\xb1\\xc7&7$/H\\xa1\\xbaw\\xd9\\xba\\x03\\xa2\\xc2\\xe9\\xe1\\x81\\xe8\\x9d\\xce\\x0f\\xe96N\\xad\\x0fg\\x80\\xe88\\x0e> V\\xaa~\\x88\\xf7\\xcd\\xed\\x0cq\\xa9\\x95\\x1f9\\xb4g\\xd1\\xd5\\xd4[\\xdc.\\xeb\\xf7\\xdaZ?Osn\\xfd\\xfcf\\xeb\\x81\\x9e\\xbb\\xaf\\xd3\\x90\\xedo\\xed\\x1f\\xdf\\xe7\\xd1\\xef\\x19\\x1dUT\\xdb#\\xfe\\x1b\\x84\\xdd\\xbc?,N\\x89\\xff\\xde5\\xd2\\xca\\x7f}\\xf6\\xa0~\\xed\\xe7]t\\x99]\\xb5\\xfc\\x86\\xa9\\xecr\\x02\\xec\\x0f:\\xa0\\x9c\\xce\\xc9\\x19>\\x1d\\x0ev\\xec\\x8fh\\xed\\xac\\xf4\\xe5\\x83~\\xe8\\xd5\\x05\\xe2\\x02+\\x7f\\x88*\\xaa~\\x9c\\xfc\\xbak\\xfaS\\xf4\\x06\\xe5@\\xbd\\xdd\\x1b\\x99\\xd3\\xc8\\xeeH\\r\\x83\\x18a\\xe5\\xd7\\x15_\\x1e;\\xc35\\xb8\\rN\\xceo\\xcd\\xad\\x0f\\x9c\\x9c\\xae\\r\\xef\\x9ep\\xb9_\\\\\\x00Q\\x0e\\xfa\\x93\\x83\\x91\\x83\\xe8\\xa7\\xc9\\xe1=k\\xda\\xbc\\xe4r\\xe3\\x02\\xc4h+\\xff\\xdc\\xc8\\xa9^Co\\xbf}h\\x97\\x8dz\\xbb^)\\x8ba\\xbb\\xf4+@\\xb4g\\xd4\\xcc\\xb5S\\x8c\\xa7\\xfe\\rQi\\xe5\\xbf\\x7f/|\\xcc\\x12\\xee\\xcd\\x15\\xefb\\xe4\\xdc\\xc3\\xe8\\xed\\xd5\\xcc\\xb7e\\xa7\\xaewvG\\xf4\\xe8Y\\xea\\xdb\\x1f\\x7f\\xf7\\x92\\x19\\xe2kHN\\x9d0`yf\\xed\\xe9\\x0fm\\xec\\xcf\\x91\\x85\\x19\\x11n\\x1b\\x14)\\x88\\xfe\\xb8\\xa0lb{\\xd3\\xd1n\\x10\\x91_\\x17\\x8e8>3\\x7fJ\\xc2WY6\\xfa\\x81\\xd7\\xa7\\x17~\\x1d>a\\xff\\x0eD\\xab:~\\xe4\\xd7=\\xed\\x8a\\x11\"\\xf4\\xebb\\x8c\\x9c\\x07\\x12\\xfd\\xcdQy\\xe7irJ{xF~^\\x11\\xdd\\x0f\"\\xcc;\\xfb1y\\x07\\xa77\\x98w(f\\xa5ir\\xf5\\x87\\xbb J\\xd5\\xdb\\xaf\\x12\\xf5\\xb6i\\x1b;1[\\xd5U\\rQ\\xaa\\xbf\\xe1\\xe2\\xf4\\xfa\\xd6\\xee\\x91\\xdf\\x16\\xedkBt\\xd0\\xf6\\xa8\\xf8/\\xab\\xea\\xd5\\x10\\xe7[\\xf95\\xbb\\xdb\\x95\\xad-O\\xd9\\xb4\\xc9F\\xfb\\xa8\\x9b\\x07\\x0c2V\\x0fg\\x11\\xbd\\xaab\\xd5\\xc9e\\xaf\\x12# B\\xbf\\xdeo\\xa3\\xbfA\\xbf>\\xd0\\xc7\\xedo\\xeb\\xeb\\xef\\xbf\\x00\\x91\\x00\\xfcC\\x189\\xb71rn\\xb4\\xfd\\xfb\\x9e\\xaa\\xae\\xaf\\x9fF\\xf4\\xff[\\x1eu\\x99^\\x90^\\xe7:y\\x0fD\\xa9y\\xf4\\x96\\xc4<\\x9a7~\\xd1_\\x96\\x0b{\\xb4\\x10\\xa5\\xc6O3F\\x8e\\xa3\\xe3\\x07\\xe5\\x87\\xa7\\xc5\\x8fk\\x9cG\\xd2\\xd8\\xcb\\xbd\\x13 \\xc6 \\xfe\\xa43\\x9f^Z\\xe3}6|\\x96\\xfb\\xf0\\xdb%\\xf9\\x84T?\\x80~\\xfd\\xcf\\x8f\\xb6m\\xe9\\xe3\\xf4\\xdc\\n\\x880Nq~-5N\\xdb4m\\xb8mJ\\xa9\\xbe\\x05Qj\\x9c\\xde\\x97\\x18\\xa7\\x1f\\xf4]E\\xa7\\x19\\x06U@\\x84\\xf9zQ\\xee\\xe9\\xc2K\\xac{\\xa1T?\\x80\\xf9:-\\x8b|e\\xd2P>\\r\\xa2T\\x7f\\x93:\\xafr\\x9d\\x97\\xb5,/tr{\\x881\\x88o\\xf5\\x03\\x9c\\xdep\\xfd\\x81z\\xcb;\\xcfU?\\xb8\\xdf\\xd4\\x08q\\x89\\x95\\xbfq\\x82\\xa9\\x97&l\\x84\\x87\\x19#\\xe7;\\x89\\xfd\\xc1\\xf9\\x1b\\xca\\xa3\\x19\\x9d\\xc7\\xec\\x96m\\xee\\x9c\\x85\\xf37\\\\\\xfc@9K\\x03\\x1a\\xf6\\x95&~\\xa1\\x81(5\\xbf\\xe1\\xe2\\xe7\\rS\\xe6\\x9a\\xf7\\xefNC\\xd3\\x0c\\xa7\\x92\\xe6\\x8c1\\xf1\\xfa\\xf4\\xe9\\x08o_4\\x0f.\\x18\\xdb\\'}\\xa1\\x95\\x8f\\xf2\\xdb\\x16\\x1b\\xe3G\\xd6\\xd0\\xb3\\xac\\xe3\\xba\\xd4c\\x88\\x8e\\xf0q\\xcdY\\xe7\\xe3\\xda\\x80\\x90z\\xe1\\xc0a\\xd3\\xc7\\xd7O\\xa1<\\x9a~m\\xc5\\x1c\\xdf\\xa0\\x90\\xde\\xff\\xc0\\xc8\\xa9\\xc5\\xd8\\xa7\\xf9\\xc5%U\\xd3\\x96\\x9d\\xa9B\\xf4\\xd9\\xdd9D\\xdd\\xe2\\x8a\\xc9\\x10\\xa5\\x8e?\\xed1\\xfdqt\\x1e\\xc5\\x8e? \\x8f\\xe2\\xe6\\xbd1V>\\x8a\\x1f\\x9c\\x1f\\xe0\\xfc\\r\\xc6OW\\xb7\\x0f\\xda\\xbamt\\xfd\\r\"\\xf2\\x83\\x1e\\x19\\x03\\xf7\\xed\\xdd5\\xb7\\x16\\xe7\\x078\\x7f;R\\xb9\\xa4jd\\x9bm\\x8f\\xc6\\xb9\\x97\\xce,8\\xf3a\\xce\\x04\\x05D\\xa9\\xf5\\x9c\\xd4y/\\xf2c\\x88\\xa8?Q\\xfbS\\xaa\\x87\\xd4t?\\xf6\\x9e\\x8d\\xf3\\xd1\\xaa\\x19a\\xda\\xc6_\\x93|\\x11\\xfd\\xac\\xea\\x1f\\xcf\\xb4\\xc3Wt\\xc3N\\x16B\\x84\\xe3\\xcf\\xdf\\xed\\xac\\x7fJ\\x0e,\\xf8\\xac\\xb6v\\xd6\\xf3\\x10\\xff\\xd7\\xe6!R\\xe3\\xe7\\xf4\\xf6\\x8f\\x9a?\\xc8i\\x9c\\x021\\xc6\\xca\\x7f\\xda\\xf8#Uo~\\x1b\\xd6\\xbd\\xfb^\\xc2\\x07W!J\\x95#u\\x1eo\\xef\\xf8\\xd3$\\xd1>q\\xd3\\xffu\\xd07\\xd4\\xd8\\x00Qj\\x9c\\xb6\\xb3\\xe2\\xd3\\xe4\\xd8[/H\\x1dO\\x9f\\x95\\xbf\\x1d\\x1a\\xe9U\\xd1qy|\\xc7d\\xe6\\xf0\\xce-\\xea\\xbdw\\xbe\\x1e\\x1c\\xf2\\x19_\\x9c8\\x06\\xae\\xbf\\xd9Z\\x97\\xc0\\xf57\\xa9\\xe36\\xae.\\xf9\\x19\\xe3\\x07p\\xdc\\xe6\\x12\\x9c\\x95\\x83\\xbd\\xc6\\xa8!\\xc2\\xf9\\xf5\\x06\\x1b\\xf3\\x01\\x9c_\\x0f\\x19rQ?bS\\xc9\\x0c\\x84\\x87\\xa7\\x07%4\\x17\\xf5\\xf5\\xb7\\xbb\\x9e\\x0b=p\\xe5\\xda\\x8e;\\x89\\x88~\\xfe\\xbc\\xa2vt\\xc3\\xb8+\\x10a=\\x87\\x1b\\x17\\xaeb\\xfa\\x03\\xeb\\xb99/e\\xac\\xaf\\xba\\\\8\\x00\"\\xea\\x0f\\xf27[\\xfbc\\xf8\\xf9\\xc6E\\x8fS\\x86\\x9e\\x88\\x0e(\\xba\\xd6W\\x99\\xb8\\xc8\\x0b!\\xf4\\x83\\x1e\\x0fz\\xe4\\x9d[\\x18\\\\\\x8a\\xeb\\x0f.\\xbfE\\x9e\\xf9Y\\xb6\\xe4\\xda\\xcdE\\x88~\\xd9g\\rq\"\\xf8\\x17\\x16\\xa2\\xa3\\xc7\\xed\\xbc7v\\xb87\\x84o\\x8d\\x82(\\xd5\\xdfp\\xfd\\x81\\xfef\\xefz\\x08n\\xbe\\x03\\xd7C\\xdc\\xfb\\xd5?\\xffE\\xcf\\xfe\\x1b \\xda\\xeb\\xd7\\x07V/H\\x1e\\xff\\xe2\\xd1\\xb5\\x88\\xee\\xf3`\\xaf\\xa0\\xf2\\xba\\x7f\\t\\xa1\\xad~\\x80\\x1b\\x17\\xa0\\x1f,\\nQ\\x9c\\xa4S^\\xb9\\t\\x11W\\x9f\\xa2\\xfc\\xbc\\xde\\xc6\\xf7\\x18\\x9f\\x1c\\x8ex\\xb3\\xdf\\xc1\\xb0\\xe1\\x10\\x1d=\\xdf\\x99\\x97Yx\\xbfn\\x96\\xaa\\x13DX\\x97\\x1c\\xb1q\\xdc\\x86u\\tn\\xdc\\x86rp\\xfd\\xc1\\xad\\x1f@9\\xcd\\xbe]\\x13\\xae\\x93\\xeaL\\x84)\\x95\\xb1\\xb7uD\\xcfeR\\xfb\\x83[\\xf7\\x87r\\xa6\\xcf\\xdb\\xbd)33\\xedK\\x88\\x8e\\x9e\\xf7J]?\\xb0w\\xdd\\xdf\\xde|p\\x17#\\x07\\xe6\\x83*\\xad\\x97\\xfe\\xbdSn\\xdb!\"\\xbd]\\xb8\\xde\\xf4\\xb7sg\\x8f\\xa9\\x87\\xdeH\\xea\\xac\\x9e\\xf2}\\xd1\\x7f\\x9bG\\xebO\\x9e_r\\xe7\\xeewJ\\x88\\xf6\\x8e?\\xbf\\xab\\xb3\\x06~S]\\xecV9\\x18\\xa1l\\x9d\\xf1\\x8d\\xb2\\xaf^\\x0e\\x87\\xfe\\x86\\xcb;\\xd7%\\xfa[\\xe3e\\x9f\\xa1\\xb5\\xc9}\\x0fB\\x94\\xaa\\xb7\\x0e\\x12\\xfbs<c@[\\x83\\xcb\\xe9\\xde\\x10\\x91\\xde^\\x95}\\xf1\\xc2qB\\xee[d\\xe3\\xfa\\xc1\\xd6\\xf4\\x95\\x1b~t\\xad?\\x89\\xe8\\x03\\x9b\\x87\\xd4/\\x88.\\x1f\\x08\\x11\\xe67\\xdc\\xfa(n~\\xfd\\xbb\\xba\\xfe\\xc8\\xa8\\xb7\\xcb{\\xdd\\xf5\\x85\\x08\\xe5\\xe0\\xde3I]?\\xf8z\\xe69\\xf7u\\x1e\\x1f\\r\\x81\\xb8\\xd8\\xca\\x1f\\xed\\x11%\\xf7\\x7f\\xa1\\xe6\\xd6V[\\xd7\\xf9r\\xa7\\x06G\\xcd\\xa9y\\x11\\xd1\\xe5nI\\xdd\\xf2X\\xd7|\\x88\\xb0?\\xdb\\xec\\xcc\\x07\\xfd\\xef\\xf1}W\\xfb\\xd4\\\\\\x85(\\xf5}#n<u\\xb4\\xdepy\\x07\\xeam\\x17y\\xb3\\xb4i\\xf5\\xf7\\x97\\x10\\xfa\\xc7\\x8c\\xdc\\x9f\\x9b\\xa4\\x8c\\x86q\\x8a\\xd3\\xdb\\x1d\\x89q*\\xb5\\xdeFzC\\xfe\\xb5\\xc2Jc\\xfd\\x00\\xe8m\\xdf\\x97\\xfb\\xf4\\x95\\xfdT{ \\xa2|\\xddm*;\\xa9\\xd3\\x91\\xc4z\\\\\\xbe\\xc6\\xf9\\x01U\\xb7{\\xf3\\xb1\\xaf\\x0e\\x9eG\\xb4\\xbd\\xf6\\xc1\\xd6\\xf5\\xd0>\\xa9\\xf9\\x8d\\x06y\\x1e\\x83\\xf0\\x1f\\xb7=\\xbeZT\\xb3\\xadT\\xaa}\\xa4\\xce\\x0f\\xec\\xad\\x83qy\\x14\\xd6\\xc1\\xe7O\\xa6\\xae\\xff>\\xf4\\xe0v\\x88\\xc8>+\\x9a\\xdfrwz\\xfdn\\x90\\xad\\xefe\\xea\\xc7\\xdf7\\xf8/\\xf35#z\\x82\\xfa\\xf8\\x8f\\x1d|:)\\x10\\xc6\\x0e\\xcd\\xeb\\xe3\\x11\\xad{\\x0b\\xe9m\\xdc\\xe2M\\xc4\\xado:O\\xc4\\xe57\\\\\\x1em\\xdf\\xf9p\\xaf\\xa9\\xdeMi\\x88V\\x14\\x9e\\xdd\\xecQR0\\n\\xa2\\xa3\\xd7\\xc5\\xb6\\xe4\\x0b\\xab\\xef\\x05\\xdd\\x98\\x0c1\\xc6\\xca\\x87\\xebH(~V\\xda\\x18?8\\xfbDY\\xf9!V\\xc4\\xd9G\\xea>\\x87\\xc8n\\x1b\\x9fs\\x0fp\\xfb\\xedwh\\xe5;*\\x8f\\xd6\\x95\\xf2\\xd1\\xc37\\xbf\\xac\\x86\\xe8\\xe8\\xfa4\\xd2\\xd37nm\\xda\\xa9)\\x10\\xa5\\xca\\xc1\\xe5QX\\x9fn?V\\xbc\\xec\\x9d\\xc3a\\x13!\\xa2\\xf8\\xe9\\xfdc\\xbb\\x8c\\xac\\xcd\\xbe\\xc3q\\xf69\\x83\\x91\\xd3~bymF\\x07\\x16Mg\\x9c\\xf8#\\x05\\xb3\\xaf\\xd5\\xac\\xd8\\x03\\x91\\x00|\\x9c\\x9cR\\x8c\\x9c1a\\xcbT\\xd1QkQYh\\xf7\\xfa\\x0e\\xa2\\x819~\\xb7\\xbe\\xd3\\xbf\\\\\\x9d\\x1b\\xd4\\xb8t;\\xc2\\x0b\\xab\\x82\\x8f\\r;\\xe0BH}\\x8f\\x81\\xadK\\xc0{\\x8c\\xcb.\\xea\\xd9\\xaf\\x8dn\\xfa\\t\"\\xca;\\xe8\\xfd\\x82\\xad\\xfb\\xec\\xfe\\xac\\xf7\\x0b\\xba\\xb4}\\xab*\\x7f\\x89\\xdc\\t\\xd1\\xd1\\xfb\\xab\\xa4\\xe6\\xeb\\xa36\\xe6\\xd1?+_\\xff\\xe4\\x99\\x91q\\xe2\\xc4\\xde,\\x881V>\\xca\\xd7;1\\xf9Z\\xea>\\x07MOu\\xf9-\\x8f\\xbf\\x0e\\x87\\x88^\\xe4\"\\xb4u<u\\xf4\\xf8\\xf3\\xac\\xf6#\\xe1\\xec\\x03\\xebm{\\xe3\\x07\\xfb^\\x13\\xc4\\xcf\\xac\\xaf\\xdbo9\\xb4\\xd2\\xab\\x11\\xa2\\xa3\\xf7\\x8bU\\xfc\\xf0\\xc5(\\xb3\\xfe\\xed\\xad\\x10a\\x9cn\\xb6q\\x9e\\xf8g\\xd9g\\x99\\xef\\xc0\\x81c\\xcb\\xfe\\xed\\x06\\xd1\\xd1\\xe3\\xf60F3\\xad\\x8b\\x90V\\x8e\\xf0\\x94\\xdfR\\xef\\x0e#\\xf7~\\x8e\\xec\\x13\\x10\\xb1\\xbb\\xaebeE[[\\xed\\x93tW\\xdd\\x10=w\\xfb\\xa7\\x88V\\x05\\x1d\\xbf\\x92\\xff\\xd9\\xa1\\r\\x08\\'\\xca\\xe7\\xbf\\xe6]\\xdb\\xf0\\x1c|\\xffc\\xeb<\\x1e\\xbe\\xffyV\\xf5\\xf6\\xb3\\x8a\\x9f\\x01:\\x97\\xfe\\xab\\xab\\xafz#\\xa4\\xd6d]Y\\xdb\\xf3\\xd7\\x188.\\xd8j\\x1f8.H\\xddoi\\xab}\\x1c]\\x9f\\xe2\\xec\\x03\\xeb\\xd3\\x15f\\xdd\\xe5\\xf3\\x1d\\xd2/@t\\xf4>\\xae \\x97Ie\\xb1\\x9f7u\\x84(u\\xbd\\ng\\x1f\\xa8\\xb7\\xc2\\xae\\xb9\\xa3\\xef4U\\x1cE\\x18~\\x87rn<\\xc9.\\x85\\xf1c\\xeb\\xfbz\\x18?\\xf6\\xce\\xafo`\\xe4\\xc0\\xf9\\xb5\\xbd\\xfb\\xc9\\xafH\\xb4\\xcf\\xb3\\xda\\x17\\x9d\\xd9\\xf7\\xea\\xd9\\n\\x8f\\xd5oBtt\\xbe\\x9e\\xbdh9\\xe3\\xef\\x14\\x99\\x03\\x11\\xe5k\\xb2\\xa8P6\\xf0\\xda\\xa1\\xcfm\\xddO\\xb1\\xfe\\x9b\\xc8\\xa4\\x90oK\\\\\\x10mo\\xfds\\t#\\x07\\xd6?\\xf6\\xca\\xa9{Frp\\xfb\\xec\\x1c-\\xe7[\\x89r\\x0c\\xf9^\\xd3\\xa8\\x88\\x1e\\' J\\x1d\\xe7\\xd0\\xfa\\x0e\\xac\\x1b\\xe18\\xe74q\\x98\\xdf\\xa7&\\xf5<\\x88(\\x90]\\xc2v\\rc\\x8e\\x16\\x07\\xe0\\xea\\x1f\\xa9\\xfbP\\xb2\\xb3\\xe8.\\xef\\x1e\\xf9e\\x10D\\xa9\\xfb-qq\\n\\xf7m<\\xab\\xfd\\x14m\\x92\\xaaG\\x15\\x97s\\xf1\\x10\\x1d]\\x07\\xcf\\x90/\\\\\\xa3e/&@\\x94\\xeao\\xc0\\xdd\\xb0\\xfef\\xef\\xb8\\xdd\\t\\xe8\\x0f\\x1dp\\xdc\\xb6\\xb7>\\xed\\x88\\xd1\\x1b\\xf47\\xdc>\\x14{\\xd7\\x0f\\xe0>\\x94\\xae\\xbd\\xc7{\\xe8\\xef\\xac\\xd3C\\x94\\xba?^\\xea\\xfa\\xc1T\\xcf:>\\xc5\\xaf{\\tD\\xe4\\xd7HN\\x81\\x8d\\xe3\\xc2\\x8bq\\x17\\xa7\\xf5\\xf2\\x1e\\xba\\x13\\xd1\\x9f\\x9c{\\xe5\\xfd\\xa4\\x90\\x9f\\xc6Ct\\xf4\\xfc\\xda\\xde8\\xc5\\xfe=\\x06\\x88\\xd3R\\xbe\\xe9\\xbb\\xb5\\x9cS,DG\\xef\\xef\\xed.\\xec)\\xdd\\xdf)r\\xe0?3\\xdf\\x0bp9\\xee\\xd3\\x01!ZWF\\xf3\\x83<\\x1b\\xfd\\xad\\xd3\\xcd\\xdc\\x93\\t\\x0f\\xbaMG\\xb4\\xa7&\\xdb\\xb7\\xdd\\x04v\\x11DG\\xe7\\x9d\\x98\\xc1u\\x17vu8q\\x13\\xa2\\xa3\\xf3\\x8e\\xbd\\xf3Q\\\\\\xfc\\xc0\\xf9h6\\xab\\'\\x14$[\\x96\\xe1\\xe4\\xfc\\xe8pzt\\x11\\xe1\\x89\\xcf1\\x87SK[KC\\'\\xc8h9\\xad\\\\\\'\\xf0\\xf1#\\xe2Iq\\xe8i\\x0fo\\x9c\\x9cr\\xb4$\\xa5\\xe6b\\xd9\\xb2v\\x19\\x16\\x8a\\xe5\\x18\\r\\xa5f\\xcf9Ug\\x19\\x87\\x19G\\x18\\xddyw%\\xef\\xce\\x1a\\xffb\\x1ce\\x1cc\\xf40{\\xcc\\x0e\\x0b\\x10\\xafa\\xe2\\xd5\\xe8i\\xf4\\x12\\xbc\\xc7\\xbe\\xc2O\\x88\\xe7_\\x8e7N2N\\xad\\x19\\xe1\\xcf\\xeaI\\x05\\xe7\\'#\\x19U\\xea|\\x92bI?\\x19\\xc1r\\xa9\\x11$#\\x9fA3:\\x91b\\xb8\\xc7\\xad\\x18Z\\x8dZ1$\\xdb\\xbaUn\\xa0\\x7fXPp\\xa8\\xffl>0\\x90\\x0f\\x0c\\xaa\\xf1\\t$\\xc4v\\xa1\\xb4.u&I)I\\xc6/\\x944p\\xa9\\xa1\\x06\\x9d\\\\\\xbc\\x0f\\x17\\x7fs\\xaa(\\x94\\xa5)\\xbf\\xf1\\xa9\\xe2s\\xa9\\xf9)z\\xcbS\\xd9\\x9a\\xd1\\x8f\\xbegm+\\xd3\\x1a\\x18\\xd4\\xd6\\xfb)m\\x9f|n\\xeb\\xb6%\\x8f\\x9aZ\\xd9\\xe3Z\\xb1\\x0b\\x02i*\\xae\\x85\\x08\\xd4\\xe9\\xf9\\xa0\\xf9\\x07\\x82H\\x95\\x86\\xd2p\\xa4\\x9fx\\xf3\\xb8\\xa5?\\xc3=\\xe6\\x04S\\xcaV\\x9c\\x9dA\\xa4\\x9a![\\x9e\\x80ne4\\x8bn\\xc3\\rza\\xa6l\\xba1\\x98\\x0f\\x0e\\xe5CB\\x84\\x90\\x900\\xf1\\x0c\\xe7\\xe7\\x04\\x99\\xe7\\xcc\\r\\x9d\\xbe\\xb8f\\xe2\\x1c\\x9aV\\xb6<\\xf4\\x0f\\x95\\xf4Gz\\x9f\\xa1\\xa1j\\x86>\\xfa\\x1a\\xa6\\x05\\x1f\\x1a*\\x84\\x86\\xca\\xc43\\xbc@|\\xf2\\xc3N\\x12\\x8c2\\xff\\t\\xfd\\xe6?!\\xb2\\xa8\\x95x\\xd4\\xbf R\\xf7\\xc7\\x0cQ\\xb207l\\xa6 \\x0b\\x9a/\\xc8\\xe6\\x86\\x0b\\xb20\\x99I<G\\x94<\\xd63\\xcd\\xb2~\\x8b\\xc5_\\xd5J\\xe12ZK0\\x1a.E\\xf4\\x0b\\xf5\\'2\\x03\\xa5\\xe0\\xc25J\\xd2\\xf2\\x83S[\\xa8\\x96\\x86\\x01\\x8c\"\\xfe\\tf0\\xa5\\x91\\xca\\x9cg\\xa0\\xb9\\xdd\\x8f\\xc9@Z\\xa7{\\x82\\x14\\x7f\\x9b\\x86\\x0f\\x0b0\\x85\\xcd\\x9d;_\\x08_<g?Nw\\x0b^\\xe5#\\x02\\x84\\x88\\x80\\x99\\xe2\\x19*\\x9e2\\xf1|\\xad\\xe0\\xc9&\\x8f\\x89`J\\xc5/\\x94\\xf111F\"\\x87\\x90\\x13\\x94\\x92\\xa6vZQ\\xd4\\x98\\x99\\x90\\xd3\\x06N \\x14Z3\\xa1\\xa0uz3\\xa1LTh\\xb3\\xc5\\xab\\x8eV\\n\\x84Vk\"\\xc4\\x1b\\x9e\\xa0\\x04\\xf1\\x1b9\\x04Es\\xb1$c&\\xf4z\\x9a\\x15\\x08\\x86\\xe4\\t6\\x9b`Y\\x83\\x8e\\xccm\\x01\\xf1\\x89<\\xc1\\x99,\\xff\\xbfA \\x0c\\xc9f9\\xa1T\\x939\\x96\\xab\\xc8\\xc9\\x95\\x8b\\xcf\\xd3\\x13L</\\'MrZ\\x99\"\\xc8\\r\\x9cI!F\\x00\\xafP\\x98\\x15-\\xe2\\x15Z\\x9a\"s-\\xb7\\xb4\\x81R\\x9a\\x14\\xa2\\xff\\xe7\\x88\\x17\\x8e\\xa1\\xb5\\xb9Vd\\xcd\\n\\xda\\xa0U\\x1a\\x95;\\x95\\xa4\\xf84NGR\\\\\\xb6\\x92d5jJP\\x92\\\\\\xbe\\x92L$\\xb5\\xb4\\xde\\xf2q\\x9eR\\xa3R\\x91\\x8cx\\xc7+i\\x93\\x92\\x96\\xc7\\x99D&\\x95M&[2G>\\x99\\xcc1\\x84^\\xb48G\\xe6Y\\xeeI\\x1d\\xa9M\\x11T4cR1\\xb4.GM2:\\x82J\\x11bu:\\xa3\\x86\\xd7\\xa8x\\r\\x95\\xa7\\xa181)\\x89\\x99\\xd8$\\xde\\xc5\\xf1\\x1a\\x96\\xd7p\\xa68\\x03\\xcb\\x99\\xe2):\\xc9\\xac%\\xc5<%^E\\xb3e\\xb7\\\\Y\\x93\\x96\\xb6\\xdc\\xd3\\xac\\xa8\\x00A+\\xaaD\\x9b\\xec=v\\xacQg\\xd2\\x11JR\\xbc\\xc4[.L|\\xae\\xa8e\\x8dJC*\\xb3[nRL:\\x83\"V\\xa0\\xdc9\\x81\"\\xd5&\\xcab\\x0cQ\\xf79\\x16\\xfd[4I\\xe9\\x1fZ\\xc8L\\xb1\\x06y\\\\6e\\xd0Y\\xacD\\xab\\x04Q{<\\xcd\\xe4\\xe9\\t\\x8a\\x10\\xdd\\\\\\xa3\\x10\\xef\\x18\\x82#\\x925\\xacI/v?_/\\xeaP\\x94\\xa3\\x10\\xbb\\x9c\\xab\\xa7\\x19\\xce\\xa0&\\xb4\"\\x87e\\xb3\\xf5\\x0c)j\\xcf$\\x82\\xde\\xac\\xb7\\xb8\\xa49\\xc1 \\xe6\\x13\\x9e!\\xcd\\x8cF\\x1d\\xcbe3\\x06\\x1d\\xcd\\xb0-``r\\x1e\\x02kdM,\\xa1#\\xb3Y\\xb1\\xb34\\x93\\xcdjtz-\\x99\\xf3\\x10\\x18\\x9e\\xd5\\n\\xacv\\x9c\\x99\\xb5\\xd82\\xbb\\xe5\\xca\\n\\x1c\\xa16q\\xb1\\x04\\'\\x88\\x9edn\\xe9M\\xcb5^\\xfcP\\xfc\\x91\\x1cc s\\r\\x94V\\x13o1\\x85\\x81%\\xcd\\x06\\x8b\\xe6L\\x89$\\x93\"$\\xb2\\x9e|\\x12iJ\"E\\xb7L\\x12\\x1faJ\\xd2X\\xee4\\\\\\xac9\\xc9\\xe2\\x12\\xe6d\\x8b\\xe3\\x08)\\xb4\\xc1$\\x9e\\x8c\\xe8Z\\x1c\\xbbq\\xa5Y\\xa5%\\xd4\\xec\\xc6U\\x85\\xb1\\x04\\x1bm\\xa0,v\\xa2\\xa2\\x1f\\x8e\\xa6G\\xf2E\\xa4\\xa2\\xd5\\x0cm\\xd0\\xb3\\x1b\\xcb\\x9c\\xd3\\xff\\x03A\\xe0\\xee\\xc6'", "year": "2018"}, {"Unnamed: 0": 438053, "autor": "frame-it", "date": 1537791240000, "content": "Hi Jono, nice to see you jump into this thread so hows the SL2 testing coming along --img--  Hmm - you are assuming that the SL2 will just be a clone of the Panasonic S - even if the rumours are true I think this is extremely unlikely, It's one thing re-badging an LX100, quite another abandoning all your SL design and development department and using Panasonic (and losing the 'made in Germany' tag as well). I'd expect a body made in Portugal / Germany, a different interface, much simpler controls and a modified sensor (for M lenses) at the very least. . . . but what do I know? (in this case nothing or I couldn't pontificate!)", "link": "https://www.l-camera-forum.com/topic/289421-new-panasonic-full-frame-with-sl-mount/page/10/?tab=comments#comment-3598683", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "hi jono, nice to see you jump into this thread so hows the sl2 testing coming along --img--  hmm - you are assuming that the sl2 will just be a clone of the panasonic s - even if the rumours are true i think this is extremely unlikely, it's one thing re-badging an lx100, quite another abandoning all your sl design and development department and using panasonic (and losing the 'made in germany' -----> tag !!!  as well). i'd expect a body made in portugal / germany, a different interface, much simpler controls and a modified sensor (for m lenses) at the very least. . . . but what do i know? (in this case nothing or i couldn't pontificate!)", "sortedWord": "None", "identifyer": 51295, "doc": "b'x\\x9c\\xc5[\\tX\\x14W\\xb6n\\xdc\\xc5\\x8cJ\\xdc\"\\x1a\\xc5\\x95\\xa7\\x01\\x11\\x15B|!\\xca\\xa2\\x06\\x14hAP#\\nEw\\xd14tW5U\\xd5,\\x86\\x04\\x97\\xe8\\x18\\xa3\\x06u\\xc4-8tU/ H\\x0c\\x99\\xb8F\\x88\\x08\\xc1%F\\xa2&>\\xc6-\\xa0\\x99IP\\\\\\x13\\x15\\xa3a\\xaa\\xb1\\xaf\\xc6\\x13\\xefX\\xfd\\x9a\\x8f\\xd4\\xf7\\xd5\\xfd\\xeb\\xd4\\xb9\\xd4\\xe9{\\xd6{o\\x15\\xef[\\xd2H\\x86U\\xd3\\x940v\\x8c\\xb7\\x89\\xe08\\x86\\xcd\\x0b\\x08\\n\\t\\x9d>#,<B~\\xdc\\xa9\\xf2\\xb8S\\xd5q\\xa7/\\xcd\\x1c\\x9dBRl\\xd5k;\\xdf\\xf6\\x8c\\xe6Y\\xd9\\x85\\x06\\x88\\xf1\\xb2G\\x87\\xcb\\xc43_\\\\Z\\xea}6j\\xba\\xfb\\xd0;eED;\\xd9\\xd3\\x87\\x13@tx}q\\xe1\\xfe\\xd0\\t\\xbb?B4[\\xd2\\xb8\\xcf\\xbbj\\xc57\\x10\\xa1\\x9c\\x195\\xef\\\\7V^Nmo\\xbb\\x9f\\x05\\x1e\\xdcl;pr\\xf6\\xf6u\\xfd`u\\xe3\\x83a\\x10\\t\\xc0?`{.\\x1cO38\\xd0\\xfd\\xeb\\xed\\xff\\xf6qM\\xf7\\xb7O!\\xfa\\x9f\\x1dJ\\x94\\xc1%M\\x87 \\xce\\xb2\\xf1kK:T\\xae\\xa8\\xce\\\\\\xb7\\x0e#\\xe77\\x8c\\x1cU\\xf3\\x80\\x97\\r\\'\\x87\\xb2\\x88\\xceirs*}m\\xdb\\x04\\x88\\x0bl|\\x8f\\x1a\\xe5\\xb4\\x95\\xb7,a\\x1b0r\\x90\\xfa\\xa0\\x9c\\xc3@\\xaf\\x01;.~z4~\\x91\\t\\xa2\\xd2\\xc6_\\xb0;\\xf3\\xe4\\xe0\\xda\\x9eU\\x15v\\x8e\\xa7fj\\xa4\\xe6\\xe6\\xfdt?D\\xcf\\x0f\\xbc\\xb1\\xeb`\\xda\\xd7j\\x88q6\\xfe\\xb9\\x11\\x93\\xbc\\xdc\\xee,?\\xb0\\xc3\\xce\\xf1\\xbck\\xcc[\\xba\\xf9\\xded\\x05\\xa2\\xfb\\xf4\\x19\\xe8\\xc6\\xf7\\xbd\\xa4\\x84\\x08\\xc7\\xb3\\xc9\\xc1\\xf1\\xdcI\\t\\x88\\xf69\\x9a\\xed\\t1\\xda\\xc6\\x1f\\x9c\\xb8\\xa0q\\\\\\xc25\\x97\\xfdv\\xfa\\x1b\\xb4O\\xd8+\\xb9\\xabk.\\x97\\x0e\\x80\\xf8\\x96\\x8d\\xbf\\xb9^\\x18\\xf0N^\\xdd\\xa9\\xbf\\xdb\\xa97\\xfd\\xcf\\xd7/z\\x9e\\xd0\\xf7B\\xb4\\x96\\xd1\\x93\\xf77\\xd5\\xe4@\\x8c\\xb5\\xf1K\\x87\\x1f\\x9eV\\xf4F\\xea\\xe9\\xddv\\xea\\r\\xc6)\\x1d\\\\\\x1cO\\xfb\\x95\\xff\\x15b\\x8c\\x8d_\\xbf\\xff\\xf2\\xd8\\xa9.!\\xedP>\\x80r\\xe0\\xb8pz\\xdb\\x17\\xb9\\xb5\\xb0\\xea\\x1fB=\\xc4\\x04\\x1b?\\xacv\\x9c\\xfb\\x9d\\r\\xe3n\\xe7`\\xc6\\xd3\\x11\\xa37(\\xc7\\x7f\\xcd\\xaa\\x0f7\\xa5n\\xbb\\x02q\\xb6\\x8d\\xff\\xe2\\xc3\\x17\\x0b\\xcf\\xcd\\x0e9\\x88\\x8b\\xd3\\x0e\\x189\\x9a\\xd8v\\r\\xfd&\\xfd\\xfb3D\\xaf\\xdb\\xc2\\xfa\\x98\\x13\\xbb\\xab J\\xf5\\x03DC9\\xd76\\xf6\\x8c\\xfd~\\xcf\\xae&D\\x7fZ\\\\\\xe9\\xd3\\xd1x\\xa8\\x07\\xc4x\\x1b_j]x\\x9e\\x1f\\xf4{\\xb8\\xa7\\xdc\\xfc\\xfe\\xc4\\x91\\x10\\xa1\\xbf\\xd9\\x9b\\x0f\\xa0\\x9c\\xceW|/^\\r\\xca\\xbf\\x85pY\\xf6\\xeda\\xa3\\xa3-!(\\x1f\\xe4\\\\\\xcd\\x0e\\xf3\\x0b\\x0e\\xed\\xb3\\x0b#\\xe7>\\xc6\\xaf\\x9bG\\xce\\xab\\x99\\xbc\\xf0L\\r\\xa2\\x97{\\xf56L\\x15\\x1e\\xfaBl\\xed| S\\x1c\\x1e\\xf5^\\xda\\xe6J\\x88\\xf3l\\xec\\xb5\\x13\\x8c\\xbd\\xd5\\x91\\xc3=qu\\xee\\x9eD9.\\xf7\\xa6V\\xdc\\x9e\\xa8N\\x83\\xa8\\xb2\\xf1\\x99n\\xcbNEL+\\x8a\\xdb\\xf6\\x9c\\xf8y^\\x9c\\x16\\x9e\\xe7N>|\\xd0t\\x13\"\\x1c\\x8f\\xc9\\xce\\xf8\\x81r>\\xfbd\\xcb\\x86\\xbe\\xb2\\xce\\xd9\\x10\\xd1\\xfc \\xb7\\x9bG\\x89|}\\xb7|\\x9c\\xde\\xd0\\xbc\\xe4yr\\x1c\\xads\\xb88\\x85u\\xae\\xac9\\xd7#E\\x973\\x05\\xe1\\x9d\\x8b\\xa6A\\xc5c\\xfb\\xe6\\xa0\\xbc\\xb3\\xf9\\xd7(\\x8fy\\xdc{\\xd9\\xf6\\xce\\x0f\\xe47zUvY\\x95U\\x85\\xe8\\x18_\\x17\\xcb*_\\x97\\x1b\\x08\\xa9a{\\xcb\\x8d\\x9f^;\\x01\\xe3\\x07WO\\xfb`\\xe4\\xc0\\xf89[b!\\xea\\xe7\\x1ey\\x1d\"\\xca\\xd7(~,\\x0e\\xe6kG\\xf3(No\\xff\\xdf<\\x8a\\xf3\\x03\\x9c\\xbf\\xc1\\xfc\\xd6\\xddu[{\\xd7\\xb5.\\xbfA|\\\\\\x7fr\\x07\\xee\\xda\\xb9#\\xa2\\x0e\\xe7\\x078\\x7f\\xab8>\\xaffD\\xbb-\\xee\\x88~\\xe5L\\xf4\\x99\\xbf[&( \\xc2\\xba\\x8d\\xab\\xa7R\\xe7\\xa3\\xc8\\x8f!\\xa2\\xf1<o\\xfe\\x86\\xcb\\xd7p\\xfe6z\\xba\\xea\\xce\\xa7?\\xbcb\\x82\\xe8\\xa8\\x1fT\\xcc\\xce\\x8dq]\\xa3\\xc8D\\xf4\\x98\\x95\\xe5\\r\\xda!\\xc7J!\\xc2:\\xf77\\x07\\xe7Ue{\\xa3\\xbf\\xac\\xab\\x9b\\xfe\\x02\\xc4\\xd6\\xae?m\\x15?\\xa7\\xb6~\\xd2\\xbc\\xcdr\\xf3\\r\\x88\\xf16>\\x8a\\x1fG\\xe7\\xa3\\xb8\\xf9\\x9bT9\\x0f%\\xcaq\\xb4\\xfe4I\\xb4O\\xf2\\x94\\xff\\xdb\\xe7\\x17n\\xb8\\x01Qj\\x9cJ\\xad\\xa7\\xddo|x\\xd4\\xf9\\xc1\\xfeb\\x88R\\xf3\\xb5\\xd4z\\xdaV\\xfev`\\x84\\xd7\\x91.\\xef\\xa4t\\xc9`\\xca\\xb7oP\\xed\\xbc\\xfb\\xed\\xa0\\xd0/\\xf9\\xfdi\\x1e(N\\xdf\\x9e\\xf1\\xf2K\\x1dg^t\\xb6w>\\xda-#\\xd7\\xb7\\xd3\\xbe.\\xfd\\x11-\\xb5n\\x7f\\x88\\x91\\xf33\\xc6\\x0f`\\xdd\\xe6R\\x9d\\x94\\x83\\xbc<T\\x10\\xe1>\\xc5\\x1a;\\xf3\\x01\\xdc\\xa7\\x18<\\xf8\\xa2n\\xf8\\xba\\xb2\\xa9\\x08\\xcb\\xa7\\x04\\xa76\\xef\\xe9\\x17\\xe0\\xe8\\xba\\xfeZ\\xf8\\xde\\x86\\xab\\x1f\\xddMC\\xf4\\x0b\\xe7\\x15u\\xa3o\\x8ck\\x80\\x88\\xe6!Ho\\xb8\\xba\\xd0\\x19#\\xe7\\xcd\\xbc\\xe5\\xf2\\x13\\xd7\\xba=\\xaes\\xb8\\xf56\\x1a\\x0f\\xf27{\\xc7\\x03\\xd7\\xdb\\x81{\\xae\\xf6S\\xa6\\xcd\\xf1B\\x08\\xfd\\x00\\xad\\x1b\\xed\\xdd\\xa7\\x88=\\xf3\\xb3|\\xde\\xd5[s\\x10\\xfd\\xaa\\xefR\\xe2h\\xc8/,\\xc4\\xd6\\xae\\xdb\\x85\\xef~\\xe4~#j\\xe3\\x02\\x88R\\xfdM\\xea\\xbe\\x98\\xa3\\xfb|\\xb8\\xf9\\x0e\\xdc\\xe7s\\x7f\\xa9\\xf1\\x85\\xaf{\\xf5_\\x03\\xd1Q\\xbf\\xde\\xbb$:c\\xfc\\xc8C+\\x10\\xdd\\xf7\\xe1N!\\xd1\\xeb\\xc1%\\x848?x\\xde~\\xc8\\xf3\\xfc`N\\xa8\\xe2\\x18\\x9d\\xf9\\xda-\\x88\\xf3Q\\x7f\\xb7^{\\xaed\\xdd\\xe6\\xe6\\x14\\x9c*\\xbd\\xc4\\xba\\x97\\xa2\\xfc\\xbc\\xda\\xe9\\xbf\\x8fgW\\xd7\\xc1[\\x97\\xed\\x1e\\xdf\\x17\\xd1\\x9f\\x97\\xc7\\xbc\\xf7\\xd2\\xbe\\xc8\\xa1\\x10[{\\xbe33\\xaf\\xf4A\\xfd\\xf4\\xc4\\xae\\x10\\xe1\\xba\\x04\\xb7o\\x89\\xab\\xdbp]\\x82\\xab\\xdbR\\xe5<\\x90(\\xa7\\xd9\\xaf{\\xea5R\\x95\\x870\\xf3x\\xd2\\x1d-\\xd1k\\xa1T9\\xbfJ\\x943ef\\xc9\\xba\\xbc\\xbc\\x95\\xdf@l\\xedy\\xaf\\xcb\\xcc\\xfc\\x85\\x85\\xe1\\xafw\\x84\\x18\\x8f\\xf8\\xb6yU\\xbe\\x83~\\xe0h>\\xc0\\xed\\x87\\xc0|P\\xa3\\xf1\\xd2m:\\xe1\\xba\\x15\"\\xd2\\xdb\\x85kM\\x1f\\x9c;[\\xa5r4\\x8f6\\x1e;?\\xef\\xee\\xbd\\x1f\\x94\\x10a\\xfdY\\x8f\\x91\\xf3\\x0bf<\\x7fXg\\r\\xfc\\xee\\xe4~\\xd7\\xe3\\x83\\x10\\xcaW\\x19\\xde\\xad<\\xfdj\\x94T\\x7f\\xc3\\xc9\\x81\\xfev\\xf3\\xb2\\xaf[]F\\xbf}\\x10\\xa1\\xdep\\xfe\\xd6I\\xa2\\xde\\x0e\\xe7\\x0eh\\xafw>\\xd5\\x07\"\\xd2\\xdb\\x9b\\xf2\\xaf\\x87\\x1d&\\x12\\xfc\\xf6\\xd8\\xb9\\x7f\\xb01g\\xd1\\x9a\\x1f]\\x1a\\x8f!z\\xef\\xfa\\xc1\\x8d\\xd1q\\xd5\\x03!\\xc2\\xfc\\x86\\xdb\\x1f\\xc5\\xcd\\xaf\\xff\\xb0\\xae\\xaf\\x18\\xb5\\xbc\\xba\\xf7=?\\x88P\\xcev\\x07\\xf7\\x0f\\xbe\\x9dv\\xce}\\x95\\xe7\\'\\x83!\\xce\\xb5\\xf1G{.H\\x08\\x18V{{\\xa3\\x9d\\xf3D\\xaf\\x82I!\\x0b\\xc2jG\"\\xba\\xda5\\xbdG!\\xebR\\x04\\x11\\x8eg\\x8b\\x83\\xf9\\xa0\\xff\\xaf|\\xbf%\\xbe\\xb5W B9\\xb8\\xbc\\x83[g\\xb5\\xb6\\xdepy\\x07\\xeam\\x07y\\xeb`\\xd3\\x92\\x7f]B\\x18\\x10?bwA\\xba2\\x0e\\xc6)Now%\\xc6\\xa9\\xd4\\xf56\\xd2\\x1b\\xf2\\xafl\\x1b\\x8d\\xf5\\x03\\xa0\\xb7]\\xdf\\xec\\xd2\\x1d\\x7f)\\xf1c\\x88(_\\xf7\\x98\\xc4N\\xecZ\\x91\\xd6\\x88\\xcb\\xd78?\\xa0\\xeaK\\xd6W\\x9d\\xdew\\x1e\\xd1\\x8e\\xda\\x07\\xbb\\xae\\x87\\xf6\\xc9*\\xba\\xa9O(d\\x10\\xfe\\xe3\\x8e\\xe7\\xe99\\xb5[\\x0eJ\\xb5\\x8f\\xd4\\xf9\\x81\\xa3\\xeb`\\\\\\x1e\\x85\\xeb\\xe0\\xf3\\xc7\\xb2V\\xff+|\\xdfV\\x88\\xc8>\\xd9\\xcd\\xcb\\xdceo\\xdf\\x0b\\xc6\\xd9\\x07W\\xe7\\x1a\\xc7?\\xd0\\x07,\\xf43!z\\x82\\xea\\xf0\\x8f\\x9d|\\xbb*\\x10&\\xb9\\x15\\xf6\\xf5\\x8c\\xd3.Cz\\x1b7w\\x1dq\\xfb\\xbbn>\\xb8\\xfc\\x86\\xcb\\xa3\\x1d\\xbb\\x95\\xf7\\x9e\\xe4\\xdd\\xb4\\x12\\xd1\\x8a\\xd2\\xb3\\xeb=\\xcb\\x8aGAl\\xed}\\xb1\\rE\\xc2\\x92_\\x83\\xaf\\xbf\\x0e1\\xde\\xc6\\x87\\xfbH(~\\x16\\xd9\\x19?8\\xfb\\xa0\\xef\\x02Bm\\x88\\xb3\\x0f\\xce\\xaf\\xe1xb{\\xac\\xed\\xec\\x1e\\xe8\\xfa\\xdb\\x1f\\xd0\\xc6o\\xad<Z\\x7f\\x90\\x8f\\x1b\\xba\\xfeU\\x15\\xc4\\xd6^\\x9f\\xc6\\x8e\\xf1K^\\xb1\\xf2\\xc4\\x1b\\x10\\xa5\\xca\\xc1\\xe5Q\\xb8>\\xddZ\\xb5\\x7f\\xe1\\xfb\\xe5\\x91>\\x10Q\\xfc\\xf4\\xf9\\xb1Cn\\xfez\\xbf\\xa18\\xfb\\xfc\\x84\\x91\\xd3\\xd1\\xa7\\xba.\\xb7\\x13\\x8b\\xa632\\xbe\\xa2x\\xc6\\xd5\\xda\\xec\\x8f!\\x12\\x80\\x8f\\x93s\\x1e#\\xc7#rab\\xdc\\x82\\x15hY\\xe8\\xf0\\xfe\\x0e\\xa2\\xe1{@\\xb8\\xbf\\xd3\\xbfZU\\x10|s\\xfeV\\x84\\x17\\x16\\x87T\\r\\xd9\\xebLH}\\x8f\\x81]\\x97\\x80\\xf7\\x18\\x97\\x9dU3\\xde\\x1a\\xdd\\xf4\\x13D\\xf8}\\x88\\xbd\\xeb\\xed?\\xeb\\xfd\\x82v\\xe5\\xae\\xc5\\xc7\\x7f\\x89\\xdd\\x0eQj\\x9cJ\\x9dWI\\xcd\\xd7\\x87\\xec\\xcc\\xa3\\x7fV\\xbe\\xfeiLn\\xee\\xd1\\xa3;\\xf3!\\xc6\\xdb\\xf8(_o\\xc7\\xe4k\\xdc>\\x12\\xd4\\x9b\\xba\\x97\\xaa\\xfa\\xb6\\xe7\\xff\\x0e\\x85\\x88^\\xe4\"\\xb4\\xb7\\x9e\\xb6v\\xfd\\x91\\xfa\\x1e\\xa3\\xad\\xbe\\xb3s4~\\xb0\\xef5A\\xfcL\\xff\\xb6\\xe3\\x86\\x03\\x8b\\xbcnB\\x94\\xfa=\\x1f\\xce>\\xb0.\\x1c\\xf9\\xf7\\xd7\\xa3L\\xba\\xe5\\x1b!\\xc28\\xc5\\xad\\xebq\\xf3\\xc4?\\xcb>\\x0b\\xfd\\x06\\x0e\\x1c[\\xf9OW\\x88\\xad]\\xb7\\x870\\xea\\xc9\\x7f\\x11VV#<\\xe1?\\xdf\\xbb\\xd3\\x88\\x9d_!\\xfb\\x04\\xc6\\x94\\xd4\\x1fYt\\xa4\\xbd\\xbd\\xf6I\\xbf\\xa7\\xba\\x11\\x17\\xb1\\xf5\\x0bD\\'\\x06\\x1fn(\\xfa\\xf2\\xc0\\x1a\\x84>\\t\\xb3\\xde\\xf2\\xae\\xbb\\xd1\\x19\\xbe\\xff\\xb1w\\x1e\\x0f\\xdf\\xff\\xb4\\xd5z\\xbb\\xad\\xe2g\\x80\\xd6\\xb9\\xff\\x92\\x93W\\xbc\\x11RK\\xf3\\x1bV\\xf4\\xba\\x1f\\x0f\\xeb\\x82\\xbd\\xf6\\x81ua\\xf1\\x91\\xc5\\xc7\\x16\\xbeI\\x0c\\x87(u\\xff@j\\xfc8\\xba>\\xc5\\xd9\\x07\\xaeO\\xb3M\\xda\\xcb\\xe7;\\xe5\\\\\\x80(\\xb5\\xce\\xe1\\xea6\\x8c\\x9f`\\xe7\\x89\\x95I_5u\\x81(u\\xbf\\ng\\x1f\\xa8\\xb7\\xd2\\xee\\x05\\xa3\\xef6\\x1d9\\x840\\xea.\\xe5t\\xf3\\x18;\\x1f\\xc6\\x8f\\xbd\\xef\\xeba\\xfc8:\\xbf\\xbe\\x8e\\x91\\x03\\xe7\\xd7\\x89]>\\xf1\\xef\\xb9\\xb2\\xc1\\x00Q\\xaa}\\x1a$\\xda\\xa7\\xad\\xbe\\xeb\\xcc\\xebw\\xe5\\xec\\x11\\xcf%\\xefAl\\xed|=c\\xce;L\\x80,\\xd6\\x02\\x11\\xe5krO\\xa9|\\xe0\\xd5\\x03_\\xd9\\xfb=\\xc5\\xea\\xefb\\xd3C\\xbf/sF\\xb4\\xa3\\xeb\\x9fK\\x189p\\xfd\\xe3\\xa8\\x9c\\xfa6\\x92S\\xd7Fr\\xbe\\x97(G_\\xe45\\x99\\x8ay\\xf1(D\\xa9u\\x0e\\xed\\xef\\xc0u#\\xacs2\\x9f!\\xfe_\\x18U3!\\xa2@v\\x8e\\xdc1\\x849\\xb4?\\x10\\xb7\\xfe\\x91\\xfa\\x1d\\x8a9\\x9f\\xfe\\xcb\\x87\\x15\\xbf\\xbc\\x0cQ\\xea\\xf7\\x96\\xb88\\x85\\xdfm\\xb4\\xd5\\xf7\\x14\\xed\\xd2O\\x8e\\xda_\\xcd\\xa5@l\\xedu\\xf0\\xd4\\x84\\xd9K5\\xec\\xc5T\\x88R\\xfd\\r\\xb8\\x1b\\xd6\\xdf\\x1c\\xad\\xdb]\\x81\\xfe\\xd0\\x01\\xeb\\xb6\\xa3\\xeb\\xd3.\\x18\\xbd\\xfdY\\xff\\xf7\\xd1\\xbd\\xcfxO\\xdd\\xddU:\\x88\\xad\\xfd\\x7f\\x1f\\x93\\xc6\\xd4\\xf3\\x99\\xfe=\\xcb \"\\xbfFr\\x8a\\xed\\xac\\x0b#\\x93/N\\xee\\xed\\xed\\xb6\\x1d\\xd1\\x9f\\x9f{msz\\xe8O\\xe3!\\xb6\\xf6\\xfc\\xda\\xd18\\xc5\\xe5\\x1d\\x18\\xa7\\x07\\xf9\\xa6\\x1fVp\\xb2$\\x88\\xad\\xfd}oO\\xe1\\xe3\\x83\\xbb\\xbb\\xc6\\x0e\\xfc,oS\\xa0\\xf3a\\xdfN\\x08\\xd1\\xbe2\\x9a\\x1f\\x14\\xda\\xe9o]o\\x15\\x1cK}\\xd8c\\n\\xa2\\xc7\\xa8\\xcd~\\x1d&\\xb0s \\xb6v\\xde\\x89\\x1fT\\x7faG\\xa7\\xa3\\xb7 \\xb6v\\xdeqt>\\x8a\\x8b\\x1f8\\x1f5\\xb3:BA\\xb2\\x95k\\x9cdN\\x8f\\x0f\\x19\\xc0g\\x1f\\xb2\\x16\\xbeh\"\\xd8O\\xf6\\xe8\\xb4qe\\xe0\\xf6cB\\xe6\\xf4\\xf4\\r\\xd9\\xe3\\x0b\\x99\\xcc\\xa2!)\\x15\\x97\\xc4VvXc\\xa5X\\x8eQS*\\xf6\\x9c\\xect\\xbe\\xc1\\xcd0\\xc4\\xe0\\xce\\xbb+yw\\xd6\\xf0?\\x86Q\\x06\\x0f\\x83\\xa7\\xc5\\xd3S\\xadUyz\\x9a<gD\\x06\\x8am\\xa4\\xd8\\x1a\\xc6\\x18\\xbc\\x0c\\x13\\r\\x93j\\x87\\x07\\xb0:R\\xc1\\xf9\\xcbI&1k\\x16I\\xb1\\xa4\\xbf\\x9c`\\xb9\\xac\\x18\\x92I\\x98J3Z\\x91b\\xb8\\'\\xbd\\x18Z\\x85z1$\\xfbt\\xaf\\x82\\xa0\\x80\\xc8\\xe0\\x90\\xf0\\x80\\x19|P\\x10\\x1f\\x14\\\\\\xeb\\x1bD\\x88\\xfd\\xc2im\\xd64\\x92R\\x92\\x8c\\x7f8\\xa9\\xe7\\xb2\\xc2\\xf5\\xda\\x04\\xf1:J\\xfc\\xc5Y\\xa2P\\x96\\xa6\\xfc\\xc7g\\x89\\xcf\\xa5fe\\xea\\xacOekG?\\xfe\\xbbg\\xf4\\xf5~\\xaao\\xd9\\xe3\\xae6\\xf6\\xb8\\xa7\\xd8\\xc5A4\\x95\\xdcB\\x04iu|\\xf0\\xac\\xbd\\xc1d\\xa2\\x9aRs\\xa4\\xbfx\\xf1\\xa4g\\x00\\xc3=\\xe1\\x84P\\xca\\xa78\\xdb\\x83I\\x15C\\xb6<\\x01]\\xcai\\x16]F\\xe9u\\xc24\\xf9\\x14C\\x08\\x1f\\x12\\xce\\x87\\x86\\n\\xa1\\xa1\\x91\\xe2\\x19\\xc5\\x87\\x05\\xd7\\xfa\\x84\\xd1\\xb4\\xb2\\xe5q\\xcf\\x1c\\xf2\\xb3\\xb48UM\\xd5\\xba=\\xfe3L\\x0f><\\\\\\x08\\x0f\\x97\\x8bgT\\xb1\\xf8\\xe4G\\xc3#\\x18e\\x91M\\x8c\\\\\\xa3g\\x8a~\\'\\xb2\\xd6\\xc3\\x1e\\xf9{\\x9e\\xea\\x8c\\xf4\\x10Lj\\x9f\\xcd\\x10\\x7f\\xa7\\x10\\x119M\\x90\\x07\\xcf2\\xcb\\xa7DFE\\x84\\x0b\\xf2\\x88(A\\x1e)7\\x8a\\xe7\\xf0\\xb2\\'f\\xa1Y\\xd6\\x7f\\xae(\\xec)\\xfb\\xc8i\\r\\xc1\\xa8\\xb9L\\xd15T\\x9f\\xcb\\xf5\\x94\\x82\\x8bR+I\\xeb\\xef\\xc8j\\xa1Z:\\x062\\x8a\\x94\\xdf1C(\\xb5T\\xe6L=\\xcd\\x95<!\\x83h\\xad\\xf6w\\xa4\\xf8\\xdb\\xd4|d\\xa012\"b\\x96\\x1057\\x8c\\x9f\\x15\\xb1\\x1b\\xa7\\xf3\\xe87\\xf9\\x98@!&p\\x9ax\\x86\\x8b\\xa7\\\\<\\xdf*\\xfe}\\x97\\'D\\x08\\x95\\xc8\\xcf\\x96\\x0b\\xb3#\\x03\\x85\\xb8(9\\x1f\\x1fo ,D\\x02A)ij\\xbb\\rE\\x1d\\n\\x84Bc\"\\x14\\xb4Vg\"\\x94i\\n\\x8dYl\\xb5\\xb4R 4\\xe2m\\rM\\xa9\\x8c\\x84H\\xf2\\x04%\\x88\\x7fa!(\\x9aK\"\\x19\\x13\\xa1\\xd3\\xd1\\xac@0$O\\xb0f\\x82e\\xf5Z\\xb2\\xa0\\x05\\xc4\\'\\xf2\\x04g\\xb4\\xfe\\x0f\\xba@\\xe83L\\t\\x84REZ\\xac\\xad\\x95\\x93@\\x1a\\x13he\\xa6\\x90\\xa0\\xe7\\x8c\\n1dx\\x85\\xc2\\xa4h\\x91\\xad\\x10E\\x91F\\xf1\\x924\\x8b\\x8d\\xd8\\xb7\\xc0z\\x9b\\xd6SJ\\xf1&\\x95l\\x11\\x1b\\x8e\\xa15\\x056dM\\nZ\\xafQ\\nJR\\xb7]<\\xc5\\xa8\\xd7\\x92\\x14gV\\x92\\xacZE\\x89w\\xb9\"%\\x99Fjh\\x9d\\xf5v\\xa1R\\x9d\\x98H2\\xe2\\x15\\xaf\\xa4\\x8dJ:!\\xd9(2)3\\x99aM&\\x85d\\x06\\xc7\\x90ZR\\x93)$\\xd2\\x8cEE2Z\\x82\\xca\\xe4\\x93\\xd4B\\x92V+$\\xd1\\xe9\\x065\\xafN\\xe4\\xd5T\\xa1\\x9a\\xe2\\xc4\\xec$&b\\xa3x\\x95lmh^\\xcd\\xf2j\\xce\\x98LS\\xb41Y\\xaf\\xd5\\x89\\r\\xcb\\x19S(:\\xdd\\xa4!\\xc5\\xfc%\\xb6\\xa2!\\xcd--k\\xd4\\xd0\\xd6k\\x9a\\x15\\x87g\\xd2dx\\x8f\\x1dk\\xd0\\x1a\\xb5\\x84\\x92\\x14\\x9b\\x14k\\xc3\\xa4\\x14\\x88\\xbaV\\'\\xaaI\\xa5\\xb9\\xe5\"\\xd3\\xa8\\xd5+\\x92\\x04\\xca\\x9d\\x13(Re\\xa4\\xd4\\xa2l\\xcaj\\x1d\\xd1\\x0c\\x16\\xab)\\xac\\x8a\\xa2t\\x8fLf\\xa2X}B\\xb2\\x99\\xd2k\\xad\\x06\\xa3\\x13\\x05Q\\xa3<\\xcd\\x14\\xea\\x08\\x8a\\x10\\x9d_\\xad0\\xe9\\xac:5\\xeaD\\x05\\x14\\xe9D=\\x8a\\x82\\x14\\x04G\\x16\\xe8h\\x86\\xd3\\xab\\x08\\x8d\\xc8aY\\xa3\\x8e!u&\\x9d\\xd5;M\\xa9z1\\x13\\xf1\\x0cif\\xf4Z\\x9aa[@\\xcfX\\x1e\\x01k`\\x05\\x96$\\xcd\\xac86\\x9a1\\xb3j\\xadNCZ\\x1e\\x01\\xc3\\xb3\\x1a\\x81\\xd5\\x8c\\xe3YZ\\xe0\\x08\\x95\\x85#YN\\xfc\\xa9F.\\x89\\xe0\\x04\\xd1\\x81L-\\xbf\\xbc\\xa5M\\x11o\\xaaY3\\x97\\xc4\\x90\\x84\\x92\\xe7h#\\xc7\\xe8\\xc9\\x02=\\xa5Q\\xa7XM\\xa2gI\\x93\\xde\\xaa0c\\x1a\\xc9d\\x1a\\xd3I\\x8d\\xc6\\x98.>\\xc5\\x98\\xae\\x16\\x1d4\\xdd\\xea\\x04\\xa6\\x0c\\xeb\\xb0\\x84LZo\\x14OFt,\\x8e]\\xbb\\xc8\\x94\\xa8!T\\xec\\xda\\xc5\\xa5I\\x04\\x1b\\xa7\\xa7\\xac&\\xa1\\xe2\\x1e\\x95\\xd1\\x8a\"\\x11\\xa98\\x15C\\xebu\\xec\\xdaJ\\xa7\\x9c\\xff\\x00\\x89%\\xeb\\xd1'", "year": "2018"}, {"Unnamed: 0": 438455, "autor": "helged", "date": 1537986660000, "content": "A 600mm FF prime by Leica would be so ridiculously expensive that the market would be tiny. Canon and Nikon sell there’s at $12000+. I know exactly no one who owns the exotic telephotos from Canon and Nikon but have encountered many who rent them. I don’t see Leica having the market share to justify a healthy rental market so large expensive telephotos don’t seem like they would be economically viable from Leica. Yes, the Leica price tag for a 600mm f4 SL APO would likely be higher than high. But I would gladly put a long Sigma (or Panasonic) prime on an L-mount body - as long as the lens is optically good. Possibly not Leica SL-good (a la 50Lux-SL, 75 and 90Cron-SL), but still good.", "link": "https://www.l-camera-forum.com/topic/289855-so-what-l-mount-lenses-do-you-want-sigma-and-panasonic-to-make/?tab=comments#comment-3600721", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "a 600mm ff prime by leica would be so ridiculously expensive that the market would be tiny. canon and nikon sell there’s at $12000+. i know exactly no one who owns the exotic telephotos from canon and nikon but have encountered many who rent them. i don’t see leica having the market share to justify a healthy rental market so large expensive telephotos don’t seem like they would be economically viable from leica. yes, the leica price -----> tag !!!  for a 600mm f4 sl apo would likely be higher than high. but i would gladly put a long sigma (or panasonic) prime on an l-mount body - as long as the lens is optically good. possibly not leica sl-good (a la 50lux-sl, 75 and 90cron-sl), but still good.", "sortedWord": "None", "identifyer": 51697, "doc": "b'x\\x9c\\xddZ\\tX\\x14G\\x16f<Q?\\xe3\\x11\\xaf\\xf5\\xc2\\x10\\x8d\\xf1\\x04E\\x8c\\x9a\\x10\\xe5\\x10\\x01\\x15F\\x04\\x14A\\xa1\\x99\\xe9\\x19Fz\\xba\\x87\\xee\\x1ea\\\\\\\\\\x8fM\\x8c\\xf7\\x81\\x8a\\x8a\\xa2\\xd0s\\x00\\x82x\\xc4\\x8b\\x18o\\x881\\x86\\r\\xde!\\xa2FtW\\xd7(^\\x89G<\\xd8F\\xa7P_RK\\xcf\\xce|l\\xbe\\xcc\\xc7\\xd4\\xdf\\xaf\\xab\\xe97\\xef\\xf5_\\xaf^\\xbd\\xae\\xf9\\xd9\\xd3H\\x96\\xd30\\xb4\\xd1\\xbd\\xff\\x003\\xc1\\xf3,\\x97\\xe1\\xed\\x1b\\x184z\\xcc\\xd8\\xe0\\x10y\\x89\\xac\\xa8DV\\\\\"\\xfb\\xca\\xc23\\t$\\xcd\\x15\\x0f\\x8f\\xed=Z\\xfd\\xe0\\xf3\\x7f\\xf61C\\x9c\\xe4\\xf4\\xf2\\xb3\\xb6\\xc2\\xd8iF\\xc6\\xe5S\\x1be/\\xe5zNo~\\x1aXQ\\x06\\xce\\x1f\\x9e\\x90\\x16\\xd1q\\x89\\xc2\\x80\\xe4g;\\xe2\\xc6\\x05\\x04T\\x9d\\x858\\xd9\\xda\\x1f\\xdd\\xed\\xed=?\\xa5\\xdc\\xe7\\'\\xe6\\x9c\\xda~\\x85\\xeb\\xb9\\xbd\\xbe\\xf5\\xfcB\\xd9\\x9b\\xf7\\xaf\\xb2~\\xd0}w5qY\\xf7\\xe9n\\x8fvH\\xae\\x88\\x8eY\\xa8\\x8aZ\\x14\\r1\\xda\\xda\\xff\\xd71]:4\\x1cw\\xa9\\xe9\\xf8\\xd1=]\\x1f\\xec\\xcf#d@O=\\x8c\\x9ef\\xc9i\\x83\\x1b}\\xe1\\xfc\\x17$\\xaf\\xdc\\xe7\\x94\\xe0\\xe9\\x97\\x13\\t\\x11\\xe9\\xd9\\xde\\xfd\\xebQy\\x1f\\'\\x9eFz\\xa0\\xdfp\\xf6\\xb8\\x1d\\xbc\\xf8\\xab\\xeb\\xa0\\xdd\\xeb\\x91\\xbc\\xae|_z:\\xa5X\\x071\\xd6\\xda\\xdfj\\xd8\\xb9\\x83W\\xfe>\\xe0\\xfc\\xe6Z\\x9eOmz\\x86\\xcc\\x8e?xVg\\xb9\\x0e1\\xdc\\xda\\xef\\xa2\\x9ark`\\\\e\\xab\\xbd\\x18=U\\xe0\\x83\\xce\\x7f\\r\\x88\\x11\\xadk\\xce\\x86\\x1cZNC\\x84\\xf6\\xec\\xb6\\xfe\\x1f\\xe2\\xc1\\x1c\\xd9\\x7f\\xd7\\x03\\xed\\xb98;\\xb0\\xf8\\x9d\\xc2\\xa6\\x04\\xc4\\t\\xd6\\xfe\\xd6i\\x9dwm\\xdd\\x1cry\\x15\\xc6\\x1e\\xdc\\xf39\\\\\\x12U\\xda\\xa3^zO$?\\xb8d\\xee\\x9a\\xef\\xden\\x19D\\xa4g\\xcan\\xc3I\\x97\\xb2\\x96\\xc5cJg\\xdc6\\x15]M\\x84z\\xa0\\xff\\x90\\\\\\xea\\x1fJ\\xdd\\xfd5i\\x08\\x92\\x19\\xbf\\xfcXf\\xc8\\x81\\xcf FX\\xfb+\\xf6^u\\xf7o\\x15Xo\\x19\\xc6\\x1e\\x1c\\xaf\\xe1\\xf3\\xa1:\\x1fLM\\xc8\\xccH\\x80(U\\x0f\\xceoPO\\xb3\\x80.\\xcfz\\x87\\x0f5C\\x0c\\xb3\\xf6\\x97\\x154(\\x9aw\\xd4\\x90\\xba\\x04\\xa3\\xe7\\x19\\x86\\x07\\xea\\xaaN]\\xb2N\\xbarH>_\\x90MTD\\x1e\\xfb\\x08b\\x9c\\xb5\\x1f\\xf1:\\xdb\\xc6\\xf1\\x03\\xedIM\\xe7<-\\xaa\\xb7\\xd4\\x10\\xa5\\xc6Q\\x9c\\xdf*W\\xb7\\x8c\\xfeq\\xcf\\xae\\xc7H>\\x1d\\x9f\\xf7\\xfd\\xc0\\xd0\\xb0 \\x880\\xee\\xe0\\xe2\\x01\\x8e\\x07\\x7f\\xf4\\xf1\\xb3\\x06\\xa3\\xe7\\t\\x86\\x07p\\xfc\\x9c\\xc8/\\xbb\\xf8\\xd9\\xf3\\xf2\\xb6\\x10\\xa5\\xf2\\r\\x17w \\xdf\\x84\\xc3\\xf9cn\\x96\\xcd\\xdc\\x02\\x91\\x00\\xfd\\xfb0z\\x1e`\\xf4\\xf4\\r\\x9d\\xae\\x8a\\x992\\x0fM\\x97N\\x05\\x0f[/\\x99\\xe1\\xe4V\\x021\\xd6\\xda_\\xdb\\xbc\\x80\\xe2*\\x9c\\xb7!\\x0f\\xce\\x8c*\\xef\\xb9\\xa8\\xdf6\\x17\\x88\\x91\\xd6\\xfe\\xde\\xfd\\xa6\\xc4y\\xbf[v\\x7f\\xb5\\x8d~s\\xcb\\x19\\x1e8el\\xd9{Hn\\xf2m\\xab\\xa9+\\xf6/\\xca\\x83\\x08\\xedI\\x07\\xf3\\xc2L\\xab\\xfc\\\\\\xe2\\xbc\\xb0\\xe8\\x07\\x83\\x97\\x85/5@TZ\\xfb\\xd7>\\x19\\xdf7\\x8a\\xffd\\xa6\\xad\\xf1: c\\xae\\xfc\\xbb\\xcaf5\\xbcv\\xea\\xebr-0c\\\\\\x17\\x881\\xd6\\xee\\xc2\\x83\\xcb{U-\\xeew&\\xcb\\xce8\\xba5S\\xf0\\x99\\x9d1\\xcf\\xb9\\xdd\\xb3\\xadF\\x95\\xdb\\xd3+\\x1f\\x0e\\x1d\\xd3\"\\xd5\\xf9\\xf4,dO\\xebg\\xads\\xcb\\'\\x04\\x1e\\xc2\\x8d\\x1f\\x9c\\xdf\\xa8\\xe8z7\\xda\\x0f\\xbf\\xb6\\x13\\xc9*\\xe7m^-\\x17\\xdc\\xc8\\x82\\xe8\\xe8\\xfc 9\\xdc@\\xb7l\\xbez=D\\x05\\xe8\\xdfd\\xa7\\xdfv\\xfc\\xec\\xabo8kN\\x0cD\\x98\\x8f\\xc2<dA-|\\x83\\xf9h@l\\xe2\\x93\\xe9\\x0b\\xfd\\xf7C\\x84z\\xf21\\xf6<\\x95\\xa8\\xc7\\xde\\xb8\\x83\\x8b\\xa30\\xee\\xb8\\xb8\\\\\\xd2uO\\xdd\\xef\\x8f\\xf0\\xc0H\\xbf\\xc4\\xaa=\\xed\\xbd\\x11\\xaf\\xcb{\\x0cw\\xeb\\xf6`\\xee>\\\\\\xdc\\x91\\x01D\\x9f\\xca\\xe0\\xc2\\x1b7\\xd7?\\x9c\\x86\\xe4zI\\'{\\xed=\\xca\\'@t\\xf48}\\xb0\\xa6\\xfe\\x05\\xae\\xb7\\xbe3DG\\xe7Us\\\\\\xb7D\\xdeKt\\xdb\\t\\xd1\\xde\\xfc\\x00\\xea\\x99\\x18\\xa48\\xce\\x18\\x86\\xde\\x83\\x08\\xf3\\x83L\\x1b\\xf3*\\x18G\\xcd\\xf7\\x94\\x9f\\x8c\\x88+\\xf1\\x84\\x88x\\xd04t\\xf3;\\xec\\x91\\xbd>\\xb5\\xf1\\xa06{6n|~\\xcd\\xa3x\\xd4h\\x84\\xe7?):\\x97\\xf9\\xd3\\x9e\\xee0\\xbe\\x1d\\xb03\\xbe\\xd9\\x9b\\xbf\\xe1x\\x00\\xf3\\xb7\\xcbO\\xd4[\\xd95k\\xe7A\\x84yH\\xaa\\x8d~\\x83y\\xc8\\x83\\x88\\xd2\\xd8\\xe1\\xdeT\\x01\\xc2\\xccQ\\x01\\xdf\\xb2\\xf3\\xc6\\x0bp\\x1dl+\\x0f\\xe0:8\\xd7c\\xe2\\xfb3\\x8c[(\\x88\\x8e\\x9e\\x17\\xa4\\xe6;\\xbbm\\xd4\\xf3g\\xcfw\\xf4yn#\\xe8\\x88\\xd6\\xdf@\\x94j\\xcf#\\x89\\xf6\\xb4\\xfe\\xc7\\x17\\x15\\xc3\\x1f\\xfe\\xeb8D\\x94\\xc7\\xa3xm\\xebzA~\\xe7\\xed\"\\xe7E)\\xc5HN\\xeeqbvD^\\xc0v\\x84\\x1b\\x8eG}\\xd0\\xa3q\\xde@\\x14\\x0f\\x06F\\xa6\\x12\\xf7\\xcf6\\xf3L\\xc7\\xe8\\xc1\\xe5\\xd7\\r\\x9b\\x1dh3|\\xc0\\xe3\\x05HVD\\xae\\x0f\\xe97\\xff\\xea\\\\\\x88p\\x9c\\xe2\\xc6\\x0f\\x8e\\x07p\\x9c\\xd6U\\x1c\\x15\\\\\\xe2\\xbe\\xfd\\xc8\\xf7b%D8\\x9f\\xda\\x1aG\\xe1|\\xba\\xd8h\\xach\\xac\\xd8F#L\\xcb\\xf3\\x9ft\\xa4\\xf3\\xc0\\x1b0?\\xb0\\xd5o\\x1dw\\x9c\\x08<T8\\xec\\xbb\\x1a{\\xec\\xccwnb\\xf48:\\xdf\\xc1\\xad\\xb3`\\xbec\\xc9d\\x9a/=\\xfcK\\x17\\x88R\\xc7\\x0fn\\xfe\\x81\\xe3\\xa7XvzQ\\x84\\xfa\\xce\\xb5\\x9d\\x19k|\\x9a~=\\xb8\\x11\\xc2)\\xd6~\\x94\\xef\\xe4\\xda\\xc97\\xef\\xcd\\x97>\\xff&v\\x96\\x19\"\\xe2\\x9b\\xa3\\xeabR\\xeb\\x89\\xb6\\x8e\\x9f\\xdf\\xd4a\\x15w\\xfb\\xdf\\x0e\\n\\x99\\x8e\\x10\\xc57d\\xcf\\xb2\\x9b3\\xc7\\x0e\\xf1\\x0bjk\\xeb:\\xab\\xea\\xbd\\xa8\\xd2\\x11\\xd3\\xcf\\x95\"\\xb9\\xae\\xf2\\x10\\xa9u${\\xeb\\xd7\\x8d\\x8bF>\\xddQ\\xe4\\xcbBtt>\\xba\\xecq7\\xd9\\xf6\\xa1\\x1b\\x06AD\\xbc\\xee[\\xaa\\x1c\\xb5\\xe0^\\xf6X[\\xe7\\x1f\\xc8\\xeb\\t\\x9a>\\x05?\\xba%\\xb6\\x80\\x08y\\xbd\\xd4\\xcez\\x95\\xbd\\xefeP\\xdc\\x81z\\xe0{\\x99\\xd1\\xd3\\x1b\\xd7?\\x13\\x9e\\x13\\x04Qj>\\x8a\\xe3\\x1b\\x9c\\xe72\\xa8\\xce\\xd1\\x1e\\x9fn3Btt\\xde+\\x95\\xd78\\xbe\\xe1\\xd6\\xdb\\x90o\\xf6\\xd6\\xe3\\xa5\\xf2\\xad\\xe1R\\xed\\xa4\\xac\\xd9\\xee\\xefAt\\xf4\\xf3\\x91Z\\x8f\\xaf\\xabuIm\\xf3)\\xd4\\x03\\xd7%\\x7f\\xb6\\xf9\\x94:\\xbffI\\xc6\\x88\\xe7\\'!\\xc2\\xb8\\x83\\xcb{+%\\xc6\\x9d\\xb9#\\xcf\\xa4w\\xf2\\x9f\\xf9\\x14\\xa2\\xd4\\xf7%\\xb8\\xe7\\x03\\xedAy!D\\xa9y\\x15\\xee\\xf9\\x1c\\x8d\\xbe\\xe5u\\xc7\\xb0\\xe6+$\\xff\\xd1\\xdec\\xe0\\xe6\\x05\\\\\\xdc\\x81\\xcf\\xe7rJe\\x9f\\x88\\xeb\\xe3\\x9aBtt\\xdc\\x99\\x12\\xbb>-\\xb1\\xaa\\xd7y\\x88R\\xdf\\x97\\xe0\\xf2\\x1d\\x18\\x0f\\xea\\xaa~PW\\xef\\x9d\\xed]\\x97<\\xc4\\xe8\\x81\\xeb\\x92v\\xacG\\xa7e\\xa3\\n\\xb6B\\x8c\\xb2\\xf6/\\x1fdj\\xa3\\t\\xed\\xde\\xcf\\x8c\\xd1\\xd3\\xc2\\x8ap]\\x02\\xfdV\\xd8\\xae\\xe3\\xc2\\xc5\\xb7\\x9e\\xbe\\x0b\\x91\\x00\\xfd8{\\xderz\\xd3\\x7f\\xe8\\xfc\\xed\\xfa+\\xb7\\x94\\xbe\\xf5\\xd7SH\\xb67\\xef\\xc5\\xc5\\x1d\\x98\\xf7J\\xe5\\x01.\\xef\\x95\\xfa\\xfe\\xf4\\xec\\x8fmM?\\xec{\\xb6\\x14\\xa2\\xa3\\xf3\\xeb\\xe8\\x16\\xcb\\x1b\\xf7\\xf4\\xe9\\xf8\\xfc7\\x08\\xf4\\xe0\\xe2hS\\x89zf\\x9a\\xb5W/4Zv\\x11\\xa2\\xa3\\xc7\\xa9\\xbdyoC\\x8c=\\x7f\\xb4\\xfdHP\\x0fn?\\x92T=-\\xbf\\\\\\xc9\\x9c\\xf4!ZC\\x8c\\xb5\\xf6;\\x8a\\xd7\\x85+\\\\n\\x85\\xc7\\x1c\\xed\\x0cQ\\xaa\\x1e\\xa9\\xbc\\xeerel\\x9b\\xcc\\xc6\\xce\\xbd!B=\\xb8z\\xef\\xaf\\x12\\xe3\\xb5\\xbd\\xf9\\x01\\xceo0?\\xb8\\xd8\\x8b0v\\x9d\\xb4`2DG\\xcf\\xdbu\\xb5\\x1f\\xe9\\xca\\x90G]7O\\x1a\\xe7\\x8ap\\xf2\\xb1k\\xf2\\x95K\\xfa$\\xa1\\xfc\\xc0\\'\\xa2\\xa0\\xe2\\xd8\\xacc\\xf5m\\xddO\\x91\\xf4H}\\'&d\\xddA$\\x9fk\\xf3\\xd3\\xfc\\xd8\\r%\\xab ::\\xee\\xa0\\xdf\\x0fQ\\xea\\xfa\\x07\\xa7\\xc7\\xd1\\xfbCpy\"\\xcc\\x0f\\xec\\xad\\xfb\\xe3\\xf6u\\xc2\\xba\\xbf\\xa3\\xea\\xa3\\xd0\\x1eX\\x1f\\xad\\xabq\\xba:\\xe4\\xc4\\xa2\\xe7[]\\'Ct\\xf48\\xed_\\x16\\xe2<=\\xbcY&DG\\xd7G\\xed\\x9dO\\xb1~\\x03\\xf3\\xe9\\xe6\\x8d\\x87\\xa9\\x0b}o}\\x0e\\xd1\\xd1\\xf5\\x83\\x8f\\x0b\\xee\\xf6\\xce[Zp\\x04\\xa2\\xa3\\xeb\\x89\\xbbN\\xec\\xd2\\x95tPm\\x81\\x88\\xc6i\\x8b\\xe1\\xdc\\xb0&\\x87\\xa7\\xdd\\xc2\\x8dS\\\\<\\xa0+\\nV\\x14\\x9f\\xfe\\xe2\\x02\\x92\\xbf,\\x1f\\xba6)\\xe8\\xdf\\x1e\\x10\\xa5\\x8eS\\xec{@0NO\\xad\\xdbV\\xb5!\\xfb\\xee\\xc7\\x10c\\xad\\xfdh>E\\xfbj\\xe0\\xfbF\\xa9\\xf9\\xc1\\xba\\xe2\\xbd\\xd3\\xe7\\x1f\\x08\\xf5\\x84\\x88\\xfc\\xd6\\xf6z\\x83\\xb4\\xcc\\x15C\\\\q~\\xc3\\xf1\\xa0\\xa1\\xe7\\xd1\\xcbi\\x8d8\\x14V\\xb0\\xfb\\xa2!\\x0fp\\xf5\\x10\\\\\\x1d\\x16\\xda\\xb3w\\xf0\\xfe\\xe9]6\\xf8\\x07Ct\\xf4\\xfc3r\\\\AjF\\xc6\\x82\\x13\\x10m\\xdd\\x87_\\xdb8\\xbd\\xf8!Q\\xd93@\\xdb\\x0b\"\\x1c\\xa7\\xb6\\xe6\\x89p\\x9c\\xee\\xdc\\x96\\xbe\\xaa\\x9dS\\xe3\\x99\\x10\\x11\\x0f\\x9e->\\xfbMI\\'\\'\\xd6V\\x1e\\x9c\\xdc\\xdc\\xff\\xc0\\xca\\xf9%5\\xfb6\\xbe\\xeb\\xf07\\xe3\\xa5\\x0f\\xbd\\xbf\\x87(\\xd5\\x1e\\xa9qG\\xbb`\\xd7\\xec\\x92_\\xa27A\\x84|\\xc3\\xe5\\xa3R\\xf9V\\x9b\\xdf\\xd2\\x9a\\xf5-\\x90\\xafh\\x96\\x89\\xf3\\xdb\\xcf\\x12\\xf9VqH\\x88q]\\xf1\\x81\\x1a\\xa2\\xa3\\xe79\\xdc\\xbc U\\xcfm;\\xedqt\\xdd\\xb2\\xae\\xf6y\\x8fNm\\xf5\\xfd\\xb1\\xf7\\x8f4\\x87(u]/u\\x9d\\xe5\\xb3\\xe7f{\\xe5\\xb4\\x89n\\x08\\xe1z\\x01\\xed\\xaf\\xb2\\xb5n\\x19}\\xeegy\\xd4\\xcd{\\x13\\x91<\\xa0\\xeb\\x9c=7\\x92i\\x15DG\\xf3\\xed\\xfc\\xc1C\\xa7\\xa8\\x13\\xbe!\\x10\\x1d]\\xb7\\xb47\\x8f\\xbf\\x8e\\xd1\\x03\\xf3x\\xef\\xdc\\x0eS\\xa3\\xe4\\xf42\\x88R\\xfd\\x86\\xea!\\xb5\\xd5\\xf9\\xe0\\xfb\\x0b[\\xdfc\\xe0\\xe6\\x9f&\\xf7r\\x8e\\'>k1\\x12\\xc9\\xf6\\xd6\\xdfp\\xe3\\xd4\\xd1u\\n\\xa9\\xf9N]\\xcdsRym\\xebz\\x01\\xf2\\xda\\xde\\xbc\\x17W\\x7f\\x83y/n]BZ\\xfb?}\\xdci\\xcf\\xc6\\xb4\\xfdgp\\xfb\\xbcq|+\\xd4\\x0e\\x90\\xb9?r.G\\xf28\\xd7\\xf6\\xefT\\xf6a\\xa6@\\x94\\xaa\\x07\\xc77\\xa8\\xe7F\\xe0\\xbb\\\\\\xc0\\x9d\\x07\\xb3 \\xe2\\xea\\xbd\\xe8\\xbe\\x8bm\\xcc\\xaf\\xeb\\x8ao\\xb8\\xf1\\x03\\xedYag\\xfd\\xcd\\xde\\xf7\\x0bU\\x18=\\xf0\\xfdB\\xe7\\xabs\\xef\\xafX\\xe0\\x11\\x05\\x11\\xd6a\\x91=\\xf0\\xf9H\\xdd\\xef_W\\xfbGs\\xce\\xca\\xee\\x9fK\\xf4Z\\x0f1\\xd6\\xda\\x0f\\xf7\\x8fJ^7:\\x98o\\xb8\\xbcW*\\xdf\\xa0=\\xf6\\xf2\\xcd\\xde\\xf5\\xe9c\\x8c\\x1e\\xb8>\\xb5\\x97\\xd7\\xb8}\\xb7\\x90\\xd7\\xf6\\xd6\\xf9\\xeeJ\\xe4\\x1bq\\xb6\\xbcU\\xe1*u(\\xc4\\xffW\\xfe\\x86\\xe35n\\xbd\\xe0\\xe8\\xfc\\r\\xb7\\x9f\\x02\\xe6o\\x16NG(H\\xaeh\\xbd\\xccI\\xf6\\xe6\\xc7\\t\\xb5\\xd5\\xde\\xf9\\xbd\\x8f\\x93\\xec7\\xff\\xf3\\xfa\\x19\\xa7\\x9ac\\'|\\xef\\xeb\\xb7F\\'jT:!\\xc8\\xa6HZ\\xcd\\xc7sE\\r\\xaa\\xc7I6\\xc7\\xb3\\x1aZ\\xcd\\x95;\\x15ffu\\x17zrY\\xefg\\xf5\\xca\\xea\\x93\\xd57\\xab\\x9f\\xb9\\xdf\\x98P\\x1f\\xb1\\r\\x15\\xdb\\xac\\xfe\\xe6\\x01\\x03\\xdd\\xdd\\xdd\\xcd\\x9e\\xee\\x94>\\xd98\\xd8\\xdd]\\xf8\\xc0\\xd32\\xd4]\\xc12t\\xd6\\xb0\\xb2\\xee\\xde\\x9c\\x8eT\\xf0^r\\x92U\\xa5\\x84\\x914Gz\\xc9\\t\\x8eO\\x89 \\xd98\\x7f\\x86\\xd5\\x8a\\x12\\xcb\\xbf\\xba\\x8ae\\xd4\\xe8*\\x96\\xe4\\xde\\xbc*\\xc7\\xd7;\\xd4/0\\xd8{\\x8c\\xe0\\xeb+\\xf8\\xfa\\x95\\xf5\\xf6%\\xc4\\xeb\\xbc\\x15\\x8a\\x94`\\xbd6\\x8ed\\xbd\\xe4\\x94\\x9eM\\x11\\x15q\\x0c\\xed\\xe5\\x91\"\\xde\\x8b\\x0e3\\xe8\\xaa\\xef\\xc4Y\\xaf\\rf\\xb4\\xff\\xcb\\xb5\\xe3E7\\xa0k\\x07\\xbcqm\\xbe/CO}!\\xf8ju\\x82_X\\xa1\\x1f\\xa9\\xd2\\xd0\\x1a\\x9e\\xf4\\x12\\x0f^]\\xe9\\xcd\\xf2\\xafz\\x02i\\xe5\\x1b=\\x9b\\xfcH5K\\xbe\\xb8\\x03:\\x943\\x9c0r\\xa2\\xe0?!O4\\x9e\\xd4\\xa8i\\xafH\\x923\\x05D\\xca\\x03\\xb2\\x02\\x85\\xc0`!(\\xc8\\x18\\x14\\x14*\\x8c\\xf53\\x8f\\r\\t\\x1e\\x19Y\\xe69\\x96a\\x94/n\\xfc;\\xbf\\xd8\\xe3w\\x1d\\xea\\xaf\\xa1\\xcb\\xba\\xd5\\xfc\\x1b\\xe6\\n!8\\xd8\\x18\\x1c,\\x17\\xbf\\xe3\\xf3\\xc5;\\xbf4\\x94`\\x95y\\xaf91\\xef5\\x95e}m\\xd1o\\x0c\\t\\x1d\\x95-\\x0f\\r\\xf1\\x0b\\xf7\\r3\\xcaC\\xe5\\xf9r\\x86\"X\\ro\\xf0\\n&\\xd5_\\xca\\xf5\\xb4\\x82\\x1f\\xafQ\\x92\\xd5\\x97\\xa6\\xbc\\x90^\\xe8\\xf7a\\x15\\t\\xafu\\x06\\xd2\\x1a\\xd0Y\\xf0J\\xf4e\\xb4\\xda\\xd7D?\\x82\\x8b\\x7fM\\x14\\x7f\\x9f&g\\\\\\xb8wpX`X\\xa4\\x10\\xeac\\n\\r\\t\\t\\x13\\xc2Bv\\xe3\\xbc\\x11\\x1e D\\xf8\\x18#|F\\x89\\xdf`\\xf1+\\x17\\xbf\\x93\\xf2_\\xbf\\xe4\\x95\\x10H\\xab\\x84\\t\\xf2,\\xc2L(\\x18\\xad\\xceL(\\xa7)(\\x8b\\xd8j\\x19\\xa5\\x89\\x10\\x1b\\x81\\xa0\\x8d\\x04\\xad4\\x12:\\xc6L\\xe8t\\xe2\\x03\\'\\xc4?\\xdeH\\xe8\\x93\\x858\\xd2\\x14\\xc7(\\r\\xc68=/\\xc4\\x19\\xcc\\n\\x82fhA\\xa10+\\xaao\\x95S\\xdd0zZiR\\x88\\xdc3*I^P2&%\\x1375\\x9f\\x14\\xcf0Z\\x8d\\x82\\xa0(C.I+\\xc4\\xabx\\x92\\xcd\\xab9\"\\x95\\xd9d2\\xa1\\xe0)\\x83\\x85Lfx\\x8d\"\\x97L\\xd6\\x89\\xb6j\\xa6\\x91&\\xf1\\x88\\x12T\\x83\\x04\\x95\\xca\\xa8bX\\x93\\x8ae\\xb4\\x165E()\\x83I-\\xb2\\xc4\\x14OL#-b#>\\xd8\\xecx\\x92\\xa0\\xf8x\\x83)^\\xa3\\x8e\\xb7T7$\\x9b\\xa51ih~\\xaa\\xa0\\xe1\\xb2\\xa7\\xea9^\\xa32\\x98\\x12h&)\\x8b\\x12(\\xc2,>U5i\\xa6H\\xf1\\x97\\x99\\xc4\\x10\\xc3\\x99(M\\x02i\\xa9n\\xc4\\xbbS\\x0c\\xad6i\\t\\xda 6l\\x82\\xa5\\xba\\x11M\\xd2j\\xcd\\xda\\xea\\x1fm\\xa4I\\xb5\\x99\\xd6$0\\xb4\\x89\\xae\\xf6\\x1a\\xcd\\x18i\\x86\\xcf\\xa1u/]i\\xa69}\\xdcT\\x0b\\xad\\xd7\\xbe\\x10*f\\xad\\xe5\\x05\\x86624\\x99\\xcb\\xe8\\xf8\\x97\\x9e\\x10\\x18\\xd6\\xc8$\\xd1&\\xf1\\xcb\\xe5\\xea\\x08\\x9a\\x10I\\xa9Q\\x98t\\xa2\\xc7rD\\xbfs\\x9a8\\xf1W\\xe8XRg\\xd6\\xb1\\x1a\\x05Y\\xddj\\xc5\\xb6\\x9a&F\\x9d\\x9e7\\xb3$\\xa5\\xa0L,I\\xf3\\x96\\xea\\x86\\xa0\\xf2Y\\x8dR\\xa3\\xd0S\\x8c\\x9e\\xa3\\x0cF\\x8e$M\\xe2W+6\\x14e\\xe6\\xe2\\t\\x964s\\x1a\\xb5\\x96\\x108J\\xe0\\x18\\xb3\\xe8\\x0c\\x8a2\\xf2\\x84:\\x97\\')R\\x17\\xcf\\xf0\\xcc\\xa6\\x9a#\\xce\\xc4\\xc7\\x13tu\\xc3\\x1b\\xf9xR< \\xb5f\\xb1a_\\x1c\\x1aL\\xbc\\x866\\x08<c\\x99\\xa6!\\xe2(\\xd2\\x98\\x14\\xcf\\x98\\x93\\x18=\\xa54\\x1aH\\xce(Zk\\x12\\xbf\\x9cIA\\xf0\\xdc\\xf2Yf\\x15E\\xa8\\xb9\\xe5\\xb3\\xb7\\xc7\\x13\\\\\\x8c\\x9e\\xaev?\\x1d\\xf3r\\xda9\\x9c\\'\"\\x1d\\xa3f\\x19\\xbd\\x8e[^$[\\xf6\\x1f-;\\x00\\x07'", "year": "2018"}], "name": "tagL-Forum2018"}