{"interestingcomments": [{"Unnamed: 0": 352838, "autor": "Berth", "date": 1408671420000, "content": "Much nicer looking P version. Obviously Leica couldn't produce M-P with smaller screw as you got there first, where do we order? They have a little screw on my M no dash P. It'll cost you $4,995, the price tag from B&H Photo.", "link": "https://www.l-camera-forum.com/topic/232629-the-new-leica-m-p-discreet-faster-harder/page/4/?tab=comments#comment-2654346", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "much nicer looking p version. obviously leica couldn't produce m-p with smaller screw as you got there first, where do we order? they have a little screw on my m no dash p. it'll cost you $4,995, the price -----> tag !!!  from b&h photo.", "sortedWord": "None", "identifyer": 13982, "year": "2014"}, {"Unnamed: 0": 380198, "autor": "bla", "date": 1393487700000, "content": "Do you mean, that if in the source folder are DNG files out of camera, they will be modified by m8raw2dng, when accidentally converted with m8raw2dng ? Yes, but there won't be much change. If you call with the -l parameter, the lens information will be corrected, otherwise the aperture guess will be improved, the makernote safety tag will be added, sensor lines will be corrected and the darkfield correction will be also applied. I normally do not change the files directly in the folder yet, as this is still a beta and I do not know if there is a small error after all. It would not be desirable to have m8raw2dng modify the original raw file, it should stay in original condition. As I said, one could do a small exif addition file, too, if you want to get rid of the jpg (for example a jpg stripped of the image data. Would then be just a few kb...) Let me know if you would like that Regards, Arvid", "link": "https://www.l-camera-forum.com/topic/216705-m8raw2dng-tool-to-convert-leica-m8-raw-files-to-dng/page/4/?tab=comments#comment-2540214", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "do you mean, that if in the source folder are dng files out of camera, they will be modified by m8raw2dng, when accidentally converted with m8raw2dng ? yes, but there won't be much change. if you call with the -l parameter, the lens information will be corrected, otherwise the aperture guess will be improved, the makernote safety -----> tag !!!  will be added, sensor lines will be corrected and the darkfield correction will be also applied. i normally do not change the files directly in the folder yet, as this is still a beta and i do not know if there is a small error after all. it would not be desirable to have m8raw2dng modify the original raw file, it should stay in original condition. as i said, one could do a small exif addition file, too, if you want to get rid of the jpg (for example a jpg stripped of the image data. would then be just a few kb...) let me know if you would like that regards, arvid", "sortedWord": "None", "identifyer": 41586, "year": "2014"}, {"Unnamed: 0": 449863, "autor": "Zhangalbert", "date": 1410971040000, "content": "There are few other things i would say minor quirks, one day i found the shutter speed dial error as i scroll through it manually but the information screen tells me im in auto setting --img--  solved by restarting it The other day i was just checkin my XV in my room, its pretty dim. I didnt aim it at any direct light source, and its on manual setting, All of a suddeny my lcd blast with a purple light of some sort... Wut tha... So i investigate further by aiming down on the floor and shot under exposed the setting was iso 3200, wide open on widest focal range, starting from 1/125 and increasing it halfstep all the way to 1/15 And i discovered purple light both on left and right bottom corner it looks like some sort of flare, its subtle but noticeable up until 1/30 (its under exposed by 1 step) On 1/15 it disappear... I dont know maybe its all common with the digital thing, i started photography as a hobby through the analog era, i used to shot with FM2 when i moved to digital camera i bought lumix lx5 it never let me down, and it does had ugly vertical purple flare too on video but never on photo mode. All these quirks happens randomly on rare occasion, but judging the price tag and the duration i have used it, i doubt it reliable to use for the next lets say 3 years. My lx5 had been abused so badly for the last 2 years, been dropped more than once, sensor was blast through lightings from music scene countless time, took flight many times, and the only thing that it gave up was the flash. I aint planning to abuse my XV though lol Edited September 17, 2014 by Zhangalbert", "link": "https://www.l-camera-forum.com/topic/234064-purple-image-from-x-vario/?tab=comments#comment-2672188", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "there are few other things i would say minor quirks, one day i found the shutter speed dial error as i scroll through it manually but the information screen tells me im in auto setting --img--  solved by restarting it the other day i was just checkin my xv in my room, its pretty dim. i didnt aim it at any direct light source, and its on manual setting, all of a suddeny my lcd blast with a purple light of some sort... wut tha... so i investigate further by aiming down on the floor and shot under exposed the setting was iso 3200, wide open on widest focal range, starting from 1/125 and increasing it halfstep all the way to 1/15 and i discovered purple light both on left and right bottom corner it looks like some sort of flare, its subtle but noticeable up until 1/30 (its under exposed by 1 step) on 1/15 it disappear... i dont know maybe its all common with the digital thing, i started photography as a hobby through the analog era, i used to shot with fm2 when i moved to digital camera i bought lumix lx5 it never let me down, and it does had ugly vertical purple flare too on video but never on photo mode. all these quirks happens randomly on rare occasion, but judging the price -----> tag !!!  and the duration i have used it, i doubt it reliable to use for the next lets say 3 years. my lx5 had been abused so badly for the last 2 years, been dropped more than once, sensor was blast through lightings from music scene countless time, took flight many times, and the only thing that it gave up was the flash. i aint planning to abuse my xv though lol edited september 17, 2014 by zhangalbert", "sortedWord": "None", "identifyer": 13354, "year": "2014"}], "name": "tagL-Forum2014"}