{"interestingcomments": [{"Unnamed: 0": 351619, "autor": "hepcat", "date": 1448659680000, "content": "Well, to help simplify for you, Hadley bags are Billingham. --img--  Jeff Sometimes I need a warning tag affixed to my forehead that says \"Engage brain BEFORE starting fingers when typing.\" Yes, I let my fingers do the typing without my brain being engaged... it should have read \"Billinham Hadley and Ona...\" Geez... --img-- ", "link": "https://www.l-camera-forum.com/topic/253687-shoulder-bag-recommendations/?tab=comments#comment-2938277", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "well, to help simplify for you, hadley bags are billingham. --img--  jeff sometimes i need a warning -----> tag !!!  affixed to my forehead that says \"engage brain before starting fingers when typing.\" yes, i let my fingers do the typing without my brain being engaged... it should have read \"billinham hadley and ona...\" geez... --img-- ", "sortedWord": "None", "identifyer": 12758, "year": "2015"}, {"Unnamed: 0": 369761, "autor": "timde", "date": 1421958720000, "content": "IMO the MM is not unique enough for its price tag, it is more or less an M-E and the \"nearly new\" price reflects that rather accurately.", "link": "https://www.l-camera-forum.com/topic/240158-m9-sensor-problem-killing-trade-in-values/?tab=comments#comment-2751430", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "imo the mm is not unique enough for its price -----> tag !!! , it is more or less an m-e and the \"nearly new\" price reflects that rather accurately.", "sortedWord": "None", "identifyer": 31060, "year": "2015"}, {"Unnamed: 0": 369763, "autor": "pico", "date": 1421959080000, "content": "IMO the MM is not unique enough for its price tag, it is more or less an M-E and the \"nearly new\" price reflects that rather accurately. Not unique? What other full-frame monochrome rangefinder are you comparing the MM to? .", "link": "https://www.l-camera-forum.com/topic/240158-m9-sensor-problem-killing-trade-in-values/?tab=comments#comment-2751433", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "imo the mm is not unique enough for its price -----> tag !!! , it is more or less an m-e and the \"nearly new\" price reflects that rather accurately. not unique? what other full-frame monochrome rangefinder are you comparing the mm to? .", "sortedWord": "None", "identifyer": 31062, "year": "2015"}, {"Unnamed: 0": 369768, "autor": "jaapv", "date": 1421963100000, "content": "IMO the MM is not unique enough for its price tag, it is more or less an M-E and the \"nearly new\" price reflects that rather accurately.Eh? It appears that you have no experience with either..", "link": "https://www.l-camera-forum.com/topic/240158-m9-sensor-problem-killing-trade-in-values/?tab=comments#comment-2751469", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "imo the mm is not unique enough for its price -----> tag !!! , it is more or less an m-e and the \"nearly new\" price reflects that rather accurately.eh? it appears that you have no experience with either..", "sortedWord": "None", "identifyer": 31067, "year": "2015"}, {"Unnamed: 0": 373142, "autor": "Gibbo", "date": 1427455620000, "content": "As promised, here are a couple of photos of my case and new insert. It's quite handy that the internal dimensions of the Immation DataGuard case are virtually identical to the Pelican 1520 resulting in the insert for the Pelican being a near perfect fit for the Immation. --img--  The insert kit comes with a bottom liner, lid liner, lens pads, side walls and assorted dividers and pins. I decided to add to that the special cutting tool and a couple of full length dividers just in case I needed more. As it happens I have not used all the dividers or pins but I did need the length of the full length insert so it was worth ordering them. The cutting tool works well but you do need a good grip as it is quite a stiff operation. The most time spent is on planning the layout. Once that is done it's quite easy to measure up by eye and trim the dividers to fit. --img--  When fitting the dividers, I placed them as tightly as possible to the lenses so that they are unlikely to flap about in transit. The little red tags are a bit unsightly but I put them in as they do make it a lot easier to pull the locking pins out if you decide to change the layout. I cut lens pads to go under the shorter lenses bringing them all to roughly the same height. The Immation case had some padding with it and I cut a couple of pieces from it to go under the camera bodies. All in all I'm very happy with the end result. With shipping and tax it was not cheap. Those two items effectively doubled the cost of the insert kit. But I got the Immation case free from a friend so I'm not going to complain. Hope this helps with your decision making process --img--  Edited March 27, 2015 by Gibbo", "link": "https://www.l-camera-forum.com/topic/241035-anyone-uses-pelican-1200-for-their-leica-m9-family/page/3/?tab=comments#comment-2787935", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tags", "selectorShort": "tag", "MarkedSent": "as promised, here are a couple of photos of my case and new insert. it's quite handy that the internal dimensions of the immation dataguard case are virtually identical to the pelican 1520 resulting in the insert for the pelican being a near perfect fit for the immation. --img--  the insert kit comes with a bottom liner, lid liner, lens pads, side walls and assorted dividers and pins. i decided to add to that the special cutting tool and a couple of full length dividers just in case i needed more. as it happens i have not used all the dividers or pins but i did need the length of the full length insert so it was worth ordering them. the cutting tool works well but you do need a good grip as it is quite a stiff operation. the most time spent is on planning the layout. once that is done it's quite easy to measure up by eye and trim the dividers to fit. --img--  when fitting the dividers, i placed them as tightly as possible to the lenses so that they are unlikely to flap about in transit. the little red -----> tags !!!  are a bit unsightly but i put them in as they do make it a lot easier to pull the locking pins out if you decide to change the layout. i cut lens pads to go under the shorter lenses bringing them all to roughly the same height. the immation case had some padding with it and i cut a couple of pieces from it to go under the camera bodies. all in all i'm very happy with the end result. with shipping and tax it was not cheap. those two items effectively doubled the cost of the insert kit. but i got the immation case free from a friend so i'm not going to complain. hope this helps with your decision making process --img--  edited march 27, 2015 by gibbo", "sortedWord": "None", "identifyer": 34446, "year": "2015"}, {"Unnamed: 0": 385540, "autor": "Lenshacker", "date": 1428783300000, "content": "Orange filter- Blue channel is left sensitive to IR. --img-- I1016049 by fiftyonepointsix, on Flickr --img-- I1016039 by fiftyonepointsix, on Flickr Custom software boosts the Blue and Green channel to match Red, then rotates the color channels in the Color-Filter-Array Tag of the DNG header. --img-- I1016044 by fiftyonepointsix, on Flickr Edited April 11, 2015 by Lenshacker", "link": "https://www.l-camera-forum.com/topic/242042-ir-experiments/?tab=comments#comment-2796332", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "orange filter- blue channel is left sensitive to ir. --img-- i1016049 by fiftyonepointsix, on flickr --img-- i1016039 by fiftyonepointsix, on flickr custom software boosts the blue and green channel to match red, then rotates the color channels in the color-filter-array -----> tag !!!  of the dng header. --img-- i1016044 by fiftyonepointsix, on flickr edited april 11, 2015 by lenshacker", "sortedWord": "None", "identifyer": 46945, "year": "2015"}], "name": "tagL-Forum2015"}