{"interestingcomments": [{"Unnamed: 0": 383985, "autor": "marknorton", "date": 1176205560000, "content": "Mark, Are there any part numbers on that standby battery - it looks like like a lithium cell, but I'm assuming its rechargeable - maybe NIMH? Sandy Sandy, it just says Varta, Germany. There's an M... obscured by the tag. Looking at the Varta web-site, it's probably MC621, 3v 3mAh, Li-Ion.", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/6/?tab=comments#comment-224618", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "mark, are there any part numbers on that standby battery - it looks like like a lithium cell, but i'm assuming its rechargeable - maybe nimh? sandy sandy, it just says varta, germany. there's an m... obscured by the -----> tag !!! . looking at the varta web-site, it's probably mc621, 3v 3mah, li-ion.", "sortedWord": "None", "identifyer": 45387, "year": "2007"}, {"Unnamed: 0": 383987, "autor": "robertwright", "date": 1176206460000, "content": "Sandy, it just says Varta, Germany. There's an M... obscured by the tag. Looking at the Varta web-site, it's probably MC621, 3v 3mAh, Li-Ion. Since it is a standard Li-ion cell, I doubt much whether leaving the camera battery out for 4 days drains it-so our speculation that this can \"reset\" the camera is pretty much bogus? You have an opportunity here to actually measure the cell, so you will know if it actually drains. In the manual, it says that it takes 30 days to recharge no?", "link": "https://www.l-camera-forum.com/topic/21079-anatomy-of-the-leica-m8/page/6/?tab=comments#comment-224629", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tag", "selectorShort": "tag", "MarkedSent": "sandy, it just says varta, germany. there's an m... obscured by the -----> tag !!! . looking at the varta web-site, it's probably mc621, 3v 3mah, li-ion. since it is a standard li-ion cell, i doubt much whether leaving the camera battery out for 4 days drains it-so our speculation that this can \"reset\" the camera is pretty much bogus? you have an opportunity here to actually measure the cell, so you will know if it actually drains. in the manual, it says that it takes 30 days to recharge no?", "sortedWord": "None", "identifyer": 45389, "year": "2007"}, {"Unnamed: 0": 384694, "autor": "Guest guy_mancuso", "date": 1195399200000, "content": "The Cron version IV is s different lens from the normal new Cron Asph and does have a different bokeh. It has been tagged as the bokeh king, it reminds me a little of the Noctilux. Different for sure", "link": "https://www.l-camera-forum.com/topic/38334-summarit-series-355090-ugly-test/page/2/?tab=comments#comment-405774", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "the cron version iv is s different lens from the normal new cron asph and does have a different bokeh. it has been -----> tagged !!!  as the bokeh king, it reminds me a little of the noctilux. different for sure", "sortedWord": "None", "identifyer": 46098, "year": "2007"}, {"Unnamed: 0": 384696, "autor": "earleygallery", "date": 1195400580000, "content": "The Cron version IV is s different lens from the normal new Cron Asph and does have a different bokeh. It has been tagged as the bokeh king, it reminds me a little of the Noctilux. Different for sure Good work on the tests! Real life testing is so much more useful that graphs and charts. I was wondering about the bokeh on the 35's - I like the effect of the Cron at f2. How does the Asph compare? is it more like the Summarit?", "link": "https://www.l-camera-forum.com/topic/38334-summarit-series-355090-ugly-test/page/2/?tab=comments#comment-405786", "origin": "L-forum", "suborigin": "L-Forum", "result": true, "Selector": "tagged", "selectorShort": "tag", "MarkedSent": "the cron version iv is s different lens from the normal new cron asph and does have a different bokeh. it has been -----> tagged !!!  as the bokeh king, it reminds me a little of the noctilux. different for sure good work on the tests! real life testing is so much more useful that graphs and charts. i was wondering about the bokeh on the 35's - i like the effect of the cron at f2. how does the asph compare? is it more like the summarit?", "sortedWord": "None", "identifyer": 46100, "year": "2007"}], "name": "tagL-Forum2007"}