{"interestingcomments": [{"Unnamed: 0": 99144, "autor": "danielandastro", "date": 1567100914000, "content": "Script to archive camera card /!/ I made a script for windows for backing up and compressing the photos on a camera card\n\n&amp;#x200B;\n\n [https://gitlab.com/danielandastro/card-scripts/blob/master/CameraArchive.bat](https://gitlab.com/danielandastro/card-scripts/blob/master/CameraArchive.bat) \n\n&amp;#x200B;\n\nyou may have to modify it to fit your use case", "link": "https://www.reddit.com/r/photography/comments/cx4acm/script_to_archive_camera_card/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "script to -----> archive !!!  camera card /!/ i made a script for windows for backing up and compressing the photos on a camera card\n\n&amp;#x200b;\n\n [https://gitlab.com/danielandastro/card-scripts/blob/master/cameraarchive.bat](https://gitlab.com/danielandastro/card-scripts/blob/master/cameraarchive.bat) \n\n&amp;#x200b;\n\nyou may have to modify it to fit your use case", "sortedWord": "None", "identifyer": 1832, "year": "2019"}, {"Unnamed: 0": 99175, "autor": "soccermom36", "date": 1567082722000, "content": "Have you thought about what happens to your work when you die? My brother, photographer Pierre Crocquet, left me his archive when he died in 2013. I keep the work alive using social media, with some success. Attached is one of his silver prints - Inner City Worship, Hillbrow, 2003. Nikon FM, Tri X.", "link": "https://www.reddit.com/r/photography/comments/cx0f7d/have_you_thought_about_what_happens_to_your_work/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "have you thought about what happens to your work when you die? my brother, photographer pierre crocquet, left me his -----> archive !!!  when he died in 2013. i keep the work alive using social media, with some success. attached is one of his silver prints - inner city worship, hillbrow, 2003. nikon fm, tri x.", "sortedWord": "None", "identifyer": 1863, "year": "2019"}, {"Unnamed: 0": 101987, "autor": "xSweetSlayerx", "date": 1551068111000, "content": "Vinegar Syndrome and Safety Film /!/ My boss handed me six boxes of film she claims have vinegar syndrome. I'm seeing nothing and smelling nothing that would indicate they're deteriorating. I'm concerned because she says that after we archive all of this stuff, we have to toss all of the scanners used for this process because it can apparently cross-contaminate other negatives. We're talking about $4,000 of equipment.\n\nWe're dealing with your basic 35mm Kodak Safety Film of the '50s. Is it true that they can get vinegar syndrome and \"infect\" the other negative and slides we have?", "link": "https://www.reddit.com/r/photography/comments/augslg/vinegar_syndrome_and_safety_film/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "vinegar syndrome and safety film /!/ my boss handed me six boxes of film she claims have vinegar syndrome. i'm seeing nothing and smelling nothing that would indicate they're deteriorating. i'm concerned because she says that after we -----> archive !!!  all of this stuff, we have to toss all of the scanners used for this process because it can apparently cross-contaminate other negatives. we're talking about $4,000 of equipment.\n\nwe're dealing with your basic 35mm kodak safety film of the '50s. is it true that they can get vinegar syndrome and \"infect\" the other negative and slides we have?", "sortedWord": "None", "identifyer": 4755, "year": "2019"}, {"Unnamed: 0": 103087, "autor": "m1ahh2gg6", "date": 1560782936000, "content": "Please help. I have too many photo files spread across a number of storage devices, need to organize. /!/ I have a number of photo files dating back decades, stored on several different devices (NAS, Dropbox, external hard drive, and my laptop's drive).  I was using Lightroom but am trying to switch to Capture One.  In the process, of consolidating all of my photos to one source location, I tried using Lightroom to make the moves.  I also set it up to create annual catalogs instead of one gigantic catalog (but I still have the gigantic catalog as a backup).  And, I somehow ended up with duplicate folders with a portion of photos in each.  There are both duplicates and unique photos in each of the three locations.  Here's an example of what I'm working with:\n\n&amp;#x200B;\n\ns:/Photo Archive/Photographs/\n\nwith subfolders:\n\n2011\n\n2012\n\n2013 \n\netc.\n\n&amp;#x200B;\n\ns:/Photo Archive/pictures/\n\nwith subfolders:\n\n2011\n\n2012\n\n2013\n\netc.\n\n&amp;#x200B;\n\ns:/pictures\n\nwith subfolders:\n\n2011\n\n2012\n\n2013\n\netc.\n\n&amp;#x200B;\n\n(note: in each year's folder, there are additional subfolders for months and days)\n\n&amp;#x200B;\n\nDoes Lightroom have the capability of merging these back into a single directory--maybe through a re-import with \"move\" originals selected?  I don't want to lose my Lightroom catalog information for the files since many have been edited and I want to retain the edits, keywording, etc.\n\n&amp;#x200B;\n\nOr is there a better tool for this job?\n\n&amp;#x200B;\n\nAlso, is there a tool that will search all of my drives, locate photos, and let me import/move them to one location?  It would be even better if I could locate photos by EXIF data so I can just select photos taken with my cameras instead of all images.\n\n&amp;#x200B;\n\nI am using a Mac (and have limited hard drive space on my laptop which is the reason for all the external storage sources).\n\n&amp;#x200B;\n\nLightroom 6\n\nCapture One Pro 12\n\nmacOS Mojave 10.14.5\n\nSynology NAS\n\nDropbox (iPhone photos only)\n\nWD Mybook\n\n&amp;#x200B;\n\nPlease help, thank you.", "link": "https://www.reddit.com/r/photography/comments/c1oemz/please_help_i_have_too_many_photo_files_spread/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "please help. i have too many photo files spread across a number of storage devices, need to organize. /!/ i have a number of photo files dating back decades, stored on several different devices (nas, dropbox, external hard drive, and my laptop's drive).  i was using lightroom but am trying to switch to capture one.  in the process, of consolidating all of my photos to one source location, i tried using lightroom to make the moves.  i also set it up to create annual catalogs instead of one gigantic catalog (but i still have the gigantic catalog as a backup).  and, i somehow ended up with duplicate folders with a portion of photos in each.  there are both duplicates and unique photos in each of the three locations.  here's an example of what i'm working with:\n\n&amp;#x200b;\n\ns:/photo -----> archive !!! /photographs/\n\nwith subfolders:\n\n2011\n\n2012\n\n2013 \n\netc.\n\n&amp;#x200b;\n\ns:/photo -----> archive !!! /pictures/\n\nwith subfolders:\n\n2011\n\n2012\n\n2013\n\netc.\n\n&amp;#x200b;\n\ns:/pictures\n\nwith subfolders:\n\n2011\n\n2012\n\n2013\n\netc.\n\n&amp;#x200b;\n\n(note: in each year's folder, there are additional subfolders for months and days)\n\n&amp;#x200b;\n\ndoes lightroom have the capability of merging these back into a single directory--maybe through a re-import with \"move\" originals selected?  i don't want to lose my lightroom catalog information for the files since many have been edited and i want to retain the edits, keywording, etc.\n\n&amp;#x200b;\n\nor is there a better tool for this job?\n\n&amp;#x200b;\n\nalso, is there a tool that will search all of my drives, locate photos, and let me import/move them to one location?  it would be even better if i could locate photos by exif data so i can just select photos taken with my cameras instead of all images.\n\n&amp;#x200b;\n\ni am using a mac (and have limited hard drive space on my laptop which is the reason for all the external storage sources).\n\n&amp;#x200b;\n\nlightroom 6\n\ncapture one pro 12\n\nmacos mojave 10.14.5\n\nsynology nas\n\ndropbox (iphone photos only)\n\nwd mybook\n\n&amp;#x200b;\n\nplease help, thank you.", "sortedWord": "None", "identifyer": 5882, "year": "2019"}, {"Unnamed: 0": 103886, "autor": "KrishnaForever", "date": 1570117481000, "content": "I genuinely need ideas in storing/archiving data /!/ Hey guys, I’ve had great photoshoots and it’ll all going fine, off late I’ve found myself in a pickle where I really cannot find/take ages to find a pic I need. I store all my RAWs in a folder with its date and another one folder for edited and final jpegs, it’s like normal when you read but when hundreds of pictures get accumulated and stuff and more often than not I don’t remember the date I took the past pic which I have but very hard to find, can you guys suggest me something for storing/archiving data better or share how you guys archive your stuff", "link": "https://www.reddit.com/r/photography/comments/dcsocd/i_genuinely_need_ideas_in_storingarchiving_data/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "i genuinely need ideas in storing/archiving data /!/ hey guys, i’ve had great photoshoots and it’ll all going fine, off late i’ve found myself in a pickle where i really cannot find/take ages to find a pic i need. i store all my raws in a folder with its date and another one folder for edited and final jpegs, it’s like normal when you read but when hundreds of pictures get accumulated and stuff and more often than not i don’t remember the date i took the past pic which i have but very hard to find, can you guys suggest me something for storing/archiving data better or share how you guys -----> archive !!!  your stuff", "sortedWord": "None", "identifyer": 6697, "year": "2019"}, {"Unnamed: 0": 318126, "autor": "EponymousHoward", "date": 1577590039000, "content": "The rise, fall and resurrection of Flickr - VERY deep dive into why reaction of the CEO's letter was overblown and misdirected - and why it matters. /!/ tl;dr - a small company is trying to repair the damage done by Big Tech and in doing so save an archive that is *way* more valuable than you realise (with illustrative examples).\n\n[The rise, fall and resurrection of Flickr](https://ferdychristant.com/the-rise-fall-and-resurrection-of-flickr-ca1850410ee1)", "link": "https://www.reddit.com/r/photography/comments/eh0top/the_rise_fall_and_resurrection_of_flickr_very/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "the rise, fall and resurrection of flickr - very deep dive into why reaction of the ceo's letter was overblown and misdirected - and why it matters. /!/ tl;dr - a small company is trying to repair the damage done by big tech and in doing so save an -----> archive !!!  that is *way* more valuable than you realise (with illustrative examples).\n\n[the rise, fall and resurrection of flickr](https://ferdychristant.com/the-rise-fall-and-resurrection-of-flickr-ca1850410ee1)", "sortedWord": "None", "identifyer": 65286, "year": "2019"}, {"Unnamed: 0": 318129, "autor": "EponymousHoward", "date": 1577589384000, "content": "The rise, fall and resurrection of Flickr - a VERY deep dive into why reaction to the CEO's letter was overblown and misdirected /!/ tl;dr - a small company is trying to repair the damage done by Big Tech to save an archive that is *way* more valuable that you realise (with illustrative examples).", "link": "https://www.reddit.com/r/photography/comments/eh0pc7/the_rise_fall_and_resurrection_of_flickr_a_very/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "the rise, fall and resurrection of flickr - a very deep dive into why reaction to the ceo's letter was overblown and misdirected /!/ tl;dr - a small company is trying to repair the damage done by big tech to save an -----> archive !!!  that is *way* more valuable that you realise (with illustrative examples).", "sortedWord": "None", "identifyer": 65289, "year": "2019"}, {"Unnamed: 0": 318359, "autor": "HairySavage", "date": 1550924535000, "content": "Cambridge University launches aerial photography archive of Britain from the Air 1945-2009", "link": "https://www.reddit.com/r/photography/comments/atuysq/cambridge_university_launches_aerial_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "cambridge university launches aerial photography -----> archive !!!  of britain from the air 1945-2009", "sortedWord": "None", "identifyer": 65527, "year": "2019"}, {"Unnamed: 0": 318975, "autor": "anotherMiguel", "date": 1561815348000, "content": "Arab Photography Archive Puts 22,000 Historic Images Online: Get a Rare Glimpse into Life and Art in the Arab World", "link": "https://www.reddit.com/r/photography/comments/c6z0vn/arab_photography_archive_puts_22000_historic/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "arab photography -----> archive !!!  puts 22,000 historic images online: get a rare glimpse into life and art in the arab world", "sortedWord": "None", "identifyer": 66160, "year": "2019"}, {"Unnamed: 0": 319708, "autor": "jyc23", "date": 1572879556000, "content": "Photography, storefronts, logos, and usage restrictions /!/ My employer is asking me to create a marketing email graphic to promote an ADA (accessibility act) compliance service that our company sells. In light of the recent news involving Dominos Pizza (a blind person sued them for having a non compliant website and won), my manager wants me to use a photograph of a Dominos storefront / logo as the headline image for the email. \n\nSo, the image is marked as Editorial Use Only in the stock image archive, which precludes commercial use. This is clearly commercial use, right? \n\nIs it possible to get around the issue by just going to a Dominos store and taking a photo of a sign myself and use that photo in the design? Or would that then raise other legal issues?", "link": "https://www.reddit.com/r/photography/comments/driqsx/photography_storefronts_logos_and_usage/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "photography, storefronts, logos, and usage restrictions /!/ my employer is asking me to create a marketing email graphic to promote an ada (accessibility act) compliance service that our company sells. in light of the recent news involving dominos pizza (a blind person sued them for having a non compliant website and won), my manager wants me to use a photograph of a dominos storefront / logo as the headline image for the email. \n\nso, the image is marked as editorial use only in the stock image -----> archive !!! , which precludes commercial use. this is clearly commercial use, right? \n\nis it possible to get around the issue by just going to a dominos store and taking a photo of a sign myself and use that photo in the design? or would that then raise other legal issues?", "sortedWord": "None", "identifyer": 66920, "year": "2019"}, {"Unnamed: 0": 319709, "autor": "kur1j", "date": 1572879169000, "content": "Archiving photos /!/ Looking for equipment suggestions to archive a bunch of my families old photos.\n\nHave regular 8x10, 4x6 prints, some 35mm negatives, and some old kodak slides.\n\nLooking for scanners to work on this project. Would something like the Epson v600 be adequate or would the quality improvement be worth it to get the v800/v850 or some other scanner for example?\n\nI probably have a couple thousand slides, negatives and prints.", "link": "https://www.reddit.com/r/photography/comments/drints/archiving_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "archiving photos /!/ looking for equipment suggestions to -----> archive !!!  a bunch of my families old photos.\n\nhave regular 8x10, 4x6 prints, some 35mm negatives, and some old kodak slides.\n\nlooking for scanners to work on this project. would something like the epson v600 be adequate or would the quality improvement be worth it to get the v800/v850 or some other scanner for example?\n\ni probably have a couple thousand slides, negatives and prints.", "sortedWord": "None", "identifyer": 66922, "year": "2019"}, {"Unnamed: 0": 325142, "autor": "Myagooshki4004", "date": 1551206913000, "content": "I want to have infinite random landscapes get shuffled to me. /!/ Is there a website with a huge database of scenic pictures that I can go on where I press play and it shuffles through every image in its archive with a description of where the picture was taken? A website like panoramio (no idea why that place shut down!)? I want to it for background.", "link": "https://www.reddit.com/r/photography/comments/av2ym3/i_want_to_have_infinite_random_landscapes_get/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "i want to have infinite random landscapes get shuffled to me. /!/ is there a website with a huge database of scenic pictures that i can go on where i press play and it shuffles through every image in its -----> archive !!!  with a description of where the picture was taken? a website like panoramio (no idea why that place shut down!)? i want to it for background.", "sortedWord": "None", "identifyer": 72569, "year": "2019"}, {"Unnamed: 0": 325186, "autor": "11201ny", "date": 1551557335000, "content": "Photo Archive Server (10GbE) /!/ &amp;#x200B;\n\nHello! We are putting a photo archive server together, and I thought i would see if you all have any thoughts on this setup.\n\n\\- Tripp Lite 18U switch depth cabinet (on wheels)\n\n\\- 2x redundant Synology RS1219+ (high availability cluster)\n\n\\- 16x HGST Ultrastar He10 (HUH721010ALE604)\n\n\\- APC UPS 1500VA Smart-UPS SMT1500RM2UC\n\n\\- APC AP9562 Rack PDU/Basic/1U/15A/120V\n\n\\- Sonnet Twin 10G Network Adapter Thunderbolt 2 (for Mac Pro)\n\n\\- 2x Synology 10Gb Ethernet Adapter 2 RJ45 Ports (E10G18-T2)\n\n\\- Sonicwall TZ300 router\n\n\\- Ubiquiti Networks Unifi 802.11ac Dual-Radio PRO Access Point (UAP-AC-PRO-US)\n\n\\- NETGEAR 8-Port Smart Managed Plus Switch, 8x10GBASE-T, (XS708E) **for private network - 10GbE**\n\n\\- NETGEAR JGS516PE-100NAS 16-Port Gigabit Rackmount Smart Managed Plus Switch, **for client network - 1GbE**", "link": "https://www.reddit.com/r/photography/comments/awlqvq/photo_archive_server_10gbe/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "photo -----> archive !!!  server (10gbe) /!/ &amp;#x200b;\n\nhello! we are putting a photo archive server together, and i thought i would see if you all have any thoughts on this setup.\n\n\\- tripp lite 18u switch depth cabinet (on wheels)\n\n\\- 2x redundant synology rs1219+ (high availability cluster)\n\n\\- 16x hgst ultrastar he10 (huh721010ale604)\n\n\\- apc ups 1500va smart-ups smt1500rm2uc\n\n\\- apc ap9562 rack pdu/basic/1u/15a/120v\n\n\\- sonnet twin 10g network adapter thunderbolt 2 (for mac pro)\n\n\\- 2x synology 10gb ethernet adapter 2 rj45 ports (e10g18-t2)\n\n\\- sonicwall tz300 router\n\n\\- ubiquiti networks unifi 802.11ac dual-radio pro access point (uap-ac-pro-us)\n\n\\- netgear 8-port smart managed plus switch, 8x10gbase-t, (xs708e) **for private network - 10gbe**\n\n\\- netgear jgs516pe-100nas 16-port gigabit rackmount smart managed plus switch, **for client network - 1gbe**", "sortedWord": "None", "identifyer": 72613, "year": "2019"}, {"Unnamed: 0": 327770, "autor": "sghokie", "date": 1558378048000, "content": "Fireworks print paper recommendations Fujiflex Crystal Archive vs Kodak Endura Metalic /!/ I have one really nice shot that I want to get done up with the Trulife Acrylic mounting. I am trying to decide between the FujiFlex or the Kodak Endura Metalic.\n\nI usually get my 'nice' photos printed up on FujiFlex and have always been happy with the results.\n\nThe specs on the Kodak does sound intriguing though, I am thinking of giving that a shot.\n\nFor a fireworks shot what would be a good safe bet?", "link": "https://www.reddit.com/r/photography/comments/bqzjrv/fireworks_print_paper_recommendations_fujiflex/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "fireworks print paper recommendations fujiflex crystal -----> archive !!!  vs kodak endura metalic /!/ i have one really nice shot that i want to get done up with the trulife acrylic mounting. i am trying to decide between the fujiflex or the kodak endura metalic.\n\ni usually get my 'nice' photos printed up on fujiflex and have always been happy with the results.\n\nthe specs on the kodak does sound intriguing though, i am thinking of giving that a shot.\n\nfor a fireworks shot what would be a good safe bet?", "sortedWord": "None", "identifyer": 75298, "year": "2019"}, {"Unnamed: 0": 327800, "autor": "ImKindaHighBut", "date": 1562261985000, "content": "I found my father's photo album that he'd been working on for decades before he passed. Photos from the early 1930's to now. How (or where) do I archive them digitally in the best possible quality?", "link": "https://www.reddit.com/r/photography/comments/c95dof/i_found_my_fathers_photo_album_that_hed_been/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "i found my father's photo album that he'd been working on for decades before he passed. photos from the early 1930's to now. how (or where) do i -----> archive !!!  them digitally in the best possible quality?", "sortedWord": "None", "identifyer": 75328, "year": "2019"}, {"Unnamed: 0": 327814, "autor": "aaron_289", "date": 1562252437000, "content": "Who has some of the VSCO Film Presets for LR? /!/ Hi all!  So VSCO completely screwed me when they pulled their presets - I had contacted them with a couple of questions, received their \"we'll get back to you\" response, and then they didn't, and they pushed my support query past the kill-date of the presets, and then wouldn't either provide, nor support the presets.  Who has some of them?  Especially the slide film and black &amp; white ones.  Or is there an archive of them online somewhere?", "link": "https://www.reddit.com/r/photography/comments/c93k62/who_has_some_of_the_vsco_film_presets_for_lr/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "who has some of the vsco film presets for lr? /!/ hi all!  so vsco completely screwed me when they pulled their presets - i had contacted them with a couple of questions, received their \"we'll get back to you\" response, and then they didn't, and they pushed my support query past the kill-date of the presets, and then wouldn't either provide, nor support the presets.  who has some of them?  especially the slide film and black &amp; white ones.  or is there an -----> archive !!!  of them online somewhere?", "sortedWord": "None", "identifyer": 75343, "year": "2019"}, {"Unnamed: 0": 329030, "autor": "zimage", "date": 1570333214000, "content": "Late 90s early 2000s photo a day project /!/ I remember stumbling upon a photography project in the late 90s of a photographer, I think in NYC, who would post a new gritty black and white photograph several times a day to his website. It was a lot of street photography, does anyone have a clue what I might be remembering? I’ll have to power on my old server because I might have an archive of a bunch of the photos.", "link": "https://www.reddit.com/r/photography/comments/ddy3qs/late_90s_early_2000s_photo_a_day_project/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "late 90s early 2000s photo a day project /!/ i remember stumbling upon a photography project in the late 90s of a photographer, i think in nyc, who would post a new gritty black and white photograph several times a day to his website. it was a lot of street photography, does anyone have a clue what i might be remembering? i’ll have to power on my old server because i might have an -----> archive !!!  of a bunch of the photos.", "sortedWord": "None", "identifyer": 76619, "year": "2019"}, {"Unnamed: 0": 329923, "autor": "Jourdy288", "date": 1567612558000, "content": "16 Iconic Peter Lindbergh Images From The British Vogue Archive", "link": "https://www.reddit.com/r/photography/comments/czmqno/16_iconic_peter_lindbergh_images_from_the_british/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "16 iconic peter lindbergh images from the british vogue -----> archive !!! ", "sortedWord": "None", "identifyer": 77546, "year": "2019"}, {"Unnamed: 0": 330979, "autor": "kawaiixxx", "date": 1575106188000, "content": "How to clean and store really old photos? /!/ Found an old family album, some of the pictures maybe a hundred years old. \n\nNaturally I will be scanning them, but I still want to keep and clean the old photos and store them properly and prevent further deterioration.\n\nIf anyone can point me to the right direction with instructions, and possibly archive supplies I'd most appreciate it.", "link": "https://www.reddit.com/r/photography/comments/e3trd7/how_to_clean_and_store_really_old_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "how to clean and store really old photos? /!/ found an old family album, some of the pictures maybe a hundred years old. \n\nnaturally i will be scanning them, but i still want to keep and clean the old photos and store them properly and prevent further deterioration.\n\nif anyone can point me to the right direction with instructions, and possibly -----> archive !!!  supplies i'd most appreciate it.", "sortedWord": "None", "identifyer": 78642, "year": "2019"}, {"Unnamed: 0": 332717, "autor": "wastedbyscotch", "date": 1553019213000, "content": "Would a picture with these dimensions look good on a wall? /!/ So I ordered a picture from artisanHD, the dimensions are 18.875”x23.625” @149ppi. Will this picture look good? It’s printed on FujuFlex Crystal Archive w 1/8” TruLife Acrylic. I don’t what to reference the 149ppi to.", "link": "https://www.reddit.com/r/photography/comments/b30sok/would_a_picture_with_these_dimensions_look_good/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "would a picture with these dimensions look good on a wall? /!/ so i ordered a picture from artisanhd, the dimensions are 18.875”x23.625” @149ppi. will this picture look good? it’s printed on fujuflex crystal -----> archive !!!  w 1/8” trulife acrylic. i don’t what to reference the 149ppi to.", "sortedWord": "None", "identifyer": 80456, "year": "2019"}, {"Unnamed: 0": 333554, "autor": "BUDDZILLA", "date": 1551149848000, "content": "Someone is requesting to digitally archive photos for a past client... What? /!/ 1) I understand what digital archiving is. I have reached out to the sender of the message, but I wanted to see if you guys find this strange like I do. I would imagine if my client wants to archive her photos that she would do it herself- she has the pictures after all. I just find it strange.\n\n&amp;#x200B;\n\n2) I am lucky enough to make decent coin off of my photography. \"Profit\" is not a dirty word. With that said, I'm wondering if it would be appropriate of me to earn something from the delivery of these photos to the archivist. I will need to pull these from some deep, dark archives of my own after all.\n\n&amp;#x200B;\n\nThoughts? ", "link": "https://www.reddit.com/r/photography/comments/auu418/someone_is_requesting_to_digitally_archive_photos/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "someone is requesting to digitally -----> archive !!!  photos for a past client... what? /!/ 1) i understand what digital archiving is. i have reached out to the sender of the message, but i wanted to see if you guys find this strange like i do. i would imagine if my client wants to archive her photos that she would do it herself- she has the pictures after all. i just find it strange.\n\n&amp;#x200b;\n\n2) i am lucky enough to make decent coin off of my photography. \"profit\" is not a dirty word. with that said, i'm wondering if it would be appropriate of me to earn something from the delivery of these photos to the archivist. i will need to pull these from some deep, dark archives of my own after all.\n\n&amp;#x200b;\n\nthoughts? ", "sortedWord": "None", "identifyer": 81322, "year": "2019"}, {"Unnamed: 0": 334100, "autor": "11201ny", "date": 1552100306000, "content": "10 GbE Photo Archive + Desktop (capture computer) &amp; DAS /!/ We are building a 10 GbE photo archive, with a 1 GbE client network, using a redundant cluster on Synology RS1219+'s (SHA). To cut costs, we started with only 4x HDD's in each unit, and will add another 4x (in each) later. We also decided to stick our working (shooting) station in there as well (Mac Pro, Pegasus3). There system was built in a switch depth cabinet that only 20.5\" deep, which is much smaller than the usual rack (pictured above without side/front panels). The Mac Pro is on a sliding mount - which is awesome.\n\nAnyway, we thought we would share this with the photo community. For a potential 70TB archive that's redundant (and fast), it wasn't an insane price.", "link": "https://www.reddit.com/r/photography/comments/ayyun6/10_gbe_photo_archive_desktop_capture_computer_das/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "10 gbe photo -----> archive !!!  + desktop (capture computer) &amp; das /!/ we are building a 10 gbe photo archive, with a 1 gbe client network, using a redundant cluster on synology rs1219+'s (sha). to cut costs, we started with only 4x hdd's in each unit, and will add another 4x (in each) later. we also decided to stick our working (shooting) station in there as well (mac pro, pegasus3). there system was built in a switch depth cabinet that only 20.5\" deep, which is much smaller than the usual rack (pictured above without side/front panels). the mac pro is on a sliding mount - which is awesome.\n\nanyway, we thought we would share this with the photo community. for a potential 70tb archive that's redundant (and fast), it wasn't an insane price.", "sortedWord": "None", "identifyer": 81886, "year": "2019"}, {"Unnamed: 0": 334102, "autor": "11201ny", "date": 1552099650000, "content": "10 GbE (&amp; GbE) Photo Archive Server", "link": "https://www.reddit.com/r/photography/comments/ayyrdn/10_gbe_gbe_photo_archive_server/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "10 gbe (&amp; gbe) photo -----> archive !!!  server", "sortedWord": "None", "identifyer": 81888, "year": "2019"}, {"Unnamed: 0": 334234, "autor": "BearBaron", "date": 1552169578000, "content": "Finally feeling inspired again /!/ I was head of yearbook for my school for two years, and I also did a lot of prom/graduation shoots. When it started becoming a job/doing it for money, I felt a lot more responsible and less passionate. Over those two years I burned out, and I put my camera down for a year and a half.\n\nI saw a picture on /r/postprocessing that made me feel some really strong emotions, and I picked up the camera again after a long time. It feels really good to go out and shoot what you want to shoot, with your own creative ideas in mind. I wasn't ever close to being a truly professional photographer, but even after experiencing the small responsibility that I did, I don't think I'll ever be one, and that's okay.\n\nI think one of the biggest things for myself, was to create a photography instagram, not for followers, but as sort of an archive to post my favorite shots. I don't tell anyone about it, but it's just to keep track of my own progress.\n\nRecently all I've wanted to do is go out and take pictures, and while life is still busy, it feels good to be passionate about it again. ", "link": "https://www.reddit.com/r/photography/comments/az8szg/finally_feeling_inspired_again/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "finally feeling inspired again /!/ i was head of yearbook for my school for two years, and i also did a lot of prom/graduation shoots. when it started becoming a job/doing it for money, i felt a lot more responsible and less passionate. over those two years i burned out, and i put my camera down for a year and a half.\n\ni saw a picture on /r/postprocessing that made me feel some really strong emotions, and i picked up the camera again after a long time. it feels really good to go out and shoot what you want to shoot, with your own creative ideas in mind. i wasn't ever close to being a truly professional photographer, but even after experiencing the small responsibility that i did, i don't think i'll ever be one, and that's okay.\n\ni think one of the biggest things for myself, was to create a photography instagram, not for followers, but as sort of an -----> archive !!!  to post my favorite shots. i don't tell anyone about it, but it's just to keep track of my own progress.\n\nrecently all i've wanted to do is go out and take pictures, and while life is still busy, it feels good to be passionate about it again. ", "sortedWord": "None", "identifyer": 82031, "year": "2019"}, {"Unnamed: 0": 334258, "autor": "11201ny", "date": 1552149019000, "content": "10 GbE (&amp; GbE) Photo Archive (Server) /!/ We are building a [10 GbE photo archive](https://i.imgur.com/dYRNCvO.jpg), with a 1 GbE client network, using a redundant cluster on Synology RS1219+'s (SHA). To cut costs, we started with only 4x HDD's in each unit, and will add another 4x (in each) later. We also decided to stick our working (shooting) station in there as well (Mac Pro, Pegasus3). There system was built in a switch depth cabinet that only 20.5\" deep, which is much smaller than the usual rack (pictured above without side/front panels). The Mac Pro is on a sliding mount - which is awesome.\n\nAnyway, we thought we would share this with the photo community. For a potential 70TB archive that's redundant (and fast), it wasn't an insane price.", "link": "https://www.reddit.com/r/photography/comments/az56uz/10_gbe_gbe_photo_archive_server/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "10 gbe (&amp; gbe) photo -----> archive !!!  (server) /!/ we are building a [10 gbe photo archive](https://i.imgur.com/dyrncvo.jpg), with a 1 gbe client network, using a redundant cluster on synology rs1219+'s (sha). to cut costs, we started with only 4x hdd's in each unit, and will add another 4x (in each) later. we also decided to stick our working (shooting) station in there as well (mac pro, pegasus3). there system was built in a switch depth cabinet that only 20.5\" deep, which is much smaller than the usual rack (pictured above without side/front panels). the mac pro is on a sliding mount - which is awesome.\n\nanyway, we thought we would share this with the photo community. for a potential 70tb archive that's redundant (and fast), it wasn't an insane price.", "sortedWord": "None", "identifyer": 82057, "year": "2019"}, {"Unnamed: 0": 334979, "autor": "Jeromiewhalen", "date": 1547506972000, "content": "Flickr rejected our application for a free Pro account for our public high school account. /!/ Title says it all. Super fucking pissed at Flickr, who we have been using for years, to offer our low-income students the ability to download and share pictures for free. Most of them don't get yearbooks, so the archive of pictures we put on Flickr into albums has been awesome. We have over 49,000 pictures that the students have taken in class, of sports games, etc. Now it's an out of pocket expense for me. \n\n&amp;#x200B;\n\nMy favorite part is they ended the application rejection \"Thank you for being a part of the Flickr community!\"\n\n&amp;#x200B;\n\nJust paid for a separate Pro account myself, looking to cancel it immediately.", "link": "https://www.reddit.com/r/photography/comments/ag1mu1/flickr_rejected_our_application_for_a_free_pro/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "flickr rejected our application for a free pro account for our public high school account. /!/ title says it all. super fucking pissed at flickr, who we have been using for years, to offer our low-income students the ability to download and share pictures for free. most of them don't get yearbooks, so the -----> archive !!!  of pictures we put on flickr into albums has been awesome. we have over 49,000 pictures that the students have taken in class, of sports games, etc. now it's an out of pocket expense for me. \n\n&amp;#x200b;\n\nmy favorite part is they ended the application rejection \"thank you for being a part of the flickr community!\"\n\n&amp;#x200b;\n\njust paid for a separate pro account myself, looking to cancel it immediately.", "sortedWord": "None", "identifyer": 82812, "year": "2019"}, {"Unnamed: 0": 335084, "autor": "wasthespyingendless", "date": 1547919140000, "content": "What new software, tools, or services changed your photography business this year? /!/ I'm a photojournalist that works between the US, UK, and the Middle East.  But a lot of these are relevant to any type of freelancing.  \n\n\nMoney: [TransferWise](https://transferwise.com/) \\- I get paid, and pay, in a lot of currencies. With TransferWise I don’t have fees when clients transfer to my account. I also get a good rate and easily convert money between USD, GBP, and EUR. It is almost magic. [Revolut](https://revolut.com/r/davidcxa) looks like a better option, but there is a waiting list.   \n\n\nPlanning: [Things](https://culturedcode.com/things/) \\- An app for Mac and iPhone that allows me to record ToDos fast, brainstorm larger projects, save the steps for recipes, and plan out my day. It’s designed to be part of the Getting Things Done ecosystem and appears to be working for me  \n\nCell Phone: [Google Fi](https://fi.google.com/) \\- Google Fi is another service that is flexible and predictable [around the world](https://fi.google.com/about/international-rates/). $20 a month plus $10 per GB of data in 200+ countries. Often it is cheaper to buy a local SIM for data but this means I can hit the ground running instead of spending an hour or afternoon doing the paperwork to get a SIM.  \n\n\nInvoicing: [Hiveage](https://www.hiveage.com/pricing/) \\- We all need a system for creating and tracking invoices. Mine used to be a Google Docs template and a spreadsheet, it worked. But I find that once Hiveage is set up it takes a lot less time, and with their iPhone app I can quickly send an invoice while in a cab.  Unfortunately they raised their rates recently.  \n\n\nToning: [Capture One](https://www.phaseone.com/en/Capture-One.aspx) \\- I have lived in Photoshop since version 5, but I now canceled my Adobe membership and switched to Capture One. Basically because my photos look more subtle when I use it. I can't explain why but I prefer the colors and how it hides the halos produced by dodging and burning.  \n\n\nToning: [Wacom Intuos](https://wacom.com/en-us/products/pen-tablets/wacom-intuos) \\- Toning photos becomes painful, especially dodging and burning on a trackpad.  A Wacom makes it slightly less painful, and after a few weeks of fiddling has become an extension of my hand.  Get the bluetooth version so you can lean back.\n\nBackups: [Backblaze](https://www.backblaze.com/) \\- I finally have an offsite backup system for my 9TB archive for $50 a year.  It took a month to upload everything, but now it is easy to keep it all up to date.  Warning: If you don't plug in a backed up hard drive for a month they will remove it, you can get around this by turning off backups while traveling away from your archive.\n\nWebsite: [Linode](https://www.linode.com/) \\- I've hosted websites on DreamHost for a long time, but its shared server just wasn't strong enough to handle my koken installation.  So I switched to Linode, it took time and googling to set up, costs a little more, but my website is much faster and more stable.  \n", "link": "https://www.reddit.com/r/photography/comments/aho4d2/what_new_software_tools_or_services_changed_your/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "what new software, tools, or services changed your photography business this year? /!/ i'm a photojournalist that works between the us, uk, and the middle east.  but a lot of these are relevant to any type of freelancing.  \n\n\nmoney: [transferwise](https://transferwise.com/) \\- i get paid, and pay, in a lot of currencies. with transferwise i don’t have fees when clients transfer to my account. i also get a good rate and easily convert money between usd, gbp, and eur. it is almost magic. [revolut](https://revolut.com/r/davidcxa) looks like a better option, but there is a waiting list.   \n\n\nplanning: [things](https://culturedcode.com/things/) \\- an app for mac and iphone that allows me to record todos fast, brainstorm larger projects, save the steps for recipes, and plan out my day. it’s designed to be part of the getting things done ecosystem and appears to be working for me  \n\ncell phone: [google fi](https://fi.google.com/) \\- google fi is another service that is flexible and predictable [around the world](https://fi.google.com/about/international-rates/). $20 a month plus $10 per gb of data in 200+ countries. often it is cheaper to buy a local sim for data but this means i can hit the ground running instead of spending an hour or afternoon doing the paperwork to get a sim.  \n\n\ninvoicing: [hiveage](https://www.hiveage.com/pricing/) \\- we all need a system for creating and tracking invoices. mine used to be a google docs template and a spreadsheet, it worked. but i find that once hiveage is set up it takes a lot less time, and with their iphone app i can quickly send an invoice while in a cab.  unfortunately they raised their rates recently.  \n\n\ntoning: [capture one](https://www.phaseone.com/en/capture-one.aspx) \\- i have lived in photoshop since version 5, but i now canceled my adobe membership and switched to capture one. basically because my photos look more subtle when i use it. i can't explain why but i prefer the colors and how it hides the halos produced by dodging and burning.  \n\n\ntoning: [wacom intuos](https://wacom.com/en-us/products/pen-tablets/wacom-intuos) \\- toning photos becomes painful, especially dodging and burning on a trackpad.  a wacom makes it slightly less painful, and after a few weeks of fiddling has become an extension of my hand.  get the bluetooth version so you can lean back.\n\nbackups: [backblaze](https://www.backblaze.com/) \\- i finally have an offsite backup system for my 9tb -----> archive !!!  for $50 a year.  it took a month to upload everything, but now it is easy to keep it all up to date.  warning: if you don't plug in a backed up hard drive for a month they will remove it, you can get around this by turning off backups while traveling away from your archive.\n\nwebsite: [linode](https://www.linode.com/) \\- i've hosted websites on dreamhost for a long time, but its shared server just wasn't strong enough to handle my koken installation.  so i switched to linode, it took time and googling to set up, costs a little more, but my website is much faster and more stable.  \n", "sortedWord": "None", "identifyer": 82923, "year": "2019"}, {"Unnamed: 0": 336542, "autor": "ccurzio", "date": 1559238614000, "content": "Arab photography archive releases 22,000 historic images online", "link": "https://www.reddit.com/r/photography/comments/buw873/arab_photography_archive_releases_22000_historic/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "arab photography -----> archive !!!  releases 22,000 historic images online", "sortedWord": "None", "identifyer": 84435, "year": "2019"}], "name": "archivephotography2019"}