{"interestingcomments": [{"Unnamed: 0": 59763, "autor": "Nerdy_Slacker", "date": 1598220662000, "content": "How should I manage my files? /!/ I apologize for the length of this post but I’m pretty frustrated with my current set up and am looking to do something better.\n\nI’m not a pro but want redundancy for storing all my personal photos. I have the last 15 years sorted by year, then by month or season, then by event. It’s a mix of raw files, original jpeg without raw, and jpeg edits from raw.\n\nRight now that’s all stored on a Western Digital MyCloud Mirror because I wanted the RAID capability for redundancy, and I liked the idea of being able to access my photos from anywhere without having to pay a monthly cloud subscription. Plus my LAN speed was gigabit and a third party cloud provider would be bottlenecked by my internet speed.\n\nBut now my files are larger. The software to scan the MyCloud can’t read the raw files so I can’t actually browse the network drive real time. WD doesn’t even support the NAS anymore because it’s so old. The software I used to access the drive stopped working. I still have a web interface but I’ve lost a lot of functionality and feel like I’m slowly being cut off from my archive in a variety of ways. A quick request from a family member to find a picture from an event turns into a huge ordeal and time suck.\n\nPart of the problem is I have a small internal drive, so work pretty quickly needs to be off loaded to the NAS. I use a Mypassort portable drive (not SSD) as functional storage because I bounce back and forth between my desktop setup and my laptop. But then files get spread across my small local drive, my external HD and my NAS and it gets confusing.\n\nSo is a very fast connection RAID SSD the best option? Seems like this is the only one I can find?\n\nhttps://www.amazon.com/MiniPro-Type-C-USB-C-Solid-State/dp/B071F8ZTBN\n\nOr Should I buy two separate External SSDs and use software to occasionally sync them?\n\nOr am I just doing NAS wrong and should focus on that route?\n\nAfter I edit down an event to the best 10-50 shots should I be saving thise in some cloud service and storing the raw files in a less accessible raid drive?\n\nFeeling a bit lost here so any advice much appreciated.", "link": "https://www.reddit.com/r/photography/comments/ifchei/how_should_i_manage_my_files/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "how should i manage my files? /!/ i apologize for the length of this post but i’m pretty frustrated with my current set up and am looking to do something better.\n\ni’m not a pro but want redundancy for storing all my personal photos. i have the last 15 years sorted by year, then by month or season, then by event. it’s a mix of raw files, original jpeg without raw, and jpeg edits from raw.\n\nright now that’s all stored on a western digital mycloud mirror because i wanted the raid capability for redundancy, and i liked the idea of being able to access my photos from anywhere without having to pay a monthly cloud subscription. plus my lan speed was gigabit and a third party cloud provider would be bottlenecked by my internet speed.\n\nbut now my files are larger. the software to scan the mycloud can’t read the raw files so i can’t actually browse the network drive real time. wd doesn’t even support the nas anymore because it’s so old. the software i used to access the drive stopped working. i still have a web interface but i’ve lost a lot of functionality and feel like i’m slowly being cut off from my -----> archive !!!  in a variety of ways. a quick request from a family member to find a picture from an event turns into a huge ordeal and time suck.\n\npart of the problem is i have a small internal drive, so work pretty quickly needs to be off loaded to the nas. i use a mypassort portable drive (not ssd) as functional storage because i bounce back and forth between my desktop setup and my laptop. but then files get spread across my small local drive, my external hd and my nas and it gets confusing.\n\nso is a very fast connection raid ssd the best option? seems like this is the only one i can find?\n\nhttps://www.amazon.com/minipro-type-c-usb-c-solid-state/dp/b071f8ztbn\n\nor should i buy two separate external ssds and use software to occasionally sync them?\n\nor am i just doing nas wrong and should focus on that route?\n\nafter i edit down an event to the best 10-50 shots should i be saving thise in some cloud service and storing the raw files in a less accessible raid drive?\n\nfeeling a bit lost here so any advice much appreciated.", "sortedWord": "None", "identifyer": 61219, "year": "2020"}, {"Unnamed: 0": 60543, "autor": "nirachi", "date": 1604406365000, "content": "Where do I begin in trying to preserve and share my mother's photo archive? /!/ My mother was an avid photographer from the 60s to the 90s. I received the first couple bins of slides, and I think that there may be 10,000 slides. I've seen some prints of her photos previously and have found some to have artistic merit. I've started scanning slides and it's very laborious. Some slides have faded in color, others are dusty, and some have damage. The boxes are informally labeled and somewhat mixed due to previous slide shows. I would like to get a sense of what is in the photos, and treat these as having value. Any suggestions for moving forward?", "link": "https://www.reddit.com/r/photography/comments/jn9dic/where_do_i_begin_in_trying_to_preserve_and_share/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "where do i begin in trying to preserve and share my mother's photo -----> archive !!! ? /!/ my mother was an avid photographer from the 60s to the 90s. i received the first couple bins of slides, and i think that there may be 10,000 slides. i've seen some prints of her photos previously and have found some to have artistic merit. i've started scanning slides and it's very laborious. some slides have faded in color, others are dusty, and some have damage. the boxes are informally labeled and somewhat mixed due to previous slide shows. i would like to get a sense of what is in the photos, and treat these as having value. any suggestions for moving forward?", "sortedWord": "None", "identifyer": 62012, "year": "2020"}, {"Unnamed: 0": 60968, "autor": "BeingMrSmite", "date": 1583886624000, "content": "Do you store your photos locally, or digitally? /!/ I'm looking for suggestions for sites/services/hard-drives that you guys use to store your photos locally. \n\nI'm not talking about sites like Flickr, 500px, etc.. to showcase your work, but your favorite way to host/archive photos until you get the time to work on them.\n\nI'm quickly running out of space, and wondering what the modern trends for storing it, vs just throwing it on a HDD/SSD.", "link": "https://www.reddit.com/r/photography/comments/fgo962/do_you_store_your_photos_locally_or_digitally/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "do you store your photos locally, or digitally? /!/ i'm looking for suggestions for sites/services/hard-drives that you guys use to store your photos locally. \n\ni'm not talking about sites like flickr, 500px, etc.. to showcase your work, but your favorite way to host/-----> archive !!!  photos until you get the time to work on them.\n\ni'm quickly running out of space, and wondering what the modern trends for storing it, vs just throwing it on a hdd/ssd.", "sortedWord": "None", "identifyer": 62454, "year": "2020"}, {"Unnamed: 0": 61645, "autor": "andyday_", "date": 1580048200000, "content": "What is the best platform for selling prints via your own website? /!/ I'm a Squarespace customer and I've sold prints via my website in the past through a third party who handled payments, printing, posting. Unfortunately they switched their own free, bespoke website plugin to Shopify, making the prints section of my website defunct.\n\nI'm now looking for an alternative. Squarespace partners with Printful but the integration seems very, very limited. This seems quite odd given that Squarespace prides itself on being the best choice for photographers.\n\nA bit of Googling led me to Visual Society but most of my customers will be in the UK and they ship from the States.\n\nZenfolio has various lab partners - including a fine art print lab in the UK - but Zenfolio's back end is quite cumbersome compared to Squarespace. This seems to be the best option so far.\n\nDoes anyone have any suggestions or recommendations? I'd like to sell both one-off archive-quality prints but also cheap digital prints from events. Thanks!\n\nTLDR: I want my website to offer 1) archive-quality prints, and 2) cheap digital prints shot at events (mostly UK sales). Payment, printing, and posting should be fully automated. What platform should I use?", "link": "https://www.reddit.com/r/photography/comments/eu76yo/what_is_the_best_platform_for_selling_prints_via/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "what is the best platform for selling prints via your own website? /!/ i'm a squarespace customer and i've sold prints via my website in the past through a third party who handled payments, printing, posting. unfortunately they switched their own free, bespoke website plugin to shopify, making the prints section of my website defunct.\n\ni'm now looking for an alternative. squarespace partners with printful but the integration seems very, very limited. this seems quite odd given that squarespace prides itself on being the best choice for photographers.\n\na bit of googling led me to visual society but most of my customers will be in the uk and they ship from the states.\n\nzenfolio has various lab partners - including a fine art print lab in the uk - but zenfolio's back end is quite cumbersome compared to squarespace. this seems to be the best option so far.\n\ndoes anyone have any suggestions or recommendations? i'd like to sell both one-off -----> archive !!! -quality prints but also cheap digital prints from events. thanks!\n\ntldr: i want my website to offer 1) archive-quality prints, and 2) cheap digital prints shot at events (mostly uk sales). payment, printing, and posting should be fully automated. what platform should i use?", "sortedWord": "None", "identifyer": 63149, "year": "2020"}, {"Unnamed: 0": 62116, "autor": "SparnaP", "date": 1590235952000, "content": "How to store 100’s of GB of day to day digital pictures? /!/ I want to properly store years and years of digital pictures. Currently they are in hard drives, cell phone or google photos. Any suggestions on how to archive them properly?", "link": "https://www.reddit.com/r/photography/comments/gp3vy2/how_to_store_100s_of_gb_of_day_to_day_digital/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "how to store 100’s of gb of day to day digital pictures? /!/ i want to properly store years and years of digital pictures. currently they are in hard drives, cell phone or google photos. any suggestions on how to -----> archive !!!  them properly?", "sortedWord": "None", "identifyer": 63630, "year": "2020"}, {"Unnamed: 0": 68547, "autor": "AntigoneWithTheWind", "date": 1596968601000, "content": "What's the best way to add descriptions to old family photographs? /!/ Hello all!\n\nThe past few days I've been going through some old photographs dating back to the 1900's. My family was able to recall all sorts of stories about the people in the pictures, tell me in what way we're related, when the pictures were taken approximately. Some of the stories were very impressive, and I would hate for them to be lost. I would like to create some sort of archive for later generations and because my memory will definitely fail me, I have decided to sort all of the pictures with a family member and get all information I can get about each picture. Now, some of the pictures already have something written on the back, but I don't know if adding something to such old photos is a good idea, I would like to leave them as they are.   \n\n\nIs there any way to archive them very nicely and have picture and description at one glance? I think that photo albums would take up too much space. Currently they're all in a nice box, all a bit scattered. I was thinking maybe post-it notes on the backs of them, but I feel like they would fall off too quickly.   \n\n\nThanks in advance!", "link": "https://www.reddit.com/r/photography/comments/i6h5lk/whats_the_best_way_to_add_descriptions_to_old/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "what's the best way to add descriptions to old family photographs? /!/ hello all!\n\nthe past few days i've been going through some old photographs dating back to the 1900's. my family was able to recall all sorts of stories about the people in the pictures, tell me in what way we're related, when the pictures were taken approximately. some of the stories were very impressive, and i would hate for them to be lost. i would like to create some sort of -----> archive !!!  for later generations and because my memory will definitely fail me, i have decided to sort all of the pictures with a family member and get all information i can get about each picture. now, some of the pictures already have something written on the back, but i don't know if adding something to such old photos is a good idea, i would like to leave them as they are.   \n\n\nis there any way to archive them very nicely and have picture and description at one glance? i think that photo albums would take up too much space. currently they're all in a nice box, all a bit scattered. i was thinking maybe post-it notes on the backs of them, but i feel like they would fall off too quickly.   \n\n\nthanks in advance!", "sortedWord": "None", "identifyer": 70247, "year": "2020"}, {"Unnamed: 0": 69207, "autor": "CheapMess", "date": 1598501784000, "content": "Travel Photography Equipment &amp; Workflow for mobility, security, and function /!/ Hi /Photography I'm going to share something that I have been working on and have a lot of hours in.  Please don't be an Jerk, but if you have something helpful to say, please do share.\n\nI wrote this guide as if I already do this - in reality, I have done all the individual parts, but haven't had the chance to put it all together (thanks covid)  There may be kinks to workout, and if you spot one, I will try to edit this guide over time.  Also, I shoot Nikon - but if you have a different brand based equivalent, I can try to include those options as well.\n\n&amp;#x200B;\n\nThe most difficult part of the travel photography workflow for me has always been culling/selecting my images.\n\nI have found that going through one to two hundred in an evening, is much more manageable than several thousand at once.\n\nI developed this workflow in order to travel as light as possible, maintain creative options, and not turn my vacation photos into a chore.\n\nI do have different gear and processes for my professional work, but this is the balance I want for personal travel.\n\nI am open to refining, but before you say it, I haven’t had any issues with battery-life with regards to the low-energy-bluetooth connection.\n\n&amp;#x200B;\n\n**GEAR:**\n\nNikon Z6 \n\n24-70 f/4 - may switch to 24-200 f/4-6.3\n\n2x TT350N Flash (one used as transmitter, also serves as a backup if a bulb blows)\n\n4 AA’s\n\n128GB QXD memory card\n\nColorChecker Passport\n\n2x ENEL15B Camera Batteries\n\niPhone with Snapbridge and LR Mobile\n\nExternal Battery Pack\n\n\\- has USB-C i/o, Lightning i/o, USB-A output, Micro-USB input\n\n\\- lightning to USB-C cable (can be used to charge phone, and by reversing, the camera)\n\n**IN THE HOTEL:**\n\nWD MyPassport (Wifi-Enabled HDD)\n\nAA Charger\n\nXQD to USB-A Adapter (you don’t need this if your camera uses SD)\n\nUSB-Micro-3 to USB-A Adapter\n\nAC Adapter\n\n\\- has 1 USB-C, 3 USB-A outputs\n\n**AT HOME:**\n\nComputer with LR Classic\n\n\\-Adobe cloud account \n\n\\-Syncomatic LR Plugin (I think it cost $5 for a license key, well worth it)\n\n\\-Photoshop or Equivalent\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**In the field:**\n\nPhotograph Images with Phone nearby, Bluetooth on, screen off.\n\n\\- Camera auto transfers 2MP JPG to SnapBridge app via Bluetooth\n\n\\- Snapbridge auto copies images to Photos app\n\n\\- Google Photos auto uploads images in Photos app to Google Account\n\n**When you have downtime (train, bus, plane, coffee shop, hotel)**\n\nCreate Folder in LR Mobile\n\nImport images into LR Mobile from Photos App\n\nUse Google Photos menu to “Free up space on device”\n\n\\- This will eliminate duplicates from Photos App, and Snapbridge\n\n\\- 2MP JPG Backups will remain in Adobe Cloud Account, and Google Photos Cloud\n\nMake Selections, and perform minor edits in LR Mobile\n\n\\- If desired, export and share select images to Social Media\n\nBackup RAW Files to WD MyPassport as 2nd Backup\n\n\\- Keep this locked in safe if possible\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**When you get home:**\n\nConnect WD MyPassport to Computer\n\nLaunch LR Classic\n\n\\- Import RAW images to Local HDD and 2nd External HDD\n\n\\- Keyword images if that is part of your workflow\n\n\\- Verify that all images are successfully copied to both locations\n\n\\- If there were any issues, copy images directly from Memory Card\n\nRun Time Machine (or equivalent backup software) on 3rd External HDD\n\n\\- You should be certain that your backups are including your External Drives\n\nMove your 2nd External HDD to separate physical location if you are extra-paranoid\n\nClear Memory Cards &amp; Clear WD MyPassport (the scariest step)\n\nYou will have a folder in the “From Lightroom CC” section with all 2mp JPGs flagged/rated\n\n\\- Click on the folder\n\nYou will have a new folder that you just imported with all your RAW images\n\n\\- Hold CMD key and Click on that folder\n\nAll your JPGs and RAW images will appear in the Grid view together\n\n(If you are not already in the Grid view, tap “G”)\n\n\\- Hold CMD and tap the “A” key to select all images in the Grid\n\nClick on “File”, go down to “Plug-in Extras” and over to “Sync files with the same name or time”\n\nFollow the Prompts\n\n(Cheat Sheet - 1st box “JPG”, 2nd box “RAW”, checkbox “File name”, Checkbox “Flag” “Rating” “Develop Settings”)\n\n\\- Click “OK”\n\n\\- All of your flags, ratings, and develop settings will be copied from your 2MP JPGs to your Raw Files\n\nDeselect the JPG Folder by CMD + Clicking on it\n\n\\- Now all of your Culling, Selections, and Rating are done\n\nEdit Exposure, Tones, Color, Cropping, etc. as normal in LR and PS as necessary \n\nRender all of your desired media as you normally do (slideshows, albums, prints, social media posts, website content, etc.)\n\nOnce finished with the project, “Export as Catalog” to Archive Drive and Delete the Files from local HDD\n\nIf you need to work on anything again, you can import the catalog into LR Classic and pick up where you left off\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nWORST CASE SCENARIOS:\n\n1) You are murdered on your trip and nobody gets to see your pictures\n\n2) Your camera is stolen, Your hard drive in the Hotel is stolen, Your phone is stolen, and your Google, and Adobe accounts are hacked and deleted\n\n3) The above, except the last one, and you are left with 2MP JPGs\n\n4) The above, except the last two, you have the same 2MP JPGs, but you don’t have to do your selections again\n\n5) Only your camera is stolen, so you get to keep your RAW files on the HDD, and still sync with LR Mobile, you only lose 1 day’s photos\n\n6) Your HDD is stolen, so you only have one copy of the RAW files on your memory card: try to get to an internet cafe/library and backup your card ASAP\n\n7) You are held prisoner, falsely accused, you blink your Google credentials in Morse code on a propaganda video for NSA analysts to decipher, they process and release your photos on your behalf, you death is tragic, but you are remembered for your art.", "link": "https://www.reddit.com/r/photography/comments/ihed9u/travel_photography_equipment_workflow_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "travel photography equipment &amp; workflow for mobility, security, and function /!/ hi /photography i'm going to share something that i have been working on and have a lot of hours in.  please don't be an jerk, but if you have something helpful to say, please do share.\n\ni wrote this guide as if i already do this - in reality, i have done all the individual parts, but haven't had the chance to put it all together (thanks covid)  there may be kinks to workout, and if you spot one, i will try to edit this guide over time.  also, i shoot nikon - but if you have a different brand based equivalent, i can try to include those options as well.\n\n&amp;#x200b;\n\nthe most difficult part of the travel photography workflow for me has always been culling/selecting my images.\n\ni have found that going through one to two hundred in an evening, is much more manageable than several thousand at once.\n\ni developed this workflow in order to travel as light as possible, maintain creative options, and not turn my vacation photos into a chore.\n\ni do have different gear and processes for my professional work, but this is the balance i want for personal travel.\n\ni am open to refining, but before you say it, i haven’t had any issues with battery-life with regards to the low-energy-bluetooth connection.\n\n&amp;#x200b;\n\n**gear:**\n\nnikon z6 \n\n24-70 f/4 - may switch to 24-200 f/4-6.3\n\n2x tt350n flash (one used as transmitter, also serves as a backup if a bulb blows)\n\n4 aa’s\n\n128gb qxd memory card\n\ncolorchecker passport\n\n2x enel15b camera batteries\n\niphone with snapbridge and lr mobile\n\nexternal battery pack\n\n\\- has usb-c i/o, lightning i/o, usb-a output, micro-usb input\n\n\\- lightning to usb-c cable (can be used to charge phone, and by reversing, the camera)\n\n**in the hotel:**\n\nwd mypassport (wifi-enabled hdd)\n\naa charger\n\nxqd to usb-a adapter (you don’t need this if your camera uses sd)\n\nusb-micro-3 to usb-a adapter\n\nac adapter\n\n\\- has 1 usb-c, 3 usb-a outputs\n\n**at home:**\n\ncomputer with lr classic\n\n\\-adobe cloud account \n\n\\-syncomatic lr plugin (i think it cost $5 for a license key, well worth it)\n\n\\-photoshop or equivalent\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**in the field:**\n\nphotograph images with phone nearby, bluetooth on, screen off.\n\n\\- camera auto transfers 2mp jpg to snapbridge app via bluetooth\n\n\\- snapbridge auto copies images to photos app\n\n\\- google photos auto uploads images in photos app to google account\n\n**when you have downtime (train, bus, plane, coffee shop, hotel)**\n\ncreate folder in lr mobile\n\nimport images into lr mobile from photos app\n\nuse google photos menu to “free up space on device”\n\n\\- this will eliminate duplicates from photos app, and snapbridge\n\n\\- 2mp jpg backups will remain in adobe cloud account, and google photos cloud\n\nmake selections, and perform minor edits in lr mobile\n\n\\- if desired, export and share select images to social media\n\nbackup raw files to wd mypassport as 2nd backup\n\n\\- keep this locked in safe if possible\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**when you get home:**\n\nconnect wd mypassport to computer\n\nlaunch lr classic\n\n\\- import raw images to local hdd and 2nd external hdd\n\n\\- keyword images if that is part of your workflow\n\n\\- verify that all images are successfully copied to both locations\n\n\\- if there were any issues, copy images directly from memory card\n\nrun time machine (or equivalent backup software) on 3rd external hdd\n\n\\- you should be certain that your backups are including your external drives\n\nmove your 2nd external hdd to separate physical location if you are extra-paranoid\n\nclear memory cards &amp; clear wd mypassport (the scariest step)\n\nyou will have a folder in the “from lightroom cc” section with all 2mp jpgs flagged/rated\n\n\\- click on the folder\n\nyou will have a new folder that you just imported with all your raw images\n\n\\- hold cmd key and click on that folder\n\nall your jpgs and raw images will appear in the grid view together\n\n(if you are not already in the grid view, tap “g”)\n\n\\- hold cmd and tap the “a” key to select all images in the grid\n\nclick on “file”, go down to “plug-in extras” and over to “sync files with the same name or time”\n\nfollow the prompts\n\n(cheat sheet - 1st box “jpg”, 2nd box “raw”, checkbox “file name”, checkbox “flag” “rating” “develop settings”)\n\n\\- click “ok”\n\n\\- all of your flags, ratings, and develop settings will be copied from your 2mp jpgs to your raw files\n\ndeselect the jpg folder by cmd + clicking on it\n\n\\- now all of your culling, selections, and rating are done\n\nedit exposure, tones, color, cropping, etc. as normal in lr and ps as necessary \n\nrender all of your desired media as you normally do (slideshows, albums, prints, social media posts, website content, etc.)\n\nonce finished with the project, “export as catalog” to -----> archive !!!  drive and delete the files from local hdd\n\nif you need to work on anything again, you can import the catalog into lr classic and pick up where you left off\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nworst case scenarios:\n\n1) you are murdered on your trip and nobody gets to see your pictures\n\n2) your camera is stolen, your hard drive in the hotel is stolen, your phone is stolen, and your google, and adobe accounts are hacked and deleted\n\n3) the above, except the last one, and you are left with 2mp jpgs\n\n4) the above, except the last two, you have the same 2mp jpgs, but you don’t have to do your selections again\n\n5) only your camera is stolen, so you get to keep your raw files on the hdd, and still sync with lr mobile, you only lose 1 day’s photos\n\n6) your hdd is stolen, so you only have one copy of the raw files on your memory card: try to get to an internet cafe/library and backup your card asap\n\n7) you are held prisoner, falsely accused, you blink your google credentials in morse code on a propaganda video for nsa analysts to decipher, they process and release your photos on your behalf, you death is tragic, but you are remembered for your art.", "sortedWord": "None", "identifyer": 70931, "year": "2020"}, {"Unnamed: 0": 69680, "autor": "steakmane", "date": 1600108890000, "content": "Looking for a better solution for clients to make selects /!/ My girlfriend has been racking up clients like crazy lately, and becoming overwhelmed by facilitating a simple photo selection process. Currently, she'll send a google drive folder or archive of sometimes hundreds of images for a client to make a list of which shots they want edited. They sometimes choose their photos via text, screenshots of the photos etc.. an absolute nightmare to keep track of. \n\nI'm looking for any suggestions on 3rd party services or workflows to make this process easier and that scales well with the increase in her client base. Ideally, its a tool that has a catalogue of all the images for a specific shoot, private to the client, and all the client has to do is check off the ones they want edited. I'm sure something like this exists, just looking for testimonials and feedback on different products.\n\nThanks!", "link": "https://www.reddit.com/r/photography/comments/isr33z/looking_for_a_better_solution_for_clients_to_make/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "looking for a better solution for clients to make selects /!/ my girlfriend has been racking up clients like crazy lately, and becoming overwhelmed by facilitating a simple photo selection process. currently, she'll send a google drive folder or -----> archive !!!  of sometimes hundreds of images for a client to make a list of which shots they want edited. they sometimes choose their photos via text, screenshots of the photos etc.. an absolute nightmare to keep track of. \n\ni'm looking for any suggestions on 3rd party services or workflows to make this process easier and that scales well with the increase in her client base. ideally, its a tool that has a catalogue of all the images for a specific shoot, private to the client, and all the client has to do is check off the ones they want edited. i'm sure something like this exists, just looking for testimonials and feedback on different products.\n\nthanks!", "sortedWord": "None", "identifyer": 71419, "year": "2020"}, {"Unnamed: 0": 69690, "autor": "DS2wasbetterJK", "date": 1600102487000, "content": "Archive pockets? /!/ This is rather unrelated to photography but I'm looking for these wax paper pockets that are used to archive photography, is anyone aware of any companies in the EU that sell them?", "link": "https://www.reddit.com/r/photography/comments/isovct/archive_pockets/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "-----> archive !!!  pockets? /!/ this is rather unrelated to photography but i'm looking for these wax paper pockets that are used to archive photography, is anyone aware of any companies in the eu that sell them?", "sortedWord": "None", "identifyer": 71429, "year": "2020"}, {"Unnamed: 0": 69938, "autor": "Mancupcake69", "date": 1600964802000, "content": "Massive family archive. /!/ I recently started an archival adventure of my family's photo albums. I've roughly (and I think lowly) estimated it at about 20,000 photos. This is a project mostly for my mom and so we do have to carry them all with us when we inevitably evacuate from fires again.\n\nI want to be able to display this collection through a digital frame but I have no experience with them and it seems like they all have storage limits. What's the best way to do this?", "link": "https://www.reddit.com/r/photography/comments/iz0g01/massive_family_archive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "massive family -----> archive !!! . /!/ i recently started an archival adventure of my family's photo albums. i've roughly (and i think lowly) estimated it at about 20,000 photos. this is a project mostly for my mom and so we do have to carry them all with us when we inevitably evacuate from fires again.\n\ni want to be able to display this collection through a digital frame but i have no experience with them and it seems like they all have storage limits. what's the best way to do this?", "sortedWord": "None", "identifyer": 71687, "year": "2020"}, {"Unnamed: 0": 70521, "autor": "stabilitywherearthou", "date": 1601516709000, "content": "What photographers have set up good websites for selling their work? /!/ Hey everyone, I’ve been asked by a photographer/friend to help him sell some of his considerable archive of prints by setting up an e-commerce site.  His work has been rep’d by galleries and gone to auction, so he’s not just starting out.  Do a lot of professionals at that level do this?  Are there any great examples of other photographers that have set up sites for selling their work?  In your opinion, what have the best examples done right? \n\nAlso, don’t be the guy that plugs his own site unless your Damon Winter or Mario Sorrenti.  Damon, Mario...you guys can go to town on this thread.  Everyone else! ...I would love to hear what’s worked for you and what hasn’t.", "link": "https://www.reddit.com/r/photography/comments/j2zebs/what_photographers_have_set_up_good_websites_for/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "what photographers have set up good websites for selling their work? /!/ hey everyone, i’ve been asked by a photographer/friend to help him sell some of his considerable -----> archive !!!  of prints by setting up an e-commerce site.  his work has been rep’d by galleries and gone to auction, so he’s not just starting out.  do a lot of professionals at that level do this?  are there any great examples of other photographers that have set up sites for selling their work?  in your opinion, what have the best examples done right? \n\nalso, don’t be the guy that plugs his own site unless your damon winter or mario sorrenti.  damon, mario...you guys can go to town on this thread.  everyone else! ...i would love to hear what’s worked for you and what hasn’t.", "sortedWord": "None", "identifyer": 72288, "year": "2020"}, {"Unnamed: 0": 70609, "autor": "Mediocre_Buyer", "date": 1602244801000, "content": "PETITION FOR INSTA TO ALLOW US TO ARCHIVE SINGULAR POSTS ON CAROUSEL", "link": "https://www.reddit.com/r/photography/comments/j7xmk5/petition_for_insta_to_allow_us_to_archive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "petition for insta to allow us to -----> archive !!!  singular posts on carousel", "sortedWord": "None", "identifyer": 72377, "year": "2020"}, {"Unnamed: 0": 70909, "autor": "yellowbubble7", "date": 1606710400000, "content": "Yellow 1953 negatives (also asked in r/analog) /!/ I work in an archive and today I came across negatives that weren't like any I'd seen before and I'm hoping someone here and help me figure out what's going on with them.\n\nBackground: labeled as taken in 1953, large format (presumably originally 4\"x5\", measured at 9.9cmx12.5cm), safety film (Ansco or Kodak, sadly I can't see the brand in my photo or remember which), other negatives in envelope were normal, other negatives in same storage container impacted by vinegar syndrome.\n\nWe have plenty of negatives in this collection that have started to turn yellow/brown/purple because the developer wasn't washed all the way off originally. These don't look like that. The areas I would expect to be black or grey are all shades of yellow and with the areas I expect to be clear are clear.\n\nEssentially, I have no idea what's going on with these and am hopeful someone here does.\n\nAlso, sorry if the flair is wrong, it was the best fit I could think of.\n\n[Three large format negatives that are yellow, rather than greyscale. Original pictures taken by Davis Studio in Frederick, MD in 1953, negatives donated to Heritage Frederick in 2009. Picture of negatives taken by u\\/yellowbubble7.](https://preview.redd.it/vjla5qxy0b261.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=b8dad3c697fe20162c0db1bf2fc484c76d65e396)", "link": "https://www.reddit.com/r/photography/comments/k3oqat/yellow_1953_negatives_also_asked_in_ranalog/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "yellow 1953 negatives (also asked in r/analog) /!/ i work in an -----> archive !!!  and today i came across negatives that weren't like any i'd seen before and i'm hoping someone here and help me figure out what's going on with them.\n\nbackground: labeled as taken in 1953, large format (presumably originally 4\"x5\", measured at 9.9cmx12.5cm), safety film (ansco or kodak, sadly i can't see the brand in my photo or remember which), other negatives in envelope were normal, other negatives in same storage container impacted by vinegar syndrome.\n\nwe have plenty of negatives in this collection that have started to turn yellow/brown/purple because the developer wasn't washed all the way off originally. these don't look like that. the areas i would expect to be black or grey are all shades of yellow and with the areas i expect to be clear are clear.\n\nessentially, i have no idea what's going on with these and am hopeful someone here does.\n\nalso, sorry if the flair is wrong, it was the best fit i could think of.\n\n[three large format negatives that are yellow, rather than greyscale. original pictures taken by davis studio in frederick, md in 1953, negatives donated to heritage frederick in 2009. picture of negatives taken by u\\/yellowbubble7.](https://preview.redd.it/vjla5qxy0b261.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=b8dad3c697fe20162c0db1bf2fc484c76d65e396)", "sortedWord": "None", "identifyer": 72686, "year": "2020"}, {"Unnamed: 0": 72264, "autor": "puzzledpanther", "date": 1605789151000, "content": "Simplest way to get into macro photography. /!/ I don't have an SLR let alone a camera. I had a lovely semi-SLR that died many years ago. However I've recently found a need to take closeup pictures of insects/flowers/seeds/etc\n\nMy smartphone can only go so far.\n\nWhat would be the simplest (and cheapest, times are hard) way of putting myself in the situation where I could take macro pictures?\nCheap macro-specialized camera? Smartphone addon?(those look like a hoax). Any ideas?\n\nI don't need the quality to be publish-worthy just some nice closeup pictures for my archive.\n\nThank you.", "link": "https://www.reddit.com/r/photography/comments/jx1v8x/simplest_way_to_get_into_macro_photography/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "simplest way to get into macro photography. /!/ i don't have an slr let alone a camera. i had a lovely semi-slr that died many years ago. however i've recently found a need to take closeup pictures of insects/flowers/seeds/etc\n\nmy smartphone can only go so far.\n\nwhat would be the simplest (and cheapest, times are hard) way of putting myself in the situation where i could take macro pictures?\ncheap macro-specialized camera? smartphone addon?(those look like a hoax). any ideas?\n\ni don't need the quality to be publish-worthy just some nice closeup pictures for my -----> archive !!! .\n\nthank you.", "sortedWord": "None", "identifyer": 74095, "year": "2020"}, {"Unnamed: 0": 72571, "autor": "LostinShropshire", "date": 1581072597000, "content": "jpgmag is trying to sell photographers their own photos before they shut down - with context /!/ &amp;#x200B;\n\n[You have to pay them for your photos](https://preview.redd.it/xtwnvb7mchf41.png?width=697&amp;format=png&amp;auto=webp&amp;s=bcccc39fe310efc9662ff924ac89f8cf347ada61)\n\nI'm posting this again because when I tried earlier, it was removed by a moderator due to lack of context or proof that they are charging.\n\nI joined jpgmag in 2009 or thereabouts. I was living in Cairo at the time and uploaded some images from Egypt and later Sri Lanka and India. Initially, there was quite a good community and I enjoyed sharing my pictures. I hadn't posted anything there for quite a long time, but looking back at the pics I had uploaded brought back some nice memories. \n\nA few months ago, I started getting emails from jpgmag saying that they were shutting down and becoming a print only company. In these emails, there was the promise that you could download all o the images that you had uploaded. I tried to do this but was then blocked by a paywall. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/ayckct2rdhf41.png?width=1152&amp;format=png&amp;auto=webp&amp;s=bdd881087c2ba22fbdf765fb1903a96721794b72\n\nThis seems to me to be a bit mean - especially as the value of the company comes from the images that were shared by the users. \n\nI wrote to jpgmag using language from GDPR legislation - hinting that they had a responsibility to return my files if they have been holding on to them, but they weren't interested and I don't have time to pursue this. \n\nI got an email from them today urging me to download my archive before it's gone and it grated enough that I wanted to share here to see what other photographers would make of it.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/23pduwxiehf41.png?width=665&amp;format=png&amp;auto=webp&amp;s=15dd061bcf7315787e6b5d233a70120921bf4576\n\nFeels like a bit of a cynical move on their part.", "link": "https://www.reddit.com/r/photography/comments/f08v6k/jpgmag_is_trying_to_sell_photographers_their_own/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "jpgmag is trying to sell photographers their own photos before they shut down - with context /!/ &amp;#x200b;\n\n[you have to pay them for your photos](https://preview.redd.it/xtwnvb7mchf41.png?width=697&amp;format=png&amp;auto=webp&amp;s=bcccc39fe310efc9662ff924ac89f8cf347ada61)\n\ni'm posting this again because when i tried earlier, it was removed by a moderator due to lack of context or proof that they are charging.\n\ni joined jpgmag in 2009 or thereabouts. i was living in cairo at the time and uploaded some images from egypt and later sri lanka and india. initially, there was quite a good community and i enjoyed sharing my pictures. i hadn't posted anything there for quite a long time, but looking back at the pics i had uploaded brought back some nice memories. \n\na few months ago, i started getting emails from jpgmag saying that they were shutting down and becoming a print only company. in these emails, there was the promise that you could download all o the images that you had uploaded. i tried to do this but was then blocked by a paywall. \n\n&amp;#x200b;\n\nhttps://preview.redd.it/ayckct2rdhf41.png?width=1152&amp;format=png&amp;auto=webp&amp;s=bdd881087c2ba22fbdf765fb1903a96721794b72\n\nthis seems to me to be a bit mean - especially as the value of the company comes from the images that were shared by the users. \n\ni wrote to jpgmag using language from gdpr legislation - hinting that they had a responsibility to return my files if they have been holding on to them, but they weren't interested and i don't have time to pursue this. \n\ni got an email from them today urging me to download my -----> archive !!!  before it's gone and it grated enough that i wanted to share here to see what other photographers would make of it.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/23pduwxiehf41.png?width=665&amp;format=png&amp;auto=webp&amp;s=15dd061bcf7315787e6b5d233a70120921bf4576\n\nfeels like a bit of a cynical move on their part.", "sortedWord": "None", "identifyer": 74417, "year": "2020"}, {"Unnamed: 0": 72730, "autor": "hubofthevictor", "date": 1581717198000, "content": "Hi folks. I am on a rabid hunt across a disorganized pile of storage for photos of a specific person for a funeral on Monday. Can you suggest a strategy to locate/dedupe/identify/enhance the files? /!/ A family member passed this week and I am trying to collect a couple hundred images of them to make a nice large collage that spans 20 years.  I've got a mishmash of backups, copies and whole drives that I need to mine for images to try to get a relatively complete collection.\n\nAssuming i am competent in windows and linux and can get a single system set up with network access to all of this content, do you have any suggestions for scanning this storage for image files, locating it into one archive space (ideally organized by date or exif data), finding ones with this person in them and enhancing them with some basic resizing, white balance, red eye removal?\n\nI don't mind spending a couple hundred bucks on software if it makes the process easier.  This is a once in a lifetime event and i have two days to get it done.\n\nThanks", "link": "https://www.reddit.com/r/photography/comments/f3zgw5/hi_folks_i_am_on_a_rabid_hunt_across_a/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "hi folks. i am on a rabid hunt across a disorganized pile of storage for photos of a specific person for a funeral on monday. can you suggest a strategy to locate/dedupe/identify/enhance the files? /!/ a family member passed this week and i am trying to collect a couple hundred images of them to make a nice large collage that spans 20 years.  i've got a mishmash of backups, copies and whole drives that i need to mine for images to try to get a relatively complete collection.\n\nassuming i am competent in windows and linux and can get a single system set up with network access to all of this content, do you have any suggestions for scanning this storage for image files, locating it into one -----> archive !!!  space (ideally organized by date or exif data), finding ones with this person in them and enhancing them with some basic resizing, white balance, red eye removal?\n\ni don't mind spending a couple hundred bucks on software if it makes the process easier.  this is a once in a lifetime event and i have two days to get it done.\n\nthanks", "sortedWord": "None", "identifyer": 74583, "year": "2020"}, {"Unnamed: 0": 72870, "autor": "blueman541", "date": 1582070527000, "content": "Anyone still backup/archive to disc media like Bluray? /!/ I practice 3-2-1 strategy for data storage backup. My 3rd copy of photo/videos used to be all on DVD/BD disc, but mostly have given up in favor of just HDD. \n\n15 years ago 1-2 disc was enough for a whole year worth of family photos etc. Today I would need to burn like 50+ disc. Size of photos and especially  4k video etc has grown a lot. A modern 8TB HDD is equiv to 160 50GB disc. I've gotten lazy burning, too time consuming and takes up physical space. \n\nMy current strategy is a FreeNAS raid-z2 NAS machine for main storage. It offers bit rot detection which is awesome and access to everything at a touch of finger.  Secondary copy would be replicated offsite to another FreeNAS machine. Finally my third copy would be just external HDD. \n\nThe downside of HDD is their shorter storage lifespan as they are not really meant for long term archiving. If I keep upgrading to new HDD or storage mediums then all the data will be kept fresh. Just future generation might have to deal with data rot once I've left this world and not refreshing.  \n\n&amp;nbsp;\n\nSo anyone else still backing up to disc media? Anyone using tape backups?", "link": "https://www.reddit.com/r/photography/comments/f61jw6/anyone_still_backuparchive_to_disc_media_like/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "anyone still backup/-----> archive !!!  to disc media like bluray? /!/ i practice 3-2-1 strategy for data storage backup. my 3rd copy of photo/videos used to be all on dvd/bd disc, but mostly have given up in favor of just hdd. \n\n15 years ago 1-2 disc was enough for a whole year worth of family photos etc. today i would need to burn like 50+ disc. size of photos and especially  4k video etc has grown a lot. a modern 8tb hdd is equiv to 160 50gb disc. i've gotten lazy burning, too time consuming and takes up physical space. \n\nmy current strategy is a freenas raid-z2 nas machine for main storage. it offers bit rot detection which is awesome and access to everything at a touch of finger.  secondary copy would be replicated offsite to another freenas machine. finally my third copy would be just external hdd. \n\nthe downside of hdd is their shorter storage lifespan as they are not really meant for long term archiving. if i keep upgrading to new hdd or storage mediums then all the data will be kept fresh. just future generation might have to deal with data rot once i've left this world and not refreshing.  \n\n&amp;nbsp;\n\nso anyone else still backing up to disc media? anyone using tape backups?", "sortedWord": "None", "identifyer": 74731, "year": "2020"}, {"Unnamed: 0": 74554, "autor": "E135L", "date": 1585993123000, "content": "RAID or something else? /!/ Guy and gals,\n\nI’ve being working on my own photo and video projects more and more for the last few years. I now have around 5 TB of data. I want to be able to back it up, archive it, but also be able to post-process it when I’ve finished shooting for a project. \n\nMy current workflow is good but getting less effective as I gain more data. I copy from my camera to my computer HDD and also a external HDD on location. I edit off my external then backup to another external when I’m at home then I delete off my computer. It’s simply not good enough. I think I need a different type of storage at home for archiving and backing up. I also need some workflow improvements and new software suggestions.\n\nAny one got any suggestions for what I need? I’ve heard good things about RAID and also just using SSD/HDD. I work on a 1 TB Mac with LR and PP.\n\nThank you!", "link": "https://www.reddit.com/r/photography/comments/fuquxx/raid_or_something_else/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "raid or something else? /!/ guy and gals,\n\ni’ve being working on my own photo and video projects more and more for the last few years. i now have around 5 tb of data. i want to be able to back it up, -----> archive !!!  it, but also be able to post-process it when i’ve finished shooting for a project. \n\nmy current workflow is good but getting less effective as i gain more data. i copy from my camera to my computer hdd and also a external hdd on location. i edit off my external then backup to another external when i’m at home then i delete off my computer. it’s simply not good enough. i think i need a different type of storage at home for archiving and backing up. i also need some workflow improvements and new software suggestions.\n\nany one got any suggestions for what i need? i’ve heard good things about raid and also just using ssd/hdd. i work on a 1 tb mac with lr and pp.\n\nthank you!", "sortedWord": "None", "identifyer": 76467, "year": "2020"}, {"Unnamed: 0": 78457, "autor": "6yXMT739v", "date": 1591303806000, "content": "Gold standard - Scan of slides/Kodachrome in 2020 /!/ Hi,  \n\n\ni would be glad if you have some recommendation for a good scanner.  \nI understand that a Plustek 8200Ai will do the trick, especially with the infrared dust removal.  \n\n\nIt will cost around 500 Euro here but i have a fairly large archive to scan. I do not have a modern DSLR (Nikon D70) but i can borrow one but i think it is too much of a makeshift after all because scanning the large archive will take a few month next to my job.  \n\n\nWith an Epson scanner i won't get the same good results as with a Plustek, right?  \n\n\nI can use Mac OS or Windows 10 - doesn't matter, i have a MacBook Pro and a Windows 10 computer so software vise it is not an issue if there are compatibility issues.  \n\n\nLooking forward to your opinions!", "link": "https://www.reddit.com/r/photography/comments/gwpx29/gold_standard_scan_of_slideskodachrome_in_2020/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "gold standard - scan of slides/kodachrome in 2020 /!/ hi,  \n\n\ni would be glad if you have some recommendation for a good scanner.  \ni understand that a plustek 8200ai will do the trick, especially with the infrared dust removal.  \n\n\nit will cost around 500 euro here but i have a fairly large -----> archive !!!  to scan. i do not have a modern dslr (nikon d70) but i can borrow one but i think it is too much of a makeshift after all because scanning the large archive will take a few month next to my job.  \n\n\nwith an epson scanner i won't get the same good results as with a plustek, right?  \n\n\ni can use mac os or windows 10 - doesn't matter, i have a macbook pro and a windows 10 computer so software vise it is not an issue if there are compatibility issues.  \n\n\nlooking forward to your opinions!", "sortedWord": "None", "identifyer": 80526, "year": "2020"}, {"Unnamed: 0": 78728, "autor": "HairySavage", "date": 1592304817000, "content": "A photography archive shot in the poorest regions of 1930s Turkey - taken by a Jewish doctor exiled by Hitler - have been made freely available on Cambridge University's Digital Library", "link": "https://www.reddit.com/r/photography/comments/ha1pgl/a_photography_archive_shot_in_the_poorest_regions/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "a photography -----> archive !!!  shot in the poorest regions of 1930s turkey - taken by a jewish doctor exiled by hitler - have been made freely available on cambridge university's digital library", "sortedWord": "None", "identifyer": 80811, "year": "2020"}, {"Unnamed: 0": 79362, "autor": "ParalyzeTheAnalysis", "date": 1596898470000, "content": "Photo Sharing And Storage Options - Long Term (What happens when I die?) /!/ Hi Everyone!\n\nI've struggled over the years to find the best long term, bulletproof method by which I store (and share) photos for personal and business use cases. I've landed on a system that mostly works for my day-to-day operations and my year-to-year storage / archiving (I'll outline that in a bit).  Lately, I've been worrying primarily about what happens to my photos should something happen to me. My wife's been on me to come up with a plan and I truly want to make it easy for her (primary goal) and family members (secondary goal) to access my digital self (in an organized fashion) should I get hit by a bus (or throw away my computer and permanently move to a remote tropical island).\n\nI've researched a lot of these options out there individually, but haven't run into any firsthand experiences that match up with my goals. Most discussions revolve around the use I assume I can't be the only one in this situation!\n\n**Current Setup**:\n\n* Drobo - RAID setup for long term archiving of photos. I think I'm approaching about 3TB and have more drives to combine into this (I need to buy more internal drives!)\n* External HD - Cloning for Drobo offsite backup of Drobo via Carbon Copy Cloner (future state for me)\n* iCloud - I share albums with family members / friends who have iPhones. Of my 75k+ camera roll, I'd probably want to selectively designate about 30% of images to be available to others in whatever long term solution I decide to use.\n* Dropbox - Client sharing (I share a Dropbox folder with clients to deliver final files) \n* SmugMug - Website backend (I do not do any client delivery or eCommerce here - It's really just a website builder for me)\n* Various External Drives - I use these for active / semi-active project files as it is quicker than my Drobo. Might include my year-to-year working files that I eventually archive to my Drobo.\n* Instagram - Of course I share here, but it's photo-by-photo and not a scalable solution (also not full resolution). It's fine for sharing a photo here and there.\n\n**Tools I DON'T use but have looked into**:\n\n* Google - I've not adopted Google for photos - Just email / Google Voice. This is probably a front runner for me right now.\n* AWS - I've looked at it, but never adopted. I do not get the sense that this is right for me, but I'm open to it. \n* Facebook - No, I hate Facebook. But, the \"legacy\" feature is nice in that I can designate someone as being in charge of my account should I die. Also, I don't believe full res photos will be an option.\n* AEM - Probably too expensive and excessive for my needs, but I've thought about using as a CMS as it has great permission control and publishing abilities. Probably akin to killing a fly with a nuke, though.\n\n**Goals**:\n\n* Publish MANY select images that are accessible by family and friends (in the \"cloud\")\n* Upload speeds - I'd love to be able to find something that isn't throttled down too far (as with iCloud - Despite my great upload speeds, I think iCloud throttles what it can receive...)\n* Password protected - Only those I designate should be able to access the files\n* Permission management abilities - I might not want to share certain galleries with one side of the family that were meant for another. For instance, my in laws probably don't care about photos that were taken at my Aunt and Uncle's Thanksgiving, just as my Aunt and Uncle probably don't care about photos published of my Niece-in-law's first birthday. \n* Full resolution photos published with the ability to download by users\n* Organizability - Should be easy to organize into logical albums and groupings of files that are easily interpreted and browsed by end users\n* File types - Photos are my primary objective here, but this could include videos, and could even include a PDF or other type of document here and there.\n* Capacity - This should be able to exceed a couple of terabytes and scale with my needs.\n* Longevity and survivability - Needs uptime and to be with a company / solution that will be around for a while (no fly by night solutions that I can't trust to outlive me).\n* Security - I am a very private person and wish to have these files be very private as well. This has been my hesitation with moving forward on \n* Billing - Able to designate an alternative billing contact to keep the storage going if I am no longer in the picture.\n* Cost - I don't want to pay an arm and a leg for this (but I will if it's the right solution) and would prefer to not be billed by the GB but by the TB - Some kind of plan where it is 1TB, 2TB, 5TB, etc... (this is more mental for me - I don't want to *feel* the money leaving my wallet as I upload the next 500 photos).\n* App-based access by end users - This is a nice to have, but I'd love for my family members to be able to access an app that cleanly displays folders/albums in a logical method (defined by me). This could be a website or a mobile app that offers a gallery-type browsing ability.\n\nI've tossed around using Google Photos. I've thought about just dumping everything into SmugMug. I've thought about iCloud shared albums. I'm just a bit balled up with where to jump from here. I've researched a lot of these individually but would love to hear of your experiences if you've been in a similar situation! I might be missing something incredibly simple as I've been deep diving too much and can't quite see the forest through the trees. I am having a tough time putting it all together in my head and appreciate ANY input that you share!", "link": "https://www.reddit.com/r/photography/comments/i60exi/photo_sharing_and_storage_options_long_term_what/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "photo sharing and storage options - long term (what happens when i die?) /!/ hi everyone!\n\ni've struggled over the years to find the best long term, bulletproof method by which i store (and share) photos for personal and business use cases. i've landed on a system that mostly works for my day-to-day operations and my year-to-year storage / archiving (i'll outline that in a bit).  lately, i've been worrying primarily about what happens to my photos should something happen to me. my wife's been on me to come up with a plan and i truly want to make it easy for her (primary goal) and family members (secondary goal) to access my digital self (in an organized fashion) should i get hit by a bus (or throw away my computer and permanently move to a remote tropical island).\n\ni've researched a lot of these options out there individually, but haven't run into any firsthand experiences that match up with my goals. most discussions revolve around the use i assume i can't be the only one in this situation!\n\n**current setup**:\n\n* drobo - raid setup for long term archiving of photos. i think i'm approaching about 3tb and have more drives to combine into this (i need to buy more internal drives!)\n* external hd - cloning for drobo offsite backup of drobo via carbon copy cloner (future state for me)\n* icloud - i share albums with family members / friends who have iphones. of my 75k+ camera roll, i'd probably want to selectively designate about 30% of images to be available to others in whatever long term solution i decide to use.\n* dropbox - client sharing (i share a dropbox folder with clients to deliver final files) \n* smugmug - website backend (i do not do any client delivery or ecommerce here - it's really just a website builder for me)\n* various external drives - i use these for active / semi-active project files as it is quicker than my drobo. might include my year-to-year working files that i eventually -----> archive !!!  to my drobo.\n* instagram - of course i share here, but it's photo-by-photo and not a scalable solution (also not full resolution). it's fine for sharing a photo here and there.\n\n**tools i don't use but have looked into**:\n\n* google - i've not adopted google for photos - just email / google voice. this is probably a front runner for me right now.\n* aws - i've looked at it, but never adopted. i do not get the sense that this is right for me, but i'm open to it. \n* facebook - no, i hate facebook. but, the \"legacy\" feature is nice in that i can designate someone as being in charge of my account should i die. also, i don't believe full res photos will be an option.\n* aem - probably too expensive and excessive for my needs, but i've thought about using as a cms as it has great permission control and publishing abilities. probably akin to killing a fly with a nuke, though.\n\n**goals**:\n\n* publish many select images that are accessible by family and friends (in the \"cloud\")\n* upload speeds - i'd love to be able to find something that isn't throttled down too far (as with icloud - despite my great upload speeds, i think icloud throttles what it can receive...)\n* password protected - only those i designate should be able to access the files\n* permission management abilities - i might not want to share certain galleries with one side of the family that were meant for another. for instance, my in laws probably don't care about photos that were taken at my aunt and uncle's thanksgiving, just as my aunt and uncle probably don't care about photos published of my niece-in-law's first birthday. \n* full resolution photos published with the ability to download by users\n* organizability - should be easy to organize into logical albums and groupings of files that are easily interpreted and browsed by end users\n* file types - photos are my primary objective here, but this could include videos, and could even include a pdf or other type of document here and there.\n* capacity - this should be able to exceed a couple of terabytes and scale with my needs.\n* longevity and survivability - needs uptime and to be with a company / solution that will be around for a while (no fly by night solutions that i can't trust to outlive me).\n* security - i am a very private person and wish to have these files be very private as well. this has been my hesitation with moving forward on \n* billing - able to designate an alternative billing contact to keep the storage going if i am no longer in the picture.\n* cost - i don't want to pay an arm and a leg for this (but i will if it's the right solution) and would prefer to not be billed by the gb but by the tb - some kind of plan where it is 1tb, 2tb, 5tb, etc... (this is more mental for me - i don't want to *feel* the money leaving my wallet as i upload the next 500 photos).\n* app-based access by end users - this is a nice to have, but i'd love for my family members to be able to access an app that cleanly displays folders/albums in a logical method (defined by me). this could be a website or a mobile app that offers a gallery-type browsing ability.\n\ni've tossed around using google photos. i've thought about just dumping everything into smugmug. i've thought about icloud shared albums. i'm just a bit balled up with where to jump from here. i've researched a lot of these individually but would love to hear of your experiences if you've been in a similar situation! i might be missing something incredibly simple as i've been deep diving too much and can't quite see the forest through the trees. i am having a tough time putting it all together in my head and appreciate any input that you share!", "sortedWord": "None", "identifyer": 81470, "year": "2020"}, {"Unnamed: 0": 79741, "autor": "daremosan", "date": 1597083936000, "content": "New Dorthea Lange archive site by Oakland museum", "link": "https://www.reddit.com/r/photography/comments/i7af2a/new_dorthea_lange_archive_site_by_oakland_museum/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "new dorthea lange -----> archive !!!  site by oakland museum", "sortedWord": "None", "identifyer": 81863, "year": "2020"}, {"Unnamed: 0": 82980, "autor": "amellice", "date": 1608058666000, "content": "Saal Digital Photobook Review /!/ Hi all, I've recently ordered a photobook from Saal Digital which is a German print house, and wanted to share my thoughts with you.\n\n&amp;#x200B;\n\nWhile I was looking for a printing house to print a portfolio photo book, I stumbled on Saal Digital which is a German print house that offers high quality prints and photo books. I've never tried Saal Digital before and having tried a different bunch of other print houses, I decided to give Saal Digital a try. I printed 130 pages 12x8.5 photo book from the professional line.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/y0ba8hnrde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=07b11fc99019899aba90a1cfef75105542f45363\n\n# Design\n\nThere are different choices of formats, surface finish, page thickness, and even a gift box that wraps your book. I chose the Professional Line photobook with the black leather cover surface and went for the glossy finish.\n\nSaal Digital offers layout design software for both Mac OS and Windows where you can customize your book. This is the tool that I used to design, upload, and order my book. You can design your book with other software and upload it for printing as a PDF.\n\nI found the software to be very easy to use. You start out by designing the cover of the book including the back and the spine. Then you start adding pages where you can either choose a layout from existing presets or design your own (and save it if you want).\n\n&amp;#x200B;\n\nhttps://preview.redd.it/v1ej6gsude561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=178c6c35bead5c9a0b6f6892327dcf2e0039b592\n\nAs for the paper itself, Saal Digital [uses](https://www.saal-digital.com/support/article/overview-of-paper-density/) Fuji Crystal Archive paper. For each page, two papers will be glued back to back with a thickness of about 0.36mm per page. I personally love this paper and use it in my darkroom printing since it's widely available in sheets. It has beautiful color rendering with deep blacks and beautiful highlights.\n\nAs for color management, Saal Digital provides ICC color profiles that you can download and load into your image editing software to get a feeling of how the printed photos would look like. I found that the profile rendering stays very close to the exported sRGB JPEGs and the final print. You would get an accurate representation if your monitor is calibrated.\n\nAnother aspect that I liked is what Saal Digital calls \"Layflat Binding\" where you can print panorama on two pages and they would look (hopefully) flat. I've tried this with full two pages layout and over one page layout and they do look flat, however, one concern is to have a white line (eventually) in the binding area, but only time can tell.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/211nol3zde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=4a5225948192e483e48ad8a247cd60b8aefc09a1\n\nhttps://preview.redd.it/d0ebe0nxde561.jpg?width=3792&amp;format=pjpg&amp;auto=webp&amp;s=175224f939c6e5181010f1d545f357fdfbf32048\n\n# Print Quality\n\nIt all comes down to print quality when I want to pick which print house to print my photos. Sure, easy tooling and process is a plus but the main factor is how good these prints look and how good the book overall look. Personally, I was impressed with Saal's final book and I'll break it down for you.\n\nAs for the cover, the leather cover felt premium and not cheap. It has a non-noticeable nice smell. The binding of the book looks sturdy and shouldn't fall apart with careful use (only time will tell though). The spine looks fine and sturdy. You can print on the first page glued to the front and back cover if you choose to do so.\n\nThe pages themselves feel thick since they are two prints glued back to back together. The glossy finish obviously has a reflection to it (but which glossy paper that doesn't) and there's very minimal to no texture. Since it's resin-coated paper, it may feel plasticy to some people.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qmtntdx1ee561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=066fecc03b9e23fc61d1d041b3d5f19c63982a65\n\nThe color rendering stayed very true to the original photos. I increased the exposure a bit (probably +1/3 stop) for some photos in post-processing while exporting photos used in this book. The prints look and feel very close to what I see on the screen and print personally on an Inkjet printer. Looking at the print above for an example, the highlights are intact and not pure white or blown away, there are some tones there. Shadows are not lost too, the subtle different tones are still rendered as I wanted which was quite surprising to me.\n\nLooking at the image below, it shows very subtle details in shadow areas (which may not be visible on a screen) like the dark trees area below the mountain in the center and some rock formations in this mountain also.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/z2q5lc53ee561.jpg?width=3667&amp;format=pjpg&amp;auto=webp&amp;s=87388d046a9f832643d8b915d950e59badadd1e1\n\nYou still get excellent deep blacks, like the following image shows where the sky looks black (which may not look so on a screen). The contrast of this print looks amazing, the white clouds on top of the mountains meet the dark black sky with zero color banding issues. This may be due to the continuous tone of RA-4 printing with this paper vs Inkjet printing for example.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1lcqypo4ee561.jpg?width=3605&amp;format=pjpg&amp;auto=webp&amp;s=c977474b37a488b3c2e4b75c99bde0b8cf61086e\n\nDeep shadows and subtle tones rendering looks amazing in color photographs too. Like the deep shadows below the dead tree and the blacks in the background mountains, while keeping the color rendering of the dark sky and the milky way true.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3cyh9s96ee561.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=6a05dc8d891dd78383cbbfe5ff72c038f53a4ce5\n\n# Summary\n\nAll in all, I was very pleased with the quality of the book and prints. The Professional Line Photobook product did indeed feel professional and premium. The color rendering is very good with truly deep blacks, subtle shadow, and highlight tones that really impress.\n\nThe one thing that I felt missing is offering other types of paper for books, as Fuji Crystal Archive glossy has high gloss and even the matt version has a bit of sheen to it, it may not suit all photos and people, especially if you're looking for something with texture. For me, I love the Crystal Archive paper and use it personally. \n\nAnother thing to note is that I capped the max number of pages allowed at 130 pages. The software wouldn't let me add more pages after that. This restriction may exist to ensure \"Layflat Binding\" would work.", "link": "https://www.reddit.com/r/photography/comments/kdrw88/saal_digital_photobook_review/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "saal digital photobook review /!/ hi all, i've recently ordered a photobook from saal digital which is a german print house, and wanted to share my thoughts with you.\n\n&amp;#x200b;\n\nwhile i was looking for a printing house to print a portfolio photo book, i stumbled on saal digital which is a german print house that offers high quality prints and photo books. i've never tried saal digital before and having tried a different bunch of other print houses, i decided to give saal digital a try. i printed 130 pages 12x8.5 photo book from the professional line.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/y0ba8hnrde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=07b11fc99019899aba90a1cfef75105542f45363\n\n# design\n\nthere are different choices of formats, surface finish, page thickness, and even a gift box that wraps your book. i chose the professional line photobook with the black leather cover surface and went for the glossy finish.\n\nsaal digital offers layout design software for both mac os and windows where you can customize your book. this is the tool that i used to design, upload, and order my book. you can design your book with other software and upload it for printing as a pdf.\n\ni found the software to be very easy to use. you start out by designing the cover of the book including the back and the spine. then you start adding pages where you can either choose a layout from existing presets or design your own (and save it if you want).\n\n&amp;#x200b;\n\nhttps://preview.redd.it/v1ej6gsude561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=178c6c35bead5c9a0b6f6892327dcf2e0039b592\n\nas for the paper itself, saal digital [uses](https://www.saal-digital.com/support/article/overview-of-paper-density/) fuji crystal -----> archive !!!  paper. for each page, two papers will be glued back to back with a thickness of about 0.36mm per page. i personally love this paper and use it in my darkroom printing since it's widely available in sheets. it has beautiful color rendering with deep blacks and beautiful highlights.\n\nas for color management, saal digital provides icc color profiles that you can download and load into your image editing software to get a feeling of how the printed photos would look like. i found that the profile rendering stays very close to the exported srgb jpegs and the final print. you would get an accurate representation if your monitor is calibrated.\n\nanother aspect that i liked is what saal digital calls \"layflat binding\" where you can print panorama on two pages and they would look (hopefully) flat. i've tried this with full two pages layout and over one page layout and they do look flat, however, one concern is to have a white line (eventually) in the binding area, but only time can tell.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/211nol3zde561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=4a5225948192e483e48ad8a247cd60b8aefc09a1\n\nhttps://preview.redd.it/d0ebe0nxde561.jpg?width=3792&amp;format=pjpg&amp;auto=webp&amp;s=175224f939c6e5181010f1d545f357fdfbf32048\n\n# print quality\n\nit all comes down to print quality when i want to pick which print house to print my photos. sure, easy tooling and process is a plus but the main factor is how good these prints look and how good the book overall look. personally, i was impressed with saal's final book and i'll break it down for you.\n\nas for the cover, the leather cover felt premium and not cheap. it has a non-noticeable nice smell. the binding of the book looks sturdy and shouldn't fall apart with careful use (only time will tell though). the spine looks fine and sturdy. you can print on the first page glued to the front and back cover if you choose to do so.\n\nthe pages themselves feel thick since they are two prints glued back to back together. the glossy finish obviously has a reflection to it (but which glossy paper that doesn't) and there's very minimal to no texture. since it's resin-coated paper, it may feel plasticy to some people.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/qmtntdx1ee561.jpg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=066fecc03b9e23fc61d1d041b3d5f19c63982a65\n\nthe color rendering stayed very true to the original photos. i increased the exposure a bit (probably +1/3 stop) for some photos in post-processing while exporting photos used in this book. the prints look and feel very close to what i see on the screen and print personally on an inkjet printer. looking at the print above for an example, the highlights are intact and not pure white or blown away, there are some tones there. shadows are not lost too, the subtle different tones are still rendered as i wanted which was quite surprising to me.\n\nlooking at the image below, it shows very subtle details in shadow areas (which may not be visible on a screen) like the dark trees area below the mountain in the center and some rock formations in this mountain also.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/z2q5lc53ee561.jpg?width=3667&amp;format=pjpg&amp;auto=webp&amp;s=87388d046a9f832643d8b915d950e59badadd1e1\n\nyou still get excellent deep blacks, like the following image shows where the sky looks black (which may not look so on a screen). the contrast of this print looks amazing, the white clouds on top of the mountains meet the dark black sky with zero color banding issues. this may be due to the continuous tone of ra-4 printing with this paper vs inkjet printing for example.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/1lcqypo4ee561.jpg?width=3605&amp;format=pjpg&amp;auto=webp&amp;s=c977474b37a488b3c2e4b75c99bde0b8cf61086e\n\ndeep shadows and subtle tones rendering looks amazing in color photographs too. like the deep shadows below the dead tree and the blacks in the background mountains, while keeping the color rendering of the dark sky and the milky way true.\n\n&amp;#x200b;\n\nhttps://preview.redd.it/3cyh9s96ee561.jpg?width=3024&amp;format=pjpg&amp;auto=webp&amp;s=6a05dc8d891dd78383cbbfe5ff72c038f53a4ce5\n\n# summary\n\nall in all, i was very pleased with the quality of the book and prints. the professional line photobook product did indeed feel professional and premium. the color rendering is very good with truly deep blacks, subtle shadow, and highlight tones that really impress.\n\nthe one thing that i felt missing is offering other types of paper for books, as fuji crystal archive glossy has high gloss and even the matt version has a bit of sheen to it, it may not suit all photos and people, especially if you're looking for something with texture. for me, i love the crystal archive paper and use it personally. \n\nanother thing to note is that i capped the max number of pages allowed at 130 pages. the software wouldn't let me add more pages after that. this restriction may exist to ensure \"layflat binding\" would work.", "sortedWord": "None", "identifyer": 85240, "year": "2020"}, {"Unnamed: 0": 86126, "autor": "seldg", "date": 1589529630000, "content": "Contributors for Instagram Film Archive /!/ Not sure if this is allowed or considered \"self-promotion\", if ever I'd understand if the post is taken down!  \n\n\nI recently created a little film archive account on Instagram (@publicfilmarchive) meant to share glimpses of the outside word (or life as we knew it) with the world being a more confined at home nowadays. I'm by no means a professional, but just wanted to make a creative space for people to share their thoughts and stories through their photos.\n\nWould love to have people share things with me to feature since it's meant to be a collective thing and it'd be nice to get photos from different people. DM me if you're open to sharing some photos! Of course, proper credit will be given for photos posted.", "link": "https://www.reddit.com/r/photography/comments/gk4ypp/contributors_for_instagram_film_archive/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "archive", "selectorShort": "archive", "MarkedSent": "contributors for instagram film -----> archive !!!  /!/ not sure if this is allowed or considered \"self-promotion\", if ever i'd understand if the post is taken down!  \n\n\ni recently created a little film archive account on instagram (@publicfilmarchive) meant to share glimpses of the outside word (or life as we knew it) with the world being a more confined at home nowadays. i'm by no means a professional, but just wanted to make a creative space for people to share their thoughts and stories through their photos.\n\nwould love to have people share things with me to feature since it's meant to be a collective thing and it'd be nice to get photos from different people. dm me if you're open to sharing some photos! of course, proper credit will be given for photos posted.", "sortedWord": "None", "identifyer": 88508, "year": "2020"}], "name": "archivephotography2020"}