{"interestingcomments": [{"Unnamed: 0": 289971, "autor": "cryptoz", "date": 1537065813000, "content": "Project: My goal is to turn every outdoor photo ever taken into usable, numerical weather data that can be used in weather models for storm prediction. Here is my progress. /!/ Hello,\n\nI am frustrated at the lack of good weather data in this day and age of connected cameras and sensors etc. So I am making projects to assimilate and analyze sources of data that could be used in weather forecasting but are not yet. An obvious one is photos outside.\n\nI'm starting with a simpler target, which is: using labelled photos of the sky, can we train a machine-learning algorithm to do basic classification on the weather conditions on the photo. For example, in a photo of the sky with clouds, and at the bottom trees and roofs, if those items are tagged in the photo then the algorithm can learn about future photos.\n\nA stretch goal is to use all photos taken outside, even if they don't include the sky in them - ground conditions, shadows, etc will all give clues as to the weather outside at the time the photo was taken.\n\nI have asked the machine learning communities what they think and they deem the basic premise of auto-tagging the photos do-able. The main issue, of course, is finding or creating a large enough training data set for this to work.\n\nSo that's where I am now. I'm estimated to need maybe a few thousand tagged photos of sky conditions at a minimum to begin work on the training algorithm. To that end and others, I've made an Android app that lets people send in tagged photos of the sky. So far I've only collected around 30 photos - and the labeling is dubious. \n\nThe app I made for this is called [All Clear Weather](https://play.google.com/store/apps/details?id=com.allclearweather.android) (US, Android for now, long story, expanding later). The app contains multiple other weather experiments as well not related to photography.\n\nClosing Thoughts and final points\n\n----\n\nI'm not sure I made a wise decision making a weather app that contains this small photography feature to use. I think it will be under-utilized. Is there interest in the photography community to contribute something like this? Should I make a separate app for you?\n\n----\n\nIt occurs to me that smartphone cameras are getting much better year over year. What kind of sensory/light details am I missing from smartphone pictures that might resolve features in the sky if a more advanced camera were used? Are smartphone cameras technically capable of more or less than I'm hoping? I'm thinking about things like [this article on cosmic rays](https://gizmodo.com/turn-your-smartphone-into-a-particle-detector-for-cosmi-1697286872), showing that the cameras can help in scientific research more than people might expect!\n\nThanks!!", "link": "https://www.reddit.com/r/photography/comments/9g7aqj/project_my_goal_is_to_turn_every_outdoor_photo/", "origin": "Reddit", "suborigin": "photography", "result": true, "Selector": "classification", "selectorShort": "classification", "MarkedSent": "project: my goal is to turn every outdoor photo ever taken into usable, numerical weather data that can be used in weather models for storm prediction. here is my progress. /!/ hello,\n\ni am frustrated at the lack of good weather data in this day and age of connected cameras and sensors etc. so i am making projects to assimilate and analyze sources of data that could be used in weather forecasting but are not yet. an obvious one is photos outside.\n\ni'm starting with a simpler target, which is: using labelled photos of the sky, can we train a machine-learning algorithm to do basic -----> classification !!!  on the weather conditions on the photo. for example, in a photo of the sky with clouds, and at the bottom trees and roofs, if those items are tagged in the photo then the algorithm can learn about future photos.\n\na stretch goal is to use all photos taken outside, even if they don't include the sky in them - ground conditions, shadows, etc will all give clues as to the weather outside at the time the photo was taken.\n\ni have asked the machine learning communities what they think and they deem the basic premise of auto-tagging the photos do-able. the main issue, of course, is finding or creating a large enough training data set for this to work.\n\nso that's where i am now. i'm estimated to need maybe a few thousand tagged photos of sky conditions at a minimum to begin work on the training algorithm. to that end and others, i've made an android app that lets people send in tagged photos of the sky. so far i've only collected around 30 photos - and the labeling is dubious. \n\nthe app i made for this is called [all clear weather](https://play.google.com/store/apps/details?id=com.allclearweather.android) (us, android for now, long story, expanding later). the app contains multiple other weather experiments as well not related to photography.\n\nclosing thoughts and final points\n\n----\n\ni'm not sure i made a wise decision making a weather app that contains this small photography feature to use. i think it will be under-utilized. is there interest in the photography community to contribute something like this? should i make a separate app for you?\n\n----\n\nit occurs to me that smartphone cameras are getting much better year over year. what kind of sensory/light details am i missing from smartphone pictures that might resolve features in the sky if a more advanced camera were used? are smartphone cameras technically capable of more or less than i'm hoping? i'm thinking about things like [this article on cosmic rays](https://gizmodo.com/turn-your-smartphone-into-a-particle-detector-for-cosmi-1697286872), showing that the cameras can help in scientific research more than people might expect!\n\nthanks!!", "sortedWord": "None", "identifyer": 36469, "year": "2018"}], "name": "classificationphotography2018"}